{
  "url": "https://www.morningstar.com/news/pr-newswire/20250812hk49464/zetrix-ai-launches-worlds-first-shariah-aligned-large-language-model-nurai",
  "authorsByline": "",
  "articleId": "5d2eac67eb034230bee7d6c07a0db641",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:46:00-05:00",
  "addDate": "2025-08-12T07:37:45.634200+00:00",
  "refreshDate": "2025-08-12T07:37:45.634206+00:00",
  "score": 1.0,
  "title": "Zetrix AI Launches World's First Shariah-Aligned Large Language Model \"NurAI\"",
  "description": "Zetrix AI Launches World's First Shariah-Aligned Large Language Model \"NurAI\"",
  "content": "Addressing the Needs of Two Billion Muslims and Unlocking the US$3 Trillion Islamic Economy\n\nKUALA LUMPUR, Malaysia, Aug. 12, 2025 /PRNewswire/ -- Zetrix AI Berhad (\"Zetrix AI\"), formerly known as MY E.G. Services Berhad, today unveiled NurAI, the world's first Shariah-aligned, Islamic values-based large language model (\"LLM\"). Based on Islamic principles and reflective of the Global South worldview, NurAI offers guidance consistent with Shariah rulings on a comprehensive spectrum of subject matters ranging from contemporary topics, such as law, healthcare and finance, to classical Islamic themes that include history, Islamic philosophy and Quranic studies.\n\nThe launch ceremony, held at the Four Seasons Hotel Kuala Lumpur and officiated by YAB Dato' Seri Dr. Ahmad Zahid bin Hamidi, Deputy Prime Minister of Malaysia, was organised in conjunction with the ASEAN AI Malaysia Summit 2025.\n\nAs the first of its kind, NurAI offers Muslim-majority nations and Muslim communities an alternative to existing Western and Chinese AI models, which often lack alignment with Islamic values and the development priorities of the Global South. Beyond consumer adoption, NurAI lays the groundwork for broader digital Islamic economy infrastructure across halal trade, supply chain, Islamic finance, and governance, thereby advancing AI sovereignty in emerging markets.\n\n\"This is a prime example of how we can harmonise religion and technology for the benefit of the ummah and the advancement of the nation. I would like to call on all parties, including the government, private sectors, financial institutions, and religious bodies, to give full support to the development and expansion of technologies like NurAI,\" said YAB Dato' Seri Dr. Ahmad Zahid bin Hamidi, Deputy Prime Minister of Malaysia.\n\nA distinctive and unique feature of NurAI is its AI Avatar channels that enable users to interact with avatars modelled after experts across various fields. Trained with exclusive datasets, these channels reflect the experts' unique knowledge and teaching philosophy. It is similar to having an AI companion that serves as a personal ustaz or Islamic finance expert with the capabilities of engaging in personalised conversations with users. While many LLMs generate broad answers across disciplines, NurAI's AI Avatar channels provide deeper and more thoughtful insights, especially on topics that require careful interpretation and understanding. NurAI team will provide an Islamic Finance channel in partnership with INCEIF University, an affiliate of Bank Negara Malaysia, in addition to channels by leading Islamic scholars from around the world.\n\nNurAI is available in Malay, Indonesian, Arabic, and English across both desktop and mobile platforms, delivering a clear and conversational user experience while maintaining Shariah alignment, serving a diverse base of Muslim users globally. The desktop version can be accessed at https://nur-ai.ai.\n\nDeveloped under the guidance of a formal Shariah Supervisory Board, NurAI is rooted in Islamic ethics and strict Shariah alignment, offering a principled and trustworthy platform.\n\nThe team behind the development of NurAI will establish a Shariah-aligned framework in collaboration with key religious bodies, including Malaysian Islamic Development Department (\"JAKIM\"), Indonesian Ulama Council (\"MUI\"), International Islamic Fiqh Academy (\"IIFA\"), and Al-Azhar University in Egypt.\n\nNurAI serves as a foundational LLM upon which advanced agentic and domain-specific generative AI can be built, enabling tailored solutions for real-world applications in sectors such as Islamic finance, education, governance, and halal industry regulation.\n\nCurrent AI systems, developed primarily in Western and Chinese contexts, may not fully reflect Islamic perspectives. This leaves a clear gap for the two billion Muslims, the US$3 trillion Islamic economy and the wider Global South, where users seek AI tools that align with their cultural values, religious principles, and development priorities. NurAI meets this need by offering a Shariah-aligned alternative for markets underserved by existing platforms. It also supports the growing demand for AI sovereignty and Shariah-aligned technology from governments and institutions across Malaysia, Indonesia, and the Gulf Cooperation Council (\"GCC\").\n\n\"The rollout of NurAI is designed to be phased and progressive. It will begin with a freemium B2C app in Malaysia and Indonesia, offering general Shariah guidance alongside premium features such as inheritance calculators and medical bioethics advice. The second phase will focus on institutional integration via B2B and B2G models, enabling implementation of NurAI into the daily operations of Islamic financial institutions, fintechs, halal certification bodies and Shariah legal authorities,\" said Datuk Mohd Jimmy Wong Bin Abdullah, Director of Zetrix AI.\n\nWith the launch of NurAI, Malaysia not only cements its leadership in halal certification, Islamic finance, and Shariah scholarship, but also in ethical AI innovation. Zetrix AI's continued investment in Shariah-aligned technologies signals a long-term commitment to developing responsible, values-based digital infrastructure for Muslim communities worldwide.\n\nZetrix AI Berhad (\"Zetrix AI\"), formerly known as MY E.G. Services Berhad, is leading the way in the deployment of blockchain technology and artificial intelligence in powering the public and private sectors across ASEAN. Headquartered in Malaysia, Zetrix AI started operations in 2000 as a pioneer in the provision of electronic government services and complementary commercial offerings in its home country. Today, it has advanced to the forefront of technology transformation in the broader region, leveraging its Layer-1 blockchain platform Zetrix and embracing the convergence of Web3, AI and robotics to enable optimally-efficient, intelligent and secure cross-border transactions, digital identity interoperability and automation solutions that seamlessly connect peoples, businesses and governments.",
  "medium": "Article",
  "links": [
    "https://nur-ai.ai/",
    "https://www.prnewswire.com/news-releases/zetrix-ai-launches-worlds-first-shariah-aligned-large-language-model-nurai-302527407.html",
    "https://nur-ai.zetrix.com/chat/login",
    "https://mma.prnewswire.com/media/2748658/Launch_of_NurAI.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Islamic finance",
      "weight": 0.08216924
    },
    {
      "name": "Islamic finance expert",
      "weight": 0.08211407
    },
    {
      "name": "Zetrix AI",
      "weight": 0.080201015
    },
    {
      "name": "Islamic values",
      "weight": 0.079685524
    },
    {
      "name": "Zetrix AI Berhad",
      "weight": 0.07931973
    },
    {
      "name": "Islamic financial institutions",
      "weight": 0.07589237
    },
    {
      "name": "broader digital Islamic economy infrastructure",
      "weight": 0.07559201
    },
    {
      "name": "Islamic philosophy",
      "weight": 0.075072944
    },
    {
      "name": "Islamic",
      "weight": 0.07496194
    },
    {
      "name": "Islamic principles",
      "weight": 0.07485751
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "LLMs"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.90869140625
    },
    {
      "name": "/News/Technology News",
      "score": 0.85546875
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.7490234375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.494140625
    }
  ],
  "sentiment": {
    "positive": 0.5756142,
    "negative": 0.03566564,
    "neutral": 0.38872012
  },
  "summary": "Zetrix AI Berhad, formerly known as MY E.G. Services Berhad and the Malaysian government, has launched NurAI, the world's first Shariah-aligned, Islamic values-based large language model. Based on Islamic principles and reflective of the Global South worldview, NurAI offers guidance consistent with Shariah rulings on a range of subject matters. It is designed to address the needs of two billion Muslims and the US$3 Trillion Islamic Economy. NurAI's unique feature is its AI Avatar channels, which enable users to interact with experts across various fields. The launch ceremony was held at the Four Seasons Hotel Kuala Lumpur and officiated by Deputy Prime Minister of Malaysia, Dr. Ahmad Zahid bin Hamidi. Nurai is available in Malay, Indonesian, Arabic, and English across both desktop and mobile platforms.",
  "shortSummary": "Zetrix AI Berhad launched NurAI, the world's first Shariah-aligned large language model, addressing the needs of two billion Muslims and aiming for broader digital Islamic economy integration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "500ec1b23a6a4abfabb289b191224df5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.prnewswire.com/news-releases/zetrix-ai-launches-worlds-first-shariah-aligned-large-language-model-nurai-302527407.html",
      "text": "Zetrix AI Launches World's First Shariah-Aligned Large Language Model \"NurAI\"\nAddressing the Needs of Two Billion Muslims and Unlocking the US$3 Trillion Islamic Economy\nKUALA LUMPUR, Malaysia, Aug. 12, 2025 /PRNewswire/ -- Zetrix AI Berhad (\"Zetrix AI\"), formerly known as MY E.G. Services Berhad, today unveiled NurAI, the world's first Shariah-aligned, Islamic values-based large language model (\"LLM\"). Based on Islamic principles and reflective of the Global South worldview, NurAI offers guidance consistent with Shariah rulings on a comprehensive spectrum of subject matters ranging from contemporary topics, such as law, healthcare and finance, to classical Islamic themes that include history, Islamic philosophy and Quranic studies.\nThe launch ceremony, held at the Four Seasons Hotel Kuala Lumpur and officiated by YAB Dato' Seri Dr. Ahmad Zahid bin Hamidi, Deputy Prime Minister of Malaysia, was organised in conjunction with the ASEAN AI Malaysia Summit 2025.\nAs the first of its kind, NurAI offers Muslim-majority nations and Muslim communities an alternative to existing Western and Chinese AI models, which often lack alignment with Islamic values and the development priorities of the Global South. Beyond consumer adoption, NurAI lays the groundwork for broader digital Islamic economy infrastructure across halal trade, supply chain, Islamic finance, and governance, thereby advancing AI sovereignty in emerging markets.\n\"This is a prime example of how we can harmonise religion and technology for the benefit of the ummah and the advancement of the nation. I would like to call on all parties, including the government, private sectors, financial institutions, and religious bodies, to give full support to the development and expansion of technologies like NurAI,\" said YAB Dato' Seri Dr. Ahmad Zahid bin Hamidi, Deputy Prime Minister of Malaysia.\nUnique Features of NurAI\nA distinctive and unique feature of NurAI is its AI Avatar channels that enable users to interact with avatars modelled after experts across various fields. Trained with exclusive datasets, these channels reflect the experts' unique knowledge and teaching philosophy. It is similar to having an AI companion that serves as a personal ustaz or Islamic finance expert with the capabilities of engaging in personalised conversations with users. While many LLMs generate broad answers across disciplines, NurAI's AI Avatar channels provide deeper and more thoughtful insights, especially on topics that require careful interpretation and understanding. NurAI team will provide an Islamic Finance channel in partnership with INCEIF University, an affiliate of Bank Negara Malaysia, in addition to channels by leading Islamic scholars from around the world.\nNurAI is available in Malay, Indonesian, Arabic, and English across both desktop and mobile platforms, delivering a clear and conversational user experience while maintaining Shariah alignment, serving a diverse base of Muslim users globally. The desktop version can be accessed at https://nur-ai.ai.\nDeveloped under the guidance of a formal Shariah Supervisory Board, NurAI is rooted in Islamic ethics and strict Shariah alignment, offering a principled and trustworthy platform.\nThe team behind the development of NurAI will establish a Shariah-aligned framework in collaboration with key religious bodies, including Malaysian Islamic Development Department (\"JAKIM\"), Indonesian Ulama Council (\"MUI\"), International Islamic Fiqh Academy (\"IIFA\"), and Al-Azhar University in Egypt.\nNurAI serves as a foundational LLM upon which advanced agentic and domain-specific generative AI can be built, enabling tailored solutions for real-world applications in sectors such as Islamic finance, education, governance, and halal industry regulation.\nAddressing a Global Gap\nCurrent AI systems, developed primarily in Western and Chinese contexts, may not fully reflect Islamic perspectives. This leaves a clear gap for the two billion Muslims, the US$3 trillion Islamic economy and the wider Global South, where users seek AI tools that align with their cultural values, religious principles, and development priorities. NurAI meets this need by offering a Shariah-aligned alternative for markets underserved by existing platforms. It also supports the growing demand for AI sovereignty and Shariah-aligned technology from governments and institutions across Malaysia, Indonesia, and the Gulf Cooperation Council (\"GCC\").\nStrategic Rollout and Partnerships\n\"The rollout of NurAI is designed to be phased and progressive. It will begin with a freemium B2C app in Malaysia and Indonesia, offering general Shariah guidance alongside premium features such as inheritance calculators and medical bioethics advice. The second phase will focus on institutional integration via B2B and B2G models, enabling implementation of NurAI into the daily operations of Islamic financial institutions, fintechs, halal certification bodies and Shariah legal authorities,\" said Datuk Mohd Jimmy Wong Bin Abdullah, Director of Zetrix AI.\nWith the launch of NurAI, Malaysia not only cements its leadership in halal certification, Islamic finance, and Shariah scholarship, but also in ethical AI innovation. Zetrix AI's continued investment in Shariah-aligned technologies signals a long-term commitment to developing responsible, values-based digital infrastructure for Muslim communities worldwide.\nAbout Zetrix AI Berhad\nZetrix AI Berhad (\"Zetrix AI\"), formerly known as MY E.G. Services Berhad, is leading the way in the deployment of blockchain technology and artificial intelligence in powering the public and private sectors across ASEAN. Headquartered in Malaysia, Zetrix AI started operations in 2000 as a pioneer in the provision of electronic government services and complementary commercial offerings in its home country. Today, it has advanced to the forefront of technology transformation in the broader region, leveraging its Layer-1 blockchain platform Zetrix and embracing the convergence of Web3, AI and robotics to enable optimally-efficient, intelligent and secure cross-border transactions, digital identity interoperability and automation solutions that seamlessly connect peoples, businesses and governments.\nSOURCE Zetrix AI Berhad\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    },
    {
      "url": "https://nur-ai.ai/",
      "text": "We're opening the doors to Nur AI Beta — a collaborative effort to shape the world's first Shariah-compliant language model.\nOver the next two weeks, access will remain fully open as we work towards launching our official subscription plans — a meaningful opportunity for all of us to shape the future together. These plans will help us sustainably manage computational costs, support ongoing innovation, and continue delivering the high-quality services our valued users deserve.\nExplore, ask, reflect — and if you have ideas or feedback, we'd love to hear from you. Together, let's build an AI that reflects our shared values, faith, and purpose.\nNurAI is more than just an AI chatbot—it's a thoughtfully designed assistant that understands and respects Islamic values. Whether you need help with daily tasks, learning, or guidance, NurAI provides intelligent assistance while maintaining the proper Islamic etiquette and manners.\nEvery aspect of NurAI has been carefully crafted to align with Islamic teachings and values, ensuring your AI interactions are always appropriate and beneficial.\nAlways responds with proper Islamic manners, using respectful language and appropriate greetings.\nAutomatically avoids inappropriate content and redirects conversations toward beneficial topics.\nDraws from authentic Islamic sources and always encourages consulting qualified scholars for religious matters.\nPromotes unity, understanding, and the beautiful teachings of Islam in every interaction.\nDiscover how NurAI can support you in various aspects of Islamic life, providing guidance while respecting the boundaries of religious scholarship.\nGet help evaluating investments, understanding Islamic banking principles, and making Sharia-compliant financial decisions.\nNavigate daily choices with confidence - from food ingredients to entertainment options that align with Islamic values.\nReceive guidance on raising children with Islamic values while addressing modern parenting challenges.\nFind Islamic perspectives on mental health, stress management, and maintaining spiritual balance in daily life.\nExplore Tafsir and Fiqh principles to understand Islamic perspectives on complex ethical situations.\nGet preliminary guidance on religious questions while being reminded to consult qualified scholars for formal rulings.\nWhile NurAI provides helpful guidance based on Islamic principles, always consult qualified scholars for formal religious rulings and complex matters of faith and Islamic jurisprudence.\nSee how our Islamic-first approach creates a fundamentally different AI experience compared to general-purpose models.\nRooted in divine knowledge, not just datasets.\nCan provide information on Islamic teachings but not specifically trained on Quran & Sunnah as core focus.\nInformation included in training, but not a primary focus.\nReviewed by Islamic legal experts across the ASEAN region.\nNot specifically designed for Shariah compliance; provides general information based on available data.\nGeneral-purpose model; not designed for Shariah compliance.\nChat with avatars trained with custom dataset provided by experts. You can now chat with your personal guru!\nNot available.\nNot available\nGrows with modern questions while upholding traditional values.\nContinuously updated and fine-tuned to improve responses to modern and traditional queries.\nCan synthesize information to address various modern and traditional questions.\nStart your journey with NurAI today. All plans include our core Islamic values and respectful AI interactions.\nPerfect for individuals exploring Islamic AI assistance\nEnhanced features for committed learners and families\nPremium experience for educators and community leaders"
    }
  ],
  "argos_summary": "Zetrix AI Berhad has launched NurAI, the world's first Shariah-aligned large language model designed to cater to the needs of the global Muslim community, which numbers around two billion and represents a US$3 trillion Islamic economy. NurAI provides guidance on various subjects consistent with Islamic principles, featuring unique AI Avatar channels for personalized interactions with experts. The model aims to fill the gap left by existing Western and Chinese AI systems, promoting AI sovereignty and supporting the development of a digital Islamic economy across Muslim-majority nations.",
  "argos_id": "GRA1SCOWV"
}