{
  "url": "https://finance.yahoo.com/news/scotiabank-rbc-capital-reduce-pt-033906738.html",
  "authorsByline": "Faheem Tahir",
  "articleId": "23baa007877c4f039a78db8503a4a2fa",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/insidermonkey.com/0631ad6912b6a113a1a9d1558775073d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T03:39:06+00:00",
  "addDate": "2025-08-13T03:54:39.090524+00:00",
  "refreshDate": "2025-08-13T03:54:39.090525+00:00",
  "score": 1.0,
  "title": "Scotiabank and RBC Capital Reduce PT on Restaurant Brands International Inc. (QSR)",
  "description": "Restaurant Brands International Inc. (NYSE:QSR) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman. Following the company’s mixed Q2 performance, Scotiabank reduced its price target on Restaurant Brands International Inc. (NYSE:QSR) from $75 to $71 on August 8, 2025, maintaining a ‘Sector Perform’ rating. The analyst […]",
  "content": "Restaurant Brands International Inc. (NYSE:QSR) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\n\nFollowing the company’s mixed Q2 performance, Scotiabank reduced its price target on Restaurant Brands International Inc. (NYSE:QSR) from $75 to $71 on August 8, 2025, maintaining a ‘Sector Perform’ rating. The analyst attributed the price revision to risks from soft U.S. consumer trends, potential weakness in net restaurant growth, Burger King’s EBITDA challenges, and Popeyes’ market share pressure.\n\nOn the same day, RBC Capital also decreased its price target on Restaurant Brands International Inc. (NYSE:QSR) from $80 to $77, maintaining an ‘Outperform’ rating. Despite the target cut, the analyst expressed confidence in Tim Hortons, which surpassed same-store sales expectations, as well as growing momentum at Burger King China and outperformance in the International segment. The company’s revenue experienced a 22.4% growth over the past twelve months, while maintaining its dividend growth policy – 10 consecutive annual increases, yielding 3.8%. At the same time, the analyst expressed concern over Burger King’s U.S. operations, which could experience pressure in its same-store sales due to a slowing consumer backdrop.\n\nKnown for brands like Tim Hortons, Burger King, Popeyes, and Firehouse Subs, Restaurant Brands International Inc. (NYSE:QSR) operates quick-service restaurants globally. It is included in our list of cheap value stocks to buy.\n\nWhile we acknowledge the potential of QSR as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.\n\nREAD NEXT: 13 Best Oil Refinery Stocks to Buy Right Now and 7 Best Potash Stocks to Buy According to Analysts.",
  "medium": "Article",
  "links": [
    "https://www.insidermonkey.com/blog/13-best-oil-refinery-stocks-to-buy-right-now-1585923/",
    "https://finance.yahoo.com/quote/QSR/",
    "https://www.insidermonkey.com/blog/12-cheap-value-stocks-to-buy-now-according-to-seth-klarman-1588256/?singlepage=1",
    "https://www.insidermonkey.com/blog/7-best-potash-stocks-to-buy-according-to-analysts-1578641/",
    "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Restaurant Brands International Inc.",
      "weight": 0.108841576
    },
    {
      "name": "certain AI stocks",
      "weight": 0.09548292
    },
    {
      "name": "Burger King",
      "weight": 0.09405879
    },
    {
      "name": "cheap value stocks",
      "weight": 0.09318283
    },
    {
      "name": "Burger King China",
      "weight": 0.09248242
    },
    {
      "name": "soft U.S. consumer trends",
      "weight": 0.07898039
    },
    {
      "name": "QSR",
      "weight": 0.07641515
    },
    {
      "name": "net restaurant growth",
      "weight": 0.07480624
    },
    {
      "name": "International",
      "weight": 0.07208236
    },
    {
      "name": "Tim Hortons",
      "weight": 0.068036586
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.994140625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97265625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95361328125
    }
  ],
  "sentiment": {
    "positive": 0.1670057,
    "negative": 0.49883044,
    "neutral": 0.33416387
  },
  "summary": "Scotiabank and RBC Capital have reduced their price targets on Restaurant Brands International Inc. (QSR) from $75 to $71 on August 8, 2025, due to concerns about soft U.S. consumer trends, potential weakness in net restaurant growth, Burger King’s EBITDA challenges, and Popeyes’ market share pressure. Despite the target cut, RBC also maintained an 'Sector Perform' rating and expressed confidence in Tim Hortons' performance and Burger King's US operations. The company's revenue experienced a 22.4% growth over the past 12 months, while maintaining its dividend growth policy of 10 consecutive annual increases.",
  "shortSummary": "Scotiabank and RBC Capital reduced their price targets for Restaurant Brands International Inc. (QSR) due to risks from soft U.S. consumer trends and potential market share pressure.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c9b9ad7d274d48d0a95929d5f88d561b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.insidermonkey.com/blog/12-cheap-value-stocks-to-buy-now-according-to-seth-klarman-1588256/?singlepage=1",
      "text": "In this article, we discuss the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nSeth Klarman, one of the most esteemed figures in value investing, has achieved success through his steadfast commitment to holding investments for the long term, allowing intrinsic value to be fully realized. This principle defines his core philosophy behind his success in deep value investing.\nSeth Klarman, as CEO and Portfolio Manager of The Baupost Group, has managed the company’s investments since its founding in May 1982. As of March 2023, Baupost has $27.4 billion under management, securing it the 11th spot on the list of the largest hedge funds in the world. The Boston-based firm offers its services to both individual and institutional clients globally.\nFurthermore, his rare, out-of-print book “Margin of Safety,” which is popular among value investors, extends his influence beyond the trading floor. It can fetch as much as $1,700 on Amazon. Interestingly, Klarman’s name is included in Baupost’s name, which is derived from the initials of its original founders. This dates back to when a Harvard professor called the freshly graduated Klarman to help manage the start-up fund, marking the start of a remarkable investing legacy.\nWith this backdrop, let’s move to our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOur Methodology\nTo curate our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman, we scanned Baupost Group’s investment portfolio to extract stocks trading under a forward price-to-earnings multiple of 21x, as of the time of writing. We ranked the shortlisted stocks in ascending order based on Baupost Group’s stake in them. We also considered hedge fund sentiment surrounding these stocks as of Q1 2025, using Insider Monkey’s hedge fund database that tracks over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n12. Clarivate Plc (NYSE:CLVT)\nBaupost Group Stake Value: $42,357,000\nForward Price-to-Earnings: 5.85\nNumber of Hedge Fund Holders: 25\nWith a low price-to-earnings multiple and a significant presence in Seth Klarman’s investment portfolio, Clarivate Plc (NYSE:CLVT) earns a spot on our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn July 30, 2025, Clarivate Plc (NYSE:CLVT) appointed Maroun S. Mourad to the role of President of its Intellectual Property segment, effective September 8, 2025. The newly appointed President will succeed Gordon Samson, who will be retiring at year-end after decades in the IP industry.\nMourad brings over 25 years of experience in data analytics, software, and technology-enabled services. He most recently led the Claims Solutions division at Verisk Analytics, handling product portfolios, services, and acquisitions globally. Clarivate Plc (NYSE:CLVT)’s CEO sees the appointment as a strategic move to drive long-term, predictable growth in the IP segment.\nClarivate Plc (NYSE:CLVT)’s IP segment offers trusted data, software, and expertise across the full lifecycle of intellectual property assets.\nWith its data, insights, workflow solutions, and expert services across various sectors, Clarivate Plc (NYSE:CLVT) operates as a leading global provider of transformative intelligence. It is included in our list of cheap value stocks to buy.\n11. Herbalife Ltd. (NYSE:HLF)\nBaupost Group Stake Value: $65,593,000\nForward Price-to-Earnings: 4.24\nNumber of Hedge Fund Holders: 31\nHerbalife Ltd. (NYSE:HLF) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn August 6, 2025, Herbalife Ltd. (NYSE:HLF) reported its results for Q2 2025. The company recorded net sales of $1.3 billion, which were down 1.7% year-over-year and flat on a constant currency basis. Meanwhile, its adjusted EBITDA of $173.6 million surpassed guidance. As such, HLF increased its full-year 2025 net sales and adjusted EBITDA outlook and lowered Capex forecasts.\nHerbalife Ltd. (NYSE:HLF)’s management expressed increasing confidence following the July launches of MultiBurn, a multifunctional weight-loss supplement, and the beta release of the AI-assisted Pro2col digital platform. Over 7,000 distributors are already engaged ahead of a Q4 U.S. and Puerto Rico rollout. During the quarter, the company’s distributor growth remained strong, with Latin America leading the segment with a 16% YoY growth.\nAhead of the earnings release, Mizuho lifted its price target on Herbalife Ltd. (NYSE:HLF) from $8 to $9, maintaining a ‘Neutral’ rating. The company also maintained its financial health steady at the quarter-end, redeeming $50 million of its 7.875% Senior Notes due 2025, maintaining leverage at 3.0x.\nOffering science-backed nutrition products and a global distributor-driven business model, Herbalife Ltd. (NYSE:HLF) operates as a leading health and wellness company. It is included in our list of cheap value stocks to buy.\n10. ICON Public Limited Company (NASDAQ:ICLR)\nBaupost Group Stake Value: $70,871,000\nForward Price-to-Earnings: 11.89\nNumber of Hedge Fund Holders: 44\nWith a low price-to-earnings multiple and a significant presence in Seth Klarman’s investment portfolio, ICON Public Limited Company (NASDAQ:ICLR) earns a spot on our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn July 25, 2025, Mizuho raised its price target on ICON Public Limited Company (NASDAQ:ICLR) from $173 to $225, maintaining an ‘Outperform’ rating. The price revision is attributed to the company’s stronger-than-expected operational metrics. Eliminating earlier fears of a slowdown, its quarterly booking trends remained stable. Furthermore, improved cancellation rates and easing trial delays boosted confidence in the company’s execution.\nMoreover, the analyst feels enhanced earnings visibility for 2026 for ICON Public Limited Company (NASDAQ:ICLR), indicating a stronger growth trajectory, in spite of macro uncertainties in the clinical research market. Thus, the analyst’s price revision reflects both the short-term momentum and long-term strategic positioning, increasing the possibility of the company capturing a larger share of clinical trial demand in the coming years.\nICON Public Limited Company (NASDAQ:ICLR) executes clinical research globally, offering outsourced development and commercialization services. It is included in our list of cheap value stocks to buy.\n9. Solventum Corporation (NYSE:SOLV)\nBaupost Group Stake Value: $80,088,000\nForward Price-to-Earnings: 13.23\nNumber of Hedge Fund Holders: 38\nSolventum Corporation (NYSE:SOLV) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn August 7, 2025, Solventum Corporation (NYSE:SOLV) announced its results for Q2 2025. The quarter marked the fifth consecutive quarter of positive volume growth, with the company recording sales of $2.2 billion, up 3.9% YoY (2.8% organic). This helped Solventum deliver an adjusted EPS of $1.69, beating expectations, along with an operating cash flow of $169 million.\nLooking ahead, Solventum Corporation (NYSE:SOLV) raised its 2025 guidance, expecting organic sales growth of 2.0%-3.0% and adjusted EPS of $5.80-$5.95, thanks to strong performance across all segments during the quarter. Following the strong quarterly performance and raised full-year guidance, on August 8, 2025, Piper Sandler raised its price target on the company from $87 to $94, maintaining an ‘Overweight’ rating. The analyst cited Solventum’s consistent execution. Meanwhile, on the same day, Wells Fargo maintained its ‘Hold’ rating with a $79 target.\nAhead of the planned sale of its Purification & Filtration segment and retention of the Drinking Water Filtration segment, Solventum Corporation (NYSE:SOLV) confirmed its free cash flow guidance of $450-$550 million for 2025.\nSolventum Corporation is a global leader in innovative medical technology and solutions. It is included in our list of cheap value stocks to buy.\n8. Elevance Health, Inc. (NYSE:ELV)\nBaupost Group Stake Value: $107,000,000\nForward Price-to-Earnings: 9.92\nNumber of Hedge Fund Holders: 75\nWith a low price-to-earnings multiple and a significant presence in Seth Klarman’s investment portfolio, Elevance Health, Inc. (NYSE:ELV) earns a spot on our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn July 17, 2025, Elevance Health, Inc. (NYSE:ELV) released its Q2 2025 results. The company posted adjusted EPS of $8.84, slightly missing expectations of $8.91. Increased medical cost trends in ACA, along with slower Medicaid rate recovery softening margins. Yet, the higher premium yields and acquisitions resulted in a $49.4 billion revenue, an increase of 14% YoY. Meanwhile, the company’s operating cash flow reached $2.1 billion.\nDeclines in Medicaid and ACA enrollment resulted in a decrease in the Membership segment, taking it to 45.6 million. Looking ahead, Elevance Health, Inc. (NYSE:ELV) reduced its full-year EPS guidance to $30, driven by cost pressures. However, it reaffirmed its strategies to stabilize margins with disciplined pricing, AI-enabled care management, and Carelon’s expanding value-based and pharmacy services.\nDespite the reduction in 2025 guidance, Mizuho maintained its ‘Buy’ rating on Elevance Health, Inc. (NYSE:ELV) with a $342 price target. The analyst’s optimism is driven by the company’s growth potential in Carelon and strong execution in Medicare Advantage.\nElevance Health, Inc. (NYSE:ELV) is a health insurance provider, offering integrated medical, pharmacy, and care delivery solutions. It is included in our list of cheap value stocks to buy.\n7. Eagle Materials Inc. (NYSE:EXP)\nBaupost Group Stake Value: $201,875,000\nForward Price-to-Earnings: 13.91\nNumber of Hedge Fund Holders: 30\nEagle Materials Inc. (NYSE:EXP) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nFollowing strong recent operational performance, Loop Capital increased its price target on Eagle Materials Inc. (NYSE:EXP) from $230 to $245 on July 30, 2025, maintaining a ‘Hold’ rating. The increased target reflects the company’s stable wallboard pricing, above-industry segment volumes, and improved investor sentiment surrounding a potential building products trough. However, the analyst believes that a stronger catalyst beyond a cyclical recovery is required to upgrade its rating on the company.\nMeanwhile, on August 6, 2025, Eagle Materials Inc. (NYSE:EXP)’s Board declared a quarterly cash dividend of $0.25 per share, which is payable on October 16 to shareholders of record as of September 15.\nEagle Materials Inc. (NYSE:EXP), based in the U.S., provides building materials, such as cement, concrete, and gypsum wallboard products. It is included in our list of cheap value stocks to buy.\n6. CRH plc (NYSE:CRH)\nBaupost Group Stake Value: $237,026,000\nForward Price-to-Earnings: 19.42\nNumber of Hedge Fund Holders: 91\nWith a low price-to-earnings multiple and a significant presence in Seth Klarman’s investment portfolio, CRH plc (NYSE:CRH) earns a spot on our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn August 6, 2025, CRH plc (NYSE:CRH) reported its results for Q2 2025. Thanks to strategic acquisitions and pricing discipline, the company posted 6% revenue growth to $10.2 billion and a 9% increase in adjusted EBITDA to $2.5 billion. Meanwhile, net income remained stable at $1.3 billion, while EPS improved to $1.94. Performance was solid across all segments, with the International Solutions segment recording a 13% revenue growth.\nOn a year-to-date basis, CRH plc (NYSE:CRH) finalized 13 acquisitions, including a $2.1 billion acquisition of Eco Material Technologies on July 29, strengthening its position in low-carbon cement. Furthermore, the company returned $0.8 billion to shareholders in the form of repurchases YTD, with a new $0.3 billion tranche authorized on August 5, alongside a quarterly dividend of $0.37 declared. CRH also raised its full-year guidance, thanks to solid demand in infrastructure and resilient non-residential markets.\nCiting the company’s differentiated model and M&A-driven growth, RBC Capital raised its price target on CRH plc (NYSE:CRH) from $108 to $112 on August 8, maintaining an ‘Outperform’ rating.\nServing the construction industry, CRH plc (NYSE:CRH) operates as a leader in building materials, supplying cement, concrete, aggregates, and related products. It is included in our list of cheap value stocks to buy.\n5. Restaurant Brands International Inc. (NYSE:QSR)\nBaupost Group Stake Value: $259,000,000\nForward Price-to-Earnings: 12.67\nNumber of Hedge Fund Holders: 32\nRestaurant Brands International Inc. (NYSE:QSR) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nFollowing the company’s mixed Q2 performance, Scotiabank reduced its price target on Restaurant Brands International Inc. (NYSE:QSR) from $75 to $71 on August 8, 2025, maintaining a ‘Sector Perform’ rating. The analyst attributed the price revision to risks from soft U.S. consumer trends, potential weakness in net restaurant growth, Burger King’s EBITDA challenges, and Popeyes’ market share pressure.\nOn the same day, RBC Capital also decreased its price target on Restaurant Brands International Inc. (NYSE:QSR) from $80 to $77, maintaining an ‘Outperform’ rating. Despite the target cut, the analyst expressed confidence in Tim Hortons, which surpassed same-store sales expectations, as well as growing momentum at Burger King China and outperformance in the International segment. The company’s revenue experienced a 22.4% growth over the past twelve months, while maintaining its dividend growth policy – 10 consecutive annual increases, yielding 3.8%. At the same time, the analyst expressed concern over Burger King’s U.S. operations, which could experience pressure in its same-store sales due to a slowing consumer backdrop.\nKnown for brands like Tim Hortons, Burger King, Popeyes, and Firehouse Subs, Restaurant Brands International Inc. (NYSE:QSR) operates quick-service restaurants globally. It is included in our list of cheap value stocks to buy.\n4. Fidelity National Information Services, Inc. (NYSE:FIS)\nBaupost Group Stake Value: $260,853,000\nForward Price-to-Earnings: 12.36\nNumber of Hedge Fund Holders: 56\nWith a low price-to-earnings multiple and a significant presence in Seth Klarman’s investment portfolio, Fidelity National Information Services, Inc. (NYSE:FIS) earns a spot on our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn August 7, 2025, Mizuho decreased its price target on Fidelity National Information Services, Inc. (NYSE:FIS) from $85 to $83, maintaining an ‘Outperform’ rating. The price target revision reflects the analyst’s updated financial model, projecting slightly lower medium-term EPS forecasts. However, Mizuho dismissed the broader speculation about a stealth downgrade to the company’s organic revenue growth for the fiscal year.\nThe analyst raised its guidance for the company’s Banking segment from 3.7%-4.4% to 4.0%-4.5%, thanks to 20 basis points of M&A contributions. Meanwhile, the Capital Markets segment guidance is maintained at 6.5%-7.0%. Mizuho remains confident in Fidelity National Information Services, Inc. (NYSE:FIS)’s long-term growth, thanks to strong momentum in its Banking division.\nFidelity National Information Services, Inc. (NYSE:FIS) serves financial institutions globally, providing banking and payment technology solutions. It is included in our list of cheap value stocks to buy.\n3. WESCO International, Inc. (NYSE:WCC)\nBaupost Group Stake Value: $311,470,000\nForward Price-to-Earnings: 15.08\nNumber of Hedge Fund Holders: 51\nWESCO International, Inc. (WCC) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn August 5, 2025, Loop Capital raised its price target on WESCO International, Inc. (WCC) from $220 to $235, maintaining a ‘Buy’ rating. This price revision follows the company’s strong Q3 results and narrows its full-year guidance. The analyst believes management’s guidance is conservative, not reflecting the expected benefits of upcoming pricing initiatives. Moreover, a recovery in end-market demand holds potential to drive earnings above the midpoint of the company’s 2025 EPS guidance.\nMeanwhile, on the previous day, JPMorgan maintained its price target on WESCO International, Inc. (WCC) at $205 price target. Looking ahead, the company looks well-positioned to translate strategic initiatives into sustained growth through 2025.\nWESCO International, Inc. (WCC) offers electrical, industrial, and communication products and services across the globe. It is included in our list of cheap value stocks to buy.\n2. Alphabet Inc. (NASDAQ:GOOGL)\nBaupost Group Stake Value: $324,644,000\nForward Price-to-Earnings: 20.92\nNumber of Hedge Fund Holders: 227\nWith a low price-to-earnings multiple and a significant presence in Seth Klarman’s investment portfolio, Alphabet Inc. (NASDAQ:GOOGL) earns a spot on our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn August 5, 2025, Loop Capital lifted its price target on Alphabet Inc. (NASDAQ:GOOGL) from $165 to $190, maintaining a ‘Hold’ rating. The analyst increased the company’s earnings multiple from 12.5x to 15x, pointing toward a more favorable earnings outlook. Furthermore, the target increase reflects the company’s growing strength in its core advertising segments and effective expense management, which have improved the company’s recent performance. However, the analyst highlighted long-term concerns surrounding evolving digital advertising dynamics and competitive pressures.\nAlphabet Inc. (NASDAQ:GOOGL), globally known for Google’s search, advertising, cloud, and other digital services, operates as a global technology conglomerate. It is included in our list of cheap value stocks to buy.\n1. Willis Towers Watson Public Limited Company (NASDAQ:WTW)\nBaupost Group Stake Value: $515,599,000\nForward Price-to-Earnings: 18.73\nNumber of Hedge Fund Holders: 57\nWillis Towers Watson Public Limited Company (NASDAQ:WTW) is included in our list of the 12 Cheap Value Stocks to Buy Now According to Seth Klarman.\nOn July 31, 2025, Evercore ISI raised its price target on Willis Towers Watson Public Limited Company (NASDAQ:WTW) from $364 to $373, maintaining an ‘Outperform’ rating. The increased target reflects the company’s improved performance in the recent quarter, along with a boost in its earnings outlook. Thanks to slightly stronger margins, strong Health segment growth, and a smaller-than-expected slowdown in the Reinsurance business buildout in the second half of 2025, the company increased its EPS estimates, boosting analyst sentiment.\nFurthermore, the analyst’s confidence was bolstered because of continued stability in the company’s Health, Wealth, and Career divisions, which account for roughly 60% of its revenue. Meanwhile, Willis Towers Watson Public Limited Company (NASDAQ:WTW)’s healthy pipelines, reduced uncertainty, and steady organic growth outlook position it well for a stronger finish to 2025.\nOperating across risk, benefits, and human capital markets, Willis Towers Watson Public Limited Company (NASDAQ:WTW) is a global advisory, insurance brokerage, and solutions company. It is included in our list of cheap value stocks to buy.\nWhile we acknowledge the potential of WTW to grow, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an AI stock that is more promising than WTW and that has 100x upside potential, check out our report about this cheapest AI stock.\nREAD NEXT: Bill Ackman Stock Portfolio: Top 10 Stock Picks and 13 Best Oil Refinery Stocks to Buy Right Now.\nDisclosure: None. Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email below."
    },
    {
      "url": "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
      "text": "There’s a once-in-a-generation convergence happening right now. Three unstoppable megatrends are reshaping the global economy—and one under-the-radar stock is perfectly positioned to profit from all of them.\nThis isn’t a flashy AI stock or a speculative play. It’s the infrastructure backbone of the future—and it’s trading at a bargain.\nLet me explain.\nTrend #1: The AI Arms Race\nArtificial intelligence is the most transformational force since the steam engine—and it’s just getting started.\nBut behind every ChatGPT prompt and robotic breakthrough is something few investors are thinking about:\nPower. Lots of it.\nWall Street is pouring hundreds of billions into artificial intelligence—training smarter chatbots, automating industries, and building the digital future. But there’s one urgent question few are asking:\nWhere will all of that energy come from?\nEven Sam Altman, the founder of OpenAI, issued a stark warning: “AI depends on an energy breakthrough.”\nElon Musk was even more blunt:\n“AI will run out of electricity by next year.”\nAs the world chases faster, smarter machines, a hidden crisis is emerging behind the scenes. Power grids are strained. Electricity prices are rising. Utilities are scrambling to expand capacity.\nAnd that’s where the real opportunity lies…\nOne little-known company—almost entirely overlooked by most AI investors—could be the ultimate backdoor play. It’s not a chipmaker. It’s not a cloud platform. But it might be the most important AI stock in the US.\nAs demand from AI data centers explodes, this company is gearing up to profit from the most valuable commodity in the digital age: electricity.\nThe “Toll Booth” Operator of the AI Energy Boom\n- It owns critical nuclear energy infrastructure assets, positioning it at the heart of America’s next-generation power strategy.\n- It’s one of the only global companies capable of executing large-scale, complex EPC (engineering, procurement, and construction) projects across oil, gas, renewable fuels, and industrial infrastructure.\n- It plays a pivotal role in U.S. LNG exportation—a sector about to explode under President Trump’s renewed “America First” energy doctrine.\nWhile investors pile into chip stocks with sky-high valuations, this company is quietly supplying the electricity that makes AI possible. No matter who wins the AI race—Microsoft, Google, Amazon, Meta—this company gets paid.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #2: Trump’s Tariff Strategy Could Trigger a U.S. LNG Export Boom\nDonald Trump has made one thing clear: he’s coming back to renegotiate global trade—on America’s terms.\nHis top priority? Narrowing the U.S. trade deficit. And this time, he’s not just targeting Chinese imports—he’s taking aim at every trade partner who’s been running a surplus at America’s expense.\nTrump’s team is already working behind the scenes to revise trade deals with Japan, Europe, and South Korea. And while the media focuses on tariffs and quotas, savvy investors are watching where the real money will flow:\nInto American LNG.\nHere’s why: The U.S. is sitting on a massive glut of natural gas—thanks to the shale boom. Domestic prices are near historic lows, while Europe and parts of Asia are paying 3–5x more for the same fuel. It’s the perfect imbalance.\nAnd Trump knows it.\nThat’s why he’s pressuring our trading partners to buy American energy as part of future trade agreements. It’s a simple way to cut the trade deficit without slapping tariffs on U.S. consumers.\nThat sets the stage for a massive wave of U.S. LNG exports, backed by political momentum and international demand.\nNow here’s where our stock comes in…\nOur stock is a tollbooth operator in this booming sector. This company builds the infrastructure that makes LNG exports possible—the pipelines, terminals, and systems that physically move U.S. gas to global buyers.\nIf Trump succeeds in tying LNG purchases to trade deals—and all signs suggest he will—this company will be printing money on every contract signed. The more the world buys American gas, the more this company earns.\nAnd this isn’t some hypothetical “if.” The groundwork is already being laid:\n- Europe is scrambling to replace Russian gas permanently.\n- Japan is actively sourcing non-Chinese, non-Russian LNG.\n- India and South Korea are deepening energy ties with the U.S.\n- New terminals are being planned and permitted in anticipation of the coming surge.\nTrump’s tariff threats may dominate the headlines—but his behind-the-scenes LNG diplomacy could be the real financial windfall for U.S. energy companies.\nAnd our pick is sitting in the perfect spot to benefit.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #3: The Great Onshoring Boom—And the $9 Billion Clue in Indiana\nFor decades, America offshored its industrial base. Now, that trend is reversing—and fast.\nFrom semiconductors to pharmaceuticals, manufacturing is coming back to U.S. soil. Rising geopolitical tensions, Trump-era tariffs, and global supply chain shocks have forced companies to rethink their entire operating models. The result? A tidal wave of onshoring—and our stock is riding it like a pro.\nJust look at what’s happening in Lebanon, Indiana.\nPharma giant Eli Lilly is investing $9 billion into two state-of-the-art manufacturing facilities at the LEAP Lebanon Innovation and Research District. This is one of the largest life sciences manufacturing investments in U.S. history—and it’s not a one-off.\nOur company—a global leader in engineering, procurement, and construction management (EPCM)—has already been awarded a $3.2 billion contract for this project. That’s not a preliminary deal. This is full notice to proceed. Shovels are in the ground. Steel is going up. Money is already flowing.\nAnd this is just the beginning.\nThe Lilly project is a bellwether for what’s coming: dozens of similar large-scale facilities across the country, spanning sectors from biotech to clean energy to advanced manufacturing. Each one will require complex infrastructure, deep engineering know-how, and flawless execution.\nThat’s exactly what our company delivers.\nThis isn’t speculative future revenue. This is high-margin, long-duration, politically supported work—backed by blue-chip clients and megatrends. And as more companies race to bring operations home, our stock is in the pole position to win contract after contract.\nn fact, you can think of it this way:\nWherever America rebuilds its industrial backbone, this company gets paid.\nIt’s not just an AI play. It’s not just an energy play. It’s also the ultimate onshoring pick-and-shovel stock—a contractor to the next American manufacturing supercycle.\nAnd while Wall Street focuses on headlines, smart investors are loading up on the company quietly collecting billion-dollar checks behind the scenes.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nBuilt for the Future: Zero Debt, Cash to Deploy, and AI in Its Sights\nWhile most energy and utility firms are buried under mountains of debt and coughing up hefty interest payments just to appease bondholders…\nThis company is completely debt-free.\nIn fact, it’s sitting on a war chest of cash—equal to nearly one-third of its entire market cap.\nIt also owns a huge equity stake in another red-hot AI play, giving investors indirect exposure to multiple AI growth engines without paying a premium.\nAnd here’s what the smart money has started whispering…\nThe Hedge Fund Secret That’s Starting to Leak Out\nThis stock is so off-the-radar, so absurdly undervalued, that some of the most secretive hedge fund managers in the world have begun pitching it at closed-door investment summits.\nThey’re sharing it quietly, away from the cameras, to rooms full of ultra-wealthy clients.\nWhy? Because excluding cash and investments, this company is trading at less than 7 times earnings.\nAnd that’s for a business tied to:\n- The AI infrastructure supercycle\n- The onshoring boom driven by Trump-era tariffs\n- A surge in U.S. LNG exports\n- And a unique footprint in nuclear energy—the future of clean, reliable power\nYou simply won’t find another AI and energy stock this cheap… with this much upside.\nThis isn’t a hype stock. It’s not riding on hope.\nIt’s delivering real cash flows, owns critical infrastructure, and holds stakes in other major growth stories.\nThis is your chance to get in before the rockets take off!\nThe Reveal: Our Top Short-Term Stock Pick for 2025\nThis is the moment when most newsletters put up a paywall and ask you to spend $99.99 to find out the name of the stock.\nBut we’re not doing that today.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nAt Insider Monkey, we believe in earning your trust first—by delivering real value, upfront. We’re confident that once you see the quality of our research and the strength of our ideas, you’ll want to subscribe on your own terms.\nSo here it is—our top short-term stock pick of 2025:\n👉 Fluor Corporation (Ticker: FLR)\nWhen we published our premium report at the end of April, FLR was trading around $35 per share. Based on everything we’ve laid out—from the AI infrastructure boom to the LNG export surge and the American manufacturing revival—we believe FLR is poised to double over the next 12 to 24 months.\nAnd this isn’t just a recommendation—it’s a conviction.\nI personally took a double-sized position in my own portfolio. That’s how strongly I believe in Fluor’s upside.\nThis is our free gift to you.\nWe want you to profit from it—and see firsthand the power of aligning your investments with long-term megatrends.\nIf you’re interested in going even deeper…\nIf you’d like to access our #1 long-term AI stock pick—one that we believe has 10,000% upside potential over the next decade—click here to learn more.\nWe’ve shown you what we can do.\nNow imagine what you’ll unlock as a premium subscriber."
    },
    {
      "url": "https://www.insidermonkey.com/blog/13-best-oil-refinery-stocks-to-buy-right-now-1585923/",
      "text": "In this article, we look at the 13 Best Oil Refinery Stocks to Buy Right Now.\nInvestors are keeping their eyes on the global oil market while staying on their toes, amid a fresh wave of geopolitical tensions and supply-side shifts. On August 5, 2025, oil prices declined sharply as OPEC+ decided to increase production by 547,000 barrels per day for September. Brent Crude prices declined to $67.64, with WTI settling at $65.15. Prices for both hit their lowest in the past week.\nMeanwhile, U.S. President Donald Trump threatened new tariffs on India over its Russian oil imports, reigniting trade tensions. In response, New Delhi showed a strong stance, indicating a growing rift. Oil prices fell further on August 6, amid speculation about progress in U.S.-Russia talks over the Ukraine war, easing fears of supply disruptions. However, prices rebounded slightly on the next day amid signs of steady U.S. demand and a larger-than-expected decrease in U.S. crude inventories. U.S. crude stockpiles dropped by 3 million barrels in the week ended August 1.\nYet, uncertainty remains over Trump’s planned summit with Putin, potential secondary sanctions on China, and volatility in global oil demand forecasts.\nWith this backdrop in mind, let’s move on to our list of the 13 Best Oil Refinery Stocks to Buy Right Now.\nOur Methodology\nTo curate our list of the 13 Best Oil Refinery Stocks to Buy Right Now, we used the Finviz screener to extract a list of companies focused on oil refining. We then assessed hedge fund sentiment surrounding these stocks. Finally, we ranked these stocks in ascending order based on the number of hedge funds holding stakes in them as of Q1 2025. We extracted hedge fund data from Insider Monkey’s hedge fund database, which tracks over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n13. Delek US Holdings, Inc. (NYSE:DK)\nNumber of Hedge Fund Holders: 21\nDrawing significant hedge fund interest, Delek US Holdings, Inc. (NYSE:DK) secures a spot on our list of the 13 Best Oil Refinery Stocks to Buy Right Now.\nOn August 6, 2025, Delek US Holdings, Inc. (NYSE:DK) reported its performance for the second quarter of 2025. The company reported an adjusted loss per share of $0.56, compared to the consensus loss of $0.92. The improvement was a result of better refining margins and record system throughput. Meanwhile, its adjusted EBITDA reached $170.2 million, driven by strong performance at the Big Spring and Krotz Springs refineries.\nLooking ahead, Delek US Holdings, Inc. (NYSE:DK) increased its Enterprise Optimization Plan (EOP) guidance from $120 million to $130-$170 million in run-rate benefits starting in the second half of 2025. This reflects cost improvements and enhanced operations. Meanwhile, Delek Logistics (DKL), the company’s logistics subsidiary, reported $120 million in adjusted EBITDA and is expected to generate $480-$520 million for the year. This highlights the segment’s growing independence and liquidity. The company’s pipeline looks strong with the Libby 2 gas plant commissioning and expanded sour gas gathering capacity in the Delaware Basin. Lastly, the company’s financial health is further reflected through $29 million in dividends and share repurchases.\nWith its Refining and Logistics segments, Delek US Holdings, Inc. (NYSE:DK) operates as an integrated energy company in the U.S.\n12. World Kinect Corporation (NYSE:WKC)\nNumber of Hedge Fund Holders: 22\nWorld Kinect Corporation (NYSE:WKC) is included in our list of the 13 Best Oil Refinery Stocks to Buy Right Now.\nWorld Kinect Corporation (NYSE:WKC) reported its performance for the second quarter of 2025 on July 31, 2025. The company beat EPS estimates of $0.48 per share with adjusted EPS of $0.59. While the quarter was marked by macroeconomic headwinds, the company showed resilience, particularly in aviation, where gross profit grew 8% YoY to $138 million. Aviation segment performance was driven by European aircraft operations and private aviation. The Land segment, on the other hand, recorded a 17% gross profit decline due to divestitures in the U.K. and Brazil, along with softness in North American liquid fuels demand.\nMeanwhile, World Kinect Corporation (NYSE:WKC) recorded a $367 million goodwill impairment related to its Land segment. While the Marine segment suffered with a one-time tax hit, its overall performance remained stable. Furthermore, the company’s financial health remained strong, thanks to a 10% reduction in operating expenses and $13 million in free cash flow generated. As a result of robust quarterly performance, WKC returned $64 million to shareholders and paid dividends.\nOperating in the U.S., the Americas, Europe, the Middle East, Africa, and the Asia Pacific, World Kinect Corporation (NYSE:WKC) is engaged in aviation, land, and marine sub-segments within the broader energy market.\n11. Diversified Energy Company PLC (NYSE:DEC)\nNumber of Hedge Fund Holders: 24\nDrawing significant hedge fund interest, Diversified Energy Company PLC (NYSE:DEC) secures a spot on our list of the 13 Best Oil Refinery Stocks to Buy Right Now.\nOn August 4, 2025, Diversified Energy Company PLC (NYSE:DEC) repurchased 53,431 ordinary shares at a volume-weighted average price of $14.35. A day later, on August 5, it bought 306 more shares at $14.35 per share. Mizuho Securities USA LLC carried out both transactions. Furthermore, all shares will be canceled, reducing the total number of outstanding shares.\nThese transactions fall under Diversified Energy Company PLC (NYSE:DEC)’s buyback initiative announced in March, which aims to optimize capital allocation and enhance shareholder returns. The company’s outstanding shares total 77,935,467 as of the time of the latest cancellations.\nDiversified Energy Company PLC (NYSE:DEC), based in the U.S., owns and operates natural gas and oil wells."
    },
    {
      "url": "https://www.insidermonkey.com/blog/7-best-potash-stocks-to-buy-according-to-analysts-1578641/",
      "text": "In this article, we discuss the 7 Best Potash Stocks to Buy According to Analysts.\nAmid the recent geopolitical developments, the global potash market remains in a state of flux. In particular, the U.S. potash market is undergoing a challenging environment following President Donald Trump’s decision to impose a 35% tariff on Canadian imports, effective August 1, 2025. Following this, concerns have risen over fentanyl trafficking across the border, causing uncertainty about the tariff’s impact on potassium fertilizers, including potash. While goods under the U.S.-Mexico-Canada Agreement (USMCA) remain unaffected by the tariff implications, and the tariff’s scope is still under negotiation, uncertainty about the future of potash trade looms.\nMeanwhile, Canada continues to dominate the potash production market, responsible for over 50% of U.S. imports. Canada has exported roughly 4.9 million metric tons of potash to the U.S. in the first five months of 2025 alone. Looking ahead, the global demand for potash is projected to grow substantially, driven by rising living standards and changing diets. BHP, one of the major potash players, projects a 70% surge in demand by 2050.\nWith this backdrop, let’s move on to our list of the 7 Best Potash Stocks to Buy According to Analysts.\nOur Methodology\nTo curate our list of the 7 Best Potash Stocks to Buy According to Analysts, we used the Finviz screener to extract potash companies. We assessed analyst sentiment across the list and chose the stocks based on their upside potential. The list is in ascending order based on the respective stocks’ upside potential. We also considered the hedge fund sentiment across these stocks using Insider Monkey’s hedge fund database, which tracks over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n7. Nutrien Ltd. (NYSE:NTR)\nNumber of Hedge Fund Holders: 32\nUpside Potential: 8.79%\nWith upside potential and strong hedge fund interest, Nutrien Ltd. (NYSE:NTR) is included in our list of the 7 Best Potash Stocks to Buy According to Analysts.\nOn July 23, 2025, UBS raised its price target for Nutrien Ltd. (NYSE:NTR) from $56 to $64, maintaining a ‘Neutral’ rating. This price revision comes amid expectations of medium-term declines in Nitrogen, Phosphorus, and Potassium (NPK) fertilizer prices.\nPreviously, on July 17, Wells Fargo also increased its price target for Nutrien Ltd. (NYSE:NTR) to $62, reflecting optimism surrounding the company’s Q2 results. However, the analyst advised caution due to the company’s share price year-to-date rally.\nMeanwhile, Oppenheimer expressed the most bullish stance. The analyst, who increased the price target to $63 on May 13, 2025, raised the target again to $65 on July 15. The company, having missed expectations in Q1 due to weather-driven volume shifts, is expected to report a stronger Q2 performance, driving the analyst’s optimism.\nWhile Nutrien Ltd. (NYSE:NTR)’s short-term outlook remains mixed among analysts, it is projected to have a strong long-term outlook.\nOperating through its Nutrien Ag Solutions, Potash, Nitrogen, and Phosphate segments, Nutrien Ltd. (NYSE:NTR) manufactures potash, nitrogen, and phosphate products for agricultural, industrial, and feed market segments. It is included in our list of the best potash stocks.\n6. The Mosaic Company (NYSE:MOS)\nNumber of Hedge Fund Holders: 48\nUpside Potential: 9.93%\nThe Mosaic Company (NYSE:MOS) is included in our list of the 7 Best Potash Stocks to Buy According to Analysts.\nOn July 16, 2025, The Mosaic Company (NYSE:MOS) announced the launch of its new $84 million blending, storage, and distribution plant in Palmeirante, Brazil. This facility is expected to boost annual processing capacity to 1 million tons, enhancing the company’s presence in the growing MATOPIBA agricultural region in Brazil.\nWith this launch, The Mosaic Company (NYSE:MOS) projects margins of $30-$40 per ton, with an internal rate of return (IRR) above 20%. This facility reinforces the company’s long-term plan of growing its distribution sales from under 8 million tons in 2024 to 13-14 million by 2030.\nFollowing the launch, on July 23, 2025, UBS upgraded The Mosaic Company (NYSE:MOS) from ‘Neutral’ to ‘Buy,’ with a $45 price target. The analyst expressed confidence in the company’s future growth trajectory, with its ongoing strategic efforts.\nOperating in the United States, Brazil, China, Canada, Paraguay, Argentina, Japan, Colombia, India, Australia, Peru, Mexico, and internationally, The Mosaic Company (NYSE:MOS) produces concentrated phosphate and potash crop nutrients."
    }
  ],
  "argos_summary": "Restaurant Brands International Inc. (NYSE:QSR) has been included in a list of cheap value stocks despite a mixed Q2 performance, leading to price target reductions by Scotiabank and RBC Capital. Scotiabank lowered its target from $75 to $71, citing risks from soft U.S. consumer trends and challenges at Burger King and Popeyes, while RBC Capital reduced its target from $80 to $77 but maintained confidence in Tim Hortons and international growth. The company has shown a 22.4% revenue growth over the past year and continues its dividend growth policy.",
  "argos_id": "GTGLJD47H"
}