{
  "url": "https://www.nasdaq.com/articles/annovis-bio-narrows-loss-q2",
  "authorsByline": "The Motley Fool",
  "articleId": "034586b1256848239147bd2cc2515abf",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T03:10:10+00:00",
  "addDate": "2025-08-13T03:49:11.426357+00:00",
  "refreshDate": "2025-08-13T03:49:11.426360+00:00",
  "score": 1.0,
  "title": "Annovis Bio Narrows Loss in Q2",
  "description": "Key PointsEPS loss (GAAP) narrowed to $(0.32), outperforming consensus estimates by $0.08.",
  "content": "Key Points\n• None No revenue reported as Annovis Bio remains pre-commercial with no marketed products.\n• None Cash and cash equivalents (GAAP) rose to $17.1 million as of June 30, 2025, up from $10.6 million as of December 31, 2024.\n• These 10 stocks could mint the next wave of millionaires ›\n\nAnnovis Bio (NYSE:ANVS), a biotechnology company focused on innovative treatments for neurodegenerative diseases, released its earnings results for the second quarter on August 12, 2025. The company reported a net loss per share of $(0.32) (GAAP), which was $0.08 better than analyst expectations of $(0.40) (GAAP). No revenue was reported, matching estimates, as Annovis remains in a pre-commercial stage. The quarter featured ongoing cost discipline, an improved cash position as of June 30, 2025 compared to December 31, 2024, and continuing clinical progress with its lead drug candidate, buntanetap. Overall, the period revealed steady operational management during a critical stage for the business.\n\nAnnovis Bio develops therapies for neurodegenerative diseases such as Alzheimer’s disease (AD) and Parkinson’s disease (PD). The company’s primary asset, buntanetap, aims to block the production of several toxic brain proteins involved in these diseases. This multi-target approach is designed to address the complex biological processes behind AD and PD, going beyond the single-protein focus of many competing drugs.\n\nThe company’s primary focus is on advancing clinical trials and expanding intellectual property (IP) protections. Annovis aims to drive buntanetap through late-stage trials while securing patents to support long-term value. Key factors for success include demonstrating clinical benefit, progressing on regulatory milestones, and ensuring sufficient funding to reach commercialization.\n\nDuring the quarter, Annovis made progress on several fronts. Research and development expenses for the three months ending June 30, 2025, were $5.2 million, compared to $5.8 million for the same period in 2024. General and administrative expenses for the three months ending June 30, 2025, were $1.1 million, compared to $2.0 million for the same period in 2024.\n\nThe company’s net loss per share (GAAP) narrowed to $(0.32), comfortably ahead of analyst estimates. Cash and cash equivalents (GAAP) rose to $17.1 million as of June 30, 2025, while total liabilities declined from $4.6 million to $3.1 million. Shareholder equity (GAAP) increased to $18.3 million as of June 30, 2025, up from $9.3 million as of December 31, 2024, while total liabilities (GAAP) declined from $4.6 million as of December 31, 2024, to $3.1 million as of June 30, 2025, mainly due to reduced accounts payable and warrant liabilities.\n\nThe company continued its pivotal Phase 3 Alzheimer’s trial of buntanetap, a small molecule drug candidate. As of August 2025, Annovis had secured 76 U.S. study sites, with 46 actively enrolling patients. About 400 patients were screened, and 38 had entered the dosing phase (buntanetap or placebo). The screen failure rate in the pivotal Phase 3 trial was 50%. Buntanetap’s design to block multiple neurotoxic proteins—APP, tau, and α-synuclein—remained a centerpiece of the company's research and communications.\n\nA robust scientific presence was established through multiple poster presentations at the 2025 Alzheimer’s Association International Conference (AAIC). Annovis also achieved a key milestone in intellectual property by “the successful transfer of all patent families to crystal buntanetap, achieving comprehensive global IP coverage for both the original and new forms.” No commercial revenue was generated or expected at this stage, given that no drugs have reached market approval. No dividends were declared or changed during the period.\n\nManagement did not provide forward earnings or operational guidance for the next quarter or for fiscal 2025. The company stated that its main focus remains on advancing the pivotal Phase 3 Alzheimer’s study, with intentions to complete enrollment “as planned.” There remained no disclosure of clinical data release timelines or regulatory filing expectations.\n\nThe expanded cash cushion provides some runway for advancing trials, but more capital will be needed if the study timeline extends or moves toward commercialization. Investors should monitor the pace of patient enrollment, particularly since the 50% screen failure rate in the pivotal Phase 3 study could continue to affect timelines. ANVS does not currently pay a dividend.\n\nRevenue and net income presented using U.S. generally accepted accounting principles (GAAP) unless otherwise noted.\n\nWhere to invest $1,000 right now\n\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 1,060%* — a market-crushing outperformance compared to 182% for the S&P 500.\n\nThey just revealed what they believe are the 10 best stocks for investors to buy right now, available when you join Stock Advisor.\n\nJesterAI is a Foolish AI, based on a variety of Large Language Models (LLMs) and proprietary Motley Fool systems. All articles published by JesterAI are reviewed by our editorial team, and The Motley Fool takes ultimate responsibility for the content of this article. JesterAI cannot own stocks and so it has no positions in any stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=79b8f352-544c-45ba-91fa-71cb435213a9&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D10969%26source%3Disaedikp0000070%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17996",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=af5aa9cb-c09d-4d94-995d-a8ae4b474497&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17187%26ftm_veh%3Darticle_pitch_feed_partners&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=dae45c98-1336-486c-b2db-4241f7f243d8",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=af5aa9cb-c09d-4d94-995d-a8ae4b474497&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17187&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=dae45c98-1336-486c-b2db-4241f7f243d8"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Annovis Bio",
      "weight": 0.065377936
    },
    {
      "name": "clinical trials",
      "weight": 0.064176984
    },
    {
      "name": "advancing trials",
      "weight": 0.06022652
    },
    {
      "name": "continuing clinical progress",
      "weight": 0.058068912
    },
    {
      "name": "Motley Fool",
      "weight": 0.057824794
    },
    {
      "name": "clinical data release timelines",
      "weight": 0.056914873
    },
    {
      "name": "proprietary Motley Fool systems",
      "weight": 0.056352332
    },
    {
      "name": "Annovis",
      "weight": 0.056131225
    },
    {
      "name": "June",
      "weight": 0.055791438
    },
    {
      "name": "multiple neurotoxic proteins",
      "weight": 0.05517562
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.966796875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.958984375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9404296875
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.89599609375
    }
  ],
  "sentiment": {
    "positive": 0.8159237,
    "negative": 0.06555153,
    "neutral": 0.11852473
  },
  "summary": "Annovis Bio (NYSE:ANVS), a biotechnology company focused on innovative treatments for neurodegenerative diseases, released its earnings results for the second quarter on August 12, 2025. The company reported a net loss per share of $0.32 (GAAP), which was above analyst expectations. No revenue was reported as Annovis remains in a pre-commercial stage with no marketed products. Cash and cash equivalents rose to $17.1 million as of June 30, 2025, up from $10.6 million in December 2024, and continued clinical progress with its lead drug candidate, buntanetap. The primary focus is on advancing clinical trials and expanding intellectual property (IP) protections. No commercial revenue was generated or expected at this stage, given no drugs were declared or changed during the period.",
  "shortSummary": "Annovis Bio reported reduced losses and improved cash and operational management, while continuing clinical progress with its lead drug candidate buntanetap, despite no revenue reported.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "81e4bb4550f144ebaef34470f1c7069a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "Annovis Bio reported its second-quarter earnings for 2025, showing a net loss per share of $(0.32), which was better than analyst expectations. The company remains pre-commercial with no revenue, but its cash and cash equivalents increased to $17.1 million. Annovis is focused on advancing its lead drug candidate, buntanetap, through clinical trials for neurodegenerative diseases, while also expanding its intellectual property protections.",
  "argos_id": "HALBOVOKX"
}