{
  "url": "https://www.startribune.com/minnesota-vikings-rondale-moore-season-ending-knee-injury/601453325",
  "authorsByline": "Andrew Krammer",
  "articleId": "126340442f57458894448a536ebc3ab0",
  "source": {
    "domain": "startribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MN",
      "county": "Hennepin County",
      "city": "Minneapolis",
      "coordinates": {
        "lat": 44.9772995,
        "lon": -93.2654692
      }
    }
  },
  "imageUrl": "https://arc.stimg.co/startribunemedia/MVVIVRX7QJBJRGATKO2LSJXLKI.jpg?&w=1200&ar=1.91:1&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:41:43.450000+00:00",
  "addDate": "2025-08-12T20:47:44.456997+00:00",
  "refreshDate": "2025-08-12T20:47:44.457000+00:00",
  "score": 1.0,
  "title": "Vikings receiver Rondale Moore will miss 2025 season with left knee injury",
  "description": "Moore, who missed last season with right knee injury, was hurt on a punt return during the Vikings’ preseason game against the Texans on Saturday.",
  "content": "Vikings receiver Rondale Moore suffered a season-ending knee injury Saturday and will miss his second straight NFL season due to an August injury.\n\nMoore, the 25-year-old former second-round pick out of Purdue in 2021, sustained the injury during his first and only snap of the Vikings’ preseason win against the Houston Texans.\n\nExpected to compete for the Vikings’ punt returner job, Moore was injured during a 2-yard return while he was tackled from behind by Texans linebacker Jamal Hill in the second quarter.\n\nCoach Kevin O’Connell called the injury “heartbreaking” for Moore, who also spent the past year on injured reserve with the Atlanta Falcons rehabbing from what Vikings special teams coordinator Matt Daniels called a dislocated right kneecap suffered during practice last summer.\n\nMoore had worked his way back from last year’s injury to sign a one-year, $2 million deal with the Vikings in March that came with $250,000 guaranteed.\n\nDaniels will have to look elsewhere for a new punt returner. Internal candidates include four receivers — Lucky Jackson, Jalen Nailor, Silas Bolden and Myles Price — who fielded punt returns during Monday’s practice at the team’s Eagan headquarters.\n\nReceiver Brandon Powell also remains a free agent after averaging 7.1 yards per punt return last season for the Vikings.",
  "medium": "Article",
  "links": [
    "https://www.startribune.com/minnesota-vikings-houston-texans-nfl-preseason-rondale-moore-injury-notebook/601450088"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vikings receiver Rondale Moore",
      "weight": 0.12933657
    },
    {
      "name": "Vikings special teams coordinator Matt Daniels",
      "weight": 0.10522866
    },
    {
      "name": "punt return",
      "weight": 0.10219144
    },
    {
      "name": "punt returns",
      "weight": 0.10219144
    },
    {
      "name": "Rondale Moore",
      "weight": 0.09941132
    },
    {
      "name": "Vikings",
      "weight": 0.097940214
    },
    {
      "name": "left knee injury",
      "weight": 0.097067684
    },
    {
      "name": "last season",
      "weight": 0.094637625
    },
    {
      "name": "Moore",
      "weight": 0.09090148
    },
    {
      "name": "Receiver Brandon Powell",
      "weight": 0.08206846
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97412109375
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.96142578125
    }
  ],
  "sentiment": {
    "positive": 0.1068201,
    "negative": 0.48984814,
    "neutral": 0.40333176
  },
  "summary": "Vikings receiver Rondale Moore has suffered a season-ending knee injury, ending his second consecutive NFL season. The injury occurred during the Vikings' preseason win against the Houston Texans. Moore had previously spent the past year on injured reserve with the Atlanta Falcons. He signed a one-year, $2 million deal with the Vikings in March.",
  "shortSummary": "Vikings receiver Rondale Moore will miss the rest of the season with a knee injury sustained during a pre-season match.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ead980352ab64c6e98dd55c315e2bff4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.startribune.com/minnesota-vikings-houston-texans-nfl-preseason-rondale-moore-injury-notebook/601450088",
      "text": "The Vikings may be without their leading punt returner candidate for an extended period.\nReceiver Rondale Moore was carted off in the second quarter of Saturday’s 20-10 preseason win against the Houston Texans with “a pretty significant left knee” injury, coach Kevin O’Connell said, that will require further imaging.\nMoore, 25, went down on his first punt return midway through the second quarter at U.S. Bank Stadium. O’Connell joined players in kneeling around Moore as he was evaluated by medical staff. The coach also talked with officials about whether Texans linebacker Jamal Hill had brought down Moore with an illegal hip-drop tackle.\n“That’s what I was asking about,” O’Connell said. “It seemed like it had a lot of the characteristics of [a hip-drop tackle], but I know it is a three-part kind of process to actually call that on the field. I don’t think there was any bad intent there.”\nReceivers Lucky Jackson and Silas Bolden are listed as the team’s second and third punt return options. Bolden fielded two punts after Moore’s injury, taking one for an 8-yard return.\nMoore took his helmet off almost immediately after hitting the ground on the Texans’ sideline near the Vikings’ 11-yard line. He could be seen on video replay grabbing at his left knee.\nMoore’s left leg was extended on the cart, and a trainer had a hand on it, but he was not placed in an air cast. He had a towel over his head and pounded the cart with his hands as he left the field.\nMoore, the 2021 second-round pick by the Arizona Cardinals out of Purdue, had spent the past year rehabbing from what Vikings special teams coordinator Matt Daniels called a dislocated right kneecap suffered during practice last summer. Moore did not play in 2024. He may not play this year if this injury is indeed significant."
    }
  ],
  "argos_summary": "Vikings receiver Rondale Moore has suffered a season-ending knee injury during a preseason game against the Houston Texans, marking his second consecutive season lost to injury. The 25-year-old, who was expected to compete for the punt returner position, was injured on his first snap while attempting a return. Coach Kevin O’Connell described the situation as 'heartbreaking' for Moore, who had previously been rehabbing from a dislocated kneecap sustained last summer.",
  "argos_id": "HF0OB3HMS"
}