{
  "url": "https://www.cnn.com/cnn-underscored/deals/reformation-sale-2025-08-12",
  "authorsByline": "Elena Matarazzo",
  "articleId": "607f1a493e86455b90d5db61bcb36ef6",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/reformation-lead.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T17:39:53.452000+00:00",
  "addDate": "2025-08-12T17:50:16.454869+00:00",
  "refreshDate": "2025-08-12T17:50:16.454870+00:00",
  "score": 1.0,
  "title": "I have a store credit at Reformation. Here’s what I’m buying during its rare sale",
  "description": "This time around, tons of best sellers, newly released items and seasonal favorites are 30% off.",
  "content": "Earlier in the year, I covered Reformation’s last sale that had savings of up to 70% off. This time around, tons of best sellers, newly released items and seasonal favorites are 30% off. While the discount isn’t as high as the clear out in January, it’s more consistent and tons of coveted styles are available to shop — plus the stock of available sizes and colors is remarkable.\n\nI’m personally shopping this sale because I’ve been patiently waiting for the brand to have a sale since I need a little wardrobe refresh ahead of fall. With a vacation coming up, concerts to attend and more, I’m ready to add a few pieces to my closet. Shop 15 of my favorite picks below.\n\nWhy this Reformation sale is worth shopping\n\nIf you’re a follower of the sustainable clothing brand, you are probably aware that they rarely have sales and never keep a section of markdowns on site or in store outside of these limited events. I’ve been shopping at Reformation and consistently shop there for wedding guest dresses, other formal events and even for some basics.\n\nWith September just a few weeks away, many of us need new staple pieces for the fall and winter months and Reformation is a great retailer to flock to for capsule wardrobe items and fashion deals. Think basic tees, timeless sweaters, ethically made denim and more.\n\nOur deals team has over a decade of combined commerce journalism experience. Rikka Altland, Jacqueline Saguin and Elena Matarazzo source the deals for the day each morning to curate one-offs and retailer-specific roundups of the best sales to shop. Searching everything from coveted pieces from Lululemon to the best picks from Dyson’s sale, the team works across a wide variety of categories to ensure we’re finding the best buys for our readers.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/cnn-underscored/fashion/maxi-skirts",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fsale&u1=0812refsale",
    "https://www.cnn.com/cnn-underscored/deals/lululemon-we-made-too-much-2025-08-12",
    "https://www.cnn.com/cnn-underscored/fashion/best-tank-tops-with-built-in-bras-2025",
    "https://www.cnn.com/cnn-underscored/fashion/best-little-black-dress",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Faubrey-knit-top%2F1316933BRW.html%3Fdwvar_1316933BRW_color%3DBRW&u1=0812refsale",
    "https://www.cnn.com/2024/07/24/style/gigi-hadid-midriff-top-lotw",
    "https://www.cnn.com/cnn-underscored/deals/dyson-week-sale-2025-08-04",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fryland-tank%2F1313231MNL.html%3Fdwvar_1313231MNL_color%3DMNL&u1=0812refsale",
    "https://www.cnn.com/cnn-underscored/deals",
    "https://www.cnn.com/cnn-underscored/about/rikka-altland",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fcarla-low-waist-skirt%2F1315328MCY.html%3Fdwvar_1315328MCY_color%3DMCY&u1=0812refsale",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fkella-knit-dress%2F1316969GOL.html%3Fdwvar_1316969GOL_color%3DGOL&u1=0812refsale",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fsammi-knit-jacket%2F1316646BLK.html%3Fdwvar_1316646BLK_color%3DBLK&u1=0812refsale",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Ftyler-mid-rise-barrel-jeans%2F1317726YRR.html%3Fdwvar_1317726YRR_color%3DYRR%26quantity%3D1&u1=0812refsale",
    "https://www.cnn.com/cnn-underscored/fashion/best-cowboy-boots",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fcheri-knit-dress%2F1317369BLK.html%3Fdwvar_1317369BLK_color%3DBLK&u1=0812refsale",
    "https://www.cnn.com/cnn-underscored/about/jacqueline-saguin",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fbella-velvet-skirt%2F1316769BLK.html%3Fdwvar_1316769BLK_color%3DBLK&u1=0812refsale",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fciana-satin-dress%2F1316815FSY.html%3Fdwvar_1316815FSY_color%3DFSY&u1=0812refsale",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fgalene-dress%2F1316316FJD.html%3Fdwvar_1316316FJD_color%3DFJD%26quantity%3D1&u1=0812refsale",
    "https://www.cnn.com/style/article/how-to-dress-for-the-office-styleguide-2023",
    "https://www.cnn.com/cnn-underscored/deals/reformation-sale-2025-01-06",
    "https://www.cnn.com/cnn-underscored/about/elena-matarazzo",
    "https://www.cnn.com/cnn-underscored/fashion/most-sustainable-clothing-brands",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fabby-low-rise-straight-jeans%2F1315100TNY.html%3Fdwvar_1315100TNY_color%3DTNY&u1=0812refsale",
    "https://www.cnn.com/style/article/dark-academia-tiktok-aesthetic-cec",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Flottie-vest%2F1317072SMK.html%3Fdwvar_1317072SMK_color%3DSMK&u1=0812refsale",
    "https://www.cnn.com/cnn-underscored/fashion/editors-favorite-fall-winter-jackets",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fkendi-denim-midi-dress%2F1313243OOL.html%3Fdwvar_1313243OOL_color%3DEUB%26quantity%3D1&u1=0812refsale",
    "https://www.cnn.com/cnn-underscored/fashion/linen-clothing-essentials",
    "https://www.cnn.com/cnn-underscored/fashion/editors-favorite-jeans",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fcarter-mid-rise-pant%2F1313605BLK.html%3Fdwvar_1313605BLK_color%3DBLK&u1=0812refsale",
    "https://www.tiktok.com/@cnnunderscored/video/7492889549832539438",
    "https://click.linksynergy.com/deeplink?id=Fr/49/7rhGg&mid=40090&murl=https%3A%2F%2Fwww.thereformation.com%2Fproducts%2Fellen-knit-top%2F1317433NVY.html%3Fdwvar_1317433NVY_color%3DNVY&u1=0812refsale",
    "https://www.cnn.com/2021/12/16/business/skinny-leggings-versus-baggy-jeans-gen-z"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "sales",
      "weight": 0.09307181
    },
    {
      "name": "best sellers",
      "weight": 0.08144843
    },
    {
      "name": "coveted pieces",
      "weight": 0.07899316
    },
    {
      "name": "capsule wardrobe items",
      "weight": 0.076661676
    },
    {
      "name": "new staple pieces",
      "weight": 0.07628166
    },
    {
      "name": "Reformation",
      "weight": 0.0690712
    },
    {
      "name": "other formal events",
      "weight": 0.06705436
    },
    {
      "name": "timeless sweaters",
      "weight": 0.06500046
    },
    {
      "name": "fashion deals",
      "weight": 0.06458812
    },
    {
      "name": "coveted styles",
      "weight": 0.06456475
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.771484375
    },
    {
      "name": "/Shopping/Apparel/Women's Clothing",
      "score": 0.50927734375
    },
    {
      "name": "/Shopping/Apparel/Other",
      "score": 0.491943359375
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Fashion Designers & Collections",
      "score": 0.4345703125
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.392822265625
    }
  ],
  "sentiment": {
    "positive": 0.42805666,
    "negative": 0.12147811,
    "neutral": 0.45046526
  },
  "summary": "The rare sale at Reformation, a sustainable clothing brand, is being held by the company for 30% off, with best sellers, newly released items and seasonal favorites priced at up to 70% off. The discount is more consistent than the clear-out in January, with tons of coveted styles and a wide selection of sizes and colors available. This sale is part of a larger trend of shopping for affordable fashion items and fashion deals. The retailer's deals team selects one-off deals and retailer-specific roundups of the best sales each day.",
  "shortSummary": "Reformation's rare 30% sale offers exceptional quality and stock, especially for fall-time purchases like Douse Christ Christ Christ's (Epic) for his employee.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d001ae3b2a83475d9c07019602f07295",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/style/article/how-to-dress-for-the-office-styleguide-2023",
      "text": "Editor’s Note: Fiona Sinclair Scott is CNN Style’s global editor. This is an edited version of an article published in 2022.\nThere’s a scene from the original incarnation of MTV’s aughts-era reality TV series “The Hills” in which main character Lauren Conrad has her outfit assessed by a fashion stylist within minutes of starting an internship at Teen Vogue. She wants to make sure she’s looking her best before meeting Lisa Love, who was the title’s editor-in-chief at the time, and so tweaks are made — “maybe just something to cover your shoulders,” suggests the stylist before giving her a jacket — before Conrad’s outfit is deemed suitable for her new workplace.\nIt’s a ludicrous moment and something that wouldn’t happen now, or even back then, in most offices. But if you’re about to start a new job and worried about what to wear, this guide — with input from four fashion insiders — should help you navigate the tricky business of dressing for work.\nOne caveat: If your sartorial energy is akin to Julia Roberts playing Erin Brockovich (“As long as I’ve got one ass instead of two, I’ll wear what I like if that’s all right with you”), you don’t need me or this guide, you need a high five. Keep it up.\nFormalities out of the way, read on for everything you need to know about dressing for the office.\nThe green tip: Shop your wardrobe\nWhen in a sartorial panic, there’s a tendency to solve it with a shopping spree. But as we all wise up to the impact of our consumption habits on the planet, consider this sustainable alternative: Get your hand out of your pocket and dig deep inside your wardrobe instead.\n“It’s a first step,” said Los Angeles-based stylist Cassandra Dittmer, who suggests you figure out what you have, what you love, what needs repair and what you might want to pass on. “Hopefully (you’ll) uncover some hidden gems.”\n“At the end of the process, you should feel a deeper connection to your wardrobe, find the gaps that need filling and give yourself a great basis to work from each day when putting your outfits together with ease.”\nI did this last month and rediscovered an old pair of trousers that I’m wearing again after re-dying them black. (Faded black jeans, trousers and sweaters really benefit from running them through a wash cycle with an at-home clothes dye capsule, such as the kind made by Dylon).\nBonus tip: If you live in a country with hot and cold seasons, pack your summer clothes away when fall arrives. You’ll be surprised by the aura of newness they take on when you retrieve them from storage months later.\nDittmer, who has built her styling business around eco-conscious values, suggests you may want to go further and channel your inner Cher Horowitz (à la the movie “Clueless”): “Document your looks and take pictures of outfits you love and feel most confident in. A convenient folder on your phone will make a quick and handy reference point when you are scrambling to pack for a work trip or getting ready in the morning.”\nThe basics: Polished comfort\nThere’s a way to dress comfortably without looking bedraggled, and with many employers loosening up on the rules, it’s a great time to try a polished but casual look.\nJoanna Dai, who left her job in finance to start her own eponymous fashion brand, has noticed a trend away from overly formal office fashion conventions like formal suits and restrictive pencil skirts.\n“In the new normal things have gotten more casual in office,” said Dai, noting that, as companies recognize the importance of well-being at work, many have adopted more relaxed dress codes that allow for jeans and sneakers or done away with dress codes altogether.\nEmbracing more casual attire while also looking professional begins with understanding the importance of quality materials, fit and color.\n“Never underestimate the power of a good fit,” Dittmer said. “I’m not talking expensive, Savile Row tailoring – but making sure your trousers are cut to the most flattering fit can be a huge improvement and make you feel really well put together. Most dry cleaners offer very accessible tailoring services.”\nModel and the founder of size-inclusive fashion brand Henning, Lauren Chan, agreed a good tailor is important, adding, “Here’s a secret: Clothes aren’t actually meant to fit you. They’re built to fit an ‘average build’ which is – spoiler alert – no one. Buy clothes that fit you across your widest part (for me, it’s my waist) and tailor the rest inward.”\nWhen it comes to materials, most linens, while beautiful, wrinkle easily and are not going to be your friend throughout an eight-hour day at a desk job. On the other hand, polyester is pretty wrinkle-resistant, but it’s a synthetic fabric that’s terrible for the planet and doesn’t breathe – putting you at risk of unsightly sweat patches and a guilty conscience. Check labels for organic and sustainably made cotton or new fabrics made with a high percentage of recycled materials.\nDai puts a lot of emphasis on what she calls “high-functioning” environmentally friendly materials, such as micromodal (made from the cellulose of natural beechwood trees in a closed-loop, carbon neutral process) or recycled polyamide (made from plastic waste like fishing nets and carpet). Many of the items in her lines are made from wrinkle-resistant, machine washable, stretch materials that are great for people with busy schedules who don’t have time to iron or make regular trips to the dry cleaner.\nOlie Arnold, style director at menswear e-commerce site Mr Porter, suggests opting for unlined suits. “Go for suits and jackets which are unlined and deconstructed with a breathable fabric,” he said, “as they will give you a smart look with a comfortable fit.”\nAnd, he advises, if you want to relax your suit further, don’t bother with a formal shirt. “If you can push the envelope a little at your workplace, a merino wool long-sleeve polo is a perfect companion, breaking up your outfit without losing that professional look.” Merino wool is naturally temperature regulating, too.\nPersonally, I also love an oversize jacket and slouchy suits, and there are many options out there right now at a range of price points. Brands like Arket (another Scandinavian label within the H&M group) offer some solid midrange casual suits. Keep the jacket unbuttoned always and wear a good quality cotton T-shirt underneath. Pair it with boots or sneakers (French brand Veja has good green credentials, offering many styles appropriate for the office).\nThe aside: A note for newbies\nIf you’re about to start your very first job, you might be looking at walking into your office without any prior reference for what people typically wear.\nFirst off, just ask — it’s totally reasonable to ask your new manager what the vibe is. And if you’re still unsure, remember this sound advice from Arnold: “Be yourself, dress for the occasion and make sure you feel comfortable. If you don’t feel comfortable in what you wear, it can reflect on how you present yourself and your productivity.”\nThe golden rule: Create your own uniform and then build on it\nSet yourself up by establishing some staple pieces that can form the basis of your work wardrobe. A great pair of black trousers, a blazer and some quality shirts can go a long way.\nDrawing on her own closet as an example, Dai said, “I have a uniform or a capsule collection in my wardrobe. I’ve got a skinny-ankle trouser which is great for cycling into work because they won’t get caught on the chain. I also have a wide-leg just to add that difference in the week…And then one or two good blazers.”\nEvery item in your collection of staples should be something you can imagine wearing multiple times in a week, and you should be able to style each item in at least three different outfits.\nIn cooler months, a well-tailored pair of trousers paired with quality knitwear and a boot is fuss-free, especially if you stick to classic colors like black, navy, grays and tans, which are very easy to interchange. The knitwear can be swapped out for a blouse or shirt in warmer weather for a similar effect.\nSkirts can play into this uniform, too. An A-line skirt cut an inch or two above the knee with a crisp white shirt with a French tuck (a more relaxed approach where the back of your shirt remains mostly untucked) could be added into your rotation in warmer months. Also, midlength skirts pair nicely with structured, thick cotton T-shirts or a thin wool sweater.\nThe twist: Accessorize\nMix up the uniform with jewelry and accessories. I’m a big fan of the workwear uniform, but I’ll mix it up with some form of accessory.\nArnold points to footwear as another way to elevate a simple look. “A classic hard shoe, such as a pair of Penny Loafers from John Lobb or George Cleverley, are a personal staple. You can’t go wrong with their practicality and long-lasting craftsmanship, whilst (they) can easily elevate an outfit if you go a little more casual.”\nA pair of tan flats are also great if you don’t want to wear sneakers. Go for a sharp, pointed toe as opposed to anything rounded. Also, a beautiful silk scarf (worn folded into a triangle and draped over your shoulders), a watch or – my personal favorite – big earrings can be quite impactful.\nIf you’re looking for an investment piece, I’d always (much to my bank account’s horror) splash out on a bag. A beautifully crafted handbag or tote will last forever and immediately lift a look. If that sounds expensive, scroll down for tips on renting. Alternatively, the luxury resale market is booming. Use sites like Vestiaire or Resee to find deals on pre-vetted, secondhand luxury items.\nThe debate: To denim or not to denim\nA no-denim policy might be the last bastion of formal workwear culture at some corporate workplaces, but for many companies, denim is absolutely acceptable.\n“I really do believe you can wear denim, even in more formal offices (or) at least on a Friday,” said Dai, who added that she preferred black denim when she still worked in a corporate setting. “If you’re not seeing clients or you have clients who are more casual than you are then I think (if you’re considering) a denim for a lunch meeting, go for it!”\nDittmer agrees. “To ease yourself in, start with dark, straight-leg denim which can look really polished. Denim can be a great base layer for crisp shirting, beautiful blouses, and is a great way to break out of your classic work uniform style and branch out into more playful looks.”\nLook for darker denim washes, and a classic straight or wide leg. Gen Z ruled out skinny jeans last year, much to the despair of many millennials, and – while I don’t live and die by trends – I think they might have a point. Also, keep your ankles away at work (a tiny hint is fine but avoid a cropped jean). And while we’re seeing a lot of low-slung options on the runway as the fashion world continues to be inspired by Y2K style, high-waisted options are the best bet for the office (they’re also the most flattering).\nThe pep talk: Don’t forget to have fun\nStarting a new job can be daunting — you’ll be meeting new people, spending time in a new environment and taking in a lot of new information. What you wear shouldn’t add to the stress. Lean into the chance to express yourself and play with fashion. Use clothes to set the mood for your day, depending on what’s on the agenda.\nRenting is an excellent way to experiment and add some fun pieces to your wardrobe. For Dittmer, “It’s a great low-commitment, low-cost way to try out new styles and brands.”\nIt’s also a great way to inject a little bit of luxury into your life. I pay for a monthly subscription to a rental company called Cocoon that allows me to select one designer bag every four weeks to be delivered to my door. The one I’m sporting this month retails around $2,000, but it cost me $130. Renting is also a great option should you need to dress up for a work event. More and more online styling services are popping up with plenty of partywear.\nAbove all, remember that fashion is supposed to be fun. Don’t take it too seriously; wear clothes that make you feel confident and happy. It’s horribly cheesy, but a smile really is the best accessory.\nSign up for CNN’s Adulthood, But Better newsletter series. Our seven-part guide has tips to help you make more informed decisions around personal finance, career, wellness and personal connections.\nTop image credits: Clockwise from left to right: Yellow skirt and shirt look courtesy Arket; Navy suit street style look via Getty Images; Brown suit courtesy Mr Porter; Maxi dress and blazer street style look via Getty Images; White shirt look courtesy Dai; Black trousers and oversize white shirt look courtesy Dai; trench coat look courtesy Arket."
    },
    {
      "url": "https://www.cnn.com/style/article/dark-academia-tiktok-aesthetic-cec",
      "text": "The “dark academic” is smart but sullen, effortlessly cool but largely withdrawn, with rings under their eyes (spending all night in dimly lit libraries) and bruised legs (getting up to no good in between courses – a dark academic typically has a dark secret).\nThey’ve got an eye for Gothic architecture and can wax poetic about Keats, Woolf and other titans of the Western canon. They sip tea by candlelight, stay up late writing at their vintage desk and thrive when the weather is dreary.\nAnd most often, the dark academic is a TikTok user, emulating a look they’ve only seen onscreen or in books, and living a version of a dream life in which they can spend their days reading the classics in a centuries-old library.\n“Dark academia,” for all its tweed blazers, scuffed loafers and schoolgirl-plaid skirts, isn’t just a material aesthetic for some, but a lifestyle. Its sacred texts include Donna Tartt’s “The Secret History” and Oscar Wilde’s classic “The Picture of Dorian Gray.” Many of its acolytes harbored dreams of attending storied schools across the pond and studying history, art or classic literature – subjects some college students might be discouraged from pursuing.\nThat’s what drew Talya Glowacz, who posts on TikTok as CosyAcademia, to the aesthetic – the “romanticization of learning.” Before the pandemic, she was attending a master’s degree program at the University of Exeter in England with plans to become a college professor. When Covid-19 sent her back to the US, she longed to return to her historic campus. Finding dark academia was the next best thing.\n“I think that building these ‘aesthetic’ communities virtually via social media has allowed for a lot of people to meet friends and explore their interests despite the isolation of the pandemic,” she told CNN in an email.\nSchool’s been in and out since March 2020, so dressing – and living – like a “dark academic” is a way for followers to meld their uniform past, unstable present and aspirational future.\nDark academia combines smarts and style\nThough versions of “dark academia” permeated Tumblr and Pinterest in the mid-2010s, the trend resurged in popularity when the pandemic began. Being forcibly separated from her school by Covid-19 made Glowacz crave the experience all the more – she wanted to romanticize an experience she’d lost.\nShe wasn’t alone – the hashtag gained traction on TikTok at the end of 2020 and continued to gain momentum and find fans. Soon, young people stuck at home were donning wooly sweaters over collared shirts and pulling up knee-high socks for looks that resembled uniforms they might have seen in “Dead Poets Society” or “Derry Girls.”\nFashion is one of the draws of dark academia – sweater vests are in! – but it’s ballooned into something far wider. On TikTok, users share violin renditions of Arctic Monkeys anthems, cosplay scenes as schoolboys running from an unknown evil and pleasing close-ups of tea being poured, rain beating against a bedroom window and the flicker of a waning flame.\n“It’s portrayed generally as a sort of secretive, individual, and intense thirst for knowledge which is what makes it moody and ‘dark’ academia,” Glowacz said.\nIn Glowacz’s videos, she shares her collection of antique leather-bound books, creates grainy videos of sealing envelopes with wax from a melted candle and outfit pairings for every season. While the fashion elements of the aesthetic are fun to play with, she said that she’s happier finding friends with similar interests, not just similar style.\nAlice Sidgwick, a lifelong reader who “loves studying, writing, vintage clothes and old buildings,” said she didn’t so much “join” the trend as she did discover an umbrella under which her pre-existing interests fell.\n“Dark Academia really is just a shorthand for all the things I like,” Sidgwick, DarkAcademiaCandles on TikTok, told CNN in an email. “It’s nice to see people posting things that are celebrating how hard they’re studying, or painting, or writing, and that other people can join in on that. I think that’s a very positive thing to come out of TikTok.”\nWhen the pandemic began, Sidgwick started selling candles inspired by characters from classic literature – a vetiver and mahogany scent for Mr. Darcy, amber and vanilla for Jay Gatsby – complete with a handwritten love letter, wax-sealed, from the character. When she discovered the dark academia hashtag on TikTok, she knew she found her customer base. Now, her business is named for the aesthetic she loves.\nDark academia can have a dark side\nSome of the “dark academia” elements that its followers love are what make it potentially problematic to others.\nRowan Ellis, a UK YouTuber who creates videos on LGBTQ history, said in a 2021 video that the elitism and emphasis on White authors and artists baked into dark academia can be limiting and harmful.\nEllis said in the video she attended Durham University, a prestigious college whose town often appears in aspirational “dark academia” posts. But her experience there didn’t reflect those fantasies – there, and at other universities in the UK, classism made students feel unwelcome and a lack of financial support left them saddled with debt.\nThe Western cannon of “classic literature” is largely comprised of White authors writing about White protagonists, Amal Abdi wrote for Refinery29. And because prestigious institutions for so long excluded Black students and people of color, when their history goes unquestioned or even celebrated, dark academics may perpetuate the same exclusion, Ellis said.\n“They wear the style of the elite and valorize the subjects of those institutions, but the long tradition of student protest and political engagement seems missing in a lot of cases,” she said in the video.\nDark academia isn’t inherently offensive, Ellis said, but to make it an inclusive community, its followers should reckon with the history of the institutions they valorize.\nThe trend keeps growing\nNewer creators are working to dismantle the predominantly White reputation of dark academia. Books like “Ace of Spades” by Faridah Àbíké-Íyímídé, about two private school students whose futures are threatened by a dangerous bully, and films like “Selah and the Spades,” about a popular group at a prestigious boarding school who harbor dark secrets, center Black protagonists in familiar stories. Dark academics from all backgrounds are adding them to lists of recommended reading and viewing. (Though the book and film share similar titles, they’re set at different institutions with unrelated characters.)\nTikTok users like CosyFaerie create content for what she calls the “Black girl, dark academia side of TikTok,” where she dons frilly shirts to sip tea, reads a yellowed copy of “Pride and Prejudice” and tours museums.\n“I was obsessed with dark academia … but could barely see any representation,” she wrote in one video. “So I decided to do it myself [smiley emoji] and add a little bit of spice.”\nDark academia’s appeal is wide and only growing (and it’s seasonally appropriate, too – nothing says “winter” like curling up with a book in bed or layering with a thick sweater). And even with school mostly back in session, Glowacz still takes comfort in the world of dark academia, where it’s perpetually drizzling and there’s always a piping-hot cup of tea waiting for her."
    },
    {
      "url": "https://www.cnn.com/2024/07/24/style/gigi-hadid-midriff-top-lotw",
      "text": "Editor’s Note: Featuring the good, the bad and the ugly, ‘Look of the Week’ is a regular series dedicated to unpacking the most talked about outfit of the last seven days.\nWhen Gigi Hadid stepped onto the “Deadpool & Wolverine” red carpet premiere in New York on Monday, she dusted off a Y2K summer staple, sporting a yellow triangle top bound to give any millennial an immediate flashback (and possibly a hot flash).\nIf crop tops could talk, the triangle — also known as a handkerchief or bandana top — is the one most likely to gossip about you behind your back, and serves as a sure-fire signal of sex appeal and cool-girl status.\nFamously worn by Beyoncé and Jennifer Aniston, the triangle top was inherently Brat two decades before “Brat girl summer” was officially coined. A quintessential going-out top, it evoked a sense of effortlessness; you were so hot, you could simply tie a hair accessory around yourself as a shirt and pull it off. The triangle spawned offshoots too — its sister, the scarf top, was suggestively tied into a bra by Christina Aguilera.\nTrue to the legend of the aughts, Hadid styled the minimal fabric maximally with a matching yellow low-slung knee-length skirt and peeping black underwear, a super-wide brown belt and equally wide stacked bangles, pointed black pumps and a color-coordinated charmed-out handbag. The matchy-yet-busy Miu Miu ensemble (all in leather, which is having a sweaty moment this summer) was a perfect time-capsule of yesteryear, with internet commenters on Reddit dubbing it “Fergalicious,” referring to the singer Fergie’s distinctive application of millennium style.\nBut while Hadid’s triangle top stood out for its nostalgic appeal, the style has lurked on the fashion periphery in recent years as crop tops have remained a fixture. Emily Ratajowski, Bella Hadid and Sydney Sweeney have all worn variations on the style, with Kylie Jenner repping the same Miu Miu top and skirt set as Hadid’s in black last month.\nJoined by her friend Blake Lively on the red carpet (clad in a lacy red Versace catsuit), Hadid’s look was meant to be a coordination of sorts, the hues evoking the signature colors of the franchise’s titular superheroes, played by Lively’s husband Ryan Reynolds and Hugh Jackman, with Lively’s a more on-the-nose interpretation of Deadpool’s predilection for spandex.\nBut the appearance also marked a shift in the now ubiquitous world of premiere ‘method dressing’ for top-billed actors. — in New York, Reynolds and Jackman wore black suits, leaving it to Lively and Hadid (neither appear in the film) to pick up the theme. Perhaps reluctant to get too coordinated, a la the classic looks of Destiny’s Child, the result was ultimately discordant, with silhouettes and materials at odds, carefully avoiding the trap of looking too ketchup and mustard.\nThough triangle tops are meant to seem easy and breezy, they can be a nuisance for small and large breasts alike; they’re also impractical anywhere there’s wind or an air conditioner. For that reason, Hadid hopefully had a jacket in tow for the chilly indoor theater — perhaps the translucent trench she changed into for the after party, also in Wolverine yellow."
    },
    {
      "url": "https://www.cnn.com/2021/12/16/business/skinny-leggings-versus-baggy-jeans-gen-z",
      "text": "When Gen Z + TikTok declare a fashion trend as “cheugy,” it means it’s over. The rest of us are expected to just move along to the next thing.\nBut what happens when Gen Z gets caught between two diametrically opposed trends, one threatening to cancel out the other, and both beloved by teen shoppers?\nWhat we’re talking about here is the struggle between fitted leggings versus baggy jeans.\nBefore they declared “skinny” anything to be out, Gen Zers were passionate about fitted leggings, a longtime staple in their closets. It’s why athleisure brand Lululemon (LULU) and its pricey $100 to $130 leggings have consistently ranked as a coveted brand among that demographic, whose members are those born after 1997.\nIn Piper Sandler’s recent 42nd semi-annual “Taking Stock With Teens” survey of 10,000 Gen Z consumers, Lululemon once again emerged as a preferred brand of young consumers this year, ranking as their fifth-favorite clothing brand after Nike, American Eagle Outfitters, Pacsun and Adidas.\nMillennials, for their part, are grateful to their successive generation’s penchant for leggings because they, too, obsessively wear them to grab a cup of coffee, for school dropoffs, even to work. And whatever the teen consumer powerhouse still likes is what retailers are keeping in stock.\nBut now, Gen Z is showing that, even in leggings, “skinny” is almost done. On TikTok, they’ve been swooning over “flared” leggings for months, otherwise known as yoga pants.\nIt’s yet another example of Gen Z’s fondness for resurrecting popular style trends of the past (baggy jeans, scrunchies, tracksuits, chunky plastic jewelry.)\nPopular influencer Emma Chamberlain, with her nearly 15 million followers on Instagram and close to 11 million on TikTok, has championed flared leggings on social media since last fall. Zoom into 2021 and flared leggings have popped up at a slew of teen-friendly chains, including Pacsun, Lululemon, Gap (GPS) and Athleta.\n“From a teen perspective, Lululemon is still a No. 1 brand with high schoolers but there is a nod to baggy trousers, pants and leggings now in their wardrobe,” said Erinn Murphy, managing director and senior research analyst with Piper Sander.\nAnd for those teens who still wear skinny leggings, they are styling the look as a “triangle” or “inverted triangle, she said. “So its baggy t-shirt with skinny leggings or a shorter top with a looser pant,” said Murphy.\nPacsun president Brieane Olson said the push for loose 70’s flares and 80’s baggy styles in pants and leggings is dominating Gen Z, and the styles are popping up heavily on TikTok and Instagram reels.\nConsequently, she said, “at Pacsun we’re seeing a sizable shift into looser silhouettes in bottoms across both our men’s and women’s consumer. Wide leg, loose fit or baggy, flare and super flare, and boot cut are surging denim trends with our Pacsun consumer.”\nOlson went as far as to say that skinny pants have begun to lose currency with Gen Z over the past few years, and “going into 2022 will become close to obsolete for our consumer.\nMarket research firm NPD Group noted in a recent report that consumers overall have adopted more casual and cozy fashion styles “from head to toe.”\nIn the women’s jeans and active bottoms categories, such as leggings, looser fitting styles are gaining share, said Maria Rugolo, fashion apparel analyst with NPD Group.\n“We are starting to see some looser fits in active apparel, as well,” she said. “Flare is the style right now and TikTok is having a moment with it.”"
    }
  ],
  "argos_summary": "Reformation is currently offering a sale with 30% off on best sellers and seasonal favorites, making it a great opportunity for shoppers looking to refresh their wardrobes ahead of fall. The brand is known for its sustainable clothing and rarely holds sales, making this event particularly noteworthy. In addition, the article discusses dressing for work, emphasizing the importance of comfort and quality materials while navigating more relaxed office dress codes, and highlights the growing trend of dark academia among Gen Z, which romanticizes learning and classic literature.",
  "argos_id": "HMEKRIEW4"
}