{
  "url": "https://www.usatoday.com/story/opinion/columnist/2025/08/12/republicans-anti-trans-ads-midterms-cooper/85615308007/",
  "authorsByline": "Sara Pequeño",
  "articleId": "f86e8e6c27d34719a39807719a0f405c",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/01/USAT/85476024007-georgia-buddy-collins-mike-carter-kristi-noem.jpg?crop=5324,2995,x0,y278&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:32:01+00:00",
  "addDate": "2025-08-12T08:37:20.536671+00:00",
  "refreshDate": "2025-08-12T08:37:20.536673+00:00",
  "score": 1.0,
  "title": "Trump hasn't done anything for GOP to campaign on. Here come the anti-trans ads.",
  "description": "While the Trump administration has successfully targeted trans people, they're currently failing at everything from the economy to health care.",
  "content": "Once again, Republicans are attacking trans people to make up for the fact that they haven’t actually accomplished anything during the first few months of President Donald Trump’s second term.\n\nAfter former North Carolina Gov. Roy Cooper announced that he would be running for U.S. Senate, the conservative Senate Leadership Fund released an ad attacking his previous support of trans people, including his vetoes on legislation that served to keep transgender women and girls out of women’s sports.\n\nBesides the fact that there is absolutely nothing wrong with supporting trans people, the ad is clearly a ploy to distract from the very real damage Republicans are doing to this country.\n\nThey have no wins to campaign off. They have cut Medicaid, increased the cost of living and failed to quell foreign tensions. Life has not improved under Republican leadership, and the party knows this. It’s why the GOP would rather attack vulnerable people like those in the trans community instead of running on positive things the party has done.\n\nTrump presidency is a joke, so Republicans resort to scare tactics\n\nCooper isn't the only Democratic candidate being attacked for treating trans people as human beings.\n\nIn an ad for Republican Rep. Buddy Carter’s senatorial campaign in Georgia, a man with stubble in a wig and a dress complains about Carter’s anti-trans policies before driving off in a car with a bumper sticker for Sen. Jon Ossoff, D-Georgia.\n\nVirginia Democratic gubernatorial candidate Abigail Spanberger has been targeted by Republican opponent Winsome Earle-Sears for supporting trans women in sports.\n\nIf it sounds familiar, that’s because it is. In 2024, millions of dollars were spent on ads going after Democratic presidential nominee Kamala Harris’ record on trans rights, announcing that she was for “they/them” as well. The advertisement is just as corny now as it was then. But it worked because Republicans seemed to be deathly afraid of pronouns.\n\nThese ads, however, have come with very real repercussions. Trans people have been erased from the federal government; they have had their legacy removed from the Stonewall National Monument and their right to accurate markers on their passports taken away. They have been attacked for playing sports according to their gender and have had their health care threatened.\n\nIn fact, I’d argue that one of the only things Trump has accomplished during his presidency is the vilification of trans people, which is leading to declining support for the community among the U.S. population. Again, it’s not as if he’s made groceries or health care more affordable. Casting trans people as the enemy remains the only thing Republicans can point to for any proof of success, despite being in charge of the entire federal government.\n\nWhile the Trump administration has successfully targeted trans people, they're failing at everything else. Nearly 10 million Americans are about to lose health insurance over the next decade thanks to the appropriations bill. More hospitals in rural areas are expected to close. Tariffs are expected to cost families $2,400 this year, according to the Yale Budget Lab. Unemployment is on the rise.\n\nBasically, nothing is going as planned, and MAGA politicians realize that targeting trans people is an easy way to rile up their base.\n\nDemocrats like Newsom, Buttigieg have wrong approach on trans issues\n\nThere are always going to be trans people in the South, from metropolitan areas to rural communities. The same goes for the rest of the country. These ads only serve to make the lives of these trans people more difficult. Perhaps that’s the point: Republicans would rather see an entire marginalized group suffer than simply leave them alone.\n\nIt’s a mistake for Democrats to stay quiet on trans issues, or turn their backs on trans people, as presidential hopefuls California Gov. Gavin Newsom and Pete Buttigieg have done. Even though the battle for trans rights is not widely understood, the morally right thing to do would be to support trans people in their efforts to live as their authentic selves.\n\nAt the very least, Democrats should point out that Republicans are using this as a distraction from the fact that they are actively hurting their constituents by cutting Medicaid and shutting down government services.\n\nTrans people are not the ones taking your benefits away or shutting down rural hospitals. They aren’t responsible for the tariffs that are raising the cost of goods. That’s all Republican lawmakers.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/picture-gallery/news/politics/2025/02/14/stonewall-inn-protest-transgender-national-parks-services-webpage/78648215007/",
    "https://puzzles.usatoday.com/",
    "https://budgetlab.yale.edu/research/state-us-tariffs-august-7-2025",
    "https://www.axios.com/2025/07/23/roy-cooper-run-north-carolina-senate-democrat",
    "https://www.usatoday.com/story/opinion/columnist/2025/07/19/trump-immigration-medicaid-cuts-economy-failure/85259690007/",
    "https://www.youtube.com/watch?v=oGHRv7_TWdE",
    "https://www.usatoday.com/story/opinion/columnist/2025/08/01/roy-cooper-north-carolina-senate-bid-democrats/85439340007/",
    "https://www.usatoday.com/story/opinion/columnist/2024/10/22/trump-republicans-anti-trans-campaign-ads-election/75778060007/",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.cnn.com/2025/08/09/politics/republicans-anti-transgender-ads",
    "https://x.com/sara__pequeno",
    "https://www.latimes.com/california/story/2025-04-01/newsom-says-his-comments-about-trans-athletes-werent-some-grand-design",
    "https://www.them.us/story/pete-buttigieg-trans-athletes-parents-sports-fairness",
    "https://wjla.com/news/local/winsome-earle-sears-abigail-spanberger-virginia-lt-governor-race-politics-local-political-news-differ-transgender-sports-bathroom-policies-school-choice-lgbtq-youth-minors-medical-hormone-nova-doe",
    "https://www.usatoday.com/news/politics/kamala-harris/",
    "https://www.pewresearch.org/short-reads/2025/02/26/americans-have-grown-more-supportive-of-restrictions-for-trans-people-in-recent-years/",
    "https://www.nbcnews.com/politics/2026-election/republicans-focus-trans-athletes-early-attacks-jon-ossoff-georgia-rcna211005",
    "https://www.usatoday.com/story/opinion/voices/2025/08/07/parent-trans-kids-gender-affirming-care-trump/85428839007/",
    "https://www.usatoday.com/story/opinion/columnist/2025/02/23/trump-nps-stonewall-national-monument-transgender/79196135007/",
    "https://www.npr.org/2025/06/30/nx-s1-5451401/republicans-big-bill-could-hit-rural-hospitals-hard",
    "https://www.usatoday.com/story/money/2025/08/11/millions-will-lose-medicaid-trump-tax-law/85514650007/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trans people",
      "weight": 0.12388055
    },
    {
      "name": "trans people",
      "weight": 0.12388055
    },
    {
      "name": "trans rights",
      "weight": 0.10325679
    },
    {
      "name": "trans women",
      "weight": 0.102462806
    },
    {
      "name": "trans issues",
      "weight": 0.100439265
    },
    {
      "name": "vulnerable people",
      "weight": 0.083391525
    },
    {
      "name": "these trans people",
      "weight": 0.06569758
    },
    {
      "name": "the anti-trans ads",
      "weight": 0.0644037
    },
    {
      "name": "Republicans",
      "weight": 0.06310138
    },
    {
      "name": "Carter’s anti-trans policies",
      "weight": 0.061573546
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    },
    {
      "name": "LGBTQ"
    },
    {
      "name": "GOP"
    },
    {
      "name": "Social Issues"
    },
    {
      "name": "Trans Rights"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98291015625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.849609375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.6767578125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.66064453125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.56005859375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.4931640625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.417724609375
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.363525390625
    }
  ],
  "sentiment": {
    "positive": 0.037068408,
    "negative": 0.8062187,
    "neutral": 0.15671292
  },
  "summary": "The anti-trans ads have been used to distract from the Republican Party's lack of achievements in President Donald Trump's second term. The Senate Leadership Fund has released an ad attacking former North Carolina Gov. Roy Cooper's support of trans people, including vetoes on legislation that restricts transgender women and girls from women's sports. This is not the first time the GOP has attacked trans people; they have cut Medicaid, increased the cost of living, and failed to quell foreign tensions. These attacks have come with real consequences, as trans people have been erased from the federal government and had their legacy removed from the Stonewall National Monument and their right to accurate passport markers threatened. Despite this, Democrats should support trans people in their efforts to live as their authentic selves.",
  "shortSummary": "Republicans are increasingly attacking trans people to distract from the real damage caused by President Donald Trump's presidency, which includes Medicaid cuts and healthcare reforms.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "645fd1cb03fc44438b033d27758e8c10",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nbcnews.com/politics/2026-election/republicans-focus-trans-athletes-early-attacks-jon-ossoff-georgia-rcna211005",
      "text": "In the early stages of the campaign, Republicans seeking to unseat Georgia Sen. Jon Ossoff in one of the key races of the 2026 midterm elections are leaning heavily into attacks over transgender athletes in women’s sports.\nTwo GOP-aligned groups launched ads on the issue in recent weeks. And GOP Rep. Buddy Carter hit the airwaves with an ad prodding Ossoff on the issue soon after launching his campaign.\nRepublican candidates and campaigns have frequently leaned on culture war issues in recent years as a way to excite the base and frame Democrats as out of touch, particularly in red-leaning states. And they’re even more emboldened after President Donald Trump bombarded then-Vice President Kamala Harris with an onslaught of ads that attacked her support for transgender people during the 2024 election.\nBut while Democrats are gearing up for a difficult re-election fight for Ossoff in a state Trump won narrowly in 2024, they think the issue will be drowned out by voters’ concerns about the economy, particularly Trump’s handling of it. Even so, it's an issue for which Democrats lack a consensus about how to respond to GOP broadsides, as prominent members of the party grapple with whether to embrace protecting the transgender community as part of their values, deflect the question, or come out against including transgender athletes in women's sports.\nOssoff is the only Democratic incumbent defending a seat in a state Trump won last year, making him far-and-away the top target for Senate Republicans. Still, some Republicans admit that Ossoff will be difficult to beat, particularly now that Gov. Brian Kemp decided not to seek the seat.\nThe early Republican criticism of Ossoff points to the Democratic senator's vote against legislation in February that would make it a Title IX violation (jeopardizing federal education funding) for states to allow transgender women and girls to participate in female sports. The bill failed to get the 60 votes it needed to advance in the Senate.\nOne Nation, the nonprofit aligned with Senate Republicans' main super PAC, has spent at least $400,000 airing an ad reminiscent of a key tagline from one of Trump’s anti-Harris ads from last year: “Man-to-man defense isn’t woke enough for Ossoff, he’s playing for they/them.”\nCarter’s opening salvo of ads included a spot touting the congressman’s MAGA credentials while a person purporting to be a transgender woman holds sports trophies and stands in front of a transgender pride flag talking about how Ossoff has been an ally to the community.\nAsked about the GOP criticism of that vote, Ossoff campaign communications director Ellie Dougherty told NBC News in a statement that “American parents don’t need federal bureaucrats confirming our children’s genitalia,” a reference to how a state might enforce the mandate in the Republican bill.\nScott Paradise, who managed Republican Herschel Walker’s losing Senate campaign in 2022, told NBC News that Ossoff’s first Senate run in 2020 provided a “perfect storm” that allowed Ossoff to position himself as a “centrist” by narrowing his focus to “bread-and-butter issues.”\n“If he’s talking about the economy or he’s talking about moments where he has stood with the right — whether it's Middle East, to the extent he has on immigration — it’s easier for him to muddy the waters. But this is such a black-and-white issue in a center-right state” that allows Republicans to try to frame him as out of step, Paradise said.\nPolling broadly shows the American public doesn’t support transgender women playing in female sports. Last month’s NBC News Stay Tuned Poll, powered by SurveyMonkey found that 75% opposed it and 25% supported it. Other national polling has found similar trends.\nThat’s one reason why Trump’s campaign focused heavily on the issue in ads, arguing that Harris was outside the mainstream and pointing to her past support for gender-affirming treatments for prison inmates. After the election, Democrats have disagreed over whether the party’s position on transgender rights, particularly in women’s sports, cost them electorally.\nAsked about the attacks last month during an interview on \"Political Breakfast,\" a podcast hosted by Georgia's public radio affiliate, Ossoff said the big early spending is a signal to him that \"demonstrates the national GOP understands the strength that I'll be bringing to this re-election campaign.\"\nThe Democrat called Republicans, particularly GOP political consultants, \"obsessed and preoccupied with this issue.\"\nThinking ahead about \"top of mind\" issues for voters in 2026, Ossoff added, will it be \"whether or not federal bureaucrats are investigating the sexual biology of adolescent athletes? I don’t think so,\" he added.\nAmy Morton, a Democratic strategist in Georgia, elaborated that she believes the midterms will instead be a \"referendum on the economy\" and Trump's handling of it, emphasizing the Democratic attacks on the GOP's broad policy bill that's working its way through Congress.\n\"They're going to continue to lean into that issue because they don't want to talk about the issues that are really impacting Georgians,\" she said, adding, \"They made a strategic decision to wrap their arms around Donald Trump so there won't be a degree of separation between his failure as an executive and their failure.\"\nA Democratic strategist who worked on Sen. Raphael Warnock's successful re-election in Georgia in 2022 added that, like their former boss, Ossoff's high-profile elections have helped to define him in the state, making them skeptical that a GOP attempt to brand him as extreme will stick. They added that while Warnock's 2022 Republican opponent, Herschel Walker, leaned heavily on social issues during his unsuccessful bid, Kemp won comfortably with a very different message on the same ballot, showing how a campaign can focus on the issues it wants and leave others to the side.\n\"You saw Brian Kemp run an extremely disciplined race on the economy. You were hard-pressed to get Kemp on the record about abortion in 2022 — the man was laser-focused on small businesses, jobs and the economy. That was the consistent message you heard out of Brian Kemp. You compare that to Herschel Walker and, you can do the math: 300,000 votes,\" the Democrat said.\nBut the economy was also a top issue in the 2024 election, and Trump and the Republican Party still managed to turn their attacks on trans issues into a memorable tagline that stuck with some voters. That's why one national Republican strategist told NBC News that the attack isn't a \"replacement\" for a cogent economic argument, but \"part of the equation.\"\n“It’s an issue that obviously had a massive impact in 2024. The Trump campaign’s ‘Harris is for they/them’ ad is one of the greatest ads of our generation in that it’s so simple and was so effective,” the strategist said.\nAds about transgender participants in women's sports can run \"on top of: Oh, he also voted to help ensure that illegal immigrants get government-paid health care and he voted against the Laken Riley amendment in 2024 before it was convenient,\" the strategist added.\nWhile the transgender sports attacks are drawing headlines, both sides have been running ads focused on spending in Washington, too. Democrats have attacked the GOP’s policy bill working its way through Washington, and Republicans hit Ossoff for backing former President Joe Biden’s signature spending bill in 2022.\nTharon Johnson, a Georgia Democratic strategist who worked for Biden's 2020 campaign in the state, agreed that Republicans are \"going to be hard-pressed to make Jon Ossoff into this radical,\" in part because of his work both in office and on the campaign trail.\nAnd while he believes the situation Harris found herself in last year isn't the same one Ossoff finds himself in now, he said Democrats can still draw a lesson from it: \"Respond sooner, and more effectively.\"\nSo far, Ossoff's response has been to stay focused on the economy and try to frame the debate as about local control."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/19/trump-immigration-medicaid-cuts-economy-failure/85259690007/",
      "text": "Trump keeps brutalizing immigrants because he's failing at everything else | Opinion\nThe Trump administration is busy producing smoke and mirrors to pacify its Republican base by targeting immigrants while failing to improve the lives of the working class.\nThere seems to be no end to President Donald Trump's and Republicans' cruelty, but don’t be fooled: it’s all a distraction.\nThe reports coming out of Alligator Alcatraz, the immigration detention center built in the Florida Everglades, are harrowing. Detainees in the center have reported overflowing toilets, lights on through the night and dismal meals.\n\"This place needs to be shut the hell down,\" Rep. Debbie Wasserman Schultz, D-Florida, said on a press call with the Naples Daily News and other outlets.\nAccording to a report from The New York Times, only about 60% of the detainees have criminal convictions. That means 40% did nothing wrong. The facility currently houses about 900 men sleeping in tents.\nAlligator Alcatraz is a cruel reminder that Trump will do whatever he wants to vulnerable populations in the United States, and only a few Democrats seem willing to call him out on it. It’s also cruel for a reason: to appease the MAGA base and keep them from realizing that Trump isn’t making good on any of his other promises. And never forget that none of this would be happening if not for Republican support.\nTrump continues to fail us on the economy\nTake the economy, for example. Trump campaigned on a promise that he would make it easier for the average family to afford the cost of living, only for his tariff plan and cuts to federal funding to send the economy into a tizzy.\nThe “Big Beautiful Bill,” Trump’s fiscal agenda, is projected to harm working-class families because of cuts to Medicaid and SNAP benefits. His tariff agenda is leading to an increase in inflation and consumer prices, something that will ultimately cost the average American household at least $1,000.\nPolling on Trump's handling of the economy has consistently been negative, according to Gallup. While it improved slightly in June, it's still much lower than the economic confidence during Trump's first term.\nGoing after immigrants does nothing to solve the unfolding economic crisis in our country. In fact, the pursuit of the Trump administration’s strict immigration agenda is likely to harm the economy, thanks to the way it is affecting businesses that rely on undocumented labor. But Trump hopes you don’t notice that, and Republicans know this was never about improving an economy that was already thriving in a global market.\nAmerica's foreign policy is a global joke. US is no longer a force for good.\nForeign relations are another area where Trump is failing – likely because he was making promises he couldn’t keep.\nHe claimed he would end the wars in Ukraine and Gaza – only for both conflicts to continue. He claimed there would be no wars under his leadership, then conducted airstrikes in Iran and nearly plunged the United States into another war. New reporting suggests his bragadocious messaging after those Iran strikes was nonsense.\nHe's just now realizing that Russian leader Vladimir Putin can't be trusted, and has finally decided to help Ukraine. Other countries are no longer seeing America as a force for good, according to Ipsos polling over the last six months. Pew Research Center polling shows a lack of confidence in Trump's international leadership abilities.\nHe threatened to annex Greenland and Canada – things that there was no way he’d be able to achieve. He has damaged relationships with allies due to his tariffs and ambitious plans, making the United States an international laughingstock and causing tourism to the country to plummet.\nBut sure, let's brutalize immigrants.\nThe Epstein files mess is engulfing the Trump administration\nOr consider the Jeffrey Epstein files, which have become a source of contention for the MAGA movement. Back in February, Attorney General Pam Bondi claimed the files existed and were sitting on her desk. Then, in July, she claimed there were no such files. Trump doubled down on this and demanded that everyone stop talking about Epstein, “somebody that nobody cares about.”\nAt first, this led to a huge backlash among MAGA supporters and conspiracy theorists who wanted answers. Right-wing personality Laura Loomer said in a July 16 interview that this could “consume” the presidency in the same way Trump’s ties to Russia did during his first term. Other pundits, like Turning Point USA founder Charlie Kirk, have dropped the conversation altogether.\nBut Trump really, really doesn’t want you to focus on the fact that he said he wanted to declassify the Epstein files on the campaign trail. It’s best if you just focus on the immigrants who are being treated no better than livestock. After all, Trump says they’re the root of the problem in this country, and we should believe that, right?\nIn all seriousness, the cruelty is not the point for a Republican Party that is both successful in pushing its agenda and failing in convincing Americans it's worth pushing. The Trump administration is busy producing smoke and mirrors to pacify its political base by targeting immigrants while failing to improve the lives of the working class. The needless meanness is merely a comforting distraction for an entire political party that can't be bothered to actually help Americans.\nFollow USA TODAY columnist Sara Pequeño on X, formerly Twitter, @sara__pequeno"
    },
    {
      "url": "https://wjla.com/news/local/winsome-earle-sears-abigail-spanberger-virginia-lt-governor-race-politics-local-political-news-differ-transgender-sports-bathroom-policies-school-choice-lgbtq-youth-minors-medical-hormone-nova-doe",
      "text": "WASHINGTON (7News) — Virginia Republican Lt. Governor Winsome Earle-Sears said state school districts should end their current transgender and non-binary bathroom and locker room policies.\nIf they don’t and she gets elected, Earle-Sears said that she will sign legislation requiring public schools to have girls-only and boys-only private spaces and ban biological males from competing in girls' sports.\nSEE ALSO | DOE: Virginia schools now have until Aug. 15 to end trans, non-binary locker room policies\n“It's common sense,” said Earle-Sears.\nSeveral Virginia school districts have policies that allow students to access bathrooms and locker rooms at school based on their chosen gender identity and not their biological sex, including Fairfax County Public Schools, Loudoun County Public Schools, Arlington Public Schools, Alexandria City Public Schools, and Prince William County Public Schools.\nRELATED | 'I really fear for my son': Family leaves Loudoun Co. after LCPS locker room investigation\nEarle-Sears said it is policies like those that underscore why some Virginians are fighting for school choice in an interview with 7News.\n“That's why parents are saying, you know what, give us our tax money and let us make the decision on where to send our children to school,” Earle-Sears told 7News. “So, whether that's private school, public school, parochial school, home school, a hybrid, whatever it is, let us make that decision. Because if you want to have policies that are going to pit me against my child, you go ahead government, do that, but you're not going to do it with my child. I'm going to take my money and find a place where my child will be safe. That's what this is about. And my opponent, she supports these rogue schools and that means she’s against parents.”\n“What we are creating in our girl children, especially, I believe, is trauma, trauma that eventually, it's going to affect them if it hasn't already, and parents don't need one more problem that the government has created for their children,” Earle-Sears said regarding school district policies that allow biological males to use biological female spaces.\nALSO READ | US Dept. of Education: Va. schools' transgender bathroom policies are violating Title IX\nLast week, the U.S. Department of Education (DOE) concluded that Alexandria City Public Schools, Arlington Public Schools, Prince William County Public Schools, Fairfax County Public Schools, and Loudoun County Public Schools’ bathroom and locker room policies violate Title IX.\nThe five northern Virginia school districts now have until August 15th to respond to the DOE’s demands that the school districts reverse their existing transgender and non-binary bathroom and locker room policies that allow students the option to use school bathrooms and locker rooms based on gender identity, and not their biological sex, a senior DOE official told 7News.\n7News asked Democratic gubernatorial candidate Abigail Spanberger’s campaign if she would weigh in on the bathroom and locker room issue and does she supports biological males competing in women’s sports. These are the specific questions 7News emailed Spanberger’s campaign on Thursday:\nSpanberger’s campaign did not answer those questions directly, but sent a statement that said, “Abigail is a mom of three kids in Virginia public schools — the safety of Virginia’s kids is Abigail’s top priority, and she believes that parents have the right to make decisions about what is best for their children.”\nIn 2022, when Virginia Gov. Glenn Youngkin announced his model policy to block student access to locker rooms and bathrooms that don’t match their biological sex, Spanberger wrote, “Gov. Youngkin’s mandate targets vulnerable children, and it’s downright shameful to think that an elected leader would punch down at kids to score political points. This mandate rolls back the rights of kids to be themselves in schools.”\nIn 2023, Spanberger also voted in favor of allowing biological males to compete in women’s sports."
    },
    {
      "url": "https://www.pewresearch.org/short-reads/2025/02/26/americans-have-grown-more-supportive-of-restrictions-for-trans-people-in-recent-years/",
      "text": "Since taking office, President Donald Trump has signed several executive orders related to transgender people. These have included orders banning trans women and girls from women’s sports and ending federal funding for health care related to gender transitions for youth.\nA new Pew Research Center survey finds that majorities of U.S. adults favor or strongly favor laws and policies that:\n- Require trans athletes to compete on teams that match their sex assigned at birth (66%)\n- Ban health care professionals from providing care related to gender transitions for minors (56%)\nAt the same time, 56% of adults express support for policies aimed at protecting trans people from discrimination in jobs, housing and public spaces.\nViews on these policies and several others have shifted in recent years, with Americans becoming more supportive of restrictions for transgender people, according to the survey of 5,097 U.S. adults conducted Feb. 10-17, 2025.\nThe survey also finds that more Americans support than oppose laws and policies that:\n- Require trans people to use public bathrooms that match their sex at birth, rather than the gender they identify with (49% favor or strongly favor, 26% oppose or strongly oppose)\n- Make it illegal for public school districts to teach about gender identity in elementary schools (47% favor or strongly favor, 34% oppose or strongly oppose)\nIn turn, adults are much more likely to oppose than favor policies requiring health insurance companies to cover medical care for gender transitions (53% vs. 22%).\nHow Americans’ views of transgender issues have changed in recent years\nCompared with 2022, Americans have become more supportive of laws that limit protections for trans people – and less supportive of laws aimed at safeguarding them.\nMore Americans now say they favor or strongly favor laws and policies that:\n- Ban health care professionals from providing care related to gender transitions for minors (up 10 percentage points)\n- Require trans athletes to compete on teams that match their sex at birth (up 8 points)\n- Require trans people to use public bathrooms that match their sex at birth (up 8 points)\n- Make it illegal for public school districts to teach about gender identity in elementary schools (up 6 points)\nAt the same time, fewer Americans now express support for laws and policies that:\n- Protect trans people from discrimination (down 8 points since 2022)\n- Require health insurance companies to cover medical care for gender transitions (down 5 points)\nThese shifts reflect changing views among both Republicans and Democrats. For example, 79% of Republicans now support making it illegal for health care professionals to provide medical care for a gender transition for minors. This compares with 72% in 2022. On the same question, 35% of Democrats now express support, up from 26% in 2022. (These figures include independents who identify with or lean toward each party.)\nAs was the case in 2022, there are wide partisan gaps in views of trans issues. Republicans are much more likely than Democrats to express support for policies that limit protections for trans people (by margins of 43 to 50 points). In turn, Democrats are much more likely than Republicans to support policies that safeguard trans people (by margins of more than 30 points).\nNote: Here are the questions used for this analysis, the topline and the survey methodology."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/voices/2025/08/07/parent-trans-kids-gender-affirming-care-trump/85428839007/",
      "text": "I'm raising a transgender son. My child is not a threat. | Opinion\nFamilies like mine are now caught in the middle of a national debate on schools, bathrooms, sports and medical care. My son is not a threat. He's a child doing his best to feel normal and included.\nThe first time my child told me he didn’t feel like a girl, he was 6 years old. To be honest, I didn’t take it seriously.\nBack then, the world saw him as my daughter. He wore dresses, had long curls and loved pink. And he was always imaginative – not long before, he insisted he was a tiger, crawling on all fours and refusing to use forks. So, when he said he wanted to be a boy, I thought: OK, another phase.\nBut this one didn’t pass like the others.\nSoon, he stopped reaching for dresses and started pulling clothes from his brother’s drawers. And he began introducing himself with a new, masculine name to friends, neighbors, even strangers.\nI was hesitant. I’d always taken pride in being a woman and hoped my child would grow up feeling that same strength. But the more I pushed, the more he pulled away. His easy smile faded. His laugh, once constant, became rare. I didn’t know what to do.\nJust past his seventh birthday, the school asked us in for a meeting. We were surprised to learn he’d been telling his teacher and classmates he didn’t feel like a girl. His teacher had tried to be supportive, but the administration told us they couldn’t allow this to continue.\nI left that meeting and cried. For the first time, I let myself really hear what my child had been saying over and over, to anyone who would listen: “I’m not a girl.” This wasn’t pretend play or a passing phase. It was something deeper – something steady and persistent. At that moment, I stopped trying to explain it away. I didn’t fully understand it, but I could no longer deny that he was telling us something real.\n2024 election thrust families like mine into middle of national debate\nWe started listening more. We talked as a family. We found a therapist. We read books. A year later, he came to us and said, “I think I’m a boy.” Not dramatically. Not defiantly. Just simply, like a truth he’d finally found words for.\nA little later, we moved to a new community, where at school they called him by the name he chose and treated him with kindness. He made friends. He joined the local Little League team. And we met other families with kids like ours and found comfort in their stories – the shared struggles, and the relief of knowing we weren’t alone.\nHe started smiling again. He talked about his future. We felt more at peace as a family.\nThen came the 2024 election, and suddenly families like mine were caught in the middle of a national debate on schools, bathrooms, sports and access to medical care.\nI understand the questions, concerns and fears that many people have – I had a lot of them myself. But what I’ve come to see is that my son, like other transgender kids, isn’t trying to cause trouble or make anyone uncomfortable. He just wants to use the bathroom, play sports, find his way and be treated like any other kid.\nHe’s not a threat – he’s a child doing his best to feel normal and included. The care he’s received hasn’t been extreme or rushed. It’s been thoughtful, deliberate and grounded in decades of research.\nTrump administration is cutting off lifesaving care\nThese days, I’m scared. Not because I think we may have made the wrong choice – the way he’s thrived since we accepted his truth has been obvious. What scares me is the growing push to take these decisions away from families – to make schools less safe and welcoming, to block treatment that’s helped him grow and heal and to treat parents like us as if we’re not capable of knowing what our own children need, even in blue states.\nThe current administration is working toward prohibiting parents like me from caring for our children. Rather than listening to stories like ours and recognizing the journey we’ve taken to educate ourselves and coming out on the side of support, they are asking Americans to make knee-jerk decisions and shut off access to truly lifesaving care.\nTransgender kids who don’t get to live as themselves are more likely to end up depressed, not to finish school or even to take their own lives.\nI never imagined I’d be raising a transgender son. To be honest, sometimes I still miss my baby girl. But you don’t parent the kids you imagined – you parent the kids you get. Like with any child, that means showing up with love, acceptance and, yes, boundaries.\nI’ve learned you don’t have to understand everything about gender to understand when a child tells you who they are. All you have to know is what it means to love a child so deeply, you’d do anything to help them be whole.\nSara Madera is a career coach for working moms and the parent to a transgender kid."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2024/10/22/trump-republicans-anti-trans-campaign-ads-election/75778060007/",
      "text": "Opinion: Trump's latest campaign ads attack trans people. Why is Harris still silent?\nThe GOP will continue spreading hatred of transgender people on the road to Election Day. The left can't keep pretending the issue doesn't exist.\nDonald Trump is using the final days of the campaign to exploit fears about yet another group of people.\nThe Republican presidential nominee's campaign has spent at least $17 million on ads about Vice President Kamala Harris for a 2019 stance on providing trans-affirming health care to people in prison. The issue has not been part of her 2024 campaign, although she was questioned about it in a recent Fox News interview. These anti-trans ads have aired more than 30,000 times.\n“Kamala is for they/them,” one ad reads. “Trump is for you.”\nThe Republicans are no strangers to using a marginalized group of people to stoke fear. We’ve seen how they talk about immigrants in dehumanizing ways. The trans panic talking points are just more hate.\nThe GOP will continue spreading hatred of transgender people on the road to Election Day. The left can’t keep pretending the issue doesn't exist. It's a good opportunity for Democrats to win voters, like the 38% who told Gallup that transgender rights are \"extremely important\" or \"very important\" when making their decision in this election. It might win over a few voters, but that's what it will take to win this election.\nWill Democrats find the right messaging to combat GOP hate?\nI asked Imara Jones, CEO of the news site TransLash, whether she thought these attacks resonated with voters. The award-winning media outlet shares stories about transgender and gender-nonconforming people. Jones explained that the anti-trans ads could be used to win over suburban white women who were initially fans of Republican former South Carolina Gov. Nikki Haley.\n“They understand this as a way to eke out close elections, right?” Jones told me. “It’s designed to get one or two votes per precinct in key states.”\nOpinion: Melania Trump says she supports abortion rights. Don't forget what her husband did.\nIn an election this close, less than a handful of votes could make a difference. Jones noted that while Democrats have not found the right messaging for trans issues, not having an answer at all creates a vulnerability that the Republicans can exploit.\n“Campaigns don’t normally let attacks go unanswered,” she said. “And so far, there hasn’t been one.”\nHarris campaign has touched on the issue through Walz\nDemocrats have – briefly – talked about transgender issues on the campaign trail. When asked about her 2019 stance on trans health care by Fox News’ Bret Baier, Harris said she would follow the law and called the issue “really quite remote.”\nHer running mate, Minnesota Gov. Tim Walz, recently delivered a stronger stance on the issue.\nOpinion: Trump said so many stupid things this week, I decided to just round them up\n“The closing arguments for Donald Trump is to demonize a group of people for being who they are,” Walz said on the podcast \"We Can Do Hard Things\" last week. “We’re out there trying to make the case that access to health care, and a clean environment and manufacturing jobs, and keeping your local hospital open ‒ those are things that people are really concerned about.”\nTruth be told, that’s the message Democrats should run with. It is the simplest message that appeases most people while still taking a stand for someone’s humanity.\nDemocrats still have time to turn this into a win before Election Day\nAnti-trans ads are only grabbing a marginal number of voters, but this is a presidential race that will be decided on razor-thin margins. Some campaigns have already had to respond to anti-trans attack ads from Republicans.\nRep. Colin Allred, a Texas Democrat running to unseat Sen. Ted Cruz, responded to this line of attack by releasing an ad claiming, “I don’t want boys playing girls sports.” It’s unclear whether this means he supports trans girls playing on girls’ sports teams.\nIt makes sense that Democrats have some anxiety about this issue. According to Gallup, 69% of Americans believe trans athletes should only be allowed to play on teams that correspond with the gender they were assigned at birth. Democrats always run the risk of isolating more moderate members of the party if they take a clear stance against these transphobic attacks.\nWe’re also incredibly close to the election, and Harris’ team probably thinks there are other communities worth targeting with such little time left.\nEven so, the Democratic Party could win over reluctant voters who don’t see themselves or the ones they love protected by either party. Even just a point on its campaign platform page would be a step in the right direction. More important, it would show Republicans that they can’t just attack a group of people without repercussions.\nRepublicans are using fear and bigotry to drive voters to the polls. Democrats may not win on the issue, but an official stance is important.\nFollow USA TODAY elections columnist Sara Pequeño on X, formerly Twitter: @sara__pequeno"
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/02/23/trump-nps-stonewall-national-monument-transgender/79196135007/",
      "text": "Trump is trying to remove trans people from Stonewall's legacy. That's impossible. | Opinion\nIn their crusade against 'transgender insanity,' the Trump administration is now going so far as to rewrite history. Future tourists who visit Stonewall will see a version that is far from the truth.\nI stood outside the Christopher Street subway entrance in New York City last week and noted my surroundings: a Starbucks, a Chase Bank and a set of bars. A triangular strip of fenced grass lined with park benches was across the street from where I stood. A defaced sign on that entrance now read, “Stonewall National TRANSGENDER Monument.”\nThe graffiti was left over from Valentine’s Day, the day after the National Park Service removed the words “transgender” and “queer” from the Stonewall National Monument website.\n“Before the 1960s, almost everything about living openly as a lesbian, gay, bisexual (LGB) person was illegal,” the monument’s website now reads, using an acronym often associated with the trans-exclusionary radical feminist (TERF) movement. “The Stonewall Uprising on June 28, 1969 is a milestone in the quest for LGB civil rights and provided momentum for a movement.”\nThe website change is the latest in the Trump administration’s full-out attack on the transgender community. It has also included blocking gender-affirming care for people under 19, barring trans women from competing in women’s sports, banning trans people from serving in the military and declaring that the United States would only recognize two genders, male and female.\nIn their crusade against \"transgender insanity,\" the Trump administration is now going so far as to rewrite history. Future tourists who visit Stonewall will see a different version of the monument that I saw last week: a whitewashed version of what really happened, a version that is far from the truth. And while the LGBTQ+ community is responding with protest and resilience, there’s an ever-present dread about what’s to come.\nTrump and Republicans want to erase the Stonewall Uprising\nThe Stonewall National Monument Visitor Center, which opened in 2024, does not agree with the Trump administration’s decision.\nIn the window was a fan that read “trans and proud” next to a statement specifying that the nonprofit that runs the space is separate from the National Park Service.\n“Our space is inextricably linked with and honors the brave pioneers, especially trans and gender-nonconforming individuals, who led the Stonewall Rebellion,” the statement reads.\nSo, what is it that the Trump administration wants us to forget and Republicans are so afraid of?\nThe Stonewall Rebellion, sometimes called the Stonewall Uprising or the Stonewall riots, was a multiday revolt in 1969 that started with a police raid on the Stonewall Inn, a gay bar and safe place for gender-nonconforming people. Trans women played a vital role in that rebellion and would become icons of the pride movement.\nLGBTQ people are still under attack. Stonewall reminded me of how important our stories are.\nInside the visitor center was a completely open room sectioned off by activity. There was a film playing in the back with rows of chairs, a wall of information and photos, and an information desk/gift shop. There was a jukebox that is the same model as the one in the original bar. Beside the help desk is a Parsons art installation featuring a set of blank notebooks where visitors can tell their stories.\nI opened the one that asked, “When did you know?”\nI flipped through to read other stories – some short and to the point, some with words of encouragement, and none over a page long. Some people had replied to others, indicated by the various marker shades. A lot of people spoke about being gay, but a surprising number were talking about when the writer knew they were trans.\nDirectly across from the books was “The Stories of Stonewall,” detailing the history of the bar itself, Greenwich Village and the uprising. Toward the end was a section dedicated to the founders of Street Transvestites Action Revolutionaries (STAR), trans activists Marsha P. Johnson and Sylvia Rivera.\nA famous quote by Johnson, who was present at Stonewall, adorns the wall: “No pride for some of us without liberation for all of us.”\nIt's alarming that pride and liberation are still under attack 56 years later.\nRepublicans want to erase people like me. We won't let that happen.\nI walked out of the visitors center and around the park, looking at the display that is almost certain to change in the next few months. There's a card addressed to \"the darling trans community\" and a flower stuck behind a photo of Johnson. When I scan the QR code in the top left corner, it leads me to the trans-exclusionary version of the NPS website.\nThere were also signs that the Trump administration had not yet made its way to Christopher Park – a trans pride flag was still whipping around in the breeze, surrounded by smaller progress pride flags. None of the signs have been changed out that include the LGBTQ acronym.\nInside the park are a pair of statues depicting two same-sex couples, cast in bronze and painted white. Someone had placed pink and blue flower bouquets in the arms of the lesbian couple. I looked at the women and the wilted flowers for a minute. Transgender people are the reason that the Stonewall Uprising happened, the reason I am afforded rights as a queer woman today. Republicans would prefer if I forgot that, but then again, it sometimes seems like they'd prefer if all LGBTQ+ people disappeared.\nI finished my afternoon at the Stonewall Inn, the bar’s neon red sign inviting me in from the cold of the park. I walked into the sound of Cardi B’s “I Like It,” greeted by the bar’s dark wood paneling and twinkling multicolored fairy lights. A set of televisions displayed a crackling fire. Things were also business as usual: There was still a giant trans flag in the back of the room.\nThe bar isn’t the original; it was an assortment of things in the years following the uprising before opening as a gay bar called New Jimmy’s in 1990. It was renamed after the owner’s death from complications of of HIV/AIDS.\nI sat at the bar and thought about what I'd seen. My freedom to sit at this bar, or at any gay bar in New York, was won because of the trans people who rose up at Stonewall. We, as other members of the LGBTQ+ community, must find a way to support our trans brothers and sisters. We can't let them be erased from our history. We must remember the truth of what happened at Stonewall, and keep its spirit in mind as we continue to protest against the Trump administration.\nFollow USA TODAY columnist Sara Pequeño on X, formerly Twitter: @sara__pequeno"
    },
    {
      "url": "https://www.latimes.com/california/story/2025-04-01/newsom-says-his-comments-about-trans-athletes-werent-some-grand-design",
      "text": "Newsom says sharing his beliefs on trans athletes wasn’t ‘some grand design’\n- Share via\n- Gov. Gavin Newsom said his decision to share his belief that it’s unfair for transgender athletes to compete in women’s sports was unplanned during his podcast last month.\n- His comments boxed him in from the left and the right: Progressives accused him of abandoning the transgender community and conservatives pressured him to sign legislation banning transgender athletes from girls’ sports.\nAfter weeks of criticism from political allies, Gov. Gavin Newsom explained why he shared his belief that it’s unfair for transgender athletes to compete in women’s sports.\nNewsom, in a recent interview with The Times, said that although he had been deliberating over the issue for years, he didn’t set up the interview with conservative personality Charlie Kirk to express his views and break news on his podcast last month.\nThe governor said the moment happened organically after Kirk “pushed so hard” on the topic and referenced a California transgender high school athlete who beat their competitors by 8 feet in the triple jump.\n“And then asked me, ‘Tell me, that’s not fair?’ And I looked at him, I said, ‘You’re right. That’s not,’” Newsom said. “And so it wasn’t some grand design. And I know, I know that hurt a lot of people. But respectfully, I just disagree with those on the other side of this.”\nThe governor was referring to the political left. Progressives and advocates for the transgender community within his own party accused him of betraying a group that had supported his political rise.\nState Sen. Scott Wiener (D-San Francisco) said Newsom’s comments were “devastating and depressing” from someone who had been such an ally of the LGBTQ+ community. Newsom’s critics also accused him of flip-flopping. They pointed to his previous support for the California law signed by former Gov. Jerry Brown that allowed trans students to compete in sports and use bathrooms based on their gender preference.\nSome Democrats alleged that Newsom, whom many consider a future presidential contender, strategically abandoned a vulnerable group of people after Donald Trump and Republicans made the issue of trans athletes competing in women’s sports a liability for Democrats during the 2024 election.\nRepublicans immediately began pressuring Newsom to back state legislation to ban transgender athletes from participating in youth and collegiate sports. The governor has declined to take a position on the proposals, which are scheduled to be considered during a legislative committee hearing Tuesday.\n“This is stunning,” said Assemblymember Bill Essayli (R-Corona) on the social media site X. “Talk is cheap Gavin Newsom.”\nThe Democratic governor of California made the comments during an hourlong interview with conservative commentator Charlie Kirk, a loyal supporter of President Trump.\nIn an interview with The Times, Newsom said he’s “been struggling with this for some time.”\nHe said he and his aides had discussed and sought advice on how to find a balance when transgender athletes competing against women became an issue in California, including during controversy over San Jose State’s transgender volleyball player last year. He also referenced a situation in 2023 in which two trans athletes declined to compete in a California Interscholastic Federation state high school track and field finals competition after facing backlash for competing in girls sports.\n“I mean, we’ve been exploring this for a couple years quietly behind the scenes, and we ... couldn’t land,” Newsom said.\nThe governor touched on that introspection during his podcast with Kirk.\n“Completely fair on the issue of fairness. I completely agree. So that’s easy to call out the unfairness of that,” Newsom told Kirk. “There’s also a humility and grace that these poor people are more likely to commit suicide, have anxiety and depression, and the way that people talk down to vulnerable communities is an issue that I have a hard time with as well. So both things I can hold in my hand. How can we address this issue with the kind of decency that I think you know is inherent in you, but not always expressed on the issue?”\nThe governor went on tell Kirk that he had “stress-tested” this issue before commenting on the rarity of transgender athletes in the NCAA.\nIn an interview with The Times, Newsom pushed back on the idea that he could have shared his perspective during the 2024 election cycle and helped his party navigate an unpopular issue with voters. Two-thirds of Americans said trans athletes should be required to compete on teams that match their sex assigned at birth, according to a Pew Research survey in February.\n“I didn’t have a podcast,” Newsom said. “I wasn’t having that conversation. I was out there on the campaign trail in the big blue bubble, on the big blue bus, in the big blue crowds having big blue conversations.”\nDemocrats find themselves flummoxed by the contrast between the MAGA-friendly host Gov. Gavin Newsom appears to be on his podcast and his national image as a liberal prizefighter. Newsom said he was also surprised, but by the response from his critics and his friends.\nNewsom said parents at his kids soccer games have come up to him and shared their concerns about transgender athletes competing against girls in youth sports. They’re often Democrats, he said, good people who celebrate the gay community and aren’t “transphobic.”\nThe governor also defended his own record of support for the transgender community. He pointed to legislation he signed last year that prohibited school districts from requiring teachers to notify parents about gender identity preferences, which led to the federal investigation launched last week by the Trump administration. He also noted his 2022 appointment of the first openly transgender judge in the U.S., Andi Mudryk, to the Superior Court of Sacramento County.\nAlthough some people reached out individually and commended him, Newsom said some of his “most loyal friends” said they were shocked and were reevaluating their support for him.\n“I’ve had a solid, a solid record on a lot of issues, and for people to question, you know, to talk in disloyal terms, made me actually start to believe the critique from the right a little bit more,” Newsom said. “I always thought the right overstated how judgmental my party was, and I’ll be candid with you, I have a deeper understanding now of that critique than I ever, ever, ever understood.”"
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/08/01/roy-cooper-north-carolina-senate-bid-democrats/85439340007/",
      "text": "What if I told you there's a Democrat who can still get the Republican vote? | Opinion\nFormer NC Gov. Roy Cooper is already giving the national Democratic Party a masterclass in how to run a successful campaign in battleground states.\n- Former North Carolina Gov. Roy Cooper announced his candidacy for the U.S. Senate seat vacated by Thom Tillis.\n- Cooper has a strong track record, overseeing significant job growth and economic investment in North Carolina.\n- He championed Medicaid expansion, a key contrast with Republican efforts to cut the program.\n- Cooper's deep roots in North Carolina and populist message are resonating with voters.\n- He faces a tough challenge against Republican Michael Whatley but has shown early fundraising success.\nAfter months of speculation, former North Carolina Gov. Roy Cooper announced on July 28 that he would be running for the U.S. Senate seat being vacated by Sen. Thom Tillis. It’s only been a few days, but Cooper is already giving the national Democratic Party a masterclass in how to run a successful campaign in battleground states.\nCooper, who has never lost an election, has the popularity and experience needed to flip a seat for the Democrats, who haven’t won a U.S. Senate race in North Carolina since 2008. As a born and raised North Carolinian, I have seen these qualities firsthand.\nNorth Carolina has been MAGA country since 2016, when President Donald Trump first won the state. The past two U.S. Senate races were expensive and disappointing for Democrats. Within the state, partisan gerrymandering and a voter ID law make it harder for Democrats to win. While Cooper isn't the singular answer to slowing Republican dominance in the state, he is the first candidate in a long time who seems to have a fighting chance.\nRoy Cooper's economic track record is good for everybody\nNorth Carolina’s economy, once burdened by the decline of factory and agriculture jobs, thrived under Cooper’s leadership. During his two terms as governor, the state added more than 640,000 jobs from companies like Toyota, Apple and Eli Lilly.\nThe state was also ranked America’s Top State for Business by CNBC for two consecutive years based on economic investments, its workforce and the state’s debt management.\n“For too many Americans, the middle class feels like a distant dream,” Cooper says in the video announcing his campaign. “Meanwhile, the biggest corporations and the richest Americans have grabbed unimaginable wealth at your expense.”\nIf his first ad is any indication, the Senate candidate seems to be running on a populist message that is likely to resonate. It's a move that Democrats have been shy to make as they crumble under the MAGA reign, but it's a move that could fare well in a state dominated by Republicans.\nRepublicans cut Medicaid. Cooper expanded access for North Carolinians.\nA crowning achievement of Cooper’s tenure as governor is the state’s expansion of Medicaid in 2023, which brought coverage to an additional 600,000 North Carolinians. He fought for that expansion for years.\nConsidering that Medicaid is one of the things Republicans in Congress placed on the chopping block recently, Cooper’s hand in bringing access to more North Carolinians is sure to bode well for the former governor.\nDemocrats, again, could learn from this: It’s not enough to talk about social issues. Medicaid just got cut in the federal spending bill, and hundreds of thousands of North Carolinians will likely lose coverage, including those who benefited from Medicaid expansion.\nThis is an issue they can win on, and one that would show they care about what everyday Americans are facing.\nThe simplest reason? Roy Cooper's actually likable.\nCooper’s biggest draw, however, may be how deeply his roots are in the state. He grew up in Nash County and attended the University of North Carolina at Chapel Hill. He was a lawyer and Sunday School teacher in Rocky Mount before entering politics. He spent several Halloweens dressed up as Sheriff Andy Taylor from “The Andy Griffith Show.\" He’s taken other Democrats to Cook Out for fast foods on the campaign trail.\nHe’s such a North Carolinian, in fact, that I wondered if he’d ever take the plunge into national politics.\n“I never really wanted to go to Washington,” Cooper says in his announcement video. “I just wanted to serve the people of North Carolina right here, where I’ve lived all my life. But these are not ordinary times.”\nIt’s a reminder to the national Democratic Party that a quality candidate is also a candidate who loves where they’re from. A candidate with deep roots in the community is a candidate who can win elections. There’s still merit to the idea that a good candidate is someone you can imagine drinking a beer on the front porch with, especially in the South.\nCooper is clearly a promising candidate who could break through the Republican stronghold in a state that’s gone for Trump three elections in a row. But he'll face an uphill battle in the form of Republican National Committee Chairman Michael Whatley, who was selected by Trump.\nRepublicans are already on the attack, accusing the former governor of \"dragging North Carolina left,\" criticizing his vetoes and complaining that he competently handled the COVID-19 pandemic.\nStill, this is the same governor who got more votes than Trump in the 2020 election – his odds are better than one might expect for a purple state.\nCooper's finances are already showing the promise of his Senate campaign, as he raised $3.4 million in the first 24 hours, setting a fundraising record.\nIf people can get behind a liberal Democrat from rural North Carolina, imagine what would happen if there were candidates of this caliber in all battleground states.\nFollow USA TODAY columnist Sara Pequeño on X, formerly Twitter: @sara__pequeno"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/11/millions-will-lose-medicaid-trump-tax-law/85514650007/",
      "text": "Millions will lose Medicaid under Trump's tax law. Here's the final tally.\nAbout 10 million Americans are expected to lose health insurance under President Donald Trump's tax cut and spending law, the nonpartisan Congressional Budget Office said.\nOver the next decade, 7.5 million people will lose Medicaid coverage due to changes under the law, the CBO said in an analysis released Monday, Aug. 11. Nondisabled adults on Medicaid will be required to get a job, volunteer or enroll in school to maintain their Medicaid coverage. And states must double Medicaid eligibility checks to twice a year.\nAnother 2.1 million people will shed Affordable Care Act coverage over the next decade, the CBO said. And 400,000 more will lose coverage due to impacts of the law — nicknamed the One Big Beautiful Bill — which was backed by Congressional Republicans.\nThe CBO earlier said the legislation, which Trump signed on July 4, would add $3.4 trillion to the federal deficit. The law extends the 2017 tax cuts, ends taxes on tips and overtime, and bolsters border security, among other things.\nThe CBO also estimated poorer Americans — those earning less than $23,750 annually and who pay about $2,300 of that in federal taxes — will lose about $1,200 per year due to Medicaid changes and reductions in food assistance. Middle-income households are expected to gain $800 to $1,200. Meanwhile, the law's tax cuts will benefit wealthier Americans by about $13,600 per year. Those families, who earn more than $690,000 annually, still will pay nearly $200,000 in federal taxes annually, the CBO said.\nSabrina Corlette, co-director of Georgetown University's Center on Health Insurance Reforms, said the CBO report shows who benefits and who doesn't under the legislation.\n\"This is one of the most regressive pieces of legislation I've seen,\" said Corlette. \"The rich will get richer and the poor will get poorer.\"\nMillions more could lose their health insurance\nWhen the bill passed the Senate, the CBO estimated it would leave about 11.8 million Americans without health insurance through 2034. The law signed by Trump won't cut as deep because it excluded a provision that would've penalized states extending Medicaid to undocumented residents.\nStill, nearly 5 million could lose coverage if Congress doesn't extend the expiring COVID-19 pandemic-era tax credits that have made Affordable Care Act plans more affordable for consumers, according to earlier CBO estimates.\nConsumers who use those pandemic-era tax credits will see the amount they need to pay spike an average of more than 75%, according to KFF, a health policy nonprofit.\nThe combination of the tax law, expiring tax credits and overall rising medical costs will make insurance premiums more expensive for everyone. Insurers plan a median premium increase of 18% for 2026 plans, which would be the largest ACA insurance price hike since 2018, according to a Peterson-KFF Health System Tracker report released Aug. 6."
    },
    {
      "url": "https://www.them.us/story/pete-buttigieg-trans-athletes-parents-sports-fairness",
      "text": "Former Secretary of Transportation Pete Buttigieg reiterated his previous comments about transgender women athletes this week, saying that in order to “bring people together” on the issue, Democrats “need to take everyone seriously.”\nDuring an interview on Substack Live with attorney and political strategist Aaron Parnas, Buttigieg briefly followed up on comments he made to NPR last week saying that trans women in women’s sports raise “serious fairness issues” that should be handled by sports leagues and local communities rather than politicians. “[People are] wondering, ‘Wait a minute. I got a daughter in a sports league. Is she going to be competing with boys right now?’” Buttigieg told NPR in the course of his remarks. “[J]ust taking everybody seriously.”\nButtigieg’s statement to Parnas followed largely the same template. The perennial presidential hopeful started off by expressing compassion for trans people and their families who he said are “being used as a political football,” and criticized those on the right who he said used trans athletes to “divide [and] hurt.”\nButtigieg then, once again, appeared to legitimize the notion that it is unfair for a trans woman to compete with her cis peers. “I think in order to bring people together on this, we also have to take everyone seriously,” Buttigieg told a nodding Parnas, echoing his remarks on NPR. “[P]eople who have questions or wonder what this means [...] they’re going to have questions about how to make sure that’s fair, and we should take those questions seriously and face those together,” he continued, again reiterating his belief that those questions “should be handled by communities and by sports leagues, not politicians.”\nOne issue with Buttigieg’s framing, however, is that such “questions” are themselves shaped by Republican anti-trans propaganda, and are often significantly overblown. Though research into hormone replacement therapy (HRT)’s effects on athletic performance is still developing, a study published last year and funded by the International Olympic Committee found evidence that on average, trans women have lower oxygen consumption rates than cis men or women, and may be disadvantaged in competitions that involve metrics like lower body strength and vertical leap height. And although Buttigieg may place his faith in sports leagues to create science-based policies for trans athletes, the IOC study’s lead researcher Yannis Pitsiladis told OutSports last year that many leagues will likely continue to ban trans women from competition regardless of any new research.\n“I suspect most [leagues] will follow the positions of the large federations to ban [trans women]. Also, it’s unlikely that those large federations will change their position as they are now too invested and they don’t really look at the science or evidence,” Pitsiladis said at the time. “Their wish is mainly to appease their membership and the decisions being taken are mainly justified by politics and dictates, rather than science.”\nThough his comments have carried a tone of general compassion, Buttigieg is the latest Democrat to hew to the center on trans athletes as a political topic. Over the past several months, California Gov. Gavin Newsom has also made numerous statements arguing that it is “deeply unfair” for trans women to play women’s sports — so much so that Newsom has also walked back his support for gender-affirming medical care. Newsom’s comments have already been cited in right-wing bills and legal briefs to argue for further sports restrictions and rollbacks on trans civil rights.\nGet the best of what’s queer. Sign up for Them’s weekly newsletter here."
    },
    {
      "url": "https://www.cnn.com/2025/08/09/politics/republicans-anti-transgender-ads",
      "text": "Shortly after former North Carolina Gov. Roy Cooper announced his plans to run for Senate, a group backing Republicans released an ad with an echo of last year’s presidential campaign.\n“Roy Cooper sides with they/them,” read the language on screen in the ad, produced by the Senate Leadership Fund.\nRepublicans are reprising a key attack line from last year’s presidential race for elections this year and next, betting that anti-trans messaging will help them counter Democrats running on GOP-led cuts to Medicaid and other parts of Trump’s policy megabill.\nTrump allies spent tens of millions of dollars airing an ad highlighting 2024 Democratic nominee Kamala Harris’ one-time commitment that detained immigrants would have access to treatment associated with gender transition as was required by federal law, including surgical care. The ad’s tagline mocked the pronouns used by non-binary individuals, saying “Kamala is for they/them; President Trump is for you.”\nWidely cited by strategists in both parties as having shaped the campaign, that ad is now being mimicked in North Carolina and another competitive Senate contest in Georgia. Trans and gender identity issues have also come up in this year’s race for Virginia governor.\nOne ad attacking Sen. Jon Ossoff aired during a basketball game and referenced the broadcast.\n“Man-to-man defense isn’t woke enough for Ossoff – he’s playing for they/them. Call and tell Sen. Ossoff, stop dunking on defenseless girls,” said the ad, from an affiliate of SLF and backed by more than $350,000.\nChris LaCivita, Trump’s 2024 co-campaign manager and an architect of the “Kamala is for they/them” ads, said it made sense for Republicans to bring back messaging they see as driving a wedge between Democrats and key voting blocs.\n“The purpose of the ads in the 2024 campaign was built around the need to increase our vote share with men, Hispanics, and moms. The ads in question - there were three - achieved the results that we were looking for,” said LaCivita in an email. “That’s what is playing out right now across the country, in Senate, House and gubernatorial races.”\nDemocrats argue that Republicans are using the issue as a distraction.\n“Republicans have given in to the most extreme fringes of their party by abandoning pocketbook issues in favor of an anti-freedom agenda that is obsessed with letting politicians make decisions that should be left to parents and doctors,” said Viet Shelton, a spokesperson for the Democrats’ House campaign arm, in a statement. “Rather than getting involved in personal matters, House Republicans should perhaps spend their time expanding the middle class, lowering costs, and protecting freedoms.”\nThe Trump administration has moved across government to target trans rights in particular, from removing trans people from the military to ordering investigations of hospitals that provide particular medical services for trans children. The White House often promotes its actions against trans-friendly policies, posting Wednesday about a move to restrict visas for trans female athletes competing in women’s sports.\nTrans people make up less than 0.6% of the United States population ages 13 and older, according to the Williams Institute, a public policy research center focused on sexual orientation and gender identity at the University of California, Los Angeles School of Law.\nSimilar attack ads in North Carolina, Georgia and Virginia\nNorth Carolina and Georgia host US Senate elections that are expected to rank among the most competitive contests of next year’s midterms. In both races, Republicans are launching transgender-focused attacks against Democrats, centered on policies governing youth sports participation and bathroom access.\nThe North Carolina GOP issued a statement slamming Cooper, saying that he “championed radical transgender ideology” and “vetoed bills to keep men out of women’s sports.” In another statement, the Senate Leadership Fund criticized Cooper’s “vetoes that allowed boys in girls’ sports.”\nMeanwhile, one of Ossoff’s challengers, Georgia Rep. Buddy Carter, is running an ad featuring a person wearing a dress and a wig complaining that Carter “helped Trump” in “banning people like me from competing in women’s sports.”\nOssoff campaign spokesperson Ellie Dougherty said that “National Republicans are scrambling to hide from Trump’s budget law after facing intense backlash in Georgia for gutting Medicaid and defunding hospitals.”\nWinsome Earle-Sears, the GOP nominee for governor in Virginia, has also been regularly targeting Democratic opponent Abigail Spanberger with attacks focused on transgender policies, as Republicans look for an opening in the challenging off-year race.\nEarle-Sears wrote on social media last week that Spanberger and Ghazala Hashmi, the Democratic nominee for lieutenant governor, “think your daughter should compete and share a locker room with biological men.”\nSam Newton, communications director for the Democratic Governors Association, argued that party leaders at the state level had successfully navigated similar attacks from Republicans in recent elections.\n“In battleground and red-state races for governor in 2022, 2023 and 2024, voters consistently rejected Republicans who made clear they only cared about stoking division with culture wars in favor of Democratic candidates who won by staying laser-focused on addressing the biggest issues impacting working families every single day. This cycle will be no different,” Newton said.\nSome Democrats are expressing sympathy for Republican views\nThe “they/them” ads come as some Democrats who could run for president in 2028 have debated in public where they should stand on the participation of trans female athletes in girls’ sports.\nCalifornia Gov. Gavin Newsom, a potential candidate for the Democratic nomination in 2028, told conservative influencer Charlie Kirk on his podcast in March that transgender athletes competing in women’s sports was “deeply unfair.” And Pete Buttigieg, another potential 2028 contender, also voiced sympathy for conservative complaints about transgender sports policies in an interview on NPR this week.\n“I think most reasonable people would recognize that there are serious fairness issues if you just treat this as not mattering when a trans athlete wants to compete in women’s sports,” Buttigieg said.\nOthers have argued for resolve and attempted to build up infrastructure to support pro-transgender policies. The Human Rights Campaign, a leading LGBTQ rights organization, is planning a series of town halls in red-state cities over the summer aimed at supporting LGBTQ individuals and policies.\n“Stories move people. Shared humanity is powerful. When the American people get to know who we are, and not who Donald Trump says we are, everything changes: hearts and minds first, policy and politics next,” HRC spokesperson Brandon Wolf said about the tour.\nWolf urged Democrats to “be bold, stand up to the bullies, and to say unequivocally: we refuse to compromise on freedom.”\nAnother effort is underway in the Christopher Street Project, a PAC formed earlier this month to endorse and raise funds for candidates that advocate for pro-transgender policies. The group released a list of 16 initial endorsees including Rep. Sarah McBride, the first transgender member of Congress, and prominent Democrats such as Reps. Alexandria Ocasio-Cortez, Pramila Jayapal, Katherine Clark, and Jamie Raskin.\nDuring an interview last month at the Center for American Progress, Minnesota Gov. Tim Walz, the 2024 Democratic vice-presidential nominee, also advised his party to avoid looking “weak” and backing down to Republicans.\n“I think it’s a mistake to focus just on economics and allow trans children to get bullied or something. I think they have to go – or we look weak, if we don’t do it,” Walz said.\nOne minor Democratic candidate for California governor, meanwhile, tried to turn the tables on Trump and Republicans with their own line. The ad from Stephen Cloobeck’s campaign shows Trump’s photo next to disgraced financier and sex offender Jeffrey Epstein and Epstein associate Ghislaine Maxwell.\n“Trump is for they/them,” the narrator says, with the names of Epstein and Maxwell highlighted. “Stephen Cloobeck is for you.”"
    },
    {
      "url": "https://www.npr.org/2025/06/30/nx-s1-5451401/republicans-big-bill-could-hit-rural-hospitals-hard",
      "text": "Republicans' big bill could hit rural hospitals hard\nRepublican lawmakers are racing to pass President Trump's sweeping domestic policy bill before Friday.\nAnd one of the obstacles dividing Republican senators? Radically reshaping Medicaid, the joint federal/state health insurance program for more than 70 million low-income and disabled people.\nThe Senate bill would cut more than $1 trillion from the program and the latest report from the non-partisan Congressional Budget Office estimates nearly 12 million people will lose health insurance if it becomes law. The plan would require able bodied adults to work 80 hours per month until age 65 to qualify for benefits, and would also cap and gradually reduce the tax states can impose on Medicaid providers.\nSeveral GOP senators have raised concerns that the tax is a critical funding stream for rural hospitals. If that income dries up, many hospitals could close.\n\"Medicaid cuts would place significant financial pressure on hospitals in rural states, where many hospitals are already at risk of closure. In more than half of states, reductions in Medicaid funding for rural hospitals would exceed 20%,\" according to the National Rural Health Association.\nSenate GOP leaders have included a new $25 billion fund to support rural hospitals in the bill to alleviate some of those concerns.\nBut Sarah Jane Tribble, chief rural correspondent at KFF Health News, told NPR that many health care officials in rural areas say it's not enough. In fact, it's only 43% of what is needed for rural hospitals to offset the cuts coming in the Senate proposal, she said.\n\"And even worse, that rural transformation fund won't just go to rural hospitals, it'll go to health clinics and federally qualified health care centers, community mental health and opioid treatment centers, too, by their estimates,\" Tribble said. \"So, they really don't think it's enough to offset it.\"\nTribble has been speaking with people from rural communities and they are worried that the proposed cuts will push rural health care to the brink of collapse. \"I'm not hearing good things,\" she said.\n\"They're very concerned because Medicaid rates are so high in rural America that these cuts will be very detrimental. They'll cause more hospitals to close. They'll tax rural health clinics,\" Tribble told All Things Considered host Juana Summers.\nThe following excerpt has been edited for length and clarity.\nInterview highlights\nJuana Summers: Give us some details about some of the types of ways in which rural hospitals could be impacted. Like, I guess I'm trying to figure out how these cuts would work and what they would mean for patients.\nSarah Jane Tribble: Well, for rural hospitals, they're specifically already on the line.\nMore than 150 hospitals have either closed completely or shut down their inpatient beds since 2010, according to the UNC Sheps Center in North Carolina. Another 267 rural hospitals have closed their obstetrics units from 2011 to 2021.\nSo, these hospitals are already, you know, showing signs of duress underneath the current health system economics, if you will. And really, Congress has acknowledged this over the years, passing a new Rural Emergency Hospital Act a couple of years ago, trying to help shore up these hospitals.\nSummers: The White House put out a fact sheet making the point that the bill will not cut Medicaid. The fact sheet calls it a myth that the bill will close rural hospitals. How do you parse those claims?\nTribble: So, when you talk to anybody from, say, Georgetown or some of the other experts out there, they have analyzed the numbers of who's using Medicaid in rural America — say, moms, working-age adults. These are patients of these hospitals.\nAnd if you decrease the number of people receiving Medicaid in rural areas, then you're going to decrease the amount of revenue the hospitals and clinics get because they just have less paying patients.\nBut also, there are some other provisions in the bill that experts have analyzed as far as work requirements and the provider taxes and state-directed payments. Those all do hit rural America in different ways, especially the expansion states.\nSummers: As you pointed out, rural hospitals have been on the decline for years, with many having closed in the last few decades, even more facing risk of immediate closure. I wonder, what does all of this mean for patients? I've heard about how these closures are particularly problematic, for example, for trauma care, cancer treatment.\nTribble: I've done a lot of reporting over the years where I talk to patients who travel long distances for their care. I did a story out of New Mexico where they were setting up telehealth services after a hospital had closed its obstetrics units so patients wouldn't have to drive for every single prenatal visit.\nThose are situations that are already sort of on the brink, if you will, where patients are having to drive long distances when they're delivering babies or even for trauma care, where helicopters have to show up and go significant distances to get people to care. And that's because rural hospitals have been closing and rural care, in general, has been declining over the past couple of decades. There's a lot of places where there's just not enough providers in general. And when a rural hospital closes, providers tend to leave the area."
    }
  ],
  "argos_summary": "Republicans are intensifying their attacks on transgender individuals as a strategy to distract from their lack of legislative successes during President Trump's second term. Following former North Carolina Governor Roy Cooper's announcement to run for the U.S. Senate, the Senate Leadership Fund released ads criticizing his support for trans rights, echoing similar tactics used in previous elections. This trend includes targeting Democratic candidates like Jon Ossoff and Abigail Spanberger, with Republicans leveraging cultural issues to galvanize their base while Democrats struggle to respond effectively, often focusing on economic concerns instead.",
  "argos_id": "HRQS0HTRN"
}