{
  "url": "https://www.yahoo.com/news/articles/china-deploys-robot-antelope-tibet-072716158.html",
  "authorsByline": "Reuters",
  "articleId": "a12265d4545544d98476967388582033",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:27:16+00:00",
  "addDate": "2025-08-12T07:45:54.075094+00:00",
  "refreshDate": "2025-08-12T07:45:54.075095+00:00",
  "score": 1.0,
  "title": "China deploys robot antelope in Tibet to surveil real herds",
  "description": "BEIJING (Reuters) -To the wolves of Tibet, China's first 'robot antelope' may look as appetising as the real herds that roam the rugged tundra, but the \"creature\" is part of Beijing's growing surveillance that now even reaches into its most remote places.  Its doe-like eyes and thick brown fur make the robotic ruminant nearly indistinguishable from the real antelope as the 5G- and AI-integrated imposter scans the Hoh Xil plateau with its sensors, footage from China's state news agency Xinhua shows.  Developed by Xinhua, the Chinese Academy of Sciences and Hangzhou-based DEEP Robotics, the robot antelope is equipped with 5G connectivity and artificial intelligence vision systems, enabling real-time monitoring of the migration, feeding and mating behaviours of the endangered species endemic to Tibet.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nBEIJING (Reuters) -To the wolves of Tibet, China's first 'robot antelope' may look as appetising as the real herds that roam the rugged tundra, but the \"creature\" is part of Beijing's growing surveillance that now even reaches into its most remote places.\n\nIts doe-like eyes and thick brown fur make the robotic ruminant nearly indistinguishable from the real antelope as the 5G- and AI-integrated imposter scans the Hoh Xil plateau with its sensors, footage from China's state news agency Xinhua shows.\n\nDeveloped by Xinhua, the Chinese Academy of Sciences and Hangzhou-based DEEP Robotics, the robot antelope is equipped with 5G connectivity and artificial intelligence vision systems, enabling real-time monitoring of the migration, feeding and mating behaviours of the endangered species endemic to Tibet.\n\nChina is offering its robotics industry tens of billions in subsidies and was host to the 2025 World Robot Conference, which wrapped up on Tuesday.\n\n5G arrived in Tibet in 2019, according to Chinese government documents, and the southwestern region reached 1 million users by 2022. With the completion of a 5G base station in the town of Gogmo in late 2023, every district in Tibet was covered, state media reported.\n\nBeyond transmitting live images and tracking data on rare antelope species, Tibet's 5G infrastructure now supports a growing range of AI applications — from small drones that can operate in areas impenetrable to radar, to telemedicine consultations and smart yak herding technologies, according to Chinese state media reports.\n\nChina has invested heavily in Tibet, boosting the at times restive region's role in President Xi Jinping's flagship Belt and Road infrastructure initiative by strengthening its trade ties with Central Asia, while also tightening surveillance over its population and extending Beijing's digital footprint towards neighbouring rival India.\n\nAnalysts and human rights campaigners accuse Beijing of deploying \"grey-zone\" tactics against countries around the Tibetan plateau. A July report from the Center of Strategic and International Studies think tank documented instances of China leveraging local telecommunications networks to surveil dissidents living in neighbouring Nepal, alongside cases of cyber theft.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "robot antelope",
      "weight": 0.07727284
    },
    {
      "name": "Tibet",
      "weight": 0.0736815
    },
    {
      "name": "rare antelope species",
      "weight": 0.07353152
    },
    {
      "name": "Chinese state media reports",
      "weight": 0.06800589
    },
    {
      "name": "China",
      "weight": 0.06521694
    },
    {
      "name": "real herds",
      "weight": 0.0640277
    },
    {
      "name": "AI applications",
      "weight": 0.06343006
    },
    {
      "name": "AI",
      "weight": 0.05887515
    },
    {
      "name": "state media",
      "weight": 0.05862677
    },
    {
      "name": "Chinese government documents",
      "weight": 0.055965707
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.869140625
    },
    {
      "name": "/News/Technology News",
      "score": 0.857421875
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.368896484375
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.305908203125
    }
  ],
  "sentiment": {
    "positive": 0.52905107,
    "negative": 0.09848779,
    "neutral": 0.37246117
  },
  "summary": "China has deployed its first 'robot antelope' in Tibet, equipped with 5G connectivity and artificial intelligence vision systems to monitor the migration, feeding and mating behaviours of the endangered species endemic to Tibet. The robot antelope is part of Beijing's growing surveillance that now reaches into its most remote places. The 5G- and AI-integrated imposter scans the Hoh Xil plateau with its sensors. This technology allows for live images and tracking data on rare antelope species and supports a range of AI applications, including small drones that can operate in areas impenetrable to radar, telemedicine consultations, and smart yak herding technologies. The robotics industry has been heavily subsidized by China, which also offers billions in subsidies and hosted the 2025 World Robot Conference.",
  "shortSummary": "China deploys a robot antelope in Tibet to monitor rare species and enhance surveillance, using 5G technology to enhance regional connectivity and digital integration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "be993774f25a459abe031d3cbdff5e44",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "China has developed a robotic antelope equipped with 5G and AI technology to monitor the endangered species in Tibet, enhancing its surveillance capabilities in remote areas. The robot, created by Xinhua and other partners, mimics real antelope and collects data on their behaviors. This initiative is part of China's broader investment in Tibet's infrastructure and technology, which includes a comprehensive 5G network that supports various AI applications. Critics argue that these advancements also facilitate increased surveillance of the local population and neighboring regions.",
  "argos_id": "HWEXG12IM"
}