{
  "url": "https://www.yahoo.com/news/articles/us-crime-rates-fell-nationwide-082503206.html",
  "authorsByline": "Amanda Hernández",
  "articleId": "5fbbd7e02579476cb03c6ec0a168eed5",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/abd4cc10c7a0c200c121607b001d64698f6f067571346afafabc5801e6d28725/ynews/resizefill_w1200/https://media.zenfs.com/en/ohio_capital_journal_articles_828/aae80747f9e5363dacd74bb610ae0ab0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:25:03+00:00",
  "addDate": "2025-08-12T08:54:45.756552+00:00",
  "refreshDate": "2025-08-12T08:54:45.756553+00:00",
  "score": 1.0,
  "title": "US crime rates fell nationwide in 2024, FBI report says",
  "description": "Violent crime in the United States fell 4.5% in 2024, according to a new FBI report, while property crime dropped 8.1% from the previous year. The declines continue a trend seen since crime surged during the COVID-19 pandemic, when homicides jumped nearly 30% in 2020 — one of the largest one-year increases since the FBI […]",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nThe J. Edgar Hoover building, Federal Bureau of Investigations headquarters, is seen in July in Washington, D.C. Violent crime in the United States fell 4.5% in 2024, according to a new FBI report. (Photo by Eric Lee/Getty Images)\n\nViolent crime in the United States fell 4.5% in 2024, according to a new FBI report, while property crime dropped 8.1% from the previous year.\n\nThe declines continue a trend seen since crime surged during the COVID-19 pandemic, when homicides jumped nearly 30% in 2020 — one of the largest one-year increases since the FBI began keeping records in 1930. By 2022, violent crime had fallen close to pre-pandemic levels.\n\nHomicides, which the FBI classifies as murder and nonnegligent manslaughter, dropped nearly 15% in 2024. Reports of other violent offenses also decreased, including rape by 5.2%, robbery by 8.9% and aggravated assault by 3%.\n\nProperty crime also fell across all major categories, with motor vehicle theft down 18.6%, burglary down 8.6% and larceny-theft down 5.5%. Reported hate crimes decreased 1.5% from the previous year.\n\nThe 2024 report draws on submissions from 16,675 law enforcement agencies — 2.1% more than last year — representing more than 95% of the U.S. population. Every city agency serving a population of 1 million or more people provided a full year of data. Participation in the FBI’s crime data collection is voluntary, and the data is based on crimes reported to police.\n\nAbout 75% of participating agencies submitted information through the FBI’s new, more detailed National Incident-Based Reporting System, or NIBRS, which covered 87% of the population.\n\nThe data release marks a shift from recent years when participation lagged following the FBI’s 2021 transition to the new system, which required many law enforcement agencies to invest in training and technology upgrades. In 2021, national reporting rates fell below 70% for the first time in two decades, forcing the FBI to estimate results for many jurisdictions.\n\nThe FBI’s crime trends report also includes new law enforcement safety data. Sixty-four officers were feloniously killed in the line of duty in 2024, 43 officers were accidentally killed and 85,730 officers were assaulted.\n\nAlthough the FBI’s 2024 report is a year behind, it aligns with other crime trend reports. The Council on Criminal Justice, a nonpartisan think tank, recently found that homicides and other serious offenses, including gun assaults and carjackings, fell in the first half of 2025 across 42 major cities compared to the same period in 2024.\n\nStateline reporter Amanda Hernández can be reached at ahernandez@stateline.org.\n\nSUPPORT: YOU MAKE OUR WORK POSSIBLE\n\nSUBSCRIBE: GET THE MORNING HEADLINES DELIVERED TO YOUR INBOX",
  "medium": "Article",
  "links": [
    "https://counciloncj.org/crime-trends-in-u-s-cities-mid-year-2025-update/",
    "https://stateline.org/2023/10/27/politicians-love-to-cite-crime-data-its-often-wrong/",
    "https://www.yahoo.com/news/articles/violent-crime-continues-drop-across-081536261.html",
    "https://www.fbi.gov/news/press-releases/fbi-releases-2024-reported-crimes-in-the-nation-statistics",
    "https://ohiocapitaljournal.com/donate",
    "https://ohiocapitaljournal.com/subscribe"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other crime trend reports",
      "weight": 0.09682482
    },
    {
      "name": "FBI report",
      "weight": 0.09633792
    },
    {
      "name": "Violent crime",
      "weight": 0.08924467
    },
    {
      "name": "violent crime",
      "weight": 0.08924467
    },
    {
      "name": "Property crime",
      "weight": 0.08619581
    },
    {
      "name": "property crime",
      "weight": 0.08619581
    },
    {
      "name": "crime",
      "weight": 0.08408255
    },
    {
      "name": "crimes",
      "weight": 0.08408255
    },
    {
      "name": "US crime rates",
      "weight": 0.08295673
    },
    {
      "name": "FBI",
      "weight": 0.08289208
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.97412109375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.9462890625
    },
    {
      "name": "/News/Other",
      "score": 0.88720703125
    },
    {
      "name": "/News/Local News",
      "score": 0.6640625
    }
  ],
  "sentiment": {
    "positive": 0.021869948,
    "negative": 0.9128384,
    "neutral": 0.06529161
  },
  "summary": "Violent crime in the United States fell 4.5% in 2024, according to a new FBI report, while property crime dropped 8.1% from the previous year. These declines continue a trend since the COVID-19 pandemic, when homicides jumped nearly 30% in 2020. The report includes submissions from 16,675 law enforcement agencies, representing over 95% of the U.S. population. The data also includes new law enforcement safety data, with an estimated 84 officers killed in the line of duty in 2024 and 43 officers accidentally killed.",
  "shortSummary": "In 2024, US crime fell 4.5%, with violent crimes increasing, while property crime declining, driven by increased enforcement costs and technological advancements.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a09f3335aaeb4249950b18f6b512820b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "According to a new FBI report, violent crime in the United States decreased by 4.5% in 2024, with property crime dropping by 8.1%. Homicides fell nearly 15%, and other violent offenses such as rape and robbery also saw declines. The report, based on data from over 16,600 law enforcement agencies, indicates a continuing trend of reduced crime rates following a surge during the COVID-19 pandemic.",
  "argos_id": "HYSSF4F4V"
}