{
  "url": "https://www.nytimes.com/athletic/6549378/2025/08/12/justin-fields-jets-giants-joint-practice-report/",
  "authorsByline": "Zack Rosenblatt",
  "articleId": "7c85ea5d9f194814b42549a1e445add0",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/12144006/GettyImages-2227377550-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:14:46+00:00",
  "addDate": "2025-08-12T19:27:45.789715+00:00",
  "refreshDate": "2025-08-12T19:27:45.789718+00:00",
  "score": 1.0,
  "title": "Justin Fields had his moments — good and bad — at Jets-Giants joint practice",
  "description": "Plus, Mason Taylor shines in his return, how the O-line fared, a dominant Jets defense, and more.",
  "content": "FLORHAM PARK, N.J. — Once upon a time, Giants and Jets joint practices brought a little feistiness, the kind that saw Jeremy Shockey trying to take on half the Jets roster, and Tom Coughlin yelling at Jets defensive coordinator Donnie Abraham. They’d take shots at each other in the press, and talk trash on the field.\n\nThe teams met again on Tuesday, and it was … mostly pleasant. There were a couple of moments — Jets defensive tackle Phidarian Mathis got into it with some Giants offensive players during 11-on-11 drills — but otherwise there wasn’t a whole lot of drama. It was a straightforward football practice where the defenses, for the most part, won the day against offenses with some question marks.\n\nOften, it’s easy to walk out of joint practices with a good feeling about which team is (or will be) better. Tuesday felt fairly even. Wednesday’s joint practice will take place at the Giants’ facility in East Rutherford.\n\nHere are some observations from Tuesday’s practice that stood out to me from a Jets perspective…\n\nThere’s an obvious aspect to the Jets offense: They will lean on the run. As I’ve said, it would not surprise me if the Jets led the NFL in rush attempts this year, after coming in last with a year ago. And the Jets showed what that might look like during Saturday’s preseason game against the Packers.\n\nBut something I’ve noticed, especially recently, is that the Jets seem to mostly be playing it safe in the passing game — or at least Fields has been. If the Jets tracked air yards in practice, Fields’ number would be low; it’s been a lot of quick slants, dump-offs, screens and the occasional throw to the intermediate area. There haven’t been many shots taken down the field — and that was true on Tuesday too. That’s not necessarily a bad thing, just something I’ve had my eye on, curious to see if the Jets are going to limit the amount of risk Fields takes on. It was an “up and down” day for Fields on Tuesday, head coach Aaron Glenn said — and I would agree with that assessment.\n\nHe was solid during seven-on-seven drills, completing seven passes in a row, and the eighth pass only fell incomplete on a nice breakup by Giants safety Jevon Holland, intended for Josh Reynolds. The first run of seven-on-seven included a perfectly executed wheel route by running back Braelon Allen, and Fields did a good job of selling that he was going to throw it to the opposite side of the field before turning at the last second and connecting with Allen.\n\nIn 11-on-11, Fields connected on a perfect throw on the move to Tyler Johnson at the sideline, who made the catch with two defenders nearby — though Fields might have been lit up for a sack by Abdul Carter if the defense was allowed to hit. Fields completed his first five passes in 11-on-11, then wasn’t as successful for a stretch. He had a pass batted down at the line of scrimmage, was sacked at least two or three times, missed Johnson on a slant, threw an incomplete pass intended for Garrett Wilson and threw the ball away as Dexter Lawrence chased him.\n\nIn red zone 11-on-11 drills, it looked like Fields might have been sacked on the first play by Brian Burns, though he did complete the pass to Breece Hall. He closed out the day with a perfect side-arm laser to Jeremy Ruckert in the back of the end zone for a touchdown.\n\nAll told, I had Fields completing 7 of 12 passes in 11-on-11 drills and 7 of 8 during seven-on-seven — including three straight passes to Garrett Wilson at one point.\n\nThe rookie tight end missed a little over a week with a high ankle sprain, which can often knock players out for much longer than that. Taylor picked up right where he left up on Tuesday, catching a few passes from Fields but really standing out on a sliding catch he made on a pass from Adrian Martinez. Glenn raved about that grab after practice, calling the play “outstanding,” highlighting the way Taylor was able to maneuver his feet to stay inbounds.\n\n“Those are the things I expect from him in the passing game,” Glenn said. “It’s nothing new. He just has to make sure that he comes along at the right pace so we don’t re-injure that ankle again, but he’s a fighter. He wants to be out there … I thought he had a hell of a day.”\n\nThe starting offensive line had a dominant performance against the Packers on Saturday, and they flashed some of that on Tuesday. Though the Giants’ pass rush will give even the best of offensive lines some trouble, and it did that on Tuesday. It doesn’t get much more fearsome than the trio of Burns, Carter and Lawrence, and all wreaked their own level of havoc — Burns, in particular, was moving around the formation and giving trouble to rookie tackle Armand Membou. Carter bowled over center Joe Tippmann for a sack at one point.\n\nOlu Fashanu, to his credit, held his own against Kayvon Thibodeaux both in the run game and pass game. Fashanu has been one of the Jets’ best and most consistent players throughout the summer. Carter also had his way with the Jets’ backup offensive line, beating left tackle Max Mitchell for a sack at one point.\n\nThe way the Jets’ practice field is set up, reporters essentially have to choose whether they want to watch the Jets offense versus the Giants defense, or the Jets defense versus the Giants offense (at least until the scrimmage period at the end of practice). I opted to watch Fields and the offense — but reporter accounts on the other side indicated that the Jets defense was dominant, especially against Russell Wilson. Micheal Clemons and Jay Tufele — building on a stellar preseason performance — both had sacks, and Wilson struggled to complete passes against the Jets secondary.\n\nI did see the Jets defense in red-zone drills and they were a little less effective in that area — Wilson hit tight end Theo Johnson in double coverage in the back of the end zone, beating Andre Cisco and Tony Adams. Then Wilson beat Adams again on a touchdown to Darius Slayton a few plays later.\n\nBanged up — but getting healthier\n\nThe Jets got some good news and some not-so-good news on the injury front on Tuesday. The good: Taylor, defensive tackle Quinnen Williams, guard John Simpson, wide receiver Xavier Gipson and defensive end Jermaine Johnson all returned to practice. This was Johnson’s first practice since being activated off PUP — the Jets are easing him back into things even though, as Johnson said, he feels ready to be a full-go.\n\nOn the flip side: Quarterback Tyrod Taylor had his knee scoped and, Glenn said, he’ll miss the rest of the preseason but is expected to be ready for Week 1. Wide receiver Allen Lazard (shoulder) will miss a couple weeks. Running back Isaiah Davis (ankle) sat out Tuesday’s practice, as did defensive tackle Byron Cowart (ankle). Quarterback Brady Cook hurt his ankle and limped off the field on Tuesday but Glenn said he’ll be fine. That leaves the Jets with only two healthy quarterbacks, in Fields and Martinez.\n• Wide receiver Brandon Smith continues to make plays with the backups as he pushes for a roster spot. He made a nice diving catch on a Brady Cook pass during team drills.\n• Same goes for wide receiver Jamaal Pritchett, who is pushing Gipson as a returner too. He made multiple impressive catches in team drills, though he did muff one punt, the first time he’s done so in camp. The undrafted rookie still has a shot to stick though.\n• Defensive tackle Leonard Taylor III — another standout from Saturday — had a dominant one-on-one rep against Giants offensive lineman Jimmy Morrissey, which hyped up the Jets entire defensive line group. He’s feeling safer and safer for the 53 as camp progresses.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6534908/2025/08/05/new-york-jets-running-game-breakdown/",
    "https://www.nytimes.com/athletic/6544823/2025/08/10/jets-53-man-roster-projection-preseason-opener-packers/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jets",
      "weight": 0.08122773
    },
    {
      "name": "Jets defensive tackle Phidarian Mathis",
      "weight": 0.07831355
    },
    {
      "name": "Jets defensive coordinator Donnie Abraham",
      "weight": 0.06934206
    },
    {
      "name": "joint practices",
      "weight": 0.066284396
    },
    {
      "name": "pass game",
      "weight": 0.0662443
    },
    {
      "name": "Fields",
      "weight": 0.06157492
    },
    {
      "name": "defensive end Jermaine Johnson",
      "weight": 0.061236303
    },
    {
      "name": "practice",
      "weight": 0.060632966
    },
    {
      "name": "passes",
      "weight": 0.060545083
    },
    {
      "name": "Giants and Jets joint practices",
      "weight": 0.06042285
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9716796875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.95166015625
    }
  ],
  "sentiment": {
    "positive": 0.10727681,
    "negative": 0.554864,
    "neutral": 0.33785924
  },
  "summary": "The Jets and Giants joint practice was held on Tuesday in New York, with both teams having largely been relatively pleasant. Despite some tension between the two teams, the practice was generally non-controversy. The Jets' quarterback, Justin Fields, had some good and bad moments, with him completing 7 of 12 passes in 11-on-11 drills and 7 of 8 during seven-on'-seven. However, he also had an up and down day, particularly in the passing game, where he seemed to play it safe and avoid further risk. Meanwhile, the Jets' defense seemed to be winning the day against an offense with some question marks. The team's next joint practice will take place at the Giants' facility in East Rutherford.",
  "shortSummary": "At Jets-Giants joint practice, Justin Fields had mixed reactions but overall solid performances, highlighting his potential for future success despite some off-field incidents.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "afb17326c19a4b33a2e3c885b14d7939",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6534908/2025/08/05/new-york-jets-running-game-breakdown/",
      "text": "The Jets finally built a brick wall up front after many — so, so many — years of trying. They also feel like they have the running backs to burst through that wall like the Kool-Aid man.\nA deep offensive line built through high draft picks and prudent free-agent signings, an intriguing backfield featuring three ball-carriers with varying skillsets, a running quarterback unlike one this organization has ever employed, and a coaching staff with designs on an offense built to run it down your throat.\nAdvertisement\n“We want to be a fast, physical, and violent outfit,” offensive coordinator Tanner Engstrand said.\nA year ago, this was one of the worst rushing attacks in the NFL, and a big reason for that was simple: They rarely ran it. Some of that was because of inconsistencies in the run blocking and in the way the backs were running the ball, but most of it was because the Jets employed a quarterback in Aaron Rodgers keen on throwing the ball as often as possible. The Jets had the fewest rushing attempts in the NFL last season. They only ran the ball 27.5 percent of the time in the red zone, far and away the lowest in the NFL — nearly 10 percentage points lower than the Bengals, the second least-run-heavy attack. There’s an argument that the Jets running game was bad for a lack of trying.\nThat won’t be the case in 2025, not with Aaron Glenn leading the way, not with the way the Jets are designing their offense, and not with the pieces they brought into the fold — and the pieces they brought back from last year’s roster. There was frustration among players on both sides of the ball with how infrequently (and often ineffectively) the Jets ran last season. If that wasn’t clear already, it has been in the way players have been talking about the new scheme and renewed focus on establishing the run. Suffice to say: They’re excited.\n“I love running the ball, man,” said left guard John Simpson. “That’s my strong suit. I’m excited for the opportunity to come out here and just run the ball. All the other stuff will come. If we can run the ball, we’ll win a lot of games.”\nAdded running back Breece Hall: “From a whole offensive standpoint we’re all really bought into this run scheme. I think it fits our backs more, I think it makes more sense to the guys up front.”\nThere was a variety of factors that propagated the issues in their rushing attack last year, including the aforementioned Rodgers factor — he often checked out of running plays even though the Jets, per TruMedia, faced the smallest percentage of stacked boxes (11.6 percent) in the NFL. But that list also includes a lack of creativity in play-calling, especially when Nathaniel Hackett was running things, and an offensive line that wasn’t buying into the style or approach of their position coach, Keith Carter.\nAdvertisement\nGlenn has designs on recreating what made the Lions offense so successful over the last few years in Detroit, with an even heavier emphasis on the run, cultivating a scheme that better fits his new quarterback (Fields) than his old one (Jared Goff). From that Lions staff, Glenn hired Tanner Engstrand as his offensive coordinator and Steve Heiden as his offensive line coach.\nHeiden, curiously, was the Lions’ tight ends coach and has only coached offensive line briefly in the NFL (in 2018 with the Cardinals), but the word out of Detroit is that he was heavily involved in cultivating the game plan for the running game and his responsibilities extended beyond his position group. The Lions had the fourth-best rushing offense in the NFL over the last two years. Scheme-wise, there will be an emphasis on wide-zone runs which, in simple terms, is predicated around the offensive line moving together laterally at the snap and forcing the defense to flow in the same direction of the offensive line, creating cut-back opportunities for the running back. The goal is to open up creases for the back to attack — and so the Jets’ backs (namely Breece Hall) need to do a better job of attacking those holes when they come than they did a year ago.\n“The offense is similar to what we did my freshman year at Wisconsin. It’s very familiar for me, it’s very natural,” running back Braelon Allen said.\nCenter Joe Tippmann said the offensive line’s responsibilities are different in this offense than in the last one.\n“What we were doing before, there was a lot of getting out wide and running. Now it’s tighter landmarks and more downhill,” Tippmann said. “As an offensive lineman you want to be able to get your feet in the ground and put pressure into the guy across from you. I’d say that’s a big difference for me.”\nAdvertisement\nGlenn’s pursuit of recreating the Lions offense — especially the running game — goes beyond scheme too. The Jets prioritized drafting a prospect they could plug right in at right tackle, and Armand Membou was at the top of his list for the combination of his size, strength and athleticism. Internally, the Jets view Membou as someone who is ready to make an impact in the running game right away while working through some growing pains as a pass-blocker. Simpson’s strength is in the running game, and the trio of left tackle Olu Fashanu, center Joe Tippmann (battling with veteran Josh Myers to start) and right guard Alijah Vera-Tucker have all combined to open up holes throughout training camp. The passing offense has looked inconsistent, but the running game has looked dominant at times.\n“That group is taking on the identity of what AG talks about,” Engstrand said. “I think they are taking that to heart and they are playing with that mentality. Which you’re seeing — we’re finding some lanes and getting some movement up front, but we’ve got some really good players out there, too, like we talked about in the spring. I really like where that group is going right now.”\nSaid Glenn: “Every offensive lineman that I know, man, they want to get downhill and smash somebody. And that’s what our guys can do.”\nIn addition to the offensive line, Glenn made it a point to add (and bring back) wide receivers with a willingness to get in the mix and block in the running game. It was the first thing that came out of Glenn’s mouth in March when he was asked why they signed wide receiver Josh Reynolds, and the No. 1 reason the Jets (surprisingly) brought back Allen Lazard. Glenn has also emphasized how impressed he’s been with tight end Mason Taylor’s blocking ability in camp — and backup Jeremy Ruckert’s primary role will likely be as a blocker too.\nThe expression “no block, no rock” might as well be painted on the walls of the wide receiver room. “Receivers gotta be able to block,” said wide receiver Tyler Johnson. “You gotta do the dirty work.”\nGarrett Wilson, the Jets’ star receiver, is excited about the prospect of a running game actually opening things up in the passing game — especially important since the Jets don’t have a whole lot of threats to scare opposing defenses and draw attention away from Wilson.\n“The better we can run the ball with the running backs we got, Justin’s ability to run the ball, the more push we can get, the more we can run the ball on second and short and convert, that stuff is going to open up everything for us,” Wilson said. “By the time we get into the season hopefully we’re rolling.”\nAdvertisement\nThat point about converting from short distances is important because, again, the Jets rarely ran the ball from short distances last season despite having the personnel (namely running back Braelon Allen) to do so. The Jets had the fewest rushing attempts with two yards or fewer to a first down (44) in the NFL — while the Lions ranked eighth.\nAnd that gets to the other most important reason to believe in the Jets’ ability to run the ball in 2025: The running back room.\nSince the early days of Glenn’s tenure, he’s emphasized that this won’t be a one-back offense — he views the trio of Hall, Allen and Isaiah Davis as a three-headed monster, all three with varying skillsets. He comes from Detroit, where the Lions first split carries between D’Andre Swift and Jamaal Williams and then, more effectively, between Jahmyr Gibbs and David Montgomery. The skillsets, to a degree, line up in comparison to the Jets’ running back room — Hall should play the role of Gibbs, an explosive runner and threat in the passing game. Hackett famously admitted late in the 2023 season that he didn’t realize Hall could be an effective pass-catcher until halfway through the season.\nGlenn won’t be making that mistake. Hall has the most receiving yards (1,074) and third-most receiving touchdowns (seven) among all running backs over the last two years. “We are going to open his game up quite a bit,” Glenn said. “He’s the type of guy that you can split out wide and let him run the route tree, because he can run it like a receiver. And I like that matchup with him against a safety or a linebacker.”\nIn this comparison, Allen can be the Montgomery type — a big, strong, downhill runner that should thrive in the trenches. Allen has been a standout in camp and looks more explosive than he did as a 20-year-old rookie. He ran for 334 yards, two touchdowns and only averaged 3.6 yards per carry last year, though the Jets got away from him as the season progressed — he had more than six carries in a game only twice after Week 8.\n“Braelon is a 240-pound man that’s always falling forward,” Glenn said. “Listen, that’s where he’s going to make his money. I’m not just saying in short yardage, those downhill runs, it’s going to weigh on defensive players, and when you continue to do that, you just create something as far as a team, as far as an identity, that this league will take notice of, and I’m looking forward to that.”\nThe Jets have the ability — especially in light of a potentially thin receiving corps — to deploy Allen and Hall on the field at the same time too. Even if they don’t, their skillsets are varied enough that, at their best, they can keep the defense off balance. It’s not unike Gibbs and Montgomery, who weren’t often on the field at the same time but still balanced each other out.\nAdvertisement\n“That’s two different dynamics that you have to get ready for when it comes to a defense getting ready to play against those guys,” Glenn said. “So, as a guy that has been coaching on defense for the most part, I know the issues that come with that and being able to game plan when this guy comes in the game or when this other guy comes in the game.”\nThe difference between this backfield and the one in Detroit: The Jets feel like they have a third starting-caliber running back in Isaiah Davis, who flashed as a fifth-round rookie last year. Davis averaged 5.8 yards per carry, albeit on limited touches (30 rushes). “He brings everything,” Glenn said. “Pass protection, his ability to run, his route tree, he’s a smart player, he’s tough, he’s aggressive. He’s a valuable piece of what we’re trying to do.”\nAnd if anyone wants to believe in the Jets’ ability to be one of the best rushing attacks in the NFL, the conversation includes Fields. Even after dealing with his toe injury (the one that caused an unnecessary stir), Fields has shown a level of mobility the Jets haven’t really had at quarterback … ever? During Saturday’s scrimmage, Fields scored an easy touchdown on a zone-read on one play, and scrambled for a long touchdown on another when he spotted a hole in the defense after a dropback.\nFinally, the Jets should not only have a running game to reckon with — they have one that will be their identity.\n(Photo of Breece Hall: John Jones / Imagn Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6544823/2025/08/10/jets-53-man-roster-projection-preseason-opener-packers/",
      "text": "What happens in the preseason often stays in the preseason.\nMore often than not, preseason hype doesn’t actually manifest into regular season success. And yet, it would be hard not to be encouraged by what quarterback Justin Fields and the Jets offense showed in Saturday night’s preseason win over the Green Bay Packers.\nAdvertisement\nFields played only one series — and he got in and out of the lineup doing exactly what he needed. He completed passes that were there for him, he scrambled for yards when nobody was open, he didn’t force things and he led a scoring drive, capped by his own 13-yard touchdown run. He completed 3 of 4 passes for 42 yards.\nThe blocking was good, and the running backs — particularly Braelon Allen — ran the ball well. If the offense looks like this when it matters, the Jets might look like a more competent outfit in 2025.\nAnother reason for optimism had to do with some mistakes made on defense. When Micheal Clemons got into a mini-fracas, head coach Aaron Glenn pulled him out of the game. When linebacker Marcelino McCrary-Ball was flagged for a late hit, Glenn laid into him. That level of accountability will resonate with a fan base — and, hopefully, a roster — that has been seeking it.\nAs for the rest of the roster: Unlike the last couple of years when the Jets loaded up with big-name veteran players and draft picks, there are more roster spots there for a taking in 2025. By my count, there are around 7-10 spots that are up for grabs — and perhaps more depending on the severity of injuries to some on the roster. (Note: The Jets currently have two players on the Physically Unable to Perform List in defensive end Jermaine Johnson and wide receiver Irv Charles; Johnson is expected to be activated while Charles will likely stick on PUP to start the season, thus not taking up a roster spot.)\nQuarterback (2)\nIn: Justin Fields, Tyrod Taylor\nOut: Brady Cook, Adrian Martinez\nTaylor is dealing with a knee injury — Glenn called it the result of “wear and tear” earlier in the week — but as long as that’s nothing serious and he’ll be available for Week 1 the Jets will likely roll with two quarterbacks to start the season. If Taylor wasn’t ready for Week 1, perhaps Cook or Martinez could play their way onto the 53 but more likely one (or both) will stick around on the practice squad. Martinez looked like the better quarterback on Saturday overall though he did play against Green Bay’s deeper backups. Cook had his moments too and has had a better camp overall.\nAdvertisement\nRunning Back (4)\nIn: Breece Hall, Braelon Allen, Isaiah Davis, Kene Nwangwu\nOut: Donovan Edwards, Lawrance Toafili, Andrew Beck (fullback)\nIf the Jets do wind up playing the trio of Hall, Allen and Davis as much as it seems they will — and in a run-heavy offense — I have concerns about the lack of depth behind them. Edwards hasn’t flashed much during training camp but had a nice 73-yard touchdown run on Saturday (albeit wiped out by a holding penalty) and Glenn raved about him after the game. If he keeps this level of play up, it’ll be harder to keep him off the roster. And while Nwangwu has gotten reps with the backups his role is primarily on special teams and as the team’s primary kick returner. Perhaps someone worth adding will come available on the waiver wire when rosters are reduced.\nI think Beck will ultimately stick around using some roster gymnastics. The Jets can cut him and, since he’s a vested veteran, he won’t have to pass through waivers. They could initially bring him back on the practice squad and use a couple elevations before eventually signing him back to the active roster. In a run-heavy offense, he’ll have a role as a blocker — maybe as a passer too after the way he played with the first-team offense on Saturday night. He caught two passes for 36 yards.\nWide Receiver (6)\nIn: Garrett Wilson, Josh Reynolds, Allen Lazard, Arian Smith, Tyler Johnson, Jamaal Pritchett\nOut: Brandon Smith, Malachi Corley, Xavier Gispon, Dymere Miller, Quentin Skinner, Ontaria Wilson\nInjured: Irv Charles\nThe big names to watch here, all of whom this staff inherited from the past regime: Lazard, Corley and Gipson. Lazard hasn’t shown much of anything in camp but the Jets seem to value his leadership and ability as a blocker in the running game (he was spotted wearing a sling on Saturday; he’ll undergo tests on his shoulder). The Jets have had Corley exclusively running with the backups on offense, likely in an attempt to motivate him to earn his standing with a new coaching staff — so far, it hasn’t worked. Corley has struggled in camp (drops, fumbles and a lack of notable plays made) and the preseason might be his best shot at proving he deserves to stick. It would be a tough look cutting a recent third-round pick, but he wasn’t Darren Mougey’s third-round pick. Corley had one catch for eight yards on Saturday.\nAdvertisement\nGipson is battling Pritchett for the primary punt returner role and it ultimately was Gipson’s job to lose, but Pritchett has outplayed him both on special teams and on offense throughout training camp. Gipson missed Saturday’s game with an injury, while Pritchett had four chances to return punts, with a long return of 13 yards.\nBrandon Smith was in a battle for the final roster spot in my projection — and he has a chance to fight his way onto the team. But there’s also a decent chance he’d make it through waivers and can stick around anyway.\nThe last wide receiver spots (whether they keep six or seven) will come down to Gipson or Pritchett, and then Smith, Corley and/or undrafted rookie Quentin Skinner — who has good size and has flashed as a deep threat both in camp and on Saturday when he made an impressive jump ball 26-yard catch in the second half.\nTight End (3)\nIn: Mason Taylor, Jeremy Ruckert, Stone Smartt\nOut: Zack Kuntz, Neal Johnson\nThis feels like a position primed to add someone after roster cuts — particularly in light of the rookie Taylor’s high ankle sprain, which should knock him out for a couple more weeks, at least. If that injury lingers into the season, the Jets are in trouble; without Taylor, this looks like the weakest position group on the roster. Ruckert has had a rough camp — two recent targets have bounced off his hands and were picked off. Smartt has flashed some pass-catching skills (and caught a 24-yard touchdown from Martinez against the Packers) but is limited as a blocker. Taylor was playing well before he got hurt.\nOffensive Line (9)\nIn: OT Olu Fashanu, OT Armand Membou, G Alijah Vera-Tucker, G John Simpson, C/G Joe Tippmann, C Josh Myers, OT Chukwuma Okorafor, OT/G Max Mitchell, G/C Xavier Newman\nOut: OT Carter Warren, G Kohl Levao, OL Leander Wiegand, OT Samuel Jackson\nThis group feels fairly locked in unless the Jets add someone new on the waiver wire after camp. Warren has struggled since the Jets drafted him in the fourth round a couple years ago and he’s been running mostly as a third-team tackle throughout camp, so it feels as if he’s fallen behind Mitchell (who at least brings the versatility to play guard too). Simpson is currently injured, which has complicated the center competition a bit, moving Tippmann over to left guard for the time being.\nAdvertisement\nDefensive Tackle (5)\nIn: Quinnen Williams, Byron Cowart, Jay Tufele, Phidarian Mathis, Leonard Taylor III\nOut: Derrick Nnadi, Payton Page, Fatorma Mulbah\nInjuries have complicated things for this group. Depth already was a concern outside of Williams — and now both Williams (calf) and Cowart (ankle) are sidelined. Nnadi has been invisible for most of camp; if everyone is healthy I’m curious to see how secure his roster spot is (his veteran experience likely helps him). Though it also makes it a real possibility that the Jets do some roster gymnastics by cutting him initially and then bringing him back on the practice squad or otherwise, which is what I projected here. Page has flashed during camp and there’s a decent chance either he or Taylor would be claimed on waivers if they’re cut. Taylor has the edge right now for his experience — and it didn’t hurt that Taylor had a strip-sack that led to a touchdown on Saturday.\nDefensive End (6)\nIn: Will McDonald, Jermaine Johnson, Micheal Clemons, Rashad Weaver, Tyler Baron, Ja’Markis Weston\nOut: Eric Watts, Braiden McGregor, Kingsley Jonathan, Michael Fletcher\nWeston is an undrafted rookie who has flown under the radar, but the Jets view him as a special-teams player with significant potential in that area, and he flashed that on Saturday when he recovered a fumble on a Mecole Hardman muffed punt.\nWatts was one of my last cuts, though I don’t feel necessarily great about it. His physical and athletic tools are intriguing and he has a year of significant experience from his undrafted rookie year (231 defense, 132 special teams), which has served him well — he just didn’t do anything with those snaps last year. He has made some plays in team drills and has gotten his share of first-team reps with Johnson (and, briefly, McDonald) missing time, but it mostly comes down to how much rotating Steve Wilks plans on doing on the defensive line — and thus justifying whether they’d roll with 11 defensive linemen. McDonald, Johnson, Clemons and Weaver all feel locked into roles, while Baron appears to be more of a project at the moment.\nWill the Jets prioritize interior defensive linemen like Page and Mathis or someone like Watts on the edge? That might depend on the health of players like Williams, Cowart and Johnson — and how Watts performs in the preseason.\nLinebacker (5)\nIn: Jamien Sherwood, Quincy Williams, Marcelino McCrary-Ball, Francis Mauigoa, Jamin Davis\nOut: Zaire Barnes\nAdvertisement\nLast year, the Lions kept six linebackers on their initial 53-man roster. This isn’t the exact same defense as the one Glenn ran in Detroit, especially since Wilks is the one running it, but the Jets are severely lacking for proven depth at this position and they’ll need their backup linebackers to play on special teams. McCrary-Ball has been the third-best linebacker during camp, though he had a bad penalty on Saturday on a late hit and Glenn wasn’t happy. Mauigoa probably needs some development — while Davis (a former first-round pick) has gotten some reps with the starters too (including against Green Bay, where he had a sack) and perhaps has some untapped potential.\nCornerback (5)\nIn: Sauce Gardner, Brandon Stephens, Michael Carter II, Azareye’h Thomas, Qwan’Tez Stiggers\nOut: Jarrick Bernard-Converse, Jordan Clark, Mario Goodrich\nInjured: Kris Boyd\nThis is arguably the strongest position group on the roster — as it was for most of the last three seasons. Stephens has had a stellar camp and could be in for a breakout campaign opposite Gardner if he keeps this up when the games matter. Thomas was showing some flashes, though he has been injured recently, while Stiggers has had a really nice camp and feels safe at this point. Bernard-Converse has failed to standout. The former draft pick has the athletic tools but hasn’t been able to put it together yet.\nBoyd was signed to be key member of the special teams unit but suffered a shoulder injury in camp and, based on his emotional posts on Instagram recently, it seems likely it’s a long-term injury, though that hasn’t been confirmed yet. If he’s healthy enough to play this season, he’ll either stick around and/or get put on the injured reserve list after roster cuts.\nSafety (5)\nIn: Andre Cisco, Tony Adams, Malachi Moore, Isaiah Oliver, Jarius Monroe\nOut: Tanner McCalister, Dean Clark\nMonroe has had a really nice camp and even got an unprompted shoutout from Glenn at one point. He was a favorite of the previous staff. McCalister has made some plays in camp as well and is a dark horse if he can keep that up in the preseason.\nSpecial Teams (3)\nIn: K Nick Folk, P Austin McNamara, LS Thomas Hennessy\nOut: Harrison Mevis\nFolk is the clear winner of this kicking competition both based on performance and on contract (Folk signed a deal above the minimum, with $755,000 guaranteed) but Mevis could still stick on the practice squad potentially — particularly because he’s a better option on kickoffs.\n(Photo of Donovan Edwards: Kayla Wolf / Imagn Images)"
    }
  ],
  "argos_summary": "During joint practices between the Giants and Jets, the atmosphere was mostly cordial, with only minor skirmishes. The Jets are focusing on a run-heavy offense this season, showing improvements in their rushing game compared to last year, and quarterback Justin Fields displayed both solid passing and mobility. However, the team is dealing with injuries, particularly to Tyrod Taylor and Allen Lazard, while some players are stepping up to secure their roster spots as the preseason progresses.",
  "argos_id": "HZK6DLOGF"
}