{
  "url": "https://www.foxnews.com/world/french-drafted-unifil-resolution-could-shield-hezbollah-us-stays-silent",
  "authorsByline": "Rachel Wolf",
  "articleId": "f16ce0b1b338412bb21d003a9ee53c0d",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/unifil.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:12:45-04:00",
  "addDate": "2025-08-12T22:21:27.409786+00:00",
  "refreshDate": "2025-08-12T22:21:27.409787+00:00",
  "score": 1.0,
  "title": "French-drafted UNIFIL resolution could shield Hezbollah as US stays silent",
  "description": "Critics fear a U.N. Security Council resolution authored by France could leave a current system in place in southern Lebanon despite years of failures to curb Hezbollah.",
  "content": "FIRST ON FOX — The U.S. may allow a controversial draft United Nations Security Council resolution to pass that some critics say would help Hezbollah, the Iran-backed terror organization.\n\nThe United Nations Interim Force in Lebanon’s (UNIFIL) mandate is up for renewal at the end of August, and the French-authored text would buy the mission another year while also not giving a firm termination date, according to a draft obtained by Fox News Digital. However, it states that the ultimate goal is to have \"the Lebanese government [be] the sole provider of security in southern Lebanon\" as long as it \"fully controls all Lebanese territory.\"\n\nUS CHAMPIONS LEBANON'S RESPONSE TO HEZBOLLAH DISARMAMENT, HINTS AT ABRAHAM ACCORDS OPPORTUNITY\n\nWhile applauding the end of hostilities, it also takes aim at Israel for its moves against Hezbollah terrorists operating across its border, noting in the draft that it, \"Welcomes the cessation of hostilities arrangement between Israel and Lebanon of 26 November 2024 (S/2024/870), as a critical step towards full implementation of Resolution 1701, while noting with grave concerns the continuous violations of this arrangement, notably air and drone strikes on Lebanese territory, and requests the parties to faithfully implement its provisions, with the support of the United Nations Special Coordinator for Lebanon (UNSCOL) and the United Nations Interim Force in Lebanon (UNIFIL), in line with their respective mandates.\"\n\nThe draft also urges Israel to withdraw from its five remaining positions inside Lebanon, which Israel maintains are meant to counter Hezbollah. Israel would also be encouraged to take part in \"diplomatic efforts\" to delineate a border between itself and Lebanon. If the resolution were to pass in its current form, Lebanon would be responsible for manning the posts with the help of UNIFIL.\n\nAs part of its goal of clearing southern Lebanon of unauthorized armed personnel — primarily Hezbollah operatives — the resolution encourages the international community to back the Lebanese Armed Forces (LAF) so it can ensure the absence of armed factions between the Blue Line and the Litani River.\n\nFollowing the Second Lebanon War in 2006, the U.N. Security Council passed Resolution 1701, which outlined that UNIFIL and LAF would work to block Hezbollah’s activity in southern Lebanon. However, this has not been the case and critics fear that French draft would only bolster a system that has already failed.\n\nDECISION DAY APPROACHES FOR TRUMP ADMIN ON CONTROVERSIAL UN FORCE THAT FAILED TO DISARM HEZBOLLAH\n\nA senior policy analyst for the Jewish Institute for National Security of America (JINSA) has voiced concern about renewing UNIFIL's mandate and called on the U.S. to veto it.\n\n\"UNIFIL has proven, over the course of decades, its failure to achieve any semblance of its stated purpose. UNIFIL was created in 1978, during the chaotic Lebanese Civil War, to try to stabilize Lebanon and prevent broader spillover,\" Yoni Tobin pointed out in an op-ed originally published by the Algemeiner. He also noted that UNIFIL has not acted against Hezbollah's building up its arsenal despite being given the green light to do so.\n\nIn the years since the resolution’s passing, the terror organization has been active, with Israel uncovering networks of tunnels similar to those used by Hamas. Additionally, Hezbollah quickly joined in Hamas’ war against Israel after the Oct. 7 massacre.\n\nUNIFIL IGNORED HEZBOLLAH TERROR BUILDUP FOR 18 YEARS, ISRAEL'S UN AMBASSADOR SAYS\n\n\"Among countless failures by the United Nations in the Middle East, UNIFIL may be the most spectacular. Tasked with ensuring that Hezbollah would not rearm after the 2006 war, it patiently watched as Hezbollah became the largest non-state terrorist and military organization in the world,\" the former U.S. Ambassador during the first Trump administration, David Friedman, told Fox News Digital in June. \"Stability in Lebanon — within reach only now that Israel has decapitated Hezbollah’s leadership — will not be achieved through UNIFIL.\"\n\nIn October 2024, Fox News Digital reported that UNIFIL had failed to prevent Hezbollah’s rapid rocket and weapons buildup since the mandate was implemented in 2006.\n\nPro-Hezbollah officials and soldiers within Lebanon’s Army also remain a core problem, according to experts and media reports. In late January, a LAF chief reportedly sent a classified document to Hezbollah. The LAF‘s Suhil Bahij Gharb, who oversees military intelligence for southern Lebanon, secured the confidential material from a military facility run by the U.S., France and UNIFIL.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIt remains unclear how the U.S. will vote on the resolution or whether it will seek revisions to the French-authored text.\n\nThe U.S. mission declined to comment, while the U.N. missions of Israel and France did not respond to Fox News Digital requests.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/world/terrorism",
    "https://www.foxnews.com/category/world/world-regions/middle-east/lebanon",
    "https://www.foxnews.com/category/world/world-regions/israel",
    "https://www.foxnews.com/video/6360664094112",
    "https://www.foxnews.com/category/world/united-nations",
    "https://www.foxnews.com/world/unifil-ignored-hezbollah-terror-build-up-18-years-israels-un-ambassador-says",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/world/decision-day-approaches-trump-admin-controversial-un-force-failed-disarm-hezbollah",
    "https://www.foxnews.com/world/us-champions-lebanons-response-hezbollah-disarmament-hints-abraham-accords-opportunity",
    "https://www.algemeiner.com/2025/08/11/after-47-years-of-failure-its-time-to-end-unifil/",
    "https://www.foxnews.com/category/world/world-regions/middle-east"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "southern Lebanon",
      "weight": 0.089702375
    },
    {
      "name": "Lebanon",
      "weight": 0.0832083
    },
    {
      "name": "Hezbollah",
      "weight": 0.07602492
    },
    {
      "name": "Hezbollah terrorists",
      "weight": 0.0755679
    },
    {
      "name": "UNIFIL",
      "weight": 0.069183856
    },
    {
      "name": "United Nations Security Council",
      "weight": 0.06814724
    },
    {
      "name": "Israel",
      "weight": 0.06587523
    },
    {
      "name": "Fox News Digital",
      "weight": 0.063313745
    },
    {
      "name": "Fox News Digital requests",
      "weight": 0.06047292
    },
    {
      "name": "a controversial draft United Nations Security Council resolution",
      "weight": 0.056923863
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98193359375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.94189453125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.89892578125
    },
    {
      "name": "/News/World News",
      "score": 0.85205078125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.837890625
    }
  ],
  "sentiment": {
    "positive": 0.086125925,
    "negative": 0.54194576,
    "neutral": 0.3719283
  },
  "summary": "The United Nations Interim Force in Lebanon’s (UNIFIL) mandate is up for renewal at the end of August, and a French-authored text would extend it for another year while not giving a termination date. The resolution, which criticizes Israel for its moves against Hezbollah terrorists across its border, aims to have the Lebanese government as sole provider of security in southern Lebanon as long as it fully controls all Lebanese territory. It also urges Israel to withdraw from its remaining positions in Lebanon, which Israel maintains are intended to counter Hezbollah. Critics fear this could bolster a system that has already failed to prevent Hezbollah from expanding its arsenal. UNIFIL has been tasked with preventing Hezbollah from rearming after the 2006 war and has not acted against Hezbollah's growing arsenal.",
  "shortSummary": "The US may support a draft UN Security Council resolution that supports Hezbollah, while critics warn it undermines the peace process and fails to disarm.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "09c83ec4d39b4ef98b9749f8ab1c191f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/world/world-regions/israel",
      "text": "What to know about the State of Israel\nIsrael is a country in the Middle East predominantly composed of Jewish individuals. It is home to many holy sites and has deep religious roots dating back to biblical times. Bordered by Egypt, Jordan, Lebanon, and Syria, Israel is roughly the size of New Jersey.\nBenjamin Netanyahu, from the right-wing Likud party, is the longest-serving prime minister of Israel. He previously served as prime minister from 1996 to 1999 and later from 2009 to 2021, before returning to the role in 2022.\nThe State of Israel was established in 1948 and was officially admitted to the United Nations (UN) in 1949. Israel has a long-standing conflict with Arab states and the Palestinians, characterized by years of violence and terrorist attacks against the Jewish state.\nOn Oct. 7, 2023, Hamas terrorists launched a deadly attack on Israel, prompting Israel to formally declare war on Hamas. In June 2025, Israel launched strikes aimed at Iran's nuclear facilities and top military leaders. On June 13, 2025, Israel initiated strikes targeting nuclear sites in Iran, marking the beginning of fire exchanges between the two nations and the start of the Israel-Iran war. In retaliation for U.S. strikes against its nuclear program, Iran launched at least 14 missiles toward Al Udeid Air Base in Qatar. According to President Donald Trump, the United States carried out strikes on three of Iran’s nuclear facilities in Operation Midnight Hammer on June 22, 2025."
    },
    {
      "url": "https://www.foxnews.com/category/world/world-regions/middle-east",
      "text": "The Middle East is rich in history, natural resources, and religion. With endless deserts, rugged mountains, and river valleys, the region offers unique wildlife and picturesque terrains. Within the Middle East lies the birthplace of major world religions such as Judaism, Christianity and Islam. With its vast oil supply and natural gas reserves fueling its economy, the Middle East is heavily relied upon internationally for its resources. Tourism is also an important factor in the Middle Eastern economy, with top tourist destinations including the Great Pyramids of Giza, Petra, Jerusalem, and Abu Dhabi in the UAE. However, some top tourist attractions have seen a decline in visitor numbers due to ongoing conflicts in different countries.\nJust as it has a long history, the Middle East has experienced a long line of conflicts both within and outside the region. Key conflicts occurring in the area include the Israel-Palestinian conflict, Israel's war with the Hamas terrorist group, the ongoing rivalry between Iran and Saudi Arabia, and various other internal conflicts. Previously, the United States military fought wars in Iraq and Afghanistan. The imposing threats of terrorism, drug smuggling, nuclear proliferation, and other factors have impacted the region's relationships both domestically and internationally. Major Middle Eastern leaders include Israeli Prime Minister Benjamin Netanyahu, Saudi Arabian Crown Prince Mohammed bin Salman, and Iranian Supreme Leader Ayatollah Ali Khamenei."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/world/decision-day-approaches-trump-admin-controversial-un-force-failed-disarm-hezbollah",
      "text": "JERUSALEM—The scandal-plagued U.N. mission set up to stop Hezbollah rocket attacks on Israel will know in late August if the Trump administration plans to vote to discontinue its mandate at the U.N. Security Council.\nIn interviews with Fox News Digital, several leading American and Israeli experts on the mandate have called for the U.S. government to pull the plug on the mandate because the United Nations Interim Force in Lebanon (UNIFIL) is an example of the U.N.’s ineffectiveness in stopping the Iran-backed Lebanese terrorist movement.\n\"Among countless failures by the United Nations in the Middle East, UNIFIL may be the most spectacular. Tasked with ensuring that Hezbollah would not rearm after the 2006 war, it patiently watched as Hezbollah became the largest non-state terrorist and military organization in the world. Stability in Lebanon — within reach only now that Israel has decapitated Hezbollah’s leadership — will not be achieved through UNIFIL,\" the former U.S. Ambassador during the first Trump administration, David Friedman, told Fox News Digital.\nEXCLUSIVE: A LOOK AT HEZBOLLAH'S PLAN TO TERRORIZE AND INVADE NORTHERN ISRAEL\nAfter the conclusion of the Second Lebanon War in 2006 between Israel and Hezbollah, the UNSC passed Resolution 1701, which outlined that the international force UNIFIL, along with the Lebanese Armed Forces (LAF), was supposed to block Hezbollah’s activity in southern Lebanon.\nHezbollah joined Hamas in its war on the Jewish state a day after the Iranian regime-backed terrorist organization in Gaza invaded Israel on October 7, 2023, and slaughtered over 1,200 people, including more than 40 Americans.\nIn October, Fox News Digital reported that UNIFIL soldiers had failed to stop Hezbollah’s massive rocket and military weapons expansion since the mandate was implemented in 2006.\nIsrael’s U.N. Ambassador Danny Danon at the time accused UNIFIL of failing to enforce its mission to prevent the U.S.-designated terrorist movement Hezbollah from establishing military outposts on the border with Israel.\nIsrael’s incursion into southern Lebanon has revealed a military outpost about a mere 300 yards north of the border with the Jewish state that is filled with explosives and mines, according to Israel Defense Forces (IDF).\nISRAEL ORDERS IDF TO SEIZE MORE GAZA TERRITORY IF HAMAS DOESN'T RELEASE HOSTAGESWhen asked if Israel seeks an end of the UNIFIl mandate, Jonathan Harounoff, international spokesperson for Israel’s Mission to the United Nations, told Fox News Digital this week that \"Israel is still evaluating the situation.\"\nA U.S. State Department spokesperson told Fox News Digital that \"We have nothing to announce at this time\" about a vote against continuing the UNIFIL mandate.\nDr. Zoe Levornik and Sarit Zehavi, from the Israel Alma Research and Education Center—one of the top think tanks assessing UNIFIL and Hezbollah—wrote on the organization’s webpage on June 10: \"Over the years, UNIFIL has had numerous opportunities to improve and fulfill its role, particularly in light of Israel’s repeated warnings. Yet no real attempt has been made to alter the organization’s conduct. There is no reason to believe that renewing the mandate—even with improvements—will bring about the necessary change that would make UNIFIL’s presence in southern Lebanon relevant and effective in maintaining the security of both Israel and Lebanon.\"\nWhen confronted with the criticism from Alma about UNIFIL, the peacekeeping force's spokesman, Andrea Teneti, told Fox News Digital \"The LAF continues to benefit from UNIFIL’s support—not only to ensure full deployment in areas currently occupied by Israel, but also through training, capacity-building, and the development of essential capabilities needed to take over our mandated tasks on land and at sea.\n\"The mission’s relevance remains vital in maintaining an impartial international presence on the ground, helping to monitor the situation and reinforce the efforts of the LAF. Additionally, UNIFIL is providing essential support to local communities during this particularly challenging period, contributing to stability in the area despite the numerous shelling monitored and reported since 27 November 2024.\"\nFREED ISRAELI HOSTAGE TELLS UN, 'NO MORE EXCUSES,' SAYS AID IS FEEDING TERRORISTS\nHe added \"Implementation of 1701 is not with UNIFIL but with the parties. We are supporting the parties in the implementation of the mandate, but commitment is needed from both sides. In recent months, during this new political environment, LAF and UNIFIL have been recovering a large number of ammunition caches as well as positions used previously by Hezbollah. The situation is more stable than earlier, but air strikes are continuing and the stability is still fragile.\"\nZehavi, who lives in northern Israel, where Hezbollah has caused severe destruction with missile fire, countered the UNIFIL spokesman's comments. She told Fox News Digital that all the things mentioned by UNIFIL \"are secondary to the primary issue of the mandate, which is the disarmament of Hezbollah.\"\nZehavi added that despite the UNIFIL spokesman claiming that UNIFIL seized ammunition used by Hezbollah, she noted that UNIFIL has provided no evidence. She asked \"in which towns\" Hezbollah is being disarmed. She stressed, \"Where are the pictures? How come there are no proofs and only statements that they are doing that? As a resident of the north, I want to see proofs to remind everybody that the IDF showed proofs of the arms of Hezbollah in south Lebanon and brought them into Israel.\"\nShe also asked where has UNIFIL been over the last 18 years in training the Lebanese army?\" I think the United States and France can do that better than UNIFIL,\" mentioning the new mechanism set up to address violations via U.S. and French Generals who are in the region, she said.\nZehavi said UNIFIL over the years \"tied our hands\" during the Israel-Hezbollah war.\nShe added that Israel is enforcing the disarming of Hezbollah via continued military strikes in the south. The Biden administration and France brokered a fragile ceasefire in November between Hezbollah and Israel. The language of the ceasefire states it aims to \"promote conditions for a permanent and comprehensive situation.\" The ceasefire ended 14 months of high-intensity warfare between Israel and Hezbollah.\nWhen asked about Zehavi’s questions, Teneti said \"All our findings—whether related to activities conducted with or without the Lebanese Armed Forces—are shared with the members of the Security Council and also transmitted to the Mechanism, as agreed by both Lebanon and Israel. This is our authorized reporting line. Additionally, all detailed information is published quarterly in the Secretary-General’s report on the implementation of Resolution 1701, which is a public document.\"\nPro-Hezbollah officials and soldiers within Lebanon’s Army also remain a core problem, according to experts and media reports. In late January, a LAF chief reportedly sent a classified document to Hezbollah. The LAF‘s Suhil Bahij Gharb, who oversees military intelligence for southern Lebanon, secured the confidential material from a military facility run by the U.S., France and the U.N. interim force in Lebanon (UNIFIL).\nCLICK HERE TO GET THE FOX NEWS APP\nThe White House and the U.S. National Security Council did not immediately respond to Fox News Digital press queries."
    },
    {
      "url": "https://www.foxnews.com/category/world/world-regions/middle-east/lebanon",
      "text": "World 7 mins ago French-drafted UNIFIL resolution could shield Hezbollah as US stays silent Critics fear a U.N. Security Council resolution authored by France could leave a current system in place in southern Lebanon despite years of failures to curb Hezbollah.\nSyria July 25 US, Israel announce targeted killings of terror leaders in Syria and Lebanon CENTCOM troops killed ISIS leader al-Hardani in Syria, while Israeli forces eliminated Hezbollah officer Ali Qoutan as both nations continue counterterrorism efforts.\nSyria July 16 Who are the Druze? Religious group aids Syrian members under Islamist attack, Israeli members offer support Israeli military responds to protect Syrian Druze from Islamist militants as local Druze citizens cross the border to aid their brethren, prompting concerns from Israeli officials.\nLebanon July 7 US champions Lebanon's response to Hezbollah disarmament, hints at Abraham Accords opportunity U.S. Envoy Thomas Barrack welcomes Lebanon's response to proposal calling for Hezbollah disarmament within four months, suggesting potential peace talks with Israel\nIsrael June 26 Trump’s crown jewel Abraham Accords may expand to normalize ties between Israel and other nations The Abraham Accords may soon include Syria and Lebanon, according to Israeli media, with the Trump administration working to expand the peace agreement between Israel and Arab nations.\nUnited Nations June 19 Decision day approaches for Trump admin on controversial UN force that failed to disarm Hezbollah Former Trump ambassador labels UNIFIL \"the most spectacular failure\" as the U.N. force faces potential mandate termination for ineffectiveness against Hezbollah's military buildup.\nIsrael June 17 Israel's US ambassador says beeper operation will 'seem simple' compared to actions against Iran Israel's Ambassador to the U.S. Yechiel Leiter said surprises will emerge amid the conflict with Iran that will make Israel's beeper operation look \"simple.\"\nLebanon May 7 Family of American hostage tortured in Lebanon wins landmark case against Iran Court rules in favor of Lebanese American family in unprecedented lawsuit against Iran for Hezbollah's kidnapping and torture, establishing legal proof of Iranian influence in Lebanon.\nLebanon April 24 A weakened Hezbollah leads some in Lebanon to talk of peace with Israel as US pushes sides together Lebanese citizens are reportedly beginning to discuss normalization with Israel following the crushing blow dealt to the Iran-backed terror proxy Hezbollah by Israel.\nLebanon March 28 Israel strikes Beirut for the first time since a ceasefire ended the latest Israel-Hezbollah war Israel has launched an attack on Beirut, marking its first strike on Lebanon's capital since a ceasefire ended the latest Israel-Hezbollah war last November.\nLebanon March 18 DHS: Deported Brown University doctor attended Hezbollah chief's funeral, supported terror leader Brown University professor Dr. Rasha Alawieh was deported to Lebanon after allegedly admitting she went to the funeral of Hezbollah leader Hassan Nasrallah.\nSyria March 17 Syria's new regime hits Hezbollah targets in Lebanon over claims its fighters were executed Conflict between two jihadist factions – Sunni-led Hayat Tahrir al-Sham and Shia Hezbollah – on the Syrian-Lebanese border highlights a growing sectarian divide in the region.\nTrump's First 100 Days March 12 ‘Overblown’ reports on Israel-Lebanon normalization risk hindering border talks before they begin: official Israeli reports that Israel and Lebanon are looking to normalize ties are \"overblown\" and risk hindering work being done to negotiate border security as Hezbollah remains a chief threat.\nLebanon February 28 Lebanon seizes $2.5M destined for Hezbollah after stopping man at airport in 'unprecedented’ bust A man allegedly carrying $2.5 million in cash destined for Hezbollah reportedly was detained at Beirut’s airport in what an expert is calling an \"unprecedented\" bust.\nBenjamin Netanyahu February 6 Netanyahu gifts Trump controversial item that helped turn tide in war against Hezbollah Israeli Prime Minister Benjamin Netanyahu gave President Trump an unusual gift in homage to the controversial pager operation that targeted Hezbollah terrorists.\nLebanon February 3 Trump urged to look into US funding of Lebanese army amid accusations of its ties to Hezbollah Amid a resurgence of Hezbollah activity on Israel’s border there are new calls for the Trump administration to push the Lebanese state to root out Hezbollah and slash aid to the country’s army.\nIsrael January 24 Israel’s military will remain in Lebanon as ceasefire deadline nears Israel said its forces will remain in southern Lebanon after UN and Lebanese forces moved too slowly under the truce with Hezbollah established in November, which remains unfulfilled.\nLebanon January 10 Lebanon's new president strikes a nationalistic tone amid regional shifts, further weakening of Hezbollah The Lebanese parliament finally voted on a new president on Thursday following two years of deadlock. Joseph Aoun the head of the country's armed forces won a majority of the votes.\nIsrael December 30 Israeli spy network uncovers Hezbollah commander's plans to marry his 4 mistresses Israeli spy agencies infiltrated Hezbollah so successfully that they learned intimate details of commander Fuad Shukr's plans to marry his four mistresses.\nIsrael December 29 Israeli official reveals how 'to truly defeat Hezbollah' Israeli Defense Forces Chief of the General Staff, LTG Herzi Halevi, said that \"to truly defeat Hezbollah,\" civilian life must return to the Lebanon border.\nIsrael December 28 IDF finds Hezbollah weapons cache in underground tunnel: video The Israeli military said it discovered and destroyed an underground tunnel system used by Hezbollah to hide weapons used to attack Israel in southern Lebanon.\nLebanon December 15 Christian leader in Lebanon urges US, allies to intervene to stop Hezbollah The leader of a Christian coalition and political party in Lebanon is calling on the U.S. and its Western allies to deploy troops to Lebanon to help the army dismantle Hezbollah.\nYear in Review December 15 Major international figures who died in 2024 Numerous key international figures died in 2024, ranging from Russian opposition leader Alexei Navalny to Yahya Sinwar, the leader of Hamas.\nIsrael December 4 Exclusive: A look at Hezbollah's plan to terrorize and invade northern Israel Fox News Digital reviewed plans, and was shown video of a Hezbollah terrorist describing the group’s plan to kill or capture Israeli civilians in its planned invasion of the Galilee region.\nIsrael December 3 Israel warns it will go after Lebanon directly if cease-fire with Hezbollah collapses Israel issued a warning at Lebanon that it will not long distinguish between Beirut and Hezbollah should the cease-fire between Jerusalem and the terrorist group collapse following an exchange of strikes.\nIsrael December 2 IDF soldiers accuse UN peacekeepers of enabling Hezbollah terrorists amid increasing cease-fire violations In southern Lebanon, Israeli forces confront entrenched Hezbollah positions and question UNIFIL’s ability to enforce its mandate even before the cease-fire agreement was drawn up.\nIsrael November 30 Israeli military says Hezbollah is smuggling weapons into Lebanon during ceasefire Hezbollah terrorists reportedly are smuggling weapons across Lebanon's borders despite an ongoing ceasefire with Israel.\nSyria November 29 ‘War followed us’: A Syrian family fled Beirut after Israeli bombardment to face repression, bombing at home Fox News Digital spoke with Ahmed Yahia Dabbas about his family's journey from Lebanon to a non-regime-held area in northwest Syria and the challenge they've faced as displaced people.\nIsrael November 29 Israel cease-fire deal has critics worried over Biden, Obama officials looking to stymie incoming Trump admin After 14 months of war between Israel and Hezbollah, a cease-fire went into effect this week amid allegations that the truce happened due to pressure put on Israel despite denials from the administration.\nIsrael November 29 Israel destroys Hezbollah's 'largest precision-guided missiles manufacturing site' as group vows to 'fight' Israel's military says it has destroyed Hezbollah's largest precision-guided missile manufacturing site, located along Lebanon's border with Syria."
    },
    {
      "url": "https://www.foxnews.com/world/us-champions-lebanons-response-hezbollah-disarmament-hints-abraham-accords-opportunity",
      "text": "The U.S. envoy to Lebanon championed a response issued by Beirut on Monday to a proposal by Washington that detailed the complete disarmament of the Iran-backed terrorist group Hezbollah in exchange for the withdrawal of Israeli troops from its southern region.\nEnvoy Thomas Barrack told reporters he was \"unbelievably satisfied\" with Beirut’s timely response to a June 19 proposal that called for the disarmament of Hezbollah within a four-month timeframe.\n\"What the government gave us was something spectacular in a very short period of time,\" Barrack said following a meeting with Lebanese President Joseph Aoun, who took the top job in January. \"I'm unbelievably satisfied with the response.\"\nTRUMP PRESSURES ISRAEL TO END GAZA CONFLICT AS HE EYES ABRAHAM ACCORDS EXPANSION\nThe news comes as negotiators are also working to end Israel’s war against Hamas in the Gaza Strip after Jerusalem saw itself facing four fronts just last fall with a war on its southern border against Hamas, back-and-forth missile strikes with Iran as well as with the Houthis in Yemen, and a campaign that unfolded in Lebanon.\nA truce was struck in Lebanon following a sophisticated pager bombing that targeted hundreds of Hezbollah members across the country in September.\nHezbollah largely retreated from Lebanon’s southern region and has reportedly relinquished some arms.\nBut reporting by Reuters on Monday also suggested that Hezbollah may be unwilling to relinquish all its arms and the details of the U.S.-Lebanon agreement that would see the disarmament of the terrorist network remain unknown.\nIsraeli troops have remained in parts of southern Lebanon to counter what it argues is a continued threat posed by the terrorist network to Israeli communities that live on the northern border, and skirmishes have continued.\nBarrack, who also serves as U.S. ambassador to Turkey and special envoy for Syria, said he believes that, ultimately, Lebanon and Israel share the same goal – peace.\n\"The Israelis do not want war with Lebanon,\" he said. \"Both countries are trying to give the same thing – the notion of a stand-down agreement, of the cessation of hostilities, and a road to peace.\"\nBarrack also suggested that the Trump administration may look to add Lebanon to the list of nations that have normalized ties with Israel under the Abraham Accords – a chief policy of Trump’s during his first administration and one which he has once again made a top priority.\nFox News Digital could not confirm whether Beirut is yet interested in that level of diplomacy with its southern neighbor.\nBut Barrack also suggested that Syria has already begun \"dialogue\" with Israel.\n\"The dialogue has started between Syria and Israel, just as the dialogue needs to be reinvented by Lebanon,\" he said. \"If you don't want change, it's no problem. The rest of the region is moving at Mach speed and you will be left behind.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe comments come one week after Israeli Minister of Foreign Affairs Gideon Sa'ar said Jerusalem \"is interested in expanding the Abraham Accords circle of peace and normalization.\n\"We have an interest in adding countries, such as Syria and Lebanon, our neighbors, to the circle of peace and normalization – while safeguarding Israel's essential and security interests,\" he added, though much of the normalization efforts would depend on Israel ending its war in the Gaza Strip.\nReuters contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/world/unifil-ignored-hezbollah-terror-build-up-18-years-israels-un-ambassador-says",
      "text": "JERUSALEM – Israeli Ambassador to the U.N. Danny Danon on Sunday accused the United Nations Interim Force In Lebanon (UNIFIL) of failing to enforce its mission to prevent the U.S.-designated terrorist movement Hezbollah from establishing military outposts on the border with Israel.\nIsrael’s incursion into southern Lebanon has revealed a military outpost about a mere 300 yards north of the border with the Jewish state that is filled with explosives and mines, according to Israel Defense Forces (IDF).\n\"Hezbollah terrorists are using UNIFIL outposts as hiding places and as places of ambushes. The U.N.'s insistence on keeping the UNIFIL soldiers in the line of fire is incomprehensible,\" said Danon.\nHEZBOLLAH BIGGER CHALLENGE THAN HAMAS TO ISRAEL: ‘CROWN JEWEL IN THE IRANIAN EMPIRE OF TERROR’\nHe added \"For 18 years, UNIFIL personnel ignored the Hezbollah bases along the border and did not report any Resolution 1701 violations, which states that only the Lebanese army is allowed to operate in the area.\"\nDanon continued that \"While the IDF is working against the terrorist organization Hezbollah, we requested that UNIFIL forces move five kilometers (approx 3.1 miles) north of the border in order to stay out of the line of fire. Unfortunately, at this time, this request has not been accepted.\"\nThe U.S. and other world powers passed Resolution 1701 at the United Nations Security Council in 2006 to aid the Lebanese Armed Forces in assuming military control over the region, replacing Hezbollah, between the Litani River and the southern border in Lebanon. The goal of the 2006 UNIFIL mandate was to prevent a third war between Israel and the U.S.-designated terrorist organization Hezbollah. Israel fought Hezbollah in 1982 and in the summer of 2006.\nHezbollah’s decision to join Hamas’ war on Israel a day after the Sunni terrorist movement Hamas invaded Israel on Oct. 7 revealed to Israeli war planners and counter-terrorism experts UNIFIL had failed its mission.\nHamas slaughtered nearly 1,200 people in southern Israel on Oct. 7, including over 30 Americans. A lethal Hezbollah drone attack on Sunday murdered four IDF soldiers and wounded nearly 60 Israelis.\nHezbollah’s massive military buildup of its presence on Israel’s northern border since the 2006 war has caused an Israeli government re-examination of the clear and present danger of the Iranian-backed Shiite terrorist movement following Hamas’ invasion of Israel’s southern border on Oct. 7.\nISRAEL DEGRADES IRAN-BACKED HEZBOLLAH TERRORISTS IN SPECTACULAR PAGER EXPLOSION OPERATION: EXPERTS\nThe IDF said in a statement that \"Over the past month, approximately 25 rockets and missiles have been launched at Israeli communities and IDF troops from Hezbollah’s terrorist compounds embedded near UNIFIL posts in southern Lebanon, exploiting their proximity to U.N. forces. One of the attacks resulted in the deaths of two IDF soldiers. Hezbollah uses compounds located above and below ground to carry out terrorist attacks against the State of Israel.\"\nUNIFIL issued a statement on Sunday, announcing, \"Early this morning, peacekeepers at a U.N. position in Ramyah observed three platoons of IDF soldiers crossing the Blue Line into Lebanon. At around 4:30 a.m., while peacekeepers were in shelters, two IDF Merkava tanks destroyed the position’s main gate and forcibly entered the position. They requested multiple times that the base turn out its lights. The tanks left about 45 minutes later after UNIFIL protested through our liaison mechanism, saying that IDF presence was putting peacekeepers in danger.\"\nUNIFIL added \"peacekeepers at the same position reported the firing of several rounds 100 meters north, which emitted smoke. Despite putting on protective masks, fifteen peacekeepers suffered effects, including skin irritation and gastrointestinal reactions, after the smoke entered the camp. The peacekeepers are receiving treatment.\"\nDanon said \"The details of the incident involving UNIFIL soldiers in southern Lebanon are currently being investigated. In the coming days, we will continue to promote a dialogue on this issue with the relevant parties at the UN.\"\nWhen Fox News Digital approached UNIFIL spokesman Andrea Tenenti for a comment about Danon’s criticism, Tenenti did not immediately respond.\nOver the weekend, Israeli Prime Minister Benjamin Netanyahu called on UNIFIL to withdraw its troops from southern Lebanon because they are being used as \"human shields\" to advance the Iranian regime-backed Hezbollah war machinery.\nSpeaking in Hebrew, Netanyahu told the U.N. Secretary-General António Guterres, \"It is time for you to withdraw UNIFIL from Hezbollah strongholds and from the areas of combat.\"\nStéphane Dujarric, spokesman for the secretary-general, said \"Against the backdrop of the ongoing hostilities in southern Lebanon and despite attacks that have hit United Nations positions, injuring a number of peacekeepers in the past several days, UNIFIL peacekeepers remain in all positions and the U.N. flag continues to fly.\"\nDujarric added that \"The Secretary-General reiterates that the safety and security of U.N. personnel and property must be guaranteed and that the inviolability of U.N. premises must be respected at all times without qualification. In a deeply worrying incident that occurred today, the entrance door of a U.N. position was deliberately breached by IDF armored vehicles.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe U.N. chief called \"on all parties, including the IDF, to refrain from any and all actions that put our peacekeepers at risk. The Secretary-General takes the opportunity to reiterate the call for a cessation of hostilities and the full implementation of UN Security Council Resolution 1701.\"\nGuterres did not address that the Hezbollah tunnel shafts discovered by the IDF were located a mere 300 feet away from a UNIFIL peacekeeping observation post, as well as the presence of other Hezbollah military installations in a zone that was required by UNSC 1701 to be free from Hezbollah explosives and armaments. The elaborate Hezbollah tunnels were found west of the Lebanese village of Labbouneh.\nThe United Nations Security Council will once again discuss the situation in Lebanon later on Monday."
    },
    {
      "url": "https://www.foxnews.com/category/world/united-nations",
      "text": "World 22 mins ago French-drafted UNIFIL resolution could shield Hezbollah as US stays silent Critics fear a U.N. Security Council resolution authored by France could leave a current system in place in southern Lebanon despite years of failures to curb Hezbollah.\nIsrael 1 day ago Netanyahu expands scope of planned Gaza takeover, says Israel has 'no choice but to finish the job' Israeli Prime Minister Benjamin Netanyahu announced the expansion of Israeli plans to temporarily take over Gaza beyond just Gaza City on Monday.\nState Department 3 days ago Trump nominates State Department spokeswoman Tammy Bruce as UN deputy representative Tammy Bruce, a U.S. State Department spokesperson, has been nominated by President Donald Trump to become the next U.N. deputy representative.\nAntisemitism Exposed August 5 Brother of Israeli hostage urges UN to act after video shows Hamas starving and torturing captives Ilay David, brother of hostage Evyatar, spoke before the United Nations Security Council, calling for action and saying that Hamas is starving hostages and forcing them to dig their own graves.\nWorld August 5 Fox News gets inside look at Gaza humanitarian situation as Israel weighs next steps Fox News was given an inside look at an aid site run by the Gaza Humanitarian Foundation as the organization faces fierce international backlash.\nUnited Nations August 4 As Israel faces blame for the hunger crisis in Gaza, UN's own data shows most of its aid is looted United Nations data reveals 87% of aid trucks entering Gaza since May 19 were looted by armed groups or civilians, sparking debate over responsibility for humanitarian crisis.\nUnited Nations August 1 US report urges UN agency's shutdown over Hamas ties, Oct 7 terror links State Department report reveals U.S. seeks full dismantling of UNRWA, citing Hamas ties, Oct. 7 involvement and refusal to return funds. Fox News Digital obtained the unreleased assessment.\nCanada July 30 Canada plans to recognize Palestinian state in September, PM Carney says Canada plans to recognize a Palestinian state in September during a meeting of the United Nations, Canadian Prime Minister Mark Carney said.\nIran July 28 Iran more than doubles state executions in first half of 2025 Iran has more than doubled state executions in 2024 with at least 612 people killed compared to 297 in the same period last year, according to the U.N. Human Rights Office.\nUnited Nations July 28 Trump rejects Macron move as US skips UN summit on Palestinian state The Trump administration boycotts U.N. summit on Palestinian statehood co-sponsored by France and Saudi Arabia, as critics call the event a stumbling block to peace efforts in the Middle East.\nIsrael July 26 Israel announces immediate resumption of Gaza aid airdrops amid growing hunger crisis The IDF plans to airdrop seven pallets of aid to Gaza Saturday, establishing humanitarian corridors as the U.N. warns of increased malnutrition in the region.\nEmmanuel Macron July 24 French President Emmanuel Macron to recognize 'State of Palestine' in September at UN General Assembly French President Emmanuel Macron shared a letter addressed to the leader of the Palestinian Authority on Thursday, citing a need for an immediate ceasefire in Gaza.\nIsrael July 24 Hamas 'hardens' stance in ceasefire talks as Netanyahu recalls negotiation team Israel recalls negotiators from Doha after Hamas increases demands for prisoner exchanges, creating a setback in ceasefire talks aimed at releasing hostages and delivering aid to Gaza\nUnited Nations July 23 UN court rules wealthy nations pay up for climate change damages in controversial global ruling International Court of Justice determines countries are responsible for corporate emissions and must cooperate to achieve concrete emission reduction targets.\nIran July 23 Iran doubles down on refusal to end nuclear program, ready for war with Israel President Pezeshkian declares Iran is 'fully prepared' for renewed conflict with Israel despite ongoing ceasefire, claiming U.S. strikes failed to eliminate Iran's nuclear capabilities.\nIsrael July 22 Huckabee hits back at Western countries that 'side’ with terror group Hamas Western call to end Gaza war draws Hamas praise and U.S. pushback, as claims over aid access intensify. U.S.-backed group delivering 85 million meals faces mounting international scrutiny.\nVIDEO July 22 US- and Israel-backed organization looks to feed Gazans in need Gaza Humanitarian Foundation Spokesperson Chapin Fay tells Fox News Digital about the organization's work and its outreach to one of its biggest critics — the U.N.\nDonald Trump July 22 Trump pulls US out of UN agency over its backing of 'woke' social causes The Trump administration announced Tuesday that the U.S. would pull out of a United Nations agency over its \"globalist, ideological agenda\" and anti-Israel bias.\nIran July 21 Iran seeks China, Russia help to stall UN sanctions ahead of nuclear talks with Europeans Iran schedules diplomatic meetings with Russia, China and European nations as the deadline approaches for a new nuclear deal to avoid the reimposition of U.N. Security Council sanctions.\nIran July 16 Iran faces August deadline to accept comprehensive nuclear deal or face renewed UN sanctions Secretary Rubio and European foreign ministers set an August deadline for Iran's nuclear deal, which could trigger the snapback mechanism reimposing all U.N. sanctions.\nIran July 16 Iran's leader threatens 'even bigger blow' against US, Trump says he's in ‘no rush’ to talk Iranian Supreme Leader Ayatollah Ali Khamenei warns of further attacks against the U.S. and Israel despite degraded military program, though experts caution that Tehran's missile capabilities remain a threat.\nCollege July 16 Chris Rufo lays out reforms to Trump administration on how to 'save' higher education New poll shows only 15% of voters trust Ivy League schools as Manhattan Institute calls for Trump to create a contract with universities demanding transparency.\nIsrael July 15 Israel slams UN for ignoring aid already in Gaza while demanding more Israel is calling out international organizations, including the United Nations, for decrying the situation in Gaza as \"thousands of pallets\" of aid remain undistributed.\nUnited Nations July 15 ‘Profound cowardice’: Booker slams Waltz for 'failure of leadership,' Signalgate accountability Sen. Cory Booker attacked former national security advisor Mike Waltz for not taking greater accountability for his role in a Signal group chat used to discuss strikes against the Houthis.\nIran July 14 Iran vows retaliation if UN Security Council issues snapback sanctions on anniversary of nuclear deal Tehran issues warning against U.N. snapback sanctions amid concerns over its nuclear program, while expert warns that enforcing the U.N. mechanism could prompt Iran to exit non-proliferation treaty.\nOpinion July 14 Here's how we take America First to the United Nations Trump's U.N. ambassador nominee Mike Waltz would focus on reforming ineffective peacekeeping missions, dismantling UNRWA and combating antisemitism at the United Nations.\nMiddle East July 13 Israel, Hamas talks drag as aid group chair tells UN to stop acting like the ‘mafia’ Israel-Hamas ceasefire talks face challenges over aid distribution as tensions rise between the Gaza Humanitarian Foundation and U.N. regarding humanitarian assistance.\nUnited Nations July 11 As US-backed group delivers 70 million meals, UN and NGOs fight to discredit Gaza aid rival The U.S.-backed Gaza Humanitarian Foundation's aid distribution system faces opposition from Hamas and criticism from the U.N. and NGOs despite delivering millions of meals to Gazans.\nIsrael July 9 Watchdog backs Rubio’s sanctions on UN official over ‘shameful efforts’ targeting US, Israel The State Department confirmed sanctions were imposed on UN official Francesca Albanese over efforts targeting U.S. and Israeli officials through the ICC.\nMiddle East July 9 US-backed Gaza aid group launches bold new system to deliver food directly to families Gaza Humanitarian Foundation launches initiative to deliver food directly to Palestinians through local leaders, addressing criticism of its previous distribution model."
    },
    {
      "url": "https://www.algemeiner.com/2025/08/11/after-47-years-of-failure-its-time-to-end-unifil/",
      "text": "After 47 Years of Failure, It’s Time to End UNIFIL\nError: Contact form not found.\nby Yoni Tobin\nThe United Nations certainly has a funny definition of the word “interim.”\nForty-seven years after its creation, the United Nations Interim Force in Lebanon (UNIFIL) is still around, despite clearly failing to fulfill its mission to restore peace to Lebanon’s border with Israel. The United States should veto the Force’s mandate renewal this month, and end the UNIFIL disaster.\nUNIFIL has proven, over the course of decades, its failure to achieve any semblance of its stated purpose. UNIFIL was created in 1978, during the chaotic Lebanese Civil War, to try to stabilize Lebanon and prevent broader spillover.\nHowever, even in peacetime, the force has suffered from the worst of the shortcomings associated with other UN peacekeeping forces around the world: inefficiency and unaccountability; serial inaction; and susceptibility to corruption. Though UNIFIL’s political superiors deny it, a former UNIFIL commander admitted these realities.\nEven though UNIFIL saw its mandate strengthened by UN Security Council Resolution 1701 in the wake of the 2006 Second Lebanon War, its track record only got worse after the fact. Despite being granted permission by the UN to take “all necessary action” to disarm Hezbollah in southern Lebanon, UNIFIL did nothing of the sort.\nWhen Israeli forces entered southern Lebanon in late 2024, they found Hezbollah weapons in roughly 1 in every 3 houses, and according to a former Israeli official, Israeli troops uncovered more anti-tank missiles in an average Lebanese village than in all of Gaza.\nDespite claiming to regularly patrol and act across southern Lebanon, UNIFIL passively allowed Hezbollah to evolve from a major threat to Israel, to a borderline existential one. With Iranian help, the terror group grew its arsenal from roughly 15,000 rockets and missiles in 2006, to approximately 150,000 in 2023.\nHezbollah increased its rocket arsenal tenfold, put many of these capabilities intentionally underneath civilian buildings, and built dozens of military bases along the Lebanon-Israel border — much of it in full view of UNIFIL facilities. UNIFIL, by its own account, was routinely stymied in its patrols by Hezbollah.\nUNIFIL cannot plead ignorance to its failure to counteract Hezbollah activity. According to Israeli officials, UNIFIL perpetually ignored Israel’s specific requests — based on detailed intelligence on Hezbollah activity — to act.\nThis inaction explicitly contravened UNIFIL’s mandate to maintain security and disarm non-state actors in southern Lebanon.\nThen, following Hezbollah joining Hamas in waging war on Israel in October 2023, UNIFIL’s serial refusal to carry out its mission played right into Hezbollah’s hands.\nUsing its classic human shield strategy, Hezbollah launched dozens of projectiles at Israel from within several hundred feet of UNIFIL facilities. By doing so, Hezbollah was able to directly complicate Israel’s operations — given Israeli reluctance to risk hitting UN facilities — and coax the all-too-willing UN into rebuking Israel when it did operate against Hezbollah near UN posts.\nFurthermore, even the charitable view that UNIFIL’s inaction was due to risk-aversion is increasingly in doubt.\nLast November, Hezbollah admitted that they bribed UNIFIL peacekeepers to gain access to UN facilities and equipment. This should perhaps come as little surprise given the force’s composition — by even the narrowest definitions, as JINSA has noted, roughly one-third of its current contingent are peacekeepers from countries that routinely criticize or actively boycott Israel.\nWhy would anyone expect a peacekeeper from, say, Malaysia, to risk their life against Hezbollah?\nUNIFIL’s perennial inaction causes another subtle, but significant, problem by preventing Lebanon from assuming full responsibility for its own security. With its current political leadership openly expressing a willingness — and its military increasingly demonstrating an ability — to crack down on Hezbollah, Lebanon should finally carry the counterterrorism baton in its own country. UNIFIL should simply get out of the way, and end the pretense that it’s helping.\nIn UNIFIL’s stead, the United States should work with partners and allies to strengthen the entity that can, and should, take primary responsibility for Lebanon’s security: Lebanon. While working to rid the Lebanese military of any remnants of Hezbollah influence and infiltration, US and partner countries should work to build up the Lebanese Armed Forces (LAF).\nThe LAF, newly emboldened from Israel’s campaign against Hezbollah and Lebanon’s new and improved political leadership, is making strides towards uprooting Hezbollah’s terror activity nationwide. This progress, while still requiring close US oversight, carrots — and, if necessary, sticks — is encouraging.\nLike so many international agencies, UNIFIL is a weak entity with strong self-preservation instincts. That is why the United States should step in and do the job itself when UNIFIL comes up for its annual mandate renewal vote at the United Nations Security Council this month.\nYoni Tobin is a senior policy analyst at the Jewish Institute for National Security of America (JINSA)."
    }
  ],
  "argos_summary": "The U.S. is considering allowing a controversial UN Security Council resolution, authored by France, to renew the mandate of the United Nations Interim Force in Lebanon (UNIFIL), which critics argue has failed to curb Hezbollah's military activities. The draft resolution aims to support the Lebanese Armed Forces in disarming unauthorized armed groups, primarily Hezbollah, while also urging Israel to withdraw from its positions in Lebanon. However, experts warn that UNIFIL has historically been ineffective, allowing Hezbollah to strengthen its arsenal significantly since the 2006 war, and some U.S. analysts are calling for the U.S. to veto the resolution to prevent further empowerment of the terror group.",
  "argos_id": "I6R2LS98M"
}