{
  "url": "https://www.express.co.uk/news/uk/2094129/pub-rape-child-Bridge-Inn-High-Green-breewood",
  "authorsByline": "Eleanor Burleigh",
  "articleId": "4e1b07017b86465e853ab7d3e2a432ab",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6354674.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T09:04:00+01:00",
  "addDate": "2025-08-12T08:22:45.601722+00:00",
  "refreshDate": "2025-08-12T08:22:45.601725+00:00",
  "score": 1.0,
  "title": "Horror as 'child raped in pub' as police hunt 45-65-year-old man",
  "description": "Police want to speak to a middle-aged man in connection with the rape of a child at a countryside pub.",
  "content": "Police have released an e-fit image of a man they want to speak to in connection with the alleged rape of a child at a pub in the English countryside. The child, of an unspecified age, was allegedly attacked at The Bridge Inn in High Green, Breewood, an ancient market town in rural Staffordshire, in 2018. The incident was belatedly reported to Staffordshire Police this year, prompting authorities to release a computer-generated image of an individual they want to speak to in relation to the assault. The force also issued a description of the man, who is said to be between 45 and 65-years-old, around 5ft 6ins tall, and of medium build with dark, greying hair and blue eyes. The West Midlands-based law enforcement has not released further information about the assault.\n\nA spokesperson for Staffordshire Police appealed for anyone with information about the incident, or the man depicted in the e-fit, to contact the force immediately. \"We have issued an image of a man we want to identify following the rape of a child in Brewood,\" they said. \"This incident took place in 2018 at The Bridge Inn in High Green, Brewood.\n\n\"It was reported to us earlier this year. The man is described as aged between 45 and 65, 5ft 6ins tall, of medium build with dark but greying hair, and blue eyes. \"If you recognise this man, or have any information that could help our investigation, please contact us.\" Anyone with information that could help the investigation can contact Staffordshire Police by calling 101 and quoting incident number 310 of 10 March, or via the live chat on the force's website. Reports can also be made anonymously by calling Crimestoppers on 0800 555 111.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/latest/west-midlands",
    "https://www.express.co.uk/news/uk/2094087/starmer-wouldnt-call-shoplifters-scumbags",
    "https://www.express.co.uk/latest/crime",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/news/uk/2094085/man-51-left-ex-girlfriend-s-body-sofa-years-horrifying-hoarder-home",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/latest/police"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Staffordshire Police",
      "weight": 0.09696993
    },
    {
      "name": "The Bridge Inn",
      "weight": 0.093397625
    },
    {
      "name": "incident number",
      "weight": 0.08279516
    },
    {
      "name": "further information",
      "weight": 0.08128907
    },
    {
      "name": "rural Staffordshire",
      "weight": 0.080551565
    },
    {
      "name": "High Green",
      "weight": 0.07790897
    },
    {
      "name": "child",
      "weight": 0.07687999
    },
    {
      "name": "medium build",
      "weight": 0.07516064
    },
    {
      "name": "Staffordshire",
      "weight": 0.07509821
    },
    {
      "name": "information",
      "weight": 0.074005134
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.994140625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9541015625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.91015625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.837890625
    },
    {
      "name": "/News/Other",
      "score": 0.7421875
    }
  ],
  "sentiment": {
    "positive": 0.06592333,
    "negative": 0.5844208,
    "neutral": 0.34965587
  },
  "summary": "Police are seeking a 45-65-year-old man in relation to the alleged rape of a child at a pub in rural Staffordshire in 2018. The incident was only discovered after it was reported to the police this year. Police have released an e-fit image of the man, who is said to be between 45 and 65 years old, around 5ft 6ins tall, and of medium build with dark hair and blue eyes. They have not released any further information about the assault.",
  "shortSummary": "Police have released an e-fit image of a 45-year-old man they want to speak to in connection with the alleged rape of a child in a pub in 2018.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7729b64889634fb6bb9c3ac04fa33b2a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "The Chancellor has sunk the UK economy, but the stock market stands firm. That could change.\nBrooklyn Beckham and Nicola Peltz's vow renewal took an unexpected turn as family...\nMinister asked about reports more than 50,000 migrants have crossed the Channel in...\nEXCLUSIVE: This town's high street thrives on community spirit and independent charm,...\nEuropean leaders, including Sir Keir Starmer, will speak to Donald Trump ahead of his...\nExpress Sport provides all the latest transfer news LIVE.\nThe deal is a looser arrangement than the couple's previous deal.\nBrooklyn Beckham's secret vow renewal has left the Beckham family reeling, as whispers...\nMotoring experts have called for a new \"maximum driving age\" with individuals pulled off the road when they hit a certain birthday.\nThe USGS warned there is a tsunami risk in light of the massive tremor.\nThe closure led to long queues build on the M25.\nThe Duke and Duchess of Sussex have a new agreement with Netflix and there is a reason...\nDaily Express\nThe Russian Embassy in London has hit out at the UK ahead of Putin-Trump peace talks.\nDrought has already been declared in several parts of England.\nBritish drivers have suggested that plans for new older driver rules don't go far...\nAmazon is dishing out the Galaxy Tab S10 FE+ at a handsomely discounted rate.\nThese beaches are stunning and untouched, as tourists largely don't know about them.\nAs Donald Trump prepares for a pivotal meeting with Vladimir Putin, his unexpected...\nA source close to the Sussexes speaks out about the \"wild speculation\" of the last few...\nThe Google Pixel 9a costs less on contract over two years than if you buy it outright,...\nMany tourists are unaware of the regulations which could land them hefty fines.\nEngland clinched the Euro 2025 title last month as the Lionesses defeated Spain in the...\nBBC Breakfast viewers issued the same complaint during an interview on Tuesday's show\nMySweetSmile are the UK's number one teeth whitening brand, and they're celebrating...\nIf the popularity of this cafe is anything to go by I don't think it will be long until we see a lot more of them and the sooner the better if you ask me.\nThe news comes as Russian President Vladimir Putin warned of nuclear war when he...\nJamie Stevens, 51, carried on living in the flat as the body of Anouska Sites, 45,...\nVirgin Media is offering free TVs to those signing up for certain bundles but this...\nBIG DEBATE: Express Sport predict how the 2025-26 Premier League season will pan out...\nA British expat living in Benidorm has warned UK tourists of one \"dangerous\" area.\nAn experienced traveller has highlighted an 'underrated city' in Europe that has...\nIn a small Illinois town, a shocking revelation has left a community reeling. A...\nIt turns out you need to be very careful which room you keep orchids in your home, as certain objects can greatly shorten their lifespan.\nHere's what the major banks have done since the Bank of England reduced the base rate\nA couple has shared their fool-proof way of how to hang a painting or frame onto a...\nA royal book claims Meghan Markle deliberately undermined a royal aide in a \"very...\nThe BBC historical films are a series of adaptations of some of Shakespeare's most...\nThe world's best tennis players are in action at the Cincinnati Open ahead of the last...\nEXCLUSIVE: Meghan Markle could soon make her As Ever products available in the UK.\nCesar Delgadillo, 39, has been charged with homicide, child endangerment, evidence...\nIn the midst of a relentless heatwave, a dramatic overnight storm has left thousands without power. The night sky lit up, but homes were plunged into darkness.\nPolice have issued CCTV images of two women they want to speak to after a man in his...\nThe Duke of Sussex could return to his home country next month.\nThree people, including a child, have died after a shooting in the parking lot of a...\nOne of the first web pioneers is finally about to hang up the phone.\nRussia risks losing 130 small towns amid collapsing industries, poor infrastructure...\nMichael James was found guilty of rape, attempted rape and assault by penetration and...\nLaws prohibiting the item in some areas were recently brought in\nAugust is the ideal month for pruning certain types of roses - learn if this includes the ones you grow in your garden.\nEmma Raducanu suffered another close defeat to Aryna Sabalenka in a thrilling match at...\nWho owns which side of the fence is often a sore subject for neighbours and the number...\nThe 2025 Strictly cast announcements have officially begun\nFox News paused their broadcast as they went live from the White House\nA major star is set to call it quits after a year of shocking storylines leaving fans...\nPrince Josef-Emanuel of Liechtenstein and his wife are now proud parents to two children.\nAn extractor fan is key in any kitchen, but it will only work effectively when it's...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Police in Staffordshire have released an e-fit image of a man they wish to speak to regarding an alleged child rape that occurred in 2018 at The Bridge Inn in High Green, Brewood. The incident was reported to authorities this year, prompting the appeal for information about the suspect, described as a man aged between 45 and 65, approximately 5ft 6ins tall, with medium build, dark greying hair, and blue eyes. Staffordshire Police are urging anyone with relevant information to come forward.",
  "argos_id": "IBNMM8X5U"
}