{
  "url": "https://www.bbc.com/sport/football/articles/c939kwd4153o",
  "authorsByline": "BBC Sport",
  "articleId": "88583a964ae94bc38ef3dfb1fd5cbd87",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3139/live/f8705660-755f-11f0-a20f-3b86f375586a.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T06:50:28.773000+00:00",
  "addDate": "2025-08-12T07:01:48.838387+00:00",
  "refreshDate": "2025-08-12T07:01:48.838388+00:00",
  "score": 1.0,
  "title": "FPL 2025-26: Eight players who could help you win this year, including Wirtz, Fernandes and Murillo",
  "description": "Our Fantasy Premier League experts pick eight players they think will help you have a successful FPL season.",
  "content": "Have you settled on your Fantasy Premier League team yet, or are you still at the tinkering stage? Either way you may want to consider one of these players in your team, according to our FPL experts. Here are the eight players - aside from the obvious premium picks such as Mohamed Salah and Erling Haaland - that we think can help you have a successful season.\n\nPicking defenders in FPL has always been about three things - clean sheet potential, attacking threat and reliability of starting consistently. The new rules around defensive contribution points gives us an important fourth aspect to consider. Van Dijk starts almost every game and Liverpool kept the most clean sheets in the league last season. But it's the defensive contribution points where the Dutchman also shines. Of all the defenders priced at £6m this season, he would have gained the most defensive contribution points (22) in 2024-25. Attacking threat? He has that too. Last season, Van Dijk was joint-top among defenders for headed efforts (21) and joint-sixth for shots in the box (23). He is the perfect 'set and forget' defender to enable using the free transfers elsewhere. New Spurs manager Thomas Frank has history of setting his team up to ensure his leading striker gets big chances consistently. Ivan Toney and Yoane Wissa hit 20 and 19 goals respectively in recent seasons. Add to this the fact that Son Heung-min's departure has left a big gap of goalscoring duties and potentially penalties for Solanke to fill. It doesn't get better than a home game against the promoted Burnley in gameweek one. Worth keeping an eye on Solanke's fitness, however, after a 'minor' injury in pre-season. Frank said Solanke will \"be available quite soon\" but if he doesn't start in Wednesday's Super Cup, the forward is one to wait a couple of weeks for.\n\nFernandes is a great option this season for his consistent output and durability - he's rarely injured and usually plays 90 minutes. In a struggling Manchester United team last season, he still combined goals (eight) with assists (12) and he should improve on those numbers this campaign. The Portuguese midfielder has many routes to points - penalties, set-pieces, open-play assist threat and decent goal threat too. This season we can also have defensive contribution - he would have earned 22 extra points last season. Fernandes' pre-season form has been excellent too, giving him a strong chance to hit the ground running in gameweek one.\n\nNdiaye is an exciting budget pick this season - he'll be looking to beat last season's Premier League goal tally of nine. Priced at £6.5m, he offers excellent value with Everton's favourable early fixture run. Five of their opening seven fixtures provide Ndiaye with the potential for attacking returns as they face Leeds, Brighton, Wolves, West Ham and Crystal Palace. Importantly, Ndiaye has been reclassified as a midfielder this season - but his role in the team will be to support the centre-forward as much as possible. He's also on penalty duty for the Toffees, which is hugely important in FPL. Added bonus - unlike other attacking midfielders he's decent in terms of defensive contributions too.\n\nWood looks like he could be great value once again this season, with Nottingham Forest having excellent opening fixtures against Brentford, Crystal Palace and West Ham. Promotion to the Europa League means no midweek fixtures for his side in August, and keeping Morgan Gibbs-White, one of Forest's best creators, in this window is another key positive. Wood scored 20 goals last season, making a fast start to the campaign. A full pre-season will help him, after injury hampered the latter stages of 2024-25. Rogers has increased in price this season but should remain great value after amassing 19 goal involvements last campaign. He is a reliable player, who regularly completes 90 minutes. Villa have enticing early fixtures, extending across the opening eight gameweeks. Keep a close eye on his fitness before his opening game against Newcastle United, after an ankle issue forced him off in a pre-season game.",
  "medium": "Article",
  "links": [
    "https://www.bbc.com/sport/football",
    "https://www.bbc.com/sport/football/articles/cd6g9l8wdqlo",
    "https://fantasy.premierleague.com/leagues/auto-join/bbcfpl",
    "https://www.bbc.com/sport/football/premier-league/scores-fixtures",
    "https://www.bbc.com/sport/football/premier-league",
    "https://www.bbc.com/sport/football/articles/cwy0pkeyzwgo",
    "https://www.bbc.com/sport/football/articles/ce8e6y90g2jo",
    "https://www.bbc.com/sport/football/premier-league/table",
    "https://www.bbc.com/sport/articles/c4gj7pl3p82o",
    "https://www.bbc.com/sport/football/articles/cj3lx24j662o",
    "https://www.bbc.com/sport/football/articles/c2dje16586ko"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Last season",
      "weight": 0.099155545
    },
    {
      "name": "last season",
      "weight": 0.099155545
    },
    {
      "name": "season",
      "weight": 0.089646354
    },
    {
      "name": "recent seasons",
      "weight": 0.087660015
    },
    {
      "name": "defensive contribution points",
      "weight": 0.07597555
    },
    {
      "name": "excellent opening fixtures",
      "weight": 0.07235278
    },
    {
      "name": "last seasons Premier League goal tally",
      "weight": 0.06665863
    },
    {
      "name": "defensive contribution",
      "weight": 0.06658667
    },
    {
      "name": "defensive contributions",
      "weight": 0.06658667
    },
    {
      "name": "decent goal threat",
      "weight": 0.065826446
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "European Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.99609375
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.93505859375
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.7646484375
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.5
    }
  ],
  "sentiment": {
    "positive": 0.36448923,
    "negative": 0.13949765,
    "neutral": 0.49601313
  },
  "summary": "FPL experts have identified eight players who could help you win the Fantasy Premier League 2025-26 season, including Wirtz, Fernandes, and Murillo. These players are considered as key players for the success of the season, with experts suggesting that Liverpool's Van Dijk could be a standout defender due to his consistent start and defensive contribution points. The new rules around defensive contribution point rules have added a fourth aspect to consider, particularly in the defensive points. Vincent Fernandes is a great option for FPL this season for his consistent output and durability, while Ndiaye is an exciting budget pick for Everton, with the team's favourable early fixture run and potential for attacking returns. Wood could be value value due to Nottingham Forest's excellent opening fixtures against Brentford, Crystal Palace and West Ham.",
  "shortSummary": "Eight players can help you win Fantasy Premier League this season, highlighted by Van Dijk, Fernandes, Ndiaye, Wirtz, and Murillo, with strong defensive contributions and favourable fixtures.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ed0f844bced548b78eb9956dac21d329",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.com/sport/football/articles/c2dje16586ko",
      "text": "Can Salah do it again? Avoid Mbeumo & Cunha? Five key FPL questions\n- Published\nWith a new point-scoring system, price rises and new clubs for some of last season's stars, there's plenty to think about before Fantasy Premier League returns a week today.\nHere, BBC Sport's team of FPL experts - Pras, Holly Shand, Gianni Buttice and FPL Heisenberg - along with Statman Dave from the FPL Podcast from BBC Sport, debate some of the big talking points to help you before the deadline of Friday, 15 August.\nYou can join the BBC Sport League on the official Fantasy Premier League game using the code bbcfpl - or by clicking this link, external.\n- Published7 days ago\n- Published4 August\n- Published4 August\nCan Salah do it again, and is he worth the money?\nMohamed Salah smashed the all-time FPL points record last season, with his 28 goals and 19 assists earning 344 FPL points.\nHe's now priced at £14.5m though, £2m more than last season, which makes him the most expensive midfielder of all time in FPL.\nGianni: Salah is the talisman for the best attack in the league and I have no doubt he's worth the high price tag. Captaincy is a huge part of this game, and more often than not Salah will be the best option for the armband.\nHolly: I'm not wholly convinced that Salah can produce as outstanding a season as 2024-25 but I still expect him to have a fast start and justify his price tag in the early stages of the campaign.\nHe has never blanked in gameweek one, scoring on average 12.25 points per game and Liverpool have strengthened their attack in this transfer window. His momentum may slow, though, with a truncated season for the Africa Cup of Nations.\nPras: Liverpool have brought in some world-class reinforcements already in Florian Wirtz and Hugo Ekitike. This can only further improve their attacking output this year.\nEven though there could be merits in spreading your cash, captaincy is such an important part of playing FPL.\nAnd that means it may still be essential to own Salah. In the first five gameweeks, I can see Salah being the top choice for captaincy in GW1 (Bournemouth at home), GW4 (Burnley away) and GW5 (Everton home).\nI'd advise starting off with Salah, and if the landscape changes then it is easy to distribute that money around the team later instead of scrambling to fit him in later.\nHeisenberg: I still expect him to have a stellar season and he doesn't need to replicate what he did last year to make him an excellent FPL asset. I wouldn't be surprised to see him in and around the top point scorer again.\nI do think he's worth the money, especially when you factor in captaincy.\nWill Mbeumo and Cunha be FPL stars again at Man Utd?\nMatheus Cunha (178 points) and Bryan Mbeumo (236) were talismen for Wolves and Brentford respectively last season. But do they have any chance of repeating those numbers among Manchester United's crowded FPL attacking options?\nHolly: Cunha and Mbeumo (both £8m) are unsurprisingly popular picks in the game, with Manchester United's global fanbase, but I'm a little sceptical of their FPL output in the early stages of the season as they fit into Ruben Amorim's system for their tricky opening games.\nI think Bruno Fernandes (£9m) remains the optimal midfield pick, with his set-piece responsibilities.\nPras: Both players were involved in a significant percentage of goals last season for their clubs, as penalty and set-piece takers. This dynamic is unlikely to be replicated at United.\nPre-season observations indicate that Fernandes will retain responsibility for penalties and continue to serve as the club's principal chance creator. Consequently, their FPL value may decline relative to their prior roles, rendering them potentially riskier selections at their current price points.\nHeisenberg: Both a wait and see for me - the fixtures are mixed for United to start the season and there are plenty of other great options to start the season with.\nIf I do have a United midfielder it'll be Fernandes - penalties, assist threat, minutes guarantee and added bonus of being decent on the defensive contribution points.\nStatman: I wouldn't touch them with a barge pole for the first eight games. This could be a crazy season - this could be either United sitting top after eight games or could be Ruben Amorim getting sacked after eight games.\nGianni: Both will lose penalties which lessens their appeal, but if and when United click in to gear both players will no doubt be good FPL assets. With tough fixtures to start the season and too many unknowns, it's a wait and see for me.\nHolly The two picks I do like from United are Fernandes and Patrick Dorgu (£4.5m). Fernandes will probably have to play a bit deeper next season, but his potential for defensive contribution points could be key. He would have claimed 22 extra points last season, the most of any midfielder priced above £5.5m.\nWing-back Dorgu was a regular threat down United's flanks last season, racking up 10 shots and 12 key passes across 12 Premier League appearances. He is already developing a strong chemistry with Cunha on the left.\nAre any Man City assets worth the rise apart from Haaland?\nPras: Manchester City have made a lot of key signings this summer to add to the returning Rodri and Oscar Bobb. In fact, most of those were made before the Club World Cup, giving us an early look at how Pep Guardiola might set up.\nA total of 24 players started at least one game in that tournament, suggesting Pep Roulette could be in full swing.\nGianni: Erling Haaland (£14m) is arguably the only Manchester City attacker you can guarantee starts every week (when fit). I would however consider Omar Marmoush (£8.5m) who is now reclassified as a midfielder.\nSince his arrival in Manchester the Egyptian started 14 from 16 league games and only Josko Gvardiol had more league minutes than the versatile attacker. Tijjani Reijnders at £5.5m is also worth consideration.\nHeisenberg: I don't think I'll start the season with any City attackers, but I do like the prospect of Marmoush. Should Haaland pick up an injury then you could get an £8.5m midfielder playing centre-forward.\nBut, with potential rotation and minutes-sharing for the City's midfielders, it's possibly best to wait and see how they all fit in.\nHolly: This is one of my biggest dilemmas going into gameweek one. Guardiola is famous for rotating his squad, with further attacking options arriving in this window, making the likes of Marmoush and Phil Foden riskier picks.\nHaaland is in less than a fifth of teams and shouldn't be ignored as an option, netting over seven goal involvements in the opening four gameweeks of the season on average. He makes my latest draft alongside Salah.\nPras: One could make a case for Marmoush, who played 90 minutes 13 times last season since arriving in January, but a lot of those starts came at a time when Haaland was injured, or Foden was out of favour. I just don't trust it - I am keen to avoid all City attackers.\nIs Chelsea's Club World Cup win and lack of summer break a concern?\nHolly: This is another tricky one to call. Chelsea have had the shortest pre-season of any side, with the demands of the football schedule increasing season on season.\nIt's difficult to ignore their assets with two home games in their first three against Crystal Palace and Fulham. I'm backing goalkeeper Robert Sanchez (£5m) to avoid fatigue, and talisman Cole Palmer (£10.5m) to ride the wave of being player of the tournament when Chelsea won the Club World Cup.\nGianni: A lack of pre-season isn't a huge concern for me, and the momentum from the Club World Cup could see a fast start for Enzo Maresca's men who were quick out the blocks last time out. Palmer, Pedro Neto, Joao Pedro and Enzo Fernandez are all attackers to consider.\nPras: Chelsea have a clear run of good fixtures over the medium term - a rarity among the top-six teams. Despite the fatigue from the Club World Cup, it is a team very much on the up.\nMaresca seems to have finally figured out how to unlock Palmer's potential by getting him into the central areas where he thrived in the tournament. He is very likely to make my team in week one. Striker Joao Pedro (£7.5m) too seems to be first choice, but I am more wary with him given the competition from another new signing in Liam Delap (£6.5m).\nBetween gameweeks 27-38 of last season, no team conceded fewer expected goals (xGC) or kept more clean sheets. I would be very tempted therefore to pick one defensive player from the team. It could be Marc Cucurella (£6m) or Sanchez in goal.\nHeisenberg: I'll judge this nearer the start of the season, I'll be paying close attention to any updates from Maresca about the condition of his team and any other relevant news.\nHow will rule changes affect the way we play FPL?\n- Published4 August\nThe key change this season is that outfield players can now earn two bonus points based on the number of defensive actions they make in one match.\nFPL managers now also get double the amount of chips - two Free Hits, two Wildcards, two Bench Boosts and two Triple Captains.\nAnd managers will have their free transfer pool boosted to five transfers before the Africa Cup of Nations in January.\nPras: A two-point return is almost as good as a three-point assist, so picking reliable players with good minutes, mainly centre-backs and defensive midfielders, has become much more viable.\nWe will also need to think about our bench players differently. Players are more likely to accumulate these two-pointers in tougher matches. So is Everton's James Tarkowski (£5.5m) away to Chelsea as bad a fixture as before? Perhaps not.\nHolly: Defensive contribution points give extra utility to centre-backs and we could see a rise in managers opting to play 4-4-2 or 4-3-3.\nWhen it comes to midfielders, FPL managers should embrace the value provided by defensive midfielders such as Chelsea's Moises Caicedo (£5.5m) and Brighton's Carlos Baleba (£5m) for their fourth or fifth midfielder spots.\nStatman: You've got to remember that these defensive contribution numbers are only there if you've picked that player every single game through the season.\nFor example, with Tarkowski, you've got to go through those games against Liverpool and Manchester City, those games where Everton are not favourites, to get those points - so you're really going to have to balance it out in terms of opposition and whether you think they're going to make defensive actions.\nOne team I'm really excited about for defensive contributions is Tottenham under Thomas Frank, because the numbers should shoot up for a number of their players and they've got a lot of £4.5m defenders.\nIn midfield, one player who really stands out is Bruno Fernandes. He would have got 22 extra points last season.\nThe start of the season is rubbish for Manchester United but he's someone that does make a lot of ball recoveries, makes a lot of tackles for his position.\nHeisenberg: The FPL rule changes shift gameplay significantly.\nTwo sets of chips is an interesting change. We'll see greater variety in chip usage in the first half of the season, with no double gameweeks around.\nFive free transfers for Afcon is a rule change I am not a fan of. Properly planning used to lead to an advantage, now everyone gets bailed out for free. However, I plan to maximise these free transfers by effectively having close to an extra wildcard and I won't use it to simply firefight absences from my squad."
    },
    {
      "url": "https://www.bbc.com/sport/articles/c4gj7pl3p82o",
      "text": "Meet BBC Sport's FPL experts\n- Published\nBBC Sport is going big on Fantasy Premier League (FPL) this season and we've signed up four top experts to bring you the very best advice.\nEach week, one of Pras, Holly Shand, FPL Heisenberg and Gianni Buttice will bring you their tips, answer your questions and tackle the most pressing talking points in the FPL world.\nHere's a lowdown on each expert.\nYou can join the BBC Sport League on the official Fantasy Premier League game using the code bbcfpl - or by clicking this link, external.\n- Published4 August\n- Published7 days ago\n- Published4 August\nFPL Heisenberg\nFPL Heisenberg, external (Wes Prickett) is one of the most recognisable names in the FPL world, with seven finishes inside the top 30k in the overall rankings and a best finish of 836th in the world.\nWes has made multiple appearances on Sky Sports, the Premier League and the BBC Fantasy 606 Podcast, to name just a few.\nHe has more than 111k followers on X and you can find him across socials on Instagram, TikTok and YouTube.\nHolly Shand\nHolly Shand, external is one of the most prominent female faces in the FPL punditry world.\nShe is a FPL content creator and pundit for the Premier League, The Athletic & Sky Sports News. Holly has 10 years experience of playing FPL, twice finishing in the top 10K. In 2023, she won a Football Content Award for Best in Fantasy Football Video.\nShe has 89k followers on X, and more than a million likes on TikTok and 38k YouTube subscribers.\nPras\nPras, external is a FPL veteran, having finished in the top 100k in each of the past 13 seasons, boasting five top-10k finishes and nine top-25k finishes.\nHe is the co-host of the popular The FPL Wire podcast, and the Deadline Dilemmas video series on Fantasy Football Scout.\nPras is also a panellist for the Premier League and regularly appears on The FPL Show and the Official FPL 'Off the Bench' Podcast. He has had several guest appearances on the Sky Sports FPL Show.\nHe has 62k followers on X and his podcast has 37k subscribers on YouTube.\nPras is also a partner and lead host of Solio Analytics, a data and analytics-focused platform.\nGianni Buttice\nGianni Buttice, external is an FPL expert and best-selling author of FPL Diary, a guide to winning a guide to top 1% finishes at fantasy football\nHe has only finished outside the top 100k three times in the past 14 seasons and has eight top-50k finishes.\nGianni runs an FPL YouTube channel, is a regular on the Official Fantasy Show, Sky Sports News FPL show and has appeared on the BBC's Fantasy 606 podcast.\nHe has 52k followers on X, 28k on YouTube and more than 800k likes on TikTok."
    },
    {
      "url": "https://www.bbc.com/sport/football/premier-league/table",
      "text": "Premier League Table\nSkip to table key\n| Team | Played | Won | Drawn | Lost | Goals For | Goals Against | Goal Difference | Points | Form, Last 6 games, Oldest first |\n|---|---|---|---|---|---|---|---|---|---|\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n10Fulham | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n|\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| |\n| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n|\nKey\n- Position 1, 2, 3, 4 : UEFA Champions League\n- Position 5 : UEFA Europa League\n- Position 18, 19, 20 : Relegation"
    },
    {
      "url": "https://www.bbc.com/sport/football/premier-league/scores-fixtures",
      "text": "Saturday 16th August\n- Aston Villa versus Newcastle United kick off 12:30Aston Villa12:30playsNewcastle United\n- Brighton & Hove Albion versus Fulham kick off 15:00Brighton & Hove Albion15:00playsFulham\n- Sunderland versus West Ham United kick off 15:00Sunderland15:00playsWest Ham United\n- Tottenham Hotspur versus Burnley kick off 15:00Tottenham Hotspur15:00playsBurnley\n- Wolverhampton Wanderers versus Manchester City kick off 17:30Wolverhampton Wanderers17:30playsManchester City\nSunday 17th August\n- Chelsea versus Crystal Palace kick off 14:00Chelsea14:00playsCrystal Palace\n- Nottingham Forest versus Brentford kick off 14:00Nottingham Forest14:00playsBrentford\n- Manchester United versus Arsenal kick off 16:30Manchester United16:30playsArsenal\nMonday 18th August\n- Leeds United versus Everton kick off 20:00Leeds United20:00playsEverton\nFriday 22nd August\n- West Ham United versus Chelsea kick off 20:00West Ham United20:00playsChelsea\nSaturday 23rd August\n- Manchester City versus Tottenham Hotspur kick off 12:30Manchester City12:30playsTottenham Hotspur\n- AFC Bournemouth versus Wolverhampton Wanderers kick off 15:00AFC Bournemouth15:00playsWolverhampton Wanderers\n- Brentford versus Aston Villa kick off 15:00Brentford15:00playsAston Villa\n- Burnley versus Sunderland kick off 15:00Burnley15:00playsSunderland\n- Arsenal versus Leeds United kick off 17:30Arsenal17:30playsLeeds United\nSunday 24th August\n- Crystal Palace versus Nottingham Forest kick off 14:00Crystal Palace14:00playsNottingham Forest\n- Everton versus Brighton & Hove Albion kick off 14:00Everton14:00playsBrighton & Hove Albion\n- Fulham versus Manchester United kick off 16:30Fulham16:30playsManchester United\nMonday 25th August\n- Newcastle United versus Liverpool kick off 20:00Newcastle United20:00playsLiverpool\nFriday 29th August\n- Aston Villa versus Crystal Palace kick off 20:00Aston Villa20:00playsCrystal Palace\nSaturday 30th August\n- Chelsea versus Fulham kick off 12:30Chelsea12:30playsFulham\n- Manchester United versus Burnley kick off 15:00Manchester United15:00playsBurnley\n- Sunderland versus Brentford kick off 15:00Sunderland15:00playsBrentford\n- Tottenham Hotspur versus AFC Bournemouth kick off 15:00Tottenham Hotspur15:00playsAFC Bournemouth\n- Wolverhampton Wanderers versus Everton kick off 15:00Wolverhampton Wanderers15:00playsEverton\n- Leeds United versus Newcastle United kick off 17:30Leeds United17:30playsNewcastle United\nSunday 31st August\n- Brighton & Hove Albion versus Manchester City kick off 14:00Brighton & Hove Albion14:00playsManchester City\n- Nottingham Forest versus West Ham United kick off 14:00Nottingham Forest14:00playsWest Ham United\n- Liverpool versus Arsenal kick off 16:30Liverpool16:30playsArsenal\nAll times are UK and subject to change. BBC is not responsible for any changes."
    },
    {
      "url": "https://www.bbc.com/sport/football/articles/cj3lx24j662o",
      "text": "Who to pick, who to avoid - your team's FPL assets ranked\n- Published\nTo help Fantasy Premier League managers as you tinker with your teams before Friday's deadline, we've gone through all 20 teams and ranked some of their assets.\nOur four experts - Pras, FPL Heisenberg, Gianni Buttice and Holly Shand - have each chosen:\na differential pick - a low-owned player who could end up being an FPL star;\na player to avoid - an asset unlikely to justify their price tag or be productive enough to win your league.\nBBC Sport has also highlighted a talisman - each team's star player.\nYou can join the BBC Sport League on the official Fantasy Premier League game using the code bbcfpl - or by clicking this link, external.\n- Published4 days ago\n- Published7 days ago\n- Published4 August\nArsenal\nTalisman: Bukayo Saka (£10m)\nLast season was the first since 2020-21 that Saka did not reach 20 goal involvements in the Premier League - he got 17 and that was after missing nearly half the campaign with injury.\nThere are a couple of question marks around him this season. Will his minutes be managed more and will new striker Viktor Gyokeres want to take penalties? - but Saka is a pretty safe bet to get 200 FPL points if fit.\nDifferential: Declan Rice (£6.5m)\nHolly: Midfielder Rice carries extra appeal this season given the introduction of defensive contribution points, having already been involved in Arsenal's set-pieces.\nHe accumulated 11 goal involvements last season and would have received an additional 18 points on this new metric. Arsenal host promoted Leeds United too in Gameweek 2.\nPlayer to avoid: Gabriel (£6m)\nHolly: Centre-back Gabriel was one of the most popular picks in the game when it launched in mid-July, but he has only played 28 minutes in pre-season.\nThat has seen his popularity wane somewhat. Mikel Arteta said he is on track to be available for gameweek one, but we need concrete news before investing, given the defensive options Arsenal have.\nAston Villa\nTalisman: Ollie Watkins (£9m)\nWatkins is such a reliable FPL asset with 50 goals and 34 assists over the past three seasons. His FPL points in that time were 178, 228 and 186.\nSo you know what you're getting at an enticing price. His only downside is the lack of penalties - Youri Tielemans is likely to be Villa's designated taker - but don't let that put you off.\nDifferential: Donyell Malen (£5.5m)\nHeisenberg: The Netherlands midfielder has been in great pre-season form, only costs £5.5m and has an eye for goal.\nHe may even get some minutes in the centre-forward position if Watkins gets injured or subbed early. The only concern with Malen is the insecurity of minutes but, at that price point, he's potentially worth a gamble.\nPlayer to avoid: Alex Moreno (£4m)\nHeisenberg: Moreno is the fourth-highest-owned Villa player in over 11% of FPL teams.\nHowever, he's third-choice left-back behind Lucas Digne and Ian Maatsen - he won't feature much this season. He's only £4.0m, but, if you want a super cheap defender go for the likes of Maxime Esteve (Burnley), Reinildo Mandava (Sunderland) or Gabriel Gudmundsson (Leeds). They're also £4.0m but they're likely to be regular starters.\nBournemouth\nTalisman - Evanilson (£7.5m)\nThe Brazilian striker scored 10 goals in 28 starts and he underperformed his expected goals by nearly three, when forwards tend to outperform xG.\nThat suggests he has more goals in his locker and he was already involved in 35% of his team's goals when on the pitch.\nWith question marks around Justin Kluivert's fitness, Evanilson could be on penalties too and, if he gets a full season under his belt, that 10-goal mark from 24-25 is easily beatable.\nDifferential: Antoine Semenyo (£7m)\nPras: The midfielder enjoyed a strong 24-25, scoring 11 goals and assisting seven times across 37 matches. Only Mohamed Salah and Cole Palmer attempted more shots.\nShould he improve on his 8.8% shot conversion there is a real possibility he makes his £7m price tag look like a bargain. At just 5.5% ownership at the time of writing, he could rival Aston Villa's Rogers and Spurs midfielder Mohammed Kudus in the same price bracket.\nPlayer to avoid: Marcos Senesi (£4.5m)\nPras: Bournemouth have sold Dean Huijsen, Kepa Arrizabalaga and Milos Kerkez already this summer. It is possible Illia Zabarnyi leaves as well. While this immediately makes defensive assets like Senesi tempting at their price, I'd avoid going there simply as a regular defence has been affected and a new one may take some time to settle.\nBrentford\nTalisman: Kevin Schade (£7m)\nIt might surprise you Schade was the 14th highest-scoring midfielder last season and with Bryan Mbeumo gone, Brentford will be hoping the German can fill the creative gap.\nSchade scored 11 times last season - seven from January onwards - in just 26 starts. Brentford scored more goals than fourth-placed Chelsea last season so the potential is there for Schade to be a steal at £7m if the Bees carry on in that vein.\nDifferential: Igor Thiago (£6m)\nGianni: In February 2024, the Brazilian joined Brentford for a club-record £30m fee and a growing reputation. Fast forward 18 months and he's only made eight appearances, scoring no goals.\nNow fully recovered from a meniscus injury, he will surely lead the line this season. Under 1% owned, he could be the best £6m forward in the game.\nPlayer to avoid: Nathan Collins (£5m)\nGianni: Collins is the highest owned but also the highest priced Brentford defender. He does well for defensive actions - two goals and seven assists last season - but £5m is too much to spend on a defender that won't keep many clean sheets and has only five league goals in his past four seasons.\nBrighton\nTalisman: Kaoru Mitoma (£6.5m)\nThe Japan forward is another one of those players who would be FPL gold dust if he could stay fit for a season.\nMitoma was Brighton's joint-top scorer (10) and had the most key passes and big chances created. All that from just 28 starts make him the Brighton midfielder of choice and a potential bargain.\nDifferential: Danny Welbeck (£6.5m)\nPras: Welbeck - in just 7.8% of teams - is one of the rare forwards under £7m, play for a top-10 team and also very likely to be on penalties (following Joao Pedro's departure).\nBrighton were ranked joint fifth for goals scored last season, racking up 66 in total. At 34, Welbeck is of course prone to injuries and rest, but clocking more than 2,000 minutes last season, where he got 10 goals, four assists, is not bad at all.\nPlayer to avoid: Georginio Rutter (£6m)\nPras: Big things were expected from Rutter when he was signed for a club-record deal from Leeds a year ago. The Frenchman disappointed, however, delivering less than 100 FPL points and playing under 2,000 minutes, despite injuries to Joao Pedro and Welbeck at various points.\nDespite Joao Pedro's move to Chelsea leaving an opportunity up front, I would avoid Rutter initially.\n- Published4 August\n- Published4 August\nBurnley\nTalisman: Jaidon Anthony (£5.5m)\nIt's hard to highlight a talisman from a promoted side, but winger Anthony scored eight goals and had seven assists in the Championship last season.\nHe looks likely to be a creative spark again for Burnley - he had 81 key passes last season - and his price point makes him a great enabler if you prefer him to a defensive midfielder.\nDifferential: Maxime Esteve (£4m)\nHolly: We've seen from data for last season that centre-backs from promoted teams can perform very well for defensive contributions, which sees Burnley's Esteve as a top pick.\nHe comes in as one of the lowest-priced defenders in the game, with some kind early fixtures including Sunderland in gameweek two. Rotate him with a Spurs defender.\nAvoid: Aaron Ramsey (£4.5m)\nHolly: Ramsey is the bandwagon £4.5m midfielder but should be avoided, with better options from other sides at this price point.\nHe missed most of last season with a knee injury and is unproven at Premier League level. It's a surprise to see the 22-year-old former Aston Villa man in 12.8% of teams.\nChelsea\nTalisman: Cole Palmer (£10.5m)\nYou don't need to say much about Palmer really. He was the top scoring player two seasons ago and had 25 goal contributions last term, even he fizzled out a bit towards the end.\nIs he under-priced at £10.5m? Only Mohamed Salah really rivals him for talisman status and everything Chelsea do flows through Palmer.\nDifferential: Pedro Neto (£7m)\nHeisenberg: The Portuguese midfielder is usually a player I avoid due to rotation worries and his injury record. However, with 10 goal contributions last season and a strong Fifa Club World Cup, he's now fully settled at Chelsea and could be their best differential asset.\nAvoid: Joao Pedro (£7.5m)\nHeisenberg: The Brazil striker is a great player but I see two problems.\nFirstly, he could and almost certainly will share minutes with Liam Delap. Secondly, he was on penalties at Brighton which was a big plus point, but this won't be the case at Chelsea because Palmer will take them.\nCrystal Palace\nTalisman: Eberechi Eze (£7.5m)\nPalace's attack is really a three-headed monster, with Eze, Ismaila Sarr and Jean-Philippe Mateta having 16, 15 and 16 goal involvements respectively last season.\nEze is the leader of the pack though, having had a hand in 35% of Palace's goals while on the pitch and almost double (102 to 59) the amount of shots to Sarr.\nWhich suggests he can improve on his eight goals with better finishing.\nDifferential: Jean-Philippe Mateta (£7.5m)\nGianni: The Frenchman is in fewer than 6% of teams and has a lot of competition at his price point with Dominic Solanke and Chris Wood being much more popular.\nMateta has an impressive 30 league goals and nine assists over the past two seasons and looks very happy playing as the focal point in Oliver Glasner's 3-4-2-1 formation.\nAvoid: Tyrick Mitchell (£5m)\nGianni: Mitchell is a solid defender and an important part of the team, but when it comes to FPL he doesn't stand out as best in class for any metric.\nAt the same £5m price, team-mate Maxence Lacroix is the pick for those looking to benefit from bonus points and defensive action points and, for £0.5m more, Daniel Munoz is an attacking output machine.\nEverton\nTalisman - Iliman Ndiaye (£6.5m)\nNdiaye has been reclassified as a midfielder this season but will essentially play as a second forward, he is on penalties and will be confident of beating last season's nine goals.\nAt £6.5m he is one of the cheapest penalty-taking midfielders you can find and Everton start the season with games against Leeds, Brighton, Wolves, West Ham and Crystal Palace in their first seven.\nDifferential: James Tarkowski (£5.5m)\nPras: The centre-back accumulated more defensive contribution points than any other Premier League player last season.\nMore than 75% of his appearances would have met the two-point threshold for defensive contributions under this season's new point-scoring system. Consequently, Everton's fixture schedule may be less critical; a clean sheet could yield between eight and 11 points for Tarkowski. This makes him a valuable differential option and justifies his price tag.\nPlayer to avoid - Beto (£5.5m)\nPras: The striker delivered eight goals in the second half of last season when stepping in for an injured Dominic Calvert-Lewin. However, manager David Moyes has made recent comments about wanting more from Beto and when that is put into context of Everton signing Thierno Barry as direct competition - I would avoid going there, despite the appealing price.\nFulham\nTalisman: Raul Jimenez (£6.5m)\nAlex Iwobi (£6.5m) was Fulham's top point-scorer last season and both he and Jimenez are Fulham's best picks, with 15 goal involvements each in 24-25.\nMexican striker Jimenez has penalties though and that sets him apart if he maintains his first-choice status. He scored 12 goals from 30 starts last season.\nDifferential: Joachim Andersen (£4.5m)\nHolly: Andersen is quickly becoming one of my favourite defenders at this price point, where 26 defensive contribution points would have been a welcome boost.\nHe could be a useful asset to rotate with a Nottingham Forest defender, in order to target both of their promising early fixtures.\nPlayer to avoid: Rodrigo Muniz (£5.5m)\nHolly: Muniz is more highly owned than Jimenez in FPL right now, which comes as a surprise when Jimenez is currently their first- choice striker.\nThey shared minutes last season, with Muniz often coming on as a substitute for the final 20 minutes of games. He provided nine goal involvements.\nLeeds\nTalisman: Dan James (£5.5m)\nJames had 12 goals and nine assists in the Championship last season and we've seen in Leeds' recent spells in the top flight that they can provide some FPL gems - who remembers goalscoring defender playing in midfield Stuart Dallas?\nJames is one of Leeds' first-choice midfield assets and could be the budget enabler you need at £5.5m.\nDifferential: Gabriel Gudmundsson (£4m)\nHeisenberg: A £4m defender who should be nailed on to start for Leeds. He has more attacking threat than Rodon (also £4.0m) as he may take some set-pieces and he has also played in a midfield role previously in his career.\nPlayer to avoid: Patrick Bamford (£5m)\nHeisenberg: Bamford was our FPL cult hero under Marcelo Bielsa in the 2020-21 season, amassing a huge 28 attacking returns, and he is the third-highest owned Leeds player in drafts at the moment.\nBut don't be expecting those heroics again as Daniel Farke confirmed he is not part of his plans for this upcoming season.\nLiverpool\nTalisman: Mohamed Salah (£14.5m)\nThe best player in the game, coming off the back of a historic season.\nThe question is, can he do it again and is he worth the increased price?\nOur four experts debated that point in our 'Burning Questions' article.\nDifferential: Cody Gakpo (£7.5m)\nGianni: Clocked 15 league attacking returns last season and has played his way in to being first choice on Liverpool's left side while scoring some important goals. Now rightly classified as a midfielder, £7.5m could prove to be exceptional value.\nAvoid: Dominik Szoboszlai (£6.5m)\nGianni: Liverpool's second-best midfielder last season with 143 points (six goals and 10 assists), but Florian Wirtz has played most of his pre-season minutes as a number 10 in a 4-2-3-1, leaving Szoboszlai's starting place at risk.\nRyan Gravenberch and Alexis Mac Allister often feel untouchable and Hungarian Szoboszlai is the most likely of the three to miss out regularly.\nManchester City\nTalisman: Erling Haaland (£14m)\nThe Norwegian striker scored 22 goals and returned 181 FPL points in what was considered a disappointing season for him.\nHe's City's main man and if he can return to nearer the 45-return 22-23 season then he is worth every penny of that £14m.\nFPL managers just need to work out if they want Haaland or Salah, can afford both or want to risk it with neither.\nDifferential: Tijjani Reijnders (£5.5m)\nPras: If the Dutchman secures a regular spot in central midfield, he has the potential to be exceptional value at his price tag.\nHis style of play is reminiscent of Ilkay Gundogan, and last season he registered 77 shots for AC Milan, placing him among the top 10 in Serie A. He also demonstrated a clinical edge, scoring 10 goals from an expected goals tally of 8.34.\nPlayer to avoid: Omar Marmoush (£8.5m)\nPras: The Egyptian forward featured for the full 90 minutes in 13 matches last season, which is noteworthy for a player who joined in January. However, many of these appearances occurred during periods when Haaland was injured or Phil Foden was not regularly selected.\nWith the addition of new signings such as Rayan Cherki, plus Foden's recent strong performances in the Club World Cup, Marmoush's playing time at the start of this season seems uncertain to me.\nManchester United\nTalisman: Bruno Fernandes (£9m)\nDespite some uncertainty over his playing position, Fernandes is a 90-minute man, consistent and at the heart of United's play.\nHe has penalties, set-pieces and open-play assist threat, on top of his goals, with eight goals and 12 assists last season.\nWith the new defensive contribution points, Fernandes would have been the fourth-best midfielder last season with 22 extra points.\nDifferential: Patrick Dorgu (£4.5m)\nHolly: Dorgu carries plenty of promise if he can nail down the left wing-back role in Ruben Amorim's system. He has been attacking in some of their pre-season games.\nHis inclusion does come with its risks though, as he could easily be left on the bench, so be sure to have cover for him.\nPlayer to avoid: Bryan Mbeumo (£8m)\nHolly: United's big money signing Mbeumo was inevitably going to be popular in FPL, with around 18% of managers acquiring his services.\nBut it's unlikely he will be as prolific as he was at Brentford, where he was the talisman of the side and heavily involved in their set-pieces.\nNewcastle\nTalisman and player to avoid: Alexander Isak (£10.5m)\nHeisenberg: We have a unique situation with Newcastle, where their star man - Alexander Isak - wants to leave but may well end up staying.\nIsak is Newcastle's best FPL asset by far (he scored 211 points last season), but manager Eddie Howe has said he \"can't involve\" the Swedish striker in the team at the moment, with speculation about a move to Liverpool.\nHe's one to avoid from the off until we get clarity on his future, but if he returns to the Newcastle starting XI he will once again be the striker to pick.\nRead the latest on Isak's future\nDifferential: Anthony Gordon (£7.5m)\nHeisenberg: Gordon has the potential to have an excellent season. He's in just over 3% of FPL teams, but he might be on penalty duty this season if Isak leaves.\nLast season was underwhelming for Gordon, with 12 attacking returns. He'll be looking to return to the level of output he achieved the season before with a huge 27 attacking returns.\nNottingham Forest\nTalisman: Chris Wood (£7.5m)\nWood scored 20 goals last season and finished with 200 points, second only to Isak among strikers.\nStill on penalties, still with very little competition - he might not match last season but Wood has everything in place to be a great FPL pick again and is a very safe bet to stick in your opening drafts, given Forest's kind opening run of games.\nDifferential: Neco Williams (£5m)\nGianni: Both Nottingham Forest full-backs are worth consideration, but Williams beats Ola Aina in the vast majority of defensive and attacking metrics.\nAina played more minutes last season and therefore earned more FPL points which is why he's now highly owned but Williams is the better pick for those buying a £5m defender at Forest.\nPlayer to avoid: Taiwo Awoniyi (£5.5m)\nGianni: If you're buying a £5.5m forward, make sure it's one that gets game time. Awoniyi won't see many league minutes this season.\nIt wasn't that long ago the Nigerian was Nottingham Forest's first choice number nine, but he's slipped to third in the pecking order behind Wood and new signing Igor Jesus.\nSunderland\nTalisman: Simon Adingra (£5.5m)\nThe Ivory Coast winger impressed in spells at Brighton, when given game time, and Sunderland have spent £20m to bring him to the Stadium of Light.\nHe's likely to nail down a starting spot on the left wing for the Black Cats and that consistency should lead to more FPL returns - with 25 starts two seasons ago he scored six times and was close to 100 points.\nDifferential: Granit Xhaka (£5m)\nPras: Xhaka made 33 Bundesliga appearances for Bayer Leverkusen last season, scoring twice and providing seven assists. He will likely have to play a bit deeper at Sunderland, having previously lined up as one of two central midfielders in a 3-4-2-1 formation at Leverkusen, but it should help boost his defensive contributions.\nHe averaged 7.6 per 90 of those (with 12 needed to gain two points) in his final season at Arsenal, but this will undoubtedly increase playing for a newly-promoted club. At just £5m, he could be the enabler your team needs to afford the other premium picks.\nPlayer to avoid: Reinildo (£4m)\nPras: Sunderland had the fourth-best defence in the Championship last season but their 17 clean sheets were significantly less than Burnley (30) and Leeds (25), suggesting they might not keep many in the Premier League.\nReinildo is a new signing to play left-back, but three goals and one assist in 140 La Liga and Ligue 1 outings suggests attacking returns are going to be in short supply. Despite the £4m price tag, I will be avoiding him and any other Sunderland defenders.\nTottenham\nTalisman: Dominic Solanke (£7.5m)\nSpurs have a host of midfield options but Solanke is clearly the man up front.\nWith Son Heung-min gone, penalties are his and he is now playing under a manager - Thomas Frank - whose tactics resulted in a 20-goal striker and a 19-goal striker last season.\nJust keep an eye on his injury status - Solanke might be one to bring in once fully fit.\nDifferential: Cristian Romero (£5m)\nHolly: Spurs have some strong opening fixtures, including Burnley at home in gameweek one and Bournemouth in gameweek three. Investing in their defence is a wise move.\nWhen considering options, look at centre-back Romero as a reliable route into this defence at a reasonable price, with solid clean sheet potential under Frank.\nAvoid: Mohammed Kudus (£6.5m)\nHolly: Ghana midfielder Kudus is a very popular pick in the game, owned by 26% of FPL managers. However, it's unclear what his role will be in this Spurs attack.\nSolanke is the safer route to start the season, if fit. Remember that Kudus only produced nine goal involvements last season.\nWest Ham\nTalisman: Jarrod Bowen (£8m)\nIt's a shame Bowen has been reclassified as a striker, but he is still going to end up as West Ham's highest points scorer.\nBowen has had 24 goal contributions in each of the past two seasons and, if he does play as a central striker, he should better his 13 goals from last season.\nDifferential: El Hadji Malick Diouf (£4.5m)\nHeisenberg: Left-back Diouf looks like the pick from the West Ham defence, if you want to go there. He's in less than 4% of FPL teams but he'll have greater attacking threat compared to the other West Ham defenders. He has a wand of a left foot and I like his assist potential.\nPlayer to avoid: Aaron Wan-Bissaka (£4.5m)\nHeisenberg: Wan-Bissaka is overhyped currently. There are plenty you should avoid from West Ham (most of their assets in my opinion) but I wanted to highlight Wan-Bissaka because of his high ownership (30.9%).\nHe wasn't great for defensive contribution points last season - if you want a West Ham defender I prefer Diouf.\nWolves\nTalisman: Jorgen Strand Larsen (£6.5m)\nThe Norwegian had a stunning end to last season with seven goals in his past nine games, to finish with 14 in his debut Premier League season.\nWith Matheus Cunha gone, the striker will be even more of a focal point for Wolves and likely to be on penalties. A bargain at £6.5m.\nDifferential: Jhon Arias (£5.5m)\nGianni: The Colombian comes with a big reputation after delivering for Fluminense in the Club World Cup. No player created more chances in the tournament than Arias.\nThe attacking midfielder could be a steal at £5.5m but there are question marks over a start in gameweek one as he is integrated to the Wolves squad.\nAvoid: Hwang Hee-chan (£6m)\nGianni: Hwang is the most expensive midfielder at Wolves and is unlikely to even be a starter at Molineux when all are fit. Swerve him."
    },
    {
      "url": "https://www.bbc.com/sport/football",
      "text": "Football\n- Live.\nTransfer news: Spurs exploring deal for Eze plus latest on Grealish to Everton\nAll the latest transfer news as Jack Grealish closes in on a loan move from Manchester City to Everton plus the latest gossip.\n- Attribution\n- Attribution\n- Posted8 hours ago\n- Attribution\n- Posted2 hours ago\n- Attribution\n- Posted2 hours ago\n- Attribution\n- Posted1 hour ago\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted18 hours ago\n- Comments\n- Attribution\n- Posted19 hours ago\n- Comments\n- Attribution\n- Posted10 hours ago\n- Attribution\n- Posted10 hours ago\n- Attribution\n- Posted1 hour ago\n- Comments\nFootball video\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted6 days ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted2 August\nScores & Fixtures\n- UEFA Champions LeagueplaysQarabağAggregate score 1ShkendijaAggregate score 0\n- UEFA Champions LeagueplaysFenerbahçeAggregate score 1FeyenoordAggregate score 2\n- UEFA Champions LeagueplaysKøbenhavnAggregate score 0Malmö FFAggregate score 0\n- UEFA Champions LeagueplaysPafosAggregate score 1Dynamo KyivAggregate score 0\n- UEFA Champions LeagueplaysViktoria PlzeňAggregate score 0RangersAggregate score 3\n- UEFA Champions LeagueplaysClub BruggeAggregate score 1Red Bull SalzburgAggregate score 0\n- UEFA Champions LeagueplaysFerencvárosAggregate score 0Ludogorets RazgradAggregate score 0\n- UEFA Champions LeagueplaysSlovan BratislavaAggregate score 0KairatAggregate score 1\n- UEFA Champions LeagueplaysBenficaAggregate score 2NiceAggregate score 0\n- UEFA Champions LeagueplaysRed Star BelgradeAggregate score 3Lech PoznańAggregate score 1\nSpanish FA approves plans for La Liga match in USA\nThe Spanish FA approves plans to host December's La Liga match between Villarreal and Barcelona in the USA.\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted1 day ago\n- Comments\n- Attribution\n- Posted5 hours ago\n- Attribution\n- Posted1 day ago\n- Comments\n- Attribution\n- Posted23 hours ago\n- Comments\n- Attribution\n- Posted22 hours ago\n- Comments\nMore top stories\nRangers 'can't ease off' despite three-goal lead - Martin\nRussell Martin says there is still pressure on Rangers, despite the buffer they take into the second leg of their Champions League third qualifying round tie at Viktoria Plzen.\n- Attribution\n- Coverage starts at18:00\n- Attribution\n- Posted1 day ago\n- Comments\n- AttributionBBC Radio 5 Live\n- Available for over a year\n- Attribution\n- Posted14 hours ago\n- Attribution\n- Posted1 day ago\n- Comments\nOnly from the BBC\n- Attribution\n- Posted7 June\n- Attribution\n- Posted28 January\n- Attribution\n- Posted27 July 2024\n- Attribution\n- Posted15 May 2024\n- Attribution\n- Posted3 April\nFootball Extra newsletter\nBringing you opinion and analysis behind the main stories each weekday\nIs it time to start giving 'disruptors' Chelsea some credit?\nChelsea's recent approach has been difficult to understand at times - but Nizaar Kinsella wonders whether it is time to start giving them some credit.\n- Attribution\n- Posted2 days ago\n- AttributionBBC Radio 5 Live\n- Available for 28 days\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted1 day ago\nGet the latest news, fan views, analysis & gossip from the clubs that interest you\nMore football video\n- Attribution\n- Posted31 July\n- Attribution\n- Posted29 July\n- Attribution\n- Posted29 July\n- Attribution\n- Posted28 July\n- Attribution\n- Posted29 July\nInsight: Must-read football stories\nNapoli 'smell blood' & target Premier League's discarded stars\nAfter Scott McTominay was a hit, Napoli went back to the Premier League for Kevin de Bruyne, could more players follow them to Serie A?\n- Attribution\n- Posted9 December 2024\n- Attribution\n- Posted22 August 2024\n- Attribution\n- Posted15 August 2024\n- Attribution\n- Posted13 August 2024\nMore to explore\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted4 days ago\n- Comments\n- Attribution\n- Posted20 hours ago\n- Attribution\n- Posted29 July\n- Attribution\n- Posted28 July\n- Attribution\n- Posted24 July\n- Attribution\n- Posted16 June\nMan Utd, Newcastle... or neither? Sesko's choices\nThe pros and cons of striker Benjamin Sesko joining Manchester United or Newcastle - or choosing to stay at RB Leipzig.\n- Attribution\n- Posted4 August\n- Attribution\n- Posted3 August\n- Attribution\n- Posted4 August\nRaskin affected by 'uncertainty' over Rangers future\nRangers midfielder Nico Raskin has been impacted by \"uncertainty\" over his future at the club, according to head coach Russell Martin.\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted19 hours ago\n- Attribution\n- Posted1 hour ago\n- AttributionBBC Radio Scotland\n- Available for 7 days\n- Attribution\n- Coverage starts at18:00\n- Attribution\n- Posted14 hours ago\n- Attribution\n- Posted18 hours ago\nCarter feared James would face 'astronomical' racist abuse\nJess Carter feared team-mate Lauren James would suffer \"astronomical\" racist abuse had she been the only England player to miss in the Euro 2025 shootout with Sweden.\n- Attribution\n- Posted8 hours ago\n- Attribution\n- Posted17 hours ago\n- Attribution\n- Posted14 hours ago\n- Attribution\n- Posted10 hours ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago"
    },
    {
      "url": "https://www.bbc.com/sport/football/articles/cd6g9l8wdqlo",
      "text": "What's changed in FPL for 25-26?\n- Published\nFantasy Premier League (FPL) has returned for the 2025-26 season and includes some updated features.\nAs well as price alterations and plenty of new arrivals into the league, there have also been announcements of new ways to score points and extra chips to apply to your team throughout the campaign.\nHere is a look at everything we know about the latest version of the game.\nYou can join the BBC Sport League on the official Fantasy Premier League game using the code bbcfpl - or by clicking this link, external.\nGet in touch\nSend us your questions\nPut your chips in\nA big change for the new season is players are now allowed two uses of all four chips.\nThey are: bench boost, free hit, triple captain and wildcard. Players will now be permitted one use of each chip in the first half of the season and another in the second.\nBench boost is where the points of all four of a team's substitutes count towards a total score in that gameweek.\nFree hits allow players to temporarily change as many players as they wish in a single gameweek, but their team will be reset to how it was in the following week.\nTriple captain is where a team's captain's score is tripled instead of doubled for a single gameweek.\nA wildcard allows a player to make unlimited permanent transfers to their team in a single gameweek.\nUnlike last year, the assistant manager chip will no longer be available.\nDefences could win titles\nOutfield players will now earn bonus points based on the number of defensive actions they make in one match.\nFor defenders, clearances, blocks, interceptions and tackles all count as defensive involvements.\nFor midfielders and forwards, clearances, blocks, interceptions, tackles and ball recoveries are classified as such.\nFor every 10 defensive actions, a defensive player makes in a single match, they will receive two bonus points. For midfielders and forwards, two points are awarded for every 12 actions made.\nHad this been in play for the 2024-25 season, Everton's James Tarkowski would have been the top-scoring player for defensive involvements. He would have earned 44 bonus points - four more than any other player.\nChelsea midfielder Moises Caicedo would have been the best-performing midfielder in this metric with 42 bonus points - six more than any other player.\n- Published7 days ago\n- Published4 August\n- Published4 August\nChanges to bonus points and assists\nThere have also been changes to how bonus points are awarded.\nBonus points are given to the best three players in each match based on the Bonus Points System (BPS) that comprises of statistics from Opta.\nPreviously, goalkeepers would get two BPS points for each save made. For saves of shots from inside the box, that has now increased to three, with shots from outside remaining at two.\nA saved penalty would have previously given a goalkeeper nine BPS points. That has been reduced to eight for the save, but is balanced out by an increase to shots from inside of the penalty area being saved.\nAll scored penalties are now worth 12 BPS points, regardless of a player's position. That was previously 18 and 24 points for midfielders and forwards respectively.\nMaking a goalline clearance has tripled in value from three BPS points to nine.\nThe final change to BPS points is tackles. All successful tackles are worth two BPS points. Previously, two points were awarded the number of net tackles completed (tackles won minus tackles lost).\nThere have also been changed into what is now being classed as an assist in order to allow for more.\nFor assists that took a deflection off a defender, assists will now be awarded regardless of whether the assist reached its intended target, providing it only took one touch off a defender and was received by the goalscorer inside the penalty area.\nUnforced defensive errors will also now lead to an assist being given by the player whose pass led to it, as long as the defensive error in question is not a missplaced pass.\nAgain, the maximum one touch from a defender rule remains in play.\nPlayers will now also earn an assist if they earn a penalty or free-kick that is scored via a handball, regardless of whether it was forced or unforced.\nExtra transfers for Afcon\nThe 2025 Africa Cup of Nations will take place during the Premier League season.\nTo help players navigate the prospect of losing a number of their players to the tournament, all managers will receive five free transfers for Gameweek 16, regardless of how many free transfers they had remaining in the previous week.\nAfcon will last from Gameweek 16 to Gameweek 22.\nPrice reveals and position changes\nAs is the case every year, the cost of players may change.\nLiverpool winger Mohamed Salah and Manchester City striker Erling Haaland will cost £14.5m (from £12.5m last season) and £14m (from £15m) respectively this time around.\nEngland and Everton goalkeeper Jordan Pickford starts the new season at a price of £5.5m (£5m last season).\nManchester City left-back Rayan Ait-Nouri, who signed from Wolves last month, will be priced at £6m (£4.5m last season).\nLiverpool's club record signing and Germany international Florian Wirtz will cost £8.5m at the start of the season.\nNewcastle's Swedish striker Alexander Isak starts at £10.5m (£8.5m last season).\nFPL has also announced position changes for 11 players.\nLiverpool's Cody Gakpo, Manchester City's Omar Marmoush, Manchester United's Matheus Cunha and Everton's Iliman Ndiaye have switched from forwards to midfielders.\nWest Ham captain Jarrod Bowen has been switched from a midfielder to a forward, while Arsenal teenager Myles Lewis-Skelly has been switched from a midfielder to a defender.\nThe full list of position changes can be found here, external.\nBBC Sport's dedicated FPL league\nAs per previous years, BBC Sport will be running its own dedicated FPL league for our readers to join and compete against each other.\nYou can join now using the code bbcfpl or by clicking this link, external.\nThis article is the latest from BBC Sport's Ask Me Anything team.\nWhat is Ask Me Anything?\nAsk Me Anything is a service dedicated to answering your questions.\nWe want to reward your time by telling you things you do not know and reminding you of things you do.\nThe team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.\nWe will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.\nOur coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio."
    },
    {
      "url": "https://www.bbc.com/sport/football/premier-league",
      "text": "MOTD pundit and Newcastle United legend Alan Shearer explains why his old club have had a pre-season to forget, and how Liverpool target Alexander Isak could stay at St James' Park.\nAround the clubs - insight, analysis and fan views\n'I'm not sure he's got that fire any more' - Hamann on Guardiolapublished at 15:28 11 August\n15:28 11 August\nFormer Manchester City midfielder Dietmar Hamann speaking to BBC Radio 5 Live about Pep Guardiola: \"He's been there 10 years now, and it's a long time. We've seen with managers in the Premier League these days, usually they don't last longer than three or four years. When a season starts, you've got to light a fire in a team with the fans and make people believe. And I'm not sure he's got that fire any more.\n\"Obviously you can never write him off because they've got a fantastic team - Rodri is back after a long injury, but I'm not sure they're going to win another big title under Guardiola.\nFrom a purely sporting perspective, there is far less prestige in playing in the Conference League compared with the Europa League - the competition Palace believed they had qualified for having won last season's FA Cup.\nThe counter argument is that Palace will stand a better chance of winning the Conference League. That may be the case, but that is not really the issue here.\nPalace feel this is a huge miscarriage of justice, irrespective of their chances of winning a European trophy next season seemingly improved.\nYou also have to wonder how the decision may impact their plans between now and the close of the transfer window.\nIt is estimated that their European demotion could cost the Eagles in the region of £20m, a relatively large amount given the size of the club.\nThat may well now play a factor in attempting to sign their preferred targets and their leveraging power as they try to prevent key players from leaving. Marc Guehi and Eberechi Eze are among those courting interest from the Premier League's top sides.\nGuehi, who has less than a year left on his contract, is likely to be sold, with Liverpool among his suitors, while Eze has interest from Arsenal and Tottenham.\n'The general feeling in the group has been down' - Howepublished at 09:45 11 August\n09:45 11 August\nNewcastle boss Eddie Howe was asked how prepared he feels before the Premier League starting this weekend in the aftermath of a 2-0 defeat to Atletico Madrid: \"Physically the players are very good but mentally is a different question. There has been challenges this summer that we haven't faced before and the general feeling in the group has been down, especially early in pre-season.\n\"Alex [Isak] is such a popular player in the dressing room and any disruption around a player of that calibre is going to affect the group.\n\"I think they have responded really well to it but it is still there in the background. It is an unwelcomed disruption. We have to get used to it and if anything it has to make us stronger.\"\nOn what needs to be done before the season kicks off this weekend: \"We need some more work in our sharpness. We are physically fit, but in the movements, one-v-one duels and the end actions haven't really been there [against Atletico Madrid].\n\"Our squad depth at the moment, we are stretched in midfield with Joe Willock's injury. With Champions League football the bodies we need and squad we are going to need, the depth isn't quite there at the moment.\"\n'We all have to improve' - Van Dijk on defendingpublished at 09:45 11 August\n09:45 11 August\nCaptain Virgil van Dijk has called on Liverpool to improve defensively after their Community Shield defeat to Crystal Palace.\nDuring half-time in Sunday's Wembley showpiece, former Liverpool defender Jamie Carragher's posted on X to highlight the Reds' attacking threat but defensive vulnerability.\nHe posted: \"LFC looking great going forward but susceptible defensively, as we've seen all pre season. A lot of the goals conceded by LFC have come from going man to man really aggressively and leaving space in behind.\"\nVan Dijk echoed those concerns in his post-match comments after his side's shootout defeat, stressing the need for collective improvement in the team's defensive setup.\n\"We have to be very honest with ourselves,\" Van Dijk said to BBC Radio Merseyside.\n\"Obviously, it is disappointing at the moment because we lost, conceded two goals we could have avoided. I think there were plenty of moments where we looked very good, especially in possession, on the break, and between the lines. But yeah, you stand without the trophy, and that is the main thing that is disappointing today.\n\"I think it is the collective defensive part that we have to work on. Everyone has the quality, obviously, otherwise you won't play for Liverpool. The absolute reality is that we all have to improve in terms of our defensive setup in order to not concede goals; it is not only the backline, not only Alisson, but together.\n\"We all take responsibility, I take responsibility, and that is how it should be. There is a reason we had the most clean sheets in the league last season, and we have to get back to that.\"\nChelsea explore Nkunku swappublished at 08:11 11 August\n08:11 11 August\nNizaar Kinsella BBC Sport football news reporter\nChelsea have offered several players to RB Leipzig for midfielder Xavi Simons, including Christopher Nkunku.\nIt's part of the complex negotiations with the Blues keen to offload players having also offered both Carney Chukwuemeka and Tyrique George.\nAny deal between the two clubs would not be a direct swap deal and would be related but separate transfers. It remains to be seen whether the German club deem it viable.\nHowever, the nature of the negotiations highlight Chelsea's intention to offload attackers to sign attackers in the last few weeks of the transfer window.\nSources close to Nkunku have also explained he is reluctant to join a club like Leipzig as he is aiming to play at Champions League level next season.\nThere is also admiration for Nkunku at Chelsea after his positive performances at the Club World Cup but he is believed to be searching for more than the bit-part role currently on offer at Stamford Bridge.\nAnother target is winger Alejandro Garnacho from Manchester United - amid initial contract discussions. Newcastle-linked Nicolas Jackson could be allowed to leave for the right offer to make space.\nIf appropriate outgoing deals are not agreed then Chelsea could reintegrate the likes of Jackson into their squad despite leaving him out of the recent pre-season friendly wins against AC Milan and Bayer Leverkusen.\nVlachodimos nearing Sevilla loan movepublished at 08:06 11 August\n08:06 11 August\nNizaar Kinsella BBC Sport football news reporter\nSevilla are set to complete a loan move for Newcastle goalkeeper Odysseas Vlachodimos this week.\nThe 31-year-old has already green lit a move to Sevilla and will travel to complete a medical at Ramon Sanchez-Pizjuan Stadium.\nNewcastle currently deem the Greece international surplus to requirements having signed Aaron Ramsdale from Southampton on loan as competition for long-term number one Nick Pope last week.\nVlachodimos has made just one competitive appearance for Newcastle having struggled to make the grade under manager Eddie Howe at St James' Park.\nHe joined Newcastle from Nottingham Forest only last summer in a £20m deal that saw midfielder Elliot Anderson move in the other direction for £35m. The deal was described at the time as a swap to satisfy the Premier League's profit and sustainability rules.\nSesko signing 'definition of high risk, high reward'published at 12:07 10 August\n12:07 10 August\nAlex Turk Fan writer\nAnd so another blossoming young forward from across the continent lands at Old Trafford, immediately shouldered by the burden of Manchester United.\nMany a starlet has fancied their chances across the past decade of despair. All have failed. Memphis Depay, Jadon Sancho, Antony and Rasmus Hojlund have come and (almost) gone.\nIt is Benjamin Sesko's turn now. Another eye-watering transfer fee worth £74million only intensifies the pressure, especially coming off United's worst-ever Premier League season.\nBut there is reason for optimism that this time, finally, it will be different.\nSesko is entering a superior environment than immediate predecessor Hojlund. He follows Matheus Cunha and Bryan Mbeumo through the door, two Premier League-proven attackers who should be relatively low-risk.\nBruno Fernandes and Amad Diallo are also creators, while Patrick Dorgu looks primed for a breakout campaign. Sesko should receive service from all angles, and he has already proven his ability to take chances in a variety of manners.\nThe 6ft 5 frontman also should be the right profile.\nUnited emphasised their use of data in the announcement, pointing out that Sesko had scored more than every other player aged under 23 in Europe's top five leagues during the past two seasons.\nPhysically and athletically, he promises to meet the demands of the Premier League adequately. I think comparisons to Hojlund are justified (it's been a scarring year), but also lazy.\nAt 22, Sesko is two years older than the Dane when he arrived in 2023. He is also a much more established goalscorer, already netting 82 career goals across five seasons. Hojlund had 22 across two.\nIt is a risk and Ollie Watkins was Ruben Amorim's initially preferred option for a reason. His Premier League goal tally has never failed to reach double digits.\nBut United's decision to go for the 'project striker' whose ceiling exceeds that of their alternative options is the definition of high risk, high reward.\nLast season, the Hale End graduate was required to step up after Bukayo Saka succumbed to injury and made 37 appearances in all competitions, scoring nine goals and registering two assists.\n\"He never [looks nervous], he's so composed, calm and confident in his ability,\" said Gunners boss Mikel Arteta after Nwaneri found the net in a 2-1 win at Girona in January. \"At 17, scoring a really important goal in the Champions League is not very common.\"\nNwaneri celebrated his 18th birthday in March and of attack-minded players under the age of 19 in Europe's big five leagues only Barcelona's Lamine Yamal ranks higher in terms of output.\nYamal has been producing exceptional numbers since his first La Liga start as a 16-year-old in 2023 and the Spanish winger was on the pitch for almost 2,000 more top-flight minutes during the season just gone.\n'Great' Hato ready for Chelsea - Ten Hagpublished at 12:54 9 August\n12:54 9 August\nNizaar Kinsella BBC Sport football news reporter\nBayer Leverkusen manager Erik ten Hag says Chelsea have signed a \"great player\" in Jorrel Hato.\nOn Friday evening, the 19-year-old defender made his Chelsea debut in a 2-0 win over Leverkusen - who are now coached by former Manchester United boss Ten Hag.\nThe Dutch centre-back broke through at Ajax the season after Ten Hag moved to Old Trafford but the boss was aware of his potential to make it at the highest level.\nAsked about Hato's potential by BBC Sport, Ten Hag said: \"For sure. [I told him] I bet he regrets that he missed me at Ajax because they didn't win the titles in the past couple of years!\n\"The moment I left, he came in but he developed and progressed so well. He was one of the best, maybe the best player in the Eredivisie. He is so young but already on a very high level.\n\"You always need some time, but he has a very good mentality and then he can progress really quickly. He has all the elements, all the skills in his game to prove he can be a very successful player.\n\"I am very sure he will succeed at Chelsea. I congratulate Chelsea for signing this great player.\"\nHato made his debut at left-back where he spent most of last season at Ajax but he had initially been a central defender in the Dutch top flight.\nWith Levi Colwill now out for the majority of the season after knee surgery, debate has begun about Hato's best position.\n\"He can do both, you will see,\" Hato said.\nFellow debutant Estevao Willian and Joao Pedro scored in a dominant win at Stamford Bridge.\n'A mistake to wait' - Glasner on potential new signingspublished at 18:00 8 August\n18:00 8 August\nAlex Howell BBC Sport football news reporter\nCrystal Palace manager Oliver Glasner says that it would be a \"mistake\" for the club to wait on their European fate before making any signings - and also says there are no negotiations over a new contract.\nThe club have appealed to the Court of Arbitration for Sport against their demotion from the Europa League to the Conference League.\nThe Eagles have been drawn against against Norwegian side Fredrikstad or Midtjylland of Denmark, for the Conference League play-off round.\nThe two legs are played on 21 and 28 August but Glasner says Palace, who have only signed two players this summer, should not wait until those matches to bring in new faces.\n\"If you're thinking like this, you make a mistake,\" he said. \"Then you're always reacting to situations. You can't run a business where you're always reacting.\n\"You can but you'll never have long-term success. You have to be active and plan what's going on.\n\"You can't say we wait and then on the 28th, if we qualify for the Conference League group stage, then we act. We don't think like this.\"\nLast season, Glasner was frustrated with Palace's late activity in the transfer window, especially given the Eagles' slow start to the season where they won only one of their opening eight league games.\nBut Glasner says he is not worried about a repeat as long as the club keeps their top talent.\n\"The difference now is the team stayed together,\" Glasner said. \"Last year, we lost 10 of the dressing room and added seven - 40% of the dressing room left.\n\"This year two loan players left and two new come in. That means the chemistry and spirit is great. Everybody knows how we want to play because everybody was here last year.\"\nWhen asked if he has asked for investment into the squad, Glasner says it is not solely about wanting players.\n\"It's not that I want investment - it's about Crystal Palace,\" Glasner said. \"My expertise and my advice is what Crystal Palace should do to be competitive in four competitions.\n\"If we want to be better than last year, then let's sign at least two players. Not to be happy, not to fulfil my wishes, nothing at all.\n\"It's been a good summer, a good pre-season, I love the players and staff who are here. I love the club and the fans.\"\nThe Palace boss also revealed there had been no talks about extending his contract. beyond next summer when it expires.\n\"Again, at the moment it's three weeks time to get the squad done, so Oliver Glasner's contract is not important at the moment,\" he said.\nAsked if what happens before the transfer deadline would impact whether he wants to talk about a new deal, the Palace boss said: \"We will see.\"\nCaptain Marc Guehi's contract expires next summer and there has been interest in the defender from both Liverpool and Newcastle.\n\"Marc and me - we have the same fate.\" Glasner said with a smile. \"I can't speak, you have to ask Marc. At the end, it's always the player's decision.\n\"Marc decides about his future. Of course, everybody wants Marc to sign a new contract. It will be his decision.\n\"Everybody wants to keep this squad together as it did so well. I don't know how often this happens here at Palace.\n\"We never know what will happen in this sometimes crazy transfer market.\"\n'Ominous' and 'no positives at all' - fans on Bayern defeatpublished at 09:51 8 August\n09:51 8 August\nFollowing Tottenham's 4-0 defeat by Bayern Munich in their pre-season friendly, we asked for your views on the result.\nHere are some of your comments:\nRazza: The result is a worrying sign for the immediate future. However, remember that Bayern are real quality. But this is the type of team that we are going to meet in Europe. I really can't believe the amount of injuries we have already and we can't blame Ange Postecoglou now, can we? Thomas Frank really needs to work hard now and Daniel Levy even harder. Frank will, but will Levy? If the season sours badly...Don't blame the manager. The spotlight is on Levy.\nLeroy: I really feel sorry for Thomas Frank. He is really up against it with this squad he has inherited. Tottenham need two central midfielders, a striker and a goalkeeper, otherwise they are going to struggle like they did last season.\nMark: It's plain as day to see our squad lacks quality/depth. Our creativity is non-existent, so without reinforcements pronto we won't be competing in one competition - let alone all of them!\nJohn: It's only a friendly, nothing to get your knickers in a twist about. I've had the unfortunate privilege of seeing a far better side being relegated in the 70s after a clean sweep in pre-season matches! I'm not sure Thomas Frank is the way forward.\nEmiliano: No positives at all for Spurs, just concerns for the coming season. I am a long-time season ticket holder and fear we have made no progress since last season. Every top team has reinforced themselves. As usual, we have been linked with lots of players who were never going to come to us. But it is the usual rubbish to keep the fans happy pre-season that never materialises. I hope we don't get really embarrassed by PSG, but fear we will. Sadly, mid-table is looming for next campaign. What can we expect with a chairman who cares less about the team but more about how many shirts the shop sells or who he can rent the stadium to?\nToby: Ominous. Strengthen the squad now or face humiliation in the Champions League, a mid-place finish in the Premier League and a continuation of no trophy in either of the domestic cups.\nMaresca seemed concerned about Colwillpublished at 15:14 7 August\n15:14 7 August\nNizaar Kinsella BBC Sport football news reporter\nThere are times as a reporter when being in the room is really important to check the tone of what a manager says.\nHearing Enzo Maresca talk about an injury to star defender Levi Colwill, you could tell there was an air of concern about the situation.\nHe said: \"It was in the first session on Monday, just in the last minutes of the session. He felt something and, as I said, we need to wait and then we see.\n\"We don't know how long he is going to be out.\n\"I spoke with him yesterday and I told him that if we achieve what we achieved last year, it is also because of him - and he was a main player for us.\"\nMaresca also hinted that if scans reveal a serious injury then they may need to go back into the transfer market for another option.\nAntonio's 'been an asset' but 'right time to bid farewell'published at 14:47 7 August\n14:47 7 August\nWe asked for your views on the departure of Michail Antonio after a decade at West Ham and if you see him returning for a role behind the scenes in the future.\nHere are some of your comments:\nBarry: It's a shame to see him go but it's not unexpected. He looks to have done a great job to get back on the pitch, which shows the determination he has. When he was at his best, he was at times unplayable. His strength and pace caused many centre-back nightmares. Good luck and thanks for some great memories.\nRebecca: It's just really sad that fans couldn't properly say goodbye to such an important and loved player. So many good memories and no chance to celebrate that!\nColin: He has been a great asset to us and is highly popular, but now is the right time to bid farewell as we need young fresh blood in the team. He knows he will always be welcomed back as a non-player.\nMandy: I'm absolutely gutted that they have let him go. He has been a great player for us and he has played in many different positions when we needed him to. Pleased the club will continue to support him and I hope he comes back behind the scenes one day.\nLen: I think it would be great for Antonio to stay at the club as an academy team member and motivate some of the younger players who can look up to him.\nAnastasia: Very sad way for him to leave the club after all this time and he deserved a much better send off. We'll always be so grateful for everything he has done for the club.\nA big risk for a record fee?published at 14:42 7 August\n14:42 7 August\nMatthew Hobbs BBC Sport\nBurnley announced the signing of Lesley Ugochukwu from Chelsea on Wednesday night for a fee in the region of £20m.\nWhile the sum is officially undisclosed, it does eclipse both the £16m paid for Zeki Amdouni, who was signed from Basel in July 2023, and the £15m fee paid for James Trafford from Manchester City that same month.\nThe Trafford deal had the potential to rise to £19m, although the goalkeeper has since returned to Etihad Stadium.\nSo what have the Clarets got for their money?\nIn short, a gamble on a young player with relatively little top-level experience.\nUgochukwu joined Chelsea from Rennes for £23m two years ago and went on to make just six starts for the Blues before joining Southampton on loan last season.\nThe 21-year-old central midfielder did not particularly stand out in an abject Saints team, making 18 league starts as they were relegated.\nHe is highly thought of in France and played regularly in the Europa League for Rennes, but this signing by Burnley that is undoubtedly based on potential rather than concrete evidence, hoping the France Under-21 international will find his way in Premier League football.\n'Didn't live up to expectations but was needed this term' - fans on Nunezpublished at 14:40 7 August\n14:40 7 August\nWe asked you whether selling Darwin Nunez is a risk on Liverpool's behalf if it ends up leaving them short on attacking numbers for the new season.\nHere are some of your comments:\nAndy: No risk. He's a liability and we're better off being one player short than having him in the squad.\nPaul: I wish Darwin well. I had hoped he would stay and take his chance when opportunity allowed. He seemed more relaxed and sharp in the friendlies. It might come back and bite us if the new faces don't hit the ground running. We just have to trust the process of recruitment.\nGary: Yes, it is a risk as we very sadly lost Diogo Jota and now we're selling Nunez, who has been great in pre-season. I'd have given him a chance. The pressure to sign Alexander Isak is now on.\nHarpreet: There is definitely a risk in letting Nunez go without a replacement ready to come in. I assume the club are confident of getting the Isak deal over the line, but FSG has shown it has no issues going into a season with a lack of depth in certain areas. The lack of depth at centre-back this close to the start of the season is another worrying issue.\nThom: Unfortunately, Nunez didn't live up to expectations. However, with the tragic loss of Jota and an influx of new talent, I felt Nunez was needed this term. He provides something different, an explosion of pace, chaos and an understanding of the club and league. Someone like that is needed while others settle in.\nRicky: I don't think selling Nunez is a risk for the club but I don't think it's the best move for the player football-wise. Good luck to him, though. Things just didn't work out as expected.\nSpeaking to BBC Radio Merseyside, The Redmen TV's Dan Clubbe said that while there is frustration around a potential deal, a move away from Liverpool would ultimately suit both club and player.\n\"It's not necessarily disappointment - the overriding feeling is frustration,\" Clubbe said. \"[Nunez] came in for a lot of money and there was a lot of expectation around him.\n\"The timing of his signing was interesting. He came in at the same time as Erling Haaland. The comparison was made from the get-go and Nunez never lived up to those levels.\n\"He was a Jurgen Klopp-led signing, which brought danger. Liverpool's recruitment had been so well thought-out, smart and data-driven. To remove from that and allow Klopp to have free rein maybe was too much of a gamble.\n\"Given the money we spent on him, he probably has come some way short of what we expected, so it probably is best for both parties that he moves on.\"\nSpare a thought for Frankpublished at 11:52 7 August\n11:52 7 August\nSami Mokbel Senior football correspondent\nThomas Frank has had time to brace himself for Son Heung-min's departure, but the long-term unavailability of Maddison arrives a as bolt out of the blue.\nSon's farewell match in South Korea earlier this week was marred by the latest knee injury suffered by Maddison.\nThe anguished expression on the midfielder's face said it all.\nThe sympathy belongs to him. Last season was cut short by an injury to the same knee, a blow that robbed him of playing in the Europa League final win over Manchester United.\nBut spare a thought for Frank, who in his first season in charge, faces losing two key attacking players – one forever and the other for a long period.\nYou would imagine now that Spurs will give big consideration to entering the market for a new attacking midfielder.\nHad their move for Nottingham Forest's Morgan Gibbs-White ended successfully then the requirement to enter the market for offensive reinforcements would be significantly less pressing.\nSuch attacking quality is hard to come by. Expensive, too.\nSummer signing from West Ham Mohamed Kudus has played centrally before and could provide an option.\nBut Spurs will have to do something to replace Maddison's contribution.\n'Building a club on its own two feet' - Barber's selling strategypublished at 11:19 7 August\n11:19 7 August\nAt the fan forum on Wednesday, one supporter kept his question simple: Why do Brighton always sell their best players?\nAlbion chief executive Paul Barber replied: \"The reality is that pretty much every club in the world is a selling club at the right price - anyone that says any different doesn't really understand football.\n\"Our business model has always been that we will buy young players, hire the best coaching staff to develop them, give them the chance to play in the first team and negotiate the best possible deal when the time is right.\n\"We will build our club sustainably like that. We can't always rely on Tony [Bloom] to fill in the gaps and usually at a club, the only gaps are financial gaps. We have to build a club on its own two feet, that is less reliant on a single person to pay the bills.\n\"In order for a club of our size to do this, we need to have a healthy trading strategy and we have got one. The key is to make sure to never leave our coaching staff with a squad incapable of competing. That is what we try and do every year and I think we are getting the balance right.\n\"There are times where we want to keep a player for longer, but players also have demands and dreams for the future. The job that Tony, I and the technical staff have is to judge the right moment to sell, which is sometimes not that easy.\"\nDibling bigger talent than Kane - former boss Martinpublished at 10:46 7 August\n10:46 7 August\nEverton remain in negotiations for Southampton winger Tyler Dibling, who is reportedly not taking part in contact training at St Mary's in order to protect himself for any potential move, although the clubs are yet to agree on a fee.\nEverton's current record signing is the £45m they paid for Gylfi Sigurdsson in 2017 and they could exceed this figure to secure Dibling's services. Former Saints boss Russell Martin believes he would be worth every penny.\nMartin coached James Maddison and Harry Kane in their early careers and he told The Rest is Football podcast, external thatrates Dibling even more highly.\n\"When I was there I had to play it down a lot and not make things more difficult for him,\" Martin said, \"but he is the most talented player I've ever worked with.\n\"Seeing him on the training pitch, seeing him live, Tyler has every capability to play for England and at the top level for a very long time.\nMartin highlighted Dibling's versatility, noting he can play at eight, 10, as a false nine or on the wing for any new club.\n\"He's powerful, he's really quick and [uses] both feet. Physically, the stuff I've seen him do at 18 in the Premier League, with people just bouncing him off him and being put on the floor when he dribbles, he has something I've not seen in a British player for some time.\"\nMan Utd like Baleba - but he would cost 'an enormous amount'published at 08:50 7 August\n08:50 7 August\nSimon Stone Chief football news reporter\nManchester United are on the lookout for someone who could strengthen their midfield and skipper Bruno Fernandes has called for new signings.\nAnd they like Carlos Baleba.\nThe problem is Brighton's desire to sell, which is non-existent, and owner Tony Bloom's negotiating tactics. Hard line.\nThat is not to say United could not get Baleba - it is just that it would cost an enormous amount of money, probably in excess of anything United have spent so far this summer.\nIt is not obvious where the money would come from, because even if they can sign Benjamin Sesko without selling players first, eventually they will have to.\nAnd it would take more than getting rid of the 'bomb squad' which even the club accepts is likely to be later in the window.\nThe key point is whether United look for an alternative or keep their powder dry for Baleba, either in case circumstances change dramatically in this window, or, more likely, for next summer.\nIs it time for Liverpool to sell Nunez?published at 15:26 6 August\n15:26 6 August\nTom McCoy BBC Sport journalist\nLiverpool are in talks with Saudi Pro League side Al-Hilal over Darwin Nunez, with the Reds considering selling the striker, who joined from Benfica in 2022 for an initial fee of £64.1m.\nThe 26-year-old has enjoyed some memorable moments with the Anfield club, such as January's match-winning late double at Brentford, but has struggled to make an impact consistently.\nHe has scored 25 Premier League goals, underperforming his expected goals (xG) total by 8.6. That is the second-worst record of any player over the past three years, with only Dominic Calvert-Lewin at Everton faring worse.\nThe league's best finishers typically register shot-conversion rates of over 20%, but Nunez's percentage of 11.1% ranks only 95th. When it comes to shot accuracy, meaning the proportion of efforts directed on target, he also barely scrapes into the top 100.\nThere is no lack of volume for the striker, who sits inside the top 10 for both shots and shots on target, despite only starting 49 top-flight matches for the Merseysiders.\nHe has also arguably been unlucky, hitting the woodwork 14 times - the most by any player since 2022-23.\nBut, ultimately, a lack of ruthlessness in front of goal may have persuaded Liverpool now is the time to cash in on the Uruguayan.\nDavid: Need to be much more aggressive and proactive with transfers. No disrespect to the players, but without new targets, survival in Europe will be challenging, not to mention the Premier League. It is quite disheartening not to see top-quality players arriving.\nAlex: Disheartening? I'm absolutely gutted, with a mix of anger, frustration and dismay! The bottom line is that the senior leadership needs to have a serious look at themselves, since Amanda Staveley and Mehrdad Ghodoussi left the club feeling directionless. We have just won our first trophy in a lifetime and have European football again - we should be the strongest we have ever been, on the field and off it. However, the club feels lost, discombobulated. Instead of being proactive, we are reactive.\nWayne: Unfortunately, Newcastle's transfer attempts have been inept, making low-ball offers and tipping off rivals about their intentions. Too slow and too timid. Also, there is no transparency or accountability, so no-one is sure who is responsible for this mess - certainly not Eddie Howe, who is sent out to face the media, apparently with zero knowledge of what is going on.\nTom: Disastrous transfer window so far. Alexander Isak hasn't helped matters with his childish behaviour and the timing of it. Just a reminder, Newcastle United won a cup and qualified for the Champions League last season. The reason players aren't coming is greed - it's as simple as that. Newcastle don't have the income yet to match the 'septic six'.\nRich: This whole saga takes me right back to the 1980s when we were simply a transition club. Great players like Paul Gascoigne, Chris Waddle and Peter Beardsley would raise the hopes and aspirations of us being a great club. Yet we failed to keep them or attract similar players to take us to the next level.\nAndy: Howe said so himself that Newcastle had to move quickly in the transfer market. We have been far from it - slow, sluggish, dithering and almost statuesque. Yoane Wissa, Benjamin Sesko, James Trafford, Bryan Mbeumo - I wonder who else will be on the oh-so-close list.\nAndrews 'understanding' of Wissa's situation published at 13:17 6 August\n13:17 6 August\nBrentford boss Keith Andrews has praised Yoane Wissa's professionalism and attitude amid ongoing uncertainty around the forward's future.\nThe 28-year-old is back with the group after leaving the Bees' pre-season trip to Portugal early last week.\nAndrews admitted Wissa is still building up match fitness but underlined the forward's value to the squad, calling him an \"outstanding talent\" and a player any coach would want to work with.\nDespite the speculation, Andrews insists their relationship remains respectful as the transfer window plays out.\n\"Wissa came back from Portugal - that was the right thing for all parties,\" Andrews told BBC Radio London.\n\"He was working very hard in the training ground in the build-up to the QPR game, obviously lacking in fitness. The players had yesterday off, and today was the first day we trained together as a group, and Yoane was there.\n\"Every coach would want him at the football club and every fan would want him at the football club, because he is an outstanding talent. He has proved to be an amazing football player for this club because of his importance within the group.\n\"I can't say that it has put me under a lot of stress because I do things one at a time. I am very understanding of the situation, having been in this industry for a long time.\n\"Transfer windows are always similar. I try to keep a good relationship with Wissa, and that's the way it has to remain.\nLiverpool 'have heeded wisdom of one of their greatest icons'published at 11:51 6 August\n11:51 6 August\nPat Nevin Former footballer and presenter\nWill Liverpool be even better this season than last?\nThey have an army of modern technical advisers but they have heeded the wisdom of one of their greatest historic icons.\nFormer manager Bill Shankly is remembered for his iconic one-liners, none more than: \"Football isn't a matter of life and death - it's more important than that.\"\nFor those who now think that trite or even tasteless, it was meant as a joke, an exaggeration, a bit of fun with words - nothing more.\nI was always more impressed with his idea that \"you must always strengthen when you are at the top, before your power starts to fade\". Chinese philosopher Sun Tzu would have been proud of that ideology.\nIt is easier said than done, however. Bringing an expensive bunch of new players into the group after winning a major trophy can put some of the current squad's noses out of joint. Some might think: \"Are they replacing me already, after all I have done for them?\"\nLiverpool cannot afford to damage the brilliant team spirit they have, so the personalities of the new recruits are as vital as how you sell their arrival to the rest of the players.\nThey cannot be allowed to upset the on-field balance either. Some players just work perfectly together - there is a synergy that cannot be measured by stats. They understand each other and help each other, sometimes even without knowing they are doing it.\nThere is also the thought that one day Mohamed Salah and Virgil van Dijk will slow down with age or get injured more frequently. While everybody still backs the Reds as favourites, could these problems beset Arne Slot's team this season?\nAlmost certainly not. They have recruited brilliantly and are still the team to beat, even if some of us are flailing around trying to find a weakness - which probably is not there."
    },
    {
      "url": "https://www.bbc.com/sport/football/articles/cwy0pkeyzwgo",
      "text": "How to win at FPL - our experts give their best tips\n- Published\nThe Fantasy Premier League season is just around the corner and, with more managers taking part, achieving that elusive top-10k finish is proving harder than ever.\nThat's where BBC Sport's four FPL experts for 2025-26 can help.\nWe've compiled the best advice from Pras, Holly Shand, FPL Heisenberg and Gianni Buttice to help you get ahead of the game.\nAnd we've also spoken to Max Littleproud, winner of the BBC Sport FPL league last season with an incredible finish of fifth in the world.\nMax's approach to the game was a little different last season - if xG and underlying data leaves you cold then you might prefer his advice.\nYou can join the BBC Sport League on the official Fantasy Premier League game using the code bbcfpl - or by clicking this link, external.\nPrioritise long-term planning over short-term point chasing\nPRAS: A good FPL manager plays the game like chess. It isn't about who to pick this week or even next, a good manager looks at blocks of fixtures and targets players with good medium-term fixture runs. Doing so avoids knee-jerking on moves, especially for players that only have one good fixture and then a not-so-great run. Have a plan and stick to it as much as possible.\nHOLLY: Team form and upcoming fixture ease are two vitally important metrics to consider when making transfers. Keep a close eye on both when planning transfers, in order to pick up key players before their hot streak begins and steal a march on your rivals.\nBalance premium picks in your week one team\nHOLLY: It's important to strike the right balance of premium players, particularly at the start of the season when form is more unpredictable.\nFor greater transfer flexibility, try to pick a premium player in each position in your gameweek one team and then make a captaincy matrix for upcoming weeks to hone in on your key transfer targets.\n- Published1 day ago\n- Published4 days ago\n- Published4 August\nDon't be stubborn when you've made a mistake\nHEISENBERG: You have to acknowledge when you've made an error by either bringing a player in you shouldn't have, or by ignoring a player in hot form that needs to come in.\nIt happens to us all - the key is to rectify these situations as quickly as possible.\nAvoid hits and early transfers\nGIANNI: It's better to roll transfers and go weeks without one if you can. Stay patient, use your bench if you need to and accumulate transfers. With several free transfers you can make significant changes to your team structure and make moves for even the most expensive assets without taking hits.\nHOLLY: I try to avoid early transfers wherever possible - information is always key and so I won't make my moves until a Friday afternoon. The exception to this rule is when there are no midweek European fixtures (like before gameweek two) or where you may be priced out of a move you have exact funds for.\nTrust your gut\nMAX: Last season I changed the way I play. I didn't have as much time as before to be online and consume FPL content. Everything I did last season was purely gut instinct - I didn't look at any statistics!\nI was changing my team 30 minutes before the deadline, going for players I really liked and trusting my gut. Even though I'm a maths teacher I stayed away from statistics as you can get bogged down in them and over analyse things.\nPay attention to minutes, set-pieces and penalty takers\nPRAS: Sometimes, counter-intuitively, FPL is about picking the reliable players over flair players.\nAn example I used to use was even though Riyad Mahrez looked amazing on the eye, a player like Bruno Fernandes was always a far superior FPL pick, simply because he was nailed on to play 90 minutes, take free-kicks and penalties.\nThese points add up and make these picks more fixture-proof since a free-kick goal or penalty is not as dependant on the difficulty of the opponent.\nWhen stuck between two players, always pick the guy taking penalties or set-pieces.\nWatch as much Premier League football as you can\nHEISENBERG: Watch full matches where possible and extended highlights of all the games. Watching more football allows you to spot things you may not notice from stats alone, while it also allows you to interpret data easier as you'll have the required context.\nMAX: I watched a lot of games last season, so I was seeing players I enjoyed watching and going for them - using the good old eye test.\nAvoid panic buys and rage sells - back your decisions\nPRAS: FPL is a game of patience, but football is a very unpredictable sport. This is a recipe for a lot of regret.\nYou pick Bukayo Saka as your captain and he misses a penalty. This is an example of good decision, bad outcome.\nManagers must understand there is an element of luck in the game but making good decisions over the long-term generally leads to good outcomes. Trust the process.\nDon't understimate the importance of xG\nGIANNI: Some fans are not keen on expected goals (xG) as a metric, but it is important in FPL.\nIf an attacker is clocking a high xG but not converting that into goals, they're either a bad finisher or more likely, they're close to catching a big haul really soon.\nMake sure you know the new rules and adjust\nGIANNI: Goals and assists will always be king but the new defensive contribution points will change how we build our FPL teams moving forward, especially when shopping for budget defenders and midfielders.\nThe first few weeks could be a learning curve so pay close attention and be ready to react.\n- Published4 August\nSave money in defence\nMAX: I never spend a lot of money on defensive options. This year I'm going for two £4.5m defenders and two £4.0m\nIf they pick up clean sheets then great, and I'm banking on them making up the difference to more expensive picks with the new defensive contribution points.\nI've never spent much on defence - with the exception of an FPL star such as Trent Alexander-Arnold - and once I've picked my defence I tend to set and forget.\nAnd finally - stop caring about other people's teams\nHEISENBERG: Everyone wants to beat their mini-league rivals and finish with as high a rank as possible, but you can get stuck if you pay too much attention to other people's teams.\nDon't try to be the same as them. Don't try to be different to them.\nSimply focus on what you can control - your own team - to maximise your points. Your overall rank and mini-leagues will take care of themselves."
    }
  ],
  "argos_summary": "As the Fantasy Premier League (FPL) season approaches, experts recommend considering various players beyond the usual premium picks like Mohamed Salah and Erling Haaland. Key players highlighted include Virgil van Dijk for his defensive contributions, Bruno Fernandes for his consistent output, and budget options like Iliman Ndiaye and Chris Wood for their favorable fixtures. The new scoring system introduces defensive contribution points, which could influence team selection strategies, emphasizing the importance of reliable players who can accumulate points through defensive actions.",
  "argos_id": "IFAFMFZNW"
}