{
  "url": "https://finance.yahoo.com/news/nike-files-126-6-million-203709309.html",
  "authorsByline": "Vicki M. Young",
  "articleId": "72d10554b14a40eebf79774e4ca6ea38",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/rZ6ZObuRRWqk6KYf.rq0CA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNTAw/https://media.zenfs.com/en/footwear_news_finance_8/ad05ffeb6337e9b9443c04c73da36e98",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:37:09+00:00",
  "addDate": "2025-08-12T20:54:51.449221+00:00",
  "refreshDate": "2025-08-12T20:54:51.449224+00:00",
  "score": 1.0,
  "title": "Nike Files a $126.6 Million Lawsuit Against Clot Founder Edison Chen",
  "description": "Nike's $126.6 million lawsuit against Clot founder Edison Chen alleging breach of contract was filed on Monday in a Los Angeles federal court.",
  "content": "Nike USA Inc. has filed a $126.6 million suit against Edison Chen, the founder and creative director of streetwear brand Clot, alleging breach of contract.\n\nThe lawsuit was filed on Monday in a federal district court in Los Angeles. The details of the suit are still unknown.\n• Nike's New Abominable Snowman-Themed Sneaker Comes With a Plush Toy\n• Nike Officially Announces Its 'Yu-Gi-Oh!' Air Max 95s - Here's How to Get Them\n• Caitlin Clark's 'Rookie of the Year' Nike Kobe Sneakers Will Release in 2026\n\nA search in the federal court docket system on Tuesday said proceedings for the case were “not available.” That’s not unusual in the dog days of summer when staff might be on vacation and the complaint hasn’t been uploaded to the database. Executives at Nike could not be reached for comment as the offices are closed this week for “wellness week.” A representative for Chen did not respond to a request for comment by press time.\n\nThe lawsuit was filed nearly two years after it was learned during Shanghai Fashion Week in October 2023 that Chen was partnering with Nike competitor Adidas. Adidas and Chen disclosed their new partnership at Clot’s spring 2024 show, noting that the inaugural collection for their line would be known as Adidas Originals by Edison Chen.\n\nClot’s partnership with Nike ran for 20 years. Their first collaborative sneaker launched in 2006. The two had been steady partners since then, until they weren’t. Little is known about why the two ended their partnership, although market rumblings at the time suggested that the deal had run its course and was set to expire anyway.\n\nClot, based in Hong Kong, became one of Nike’s most important partners in Asia. Their collaborations included narratives that served to educate the West on Chinese customers, such as tea ceremonies and reflexology.\n\nAmong the highs were an Air Max 1 “Kiss of Death,” which became of the most sought-after versions of the silhouette ever. It was released in 2006 for $100, and has a list price of $1,200 on the sneaker resale site StockX, although market data going back to 2017 indicates a range from a low of $230 to a high of $2,053 depending on condition and scarcity of size range.\n\nAlso popular has been a silk Air Force 1 with tear-away uppers. Clot and Nike also had a new Cortez collab — Clot x Nike “Clotez” — featuring a yellow-based upper offset by a black mudguard that was inspired by a jumpsuit worn by martial artist great Bruce Lee in his iconic 1979 film “Game of Death.” Clot also joined forces with Nike’s Jordan brand for several collaborations over the years.",
  "medium": "Article",
  "links": [
    "https://wwd.com/footwear-news/sneaker-news/yu-gi-oh-nike-air-max-95-joey-jonouchi-release-date-1238034476/",
    "https://wwd.com/fashion-news/sportswear/edison-chen-stan-smith-tennis-capsule-adidas-1237962414/",
    "https://wwd.com/footwear-news/sneaker-news/caitlin-clark-nike-kobe-5-rookie-year-release-date-1238033568/",
    "https://wwd.com/footwear-news/sneaker-news/nike-dunk-low-abominable-snowman-im7170-441-1238034930/",
    "https://wwd.com/footwear-news/sneaker-news/adidas-uncle-waffles-superstar-the-original-campaign-1238033519/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nike competitor Adidas",
      "weight": 0.09351871
    },
    {
      "name": "Nike",
      "weight": 0.093517646
    },
    {
      "name": "Clot Founder Edison Chen",
      "weight": 0.09297276
    },
    {
      "name": "Nike USA Inc.",
      "weight": 0.08929965
    },
    {
      "name": "streetwear brand Clot",
      "weight": 0.081229314
    },
    {
      "name": "Edison Chen",
      "weight": 0.07589465
    },
    {
      "name": "Clot",
      "weight": 0.073563375
    },
    {
      "name": "Air Max 95s",
      "weight": 0.0695471
    },
    {
      "name": "Chen",
      "weight": 0.06518181
    },
    {
      "name": "martial artist great Bruce Lee",
      "weight": 0.063913204
    }
  ],
  "topics": [
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.95361328125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.77099609375
    },
    {
      "name": "/Law & Government/Legal/Business & Corporate Law",
      "score": 0.489501953125
    },
    {
      "name": "/Law & Government/Legal/Legal Services",
      "score": 0.389892578125
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.30126953125
    }
  ],
  "sentiment": {
    "positive": 0.12497311,
    "negative": 0.4522483,
    "neutral": 0.4227786
  },
  "summary": "Nike USA Inc. has filed a $126.6 million lawsuit against Edison Chen, founder and creative director of streetwear brand Clot, alleging breach of contract. The lawsuit was filed in a federal district court in Los Angeles. The details of the lawsuit are still unknown. It was filed nearly two years after it was revealed that Chen was partnering with Adidas, marking the end of a 20-year partnership with Nike. Clot was one of Nike's most important partners in Asia and its first collaborative sneaker launched in 2006.",
  "shortSummary": "Nike USA has filed a $126.6 million lawsuit against Clot founder Edison Chen for breach of contract, following their discontinuation from their partnership.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ae1f01d71eaf4afeac7c0cee32984474",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://wwd.com/footwear-news/sneaker-news/yu-gi-oh-nike-air-max-95-joey-jonouchi-release-date-1238034476/",
      "text": "After a steady ramp-up of teases and leaks, Nike is now pulling back the curtain on its highly anticipated “Yu-Gi-Oh!” collaboration.\nThe “Yu-Gi-Oh!” x Nike Air Max 95 will feature in two colorways, one of which launches globally on Tuesday and will be followed later by an edition exclusive to Japan. Only the blue “Joey” colorway had leaked prior, and the announcement gives the first look at the gray “Jonouchi” variant, which will be released only in Japan.\nAs the more colorful sneaker in the duo, the Air Max 95 “Joey” is primarily made up of a mix of blues and includes faux-scuffs on its midsole. “Neon” green detailing is used for the “Air Muscle” tongue branding and visible Air Max units, while a graphic of Red-Eyes black dragon is printed on the insole. Within the translucent bubble of the outsole, you’ll also find a “Yu-Gi-Oh!” logo.\nYou May Also Like\nThe Air Max 95 “Jonouchi” opts for grayscale with its own embellished scuffs on a black midsole. It, too, features “Air Muscle” branding on the tongue rather than the usual “Air Max” mark, and its Red-Eyes black dragon insole is rendered without color outside of the red in the “Yu-Gi-Oh!” logo on one shoe to go with Jonouchi on another. Co-branded text for the two parties is also printed on the rear of the heel Air Max unit on both editions.\nBoth sneakers come in special packaging, including the official playable trading cards from Konami that had been previewed at San Diego Comic-Con.\nBoth sneakers call back to a 1997 “Yu-Gi-Oh!” manga issue with a story centered upon an Air Max 95 “Neon” duplicate dubbed the “Air Muscle.” In it, Jonouchi (known as “Joey” in English translations) is scammed by a shoe shop owner who sold him the sneakers and paid a group of thugs to steal them back from him and sell them once again. Dark Yugi confronts the owner on behalf of Jonouchi and wins back the sneakers in a game.\nPrecise release details haven’t been revealed for the “Yu-Gi-Oh!” x Nike Air Max 95 “Joey,” though it is confirmed to release on Tuesday, likely through the Snkrs app. The “Yu-Gi-Oh!” x Nike Air Max 95 “Jonouchi” will then follow later in the month, exclusively in Japan. Pricing for both sneakers is set at $200."
    }
  ],
  "argos_summary": "Nike USA Inc. has filed a $126.6 million lawsuit against Edison Chen, founder of streetwear brand Clot, for breach of contract, following Chen's recent partnership with competitor Adidas. The lawsuit comes nearly two years after Clot's long-standing collaboration with Nike, which began in 2006, ended. Meanwhile, Nike is also launching its anticipated 'Yu-Gi-Oh!' collaboration with Air Max 95 sneakers, set to release soon.",
  "argos_id": "INK7RFH8K"
}