{
  "url": "https://www.bloomberg.com/news/videos/2025-06-11/balance-of-power-late-edition-6-10-2025-video",
  "authorsByline": "bn",
  "articleId": "c52393de4f814bc989bfdf5601c1e886",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/izX6Tise5YGY/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-06-11T00:04:37.904000+00:00",
  "addDate": "2025-06-11T00:30:05.443577+00:00",
  "refreshDate": "2025-06-11T00:30:05.443580+00:00",
  "score": 1.0,
  "title": "California Asks Court to Stop LA Troop Deployment",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, Rep. Krishnamoorthi (D) Illinois shares his thoughts on the second day of trade talks between the United States and China. Janet Napolitano, former Homeland Security Secretary under the Obama Administration, weighs in on the Los Angeles protests and the 4,000 National Guard troops and 700 US Marines in the city and what she would have done if the President asked her to deploy these troops. US Senator Ted Cruz, a Texas Republican, discusses the tax-cut package passed by the House and the anti-deportation protests in Los Angeles. (Source: Bloomberg)",
  "content": "> > THIS IS \"BALANCE OF POWER\" LIVE FROM WASHINGTON, D.C. JOE: WELCOME TO \"BALANCE OF POWER.\" KAILEY: TONIGHT, TRYING TO MAKE A DEAL. TRADE TALKS BETWEEN THE U.S. AND CHINA STRETCHING INTO A LONG SECOND DAY WITH NO NEWS YET ON THE AGREEMENT. WHAT THE TREASURY SECRETARY SAID WHEN LEAVING THOSE TALKS MOMENTS AGO. WE WILL HAVE A REPORTER ON THE GROUND TO DISCUSS U.S.-CHINA RELATIONS WITH RANKING MEMBER OF THE CHINA SELECT COMMITTEE. JOE: SENATE REPUBLICANS LOOKING TO ALTER OR ELIMINATE MAJOR ELEMENTS OF THE TRUMP TAX BILL. KAILEY: AND WITH U.S. MARINES NEARBY, THE NATIONAL GUARD ON-SITE IN LOS ANGELES. THE PRESIDENT BLAMING OUTSIDE AGITATORS FOR THE VIOLENCE. > > THESE ARE PAID INSURRECTIONISTS OR AGITATORS OR TROUBLEMAKERS. CALL THEM WHATEVER YOU WANT AND WE ENDED IT AND WE HAVE IN CUSTODY SOME VERY BAD PEOPLE. JOE: THE POLITICAL BACKLASH OVER THE IMMIGRANT CRACKDOWN PROTESTS AND THE ADMINISTRATION RESPONSE AS CALIFORNIA'S GOVERNOR FILES AN EMERGENCY MOTION TO BLOCK THE MILITARY'S PRESENCE IN L.A. THE FORMER HOMELAND SECURITY SECRETARY WILL SPEAK WITH US. KAILEY: WE BEGIN THIS EVENING WITH A REPORT FROM ON THE GROUND IN LONDON AS TODAY'S TALKS BETWEEN THE U.S. AND CHINA STILL HAVE NOT WRAPPED EVEN IF THE TREASURY SECRETARY HAS LEFT THE BUILDING. WE ARE LIVE OUTSIDE. BESSENT HAS TO GET BACK HERE FOR TESTIMONY BUT JAMIESON GREER AND HOWARD LUTNICK ARE STICKING AROUND. DOES THAT MEAN WE ARE GOING TODAY THREE? ANNMARIE: POTENTIALLY. THAT IS WHAT THE TREASURY SECRETARY SAID. HE LEFT HIS TWO COLLEAGUES. THE COMMERCE SECRETARY IS STILL AT THE TABLE WITH THEIR CHINESE COUNTERPARTS. HE MADE IT CLEAR HE IS GOING BACK BECAUSE HE HAS TESTIMONY IN FRONT OF THE HOUSE WAYS AND MEANS COMMITTEE. LISTEN TO WHAT TREASURY SECRETARY BESSENT HAD TO SAY JUST BEFORE HE LEFT LANCASTER HOUSE. > > I HAVE TO GO BACK TO WASHINGTON TO TESTIFY BEFORE CONGRESS TOMORROW. WE HAVE HAD TWO DAYS OF PRODUCTIVE TALKS. THEY ARE ONGOING. MY COLLEAGUE SEC. LUTNICK AND AMBASSADOR GREER ARE GOING TO BE CONTINUING AS NEEDED WITH THE CHINESE DELEGATION. ANNMARIE: WHAT WE ARE HEARING IS THEY ARE WORKING ON SOME TECHNICAL DETAILS. TWO THINGS COME TO MIND FOR ME. -- SAID THEY WERE GOING TO GET TO THIS AGREEMENT QUICKLY WHICH WAS GOING TO BE EASING EXPORT CONTROLS ON THE U.S. SIDE AND IN EXCHANGE, GETTING MORE ACCESS TO THE RARE EARTH AND MAGNETS THAT CHINA HAS MORE THAN 70% CONTROL OVER. WHAT WE'VE SEEN NOW IS TWO DAYS AND MORE THAN 13 HOURS OF TALKS AND NEGOTIATIONS AND THE FACT THAT THE TREASURY SECRETARY HAS TO LEAVE BECAUSE HE HAS PRIOR ENGAGEMENTS IN WASHINGTON, BUT THE TALKS ARE STILL ONGOING. JOE: WE HAVE A COUPLE DAYS UNDER OUR BELTS. I KNOW YOU'VE BEEN THERE FOR ALL OF IT. WITH THAT SAID, IT SOUNDS LIKE THEY'VE HAD A LOT OF TIME TO SHAKE HANDS. ANNMARIE: THEY'VE HAD A LOT OF TIME TO SHAKE HANDS AND THEY CERTAINLY DID AT THE START. THERE'S BEEN A LOT OF BREAKS, BACK AND FORTH. WE DON'T EXACTLY KNOW WHAT THE STICKING POINTS ARE. I THINK ONE THING IS CLEAR. -- SAID THEY ARE NOT WILLING TO GO INTO THE NVIDIA CHIPS. LOOKING AT EXPORT CONTROLS THEY ARE WILLING TO EASE UP ON, IT WOULD BE THOSE THAT CAME AFTER GENEVA. POTENTIALLY THIS IS ONE OF THE STICKING POINTS THAT IS BEING DISCUSSED AT THE TABLE. WE SHOULD ALSO MENTION THERE IS A HOST OF ISSUES THAT WASHINGTON AND BEIJING HAVE WITH EACH OTHER. WHETHER OR NOT IT IS ABOUT HOW THE ECONOMIES ARE WORKING, THE TRADE DEFICIT, WHAT THE U.S. WAS SAYING IT IS DUMPING ON THE MARKET, UNFAIR PRACTICES, PUTTING THEIR THUMB ON THE SCALE WHEN IT COMES TO HELPING THE RUSSIAN ECONOMY. THERE ARE A PLETHORA OF ISSUES THAT THESE COUNTRIES COULD GET INTO THAT OR EVEN OUTSIDE THE SCOPE OF TRADE AND WE NEED TO REMEMBER DURING TRUMP'S FIRST ADMINISTRATION, THE TRADE WAR STARTED IN 2018, FOR THE PURCHASING AGREEMENT. IT DIDN'T END FOR 18 MONTHS. WE GOT A FINAL AGREEMENT IN 2020. IF YOU LOOK AT WHERE WE WERE IN GENEVA, WE ARE ONE MONTH INTO TRADE WAR 2.0. JOE: REALLY GLAD YOU ARE THERE WITH US, LIVE FROM LONDON. FOR MORE ON THE IMPLICATIONS OF THOSE TRADE TALKS WE TURN TO DEMOCRATIC COMMERCE MEN ROGER KRISTA MORPHY -- DEMOCRATIC CONGRESSMAN RAJA -- WHAT LEVERAGE DOES THE UNITED STATES HAVE HERE OTHER THAN EXPORT CONTROLS AND IF THAT IS THE CASE, WE ARE TO BELIEVE THAT INVOLVES NATIONAL SECURITY, WHY ARE WE PUTTING NATIONAL SECURITY ON THE BARGAINING TABLE? > > WE SHOULD NOT RELAX THOSE EXPORT CONTROLS. THEY ARE INCREDIBLY CAN -- INCREDIBLY IMPORTANT BECAUSE WE EXPORT OUR HIGHEST AND SEMICONDUCTOR CHIPS TO THE PEOPLE'S REPUBLIC OF CHINA, THE CHINESE COMMUNIST PARTY USES THOSE AGAINST OUR INTERESTS AND OUR VALUES. THEY USE THEM IN THEIR HIGH-END MILITARY SYSTEMS AND THE USE THEM TO PERPETRATE HUMAN RIGHTS ABUSES, A GENOCIDE AGAINST THE UIGHUR PEOPLE USING FACIAL RECOGNITION MODELS TRAINED USING THESE CHIPS. WE SHOULD NOT RELAX THOSE EXPORT CONTROLS. UNFORTUNATELY WE ARE IN THIS SITUATION IN PART BECAUSE OF THE TRADE CHAOS THAT DONALD TRUMP HAS CREATED, INCLUDING IMPOSING BLANKET TARIFFS ON OUR FRIENDS, PARTNERS AND ALLIES. WE NEED THOSE PARTNERS TO WORK WITH US TO PUT ADDITIONAL PRESSURE ON THE CHINESE AND WE DON'T HAVE THEM SQUARELY IN OUR CORNER RIGHT NOW. KAILEY: CONGRESSMAN, AS YOU TALK ABOUT THE NATIONAL SECURITY IMPLICATIONS AROUND OUR EXPORT CONTROLS, ARE THERE ALSO NOT GRIEVE NATIONAL SECURITY CONCERNS IF CHINA RESTRICTS OUR ACCESS TO CRITICAL MINERALS AND RARE EARTHS, THINGS WE NEED FOR THINGS LIKE FIGHTER JETS FOR EXAMPLE? REP. KRISHNAMOORTHI: I COME BACK TO WORKING WITH YOUR FRIENDS AND ALLIES TO SOURCE SOME OF THOSE CRITICAL MINERALS IN OTHER PLACES. STANDING UP ALTERNATIVE REFINING AND ANTI-FACTORING CAPABILITIES ELSEWHERE. THAT'S WHAT YOU DO BEFORE YOU START A TRADE WAR, AND THE TRADE CHAOS ASSOCIATED WITH THESE TARIFFS THAT BASICALLY END UP INCREASING PRICES FOR EVERYBODY, ALLOWING THE CHINESE TO FEEL LIKE THEY HAVE MORE LEVERAGE AND THEN HURTING OUR BUSINESSES IN THE PROCESS. WE HAVE A 25 PERSON SMALL BUSINESS THAT JUST INITIATED LAYOFFS AFTER IT WAS GOING GANGBUSTERS AS LATE AS APRIL. THAT'S THE LEVERAGE THAT THE CHINESE HAVE. THEY KNOW IT IS CAUSING PAIN FOR AMERICANS, WHAT THE TRUMP ADMINISTRATION IS DOING RIGHT NOW, SO THEY ARE WILLING TO WAIT IT OUT. JOE: THE REALITY OF THE SITUATION HERE, IS THAT WE ARE JUST TRYING TO NEGOTIATE OUR WAY BACK A COUPLE OF WEEKS TO GENEVA , POST LIBERATION DAY. THERE IS A MUCH BIGGER CONVERSATION BEYOND ANYTHING IN THE SCOPE OF THESE TALKS IN LONDON THAT HAS TO DO WITH RECIPROCAL TARIFFS AND A FULL ON TRADE WAR THAT WE WERE IN A COUPLE OF WEEKS AGO WITH AN AUGUST DEADLINE. CAN WE GET THAT DONE? REP. KRISHNAMOORTHI: I DON'T KNOW. I DON'T KNOW WHAT TO BELIEVE ABOUT DONALD TRUMP, ABOUT THE STATE OF THESE TALKS OR WHERE THEY ARE AT. IT SEEMS LIKE HE IS MORE INTERESTED IN HEADLINES. WE KNOW THAT FROM THE FIRST TIME , I ANNMARIE THE PHASE ONE TRADE DEAL THAT HE NEGOTIATED WITH CHINA. IT WAS NOT WORTH THE PRICE OF THE PAPER IT WAS WRITTEN ON. DIDN'T -- THE CHINESE DIDN'T FULFILL THE AGREEMENT THEN, THAT DONALD TRUMP SUPPOSEDLY NEGOTIATED FOR US SO NOW I'M CONCERNED HE WON'T BE ABLE TO DELIVER AN AGREEMENT HERE EITHER. KAILEY: SPEAKING OF DELIVERING AN AGREEMENT OR A DIFFERENT KIND OF DEAL, THE DEADLINE TECHNICALLY IS NEXT WEEK FOR THE EXTENDED PERIOD WITH WHICH BYTEDANCE HAD TO DIVEST U.S. OPERATIONS OF TIKTOK DUE TO LEGISLATION YOU SUPPORTED AND PLAYED A MAJOR HAND IN. WOULD IT BE A MISTAKE FOR THE PRESIDENT TO EXTEND THAT DEADLINE? REP. KRISHNAMOORTHI: TIKTOK SHOULD NOT GO DARK. THE ADMINISTRATION SHOULD HELP TO NEGOTIATE A DEAL FOR THE PURCHASE OF TIKTOK. UNFORTUNATELY BECAUSE OF THE TRADE CHAOS AND THIS TARIFF CHAOS, TIKTOK IS NOW A VICTIM OF THOSE NEGOTIATIONS AND THE CHINESE ARE NOW BASICALLY USING THAT AS ANOTHER ITEM TO BE NEGOTIATED AS PART OF THE TRADE TALKS. UNFORTUNATELY INSTEAD OF SPENDING TIME ON NEGOTIATING THIS DEAL WITH TIKTOK, THEY'VE WASTED TIME WITH REGARD TO THESE TARIFFS AND NOW ANOTHER VICTIM OF THAT IS POTENTIALLY NATIONAL SECURITY. JOE: PRESIDENT TRUMP SPEAKING AT FORT BRAGG AS WE HAVE THIS CONVERSATION AND HE'S TALKING ABOUT THE OPERATIONS UNDERWAY RIGHT NOW IN LOS ANGELES, SAYING WE WILL USE EVERY ASSET TO QUELL VIOLENCE IN L.A. A LIVE VIEW OF HIS SPEECH AT FORT BRAGG. WE'VE BEEN ASKING THE QUESTION AND WE'VE HEARD IT SUGGESTED MANY TIMES OVER THE PAST 48 HOURS THAT THIS COULD SPREAD TO OTHER CITIES. WHAT WOULD HAPPEN IF IT WERE ON THE STREETS OF NEW YORK OR CHICAGO? IS CHICAGO OR THE STATE OF ILLINOIS PREPARED FOR A SCENARIO LIKE THIS? HOW WOULD YOU RESPOND TO THE PRESIDENT SENDING TROOPS TO YOUR CITY? REP. KRISHNAMOORTHI: WHAT THE PRESIDENT IS DOING BY MILITARIZING THE SITUATION IS HE IS PROVOKING FURTHER ESCALATION. THAT IS THE OPPOSITE OF WHAT AMERICANS WANT RIGHT NOW. THEY WANT DE-ESCALATION, THEY WANT A PEACEFUL RESOLUTION. THE OTHER THING THE PRESIDENT IS DOING IS TRYING TO DISTRACT ATTENTION FROM OTHER THINGS GOING ON, SUCH AS THE TARIFF AND TRADE CHAOS AS WELL AS THE EFFECTS OF HIS BILL, THE LARGE LOUSY LAW WHICH IS ABOUT TO LEAVE 10 MILLION AMERICANS WITHOUT HEALTH INSURANCE. THIS IS WHAT HE DOES NOT WANT TO TALK ABOUT OR HAVE PEOPLE FOCUSED ON AND INSTEAD HE'S TRYING TO PROVOKE THESE CONFLICTS WHETHER IT IS IN CALIFORNIA OR ELSEWHERE. KAILEY: BUT ARE YOU CONCERNED THAT ELSEWHERE MAY BE CHICAGO? ARE YOU SEEING SIGNS OF THAT DISCORD BEING SEWN? REP. KRISHNAMOORTHI: I JUST HAD A CALL THIS MORNING WITH IMMIGRATION ADVOCATES IN CHICAGO. THANKS TO WHAT MY FELLOW CONGRESSMEN CONVENED, THEY ARE CONCERNED ABOUT WHAT ARE PRESIDENT TRUMP'S NEXT MOVES? I THINK A LOT OF PEOPLE ARE LIVING IN FEAR TODAY AND THAT HURTS THE ECONOMY. BECAUSE PEOPLE ARE GOING TO COME TO WORK WHEN THEY FEAR A RAID ON THE WORKPLACE. THEY ARE NOT NECESSARILY GOING TO GO TO SCHOOL. THIS HAS BROADER IMPLICATIONS THAN JUST WITH REGARD TO THE TARGETS OF THESE RAIDS. IT HAS APPLICATIONS FOR THE ECONOMY WHICH IS ALREADY SHRINKING. KAILEY: WE APPRECIATE YOUR TIME. DEMOCRAT CONGRESSMAN RAJA KRISHNAMOORTHI, THANK YOU SO MUCH. COMING UP, OUR CONVERSATION WITH SENATOR TED CRUZ OF TEXAS, CHAIR OF THE SENATE COMMERCE COMMITTEE. BUT FIRST, MORE ON THE TRUMP ADMINISTRATION'S MOBILIZATION OF 700 MARINES TO JOIN THE NATIONAL GUARD TROOPS IN LOS ANGELES. WE WILL SPEAK WITH THE FORMER SECRETARY OF HOMELAND SECURITY DURING THE OBAMA ADMINISTRATION, NEXT ON \"BALANCE OF POWER.\" > > WE WILL USE EVERY ASSET AT OUR DISPOSAL TO QUELL THE VIOLENCE AND RESTORE LAW & ORDER. KAILEY: PRESIDENT TRUMP MOMENTS AGO AT FORT BRAGG ADDRESSING TROOPS TO MARK THE ARMY'S 250TH ANNIVERSARY BUT OF COURSE REFERENCING THE FIFTH DAY OF PROTESTS IN LOS ANGELES. A TOTAL OF 4000 NATIONAL GUARD TROOPS AND 700 ACTIVE-DUTY U.S. MARINES HAVE BEEN DEPLOYED. NATIONAL DEMOCRATS TIN ANNOUNCING THE MILITARY RESPONSE , ARGUING IT IS INFLAMING TENSIONS. > > POUR GASOLINE ON AN ALREADY VOLATILE MOMENT. JOE: JOINING US NOW ON \"BALANCE OF POWER\" WITH MORE PERSPECTIVE ON THE SITUATION, JANET NAPOLITANO FORMER SECURITY -- SECRETARY OF HOMELAND SECURITY UNDER THE OBAMA ADMINISTRATION. GREAT TO HAVE YOU BACK WITH US ON BLOOMBERG TV AND RADIO. WHAT WOULD YOU HAVE DONE IF THE PRESIDENT OF UNITED STATES POSED THIS OPTION TO YOU? NOT ONLY DEPLOYING NATIONAL GUARD TROOPS AROUND THE AUTHORITY OF A SITTING GOVERNOR BUT DEPLOYING ACTIVE-DUTY U.S. MARINES TO AN AMERICAN CITY? JANET: IF THE PRESIDENT HAD ACTUALLY ASKED ME WHEN I WAS A GOVERNOR, ABOUT DEPLOYING NATIONAL GUARD OR ACTIVE-DUTY MILITARY, I WOULD HAVE FIRST SAID LET'S ASSESS THE SITUATION AND WHETHER MY LAW ENFORCEMENT AND CIVILIAN LAW ENFORCEMENT HAS THE CAPACITY TO HANDLE THIS. IN L.A., YOU HAVE A VERY LARGE URBAN WELL TRAINED POLICE DEPARTMENT AND THERE ARE 88 OTHER CITIES IN L.A. COUNTY, ALL OF WHOM HAVE POLICE DEPARTMENTS WITH MUTUAL AID AGREEMENTS. AND YOU HAVE THE L.A. COUNTY SHERIFF'S OFFICE WHICH IS ALSO A LARGE DEPARTMENT. GIVEN WHAT WE ARE SEEING ON THE MEDIA IN TERMS OF THESE PROTESTS, I WOULD HAVE SAID TO THE PRESIDENT, WE HAVE NO NEED FOR MILITARIZATION OF THIS SITUATION. THIS IS A CIVIL DISTURBANCE. THERE IS VIOLENCE, WE WILL DEAL WITH THE VIOLENCE. WE WILL MAKE SURE THOSE INDIVIDUALS ARE ARRESTED. IN TERMS OF THE PEACE AND SECURITY OF OUR COMMUNITY, YOU DON'T NEED TO BRING IN 4700 MILITARY FOLKS. KAILEY: FOR THOSE 4700 SERVICE MEMBERS WHO HAVE BEEN DEPLOYED, WHAT ARE THEY ACTUALLY CAPABLE OF DOING IN A SITUATION LIKE THIS, IF AND WHEN THE PRESIDENT INVOKES THE INSURRECTION ASK, THEY MAY BE ABLE TO ACT IN A LAW ENFORCEMENT CAPACITY BUT CANNOT DO SO NOW. WHAT IS THE PURPOSE OF HAVING THEM THERE? JANET: IT IS MYSTERIOUS BECAUSE L.A. IS A HUGE GEOGRAPHIC CITY. THERE HAVE BEEN POCKETS OF VIOLENCE WHICH THE MEDIA FOCUSES ON BECAUSE THEY ARE VERY APPEALING IN THAT WAY, BUT MOST OF THE CITY IS LOOKING VERY PEACEFUL. BUSINESSES ARE GOING ON, KIDS ARE GOING TO SCHOOL. THE ORDER THAT THE PRESIDENT EXECUTED WAS THAT THE GUARD COULD PROTECT FEDERAL BUILDINGS AND THEY ARE ALL IN ONE BASIC AREA OF L.A. I GUESS THEY ARE GOING TO BE STANDING AROUND. WE DON'T KNOW WHAT THE RULES OF ENGAGEMENT ARE AND THAT IS A RISK. IF THIS IS LAYING THE PREDICATE FOR IF ACACIA AND OF THE INSURRECTION ACT THAT IS A REAL RISK -- FOR PEOEVOCATION OF THE INSURRECTION ACT, THAT IS A REAL RISK. JOE: A LOT OF POLITICS GOING ON HERE. YOU ARE NO STRANGER TO THAT BUSINESS AND THERE ARE QUESTIONS ABOUT THE WAY DEMOCRATS SHOULD BE MESSAGING THIS. WE ARE HEARING A LOT OF WHAT ABOUTISM WHEN YOU ASK CERTAIN REPUBLICANS ABOUT THIS. EARLIER TODAY, A REPUBLICAN CONGRESSWOMAN FROM MICHIGAN HAD THIS RESPONSE TO THE PROTESTS. > > REMEMBER, THE DEMOCRATS ARE THE ONES THAT DEMANDED WE DEFUND THE POLICE. THIS IS WHAT YOU GET WHEN YOU DEFUND THE POLICE. THEY ARE THE ONES WHO WANT TO ABOLISH ICE. GUESS WHAT? ICE IS THE ONE THAT PROTECTS US. JOE: JANET NAPOLITANO, HOW DO YOU RESPOND? JANET: BALONEY. IT IS JUST BALONEY, OLD TROPES THAT ARE NOT POLICY OR THE POSITION OF THE DEMOCRAT PARTY. LOS ANGELES POLICE DEPARTMENT IS WELL-FUNDED, WELL-TRAINED, AND A HIGHLY URBANIZED AND VERY DIVERSE ENVIRONMENT. THEY ARE USED TO DEALING WITH THESE SITUATIONS. ONE OF THE ISSUES OF BRINGING IN THE GUARD, PARTICULAR WITH BEING AN ACTIVE DUTY MARINE IS DE-ESCALATION, RESTORING SAFE AND SECURE ENVIRONMENTS IS NOT WHAT THEY ARE TRAINED TO DO. YOU HAVE THAT ISSUE. YOU HAVE ALL KINDS OF OPERATIONAL ISSUES. WHEN YOU FLOOD THE ZONE WITH GUARDSMEN AND ACTIVE-DUTY MARINES, THE COMMUNICATIONS ISSUES WITH THE FOLKS WHO ARE REALLY IN CHARGE OF SAFETY AND SECURITY IN THIS AREA, WHICH IS THE POLICE DEPARTMENT AND THE SHERIFF'S OFFICE. THERE MAY BE CIRCUMSTANCES WHERE IT IS APPROPRIATE TO BRING IN THE GUARD. DURING THE RODNEY KING RIOTS OF 1992 WHICH WERE MUCH MORE WIDESPREAD AND SERIOUS. THE GUARD CAME INTO LOS ANGELES AT THE GOVERNOR'S REQUEST. I LOOK AT THIS AS A PROBLEM NOT ONLY OPERATIONALLY BUT A PROBLEM OF STATE SOVEREIGNTY AND NOT ADHERING TO THE WISHES OF THE GOVERNOR. I ALSO LOOK AT IT AS A PROBLEM OF PROPER USE OF THE MILITARY AT HOME, IN A DOMESTIC ENVIRONMENT. KAILEY: OBVIOUSLY REPUBLICANS AND THE ADMINISTRATION ARE ARGUING THAT ALL OF THIS GETS TO THE ROOT OF ONE DOMESTIC ISSUE WHICH IS THE BORDER. I ASK YOU THIS AS A FORMER GOVERNOR OF A BORDER STATE BUT ALSO SOMEONE WHO USED TO RUN THE HOMELAND SECURITY DEPARTMENT. WHEN THEY SAY THAT WHAT WE ARE SEEING IS EVIDENCE THAT WE NEED MORE ICE AGENTS AND BORDER PATROL, DO YOU SEE THAT NEED AS JUSTIFIED? DO WE NEED MORE PERSONNEL IN THOSE ROLES? JANET: I THINK THE BORDER NEEDS TO BE SECURE. I WOULD SAY MANY OF THE THINGS THAT THE TRUMP ADMINISTRATION HAS DONE ON THE BORDER FROM AN OPERATIONAL STANDPOINT HAVE BEEN USEFUL IN THAT REGARD. BUT IT IS A DIFFERENT DEAL WHEN YOU TALK ABOUT INTERIOR ENFORCEMENT WITHIN THE UNITED STATES. OVER TIME THERE HAVE BEEN ABOUT 10 MILLION OR SO UNDOCUMENTED INDIVIDUALS WHO NOW LIVE IN OUR COUNTRY. IF THE TRUMP ADMINISTRATION IS REALLY INTENT ON ROOTING THEM ALL OUT AND SENDING THEM ALL BACK TO THEIR COUNTRIES OF ORIGIN, THEY ARE GOING TO BE IN EVERY COMMUNITY, THEY ARE GOING TO BE IN STORES AND SCHOOLS AND CHURCHES AND COURTHOUSES ALL OVER THE COUNTRY, NOT JUST LOS ANGELES. I'M NOT SURE THAT IS WHAT THE AMERICAN PEOPLE VOTED FOR. WHAT THEY WERE TOLD DURING THE CAMPAIGN IS THAT THE ADMINISTRATION WOULD FOCUS ON DEPORTING THOSE WHO HAD COMMITTED OTHER CRIMINAL OFFENSES WHILE IN THE COUNTRY ILLEGALLY. BUT THAT IS NOT WHAT WE ARE SEEING. NOR IS IT PART OF THE PLAN FOR THIS SO-CALLED MASS DEPORTATION. JOE: WE'VE ONLY GOT A MINUTE LEFT. IS ARIZONA READY FOR THIS? IS PHOENIX READY FOR THE SITUATION LIKE L.A.? JANET: I WOULD THINK SO. I WOULD THINK THAT ANY GOVERNOR OR ANY BIG CITY MAYOR WOULD BE LOOKING AT CALIFORNIA AND WHAT IS GOING ON IN L.A., SAYING THAT COULD HAPPEN HERE AND WE BETTER MAKE SURE WE ARE READY. JOE: GOOD TO HAVE YOU WITH US, JANET NAPOLITANO, FORMER SECRETARY OF HOMELAND SECURITY IN THE OBAMA ADMINISTRATION AND FORMER GOVERNOR OF ARIZONA. ANOTHER STORY WE ARE FOLLOWING, RUSSIA CONTINUING DAILY ATTACKS ON MAJOR CITIES ACROSS UKRAINE IN AN EFFORT TO PRESSURE KEY TO ACCEPT ITS EFFORT -- EXCEPT ITS TERMS TO END THE WAR. TARGETING URBAN INFRASTRUCTURE, RESIDENTIAL BUILDINGS AND A MATERNITY WARD ACCORDING TO UKRAINIAN OFFICIALS. MORE THAN 700 DRONES ATTACKED THOSE SAME AREAS. KAILEY: RUSSIA HAS PLEDGED AN INCREASE IN PRODUCTION OF INEXPENSIVE LONG-RANGE WEAPONS AND HOST OUTPUT AS MANY AS 500 PER DAY. TODAY THE UKRAINIAN PRESIDENT RELEASED A STATEMENT SAYING QUOTE, RUSSIAN MISSILE AND -- STRIKE STRUNG OUT THE EFFORTS OF THE UNITED STATES AND OTHERS AROUND THE WORLD TO FORCE RUSSIA INTO PEACE. JOE: DURING A HOUSE APPROPRIATIONS DEFENSE SUBCOMMITTEE MEETING, DEFENSE SECRETARY PETE HEGSETH SAID THIS WHEN ASKED ABOUT CONTINUED SUPPORT FOR UKRAINE. > > AS YOU KNOW THIS ADMINISTRATION TAKES A VERY DIFFERENT VIEW OF THAT CONFLICT. WE BELIEVE A NEGOTIATED PEACEFUL SETTLEMENT IS IN THE BEST INTEREST OF BOTH PARTIES AND OUR NATION'S INTERESTS. I DON'T THINK THE WORD VICTORY HAS BEEN WELL DEFINED OR THE PATH TO IT. AS A RESULT, A PASS -- A PATH TO PEACE THAT STOPS THE KILLING IS SOMETHING PRESIDENT TRUMP IS INVESTED IN. JOE: ALSO TODAY, NATO SAID IT WOULD CONSIDER A PROPOSAL THAT WOULD ALLOW CONTRIBUTIONS TO UKRAINE'S DEFENSE TO BE INCLUDED IN THE NEW SPENDING TARGET ALLIANCE MEMBERS ARE EXPECTED TO ADOPT. A STORY WE ARE CONTINUING TO TRACK ON \"BALANCE OF POWER.\" COMING UP, OUR CONVERSATION WITH SENATOR TED CRUZ, ON THE SENATE'S PLANNED CHANGES TO PRESIDENT TRUMP'S TAX AND SPEND BILL. WE WILL HAVE THAT CONVERSATION NEXT ON \"BALANCE OF POWER.\" > > THE DEALBREAKER IS WHENEVER YOU GET OUT OF BALANCE. WE STRUCK A VERY GOOD BALANCE OF PASSING A BILL, TO 15-214 IN THE HOUSE OF REPRESENTATIVES. YOU HAVE TO THREAD A VERY NARROW NEEDLE AND THAT'S WHAT THE DEALBREAKER COULD BE. IS IF THE SENATE ADJUSTS IT TOO MUCH ONE WAY OR THE OTHER, YOU COULD EITHER LOSE MEMBERS OF THE RIGHT FLANK, OR YOU COULD LOSE MEMBERS ON THE LEFT FLANK. SO THEY ARE -- THOSE ARE THINGS WE ARE BALANCING AND THAT IS WHAT COULD BE FATAL. JOE: REPUBLICAN CONGRESSMAN JASON SMITH OF MISSOURI AS CHAIR OF THE HOUSE WAYS AND MEANS COMMITTEE, TALKING WITH US ON THE EARLY EDITION TODAY ABOUT DEALBREAKER'S THEY COULD COME FROM THE SENATE MODIFICATIONS TO THE HOUSE TAX BILL. THIS AFTERNOON WE SPOKE WITH REPUBLICAN SENATOR TED CRUZ OF TEXAS ABOUT THE SENTENCE PLANS FOR THE PRESIDENT SPILL AMONG OTHER ISSUES AS WELL. WE STARTED BY ASKING WHAT CHANGES HE WANTS TO SEE IN THE SENATE. SEN. CRUZ: I THINK THAT HAS TO DO GOOD JOB, WE ARE GOING TO GET THIS BILL ACCOMPLISH. WE WILL GET A PASS BECAUSE IT IS THE MAIN VEHICLE TO DELIVER ON THE PROMISES WE MADE TO THE AMERICAN PEOPLE IN NOVEMBER. SO IT IS THE MAIN VEHICLE TO DELIVER THE FUNDING TO SECURE THE BORDER, IT'S A MAIN VEHICLE TO REBUILD OUR MILITARY, TO EXTEND THE 2017 TAX CUTS AND MAKE THEM BIGGER AND BOLDER, AND THAT'S CRITICAL FOR ECONOMIC GROWTH AND JOBS. THE PROCESS OF THE BACK-AND-FORTH IS ONGOING. IN THE SENATE RIGHT NOW, EACH COMMITTEE IS RELEASING ITS LANGUAGE AND THE SENATE IS GOING TO TAKE SOME DIFFERENT APPROACHES THAN THE HOUSE DID, AND ULTIMATELY THEIR WE ARE CONFERENCE AND THE TWO WILL COME TOGETHER. THROUGH THAT PROCESS, THE BILL WILL GET BETTER. KAILEY: AND CERTAINLY THE COMMERCE COMMITTEE HAS MADE SOME CHANGES TO THE HOUSE LEGISLATION, A TWEAK TO THE MORATORIUM ON STATE AI LAWS, TYING IT TO THE FEDERAL BROADBAND EXPANSION PROGRAM. MR. CHAIRMAN, ARE YOU CONFIDENT THAT CAN GET THROUGH THE? SENATE HAS THE PARLIAMENTARIAN SUGGESTED THAT WILL PASS MUSTER? SEN. CRUZ: I ANTICIPATE WE WILL ARGUE IT THIS WEEK OR NEXT WEEK AND IT'S ONLY WILL BE CHALLENGED, THAT PROVISION WILL BE CHALLENGED IN FRONT OF THE PARLIAMENTARIAN. DON'T KNOW HOW SHE WILL RULE. I THINK IT IS VERY SOUND POLICY. IF YOU LOOK AT JUST A FEW WEEKS AGO I CHAIRED A HEARING ON AI AND I THINK AI IS TRANSFORMATIONAL TECHNOLOGY THAT IS GOING TO HAVE A MASSIVE IMPACT ON PRODUCTIVITY AND JOBS ACROSS THE COUNTRY. I THINK IT IS CRITICAL THAT AMERICA WIN THE RACE TO AI, THAT WE NOT LOSE TO CHINA. AT THE HEARING I CHAIRED, WE HAD WITNESSES FROM ACROSS THE INDUSTRY TESTIFY. EVERYONE AGREED THERE IS A REAL DANGER OF STATE LEGISLATION AND IN PARTICULAR STATES LIKE CALIFORNIA ADOPTING A HEAVY-HANDED NANNY STATE APPROACH, MUCH LIKE THE EUROPEAN UNION WHICH WOULD CRIPPLE AMERICA'S LEADERSHIP IN AI SO I THINK IT IS SOUND POLICY, WHETHER HE GETS ENACTED ON RECONCILIATION ARE NOT IS A QUESTION THAT IS STILL BEING ARGUED. JOE: YOU HAVE THE FAA IN YOUR PURVIEW, AND SENT AGENCY THAT WE'VE ALL TALKED ABOUT AS AMERICANS A LOT RECENTLY. IT TOUCHES ALL PERP YEARS AND LISTENERS. YOU HAVE A LITTLE OVER $12 BILLION FOR ENHANCEMENTS AND IMPROVEMENTS. IS THAT ENOUGH TO REPLACE THE NATION'S AIR TRAFFIC CONTROL SYSTEM? SEN. CRUZ: IT'S A MAJOR INVESTMENT IN MODERNIZING AIR TRAFFIC CONTROL. THERE IS NO DOUBT WE NEED TO DO SO. IT'S SOMETHING I'VE BEEN FIGHTING FOR FOR OVER A DECADE IN THE SENATE. OUR AIR TRAFFIC CONTROL SYSTEM IS OUTDATED EQUIPMENT. THEY USE RADARS FROM THE 1950'S. THEY USE LITTLE SLIPS OF PAPER AND COMPUTERS THAT USE FLOPPY DISKS. THAT'S WHAT WE RELY ON TO KEEP OUR FLYING PUBLIC SAY. THAT IS UNACCEPTABLE. WE NEED TO EMBRACE MODERN-DAY TECHNOLOGY AND GPS. THERE ARE ENORMOUS SUBSIDES. $12.5 BILLION IS A MAJOR INVESTMENT. I ALSO THINK WE NEED REFORMS TO IMPROVE THE SYSTEM. THAT SOMETHING IS GOING TO BE A REAL PRIORITY FOR THE COMMERCE COMMITTEE. JOE: I'M SAVING MY FLOPPIES IN CASE THEY BECOME COLLECTORS ITEMS SOMEDAY. I WONDER IF YOU STILL FEEL LIKE STARLINK IS PART OF THE SOLUTION AND IF YOU'VE HAD A CHANCE TO TALK WITH ELON MUSK ABOUT IT SINCE HIS APPARENT BREAKUP WITH THE PRESIDENT. SEN. CRUZ: I THINK STARLINK IS AMAZING TECHNOLOGY. TECHNOLOGY DECISIONS THROUGHOUT THE GOVERNMENT OUGHT TO BE BASED ON THE MERIT. CONGRESS AUTHORIZED $42 BILLION TO PROVIDE CONNECTIONS TO HIGH-QUALITY BROADBAND AND THE ENTIRE BIDEN ADMINISTRATION DID NOT CONNECT EVEN A SINGLE HOME IN AMERICA. IT WAS AN ABSOLUTE BOONDOGGLE AND FAILURE. PRESIDENT TRUMP'S ADMINISTRATION IS RIGHTLY FOCUSED ON USING THAT MONEY TO ACTUALLY HAVE CONNECTIVITY. ONE OF THE REASONS THE BIDEN ADMINISTRATION DID NOT CONNECTED ONE IS I DECIDED THAT HATED ELON MUSK AND HATED STARLINK SO WE ARE NOT GOING TO CONSIDER THAT AS AN OPTION. THE REALITY WHEN YOU TALK ABOUT BROADBAND, IT IS THE RIGHT TECHNOLOGY THAT DEPENDS ON THE RIGHT LOCATION. IN ADDITIONS URBAN ENVIRONMENT, FIBER MAKES A LOT OF SENSE. IF YOU'RE OUT OF THE MOUNTAINS ON THE MIDDLE OF THE WILDERNESS WITH SPARSE POPULATION, SATELLITE OR LESS EXPENSIVE INFRASTRUCTURE SOLUTIONS MAKE A LOT MORE SENSE. THE GOVERNMENT OUGHT TO MAKE THOSE DECISIONS BASED ON THE TECHNOLOGY THAT BEST MEETS THE NEED. KAILEY: I LIKE TO ASK YOU ABOUT WORDS WE HEARD FROM ANOTHER SENATE CHAIRMAN, LINDSEY GRAHAM OF THE BUDGET COMMITTEE WHO SUGGESTED IN AN INTERVIEW TODAY THAT THIS PACKAGE MAY END UP NEEDING TO BE BROKEN UP IN DIFFERENT PARTS AFTER ALL, WHICH WAS THE ORIGINAL PLAN OF THE MAJORITY LEADER JOHN THUNE. IS ACCEPTABLE TO YOU AND WOULD BE EXCEPT A BALL FOR THE PRESIDENT TO NOT GET HIS ENTIRE AGENDA DONE IN ONE BIG BEAUTIFUL BILL? SEN. CRUZ: I THINK WE ARE GOING TO GET IT DONE. I WOULD'VE BEEN SUPPORTIVE OF TWO BILLS BUT WE ARE GOING TO GET THIS BILL ACCOMPLISHED. I THINK THE STAKES OF FAILURE ARE TOO HIGH. IF CONGRESS DOES NOT ACT, BY DECEMBER 31 THERE IS AN AUTOMATIC $4 TRILLION TAX INCREASE. THAT WILL HURT EVERY WORKING FAMILY IN AMERICA AND EVERY SMALL BUSINESS IN AMERICA. THAT IS AN OUTCOME THAT THE DEMOCRATS ARE QUITE HAPPY WITH BUT THERE'S NOT A SINGLE REPUBLICAN IN THE HOUSE OR SENATE WHO WANTS THAT TO HAPPEN. IS HE GOING TO BE COMPLICATED? YES. BUT WE ARE GOING TO GET IT DONE. I WILL REFLECT BACK TO 2017, THE LAST BIG TAX CUT WE PASSED UNDER PRESIDENT TRUMP. I SPENT HUNDREDS OF HOURS IN 2017 NEGOTIATING PROVISIONS IN THAT BILL. THE HOUSE PASSED A GOOD BILL, IT WENT TO THE SENATE. THE SENATE MADE IT SUBSTANTIALLY BETTER AND THEN WE WENT TO CONFERENCE COMMITTEE AND IT GOT BETTER AS WELL. I HOPE IS THE SAME THING HAPPENS THIS TIME. I LIKE TO SEE THE SENATE BE BIGGER AND BOLDER AND HAVE MORE FISCAL RESPONSIBILITY AND CUT UNNECESSARY WASTE AND FRAUD AND ABUSE. THAT IS CERTAINLY WHAT I'M URGING MY COLLEAGUES IN THE SENATE TO DO. KAILEY: YOUR BRAINCHILD WAS FROM SAVINGS ACCOUNTS FOR NEWBORNS. I WONDER WHAT ASSUMPTIONS YOU ARE MAKING ABOUT THE STATUS OF BIRTHRIGHT CITIZENSHIP HERE. SEN. CRUZ: THIS PARTICULAR PROVISION DOESN'T RESOLVE THAT, JUST RELIES ON U.S. LAW. RIGHT NOW U.S. LAW CONFERS CITIZENSHIP ON BIRTH. I THINK BIRTHRIGHT CITIZENSHIP IS A POLICY THAT DOESN'T MAKE SENSE BECAUSE IT ENCOURAGES ILLEGAL IMMIGRATION SO I HAVE LONG ADVOCATED FOR CHANGING THAT POLICY. BUT THIS BILL IS AN ECONOMIC BILL SO IT IS NOT PURPORTING TO RESOLVE IMMIGRATION QUESTIONS. WHAT THIS BILL IS DOING, AND A PROUD TO HAVE INTRODUCED IT AND BE FIGHTING OR IT, IT IS IN THE BILL AND IS GOING TO BE ENACTED. THIS WILL CREATE AN INVESTMENT ACCOUNT FOR EVERY CHILD IN AMERICA. NEWBORN CHILDREN BORN THIS YEAR WOULD RECEIVE $1000 TO SEED THAT ACCOUNT AND THEN EACH YEAR, PARENTS AND FAMILY AND EMPLOYERS WOULD BE ABLE TO CONTRIBUTE UP TO $5,000 A YEAR IN A TAX-ADVANTAGED ACCOUNT. THAT MONEY WOULD GROW AND WOULD BE INVESTED IN THE STOCK MARKET, IN THE S & P 500. LET'S ASSUME A LITTLE GIRL OR LITTLE BOY WORN THIS YEAR HAS $1000 AND THEN HAS $5,000 INVESTED EACH YEAR. IF YOU ASSUME THIS SORT RATES OF GROWTH OF THE S & P 500, THAT LITTLE BABY, BY THE TIME HE OR SHE TURNS 18 WOULD HAVE $170,000 IN THEIR ACCOUNT. IF THEY KEPT ON INVESTING $5,000 A YEAR, BY THE TIME THEY TURN 35 COME THAT WOULD HAVE $700,000 IN THAT COUNT, AND THAT'S FOR EVERY CHILD IN AMERICA. THAT IS A POWERFUL WAY TO ENABLE EVERY CHILD IN AMERICA TO HAVE THE BENEFITS OF COMPOUND GROWTH. JOE: I WANT TO GO TO L.A. WITH YOU FOR A MOMENT BECAUSE I KNOW YOU'RE VERY SENSITIVE TO CONSTITUTIONAL LAW AND I'M SURE YOU HAVE VERY STRONG FEELINGS ABOUT SOME OF THE THINGS WE'VE SEEN ON THE STREETS OF AMERICA SECOND LARGEST CITY OF THE PAST FOUR DAYS. WE RECEIVED A STATEMENT FROM THE CHIEF OF POLICE, LAPD CHIEF JIM MCDONNELL. THAT'S RESPONDING TO THE POSSIBLE DEPLOYMENT OF MARINES WHICH NOW HAS HAPPENED. HE STARTS BY WRITING, THE LAPD HAS NOT RECEIVED ANY FORMAL NOTIFICATION THE MARINES WILL BE ARRIVING. HOWEVER, THE ARRIVAL OF FEDERAL MILITARY FORCES IN LOS ANGELES, ABSENT CLEAR COORDINATION, PRESENTS A SIGNIFICANT LOGISTICAL AND OPERATIONAL CHALLENGE FOR THOSE OF US CHARGED WITH SAFEGUARDING THE CITY. THIS IS WHAT THE PRESIDENT -- IS WHAT THE PRESIDENT IS DOING RIGHT NOW FAIR TO THE POLICE IN LOS ANGELES? SEN. CRUZ: WHAT IS NOT FAIR IS THE ACTIONS OF KAREN BASS AND THE ACTIONS OF GAVIN NEWSOM. WHAT WE ARE SEEING IN L.A. IS TERRIFIC, VIOLET -- VIOLENT RIOTS DAY AFTER DAY AFTER AP RACINE POLICE CAR FIREBOMBED, PROTESTERS PROTESTING AGAINST ENFORCEMENT OF FEDERAL IMMIGRATION LAW. IT IS A BIZARRE IMAGE TO SEE PROTESTERS WHO SAY DO NOT ENFORCE IMMIGRATION LAW, WE WANT TO BE HERE ILLEGALLY, TO SEE THEM WAVING MEXICAN FLAGS FOR THE PROPOSITION, DON'T YOU DARE SEND US BACK TO THE COUNTRY WHOSE FLAG WE ARE WAITING. THAT MAKES NO SENSE. THE PROBLEM WE'VE SEEN IN PLACE LIKE L.A. IS THE COPS, AND I SUPPORT LAW ENFORCEMENT AND THE POLICE, BUT UNFORTUNATELY, TODAY'S DEMOCRATS DO NOT. WHEN THEY ARE GIVEN A CHOICE BETWEEN SIDING WITH ILLEGAL IMMIGRANTS ARE VENEZUELAN GANG MEMBERS ARE VIOLENT CRIMINALS ARE SIDING WITH THE POLICE, TODAY'S DEMOCRATS DO WHAT AVENUE SOME DOES, HE IS SUING THE TRUMP ADMINISTRATION SAYING DO NOT ENFORCE LAW AND ORDER, DO NOT PROTECT OUR CITIZENS. I GOT TO SAY THAT'S BACKWARDS. WE OUGHT TO BE KEEPING OUR CITIES SAFE. REGARDLESS OF THE CIRCUMSTANCES WE SHOULD BE AGAINST VIOLENCE. KAILEY: BUT SHOULD WE BE AGAINST ? STATES RIGHTS, SENATOR DOES THIS NOT RISK SETTING A DANGEROUS PRECEDENT OF THE FEDERAL GOVERNMENT COMING IN AND OVERTAKING THE WILL OF AN INDIVIDUAL STATE? SEN. CRUZ: THERE IS A LONG TRADITION, WHEN YOU HAVE LOCAL POLITICIANS WHO ARE LAWLESS, DEFYING FEDERAL LAW, THE FEDERAL GOVERNMENT HAS THE AUTHORITY AND THE OBLIGATION TO ENFORCE FEDERAL LAW. YOU SAW WHEN YOU HAD SOUTHERN DEMOCRAT GOVERNORS IN THE CIVIL RIGHTS MOVEMENT RESIST INTEGRATING SCHOOLS, SAYING WE ARE NOT GOING TO ALLOW AFRICAN-AMERICAN CHILDREN IN OUR SCHOOLS. USE OUR PRESIDENT TO DWIGHT D. EISENHOWER SEND IN THE NATIONAL GUARD AND SAY YOU ARE GOING TO FOLLOW FEDERAL LAW. THE NEW MASSIVE RESISTANCE DEMOCRATS ARE NOW FIGHTING AGAINST FEDERAL IMMIGRATION LAW AND THE FEDERAL GOVERNMENT HAS RESPONSIBILITY TO KEEP THE AMERICAN PEOPLE SAFE. WE ARE SEEING A REPLAY OF WHAT HAPPENED DURING THE BLACK LIVES MATTER AND AND PEOPLE RIGHTS WERE DEMOCRAT POLITICIANS PREVENTED THE POLICE FROM PROTECTING THEIR CITIZENS AND ALLOWED PEOPLE TO BE MURDERED, ALLOWED STORES TO BE LOOTED AND POLICE TO BE ASSAULTED. SO I'M GLAD PRESIDENT TRUMP IS STEPPING FORWARD SAYING WE ARE GOING TO KEEP YOU SAFE FROM VIOLENCE ON THE STREETS. KAILEY: WHEN WE CONSIDER WHAT HE IS KEEPING AMERICANS SAFE FROM, THERE'S A DIFFERENCE BETWEEN RESISTANCE AND INSURRECTION AND THE PRESIDENT TODAY DID NOT RULE OUT INVOKING THE INSURRECTION ACT. SHOULD HE? SEN. CRUZ: THAT WILL BE A QUESTION THAT WILL DEPEND ON THE CIRCUMSTANCES. BUT THE PROBLEM IS MADE WORSE WHEN YOU HAVE DEMOCRAT MAYORS AND GOVERNORS THAT REFUSE TO ENFORCE THE LAW. THAT'S WHAT WE ARE SEEING IN CALIFORNIA. IF YOU BREAK THE LAW, IF YOU COMMIT ACTS OF VIOLENCE, YOU SHOULD BE ARRESTED. THESE ARE LAWLESS PROTESTS IN SUPPORT OF FURTHER LAWLESSNESS. THEY ARE MAD BECAUSE PRESIDENT TRUMP IS DEPORTING ILLEGAL IMMIGRANTS. THEY ARE MAD BECAUSE HE IS DEPORTING VENEZUELAN GANG MEMBERS AND MURDERERS AND CHILD RAPIST. I DON'T GET THE DEMOCRATS CALCULUS WHEN THEY LOOK AT AND SAY AMERICA NEEDS MORE MS 13 MEMBERS, HUMAN TRAFFICKERS AND CRIMINALS. I THINK THE VAST MAJORITY OF AMERICANS DON'T AGREE WITH THAT. KAILEY: THAT WAS OUR CONVERSATION WITH REPUBLICAN SENATOR TED CRUZ OF TEXAS. WE WILL CONTINUE OUR CONVERSATION ON THE ONGOING PROCESS IN LOS ANGELES AND THE TRUMP ADMINISTRATION'S RESPONSE, COMING UP WITH OUR POLITICAL PANEL. THAT'S NEXT ON \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. JOE: THIS IS \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. WE HAD A FLURRY OF ACTIVITY TODAY ON CAPITOL HILL WITH LAWMAKERS DEBATING THE PRESIDENTS TAX-AND-SPEND BILL AND REACTING AS WELL TO WHAT IS BEEN PLAYING OUT IN LOS ANGELES. PRESIDENT TRUMP TODAY SPEAKING AT FORT BRAGG, ADDING THAT HE WILL USE EVERY ASSET TO QUELL THE VIOLENCE. JOINING US WITH THEIR REACTION TO ALL THIS UNFOLDING BEFORE OUR EYES IS THIS EVENINGS POLITICAL PANEL, JIM KESSLER, ALONGSIDE REPUBLICAN STRATEGIST BRITNEY MARTINEZ, EXECUTIVE DIRECTOR OF PRINCIPLES FIRST. WE WANT TO HEAR FROM BOTH OF YOU ON THIS. JIM, YOUR REACTION TO WHAT WE ARE SEEING HERE, GAVIN NEWSOM SUING THE PRESIDENT OF THE UNITED STATES, THE PRESIDENT DOUBLING DOWN TODAY, NOT ONLY RHETORICALLY, BUT LITERALLY ADDING ANOTHER 2000 NATIONAL GUARD TROOPS IN LOS ANGELES. IS THIS A POLITICAL BATTLE? IS MORE THAN THAT? > > FIRST AND FOREMOST IT IS A POLITICAL BATTLE. I THINK GAVIN NEWSOM HAS BROUGHT A KNIFE TO A GUNFIGHT, TO BE HONEST WITH YOU. THIS IS WHAT DONALD TRUMP SAID HE WAS GOING TO DO. HE IS DOING IT, IT FEELS LIKE DEMOCRATS WERE CAUGHT FLAT-FOOTED HERE. VIOLENCE IN LOS ANGELES AND IF THERE'S NOT THAT MUCH VIOLENCE, SUCH AS THERE IS, THAT IS GOOD FOR DONALD TRUMP. HE WOULD LOVE TO SEE THAT -- VIOLENCE IN MORE CITIES. WE HAVE A PRESIDENT WHO WANTS VIOLENCE IN MORE CITIES. IT HELPS HIM POLITICALLY. DEMOCRATS HAVE TO BE READY IN ALL CITY STUDENT KNOW WHAT THEY ARE GOING TO DO TO COUNTER THAT. KAILEY: YOU HAVE A LOT OF EXPERIENCE IN CALIFORNIA, YOU WORKED AS PRESS SECRETARY FOR KEVIN MCCARTHY. > > FIRST AND FOREMOST, AMERICANS HAVE THE FIRST AMENDMENT RIGHT TO FREEDOM OF SPEECH. WHAT THEY DON'T HAVE THE RIGHT TO DO IS RIOT AND LOOT THE WAY THEY HAVE BEEN DOING. ANYONE WHO HAS BEEN VIOLENT SHOULD BE PROSECUTED TO THE FULLEST EXTENT OF THE LAW. WITH THAT BEING SAID, THAT WE HAVEN'T SEEN MANY TIMES IN OUR HISTORY IS A U.S. PRESIDENT GOING AND SENDING THE NATIONAL GUARD INTO A STATE WHERE THE GOVERNOR HAS NOT REQUESTED THOSE RESOURCES. KAILEY: SO YOU SEE NEWSOM AS HAVING GOOD STANDING AS HE SUES THE ADMINISTRATION? > > I'M NOT THERE, I CAN'T SAY FROM MY OWN EYES, BUT WE HAVE A PRESIDENT WHO IS REPUBLICAN WHO BELIEVES IN LIMITED GOVERNMENT, THAT IS TRADITIONALLY WHITE REPUBLICANS HAVE BELIEVED IN, AND HE IS USING HIS EXECUTIVE AUTHORITY TO GO INTO A STATE WHERE THEY SAID WE ARE GOOD TO GO, WE DON'T NEED YOU YET. THERE WERE LAW ENFORCEMENT OFFICERS WHO PARROTED THE SAME THING. IT'S CONCERNING AND I THINK TO ALL THE PEOPLE WHO ARE CHAOS AGENTS AND ARE BEING DESTRUCTIVE, YOU'RE TAKING AWAY FROM THE MESSAGE THAT IS, THIS IS A CONCERN, WE SHOULD BE PAYING ATTENTION TO THE EXECUTIVE ORDER THE PRESIDENT SIGNED. TO YOUR POINT ABOUT DEMOCRAT GOVERNORS PREPARING, I DON'T THINK YOU'RE WRONG THERE. JOE: LET'S GET INTO THIS A LITTLE BIT MORE FROM THE DEMOCRATIC POINT OF VIEW. THE NARRATIVE NOW IS THAT DEMOCRATS ARE SO BUSY MAKING COMMERCIALS AND BUMPER STICKERS, I THINK YOU ARE LOOKING AT THIS WITH A LITTLE BIT MORE NUANCE. BUT IF THIS DOES START TO SPREAD TO OTHER CITIES IN STATES? > > I SUSPECT IT IS GOING TO SPREAD. DONALD TRUMP IS JUST THROWN GASOLINE ONTO THE FIRE IN LOS ANGELES. THIS IS WHAT HE WANTS AND I IMAGINE IT WAS SPREAD TO OTHER PLACES. I ALSO WANT TO BE CLEAR THAT THE PEOPLE WHO ARE STANDING ON BURNT OUT CARS HOLDING UP MEXICAN FLAGS ARE NOT DEMOCRATS, THEY ARE NOT GOING TO LISTEN TO WHAT DEMOCRATS SAY IS GOOD FOR THEM FOR MIDTERMS. I DO THINK DEMOCRATIC GOVERNORS AND MAYORS NEED TO BE READY SO THAT WHEN THERE'S SOME CHAOS THERE, THEY ARE SHOWING THEY GOT IT UNDER CONTROL COMPLETELY. MAYBE THERE ARE SOME CURFEWS THEY PUT IN THEIR, SO THAT DONALD TRUMP DOES NOT HAVE AN EXCUSE TO DOUSE THE FLAMES WITH GASOLINE. KAILEY: DONALD TRUMP OF COURSE HAS SAID THIS IS REALLY WHY HE WAS ELECTED PRESIDENT, THAT THE COUNTRY WANT HIM TO FOCUS ON THESE ISSUES OF CRIME AND IMMIGRATION. AS WE SEE THE MILITARY LITERALLY GOING INTO U.S. CITIES, DOESN'T THAT RISK BACKFIRING ON HIM? IS THIS REALLY IN YOUR MIND WHAT PEOPLE VOTED FOR? > > WE TALK ABOUT IMMIGRATION, YOU'RE RIGHT, PEOPLE WANT US TO HAVE A STRONGER STANCE ON IMMIGRATION. FOR A LONG TIME HER GENEROSITY HAS BEEN ABUSE. WITH THAT BEING SAID, WHEN WE SEE POLLING AFTER THIS NEXT WEEK OR SO, I THINK WERE GOING TO SEE A DIFFERENCE. WHAT WE SAW IS JUST THESE ICE RAIDS, ESPECIALLY IN A PLACE LIKE CALIFORNIA. I AM FROM CALIFORNIA, A GROUP THERE. I HAD FRIENDS WHOSE PARENTS WERE UNDOCUMENTED AND WERE DEPORTED IN HIGH SCHOOL, IT'S THESE FAMILIES COME THE STORIES. IT'S NOT JUST ANOTHER NUMBER AND ANOTHER FIGURE TO BE LOOKING AT. THE LAST THING I WILL SAY IS THAT THIS WEEKEND WHEN IT'S THE MILITARY PARADE, THE PRESIDENTS PARADE, HE HAS ALREADY LET OUT A MESSAGE SAYING ANY PROTESTERS ARE GOING TO BE DEALT WITH WITH FULL FORCE. AND THAT'S A PRESIDENT OF THE UNITED STATES. WE HAVE THE RIGHT TO ASSEMBLY IN PEACEFUL PROTEST AND YOU ARE ALREADY MAKING ASSUMPTIONS THIS WILL TURN INTO SOMETHING VIOLENT. HIM SIGNALING THAT, TO ME MEANS HE'S TRYING TO CAUSE A FIGHT. JOE: HOW WORRIED ARE YOU ABOUT THIS BIG MILITARY PARADE ON THE PRESIDENTS BIRTHDAY ON SATURDAY? > > I EXPECT THERE'S GOING TO BE SOME PERFORMANCE ARTISTRY GOING ON ON BOTH SIDES HERE. BUT I DO WANT TO SAY ON WHAT'S HAPPENING WITH THE PRESIDENT ON IMMIGRATION, THIS IS WHAT PEOPLE DID VOTE FOR. I'M NOT SURPRISED IN THE LEAST OF WHAT IS HAPPENING, HE SAID THIS OVER AND OVER AGAIN. HE'S DOING WHAT HE PROMISED TO DO. I'M NOT SURE IT'S GOING TO BE POPULAR, BUT THIS IS WHAT HE PROMISED TO DO. KAILEY: PROMISES MADE, PROMISES KEPT PERHAPS. THANK YOU SO MUCH. WE ARE LIVE IN CALIFORNIA AS WE END THIS PROGRAM, THIS TIME AT THE BLOOMBERG GLOBAL CREDIT FORUM TAKING PLACE IN LOS ANGELES, WITH QUESTIONS AROUND THESE PROTESTS, TRADE WARS, INFLATION, GROWING CONCERN ABOUT A SLOWDOWN IN THE WORLD LARGEST ECONOMY LOOMING LARGE. LISA ABRAMOWICZ IS JOINING US LIVE ON THE GROUND WITH SOME INFORMATION ON HER INTERVIEWS AND THE PROTESTS WE'VE BEEN COVERING. WHAT A TIME TO BE IN LOS ANGELES. LISA: AS YOU CAN SEE FROM A BACKDROP, IT DOESN'T EXACTLY LOOK LIKE WHAT YOU'RE ARE SEEING IN DOWNTOWN L.A.. SOME MEETINGS HAVE GOTTEN CANCELED BUT IT IS A VERY SMALL PART OF THE CITY IN THE CITY IS A VERY BIG, SPRAWLING CITY, AS MANY PEOPLE KNOW. I'M HERE RIGHT NOW HEAD OF TOMORROW'S CONFERENCE AT THE FORTRESS INVESTMENT GROUP'S REAL ESTATE CONFERENCE. I WAS JUST CATCHING UP WITH THE CO-HEADS OF REAL ESTATE GROUP AND OTHERS. THEY WERE TALKING ABOUT HOW IT HASN'T REALLY AFFECTED THEIR INVESTMENT STRATEGIES AND HOW THEY'VE TAKEN A LOT OF THE POLICY CHANGES IN STRIDE BUT THEY DO STILL SEE IS HUGE THIS INTERMEDIATION UNDERWAY, HEADING INTO PRIVATE INVESTMENT FIRMS, EVEN WITH THE DEREGULATION THAT WE'VE SEEN FROM WASHINGTON DC. TAKE A LISTEN. > > THERE IS SIGNIFICANT DEMAND FOR INVESTMENT HERE IN THE U.S.. THERE'S A LARGE TREND TOWARDS PRIVATE CREDIT, TAKING MARKET SHARE AWAY FROM THE COMMERCIAL BANKING SYSTEM. WE'VE SEEN THAT IN A NUMBER OF DIFFERENT PRODUCTS, WHETHER THAT'S REAL ESTATE, PRIVATE CREDIT, FORWARD FLOWS, CONSUMER FINANCE, WE THINK IT'S A TERRIFIC OPPORTUNITY. THINK IT'S KIND OF A LONG-LIVED OPPORTUNITY AND ONE THAT WE WILL BE INVESTING IN. FOR A SIGNIFICANT PERIOD OF TIME. AT THE SAME TIME WE ARE SEEING LOTS OF OPPORTUNITY IN EUROPE, WE ARE SEEING GREAT CONTINUATION OF INVESTING OF OUR JAPAN FRANCHISE. WE ARE PRETTY ACTIVE ALL OVER THE WORLD NOW. > > AT THE END OF THE DAY, INVESTORS GO TO WHERE THEY WILL GET THE BEST RETURNS. THERE ARE STILL INCREDIBLE OPPORTUNITIES HERE IN THE U.S. BUT ALSO IN THE OTHER MARKETS THAT > > > > LISA MENTIONED. ARE YOU TALKING MORE RESIDENTIAL OR COMMERCIAL? IS THERE MORE ROOM FOR SOME OF THESE PRIVATE ASSET MANAGERS AT A TIME WHEN THERE IS AN INCREASINGLY STAGNANT MARKET IN SOME WAYS BECAUSE OF MORTGAGE RATES? > > I THINK THERE'S A LOT OF OPPORTUNITY IN THE RESIDENTIAL MARKET. FOR EXAMPLE, WHERE ONE OF THE LARGEST PURCHASERS OF TAX LIENS IN THE U.S. AND THOSE ARE VERY, VERY ATTRACTIVE RISK-ADJUSTED RETURNS. YOU'RE GENERALLY BUYING THOSE AT ABOUT A 10% YIELD FOR BEING LESS THAN 1% LOAN TO VALUE. JOE: THE FORTRESS CO-CEO TALKING WITH LISA ABRAMOWICZ. TIM'S SONG WAS PART OF THAT CONVERSATION AS WELL PROVE YOU CAN READ A LOT MORE IN THE WASHINGTON EDITION NEWSLETTER ON ALL THE STORIES WE COVERED TODAY. KAILEY: AND YOU CAN FIND US RIGHT BACK HERE TOMORROW AS WE WILL HAVE THE LATEST FROM LOS ANGELES, THE LATEST ON BUDGET RECONCILIATION AND POTENTIALLY THE LATEST ON U.S.-CHINA TRADE TALKS WHICH ARE STILL ONGOING IN LONDON. WE WILL SEE YOU THEN RIGHT HERE ON BLOOMBERG TV AND RADIO.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.0561875
    },
    {
      "name": "PRESIDENT TRUMP MOMENTS",
      "weight": 0.05360493
    },
    {
      "name": "MORE CITIES",
      "weight": 0.04672038
    },
    {
      "name": "U.S. LAW",
      "weight": 0.04463174
    },
    {
      "name": "FEDERAL IMMIGRATION LAW",
      "weight": 0.044492748
    },
    {
      "name": "DONALD TRUMP",
      "weight": 0.04423744
    },
    {
      "name": "U.S. CITIES",
      "weight": 0.0439851
    },
    {
      "name": "PRESIDENT",
      "weight": 0.04322711
    },
    {
      "name": "LOS ANGELES",
      "weight": 0.042298585
    },
    {
      "name": "OTHER CITIES",
      "weight": 0.042194996
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.9482421875
    },
    {
      "name": "/News/Local News",
      "score": 0.93359375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.89990234375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.64892578125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.548828125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.521484375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.3408203125
    }
  ],
  "sentiment": {
    "positive": 0.0635376,
    "negative": 0.6879883,
    "neutral": 0.24829102
  },
  "summary": "California has asked the Court of Appeal to stop the deployment of LA Troop Deployment of the National Guard in L.A. The state has been trying to resolve a diplomatic dispute between the U.S. and China, where trade talks between the two countries have stalled for a second day with no progress yet on the agreement. This comes as California's governor seeks to block the presence of the military of the Los Angeles Army National Guard. The issue of immigration control is also being addressed, with concerns about the potential impact on the U., China, and the potential for an increase in border control on the United States. Meanwhile, the former Home Secretary of the California Home Office has been testifying before Congress about the situation.",
  "shortSummary": "California seeks court approval to block LA Troop Deployment, amid stalled trade talks between the U.S. and China without agreement, highlighting ongoing political tensions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f55f750f855c4c06a1936c33c5f64b7d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Trade talks between the U.S. and China are ongoing in London, with the Treasury Secretary leaving for a congressional testimony while his colleagues continue negotiations. The talks have yet to yield an agreement, with key issues including export controls and access to critical minerals. Meanwhile, President Trump has deployed military forces to Los Angeles amid protests, blaming outside agitators for the violence, which has sparked political backlash and concerns over state sovereignty. The situation raises questions about the implications of federal intervention in local law enforcement.",
  "argos_id": "IPV6H0CMO"
}