{
  "url": "https://www.forbes.com/sites/jamiecartereurope/2025/08/12/northern-lights-tuesday-these-states-may-see-aurora-and-shooting-stars/",
  "authorsByline": "Jamie Carter",
  "articleId": "6f099e14409941a0a8d9d84e7d7a8049",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689a6bcc45028a2c606b3d9f/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:38:40+00:00",
  "addDate": "2025-08-12T07:50:15.808148+00:00",
  "refreshDate": "2025-08-12T07:50:15.808152+00:00",
  "score": 1.0,
  "title": "Northern Lights Tuesday: These States May See Aurora And ‘Shooting Stars’",
  "description": "The Northern Lights may be visible in U.S. states after space weather experts at NOAA forecast geomagnetic activity.",
  "content": "The Northern Lights may be visible in the U.S. on Tuesday and Wednesday just as the Perseid meteor shower peaks, according to a forecast by the National Oceanic and Atmospheric Administration’s .\n\nDespite the weekend’s bright full moon rising later at night to entirely true dark skies, sky-watchers in around 10 U.S. states may have a chance to see the aurora borealis on the northern horizon as “shooting stars” fall. The cause is a spate of solar flares on the sun after weeks of inactivity.\n\nThe agency’s three-day forecast indicates an uptick in geomagnetic activity overnight on Tuesday, Aug. 12 through Wednesday, Aug. 13. According to a NOAA forecast, the Kp index — which provides a rough guide to the intensity of aurora displays — may reach 4 during a G1 geomagnetic storm.\n\n“The geomagnetic field is expected to reached active levels, with a chance for G1 (Minor) geomagnetic storms, over 12-13 Aug due to persistent influence from a positive polarity CH HSS,” reads a NOAA forecast. A positive polarity CH HSS is a stream of fast-moving solar wind from a coronal hole on the sun, which can cause geomagnetic storms and auroral displays.\n\nWhere The Northern Lights May Be Visible\n\nNOAA’s latest aurora viewlines indicate that aurora displays are a possibility in northern U.S. states and Canada, with 10 U.S. states having a chance after dark on Wednesday, June 25.\n\nParts of U.S. states that could potentially see aurora — possibly only on camera — according to NOAA, include Alaska, Washington, northern Idaho, Montana, North Dakota, South Dakota, Minnesota, Wisconsin, Michigan and Maine.. Check NOAA’s 30-minute forecast or use the Glendale App for up-to-the-minute forecasts.\n\nWhy The Northern Lights Are Being Seen In The U.S.\n\nThe possibility of displays of the aurora borealis at more southerly latitudes than is typical is down to an increase in solar activity, which is currently at a 23-year high due to the current solar maximum period.\n\nThe sun is now thought to be on the wane, having peaked in late 2024, but the best aurora displays often occur in the few years after solar maximum. If the current solar cycle does have a long tail, good aurora sightings in the U.S. could result for a few years.\n\nWhen The Northern Lights Are Most Common\n\nMarch-April and September-October are the most geomagnetically active month of the year, with geomagnetic disturbances twice as likely in spring (and also in fall) as in winter and summer. They tend to be strongest in the week or two after the equinoxes (September 22, 2025 and March 20, 2026).\n\nEarth’s axis tilts by 23.5 degrees, which is why we have seasons. It also puts Earth perpendicular to the sun at equinox. Since the solar wind’s magnetic field is facing southward relative to the Earth, during equinox the geometry more easily allows charged particles from the sun to be accelerated down the field lines of the Earth’s magnetic field.",
  "medium": "Article",
  "links": [
    "https://www.swpc.noaa.gov/products/3-day-forecast",
    "https://www.swpc.noaa.gov/products/forecast-discussion",
    "https://www.forbes.com/sites/jamiecartereurope/2025/08/10/the-perseids-are-peaking---heres-how-to-beat-the-bright-moonlight/",
    "https://www.swpc.noaa.gov/products/aurora-30-minute-forecast",
    "https://aurora-alerts.uk/",
    "https://www.swpc.noaa.gov/communities/aurora-dashboard-experimental",
    "https://www.swpc.noaa.gov/products/aurora-viewline-tonight-and-tomorrow-night-experimental",
    "https://www.forbes.com/sites/jamiecartereurope/2025/06/24/northern-lights-tonight-10-states-may-see-aurora-on-tuesday-during-geomagnetic-storm/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "northern U.S. states",
      "weight": 0.09485571
    },
    {
      "name": "aurora displays",
      "weight": 0.09381078
    },
    {
      "name": "U.S. states",
      "weight": 0.08578626
    },
    {
      "name": "good aurora sightings",
      "weight": 0.08564249
    },
    {
      "name": "solar activity",
      "weight": 0.082003415
    },
    {
      "name": "geomagnetic storms",
      "weight": 0.08123953
    },
    {
      "name": "Aurora",
      "weight": 0.0812191
    },
    {
      "name": "aurora",
      "weight": 0.0812191
    },
    {
      "name": "geomagnetic activity",
      "weight": 0.07941081
    },
    {
      "name": "solar flares",
      "weight": 0.07792225
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Weather",
      "score": 0.9013671875
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.50146484375
    }
  ],
  "sentiment": {
    "positive": 0.21405038,
    "negative": 0.16333365,
    "neutral": 0.62261593
  },
  "summary": "The National Oceanic and Atmospheric Administration (NOAA) has forecasted that the Northern Lights may be visible in the U.S. on Tuesday and Wednesday, just as the Perseid meteor shower peaks. This is due to a spate of solar flares on the sun after weeks of inactivity. The agency's three-day forecast indicates an increase in geomagnetic activity overnight on Aug. 12 through Wednesday, Aug. 13. The Kp index, a guide to the intensity of aurora displays, may reach 4 during a G1 geomagnomagnetic storm. The potential displays are likely to occur in northern U.K. states and Canada, with 10 U.",
  "shortSummary": "The Northern Lights may be visible in 10 US states as a result of increased solar activity, particularly during the Perseid meteor shower.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ba2794ed584b467e906729de81333d7b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/jamiecartereurope/2025/08/10/the-perseids-are-peaking---heres-how-to-beat-the-bright-moonlight/",
      "text": "When is the Perseid meteor shower? Happening right now — and peaking this week — the fastest and brightest meteor shower of the year will likely underwhelm.\n“The Perseid meteor shower is active between Jul. 17 and Aug. 24,” said Dr Shyam Balaji, theoretical physicist at King’s College London, in an email. “It peaks on Aug. 12, but the light from the full moon might make meteors harder to spot that night.” Harder, but not impossible.\nHere’s everything you need to know about — and how and when to get the best view of — the Perseid meteor shower this week.\nPeak Night Is August 12–13 — But Moonlight Will Be a Factor\nOn the peak night, Aug. 12–13, a bright gibbous moon — about 84% lit and rising just as it starts to get dark — will vastly reduce the visibility of “shooting stars.” “The light from the full moon might make meteors harder to spot that night,” said Balaji.\nThe best chance may be just after sunset and before moonrise, when the sky is still dark, on Aug. 12 — but it’s a narrow window.\nExpect About 5-10 ‘Shooting Stars’ Per Hour On The Peak Night\nAlthough the Perseids can see about 75 “shooting stars” per hour during their peak night, this year observers might spot only five to 10 meteors per hour. That’s the huge impact of a bright gibbous moon.\n“The Perseid meteor shower is caused by the Earth travelling through the debris left by a comet called Swift-Tuttle,” said Balaji. “The debris falls through the Earth’s atmosphere, and as it burns up, you get the meteor shower display.”\nFind An Open Space With A Clear View\nAlthough strong moonlight means there’s no point in escaping to dark skies for the Perseids this year, you still need to think about your observing location. \"The key would be to find an open space with a clear view of as much of the sky as possible, since meteors can appear anywhere,” said Dr. Qicheng Zhang, astronomer at Lowell Observatory in Flagstaff, Arizona, in an email. He adds that smoke and smog can also make a noticeable difference.\nThe Peak Night Is Still Worth Watching Despite the Moon\nAlthough the Perseid meteor shower will be marred by moonlight, it can still be an astronomical highlight for stargazers. That’s because some of the brighter “shooting stars” — called fireballs — will still be visible to those with lots of patience.\nThe best chance may be just after sunset and before moonrise, when the sky is still dark, on Aug. 12 — but it’s a narrow window.\nThere may be reasons to look for Perseids in a darker sky, but there’s still likely to be a visible uptick in rates around the peak night. “The Perseids in the middle of the month are still likely to produce the most visible meteors despite the moon,” said Zhang.\nYou Can Take Evasive Action To Beat The Strong Moonlight\nThere’s not much you can do about moonlight interrupting the peak of the Perseid meteor shower, but you can lessen its impact by keeping the moon behind you and, better still, watching from somewhere in shadow.\nHowever, be careful that the obstruction you use to block the moon doesn’t also block too much of the night sky. That’s likely to be a bigger problem the higher the moon rises into the sky after midnight.\nThe Nights Following The Peak Are Also Worth Being Outside For\nThe nights immediately afterwards are also worth being outside for looking for “shooting stars.”\n“The moon rises slightly later each night around the time of the Perseids peak, giving a slightly longer moonless window for later nights,” said Zhang. “However, typically, the meteor rate drops off substantially from the peak — one would probably still see more meteors on the peak night than afterward, all else equal.”\nThere Could Be A Sudden Outburst\nSudden, unpredictable outbursts could increase that number, but they’re rare and difficult to forecast. “Outbursts are notoriously hard to predict since they require us to know precisely how the parent comet responsible for the meteors was behaving centuries ago, long before astronomers were observing it in any detail,” said Zhang. “Strong outbursts in meteor activity may last only a few hours, and because they’re unpredictable in time, require either a lot of luck or watching for many hours to have a reasonable chance of catching.”\nThe Perseid meteor shower is caused by the Earth travelling through the debris left by comet Swift-Tuttle.\nLook To The North-East For The Best Chance\n“Shooting stars” can appear anywhere in the night sky at any time. However, there is a radiant point, a specific location in the night sky from which the meteors appear to originate. “The best place to view the Perseid meteor shower is in the Northeast near the constellation Perseus,” said Balaji. “While you can look at the whole sky and are likely to see a meteor, that’s the target location.”\nThe brightly lit moon might upset your view of the Perseid meteor shower in 2025, but it will simultaneously create a rather beautiful sight. Look alongside the moon as it rises in the east — albeit uncomfortably near the Perseids’ radiant point — and you’ll see the planet Saturn, close to looking its biggest, brightest and best in 2025.\nWishing you clear skies and wide eyes."
    },
    {
      "url": "https://www.swpc.noaa.gov/products/aurora-30-minute-forecast",
      "text": "|\nNorthern Hemisphere |\nSouthern Hemisphere |\nThis is a short-term forecast of the location and intensity of the aurora. This product is based on the OVATION model and provides a 30 to 90 minute forecast of the location and intensity of the aurora. The forecast lead time is the time it takes for the solar wind to travel from the L1 observation point to Earth.\nThe two maps show the North and South poles of Earth respectively. The brightness and location of the aurora is typically shown as a green oval centered on Earth’s magnetic pole. The green ovals turn red when the aurora is forecasted to be more intense. The sunlit side of Earth is indicated by the lighter blue of the ocean and the lighter color of the continents. Aurora can often be observed somewhere on Earth from just after sunset or just before sunrise. The aurora is not visible during daylight hours. The aurora does not need to be directly overhead but can be observed from as much as a 1000 km away when the aurora is bright and if conditions are right.\nThe aurora is an indicator of the current geomagnetic storm conditions and provides situational awareness for a number of technologies. The aurora directly impacts HF radio communication and GPS/GNSS satellite navigation. It is closely related to the ground-induced currents that impact electric power transmission.\nFor many people, the aurora is a beautiful nighttime phenomenon that is worth traveling to arctic regions just to observe. It is the only way for most people to actually experience space weather.\nThese links provide a discussion of the aurora phenomena and tips for the best opportunities to view aurora at various locations around the world.\nThe OVATION (Oval Variation, Assessment, Tracking, Intensity, and Online Nowcasting) model is an empirical model of the intensity of the aurora developed at the Johns Hopkins University, Applied Physics Laboratory by Patrick Newell and co-workers1. The model uses the solar wind velocity and interplanetary magnetic field measured at the L1 orbit position at 1.6 million km (1 million miles) upstream from earth as input and calculates three types of electron precipitation and the proton precipitation which strongly correlate with the aurora. An estimate of aurora viewing probability can be derived by assuming a linear relationship to the intensity of the aurora. This relationship was validated by comparison with data from the Ultraviolet imager (UVI) instrument on the NASA Polar satellite(2).\nOn occasion, the input solar wind data are either contaminated or unavailable. In those instances, an alternative estimate of the solar wind forcing, based on the current Kp geomagnetic index is used to drive the OVATION model. When this occurs, there is no forecast lead time.\nFor more information on the OVATION model and aurora products, see:\n- Newell, P. T., T. Sotirelis, and S. Wing (2009), Diffuse, monoenergetic, and broadband aurora: The global precipitation budget, J. Geophys. Res., 114, A09207, doi:10.1029/2009JA014326(link is external).\n- Machol, J. L., Green., J. C., Redmon, R. J., Viereck, R. A., Newell, P. T., (2012), Evaluation of OVATION Prime as a forecast model for visible aurorae, Space Weather, 10, 3, doi.org/10.1029/2011SW000746\nIn 2009, Newell et. al., developed the OVATION model.\nIn 2011, NOAA (NCEI and SWPC) developed a real-time version of the OVATION model to forecast the location and intensity of the aurora. Machol and Redmon (NCEI) developed the real-time ovation model. Viereck (SWPC) implemented the model and developed the graphical products to run in realtime to create aurora forecasts.\nIn 2013, Newell upgraded the OVATION Prime model so that it would more accurately capture large geomagnetic storms. The original model, based solely on DMSP data, was only reliable to Kp of 7. By adding data from the NASA TIMED GUVI instrument, Newell et al., were able to expand the model to include the larger storm values of Kp of 8 and 9.\nIn 2016, NOAA SWPC shared the operational OVATION code (written in IDL) with the UK Met Office in the UK. The UK Met Office converted the OVATION model from IDL to Python.\nIn 2020, NOAA SWPC implemented the new version of the OVATION Prime model into operations. This version has been dubbed OVATION 2020.\nThe Auroral Forecast product is based on the OVATION Prime model developed by P. Newell at the Johns Hopkins, Applied Physics Laboratory.\nThe latest 24 hours of image frames comprising the Northern and Southern hemisphere loops (with time-tagged file names) are available: Northern, Southern\nThe most recent Northern and Southern Hemisphere images (with static file names) are available: Northern, Southern\nAuroral data in a grided format for the entire Earth is available in compressed JSON format: The latest JSON file is available as well.\nThe Hemispheric Power Index, an estimate of the total auroral energy input at each pole, is available in ASCII format: latest HPI"
    },
    {
      "url": "https://www.swpc.noaa.gov/products/aurora-viewline-tonight-and-tomorrow-night-experimental",
      "text": "This is a prediction of the intensity and location of the aurora borealis tonight and tomorrow night over North America. It also shows a 'viewline' that represents the southern-most locations from which you may see the aurora on the northern horizon. This product is based on the OVATION model and uses the maximum forecast geomagnetic activity (Kp) between 6pm and 6am US Central Time. The images are updated continuously, with the transition when \"tomorrow night\" becomes \"tonight\" occurring at 12:00Z (i.e., within an hour of the end of the 6pm-6am Central Time window that is used here to define \"night\").\nThe two maps show the aurora and viewline tonight and tomorrow night. The brightness and location of the aurora is typically shown as a green oval centered on Earth’s magnetic pole. The green ovals turn red when the aurora is forecast to be more intense. Aurora can often be observed somewhere on Earth from just after sunset or just before sunrise. The aurora is not visible during daylight hours. The aurora does not need to be directly overhead but can be observed from as much as 1000 km away when the aurora is bright and if conditions are right.\nA short term forecast (~30 minutes) along with the last 24 hours of activity can be found on the Aurora - 30 Minute Forecast page. And SWPC's new Aurora Dashboard (Experimental) collects the products and information from across SWPC's website for a one-stop shop.\nThe OVATION (Oval Variation, Assessment, Tracking, Intensity, and Online Nowcasting) model is an empirical model of the intensity of the aurora developed at the Johns Hopkins University, Applied Physics Laboratory by Patrick Newell and co-workers[1]. For tonight's and tomorrow night's aurora viewline prediction the SWPC 3-Day Geomagnetic Forecast (Kp index) is used to drive the OVATION model. The model uses maximum forecast geomagnetic activity (Kp) between 6pm and 6am US Central Time tonight and tomorrow night\nFor more information on the OVATION model and aurora products, see:\n- Newell, P. T., T. Sotirelis, and S. Wing (2009), Diffuse, monoenergetic, and broadband aurora: The global precipitation budget, J. Geophys. Res., 114, A09207, doi:10.1029/2009JA014326(link is external).\n- Machol, J. L., Green., J. C., Redmon, R. J., Viereck, R. A., Newell, P. T., (2012), Evaluation of OVATION Prime as a forecast model for visible aurorae, Space Weather, 10, 3, doi.org/10.1029/2011SW000746\nIn 2022, the view-line product presented here for tonight's and tomorrow night's aurora first debuted.\nThe history of the OVATION model can be found on the 'History' tab of the Aurora - 30 Minute Forecast page.\nBecause the view-line images are based on forecast Kp, the images themselves are not archived."
    },
    {
      "url": "https://aurora-alerts.uk/",
      "text": "WARNING : You have prevented the app from using your location, so all local times and forecasts will be inaccurate. You will be unable to report sightings and may be seeing a version of the app for the wrong country.\nLocation is automatically blocked by default on Apple devices. You have to fix it yourself otherwise this app will not work properly.\nYou are now frozen out for at least 60 seconds.\nWait patiently or come back later. Never refresh your screen. The app will automatically refresh as fast as it is able. Help\nIf you are constantly seeing the blue loading popup, it is because you are either refreshing the screen or repeatedly closing/re-opening the app. This puts unnecessary strain on the server which can cause it to overload at peak times.\nLearning how to avoid this will help you have a much better experience with your device and also help me to provide a service to more people at busy times.\nIn most cases, this is because you have a three-button Android device and are using the 'back' button instead of the 'home' (middle) button. Try using the middle button on your phone instead of 'back' and everything will work much more efficiently.\n'Back' closes apps, instead of minimising them. This means that when you come back to the app a few minutes later it has to fully reload itself. Use the middle button and all apps will load instantly.\nMore help is available on the Support Page.\n| A status report will normally be posted by 7pm each evening, with further updates as things develop. |\nGlendale App is the world's most accurate aurora alerting and forecasting app. Over 199,000 users.\nRegister to activate the full features of the app. Pro bono. No SPAM. No advertisements. No marketing. No cost. No begging.\nYou are seeing only sample data at the moment. You need to register to see live, real-time updates.\n| Elevation | Azimuth | |\n|---|---|---|\n| Sun Position | ||\n| NLCs | Cirrus | |\n| Max Height | ||\nNoctilucent clouds are lit by sunlight in an area of the night sky called the Twilight Arc.\nMy twilight-arc tracker is constantly monitoring the position of the sun at your location and calculating the position and height of the twilight arc.\nThe centre of the twilight arc is at the sun's azimuth. The sun's elevation is its angle above (or below, if -ve) the horizon.\nThe 'Max Heights' are the maximum angles above the horizon that Noctilucent Clouds and Cirrus can be lit directly by sunlight.\nNLCs are only visible when the sun is in a narrow range of angles below the horizon that are dependent on your latitude. The optimum times, when you have the highest chance of seeing them are shown.\nThey are much rarer than auroras, typically seen fewer than 15 nights per year. They are clearly visible by eye, even in towns and cities.\nThere is no way to predict noctilucent clouds. The trick is to look every night at the optimum times given on this app and you will get lucky.\nGlobal, real-time tracking of auroral substorms is only possible due to some incredible organisations allowing me to access the live data from their magnetometer arrays.\nI am indebted to the kindness and generosity of the Tromsø Geophysical Observatory, Swedish Institute of Space Physics, the US Geological Survey and the Finnish Meteorological Institute for letting me access their live data feeds.\nI am also indebted to I.R. Mann, D.K. Milling and the rest of the CARISMA team for use of data from the Canadian magnetometer array. CARISMA is operated by the University of Alberta, funded by the Canadian Space Agency.\nSubstorm tracking relies on data collected at magnetic observatories. I thank the national institutes that support them and INTERMAGNET for promoting high standards of magnetic observatory practice (www.intermagnet.org).\nMann, I. R., et al. (2008), The upgraded CARISMA magnetometer array in the THEMIS era, Space Sci. Rev., 141, 413ï¿½451, doi:10.1007/s11214-008-9457-6.\nThe headline figure -100 nT is the strength of the aurora in the sky right now, called the substorm strength*.\nWatch this number! You want it negative. The more negative it is, the stronger the aurora is at that minute. Falling is good, rising is bad. It tracks the strength of the actual aurora in the sky in real-time. It is the single most important number on the app and overrides all others.\nWhen it says 'growth', the substorm is charging up like a battery. When it says 'expansion' that energy is being released as aurora. When it says 'recovery', the aurora will slowly begin to fade.\nThe trendline shows the changes in strength over the last hour. The line dropping sharply downwards is good. Rising is bad. The blue shaded area indicates the ambient level.\n*Auroral Substorm Index (AS Index).\n| Loading... |\nIMF tells us about the future, not the present. We use it to predict activity 1 to 3 hours from now.\nThe table shows an analysis of the interplanetary magnetic field in the 30 minute window that is currently arriving at Earth, together with windows either side of it. The 'percentage' figure indicates how negative the Bz was, the ideal is 100% negative.\nIf the 'now' and 'next' rows are both lit up, the substorm will continue if one is active or will start in about an hour if one isn't active.\nIf the 'next' row is not lit up, the activity will start to wane if a substorm is active but there can be an extra burst of activity, so wait an hour.\nWhen a substorm is in its expansion phase all of these values are irrelevant to that substorm. Substorm strength overrides all other metrics.\nThe trendlines show the Bz and Bt that is arriving at Earth now (left) and as far into the future as it is possible to see, at L1 satellites (right). Bt is at the top, Bz in the middle and the optimum Bz at the bottom (black).\nThe middle line is the important one. You want it to be below the blue shaded (ambient) area and as close to the black line as possible.\n| Speed (V) | Loading... | |\n|---|---|---|\n| Density (N) | Loading... | |\n| Pressure | Loading... | |\n| PCP | Loading... |\nThis is the mean velocity, density and pressure of the solar wind that is currently arriving at the Earth. They don't directly matter for aurora. IMF is what matters. A good IMF will lead to aurora even when speed and density are at ambient levels.\nWe use solar wind data to look for space weather events that might bring us good IMF. Primarily we look for shocks, which are simultaneous large steps on the graphs.\nWhen a substorm is active, all of these values are irrelevant. Substorm strength overrides all other metrics.\nAurora is all about magnetic fields (IMF-driven). Speed and density do NOT affect physical characteristics of the aurora such as brightness, colour or viewing latitude. Nor do they have any affect on the substorm process itself.\nThe trendlines show the solar wind speed (V), density (N), temperature (T) and IMF strength (B) that is arriving at Earth now (left) and as far into the future as it is possible to see, at L1 satellites (right). The blue shaded area indicates the ambient level.\nThe EPAM chart shows low-energy particles arriving at Earth. The protons are the thick line and electrons the thin line. The lines climbing sharply indicates that a space weather event is approaching. Proton values rise sharply in the hours before an interplanetary shock.\nCoronal holes cause most of our auroras and they are regular, repeating on a 27 day cycle. Plasma from an Earth-facing coronal hole typically takes 3 to 4 days to reach us and spark auroras.\nFlipping between the 'now' and '-27 days' tabs allows you to see how coronal holes have changed since their last rotation 27 days ago.\nThe '-4 days' tab allows you to see how the coronal hole looked when it was in the earth-facing position 4 days ago.\nSolar imagery courtesy of NASA/SDO and the AIA, EVE, and HMI science teams. GOES SUVI imagery courtesy of the NOAA SWPC.\n| Loading... |\n| Loading... |\nCoronal Mass Ejections are bursts of plasma that sometimes erupt from sunspots, during a solar flare, or from filaments. They can trigger the strongest auroras if they hit Earth.\nYou are looking for plasma surrounding more than 50% of the solar disk in this graphic (a partial halo). The ideal is a 'full halo', where plasma appears to surround the entire solar disk. It then takes 2 to 3 days for the CME to reach Earth.\nEven when there appears to be an Earth-directed component or it looks like a direct hit, the CME can still miss completely or bounce off the Earth's magnetosphere. Don't get too excited until the app alerts that a shock has been detected!\nDon't take any ETAs too seriously, either here or on other sites, as they are only a very rough guide.\nUnverified CMEs are those automatically detected by the app that haven't been manually reviewed yet to confirm that they are valid and Earth-sided.\nCME data and graphics derived by Glendale App from solar imagery kindly provided by SOHO.\n| Loading... |\n| Loading... |\nSolar flares from sunspots sometimes produce a CME which, if directed earthward, can cause strong substorms between two and four days after the eruption.\nMost flares don't produce a CME and most CMEs miss the Earth, so don't get too excited about flares.\nFlares are classed A, B, C, M or X with A being weakest and X being strongest. The number indicates how strong the flare was within its class.\nAfter a flare, it can take several hours before imagery becomes available that enables us to determine whether there was a CME and whether that CME was Earth-directed. After a flare, keep checking the Coronal Mass Ejections panel for the latest updates as imagery arrives.\nThe image shows the active region that was the source of the most recent solar flare, highlighted with a circle. When there have been no recent flares it shows the latest image of the solar disk. The images are annotated with the sunspot (active region) numbers. These are colour-coded based on magnetic complexity.\nSolar imagery courtesy of NASA/SDO and the AIA, EVE, and HMI science teams. GOES SUVI imagery and Region Summary data courtesy of the NOAA SWPC.\n| Loading... |\nDates that are coloured black are uncertain. Dates shown in colour are more likely. Dates that are missing have no predicted activity.\nThis forecast should only be used for dates 10 to 27 days in the future. Up to 9 days ahead we can see the actual hole on the solar disk.\nThe sun spins on its axis effectively every 27 days, which means that coronal holes and active regions giving us auroras today can rotate back around again in 27 days time, giving another show.\nThese are the dates when solar wind streams that gave us good auroras will rotate around again. There is no guarantee that the coronal holes that caused the substorms on the previous rotation won't have closed but they also may have got larger. You can only use these as a guide but this is the most accurate long-range forecast for the UK, Ireland, Iceland, Scandinavia, North America and Australasia that you will find anywhere in the world.\nIt is essential to check the coronal holes panel, as we get closer to the dates that interest you, to confirm the current status of the hole that caused the activity, as it might have closed.\nThis forecast is based on my own data collected in the UK and is valid worldwide. The more negative the figure, the stronger the aurora could be.\n* You need to register to view the full 28-day forecast.\n| Loading... |\nIf you have forgotten your password, an email will be sent to your registered email address with a link to reset it. Click 'Reset Password' button and follow the instructions in the email to log back in.\nIf you have forgotten what your own name is, an email can be sent to your registered email address with a reminder. Click 'Send My Name' button and a reminder will be sent to you.\nEntering your details here will allow you to make instant, live, aurora reports to let others know what the current situation is where you are. You will also be able to see reports from other users, access all features of the app and see the live data in real-time.\nEnter the exact same details on all devices where you use the app to synchronise your history and reports across them all.\nIf you work as an aurora tour guide, researcher, scientist or are an admin on an aurora facebook site you can enter those details and they may be shown to other users.\nYour actual name, your actual email address and the name of your nearest town/village are required to use this app. Only your first and last name are required. Abuses will result in the account being de-activated. This includes nick-names, truncation, obfuscation, business names, junk, burner emails, emails that bounce, etc.\nThis app collects sighting reports you make for purposes of scientific research, to improve the accuracy of aurora forecasting and for alerting users when the aurora is active.\nYour personal data is not shared with any other organisations or third parties.\nYou will not be spammed. You may be contacted about interesting reports you have made, problems you are having with the app or security/authentication issues.\nThis app only uses essential cookies.\nThe commonest reason for your account being blocked is that you have a mistake in your email address. If the account activation email bounces your account will automatically be blocked. Check your email address very carefully. It may also be due to your name failing to meet the account rules.\nThe commonest reason that you haven't received an activation code is that you have a mistake in your email address. Check your email address very carefully. If you are certain the email is correct then it is most likely your spam filter, to unblock this email me from the email account you are registering with and request a code.\nYour phone is android and is capable of receiving alerts but you need to install the Chrome app and make it your default web browser. You are currently using the Samsung web browser.\nTo install this web app on your device:\nOpen Safari.\nGo to aurora-alerts.uk.\nPress SHARE button in Safari (NOT 'share' in the app).\nScroll right.\nAdd to Home Screen.\nAdd (top right).\nOpen Chrome or Firefox.\nGo to aurora-alerts.uk.\nClick the red 'install the app' button.\nOpen the Chrome App.\nGo to aurora-alerts.uk.\nClick three vertical dots icon (top right).\nAdd To Home Screen.\nClick 'Enable Alerts'.\nApp installed and tile added.\nThe basic alerts are push notifications that the app sends automatically when it detects that an aurora is developing. An 'onset' alert is sent first as a warning that an aurora is starting, followed by yellow, amber, red, major, severe and extreme alerts as activity develops. Your device will receive these even when the app is not running.\nThe 'Expansion Alarm' is designed for desktop users. If you leave the app running in 'alarm mode' on your PC, the app will start bleeping as soon as it detects a substorm heading into expansion phase to give you time to head out and catch it at its peak.\n'Activity Alerts' are notifications that can be set to 'ping' your device only when the app is running. These occur much more frequently than the basic alerts. They alert you to all thresholds being crossed, auroras being reported by users and photos being uploaded. These are great for users of desktop PCs who want to keep constantly updated on the current aurora situation.\nAlerts are available for both Apple and Android devices via Telegram at https://t.me/GlendaleApp\nThe plot shows the substorm strength* over the last 24 hours, which allows you to see the periods when the aurora was at its best.\nThe more negative the figure, the stronger the aurora was.\nThese graphs are deliberately produced 5+ minutes behind real-time. Use the Substorm Panel above for aurora-hunting.\nThese graphs allow you to verify the accuracy of this app by comparing the times of your best photos against the substorm strength the following day. You will see that your best photos were taken precisely on the best drops. Remember that the graphs are in UTC time, not your local time.\n*Auroral Substorm Index (AS Index).\nThe plot shows the IMF Bt (black) & Bz (red) over the last 24 hours, which allows you to see the periods when the IMF was strongest.\nThe pale green line shows the By.\nThe plot shows the clock angle (θ) over the last 24 hours, which allows you to see the periods when the IMF was best aligned.\nThe plot shows the solar wind speed & density over the last 24 hours.\nThe chart shows magnetometer deflections at every station on the entire Norwegian array from north to south, in descending order of latitude, plotted over the last 24 hours.\nSharp drops correspond to substorms in their expansion phase. Ideally what you are looking for on the stackplot are drops of >200nT on the right-hand side of the graph. The scale is shown top-right.\nThis should not be used for real-time aurora-hunting. Use the substorm panel at the top of the app instead, as it reacts faster and translates all the squiggles into a single, easy-to-use number.\nStackplot courtesy of the Tromsø Geophysical Observatory.\nThe 'at-Earth' graphs allow you to see when activity was happening over the last 24 hours. These should not be used for real-time aurora-hunting, as they are deliberately delayed. They are intended to be used to correlate the timestamps on your images taken last night against the data that was being shown on Glendale App at the time. This helps you to verify how accurate the app is at tracking the actual aurora that was happening in the sky. Times are in UTC, so you will need to consider your UTC offset.\nThe 'substorm strength' graph is the main graph for retrospective use. It shows you when all of the substorm activity was happening. You will see that the times of peak activity on your images correspond to the peak drops on the graph.\nThe other graphs are all adjusted to the Earth-time frame of reference and aligned vertically so that you can easily see how the other parameters influence the substorms.\nThese are an educational tool to help you understand how the aurora you captured last night corresponds to the relevant data.\nIdeally what we want is either a negative Bz, or a very wide separation between the Bz and Bt lines, over the course of the last hour.\nSolar wind graphs courtesy of the NOAA SWPC.\nStereo graphs courtesy of the STEREO Science Center\nThis allows you to verify that you have enabled location services correctly in your device and confirm what lat/long your device is giving to the app. If these are wrong then all forecasts and times given on the app will be incorrect. It is vital that you resolve any issues.\nYour location in geomagnetic co-ordinates is also given, which allows you to see how much closer your effective latitude for auroras is to your true latitude.\nGlendale App was created by Andy Stables of the Glendale Skye Auroras Facebook Page to make it easy for people to see and photograph auroras worldwide. It is the result of research carried out on a daily basis since September 2012 in the Isle of Skye.\nThe world-leading accuracy of the app is only possible due to the generosity of the Tromsø Geophysical Observatory, the Swedish Institude of Space Physics, the US Geological Survey, the Finnish Meteorological Institute and the CARISMA team in allowing me to access the live data feeds from their entire magnetometer arrays around the northern hemisphere.\nThe wonderful icons for the tiles, badges and logo were the work of Andrew Liley from Portree.\nThe Iceland Version of the App was only made possible thanks to many hours of detailed observation and recording by Caroline Weir from Reykjavik, who runs the Aurora Iceland Facebook Group.\nRead the full behind-the-scenes story of Glendale App here.\nEurope, Canada & Oceania Maps by vemaps.com."
    },
    {
      "url": "https://www.forbes.com/sites/jamiecartereurope/2025/06/24/northern-lights-tonight-10-states-may-see-aurora-on-tuesday-during-geomagnetic-storm/",
      "text": "Update, June 24, 2025: NOAA has upgraded its forecast, which is now reflected in the article.\nThe Northern Lights may be visible in the U.S. this week, according to the National Oceanic and Atmospheric Administration’s Space Weather Prediction Center, which is predicting a geomagnetic storm that could result in aurora being glimpsed in as many as 14 U.S. states overnight on Tuesday, June 24, and Wednesday, June 25.\nThe agency’s three-day forecast has a minor geomagnetic storm occurring, measured at a value of up to G2 on a scale of G1 to G5. According to NOAA’s forecast, the Kp index — which provides a rough guide to the intensity of aurora displays — may reach 5.\nAccording to Spaceweather.com, a large hole in the sun’s atmosphere is turning toward Earth, unleashing a stream of solar wind in its direction.\nWhere The Northern Lights May Be Visible\nNOAA’s aurora viewlines have potential aurora displays that are possible in northern U.S. states and Canada. A total of 14 U.S. states have a chance of seeing the aurora on the northern horizon on Tuesday, June 24, and Wednesday, June 25, with those on the U.S.-Canada border having a higher chance.\nParts of U.S. states that could potentially see aurora include Washington, northern Idaho, Montana, Wyoming, North Dakota, South Dakota, Minnesota, Wisconsin, Michigan, Iowa, New York, Vermont, New Hampshire and Maine. Areas far from light pollution are likely to get the best views.\nWhen To See The Northern Lights\nExactly when and where aurora becomes visible this week will be down not to predictions but data coming in from NASA’s DSCOVR and ACE satellites. Orbiting the sun from around a million miles from Earth, they give a roughly 30-minute warning of aurora displays after measuring the solar wind’s speed and magnetic intensity. Check NOAA's 30-minute forecast or use the Glendale App for up-to-the-minute forecasts.\nWhat Causes The Northern Lights\nThe Northern Lights are caused by the solar wind, a stream of charged particles from the sun interacting with Earth’s magnetic field. Although the magnetic field deflects much of it, some charged particles accelerate along the magnetic field lines toward the polar regions, where they collide with oxygen and nitrogen atoms, exciting them and causing them to release energy as light.\nThe possibility of displays of the aurora borealis at more southerly latitudes comes from a spike in solar activity, which is currently at a 23-year high due to the current solar maximum period. Geomagnetic storms and aurora are expected to continue through 2025 and 2026.\nWishing you clear skies and wide eyes."
    }
  ],
  "argos_summary": "The Northern Lights may be visible in the U.S. on August 12-13, coinciding with the peak of the Perseid meteor shower, due to increased geomagnetic activity from solar flares. A NOAA forecast indicates a potential Kp index of 4 during a G1 geomagnetic storm, allowing sightings in northern states such as Alaska, Washington, and North Dakota. Despite a bright full moon potentially obscuring the Perseids, sky-watchers may still catch glimpses of both phenomena.",
  "argos_id": "J83J40EA2"
}