{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/trump-dc-crackdown-a-distraction-mayor-arulampalam-video",
  "authorsByline": "bn",
  "articleId": "e6be3e1c48704372bed8a6f95fa44920",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i4yk2iICJdI4/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:14:44.370000+00:00",
  "addDate": "2025-08-12T22:26:43.123712+00:00",
  "refreshDate": "2025-08-12T22:26:43.123716+00:00",
  "score": 1.0,
  "title": "Trump DC Crackdown a Distraction: Mayor Arulampalam",
  "description": "Democratic Mayor Aruban Arulampalam of Hartford, Connecticut, shares his thoughts on President Trump deploying the National Guard on Washington, D.C. and whether this is right or wrong. He also talks about the President slashing public safety funding, and not asking mayors what they are doing to keep crime rates low. Mayor Arulampalam speaks with Joe Mathieu on the late edition of Bloomberg’s “Balance of Power.” (Source: Bloomberg)",
  "content": "What would be your reaction to seeing the federalization of your police department or National Guard troops on the streets of Hartford? Well, Joe, it's great to be with you. Thank you for having me. Let's start with some honest facts here about what's going on. D.C. has had historic lows in this last year in violent crime, the lowest numbers in about 30 years. In fact, it's like crime is down about 30%. And that's what we've seen in cities all across America this past year in Chicago and L.A. and Nashville and Baltimore and Cleveland in Mayor Diaries, City of Fresno. I know you're having him on in a moment. He's he's a good friend. That's right. Here in Hartford. You know, we we had the lowest number of shootings we've had on record in the city of Hartford, about 43% less than they were two years ago. And cities and mayors have shown that we are making real gains when it comes to public safety. And that should be really good news for a president who campaigned on law and order, for a president who campaigned on public safety. That should be good news. And unfortunately, what this president has done, instead of calling up Hartford and saying, you know, how how did you get these historic lows instead of going to the mayor of D.C. and asking, how did you bring down violent crime? 30%. He has slashed public safety funding. He's he's defunded our police. After all the concern we had for many years of Democrats defunding police, this big, beautiful bill has cut longer dollars to law enforcement locally, to federal law enforcement agencies, to community based violence, intervention programs that we know are working. The data is showing that it is working. And it is almost as if he woke up and realized that he campaigned on public safety and had nothing to show for it. And the only people getting things done, the folks keeping our community safe, are mayors working together with law enforcement and communities to create safer and healthier cities, better cities, and more safe cities. Mayors are really getting things done. And instead of engaging US mayors and asking what they can do better and how they can support the efforts that are working, instead of talking to us mayors. And many of us happen to be Democrats, but we just want what is best for our residents. What they've done instead is slash public safety funding and then engage in this distraction that frankly, is is unnecessary and chaotic and dangerous. Well, you've isolated of public safety funding as an issue, and that's duly noted here. I want to get to what else might be right or wrong with the deployment of National Guard troops, the federalization of the police? Because I'm looking at the same data you are. And I live here in Washington, D.C., and I've been around here for a minute. I realize that there have been pretty great strides made, certainly since 2023 when things like carjackings were really peeking around here. And it's a big topic of conversation. But, you know, Mayor, what I've heard from a lot of people who live in town is, yeah, we're at a 30 year low and we're proud of that. But you know what? I still don't feel safe and I might not have a problem with a couple of officers in a cruiser on the corner here on my way home. Is there a problem with the optical impact of what the president is doing? Yeah. And let me be clear. We have so much left to go. Any one person getting shot, any one person having their car. So any one person experiencing the trauma of the crime is one too many. And we want to work to create better solutions. Mayor Dyer, who you're going to talk to in a moment, was a police officer himself. And he will tell you, I hope, that police officers receive a completely different set of training than that National Guard. So it makes no sense to cut funds to actual police officers in our city. It makes no sense to cut funds to these programs that we know are working, coming out of PD, coming out of our cities that are actually working to reduce crime. It makes no sense to to stop the progress that is actually happening. And then talk about bringing in the National Guard. It is an attempt by this White House, frankly, to snatch defeat out of the jaws of victory. We are making real strides when it comes to public safety. And instead of finding and identifying what is working and how do we find those solutions that are working, they're slashing those very solutions that are working in cities and then talking about bringing in the National Guard who have no experience in law enforcement in cities. Have you asked the White House for extra funding or an emergency supplemental for your police department? Well, look, when in the Biden administration, love him or hate him. In the Biden administration, we had real conversations with the White House. They reached out to us and asked us what we need. When it comes to public safety, I don't have any relationship with anyone in the White House. And I think every city has tried to develop those relationships. We would love to try to get additional funding. It also, you know, fundamentally, it bothers me that there is this is a president who is defunding police, defunding dollars that are going to local law enforcement in our cities and our communities. Defunding dollars that are going to federal law enforcement, the DEA and ATF and enforcement agencies that we work closely with to take down crime rates and then talking about public safety in our major cities. You can't cut the dollars to our law enforcement and then expect our cities to to believe you when you talk about wanting to have safer, stronger communities.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "public safety funding",
      "weight": 0.092251696
    },
    {
      "name": "public safety",
      "weight": 0.08698337
    },
    {
      "name": "better cities",
      "weight": 0.07921342
    },
    {
      "name": "law enforcement",
      "weight": 0.078274205
    },
    {
      "name": "cities",
      "weight": 0.078023896
    },
    {
      "name": "federal law enforcement agencies",
      "weight": 0.07727243
    },
    {
      "name": "federal law enforcement",
      "weight": 0.07714915
    },
    {
      "name": "police officers",
      "weight": 0.07657741
    },
    {
      "name": "local law enforcement",
      "weight": 0.07567804
    },
    {
      "name": "actual police officers",
      "weight": 0.07440927
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98193359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.8330078125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.72998046875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.72705078125
    }
  ],
  "sentiment": {
    "positive": 0.050206978,
    "negative": 0.8012505,
    "neutral": 0.14854246
  },
  "summary": "Hartford, Connecticut, Mayor Arulampalam, has criticized President Donald Trump's decision to federalize his police department or National Guard troops in Washington, D.C. for a crackdown on violent crime, citing historic low numbers in the last 30 years and a 30-year low in violent crime as proof that public safety is on the rise. However, he argues that the president has instead slashed public safety funding and engaged in a distraction that is unnecessary and chaotic and dangerous. He criticizes the White House for not engaging US mayors and instead engaging them in discussions about solutions that are working. Arulamalam argues that mayors are working to reduce crime and create safer and healthier cities. He also criticizes an attempt to snatch out of victory by the administration, stating that the administration is trying to defeat progress that is being made.",
  "shortSummary": "President Donald Trump's administration's reliance on federal intervention to reduce violent crime has led to significant reductions, yet his policies prioritize public safety over law enforcement.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ac722230e63e4c4a9456fc85a4f9f173",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article discusses the significant reductions in violent crime in various U.S. cities, including Hartford, where shootings have decreased by 43%. Despite these improvements, the mayor criticizes the Biden administration for cutting public safety funding and defunding police, arguing that this undermines the progress made in community safety. The mayor emphasizes the need for collaboration between local law enforcement and the federal government to maintain and enhance public safety efforts.",
  "argos_id": "JB0I3LQRB"
}