{
  "url": "https://www.nasdaq.com/articles/taiwan-stock-market-expected-open-green",
  "authorsByline": "RTTNews",
  "articleId": "d4644b255273496987b3e819e86ea338",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:30:50+00:00",
  "addDate": "2025-08-13T00:37:55.408693+00:00",
  "refreshDate": "2025-08-13T00:37:55.408695+00:00",
  "score": 1.0,
  "title": "Taiwan Stock Market Expected To Open In The Green",
  "description": "(RTTNews) - The Taiwan stock market has moved higher in four straight sessions, rallying more than 700 points or 3 percent along the way. The Taiwan Stock Exchange now sits just beneath the 24,160-point plateau and it may see additional support again on Wednesday.",
  "content": "(RTTNews) - The Taiwan stock market has moved higher in four straight sessions, rallying more than 700 points or 3 percent along the way. The Taiwan Stock Exchange now sits just beneath the 24,160-point plateau and it may see additional support again on Wednesday.\n\nThe global forecast for the Asian markets is upbeat on an improved outlook for interest rates. The European markets were mixed and the U.S. bourses were up and the Asian markets figure to follow the latter lead.\n\nThe STI finished barely higher on Tuesday following gains from the plastics and mixed performances from the financial shares and technology stocks.\n\nFor the day, the index perked 22.86 points or 0.09 percent to finish at 24,158.36 after trading between 24,065.43 and 24,263.92.\n\nAmong the actives, Mega Financial rallied 1.59 percent, while CTBC Financial fell 0.32 percent, First Financial climbed 1.06 percent, Fubon Financial collected 0.58 percent, E Sun Financial perked 0.15 percent, United Microelectronics Corporation added 0.62 percent, Hon Hai Precision shed 0.51 percent, Largan Precision sank 0.83 percent, Catcher Technology stumbled 2.14 percent, MediaTek gained 0.37 percent, Delta Electronics improved 0.63 percent, Novatek Microelectronics rose 0.23 percent, Formosa Plastics surged 3.25 percent, Nan Ya Plastics soared 3.89 percent, Asia Cement lost 0.63 percent and Cathay Financial and Taiwan Semiconductor Manufacturing Company were unchanged.\n\nThe lead from Wall Street is firm as the major averages opened higher and continued to accelerate as the day progressed, ending near session highs.\n\nThe Dow surged 483.52 points or 1.10 percent to finish at 44,458.61, while the NASDAQ rallied 296.50 points or 1.39 percent to close at a record 21,681.90 and the S&P 500 climbed 72.31 points or 1.13 percent to end at 6,445.76, also a record.\n\nThe strength on Wall Street followed the release of the Labor Department's closely watched report on consumer price inflation for July, which was in line with expectations.\n\nDespite the faster than expected annual core price growth, traders seem to believe the data increases the chances the Federal Reserve will lower interest rates next month.\n\nFollowing the release of the report, CME Group's FedWatch Tool is indicating a 94.4 percent chance the Fed will cut rates by a quarter point in September.\n\nCrude oil prices slumped on Tuesday ahead of an upcoming meeting between the U.S. and Russian presidents on Friday in Alaska. West Texas Intermediate crude for September delivery was down $0.88 or 1.38 percent at $63.08 per barrel.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taiwan Stock Market",
      "weight": 0.08275485
    },
    {
      "name": "Cathay Financial",
      "weight": 0.07069701
    },
    {
      "name": "consumer price inflation",
      "weight": 0.07051339
    },
    {
      "name": "E Sun Financial",
      "weight": 0.0699148
    },
    {
      "name": "Mega Financial",
      "weight": 0.06845459
    },
    {
      "name": "First Financial",
      "weight": 0.068396606
    },
    {
      "name": "CTBC Financial",
      "weight": 0.06836467
    },
    {
      "name": "Fubon Financial",
      "weight": 0.06832827
    },
    {
      "name": "interest rates",
      "weight": 0.06569557
    },
    {
      "name": "Taiwan Semiconductor Manufacturing Company",
      "weight": 0.06554066
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.5693359375
    }
  ],
  "sentiment": {
    "positive": 0.6306414,
    "negative": 0.16710334,
    "neutral": 0.20225525
  },
  "summary": "The Taiwan Stock Exchange (STI) has risen in four consecutive sessions, rallying over 700 points or 3 percent. The global outlook for the Asian markets is positive due to an improved outlook for interest rates. The STI finished barely higher on Tuesday, largely due to gains from plastics and financial shares. Major averages on Wall Street also opened higher, with the Dow surging by 1.10% and S&P 500 ending near session highs. Despite the Labor Department's report on consumer price inflation for July being in line with expectations, traders believe it increases the chances the Federal Reserve will lower interest rates next month.",
  "shortSummary": "The Taiwan Stock Exchange rose slightly, with gains from plastics and financial stocks offsetting declines in other sectors, while global markets also rose.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6e09c0fc0885484793346ec66dfce428",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Taiwan stock market has experienced a four-session rally, gaining over 700 points or 3%, and is currently positioned just below the 24,160-point mark. The positive outlook for Asian markets is supported by favorable trends in the U.S. stock market, where major indices reached record highs following a consumer price inflation report that aligns with expectations, increasing the likelihood of an interest rate cut by the Federal Reserve. Meanwhile, crude oil prices have declined ahead of a significant meeting between U.S. and Russian leaders.",
  "argos_id": "JD3SIBUH4"
}