{
  "url": "https://www.reuters.com/business/environment/china-deploys-robot-antelope-tibet-surveil-real-herds-2025-08-12/",
  "authorsByline": "Reuters",
  "articleId": "315b8840943247deb97688b8d35ff32b",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/466BJJQ7PVGY5O53NZ3KL65MHM.png?auth=b9c3bf166c40a6778eb5672993fde7c30a15f48329026674eff92afd8da1d0ca&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:27:30.076000+00:00",
  "addDate": "2025-08-12T07:32:20.969817+00:00",
  "refreshDate": "2025-08-12T07:32:20.969818+00:00",
  "score": 1.0,
  "title": "China deploys robot antelope in Tibet to surveil real herds",
  "description": "To the wolves of Tibet, China's first 'robot antelope' may look as appetising as the real herds that roam the rugged tundra, but the \"creature\" is part of Beijing's growing surveillance that now even reaches into its most remote places.",
  "content": "BEIJING, Aug 12 (Reuters) - To the wolves of Tibet, China's first 'robot antelope' may look as appetising as the real herds that roam the rugged tundra, but the \"creature\" is part of Beijing's growing surveillance that now even reaches into its most remote places.\n\nIts doe-like eyes and thick brown fur make the robotic ruminant nearly indistinguishable from the real antelope as the 5G- and AI-integrated imposter scans the Hoh Xil plateau with its sensors, footage from China's state news agency Xinhua shows.\n\nDeveloped by Xinhua, the Chinese Academy of Sciences and Hangzhou-based DEEP Robotics, the robot antelope is equipped with 5G connectivity and artificial intelligence vision systems, enabling real-time monitoring of the migration, feeding and mating behaviours of the endangered species endemic to Tibet.\n\nChina is offering its robotics industry tens of billions in subsidies and was host to the 2025 World Robot Conference, which wrapped up on Tuesday.\n\n5G arrived in Tibet in 2019, according to Chinese government documents, and the southwestern region reached 1 million users by 2022. With the completion of a 5G base station in the town of Gogmo in late 2023, every district in Tibet was covered, state media reported.\n\nBeyond transmitting live images and tracking data on rare antelope species, Tibet's 5G infrastructure now supports a growing range of AI applications — from small drones that can operate in areas impenetrable to radar, to telemedicine consultations and smart yak herding technologies, according to Chinese state media reports.\n\nChina has invested heavily in Tibet, boosting the at times restive region's role in President Xi Jinping's flagship Belt and Road infrastructure initiative by strengthening its trade ties with Central Asia, while also tightening surveillance over its population and extending Beijing's digital footprint towards neighbouring rival India.\n\nAnalysts and human rights campaigners accuse Beijing of deploying \"grey-zone\" tactics against countries around the Tibetan plateau. A July report from the Center of Strategic and International Studies think tank documented instances of China leveraging local telecommunications networks to surveil dissidents living in neighbouring Nepal, alongside cases of cyber theft.",
  "medium": "Article",
  "links": [
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "robot antelope",
      "weight": 0.080483004
    },
    {
      "name": "rare antelope species",
      "weight": 0.076517776
    },
    {
      "name": "Tibet",
      "weight": 0.07423549
    },
    {
      "name": "Chinese state media reports",
      "weight": 0.07181109
    },
    {
      "name": "real herds",
      "weight": 0.06671353
    },
    {
      "name": "China",
      "weight": 0.0663761
    },
    {
      "name": "state media",
      "weight": 0.06255046
    },
    {
      "name": "Chinese government documents",
      "weight": 0.05821218
    },
    {
      "name": "neighbouring Nepal",
      "weight": 0.05746027
    },
    {
      "name": "World Robot Conference",
      "weight": 0.057248797
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Environment"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.927734375
    },
    {
      "name": "/News/Other",
      "score": 0.767578125
    },
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.427490234375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.414306640625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.353271484375
    }
  ],
  "sentiment": {
    "positive": 0.38213342,
    "negative": 0.15984231,
    "neutral": 0.45802426
  },
  "summary": "China has deployed its first 'robot antelope' in Tibet to monitor the migration, feeding and mating behaviours of the endangered species. The robot was developed by Xinhua, the Chinese Academy of Sciences, and DEEP Robotics. It is part of Beijing's growing surveillance, which includes 5G connectivity and AI vision systems. The move comes amid accusations of China using \"grey-zone\" tactics against countries around the Tibetan plateau. The country has invested heavily in Tibet, enhancing its trade ties with Central Asia and tightening surveillance over its population.",
  "shortSummary": "China is deploying a robot antelope with 5G connectivity and AI, targeting endangered species and expanding its digital footprint in remote areas.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "be993774f25a459abe031d3cbdff5e44",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "China has developed a 'robot antelope' equipped with 5G and AI technology to monitor the endangered Tibetan antelope in the Hoh Xil plateau, enhancing its surveillance capabilities in remote areas. This initiative is part of a broader investment in Tibet's technological infrastructure, which includes various AI applications and aims to strengthen trade ties with Central Asia while tightening control over the region. Analysts express concerns over China's surveillance tactics, particularly regarding their implications for neighboring countries.",
  "argos_id": "JG0P0DPH0"
}