{
  "url": "https://www.forbes.com/sites/nathangoldman/2025/08/11/insider-nvidia-and-amds-3-billion-export-tax-deal-with-trump/",
  "authorsByline": "Nathan Goldman",
  "articleId": "2617f7f2db044c868cd1d0510686607d",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://specials-images.forbesimg.com/imageserve/689a739b8248128b2f0ab994/Nvidia-AMD/960x0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:03:50+00:00",
  "addDate": "2025-08-11T23:09:05.647338+00:00",
  "refreshDate": "2025-08-11T23:09:05.647341+00:00",
  "score": 1.0,
  "title": "Inside Nvidia And AMD’s $3 Billion Export “Tax” Deal With Trump",
  "description": "This article discusses the basics surrounding the new export trade deal for Nvidia and AMD with Trump and the consequences of the deal for the two companies and beyond.",
  "content": "Two of the largest companies in the world, Nvidia and AMD, have agreed to pay the U.S. 15% of their revenues from sales of chips and semiconductors to China. This agreement can be viewed as a win-win for technology conglomerates and the U.S. government, as it enables Nvidia and AMD to expand their market share for their products while allowing the U.S. to collect upwards of $3 billion more in incremental revenue from export activities. This novel type of revenue collection is not a tax, as commonly defined. However, it does appear to be a form of an export tax, and its framework presents a potential new opportunity for the Trump administration to raise additional revenues that it would otherwise not have previously collected. This article discusses the basics surrounding this novel new export trade deal for Nvidia and AMD with Trump and the direct and indirect consequences of such a deal for the two companies and beyond.\n\nNvidia and AMD are currently two of the largest companies in the world, ranking 31st and 167th on the Fortune 500 list, respectively. Importantly, they are among the world’s largest manufacturers of computer chips, which have become increasingly important and valuable as these products now appear in numerous devices, from obvious items like computers and smartphones to less obvious items like vehicles and appliances. Furthermore, the use of proprietary technology has become an even more strategic asset as the world has entered the artificial intelligence boom, which relies heavily on advanced processing chips.\n\nNvidia and AMD are among the two most significant manufacturers of these chips, which help enable the use of advanced computing. This technology achievement has been accomplished by securing a significant market share of the Graphics Processing Unit market and playing a pivotal role in enhancing processing power to advance and adapt to artificial intelligence, according to TechSpot.\n\nWhile this technology is valuable, the U.S. limits companies’ ability to sell these products to those outside the U.S., most notably, China. Although there are chip manufacturers outside the U.S., the quality of their products may not be the same, creating a natural demand for companies like Nvidia and AMD to expand their sales into these other countries.\n\nAs first reported by Financial Times, Nvidia and AMD have agreed to pay 15% of their revenues from semiconductor and chip sales to China in exchange for specific export licenses that allow the companies to move their products overseas. The specific deal pertains to Nvidia’s H20 chips and AMD’s MI308 chips. This announcement comes after Nvidia was hit with a ban in April for sending these same H20 chips to China. Yahoo!Finance reports that the prior ban cost the company billions in lost revenue, and the new deal will result in as much as $3 billion in incremental collections to the U.S. government.\n\nBillionaire Mark Cuban reacted to this agreement on X with the following statement:\n\nThis social media post comes as high praise to many, as Cuban has been a known and public skeptic of Trump, and Cuban calls out the vast majority of his strongest adversaries in congratulating the President on this unique trade agreement.\n\nWhile companies often face import and export fees, taxes, and tariffs when moving products across borders, this type of collection is unique in that technology companies have often been better equipped to utilize their intangible assets, enabling them to engage in profit shifting and cost-sharing agreements. As Cuban has exclaimed, the U.S. Government has long sought to tax many of these companies based on their income. However, this new export sales tax might revolutionize the nature and extent to which these companies pay their fair share of money to the U.S.\n\nThe Consequences Of Nvidia And AMD’s Export Trade Deal\n\nWhile the agreement appears to be great news for many key participants, the stock prices of Nvidia and AMD both struggled following the news, according to Forbes. Part of the reason for the mixed reaction is that the 15% collection of revenues for these chips is high, and the tax incidence will potentially fall onto Chinese customers, meaning they will be paying substantially more for the same chips they bought earlier this year. Furthermore, as reported by CNN, it is unclear whether China will even want these chips, as they are not as advanced as the technology that Nvidia and AMD currently produce.\n\nHowever, the broader consequences of this deal are that it creates a framework for the Trump administration (and potentially future administrations) to tax specific types of goods produced by U.S. companies. Other electronic manufacturers, such as Apple and Microsoft, as well as non-electronics companies like DowDuPont and Amgen, export billions of dollars’ worth of goods each year. Even arms manufacturers like Lockheed Martin, Boeing, Raytheon Technologies, and Northrop Grumman export significant quantities of weapons to allied countries. Like chips and semiconductors, the U.S. government closely monitors and potentially restricts the types and amounts of weapons sold to each country. Thus, given the new framework provided by Nvidia, AMD, and the Trump administration, these defense manufacturers can potentially now determine whether and to what extent they can expand their foreign sales, while also providing some incremental financial benefits to the U.S. government.\n\nBefore more companies can negotiate such a deal, the Trump administration will need to defend the legality of Nvidia and AMD’s deal, as lawmakers from both sides of the aisle question whether this export tax can be allowed, according to Politico. Despite some of the pessimism and the possibility of legal challenges, the deal reflects ingenuity and thinking outside the box, and, should it be an actual win-win situation, many other companies will potentially line up to strike a similar deal with Trump.",
  "medium": "Article",
  "links": [
    "https://www.ft.com/content/cd1a0729-a8ab-41e1-a4d2-8907f4c01cac",
    "https://x.com/mcuban/status/1954959374272827823",
    "https://www.techspot.com/news/108225-nvidia-reaches-historic-92-gpu-market-share-leaves.html",
    "https://www.forbes.com/sites/siladityaray/2025/08/11/nvidia-and-amd-slip-in-premarket-as-reports-say-us-will-take-15-cut-of-china-ai-chip-sales/",
    "https://www.politico.com/news/2025/08/11/trump-defends-deal-to-sell-nvidia-export-control-license-00503778",
    "https://finance.yahoo.com/news/nvidia-is-willing-to-pay-the-us-government-3-billion-to-save-its-business-in-china-151107429.html",
    "https://www.cnn.com/2025/08/11/china/us-china-trade-nvidia-chips-intl-hnk"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. companies",
      "weight": 0.09704013
    },
    {
      "name": "technology companies",
      "weight": 0.08777341
    },
    {
      "name": "many other companies",
      "weight": 0.08487921
    },
    {
      "name": "more companies",
      "weight": 0.08125874
    },
    {
      "name": "companies",
      "weight": 0.07834105
    },
    {
      "name": "chip manufacturers",
      "weight": 0.07731272
    },
    {
      "name": "Nvidia",
      "weight": 0.074072234
    },
    {
      "name": "non-electronics companies",
      "weight": 0.07293774
    },
    {
      "name": "AMD",
      "weight": 0.070915245
    },
    {
      "name": "computer chips",
      "weight": 0.06748254
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.92236328125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.916015625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.86328125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.7314453125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.45751953125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.447509765625
    }
  ],
  "sentiment": {
    "positive": 0.5748107,
    "negative": 0.04451986,
    "neutral": 0.38066944
  },
  "summary": "Nvidia and AMD, two of the world's largest companies, Nvidia and AMD (31st and 167th on the Fortune 500 list), have agreed to pay the U.S. 15% of their revenues from sales of chips and semiconductors to China, a form of an export tax, allowing them to expand their market share for their products and generate upwards of $3 billion in incremental revenue from export activities. This agreement is seen as a win-win-win for technology giants and the US government as it allows them to increase their market shares and collect more revenue. However, the tax incidence on these chips could potentially fall onto Chinese customers, meaning they will pay substantially more for the same chips they bought earlier this year. The deal also provides an opportunity for the Trump administration to raise additional revenues it has not previously collected previously. The agreement was praised by billionaire Mark Cuban, who has been a public skeptic of President Trump, while other companies like Apple and Microsoft have also commented on the deal. The broader implications of this deal could include a potential tax on specific types of goods produced by specific types and quantities of weapons and semiconductor manufacturers, including weapons manufacturers like Lockheed Technologies, Boeing, Northrop Grumman, and North Korea.",
  "shortSummary": "Nvidia and AMD agreed to pay 15% of their revenues from China, potentially creating $3 billion in revenue for the U.S. government.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d650a6bc358d454ba1df53ab98e38511",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/nvidia-is-willing-to-pay-the-us-government-3-billion-to-save-its-business-in-china-151107429.html",
      "text": "In This Article:\nNvidia (NVDA) has cut an unprecedented deal with the Trump administration to save its China business that would entail sharing as much as $3 billion in revenue with the US government for the current fiscal year to resume sales of its H20 chips.\nPresident Trump confirmed in a press briefing Monday that he made an arrangement with Nvidia to grant the leading AI chipmaker export licenses for the chips in exchange for 15% of their revenues from China.\n\"We negotiated a little deal,\" Trump told a room of reporters, calling Nvidia CEO Jensen Huang \"a brilliant guy.\"\nMultiple media outlets reported over the weekend that Nvidia and rival Advanced Micro Devices (AMD) had made such deals with President Trump, citing unnamed sources, following an initial report of the news from the Financial Times. Trade policy experts cited by the Washington Post said the agreements amounted to blackmail and violated the US Constitution's ban on export taxes.\nNvidia did not confirm its new arrangement with the Trump administration, but a spokesperson told Yahoo Finance, \"We follow rules the U.S. government sets for our participation in worldwide markets. While we haven't shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide.\"\nNvidia and AMD shares fell fractionally on Monday.\nChina is one of Nvidia's most important markets, accounting for 13% of the company's revenue in its prior fiscal year. Nvidia has repeatedly introduced new, lower-power chips to sell to China in the face of tightening US export controls, as the government has cited national security concerns. The chipmaker began sales of its H20 chips — graphics processing units based on its prior-generation Hopper architecture — in 2024.\nNvidia got hit with a surprise ban on exports of its H20 chips to China by the Trump administration in April, costing the company billions in lost sales and sending the stock spiraling. The ban was later reversed in July, drawing national security concerns from lawmakers worried about China's development of AI.\nWall Street analysts projected that Nvidia would recoup $15 billion in lost sales in the second half of the year after the ban was lifted, to hit about $20 billion in revenue from China for its fiscal year 2026, which ends next January — meaning the US government could get $3 billion from its deal with the company.\nBernstein analyst Stacy Rasgon said Nvidia making some revenue from China is better than none: \"At the end of the day we believe it is better to allow NVIDIA (and AMD) to sell AI into China, as failure to do so effectively hands the Chinese AI market over to Huawei, and encourages the coalescence of Chinese developers around Huawei's architecture and ecosystem (undesirable).\""
    },
    {
      "url": "https://www.forbes.com/sites/siladityaray/2025/08/11/nvidia-and-amd-slip-in-premarket-as-reports-say-us-will-take-15-cut-of-china-ai-chip-sales/",
      "text": "Topline\nShares of Nvidia and AMD fell in premarket trading early on Monday, after reports said both companies have agreed to pay 15% of the revenue generated on AI chip sales to China to the U.S. government, as part of an unconventional deal with the Trump administration to secure export licenses.\nKey Facts\nAccording to the Financial Times, which first reported on the matter, Nvidia will pay the 15% cut on the revenue it generates from the sale of its H20 AI chips, a cut-down version of its H100 chip designed to comply with export rules on China.\nAMD has also agreed to pay a similar cut on the sales of its MI308 chip designed for China, the report added.\nCiting an unnamed U.S. official and others familiar with discussions, the FT report said the deal was a necessary condition for the China export licenses granted to the companies last week.\nIt is unclear if these 15% export levies will raise the price of these chips for Chinese buyers.\nIn premarket trading early on Monday morning, Nvidia’s shares dropped 1.16% to $180.61, while AMD’s slipped 2.3% to $168.79.\nU.S. government officials and AMD have not yet publicly commented on the matter, but an Nvidia spokesperson told various outlets that the company hasn’t “shipped H20 to China for months,” but it hopes “export control rules will let America compete in China and worldwide.”\nHow Much Could The U.s. Government Earn From This Deal?\nIn May this year, Nvidia CEO Jensen Huang told the Stratechery Podcast that he estimates Nvidia could earn $15 billion from H20 chip sales to China. This means the U.S. government stands to earn as much as $2.25 billion from the AI chipmaking giant as part of this deal. In its Q2 2025 earnings call last week, AMD reported a $800 million write-off due to restrictions on the exports of its MI308 chips to China. If the company’s China sales projections are accurate, the U.S. government could earn another $120 million.\nWhat Do We Know About U.s. Chip Export Controls For China?\nIn an SEC filing made in April, Nvidia disclosed that the Trump administration had placed additional restrictions on the exports of its H20 AI chips to “China (including Hong Kong and Macau),” or to companies headquartered in the country. At the time, the company said the restrictions would result in a $5.5 billion hit in its first-quarter financial results. Last month, Huang met Trump at the White House, where he reportedly urged the president to allow his company to restart H20 sales to China, arguing that the export controls would weaken the U.S.’s edge in artificial intelligence and semiconductors. A few days after the meeting, Nvidia announced that it plans to resume H20 sales in China after the U.S. government “assured” the company that the “licenses will be granted.” The Financial Times reported last week that the commerce department has started issuing the licenses to Nvidia, allowing it to export its cut-down AI chips to China.\nChief Critics\nLast month, a group of 20 national security experts and former government officials wrote to Commerce Secretary Howard Lutnick, raising concerns about the export license approval. “We believe this move represents a strategic misstep that endangers the United States’ economic and military edge in artificial intelligence (AI)—an area increasingly seen as decisive in 21st-century global leadership,” the letter said. “The decision to ban H20 exports earlier this year was the right one. We ask you to stand by that principle and continue blocking the sale of advanced AI chips to China as America works to maintain its technological edge. This is not a question of trade. It is a question of national security.” The signatories of the letter included Matt Pottinger, who serves as the deputy national security adviser during Trump’s first term, and Stewart Baker, who served as Assistant Secretary of Homeland Security for Policy during the George W. Bush administration. In a Wall Street Journal op-ed on Sunday Pottinger and Liza Tobin, who served as the China director of the White House’s National Security Council between 2019-21, wrote: “The controls on Nvidia’s H20 chips appear to have been working until CEO Jensen Huang’s lobbying secured a reversal that handed Beijing exactly what it wanted.” On the 15% cut deal, Tobin told the New York Times: “This is the Trump playbook applied in exactly the wrong domain. You’re selling our national security for corporate profits.”\nCrucial Quote\nIn an interview with CNBC last month, Lutnick defended the administration’s decision to allow H20 exports to China, describing it as Nvidia’s “fourth best” chip. “We don't sell them our best stuff, not our second best stuff, not even our third best,” the commerce secretary said. “We want to keep having the Chinese use the American technology stack, because they still rely upon it...The idea is the Chinese are more than capable of building their own. You want to keep one step ahead of what they can build, so they keep buying our chips.”\nNvidia and AMD to pay 15% of China chip sale revenues to US government (Financial Times)"
    },
    {
      "url": "https://www.cnn.com/2025/08/11/china/us-china-trade-nvidia-chips-intl-hnk",
      "text": "Nvidia and AMD have agreed to pay the US government 15% of their revenues from semiconductor sales to China in exchange for export licenses, an unprecedented quid pro quo arrangement aimed at solidifying America’s AI business dominance while maintaining trade ties with China.\nThe deal with the Trump administration allows the companies to obtain export licenses to sell Nvidia’s H20 chips and AMD’s MI308 chips in China, a US official told CNN. The Financial Times first reported the story Sunday.\nThe deal came together after Nvidia CEO Jensen Huang met with President Donald Trump on Wednesday, the official said. Although the export licenses were granted Friday, no shipments have yet been made. It’s still unclear how the deal will be structured, but the White House may use its recent trade agreements as a template.\n“We follow rules the US government sets for our participation in worldwide markets,” a Nvidia spokesperson said in a statement. “While we haven’t shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide.”\nTrump calls the chips ‘obsolete’\nTrump said Monday that the AI chips he approved for sale to China are “obsolete,” but he left open the possibility that Nvidia could export its super high-end Blackwell chips for a higher price.\n“The chip that we’re talking about, the H20, it’s an old chip,” Trump said at a press conference Monday. “China already has it in a different form, different name, but they have it.”\nTrump said Huang, who met with the president Wednesday, wanted to sell the H20 AI chip to China after the Trump administration expressed openness to lifting its export ban on the technology. But Trump demanded payment to the US government in exchange for the export license.\nAt first, Trump said he wanted Nvidia to pay the US government 20% of sales of its AI chips exported to China, but they negotiated a rate of 15%.\n“I said, if I’m going to do that, I want you to pay us, as a country, something, because I’m giving you a release,” Trump said.\nThe H20 is a sophisticated AI processor, although it is not Nvidia’s highest-end processor. The Blackwell chip is significantly more advanced, and the Trump administration has closed the door on the export of that technology to China — even after reversing course on the H20.\nHowever, Trump on Monday said that he’d consider allowing Nvidia to sell the Blackwell chip if Nvidia pays the US government an even steeper cost.\n“The Blackwell is superduper advanced. I wouldn’t make a deal with that, although it’s possible,” Trump said. “I’d make a deal – a somewhat enhanced in a negative way. Blackwell, in other words, take 30% to 50% off of it, but that’s the latest and the greatest in the world. Nobody has it. They won’t have it for five years.”\nTrump said Huang will return to the White House in the future to discuss selling an “unenhanced” version of Blackwell.\n“I think he’s coming to see me again about that, but that will be a unenhanced version of the big one,” Trump said. “You know, we will sometimes sell fighter jets to a country and we’ll give them 20% less than we have.”\nChina may not accept the chips\nThe AI chips are in extremely high demand and the arrangement could raise billions of dollars for the US government. But it’s unclear how successful the venture will be, because China may not be willing to play ball: Nvidia’s H20 chips pose security concerns for China, a social media account linked to Chinese state media said Sunday, as Washington and Beijing near a deadline to strike a deal in trade negotiations in which technology has also emerged as a key issue.\nChina could choose not to buy US tech firm Nvidia’s H20 chips, said the account, Yuyuan Tantian, which is affiliated with state broadcaster CCTV, as it claimed that the artificial intelligence (AI) chips could have “backdoors” that impact their function and security.\n“When a type of chip is neither environmentally friendly, nor advanced, nor safe, as consumers, we certainly have the option not to buy it,” said the commentary, which came after China’s cybersecurity administration also raised concerns over backdoor access in those chips.\nNvidia has repeatedly denied that its products have backdoors.\nTrade friction\nChina’s access to American technology, especially high-end chips that can be used in the development of artificial intelligence, has become a key issue in trade and tech frictions between the rival economies – as both vie for tech dominance.\nA trade truce between the two countries that reduced triple-digit tariffs is set to expire on August 12, though officials have signaled an extension could come into effect following talks in Sweden last month.\nNvidia last month said it would resume sales of the H20 chip to China after the White House changed course on export controls it imposed in April as its trade frictions with China deepened. US Treasury Secretary Scott Bessent told Bloomberg in an interview at the time that the Nvidia export controls have been a “negotiating chip” in the larger US-China trade talks.\nNvidia released the H20 chip last year to maintain access to the Chinese market following strict export controls put in place under the Biden administration that stopped the export of chips with greater processing power.\nNvidia’s announcement last month that it would be able to export the H20 chip to China raised concerns among some US lawmakers, who support tight controls to prevent China from using American technology to advance its military and AI systems.\nTrump administration have correctly said that the H20 chips aren’t the top-of-the-line AI chips that can build large language models. As a result, the White House has been willing to open up the market for those chips to maintain US business dominance in AI – without giving up the cream-of-the-crop chips to China, which administration officials say could still pose a national security threat.\nChina’s mounting concern about the security of the chips comes after the White House last month recommended implementing export controls that would verify the location of advanced artificial intelligence chips. China’s cyberspace regulator late last month summoned Nvidia over security concerns about “tracking and positioning” and “remote shutdown” capabilities.\nIn a blog post published last week, Nvidia reiterated that its chips did not have back doors, spyware or kill switches and said that “embedding backdoors and kill switches into chips would be a gift to hackers and hostile actors.”\nChina’s security concerns appear to mirror those that the US has in the past expressed about Chinese technology, most prominently the first Trump administration’s campaign against the growing foothold of Chinese tech giant Huawei in global communications infrastructure.\nChinese leaders have also pushed for the country’s tech firms to become self-sufficient and reduce reliance on American-made chips to achieve Beijing’s AI and tech ambitions, and experts have said that controls on chips like the H20 could push China to speed up its own innovation.\nBut the H20 is not the only technology that reports suggest is entangled with negotiations between the two sides.\nAccording to another report from the FT also published Sunday, China wants the US to ease export controls on a critical component for artificial intelligence chips as part of a trade deal ahead of a possible summit between President Donald Trump and Chinese leader Xi Jinping.\nChinese officials have told experts in Washington that Beijing wants the Trump administration to relax export restrictions on high-bandwidth memory (HBM) chips, the FT reported, citing several people familiar with the matter.\nA spokesperson for China’s Foreign Ministry on Monday sidestepped a media question about the report, but said China opposes both “malicious blockades and suppression of China” and the “weaponization of scientific and technological, economic, and trade issues.”\n“Such practices disrupt the stability of the global supply chain and are not in the interests of anyone,” spokesperson Lin Jian said. When asked to comment on reports that Nvidia and AMD have agreed to pay the US government 15% of their revenues from semiconductor sales to China, Lin said Beijing had “repeatedly expressed” its position on the issue of US chip exports.\nThe US government imposed export controls on the sale of high-bandwidth memory chips to China last year.\nThis story has been updated with additional information. CNN’s Nectar Gan contributed reporting."
    }
  ],
  "argos_summary": "Nvidia and AMD have reached an agreement with the U.S. government to pay 15% of their revenues from semiconductor sales to China in exchange for export licenses for their H20 and MI308 chips. This arrangement is expected to generate approximately $3 billion in additional revenue for the U.S. government, while allowing the companies to expand their market share in China. However, the deal has faced criticism regarding its legality and potential implications for national security, as concerns arise over whether China will accept these chips due to security issues.",
  "argos_id": "JXU3RZQUT"
}