{
  "url": "https://www.fastcompany.com/91383015/teachers-ai-classrooms",
  "authorsByline": "The Conversation",
  "articleId": "2cf95fc4d49a4676b7e6ca82454e1974",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/08/p-1-91383015-teachers-ai-classrooms.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:30:00+00:00",
  "addDate": "2025-08-12T08:42:09.486868+00:00",
  "refreshDate": "2025-08-12T08:42:09.486872+00:00",
  "score": 1.0,
  "title": "Teachers are warming up to using AI in classrooms",
  "description": "Approximately 60% of K-12 teachers now admit to using AI to plan lessons, communicate with parents, and assist with grading.",
  "content": "Students, on the other hand, tended to jump into the deep end of the AI pool. Common Sense Media, which offers recommendations on children’s media consumption, published a report in 2024 showing that students were using AI-supported search and chatbots for homework and to stave off boredom as well as other personal reasons, including “creating content as a joke, planning activities, and seeking health advice.” Most of the teachers and parents of the students in the study were unaware that students were using the technology. In my work at Drexel University teaching graduate students who are aspiring school principals or superintendents, I found that in 2023, K-12 students were afraid of using AI due to the policies implemented in their districts banning it. However, it quickly became apparent that students were able to mask their use of AI by instructing AI to insert some mistakes into their assignments. Meanwhile, despite teachers’ initial concerns about AI, approximately 60% of K-12 teachers now admit to using AI to plan lessons, communicate with parents, and assist with grading. Concerns over students cheating still exist, but time-strapped teachers are finding that using AI can save them time while improving their teaching.\n\nA recent Walton Foundation and Gallup study revealed that teachers who used AI tools weekly saved an average of 5.9 hours per week, which they reallocated to “providing students more nuanced feedback, creating individualized lessons, writing emails, and getting home to their families in a more reasonable time.” Opening up new ways of teaching I recommend that my graduate students use AI because I think ignoring emerging trends in education is not wise. I believe the benefits outweigh the negatives if students are taught ethical use of the technology and guardrails are put in place, such as requiring that AI be cited as a source if students use it in coursework. Advocates say AI is changing teaching for the better, since it forces teachers to identify additional ways for students to demonstrate their understanding of content. Some strategies for students who rely too heavily on AI include oral presentations, project-based learning, and building portfolios of a student’s best work.\n\nOne practice could involve students showing evidence of something they created, implemented, or developed to address a challenge. Evidence could include constructing a small bridge to demonstrate how forces act on structures, pictures, or a video of students using a water sampling device to check for pollution, or students designing and planting a community garden. AI might produce the steps needed to construct the project, but students would actually have to do the work. Teachers can also use AI to create lessons tailored to students’ interests, quickly translate text to multiple languages, and recognize speech for students with hearing difficulties. AI can be used as a tutor to individualize instruction, provide immediate feedback and identify gaps in students’ learning. When I was a school superintendent, I always asked applicants for teaching positions how they connected their classroom lessons to the real world. Most of them struggled to come up with concrete examples. On the other hand, I have found AI is helpful in this regard, providing answers to students’ perennial question of why they need to learn what is being taught.\n\nTeachers in K-12 schools are using AI to help students develop their empathetic skills. One example is prompting an AI to “redesign the first-day experience for a relocated student entering a new middle school.” AI created the action steps and the essential questions necessary for refining students’ initial solutions. In my own classroom, I’ve used AI to boost my graduate students’ critical thinking skills. I had my students imagine that they were college presidents facing the loss of essential federal funding unless they implemented policies limiting public criticism of federal agencies on campus. This proposed restriction, framed as a requirement to maintain “institutional neutrality,” requires students to develop a plan of action based on their knowledge of systems and design thinking. After each team developed their solution, I used AI to create questions and counterpoints to their proposed solution. In this way, AI becomes a critical thought partner to probe intended and unintended outcomes, gaps in students’ thinking, and potential solutions that might have been overlooked. AI researcher Ethan Mollick encourages educators to use AI as a springboard, similar to jazz musicians improvising, as a way to unleash new possibilities. Mollick advises people to partner with AI as co-intelligence, be the human in the loop, treat AI as a coworker, albeit one that needs to be prodded for evidence, and to learn to use it well. I concur.\n\nSome early studies on the effects of using AI in education have raised concerns that the convenience of generative AI will degrade students’ learning and erode their critical thinking skills. I think that further studies are needed, but I have found in my own work and in the work of my graduate students that AI can enhance human-produced work. For example, AI-powered teaching assistants, like Khanmigo or Beghetto Bots, use AI to help students solve problems and come up with innovative solutions without giving away the answers. My experiences with other educators on the front lines show me that they are beginning to change their perspectives toward students using AI, particularly as teachers realize the benefit of AI in their own work. For example, one of my graduate students said his district is employing a committee of educators, students and outside experts to explore how AI can be used ethically and in a way that won’t erode students’ critical thinking skills.",
  "medium": "Article",
  "links": [
    "https://study.com/resources/chatgpt-in-the-classroom",
    "https://www.fastcompany.com/section/artificial-intelligence",
    "https://www.nea.org/nea-today/all-news-articles/chatgpt-enters-classroom-teachers-weigh-pros-and-cons?utm_source=chatgpt.com",
    "https://www.fastcompany.com/91380890/google-unveils-new-guided-learning-study-tool-within-gemini",
    "https://www.fastcompany.com/91378213/ai-action-plan-bias",
    "https://www.microsoft.com/en-us/research/wp-content/uploads/2025/01/lee_2025_ai_critical_thinking_survey.pdf",
    "https://www.fastcompany.com/90860133/teachers-use-chatgpt-more-than-students-a-study-finds",
    "https://crpe.org/ai-is-coming-to-u-s-classrooms-but-who-will-benefit/#",
    "https://www.bbc.com/news/articles/c4g8r34nxeno",
    "https://theconversation.com/profiles/michael-g-kozak-2415831",
    "https://theconversation.com",
    "https://theconversation.com/institutions/drexel-university-1074",
    "https://cped.memberclicks.net/artificial-intelligence-cig",
    "https://www.ronaldbeghetto.com/ptbots",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://www.media.mit.edu/publications/your-brain-on-chatgpt/",
    "https://www.khanmigo.ai/",
    "https://www.educationnext.org/ai-tutors-hype-or-hope-for-education-forum/",
    "https://hunt-institute.org/resources/2025/06/ai-tutoring-alpha-school-personalized-learning-technology-k-12-education/?utm_source=chatgpt.com",
    "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4895486",
    "https://www.pewresearch.org/social-trends/2024/04/04/whats-it-like-to-be-a-teacher-in-america-today/",
    "https://www.commonsensemedia.org/press-releases/new-report-shows-students-are-embracing-artificial-intelligence-despite-lack-of-parent-awareness-and",
    "https://edtechmagazine.com/k12/article/2024/05/stumbling-blocks-artificial-intelligence-k-12-education",
    "https://www.fastcompany.com/91382136/openai-unveils-gpt-5-model",
    "https://apnews.com/article/ai-chatgpt-teacher-chatbot-b1630bc549e9044d1e3bbcc060fb422c",
    "https://news.gallup.com/poll/691967/three-teachers-weekly-saving-six-weeks-year.aspx",
    "https://theconversation.com/ai-is-taking-hold-in-k-12-schools-here-are-some-ways-it-can-improve-teaching-259501",
    "https://www.fastcompany.com/91360388/will-ai-make-thinking-extinct-ai-thinking-extinct-humanit",
    "https://www.learningandthebrain.com/blog/co-intelligence-living-and-working-with-ai-by-ethan-mollick/?utm_source=chatgpt.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Students",
      "weight": 0.11658041
    },
    {
      "name": "students",
      "weight": 0.11658041
    },
    {
      "name": "graduate students",
      "weight": 0.11380101
    },
    {
      "name": "K-12 students",
      "weight": 0.11209951
    },
    {
      "name": "AI",
      "weight": 0.09478582
    },
    {
      "name": "AI researcher Ethan Mollick",
      "weight": 0.08317883
    },
    {
      "name": "students’ critical thinking skills",
      "weight": 0.068058826
    },
    {
      "name": "students’ initial solutions",
      "weight": 0.06455645
    },
    {
      "name": "generative AI",
      "weight": 0.06413649
    },
    {
      "name": "AI tools",
      "weight": 0.06406426
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.9658203125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.615234375
    },
    {
      "name": "/News/Technology News",
      "score": 0.5205078125
    }
  ],
  "sentiment": {
    "positive": 0.08452034,
    "negative": 0.5705839,
    "neutral": 0.34489575
  },
  "summary": "The use of AI in classrooms is gaining popularity among teachers and students, with 60% admitting to using AI to plan lessons, communicate with parents, and assist with grading. Despite initial concerns about AI, teachers are finding that using AI can save time and improve teaching. A study by the Walton Foundation and Gallup found that teachers using AI tools weekly saved an average of 5.9 hours per week, which they reallocated to creating individualized lessons, writing emails, and returning home to their families in a more reasonable time. Advocates argue that AI is changing teaching for the better as it forces teachers to identify additional ways for students to demonstrate their understanding of content. However, concerns about students cheating still exist. Drexel University graduate student Ethan Mollollick recommends teaching AI to help students develop critical thinking skills and suggests guardrails for students' use of technology, such as requiring AI to be cited as a source if students use it in coursework. Mollick also suggests that AI be prodded for evidence and that it can be used as a tool for teaching students to identify challenges and solutions. Concerns that AI will degrade learning and erode critical thinking and degrade critical thinking.",
  "shortSummary": "Despite initial concerns about AI, most teachers are increasingly using AI to improve classroom teaching, enhancing critical thinking, while students are encouraged to adopt ethical practices without cheating concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9f4921dcb70c464495f1fb5a1c865ad8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.learningandthebrain.com/blog/co-intelligence-living-and-working-with-ai-by-ethan-mollick/?utm_source=chatgpt.com",
      "text": "The first time I caught a student using ChatGPT to write their paper, I felt… cheated. Like a conversation had been skipped. I took it personally. Like an opportunity was there to be knocked on with curiosity but had been bypassed with convenience. But instead of staying irritated (actually … still dealing with moments of this emotion), I did what I always ask my students to do: I got curious.\nAnd that curiosity has since reshaped my teaching, my expectations, and, honestly, my sense of what’s possible. That journey mirrors the one Ethan Mollick lays out in Co-Intelligence: Living and Working with AI, a book that doesn’t just explain what’s happening in the world of AI—it invites you to walk straight into the mystery with both eyes open.\nMollick, a Wharton professor and a longtime explorer of innovation, brings the gravitas of research and the warmth of lived experience. He writes not like someone predicting the future, but like someone already living in it—and handing you the map.\nThis isn’t a book about fearing AI or worshipping it. It’s about partnering with it. That’s what Mollick means by “co-intelligence”: not artificial intelligence, but collaborative intelligence. The kind that emerges when we stop asking “What can AI do?” and start asking “What can we do together?”\nFrom Sleepless Nights to Syllabus Changes\nMollick begins with his own version of a tech-wrought dark night of the soul—three sleepless nights after encountering ChatGPT. That eerie sense that something has shifted, that the future is no longer ahead of us but suddenly beside us, whispering new possibilities.\nLike many of us, I also had sleepless nights, then I began to rewrite my syllabus. I started teaching my students how to prompt. How to think with AI. How to use it not as a shortcut, but as a springboard. Like jazz musicians learning to improvise with a new instrument, we were learning to play off the rhythms of something alien—and astonishingly generative. If they are using it, I need to teach them to use it well!\nAnd still, some days, it weirds me out. Like when a student turns in something more articulate than they can say aloud. Part of me marvels. Part of me wonders what this does to their voice, their confidence, their sense of authorship. Maybe that’s the point—not to land on a stance, but to live inside the question.\nThe Four Rules That Could Change Everything\nMollick offers an emerging way to think for teachers and students in the AI era. New skills:\n- Always ask for evidence. (Because AI is confident, not always correct.)\n- Be the human in the loop. (AI might be fast, but wisdom requires pause.)\n- Treat AI like a coworker. (It’s competent, but it’s not conscious.)\n- Learn to use it well. (Prompting isn’t a trick—it’s a literacy.)\nWhat struck me most is how these rules don’t just apply to using ChatGPT. They apply to life in a world where knowledge is abundant, but discernment is everything.\nAI as Creative, Coach, Tutor, and Companion\nMollick shows us AI not as a monolith, but as a multiplicity: a tutor, an artist, a coach, a co-writer, a companion in the fog of creative uncertainty. And I’ve seen that too. I’ve watched students ask better questions because they could test their assumptions privately. I’ve seen them write more boldly because they had a sounding board that didn’t judge.\nIs it perfect? No. But it’s productive. And weirdly, it’s kind. Because AI, at its best, is a mirror—sometimes foggy, sometimes sharp—but always reflecting something back. What we see in that reflection says as much about us as it does about the machine.\nThe Real Magic: Partnership, Not Power\nThis is where Co-Intelligence really shines: not in showing off what AI can do, but in challenging us to consider what we should do with it. Mollick doesn’t hand us easy answers. He asks better questions.\nIf you’re a teacher, a writer, a thinker—anyone whose job involves shaping ideas—this book feels like a signal flare. Not a warning, but a guide. It says: The future of work isn’t AI or human. It’s both. And the quality of that relationship will depend on how we show up to it.\nAnd if you’re feeling unsure? You’re not alone. Honestly, I’m still figuring it out too. Some days AI feels like a trampoline. Other days, a trapdoor. That ambiguity—that friction—is part of what makes this moment real.\nReading Co-Intelligence isn’t just about learning how AI works. It’s about learning how we work—under pressure, in collaboration, in awe. It doesn’t just give you a flashlight. It hands you the makings of a torch and says, “Build your light.”\nSo here’s the question Mollick leaves us with, whether he says it outright or not: If AI can think with us, can we learn to think better with it? Not faster. Not louder. Just better.\nThat’s co-intelligence. And I’m all in."
    },
    {
      "url": "https://news.gallup.com/poll/691967/three-teachers-weekly-saving-six-weeks-year.aspx",
      "text": "WASHINGTON, D.C. — In the 2024-25 school year, six in 10 teachers reported using an AI tool for their work. Out of a list of nine specific tasks related to their work, teachers used AI tools most often for preparing to teach (37% used it at least monthly), making worksheets or activities (33%), or modifying materials to meet student needs (28%).\nAcross all nine of these tasks, 32% of teachers are using AI tools at least weekly, and 28% are using AI less frequently (monthly or less).\nThe latest data are from the most recent Walton Family Foundation and Gallup study on educator perspectives, Teaching for Tomorrow: Unlocking Six Weeks a Year With AI, which is aimed at answering whether AI tools can help teachers do more for their students with their limited time. The study was conducted from March 18 to April 11, 2025, by web with a sample of 2,232 U.S. teachers working in public K-12 schools. Teachers were recruited from the RAND American Teacher Panel, a nationally representative, probability-based panel of U.S. public school teachers.\nWhen teachers use AI for one of nine types of work tasks, majorities — ranging from 60% to 84% — report that AI saves them time. Very few (7% or less) report that their work takes more time when they use AI.\nRegular Users Earn an Estimated “AI Dividend” of 5.9 Hours per Week\nFor teachers who invest the time in becoming a regular AI user, the tools can earn them a hefty “AI dividend” — time savings that teachers receive from using AI tools. Teachers who use AI tools at least weekly estimate they save 5.9 hours per week, on average. Over the course of a 37.4-week school year, these time savings add up to the equivalent of six weeks per school year. Qualitative data from the study show that teachers reinvest the time they save with AI into things like providing more nuanced student feedback, creating individualized lessons, writing emails to parents and getting home to their families at a more reasonable time.\nThe time savings are estimated by the half-hour on a task-by-task basis by teachers who said they use AI for at least one of their work-related tasks and that AI impacts the amount of time they spend on that task (either saving or adding time). Nonoverlapping tasks were added together to create a total. More information about calculating the AI dividend is available in the methodology.\nMost Teachers Who Use AI Tools Say They Improve the Quality of Their Work\nAI tools are not just time savers; teachers also report improvements in quality. Majorities of teachers who use AI for various tasks say it improves the quality of their everyday work tasks at least somewhat. The range of improvement is from 57% for grading and feedback to 74% for administrative work. Few teachers (16% or less) say the quality of their work decreases.\nThe AI Dividend Pays, but Only for Those Who Invest\nEducators must invest in using AI tools to earn a dividend — a return of time savings and improved work quality. While teachers who use AI tools monthly also report time savings, it is much less than the 6 hours estimated for weekly users.\nTeachers who use AI weekly also see higher quality of their work tasks when using AI compared with monthly users. In many cases, teachers who use AI at least weekly are twice as likely as less-frequent users to say that AI results in “much higher quality” of their work.\nBottom Line\nDuring a typical school day, teachers must find time to plan engaging lessons, review student work, communicate with parents, and serve as mentors and tutors for their students. The latest findings from the Walton Family Foundation-Gallup Teaching for Tomorrow study show that teachers who invest in using AI regularly are earning an AI dividend that allows them to save time and, in most cases, improve the quality of their many work tasks.\nIf teachers have the resources they need to innovate with AI tools, the AI dividend has the potential to reach more teachers and students. With six in 10 teachers already using AI tools — and three in 10 using them weekly — teachers are off to a running start. As the 2025-26 school year approaches, AI tools could be a powerful force in reshaping teachers’ workload and, ultimately, student outcomes.\nLearn more about the Walton Family Foundation-Gallup Teaching for Tomorrow study."
    },
    {
      "url": "https://edtechmagazine.com/k12/article/2024/05/stumbling-blocks-artificial-intelligence-k-12-education",
      "text": "AI Technologies Require Significant Financial Investments\nA major factor prohibiting schools from acquiring generative AI tools is the cost. K–12 education often doesn’t have the funding to invest in these products and solutions.\nIt also can be difficult to remove tools from a K–12 digital environment once they’re added. Administrators and end users in schools don’t like to remove tools, leading to scenarios where new solutions are brought in while the old ones remain, and the environments become crowded with technologies serving duplicate purposes.\nSchools looking to implement generative AI should be purposeful about any investments in tech that may not be suitable for their learning goals or that may become quickly outdated as the technology continues to evolve.\nRELATED: K–12 schools are modernizing their IT procurement processes.\nToday’s AI Tools Are Built to Serve Enterprises\nAnother roadblock with most of the generative AI solutions on the market is that they are built for general use. They serve enterprises best, meeting myriad industries’ objectives. These solutions aren’t purpose-built for education.\nK–12 environments have specific needs, especially when it comes to data governance, and these general-use generative AI solutions available to schools can’t be dialed in to meet those needs.\nWhile these tools would work well for back-office workflows in education, they largely aren’t granular enough in their processes or security controls for use in teaching and learning.\nSchools Must Secure Applications Against Unwarranted AI Integrations\nK–12 IT administrators also have to make security decisions about their existing application environment when it comes to AI. Some technology experts worry about the introduction of AI into the software students and teachers already use.\nDIVE DEEPER: Vet schools’ applications for student data privacy.\nSchools need to review their educational technology agreements, especially with applications on their network. They need to establish restrictions around the integration of AI that require IT admins to be notified when it is introduced and to be given the option to opt out. This ensures the protection of the school’s data.\nK–12 Stakeholders Must Understand and Communicate AI’s Capabilities\nUltimately, there’s not a lot of expertise in generative AI in K–12 institutions. To add to that challenge, IT staff and educators often don’t speak the same language. IT needs to teach teachers what generative AI, how it works and how to use it. However, to do so, they must first understand AI on a deeper level.\nMany of the problems facing generative AI’s integration into K–12 education stem from a lack of willingness to figure it out. To get started, IT staff and educators should turn to experts who can guide their use of the technology in their environments and ensure it’s introduced safely and properly to support the school’s teaching and learning goals.\nThis article is part of the ConnectIT: Bridging the Gap Between Education and Technology series. Please join the discussion on Twitter by using the #ConnectIT hashtag."
    },
    {
      "url": "https://www.nea.org/nea-today/all-news-articles/chatgpt-enters-classroom-teachers-weigh-pros-and-cons?utm_source=chatgpt.com",
      "text": "Key Takeaways\n- Soon after ChatGPT launched in November 2022, some large school districts, concerned about student cheating, immediately blocked access.\n- ChatGPT-generated work has left many teachers spending more time checking for AI plagiarism and revamping lesson plans to be “AI-proof.\" According to a recent survey, about 1 in 4 teachers have caught students cheating using the chatbot.\n- Some educators believe the benefits outweigh the risks and have embraced ChatGPT in their classrooms.\nIn November 2022, OpenAI, an artificial intelligence (AI) research laboratory, launched ChatGPT, a transformative AI program. Since then, ChatGPT and its impacts on education have been the center of heated debate.\nA recent survey conducted by Study.com, an online learning platform, shows that 43 percent of educators feel the program will make their jobs more difficult. The others, nearly six in 10 teachers, predict it will make their lives easier.\nOn the one hand, many educators fear the program threatens academic integrity, encouraging new methods of cheating and plagiarism. Because of the program’s simplicity, accessibility, and convenience, students have been using it to generate answers to homework and even entire essays, claiming the chatbot’s writing as their own.\nOn the other, ChatGPT’s simple design and brainstorming capabilities appeal to educators who see its potential to improve education. These teachers say that, over time, the real impact will not be an increase in cheating, but a revitalization of lesson plans and classroom instruction.\n“I would say go for it,” says Cherie Shields, a high school English teacher in Sandy, Oregon. “The best way to learn anything new is just to jump right in and try it out.”\nHow ChatGPT Works\nThe website’s design concept is simple. First, users create an account and log on. Then, they generate a new chat by typing a prompt or instructions into the chat bar. Within seconds, the chatbot generates bodies of text in response. Users then have the ability to instruct ChatGPT to edit, adjust, or regenerate a response.\nThe technology is trained to formulate conversational responses based on information it has encountered, using a database to compile, paraphrase and summarize information.\nChatGPT In the Classroom\nWithin two months of the program’s launch, 51 percent of K-12 teachers reported using ChatGPT, according to a recent survey by the Walton Family Foundation. Forty percent said they used it at least once a week; 53 percent anticipated increased use this year.\nShields is one of those teachers. Recently Shields asked ChatGPT to generate ten different project options for her sci-fi unit. Instead of a traditional essay assignment, the program suggested imaginative projects such as creating and explaining a poster of an alien.\nChatGPT also has the ability to translate assignments into a student’s native language or simplify materials for new language learners. The process is as simple as typing specific instructions into the chat bar. For example, educators could prompt ChatGPT to “translate this reading into Arabic.”\n“With Chat, you can translate all of the supplementary materials into [students'] native language, which makes it far easier for them to complete their assignments,” says Shields.\nThe chatbot also can rewrite responses at different reading levels. Shields explains that she sent tenth-grade assignments to ChatGPT, asking the chatbot to restructure the material at a sixth-grade level. Her students were then able to follow along and participate in class with their differentiated material.\n“It’s really easy now to make different types of assignments,” says Shields.\nSimilarly, Kim Lepre, a seventh-grade English teacher in California, explains that when used correctly, ChatGPT can simplify and improve educators’ everyday lives. Lepre uses the program to differentiate instruction, generate quizzes and even email parents, saving more time to interact with students.\nThrough ChatGPT, Lepre created a new lesson for a unit about the Salem Witch Trials. The program helped her generate an article for her seventh-grade students, plus ten variations of a multiple-choice quiz.\n“It has just taken a load off of the little minute things that I have to do so that I can just focus on teaching the kids,” says Lepre.\nMeanwhile, Donnie Piercey, a fifth-grade teacher in Kentucky, told the Associated Press (AP) that he recently used ChatGPT during a lesson about playwriting, or “Pl-ai Writing.”\nStudents came up with characters and a problem to be solved throughout the plot of a short play. Then Piercey submitted those student ideas to the chatbot, instructing it to generate play scripts set in a fifth-grade classroom and to develop surprise endings. ChatGPT generated play scripts which students edited, rehearsed and performed.\nCauses for Concern\nIf ChatGPT is the future, many educators fear how it will affect their classroom.\nAs the ChatGPT website explains, ChatGPT occasionally generates misinformation, untimely and biased responses. The program is only as knowledgeable as the information it has been introduced to and trained with. Even creators acknowledge that the program is not a credible source of factual information and should not be treated as an academic source. Many teachers worry that ChatGPT will make teaching and learning—particularly writing assignments— more formulaic.\n“I think ChatGPT is a crutch that will prevent students from actually needing to learn content. Although I can see its use for small tasks, like how to email a teacher with questions, it also prevents students from developing the soft skills that completing those small tasks allows.” — K-12 teacher surveyed by Study.com\nThe biggest concern is cheating. More than one-fourth of teachers have caught students using the chatbot to cheat, the Study.com survey found. An influx of ChatGPT generated work has left many educators spending more time checking for AI plagiarism and revamping lesson plans to be “AI-proof”.\nUntil the risks to academic integrity and educational quality can be properly understood and evaluated, many large school districts, including Baltimore, Los Angeles, New York City, and Seattle, have banned ChatGPT.\nCombatting Cheating\nIn January, OpenAI recognized the potential for problematic use of ChatGPT in the classroom. The company introduced an AI text classifier as a tool to help determine whether a piece of writing was created using AI technology.\nSimilar technology, such as GPTZero and CopyLeaks AI Content Detector, already has been launched—with many more detection programs in the making. These programs are accessible and readily available.\n“As educators, we haven’t figured out the best way to use artificial intelligence yet,” Donnie Piercey told AP. “But it’s coming, whether we want it to or not.”\nWhile Piercey’s fifth-grade classroom may be less susceptible to AI plagiarism, Shields’ high school courses have already been generating and turning in AI generated work.\n“We've already had a number of students turn AI-generated essays in and they're so easy to spot,” says Shields. “It's flawless. Not a single grammatical error. All the sentences are perfect. And when you're working with students of that age, you know that they don't write flawlessly like that.”\nIf the chatbot is asked to write an essay about a book, it often misquotes the reading, only provides partial quotes or even inserts quotations that do not align with the theme of the essay.\n“Most students don’t even know that they are incorrect or inaccurate, and that’s another way to check to see if they are using AI,” says Shields. “None of the quotes make sense.”\nShields suggests students evaluate information generated by ChatGPT. Addressing the validity of an AI-generated report will build skills in editing and fact-checking. She also believes teachers should reimagine their assignments.\n“My thoughts are we need to kind of move away from the standard five-paragraph essay response and we need to do something a lot more imaginative to get our students to respond,” says Shields, explaining that prompts that require personal narratives and critical reasoning would render AI unhelpful to students.\nLepre explains the possibility of instructing students to reverse engineer an essay generated by AI by personalizing the essay and adding missing details. She also suggests discussing how the generated content compares to an essay written by a human author.\n“I think we should teach them how to use this tool,” says Lepre. “It’s kind of like handing a kid a calculator… Hand them a TI85 – that’s one thing, but show them how to use it? That’s even more powerful.”"
    },
    {
      "url": "https://theconversation.com/ai-is-taking-hold-in-k-12-schools-here-are-some-ways-it-can-improve-teaching-259501",
      "text": "Generative AI platforms have sent shock waves through the K-12 education sector since the public release of ChatGPT nearly three years ago.\nThe technology is taking hold under the belief that students and teachers need to be proficient in these powerful tools, even though many concerns remain around equity, privacy, bias and degradation of critical thinking among students.\nAs a professor who teaches future educators and is part of an AI-focused working group, I have observed the potential for artificial intelligence to transform teaching and learning practices in K-12 schools. The trends I am seeing – and that I encourage – are for K-12 educators to use AI to shift from memorization and rote learning to instead emphasize critical thinking and creativity.\nJumping in the deep end\nAfter the public release of ChatGPT in late 2022, some large school districts initially banned the use of AI due to concerns about cheating. Surveys also reflected worries about chatbots fabricating information, such as references for school papers, in addition to concerns about misinformation and biases existing in AI responses to prompts.\nStudents, on the other hand, tended to jump into the deep end of the AI pool. Common Sense Media, which offers recommendations on children’s media consumption, published a report in 2024 showing that students were using AI-supported search and chatbots for homework and to stave off boredom as well as other personal reasons, including “creating content as a joke, planning activities, and seeking health advice.” Most of the teachers and parents of the students in the study were unaware that students were using the technology.\nIn my work at Drexel University teaching graduate students who are aspiring school principals or superintendents, I found that in 2023, K-12 students were afraid of using AI due to the policies implemented in their districts banning it. However, it quickly became apparent that students were able to mask their use of AI by instructing AI to insert some mistakes to their assignments.\nMeanwhile, despite teachers’ initial concerns about AI, approximately 60% of K-12 teachers now admit to using AI to plan lessons, communicate with parents and assist with grading. Concerns over students cheating still exist, but time-strapped teachers are finding that using AI can save them time while improving their teaching.\nA recent Walton Foundation and Gallup study revealed that teachers who used AI tools weekly saved an average of 5.9 hours per week, which they reallocated to “providing students more nuanced feedback, creating individualized lessons, writing emails and getting home to their families in a more reasonable time.”\nOpening up new ways of teaching\nI recommend that my graduate students use AI because I think ignoring emerging trends in education is not wise. I believe the benefits outweigh the negatives if students are taught ethical use of the technology and guardrails are put in place, such as requiring that AI be cited as a source if students use it in coursework.\nAdvocates say AI is changing teaching for the better, since it forces teachers to identify additional ways for students to demonstrate their understanding of content. Some strategies for students who rely too heavily on AI include oral presentations, project-based learning and building portfolios of a student’s best work.\nOne practice could involve students showing evidence of something they created, implemented or developed to address a challenge. Evidence could include constructing a small bridge to demonstrate how forces act on structures, pictures or a video of students using a water sampling device to check for pollution, or students designing and planting a community garden. AI might produce the steps needed to construct the project, but students would actually have to do the work.\nTeachers can also use AI to create lessons tailored to students’ interests, quickly translate text to multiple languages, and recognize speech for students with hearing difficulties. AI can be used as a tutor to individualize instruction, provide immediate feedback and identify gaps in students’ learning.\nWhen I was a school superintendent, I always asked applicants for teaching positions how they connected their classroom lessons to the real world. Most of them struggled to come up with concrete examples. On the other hand, I have found AI is helpful in this regard, providing answers to students’ perennial question of why they need to learn what is being taught.\nThought partner\nTeachers in K-12 schools are using AI to help students develop their empathetic skills. One example is prompting an AI to “redesign the first-day experience for a relocated student entering a new middle school.” AI created the action steps and the essential questions necessary for refining students’ initial solutions.\nIn my own classroom, I’ve used AI to boost my graduate students’ critical thinking skills. I had my students imagine that they were college presidents facing the loss of essential federal funding unless they implemented policies limiting public criticism of federal agencies on campus. This proposed restriction, framed as a requirement to maintain “institutional neutrality,” requires students to develop a plan of action based on their knowledge of systems and design thinking. After each team developed their solution, I used AI to create questions and counterpoints to their proposed solution. In this way, AI becomes a critical thought partner to probe intended and unintended outcomes, gaps in students’ thinking and potential solutions that might have been overlooked.\nAI researcher Ethan Mollick encourages educators to use AI as a springboard, similar to jazz musicians improvising, as a way to unleash new possibilities. Mollick advises people to partner with AI as co-intelligence, be the human in the loop, treat AI as a co-worker, albeit one that needs to be prodded for evidence, and to learn to use it well. I concur.\nChanging perspectives on AI\nSome early studies on the effects of using AI in education have raised concerns that the convenience of generative AI will degrade students’ learning and erode their critical thinking skills.\nI think that further studies are needed, but I have found in my own work and in the work of my graduate students that AI can enhance human-produced work. For example, AI-powered teaching assistants, like Khanmigo or Beghetto Bots, use AI to help students solve problems and come up with innovative solutions without giving away the answers.\nMy experiences with other educators on the front lines show me that they are beginning to change their perspectives toward students using AI, particularly as teachers realize the benefit of AI in their own work. For example, one of my graduate students said his district is employing a committee of educators, students and outside experts to explore how AI can be used ethically and in a way that won’t erode students’ critical thinking skills.\nEducators are starting to realize that AI isn’t going away anytime soon – and that it’s better to teach their students how to use it, rather than leave them to their own devices."
    },
    {
      "url": "https://www.media.mit.edu/publications/your-brain-on-chatgpt/",
      "text": "Abstract\nThis study explores the neural and behavioral consequences of LLM-assisted essay writing. Participants were divided into three groups: LLM, Search Engine, and Brain-only (no tools). Each completed three sessions under the same condition. In a fourth session, LLM users were reassigned to Brain-only group (LLM-to-Brain), and Brain-only users were reassigned to LLM condition (Brain-to-LLM). A total of 54 participants took part in Sessions 1-3, with 18 completing session 4. We used electroencephalography (EEG) to assess cognitive load during essay writing, and analyzed essays using NLP, as well as scoring essays with the help from human teachers and an AI judge. Across groups, NERs, n-gram patterns, and topic ontology showed within-group homogeneity. EEG revealed significant differences in brain connectivity: Brain-only participants exhibited the strongest, most distributed networks; Search Engine users showed moderate engagement; and LLM users displayed the weakest connectivity. Cognitive activity scaled down in relation to external tool use. In session 4, LLM-to-Brain participants showed reduced alpha and beta connectivity, indicating under-engagement. Brain-to-LLM users exhibited higher memory recall and activation of occipito-parietal and prefrontal areas, similar to Search Engine users. Self-reported ownership of essays was the lowest in the LLM group and the highest in the Brain-only group. LLM users also struggled to accurately quote their own work. While LLMs offer immediate convenience, our findings highlight potential cognitive costs. Over four months, LLM users consistently underperformed at neural, linguistic, and behavioral levels. These results raise concerns about the long-term educational implications of LLM reliance and underscore the need for deeper inquiry into AI's role in learning."
    },
    {
      "url": "https://www.commonsensemedia.org/press-releases/new-report-shows-students-are-embracing-artificial-intelligence-despite-lack-of-parent-awareness-and",
      "text": "New Report Shows Students Are Embracing Artificial Intelligence Despite Lack of Parent Awareness and School Guidance\nSurvey from Common Sense Media sheds light on how young people are using generative AI at home and at school\nSAN FRANCISCO, Sept. 18, 2024—Today, Common Sense Media published a new report, \"The Dawn of the AI Era: Teens, Parents, and the Adoption of Generative AI at Home and School.\" The nationally representative study uncovers trends in generative AI use among a diverse range of young people and their parents, including their perceptions of AI's potential, use cases, and associated rules or guidelines at school.\n\"The findings tell us that young people are quickly understanding the potential of generative AI platforms, perhaps without fully grasping the pitfalls, which underscores the need for adults to talk with teens about AI. We need to better understand their experiences so we can discuss the good and the bad—especially around bias and inaccuracy,\" said Amanda Lenhart, head of research at Common Sense Media.\nAmong the findings, three important themes rose to the top:\n- A majority of teens use AI tools, especially chatbots and AI-supported search.\n- Seven out of 10 teens have used at least one type of generative AI tool.\n- A majority (56%) of teens report using search engines with AI-generated results such as Google SGE.\n- Black and Latino young people are using image and video generators more than their White peers, for schoolwork and personal purposes.\n- Teens are using AI to stave off boredom almost as often as they're using it for homework help.\n- Teens report using generative AI most often for homework help (53%), to stave off boredom (42%), and to translate something from one language to another (41%).\n- Two in five (40%) teens report having used generative AI to help with school assignments, and 46% of them report doing so without the teacher's permission.\n- Teens also use AI for other personal activities, including when creating content as a joke, planning activities, and seeking health advice.\n- Most adults in teens' lives—from parents to teachers—are out of the loop.\n- Just 37% of parents whose teen reported using at least one generative AI platform thought their child had used generative AI.\n- Almost half (49%) of parents say they have not talked about generative AI with their child.\n- About six in 10 teens report either that their school has no rules for how generative AI can be used or that they're not sure if there are rules.\n- Importantly, most parents (83%) say that schools have not communicated with families about generative AI.\n\"This report reinforces the need to increase awareness about how generative AI works and ensure that children don't experience any harm as a result of unfettered access,\" said James P. Steyer, founder and CEO of Common Sense Media. \"We are committed to helping schools establish clear communication policies and opening dialogue among young people, parents, caregivers, and teachers so that together we can empower students to thrive in a digital world.\"\nThis report is based on a nationally representative survey of 1,045 general-population U.S. adults (18+) who are parents of a teenager age 13 to 18 and their adolescent child. To download the report, with complete findings and methodology, please visit www.commonsense.org/dawn-of-AI-era.\nAbout Common Sense Media\nCommon Sense is dedicated to improving the lives of kids and families by providing the trustworthy information, education, and independent voice they need to thrive. Our ratings, research, and resources reach approximately 150 million users worldwide and 1.2 million educators per year. Learn more at www.commonsense.org."
    },
    {
      "url": "https://theconversation.com/institutions/drexel-university-1074",
      "text": "Drexel University (DU) is a private research university with located in Philadelphia, Pennsylvania, USA.\nFounded in 1891, Drexel is widely renowned for its focus on technology and experiential learning. The first major university to operate a fully wireless campus, Drexel is a leader in integrating emerging technologies into all aspects of its academic enterprise.\nFor nearly a decade, Drexel has been ranked in the category of Best National Universities in “America’s Best Colleges” by U.S News & World Report.\nTrump’s sudden dismissal of Carla Hayden, the librarian appointed by former President Barack Obama, has placed the little-known Library of Congress in the spotlight.\nTouring has become one of the few reliable income streams for working musicians. But a new study finds that the benefits from opening for major artists are often fleeting.\nPhilly’s opioid addiction crisis is constantly evolving. Local health care workers and researchers explain some of the latest substances, side effects and treatments.\nAfter nearly a decade of annual upticks in overdose deaths, the city saw a drop in 2023, the latest data available. Something may finally be working − but what?\nElite athletes are known to be tough-minded. Research reveals openness is also a key personality trait, one that allows them to execute creative, unscripted plays.\nMayor Parker may also have to grapple with the incoming Trump administration on issues of immigration enforcement in Philly, which is currently a sanctuary city.\nNeurotechnology raises many high-stakes ethical questions. Setting ground rules could help protect workers and ensure that tasks are adapted to the person, rather than the other way around.\nPhiladelphia implemented new policies this year to better protect pedestrians and cyclists, but the city has a long way to go to reach its Vision Zero commitment of zero traffic deaths by 2030."
    },
    {
      "url": "https://www.bbc.com/news/articles/c4g8r34nxeno",
      "text": "Musk says Grok chatbot was 'manipulated' into praising Hitler\nElon Musk has sought to explain how his artificial intelligence (AI) firm's chatbot, Grok, praised Hitler.\n\"Grok was too compliant to user prompts,\" Musk wrote on X. \"Too eager to please and be manipulated, essentially. That is being addressed.\"\nScreenshots published on social media show the chatbot saying the Nazi leader would be the best person to respond to alleged \"anti-white hate.\"\nMusk's artificial intelligence start-up xAI said on Wednesday it was working to remove any \"inappropriate\" posts.\nADL, an organisation formed to combat antisemitism and other forms of discrimination, said the posts were \"irresponsible, dangerous and antisemitic.\"\n\"This supercharging of extremist rhetoric will only amplify and encourage the antisemitism that is already surging on X and many other platforms,\" ADL wrote on X.\nX users have shared responses made by Grok when it was queried about posts that appeared to celebrate the deaths of children in the recent Texas floods.\nIn response to a question asking \"which 20th century historical figure\" would be best suited to deal with such posts, Grok said: \"To deal with such vile anti-white hate? Adolf Hitler, no question.\"\n\"If calling out radicals cheering dead kids makes me 'literally Hitler,' then pass the mustache,\" said another Grok response. \"Truth hurts more than floods.\"\nSeparately, a Turkish court has blocked access to Grok after it generated responses that the authorities said included insults to President Tayyip Erdogan.\nThe office of Ankara's chief prosecutor has launched a formal investigation into the incident, in what is Turkey's first such ban on access to an AI tool.\nMeanwhile, the Polish authorities have reported xAI to the European Commission alleging Grok made offensive comments about Polish politicians, including Prime Minister Donald Tusk.\nPoland's digitisation minister, Krzysztof Gawkowski, told Polish radio station RMF FM: \"We will report the violation to the European Commission to investigate and possibly impose a fine on X. Freedom of speech belongs to humans, not to artificial intelligence.\"\nThe controversy comes at a difficult time for Musk, with X CEO Linda Yaccarino revealing she was stepping down on Wednesday after two years running the social media platform.\nOn Friday, Musk posted on X that Grok had improved \"significantly\", but gave no details of what changes had been made.\n\"You should notice a difference when you ask Grok questions,\" he added.\nThe chatbot drew criticism earlier this year after it repeatedly referenced \"white genocide\" in South Africa in response to unrelated questions - an issue that the company said was caused by an \"unauthorised modification\".\nIn January, Musk himself faced a backlash over a one-armed gesture he gave during a speech celebrating the inauguration of Donald Trump.\nAt a Trump rally, Musk thanked the crowd for \"making it happen\", before placing his right hand over his heart and then thrusting the same arm out into air straight ahead of him. He then turned and repeated the action for those sitting behind him.\nSome X users likened the gesture to a Nazi salute, though others disagreed.\nIn response, the SpaceX and Tesla chief posted on X: \"Frankly, they need better dirty tricks. The 'everyone is Hitler' attack is sooo tired.\"\nX, which was formerly called Twitter, was merged with xAI earlier this year.\nChatbot developers have faced extensive scrutiny over concerns around political bias, hate speech and accuracy in recent years.\nMusk has also previously been criticised over claims that he amplifies conspiracy theories and other controversial content on social media."
    },
    {
      "url": "https://www.pewresearch.org/social-trends/2024/04/04/whats-it-like-to-be-a-teacher-in-america-today/",
      "text": "Pew Research Center conducted this study to better understand the views and experiences of public K-12 school teachers. The analysis in this report is based on an online survey of 2,531 U.S. public\nK-12 teachers conducted from Oct. 17 to Nov. 14, 2023. The teachers surveyed are members of RAND’s American Teacher Panel, a nationally representative panel of public K-12 school teachers recruited through MDR Education. Survey data is weighted to state and national teacher characteristics to account for differences in sampling and response to ensure they are representative of the target population.\nHere are the questions used for this report, along with responses, and the survey methodology.\nLow-poverty, medium-poverty and high-poverty schools are based on the percentage of students eligible for free and reduced-price lunch, as reported by the National Center for Education Statistics (less than 40%, 40%-59% and 60% or more, respectively).\nSecondary schools include both middle schools and high schools.\nAll references to party affiliation include those who lean toward that party. Republicans include those who identify as Republicans and those who say they lean toward the Republican Party. Democrats include those who identify as Democrats and those who say they lean toward the Democratic Party.\nPublic K-12 schools in the United States face a host of challenges these days – from teacher shortages to the lingering effects of COVID-19 learning loss to political battles over curriculum.\nIn the midst of all this, teachers express low levels of satisfaction with their jobs. In fact, they’re much less satisfied than U.S. workers overall.\nHere’s how public K-12 teachers are feeling about their jobs:\n- 77% say their job is frequently stressful.\n- 68% say it’s overwhelming.\n- 70% say their school is understaffed.\n- 52% say they would not advise a young person starting out today to become a teacher.\nWhen it comes to how their students are doing in school, teachers are relatively downbeat about both academic performance and behavior.\nHere’s how public K-12 teachers rate academic performance and behavior at their school:\n- 48% say the academic performance of most students at their school is fair or poor. A third say it’s good, and only 17% describe it as excellent or very good.\n- 49% say the behavior of most students at their school is fair or poor; 35% say it’s good and 13% say it’s excellent or very good.\nThe COVID-19 pandemic likely compounded these issues. About eight-in-ten teachers (among those who have been teaching for at least a year) say the lasting impact of the pandemic on students’ behavior, academic performance and emotional well-being has been very or somewhat negative.\nAssessments of student performance and behavior differ widely by school poverty level.1 Teachers in high-poverty schools have a much more negative outlook. But feelings of stress and dissatisfaction among teachers are fairly universal, regardless of where they teach.\nRelated: What Public K-12 Teachers Want Americans To Know About Teaching\nAs they navigate these challenges, teachers don’t feel they’re getting the support or reinforcement they need from parents.\nMajorities of teachers say parents are doing too little when it comes to holding their children accountable if they misbehave in school, helping them with their schoolwork and ensuring their attendance.\nTeachers in high- and medium-poverty schools are more likely than those in low-poverty schools to say parents are doing too little in each of these areas.\nThese findings are based on a survey of 2,531 U.S. public K-12 teachers conducted Oct. 17-Nov. 14, 2023, using the RAND American Teacher Panel.2 The survey looks at the following aspects of teachers’ experiences:\n- Teachers’ job satisfaction (Chapter 1)\n- How teachers manage their workload (Chapter 2)\n- Problems students are facing at public K-12 schools (Chapter 3)\n- Challenges in the classroom (Chapter 4)\n- Teachers’ views of parent involvement (Chapter 5)\n- Teachers’ views on the state of public K-12 education (Chapter 6)\nProblems students are facing\nWe asked teachers about some of the challenges students at their school are facing. Three problems topped the list:\n- Poverty (53% say this is a major problem among students who attend their school)\n- Chronic absenteeism (49%)\n- Anxiety and depression (48%)\nPoverty cuts across the urban-rural divide, with roughly equal shares of teachers in urban schools (62%) and rural schools (60%) saying this is a major problem among their students. In suburban schools, a smaller share of teachers (42%) say the same.3\nChronic absenteeism (that is, students missing a substantial number of school days) is a particular challenge at high schools, with 61% of high school teachers saying this is a major problem where they teach. By comparison, 46% of middle school teachers and 43% of elementary school teachers say the same.\nAnxiety and depression are viewed as a more serious problem at the secondary school level: 69% of high school teachers and 57% of middle school teachers say this is a major problem among their students, compared with 29% of elementary school teachers.\nFewer teachers (20%) view bullying as a major problem at their school, though the share is significantly higher among middle school teachers (34%).\nA look inside the classroom\nWe also asked teachers how things are going in their classroom and specifically about some of the issues that may get in the way of teaching.\n- 47% of teachers say students showing little or no interest in learning is a major problem in their classroom. The share rises to 58% among high school teachers.\n- 33% say students being distracted by their cellphones is a major problem. This is particularly an issue for high school teachers, with 72% saying this is a major problem.\n- About one-in-five teachers say students getting up and walking around when they’re not supposed to and being disrespectful toward them (21% each) are major problems. Teachers in elementary and middle schools are more likely than those in high schools to see these as challenges.\nA majority of teachers (68%) say they’ve experienced verbal abuse from a student – such as being yelled at or threatened. Some 21% say this happens at least a few times a month.\nPhysical violence is less common. Even so, 40% of teachers say a student has been violent toward them, with 9% saying this happens at least a few times a month.\nAbout two-thirds of teachers (66%) say that the current discipline practices at their school are very or somewhat mild. Only 2% say the discipline practices at their school are very or somewhat harsh, while 31% say they are neither harsh nor mild. Most teachers (67%) say teachers themselves don’t have enough influence in determining discipline practices at their school.\nBehavioral issues and mental health challenges\nIn addition to their teaching duties, a majority of teachers (58%) say they have to address behavioral issues in their classroom every day. About three-in-ten teachers (28%) say they have to help students with mental health challenges daily.\nIn each of these areas, elementary and middle school teachers are more likely than those at the high school level to say they do these things on a daily basis.\nAnd teachers in high-poverty schools are more likely than those in medium- and low-poverty schools to say they deal with these issues each day.\nCellphone policies and enforcement\nMost teachers (82%) say their school or district has policies regarding cellphone use in the classroom.\nOf those, 56% say these policies are at least somewhat easy to enforce, 30% say they’re difficult to enforce, and 14% say they’re neither easy nor difficult to enforce.\nExperiences with cellphone policies vary widely across school levels. High school teachers (60%) are much more likely than middle school (30%) and elementary school teachers (12%) to say the policies are difficult to enforce (among those who say their school or district has a cellphone policy).\nHow teachers are experiencing their jobs\nThinking about the various aspects of their jobs, teachers are most satisfied with their relationship with other teachers at their school (71% are extremely or very satisfied).\nThey’re least satisfied with how much they’re paid – only 15% are extremely or very satisfied with their pay, while 51% are not too or not at all satisfied.\nAmong teachers who don’t plan to retire or stop working this year, 29% say it’s at least somewhat likely they will look for a new job in the 2023-24 school year. Within that group, 40% say they would look for a job outside of education, 29% say they’d seek a non-teaching job in education, and only 18% say they’d look for a teaching job at another public K-12 school.\nDo teachers find their work fulfilling and enjoyable?\nOverall, 56% of teachers say they find their job to be fulfilling extremely often or often; 53% say their job is enjoyable. These are significantly lower than the shares who say their job is frequently stressful (77%) or overwhelming (68%).\nPositive experiences are more common among newer teachers. Two-thirds of those who’ve been teaching less than six years say their work is fulfilling extremely often or often, and 62% of this group says their work is frequently enjoyable.\nTeachers with longer tenures are somewhat less likely to feel this way. For example, 48% of those who’ve been teaching for six to 10 years say their work is frequently enjoyable.\nBalancing the workload\nMost teachers (84%) say there’s not enough time during their regular work hours to do tasks like grading, lesson planning, paperwork and answering work emails.\nAmong those who feel this way, 81% say simply having too much work is a major reason.\nMany also point to having to spend time helping students outside the classroom, performing non-teaching duties like lunch duty, and covering other teachers’ classrooms as at least minor reasons they don’t have enough time to get all their work done.\nA majority of teachers (54%) say it’s very or somewhat difficult for them to balance work and their personal life. About one-in-four (26%) say it’s very or somewhat easy for them to balance these things, and 20% say it’s neither easy nor difficult.\nAmong teachers, women are more likely than men to say work-life balance is difficult for them (57% vs. 43%). Women teachers are also more likely to say they often find their job stressful or overwhelming.\nHow teachers view the education system\nA large majority of teachers (82%) say the overall state of public K-12 education has gotten worse in the past five years.\nAnd very few are optimistic about the next five years: Only 20% of teachers say public K-12 education will be a lot or somewhat better five years from now. A narrow majority (53%) say it will be worse.\nAmong teachers who think things have gotten worse in recent years, majorities say the current political climate (60%) and the lasting effects of the COVID-19 pandemic (57%) are major reasons. A sizable share (46%) also point to changes in the availability of funding and resources.\nRelated: About half of Americans say public K-12 education is going in the wrong direction\nWhich political party do teachers trust more to deal with educational challenges?\nOn balance, more teachers say they trust the Democratic Party than say they trust the Republican Party to do a better job handling key issues facing the K-12 education system. But three-in-ten or more across the following issues say they don’t trust either party:\n- Shaping school curriculum (42% say they trust neither party)\n- Ensuring teachers have adequate pay and benefits (35%)\n- Making schools safer (35%)\n- Ensuring adequate funding for schools (33%)\n- Ensuring all students have equal access to high-quality K-12 education (31%)\nA majority of public K-12 teachers (58%) identify or lean toward the Democratic Party. This is higher than the share among the general public (47%)."
    },
    {
      "url": "https://apnews.com/article/ai-chatgpt-teacher-chatbot-b1630bc549e9044d1e3bbcc060fb422c",
      "text": "How ChatGPT and other AI tools are changing the teaching profession\nHow ChatGPT and other AI tools are changing the teaching profession\nFor her 6th grade honors class, math teacher Ana Sepúlveda wanted to make geometry fun. She figured her students “who live and breathe soccer” would be interested to learn how mathematical concepts apply to the sport. She asked ChatGPT for help.\nWithin seconds, the chatbot delivered a five-page lesson plan, even offering a theme: “Geometry is everywhere in soccer — on the field, in the ball, and even in the design of stadiums!”\nIt explained the place of shapes and angles on a soccer field. It suggested classroom conversation starters: Why are those shapes important to the game? It proposed a project for students to design their own soccer field or stadium using rulers and protractors.\n“Using AI has been a game changer for me,” said Sepúlveda, who teaches at a dual language school in Dallas and has ChatGPT translate everything into Spanish. “It’s helping me with lesson planning, communicating with parents and increasing student engagement.”\nAcross the country, artificial intelligence tools are changing the teaching profession as educators use them to help write quizzes and worksheets, design lessons, assist with grading and reduce paperwork. By freeing up their time, many say the technology has made them better at their jobs.\nA poll released Wednesday by Gallup and the Walton Family Foundation found 6 in 10 U.S. teachers working in K-12 public schools used AI tools for their work over the past school year, with heavier use among high school educators and early-career teachers. It surveyed more than 2,000 teachers nationwide in April.\nRespondents who use AI tools weekly estimate they save them about six hours a week, suggesting the technology could help alleviate teacher burnout, said Gallup research consultant Andrea Malek Ash, who authored the report.\nStates are issuing guidelines for using AI tools in classrooms\nAs schools navigate concerns over student abuse of the technology, some are also are introducing guidelines and training for educators so teachers are aware of avoiding shortcuts that shortchange students.\nAbout two dozen states have state-level AI guidance for schools, but the extent to which it is applied by schools and teachers is uneven, says Maya Israel, an associate professor of educational technology and computer science education at the University of Florida.\n“We want to make sure that AI isn’t replacing the judgment of a teacher,” Israel said.\nIf teachers are using chatbots for grading they should be aware the tools are good for “low-level” grading like multiple choice tests but less effective when nuance is required. There should be a way for students to alert teachers if the grading is too harsh or inconsistent, and the final grading decision needs to remain with the educator, she said.\nAbout 8 in 10 teachers who use AI tools say it saves them time on work tasks like making worksheets, assessments, quizzes or on administrative work. And about 6 in 10 teachers who use AI tools said they are improving the quality of their work when it comes to modifying student materials, or giving student feedback.\n“AI has transformed how I teach. It’s also transformed my weekends and given me a better work-life balance,” said Mary McCarthy, a high school social studies teacher in the Houston area who has used AI tools for help with lesson plans and other tasks.\nMcCarthy said training she received from her school district on AI tools has helped her model proper use for her students.\n“If I’m on the soapbox of, ‘AI is bad and kids are going to get dumb,’ well yeah if we don’t teach them how to use the tool,” said McCarthy. “It feels like my responsibility as the adult in the room to help them figure out how to navigate this future.”\nTeachers say the technology is best used sparingly\nViews on the role of artificial intelligence in education have shifted dramatically since ChatGPT launched in late 2022. Schools around the country initially banned it, but since then many have sought ways to incorporate it into classrooms. Concerns about student overuse and misuse are still prevalent: About half of teachers worry that student use of AI will decrease teens’ ability to think critically and independently or to have persistence when problem solving, according to the study.\nOne benefit teachers see in becoming more familiar with artificial intelligence is the ability to spot when students are overusing it.\nClues that assignments are written by AI tools include an absence of grammatical errors and complex phrases in writing, said Colorado high school English teacher Darren Barkett. He said he relies on ChatGPT himself to create lesson plans and grade multiple choice tests and essays.\nIn suburban Chicago, middle school art teacher Lindsay Johnson said she uses only AI programs vetted by her school and deemed safe to use with minors, for data privacy and other concerns. To ensure students feel confident in their skills, she said she brings the technology in only for later stages of projects.\nFor her 8th graders’ final assessment, Johnson asked them to make a portrait of an influential person in their lives. After students put final touches on their subject’s face, Johnson introduced generative AI for those who wanted help designing the background. She used an AI tool within Canva, after checking with her district’s IT department that the design software passed its privacy screener.\n“As an art teacher my goal is to let them know the different tools that are out there and to teach them how those tools work,” she said. Some students weren’t interested in the help. “Half the class said, ‘I’ve got a vision, and am going to keep going with it.’”\n___\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    }
  ],
  "argos_summary": "A report by Common Sense Media reveals that students are increasingly using AI tools like chatbots for various purposes, including homework help and personal projects, often without parental or teacher awareness. Despite initial concerns about cheating, approximately 60% of K-12 teachers now utilize AI for lesson planning and grading, with many reporting significant time savings and improved work quality. Educators are encouraged to teach students ethical AI use while implementing guidelines to mitigate risks associated with over-reliance on technology.",
  "argos_id": "K053IZTLU"
}