{
  "url": "https://www.nytimes.com/athletic/6548469/2025/08/13/mohammed-kudus-spurs-profile/",
  "authorsByline": "Elias Burke",
  "articleId": "083758afe549453aa0450e5923198ce3",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/12085408/GettyImages-2229712236-scaled-e1755003592495.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:10:41+00:00",
  "addDate": "2025-08-13T04:24:58.281463+00:00",
  "refreshDate": "2025-08-13T04:24:58.281465+00:00",
  "score": 1.0,
  "title": "Tottenham’s Mohammed Kudus and the realisation of a dream: ‘You just have to let him play’",
  "description": "The key to Spurs getting the best from their new Ghanaian forward could be his relationship with head coach Thomas Frank...",
  "content": "As the standout in a talented crop, Tottenham Hotspur’s £55million new signing Mohammed Kudus had been earmarked for stardom long before he left his native Ghana to play in Europe. And he has long dreamt of being part of occasions like tonight, when he and his new club will face European champions Paris Saint-Germain in the UEFA Super Cup. He is unlikely to be overawed.\n\n“I first became aware of Kudus when I watched him train in Ghana in 2016 among the 1999-to-2001-born players — he was 16 years old and his talent was obvious,” Flemming Pedersen, technical director of Danish club FC Nordsjaelland and the Ghana-based Right to Dream academy, tells The Athletic. “He always stood out. He had extra physical and technical qualities.”\n\nPlucked from Strong Tower, an amateur club in Ghana’s capital city Accra, Kudus was 12 years old when he joined Right to Dream, the free-of-charge residential talent factory established by former Manchester United scout Tom Vernon that has supercharged the pathway for prospects from that country into European football.\n\n“(Right to Dream) was a really good environment,” says Ibrahim Sadiq, a 25-year-old winger now at Dutch club AZ who progressed through the Right to Dream academy at the same time as Kudus. “There was a good schedule and balance. We were able to go to school and play football. The facilities were great — similar to grounds and facilities in Europe.”\n\nRight to Dream provided a professional “student-athlete” programme, similar to the NCAA system at American colleges that places value on academics as well as developing potential professional athletes. There, Kudus progressed as a teenager alongside some of West Africa’s brightest talents.\n\n“He grew up with a number of players who now play for the national team,” says Henry Asante Twum, a Ghanaian FA official who has seen Kudus develop from a youth player into a star for the country’s national team. “Kamaldeen Sulemana, who recently signed for Atalanta from Southampton, Ibrahim Sulemana, who also plays for Atalanta, and Ibrahim Osman at Brighton (now on loan to Auxerre) — they all grew up together.”\n\nIn the years before Right to Dream and similar academies offered a centralised pathway, West African talents relied on scouts linked to those professional clubs thousands of miles away, or youth tournaments with their national teams, to secure moves to Europe. Thanks to Right to Dream, Kudus had a direct route to playing in Scandinavia through Nordsjaelland, the Danish Superliga club known as FCN that the academy bought in 2015.\n\nKudus was invited to train with FCN at 16 and played in a summer tournament in England alongside the programme’s best Danish and Ghanaian talent, including now Brentford forward Mikkel Damsgaard. At the same time, he was progressing through Ghana’s youth setup. In 2017, he was called up by his country for the Under-17 Africa Cup of Nations; Ghana got to the final, earning qualification for the same age group’s World Cup in the October of that year.\n\nThe following August, FCN signed him to a professional contract on his 18th birthday, and he made his senior debut three days later.\n\n“Moving to Denmark was not really hard,” says Sadiq, who moved to FCN from Right to Dream with Kudus. “At Right to Dream, we were used to travelling a lot for tournaments, so we already knew things like the climate and food in Europe. He always wanted to play football, to make fans happy, and I’ve never seen him nervous.”\n\nFCN have a proud track record of providing a seamless environment for players to transition from Ghana to Denmark.\n\nIt’s no coincidence that, between 2018 and 2023, no senior club in world football awarded a higher percentage of minutes to under-20 players than their 37 per cent, including Sulemana, Osman, Kudus and Simon Adingra, who joined Sunderland this summer from Brighton.\n\nThe systems deployed in Ghana, Denmark and at the organisation’s other locations in Egypt and the U.S. city of San Diego are uniform, to the extent it is defined in its “playbook”, which helps players to hit the ground running. Still, there is a natural adjustment period for anyone, even those as talented as Kudus.\n\n“He needed to find out that it wouldn’t be like the academy as a professional,” says Pedersen, who was FCN’s head coach at the time. “When he was in the academy, he won all of his one-v-one situations. When you get into professional men’s football, you meet players who are 10 kilograms (22lbs) heavier than you, and are as fast as you and much stronger. They’re more experienced and intelligent at reading your movements. He needed to get used to not being able to rely on his technical and physical qualities.\n\n“He was extremely individual when he transitioned from Ghana to FCN. He slowly got used to a more collective game and understanding his defensive responsibilities: pressing and reading the game.”\n\nKudus was in and out of FCN’s starting line-up in that debut year but became a “powerhouse” by his second season in Denmark, scoring 11 goals in 25 league appearances. According to Pedersen, the switch was flicked during a conversation they had about understanding his role within the team.\n\n“Kudus is a player that you can’t just put into a stiff structure,” says Pedersen. “He needs to play with freedom to express himself. Still, we wanted to put him in our framework but allow the framework to help him express himself. We spoke about him wanting more freedom, and then we discussed the idea of structure versus freedom, and that it was not necessarily opposed. The structure could actually help him gain more freedom.\n\n“I said, ‘OK, if you have a one-v-one in the attacking third, is there anything you want from your team-mates?’. He said, ‘Yes, I want my team-mates to stay away’. So I asked, ‘But what if your team-mate wants to run towards you? What if your team-mate tells us that he wants to play with freedom and wants to run towards you to get closer?’. He realised that his team-mate would take up the space and maybe attract another opponent. It helped him understand that the game is collective. Team-mates need to make demands of each other to get the best out of each other and the team.”\n\nOff the back of that excellent second season for FCN, by which time he had established himself as “the best attacking midfielder in Denmark”, according to Pedersen, Kudus moved to Dutch giants Ajax in July 2020, a couple of weeks before turning 20. The transfer was the realisation of a lifelong dream for a boy from Nima, a suburb in Accra, once known for its gang violence and now famous for exporting Kudus, who frequently returns to his hometown to donate football boots and other equipment and organise community games.\n\n“I remember conversations from as young as 17 — he was so determined to play in the Champions League,” says Asante-Twum. “Moving to Ajax was truly a dream come true for him. When he got there, he was not overawed by the stage — he never is.”\n\nThough he made his Champions League debut in Ajax’s first group-stage game that October against Liverpool, Kudus’ debut season in Amsterdam was disrupted by a knee injury sustained early in that match. He was limited to eight starts in the domestic top flight, featuring primarily as a central midfielder or as a No 10. An ankle problem and rib fracture then prevented him from building much momentum in year two, where he started only four times in the Eredivisie.\n\nWith the 2022 World Cup on the horizon, Kudus was attracted by a proposal from Burnley and wanted to leave for the then Championship club, but they did not meet Ajax’s asking price. Everton also made a loan offer, but with several key starters departing after Erik ten Hag left for the Manchester United job in that summer window, new head coach Alfred Schreuder was determined to hang onto Kudus.\n\n“Everyone told me he was one of the most talented players they had — but they needed to find a position for him,” Schreuder tells The Athletic. “I think in the beginning he wanted to leave, but we had sold so many players that summer, Antony, Lisandro Martinez, Ryan Gravenberch, Noussair Mazraoui, Nicolas Tagliafico… I told him, ‘You will play a lot’, but I had the feeling that he didn’t trust that at first.\n\n“For me, it was a little bit difficult to find him a position in midfield. He wanted to play as a No 10, but in the Dutch league, those players are a little bit different. So I started to play him as a nine in the Champions League against Rangers, like a dropping (false) nine, and he was amazing.”\n\nKudus exploded into British football’s consciousness that season, scoring and assisting in that 4-0 win over Rangers in Ajax’s group opener, before adding another goal in a 2-1 defeat by Liverpool at Anfield a week later. Though Ajax failed to advance to the knockout phase, Kudus scored four goals and assisted twice in their six matches from that false nine position. His strong form in the Champions League carried into the World Cup that November and December in Qatar, where Kudus gained international recognition.\n\nHe was one of the breakout stars of the tournament, creating a goal for his idol Andre Ayew in a 3-2 defeat by Portugal, before scoring twice in a 3-2 victory against South Korea in their second group game. As with Ajax in that year’s Champions League, Ghana ultimately fell at the first hurdle following a 2-0 defeat by Uruguay, but not without Kudus significantly elevating his standing.\n\n“After the World Cup and Champions League, he became very popular,” says Schreuder, who was sacked a few weeks later in a season where Ajax eventually finished third, “but he was very professional and extremely disciplined in the team effort. He runs a lot and works very hard — he’s not the kind of player you have to talk a lot with.\n\n“You explain what you want from him, and he understands it. From there, you just have to let him play. I think when you let him play, he starts to trust you — he’s not the kind of player who needs to be too involved in the team’s tactics. He’s an introvert, but really an amazing and honest guy. He will never hide from you if you show him real interest.”\n\nThat summer, Kudus joined West Ham for £35m, following in the footsteps of his Ghanaian idols Michael Essien and Ayew in playing in the Premier League. He had an outstanding first season at the London Stadium, finishing with 14 goals and six assists in all competitions, featuring across the forward line and as an attacking midfielder.\n\nLast season, his second in east London, was more challenging as West Ham struggled, finishing 14th. The summer departure of first-team coach John Heitinga to join the Liverpool backroom staff and tension with short-lived new manager Julen Lopetegui, who was sacked in January, were cited as factors in his downturn. Ghana also failed to qualify for the Africa Cup of Nations, which starts this December.\n\nAgain, he split his minutes fairly evenly across the central striker, No 10 and wide positions, highlighting his versatility.\n\n“For a team that wants to play (passing football), he can drop in as a nine into the midfield,” says Schreuder. “He is amazing at that. It depends on how the coach wants to use him — he can play from the right or in the 10. But it’s very difficult, I think, to define a position for him. For me, he’s not a classic No 10. In modern football, you have to play several positions — and he’s exactly that. I think (new Spurs head coach Thomas) Frank will use him in two or three positions. Winger, No 8 and No 9 are his best.”\n\nMore than anything, however, to get the best out of the “Star Boy”, as Kudus is called by his Ghana team-mates, the former Brentford manager must find a relationship with him on a personal level.\n\n“You see the best of Kudus when he is connected with the coach,” says Pedersen. “Already, Thomas and I have been speaking about this. Kudus needs to be understood. I can already sense that Thomas has a really good feeling, and the relationship between Kudus and Thomas could be something special, because Thomas is a special coach when it comes to understanding his players.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/article/6546401/",
    "https://www.nytimes.com/athletic/6478040/2025/07/09/why-tottenham-want-kudus/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kudus",
      "weight": 0.07358754
    },
    {
      "name": "Mohammed Kudus",
      "weight": 0.07254413
    },
    {
      "name": "player",
      "weight": 0.056682162
    },
    {
      "name": "players",
      "weight": 0.056682162
    },
    {
      "name": "new head coach Alfred Schreuder",
      "weight": 0.051000033
    },
    {
      "name": "Danish club",
      "weight": 0.050202344
    },
    {
      "name": "Ghana",
      "weight": 0.04916468
    },
    {
      "name": "Dutch club AZ",
      "weight": 0.048500497
    },
    {
      "name": "Champions League",
      "weight": 0.04748787
    },
    {
      "name": "European football",
      "weight": 0.04624853
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.98193359375
    }
  ],
  "sentiment": {
    "positive": 0.6950551,
    "negative": 0.04818491,
    "neutral": 0.25675994
  },
  "summary": "Tottenham Hotspur has signed Ghanaian footballer Mohammed Kudus for £55m. The £12m signing was selected from the Right to Dream academy in Ghana, a free-of-charge residential talent factory established by former Manchester United scout Tom Vernon. The academy also provided a professional “student-athlete” programme, similar to the NCAA system at American colleges, which emphasizes academics and potential professional athletes. Kudu had a direct route to playing in Scandinavia through Nordsjaelland, the Danish Superliga club the academy bought in 2015. He was invited to train with FCN at 16 and played in a summer tournament in England alongside the programme’s best Danish and Ghanaian talent, including now Brentford forward Mikkel Damsgaard.",
  "shortSummary": "Tottenham Hotspur’s £55m signing Mohammed Kudus, originally from Ghana, has a promising career path from Ghanaian youth to professional football, thanks to Right to Dream, Denmark's leading talent pipeline.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a87f05c2a3bd4668acc32e7d1362d174",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6478040/2025/07/09/why-tottenham-want-kudus/",
      "text": "When shaping any squad, the diversity of the profiles is vital.\nDifferent characteristics offer diverse solutions depending on the team’s principles and the opponent on the day.\nTottenham Hotspur’s new head coach, Thomas Frank, will adapt to the squad at his disposal. That’s why empowering the team with missing profiles is a step in the right direction, as it gives the Danish head coach more tools.\nAdvertisement\nSince the start of the summer transfer window, Spurs have been interested in signing a winger and on July 8 they reached a transfer agreement with West Ham for Mohammed Kudus worth in the region of £55million ($75m).\nGoing for Kudus, 24, is an interesting choice because it provides flexibility and fills a profile gap in Tottenham’s squad. The shortage of dribblers in Frank’s team limits their attacking solutions, especially with the lack of a left-footed one.\nKudus perfectly fits the required profile, while being able to play in any position across the front line. The forward’s skill set isn’t limited to his dribbling, though, as his ball-carrying ability offers a threat on the transition and his movement inside the penalty area puts him in dangerous goalscoring positions.\nIn terms of Premier League dribblers, it’s impossible to ignore Kudus’ one-on-one prowess. “It’s one of my biggest attributes,” he told The Athletic last year. “I play with so much risk and try to create stuff in the game out of nothing.”\nLast season, he attempted the second-most take-ons per 90 minutes (7.2) in the Premier League, and had the second-highest successful take-ons per game (3.2) among players with at least 75 attempts.\nOne of the stand-out aspects of Kudus’ dribbling is his ability to drive past opponents in large areas as well as weave through them in tight spaces, as seen in this example from the 1-1 draw against Everton in March.\nKudus is comfortable dribbling in any direction, which makes him unpredictable and enables him to play in multiple attacking positions. His understanding of how to use his body as a shield between the opponent and the ball is another aspect that makes him hard to dispossess.\n“My low centre of gravity also helps. I work a lot on my lower body, so it’s really hard for me to get off the ball or be pushed away easily,” Kudus said in an interview with the Premier League last year.\nAdvertisement\nThe forward’s low centre of gravity allows him to twist and turn faster, which is key to his success in one-on-one situations.\nIn this example, against Tottenham in May, Kudus dribbles inside the pitch and puts his body between Wilson Odobert and the ball, before quickly changing direction to get past Yves Bissouma and speeding past Archie Gray to create a crossing angle.\nKudus is a multiple-touch dribbler, which helps him keep the ball away from the opponents while waiting for the right moment to change direction or accelerate into space to find a passing angle.\nIn this example, from the 3-1 victory against Luton Town in May 2024, Kudus was in a one-versus-two situation, but he managed to dribble past Gabriel Osho and Alfie Doughty to assist George Earthy.\nHere, West Ham’s forward initially dribbles inside and his multiple-touch approach wrong-foots Osho.\nKudus’ left-footed touch (slide 1) moves the Luton defender inside the pitch, and he quickly rolls the ball in the other direction as Osho tries to balance himself, before accelerating into space to play the cutback with his right foot.\nKudus’ dribbling style translates well to a higher-possession side that faces deeper blocks because he is able to dribble in tight spaces by using his body smartly, taking multiple touches to change his direction and accelerating in short distances to create passing or shooting angles.\nThe last part is complemented by his ability to shoot or pass with his weaker foot, which makes him a threat regardless of his position or direction of dribble.\nIn bigger spaces and transitional situations, Kudus is a menace on and off the ball due to his pace and ball-carrying ability. “When I see space with the ball at my feet, I don’t care what’s in front of me. I have to go for it,” he told The Athletic last year.\nDespite Kudus’ unattractive underlying attacking numbers — which are partly influenced by West Ham’s style — his off-ball movement in and around the penalty box is smart and it’s an area of his game that can be harnessed in a better way.\nIn this example, against Brentford in November 2023, Kudus darts inside the penalty area and attacks the space behind Vitaly Janelt to offer Said Benrahma a crossing option towards the back post.\nThe Ghanaian only manages to hit the post with his thigh, but Jarrod Bowen follows the ball and scores on the rebound.\nIn another example, against Brighton & Hove Albion in April, Aaron Wan-Bissaka finds Bowen’s run behind the defence, while Mats Wieffer is keeping an eye on Kudus down the left side.\nKudus initially darts inside to offer Bowen a passing option…\n… but then changes his direction and attacks the back post to surprise Wieffer.\nHowever, Bowen plays the pass according to Kudus’ earlier movement, and the Ghanaian alters his direction once again to beat Wieffer who has dropped to defend the back post.\nKudus’ smart off-ball movement allows him to reach the ball first…\n… and he side-foots it into the bottom corner.\nThere is scope for developing Kudus’ attacking output in terms of goals and assists, which in theory should increase in a more attacking style of play.\nHis profile has the capacity to be a goalscoring and creative threat because, more often than not, it’s the final action that fails him.\nKudus’ ability in one-versus-one situations means that isolating him against a defender is one attacking option, but his dribbling is as beneficial in tight spaces against deeper blocks.\nAdvertisement\nMeanwhile, he is effective on the transition and has the potential to be a goalscoring threat inside the penalty area.\nKudus is primarily a dribbler, but he offers more than that. His profile is one that Tottenham don’t have in abundance and he will offer Frank more attacking solutions against different types of opponents."
    }
  ],
  "argos_summary": "Mohammed Kudus, Tottenham Hotspur's new £55 million signing, has been recognized for his exceptional talent since his youth in Ghana, where he trained at the Right to Dream academy. His journey through European football began with FC Nordsjaelland in Denmark, leading to a successful stint at Ajax, where he gained international acclaim during the 2022 World Cup. Known for his versatility and dribbling skills, Kudus is expected to enhance Tottenham's attacking options under new head coach Thomas Frank.",
  "argos_id": "KCYZH6QOB"
}