{
  "url": "https://www.dallasnews.com/sports/oklahoma-sooners/2025/08/12/okahoma-qb-john-mateer-denies-sports-gambling-allegations-surfaced-on-venmo/",
  "authorsByline": "Lia Assimakopoulos",
  "articleId": "7ada4f15475e4b3685861a5336b89995",
  "source": {
    "domain": "dallasnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "TX",
      "county": "Dallas County",
      "city": "Dallas",
      "coordinates": {
        "lat": 32.7762719,
        "lon": -96.7968559
      }
    }
  },
  "imageUrl": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/AS2SIUTL4NGKJFV5LUU6JTNPSU.jpg?auth=1a9863f644910db5f08c3507e86b8fa24a366fbe96aff80f2b9eb057800e0b78&quality=80&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:33:26.847000+00:00",
  "addDate": "2025-08-12T18:51:15.730487+00:00",
  "refreshDate": "2025-08-12T18:51:15.730488+00:00",
  "score": 1.0,
  "title": "Okahoma QB John Mateer denies sports gambling allegations surfaced on Venmo",
  "description": "Oklahoma QB John Mateer and the university commented on the sports gambling allegations.",
  "content": "Less than 24 hours after screenshots referencing “sports gambling” in his Venmo transaction history surfaced, Oklahoma quarterback John Mateer denied any wrongdoing.\n\nIn a statement he release on X Tuesday afternoon, Mateer confirmed that the Venmo transactions did in fact come from his account, but were merely a joke rather than a trail of any involvement in sports gambling.\n\n“The allegations that I once participated in sports gambling are false,” his statement read. “My previous Venmo descriptions did not accurately portray the transactions in question but were instead inside jokes between me and my friends.\n\n“I have never bet on sports. I understand the seriousness of the matter, but recognize that, taken out of context, those Venmo descriptions suggest otherwise. I can assure my teammates, coaches, and officials at the NCAA that I have not engaged in any sports gambling.”\n\nScreenshots posted online Monday night showed Mateer including “sports gambling” in two separate Venmo transactions to “Richard Roaten” on Nov. 20, 2022, while he was a freshman at Washington State.\n\nThe NCAA has a strict policy prohibiting athletes from betting on intercollegiate, amateur or professional athletics competition. Consequences for athletes caught sports betting include loss of eligibility.\n\nThe Division I Council did introduce a proposal in June that, if adopted in October, would change sports betting rules to permit student-athletes and staff members to bet on professional sports.\n\nBut that has not been approved yet, and one of the alleged Venmo transactions by Mateer referenced “UCLA vs. USC,” a college event.\n\nOklahoma athletics addressed the situation in a statement to The Dallas Morning News, saying, \"OU Athletics provides ongoing education to its student-athletes, coaches, and staff on matters related to sports gambling. The department utilizes ProhiBet, which is an industry-standard service offering comprehensive monitoring of sports gambling activities.\n\n“OU takes any allegations of gambling seriously and works closely with the NCAA in any situations of concern. OU Athletics is unaware of any NCAA investigation and has no reason to believe there is one pending.”\n\nMateer was one of the top transfer players this offseason, departing Washington State to join the Sooners. He passed for 3,139 yards and 29 touchdowns last season, which was his third with the Cougars.\n\nFind more college sports coverage from The Dallas Morning News here.",
  "medium": "Article",
  "links": [
    "https://www.dallasnews.com/sports/college-sports/",
    "https://www.dallasnews.com/sports/texas-longhorns/2025/08/11/ap-preseason-top-25-texas-ohio-state/",
    "https://www.dallasnews.com/sports/smu-mustangs/2025/08/11/four-texas-related-takeaways-from-the-first-ap-poll-of-2025/",
    "https://www.dallasnews.com/help/terms-of-service/",
    "https://x.com/John_Mateer4/status/1955330796211802235",
    "https://t.co/5PF0iOuAjJ",
    "https://www.dallasnews.com/help/privacy-policy",
    "https://www.dallasnews.com/sports/oklahoma-sooners/2025/08/11/pick-six-brent-venables-other-college-coaches-on-the-hot-seat-entering-2025/",
    "https://twitter.com/Lassimak",
    "https://www.dallasnews.com/topic/oklahoma-sooners/",
    "https://twitter.com/John_Mateer4/status/1955330796211802235?ref_src=twsrc%5Etfw"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "sports gambling",
      "weight": 0.12940076
    },
    {
      "name": "sports gambling allegations",
      "weight": 0.12541331
    },
    {
      "name": "sports gambling activities",
      "weight": 0.12129278
    },
    {
      "name": "professional sports",
      "weight": 0.10835424
    },
    {
      "name": "sports betting rules",
      "weight": 0.10659125
    },
    {
      "name": "sports",
      "weight": 0.106343485
    },
    {
      "name": "more college sports coverage",
      "weight": 0.10044251
    },
    {
      "name": "gambling",
      "weight": 0.08676802
    },
    {
      "name": "John Mateer",
      "weight": 0.08585932
    },
    {
      "name": "Oklahoma quarterback John Mateer",
      "weight": 0.08558398
    }
  ],
  "topics": [
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9873046875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.91943359375
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.54345703125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.5419921875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.31494140625
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.302734375
    }
  ],
  "sentiment": {
    "positive": 0.06303233,
    "negative": 0.6381601,
    "neutral": 0.29880765
  },
  "summary": "Oklahoma quarterback John Mateer has denied allegations of involvement in sports gambling, stating that the transactions were merely inside jokes and were not true. The NCAA has a strict policy against athletes betting on intercollegiate, amateur or professional athletics, resulting in loss of eligibility. The Division I Council proposed a proposal in June that would change sports betting rules to permit student-athletes and staff to bet on professional sports, but that hasn't been approved yet.",
  "shortSummary": "Oklahoma quarterback John Mateer denied involvement in sports gambling allegations surfaced on Venmo, attributing the claims to a joke, while the NCAA continues to monitor such allegations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4f89ceae392d463faa8cd4b522b608ce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dallasnews.com/topic/oklahoma-sooners/",
      "text": "Mateer called the allegations “false” and said the Venmo transactions were an inside joke with friends.\nTeams from Texas and Oklahoma made up a fifth of the teams in this year’s AP preseason poll.\nThe clock is ticking for Venables, who is heading into his fourth season in Norman.\nTexas received 25 first-place votes to give the SEC the preseason No. 1 team for a record fifth straight year.\nPlenty of college coaches, like Texas Tech’s Joey McGuire, have significant coaching roots in the high school football world.\nPlus, the list featured players from North Texas, Oklahoma and Texas Tech, among other area teams.\nSMU, Texas A&M and Texas Tech also cracked the preseason top 25.\nThe executive order signed by President Donald Trump is an attempt to create clearer national standards for the NCAA’s name, image and likeness program.\nThe Athletic took at crack at applying valuations for how much Power Four football programs would sell for.\nIf anyone knows about the pressures of winning in Norman, it’s Mayfield.\nThe Longhorns fell in an overtime thriller to Georgia in last season’s SEC Championship.\nPlenty of questions remain as coaches wonder what’s next for the College Football Playoff, NIL and the SEC schedule.\nThe Big Ten’s recent success has put a dent in the SEC’s reputation as the nation’s dominant conference. SEC coaches, players and Commissioner Greg Sankey have no question they’re still No. 1.\nBrent Venables is hoping the former Little Elm star can help lift the program back to its lofty standards.\nThe Denton Guyer product Arnold struggled through a difficult year with the Sooners, losing his starting job and entering the transfer portal after the season.\nTexas A&M and Oklahoma led the way with eight players taken each.\nThe standout lefty was selected by the Los Angeles Angels with the 379th overall pick in the 13th round of the draft.\nSEC Commissioner Greg Sankey says the conferences have not agreed on a CFP format beyond this season.\nFrom Texas to the Cleveland Browns, former top prospects have made their mark at the college and professional levels.\nCarmichael, a junior, was named a first-team All-American in his final season with the Oklahoma Sooners this spring."
    },
    {
      "url": "https://www.dallasnews.com/sports/texas-longhorns/2025/08/11/ap-preseason-top-25-texas-ohio-state/",
      "text": "For the first time, Texas will open a college football season ranked No. 1 in The Associated Press Top 25.\nThe Longhorns hardly have a mandate in the poll released Monday: They edged out Penn State by just five points in the closest preseason vote since 1998.\nTexas received 25 first-place votes and 1,552 points to give the Southeastern Conference the preseason No. 1 team for a record fifth straight year. The Nittany Lions got 23 first-place votes and 1,547 points for their highest preseason ranking since they were No. 1 to open the 1997 season.\nThe Longhorns face a major test right away. Their Aug. 30 opener at defending champion and third-ranked Ohio State is a rematch of last season’s College Football Playoff semifinal, a 28-14 Buckeyes win in the Cotton Bowl.\nThe Buckeyes received 11 first-place votes from the panel of 65 media members who cover college football. No. 4 Clemson got four first-place votes and No. 5 Georgia got one.\nNotre Dame, Oregon (which got the final first-place vote), Alabama, LSU and Miami round out the top 10.\nThe SEC leads all conferences with 10 teams in the preseason Top 25, most ever by a conference and one more than a year ago. The SEC has four teams in the top 10 for the second straight year.\nThe Big Ten, which has won the last two national championships, has two of the top three teams in the poll for the third straight year and six in the Top 25 for the third year in a row.\nFour Big 12 teams are ranked, with defending conference champion Arizona State the highest at No. 11. The Atlantic Coast Conference has three, led by Clemson.\nTop-ranked Texas\n“Arch Mania” is at a fever pitch in Texas with Arch Manning now the undisputed starting quarterback.\nThe Longhorns have been on an upward trajectory since they were 5-7 in 2021, Steve Sarkisian’s first season. They have won 25 of their last 30 games and reached two straight CFP semifinals. Last year, they were ranked No. 1 four of five weeks from mid-September to mid-October, and they reached the SEC championship game in their first season in the conference.\n“But this is a new year, new faces, new team, and obviously expectations are high for our program,” Sarkisian said at SEC media days. “I’m not naive to that. I don’t put my head in the sand, and expectations are very high. But I also say we’re the University of Texas, and the standard is the standard here, and that’s competing for championships year in and year out.”\nTwelve Texas players were taken in the NFL draft, including three-first-round picks, but elite recruiting and additions from the transfer portal should alleviate concerns about losses on the offensive line and at receiver. The defense brings back plenty of talent.\nStill, Texas received just 38.5% of the first-place votes (25 of 65), the smallest share for a No. 1 team in the preseason poll since Georgia got 33.9% (22 of 65) in 2008.\nThe Longhorns have ended a season No. 1 in the AP poll three times (1963, 1969, 2005) but until now had never started a season higher than No. 2 (1962, 1965, 1970, 2005, 2009).\nBig Ten lurking\nThe second-ranked Nittany Lions are not only six points from being No. 1, they are 75 points ahead of the Buckeyes in what might be considered a slight to the national champs.\nPenn State will have Drew Allar back under center for what many consider a light schedule ahead of a late September visit from Oregon before a Nov. 1 showdown at Ohio State.\nThe Buckeyes, in the preseason top five for the ninth straight year and 12th of the last 13, will have a new look with only five starters back on offense and three on defense.\n“This team has its own identity,” coach Ryan Day said. “It wants to have its own identity, but it also wants to be the first Ohio State team to win back-to-back national championships.”\nThe opener against Texas will give the Buckeyes a good measure of themselves. Julian Sayin or Lincoln Kienholz will be the third new starting quarterback in three years. Whoever gets the job will throw to one of the nation’s top players in Jeremiah Smith.\nDay will also have another chance to figure out archrival and preseason No. 14 Michigan, which has beaten the Buckeyes four straight years.\nPoll nuggets\n— Texas will try to become the 12th team to start and finish No. 1 since the AP preseason poll debuted in 1950. The last team to do it was Alabama in 2017.\n— Notre Dame is in the preseason top 10 for the third time in four years. The Fighting Irish will have a new quarterback, CJ Carr or Kenny Minchey. The two played a combined eight snaps last season as Notre Dame went all the way to the CFP title game won by Ohio State.\n— With Boise State at No. 25, all 12 teams in the 2024 College Football Playoff are ranked in the preseason. The Mountain West’s Broncos are the first team from a Group of Five conference to crack the preseason Top 25 since Tulane was No. 24 in 2023.\n— No. 16 SMU, which returns quarterback Kevin Jennings from its CFP team, is in the preseason Top 25 for the first time in 40 years. The 1985 team was No. 3 and finished 6-5 and unranked.\nAP preseason top 25\n1. Texas, 1552 (25)\n2. Penn State, 1547 (23)\n3. Ohio State, 1472 (11)\n4. Clemson, 1398 (4)\n5. Georgia, 1331 (1)\n6. Notre Dame, 1325\n7. Oregon, 1236 (1)\n8. Alabama, 1179\n9. LSU, 1174\n10. Miami, 889\n11. Arizona State, 791\n12. Illinois, 713\n13. South Carolina, 667\n14. Michigan, 662\n15. Florida, 626\n16. SMU, 565\n17. Kansas State, 512\n18. Oklahoma, 463\n19. Texas A&M, 434\n20. Indiana, 423\n21. Ole Miss, 370\n22. Iowa State, 309\n23. Texas Tech, 274\n24. Tennessee, 192\n25. Boise State, 191\nOthers receiving votes: BYU 156, Utah 144, Baylor 132, Louisville 90, Southern Cal 64, Georgia Tech 63, Missouri 33, Tulane 23, Nebraska 23, UNLV 21, Toledo 13, Auburn 10, James Madison 9, Memphis 9, Florida St. 8, Duke 6, Liberty 5, Navy 5, Iowa 5, TCU 4, Pittsburgh 3, Army 2, Colorado 1, Louisiana-Lafayette 1.\nFind more college sports coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/smu-mustangs/2025/08/11/four-texas-related-takeaways-from-the-first-ap-poll-of-2025/",
      "text": "The AP released its annual preseason football poll Monday, giving a first glimpse into who its voters expect will be this year’s top performers in college football.\nTexas (No. 1), SMU (No. 16), Oklahoma (No. 18), Texas A&M (No. 19) and Texas Tech (No. 23) earned spots in the top 25, while Baylor and TCU also received votes.\nThe first regular-season poll won’t be released until Sept. 2. Here are five takeaways from the initial rankings this year:\nTexas ranked preseason No. 1 for first time\nFor the first time, Texas will open a college football season ranked No. 1 in the nation, according to the AP poll.\nThe Longhorns edged out Penn State by just five points, the closest preseason vote since 1998.\nExpectations are high for the Longhorns, who have returned to prominence in the last few seasons, winning 25 of their past 30 games and reaching two straight College Football Playoff semifinals.\nWith Arch Manning as the undisputed starter, many wonder if this may be the year Texas finally returns to — or even wins — the national championship.\nTexas will face a huge test early, facing defending national champion Ohio State in Week 1 in a rematch of last season’s CFP semifinal where the Buckeyes beat the Longhorns 28-14 in the Cotton Bowl.\nWith Ohio State ranked No. 3 in the preseason poll, expect some shake up of the rankings in the first regular-season poll.\nSMU ends 40-year drought\nSMU had not appeared in an AP preseason poll since 1985 — until now.\nThe Mustangs earned the No. 16 ranking in the nation entering this season — the second-highest in Texas and third-highest in the ACC.\nComing off an unprecedented run to the CFPlayoff, SMU burst onto the national scene last year. While their underwhelming performance against Penn State in their CFP first-round game was quite the disappointment, the Mustangs maintained some respect after what they accomplished in 2024. SMU went undefeated in league play before reaching the ACC title game in their first year in the conference.\nSMU also brings back quarterback Kevin Jennings after a breakout season and star tight end RJ Maryland, who suffered a season-ending ACL tear in October of last year.\nWith nonconference matchups against Baylor and TCU — and regular-season matchups against Clemson, Miami and Louisville — SMU will be able to earn résumé-building wins.\nTexas Tech’s big spend captures nation’s attention\nIt’s championship or bust for the Red Raiders this year, who reportedly spent $12 million to bring in 21 new transfers and $25 million to construct their roster.\nThat earned Texas Tech its first AP poll spot since 2018 and its highest ranking since 2013, as the Red Raiders slotted in at No. 23.\nTech hasn’t been ranked in a preseason poll since 2008, and it hasn’t been ranked for more than one week in a season since 2013.\nBut last year’s CFP selection process showed the Big 12 is wide open, and Tech has certainly established itself as one of the contenders, even after an 8-5 finish last season.\nBig 12 remains an enigma\nThe Big 12 is arguably the most wide open conference in America, and the AP preseason poll reflected that.\nNo Big 12 team earned a spot in the top 10, but Arizona State (No. 11), Kansas State (No. 17), Iowa State (No. 22) and Texas Tech (No. 23) will begin the season ranked. BYU, Utah and Baylor were the first three teams out, while TCU and Colorado also received votes.\nThis AP poll reflects last season’s final standings where seven teams were no more than a game out of reaching the Big 12 title game.\nBut parity in the conference wasn’t enough to earn the Big 12 more than a single bid to the College Football Playoff. Could this year be different?\nOn X/Twitter: @Lassimak\nFind more college sports coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/oklahoma-sooners/2025/08/11/pick-six-brent-venables-other-college-coaches-on-the-hot-seat-entering-2025/",
      "text": "With rising expectations in competitive conferences, money flowing directly to players and unforgiving fan bases, the pressure has never been higher across college football.\nHere are six coaches who could very well be on the hot seat — from warm to scorching — entering the 2025 season:\nBrent Venables, Oklahoma\nThe clock is ticking for Brent Venables, who heads into his fourth season in Norman yet to meet the expectations that come with this storied program. His sole winning season is sandwiched between 6-7 records in 2022 and 2024. He’s yet to lead the program to a bowl win, going 0-3, and the Cheez-It, Alamo and Armed Forces bowls aren’t where Sooners fans want to end the year.\nOklahoma finished with a 2-6 conference record in its inaugural season in the SEC a year ago while fellow newbie and rival Texas topped the conference. Entering year two in the SEC, Venables could use a standout year.\nHugh Freeze, Auburn\nHugh Freeze is feeling the heat after opening with two seven-loss seasons. Recruiting efforts have been admirable, but in-game decisions in high-pressure moments have raised concerns. Auburn hasn’t hesitated to part ways with coaches in recent years, and Freeze could be next on the chopping block if he doesn’t produce fast results. Getting Georgia and Alabama at home might help ... right?\nSam Pittman, Arkansas\nWhat to do with Sam Pittman? He is a folksy, charming guy and he has three winning seasons out of five for the Razorbacks that included bowl wins. But he is 30-31 overall and Arkansas has not emerged as any kind of a consistent threat in the SEC.\nExpectations were high for Pittman after a 9-4 season in 2021 but the Hogs look like a mostly middling program. The schedule this year includes visits to Ole Miss, Tennessee and, on back-to-back weekends, LSU and Texas.\nBilly Napier, Florida\nBilly Napier’s tenure in Florida started with 6-7 and 5-7 records before last year’s 8-5 finish that included a 4-4 mark in the SEC. Does gradual improvement meet the high standards of a historically dominant program?\nA dominant season by quarterback DJ Lagway and a few marquee wins could help Napier’s job security. The Gators won’t have to wait long to see how they stack up: A four-game stretch that starts in Week 3 features LSU, Miami, Texas and Texas A&M, with only the Longhorns visiting the Swamp of the group.\nLuke Fickell, Wisconsin\nAfter two full seasons at the helm, Luke Fickell could use a breakout season. Wisconsin went 5-7 last year after a 7-6 finish in his first full season, easily an afterthought in a Big Ten Conference that grabbed two national titles. Inconsistent quarterback play, injuries and a difficult schedule have troubled the Badgers.\nFickell’s strong run at Cincinnati seems a long time ago now. Up next is a schedule that includes visits to Alabama, Michigan and Oregon. At least Ohio State is at Camp Randall Stadium.\nLincoln Riley, USC\nLincoln Riley’s first year with the Trojans felt somewhat magical for a while, an 11-3 effort stymied by a pair of losses to Utah and one-point bowl loss to Tulane. What’s followed has warmed things up for Riley: an 8-5 record in 2023 and a 7-6 mark last year. Much of Riley’s fate could be in the hands of quarterback Jayden Maiava but the Trojans would love to see new assistant and former NFL veteran Rob Ryan field a shutdown defense.\nHonorable mention\n- Alabama’s Kalen DeBoer saw his team put up a 9-4 mark in his first season in Tuscaloosa; the Crimson Tide will need to be better than that — as in, make the College Football Playoff.\n- Oklahoma State went 12-2 in 2021 but Mike Gundy’s teams have been inconsistent for a while now and last year’s 3-9 collapse raised questions about the veteran coach.\n- Mike Norvell has had two good seasons sandwiched by two bad ones, including last year’s 2-10 mark. Surely everyone in Tallahassee heard former coach Jimbo Fisher tell a podcast last week he was ready to come back to the right situation in college football?\nFind more college sports coverage from The Dallas Morning News here."
    }
  ],
  "argos_summary": "Oklahoma quarterback John Mateer denied allegations of sports gambling after screenshots of his Venmo transactions surfaced, stating they were inside jokes with friends. He emphasized that he has never bet on sports and understands the seriousness of the matter. The NCAA prohibits athletes from betting on sports, and while a proposal to change these rules is under consideration, it has not yet been approved.",
  "argos_id": "KI6DHD55F"
}