{
  "url": "https://www.benzinga.com/news/politics/25/08/47051678/muriel-bowser-warned-5-years-ago-trumps-police-takeover-would-be-complete-disaster-now-says-shell-work-every-day-to-prevent-it",
  "authorsByline": "Snigdha Gairola",
  "articleId": "4cad6c8df4f84dd49752a7e11f94bc59",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/12/Washington--Dc--Usa---12-June-2021-Murie.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T03:28:22-04:00",
  "addDate": "2025-08-12T07:38:05.827668+00:00",
  "refreshDate": "2025-08-12T07:38:05.827672+00:00",
  "score": 1.0,
  "title": "Muriel Bowser Warned 5 Years Ago Trump's Police Takeover Would Be 'Complete Disaster,' Now Says She'll Work 'Every Day' To Prevent It",
  "description": "Washington Mayor Muriel Bowser denies comparisons to 2020 protests, emphasizing community trust in police as top priority amid potential federalization.",
  "content": "Washington Mayor Muriel Bowser pushed back Monday against comparisons to 2020's racial justice protests, insisting her administration is prepared to maintain control and protect residents.\n\nBowser Says True Disaster Is Losing Community Trust In Police\n\nSpeaking at a press conference, Bowser was asked whether the current situation could mirror the tense standoff five years ago, when she warned that President Donald Trump's potential takeover of the Metropolitan Police would be \"a complete disaster.\"\n\n\"I'm going to work every day to make sure it's not a complete disaster,\" Bowser said. She credited Police Chief Pamela Smith's \"leadership and her expertise\" in navigating both local and federal law enforcement coordination.\n\nBowser said a breakdown in trust between police and residents would be the real catastrophe. \"What could be a disaster is if we lose communities who won't call the police,\" she said.\n\n\"It would be a disaster if people who aren't committing crimes are antagonized into committing crimes.\"\n\nThe mayor acknowledged she may use curfews, request emergency legislation, and seek additional congressional funding if crime surges. She emphasized that any National Guard deployment must be strategic, ensuring resources aren't wasted.\n\nSee Also: JD Vance Wants Red States To Redistrict Because California Has ‘Way More' House Seats Than It Should Because Of Illegal Aliens\n\nTrump has declared a \"crime emergency\" in Washington, D.C., invoking a rarely used provision of the Home Rule Act to federalize the Metropolitan Police Department (MPD), as reported by CNN on Monday.\n\nThe move, the first of its kind under Section 740, has sparked confusion among city officials, as Mayor Bowser and Police Chief Smith learned of the decision during Trump's live announcement.\n\nWhile Trump has appointed Attorney General Pam Bondi to oversee the order's implementation, Bowser insists the MPD's organizational structure remains unchanged.\n\nThe Home Rule Act allows presidential control for 48 hours, extendable with congressional notification, and beyond 30 days with legislation.\n\nExperts say the unprecedented action raises unresolved questions over command, strategy, and how federal agents, many untrained in community policing, will integrate with local officers.\n\nOn Monday, District officials argue that the portrayal of a public safety crisis is exaggerated. Bowser earlier pointed to a 26% drop in violent crime year-to-date and overall crime rates lower than last year. She also noted that city police were not consulted on the initial federal deployment plan.\n\nFollowing an early August attack on a federal staffer, the White House announced a weeklong surge of federal officers and signaled possible National Guard involvement.\n\nBy the weekend, the FBI had assigned agents to overnight patrols. Soon after, Trump issued a homelessness directive and previewed Monday's briefing.\n\nLegal uncertainty surrounds any effort to conduct mass evictions citywide. While the president has authority over federal property and the D.C. National Guard, broader control measures would challenge the boundaries set by the District's Home Rule Act.\n• Mark Cuban Says This Is How ‘Trump World' Is Beating The Democrats With Algorithms: ‘Other Side Has No Clue'\n\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/news/politics/25/08/47022890/trump-says-washingtons-homeless-should-be-prepared-to-move-out-immediately-there-will-be-no-mr-nice-guy",
    "https://www.benzinga.com/news/politics/25/08/47023901/jd-vance-wants-red-states-to-redistrict-because-california-has-way-more-house-seats-than-it-should-because-of-illegal-aliens",
    "https://www.benzinga.com/news/politics/25/08/47024183/trump-sends-fbi-agents-on-overnight-patrols-in-washington-high-traffic-areas-hotspots-to-be-in-focus",
    "https://www.benzinga.com/news/politics/25/08/47023383/mark-cuban-says-this-is-how-trump-world-is-beating-the-democrats-with-algorithms-other-side-has-no-clue",
    "https://edition.cnn.com/2025/08/11/politics/trump-federalized-dc-police-now-what"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "federal agents",
      "weight": 0.075421244
    },
    {
      "name": "Mayor Bowser",
      "weight": 0.07513301
    },
    {
      "name": "Washington Mayor Muriel Bowser",
      "weight": 0.07386311
    },
    {
      "name": "Muriel Bowser",
      "weight": 0.07359903
    },
    {
      "name": "federal officers",
      "weight": 0.07335332
    },
    {
      "name": "Bowser",
      "weight": 0.07117213
    },
    {
      "name": "federal property",
      "weight": 0.07090993
    },
    {
      "name": "Trump World",
      "weight": 0.06872047
    },
    {
      "name": "Donald Trump",
      "weight": 0.06810104
    },
    {
      "name": "Trump",
      "weight": 0.06638616
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98095703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8583984375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.814453125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.74560546875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.6708984375
    },
    {
      "name": "/News/Local News",
      "score": 0.63818359375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.3837890625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.35693359375
    }
  ],
  "sentiment": {
    "positive": 0.036026806,
    "negative": 0.8135853,
    "neutral": 0.15038796
  },
  "summary": "Washington Mayor Muriel Bowser has defended her administration against comparisons to the potential takeover of the Metropolitan Police by President Donald Trump five years ago, stating that her administration is prepared to maintain control and protect residents. She also warned that a breakdown in trust between police and residents could be a real catastrophe. Bowser suggested that she may use curfews, request emergency legislation, and seek additional congressional funding if crime surges. The move, invoking a rarely used provision of the Home Rule Act, has caused confusion among city officials and raised questions over command, strategy, and how federal agents will integrate with local officers.",
  "shortSummary": "Washington Mayor Muriel Bowser vows to prevent President Donald Trump's potential takeover of the Metropolitan Police, citing community trust loss and potential National Guard intervention.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "98ccc2043d0841d6a7fb7a34a69a541e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/news/politics/25/08/47023901/jd-vance-wants-red-states-to-redistrict-because-california-has-way-more-house-seats-than-it-should-because-of-illegal-aliens",
      "text": "Vice President JD Vance is calling on Republicans to match Democrats' aggressive redistricting strategies, arguing that California unfairly benefits from the presence of undocumented immigrants.\nVance Claims Census Rules Give California Extra Political Power\nIn an interview with Fox News Sunday Morning Futures with Maria Bartiromo, Vance claimed California has \"way more House seats than it should\" because the U.S. Census counts all residents, including undocumented immigrants, when determining congressional representation.\nVice President Urges GOP To Match Democrats’ Redistricting Tactics\n\"So California has way more House seats than it should because they have such a high population of illegal aliens,\" Vance said in a preview clip posted by Fox News on X.\n\"They get rewarded for welcoming illegal aliens into their state, giving them federal benefits … and then taxpayers in Ohio and Indiana have fewer congressional representatives because of what California has allowed to happen. That's ridiculously unfair.\"\nVance argued the only way to \"fight back\" is for Republican-controlled states to redraw congressional maps \"as aggressively as these hard-blue states have done.\"\nAccording to the Public Policy Institute of California, the Golden State is home to an estimated 2.35 to 2.6 million undocumented immigrants, roughly a quarter of the U.S. total, making up over 6% of the state's population. Most are from Latin America, with 71% Mexican-born.\nAbout 1.75 million undocumented immigrants are part of California's workforce, nearly one in ten workers, especially in agriculture, construction, and manufacturing. Many live in mixed-status families; over 12% of K–12 students have an undocumented parent, and more than 200,000 DACA recipients reside in the state.\nDemocrats Hit Back At Texas GOP With Plan To Flip Five Republican Seats\nVance’s statement came after Texas Republicans had proposed new congressional maps adding five strongly pro-Trump districts to protect their 219-212 House majority before the 2026 midterms.\nThe plan, filed by State Rep. Todd Hunter (R) during a special legislative session, came amid a broader national redistricting fight. In response, Texas Democrats left the state to block a quorum and delay the GOP's efforts, halting legislative progress but risking fines and arrest.\nFollowing this, California Democrats also considered a sweeping redistricting proposal aimed at flipping five Republican-held House seats and boosting their congressional edge from 43 to 48 out of 52 seats.\nThe draft map, positioned as a direct counter to Texas Republicans' aggressive redistricting, would dilute GOP voting power in districts held by Reps. Ken Calvert (R-Calif.), Rep. Darrell Issa (R-Calif.), Rep. Kevin Kiley (R-Calif.), Rep. David Valadao (R-Calif.), and Rep. Doug LaMalfa (R-Calif.), reported by the Associated Press.\nThis development could also strengthen Democratic margins in battleground areas like Orange County, San Diego County, and the Central Valley.\nCalifornia Governor Gavin Newsom (D-Calif.) backed the plan and has pledged a special election in early November to let voters decide, though he said he'd pause if Texas halts its efforts. The proposal could face resistance from voters wary of reversing the state's move toward independent redistricting.\nVance Predicts Indictments After Gabbard's Explosive Claims On Intel Abuse\nOn Sunday, Vance also predicted a wave of indictments following Donald Trump's treason allegations against Barack Obama, citing documents from Director of National Intelligence Tulsi Gabbard that accuse Obama-era officials of linking Trump to Russian interference and pushing Hillary Clinton campaign talking points.\nVance condemned the alleged misuse of intelligence agencies, calling it \"sick and disgusting,\" and insisted indictments should follow clear violations of the law.\nRead Next:\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nPhoto Courtesy: Phil Mistry on Shutterstock.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/politics/25/08/47022890/trump-says-washingtons-homeless-should-be-prepared-to-move-out-immediately-there-will-be-no-mr-nice-guy",
      "text": "President Donald Trump on Sunday pledged to remove homeless people from Washington, D.C., and put criminals \"in jail,\" escalating a public safety push that city leaders say overstates current crime levels.\nWhat Happened: \"The Homeless have to move out, IMMEDIATELY,\" he wrote on Truth Social. \"We will give you places to stay, but FAR from the Capital. The Criminals, you don't have to move out. We're going to put you in jail where you belong.\"\nHe said that he will hold a Monday press conference to \"stop violent crime in Washington, D.C.\"\nDetails of the plan remain unclear. A U.S. official told Reuters the administration is preparing to deploy hundreds of National Guard troops to the capital, though no final decision has been made and roles are still being determined. Unlike states, where governors activate Guard units, the D.C. National Guard answers to the president.\nWashington Mayor Muriel Bowser rejected the premise of a surge in crime, noting D.C. police data show violent crime down 26% and overall crime down about 7% so far this year compared with 2024. \"We are not experiencing a crime spike,\" she said to MSNBC on Sunday.\nWhy It Matters: The White House last week increased federal presence in the city after a brutal assault on a young administration staffer that angered Trump. By Saturday, officials told Reuters that 450 federal officers were on D.C. streets. On Sunday, Trump posted his homelessness directive and previewed Monday's briefing.\nLegal questions loom. The White House has not explained what authority it would use to evict people citywide. The federal government directly controls federal lands and buildings in D.C. Prior Guard deployments in the District have included the response to the Jan. 6, 2021, Capitol attack.\nTrump has been clear on his public-safety agenda in the capital, including an executive order in March this year directing the cleanup of homeless encampments on federal land and earlier talk of a federal takeover of D.C. governance. Those moves frame Sunday's vow and the potential Guard deployment now under consideration.\nPhoto: noamgalai from Shutterstock\nRead Next:\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/politics/25/08/47023383/mark-cuban-says-this-is-how-trump-world-is-beating-the-democrats-with-algorithms-other-side-has-no-clue",
      "text": "Mark Cuban said Sunday that President Donald Trump's allies are outmaneuvering Democrats online because they better understand how engagement algorithms work.\nWhat Happened: \"This is how the trump world is beating Dems right now. One side understands algorithms, the other has no clue,\" he wrote on X, linking to a Substack analysis.\nCuban pointed to \"Silent Coup: How Trump's Allies Are Gaming Algorithms To Seize Your Feed,\" a piece by behavioral scientist Caroline Orr Bueno. The essay describes a \"Feedback Loop Coup\" in which operatives stage and amplify outrage to trigger platform ranking systems, pushing a narrative into millions of feeds without breaking rules.\nIn plain terms, Orr Bueno’s research suggests that coordinated posts generate rapid likes, shares and comments. The algorithm reads that velocity as importance. News coverage then recycles and further boosts the same storyline.\nThe article cites \"Stop the Steal\" as a clear example and pairs it with a related tactic, labelled \"Reverse Algorithmic Capture,\" which uses political pressure to reshape moderation rules over time.\nSee Also: Hacker Exposes Flaw In Automaker’s Portal That Could Let Thieves Unlock Cars Remotely\nWhy It Matters: Cuban's warning tracks with his recent critiques of ad-driven recommendation systems and his calls to rethink algorithm design in AI and social platforms. He has urged Trump advisers to restrict ads in AI models and previously argued that \"algorithms drive everything\" in modern politics.\nRepublicans often counter that platforms tilt against conservatives and say any organized effort is a reaction to biased gatekeeping. Surveys by Pew Research from April 2024 show most Republicans and many Democrats believe social media platforms censor political views, highlighting how contested the ground rules have become.\nDemocrats aren't absent from the meme wars. According to a report by The Washington Post, analysts note they have mounted reactive campaigns such as \"Dark Brandon,\" a pro-Biden remix that rode the same engagement dynamics Cuban is highlighting, albeit on a smaller scale.\nPhoto Courtesy: Kathy Hutchins on Shutterstock.com\nRead Next:\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/politics/25/08/47024183/trump-sends-fbi-agents-on-overnight-patrols-in-washington-high-traffic-areas-hotspots-to-be-in-focus",
      "text": "FBI agents will be sent on night patrols in the nation's capital after President Donald Trump threatened to federalize the District of Columbia.\nWhat Happened: The Washington Post reported the bureau has begun assigning close to 120 agents to overnight shifts to help D.C. authorities deter carjackings and violent crime.\nAn FBI spokesperson told The New York Times that the bureau \"is involved in the increased federal law enforcement presence in Washington, D.C.\" and referred questions to the White House.\nA White House official told NewsNation’s Kellie Meyer that 450 federal officers would be stationed \"in high-traffic areas and other known hotspots across Washington, D.C.\"\nIn a statement obtained by CBS, press secretary Karoline Leavitt said, \"Washington, D.C., is an amazing city, but it has been plagued by violent crime for far too long. President Trump has directed an increased presence of federal law enforcement to protect innocent citizens. Starting tonight, there will be no safe harbor for violent criminals in D.C.\"\nWhy It Matters: District leaders counter that the crisis picture is overstated. Mayor Muriel Bowser says violent crime is down 26% year to date and overall crime is lower than a year ago, and city police were not consulted on the initial deployment plan, according to the Post.\nAfter an attack on a federal staffer in early August, the White House announced a weeklong surge of federal officers and flagged possible Guard involvement. By the weekend, the FBI began assigning agents to overnight patrols. Trump then posted his homelessness directive and previewed Monday's briefing.\nLegal questions remain about any move to evict people citywide. While the president controls federal property and the D.C. National Guard, broader takeovers would test limits under the District's Home Rule Act.\nPhoto Courtesy: Kristi Blokhin on Shutterstock.com\nRead Next:\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://edition.cnn.com/2025/08/11/politics/trump-federalized-dc-police-now-what",
      "text": "The Metropolitan Police along with federal agencies tasked with helping curb crime in the nation’s capital are scrambling to figure out roles and strategy following President Donald Trump’s decision to declare a crime emergency and federalize DC’s police force, multiple sources told CNN.\n“We’re going to restore the city back to the gleaming capital that everybody wants it to be,” Trump said at the White House on Monday. “It’s going to be something very special.”\nBut little communication seems to have been done before Trump’s news conference – the Washington, DC, mayor and police chief hadn’t been told about the takeover until they watched Trump say it live. It’s led to confusion over who now leads the MPD, how their policing strategy will change and in what ways federal agents – many who aren’t trained for community policing – are going to interact with local officers.\nDuring a separate news conference, Mayor Muriel Bowser said she was trying to set up a meeting with Attorney General Pam Bondi, who Trump said would be overseeing the implementation of his order. She also maintained that Chief of Police Pamela Smith would still run the department and report to Bowser up through the deputy mayor.\n“Nothing about our organizational chart has changed,” Bowser said. “And nothing in the executive order would indicate otherwise.”\nThe Home Rule Act of 1973 allows the president to take control of the city’s police for 48 hours if he “determines that special conditions of an emergency nature exist,” which requires the department’s use for federal purposes. The president can retain control of the department for a longer period if he notifies the chairs and ranking members of the congressional committees that handle legislative matters pertaining to DC, which Trump indicated he intends to do. Any request of control over the city’s police department for more than 30 days must be passed into law.\nThis is the first time a president has used Section 740 of the Home Rule Act to federalize the DC metro police, said Dr. Heidi Bonner, chair of the Department of Criminal Justice and Criminology at East Carolina University.\n“It’s definitely difficult to say what that means,” she said, including it being “an open question” as to who’s in charge.\n“Is the chief of police still in charge of the department once it’s become federalized?” Bonner asked. “And of course, all this is mixed up in the unique nature of DC as a district and not a state. There are different authorities – the president acts as the governor for all intents and purposes when it comes from the National Guard.”\nWhen asked about the confusion over how MPD will now be run, the Justice Department highlighted portions of Trump’s order that state, “the Mayor shall provide such services of the Metropolitan Police force as the Attorney General may deem necessary and appropriate.”\nIt remains unclear, however, how such an arrangement will play out practically.\nThe order also says the attorney general will also update Trump if further action might be required from the president.\nBowser seemed resigned to the fact that Trump’s decision would go into effect given the city’s status. Prominent Democrats called Bowser and her office Monday to offer support but indicated there was little they could do to stop the takeover.\n“I don’t want to minimize what was said and I don’t want to minimize the intrusion on our autonomy,” Bowser said. The mayor also called the move “unsettling and unprecedented” and advocated for DC statehood to prevent such unilateral action from the president.\nPolice Chief Smith said she was scheduled to meet with federal liaisons following the news conference for the first time regarding Trump’s announcement in order to start to “create an operational plan.”\nDC National Guard and FBI agents on the ground\nTrump activated 800 soldiers from the DC National Guard, with up to 200 members being assigned to supporting law enforcement, according to the Defense Department.\n“Duties for those personnel include administrative and logistical roles, as well as providing a physical presence in support of law enforcement,” the DOD said.\nThe unilateral move contrasts heavily with how Trump blamed others, including Bowser and then-House Speaker Nancy Pelosi for not deploying the National Guard on January 6, 2021, before Trump-supporters broke into the US Capitol.\nOver the weekend, Trump had already moved officers from several federal agencies to begin assisting MPD in policing certain areas in DC, including as many as 130 FBI agents to patrol with DC police as part of the increased federal presence, according to two people familiar with the deployment.\nIt’s not typical for FBI agents to patrol with local police, and agents are often not trained for community policing and operate under different policies – including for use of deadly force – that could create issues on the ground, two federal law enforcement sources told CNN. Because of this, pairing federal agents with officers to patrol DC could present a situation where each member of the team must respond differently to a potential threat based on the respective agency’s policy.\nIn the FBI, the plan to deploy agents to patrol the streets of Washington has been met with concern over strained resources and the safety of agents who are not trained in routine police patrols, according to multiple sources.\nTaking agents away from their daily investigations to patrol DC would risk not adequately addressing other serious crimes like terrorism, foreign counterintelligence threats, cyber intrusions and the nation’s fentanyl epidemic, sources said.\n“This isn’t hard: If we’re doing (policing) we’re not covering down on those other threats,” said one source.\nFederal agents are also typically only minimally trained in conducting vehicle stops, which remains one of the most dangerous aspects of a police officer’s job. Unlike routine police encounters with suspects, which may only involve one or two officers, when agencies like the FBI conduct an arrest, they typically plan out the operation methodically in advance and execute it with a complement of agents that far outnumbers the suspect.\nDuring the two sparring news conferences Monday, Trump remained adamant that crime in Washington is out of control despite data suggesting that it has decreased in recent years, and Bowser said firmly that DC is “not experiencing a spike in crime but a decrease in crime.”\nRegardless of the current crime rates, Bonner noted that Trump’s order has a 30-day limit and said any long-term impact on crime is doubtful.\n“You can’t have a long-term effect on crime with fast actions like this because it doesn’t get to the root causes,” Bonner said. “At the end of 30 days, it will be interesting to see what it has done in terms of reducing the crime rate further, or whatever the goals of this operation are, and what they might try to do moving forward to affect some long term fixes.”\n“Because, again, you’re not going to affect crime in the long term without addressing the symptoms of crimes,” Bonner said.\nThis story and headline have been updated with additional details."
    }
  ],
  "argos_summary": "Washington Mayor Muriel Bowser has expressed concerns over President Trump's recent decision to federalize the Metropolitan Police Department amid claims of a crime emergency in D.C. Bowser insists that crime rates are actually down and that the real disaster would be a loss of community trust in the police. Trump's actions, which include deploying National Guard troops and federal agents, have raised questions about the command structure and effectiveness of policing in the city, as local officials were not consulted prior to the announcement.",
  "argos_id": "KN4L3LDRD"
}