{
  "url": "https://www.bloomberg.com/news/videos/2025-08-13/bnef-ev-fast-charging-more-expensive-than-gas-in-europe-video?srnd=all",
  "authorsByline": "bn",
  "articleId": "7296fda3df324253a20022a9489ad6da",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ic7ZTxsO_jT4/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T05:07:26.072000+00:00",
  "addDate": "2025-08-13T05:16:30.179607+00:00",
  "refreshDate": "2025-08-13T05:16:30.179609+00:00",
  "score": 1.0,
  "title": "BNEF: EV Fast Charging More Expensive Than Gasoline in Europe",
  "description": "BloombergNEF's analyst Madeleine Brolly breaks down the the costs of charging your EV car at home or at a fast public charger and looks at where the cost of refueling with electricity is more expensive than pulling up to a petrol pump. This interview occurred Monday, August 11. (Source: Bloomberg)",
  "content": "So the impact of Seattle then suspending activity at that major lithium mine will be felt most acutely, of course, in the car space. But the costs when it comes to charging your car at home, or at least a fast public charger, can fluctuate wildly whether or not you charge at home or at one of those fast charges. There are countries where refueling with electricity is actually far more expensive, counterintuitively, of course, than pulling up to a petrol pump to break this down further. With me, let's bring in bloomberg nrf analyst madeline brolly. Madeline, thanks for coming into the studio to talk us through the story. The analysis, of course, that you and the team have been pulling together on this. It does seem counter-intuitive on a kind of simplistic level. You would assume that it would be cheaper to charge your EV than to fill up at the pump what is going which is cheaper and where is that happening? Yeah, absolutely. And the answer to this very much depends on where you're charging. So charging at home remains significantly cheaper than gasoline across much of the world. Just looking at standard electricity tariffs that people pay for your home across Europe, obviously about a 40% saving compared to gasoline on 20% saving. And that's just on a standard tariff. Many are saving much more than that by using these dedicated EV charging tariffs. So these will lower your costs during off peak periods and they actually lower it to under the equivalent of $0.02 per kilometre, which is about a fifth of the cost of gasoline in the UK, for example. The challenge comes when you can't access a home charger and this is why we've seen the cost of fast charging in some markets become substantially more expensive than gasoline on average. So just looking across Europe, we see about 25% premium, but some markets it's much greater. So the UK has the most expensive fast public charging in Europe and it's about 80% more expensive than gasoline on average. Why doesn't it surprised me that the UK comes out top of the list in terms of higher costs, higher costs for EV charging, higher costs across the board. It seems in the UK for a number of different things in which which we purchase and have to spend money on and EV charging is one of them. In terms of lower prices across globally where there's Europe globally, where are you seeing what you think, where which country is best positioned to offer you the prospect of really, really cheap EV charging? So China has very cheap charging both at home and in public. There are several European markets that are doing well on this front as well. One thing we've noticed actually is the price of fast charging in some Nordic markets. So Norway and Denmark coming down. And we think that's because the EV adoption has been strong and now demand is at a level where it can start to spur competition in the market. What about co-locating charging? What is co-locating? Because this is something that's being considered. You could have businesses, homes, you've got co-locating of charging. Is that something that's being worked through right now? Yeah, absolutely. So just taking the UK as an example for this. Operators are facing some significant challenges. So the grid fees that they pay for their sites have risen quite substantially even just compared to a few years ago. And so what we've seen is that some businesses that have alternate alternative forms of revenues are thinking about maybe a supermarket. They've been able to keep their average prices somewhat lower than the national average. So fast charging dedicated operators have been really focused in the UK and other European markets in rolling out a robust, high powered network that will suit the future needs of the EV fleet. The problem they've got is that they've got the demand of the EV fleet today and so it's definitely a bit of a balancing act for the industry and how it manages that expansion with kind of revenue generation today and high prices are part of that. Okay, Madeleine, thank you very much indeed. Really interesting analysis. And of course, you can get more details on Bloomberg.com and of course on the terminal from Madeleine Brolly and the team at Bloomberg and the.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "EV Fast Charging",
      "weight": 0.09660579
    },
    {
      "name": "fast charging",
      "weight": 0.095348254
    },
    {
      "name": "EV charging",
      "weight": 0.09369547
    },
    {
      "name": "co-locating charging",
      "weight": 0.079232045
    },
    {
      "name": "charging",
      "weight": 0.07776065
    },
    {
      "name": "higher costs",
      "weight": 0.074120976
    },
    {
      "name": "other European markets",
      "weight": 0.07276875
    },
    {
      "name": "several European markets",
      "weight": 0.07115506
    },
    {
      "name": "home",
      "weight": 0.069781825
    },
    {
      "name": "homes",
      "weight": 0.069781825
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.7919921875
    },
    {
      "name": "/Computers & Electronics/Electronics & Electrical/Power Supplies",
      "score": 0.5439453125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.50048828125
    },
    {
      "name": "/News/Technology News",
      "score": 0.44287109375
    },
    {
      "name": "/Autos & Vehicles/Vehicle Parts & Services/Vehicle Parts & Accessories",
      "score": 0.427490234375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Electricity",
      "score": 0.406982421875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.334716796875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.329345703125
    }
  ],
  "sentiment": {
    "positive": 0.18836088,
    "negative": 0.37368688,
    "neutral": 0.4379522
  },
  "summary": "The costs of charging your car at home or at least a fast public charger can fluctuate wildly depending on where you're charging, with some countries where refueling with electricity is more expensive than petrol. The cost of fast charging in some markets has become significantly more expensive. The UK has the most expensive fast public charging in Europe, with it being about 80% more costly than gasoline on average. This is due to the country's most affordable home charger, which can be reduced to under $0.02 per kilometre, which is about a fifth of the cost of gasoline in the UK. The analysis suggests that while charging at home remains significantly cheaper than gasoline across much of the world, it depends on the location of the charger. The study also suggests that China has the highest rates of cheap charging both at home and in public, with several European markets performing well. However, the UK is the leading European market for fast charging, particularly the UK, where grid fees have risen significantly significantly. There are challenges facing operators in the industry due to high demand and high prices.",
  "shortSummary": "The cost of fast charging EV cars at home or at public charging varies wildly depending on where you're charging, with specific markets seeing higher costs compared to gasoline.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a664bc135c9649f4adf088dd176f213c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The suspension of activity at a major lithium mine in Seattle will significantly impact electric vehicle (EV) costs, particularly in charging. While home charging is generally cheaper than gasoline, fast public charging can be more expensive, especially in the UK, where it is about 80% pricier than gasoline. In contrast, countries like China and some Nordic markets are offering more affordable charging options, driven by strong EV adoption and competition.",
  "argos_id": "KN79YQFJW"
}