{
  "url": "https://finance.yahoo.com/news/eloro-resources-continues-expand-higher-110000911.html?.tsrc=rss&_guc_consent_skip=1754480229",
  "authorsByline": "Eloro Resources Ltd.",
  "articleId": "cde04af5334f404484f9f2a2a4c7deba",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/qr5TCpEaL7j2fdGuAb3BJw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNjg4O2NmPXdlYnA-/https://media.zenfs.com/en/globenewswire.com/507c1b2a42949562f43fa7e14b0f185d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T11:00:00+00:00",
  "addDate": "2025-08-06T11:39:16.564968+00:00",
  "refreshDate": "2025-08-06T11:39:16.564970+00:00",
  "score": 1.0,
  "title": "Eloro Resources Continues to Expand Higher-Grade Tin and Silver Mineralization in Step-Out Definition Drilling at its Iska Iska Project, Potosí Department, Bolivia",
  "description": "Highlights: DSB-78, a step-out hole 75m southwest of discovery hole DSB-72, intersected a higher-grade tin zone grading 0.40% Sn over 79.50m beginning at 319.60m, including a higher-grade section of 0.89% Sn over 16.50m beginning at 366.10m. Further downhole, it intersected 0.57% Sn over 25.50m beginning at 486.10m, including a section grading 0.90% Sn over 13.50m beginning at 495.10m.Hole DSB-79, a step-out hole collared 75m southwest of hole DSB-64, intersected both silver- and tin-enriched zo",
  "content": "Note: True width is approximately 80% of core length. Silver equivalent (Ag eq) grades are calculated using 3-year average metal prices of Ag = US$24.14/oz, Zn = US$1.36/lb , Pb = 0.98/lb and Sn = US$13.74/lb, and preliminary metallurgical recoveries of Ag = 88%, Zn = 87%, Pb= 80% and Sn = 50%. In selecting intervals, a cutoff grade of 30 g Ag eq/t has been used. Lower grade material may be included in intersections where geological continuity is warranted.\n\n0.39% Sn and 33.62 g/t Ag over 49.50m beginning at 349.50m, including 0.84% Sn over 3.75m beginning at 367.50m, and 1.10% Sn over 6.00m beginning at 390.00m.\n\nHole DSB-82 drilled 50m northeast of hole DSB-35 intersected 0.16% Sn and 14.19 g/t Ag over 15.00m beginning at 97.80m. It also intersected 0.23% Sn over 12.00m beginning at 472.80m.\n\nDSB-81, a step-out hole 50m southwest of hole DSB-35, intersected 0.18% Sn over 57.00m beginning at 9.60m, including higher grade sections of 0.33% Sn over 6.00m beginning at 9.6m and 0.32% Sn over 6.00m beginning at 44.10m.\n\nHole DSB-79 , a step-out hole collared 75m southwest of hole DSB-64, intersected both silver- and tin-enriched zones. Higher-grade silver grading 52.73 g/t Ag over 43.50m occurs from 214.10m, including 401.65 g/t Ag over 3.00m beginning at 244.10m. Further down hole a number of higher grade tin intersections were returned including: 0.43% Sn over 3.00m beginning at 404.60m, 0.31% Sn over 9.00m beginning at 418.10m, 0.72% Sn over 4.50m beginning at 454.10m, 0,21% Sn over 6.00m beginning at 440.60m, and 0.28% Sn over 1.50m beginning at 472.10m.\n\nDSB-78, a step-out hole 75m southwest of discovery hole DSB-72, intersected a higher-grade tin zone grading 0.40% Sn over 79.50m beginning at 319.60m, including a higher-grade section of 0.89% Sn over 16.50m beginning at 366.10m. Further downhole, it intersected 0.57% Sn over 25.50m beginning at 486.10m, including a section grading 0.90% Sn over 13.50m beginning at 495.10m.\n\nResults from the first 5 diamond drillholes from the restart definition drill program has significantly expanded the higher-grade tin mineralization and the shallower higher grade silver mineralized zone which is above the tin zone. The tin mineralization is extended at least 100m laterally beyond the known mineralization in the western part of the Santa Barbara zone and remains open along strike.\n\nTORONTO, Aug. 06, 2025 (GLOBE NEWSWIRE) -- Eloro Resources Ltd. (TSX: ELO; OTCQX: ELRRF; FSE: P2QM) (“Eloro”, or the “Company”) is pleased to announce assay results from the first five (5) drillholes of the restart phase definition diamond drilling program in the predominant tin domain potential Santa Barbara starter pit area in the Iska Iska silver-tin polymetallic project in the Potosi Department of southwestern Bolivia. A total of 2,871.4m of diamond drilling has been completed in these five (5) holes with assays pending for the remaining three holes totalling 1,413.90m. Figure 1 shows the location of drill holes reported, Table 1 lists significant assay results and Table 2 lists drill hole coordinates.\n\nTom Larsen, Eloro’s CEO commented: “The new drill results are significantly expanding on the existing mineralization in the predominant tin domain, further adding to the solid foundation for building the initial open pit mineral resource. We continue to be encouraged with the higher-grade tin and silver drill results. The Santa Barbara Zone continues to be open laterally and downdip, offering significant potential for further infill and step-out drilling to further expand and upgrade resources for the planned PEA.”\n\nDr. Osvaldo Arce, P.Geo., Executive Vice President Operations Latin America for Eloro added: “The current closer-spaced definition drill program has both upgraded and expanded the mineralization with significant higher-grade tin and silver zones which are still open laterally and at depth in the potential starter pit area at Santa Barbara zone. This highlights the significant opportunity to outline additional higher-grade mineral resources presently defined in a 700m x 400m x 500m potential starter pit, as well as further enlarging this target to the NE and SE.”\n\nHoles DSB-78 and DSB-79 were drilled on the southwestern margin of the potential starter pit area at Santa Barbara as shown in Figure 1. Hole DSB-78 is located 75m southwest of discovery hole DSB-72 and hole DSB-79 is located 75m southwest of hole DSB-64. Both holes intersected significant tin mineralization in intrusion breccia (TIB) and locally in phreatomagmatic breccia. Tin intersections in both holes are visibly coarse and medium grained cassiterite which are likely to be amenable to multi-gravity separation.\n\nHole DSB-78 intersected 0.40% Sn over 79.50m from 319.60m to 399.10m, including a higher-grade section of 0.89% Sn over 16.50m from 366.10m to 382.60m. It also intersected 0.57% Sn over 25.50m from 486.10m to 511.60m, including a section grading 0.90% Sn over 13.50m from 495.10m to 508.60m. In addition, it intersected 38 g/t Ag and 0.50% Sn over 3.00m from 7.60m to 10.60m; 390.40 g/t Ag and 0.25% Sn over 3.75m from 224.35m to 228.10m; 51.33 g/t Ag over 4.50m from 244.60m to 249.10m, and 0.42% Sn over 3.00m from 549.10m to 552.10m.\n\nHole DSB-79 intersected both silver and tin enriched zones. A higher-grade silver intersection of 52.73 g/t Ag over 43.50m was returned from 214.10m to 257.60m, including 401.65 g/t Ag over 3.00m from 244.10m to 247.10m. Multiple zones of deeper higher-grade tin mineralization were intersected including 0.43% Sn over 3.00m from 404.60m to 407.60m, 0.31% Sn over 9.00m from 418.10m to 427.10, 0.72% Sn over 4.50m from 454.10m to 458.60m, 0,21% Sn over 6.00m from 440.60m to 446.60m, and 0.28% Sn over 1.50m from 472.10m to 473.60m. Shallow higher grade tin mineralization of 0.21% Sn and 19.50 g/t Ag over 19.50m from 86.60m to 106.10m, including 0.47% Sn over 6.00m, was also intersected.\n\nHoles DSB-81 and DSB-82 were drilled on the western margin of the potential starter pit area at Santa Barbara as shown in Figure 1. Hole DSB-81 is located 50m southwest of hole DSB-35 and DSB-82 is located 50m northeast of hole DSB-35. Both holes intersected moderate intensity tin mineralization in intrusion breccia (TIB), the principal host for higher grade tin mineralization at Iska Iska (see Eloro press releases dated January 23, 2025 and February 20, 2025 for further detail) and minorly in medium grained dacitic dome. Tin intersections in both holes are visibly coarse and medium grained cassiterite which are likely to be amenable to multi-gravity separation.\n\nHole DSB-81 intersected 0.18% Sn over 57.00m from 9.60m to 66.60m including higher grade sections of 0.33% Sn over 6.00m from 9.60m to 15.60m and 0.32% Sn over 6.00m from 44.10m to 50.10m. Shallower higher grade silver and tin mineralization was also intersected, including 48.00 g/t Ag and 0.23% Sn over 0.75m from 80.85m to 81.60m; and 55.00 g/t Ag and 0.75% Sn over 1.50m from 237.60m to 239.10m.\n\nHole DSB-82 intersected 0.16% Sn and 14.19 g/t Ag over 15.00m from 97.80m to 112.80m, 0.23% Sn over 12m from 472.80m to 484.80m and 0.17% Sn over 12m from 594.30 to 606.30m. Shallower tin mineralization was also intersected, including 0.28% Sn over 3.90m from 0.90m to 4.80m; 0.26% Sn over 1.50m from 34.80m to 36.30m; 0.27% Sn over 4.50m from 81.30m to 85.80m; 0.38% Sn over 1.50m from 130.80m to 132.30m and 0.48% Sn over 4.50m from 139.80m to 144.30m.\n\nHole DSB-83 was drilled on the central part of the potential starter pit area at Santa Barbara as shown in Figure 1. It is located 135m northeast of discovery hole DSB-72 and intersected multiple silver and tin intervals, mostly in intrusion breccia and locally in medium grained dacite. The first mineralized interval was intersected in the oxides zone related to silver mineralization. Subsequently, multiple mineralized interceptions were encountered in the lower part of the hole in the sulphides zone starting from 313.50 to 541.50m in intrusion breccia (TIB). The mineralizing sequence starts with shallow silver mineralization, continues deeper to tin-silver combined mineralization, followed by a tin interval, then another silver interval, finally ending with a tin interval. This is interpreted as a continuous overprinting between high-temperature tin mineralization and lower-temperature epithermal silver mineralization.\n• 39.43 g/t Ag over 31.50m from 52.30m to 83.80m, including 43.53 g/t Ag over 25.50m from 52.30m to 77.80m.\n• 32.26 g/t Ag over 4.70m from 112.30m to 117.00m.\n• 51.24 g/t Ag over 25.50m from 313.50m to 339.00m, including 69.22 g/t Ag over 13.50m from 315.00m to 328.50m.\n• 0.39% Sn and 33.62 g/t Ag over 49.50m from 349.50m to 300.00m, including 0.41% Sn over 7.50m from 349.50m to 357.00m; 0.84% Sn over 3.75m from 367.50m to 371.25m; 0.41% Sn over 7.50m from 379.50m to 387.00m; and 1.10% Sn over 6.00m from 390.00m to 396.00m.\n• 0.22% Sn over 15.00m from 408.00m to 423.00m.\n• 0.21% Sn over 1.50m from 450.00m to 451.50m.\n• 0.23% Sn over 6.00m from 457.50m to 463.50m.\n• 37.91 g/t Ag over 16.50m from 513.00m to 529.50m, including 87.00 g/t Ag over 4.50m from 513.00m 517.50m.\n• 0.29% Sn over 1.50m from 540.00m to 541.50m.\n\n\n\n\n\nNote: True width is approximately 80% of core length. Silver equivalent (Ag eq) grades are calculated using 3-year average metal prices of Ag = US$24.14/oz, Zn = US$1.36/lb , Pb = 0.98/lb and Sn = US$13.74/lb, and preliminary metallurgical recoveries of Ag = 88%, Zn = 87%, Pb= 80% and Sn = 50%. In selecting intervals, a cutoff grade of 30 g Ag eq/t has been used. Lower grade material may be included in intersections where geological continuity is warranted.\n\nFigure 1: Location Map of Definition Diamond Drill Holes, Santa Barbara zone, Iska Iska. The yellow circles highlight the location of holes DSB-78, DSB-79, DSB-81, DSB-82 and DSB-83 referred to in this release.\n\nTable 2: Summary of Diamond Drill Hole Coordinates for Drill Holes Completed at Iska Iska as of August 1, 2025\n\nDr. Osvaldo Arce, P.Geo. Executive Vice President, Latin America for Eloro and General Manager of Eloro’s Bolivian subsidiary, Minera Tupiza S.R.L, and a Qualified Person (“QP”) as defined by National Instrument (“NI”) 43-101 has reviewed and approved the technical content of this news release. Dr. Arce has supervised all field work carried out at Iska Iska.\n\nEloro utilized both ALS and AHK for drill core analyses, both of whom are major international accredited laboratories. Drill samples sent to ALS were prepared in both ALS Bolivia Ltda’s preparation facility in Oruro, Bolivia and the preparation facility operated by AHK in Tupiza with pulps sent to the main ALS Global laboratory in Lima for analysis. Eloro employs an industry standard QA/QC program with standards, blanks and duplicates inserted into each batch of samples analyzed with selected check samples sent to a separate accredited laboratory.\n\nDrill core samples sent to AHK Laboratories were prepared in a preparation facility installed and managed by AHK in Tupiza with pulps sent to the AHK laboratory in Lima, Peru. Check samples between ALS and AHK are regularly done as a QA/QC check. AHK is following the same analytical protocols used as with ALS and with the same QA/QC protocols.\n\nThe Iska Iska silver-tin polymetallic project is a road accessible, royalty-free property, wholly controlled by the Title Holder, Empresa Minera Villegas S.R.L. and is located 48 km north of Tupiza city, in the Sud Chichas Province of the Department of Potosi in southern Bolivia. Eloro has an option to earn a 100% interest in Iska Iska.\n\nIska Iska is a major silver-tin polymetallic porphyry-epithermal complex associated with a Miocene possibly collapsed/resurgent caldera, emplaced on Ordovician age rocks with major breccia pipes, dacitic domes and hydrothermal breccias. The caldera is 1.6km by 1.8km in dimension with a vertical extent of at least 1km. Mineralization age is similar to Cerro Rico de Potosí and other major deposits such as San Vicente, Chorolque, Tasna and Tatasi, all located along the same overall geological trend.\n\nEloro began underground diamond drilling from the Huayra Kasa underground workings at Iska Iska on September 13, 2020. On November 18, 2020, Eloro announced the discovery of a significant breccia pipe with extensive silver polymetallic mineralization just east of the Huayra Kasa underground workings and a high-grade gold-bismuth zone in the underground workings. On November 24, 2020, Eloro announced the discovery of the Santa Barbara Breccia Pipe (SBBP) approximately 150m southwest of the Huayra Kasa underground workings.\n\nSubsequently, on January 26, 2021, Eloro announced significant results from the first drilling at the SBBP including the discovery hole from 0.0m to 257.5m. Subsequent drilling has confirmed the presence of significant values of Ag-Sn polymetallic mineralization in the SBBP and the adjacent Central Breccia Pipe (CBP). A substantive mineralized envelope which is open along strike and down-dip extends around both major breccia pipes. Continuous channel sampling along the walls of the Santa Barbara Adit located to the east of SBBP returned average grades of 164.96 g Ag/t, 0.46%Sn, 3.46% Pb and 0.14% Cu over 166m including 446 g Ag/t, 9.03% Pb and 1.16% Sn over 56.19m. The west end of the adit intersects the end of the SBBP.\n\nSince the initial discovery hole DHK-15 which returned 29.53g Ag/t, 0.078g Au/t, 1.45%Zn, 0.59%Pb, 0.080%Cu and 0.056%Sn over 257.5m, Eloro has released a number of significant drill results in the SBBP and the surrounding mineralized envelope which, along with geophysical data, has defined an extensive target zone. On October 17, 2023, Eloro filed the NI 43-101 Technical Report outlining the initial inferred MRE for Iska Iska, prepared by independent consultants Micon International Limited. The MRE was reported in two domains, the Polymetallic (Ag-Zn-Pb) Domain which is primarily in the east and south of the Santa Barbara deposit and the Tin (Sn-Ag-Pb) Domain which is primarily in the west and north.\n\nThe Polymetallic Domain is estimated to contain 560Mt at 13.8 g Ag/t, 0.73% Zn & 0.28% Pb at an NSR cutoff of US$9.20 for potential open pit and an NSR cutoff of US$34.40 for potential underground. The majority of the mineral resource is contained in the constraining pit which has a stripping ratio of 1:1. The Polymetallic Domain contains a higher-grade mineral resource at a NSR cutoff of $US25/t of 132 million tonnes at 1.11% Zn, 0.50% Pb and 24.3 g Ag/t which has a net NSR value of US$34.40/t which is 3.75 the estimated operating cost of US$9.20/t. The Tin Domain which is adjacent to the Polymetallic Domain and does not overlap, is estimated to contain a mineral resource of 110Mt at 0.12% Sn, 14.2 g Ag/t and 0.14% Pb but is very under drilled.\n\nResults of the definition drill program which totalled 5,267.7m in 11 holes were reported on December 18, 2023 and January 11, 2024, respectively. Significant results included 279.22 g Ag/t, 0.47% Pb and 0.43% Sn (339.82g Ag eq/t) over 62.84m and 33.83 g Ag/t, 1.53% Zn, 0.93% Pb and 0.14% Sn (130.88g Ag eq/t) over 178.99m including 120.37 g Ag/t, 2.13% Zn, 1.57% Pb and 0.19% Sn in hole DSB-61; 57.62g Ag/t, 1.26% Zn, 0.94% Pb and 0.12% Sn (139.94g Ag eq/t) over 136.11m in hole DSB-66 and 118.86g Ag/t, 0.35% Zn, 0.35% Pb and 0.15% Sn (152.29g Ag eq/t) over 81.28m in hole DSB-65. This latter intersection in hole DSB-65 included a very high-grade sample of 5,080g Ag/t, 0.12 g Au/t, 0.26% Zn, 1.34% Pb, 1.53% Cu and 1.27% Sn (4,746.46g Ag eq/t) over 1.46m.\n\nMetallurgical tests reported on January 23, 2024 from a 6.3 tonne PQ drill core bulk sample representative of the higher grade Polymetallic (Ag-Zn-Pb) Domain returned a significantly higher average silver value of 91 g Ag/t compared to the weighted average grade of the original twinned holes at 31 g Ag/t strongly suggesting that the average silver grade is likely significantly underreported in the original twinned holes due to the much smaller sample size.\n\nOn January 29, 2024, the Company reported that the new chargeability high outlined southeast of the MRE open pit by the expanded induced polarization (IP) survey indicates that the major mineralized structural corridor that is up to 800m wide extends a further 600m along strike to the southeast for an overall strike length of at least 2km. This new area has not been drilled.\n\nThe Company reported on July 30, 2024, that updated modelling of the potential starter pit area at Santa Barbara zone highlights the importance of completing additional drilling to better define the grade and extent of the mineral resource in this area. Areas with higher-grade resource typically have much better drilling density but holes outside the core potential pit area are too widely spaced to give an accurate estimate of grade.\n\nOn September 4, 2024, the Company announced the restart of definition drilling in the potential starter pit area at Santa Barbara. Previous drilling has shown that areas with high-grade mineralization typically have much better drilling density, whereas holes outside the core area are too widely spaced to give an accurate grade estimate. This increased drilling density is particularly important for defining the extent of the high-grade Ag-bearing and Sn-bearing structures, and for categorizing the mineral resources from inferred to indicated, which have a major influence on overall grade and resources that will contribute to the preliminary economic assessment (“PEA”).\n\nResults from the first definition drill hole DSB-68 were released on November 26, 2024. This hole intersected 66.90g Ag/t, 0.63% Zn, 0.42% Pb and 0.11% Sn (111.14g Ag eq/t) over 289.13m including higher grade intervals of:\n• 47.61g Ag/t, 0.22% Zn, 0.40% Pb and 0.45% Sn (146.06g Ag eq/t) over 16.51m, and\n\nFurther drill results were released on January 6, 2025:\n• Hole DSB-69 intersected 127.49g Ag/t, 0.50% Zn, 0.16% Pb and 0.31% Sn (193.00g Ag eq/t) over 41.25m within a broader interval of 49.71g Ag/t, 0.78% Zn, 0.32% Pb and 0.15% Sn (106.97g Ag eq/t) over 142.50m.\n• Hole DSB-70 intersected, 45.71g Ag/t, 3.11% Zn, 1.91% Pb and 0.23% Sn (232.35g Ag eq/t) over 81.00m within a broader interval of 30.08g Ag/t, 1.63% Zn 0.98% Pb and 0.13% Sn (127.89g Ag eq/t) over 255.75m\n• Hole DSB-71 intersected 53.17 Ag/t, 0.72% Zn, 0.40% Pb and 0.19% Sn (116.62 g Ag eq/t) over 45.00m within a broader interval of 29.26 Ag/t, 0.58% Zn, 0.22% Pb and 0.11% Sn (71.46g Ag eq/t) over 127.50m.\n\n\n\n\n\nOn January 23, 2025, the Company reported discovery hole DSB-72 that opens up a major tin zone intersecting 33m grading 1.39% Sn within 87m grading 0.74% Sn. Tin mineralization is hosted in an extensive intrusion breccia unit (TIB) that is approximately 750m long by 450m wide and extends to a depth of at least 700m. Previous wide space reconnaissance drilling has intersected a number of significant Sn intersections in this breccia unit which is very under-drilled\n\nHigher grade tin mineralization in Hole DSB-72 occurs as visible coarse and medium-grained high temperature cassiterite which is likely to be amenable to multi-gravity separation. Core from this hole will be used for additional metallurgical testing. Geophysically, the intrusion breccia has low chargeability which contrasts considerably with the adjacent later epithermal Ag-Zn-Pb mineralization which is marked by a strong chargeability anomaly. The intrusive breccia is very likely an offshoot or apophysis from a large tin porphyry at depth. The likely top of this tin porphyry is marked by a highly conductive zone that is interpreted as a pyrite-pyrrhotite halo around this porphyry. Similar pyritic halos have been reported from other major tin deposits in the Bolivian Tin Belt.\n\nWith this discovery of a presumed shallow level apophysis of a tin porphyry at depth, Eloro is in a unique position of having two discernable different deposit styles juxtaposed against one another; a very large silver-zinc-lead dominant system next to a high-grade tin system. While these two systems are likely genetically related, this means that the Company may potentially have two giant deposits on the same property.\n\nEloro is an exploration and mine development company with a portfolio of precious and base-metal properties in Bolivia, Peru and Quebec. Eloro has an option to acquire a 100% interest in the highly prospective Iska Iska Property, which can be classified as a polymetallic epithermal-porphyry complex, a significant mineral deposit type in the Potosi Department, in southern Bolivia. A NI 43-101 Technical Report on Iska Iska, which was completed by Micon International Limited, is available on Eloro’s website and under its filings on SEDAR+. Iska Iska is a road-accessible, royalty-free property. Eloro also owns an 82% interest in the La Victoria Gold/Silver Project, located in the North-Central Mineral Belt of Peru some 50 km south of the Lagunas Norte Gold Mine and the La Arena Gold Mine.\n\nFor further information please contact either Thomas G. Larsen, Chairman and CEO or Jorge Estepa, Vice-President at (416) 868-9168.\n\nInformation in this news release may contain forward-looking information. Statements containing forward-looking information express, as at the date of this news release, the Company’s plans, estimates, forecasts, projections, expectations, or beliefs as to future events or results and are believed to be reasonable based on information currently available to the Company. There can be no assurance that forward-looking statements will prove to be accurate. Actual results and future events could differ materially from those anticipated in such statements. Readers should not place undue reliance on forward-looking information.\n\nNeither the TSX nor its Regulation Services Provider (as that term is defined in the policies of the TSX) accepts responsibility for the adequacy or accuracy of this release.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/16bdf1e3-7212-44bd-989d-57b046fb04d1",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/16bdf1e3-7212-44bd-989d-57b046fb04d1"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Higher grade tin mineralization",
      "weight": 0.08595472
    },
    {
      "name": "higher grade tin mineralization",
      "weight": 0.08595472
    },
    {
      "name": "Shallow higher grade tin mineralization",
      "weight": 0.08173621
    },
    {
      "name": "higher grade tin intersections",
      "weight": 0.08152936
    },
    {
      "name": "higher grade intervals",
      "weight": 0.0742608
    },
    {
      "name": "higher grade sections",
      "weight": 0.07249162
    },
    {
      "name": "Drill Holes",
      "weight": 0.07155392
    },
    {
      "name": "drill holes",
      "weight": 0.07155392
    },
    {
      "name": "Iska Iska",
      "weight": 0.07064581
    },
    {
      "name": "significant tin mineralization",
      "weight": 0.06943831
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.80615234375
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.68505859375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.46044921875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.354736328125
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.31982421875
    }
  ],
  "sentiment": {
    "positive": 0.16052246,
    "negative": 0.13928223,
    "neutral": 0.7001953
  },
  "summary": "Eloro Resources Ltd. (TSX: ELO; OTCQX: Eloro) continues to drill at its Iska Iska Project, Potosí Department, Bolivia, with a total of 5.4m of drilling completed in five diamond drill holes totalling 1,413 holes. The company continues to expand its higher-grade tin and silver mineralization in the Santa Barbara area, which remains open along strike. The first five drillholes from the restart definition diamond drilling program have significantly expanded the higher grade tin mineralization and the shallower higher grade silver mineralized zone above the tin zone. Higher-grade silver grading 52.73 g/t Ag over 43.50m was found to be higher-quality, with several high-profile intersections including 0.39% Sn and 33.62 g/T Ag over 49.50 m, and 0.84% Sn over 3.75m from a step-out hole.",
  "shortSummary": "Eloro Resources continues to expand higher-grade tin and silver mineralization at its Iska Iska Project in Bolivia, with significant results in several holes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b941cfffbdeb45c1a864bba1e495e498",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Eloro Resources Ltd. has announced significant assay results from the first five drill holes of its definition drilling program at the Santa Barbara zone of the Iska Iska silver-tin polymetallic project in Bolivia. The results indicate substantial expansions of higher-grade tin and silver mineralization, with notable intersections including 0.39% Sn and 33.62 g/t Ag over 49.50m in hole DSB-83. The drilling has extended mineralization laterally and at depth, highlighting the potential for further resource expansion in the area.",
  "argos_id": "L4T7UBDVR"
}