{
  "url": "https://finance.yahoo.com/news/benz-announces-drilling-accelerate-glenburgh-013700253.html?.tsrc=rss",
  "authorsByline": "Newsfile Corp.",
  "articleId": "60313e66bdd0448296492d0ae037d120",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/ed297fda751040d38ec88cb24395b3bd",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:37:00+00:00",
  "addDate": "2025-08-13T01:43:36.181085+00:00",
  "refreshDate": "2025-08-13T01:43:36.181087+00:00",
  "score": 1.0,
  "title": "Benz Announces Drilling to Accelerate at Glenburgh Following A$30M Bought Deal",
  "description": "HIGHLIGHTS Firm commitments received to raise A$30 million via bought deal at marketPlacement driven by demand from leading, high-quality long only offshore institutional investorsThe proceeds will enable Benz to accelerate drilling at Glenburgh following up the emerging bulk tonnage gold system at Icon and the exciting high grade gold trend at Zone 126 4 rigs have been locked in, with drilling expected to be ongoing and aggressively ramped upBenz is well-funded with a pro-forma ...",
  "content": "\"With a strengthened pro-forma balance sheet of A$40m 1 in cash, Benz is well funded to deliver a step change in exploration activities at Glenburgh, doubling drilling capacity to four rigs to fast track resource growth across multiple high priority targets.\n\n\"The demand received from these institutions, together with our existing large institutional shareholders, is seen as a strong endorsement of our recent discoveries and the exploration potential that remains within our belt-scale tenure.\n\n\"To have had such strong cornerstone demand from two leading offshore institutional funds who share our excitement and vision with the new exploration strategy at Glenburgh is extremely pleasing. The new discoveries at the Icon Apollo trend deserve their own dedicated rigs to rapidly unlock the size and scale of the emerging bulk tonnage system. The remaining rigs will continue to target high grade ounces along the Zone 126 trend and scout out new and exciting untested priority targets along out 18km mineralised trend.\n\n\"This is a transformational capital raising for Benz which will position the Company to significantly increase its exploration activities at the Glenburgh Project, following recent drilling successes at the Icon Prospect and at Zone 126.\n\nThe Placement was driven by strong demand from leading, high-quality offshore institutional investors, and was also supported by its existing large institutional shareholders. Benz's share register is now well-positioned with a broad range of long-only institutional shareholders who have demonstrated their support for the Company's strategy of aggressive exploration to fast track resource growth.\n\nVancouver, British Columbia--(Newsfile Corp. - August 12, 2025) - Benz Mining Corp. (TSXV: BZ) (ASX: BNZ) ( Benz or the Company ) is pleased to announce that it has received firm commitments for a placement of 30,456,853 new fully paid CHESS Depositary Interests ( CDIs ) in the Company via a bought deal at an issue price of A$0.985 per CDI to raise A$30 million (before costs) ( Placement ).\n\nBenz is well-funded with a pro-forma cash position of over $40 million following completion of the Placement 1\n\n4 rigs have been locked in, with drilling expected to be ongoing and aggressively ramped up\n\nThe proceeds will enable Benz to accelerate drilling at Glenburgh following up the emerging bulk tonnage gold system at Icon and the exciting high grade gold trend at Zone 126\n\n\"As we move into the next exciting chapter for the Company, I'd like to take this opportunity to welcome our new shareholders to the register and thank our exiting holders for their continued support.\"\n\nProceeds from the Placement will enable Benz to accelerate exploration across its gold portfolio, with a focus on its 100%-owned Glenburgh Gold Project in Western Australia — a new frontier gold district with multi-million-ounce potential.\n\nFunding will be applied towards:\n• \n• Increasing drilling capacity to four rigs to accelerate testing of the emerging bulk-tonnage gold system at the Icon deposit, the high-grade Zone 126 trend, and other priority targets.\n• Geological modelling, including detailed televiewer interpretation, to deliver a resource model that honours Glenburgh's folded and metamorphosed geometry.\n• Progress towards an updated Mineral Resource Estimate once the majority of planned drilling is complete, ensuring it reflects the full scale of the Project's potential.\n• \n• Scoping Study to assess early-stage technical and economic development options for the high-grade resource.\n\nThe Placement was undertaken at an issue price of A$0.985, being the closing share price on the ASX on Friday, 8 August 2025.\n\nThe Company will issue 30,406,091 CDIs under its existing placement capacity under ASX Listing Rule 7.1 (Tranche 1 Placement).\n\nA Director of the Company intends to subscribe for 50,762 CDIs (A$50,000) in the Placement (Tranche 2 Placement), subject to shareholder approval at a general meeting that will be held in due course.\n\nIt is anticipated that settlement of the Tranche 1 Placement will occur on Wednesday, 20 August 2025 and the CDIs will be allotted and commence trading on Thursday, 21 August 2025. The Tranche 2 Placement is expected to complete in early October 2025. The Placement CDIs will rank equally with existing CDIs from the date of issue.\n\nEuroz Hartleys Limited acted as Lead Manager to the Placement.\n\nThis announcement has been approved for release by the Board.\n\nFor more information please contact:\n\nMark Lynch-Staunton\n\nChief Executive Officer\n\nBenz Mining Corp.\n\nE: mstaunton@benzmining.com\n\nT: +61 8 6143 6702\n\nBenz Mining Corp. (TSXV: BZ) (ASX: BNZ) is a pure-play gold exploration company dual-listed on the TSX Venture Exchange and Australian Securities Exchange. The Company owns the Eastmain Gold Project in Quebec, and the recently acquired Glenburgh and Mt Egerton Gold Projects in Western Australia.\n\nBenz's key point of difference lies in its team's deep geological expertise and the use of advanced geological techniques, particularly in high-metamorphic terrane exploration. The Company aims to rapidly grow its global resource base and solidify its position as a leading gold explorer across two of the world's most prolific gold regions.\n\nThe Glenburgh Gold Project features a Historical (for the purposes of NI 43-101) Mineral Resource Estimate of 16.3Mt at 1.0 g/t Au (510,100 ounces of contained gold)2. A technical report prepared under NI 43-101- Standards of Disclosure for Mineral Projects (NI 43-101) titled \"NI 43-101 Technical Report on the Glenburgh - Egerton Gold Project, Western Australia\" with an effective date of 16 December 2024 has been filed with the TSX Venture Exchange and is available under the Company's profile at www.sedarplus.ca.\n\nThe Eastmain Gold Project in Quebec hosts a Mineral Resource Estimate dated effective May 24, 2023 and prepared in accordance with NI 43-101 and JORC (2012) of 1,005,000 ounces at 6.1g/t Au3, also available under the Company's profile at www.sedarplus.ca, showcasing Benz's focus on high-grade, high-margin assets in premier mining jurisdictions.\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/1818/262316_7450fd1d84517b6d_001full.jpg\n\nFor more information, please visit: https://benzmining.com/.\n\nThe disclosure of scientific or technical information in this news release is based on, and fairly represents, information compiled by Mr Mark Lynch-Staunton, who is a Qualified Person as defined by NI 43-101 and a Member of Australian Institute of Geoscientists (AIG) (Membership ID: 6918). Mr Lynch-Staunton has reviewed and approved the technical information in this news release. Mr Lynch-Staunton owns securities in Benz Mining Corp.\n\nAll mineral resource estimates in respect of the Glenburgh Gold Project in this news release are considered to be \"historical estimates\" as defined under NI 43-101. These historical estimates are not considered to be current and are not being treated as such. These estimates have been prepared in accordance with the Australasian Code for Reporting of Exploration Results, Mineral Resources and Ore Reserves prepared by the Joint Ore Reserves Committee of the Australasian Institute of Mining and Metallurgy, Australian Institute of Geoscientists and Minerals Council of Australia (JORC Code) and have not been reported in accordance with NI 43-101. A qualified person (as defined in NI 43-101) (Qualified Person) has not done sufficient work to classify the historical estimates as current mineral resources. A Qualified Person would need to review and verify the scientific information and conduct an analysis and reconciliation of historical data in order to verify the historical estimates as current mineral resources.\n\nStatements contained in this news release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively Forward-Looking Information) as such term is used in applicable Canadian securities laws. Forward-Looking Information includes, but is not limited to, disclosure regarding the acquisition of the Glenburgh and Mt Egerton projects as well as certain tenements adjacent thereto and the anticipated benefits thereof, planned exploration and related activities on the Glenburgh and Mt Egerton projects. In certain cases, Forward-Looking Information can be identified by the use of words and phrases or variations of such words and phrases or statements such as \"anticipates\", \"complete\", \"become\", \"expects\", \"next steps\", \"commitments\" and \"potential\", in relation to certain actions, events or results \"could\", \"may\", \"will\", \"would\", be achieved. In preparing the Forward-Looking Information in this news release, the Company has applied several material assumptions, including, but not limited to, that the tenements associate with the Glenburgh and Mt Egerton projects that are still pending grant or undergoing the renewal process will be granted and/or renewed, as applicable, in the timely manner and on reasonable terms, and all conditions precedent to completion of the acquisitions will be satisfied, in a timely manner; the Company will be able to raise additional capital as necessary; the current exploration, development, environmental and other objectives concerning the Company's Projects (including Glenburgh and Mt Egerton) can be achieved; and the continuity of the price of gold and other metals, economic and political conditions, and operations.\n\nForward-looking information is subject to a variety of risks and uncertainties and other factors that could cause plans, estimates and actual results to vary materially from those projected in such forward-looking information. Factors that could cause the forward-looking information in this news release to change or to be inaccurate include, but are not limited to, the risk that any of the assumptions referred to prove not to be valid or reliable, that occurrences such as those referred to above are realized and result in delays, or cessation in planned work, that the Company's financial condition and development plans change, and delays in regulatory approval, as well as the other risks and uncertainties applicable to the Company as set forth in the Company's continuous disclosure filings filed under the Company's profile at www.sedarplus.ca and www.asx.com.au. Accordingly, readers should not place undue reliance on Forward-Looking Information. The Forward-looking information in this news release is based on plans, expectations, and estimates of management at the date the information is provided and the Company undertakes no obligation to update these forward-looking statements, other than as required by applicable law.\n\nNEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ACCURACY OR ADEQUACY OF THIS RELEASE.\n\n1 Based on Benz's closing cash of A$10m as at 30 June 2025 and adjusted for gross Placement proceeds (excludes transaction costs).\n\n2 Indicated: 13.5Mt at 1.0g/t Au for 430.7koz; Inferred: 2.8Mt at 0.9g/t Au for 79.4koz. See Historical Mineral Resource Estimates, below\n\n3 Indicated: 1.3Mt at 9.0g/t Au for 384koz; Inferred: 3.8Mt at 5.1g/t Au for 621koz\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/262316",
  "medium": "Article",
  "links": [
    "https://images.newsfilecorp.com/files/1818/262316_7450fd1d84517b6d_001full.jpg",
    "https://api.newsfilecorp.com/redirect/YEEGbsbeAj",
    "https://api.newsfilecorp.com/redirect/pppm5SX8Qe",
    "https://api.newsfilecorp.com/redirect/PqqXbcAroM",
    "https://api.newsfilecorp.com/redirect/wEEPps04DR",
    "https://api.newsfilecorp.com/redirect/gJJr4f8nD1",
    "https://api.newsfilecorp.com/redirect/0pp85SPgWO"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Glenburgh Gold Project",
      "weight": 0.066778325
    },
    {
      "name": "Benz Mining Corp.",
      "weight": 0.061096214
    },
    {
      "name": "high grade ounces",
      "weight": 0.054849222
    },
    {
      "name": "Glenburgh",
      "weight": 0.054753274
    },
    {
      "name": "Benz",
      "weight": 0.054425493
    },
    {
      "name": "Mt Egerton Gold Projects",
      "weight": 0.053914204
    },
    {
      "name": "planned exploration",
      "weight": 0.05299314
    },
    {
      "name": "Company",
      "weight": 0.052571308
    },
    {
      "name": "exploration activities",
      "weight": 0.05218384
    },
    {
      "name": "Historical Mineral Resource Estimates",
      "weight": 0.051955786
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.990234375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.52783203125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.362548828125
    }
  ],
  "sentiment": {
    "positive": 0.85253805,
    "negative": 0.014597278,
    "neutral": 0.13286467
  },
  "summary": "Benz Mining Corp. (TSXV: BZ) (ASX: BNZ) has announced that it has received commitments for a placement of 30,456,853 new fully paid CHESS Depositary Interests ( CDIs) in the Company via a bought deal to raise A$30 million. The Placement was driven by strong demand from leading offshore institutional investors and was also supported by existing large institutional shareholders. Benz's CEO, Staunton Lynch, described this as a \"transformational capital raising\" for the company. The proceeds will enable Benz to accelerate drilling at Glenburgh, a new frontier gold district with multi-million-ounce potential. The company plans to issue 30,406,091 CDIs under its existing placement capacity under ASX Listing Rule 7.1 (Tranche 1 Placement). The general general allocation will occur on August 20 2025 and the Tranche 2 Placement is expected to complete in early October 2021.",
  "shortSummary": "Benz Mining Corp. is accelerating exploration at its Glenburgh Project with A$30 million in proceeds from a major Placement, supported by significant offshore institutional investor.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "40aaa8bafa364453bfc7150210415f19",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.newsfilecorp.com/redirect/0pp85SPgWO",
      "text": "Benz Announces Drilling to Accelerate at Glenburgh Following A$30M Bought Deal\nAugust 12, 2025 9:37 PM EDT | Source: Benz Mining Corp.\nHIGHLIGHTS\nFirm commitments received to raise A$30 million via bought deal at market\nPlacement driven by demand from leading, high-quality long only offshore institutional investors\nThe proceeds will enable Benz to accelerate drilling at Glenburgh following up the emerging bulk tonnage gold system at Icon and the exciting high grade gold trend at Zone 126\n4 rigs have been locked in, with drilling expected to be ongoing and aggressively ramped up\nBenz is well-funded with a pro-forma cash position of over $40 million following completion of the Placement1\nVancouver, British Columbia--(Newsfile Corp. - August 12, 2025) - Benz Mining Corp. (TSXV: BZ) (ASX: BNZ) (Benz or the Company) is pleased to announce that it has received firm commitments for a placement of 30,456,853 new fully paid CHESS Depositary Interests (CDIs) in the Company via a bought deal at an issue price of A$0.985 per CDI to raise A$30 million (before costs) (Placement).\nThe Placement was driven by strong demand from leading, high-quality offshore institutional investors, and was also supported by its existing large institutional shareholders. Benz's share register is now well-positioned with a broad range of long-only institutional shareholders who have demonstrated their support for the Company's strategy of aggressive exploration to fast track resource growth.\nBenz Chair, Mr Evan Cranston, commented:\n\"This is a transformational capital raising for Benz which will position the Company to significantly increase its exploration activities at the Glenburgh Project, following recent drilling successes at the Icon Prospect and at Zone 126.\n\"To have had such strong cornerstone demand from two leading offshore institutional funds who share our excitement and vision with the new exploration strategy at Glenburgh is extremely pleasing. The new discoveries at the Icon Apollo trend deserve their own dedicated rigs to rapidly unlock the size and scale of the emerging bulk tonnage system. The remaining rigs will continue to target high grade ounces along the Zone 126 trend and scout out new and exciting untested priority targets along out 18km mineralised trend.\n\"The demand received from these institutions, together with our existing large institutional shareholders, is seen as a strong endorsement of our recent discoveries and the exploration potential that remains within our belt-scale tenure.\n\"With a strengthened pro-forma balance sheet of A$40m1 in cash, Benz is well funded to deliver a step change in exploration activities at Glenburgh, doubling drilling capacity to four rigs to fast track resource growth across multiple high priority targets.\n\"As we move into the next exciting chapter for the Company, I'd like to take this opportunity to welcome our new shareholders to the register and thank our exiting holders for their continued support.\"\nUse of Funds\nProceeds from the Placement will enable Benz to accelerate exploration across its gold portfolio, with a focus on its 100%-owned Glenburgh Gold Project in Western Australia — a new frontier gold district with multi-million-ounce potential.\nFunding will be applied towards:\n- Glenburgh Gold Project (WA):\n- Increasing drilling capacity to four rigs to accelerate testing of the emerging bulk-tonnage gold system at the Icon deposit, the high-grade Zone 126 trend, and other priority targets.\n- Geological modelling, including detailed televiewer interpretation, to deliver a resource model that honours Glenburgh's folded and metamorphosed geometry.\n- Progress towards an updated Mineral Resource Estimate once the majority of planned drilling is complete, ensuring it reflects the full scale of the Project's potential.\n- Mt Egerton Gold Project (WA):\n- Exploration targeting high-grade near-surface mineralisation through RC drilling, mapping, and geochemical surveys.\n- Eastmain Gold Mine (Quebec, Canada):\n- Scoping Study to assess early-stage technical and economic development options for the high-grade resource.\n- General:\n- Working capital and corporate costs.\nPlacement Details\nThe Placement was undertaken at an issue price of A$0.985, being the closing share price on the ASX on Friday, 8 August 2025.\nThe Company will issue 30,406,091 CDIs under its existing placement capacity under ASX Listing Rule 7.1 (Tranche 1 Placement).\nA Director of the Company intends to subscribe for 50,762 CDIs (A$50,000) in the Placement (Tranche 2 Placement), subject to shareholder approval at a general meeting that will be held in due course.\nIt is anticipated that settlement of the Tranche 1 Placement will occur on Wednesday, 20 August 2025 and the CDIs will be allotted and commence trading on Thursday, 21 August 2025. The Tranche 2 Placement is expected to complete in early October 2025. The Placement CDIs will rank equally with existing CDIs from the date of issue.\nEuroz Hartleys Limited acted as Lead Manager to the Placement.\nThis announcement has been approved for release by the Board.\nFor more information please contact:\nMark Lynch-Staunton\nChief Executive Officer\nBenz Mining Corp.\nE: mstaunton@benzmining.com\nT: +61 8 6143 6702\nAbout Benz Mining Corp.\nBenz Mining Corp. (TSXV: BZ) (ASX: BNZ) is a pure-play gold exploration company dual-listed on the TSX Venture Exchange and Australian Securities Exchange. The Company owns the Eastmain Gold Project in Quebec, and the recently acquired Glenburgh and Mt Egerton Gold Projects in Western Australia.\nBenz's key point of difference lies in its team's deep geological expertise and the use of advanced geological techniques, particularly in high-metamorphic terrane exploration. The Company aims to rapidly grow its global resource base and solidify its position as a leading gold explorer across two of the world's most prolific gold regions.\nThe Glenburgh Gold Project features a Historical (for the purposes of NI 43-101) Mineral Resource Estimate of 16.3Mt at 1.0 g/t Au (510,100 ounces of contained gold)2. A technical report prepared under NI 43-101- Standards of Disclosure for Mineral Projects (NI 43-101) titled \"NI 43-101 Technical Report on the Glenburgh - Egerton Gold Project, Western Australia\" with an effective date of 16 December 2024 has been filed with the TSX Venture Exchange and is available under the Company's profile at www.sedarplus.ca.\nThe Eastmain Gold Project in Quebec hosts a Mineral Resource Estimate dated effective May 24, 2023 and prepared in accordance with NI 43-101 and JORC (2012) of 1,005,000 ounces at 6.1g/t Au3, also available under the Company's profile at www.sedarplus.ca, showcasing Benz's focus on high-grade, high-margin assets in premier mining jurisdictions.\nTo view an enhanced version of this graphic, please visit:\nhttps://images.newsfilecorp.com/files/1818/262316_7450fd1d84517b6d_001full.jpg\nFor more information, please visit: https://benzmining.com/.\nQualified Person's Statement (NI 43-101)\nThe disclosure of scientific or technical information in this news release is based on, and fairly represents, information compiled by Mr Mark Lynch-Staunton, who is a Qualified Person as defined by NI 43-101 and a Member of Australian Institute of Geoscientists (AIG) (Membership ID: 6918). Mr Lynch-Staunton has reviewed and approved the technical information in this news release. Mr Lynch-Staunton owns securities in Benz Mining Corp.\nHistorical Mineral Resource Estimates\nAll mineral resource estimates in respect of the Glenburgh Gold Project in this news release are considered to be \"historical estimates\" as defined under NI 43-101. These historical estimates are not considered to be current and are not being treated as such. These estimates have been prepared in accordance with the Australasian Code for Reporting of Exploration Results, Mineral Resources and Ore Reserves prepared by the Joint Ore Reserves Committee of the Australasian Institute of Mining and Metallurgy, Australian Institute of Geoscientists and Minerals Council of Australia (JORC Code) and have not been reported in accordance with NI 43-101. A qualified person (as defined in NI 43-101) (Qualified Person) has not done sufficient work to classify the historical estimates as current mineral resources. A Qualified Person would need to review and verify the scientific information and conduct an analysis and reconciliation of historical data in order to verify the historical estimates as current mineral resources.\nForward-Looking Statements\nStatements contained in this news release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively Forward-Looking Information) as such term is used in applicable Canadian securities laws. Forward-Looking Information includes, but is not limited to, disclosure regarding the acquisition of the Glenburgh and Mt Egerton projects as well as certain tenements adjacent thereto and the anticipated benefits thereof, planned exploration and related activities on the Glenburgh and Mt Egerton projects. In certain cases, Forward-Looking Information can be identified by the use of words and phrases or variations of such words and phrases or statements such as \"anticipates\", \"complete\", \"become\", \"expects\", \"next steps\", \"commitments\" and \"potential\", in relation to certain actions, events or results \"could\", \"may\", \"will\", \"would\", be achieved. In preparing the Forward-Looking Information in this news release, the Company has applied several material assumptions, including, but not limited to, that the tenements associate with the Glenburgh and Mt Egerton projects that are still pending grant or undergoing the renewal process will be granted and/or renewed, as applicable, in the timely manner and on reasonable terms, and all conditions precedent to completion of the acquisitions will be satisfied, in a timely manner; the Company will be able to raise additional capital as necessary; the current exploration, development, environmental and other objectives concerning the Company's Projects (including Glenburgh and Mt Egerton) can be achieved; and the continuity of the price of gold and other metals, economic and political conditions, and operations.\nForward-looking information is subject to a variety of risks and uncertainties and other factors that could cause plans, estimates and actual results to vary materially from those projected in such forward-looking information. Factors that could cause the forward-looking information in this news release to change or to be inaccurate include, but are not limited to, the risk that any of the assumptions referred to prove not to be valid or reliable, that occurrences such as those referred to above are realized and result in delays, or cessation in planned work, that the Company's financial condition and development plans change, and delays in regulatory approval, as well as the other risks and uncertainties applicable to the Company as set forth in the Company's continuous disclosure filings filed under the Company's profile at www.sedarplus.ca and www.asx.com.au. Accordingly, readers should not place undue reliance on Forward-Looking Information. The Forward-looking information in this news release is based on plans, expectations, and estimates of management at the date the information is provided and the Company undertakes no obligation to update these forward-looking statements, other than as required by applicable law.\nNEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ACCURACY OR ADEQUACY OF THIS RELEASE.\n1 Based on Benz's closing cash of A$10m as at 30 June 2025 and adjusted for gross Placement proceeds (excludes transaction costs).\n2 Indicated: 13.5Mt at 1.0g/t Au for 430.7koz; Inferred: 2.8Mt at 0.9g/t Au for 79.4koz. See Historical Mineral Resource Estimates, below\n3 Indicated: 1.3Mt at 9.0g/t Au for 384koz; Inferred: 3.8Mt at 5.1g/t Au for 621koz\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/262316"
    }
  ],
  "argos_summary": "Benz Mining Corp. has successfully raised A$30 million through a placement of new CHESS Depositary Interests, bolstered by strong demand from institutional investors. This funding will enable the company to double its drilling capacity to four rigs at the Glenburgh Gold Project in Western Australia, accelerating exploration activities and resource growth. The focus will be on the emerging bulk tonnage gold system at Icon and the high-grade Zone 126 trend, with plans for geological modeling and an updated Mineral Resource Estimate.",
  "argos_id": "LGNYKMTG5"
}