{
  "url": "https://www.usatoday.com/story/news/local/washington/2025/08/12/washington-state-farmers-almanac-2025-2026-winter-forecast/85628381007/",
  "authorsByline": "Andre Byik, Mike Snider",
  "articleId": "5d81a28d5f2646bfbd6cbb5b4d16a33a",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/12/PASH/85627641007-screenshot-20250812-at-124307-pm.png?crop=1191,670,x0,y274&width=1191&height=670&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:22:34+00:00",
  "addDate": "2025-08-12T21:38:15.431862+00:00",
  "refreshDate": "2025-08-12T21:38:15.431863+00:00",
  "score": 1.0,
  "title": "Farmers' Almanac winter forecast for Washington state is in. See 2025-26 seasonal outlook",
  "description": "The Farmers' Almanac 2025-2026 predicts an \"old-fashioned\" winter for much of the United States. But what about Washington state?",
  "content": "Periods of exceptionally hot temperatures have made Washington sweat this summer, but the state could be in for some welcome relief come late fall and winter.\n\nThat's because the recently released 209th edition of the Farmers' Almanac forecasts \"Chill, Snow, Repeat\" weather patterns for the upcoming 2025-2026 winter season.\n\nFarmers' Almanac Editor Sandi Duncan delivered the details to USA TODAY. Here's what the outlook looks like for Washington state and the rest of the country.\n\nWhat is the winter forecast for the Pacific Northwest?\n\nGood news for skiers in Washington, Idaho, and Oregon, because overall chilly and wet conditions are expected this winter. \"The wet conditions obviously in the mountains are going to help that snow pack … (for) skiing,\" Duncan said.\n\nThe Pacific Northwest's mountains \"are gearing up for some impressive snowfall totals,\" the Almanac says.\n\nFor coastal Washington in the middle of February and March, \"we're calling for a lot of wet conditions, especially along the coast,\" with rainstorms, Duncan said.\n\nWhat does the Farmers' Almanac forecast for winter in the US?\n\nThe cold and snow may not reach as far south as last year, but the Northern Plains to New England are likely in for a cold, snowy winter, \"hopefully not as brutally cold as last,\" Duncan said.\n\n\"Most of the country is on tap for a cold or very cold winter, kind of almost going back to an old-fashioned winter,\" Duncan said. \"It's going to cool down, it's going to snow, then it might warm up a little, then it's going to repeat itself again.\"\n\nEven though the upcoming winter may not bring a repeat of last year's prolonged bone-chilling temperatures, the upcoming season's expected weather cycle means \"this winter’s shaping up to be a wild ride,\" the Almanac predicts.\n\nWintery effects may begin in late fall as cold winter temperatures could \"sneak in a little bit early in many of the northern sections,\" Duncan said.\n\nWhile winter doesn't officially start until Dec. 21, \"we do see some very cold conditions, kind of blowing in with some possible snow in some areas,\" she said. \"I think the greatest chance of a White Christmas would be out in the northern Plains, perhaps, but not too many other places.\"\n\nWinter could linger, too. \"It looks like it's going to hang on for a little bit through March and even through April … especially in New England, Great Lakes and the northern Plains,\" Duncan said.\n\nDid the Farmers' Almanac get its winter weather prediction right last year?\n\nIn part, the Almanac proffers, mentioning in the new edition how its winter 2024-2025 forecast \"for a mild winter in Texas and the Southern Plains hit the mark, and we correctly called the cold weather over the Northern Plains and Great Lakes.\"\n\nThe Almanac notes, \"We also accurately forewarned of a very cold spell at the end of January,\" perhaps referencing some of winter 2024-2025's milestones, including the arctic air mass that contributed to cold weather advisories that month. \"But La Niña threw a curveball, leaving us with fewer wet weather events than expected,\" the Almanac said.\n\nFebruary also brought dangerously cold temperatures, but overall, the contiguous U.S. had the third warmest winter on record, according to the National Oceanic and Atmospheric Administration, with an average temperature of 34.1 degrees F, 1.9 degrees above average.\n\nThere's a chance a La Niña winter could be in store, according to the Climate Prediction Center. That could mean cold and snow for the Northwest, dry conditions in the South, and higher-than-average temperatures in the Southeast and Mid-Atlantic.\n\nThe Farmers' Almanac creates its forecasts \"using a proprietary formula that adapts to the mysteries of nature and the ever-changing world in which we live,\" this edition notes. \"The basis of our prediction method was developed by our founding editor according to correlations between celestial events and various meteorological conditions.\"\n\nWhile scientists may question the accuracy of The Farmers' Almanac — and the competing The Old Farmer's Almanac — the guide, which includes planting tips and an astronomical calendar, remains an interesting read.\n\nWhat does NOAA predict for winter in Washington state?\n\nThe Climate Prediction Center at the National Oceanic and Atmospheric Administration says the temperature outlook in Western Washington for the winter months of January, February, and March is leaning toward there being below-normal temperatures for the region. There are equal chances for temperatures to be below or above normal in Eastern Washington.\n\nThere are also equal chances for below normal or above normal precipitation across Washington state for the same three-month period in 2026, according to NOAA.\n\nWhen does fall start in 2025?\n\nFall starts on Sept. 22, 2025, according to Time and Date.\n\nWhen does daylight saving time end in 2025?\n\nDaylight saving time ends in Washington state at 2 a.m. PT on Nov. 2, 2025, according to Time and Date. This is when clocks will turn back one hour, to 1 a.m.\n\nWhen does winter start in 2025?\n\nWinter starts on Dec. 21, 2025, in the Northern Hemisphere, according to Time and Date.",
  "medium": "Article",
  "links": [
    "https://www.cpc.ncep.noaa.gov/products/predictions/long_range/seasonal.php?lead=6",
    "https://www.timeanddate.com/calendar/autumnal-equinox.html",
    "https://www.usatoday.com/story/news/nation/2025/01/20/winter-weather-forecast-updates-extreme-cold-snow/77834883007/",
    "https://www.usatoday.com/story/news/weather/2025/02/18/record-cold-surges-across-central-u-s/79064390007/",
    "https://www.noaa.gov/news/despite-arctic-air-outbreaks-us-had-warm-dry-winter-on-average",
    "https://www.farmersalmanac.com/",
    "https://www.cpc.ncep.noaa.gov/products/analysis_monitoring/enso_advisory/ensodisc.shtml",
    "https://www.usatoday.com/story/news/weather/2024/08/12/farmers-almanac-winter-weather-forecast-2024-2025/74603654007/#Texas",
    "https://www.usatoday.com/story/life/food/2025/07/11/when-will-in-n-out-open-washington-how-to-order-off-secret-menu/84645448007/",
    "https://www.usatoday.com/story/news/local/washington/2025/07/11/8-washington-colleges-4-plus-stars-money-2025-best-colleges-america/84590873007/",
    "https://www.usatoday.com/story/news/local/washington/2025/06/30/what-direction-should-your-ceiling-fan-go-for-summer-washington-state-heat/84415631007/",
    "https://www.timeanddate.com/time/change/usa",
    "https://www.usatoday.com/story/news/weather/2025/01/30/spring-2025-forecast-old-farmers-almanac/78021490007/",
    "https://www.usatoday.com/story/news/weather/2025/07/10/la-nina-may-develop-later-in-2025/84531009007/",
    "https://www.timeanddate.com/calendar/winter-solstice.html",
    "https://www.usatoday.com/story/news/local/washington/2025/06/27/best-places-for-renters-to-live-in-2025-washington-state-seattle/84385651007/",
    "https://www.usatoday.com/story/news/local/washington/2025/07/07/trump-raises-entry-fees-national-parks-dei-changes-how-it-affects-washington-state/84491207007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cold winter temperatures",
      "weight": 0.12098818
    },
    {
      "name": "Winter",
      "weight": 0.0963822
    },
    {
      "name": "winter",
      "weight": 0.0963822
    },
    {
      "name": "Washington state",
      "weight": 0.08311508
    },
    {
      "name": "cold weather advisories",
      "weight": 0.08073536
    },
    {
      "name": "Almanac",
      "weight": 0.07476418
    },
    {
      "name": "Farmers Almanac winter forecast",
      "weight": 0.07227866
    },
    {
      "name": "temperatures",
      "weight": 0.070544064
    },
    {
      "name": "Western Washington",
      "weight": 0.07004179
    },
    {
      "name": "Washington",
      "weight": 0.069650434
    }
  ],
  "topics": [
    {
      "name": "Local Weather"
    }
  ],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Weather",
      "score": 0.96435546875
    },
    {
      "name": "/News/Local News",
      "score": 0.60595703125
    }
  ],
  "sentiment": {
    "positive": 0.23745973,
    "negative": 0.31274518,
    "neutral": 0.44979507
  },
  "summary": "The Farmers' Almanac has released its 209th edition, which forecasts \"Chill, Snow, Repeat\" weather patterns for the 2025-2026 winter season. The Pacific Northwest is expected to see chilly and wet conditions, particularly for coastal Washington. The Northern Plains to New England are expected to be in for a cold, snowy winter, according to the Almanac's Editor Sandi Duncan. While winter doesn't officially start until Dec. 21, winter could linger through March and even through April, especially in New England, Great Lakes and the northern Plains. The Almanac also notes that its predictions accurately forecast a mild winter in Texas and the Southern Plains and accurately predicted a cold spell at the end of January.",
  "shortSummary": "The Farmers' Almanac's winter forecast for Washington state predicts chilly, snowfall, and potentially cold weather across the rest of the US, with potential for La Niña winter.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8b03f5266b6f48b38a9ca68e0d93f69f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/news/weather/2025/02/18/record-cold-surges-across-central-u-s/79064390007/",
      "text": "'Warming up to 24 below zero:' Record cold surges across central U.S.\nA bitter blast of Arctic air – which is related to the polar vortex – is roaring south across the central U.S. Tuesday, bringing with it record-cold temperatures and \"dangerously\" low wind chills. Extreme cold warnings and cold weather advisories span the northern Plains and upper Midwest down to central Texas.\n\"Some of the harshest conditions of the winter will be felt in the upcoming five to seven days,\" said AccuWeather meteorologist Alex Sosnowski in an online forecast.\n\"Be sure to dress in layers including a hat, face mask, and gloves if you must go outside,\" the National Weather Service advised.\nOver a hundred daily record lows could be set from the Plains to the northern Gulf Coast through Friday mornings, Weather.com reported. Some of that cold air will also spill into the East, including much of Florida.\n\"The cold will envelop the entire nation east of the Mississippi from late (this) week into (the) weekend,\" AccuWeather senior meteorologist Joe Lundberg said.\nHow cold will it get?\nWith the frigid air mass's continued southward plunge, temperatures well below zero are forecast from Montana and the Dakotas to the Upper Midwest and sections of the central Plains, with minus 30s near the Canadianborder by Wednesday morning, the weather service said.\nWind chills will reach dangerously cold levels between minus 30 and minus 60 degrees in these areas. \"The wind chills could cause frostbite on exposed skin in minutes, and hypothermia shortly thereafter,\" the weather service in Bismarck, North Dakota, said.\nHigh temperatures are forecast to only stay in the single digits for the next couple of afternoons in the central Plains, setting numerous cold high-temperature records.\nBy Thursday morning, the arctic air will reach the Gulf Coast, where temperatures are forecast to dip below freezing with numerous low-temperature records expected to be broken from the central Plains southward to the Gulf Coast.\n“On Thursday morning, 87% of the contiguous United States will have temperatures below freezing,” WGN-TV weather producer Bill Snyder told Block Club Chicago. “It’s a pretty impressive breed of cold we’re going to endure.”\n'Warmed up to 24 below zero'\nIn Minot, North Dakota, city spokeswoman Jen Kleen her car's temperature gauge said it was minus 32 degrees while she was driving to work on Tuesday morning. It had warmed up to minus 24 degrees by the time she'd arrived.\n\"At a certain point, you can only put on so many layers,\" she said.\nA water main beneath one of the city's main streets burst Monday, flooding and freezing an intersection, and crews worked for hours in minus 20-degree temperatures to make repairs, Kleen said. She said residents are trickling their faucets to prevent freezing pipes, and worried that the cold may cause power lines to snap.\n\"We have a lot of appreciation for our utilities folks who are keeping us going,\" Kleen said. \"We have one more night of the really cold stuff. By next Friday maybe it will be 40 degrees out.\"\nAsphalt failing in North Dakota\nIn Bismarck, North Dakota, state patrol Sgt. Jenna Clawson Huibregtse said the extreme cold has been causing problems for drivers, in part, because asphalt patches on the roads are failing, buckling and causing flat tires. She said she's been reminding troopers to keep every bit of skin covered when they're outside – even to the point of wearing ski goggles if necessary.\n\"People are saying at least it's not windy,\" she said. \"We just try to hold onto those happy thoughts about warmer weather and wait for things to warm up.\"\nFrigid, then mild in Chicago\nIn Chicago, after several days of bitter cold, some milder air will be on the way. High temperatures will reach the 20s by the end of the week, the 30s by the weekend and the 40s by early next week, according to Snyder of WGN-TV.\n“Seven days from now, you’re going to have temperatures that feel 50 to 60 degrees, if not even more, warmer than we have this week,” Snyder said to Block Club Chicago.\n“It’s amazing how fast things can change!” he said.\nCold reaches to Colorado\nAcross Colorado, the cold temperatures arrived following a welcome dumping of snow for ski resorts. Vail reported 53 inches of snowfall over the past week, but temperatures on Monday night fell to about zero overnight and were expected to drop even further Tuesday night, with some forecasts calling for minus 3 degrees.\nIn response to the cold, Denver city officials opened a temporary around-the-clock warming shelter for people living without permanent shelter. Cold temperatures are one of the biggest causes of death and injury for unhoused people.\nCrashes caused by the snow and cold prompted Colorado Department of Transportation officials to close portions of north-south Interstate 25 near the Wyoming border, and east near the Nebraska border, CDOT weather stations showed temperatures of around minus 8 degrees.\nDangerous in Dallas\nTemperatures and wind chills will plummet later today, reaching dangerously cold levels each night this week, the weather service in Dallas said. \"The coldest conditions will be Wednesday and Thursday mornings as a few locations experience wind chills near minus 10 degrees.\"\nThe weather service said that \"conditions will be life-threatening for unsheltered or marginally sheltered populations.\"\n\"Bundle up if you will be outdoors! Don't forget to check on your neighbors and pets! Protect outdoor pipes and let the indoor faucets drip.\""
    },
    {
      "url": "https://www.usatoday.com/story/news/weather/2025/07/10/la-nina-may-develop-later-in-2025/84531009007/",
      "text": "Global climate pattern shows signs of shifting. What will happen in the US?\nEarly signs of a possible La Niña fall and winter are emerging in some climate models, federal forecasters announced July 10.\nLa Niña is a part of a natural climate cycle officially known as El Niño – Southern Oscillation, called ENSO by scientists. The cycle swings between warmer and cooler seawater in a region along the equator in the tropical Pacific. La Niña is marked by cooler-than-average ocean water in the region.\nIt is one of the main drivers of weather in the United States, especially during the late fall, winter and early spring. It's the opposite of the more well-known El Niño, which occurs when Pacific Ocean water is at least 0.9 degree warmer than average for three months.\nLa Niña and El Niño typically have minimal impact on summer weather in the United States, other than some effects on hurricanes. Winter is the one season when they have the most impact.\nA typical La Niña winter in the United States brings cold and snow to the Northwest and unusually dry conditions to most of the Southern states, according to the Climate Prediction Center. The Southeast and mid-Atlantic also tend to see higher-than-average temperatures during a La Niña winter.\nMeanwhile, New England and the Upper Midwest, including New York, tend to see lower-than-average temperatures, the Weather Channel said.\nMap shows what a La Niña could mean for winter 2025-2026\nThe typical impacts of a La Niña winter in North America include a wetter, colder winter in parts of the northern United States and a drier, warmer winter in parts of the southern United States.\nWhat is La Niña?\nLa Niña is a natural climate pattern marked by cooler-than-average seawater in the central and eastern Pacific Ocean. When the water cools at least 0.9 degree Fahrenheit below average for three straight months, a La Niña is declared.\n\"While this may sound like a small change in temperature, it can cause significant changes in the weather patterns around the globe,\" AccuWeather meteorologist Brian Lada said.\nCould the possible La Niña affect the hurricane season?\nIn general, La Niña conditions favor hurricane development in the Atlantic basin, which includes the Caribbean Sea and the Gulf of America, formerly known as the Gulf of Mexico. This is because during La Niña, the strong storm-killing winds known as wind shear relax across the Atlantic basin, allowing hurricanes to more easily develop.\nHurricane researcher Phil Klotzbach of Colorado State University, in a July 10 email to USA TODAY, explained that \"while Caribbean shear has been quite strong in June and is likely to remain strong throughout most of July, the potential trend more towards cool neutral (or even weak La Niña) later in the season may result in lower shear in the Caribbean later in the season.\"\nThe lower the wind shear, the greater the chance for hurricane development in the Atlantic basin.\nBut the status of ENSO is only part of the hurricane puzzle: Twenty years ago, in 2005, for instance, ENSO-neutral conditions also occurred in the Pacific ‒ and that year spawned the infamously destructive hurricanes Katrina and Rita, the National Weather Service said in an online report.\nHow likely is a La Niña winter?\nRight now, it appears to be a toss-up.\nWhile so-called \"ENSO-neutral\" conditions are most likely through the late summer, thereafter, chances of La Niña conditions increase into the fall and winter 2025-26, forecasters from the Climate Prediction Center (CPC) said July 10. In fact, one climate model used by the CPC – the North American Multi-Model Ensemble – \"favors the onset of La Niña conditions during the Northern Hemisphere fall,\" the CPC said in its monthly update.\nJapan's weather bureau also announced July 10 that there is a 40% chance of La Niña emerging in the fall.\nOverall, the CPC said the chances for La Niña remain comparable to the likelihood of ENSO-neutral continuing.\nWhat is ENSO-neutral?\nENSO-neutral means neither El Niño (warmer waters) nor La Niña (cooler waters) conditions are dominant in the Pacific. While El Niño and La Niña have expected impacts on global seasonal weather and climate, what about neutral?\n\"ENSO-neutral doesn’t mean we expect upcoming seasonal rain, snow, and temperature to be close to average,\" writes Emily Becker in the CPC's ENSO blog. \"Rather, during neutral, we don’t have the same predictive information that El Niño and La Niña’s atmospheric changes provide, making upcoming patterns harder to predict very far in advance.\"\nContributing: Reuters"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/01/20/winter-weather-forecast-updates-extreme-cold-snow/77834883007/",
      "text": "Wind chills 55 below; snow and ice in Florida: Extreme cold invading US\nAn arctic air mass sprawling across the eastern, central and parts of the western U.S. on Monday will channel temperatures 20-30 degrees below already historically cold January averages and is poised to slam parts of the South with a disruptive winter storm.\nFreeze warnings were in place along much of the Gulf Coast and northern Florida. The combination of cold air and a developing low pressure system will set the stage for a \"rare, significant winter storm\" in the region, National Weather Prediction Center forecaster Bryan Putnam said.\nThe storm began late Monday across eastern and southern Texas and figures to roll eastward along the Gulf Coast and through the Southeast on Tuesday and Wednesday, Putnam said. Heavy snow is expected along and north of the Interstate 10 corridor with swaths of sleet and freezing rain over portions of southern Texas, southeast Georgia and northern Florida.\nThe National Weather Service office in Houston reported broadening sleet and snow showers at 6:45 p.m. CT, adding that they would get more intense overnight and urging motorists to stay off the road.\nThe cold front could extend for as much as 1,000 miles along the highway while closing off travel and shutting down power on that corridor for a prolonged period, AccuWeather said.\nSouthern cities await rare wintry slam\nMajor southern United States cities bracing for a wintry hit include Austin, San Antonio and Houston in Texas; New Orleans and Baton Rouge in Louisiana; Jackson and Biloxi in Mississippi; Mobile in Alabama; Savannah in Georgia; and Pensacola, Tallahassee and Jacksonville in Florida, AccuWeather warned.\nNew Orleans hasn't seen measureable snowfall since 2009. It has been 35 years for Jacksonville. In Texas, the Austin school district and numerous surrounding districts already have canceled classes for Tuesday.\n\"This will be a rare and especially dangerous winter storm right along the upper Gulf Coast that will result in major and lengthy disruptions to travel,\" AccuWeather chief meteorologist Jonathan Porter said.\nWeather disrupts travel, alters inauguration\nIn addition to flight delays and cancellations − Houston's Bush Airport had by far the most canceled flights with 102 as of 6:30 p.m. CT − the winter blast may cause power outages in areas of significant snow and ice, Putnam said.\nHighs will only reach the teens and 20s for New England and the Mid-Atlantic states. That was enough for officials in Washington, D.C., to move the presidential inauguration indoors − for the first time in 40 years.\nWith a noon temperature of 27 degrees, 10 below the norm, Monday's was the fifth coldest inauguration day on record, according to the National Weather Service. That pushed down the Jimmy Carter (Jan 20, 1977) and Barack Obama (Jan 20, 2009) inaugurations into a tie for sixth place.\n− Contributing: Dinah Voyles Pulver\nHouston airports to close ahead of storm\nUp to 4 inches of snow was forecast for Houston overnight Monday into Tuesday. The National Weather Service in Houston warned on social media of dangerous road conditions through Wednesday morning: \"DO NOT TRAVEL IF POSSIBLE! If you must drive, TAKE IT SLOW! Be extremely cautions, especially on bridges and overpasses. Even cars with four-wheel drive can lose traction.\"\nThe city's two major airports plan to close at midnight. Operators of the airports, George Bush Intercontinental and William P. Hobby, said the decision was in response to anticipated hazardous road conditions.\n\"While there will be no departing or arriving flights, our dedicated teams will remain on-site 24/7, working diligently to prepare for a swift and safe return to normal operations when weather permits,\" the airport authority said in a statement.\n− Zach Wichter\n'Life-threatening' temps could reach 55 degrees below zero\nTemperatures over the next few days are forecast to climb no higher than the negative teens and single digits in the Upper Midwest to single digits and teens in the Rockies, central Plains and Midwest.\n\"Life-threatening wind chills of 30 to 55 degrees below zero at times are expected across the Rockies, northern Plains, and Upper Midwest through Tuesday morning,\" Putnam said.\nThe deep freeze is likely to maintain its grip on the eastern and southern U.S. through the next few days, Putnam said. The nation's interior, however, could begin to warm up as soon as Tuesday, when some areas will see highs back into the 20s, 30s and 40s.\nSnow coming to Mississippi\nMississippi Gov. Tate Reeves had declared a state of emergency ahead of Tuesday's anticipated storms. Temperatures are expected to drop below freezing each day this week, according to the latest forecast. Central Mississippi, including the Jackson area, was expected to get up to 2 inches of snow.\nHattiesburg and much of South Mississippi, including Natchez, were under a \"significant threat\" of snow, and 2-4 inches was likely, forecasters said.\n− Mississippi Clarion Ledger\nFlorida's capital city braces for wintry mix\nSouth-central Georgia and Florida's Big Bend area could see ice totals between a tenth and a quarter of an inch. Tallahassee could get a dusting of snow and a quarter of an inch of ice − enough to make roads impassable and knock out power lines from the winter storm forecast to hit the capital area.\n“Confidence continues to increase on the potential for an impactful winter weather event late Tuesday afternoon-Wednesday morning,” the National Weather Service in Tallahassee said. The freezing rain, sleet, snow and rain are expected Tuesday night into Wednesday. Tallahassee is in Leon County, where public schools already have decided to close Wednesday. Florida A&M University also will be closed, and more closures, delays and postponements are expected.\n− William L. Hatfield and Jeff Burlew, Tallahassee Democrat\nLos Angeles hoping to avoid another fire amid intense winds\nOn the other side of the spectrum from the frigid temperatures across much of the country is the Los Angeles area, which is still trying to put out two large fires while hoping no other blazes ignite during the latest round of ferocious Santa Ana winds.\nThe NWS office in Los Angeles is warning of a \"powerful & damaging'' windstorm that will make for extreme fire weather Monday and Tuesday through 10 a.m., with gusts of 50-70 mph in the coasts and valleys and 60-100 mph in the mountains and foothills.\nTemperatures in L.A. are expected to rise into the mid and high 70s with no hint of precipitation through Friday, before a cold front moves in over the weekend and brings at least a chance of desperately needed rain and a cooling effect.\nIn response to the hazardous conditions, Los Angeles Fire Department officials said they have pre-positioned 30 engines in areas of high fire danger and extended the duty hours of hundreds of firefighters. The department said it quickly extinguished a small brush fire Monday below the Griffith Observatory and structures at risk did not sustain any damage.\nThe Palisades and Eaton fires, which have combined to kill at least 27 people and destroy more than 15,000 structures, were 59% and 87% contained, respectively, as of the latest Cal Fire updates around noon Monday."
    },
    {
      "url": "https://www.usatoday.com/story/news/local/washington/2025/07/07/trump-raises-entry-fees-national-parks-dei-changes-how-it-affects-washington-state/84491207007/",
      "text": "Trump orders price hikes to enter national parks. How it affects Washington state\nPresident Donald Trump has issued an executive order that would make it more expensive for international tourists to visit national parks in Washington state and across the country.\nTrump's July 3 executive order directs Interior Secretary Doug Burgum to raise the prices of entrance fees and recreation passes, such as the America the Beautiful Pass, at areas in the National Park System for non-U.S. residents.\n\"From the awe-inspiring Grand Canyon to the tranquility of the Great Smoky Mountains, America’s national parks have provided generations of American families with unforgettable memories,\" Trump said in the order. \"It is the policy of my Administration to preserve these opportunities for American families in future generations by increasing entry fees for foreign tourists, improving affordability for United States residents, and expanding opportunities to enjoy America’s splendid national treasures.\"\nAny additional money generated by the price hikes must be used to \"improve the infrastructure of, or otherwise enhance enjoyment of or access to\" federal recreation areas, the order states.\nThe new order also rescinds former President Barack Obama's 2017 memorandum, \"Promoting Diversity and Inclusion in our National Parks, National Forests, and Other Public Lands and Waters,\" which supported efforts to broaden the federal workforce and improve park access for underserved populations.\nHow does Trump's order affect national parks in Washington state?\nIt was unclear when the fee increases could be implemented at national parks or by how much prices would be raised for international visitors.\nBurgum acknowledged Trump's order on X, stating that it would make national parks more affordable for U.S. residents and make sure \"visitors from around the world contribute to preservation.\" He didn't elaborate on any specific adjustments in the post.\nThe National Park Service referred USA TODAY Network to Burgum's X post when reached for comment.\nThe change would affect millions of visitors to U.S. national parks. More than 13 million overseas travelers visited national parks in 2016, the nonprofit U.S. Travel Association reported, citing the figures from the National Travel and Tourism Office. That number was expected to reach 14 million in 2018.\nThe National Park Service's website states that most areas don't charge a fee to get in, but some do. The website lists the sites in Washington state that currently require an entrance fee, along with their associated costs:\nFort Vancouver National Historic Site\n- State: Washington, Oregon\n- Entrance pass: Standard pass, $10; Annual pass, $35; America the Beautiful Pass, free-$80\nLewis and Clark National Historic Park\n- State: Washington, Oregon\n- Entrance pass: Standard pass, $10; Annual pass, $35; America the Beautiful Pass, free-$80\nMount Rainier National Park\n- State: Washington\n- Entrance pass: Standard pass, $15-$30; Annual pass, $55; America the Beautiful Pass, free-$80\nOlympic National Park\n- State: Washington\n- Entrance pass: Standard pass, $15-$30; Annual pass, $55; America the Beautiful Pass, free-$80\nPlaces such as North Cascades National Park, Lake Roosevelt National Recreation Area, and San Juan Island National Historic Park, among other sites in Washington, don't charge entrance fees, according to the National Park Service website.\nWhat are the free entrance days for national parks in 2025?\nHere are the remaining days in 2025 when all National Park Service sites will offer free admission to all visitors, according to the Department of the Interior's website:\n- Wednesday, July 16: Bureau of Land Management’s birthday\n- Monday, Aug. 4: Great American Outdoors Day\n- Saturday, Sept. 27: National Public Lands Day\n- Sunday, Oct. 12: first Sunday of National Wildlife Refuge Week\n- Tuesday, Nov. 11: Veterans Day\nContributing: Eve Chen, USA TODAY\n(This story was updated with new information.)"
    },
    {
      "url": "https://www.timeanddate.com/calendar/autumnal-equinox.html",
      "text": "When Is the First Day of Fall 2025 and 2026?\nNorth of the equator, fall begins in September; in the Southern Hemisphere, it starts in March. Find out the exact dates and how the fall season is defined.\nEqual day and night? It can also happen in June!\nFall 2025 & 2026 Dates\nAccording to the astronomical definition, fall begins with the autumnal equinox. In the Northern Hemisphere, it's the September equinox; south of the equator, it is the equinox in March.\nEquinoxes and solstices in your city\nAutumn Equinox, Northern Hemisphere (September)\nNorth America, Europe, most of Asia, Northern Africa\nIn Malmö, Sweden: måndag den 22 september 2025, 20:19 CEST (Change location)\nThis corresponds to måndag den 22 september 2025, 18:19 UTC.\nAutumn Equinox, Southern Hemisphere (March)\nAustralia, New Zealand, South America, southern Africa\nIn Malmö, Sweden: fredag den 20 mars 2026, 15:46 CET (Change location)\nThis corresponds to fredag den 20 mars 2026, 14:46 UTC.\nAlternative Fall Start Dates\nMeteorologists use a different method of defining the first day of fall. In some countries, the beginning of the seasons is determined by average temperatures rather than fixed dates or astronomical events.\nMeteorological and other seasons definitions\nDwindling Daylight around the Fall Equinox\nIn most locations on Earth—except for tropical regions—the start of fall is accompanied by rapidly shortening days.\nAt any given location, the day-to-day difference in day length is greatest around the days of the equinoxes. After the fall equinox, days still get shorter, but at an ever-decreasing rate. On the shortest day of the year, the winter solstice, the day-to-day difference reaches zero.\nLocations closer to the poles experience larger day-to-day differences:\n- In Toronto, the day of the fall equinox is just under 3 minutes shorter than the previous day.\n- In Miami, roughly 2000 kilometers or 1200 miles farther south, the difference is only about 1 minute and 30 seconds.\nDay-to-day differences in your city\nEqual Day and Night?\nAstronomical fall begins on the day of the equinox. The name derives from Latin and means equal night, giving the impression that both day and night are exactly 12 hours long. However, that is not entirely true. In most regions, the day of the equinox is a bit longer than 12 hours.\nEquilux\nThe date when day and night are actually equal is called the equilux. It falls a few days before the spring equinox and some days after the fall equinox in both hemispheres.\nOther astronomical terms & definitions\nFalling Temperatures\nIn the temperate zone, fall is also when the warm, stable weather of summer gives way to colder, more erratic weather conditions. However, this varies substantially from one region to another.\nClimate and monthly average temperatures in your city\nTraditions and Folklore\nThe start of autumn and the fall equinox are celebrated in cultures and religions around the world with various fall traditions, holidays, and festivals.\nFall festivals: Mabon, Navaratri, and the Snake of Light\nFall Months\nIn the Northern Hemisphere, astronomical and meteorological autumn runs from September to December. South of the equator, it starts in March and ends in June. Read more about the history and meaning of the fall months:\nNorthern fall months\nSeptember | October | November | December\nSouthern fall months\nHow Long Is Fall?\nEarth does not move at a constant speed in its elliptical (oval) orbit. This means the seasons are not equal in length. On average, fall lasts 89.8 days in the Northern Hemisphere and 92.8 days in the Southern Hemisphere.\nAverage season lengths:\n- March equinox to June solstice: 92.8 days\n- June solstice to September equinox: 93.6 days\n- September equinox to December solstice: 89.8 days\n- December solstice to March equinox: 89.0 days\nFall or Autumn?\nBoth fall and autumn are correct English terms for the season preceding winter. Autumn is primarily used in British English, while fall is a term more frequently used in American English."
    },
    {
      "url": "https://www.usatoday.com/story/news/local/washington/2025/06/30/what-direction-should-your-ceiling-fan-go-for-summer-washington-state-heat/84415631007/",
      "text": "What direction should your ceiling fan go for the summer? Cooling tips for Washington\nSummer means the arrival of warnings to stay cool in the heat.\nThe National Weather Service in Spokane reported that hot temperatures, ranging from the 90s to the lower 100s, are expected region-wide throughout Central Washington and Eastern Washington from today, Monday, June 30, to Wednesday, July 2.\nHigher temperatures also mean costlier electric bills. One way to find relief in the pocketbook and from the heat is to use ceiling fans to cool your home.\nBut what direction should a ceiling fan go in the summer?\nHere's what to know about fans to cool your home, as well as another possible cooling solution: a box fan.\nWhat direction should ceiling fans run in the summer?\nIn summer, ceiling fans should rotate counterclockwise when you look up at them, according to the U.S. Department of Energy. This direction pushes cool air downwards, creating a cooling breeze that helps you feel more comfortable.\nIn winter, reverse the direction to clockwise and set to low speed to circulate warm air from the ceiling down to the living spaces.\nInstallation tips for ceiling fans\nThe Department of Energy suggests these tips when installing a ceiling fan in your home:\n- Ensure ceilings are at least eight feet high.\n- Follow the manufacturer's instructions for optimal placement and safety.\n- Room Size: Use a 36- or 44-inch diameter fan for rooms up to 225 square feet. For larger rooms, use fans 52 inches or more. In rooms longer than 18 feet, multiple fans work best.\n- Blade Size: Larger blades move more air at lower velocities, which is helpful in areas where a strong breeze might disturb loose objects.\n- Look for the ENERGY STAR label to ensure efficiency. ENERGY STAR-certified ceiling fans are up to 60% more efficient than conventional models\nWhere to point your window or box fan: In or out?\nThe thing to remember about box fans is that they're great for pushing hot air out and sucking cool air in.\nExperts recommend placing window fans blowing air into your home on the coolest side of your house. Windows near shady, cooler outdoor areas usually provide the best intake, according to the Department of Energy.\nOn the western, or hottest side of your home, face your window fans so they're blowing air out of your house.\nWhat if my house has two floors?\nIf your house has more than one floor, consider putting the window fan facing out on the upper floor where indoor temperatures are usually hottest.\nHow much electricity do box fans use?\nIf you're going to go through the trouble of setting up a window or box fan, you probably want to know whether or not you're actually saving money, right?\nMost box fans use between 50-100 watts of power per hour, according to experts, who say a 20-inch box fan consumes about 50-75 watts per hour. That's about 50% more than your standard ceiling fan, but far less power than an air conditioner, which can use between 500-5,000 watts of electricity.\nYou might be wondering, then, how much that box fan will cost you in electricity every month. Fortunately, there's a simple formula you can use.\nHow much money does it cost to run a box fan?\nThe simple answer? Roughly 20 cents a day.\nThat's if you're running a 50-watt fan for 24 hours and the price of your electricity is $0.13/kWh — rounded down from 13.41 ¢/kWh — which is the average cost of residential electricity in Indiana, according to data from the U.S. Energy Information Administration.\nSo one box fan running nonstop typically costs only a few dollars a month. That amount can change periodically, so be sure to check your energy bill for the amount of electricity you pay for every kilowatt-hour of energy.\nFiguring out how much your appliances cost\nTo find out how much any appliance in your home will cost per hour, use this formula courtesy of Homes And Gardens.\nMultiply the appliance's wattage by the number of hours you want to use it. Divide by 1,000 and then multiply again by the cost per kilowatt-hour on your electric bill. The formula looks like this:\nCost = (power (in watts) x time (in hours)) / 1,000 x cost of one kilowatt-hour.\nSo, in our box fan example from above, the formula would be: (50 watts x 24 hours) / 1,000 x $0.17 per kilowatt-hour = $0.20."
    },
    {
      "url": "https://www.noaa.gov/news/despite-arctic-air-outbreaks-us-had-warm-dry-winter-on-average",
      "text": "February 2025 saw near-average temperatures, precipitation\nA near-average February wrapped up a relatively warm and dry winter for the U.S., according to experts from NOAA’s National Centers for Environmental Information (NCEI).\nBelow are highlights from NOAA’s February 2025 U.S. climate report:\nClimate by the numbers\nMeteorological winter (December 2024 – February 2025)\nMeteorological winter across the contiguous U.S. had an average temperature of 34.1 degrees F — 1.9 degrees above average — ranking in the warmest third of NOAA’s historical record.\nTotal winter precipitation was 5.87 inches, 0.92 of an inch below average, ranking in the driest third of the December–February climate record.\nFebruary 2025\nThe average temperature across the contiguous U.S. last month was 34.9 degrees F, 1.0 degree above the 20th-century average, ranked in the middle third of the climate record. February temperatures were generally above average across much of the Southwest, Gulf Coast and Southeast, and cooler-than-average from the Pacific Northwest to the northern and central Plains. Arizona had its second-warmest February on record.\nFebruary precipitation for the Lower 48 was 2.13 inches, which is average for the month. Precipitation was above average across much of the Northwest, as well as from the central Mississippi Valley to the East Coast and into parts of the Northeast. Drier-than-normal conditions were found across parts of the Southwest, Deep South to the Great Lakes and northern Plains, and in portions of the Southeast.\nOther notable climate events\nDrought coverage increased slightly: According to the March 4 U.S. Drought Monitor report offsite link, about 44.4% of the contiguous U.S. was in drought, up about 2% from the beginning of February. Drought conditions expanded or intensified across the Pacific Northwest, portions of the Southwest, Midwest, southern Plains and Hawaii. Drought lessened in coverage or intensity across parts of the Tennessee Valley, Mid-Atlantic, Northern Rockies and parts of the West Coast.\nBoth Alaska and Hawaii had a warm winter: The average winter temperature for Alaska was 13.6 degrees F — 10.0 degrees above average — ranking as the third-warmest meteorological winter in the state’s 101-year record. Hawaii had a winter temperature of 64.9 degrees F, 1.2 degrees above average, ranking as the state’s second-warmest meteorological winter on record.\nMore > Access NOAA’s latest climate report and download the images."
    },
    {
      "url": "https://www.timeanddate.com/time/change/usa",
      "text": "den 2 nov 2025, 02:00\n| Country: | United States |\n|---|---|\n| Long Name: | United States of America |\n| Abbreviations: | US, USA |\n| Capital: | Washington DC |\n| Time Zones: | 7 (Main Country) |\n| Total Time Zones: | 13 (with dependencies) |\n| Dial Code: | +1 |\n9 mar\nForward 1 hour\nden 9 mar 2025 - Daylight Saving Time Started\nWhen local standard time was about to reach\nsöndag den 9 mars 2025, 02:00:00 clocks were turned forward 1 hour to\nsöndag den 9 mars 2025, 03:00:00 local daylight time instead.\nSunrise and sunset were about 1 hour later on den 9 mar 2025 than the day before. There was more light in the evening and less light in the morning.\nAlso called Spring Forward, Summer Time, and Daylight Savings Time.\nMore info:\nTexas Moves Toward Permanent DST\nUS Starts Daylight Saving 2025\n2 nov\nBack 1 hour\nden 2 nov 2025 - Daylight Saving Time Ends\nWhen local daylight time is about to reach\nsöndag den 2 november 2025, 02:00:00 clocks are turned backward 1 hour to\nsöndag den 2 november 2025, 01:00:00 local standard time instead.\nSunrise and sunset will be about 1 hour earlier on den 2 nov 2025 than the day before. There will be more light in the morning and less light in the evening.\nAlso called Fall Back and Winter Time.\nMore info:\nTexas Moves Toward Permanent DST\nWhen Does DST Start and End in the US?\nDaylight Saving Time (DST) in most of the United States starts on the second Sunday in March and ends on the first Sunday in November.\nWhich States and Federal Districts use Daylight Saving Time in 2025\nDST in States and Federal Districts in USA | |||||\n|---|---|---|---|---|---|\n| Alabama | 9 mar – 2 nov | Kentucky | 9 mar – 2 nov | Ohio | 9 mar – 2 nov |\n| Alaska | 9 mar – 2 nov | Louisiana | 9 mar – 2 nov | Oklahoma | 9 mar – 2 nov |\n| Arizona (northeast) | 9 mar – 2 nov | Maine | 9 mar – 2 nov | Oregon | 9 mar – 2 nov |\n| Arizona | No DST | Maryland | 9 mar – 2 nov | Pennsylvania | 9 mar – 2 nov |\n| Arkansas | 9 mar – 2 nov | Massachusetts | 9 mar – 2 nov | Rhode Island | 9 mar – 2 nov |\n| California | 9 mar – 2 nov | Michigan | 9 mar – 2 nov | South Carolina | 9 mar – 2 nov |\n| Colorado | 9 mar – 2 nov | Minnesota | 9 mar – 2 nov | South Dakota | 9 mar – 2 nov |\n| Connecticut | 9 mar – 2 nov | Mississippi | 9 mar – 2 nov | Tennessee | 9 mar – 2 nov |\n| Delaware | 9 mar – 2 nov | Missouri | 9 mar – 2 nov | Texas | 9 mar – 2 nov |\n| District of Columbia | 9 mar – 2 nov | Montana | 9 mar – 2 nov | Utah | 9 mar – 2 nov |\n| Florida | 9 mar – 2 nov | Nebraska | 9 mar – 2 nov | Vermont | 9 mar – 2 nov |\n| Georgia | 9 mar – 2 nov | Nevada | 9 mar – 2 nov | Virginia | 9 mar – 2 nov |\n| Hawaii | No DST | New Hampshire | 9 mar – 2 nov | Washington | 9 mar – 2 nov |\n| Idaho | 9 mar – 2 nov | New Jersey | 9 mar – 2 nov | West Virginia | 9 mar – 2 nov |\n| Illinois | 9 mar – 2 nov | New Mexico | 9 mar – 2 nov | Wisconsin | 9 mar – 2 nov |\n| Indiana | 9 mar – 2 nov | New York | 9 mar – 2 nov | Wyoming | 9 mar – 2 nov |\n| Iowa | 9 mar – 2 nov | North Carolina | 9 mar – 2 nov | ||\n| Kansas | 9 mar – 2 nov | North Dakota | 9 mar – 2 nov |\nWhich States Don't Use DST?\nMost of Arizona and Hawaii don't use DST. Indiana introduced DST in 2006.\nDaylight Saving Time in Dependencies of USA\n| Dependency | Type | Daylight Saving Time Period |\n|---|---|---|\n| American Samoa | Unincorp. unorg. territory | No Daylight Saving Time |\n| Guam | Unincorp. org. territory | No Daylight Saving Time |\n| Northern Mariana Islands | Unincorp. org. territory | No Daylight Saving Time |\n| Puerto Rico | Unincorp. org. territory | No Daylight Saving Time |\n| US Minor Outlying Islands | Territory | No Daylight Saving Time |\n| US Virgin Islands | Unincorp. org. territory | No Daylight Saving Time |\nUS dependencies do not use Daylight Saving Time (DST).\nDaylight Saving Time History in United States\n- United States first observed Daylight Saving Time in 1918.\n- United States has observed DST for 108 years between 1918 and 2025 (DST in at least one location).\n- See Worldwide DST Statistics\nDST in the USA Today\nDaylight Saving Time (DST) in the USA starts on the second Sunday in March and ends on the first Sunday in November. The current schedule was introduced in 2007 and follows the Energy Policy Act of 2005.\nAccording to section 110 of the act, the US Department of Transportation (DOT) governs the use of DST. The law does not affect the rights of the states and territories that choose not to observe DST.\nConfusing DST Rules\nHistorically, there were no uniform rules for DST from 1945 to 1966. This caused widespread confusion, especially in transport and broadcasting. The Uniform Time Act of 1966 aligned the switch dates across the USA for the first time.\nFollowing the 1973 oil embargo, the US Congress extended the DST period to 10 months in 1974 and 8 months in 1975, in an effort to save energy.\nAfter the energy crisis was over in 1976, the DST schedule in the US was revised several times. From 1987 to 2006, the country observed DST for about 7 months each year."
    },
    {
      "url": "https://www.timeanddate.com/calendar/winter-solstice.html",
      "text": "Winter Solstice: When Does Winter Start?\nThe first day of winter in the Northern Hemisphere is in December; south of the equator, it is in June. Find out exactly when the winter season starts.\nEqual day and night? It happens at the solstice!\nWinter Date for 2025\nAccording to the astronomical definition, winter begins with the winter solstice. In the Northern Hemisphere, it's the December solstice; south of the equator, it is the solstice in June.\nWinter Solstice, Northern Hemisphere (December)\nNorth America, Europe, most of Asia, Northern Africa\nIn Malmö, Sweden: söndag den 21 december 2025, 16:03 CET (Change location)\nThis corresponds to söndag den 21 december 2025, 15:03 UTC.\nWinter Solstice, Southern Hemisphere (June)\nAustralia, New Zealand, South America, southern Africa\nIn Malmö, Sweden: lördag den 21 juni 2025, 04:42 CEST (Change location)\nThis corresponds to lördag den 21 juni 2025, 02:42 UTC.\nSolstices and equinoxes in your city\nAlternative Winter Start Dates\nMeteorologists use a different method of defining the first day of winter. And, in some countries, the beginning of the seasons is determined by average temperatures rather than fixed dates or astronomical events.\nMeteorological and other seasons definitions\nDays Get Longer During Winter\nAstronomical winter begins at the winter solstice, which is the shortest day of the year. This means days get longer during winter—very slowly at first, but at ever-larger daily intervals as the March equinox approaches, heralding the start of spring.\nLocations closer to the poles experience larger differences in day length throughout the year, so winter days are shorter there. In Toronto, the shortest day is just under 8 hours and 56 minutes long; in Miami, roughly 2000 kilometers or 1200 miles farther south, it lasts about 10 hours and 32 minutes.\nPlaces within the polar circles experience polar night during all or part of the winter season when the Sun does not rise at all.\nEarliest sunset is not on the shortest day\nLonger Days, but Falling Temperatures\nAlthough daylight hours increase during the winter months, temperatures continue to fall in most regions. This is because it takes time for Earth, particularly its oceans, to change temperature—an effect known as seasonal lag. (As a comparison, the planet Mars has seasons but no oceans, so there is almost no seasonal lag.)\nWinter Traditions and Folklore\nThe start of winter and the winter solstice are celebrated in cultures and religions around the world with various traditions, holidays, and festivals.\nWinter festivals: Christmas, Juul, and Saturnalia\nWinter Months\nIn the Northern Hemisphere, astronomical and meteorological winter runs from December to March. South of the equator, it starts in June and ends in September. Read more about the history and meaning of the winter months:\nNorthern winter months\nDecember | January | February | March\nSouthern winter months\nJune | July | August | September\nHow Long Is Winter?\nThe Earth does not move at a constant speed in its elliptical orbit, so the seasons are not of equal length. On average, winter lasts for 89.0 days in the Northern Hemisphere and 93.6 days in the Southern Hemisphere.\nAverage season lengths:\n- March equinox to June solstice: 92.8 days\n- June solstice to September equinox: 93.6 days\n- September equinox to December solstice: 89.8 days\n- December solstice to March equinox: 89.0 days"
    },
    {
      "url": "https://www.usatoday.com/story/life/food/2025/07/11/when-will-in-n-out-open-washington-how-to-order-off-secret-menu/84645448007/",
      "text": "As In-N-Out prepares to open in Washington, here's how to order off chain's 'secret' menu\nIs the anticipation eating you up?\nThe first In-N-Out restaurant in Washington state is set to open soon in Ridgefield. That means it's almost time to get in a (usually long) line for Double-Doubles, fries, and strawberry shakes. Oh, and don't forget the chilis.\nIn-N-Out's menu is short and easy to take in, especially when you're waiting to take your order at the drive-thru. But there's also a \"secret\" menu that's not so secret at all and as easy to order from as the regular menu.\nHere's what to know about the opening date of Washington's first In-N-Out and the restaurant's secret menu:\nWhen is In-N-Out opening in Washington state?\nPatty Pena, a spokesperson for In-N-Out, told USA TODAY Network that the company plans to open its first location in Washington state sometime this summer.\n\"Although an opening date for our Ridgefield location has not yet been finalized, we aim to serve burgers in Washington by September,\" Pena said in a July 8 email.\nThe Ridgefield location is at 5801 Pioneer Canyon Dr., in Southwest Washington near the Oregon border. The store is taking applications for store associates, with wages starting at $18.75 per hour, according to the company's website.\nWhat is the In-N-Out secret menu?\nIn-N-Out's secret menu is basically a list of ways you can customize your order. Want an extra beef patty? You can get that. Want two extra beef patties? Yeah, that's possible. There's some other lingo new customers will have an easy time getting the hang of, too, such as \"protein style\" and \"animal style.\" In-N-Out's workers have a reputation for being friendly and helping you get what you want, so don't be shy.\nIn-N-Out's website has a brief guide to the secret menu. But USA TODAY Network staffers put together this list of items that include and go beyond what the restaurant advertises. Check it out:\n3x3\nDouble-Double not doing it for you? The 3x3 ups the ante by delivering a burger with three beef patties and three slices of cheese.\n4x4\nOrdering a 4x4 gets you a burger that looks like a small house, thanks to its four beef patties and four cheese slices. You can go up to a 4x6 to get six slices of cheese. But to really go YOLO and add even more beef patties for a 5x5 or anything bigger, you’ll have to order the extra patties with cheese on the side and add the stuff yourself into the 4x4. Good luck. Have fun.\nAnimal style\n\"Animal style\" basically means adding cheese, grilled onions, and spread sauce to your order. Animal-style fries, for example, come with melted cheese, grilled onions, and spread sauce on top. Animal-style burgers come with lettuce, tomato, a beef patty grilled in mustard, pickles, grilled onions, and extra spread sauce. You can even get an animal-style grilled cheese, which is basically the animal-style burger minus the beef patty.\nBlack and white shake\nA shake with vanilla and chocolate. Note that you can also ask for vanilla-strawberry or chocolate-strawberry.\nCheese fries\nFries served with melted cheese on top. A good option for folks who like their fries to be more savory but don’t like spread sauce or grilled onions.\nChopped chilis\nThis customization option adds bright yellow-green cascabella peppers that In-N-Out offers on the side into your burger in chopped form. This is a good option if adding whole chilis is a bit too much and you want milder heat.\nCold cheese\nInstead of melted cheese, this adds a slice of unmelted cheese to your burger.\nDouble meat\nThis is an In-N-Out burger with two patties. Unlike the Double-Double listed on the menu, the Double Meat does not come with cheese.\nExtra everything\nDo you want more in life? Asking for “extra everything” will get you a burger with extra lettuce, tomato, onion, spread, pickles, and chilis for good measure. This is for folks who want to have their cake, er, or burger and eat it, too.\nFlying Dutchman\nIn-N-Out’s Flying Dutchman comes with two slices of melted cheese sandwiched between two beef burger patties and nothing else. No bread. No lettuce. No onions. It’s almost like a deconstructed burger.\nFries well done\nFor some, In-N-Out’s fresh fries can be a tad too limp. To get them extra crispy, ask for them well done. If the well-done is too crispy, you can also ask for them to be light. If you want them even less crispy than normal, ask for Fries Lite. You can also ask for fries with no salt.\nGrilled cheese\nThis is an In-N-Out burger without meat. It comes with two slices of melted cheese, lettuce, tomato, onions, and a spread. A good option for vegetarians who can still eat dairy. For those who can’t, see the Wish Burger entry.\nGrilled onions\nThis option replaces the fresh onions on your burger with grilled onions. The onions are caramelized, so they taste richer and sweeter. You can ask for your burger to have fresh and grilled onions simultaneously.\nMedium rare\nYes, my dude (or dudette), you can order your burger patty at In-N-Out to be medium rare.\nMustard fried\nA customization option that has a burger grilled with mustard and also adds pickles. It’s a lighter option to animal style that takes out the grilled onions and extra spread sauce.\nNeapolitan shake\nA shake with vanilla, chocolate, and strawberry.\nProtein style\nThis is a traditional In-N-Out burger with no buns. Instead, the burger is wrapped with lettuce. A popular option for people following a keto diet.\nRoot beer float\nIt's a dessert typically made with half root beer and half vanilla. You can further customize by letting staff know if you prefer to have more of one than the other. Just be mindful if it’s super busy, as it can be tricky to make and stressful for staff.\nWish burger\nThis goes beyond the grilled cheese by taking out the cheese altogether. So you have a \"burger\" with just vegetable fillings like lettuce, tomato, and onions. A good option for vegetarians who also don’t eat dairy. Other folks will wish for something else on the menu.\nContributing: USA TODAY Network\n(This story was updated to fix a typo.)"
    },
    {
      "url": "https://www.usatoday.com/story/news/local/washington/2025/07/11/8-washington-colleges-4-plus-stars-money-2025-best-colleges-america/84590873007/",
      "text": "The 8 Washington colleges that got 4+ stars in Money's 2025 Best Colleges in America\nGrades are in.\nWhile no university in Washington received the top rating – five stars − in Money's 2025 Best Colleges in America report, eight in the state received respectable scores of four or four and a half stars.\nMoney ranked 732 public and private four-year higher-education institutions based on several key metrics, including quality of education, affordability, and student outcomes such as future earnings potential. The goal was to \"help families make informed decisions about where to spend their tuition dollars,\" according to the report.\nMost schools in Money's list earned three and a half stars or four stars. These are solid institutions that may have scored highly in some topic areas but poorly in others. Fewer schools received four and a half stars or five stars. These are considered great-to-outstanding schools worth the price of admission for a wide array of students, according to the company's methodology.\nHere's more on Money's report and the Washington colleges that made the list.\nWhich Washington schools got four or more stars in Money's Best Colleges in America 2025 report?\n- Central Washington University (4.5 stars): Students interested in construction management, teaching, aviation, and emergency medical care might find this school in Ellensburg the right fit for them.\n- University of Washington-Seattle (4.5 stars): This top-of-class research university boasts an impressive admission rate, a competitive athletics program, and an academic portfolio that gives its graduates good opportunities for establishing lucrative careers. Science, technology, engineering, and math programs are popular here, according to Money.\n- Gonzaga University (4 stars): This university in Spokane is known for its business, psychology, nursing, and computer science programs in addition to being one of the best bangs for your buck in the country, according to U.S. News & World Report. Go Zags.\n- Pacific Lutheran University (4 stars): Founded in 1890 by Scandinavian immigrants, this religious university south of Tacoma offers its 2,600 students research opportunities with faculty and a slate of academic offerings in business, science, communications, and education, according to the school.\n- Seattle University (4 stars): This Jesuit Catholic university is dedicated to \"inclusive academic excellence,\" its provost has said, and ranks highly for its nursing, analytics, finance, and marketing programs, among others, according to U.S. News.\n- Washington State University (4 stars): WSU's flagship campus is in Pullman, and the school attracts journalism students to its Edward R. Murrow College of Communication while also being known for its agricultural and veterinary programs.\n- Western Washington University (4 stars): This school in Bellingham is one of the best public institutions in the Pacific Northwest, according to U.S. News, offering more than 200 academic programs to its roughly 13,700 students. The school has been nationally recognized for its manufacturing and supply chain management program.\n- Whitman College (4 stars): This small, private institution in Walla Walla has an undergraduate enrollment of about 1,500 students, and it's ranked as one of the best liberal arts and undergraduate teaching colleges in the country, according to U.S. News. The school touts its value as well, with about 62% of students graduating with zero loan debt.\nHow many people have student loan debt in Washington?\nAbout 10% of state residents have student loan debt, according to an analysis of federal student loan data by EducationData. In total, there are about 790,000 student borrowers residing in Washington, and nearly half are under 35 years old. About $29 billion in student loan debt is held by state residents, with the average amount totaling $36,709.\n\"In Washington, people are less likely to have unpaid educational debt, but the amount is on par\" with the rest of the country, according to EducationData.\nWhat is the most beautiful campus in Washington?\nThe University of Washington was ranked 10th in Travel and Leisure's \"30 Most Beautiful College Campuses in the U.S.\" report, which was posted on June 3.\nThe report acknowledged the school's Suzzallo Library, which the university said is an example of the Collegiate Gothic style and was designed by Seattle architects Carl F. Gould Sr. and Charles H. Bebb. Construction on the library began in 1923.\n\"But come spring, the quad's 29 Yoshino cherry trees steal the spotlight with blooms of delicate pink petals set against red-brick buildings,\" the report said. \"The Drumheller Fountain is a great spot for views of snowcapped Mount Rainier.\""
    },
    {
      "url": "https://www.usatoday.com/story/news/weather/2025/01/30/spring-2025-forecast-old-farmers-almanac/78021490007/",
      "text": "The Old Farmer's Almanac spring 2025 forecast: Warm, wet spring for much of US\nWho needs Punxsutawney Phil? Ahead of Groundhog Day, the Old Farmer's Almanac already has a forecast for the upcoming spring season: Warmer temperatures ahead.\nThe Old Farmer's Almanac, which has been in business since 1792, recently released its spring weather forecast. The outlook? \"Warmer-than-normal temperatures for most of the country, with a few exceptions: southern and central California, Desert Southwest, southern Florida, and western Ohio Valley, where it will be near to below normal.\"\nA wetter spring is predicted, too, by the Old Farmer's Almanac. \"Much of the country will experience more rainfall than usual. However, dry conditions are expected in the following regions: upper New England, southern Florida, Texas–Oklahoma and the Heartland, the western Ohio Valley and Lower Great Lakes, the northern High Plains and Upper Midwest, and the Pacific Northwest and northern California,\" the Almanac says.\nIn general, that parallels the National Weather Service's Climate Prediction Center's outlook for spring, with much of the U.S. expected to get average or above average temperatures and about half to get average precipitation from March to May.\nWhen is the first day of spring?\nMarch 20, the date of the spring equinox, is the first day of spring in the U.S.\nHow does The Old Farmer's Almanac make its weather predictions?\nThe Old Farmer's Almanac compares \"solar patterns and historical weather conditions with current solar activity\" to make long-term predictions. It's taken into account \"a weak La Nina phase of the ENSO (El Nino/Southern Oscillation).\n\"Like all forecasters, we have not yet gained sufficient insight into the mysteries of the universe to predict the weather with total accuracy, though our results are often very close to our traditional claim of 80%,\" it says.\nIs the Old Farmer's Almanac always accurate?\nIt depends on your point of view. For this winter, The Old Farmer's Almanac forecast, in general, \"a temperate uneventful winter,\" back in August 2024.\nOf course, the U.S. was hit in January with a major winter storm followed by an Arctic blast of below-average temperatures across the country. Subsequently, a \"once in a generation weather event\" hit the South and set snowfall records from Texas to Florida.\nFor its part, The Farmer's Almanac also forecast a milder – and wetter – winter.\nThe almanacs are valued by farmers as they \"have developed a certain kind of trust with their product and information,” Steve Hu, an agricultural climatologist at the University of Nebraska–Lincoln, told Scientific American.\nBut weather forecasters typically pooh-pooh their predictions. A University of Illinois study from 2010, cited by Popular Mechanics in an October 2022 story, found The Old Farmer's Almanac only about 52% accurate over the years, \"which is essentially random chance,\" the news site wrote.\nNOAA, National Weather Service: Spring 2025 forecast\nHere's a closer look at the NWS Climate Prediction Center's seasonal outlook for spring, with average or above average temperatures and average precipitation forecast for much of the U.S. from March to May:\n- Below average temperatures: Cooler than average temperatures are expected for the Northwest, as well as Montana and parts of Alaska, the Dakotas, Idaho and Wyoming.\n- Above average temperatures: Areas where temperatures are expected to at least lean above average include much of the Mid-Atlantic, Northeast, Southeast and Southwest.\n- Below average precipitation: Below average precipitation is likely in the Southwest and Florida.\n- Above average precipitation: Areas predicted to have above average precipitation include parts of the Northwest and the middle U.S., including Arkansas and Mississippi, Wisconsin, Pennsylvania and New York.\nThe Old Farmer's Almanac: Regional forecast highlights for April and May\nHere's the forecast highlights from The Old Farmer's Almanac for the coming months of April and May 2025, by region.\nNortheast: Maine, Massachusetts, New Hampshire, New York, Vermont\nNo significant snowfall is forecast. Temperatures will be warmer than average, especially in April (3 degrees Fahrenheit above normal), the almanac says. Precipitation is expected to be average in April and below average in May, No significant snowfall is forecast.\nAtlantic Corridor: Delaware, Connecticut, New Jersey, Rhode Island, parts of Maryland and Virginia\nTemperatures will be warmer than usual, with the southern region seeing temperatures 5 degrees Fahrenheit above average in April. Rainfall will be above normal in April and slightly below normal in May.\nAppalachian region: Maryland, Virginia, Pennsylvania, parts of North Carolina and West Virginia\nIn this mountainous region, spring temperatures will be slightly warmer than usual; precipitation will range from slightly above average to average.\nSoutheast forecast: Georgia, North Carolina, South Carolina\nTemperatures will be near average along the coast of the Carolinas and Georgia, but above normal in the western parts of the region. Rainfall will be near normal overall.\nFlorida: The Old Farmer's Almanac April-May forecast\nThe northern part of the state will experience warmer and wetter conditions, while the southern part will be cooler and drier than usual.\nLower Lakes: Michigan, parts of Illinois, Indiana, New York, Ohio, Pennsylvania, Wisconsin\nMichigan and the Great Lake states will get temperatures warmer than normal overall. As for rainfall, expect above normal precipitation in the East and below normal in the West.\nOhio Valley: Kentucky, parts of Illinois, Indiana, Missouri, Ohio, Pennsylvania, West Virginia and Wisconsin\nThe start of April brings below normal temperatures and precipitation to much of Kentucky, southern Illinois, Indiana and neighboring areas, but normal conditions in the rest of the region. For May, the entire region will get above-normal temperatures and rainfall.\nDeep South: Alabama, Arkansas, Louisiana, Mississippi, Tennessee, part of Georgia\nAfter normal temperatures in April, the region gets warmer-than-normal temperatures in May. Wetter than usual conditions are expected overall, but particularly in the southern areas of Louisiana, Mississippi and Alabama.\nUpper Midwest: Minnesota, Wisconsin, parts of North Dakota, South Dakota and Michigan\nTemperatures will be much warmer than usual (3 degrees Fahrenheit above average), while precipitation will be drier in the north and wetter in the south.\nHeartland: Iowa, Missouri, Kansas, plus parts of Nebraska and South Dakota\nExpect a warm spring, especially in the north (3 degrees Fahrenheit above average in April) and below normal rainfall. Heat and dry conditions will likely continue through the summer.\nThe Old Farmer's Almanac April-May forecast for Oklahoma and Texas\nApril begins with below-normal temperatures, but warmer than normal temps arrive in May. Rainfall will be slightly below to near normal.\nHigh Plains: Colorado, Montana, Nebraska, North Dakota, South Dakota and Wyoming, parts of Kansas, New Mexico and Oklahoma\nThe Plains will experience normal to warm temperatures, especially in the North (6 degrees Fahrenheit above average in April). Rainfall will be below normal in the North and above normal in the South.\nIntermountain: Idaho, Nevada, Utah, parts of Colorado, Oregon, Washington, Wyoming and New Mexico\nTemperatures will be warmer than normal in April (4 degrees Fahrenheit above average), but cooler than normal in May (3 degrees Fahrenheit below average). Rainfall will be above normal overall.\nDesert Southwest: Arizona, New Mexico, parts of Texas, Nevada and California.\nCooler than usual temperatures are expected in the desert areas of New Mexico, Arizona, and southeastern California. Rainfall will be slightly above normal.\nPacific Northwest: Oregon, Washington, California\nAlong the coast, temperatures will be above normal in April (3 degrees Fahrenheit above average), but drop to below normal in May. Conditions will be slightly drier than usual.\nThe Old Farmer's Almanac April-May forecast for the Pacific Southwest (California)\nTemperatures will be above normal in April but drop to below normal in May. Below normal rainfall is forecast for the north and above normal precipitation in the south.\nThe Old Farmer's Almanac April-May forecast for Alaska\nTemperatures and precipitation will be above normal overall.\nThe Old Farmer's Almanac April-May forecast for Hawaii\nNormal temperatures in the west are forecast, but warmer-than-usual temperatures are expected in the east; wetter-than-usual conditions are expected statewide.\nContributing: Janson McNair and John Tufts, USA TODAY Network.\nFollow Mike Snider on Threads, Bluesky and X: mikegsnider & @mikegsnider.bsky.social & @mikesnider.\nWhat's everyone talking about? Sign up for our trending newsletter to get the latest news of the day"
    },
    {
      "url": "https://www.usatoday.com/story/news/weather/2024/08/12/farmers-almanac-winter-weather-forecast-2024-2025/74603654007/#Texas",
      "text": "Farmers' Almanac winter forecast for 2024-2025: Wet, milder, longer season for much of US\nWinter is coming – a wetter one than usual, the Farmers' Almanac predicts. Much of the country will have average or warmer temperatures, but states in central US and by the Great Lakes will be colder.\nAfter what was the warmest winter on record, the upcoming winter should be wet and milder for most of the U.S., according to the Farmers' Almanac.\nThe 208th edition of the Farmers' Almanac, out now, foresees a \"Wet Winter Whirlwind,\" for the upcoming 2024-2025 winter season. \"It definitely looks more wet than white in many areas,\" Farmers' Almanac Editor Sandi Duncan told USA TODAY. \"Obviously, depending on where you live, there might be more white than wet, but we're focusing in on the wet winter ahead.\"\nThe climate pattern known as La Niña – likely to emerge in the September-November period, the Climate Prediction Center said in a recent forecast – could result in a warmer winter than normal in much of the country, she said.\nAverage or above normal temperatures are forecast for New England, the Northeast, the Southern Plains, the Southeast and the Atlantic Coast regions.\n\"The coldest temperatures look like they're going to be over the North Central States into the Great Lakes area,\" Duncan said.\nMost of the nation can expect a wet Thanksgiving holiday, too, \"except for way out in the Southwest,\" she said. And Christmas \"looks wet rather than white for most areas.\"\nThe end of January gets a red flag for much of the nation due to the potential of \"a very active storm track\" expected to bring strong and gusty winds, along with heavy precipitation – \"copious amounts of snow, rain, sleet, and ice (depending on where you live) could fall,\" the Almanac says.\nThe winter chill is expected to \"hang on\" longer than usual in the North, Northeast and middle of the U.S. \"So it looks like it's going to feel like a longer winter, even if it's a little warmer in certain areas that usually get snowier conditions,\" she said.\nWant climate news from experts? Sign up for USA TODAY's Climate Point newsletter.\nLa Niña: Hurricane season could be 'extremely active' with arrival of climate pattern\nDid the Farmers' Almanac get its winter weather prediction right last year?\nNot if you consider the Almanac's overall forecast of a cold 2023-2024 winter because it was the warmest on record. However, the Almanac notes it hit on some of its predictions including heavy show and blizzard conditions from Colorado to the Plains that threatened Christmas holiday travel.\nThe Almanac's forecast paralleled a weather pattern described by the National Oceanic and Atmospheric Administration as \"a swatch of cooler-than-average temperatures across the central part of the country in January.\"\nThe Farmers' Almanac, which originated in 1818, says its longtime fans claim the publication's weather predictions are accurate approximately 80%-85% of the time. It uses \"a top-secret mathematical and astronomical formula, taking sunspot activity, tidal action, the position of the planet, and many other factors into consideration,\" the Almanac states.\nShould you base your plans on the Farmers' Almanac – or the Old Farmer's Almanac, due out later this month? Russ Schumacher, a professor and climatologist at Colorado State University, was skeptical he told the Coloradoan in 2022\n\"They attract attention and get people talking about it. But a lot of times what they do is use general phrases that are true most any year,\" he said.\n\"What does 'glacial and snow-filled' for our area mean? Is that we get a few days of really cold weather and some snow? That happens pretty much every winter,'' he said.\nThe Farmers' Almanac still makes for an interesting read. Here's a closer look at its regional winter forecasts (click on a link to go directly to that region's forecast).\nNortheast, New York | Midwest, Ohio and Michigan| Pacific Northwest| North Central | Southeast, Florida | Texas, South Central | California, Southwest\nNortheast, New York: 'Active time' for storms in late January\nWinter in the New England and the Northeast region (Connecticut, Delaware, Maine, Maryland, Massachusetts, New Hampshire, New Jersey, New York, Pennsylvania, Rhode Island and Vermont) will be stormy with above-normal amounts of precipitation and near- to above-normal temperatures, according to the Almanac. \"Obviously, in the mountainous areas, we do see some good opportunities for that winter precipitation to turn white,\" Duncan said.\nAn early start to winter is expected with a coastal storm along the Atlantic Seaboard in the first week of December bringing mixed precipitation, then very cold temperatures. Much of New England and New York can expect a few inches of snow from a \"fast-moving clipper system\" in mid-January; the rest of the region gets rains and a wintry mix.\nThe end of January will be \"a very active time,\" for the region with a big storm dropping six or more inches of snow to Delaware, Maryland and parts of Pennsylvania and New Jersey, \"with some lighter amounts in southern New York and New England,\" Duncan said.\nSnow storms are predicted into March with one dropping up to 5 inches in mid-March in upstate New York and central and northern New England.\nMidwest, Ohio and Michigan: 'Big freeze' in January\nThe Great Lakes, Ohio Valley and Midwest region (Illinois, Indiana, Kentucky, Michigan, Ohio, Wisconsin) can expect periods of wet snow and rain to begin in early November, with \"frigidly cold\" temperatures through Nov. 11. Rain and wet snow continues to Thanksgiving, with a drier forecast toward the end of the year.\n\"January looks like when the Big Freeze may be on for that area,\" Duncan said. With \"very, very cold\" conditions expected, \"If you can plan your trip to the Caribbean, I would go then.\"\nIn mid-March, a \"rapidly moving storm\" is expected to bring two to five inches of wet snow to Illinois, Indiana, Ohio and the lower peninsula of Michigan and a wintry mix to Kentucky. The first of April is also predicted to bring cold rain, sleet and wet snow to Kentucky, southern Indiana and southern Ohio.\nNorthwest: Rain and wet snow for Idaho, Oregon and Washington\nThe Northwest region (Idaho, Oregon and Washington) will get plenty of showers, with wet snow beginning in early November. A stormy December may yield a possible fair, dry and cold Christmas holiday, then a fair January.\nBut in early February, a major storm is expected to bring heavy snow to the Bitterroot Range in eastern Idaho \"with 12 inches possible.\"\n\"So I think it's going to be very wet conditions,\" Duncan said. \"It obviously may not be so bad in the other states in that region.\"\nNorth Central states, Colorado: 'More like winter'\nThe North Central states (Colorado, Iowa, Kansas, Missouri, Minnesota, Montana, Nebraska, North Dakota, South Dakota, and Wyoming) will get a gusty Halloween and then snow in the Rockies at the start of November. An early November storm is predicted to bring heavy snow and, after it clears very cold temperatures. After a rainy, snowy Thanksgiving more storms kick off December. But a \"generally fair, dry, very cold\" Christmas is forecast; unseasonably cold temperatures are predicted to arrive in late January.\n\"This is where we are saying winter feels a little bit more like winter, with the coldest temperatures of the season and average snowfall,\" Duncan said. Expect a lot of snow in February, with some generated by that storm forecast for Idaho. A mid-February snowstorm predicted in the Plains could dump heaviest in Kansas.\nSoutheast, Florida: 'Mild and wet' winter\nSoutheast states (Alabama, Florida, Georgia, Mississippi, North Carolina, South Carolina, Tennessee, Virginia and West Virginia) overall are expected to be \"mild and wet,\" Duncan said. \"But that doesn't mean they will escape Old Man Winter.\"\nA \"sharp cold front\" in mid-November could bring violent thunderstorms to Tennessee and areas south, followed by a deep freeze. Conditions return to fair and dry before a wet Thanksgiving. An early December coastal storm could bring rain, winds and \"very cold air\" plus freezing conditions into Florida. A wet Christmas follows.\n\"We do see some colder conditions and very cold and bitterly cold conditions ending the month (of January) in the Southeast states,\" Duncan said.\nCold conditions are predicted to continue into February, with a midmonth storm possibly bringing sleet and wet snow to most of the region.\nTexas, South Central: Another winter snowstorm predicted\nSouth Central states (Arkansas, Louisiana, Oklahoma, New Mexico) and Texas are forecast to have \"mild with near to below normal precipitation,\" Duncan said.\nThe region is expected to get plenty of rain and wet snow in December, followed by a mostly fair January.\nBut the beginning of February will be \"very unsettled, with some snow, possibly … up to 6 inches\" in Texas, she said.\nA wet Mardi Gras could be upcoming, too, according to the Almanac.\nCalifornia, Southwest: 'Fair, dry, very chilly' Christmas\nSouthwest states (Arizona, California, Nevada and Utah) are forecast to have average temperatures and precipitation, a possible break from last winter's atmospheric rivers. A dry Thanksgiving is followed by rain and snow showers and a \"fair, dry, very chilly\" Christmas season is forecast.\nHeavy snow in the mountains in late January could lead to storms to the east.\nWith colder conditions also forecast in the Southeast, and Midwest and a major storm in the Northwest at the beginning of February, \"the end of January (and) beginning of February, for most of the country, looks like something you just may want to put on the calendar,\" Duncan said.\nFollow Mike Snider on X and Threads: @mikesnider & mikegsnider.\nWhat's everyone talking about? Sign up for our trending newsletter to get the latest news of the day"
    },
    {
      "url": "https://www.usatoday.com/story/news/local/washington/2025/06/27/best-places-for-renters-to-live-in-2025-washington-state-seattle/84385651007/",
      "text": "One of the best cities for renters to live is in Washington, report finds\nThree cities in the Pacific Northwest have been named among the best places to rent in the western United States in 2025.\nThe apartment-search website RentCafe published its annual \"Best Cities for Renters to Live\" report on June 26, finding Seattle, Portland, and Boise are among the top cities for renters in the West.\nThe report looked at communities where affordability intersected with a \"strong sense of community\" and good job prospects. Researchers took 150 cities across the nation and ranked them based on 20 indicators, including \"apartment quality, economic strength, traffic, air quality and access to natural amenities,\" according to the report.\nOverall, McKinney, Texas, was ranked as the best city for renters in the country due to its mix of affordability, quality of life, and consistent job growth, according to RentCafe. But the report also ranked the top 10 cities by region.\nHere's more on the report and what to know about the best places for renters in the nation and the West.\nWhich cities ranked as the best places to rent in the West?\nAccording to RentCafe, the 10 best cities for renters to live in the western U.S. in 2025 are:\n- Gilbert, Arizona\n- Boise, Idaho\n- Scottsdale, Arizona\n- Denver, Colorado\n- Colorado Springs, Colorado\n- Salt Lake City, Utah\n- Reno, Nevada\n- Westminster, Colorado\n- Seattle, Washington\n- Portland, Oregon\nWhile Seattle ranked ninth in the West, its overall rank fared a bit worse in RentCafe's 2025 report. The Emerald City ranked 73rd in the nation.\nAnalysts found that while Seattle, with a population of about 781,000 residents, enjoys a strong local economy (ranked 16th in the U.S.) and quality of life (12th), its housing and cost of living scores are among the lowest in the report, ranking 139th out of 150.\nSeattle has consistently ranked among the most expensive places to live in the country, according to media reports. The Seattle Times reported that, in 2023, consumer prices in the Seattle metro area were nearly 13% higher than the national average, according to data from the Bureau of Economic Analysis. Housing costs were about 50% higher than the national average, the paper reported.\nHowever, some households can live comfortably in the city despite its high cost of living. A January 2025 report from the travel website Upgraded Points found that Seattle ranked third in the U.S. for cities where \"middle-class families enjoy the most financial breathing room.\" This is due to wages exceeding the area's \"elevated living costs.\"\nAccording to U.S. Census data, the median household income in Seattle in 2023 dollars was $121,984. The median gross rent was $1,998, according to the data.\nWhere are the best places for renters to live in the US?\nAccording to RentCafe, the five best places for renters to live in the United States in 2025 are:\n- McKinney, Texas\n- Sarasota, Florida\n- Atlanta, Georgia\n- Austin, Texas\n- Huntsville, Alabama\nWhat is the worst city for renters to live in the US?\nAnaheim, in Southern California, ranked last in RentCafe's report of the best places for renters to live in the nation. Home to a Disneyland theme park and the Los Angeles Angels baseball team, Anaheim scored near the bottom of the list for housing and cost of living (144th), local economy (122nd), and quality of life (117th), according to the report."
    },
    {
      "url": "https://www.cpc.ncep.noaa.gov/products/analysis_monitoring/enso_advisory/ensodisc.shtml",
      "text": "During June 2025, ENSO-neutral continued, with near-average sea surface temperatures (SSTs) prevailing across most of the equatorial Pacific Ocean [Fig. 1]. The latest weekly Niño SST index values ranged from 0.0°C to +0.4°C [Fig. 2]. Subsurface temperature anomalies were weakly positive and nearly unchanged from last month [Fig. 3], with mostly above-average temperatures established along the thermocline [Fig. 4]. Over the east-central and eastern equatorial Pacific Ocean, low-level wind anomalies were easterly and upper-level wind anomalies were westerly. Convection remained enhanced over Indonesia [Fig. 5]. Collectively, the coupled ocean-atmosphere system in the tropical Pacific reflected ENSO-neutral.\nThe IRI predictions indicate ENSO-neutral is most likely through the Northern Hemisphere winter 2025-26 [Fig. 6]. In contrast, the North American Multi-Model Ensemble favors the onset of La Niña conditions during the Northern Hemisphere fall, though lasting a shorter duration than NOAA's requirement of five consecutive overlapping 3-month seasons. While the subsurface equatorial Pacific remains above average, easterly trade winds are predicted to strengthen in the coming month, which could portend cooler conditions. In summary, ENSO-neutral is most likely through the late Northern Hemisphere summer 2025 (56% chance in August-October). Thereafter, chances of La Niña conditions increase into the fall and winter 2025-26, but remain nearly equal to ENSO-neutral [Fig. 7].\nThis discussion is a consolidated effort of the National Oceanic and Atmospheric Administration (NOAA), NOAA's National Weather Service, and their funded institutions. Oceanic and atmospheric conditions are updated weekly on the Climate Prediction Center web site (El Niño/La Niña Current Conditions and Expert Discussions). A probabilistic strength forecast is available here. The next ENSO Diagnostics Discussion is scheduled for 14 August 2025.\nTo receive an e-mail notification when the monthly ENSO Diagnostic Discussions are released, please send an e-mail message to: ncep.list.enso-update@noaa.gov."
    },
    {
      "url": "https://www.cpc.ncep.noaa.gov/products/predictions/long_range/seasonal.php?lead=6",
      "text": "www.nws.noaa.gov\nHome\nSite Map\nNews\nOrganization\nSearch\nCPC Search\nMap Explanations\nOfficial Fcsts\nFcst Tools\nAbout Us\nOur Mission\nWho We Are\nContact Us\nCPC Information\nCPC Web Team\nOfficial 90-day Outlooks are issued once each month near mid-month at 8:30am Eastern Time. Please consult the\nschedule\nof 30 & 90-day outlooks for exact release dates.\nHOME\n>\nOutlook Maps\n>\nMonthly to Seasonal Outlooks\n> Seasonal Outlooks\nOFFICIAL Forecasts\nJan-Feb-Mar 2026\nClick here for information about the three-month outlook\nText-Format\nDiscussions\nMonthly\nLong Lead\n30-& 90-Day Hawaiian\nMore Outlooks\n0.5mn ASO 2025\n1.5mn SON 2025\n2.5mn OND 2025\n3.5mn NDJ 2025 - 26\n4.5mn DJF 2025 - 26\n5.5mn JFM 2026\n6.5mn FMA 2026\n7.5mn MAM 2026\n8.5mn AMJ 2026\n9.5mn MJJ 2026\n10.5mn JJA 2026\n11.5mn JAS 2026\n12.5mn ASO 2026\n0.5mn Aug 2025\nClimatological Values (1991-2020) for JFM\nTools Used\n(see Discussion for explanation)\nTools Discussion\n(updated as new tools are implemented)\nCanonical Correlation Analysis\nEnsemble Canonical Correlation Analysis\nOptimal Climate Normals\nClimate Forecast System\nScreening Multiple Linear Regression Tool\nProbability of Exceedence\nClick on individual map to view larger format\nEmail to Forecasters\nEmail to Webmasters\nNOAA/\nNational Weather Service\nNOAA Center for Weather and Climate Prediction\nClimate Prediction Center\n5830 University Research Court\nCollege Park, Maryland 20740\nPage Author:\nClimate Prediction Center Internet Team\nPage last modified: September 03, 2015\nDisclaimer\nInformation Quality\nCredits\nGlossary\nPrivacy Policy\nFreedom of Information Act (FOIA)\nAbout Us\nCareer Opportunities"
    }
  ],
  "argos_summary": "Washington state is expected to experience a colder and wetter winter for the 2025-2026 season, according to the Farmers' Almanac, which predicts significant snowfall in the Pacific Northwest, benefiting skiers. The forecast indicates a cycle of cold and snow, with potential wintery conditions beginning in late fall. Meanwhile, NOAA's Climate Prediction Center suggests that temperatures in Western Washington may trend below normal, while precipitation levels could vary across the state.",
  "argos_id": "LHG300PB9"
}