{
  "url": "https://www.bloomberg.com/news/audio/2025-08-12/stock-movers-airlines-chips-cardinal-health",
  "authorsByline": "Bloomberg",
  "articleId": "2a1cdc4fc1ee427e9a764b7d57096f8f",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ikP8v_9GZHFM/v0/500x500.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:24:02.904000+00:00",
  "addDate": "2025-08-12T20:32:54.557730+00:00",
  "refreshDate": "2025-08-12T20:32:54.557733+00:00",
  "score": 1.0,
  "title": "Stock Movers: Airlines, Chips, Cardinal Health",
  "description": "Bloomberg journalists discuss today's biggest winners and losers in the stock market. Listen for analysis on the companies making news on Wall Street.",
  "content": "Listen for comprehensive cross-platform coverage of the US market close as heard on Bloomberg Television, Bloomberg Radio, and YouTube with Romaine Bostick, Vonnie Quinn, Carol Massar and David Gura. On this episode of Stock Movers: - United Airlines (UAL) and Delta Air Lines (DAL) were the top performers in the S&P 500 Tuesday as an unexpected pickup in airfares lifted airline stocks. Airline fares increased 4% month over month in July, according to the release Tuesday of the consumer price index, marking a sudden reversal after five consecutive monthly declines. It was the largest seasonally adjusted change in airfares since May 2022, according to the Bureau of Labor Statistics, which publishes the data. The news boosted airline stocks on Tuesday. United was up 9.9%, Delta gained 9.1%, American Airlines Group was climbing 11%, and Southwest Airlines was up 4.1%. - AST SpaceMobile (ASTS) shares rise over 13% in premarket trading after the satellite firm set out an ambitious plan to launch 45 to 60 satellites during 2025 and 2026. The firm also said it received two additional early-stage contracts for the US government. - Cardinal Health (CAH) agreed to purchase Solaris Health in a $1.9 billion deal, the company’s latest acquisition in the urology category and an expansion of its multispecialty strategy. “Urology is an attractive specialty for us,” said Jason Hollar, chief executive officer of Cardinal Health, in a statement. Among other recent urology acquisitions, Cardinal Health recently completed the purchase of Academic Urology & Urogynecology. Solaris Health has more than 750 providers in 14 states.",
  "medium": "Article",
  "links": [
    "https://www.bloomberg.com/podcasts/series/stock-movers"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Cardinal Health",
      "weight": 0.09983979
    },
    {
      "name": "Solaris Health",
      "weight": 0.089926794
    },
    {
      "name": "United Airlines",
      "weight": 0.07779362
    },
    {
      "name": "other recent urology acquisitions",
      "weight": 0.07645596
    },
    {
      "name": "American Airlines Group",
      "weight": 0.07541332
    },
    {
      "name": "comprehensive cross-platform coverage",
      "weight": 0.07302954
    },
    {
      "name": "Southwest Airlines",
      "weight": 0.070962586
    },
    {
      "name": "airline stocks",
      "weight": 0.067769125
    },
    {
      "name": "Delta Air Lines",
      "weight": 0.06727007
    },
    {
      "name": "Airlines",
      "weight": 0.06672639
    }
  ],
  "topics": [
    {
      "name": "Aviation"
    },
    {
      "name": "Markets"
    },
    {
      "name": "Airlines"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.990234375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96142578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.921875
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.8017578125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.462890625
    }
  ],
  "sentiment": {
    "positive": 0.8819246,
    "negative": 0.03763031,
    "neutral": 0.08044514
  },
  "summary": "United Airlines (United Airlines) and Delta Air Lines (DAL) were the top performers in the S&P 500 due to an unexpected increase in airfares, which boosted airline stocks. The consumer price index increased by 4% month over month in July, marking a sudden reversal after five monthly declines. The news led to United's 9.9% increase in United's shares, followed by Delta's 8.5% rise in American Airlines Group and Southwest's 4.9%. Meanwhile, Cardinal Health (CAH) has agreed to purchase Solaris Health in a $1.9 billion deal, marking its latest acquisition in the urology category and expanding its multispecialty strategy.",
  "shortSummary": "US Stock Movers: United Airlines, Delta Air Lines, and Cardinal Health led the charge as airline stocks rose due to a 4% rise in airfares.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "61fef3312b754b94bea72be584814748",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "On Bloomberg's Stock Movers, airline stocks surged as United Airlines and Delta Air Lines led the S&P 500 following a 4% increase in airfares in July, marking a significant turnaround after months of decline. United's shares rose by 9.9%, while Delta gained 9.1%, with other airlines also seeing notable increases. Additionally, AST SpaceMobile's shares jumped over 13% after announcing plans to launch 45 to 60 satellites by 2026 and securing new contracts with the US government. Cardinal Health is set to acquire Solaris Health for $1.9 billion, expanding its urology services.",
  "argos_id": "LL4NS2WMN"
}