{
  "url": "https://www.slashgear.com/1933990/best-1950s-semi-trucks/",
  "authorsByline": "D Figg",
  "articleId": "f98ab0db81c14a90a6660d620f54ced9",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/13-of-the-best-looking-semi-trucks-from-the-1950s/l-intro-1754294768.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:30:00+00:00",
  "addDate": "2025-08-12T23:36:43.304212+00:00",
  "refreshDate": "2025-08-12T23:36:43.304214+00:00",
  "score": 1.0,
  "title": "13 Of The Best-Looking Semi Trucks From The 1950s",
  "description": "Classic cars from the '50s are among the most collectible in the world, but those nostalgic for the era have a number of beautiful semis to appreciate as well.",
  "content": "13 Of The Best-Looking Semi Trucks From The 1950s\n\nSemi trucks, though they get little recognition, or even respect, for that matter, are holding America together. These rigs, often called 18-wheelers, can last millions of miles, and are concentrated into just a few, very popular truck brands across the country. While we have some good-looking semi-trucks today, with people arguing over whether the Kenworth T680 or the Peterbilt 579 comes out on top, modern designs cannot hold a candle to those of days gone by, for the 1950s were the golden age of semi-truck design. The post-war years were when American truck makers truly hit their stride, building vehicles that would look cool even half a century later. With hand-formed aluminum bodies, multiple tall, vertical-stack exhaust systems, and paint schemes that caught the eye from a mile out, the 1950s had it all. Today, many of these examples will fetch over six figures at sale. Here are 13 of the most stunning semi trucks from the 1950s.\n\nThe Kenworth 524 hit its stride in 1953, just a couple of years after its launch. It came with a Cummins supercharged engine (called the NHRS) that would produce 275 hp and between 700 and 800 lb-ft of torque. This beastly powerplant -– for the time, at any rate -– would be paired to a 15-speed transmission from Spicer, which made it usable in all sorts of situations. As things stood, the 524 gained popularity in various off-road use-cases, such as logging – things that we would call severe duty in the industry today. Other uses for the 524 included a special 6x4 setup that was intended for export and was used by the mines in Peru to haul ore from place to place. Notably, 1951 was also the year that marked the 10,000th Kenworth to roll off the assembly line, and in 1952, the company would break its record by producing more than 1,000 units in a year. Design-wise, the 524 was perfection with the cab mounted on top of the engine; known as a cab over engine, or COE for short. The proportions were also quite pleasing to the eye, with a flat-front long hood, rising into a near-vertical windscreen, making it a great sight to see on the road.\n\nPeterbilt came out with the gorgeous 351 in 1954. The 1957 model pictured above shows off its long butterfly hood with a huge flat-front radiator grille, massive bumpers, and extremely large fenders — it was also a COE design, but wider than the preceding conventional trucks. On top of that, there was chrome everywhere and on everything — the grille, the front and rear bumpers, on the wheels, exhaust stacks, fuel tanks, on all the filters, and everywhere else. The placement of the headlights was similar to the Kenworth, being mounted on the walls of the hood, between the space left by the fender. Power for this generation 351 came from a six-cylinder Cummins unit that produced around 275 hp while being paired with a 10-speed transmission. There was also the option for buyers to get their Peterbilt 351 with a sleeper cab as well as day cabs, which was a trend that was just beginning to get traction in the industry. Today, if and when one does come up for auction, it'll sell for close to six figures, for units in good condition, like this one that sold in March 2025. The last noteworthy thing about the 351 was that it was the longest production run of any Peterbilt truck to date.\n\nPerhaps America's most legendary truck manufacturer is Mack, a company that has been in the industry since 1900. The model pictured above is a '57 Mack B61 semi truck, and it is easily one of the best-looking trucks of the era, albeit with a different design language than that of the Peterbilt and Kenworth. Where those two were sharp, angular, and imposing, the B61 was a lot smoother, with flowing lines. The hood and bumper merged seamlessly with the large fenders, and there was a huge amount of ground clearance between the bottom of the bumper and the road below. The headlights were in a bit of an awkward-looking position, being sandwiched on either side of the radiator grille, but this was most likely a functional decision to prevent a dead lighting zone — laser-matrix LEDs hadn't been invented back then. Power for the B61s came from an 11-liter (673 cubic inch) engine with six cylinders called the END Thermodyne, which made 250 hp. Torque figures vary, but Mack documentation indicates 701 lb-ft delivered via a five-speed transmission. The B61 was available in a variety of forms, including dedicated full-truck versions, day cab semi-trucks, and sleeper cab semi-trucks. And it was popular too, with about 128,000 being sold from the beginning of production in 1953 to the end in 1966.\n\nThe LTL line from Mack caught the eye with a chromed front fascia consisting of a large, body-width bumper that led up to a flatnose radiator grille with the legendary Mack Bulldog hood ornament mounted on top. There was a relatively short hood that extended to the driving cab, with a slightly angled windscreen. This was all fine, but pretty standard for the time, which is where the party piece of this design comes in. The massive sleeper cab attached to the back might seem ungainly at first, but the way Mack has worked it into the overall silhouette of the design is remarkable, giving the truck an overall look of great proportionality. It's worth mentioning that the sleeper cab's design is particularly impressive on the LTL because these trucks didn't ship with sleeper cabs, but had to be added later by Mack dealers as an aftermarket accessory. In terms of utility, the LTL came with a Cummins engine that churned out 235 hp and up to 695 lb-ft of torque. This engine was able to deliver its power to the wheels via a five-speed transmission. While the model shown above is from 1952, the production run was quite short, having started in 1947 and ended in 1956, with only about 2,000 units produced.\n\nAfter the war concluded, Kenworth was churning out trucks like there was no tomorrow, which is presumably why they didn't bother giving this one a proper name. After all, the name looks like a model code: CC825C, with the 825 actually not indicating the engine size, for it came with a 743 cubic inch unit. However, these indiscretions can easily be forgiven after a brief glance at how good-looking this truck is. The CC825C had the vastly popular needle-nose design with a butterfly hood, which would open like gullwing doors on the contemporary Mercedes-Benz 300SL. In addition, the cab was rounded in many places, rather than the boxy design found on the Kenworth 524 and Peterbilt 351, which gave the silhouette a bit of a gentler look. Headlights on the CC825C were virtually the same as those on these two models, though, being circular units mounted in the space between the walls of the hood and the fenders. The truck was powered by a 12.2-liter (743 cubic inch) six-cylinder unit sourced via Cummins, which would make all of 320 hp and 865 lb-ft of torque, mated to a 6x4-speed gearbox.\n\nThe Diamond T model 921 is the next truck on our list, and is certainly good-looking. It features a cabover design with a needle-nose hood and a three-axle setup with an optional sleeper cab. Adding flair are several accent features such as exhaust vents down the side of the hood, short exhaust pipes, and funky headlights. As expected, there was chrome on everything that could be chromed, and even on some things that would have done better without it, such as the rear fenders. The headlight placement mimics the Kenworth and Peterbilt from above, but the turn signal indicator is mounted in a very odd place — on top and in the middle of the front fender, which is certainly an interesting choice. Overall, though, whether equipped with the optional sleeper cab or not, the Model 921 is definitely a good-looking beast. In terms of engines, the 921NT came with a Cummins 14-liter (855 cubic inch) six-cylinder engine. This unit churned out between 250 and 475 hp along with up to 1,650 lb-ft of torque. This power was channeled to the wheels via a 13-speed transmission. Diamond would eventually go on to complete a full merger with another semi-truck company named Reo in 1967. This partnership would be rather short-lived, as Diamond Reo would go out of business in 1975.\n\nLike its smaller sibling, the Diamond T Model 922 was a good-looking semi-truck. Several design cues were carried over from the 921, such as the quad-headlights and the overall proportions. Additionally, the 922 would often ship with tandem axles at the back along with dual heavy-duty tires on each of the rear axles, for added utility. However, a key difference between the DT 921 and DT 922 was that the latter had softer corners and more sloping angles, giving it less of a boxy look than its predecessor. The Diamond T 922 is also a fair bit more restrained with the amount of chrome, so it looks more elegant than the 921. Where the DT 921 had dual-stacked exhausts and a single, unbroken windscreen, the Diamond T 922 had a single exhaust stack on the right-hand side and a split windshield. However, the split windshield was a lot less prominent when compared to other manufacturers, with both glass panels being separated only by a very thin metal strip. All in all, it was a fantastic, low-profile truck that would turn heads wherever it went, and it was decently performant too. Engine choices included the legendary 14-liter (855 cubic inch) NHC unit that produced 250 hp and 650 lb-ft of torque – plenty of power for the applications this rig would have been used for.\n\nIt makes sense to cover the WC22 from the White Motor Company right after the Diamond Ts, because WMC would go on to acquire Diamond T in 1958. Of course, then Diamond T would merge with REO in '67, and then promptly go bankrupt in '75, but that's a story for another day. The WC22 was a really small truck – one that barely could be called a semi. Yet it got the job done. Its intended use was as a day-cab. No one was going to be doing any cross-country trucking in something this cramped — but it looked amazing. The tall, curved radiator grille made out of steel columns ended in a minimalist bumper, and the hood was not overly long like some of the other trucks on this list. The windscreen was actually a bit on the smaller side and was curved at the bottom to contour-match the shape of the hood. The windows were fairly large, taking up most of the upper part of each door, and the big, flowing fenders took up half the length of the chassis. If anything, the White WC22 could be likened to a 1930s Plymouth coupe that had been lifted up, given a massive engine, and fitted with large wheels. It came with a six-cylinder, 6.3-liter (386 cubic inch) unit from White itself, which made 148 hp.\n\nAutocar — not the magazine — was another huge semi-truck manufacturing company from the 1950s that was vastly popular. Today, more than 125 years since it was founded, Autocar Truck manufactures several rigs designed for the most severe conditions on the planet, such as the massive ACX and DC-64. Back in the 50's, Autocar was also building the AP40. However, in terms of design, nothing comes close to Autocar's offerings from yesteryear, which were simply easy on the eyes. Take, for example, the DC-75 from 1953, pictured above. It had a high-riding front bumper, chrome, naturally, and a large hood leading up to the driver's day cab, replete with twin-exhaust stacks. Every bit of metal on this rig was either painted or chromed, with no in-between options. Some versions also came with tandem axles at the rear for hauling heavier loads. The big Autocar diesel plaque was riveted to the side of the massive hood, and the large three-quarter fenders started just behind the shaft-mounted headlamp units at the front, on each side. Power for the DC-75 came from a Cummins engine that pushed out 355 hp, paired with a nine-speed transmission. All Autocar trucks at the time, save for the DC-65, used the same Cummins HRB engine.\n\nThe Westcoaster looked like a scaled-up, beefier, more modern version of the R1-90. In terms of the actual design, though, it was significantly changed, with several immediate differences visible. For one, the grille on the front was now made of horizontal metal strips instead of vertical ones, and it was more square overall. Furthermore, the hood was more angular, and there were now four lights on the front as opposed to two on the R1-90. The windshield design remained largely the same, being curved on the bottom to accommodate the silhouette of the hood, and the roof also got a sort of sun-visor that extended over the windshield, which the R1-90 didn't have. The aesthetic change of including the sun visor not only made the truck look a lot better — like it was wearing a cap — but it was probably quite functional as well, given that windshield tinting wasn't a thing back then. Furthermore, the Westcoaster was often shipped with a small sleeper cabin behind the rig that would have enabled far longer shipments than the R1-90, which was mainly a day-cab vocational truck. The engine on the Westcoaster was a unit from Cummins that made 335 hp and was paired to a 13-speed transmission.",
  "medium": "Article",
  "links": [
    "https://www.slashgear.com/1841906/semi-truck-vertical-exhaust-stacks-use-explained/",
    "https://www.youtube.com/watch?v=39q7yG9f9l4",
    "https://www.tractorhouse.com/listing/auction-results/242353985/1957-peterbilt-351-sleeper-trucks",
    "http://www.tyldenheritage.com.au/uploads/9/3/0/6/9306704/endt673c.pdf",
    "https://www.youtube.com/watch?v=V882LZiW3U8",
    "https://www.slashgear.com/1913421/why-semi-trucks-last-million-miles-but-cars-dont/",
    "https://www.freightliner.com/why-freightliner/a-tradition-of-innovation/background-a-tradition-of-innovation/",
    "https://www.youtube.com/watch?v=2NBsh4JYMsY",
    "https://www.slashgear.com/1895303/kenworth-t680-vs-peterbilt-579-what-difference-which-better-long-haul-truck/",
    "https://www.youtube.com/watch?v=ZzWnAqOj9uM",
    "https://www.youtube.com/watch?v=_gTkaiMYHyc",
    "https://www.youtube.com/watch?v=iTkO5o6Zlas",
    "https://www.youtube.com/watch?v=LHpxDelr3H4",
    "https://www.youtube.com/watch?v=fZSRgCjAcKA",
    "https://www.youtube.com/watch?v=l8-YCNjnofU",
    "https://www.slashgear.com/1670414/semi-trucks-most-popular-america/",
    "https://www.youtube.com/watch?v=WjT0kdDcADI",
    "https://www.slashgear.com/1921311/why-are-semi-trucks-called-18-wheelers/",
    "https://www.youtube.com/watch?v=RcSBEbLuZuw",
    "https://www.slashgear.com/rm-sothebys-to-auction-55-mercedes-300-sl-sportabteilung-gullwing-02412561/",
    "https://www.youtube.com/watch?v=beQKaroCSkY"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "semi-truck design",
      "weight": 0.08303477
    },
    {
      "name": "truck",
      "weight": 0.07071645
    },
    {
      "name": "trucks",
      "weight": 0.07071645
    },
    {
      "name": "Semi trucks",
      "weight": 0.06845014
    },
    {
      "name": "sleeper cab semi",
      "weight": 0.06803541
    },
    {
      "name": "day cab semi",
      "weight": 0.06690193
    },
    {
      "name": "American truck makers",
      "weight": 0.065198146
    },
    {
      "name": "sleeper cabs",
      "weight": 0.06333601
    },
    {
      "name": "day cabs",
      "weight": 0.06188843
    },
    {
      "name": "Several design cues",
      "weight": 0.055588838
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.77099609375
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Trucks, Vans & SUVs",
      "score": 0.30322265625
    }
  ],
  "sentiment": {
    "positive": 0.3389607,
    "negative": 0.16851614,
    "neutral": 0.4925231
  },
  "summary": "The 1950s were the era when American truck manufacturers were at their peak, producing vehicles that still hold America together. The Kenworth 524, introduced in 1953 with a Cummins supercharged engine (NHRS) that produced 275 hp and between 700 and 800 lb-ft of torque, was popular off-road use-cases such as logging and mining. The company's design language was different from that of the Peterbilt and Kenworth. The 1950s featured hand-formed aluminum bodies, multiple tall vertical-stack exhaust systems, and paint schemes that caught the eye. Many examples of these vehicles are now fetch over six figures at auction. The most stunning semi truck manufacturer is Mack, a company that has been in the industry since 1900.",
  "shortSummary": "The 1950s were renowned for their stunning semi-trucks, featuring iconic designs like the Kenworth 524, Peterbilt 351, Mack B61, and Mack 524.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f5bb5dac60974f1ebb4c027fe2fdb82f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.slashgear.com/1913421/why-semi-trucks-last-million-miles-but-cars-dont/",
      "text": "Why Semi-Trucks Last Millions Of Miles (But Cars Don't)\nTake a ride on any major highway around the world, and you're sure to see a familiar sight: armies of semi-trucks zipping by or trudging along, filled with all the things we buy at our favorite shops. It is the backbone of our modern supply chain in that last final step, from getting goods offloaded at the port and transported to distribution centers. The importance of these fleets of trucks and the commitment of the truck drivers themselves became even more apparent during the pandemic, as supply chain choke points irritated many consumers and politicians alike. These days, things are pretty much back to normal, but you do have to admire the fact that these massive storage units on wheels, clocking thousands and thousands of miles or more, are so reliable.\nMany often wonder how exactly, when considering an average car's engine may only last a few hundred thousand miles before the final rev of the cylinders, do semi trucks stay on the road for millions of miles? What's considered \"high mileage\" to a car owner would be considered normal to a semi-truck owner, as they push well beyond those numbers of total miles driven. Here, we will explore the reasons why semi-trucks seem to have an astounding ability to outlast the cars they share roads with, cruising the highways effortlessly into the million-mile range before retirement or engine failure.\nEngineered for endurance\nThe reasons for a semi-truck's epic longevity are not accidental or from sheer luck; rather, they are intentionally engineered to last long. Heavy-duty use is the purpose for tractor-trailers, and as such, engineers prioritize longevity and reliability, helping to push mileage into the unconceivable million-plus range. Another reason for their epic total mileage is due to the ease of majority highway miles versus rough, stop-and-start city driving. To put it into perspective, William Coe Jr., a Florida native, put a staggering 3,001,276 miles on his long-haul truck between 1986 and 2009, which is considered a world record.\nHowever, it isn't apples to apples when comparing semi-trucks to cars. Cars are literally designed to be written off due to high repair costs, while their engines don't last as long. A 2.0L displacement gasoline engine powering, say, a Honda Civic, is not anywhere close to the power and build tolerances of a 510 horsepower, 12.9L MX-13 diesel, which also costs significantly more. Inherent in a diesel engine design are the larger crankshaft and camshafts, which need more clearance, which, in turn, allows more oil to flow, lessening wear and tear. Next, gear-driven mechanics over a car-engine style timing belt, combined with piston cooling jets that continually spray oil on the bottom of the pistons, help things run smoothly. Lastly, a diesel engine's lower overall RPM, due to its power and torque output from lower revs, means less wear on bearings, pistons, and valves — all contributing to a longer engine's lifespan.\nUsage, environment, and maintenance\nThe key takeaway here is that, beyond being engineered for longevity, combined with an industrial diesel's inherent functionality, it's the maintenance that is a big reason semis seem to last forever. Transport companies with large fleets of trucks will adhere to strict maintenance schedules, as it's in their best interests to keep fluids topped up and filters changed regularly. This in turn maximizes their ROI where they keep trucks on the road longer, ensuring they can meet the demands of customers. Drivers are encouraged to check what they can — tires, brakes, fluid levels, electrical systems, and lights — which can be done easily at stops while on a long haul. These factors become even more important when considering seasonal driving conditions, especially with extreme weather, which can affect a truck's performance.\nSemi-truck owners are encouraged to use high-quality replacement parts that meet or exceed OEM standards, especially for pistons, gaskets, liners, and valve train accessories. Not skimping on cheap parts is insurance against breakdowns, allowing diesel truck engines to stand up to the most rigorous hauls required. Keeping the cooling systems topped up, using the correct oil viscosity, or even considering synthetic oil for brutal conditions like extreme heat or massive loads can further protect the heart of the truck. Lastly, using the best quality fuel during trips is recommended. This, combined with having a talented and capable team of technicians at the ready if problems arise, all lead to hitting that million-mile-plus range."
    },
    {
      "url": "https://www.freightliner.com/why-freightliner/a-tradition-of-innovation/background-a-tradition-of-innovation/",
      "text": "Background: A Tradition of Innovation\nHistory of Innovation\nHistory of Innovation Timeline\nFounded in 1942 on principles of innovation and customer satisfaction, Freightliner Trucks began with Leland James’s idea to build truck components with lightweight aluminum rather than traditional steel. James’s innovative concept was initially met with resistance and skepticism, but he was determined to make his idea a reality. He hired a team of engineers and built the first Freightliner® truck.\nMore than seven decades following James’s revolutionary idea, Freightliner continues to innovate, developing trucks that build businesses. As a result, business owners, fleet managers and professional drivers rely on our efficient and innovative products to finish the job.\n1950\nThe Eastern Freightliner debuts. The B42 tractor is designed to haul a single semi-trailer. For $15,871, Freightliner sells its first transcontinental cab-over sleeper, capable of hauling a 35-foot trailer.\n1953\nFreightliner introduces the first overhead sleeper, model WF64, optimized for long-haul applications while meeting restrictive length laws in place at the time. An alternative-fuel truck capable of using gasoline, diesel or liquefied propane, the WF64 is well ahead of its time.\n1954\nThe four-wheel-drive Freightliner® Mountaineer tractor is introduced, offering improved on- and off-highway traction, enabling doubles to operate on snow-covered mountain passes.\n1964\nFreightliner builds the WFT5366 AWD Cane Hauler for Hawaii, with a GCVW of 76 tons, specifically designed to haul sugar cane.\n1965\nPowered by a Boeing model 553 gas turbine, the Freightliner® Turboliner weighs 2,400 pounds less than a similar truck with a diesel engine. Offering better visibility in tight spaces, the WFHT6288 half-cab dominates job sites and crowded lots.\n1973\nFreightliner introduces its flagship Powerliner, a truck with a massive 2,000-square-inch radiator and 600-horsepower engine.\n1974\nFreightliner builds its 100,000th truck, a 104” Bumper-to-Back-of-Cab (BBC) stretch-cab tractor, and begins shifting towards conventional trucks, offering better ride and handling. The Aluminum Hood WFC kicks things off.\n1976\nFreightliner expands its product line, introducing the driver-friendly FLL low-cab-forward truck.\n1987\nFreightliner’s first aerodynamic, conventional tractor, the FLD, is introduced in 112” and 120” BBCs. It becomes North America’s best-selling class-8 truck.\n1989\nFreightliner’s proprietary AirLiner suspension gives drivers a new level of comfort, cushioning the cab with airbags built into the suspension. It becomes the best-selling air suspension of all time.\n1990\nThe Freightliner® FLD Classic is introduced to market for the owner-operator desiring a traditional-appearing truck.\n1991\nManufactured for the medium-duty market, the FLN Business Class truck offers improvements in visibility and maneuverability for the vocational truck buyer.\n1992\nThe Freightliner® FLD 70” Raised Roof Sleeper is introduced and rapidly exceeds sales expectations.\n1993\nThe Freightliner® FLD Classic XL provides a 132”-long, BBC traditional-styled truck.\n1995\nThe Freightliner Century Class® offers technological breakthroughs that improve fuel economy, increase payload, enhance driver safety and increase productivity.\n1998\nCombining the spaciousness of a conventional cab and the maneuverability and visibility of a cab-over-engine (COE), the Argosy incorporates the first flat-floor design in a COE. It also offers the industry’s first electronically assisted articulating steps, making it easier to get in and out.\n1999\nFreightliner Trucks introduces the Century Class S/T (Safety/Technology) vehicle, a major product upgrade, adding numerous standard safety and technology features.\n2001\nFreightliner introduces the Business Class M2, offering the strength of steel with the lightweight corrosion resistance of aluminum.\n2004\nFreightliner builds the first—and still the only—full-scale wind tunnel owned and operated by a North American truck manufacturer.\n2007\nThe original Freightliner Cascadia® truck debuts, incorporating a range of new aerodynamic, lightweight and maintenance-reducing features. The Detroit® DD15® engine, a lighter-weight engine that reduces parasitic loss to boost fuel efficiency, is introduced. With a proprietary asymmetric turbocharger, optimized piston design and variable-speed water pump, the DD15 delivers up to 505 horsepower.\n2009\nDeveloped to highlight not only existing technologies, but also to preview what customers could expect in the near future, the Freightliner Cascadia Innovation Truck is revealed at the Mid-America Trucking Show.\n2011\nFreightliner’s 1,000th natural gas-powered truck rolls off the line, cementing North America’s strongest alternative power lineup. The SD line debuts, rounding out Freightliner’s vocational offering to cover a wide range of severe-duty applications, such as construction, mining and municipal segments.\n2012\nThe Freightliner Revolution Innovation Truck concept vehicle appears at the Mid-America Trucking Show, featuring a revolutionary crossover cab with cutting-edge ergonomics and a driver’s jump seat that transforms into a sleep space in seconds. The Freightliner Cascadia Evolution is introduced, setting a new standard for reducing RCO.\n2015\nThe Freightliner SuperTruck is unveiled at the Mid-America Trucking Show, smashing a goal set by the Department of Energy by increasing freight hauling efficiency by 115 percent. The Freightliner Inspiration Truck becomes the first licensed commercial truck to operate in autonomous vehicle mode on open public highways in the United States.\n2017\nElevating the class-8 driving experience for increased comfort and driver retention, the Cascadia is released to the general public, ushering in a new era of on-highway trucking efficiency and uptime—driven by inspired science and the integrated Detroit powertrain.\nLowering every customer’s Real Cost of Ownership by focusing on superior quality, fuel efficiency, uptime, safety, connectivity and driver experience, the Cascadia is poised to take an industry by storm.\nEnhancing the best elements of the successful Cascadia line to create the definitive Cascadia experience, Freightliner increases fuel efficiency by eight percent over the previous model."
    },
    {
      "url": "https://www.slashgear.com/1921311/why-are-semi-trucks-called-18-wheelers/",
      "text": "Why Are Semi-Trucks Called 18-Wheelers? (And How Many Wheels They Really Have)\nA semi-truck is a crucial part of supply chains across the world because of its ability to move goods over long distances. Designed to carry large, heavy, or large quantities of cargo, semi-trucks are huge machines. Their size is essential to transport loads inexpensively and efficiently, and require powerful tractor trucks to pull the trailers that contain the cargo. Semi-trucks are sometimes called other names, including big rig, semis, or 18-wheelers, and for the last moniker, this is because of the combined number of wheels of both the tractor and the trailer.\nThese two parts of a semi-truck each have their own set of wheels. The tractor, or power unit for the whole rig, has ten wheels, which are divided between the front steering axle and the pair of rear drive axles, which have two and four wheels respectively. Trailers can have between two and three axles. The most common type is the double axle, which has four wheels attached to each, for a total of eight wheels for the trailer.\nSemi-trucks have many wheels for several reasons, with weight distribution as the foremost. On semi-trucks, the weight is split between the three axles. This weight distribution is further emphasized for the trailer when carrying loads, with an industry guideline of 60% of the weight in front of the trailer axle and 40% behind it. In essence, proper weight distribution is essential for on-road stability, which impacts the performance of semi-truck operations. Additionally, there are federal regulations that govern weight limits and the load distances per axle that semi-trucks must comply with to avoid hefty fines and penalties.\nMore tires for a safer more stable semi-truck\nThere are other important reasons why a semi-truck needs several wheels. One big reason is to avoid damaging road surfaces, as the weight of the truck is spread across all wheels instead of just a single point. Also, having more wheels and axles allows the semi-truck to be more firmly anchored to the road, which gives the driver better control, a critical factor for a vehicle of its size and weight. Finally, each tire on the semi-truck is federally mandated to have independent brakes, which means more tires mean more stopping power for the truck.\nOf course, the number of wheels on a semi-truck also has its downsides, including increased costs from repairs and replacement and higher fuel consumption. Today, the average mpg of a semi-truck is around 7.1 mpg, and this is substantially impacted by its total weight, including the wheels. For a semi-truck, its tires alone weigh 110 pounds each, while the average steel wheel is 78 pounds, totaling 738 pounds for just the eight wheels, which is heavier than a Harley Davidson Dyna. In addition, the greater number of tires causes greater rolling resistance, which also negatively impacts fuel consumption.\nWhile they may all look the same, it is important to note that a semi-truck has three different tire types. The first is the steering tire, which is used in the front of the tractor for steering and handling. The drive tires give traction and power the tractor, and the trailer tires are specifically designed for load handling."
    },
    {
      "url": "https://www.slashgear.com/1841906/semi-truck-vertical-exhaust-stacks-use-explained/",
      "text": "Why Do Semi Trucks Have Vertical Exhaust Stacks?\nThe next time you see a semi truck rumbling down the highway, pay attention to the vertical exhaust stacks rising up from behind the cab. These exhaust pipes aren't just for aesthetic purposes: These smoke stacks are a part of diesel trucks and semis for good reason. They improve engine efficiency, help with environmental safety, and give trucks their signature roar.\nAt a basic level, exhaust stacks are vertical pipes that reroute the exhaust from under the truck bed to above the cab. This design pushes engine emissions up to the sky rather than the traditional downward or outward direction. From a mechanical standpoint, this vertical setup lets more exhaust out more efficiently, which can slightly boost the engine's overall combustion process. The better the engine \"breathes\" like this, the smoother and more coolly it will run overall. This is especially helpful in large diesel engines, which have more exhaust than a traditional gas-powered car.\nOther reasons for a vertical exhaust stack\nBeyond performance, vertical exhaust stacks also have advantages with safety. A semi truck diesel engine's exhaust isn't just noisy ... it's incredibly dirty, too. Routing that exhaust out of the side or back of the truck could expose pedestrians on the side of the road, follow drivers on the highway, or even sensitive cargo in the trailer to harmful emissions. By sending the smoke straight up, exhaust stacks move the fumes up, up, and away.\nLong-haul truckers spend a lot of time idling. Imagine the pollution if semis let the exhaust pour out the side or back of the cab in a crowded loading dock, construction zone, or confined roadway. In these situations, sending the exhaust through vertical vents lowers the risk of exposing everyone to harmful diesel emissions.\nOf course, it's not all about practicality. Looks and sound play a big role, too. Stacks are highly customizable, with plenty options ranging from straight-cut, or miter stacks to the angled, or cat stacks. The sky is the limit when it comes to sizes, with options anywhere from 5 to 10 inches in diameter and 12 to 120 inches in height. Moreover, the larger the stack, the louder the sound – another thing that semis love to show off.\nIs there a law that says semis have to use vertical exhaust stacks?\nThere's no specific law that says semi trucks must use vertical exhaust stacks, but the regulations that do exist make them a very popular choice. According to Federal Motor Carrier Safety Regulation § 393.83, exhaust systems on trucks and truck tractors must discharge to the rear of the cab or, if the exhaust projects above the cab, at a location near the rear of the cab. The rules also prohibit exhaust from venting directly beneath or in front of the driver's compartment, or in areas where it could damage wiring, fuel systems, or other combustible parts.\nVertical stacks offer a reliable way to check all the boxes: They push exhaust well above the cab, meet the regulation's location requirements, and reduce the risk of harmful diesel fumes entering the cabin or affecting sensitive parts or cargo on the vehicle.\nSo, while they're not mandated by law, vertical stacks are nevertheless an easy and efficient way to stay street-legal. Just don't go thinking about attaching one to your gas-powered sedan anytime soon."
    },
    {
      "url": "https://www.slashgear.com/1670414/semi-trucks-most-popular-america/",
      "text": "6 Of The Most Popular Semi-Truck Brands In America\nIt's almost impossible to overstate just how important the trucking industry is to the U.S., with semi-trucks carrying over 11 billion tons of freight (in primary shipments) over American roads in 2023 alone. With so many big rigs driving across the country, there is clearly a lot of money to be made in manufacturing and selling semi-trucks. In 2023 the semi market was valued at $141.7 billion, and it's expected to grow over the next decade.\nFreight companies and independent truckers often look for certain qualities in a heavy-duty tractor that will save them money in the long run. That includes fuel efficiency, initial costs, durability, and reliability — after all, you're not going to make much money shipping cargo if your truck is constantly breaking down on the side of the highway. Driver comfort can also be important, since truckers spend a lot of time in a semi's cab and should to be at their best in order to reach their destination on time. Similarly, there is an increasing appetite for newer technology and innovative features, like driver assistance systems and modern displays.\nAnother factor that's growing in importance is sustainability. Just because the auto industry is making a big push into all-electric motors doesn't mean semis — which are primarily fueled by diesel — will soon be a thing of the past. Several of the biggest names in trucking have already begun converting popular models into BEV models or designing new ones from scratch. If you're wondering what the biggest names in trucking are and whether you've heard of them before, here are the six most popular semi-truck brands in America, which collectively account for nearly all of the big rigs currently transporting goods around the country.\nFreightliner\nFreightliner isn't just one of the most popular semi-truck brands in America — it's without a doubt the most popular, and by a wide margin, at least if you're going strictly by sales. As of 2024, Freightliner commands nearly 38% of semi-truck sales in the U.S. As a result, Freightliner has a variety of different types of trucks on the road, including the Cascadia, which has a sleek, aerodynamic design that helps make it more fuel efficient — even with a whopping max 600 horsepower. Truckers are big fans of the brand, as Freightliner doesn't ignore driver comfort, which is obviously important for workers spending countless hours behind the wheel.\nThe brand has built a reputation for being reliable and durable, as well as developing and incorporating advanced technology, which has become just as — if not more — important to the trucking industry as it has for commercial automakers. The company has even launched fully-electric commercial trucks including the eCascadia, which has a range of up to 230 miles and can recharge up to 80% in under 90 minutes, as well as the medium-duty eM2, which can do the same in under an hour and has a range of up to 250 miles. Freightliner even built a prototype autonomous big rig way back in 2015.\nPeterbilt\nNearly 15% of semi-trucks sold in America are Peterbilt trucks. Peterbilt Motors Company is a subsidiary of PACCAR, which also owns popular big rig brand Kenworth and manufactures many of the engines that power Peterbilt vehicles. Peterbilt is popular partly for its willingness to customize vehicles to best fit its clients' needs and preferences. The distinct designs of these trucks often include sleek lines, long hoods, and striking front grilles that are hard to ignore.\nIn addition to long-haul tractors, the brand also makes regional and vocational trucks, among other vehicle types. The Peterbilt 579 is one of its best-known rigs and boasts up to 605 horsepower, while also being fuel efficient and including roomy, comfortable sleeper cabs for its drivers.\nAs one of the leading semi-truck brands in the U.S., Peterbilt has also made a commitment to a greener future. The battery-electric model of its 579EV is even slightly more powerful, with a 500 kW engine that can deliver up to 670 horsepower. It can run 150 miles on a single charge and is particularly efficient for regional hauls, as its regenerative braking system conserves energy during the frequent stopping and starting that off-highway travel often involves.\nKenworth\nPACCAR also owns Kenworth Trucks. By itself, Kenworth boasts 14% of the semi-truck sales, which means that PACCAR has hold of around 29% of the entire market share in the country, second only to Freightliner. Like its sibling company, Kenworth also provides customizable medium and heavy-duty trucks, and its vehicles are also known for their durability, efficiency, and versatility. It's also known for using quality materials, ergonomic seating, and easier-to-use controls. Truckers also find Kenworth's advanced technology valuable, such as adaptive cruise control, collision avoidance features, and modern infotainment options.\nThe T680 is perhaps the best-known long-hauler made by Kenworth. It sports an innovative aerodynamic design — including a narrower hood and grille design — that the company claims saves owners up to seven percent in fuel savings. The truck's PACCAR engine can also deliver up to 510 horsepower and 1,850 lb-ft of torque. Kenworth also offers alternative fuel options including both natural gas and hybrid engines, as well as EVs, including a fully-electric model of its T680.\nWhile T680 DCEV doesn't pack quite as much horsepower as its diesel counterpart, it can travel up to 450 miles on a single charge and reach speeds of up to 70 miles per hour. As highways become more and more populated by electric cars and trucks, Kenworth will likely remain a popular semi-truck brand in America if it continues to innovate and incorporate EVs into its fleet.\nInternational\nWith an 11% share of the American semi-truck market, International Trucks is one of the most popular brands in the country. International, which also makes cement mixers and other heavy-duty vehicles, is owned by Navistar, which also manufactures truck parts and operates IC Bus, a major brand in its own right that builds school buses. Notably, International uses its own first-party axles in its trucks, as opposed to the Eaton Fuller or Rockwell axles used by many other popular semi brands in their drivetrains.\nThe brand makes a versatile fleet of trucks, including light, medium, and heavy-duty rigs, as well as severe-duty dump trucks. One option for truckers and trucking companies is an LT Series rig with a Cummins X15 Efficiency Engine (which is comparable to PACCAR's diesel engines), a tractor that's propelled by up to 565 horsepower with 2,050 lb-ft of torque.\nThe LT Series also provides several cab options for drivers, including day cabs and low-roof, high-rise, and sky-rise sleepers. International has also leaned into making more zero-emission vehicles and says that its EVs have already logged millions of miles of real-world road. The medium-duty eMV made by International, for example, has an average range of 135 miles and can produce up to 342 horsepower.\nVolvo\nEven if you don't know much about 18-wheelers, one semi-truck brand you've likely heard of is Volvo — the same Swedish company that makes passenger cars and SUVs. In addition to these vehicles, Volvo also accounts for over 10% of big rigs in the U.S. Along with other factors that are popular with truckers and shipping companies – including fuel efficiency, reliability, driver comfort, and durability — newer Volvo trucks are equipped with state-of-the-art smart technology that can monitor performance in real-time and allow for enhanced fleet management. Advanced safety features and driver assistance systems also make Volvo trucks easier and safer to drive.\nPlus, Volvo trucks have solid maneuverability, which makes them ideal for regional and local distribution in urban environments with smaller, more congested streets. One standout model from the brand is the Volvo VNL, which features state-of-the-art amenities like a digital information display and infotainment system in the dash, stalk-mounting shifting, and a comfortable, modern-looking sleeping space. The VNL is also fuel efficient, has a peak torque of 1,950 lb-ft, and can deliver up to 500 horsepower.\nAs with other major semi manufacturers, Volvo also now has fully-electric models available, including the Volvo FH and the Volvo VNR Electric, which has a 275-mile range and can charge up to 80% in 90 minutes.\nMack\nPerhaps the most well-known name in trucking is Mack, which was founded in Brooklyn, New York at the turn of the last century – nearly a decade before the Model-T first hit the road. While it was once an independent company, Mack has been owned by Volvo since 2001, though still operates at its own separate brand from its parent company. Mack makes up around 8.4% of the semi-trucks in the U.S. Combined with the rest of its 10% market share, that makes Volvo responsible for over 18% of the big rigs in America.\nMack trucks have a reputation for prioritizing durability over driver comfort, so while truckers might not love the cab of a Mack, they'll appreciate its ability to make long hauls in tough conditions. The Mack Anthem is a Class 8 tractor with up to 505 horsepower under its hood and which sports a comfier cab than previous Macks, with a ceiling height of over seven feet in the sleeper and modular cabins that allow for customizable storage spaces, flatscreen TVs, microwaves, and stainless steel refrigerators.\nWhile the brand has released smaller EV trucks, there is still no fully-electric Mack big rig for long hauls. Considering that Volvo is already catering to that part of the market, it's currently unclear if Mack will eventually transition to an electric future or cede more ground to other major semi-truck brands and become less of an American trucking staple and more of a niche — albeit one with a legacy well over 100 years old."
    },
    {
      "url": "https://www.slashgear.com/1895303/kenworth-t680-vs-peterbilt-579-what-difference-which-better-long-haul-truck/",
      "text": "Kenworth T680 Vs Peterbilt 579: What's The Difference & Are Either Considered Better For The Long-Haul?\nDesigned with long-haul efficiency and driver comfort first, the Kenworth T680 and Peterbilt 579 are some of the most popular semi-trucks on the highway, both with legendary reputations. Although their specs and features often overlap, these two trucks – which share the same parent company, PACCAR – are not exactly alike. Choosing between the T680 and 579 is more than just a question of brand loyalty for fleet managers and drivers both, it's about striking the ideal mix of technology, fuel economy, durability, and driver experience.\nBoth trucks have similar powertrain choices, with the PACCAR MX-13 engine and automated transmissions, designed for maximum efficiency, being available for both. Their different designs, inside layouts, and ride quality have split supporters among long-distance drivers.\nWhile Peterbilt usually gets compliments for its classic styling, high quality materials and more modular dash, Kenworth typically attracts those seeking simpler driver tech and more creature comforts like cabin noise control and improved sleep area. The rivalry between the two has never been fiercer, as both models receive constant updates, including advanced driver assistance systems and better aerodynamics. The question still stands for those who intend to spend many hours and miles on the road: Which rig actually provides the better long-haul experience?\nWhich truck feels better behind the wheel?\nTo begin with, the Peterbilt 579 appeals for its elegant interior and strong exterior design. Many drivers view Peterbilt's ergonomic, customizable cab — especially with the revised 579 Ultraloft sleeping arrangement – as more premium. It boasts a big 15-inch touchscreen interface, cutting-edge digital displays, and loads of personal storage for long trips. The inside of the Kenworth T680, meanwhile, promotes simplicity and seamless integration of digital systems. Although the T680 has a 15-inch digital display as well, its somewhat simpler design leans towards ease of use, something many drivers value when logging long hours\nThanks to its sophisticated suspension system and better cab insulation, Kenworth's T680 is sometimes cited as having better ride quality. Feedback from long-distance drivers and sources like Pay4Freight indicates that Kenworth cabins feel quieter and more refined on uneven roads, which can greatly and positively affect driver fatigue over time. Conversely, Peterbilt stresses simplicity of maintenance and customization. The 579's customizable and spacious cabin is praised by long-distance drivers, while its high-quality components are designed to last for years.\nAlthough both trucks are comfortable, the Kenworth T680 might have a small advantage for drivers who value a quiet, cushioned ride and streamlined tech, while the Peterbilt 579 holds great appeal for those who value creature comforts, customization, and space in their semi-truck cabin and sleeper cab.\nWhich is the better investment?\nBoth trucks have the same PACCAR engine choices under the hood, usually the MX-13 engine combined with either an Eaton gearbox or the PACCAR 12-speed automated transmission. As one of the most powerful truck engines, the MX-13 is capable of putting out over 1800 lb-ft of torque and 500 hp, but the Kenworth is known to edge out the Peterbilt truck when it comes to real-world MPG thanks to innovative aerodynamics and predictive cruise control.\nWhere user preferences really matter are durability and serviceability. Peterbilt is renowned for its build quality, making the brand the go-to for many fleet managers looking to save time and money on maintenance.\nAnother consideration is price. Although both trucks fall in a similar price range when new, with the Peterbilt 579 priced between $160,000 and $210,000 and the Kenworth T680 from around $170,000 to $200,000. The Peterbilt 579 is known to have better resale value mostly because of its more general brand attractiveness in the used market. So, when it comes to choosing a long-distance hauler, both trucks offer amazing features and unique selling points, and it ultimately boils down to what drivers and fleet managers value most."
    },
    {
      "url": "https://www.slashgear.com/rm-sothebys-to-auction-55-mercedes-300-sl-sportabteilung-gullwing-02412561/",
      "text": "RM Sotheby's To Auction '55 Mercedes 300 SL Sportabteilung Gullwing\nOne of the most valuable of all classic Mercedes-Benz cars are the 300 SL Gullwing cars of the mid to late '50s. RM Sotheby's is set to auction off one of these rare cars and this one is even more special and rare than the norm. The car is a 1955 Mercedes-Benz 300 SL \"Sportabteilung\" Gullwing. The car is a special completion version of 300 SL and is only one of four that were made.\nThis car is the first of the four W198 Gullwing steel-bodied cars that were prepared by the Sportabteilung or competition department. The car has a 240hp inline six-cylinder engine with Bosch R3 mechanical fuel injection and four speed manual transmission.\nThe front suspension is independent and uses coil springs along with a modified rear swing-axle suspension with coil springs and ventilated drum brakes. The car was driven to the second place overall in the 1956 Tour de France by Sir Stirling Moss.\nRM Sotheby's expects the car to generate lots of interest and to bring big money at auction. With its rarity and racing pedigree being driven to success by one of the most famous racers of the era it's rightly considered to be a golden-grail for collectors.\nSOURCE: RM Sotheby's"
    }
  ],
  "argos_summary": "The article highlights 13 of the most visually striking semi trucks from the 1950s, showcasing their unique designs and powerful engines that have made them iconic in the trucking industry. Notable models include the Kenworth 524, Peterbilt 351, and Mack B61, each celebrated for their aesthetic appeal and engineering prowess. The piece emphasizes the golden age of semi-truck design during the post-war years, where trucks featured hand-formed aluminum bodies and eye-catching paint schemes, many of which are now highly sought after by collectors.",
  "argos_id": "LW8SH0J08"
}