{
  "url": "https://www.morningstar.com/news/dow-jones/202508121015/asia-stock-markets-get-a-lift-as-china-us-extend-tariff-truce",
  "authorsByline": "",
  "articleId": "fd2e8f3737a845feb438fe38522858e4",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:56:00-05:00",
  "addDate": "2025-08-12T07:25:42.165849+00:00",
  "refreshDate": "2025-08-12T07:25:42.165850+00:00",
  "score": 1.0,
  "title": "Asia Stock Markets Get a Lift as China, U.S. Extend Tariff Truce",
  "description": "",
  "content": "Asian stocks were broadly higher after President Trump said he would grant China a 90-day extension on tariffs that were set to kick in Tuesday.\n\nChina's commerce ministry confirmed the move hours after Trump's announcement, saying it would prolong the truce until mid-November.\n\nThe delay gives the world's two largest economies more time to resolve their trade dispute, offering relief to markets already somewhat cheered by a spate of other tariff-reducing deals.\n\nChina's benchmark Shanghai Composite Index was 0.5% higher Tuesday afternoon, on track for its highest closing level since December 2021.\n\nThe yield on China's 30-year government bonds was up 2 basis points in early afternoon trading at 2.014%, the highest since April 2025, in a possible reflection of a shift toward a more risk-on mood.\n\nMajor indexes scaled peaks elsewhere in Asia too, buoyed as well by policy moves and earnings optimism.\n\nJapan's Nikkei Stock Average touched its highest level in over a year earlier in the day, and closed 2.1% higher.\n\nAustralia's S&P/ASX 200 set another high after the country's central bank cut interest rates for the third time this year.\n\nThe extension of the China-U.S. detente \"averts costly re-escalation for now,\" keeping tariffs steady until November, said Lynn Song, Greater China chief economist at ING.\n\n\"While China continues to face some of the highest tariff rates, the relative disadvantage compared to many other economies has narrowed,\" Song said in a note, adding that duties for many economies are rising from 10% to 15%-40%.\n\nThe extension gives Chinese equities some breathing room, Vishnu Varathan of Mizuho Securities said in a note.\n\n\"Given Trump's positive remarks about negotiations with China, this extension is presumably on grounds of optimism about, and goodwill for, an impending trade deal,\" he said.\n\nAsian chip makers were among the biggest gainers. Japan's Advantest rose 6.1%, while Semiconductor Manufacturing International Corp., China's largest chip maker, added 4.4%.\n\nTaiwan's Taiex added 0.1% but Hong Kong's Hang Seng Index was flat after flitting between gains and losses.\n\nFutures tied to U.S. indexes were muted ahead of Tuesday's U.S. inflation report.\n\n\"CPI data tonight will be closely watched for signs of tariff passthrough,\" with policymakers previously noting that it may not be possible for front-loading and suppliers to hold back price increases indefinitely, DBS senior rates strategist Eugene Leow said in a note.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Greater China",
      "weight": 0.089718714
    },
    {
      "name": "China",
      "weight": 0.08898573
    },
    {
      "name": "Greater China chief economist",
      "weight": 0.08380718
    },
    {
      "name": "Tariff Truce",
      "weight": 0.07886154
    },
    {
      "name": "tariff passthrough",
      "weight": 0.07673242
    },
    {
      "name": "tariffs",
      "weight": 0.07340575
    },
    {
      "name": "many other economies",
      "weight": 0.0711361
    },
    {
      "name": "U.S. indexes",
      "weight": 0.06675463
    },
    {
      "name": "DBS senior rates strategist Eugene Leow",
      "weight": 0.06528018
    },
    {
      "name": "many economies",
      "weight": 0.06493859
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.994140625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9208984375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.91845703125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.7431640625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.5068359375
    }
  ],
  "sentiment": {
    "positive": 0.8316746,
    "negative": 0.06488782,
    "neutral": 0.1034376
  },
  "summary": "Asian stocks rose following President Trump's announcement that China and the United States would extend a 90-day tariff truce until mid-November. The extension gives the world's two largest economies more time to resolve their trade dispute. China's benchmark Shanghai Composite Index was 0.5% higher on the day, on track for its highest closing level since December 2021. The yield on China's 30-year government bonds also rose, indicating a shift towards a more risk-on mood. Major Asian stock markets also saw significant gains, with Japan's Nikkei Stock Average reaching its highest level in over a year and Australia's S&P/ASX 200 setting another high after the country's central bank cut interest rates.",
  "shortSummary": "Asian stock markets rose after President Trump extended China's tariff extension, allowing more time for resolving their dispute, with major indexes hitting highs and bond yields rising.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "86ffc3b845424f11bd5494a37df99ef4",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Asian stocks rose after President Trump announced a 90-day extension on tariffs with China, allowing more time for trade negotiations. China's Shanghai Composite Index increased by 0.5%, while Japan's Nikkei Stock Average reached a one-year high, closing up 2.1%. The extension is seen as a positive move, providing relief to markets and boosting optimism among investors, particularly in the chip manufacturing sector.",
  "argos_id": "LWWM7BMZD"
}