{
  "url": "https://www.nytimes.com/es/2025/08/12/espanol/que-significa-inedible.html",
  "authorsByline": "The Learning Network",
  "articleId": "54af7c68670b4b0888634c6b904f8cca",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/07/31/espanol/WOTD-inedible-ES-copy1/WOTD-inedible-facebookJumbo.png",
  "country": "us",
  "language": "es",
  "pubDate": "2025-08-12T07:00:06.286000+00:00",
  "addDate": "2025-08-12T07:11:03.805174+00:00",
  "refreshDate": "2025-08-12T07:11:03.805176+00:00",
  "score": 1.0,
  "title": "Qué significa inedible",
  "description": "Esta palabra ha aparecido en 26 artículos en NYTimes en el último año. ¿Puedes usarla en una frase?",
  "content": "La palabra del día en inglés Esta palabra ha aparecido en 26 artículos en NYTimes.com en el último año. ¿Puedes usarla en una frase? 12 de agosto de 2025 a las\n\n: not suitable for food\n\n: no apto para la alimentación El término inedible puede traducirse al español como no comestible o incomible. Recuerda que las palabras de un idioma no siempre tienen una correspondencia directa en otro idioma. Esto es, a veces es necesario usar una frase para expresar el significado de un término en otro idioma. Igualmente, pueden no compartir todos sus significados. La palabra inedible ha aparecido en 26 artículos de NYTimes.com en el último año, incluido el 9 de julio en “Over 200 Children Hospitalized in China After School Serves Lead-Tainted Food”, por David Pierson y Berry Wang: ¿Puedes utilizar correctamente la palabra inedible en una frase? A partir de la definición y el ejemplo proporcionados, escribe una frase en inglés con la palabra del día de hoy. Lo más importante es que tu frase tenga sentido y demuestre que entiendes la definición de la palabra, pero también te animamos a que seas creativo y te diviertas. Para tener una mejor idea de cómo se puede utilizar inedible en una frase, lee estos ejemplos de uso en Vocabulary.com. También puedes visitar esta guía y aprender a utilizar los símbolos IPA que muestran cómo se pronuncian las distintas palabras. Si disfrutas con este reto, prueba nuestros cuestionarios de vocabulario. La palabra del día la proporciona Vocabulary.com. Obtén más información y consulta ejemplos de uso sobre diversos temas en el Diccionario Vocabulary.com. En esta columna encontrarás todas las ediciones de la Palabra del día.",
  "medium": "Article",
  "links": [
    "http://nytimes.com",
    "https://www.nytimes.com/es/section/estilos-de-vida",
    "https://www.nytimes.com/es/section/tiempo-y-clima",
    "https://www.nytimes.com/es/section/estados-unidos",
    "https://www.nytimes.com/2025/07/09/world/asia/china-children-lead-poisoning.html",
    "http://www.vocabulary.com/dictionary/",
    "https://www.nytimes.com/2025/08/12/learning/word-of-the-day-inedible.html",
    "https://www.vocabulary.com/dictionary/inedible",
    "https://www.nytimes.com/es/column/aprender-palabra-ingles",
    "https://www.nytimes.com/es/section/ciencia-y-tecnologia",
    "https://www.nytimes.com/es/section/mundo",
    "https://www.nytimes.com/spotlight/vocabulary-quizzes",
    "https://www.nytimes.com/es/section/negocios",
    "http://vocabulary.com",
    "https://www.nytimes.com/es/spotlight/notas-de-bienestar",
    "https://www.nytimes.com/es/section/cultura",
    "https://www.vocabulary.com/resources/ipa-pronunciation/",
    "https://www.nytimes.com/es/",
    "https://www.nytimes.com/es/section/america-latina",
    "https://www.nytimes.com/es/section/opinion",
    "https://www.nytimes.com/es/section/deportes"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "examples",
      "weight": 0.07348917
    },
    {
      "name": "various topics",
      "weight": 0.072433226
    },
    {
      "name": "David Pierson",
      "weight": 0.071030274
    },
    {
      "name": "food",
      "weight": 0.06747488
    },
    {
      "name": "The unable word",
      "weight": 0.06498796
    },
    {
      "name": "more information",
      "weight": 0.06415811
    },
    {
      "name": "use",
      "weight": 0.06302506
    },
    {
      "name": "Nytimes.com",
      "weight": 0.06178787
    },
    {
      "name": "Berry Wang",
      "weight": 0.05946353
    },
    {
      "name": "the different words",
      "weight": 0.059377637
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [],
  "sentiment": {
    "positive": 0.13925949,
    "negative": 0.3569162,
    "neutral": 0.50382435
  },
  "summary": "",
  "shortSummary": "",
  "translation": "The word of the day in English this word has appeared in 26 articles at Nytimes.com in the last year. Can you use it in a sentence? August 12, 2025 at\n\n: not suitable for food\n\n: Not suitable for feeding The unable term can be translated into Spanish as non -edible or abundable. Remember that the words of a language do not always have a direct correspondence in another language. This is sometimes it is necessary to use a phrase to express the meaning of one term in another language. Likewise, they may not share all their meanings. The unable word has appeared in 26 articles by Nytimes.com in the last year, including July 9 in “Over 200 Children Hospitalized in China After School Serves Lead-Tainced Food”, by David Pierson and Berry Wang: Can you correctly use the word unable in a phrase? From the definition and the example provided, write a phrase in English with the word of today. The most important thing is that your phrase makes sense and show that you understand the definition of the word, but we also encourage you to be creative and have fun. To have a better idea of how it can be used in a phrase, read these examples of use in vocabulary.com. You can also visit this guide and learn to use the IPA symbols that show how the different words are pronounced. If you enjoy this challenge, try our vocabulary questionnaires. The word of the day provides vocabulary.com. Get more information and consult examples of use on various topics in the vocabular and.com dictionary. In this column you will find all the editions of the word of the day.",
  "translatedTitle": "What does it mean unable",
  "translatedDescription": "This word has appeared in 26 articles in Nytimes in the last year. Can you use it in a sentence?",
  "translatedSummary": "The word of the day in English has been the subject of 26 articles on Nytimes.com in the past year, with the definition and example provided. The term, which can also be translated into Spanish, can be used in other languages. The challenge involves using a phrase to express the meaning of a term in another language, making it clear that the word is not suitable for food. The article also includes a question: Can you correctly use this word in a phrase?",
  "reprint": false,
  "reprintGroupId": "578045203fbf4e9f8afeda3cfc99ca78",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/spotlight/vocabulary-quizzes",
      "text": "Vocabulary in Context: TikTok Influencing\nTest your vocabulary and reading comprehension with this quiz based on the Times article “For Gen Z, Playing an Influencer on TikTok Comes Naturally.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “For Gen Z, Playing an Influencer on TikTok Comes Naturally.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Inside the ‘Top Chef’ Industrial Complex.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Pythons, Invasive and Hungry, Are Making Their Way North in Florida.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Snarl, You’re on Candid Camera.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Dance Like You’re Wednesday Addams.”\nCompiled by Katherine Schulten\nThis word has appeared in 12 articles on NYTimes.com in the past year. Can you use it in a sentence?\nBy The Learning Network\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Taking Back the Mountains.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “A Championship Season in Mariachi Country.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Behind Bad Bunny’s Summery Surprise, ‘Un Verano Sin Ti’.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Gen Z Knows What It Wants From Employers. And Employers Want Them.”\nCompiled by Katherine Schulten\nAdvertisement\nAdvertisement"
    },
    {
      "url": "http://nytimes.com",
      "text": "New York Times - Top Stories\nPresident Trump set a low bar for his summit with President Vladimir Putin, saying he was ready to walk away if no deal on ending the war was forthcoming.\n5 min read\nRussia has repeatedly targeted soldiers assembled at military academies, barracks and parade grounds.\n4 min read\nOfficials accused Anas al-Sharif of being a Hamas operative posing as a reporter. Al Jazeera says he and four other victims worked for the network.\n2 min read\nThe troops President Trump is sending into Washington, D.C., will not perform law enforcement tasks but may be able to detain people temporarily, officials said.\n4 min read\nPresident Trump has railed against crime in largely liberal cities for decades, but Monday’s announcement was an extraordinary exertion of federal power.\n6 min read\nPresident Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year.\n4 min read\nPresident Trump said he would nominate the economist E.J. Antoni for the role. He fired the previous chief after a downbeat jobs report.\n4 min read\nA $500 million settlement would end a battle that pitted the nation’s wealthiest school against the Trump administration’s crackdown on higher education.\n6 min read\nThe former Texas governor and Trump energy secretary has now dedicated his life to promoting the powerful psychedelic ibogaine.\n8 min read\nAdvertisement\nSKIP ADVERTISEMENTMore News\nThe gunman fled and was caught after stealing two cars, the police in Austin said.\n3 min read\nThe images are the latest reflecting the wave of sectarian violence that has recently consumed the country and left more than 1,000 dead.\n3 min read\nThree rabbits used in a photo shoot featuring Anna Delvey, whose real name is Anna Sorokin, were found abandoned in Prospect Park in Brooklyn.\n4 min read\nWell\nCulture and Lifestyle\nAudio\nPodcasts and narrated articles\nAudio\nPodcasts and narrated articlesGames\nDaily puzzles\nGames\nDaily puzzles"
    }
  ],
  "argos_summary": "The word of the day is 'inedible,' which translates to 'no apto para la alimentación' in Spanish. It has appeared in 26 articles on NYTimes.com over the past year, including a notable article about children hospitalized due to lead-tainted food. The article encourages readers to use the word in a sentence, highlighting the importance of understanding its definition and context.",
  "argos_id": "LZQEPWUQF"
}