{
  "url": "https://seekingalpha.com/article/4812764-industry-analysis-specialty-chemicals-20-percent-total-return-potential-stepan-company",
  "authorsByline": "Mark Bern",
  "articleId": "c80918382ebc45d68cab595a11f025fa",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1387118000/image_1387118000.jpg?io=getty-c-w1536",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:24:01+00:00",
  "addDate": "2025-08-12T19:26:25.126365+00:00",
  "refreshDate": "2025-08-12T19:26:25.126367+00:00",
  "score": 1.0,
  "title": "Industry Analysis: Specialty Chemicals - 20% Total Return Potential With Stepan (SCL)",
  "description": "Stepan Company (SCL) stands out with a 3.1% yield, strong dividend growth, low price to free cash flow, and a 56-year dividend increase streak. Read the full stock analysis here.",
  "content": "At Friedrich Global Research we are searching for what we believe will be the safest and best performing companies in which to buy stocks. We focus on free cash flow, efficient capital allocation, and consistently superior results to identify the highest quality management teams.\n\nI always want to stick with quality companies. When I was younger, I was always on the prowl for small, fast-growing companies with a compelling story. That did not lead to the success I needed as many of those stories\n\nFounder of Bern Factor LLC, an independent research and publishing firm located in Virginia. I have nearly 40 years of investing and analysis experience. I am a former CPA (1990 -2017) and became a CFA charter holder in 2000. I consider myself an expert in Quantitative and Qualitative analysis and have extensive experience in Technical Analysis. I also have a deep interest in stock market history and hold degrees in Economics (BS) and Management Information Systems (MBA). I have been actively involved with investment analysis since 1985 but have been a student of investing since the 1960s. I owned my first individual stock position while still in high school. I am a student of Benjamin Graham and Warren Buffett. I have achieved a uniquely diverse experience from multiple careers that has allowed me to develop a broad perspective enabling me to look at the big picture of macroeconomics all the way down to the detail of a retail unit or factory floor. In my youth I was in retail, then served in reconnaissance during my tours in Vietnam. I have been a blue collar, union worker in a factory and a manager in services, hospitality and transportation as well as a manager of professional staffs. I have more than 20 years of experience each in both the public and private sectors. I have personal points of reference that many analysts will never have. I bring more to the table than just the theories and models I have studied or built. To understand more about my investing philosophy please visit my website.\n\nAnalyst’s Disclosure:I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Short position through short-selling of the stock, or purchase of put options or similar derivatives in SCL over the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. \n\n\n\nDISCLAIMER: This analysis is not advice to buy or sell this or any stock; it is just pointing out an objective observation of unique patterns that developed from our research. Factual material is obtained from sources believed to be reliable, but the poster is not responsible for any errors or omissions, or for the results of actions taken based on information contained herein. Nothing herein should be construed as an offer to buy or sell securities or to give individual investment advice.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    },
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "investment analysis",
      "weight": 0.07453317
    },
    {
      "name": "stock market history",
      "weight": 0.07297819
    },
    {
      "name": "stocks",
      "weight": 0.07085833
    },
    {
      "name": "individual investment advice",
      "weight": 0.070629366
    },
    {
      "name": "quality companies",
      "weight": 0.06766574
    },
    {
      "name": "individual investors",
      "weight": 0.061265822
    },
    {
      "name": "Seeking Alpha",
      "weight": 0.06067131
    },
    {
      "name": "US investment adviser",
      "weight": 0.060215205
    },
    {
      "name": "similar derivative position",
      "weight": 0.05897981
    },
    {
      "name": "Technical Analysis",
      "weight": 0.058376428
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9931640625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9560546875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.95361328125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.423095703125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.359130859375
    }
  ],
  "sentiment": {
    "positive": 0.40308243,
    "negative": 0.08874023,
    "neutral": 0.50817734
  },
  "summary": "F Friedrich Global Research, founder of Bern Factor LLC, has nearly 40 years of investing and analysis experience. He is a former CPA and CFA charter holder, and considers himself an expert in Quantitative and Qualitative analysis and extensive experience in Technical Analysis. He also holds degrees in Economics (BS) and Management Information Systems (MBA). He has been actively involved with investment analysis since 1985 but has been a student of investing since the 1960s. His diverse background allows him to develop a broad perspective on macroeconomics and retail operations. However, this analysis is not advice to buy or sell any stock mentioned, merely an observation of unique patterns developed from our research.",
  "shortSummary": "F Friedrich Global Research, based on expert analysis, identifies the best performing companies in the Specialty Chemicals sector with high quality management teams.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9776f22c670f4ac398a18a1e0ea96933",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Friedrich Global Research focuses on identifying high-quality companies for stock investment, emphasizing free cash flow and efficient capital allocation. The founder, with nearly 40 years of experience in investing and analysis, advocates for investing in quality companies rather than fast-growing ones with compelling stories. The article includes a disclaimer stating that it does not constitute investment advice and highlights the author's lack of current positions in mentioned stocks.",
  "argos_id": "MHE8GTR1S"
}