{
  "url": "https://www.investing.com/indices/s-p-cnx-nifty-chart",
  "authorsByline": "",
  "articleId": "92d1d1839b13493f8c86fcf71e9eebf8",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-13T01:31:34+00:00",
  "addDate": "2025-08-13T02:11:31.568910+00:00",
  "refreshDate": "2025-08-13T02:11:31.568911+00:00",
  "score": 1.0,
  "title": "Nifty 50 Chart (NSEI) - Investing",
  "description": "Here you will find a real-time chart of the S&P CNX Nifty.",
  "content": "Risk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks.\n\n Before deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed.\n\n Fusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily provided by any market or exchange, but may be provided by market makers, and so prices may not be accurate and may differ from the actual price at any given market, meaning prices are indicative and not appropriate for trading purposes. Fusion Media and any provider of the data contained in this website will not accept liability for any loss or damage as a result of your trading, or your reliance on the information contained within this website.\n\n It is prohibited to use, store, reproduce, display, modify, transmit or distribute the data contained in this website without the explicit prior written permission of Fusion Media and/or the data provider. All intellectual property rights are reserved by the providers and/or the exchange providing the data contained in this website.\n\n Fusion Media may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers.",
  "medium": "Article",
  "links": [
    "https://cdn.investing.com/about-us/terms_and_conditions.pdf",
    "https://twitter.com/investingcom",
    "https://cdn.investing.com/about-us/privacy_policy.pdf",
    "https://www.facebook.com/investingcom",
    "https://cdn.investing.com/about-us/risk_warning.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "financial instrument",
      "weight": 0.10220824
    },
    {
      "name": "financial instruments",
      "weight": 0.10220824
    },
    {
      "name": "risk appetite",
      "weight": 0.10098604
    },
    {
      "name": "high risks",
      "weight": 0.0993339
    },
    {
      "name": "Risk Disclosure",
      "weight": 0.0924829
    },
    {
      "name": "Fusion Media",
      "weight": 0.0899529
    },
    {
      "name": "market makers",
      "weight": 0.08277965
    },
    {
      "name": "Prices",
      "weight": 0.07338777
    },
    {
      "name": "prices",
      "weight": 0.07338777
    },
    {
      "name": "cryptocurrencies",
      "weight": 0.07140554
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9931640625
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.8759765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.771484375
    }
  ],
  "sentiment": {
    "positive": 0.116318144,
    "negative": 0.24714893,
    "neutral": 0.6365329
  },
  "summary": "The risk of trading in financial instruments and/or cryptocurrencies involves high risks, including the potential for losing some of your investment amount. The volatility of these currencies may increase due to external factors such as financial, regulatory or political events. The data and prices on this website are not necessarily real-time nor accurate, but may be provided by market makers. It is prohibited to use, store, reproduce, display, modify, or distribute the data without the explicit permission of the data provider.",
  "shortSummary": "Risk Disclosure: Trading in financial instruments and cryptocurrencies involves high risks, including losing some or all of your investment amount, requiring expert advice.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "275ca3c6df5e42f2a17820eccc143721",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Trading in financial instruments and cryptocurrencies carries significant risks, including the potential loss of the entire investment. Prices are highly volatile and can be influenced by various external factors, necessitating careful consideration of investment objectives and risk tolerance. Users are advised to seek professional guidance and be aware that the data provided on the website may not be real-time or accurate, and reliance on this information is at their own risk.",
  "argos_id": "MO457L8AJ"
}