{
  "url": "https://www.forbes.com/sites/garystoller/2025/08/12/museum-exhibition-uses-the-art-of-sports-to-attract-visitors/",
  "authorsByline": "Gary Stoller",
  "articleId": "c2f58af82d9740cab4a80e2c89ed4741",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/6851cbf187dd69cc5464a5f6/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:13:41+00:00",
  "addDate": "2025-08-12T18:20:41.268085+00:00",
  "refreshDate": "2025-08-12T18:20:41.268089+00:00",
  "score": 1.0,
  "title": "Museum Exhibition Uses The Art Of Sports To Attract Visitors",
  "description": "Using the artistry of sports, the San Francisco Museum of Modern Art sends its unique \"Get in the Game\" exhibition to Crystal Bridges Museum of Modern Art in Arkansas.",
  "content": "An exhibition aimed at attracting sports fans to an art museum is now going on the road to other museums.\n\nSFMOMA, the San Francisco Museum of Modern Art, organized the exhibit, Get in the Game: Sports, Art, Culture,” and presented it at its museum last fall through Feb. 18, 2025. The exhibit heads next month to the Crystal Bridges Museum of American Art in Bentonville, Arkansas and will be at the Pérez Art Museum Miami in Florida March-September 2026.\n\nSFMOMA marketed the exhibit by saying it’s art about, and created by, athletes and an opportunity to play on a 22-person foosball table and other artworks.\n\n“At its heart, Get in the Game: Sports, Art, Culture offers a collection of stories that show how sports impacts our culture and our psyches,” SFMOMA says. “They’re the type of stories that fuel our collective passion for ‘the game.’”\n\nFrom the Olympics to the local recreation league, SFMOMA says, the exhibition enables museum goers to “experience how some of our most iconic images have been formed and unforgettable human stories have played out in the world of sports.”\n\nViewers of the exhibition, according to the Crystal Bridges Museum, can discover the depth of swimmer Diana Nyad’s determination “through an unexpected portrait angle”; feel the pressure faced by Billie Jean King through a reenactment of her legendary Battle of the Sexes tennis match against Bobby Riggs, and celebrate Scottie Pippen’s legacy as an NBA superstar “in lustrous ceramic.”\n\nThe exhibition spawned a 169-page book, Get in the Game: Sports, Art, Culture, distributed by Simon & Schuster. Soccer great Megan Rapinoe wrote the forward to the book, and illustrations were done by surfer AJ Dungo, who illustrated the 2019 graphic novel In Waves.\n\nAt Crystal Bridges Museum, the exhibition will present more than 150 sports-related pieces, inviting visitors to “experience moments of joy, connection and personal resonance,” museum officials say. The pieces will encourage “reflection on well-being, mindful action, physical activity and mental health awareness.”\n\nArtists and athletes share a “rich, creative expression,” the officials say, and the exhibition calls on visitors to “get in the game and discover interconnections between sports, art and contemporary culture.”\n\nThe exhibition, which is sponsored by Bank of America, begins Sept. 13 and runs through Jan. 26, 2026. Admission is $15 or free for museum members and youths age 18 and under. On Sept. 11, the museum will host an opening lecture by Austen Barron Bailly, the museum’s chief curator, and a conversation with soccer great Mia Hamm, a two-time Olympic gold medalist.\n\nFounded by philanthropist Alice Walton, Crystal Bridges is a nonprofit charitable organization. It opened in 2011 and had nearly 785,00 annual visitors in 2023.",
  "medium": "Article",
  "links": [
    "https://myvthl6ab.cc.rs6.net/tn.jsp?f=001y6H3C4kUyw9HPhOE9cqK1yaAt-0HScX3hxK_jXrbKblOJN3nQ7bFhB5n0vL5V9ySZL1VD_49JAWf2ORjJ21Fo08BW4PXUr-7562lw1-97xSiE4wmcPzfU4Z45910_WqWbMLcubWhzUGBPgmCnMPOrnB-ubGg7HAAtSLHmQsVPPEmatO01sdF2VxReWnIxqEwzO5ZG2ctm--tRsFZEt44QwcT6Q2_PgEE&c=0AMy621uIOx0SdDifzryqN_n6YRiX1XIk-6USbXNNAEolh9a1NdzlQ==&ch=lTI4sXmmQXJR-i0RnT1GIj_ul-HTGa9KrNSb9XroT3Yew5HdgDxSRQ==",
    "https://myvthl6ab.cc.rs6.net/tn.jsp?f=001y6H3C4kUyw9HPhOE9cqK1yaAt-0HScX3hxK_jXrbKblOJN3nQ7bFhHCvGOo6GxxPTU2WqGTUxg7jvMjf3QWu2UtqpF-XmwuiX3mDvOK5zTiJ9dK31ZXwcQgN6jKHTcfVtLocQkb2CTU4tyDp_v3mtCV9gTqQ8IPI&c=0AMy621uIOx0SdDifzryqN_n6YRiX1XIk-6USbXNNAEolh9a1NdzlQ==&ch=lTI4sXmmQXJR-i0RnT1GIj_ul-HTGa9KrNSb9XroT3Yew5HdgDxSRQ==",
    "https://www.pamm.org/en/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Museum Exhibition",
      "weight": 0.099300586
    },
    {
      "name": "Crystal Bridges Museum",
      "weight": 0.087229684
    },
    {
      "name": "museum officials",
      "weight": 0.082217045
    },
    {
      "name": "other museums",
      "weight": 0.080912665
    },
    {
      "name": "museum members",
      "weight": 0.079639435
    },
    {
      "name": "museum goers",
      "weight": 0.07917785
    },
    {
      "name": "Crystal Bridges",
      "weight": 0.07419802
    },
    {
      "name": "sports fans",
      "weight": 0.0682354
    },
    {
      "name": "Modern Art",
      "weight": 0.067513555
    },
    {
      "name": "American Art",
      "weight": 0.06747914
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.84423828125
    },
    {
      "name": "/Arts & Entertainment/Visual Art & Design/Other",
      "score": 0.66357421875
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.63525390625
    },
    {
      "name": "/Arts & Entertainment/Visual Art & Design/Art Museums & Galleries",
      "score": 0.56396484375
    }
  ],
  "sentiment": {
    "positive": 0.49544954,
    "negative": 0.08509317,
    "neutral": 0.4194573
  },
  "summary": "SFMOMA, the San Francisco Museum of Modern Art, has launched an exhibition called \"Get in the Game: Sports, Art, Culture\" aimed at attracting sports fans to its museum. The exhibit will be held at the Crystal Bridges Museum of American Art in Bentonville, Arkansas, and the Pérez Art Museum Miami in Florida from March-September 2026. The exhibition, which includes over 150 sports-related pieces, aims to show how sports impacts our culture and our psyches. It was marketed as art about athletes and offers an opportunity to play on a 22-person foosball table and other artworks. The show also spawned a 169-page book by soccer legend Megan Rapinoe.",
  "shortSummary": "A SFMOMA exhibition, \"Get in the Game: Sports, Art, Culture,\" travels to Crystal Bridges Museum in Arkansas and the Pérez Art Museum in Miami.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6ed27623367549bf84ba04b6825df671",
  "places": [
    {
      "osmId": "8240824",
      "road": "Museum Way",
      "city": "Bentonville",
      "county": "Benton County",
      "state": "Arkansas",
      "postcode": "72712",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 36.3821547,
        "lon": -94.2037574492
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://myvthl6ab.cc.rs6.net/tn.jsp?f=001y6H3C4kUyw9HPhOE9cqK1yaAt-0HScX3hxK_jXrbKblOJN3nQ7bFhHCvGOo6GxxPTU2WqGTUxg7jvMjf3QWu2UtqpF-XmwuiX3mDvOK5zTiJ9dK31ZXwcQgN6jKHTcfVtLocQkb2CTU4tyDp_v3mtCV9gTqQ8IPI&c=0AMy621uIOx0SdDifzryqN_n6YRiX1XIk-6USbXNNAEolh9a1NdzlQ==&ch=lTI4sXmmQXJR-i0RnT1GIj_ul-HTGa9KrNSb9XroT3Yew5HdgDxSRQ==",
      "text": "Welcome to\nCrystal Bridges\nMuseum of American Art\nAmerican art and exhibitions. Stunning architecture.\n134 acres of Ozark nature. General admission is always free.\nDaily Programs\nSee what tours, talks, and events are happening daily.\nYayoi Kusama Flowers\nExperience\nYayoi Kusama Flowers\n- FREE\n-\n- Orchard Trail\nFrank Lloyd Wright Tours\nTour\nFrank Lloyd Wright Tours\n-\n- Frank Lloyd Wright House\nDrop-In Campus Architecture Tour: Designing for Well-Being\nTour\nDrop-In Campus Architecture Tour: Designing for Well-Being\n- FREE\n-\n- Campus Parking\nDrop-in Tour: Art Herstory\nTour\nDrop-in Tour: Art Herstory\n- FREE\n-\n- Garrison Lobby\nDrop-in Tour: Collection Highlights\nTour\nDrop-in Tour: Collection Highlights\n- FREE\n-\n- Garrison Lobby\nDrop-in Tour: Big Picture - Art, Architecture, and Nature\nTour\nDrop-in Tour: Big Picture - Art, Architecture, and Nature\n- FREE\n-\n- Garrison Lobby\nEvenings in Eleven\nFood/Drink\nEvenings in Eleven\n- $114.45\n-\n- Eleven Restaurant\nEvenings in Eleven\nFood/Drink\nEvenings in Eleven\n- $114.45\n-\n- Eleven Restaurant\nDrop-in Architecture Tour: Heartland Whole Health Institute\nTour\nDrop-in Architecture Tour: Heartland Whole Health Institute\n- FREE\n-\n- Heartland Whole Health Institute\nDrop-in Tour: Architecture - Crystal Bridges\nTour\nDrop-in Tour: Architecture - Crystal Bridges\n- FREE\n-\n- Garrison Lobby\nDrop-in Artmaking\nClass/Workshop\nDrop-in Artmaking\n- FREE\n-\n- Durand/Estes Rooms\nPlaza Concert: Los Carnales Hernandez\nMusic/Performance\nParty\nPlaza Concert: Los Carnales Hernandez\n- FREE\n-\n- Campus Parking\nSeasonal Highlights\nSummer Guide to Crystal Bridges\nPlan your perfect visit to Crystal Bridges—no matter the season!\nConnect\nDigital Experiences\nExplore the collection and discover interactive digital experiences from anywhere in the world.\nNews & Updates\nLearn more about what’s happening at your museum.\nCrystal Bridges Expansion\nCrystal Bridges Expansion\nCrystal Bridges to Host Lecture Featuring Soccer Icon Mia Hamm\nCrystal Bridges to Host Lecture Featuring Soccer Icon Mia Hamm\nCrystal Bridges and the Momentary Unveil Fall Lineup of Exhibitions and Immersive Experiences\nCrystal Bridges and the Momentary Unveil Fall Lineup of Exhibitions and Immersive Experiences\nArt for Everyone: Accessibility at Crystal Bridges"
    },
    {
      "url": "https://myvthl6ab.cc.rs6.net/tn.jsp?f=001y6H3C4kUyw9HPhOE9cqK1yaAt-0HScX3hxK_jXrbKblOJN3nQ7bFhB5n0vL5V9ySZL1VD_49JAWf2ORjJ21Fo08BW4PXUr-7562lw1-97xSiE4wmcPzfU4Z45910_WqWbMLcubWhzUGBPgmCnMPOrnB-ubGg7HAAtSLHmQsVPPEmatO01sdF2VxReWnIxqEwzO5ZG2ctm--tRsFZEt44QwcT6Q2_PgEE&c=0AMy621uIOx0SdDifzryqN_n6YRiX1XIk-6USbXNNAEolh9a1NdzlQ==&ch=lTI4sXmmQXJR-i0RnT1GIj_ul-HTGa9KrNSb9XroT3Yew5HdgDxSRQ==",
      "text": "Get in the Game: Sports, Art, Culture\nCelebrate the love of the game from the Olympics to Little League\nThe roar of the stadium. The green of the field. A held breath erupting into victory—or defeat.\nIs it any wonder that sports inspire artists? With our latest exhibition, Get in the Game: Sports, Art, Culture, experience how today’s artists and designers respond to the drive, passion, culture, and systems surrounding games—and who gets to play them.\nFrom the Olympics to the local recreation league, through Get in the Game you’ll experience how some of our most iconic images have been formed and unforgettable human stories have played out in the world of sports.\nSports icons and everyday athletes alike are celebrated in this thrilling exhibition. You’ll have the opportunity to discover the depth of swimmer Diana Nyad’s determination through an unexpected portrait angle; feel the pressure faced by tennis champion Billie Jean King through a reenactment of her legendary Battle of the Sexes match; and celebrate Arkansas-born Scottie Pippen’s legacy as an NBA superstar and cultural icon in lustrous ceramic.\nOrganized by the San Francisco Museum of Modern Art, this exhibition taps into the spirit of sports through art, design, and interactive experiences. It’s time to get in the game!\nExhibition Tickets\n$15 Adult General Admission\nFREE Members, SNAP participants*, Veterans, and Youth 18 and Under**\n* SNAP participants, please call (479) 657-2335 to enroll for free entry to temporary exhibitions.\nSelected Works from the Exhibition\nUpcoming Exhibition Events\nExplore programs and events inspired by Get in the Game.\nExhibition Opening Lecture: Get in the Game Featuring Mia Hamm\nExhibition Opening Lecture: Get in the Game Featuring Mia Hamm\n- $30 ($25/members)\n-\n- Great Hall\nMember Preview | Get in the Game: Sports, Art, Culture\n- Free for members\n-\n- Temporary Exhibition Gallery\nMember Mingle | Get in the Game: Sports, Art, Culture\n- FREE\n-\n- Eleven Restaurant\nWOW: Get in the Game\n- $105 ($95/members)\n-\n- Great Hall\nPlan Your Visit\nExhibition Sponsors\nGet in the Game: Sports, Art, Culture is organized by the San Francisco Museum of Modern Art.\nThe exhibition is curated by Jennifer Dunlop Fletcher, Helen Hilton Raiser Curator of Architecture and Design SFMOMA; Seph Rodney, independent curator and writer; and Katy Siegel, Curator-at-Large, Research & Special Program Initiatives, SFMOMA.\nThe Crystal Bridges Museum of American Art presentation is curated by Austen Bailly, Chief Curator, and Laura Pratt, Manager, Curatorial Affairs."
    }
  ],
  "argos_summary": "The exhibition \"Get in the Game: Sports, Art, Culture,\" organized by SFMOMA, is traveling to various museums after its initial showing in San Francisco. It features over 150 sports-related artworks and interactive experiences, highlighting the cultural impact of sports through the stories of athletes like Diana Nyad and Billie Jean King. The exhibition will be at the Crystal Bridges Museum in Arkansas from September 13, 2025, to January 26, 2026, and aims to engage visitors in the connections between sports, art, and contemporary culture.",
  "argos_id": "MOHBCCADR"
}