{
  "url": "https://fortune.com/2025/08/12/ceos-nvidia-and-amd-china-export-deal/",
  "authorsByline": "Diane Brady",
  "articleId": "bebe46cbaa2b40d8a34ef535da7a9c07",
  "source": {
    "domain": "fortune.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2205754389.jpg?resize=1200,600",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T09:00:24+00:00",
  "addDate": "2025-08-12T09:22:58.977612+00:00",
  "refreshDate": "2025-08-12T09:22:58.977614+00:00",
  "score": 1.0,
  "title": "What CEOs really think about Nvidia and AMD's China export deal: 'Brilliant, a tariff that we don’t have to pay'",
  "description": "Also: All the news and watercooler chat from Fortune.",
  "content": "Good morning. I called some CEOs yesterday to get their thoughts on Nvidia and AMD’s deal to give the U.S. government a 15% cut of AI chip sales to China to secure export licenses. Most were surprisingly sanguine about the unusual arrangement.\n\nCorey duBrowa, who is global CEO of communications giant Burson, described the deal as “another novel approach that’s being implemented by the Trump administration as they continue to rewrite trade norms and practices.”\n\nA veteran leader in the manufacturing space described the deal as proof of Trump’s commitment to American manufacturing, adding that the cost was likely worth it. Another U.S.-based CEO called it “brilliant, a tariff that we don’t have to pay.”\n\nBut some also raised questions:\n\nWhat does this mean for national security? Such restrictions are designed to address national security concerns, not raise revenue. Governments typically only make money when penalizing those who break the rules. Could financial incentives put security priorities on hold? Allies are historically able to buy military equipment and sensitive technologies that others are not. Could this further erode trust?\n\nHow will this impact trade deals? Many CEOs believe tariffs are here to stay, as America’s trading partners create their own walled fortresses and blocs. Allies are historically able to buy military equipment and sensitive technologies that others are not. Could this further erode trust?\n\nWhere will the money go? Export fees and tariffs mean higher costs for U.S. consumers and companies, and higher revenue for the government. Tariffs alone are expected to bring in $50 billion a month. The Nvidia/AMD deals could add another $4 billion to Treasury coffers next year. Will that be used to pay down debt, help consumers, or be spent some other way?\n\n\n\nContact CEO Daily via Diane Brady at diane.brady@fortune.com\n\nBoth countries will pause tariffs on each other in favor of a 10% levy while negotiations continue. There are signs that President Trump and President Xi Jinping will meet before the deal is signed. The previous deal lowered tariffs from their peak rate of 145% to 30%.\n\nNvidia CEO Jensen Huang had been working for months behind the scenes to create a deal that would allow his company to continue to sell H20 chips to China. The deal included a $500 billion U.S. investment promise and the notion that China would remain independent on Nvidia’s less powerful chips. And then President Trump demanded money, the WSJ reports.\n\nLast week, the president demanded the resignation of Intel CEO Lip-Bu Tan because of his history of Chinese investments. Yesterday, Trump called his meeting with the executive “a very interesting one.” “His success and rise is an amazing story,” Trump said. The company said it would work with the White House to “restore this great American company.”\n\nPresident Trump prepares to meet Putin without Europe or Ukraine\n\nThe meeting will deliver to Putin exactly what he wants—the visual that the key parties in the negotiations are Moscow and Washington not Kyiv or Brussels.\n\nReality check: There is no sign of imminent peace in Ukraine\n\nRussian battlefield maneuvers show they are preparing yet more offensives inside Ukraine. Meanwhile, Europe is building for war: Satellite photos show defense facilities have added 7 million square metres of new industrial development at 150 sites in 37 countries, the FT reports.\n\nAnalysts from investment bank Stifel warn in a new research note that a slowdown in consumer spending and fading effects of COVID-era stimulus have left the U.S. economy vulnerable to stagflation, predicting a selloff of 10% or more in the S&P 500. Despite seemingly strong account balances, underlying weakness and diminishing savings signal that the current market highs are built on a 'money illusion' that may soon dissipate.\n\nMoody’s Chief Economist Mark Zandi believes tariffs will be under intense political pressure to be cut in any recession, making them unreliable as a long-term funding source. Though President Donald Trump’s tariffs are generating revenue for the federal government at an annual rate of about $300 billion, most tariff costs are being passed on to consumers as higher prices, acting effectively as a sales tax, according to Zandi.\n\nIn other news: … Elon Musk threatened to sue Apple for not giving prominence to his Grok apps in the App Store … A federal judge declined to release grand jury transcripts from the case against Ghislaine Maxwell, the imprisoned ex-partner of Jeffrey Epstein … Trump appointed E.J. Antoni, chief economist at the Heritage Foundation, to lead the Bureau of Labor Statistics. Antoni is one of the authors of Project 2025 and a longtime critic of the BLS.\n\nS&P 500 futures were flat this morning, premarket, after the index closed down 0.25% on Friday. STOXX Europe 600 was up 0.26 in early trading. The U.K.’s FTSE 100 was up 0.27% in early trading. Japan’s Nikkei 225 was up 2.15%, hitting a new all-time high. China’s CSI 300 was up 0.52%. The South Korea KOSPI was down 0.53%. India’s Nifty 50 was up 0.17%. Bitcoin declined to $118.9K.\n\nExclusive: Fintech giant Stripe building ‘Tempo’ blockchain with crypto VC Paradigm by Ben Weiss and Leo Schwartz\n\nThe new American workplace crisis: Return-to-office mandates lead to a working mom exodus by Ashley Lutz\n\nOpenAI’s CEO Sam Altman says in 10 years’ time college graduates will be working ‘some completely new, exciting, super well-paid’ job in space by Preston Fore\n\nSoutheast Asia’s cities at ‘high risk’ of flooding and heatwaves, thanks to climate change by Lionel Lim\n\nCEO Daily is compiled and edited by Joey Abrams and Jim Edwards.",
  "medium": "Article",
  "links": [
    "https://www.wsj.com/politics/policy/trump-to-nominate-longtime-critic-to-lead-bureau-of-labor-statistics-190e7252",
    "https://fortune.com/asia/2025/08/11/southeast-asia-cities-high-risk-flooding-heatwaves-zurich-resilience/",
    "https://fortune.com/crypto/2025/08/11/stripe-blockchain-tempo-paradigm/",
    "https://fortune.com/2025/08/11/trump-foreign-countries-eat-tariffs-pass-through-consumers/",
    "https://nypost.com/2025/08/11/business/trump-changes-tune-on-intel-ceo-after-demanding-his-resignation/",
    "https://www.wsj.com/world/russia/trump-putin-meeting-russia-goals-327d4d4c",
    "https://www.ft.com/content/ce617187-43ed-4bec-aebf-b1b346c4cfb1",
    "https://fortune.com/2025/08/11/recession-trump-tariffs-cut-consumer-tax-relief-federal-revenue/",
    "https://fortune.com/2025/08/11/working-moms-leave-american-workforce-return-to-office/",
    "https://fortune.com/2025/08/11/openai-ceo-sam-altman-10-years-gen-alpha-college-graduates-working-in-solar-system-well-paid-jobs-as-gen-z-struggles-todays-job-market/",
    "https://www.wsj.com/world/china/nvidia-ceo-jensen-huang-trade-tariffs-475b5cd7",
    "https://www.cnbc.com/2025/08/12/us-china-tariff-truce-extended-as-outstanding-issues-stall-a-deal-.html",
    "https://fortune.com/2025/08/11/sp-500-correction-bubble-markets-inflation-stagflation-recession-stifel/",
    "https://www.axios.com/2025/08/11/ghislaine-maxwell-grand-jury-doj-request-denied",
    "https://www.cnbc.com/2025/08/12/ukraine-warns-the-world-not-to-trust-russia-says-new-offensives-ahead.html",
    "https://www.axios.com/2025/08/11/us-china-tariffs-pause-90-days",
    "https://www.cnbc.com/2025/08/12/musk-threatens-immediate-legal-action-against-apple-over-alleged-antitrust-violations.html"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "most tariff costs",
      "weight": 0.06462507
    },
    {
      "name": "Tariffs",
      "weight": 0.062986195
    },
    {
      "name": "tariffs",
      "weight": 0.062986195
    },
    {
      "name": "trade deals",
      "weight": 0.060694177
    },
    {
      "name": "President Trump",
      "weight": 0.060286704
    },
    {
      "name": "Nvidia CEO Jensen Huang",
      "weight": 0.057413448
    },
    {
      "name": "CEO Daily",
      "weight": 0.057054717
    },
    {
      "name": "U.S. consumers",
      "weight": 0.054672886
    },
    {
      "name": "Trump",
      "weight": 0.054145157
    },
    {
      "name": "Donald Trump",
      "weight": 0.054118786
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    },
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9677734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.94384765625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.94384765625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.53759765625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.4697265625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.4345703125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.322021484375
    }
  ],
  "sentiment": {
    "positive": 0.16430846,
    "negative": 0.41539747,
    "neutral": 0.42029402
  },
  "summary": "CEOs from Nvidia and AMD have expressed their opinions on Nvidia andAMD's deal to give the US government a 15% cut of AI chip sales to China to secure export licenses. While some CEOs were generally positive about the unusual arrangement, others questioned the implications of national security restrictions designed to address national security concerns, not raise revenue. The deal includes a $500 billion U.S. investment promise and the notion that China would remain independent on Nvidia’s less powerful chips. Both countries will suspend tariffs on each other in favor of a 10% levy while negotiations continue. The deals could add another $4 billion to Treasury coffers next year and potentially generate revenue for consumers and companies. However, questions about the impact on national security, including whether this could further erode trust in allies who are historically able to buy military equipment and sensitive technologies that others are not.",
  "shortSummary": "Nvidia and AMD's deal to cut tariffs on AI chip sales to secure export licenses for the US government raises significant questions about trade rules and revenue sustainability.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "bd655ed874c6429ebe7a7e66515d9bc7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://fortune.com/crypto/2025/08/11/stripe-blockchain-tempo-paradigm/",
      "text": "The fintech giant Stripe is developing a new blockchain, according to a recent job posting on a site for the crypto lobby group Blockchain Association. “Tempo is a high-performance, payments-focused blockchain,” reads the job advertisement, which is for a product marketing position and dated Aug. 3.\nThe posting goes on to say that Tempo is in stealth, has a team of five, and is being built in partnership with Paradigm—a crypto venture capital firm whose cofounder and managing partner, Matt Huang, is on the board of Stripe. Applicants for the marketing position should have “experience marketing to a Fortune 500 audience,” per the ad.\nThe blockchain is a layer 1, or not built on top of other protocols, and it’s compatible with the coding language used on the blockchain Ethereum, according to four sources briefed on the matter. All sources requested anonymity to talk about private business conversations.\nSpokespeople for Stripe and Paradigm declined to comment. The job posting was taken down after Fortune reached out to both companies.\nTempo is the latest bet on crypto from Stripe, which has grown to an almost $92 billion valuation on the back of payment products like easy online checkout and automated invoicing for businesses.\nIn October, Stripe announced it was paying $1.1 billion for the stablecoin infrastructure firm Bridge, its largest acquisition to date. And in June, the payments titan said it bought the crypto wallet developer Privy. (It didn’t disclose the price.)\nStripe’s crypto shopping spree comes amid a rush of interest in stablecoins, or cryptocurrencies pegged to underlying assets like the U.S. dollar. Boosters say the crypto assets are a more effective payment technology than legacy financial infrastructure like SWIFT or wires. They also argue that the technology can reduce cross-border payment costs as well as cut down on transaction fees, among other benefits.\nAlthough stablecoins have existed for more than a decade, broader interest in the technology has picked up steam over the past year, especially after President Donald Trump signed the GENIUS Act into law in July. The bill outlines federal regulatory guidance and rules for the burgeoning sector of crypto.\nStablecoins have become such a buzzy subject in the world of payments that even Big Tech giants like Meta, Apple, and Airbnb are exploring stablecoin integrations—but Stripe is leading the charge. “We are now seeing meaningful business interest in stablecoins as the underlying technology has matured,” Patrick Collison, cofounder and CEO of Stripe, said in testimony to the House in March.\nStripe’s acquisition of Bridge gives the fintech ownership of a platform that helps companies integrate stablecoins into their payment flows and issue their own. And its purchase of Privy gives it the ability to build out crypto wallets for customers to help them manage their holdings. A new blockchain would allow it to control another layer in the stablecoin tech stack—the servers that process stablecoin transactions.\nStripe hasn’t publicly stated its reasons for building a blockchain. It also hasn’t said it intends to issue a cryptocurrency to support it—a common move for founders of a new crypto protocol.\nUpdate, Aug. 11, 2025: This article has been updated to note that the job posting has since been taken down after Fortune reached out to Stripe and Paradigm for comment."
    },
    {
      "url": "https://fortune.com/2025/08/11/openai-ceo-sam-altman-10-years-gen-alpha-college-graduates-working-in-solar-system-well-paid-jobs-as-gen-z-struggles-todays-job-market/",
      "text": "- With Gen Z facing existential career crises, billionaire OpenAI CEO Sam Altman says that in just 10 years, college grads will be exploring the solar system—jobs that will reel in sky-high salaries. The tech leader even says he’s envious of young people because our early-career jobs will look “boring” by comparison.\nAs AI reshapes the workforce, many Gen Z college graduates are finding out the hard way that their degrees don’t guarantee a smooth career launch.\nNow, even OpenAI CEO Sam Altman—one of Silicon Valley’s biggest leaders driving the AI revolution—is admitting the elephant in the room is true: AI will wipe out some jobs entirely. However, the tech billionaire insists the coming decade could be the most exciting time in history to start a career, especially for anyone who’s ever dreamed of working in space.\nNot only will they be reeling in sky-high salaries, but Altman says they’ll also be “feeling so bad for you and I that we had to do this really boring, old work and everything is just better.”\n“In 2035, that graduating college student, if they still go to college at all, could very well be leaving on a mission to explore the solar system on a spaceship in some completely new, exciting, super well-paid, super interesting job,” Altman said to video journalist Cleo Abram last week.\nThough it’s unclear how widespread space exploration will expand in the coming years—considering NASA’s broad goal of getting to Mars in the 2030s—aerospace engineers are growing faster than the national average of all jobs, according to data from the U.S. Bureau of Labor Statistics. And they bring home an envy-inducing annual paycheck of over $130,000.\nHow AI will reshape the workplace\nOther tech pioneers have AI predictions that are more grounded on Earth—but still alluring to workers. For example, billionaire Microsoft cofounder Bill Gates said earlier this year that the technology might dramatically reduce the length of the workweek, thanks to humans no longer being needed “for most things.”\n“What will jobs be like? Should we just work like two or three days a week?” the tech billionaire told Jimmy Fallon on The Tonight Show earlier this year.\nNvidia CEO Jensen Huang echoed that AI has already given his workers “superhuman” skills—something that will only increase as the technology advances.\n“I’m surrounded by superhuman people and super intelligence, from my perspective, because they’re the best in the world at what they do. And they do what they do way better than I can do it. And I’m surrounded by thousands of them. Yet it never one day caused me to think, all of a sudden, I’m no longer necessary,” he separately told Cleo Abram on her Huge Conversations podcast series.\nWhile Altman admitted that his crystal ball remains foggy—and that the true direction of AI is unclear—he is actually envious of Gen Z professionals starting off their careers: “If I were 22 right now and graduating college, I would feel like the luckiest kid in all of history,” he added to Abram.\nFortune reached out to OpenAI for comment.\nAI will make one-person, billion-dollar companies\nAfter last week’s launch of the latest OpenAI model, GPT-5, Altman declared that the world has access to technology equivalent to a “team of PhD-level experts” right in their pocket. And as a result, the CEO said it will be easier than ever for one person to create a business that used to take “hundreds” of people—all it takes is coming up with a great idea and mastering AI tools.\n“It is probably possible now to start a company, that is a one-person company that will go on to be worth more than a billion dollars, and more importantly than that, deliver an amazing product and service to the world, and that is like a crazy thing,” he said.\nBillionaire Mark Cuban has gone even further with his prediction, saying that AI could give Elon Musk a run for his money as the world’s richest person.\n“We haven’t seen the best or the craziest of what [AI is] going to be able to do,” Cuban told the High Performance podcast earlier this summer. “And not only do I think it’ll create a trillionaire, but it could be just one dude in the basement. That’s how crazy it could be.”"
    },
    {
      "url": "https://www.cnbc.com/2025/08/12/ukraine-warns-the-world-not-to-trust-russia-says-new-offensives-ahead.html",
      "text": "Sidelined from forthcoming talks between Russian President Vladimir Putin and U.S. President Donald Trump to negotiate an end to the war, Ukraine has warned the world that Moscow is not to be trusted and is planning new offensives.\nUkraine's President Volodymyr Zelenskyy said intelligence and military officials had briefed him on Monday \"on what Putin is counting on and what he is actually preparing for,\" saying \"this includes military preparations.\"\n\"He is certainly not preparing to cease fire or end the war,\" Zelenskyy said in his nightly address.\n\"There is not a single sign that the Russians have been told to prepare for a post-war situation – not yet. On the contrary, they are moving their troops and forces in ways that indicate they plan to launch new offensive operations. No one preparing for peace acts this way,\" he added.\n\"Putin's sole aim is to present a meeting with America as his personal victory and then continue acting as before, putting pressure on Ukraine as before,\" the president warned. CNBC has contacted the Kremlin for a response to Zelenskyy's claims and is awaiting a response.\nThe problem for Ukraine is whether anyone is listening.\nNeither Zelenskyy nor European officials are invited to the Trump-Putin talks in Alaska on Friday, much to their consternation.\nUkraine has vehemently stated that no deal about its future can be struck in its absence, amid fears that it could be forced to cede Russian-occupied territory to Moscow as part of a peace deal. European leaders, meanwhile, are pushing strongly for Ukraine's involvement in the talks. The U.S., for its part, has said it is considering inviting Zelenskyy, NBC News reported.\nGerman Chancellor Friedrich Merz invited Trump to join Zelenskyy and European leaders when they hold an emergency call on Tuesday afternoon in anticipation of Friday's talks. The virtual summit will reportedly focus on ways to pressure Russia, the fate of Ukrainian territories seized by Russia and possible security guarantees for Kyiv.\nKaja Kallas, the European Union's foreign policy chief, told CNBC Tuesday that Putin was \"just pretending to negotiate\" and was trying to circumvent Trump's threat of further sanctions if a ceasefire is not agreed.\n\"In order to have any deal implemented, you need Europe and you need Ukraine. So it is clear that Putin is just pretending to negotiate. Otherwise it would have Ukraine around that table. He just wants to postpone the sanctions, and that's why he's playing this game,\" Kallas told CNBC's \"Squawk Box Europe.\"\nClaiming that Putin \"just wants to have a picture with President Trump,\" Kallas said Russia had shown little appetite for peace.\n\"It is clear that Putin just wants some concessions, and they haven't done any concessions on their side before [talking about ceding] territories, we should talk about ceasefire ... Ukraine agreed to an unconditional ceasefire already five months ago, and since then, Putin and the Kremlin have just been playing games. So we should really put the pressure on Russia,\" she said.\n'Feel-out' meeting\nTrump suggested on Monday that there could \"some swapping\" of territory as part of a peace deal though he insisted the U.S. \"would try to get some of that territory back for Ukraine.\"\n\"There'll be some swapping, there'll be some changes in land,\" Trump told reporters at the White House, although he downplayed any expectations of what could come of the talks, describing them as a \"feel-out meeting.\"\n\"We're going to see what he has in mind and if it's a fair deal, I'll reveal it to the European Union leaders and to NATO leaders and also to President Zelensky,\" Trump said.\nGeopolitical analysts agree that the talks are unlikely to yield a comprehensive and long-lasting solution to the more-than-three year conflict between Russia and Ukraine, given the complexity of the war, its underlying causes and the number of stakeholders involved.\nInstead, the talks \"should be seen as the Trump administration's attempt to assess whether there is space for a mutually acceptable compromise — at least on select issues,\" Andrius Tursa, Central and Eastern Europe advisor at risk consultancy Teneo, said in emailed comments Monday.\n\"Even in a best-case scenario, any high-level agreement would require multiple rounds of difficult follow-up talks to resolve implementation issues. This would be another option for Moscow to draw out the talks, hoping to capitalize on its gradually increasing advantage on the frontlines,\" he noted.\nRead more\nThe Kremlin may seek to exploit growing exhaustion in Ukraine by proposing a temporary or partial de-escalation in the war, Tursa said.\n\"Such a move would offer the Trump administration a symbolic diplomatic success while placing pressure on Kyiv to make substantial concessions. Should Ukraine fail to respond in a way deemed acceptable by Moscow, the Kremlin would likely portray Kyiv as the main obstacle to peace and count on Washington to increase pressure on Zelenskyy.\"\nTursa said this latter scenario underscores the risks inherent in any potential Trump-Putin agreement that's reached without the direct involvement of Ukraine and its European allies.\n\"Despite Ukraine's reliance on U.S. support, neither Zelensky nor Ukraine's parliament could be expected to endorse an agreement perceived as unfavorable and lacking public backing. Zelensky's administration has already publicly rejected the idea of territorial concessions floated ahead of the summit, clearly signaling Kyiv's red lines.\""
    },
    {
      "url": "https://fortune.com/2025/08/11/working-moms-leave-american-workforce-return-to-office/",
      "text": "The historic surge in employment among working mothers seen during the pandemic has reversed sharply in 2025, as new data reveal tens of thousands of American women, especially those with young children, leaving the workforce. According to federal labor statistics analyzed by the Washington Post, the labor force participation rate for women ages 25 to 44 with children under 5 fell nearly three percentage points between January and June 2025, reaching its lowest level in over three years.\nWorkforce trends and gender gaps\nFortune’s analysis integrates these workforce shifts with a broader view of corporate America’s changing priorities. Our coverage finds:\n- While flexible and remote work previously enabled women—particularly mothers—to remain employed, return-to-office requirements have pushed many out, with CEOs openly acknowledging greater losses of female talent.\n- Surveys show that women who work from home report less feedback and mentorship than their in-office peers, raising new barriers to career advancement.\n- Mothers working remotely often face the “motherhood penalty”—less pay, fewer raises, and limited promotion prospects—while those forced back in person are sometimes left with only the option to quit.\n- Despite a recent record in female workforce participation, the disappearance of flexibility risks lasting damage to women’s financial independence and retirement readiness.\nWomen flee the workforce\n- Labor force participation of mothers with young children dropped from 69.7% to 66.9% between January and June 2025.\n- 212,000 women age 20 and older have left the workforce since January—compared with 44,000 men who joined it.\n- Full-time office requirements among Fortune 500 firms rose to 24% in 2Q25, up from 13% at the end of 2024.\nFlexibility vanishes; mothers exit\nThis pullback follows the widespread rollback of remote and flexible work policies that initially ushered many mothers back to the job market. Major corporations and the federal government have now instituted strict return-to-office mandates, requiring five-days-a-week in-person attendance. For many mothers, the loss of flexibility means a logistical and financial reckoning. JPMorgan Chase, AT&T, and Amazon, among others, ramped up their in-office requirements in 2025, with Fortune reporting that the share of Fortune 500 companies with full-time mandates nearly doubled since late 2024.\nEmployers report difficulty replacing departed female talent, with overall productivity suffering as a result.\nChildcare costs and cultural shifts bring complications\nCompounding these changes are rising childcare costs, closures of childcare centers due to lapsing federal aid, and a noticeable trend toward traditional gender roles. Social media movements like #tradwife encourage women to prioritize home and children, amplified by calls from political leaders for more parents to stay home.\nFor many families facing unaffordable childcare, the decision is an economic necessity rather than a cultural choice. Black women and those with college degrees have been hit especially hard. The unemployment rate for Black women climbed to its highest in nearly four years; federal layoffs and the dismantling of diversity initiatives eliminated stable jobs that disproportionately supported minority women.\nWhy it matters\nExperts interviewed by both the Washington Post and Fortune warn that these trends, if left unchecked, will have “huge implications” for women’s lifetime earnings, career prospects, and retirement security. With breaks in employment history, women frequently return to lower-paying jobs and face diminished opportunities for advancement.\nStudies, including a 2024 University of Pittsburgh analysis, similarly show that aggressive return-to-office mandates have led to a loss of senior employees—many of them women—threatening productivity and competitiveness.\nFor this story, Fortune used generative AI to help with an initial draft. An editor verified the accuracy of the information before publishing."
    },
    {
      "url": "https://www.cnbc.com/2025/08/12/musk-threatens-immediate-legal-action-against-apple-over-alleged-antitrust-violations.html",
      "text": "Elon Musk on Monday threatened Apple with legal action over alleged antitrust violations related to rankings of the Grok AI chatbot app, which is owned by his artificial intelligence startup xAI.\n\"Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation. xAI will take immediate legal action,\" Musk wrote in a post on his social media platform X.\nApple did not immediately respond to CNBC's request for comment.\n\"Why do you refuse to put either X or Grok in your 'Must Have' section when X is the #1 news app in the world and Grok is #5 among all apps? Are you playing politics?\" Musk said in another post.\nApple last year tied up with OpenAI to integrate ChatGPT into its iPhone, iPad, Mac laptop and desktop products. Musk at that time had said that \"If Apple integrates OpenAI at the OS level, then Apple devices will be banned at my companies. That is an unacceptable security violation.\"\nPrior to his legal threats against Apple, Musk had celebrated Grok surpassing Google as the fifth top free app on the App Store. When contacted by CNBC, xAI did not immediately respond to a request for further information on a potential lawsuit.\nCNBC confirmed that ChatGPT was ranked No. 1 in the top free apps section of the American iOS store, and was the only AI chatbot in Apple's \"Must-Have Apps\" section. The App Store also featured a link to download OpenAI's new flagship AI model, ChatGPT-5 at the top of its \"Apps\" section.\nOpenAI on Thursday announced GPT-5, its latest and most advanced large-scale AI model, following xAI's release of its newest chatbot, Grok 4, last month.\nMusk has an ongoing feud with ChatGPT maker OpenAI, which he co-founded in 2015. The billionaire stepped down from its board in 2018, four years after saying that AI was \"potentially more dangerous than nukes.\"\nHe is now suing the Microsoft-backed startup, and its CEO Sam Altman, alleging they abandoned OpenAI's founding mission to develop artificial intelligence \"for the benefit of humanity broadly.\"\nRobert Keele, who headed the legal department at xAI, announced last week that he had left the company to spend more time with his family. In his announcement, Keele also acknowledged \"daylight between our worldviews\" with Musk.\nIn response to Musk's antitrust threats against Apple, OpenAI CEO Sam Altman said in an X post: \"This is a remarkable claim given what I have heard alleged that Elon does to manipulate X to benefit himself and his own companies and harm his competitors and people he doesn't like.\"\nThis is not the first time Apple has been challenged on antitrust grounds. In a landmark case, the Department of Justice last year sued the company over charges of running an iPhone ecosystem monopoly.\nIn June, a panel of judges also denied an emergency application from Apple to halt the changes to its App Store resulting from a ruling that the company could no longer charge a commission on payment links inside its apps, nor tell developers how the links should look.\n— CNBC's Kif Leswing and Lora Kolodny contributed to this story."
    },
    {
      "url": "https://fortune.com/2025/08/11/trump-foreign-countries-eat-tariffs-pass-through-consumers/",
      "text": "- Goldman Sachs estimates U.S. consumers now shoulder two-thirds of President Trump’s new tariff costs, with more companies planning to pass them on in the future and foreign exporters refusing to “eat” the price hikes. The bank expects the measures to lift core PCE inflation (personal consumption expenditures) to 3.2% by year-end, adding pressure to the Fed’s 2% target.\nWhen President Trump announced his tariff agenda, he said it would be foreign companies and consumers that would “eat” the price hikes. That’s a take that may be proved optimistic at best and misguided at worst.\nWhile tariffs have yet to significantly shift the dial on inflation—prompting individuals like Treasury Secretary Scott Bessent to label them the “dog that didn’t bark”—analysts are widely expecting the hikes to ultimately be paid for by the U.S.\nSo far the sharpest end of the tariff regime has yet to be felt. President Trump delayed his “Liberation Day” tariffs by three months in order to reach agreements with trading partners.\nSome negotiations have proved successful, with framework deals done with the U.K., the EU, and Japan to name a few, drastically lowering tariff rates from Trump’s initial threats back in April. Yet countries that haven’t yet agreed to a deal (which received letters informing them of their new tariff rate) saw their effective export rate rise on the deadline of Aug. 7.\nThat includes nations like India, which is facing a rate of 25% that may double on Aug. 27 as punishment for buying Russian oil. Likewise, while the Trump administration on many occasions has touted a deal nearly done with China, nothing beyond an agreement to delay tit-for-tat price increases until this week has been confirmed.\nWith a slew of tariffs now effectively in place, Goldman Sachs believes that the cost absorbed by foreign exporters will grow over time, but will remain low.\nEconomist Elsie Peng wrote in a note yesterday seen by Fortune that Goldman believes exporters absorbed 14% of the costs of all tariffs in June, which will rise to 25% by October if the sanctions follow a similar trajectory to the price hikes administered by the Trump administration in his first term.\nBut the portion consumers can expect to pay is also on the rise. Peng noted that around 36% of the 2025 tariff costs were passed on to consumer prices after three months of implementation and around 67% were passed on after four months.\nThe economist added that “although the pass-through rate appears to be increasing rapidly over time, it still remains somewhat below the pass-through rate that we estimate at the same point in time during the 2018–2019 trade war.”\nOne portion of the economy that intends to reduce its share is U.S. businesses. The Conference Board released its U.S. CEO Confidence report for the third quarter last week, which revealed 64% are certain they would be passing the price hike on to consumers, and a further 16% said they’re still considering.\nThis is a higher rate than previously identified (following the prediction of Goldman Sachs) as only in June the New York Fed reported a smaller 45% of services firms were intending to pass on the full extent of their tariff-related increases.\nPeng noted that her math “implies that U.S. businesses have absorbed more than half of the tariff costs so far but that their share would fall to less than 10%. This net impact on U.S. businesses likely masks that some companies have absorbed a larger share of tariff costs, while some domestic producers shielded from import competition have raised their own prices and benefited.”\nInflation pass-through\nOf course, if consumers are paying higher prices for goods and services then the Federal Reserve’s job of keeping inflation to 2% will only get more difficult.\nGoldman Sachs believes this will be the case, writing, “Our analysis implies that tariff effects have boosted the core PCE price level by 0.20% so far.\n“We expect another 0.16% impact in July, followed by an additional 0.5% from August through December. This would leave core PCE inflation at 3.2% year over year in December, assuming that the underlying inflation trend net of tariff effects is 2.4%.”\nReflecting on the June consumer price index report (the latest available at the time of writing), Macquarie’s North America economists David Doyle and Chinara Azizova commented that the data was already showing hints of pass-through inflation.\nThey wrote last month: “Notable price pressures were apparent in household furnishings and supplies, apparel, video and audio products, sporting goods, and toys. This list suggests impacts from tariffs on the data. One measure that reflects this is core goods ex used cars and trucks. This accelerated to +0.3% MoM, its strongest pace since Feb-23. It also shows an accelerating monthly trend.”\nMany economists are hoping Fed Chairman Jerome Powell will see through this inflation and lower the base rate, in part to offset an alarming jobs report from the Bureau of Labor Statistics a matter of weeks ago. But analysts can’t hold their breath. After all, Powell made the point at his last press conference that by not raising rates (a move which truly would have upset markets) he is already seeing through such pressures."
    },
    {
      "url": "https://nypost.com/2025/08/11/business/trump-changes-tune-on-intel-ceo-after-demanding-his-resignation/",
      "text": "Trump changes tune on Intel CEO after demanding his resignation: ‘Meeting was a very interesting one’\nPresident Trump said he met with Intel CEO Lip-Bu Tan on Monday, days after seeking his resignation, praising Tan and calling the meeting “a very interesting one.”\nShares of the chipmaker rose 3% in extended trading.\nLast week, Trump had demanded the immediate resignation of Tan, calling him “highly conflicted” over his ties to Chinese firms, injecting uncertainty into the chipmaker’s years-long turnaround effort.\nTrump said he met with Tan, along with Commerce Secretary Howard Lutnick and Treasury Secretary Scott Bessent. His cabinet members and Tan were going to bring suggestions to him next week, Trump said in a post on Truth Social.\n“His success and rise is an amazing story,” Trump said about Tan.\nTan had invested in hundreds of Chinese firms, some of which were linked to the Chinese military, Reuters reported exclusively in April. It is not illegal for U.S. citizens to hold stakes in Chinese companies unless they have been added to the U.S. Treasury’s Chinese Military-Industrial Complex Companies List, which explicitly bans such investments.\nTan has been tasked to undo years of missteps that left Intel struggling to make inroads in the booming AI chip industry dominated by Nvidia, while investment-heavy contract manufacturing ambitions led to heavy losses.\nIn the roughly six months as Intel CEO, Tan made major strategic shifts that included divesting assets, laying off employees and redirecting resources.\nBut the demand for Tan’s resignation will only distract him from that task, investors and a former senior employee have told Reuters.\nTan is now making an effort to reassure Trump that he remains the right person to revive the storied American chipmaker.\nTan met with Trump for a candid and constructive discussion on the company’s commitment to strengthening US technology and manufacturing leadership, Intel said in a statement. The company said it would work closely with the administration to “restore this great American company.”\nTrump’s intervention marked a rare instance of a president publicly calling for a CEO’s ouster and raised questions about his control over corporate affairs.\nThis was also evident in an agreement calling for Nvidia and AMD to give the US government 15% of revenue from China sales."
    },
    {
      "url": "https://fortune.com/asia/2025/08/11/southeast-asia-cities-high-risk-flooding-heatwaves-zurich-resilience/",
      "text": "In recent weeks, there have been viral images from the Philippines show couples exchanging wedding vows in flooded churches after Tropical Storm Wipha made landfall in late-July. The storm swept through southern China and central Vietnam, with heavy rain causing flooding in both locations.\nVietnam and the Philippines are used to periods of intense rain, but climate change threatens to make these events more severe. Southeast Asia as a whole faces an escalating climate risk, due its densely populated cities, frequent heavy rain, and insufficient infrastructure.\nRecent modelling from Zurich Resilience Solutions found that six major cities in Southeast Asia—Singapore, Bangkok, Ho Chi Minh City, Jakarta, Kuala Lumpur, and Manila—all face at least a “high risk” of extreme precipitation, heatwaves, and rising sea levels through the 2040s.\nIn particular, the modelling noted that Manila, Bangkok, Singapore, and Jakarta are among Southeast Asia’s most climate-vulnerable cities, with critical infrastructure facing high exposure to multiple climate hazards.\nZurich’s risk modelling used data points from seaports, airports, and notable cultural sites, like Bangkok’s Grand Palace and Manila’s Fort Santiago. The analysis was conducted under the SSP2-4.5 scenario, a widely used projection developed Intergovernmental Panel on Climate Change. The “middle-of-the-road” pathway assumes moderate global mitigation efforts and anticipates a two degree Celsius increase in global average temperatures between 2041 and 2060.\n“In Manila, sites are at severe risk from extreme precipitation, storm surge, sea level rise, and flooding, threatening trade and cultural preservation,” the report’s authors wrote. Both Bangkok and Jakarta are also threatened by worse flooding from climate change.\nZurich notes that governments are already investing to address some of these risks. For example, its report highlighted that Singapore added another 5 billion Singapore dollars ($3.9 billion) to its coastal and flood protection fund this year to support new infrastructure like detention tanks, widened canals, and elevated platform levels. Ho Chi Minh City is also upgrading its drainage systems and expanding green urban spaces to curb local flooding.\nNot investing in mitigation could result in severe financial losses. A recent report from the World Economic Forum and Singapore International Foundation estimates that the impact of climate change could reduce Southeast Asia’s GDP by up to 25% by 2050.\nAnother study from Oxford Economics estimates that a 1% increase in average temperatures could raise food prices across Vietnam, Thailand, Malaysia, Indonesia and the Philippines.\nBusinesses in the region are also taking notice of how climate change’s financial cost could hit their own operations.\nCity Developments Limited (CDL), No. 139 on the Southeast Asia 500, estimated in 2023 that climate inaction could cost 120 million Singapore dollars ($93.2 million) by 2030, equal to almost 4% of its 2024 revenue. CDL is working on another climate scenario study to be published later this year."
    },
    {
      "url": "https://fortune.com/2025/08/11/sp-500-correction-bubble-markets-inflation-stagflation-recession-stifel/",
      "text": "A question looms over Wall Street as it digests the stock market highs in the dog days of summer 2025: Is this another version of the dotcom bubble? Apollo’s Torsten Slok has already calculated that the top 10 S&P 500 companies today are more overvalued than in the late ’90s tech boom. Now the investment bank Stifel is predicting that even as “euphoric markets party like it’s 1999,” a stock market correction and stagflation are ahead.\nStifel’s strategists, led by Barry Bannister and Thomas Carroll, wrote in a research note that they are simply “uncomfortable” with the S&P 500 gaining 32% off its April 7 intraday low as the latest GDP figures show the actual economy slowing almost to a crawl. They further warn that “hopium” is a powerful drug and that stock markets may be “whistling past the graveyard.”\nSimply put, Bannister and Carroll say consumers are not as rich as their account balances show, following the “money illusion” of COVID-era fiscal stimulus that they described as a “World War–level” effort.\nWith the mighty American consumer running out of breath amid an economic slowdown in the second half of 2025, Stifel sees a decline of 10% or more in the S&P 500.\nReal economic pain is brewing\nAccording to Stifel, the apparent health of the U.S. consumer belies an underlying slowdown, with personal consumption—responsible for 68% of GDP—showing effectively 0% growth year to date. Their research highlights several red flags.\nThey note that growth in real wage income, the main driver of personal consumption, has slowed to an annual rate of just 1% as stagflation hits.\nIn addition, monetary and fiscal policies are in a “tug-of-war” that counteract each other, resulting in a minimal boost to consumer spending.\nAnd unlike in 2022–23, there is significantly less consumer savings to support consumption.\nAbout that money illusion: Stifel’s data shows that from September 2019 to March 2022, household cash balances increased 44%, while consumer spending doubled against the historic median. Bannister and Carroll argue that the illusion kept spending afloat and helped drive asset prices upward, but it’s now fading after the “helicopter dump” of cash in the early 2020s.\nThe tell here, they say, is that savings rates have come back into balance with equity net worth, after a period when excess money moved first through consumption, then assets. Put another way, America is essentially cash-poor.\nWhat’s more, Stifel’s calculation shows that the personal savings rate has fallen dramatically since COVID, so Americans have binged on spending and now have less cash on hand than in the years before the pandemic.\nThe analysts warn that this shows the artificial boost has waned and there is no apparent new source of household spending power, amid persistent fiscal deficits and tariffs.\nBank of America Research has likewise cited tariffs as it maintained its call for stagflation instead of recession.\nCorrection coming?\nThe Federal Reserve has been left in a “too late” posture from stagflation, as the rate cuts that Trump keeps calling for can’t save an “overvalued” S&P 500, with inflation proving sticky and supply constrained in the economy.\nWhile the capex boom around AI temporarily supports GDP and asset prices, Stifel forecasts this bump will fade as corporate tech spending plateaus. Such a build-out, after all, occurs only once, while consumer spending power is entering a lull that could expose markets to abrupt correction, they write.\nValuations have ballooned. Stifel notes the S&P 500 hit 6,375 and the Nasdaq 100 reached 23,587 earlier this month. Yet history shows that momentum can turn on a dime. “Valuation doesn’t matter until it does,” the analysts warn, citing the Great Depression of 1929, the dotcom boom of 1999, and the post-COVID atmosphere of 2021. They forecast a more than 10% selloff beckoning for the S&P 500.\nAn explanation for a ‘weird’ feeling?\nStifel’s bearish prediction, echoing Bank of America, may offer an explanation for a “weird” feeling permeating the economy. Nick Maggiulli, COO of Ritholtz Wealth Management and author of the New York Times bestseller The Wealth Ladder, previously spoke to Fortune about the odd state of the economy in 2025 and concluded that “something weird’s going on.”\nMaggiulli, whose book focuses on what his research indicates about the emerging six economic classes of the U.S., said “the economy wasn’t built to handle this many people with this much money.” He cited data showing that the upper middle class, with household net worths between $1 million and $10 million, have ballooned from just 7% of the country in 1989 to 18% as of 2022–23, with much of this run-up in wealth occurring since the pandemic.\nUBS Global Wealth Management has similarly documented a dramatic rise in the “everyday millionaire,” with a fourfold increase on a global basis since the start of the 21st century. Even after adjusting for inflation, their number has more than doubled in real terms since 2000. “There’s a good portion of [everyday millionaires] that feel like they don’t have enough,” Maggiulli told Fortune, “and they feel like they’re just getting by, even though statistically they’re in the top 20% of U.S. households.”"
    },
    {
      "url": "https://fortune.com/2025/08/11/recession-trump-tariffs-cut-consumer-tax-relief-federal-revenue/",
      "text": "- President Donald Trump’s tariffs are generating revenue for the federal government at an annual rate of about $300 billion. While that sounds like a promising source of funding, tariffs went into effect with the stroke of a pen, and they can go away with one, too. And in the next recession, there will be calls for tariff relief to help consumers, Moody’s Analytics chief economist Mark Zandi said.\nThe federal government is on pace to reap a significant amount of revenue from President Donald Trump’s tariffs, but they may not be a reliable source of funding, especially in a recession, according to Moody’s Analytics chief economist Mark Zandi.\nThe average effective tariff rate is now 20.2%, the highest since 1911, according to Yale’s Budget Lab. Based on the revenue tariffs are generating so far, they should bring in about $300 billion annually.\nThough that’s not nearly enough to eliminate the federal budget deficit, which is expected to widen to almost $2 trillion this year, it’s still a meaningful amount. So why not rely on them as a long-term revenue source?\nOn last Wednesday’s episode of the Facing the Future podcast from the Concord Coalition, a nonpartisan group focused on reducing the national debt, Moody’s Analytics chief economist Mark Zandi pointed out tariffs were imposed via executive order and can be changed in an instant.\nIn addition, the so-called reciprocal tariffs are facing court challenges on the argument they’re not covered under the International Emergency Economic Powers Act.\nAs a result, Zandi cautioned against making other tax and spending decisions based on the assumption those tariffs will remain in place. And if the economy goes south, then all bets are off.\n“I suspect that the next time the economy gets into recession—and it will, maybe not this go around, but at some point it will—whoever’s president is going to be under significant pressure to cut those tariffs because they can do it under executive order. They don’t need to go to Congress to get a piece of legislation,” he added.\nA downturn may even come sooner rather than later. Earlier this month, Zandi warned the economy is on the brink of a recession.\nOn Sunday, he followed that up, saying while the U.S. isn’t in a recession now, more than half of the roughly 400 industries tracked in government data are already shedding workers, a phenomenon that’s accompanied previous downturns.\nMeanwhile, most of the cost of tariffs is being passed on to consumers, meaning those import taxes are effectively sales taxes. Goldman Sachs calculated that around 67% of the tariff costs are being passed on to consumers.\n“There’s going to be a strong incentive on that president’s part to say, ‘Okay, I’m going to cut the taxes,’” Zandi told the Concord Coalition’s Carolyn Bourdeaux and Robert Bixby.\nWhile Trump has floated the idea of using tariff revenue to provide some kind of dividend or rebate to Americans, the White House insists consumers are not shouldering tariff costs and that foreign exporters are.\nEither way, Zandi said he thinks it’s highly unlikely that tariffs will generate $300 billion a year over the next decade and warned against counting on a windfall like that.\n“In fact, if you did do that, we’re setting ourselves up for an even more dire, darker fiscal situation down the road, because I just don’t think those tariffs are going to be around 10 years from now,” he added."
    }
  ],
  "argos_summary": "CEOs have mixed reactions to Nvidia and AMD's deal to give the U.S. government a 15% cut of AI chip sales to China for export licenses, with some viewing it as a strategic move while others express concerns about national security and trade implications. The ongoing tariff situation under President Trump is generating significant revenue for the government, but experts warn that reliance on this income may be risky, especially during a potential recession. Meanwhile, the economic landscape shows signs of vulnerability, with predictions of a market correction and stagflation as consumer spending slows and inflation pressures mount.",
  "argos_id": "MPNBHT9LI"
}