{
  "url": "https://finance.yahoo.com/news/5-revealing-analyst-questions-msa-072651441.html",
  "authorsByline": "Max Juang",
  "articleId": "4f9ba430a2cd428199b59b18bdce0a66",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/h6VoBfp9PYnZAVIUIlkBcg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/b34ec32ebecee7a0b3074bc38420373f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:26:51+00:00",
  "addDate": "2025-08-12T07:34:31.807565+00:00",
  "refreshDate": "2025-08-12T07:34:31.807568+00:00",
  "score": 1.0,
  "title": "5 Revealing Analyst Questions From MSA Safety’s Q2 Earnings Call",
  "description": "MSA Safety’s first quarter results were met with a positive market response, driven by continued strength in its Detection segment and resilient demand across product categories. Management credited the quarter’s outperformance to higher Detection sales and customer shipment acceleration ahead of anticipated tariffs. CEO Steven Blanco cited “excellent growth in Detection” and emphasized the company’s ability to navigate a dynamic operating environment. Gross margins faced pressure from foreign c",
  "content": "MSA Safety’s first quarter results were met with a positive market response, driven by continued strength in its Detection segment and resilient demand across product categories. Management credited the quarter’s outperformance to higher Detection sales and customer shipment acceleration ahead of anticipated tariffs. CEO Steven Blanco cited “excellent growth in Detection” and emphasized the company’s ability to navigate a dynamic operating environment. Gross margins faced pressure from foreign currency headwinds, particularly in Latin America, but this was partially offset by favorable product mix and disciplined expense management. Is now the time to buy MSA? Find out in our full research report (it’s free).\n• Operating Margin: 20.7%, down from 23.5% in the same quarter last year While we enjoy listening to the management's commentary, our favorite part of earnings calls are the analyst questions. Those are unscripted and can often highlight topics that management teams would rather avoid or topics where the answer is complicated. Here is what has caught our attention.\n• Rob Mason (Baird): Asked how project decision-making and customer behavior changed as tariffs became more prominent. CEO Steven Blanco said some customers accelerated shipments, especially in Canada, and highlighted strong global project activity, particularly in Detection.\n• Ross Sparenblek (William Blair): Inquired about the relative performance of fixed versus portable Detection products and the sustainability of recent growth rates. Blanco noted balanced growth between fixed and portable categories, with Detection expected to remain a growth driver.\n• Ross Sparenblek (William Blair): Sought clarification on backlog normalization and the impact of past order conversions on second quarter performance. CFO Elyse Brody explained that Q2 faces a tough comparison due to last year’s backlog conversion, but highlighted healthy current order trends.\n• Jeff Van Sinderen (B. Riley FBR): Asked for specifics on shipment pull-forwards and the potential impact of future tariffs on the supply chain. Brody detailed that the Q1 pull-forward was under $10 million and weighted slightly toward Fire Service, with ongoing tariff mitigation efforts underway.\n• Mike Shlisky (D.A. Davidson): Questioned whether cost reduction actions taken to address tariffs could result in lasting margin gains, and if the company’s long-term financial targets remain achievable under current conditions. Blanco responded that cost savings are intended to be permanent, and management remains committed to 2028 targets despite increased uncertainty.\n\nIn the coming quarters, the StockStory team will monitor (1) the pace and effectiveness of tariff mitigation actions—including pricing and supply chain shifts, (2) the sustainability of Detection product demand and expansion of connected solutions, and (3) margin trends as foreign currency and tariff pressures evolve. Additional focus will be on execution of new product rollouts and progress toward long-term financial targets. MSA Safety currently trades at $170.35, down from $177.41 just before the earnings. Is the company at an inflection point that warrants a buy or sell? Find out in our full research report (it’s free). When Trump unveiled his aggressive tariff plan in April 2025, markets tanked as investors feared a full-blown trade war. But those who panicked and sold missed the subsequent rebound that’s already erased most losses. Don’t let fear keep you from great opportunities and take a look at Top 5 Growth Stocks for this month. This is a curated list of our High Quality stocks that have generated a market-beating return of 183% over the last five years (as of March 31st 2025). Stocks that made our list in 2020 include now familiar names such as Nvidia (+1,545% between March 2020 and March 2025) as well as under-the-radar businesses like the once-micro-cap company Tecnoglass (+1,754% five-year return). Find your next big winner with StockStory today. StockStory is growing and hiring equity analyst and marketing roles. Are you a 0 to 1 builder passionate about the markets and AI? See the open roles here.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nyse/msa?utm_source=earningsCall&utm_medium=yahoo&utm_campaign=earningsCallIntroCTA&utm_article=CF12aG4AY0I%3D&utm_ticker=MSA",
    "https://stockstory.org/us/stocks/nyse/msa?utm_source=earningsCall&utm_medium=yahoo&utm_campaign=earningsCallQuestionCTA&utm_article=CF12aG4AY0I%3D&utm_ticker=MSA",
    "https://stockstory.org/high-quality/top-growth-stocks?utm_source=earningsCall&utm_medium=yahoo&utm_campaign=EndCategory&utm_article=CF12aG4AY0I%3D&utm_ticker=MSA",
    "https://stockstory.org/discover/high-quality-stocks?utm_source=earningsCall&utm_medium=yahoo&utm_campaign=discover&utm_article=CF12aG4AY0I%3D&utm_ticker=MSA",
    "https://stockstory.org/careers"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Detection product demand",
      "weight": 0.076134674
    },
    {
      "name": "tariff mitigation actions",
      "weight": 0.073501125
    },
    {
      "name": "future tariffs",
      "weight": 0.06870654
    },
    {
      "name": "ongoing tariff mitigation efforts",
      "weight": 0.068176955
    },
    {
      "name": "tariffs",
      "weight": 0.067747384
    },
    {
      "name": "anticipated tariffs",
      "weight": 0.06746477
    },
    {
      "name": "higher Detection sales",
      "weight": 0.062884204
    },
    {
      "name": "Detection",
      "weight": 0.061700687
    },
    {
      "name": "management teams",
      "weight": 0.059485305
    },
    {
      "name": "customer shipment acceleration",
      "weight": 0.05908815
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Earnings Calls"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97998046875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95361328125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9140625
    }
  ],
  "sentiment": {
    "positive": 0.38021696,
    "negative": 0.2979625,
    "neutral": 0.32182053
  },
  "summary": "MSA Safety's Q2 results were met with positive market response, driven by continued strength in its Detection segment and demand across product categories. The company's operating margin was 20.7%, down from 23.5% in the same quarter last year. Gross margins faced pressure from foreign currency headwinds, but this was partially offset by favorable product mix and disciplined expense management. CEO Steven Blanco highlighted \"excellent growth in Detection\" and the company's ability to navigate a dynamic operating environment. Analyst questions included questions about project decision-making and customer behavior as tariffs became more prominent. CFO Elyse Brody highlighted healthy current order trends and the potential impact of future tariffs on the supply chain. MSA Safety currently trades at $170.35, down from $177.41 just before the earnings.",
  "shortSummary": "MSA Safety’s Q2 results were highlighted by strong Detection sales and anticipated tariffs, despite challenges from foreign currency and uncertain market conditions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e56f1705f3ee44c1b8914a2b7695fa8f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nyse/msa?utm_source=earningsCall&utm_medium=yahoo&utm_campaign=earningsCallQuestionCTA&utm_article=CF12aG4AY0I%3D&utm_ticker=MSA",
      "text": "MSA Safety (MSA)\nWe aren’t fans of MSA Safety. It’s recently struggled to grow its revenue, a worrying sign for investors seeking high-quality stocks.― StockStory Analyst Team\n1. News\n2. Summary\nWhy MSA Safety Is Not Exciting\nFounded in 1914 as Mine Safety Appliances to protect coal miners from dangerous gases, MSA Safety (NYSE:MSA) designs and manufactures advanced safety products that protect workers and facilities across industries including fire service, energy, construction, and manufacturing.\n- Smaller revenue base of $1.83 billion means it hasn’t achieved the economies of scale that some industry juggernauts enjoy\n- The good news is that its successful business model is illustrated by its impressive adjusted operating margin\nWhy There Are Better Opportunities Than MSA Safety\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than MSA Safety\nAt $170.35 per share, MSA Safety trades at 20.3x forward P/E. This valuation is fair for the quality you get, but we’re on the sidelines for now.\nThere are stocks out there similarly priced with better business quality. We prefer owning these.\n3. MSA Safety (MSA) Research Report: Q2 CY2025 Update\nSafety equipment manufacturer MSA Safety (NYSE:MSA) beat Wall Street’s revenue expectations in Q2 CY2025, with sales up 2.5% year on year to $474.1 million. Its non-GAAP profit of $1.93 per share was 10% above analysts’ consensus estimates.\nMSA Safety (MSA) Q2 CY2025 Highlights:\n- Revenue: $474.1 million vs analyst estimates of $447.8 million (2.5% year-on-year growth, 5.9% beat)\n- Adjusted EPS: $1.93 vs analyst estimates of $1.76 (10% beat)\n- Adjusted EBITDA: $116.5 million vs analyst estimates of $105 million (24.6% margin, 10.9% beat)\n- The company maintained its low-single-digit full-year organic sales growth outlook for 2025, while acknowledging ongoing risk due to macroeconomic factors\n- Operating Margin: 18.1%, down from 23.5% in the same quarter last year\n- Free Cash Flow Margin: 8%, similar to the same quarter last year\n- Market Capitalization: $6.89 billion\nCompany Overview\nFounded in 1914 as Mine Safety Appliances to protect coal miners from dangerous gases, MSA Safety (NYSE:MSA) designs and manufactures advanced safety products that protect workers and facilities across industries including fire service, energy, construction, and manufacturing.\nMSA Safety's product portfolio is organized into three main categories: Firefighter Safety, Detection, and Industrial Personal Protective Equipment (PPE). The company's firefighter safety line includes self-contained breathing apparatus (SCBA), protective apparel, and helmets under brands like Cairns and Gallet. Its detection products encompass fixed gas and flame detection systems and portable gas detection instruments that monitor for hazardous gases in various environments. The industrial PPE category features the iconic V-Gard hard hats and comprehensive fall protection equipment.\nThe company serves two primary customer types: distributors and end-users. In the Americas, MSA primarily sells through distribution networks, while its International segment utilizes both direct and indirect sales channels. MSA maintains relationships with over 2,100 authorized distributor locations worldwide to reach diverse markets and segments.\nA firefighter entering a burning building might rely on MSA's G1 SCBA for breathable air, while wearing the company's helmet and protective clothing. Similarly, an oil refinery worker might use MSA's portable gas detector to check for dangerous gas leaks before performing maintenance.\nMSA generates revenue through both initial equipment sales and recurring business from replacement components and services, particularly in its fixed gas and flame detection systems. The company has enhanced its recurring revenue through MSA+, a platform launched in 2022 that integrates hardware with cloud software solutions and subscription-based safety services.\nThe company invests significantly in research and development, with dedicated teams working alongside industry standards groups to develop innovative safety solutions. This commitment to innovation has resulted in numerous patents and proprietary technologies like XCell sensors for faster gas detection and ReflectIR thermal barrier technology in hard hats.\n4. Safety & Security Services\nRising concerns over physical security, cybersecurity threats, and workplace safety regulations will present opportunities for companies in this sector. AI and digitization will enhance surveillance, access control, and threat detection, which could benefit key players in Safety & Security Services. These trends could also introduce ethical and regulatory concerns over data privacy and automated decision-making in security operations, giving rise to headline risks. Finally, increasing scrutiny on private security practices and evolving criminal justice policies again mean that companies in the space need to operate with the utmost care or risk being the poster child of abuse of power.\nMSA Safety's competitors include 3M (NYSE:MMM) in respiratory and head protection, Honeywell (NASDAQ:HON) in gas detection and protective equipment, and Dräger (ETR:DRW3) in breathing apparatus and gas detection systems. In the fire service market, they compete with Globe Manufacturing (owned by MSA) and Lion Group.\n5. Revenue Growth\nReviewing a company’s long-term sales performance reveals insights into its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul.\nWith $1.83 billion in revenue over the past 12 months, MSA Safety is a mid-sized business services company, which sometimes brings disadvantages compared to larger competitors benefiting from better economies of scale. On the bright side, it can still flex high growth rates because it’s working from a smaller revenue base.\nAs you can see below, MSA Safety’s 5.8% annualized revenue growth over the last five years was decent. This shows its offerings generated slightly more demand than the average business services company, a useful starting point for our analysis.\nLong-term growth is the most important, but within business services, a half-decade historical view may miss new innovations or demand cycles. MSA Safety’s recent performance shows its demand has slowed as its annualized revenue growth of 4.6% over the last two years was below its five-year trend.\nThis quarter, MSA Safety reported modest year-on-year revenue growth of 2.5% but beat Wall Street’s estimates by 5.9%.\nLooking ahead, sell-side analysts expect revenue to grow 4.5% over the next 12 months, similar to its two-year rate. This projection doesn't excite us and implies its newer products and services will not accelerate its top-line performance yet.\n6. Operating Margin\nOperating margin is an important measure of profitability as it shows the portion of revenue left after accounting for all core expenses – everything from the cost of goods sold to advertising and wages. It’s also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.\nMSA Safety has been a well-oiled machine over the last five years. It demonstrated elite profitability for a business services business, boasting an average operating margin of 20.7%.\nAnalyzing the trend in its profitability, MSA Safety’s operating margin rose by 4.6 percentage points over the last five years, as its sales growth gave it operating leverage.\nIn Q2, MSA Safety generated an operating margin profit margin of 18.1%, down 5.4 percentage points year on year. This contraction shows it was less efficient because its expenses grew faster than its revenue.\n7. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nMSA Safety’s EPS grew at a solid 10.2% compounded annual growth rate over the last five years, higher than its 5.8% annualized revenue growth. This tells us the company became more profitable on a per-share basis as it expanded.\nDiving into the nuances of MSA Safety’s earnings can give us a better understanding of its performance. As we mentioned earlier, MSA Safety’s operating margin declined this quarter but expanded by 4.6 percentage points over the last five years. This was the most relevant factor (aside from the revenue impact) behind its higher earnings; interest expenses and taxes can also affect EPS but don’t tell us as much about a company’s fundamentals.\nLike with revenue, we analyze EPS over a more recent period because it can provide insight into an emerging theme or development for the business.\nFor MSA Safety, its two-year annual EPS growth of 9.3% is similar to its five-year trend, implying stable earnings.\nIn Q2, MSA Safety reported adjusted EPS at $1.93, down from $2.01 in the same quarter last year. Despite falling year on year, this print beat analysts’ estimates by 10%. Over the next 12 months, Wall Street expects MSA Safety’s full-year EPS of $7.69 to grow 8.6%.\n8. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nMSA Safety has shown terrific cash profitability, enabling it to reinvest, return capital to investors, and stay ahead of the competition while maintaining an ample cushion. The company’s free cash flow margin was among the best in the business services sector, averaging 13.5% over the last five years.\nTaking a step back, we can see that MSA Safety’s margin expanded by 2 percentage points during that time. This is encouraging because it gives the company more optionality.\nMSA Safety’s free cash flow clocked in at $37.9 million in Q2, equivalent to a 8% margin. This cash profitability was in line with the comparable period last year but below its five-year average. In a silo, this isn’t a big deal because investment needs can be seasonal, but we’ll be watching to see if the trend extrapolates into future quarters.\n9. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nAlthough MSA Safety hasn’t been the highest-quality company lately, it historically found a few growth initiatives that worked out well. Its five-year average ROIC was 20.7%, impressive for a business services business.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Uneventfully, MSA Safety’s ROIC has stayed the same over the last few years. Given the company’s underwhelming financial performance in other areas, we’d like to see its returns improve before recommending the stock.\n10. Balance Sheet Assessment\nMSA Safety reported $147 million of cash and $679.3 million of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $464.2 million of EBITDA over the last 12 months, we view MSA Safety’s 1.1× net-debt-to-EBITDA ratio as safe. We also see its $8.19 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n11. Key Takeaways from MSA Safety’s Q2 Results\nWe were impressed by how significantly MSA Safety blew past analysts’ revenue expectations this quarter. We were also glad its EPS outperformed Wall Street’s estimates. The company maintained its low-single-digit full-year organic sales growth outlook for 2025, while acknowledging ongoing risk due to macroeconomic factors. Zooming out, we think this quarter featured some important positives but the commentary around guidance adds some uncertainty to the picture, something investors don't love. Shares traded down 1.4% to $175 immediately following the results.\n12. Is Now The Time To Buy MSA Safety?\nUpdated: August 11, 2025 at 11:08 PM EDT\nThe latest quarterly earnings matters, sure, but we actually think longer-term fundamentals and valuation matter more. Investors should consider all these pieces before deciding whether or not to invest in MSA Safety.\nWhen it comes to MSA Safety’s business quality, there are some positives, but it ultimately falls short. To begin with, the its revenue growth was decent over the last five years, and analysts believe it can continue growing at these levels. On top of that, MSA Safety’s impressive operating margins show it has a highly efficient business model, and its powerful free cash flow generation enables it to stay ahead of the competition through consistent reinvestment of profits.\nMSA Safety’s P/E ratio based on the next 12 months is 20.3x. Investors with a higher risk tolerance might like the company, but we think the potential downside is too great. We're pretty confident there are superior stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $191.80 on the company (compared to the current share price of $170.35)."
    },
    {
      "url": "https://stockstory.org/us/stocks/nyse/msa?utm_source=earningsCall&utm_medium=yahoo&utm_campaign=earningsCallIntroCTA&utm_article=CF12aG4AY0I%3D&utm_ticker=MSA",
      "text": "MSA Safety (MSA)\nWe aren’t fans of MSA Safety. It’s recently struggled to grow its revenue, a worrying sign for investors seeking high-quality stocks.― StockStory Analyst Team\n1. News\n2. Summary\nWhy MSA Safety Is Not Exciting\nFounded in 1914 as Mine Safety Appliances to protect coal miners from dangerous gases, MSA Safety (NYSE:MSA) designs and manufactures advanced safety products that protect workers and facilities across industries including fire service, energy, construction, and manufacturing.\n- Smaller revenue base of $1.83 billion means it hasn’t achieved the economies of scale that some industry juggernauts enjoy\n- The good news is that its successful business model is illustrated by its impressive adjusted operating margin\nWhy There Are Better Opportunities Than MSA Safety\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than MSA Safety\nAt $170.35 per share, MSA Safety trades at 20.3x forward P/E. This valuation is fair for the quality you get, but we’re on the sidelines for now.\nThere are stocks out there similarly priced with better business quality. We prefer owning these.\n3. MSA Safety (MSA) Research Report: Q2 CY2025 Update\nSafety equipment manufacturer MSA Safety (NYSE:MSA) beat Wall Street’s revenue expectations in Q2 CY2025, with sales up 2.5% year on year to $474.1 million. Its non-GAAP profit of $1.93 per share was 10% above analysts’ consensus estimates.\nMSA Safety (MSA) Q2 CY2025 Highlights:\n- Revenue: $474.1 million vs analyst estimates of $447.8 million (2.5% year-on-year growth, 5.9% beat)\n- Adjusted EPS: $1.93 vs analyst estimates of $1.76 (10% beat)\n- Adjusted EBITDA: $116.5 million vs analyst estimates of $105 million (24.6% margin, 10.9% beat)\n- The company maintained its low-single-digit full-year organic sales growth outlook for 2025, while acknowledging ongoing risk due to macroeconomic factors\n- Operating Margin: 18.1%, down from 23.5% in the same quarter last year\n- Free Cash Flow Margin: 8%, similar to the same quarter last year\n- Market Capitalization: $6.89 billion\nCompany Overview\nFounded in 1914 as Mine Safety Appliances to protect coal miners from dangerous gases, MSA Safety (NYSE:MSA) designs and manufactures advanced safety products that protect workers and facilities across industries including fire service, energy, construction, and manufacturing.\nMSA Safety's product portfolio is organized into three main categories: Firefighter Safety, Detection, and Industrial Personal Protective Equipment (PPE). The company's firefighter safety line includes self-contained breathing apparatus (SCBA), protective apparel, and helmets under brands like Cairns and Gallet. Its detection products encompass fixed gas and flame detection systems and portable gas detection instruments that monitor for hazardous gases in various environments. The industrial PPE category features the iconic V-Gard hard hats and comprehensive fall protection equipment.\nThe company serves two primary customer types: distributors and end-users. In the Americas, MSA primarily sells through distribution networks, while its International segment utilizes both direct and indirect sales channels. MSA maintains relationships with over 2,100 authorized distributor locations worldwide to reach diverse markets and segments.\nA firefighter entering a burning building might rely on MSA's G1 SCBA for breathable air, while wearing the company's helmet and protective clothing. Similarly, an oil refinery worker might use MSA's portable gas detector to check for dangerous gas leaks before performing maintenance.\nMSA generates revenue through both initial equipment sales and recurring business from replacement components and services, particularly in its fixed gas and flame detection systems. The company has enhanced its recurring revenue through MSA+, a platform launched in 2022 that integrates hardware with cloud software solutions and subscription-based safety services.\nThe company invests significantly in research and development, with dedicated teams working alongside industry standards groups to develop innovative safety solutions. This commitment to innovation has resulted in numerous patents and proprietary technologies like XCell sensors for faster gas detection and ReflectIR thermal barrier technology in hard hats.\n4. Safety & Security Services\nRising concerns over physical security, cybersecurity threats, and workplace safety regulations will present opportunities for companies in this sector. AI and digitization will enhance surveillance, access control, and threat detection, which could benefit key players in Safety & Security Services. These trends could also introduce ethical and regulatory concerns over data privacy and automated decision-making in security operations, giving rise to headline risks. Finally, increasing scrutiny on private security practices and evolving criminal justice policies again mean that companies in the space need to operate with the utmost care or risk being the poster child of abuse of power.\nMSA Safety's competitors include 3M (NYSE:MMM) in respiratory and head protection, Honeywell (NASDAQ:HON) in gas detection and protective equipment, and Dräger (ETR:DRW3) in breathing apparatus and gas detection systems. In the fire service market, they compete with Globe Manufacturing (owned by MSA) and Lion Group.\n5. Revenue Growth\nReviewing a company’s long-term sales performance reveals insights into its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul.\nWith $1.83 billion in revenue over the past 12 months, MSA Safety is a mid-sized business services company, which sometimes brings disadvantages compared to larger competitors benefiting from better economies of scale. On the bright side, it can still flex high growth rates because it’s working from a smaller revenue base.\nAs you can see below, MSA Safety’s 5.8% annualized revenue growth over the last five years was decent. This shows its offerings generated slightly more demand than the average business services company, a useful starting point for our analysis.\nLong-term growth is the most important, but within business services, a half-decade historical view may miss new innovations or demand cycles. MSA Safety’s recent performance shows its demand has slowed as its annualized revenue growth of 4.6% over the last two years was below its five-year trend.\nThis quarter, MSA Safety reported modest year-on-year revenue growth of 2.5% but beat Wall Street’s estimates by 5.9%.\nLooking ahead, sell-side analysts expect revenue to grow 4.5% over the next 12 months, similar to its two-year rate. This projection doesn't excite us and implies its newer products and services will not accelerate its top-line performance yet.\n6. Operating Margin\nOperating margin is an important measure of profitability as it shows the portion of revenue left after accounting for all core expenses – everything from the cost of goods sold to advertising and wages. It’s also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.\nMSA Safety has been a well-oiled machine over the last five years. It demonstrated elite profitability for a business services business, boasting an average operating margin of 20.7%.\nAnalyzing the trend in its profitability, MSA Safety’s operating margin rose by 4.6 percentage points over the last five years, as its sales growth gave it operating leverage.\nIn Q2, MSA Safety generated an operating margin profit margin of 18.1%, down 5.4 percentage points year on year. This contraction shows it was less efficient because its expenses grew faster than its revenue.\n7. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nMSA Safety’s EPS grew at a solid 10.2% compounded annual growth rate over the last five years, higher than its 5.8% annualized revenue growth. This tells us the company became more profitable on a per-share basis as it expanded.\nDiving into the nuances of MSA Safety’s earnings can give us a better understanding of its performance. As we mentioned earlier, MSA Safety’s operating margin declined this quarter but expanded by 4.6 percentage points over the last five years. This was the most relevant factor (aside from the revenue impact) behind its higher earnings; interest expenses and taxes can also affect EPS but don’t tell us as much about a company’s fundamentals.\nLike with revenue, we analyze EPS over a more recent period because it can provide insight into an emerging theme or development for the business.\nFor MSA Safety, its two-year annual EPS growth of 9.3% is similar to its five-year trend, implying stable earnings.\nIn Q2, MSA Safety reported adjusted EPS at $1.93, down from $2.01 in the same quarter last year. Despite falling year on year, this print beat analysts’ estimates by 10%. Over the next 12 months, Wall Street expects MSA Safety’s full-year EPS of $7.69 to grow 8.6%.\n8. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nMSA Safety has shown terrific cash profitability, enabling it to reinvest, return capital to investors, and stay ahead of the competition while maintaining an ample cushion. The company’s free cash flow margin was among the best in the business services sector, averaging 13.5% over the last five years.\nTaking a step back, we can see that MSA Safety’s margin expanded by 2 percentage points during that time. This is encouraging because it gives the company more optionality.\nMSA Safety’s free cash flow clocked in at $37.9 million in Q2, equivalent to a 8% margin. This cash profitability was in line with the comparable period last year but below its five-year average. In a silo, this isn’t a big deal because investment needs can be seasonal, but we’ll be watching to see if the trend extrapolates into future quarters.\n9. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nAlthough MSA Safety hasn’t been the highest-quality company lately, it historically found a few growth initiatives that worked out well. Its five-year average ROIC was 20.7%, impressive for a business services business.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Uneventfully, MSA Safety’s ROIC has stayed the same over the last few years. Given the company’s underwhelming financial performance in other areas, we’d like to see its returns improve before recommending the stock.\n10. Balance Sheet Assessment\nMSA Safety reported $147 million of cash and $679.3 million of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $464.2 million of EBITDA over the last 12 months, we view MSA Safety’s 1.1× net-debt-to-EBITDA ratio as safe. We also see its $8.19 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n11. Key Takeaways from MSA Safety’s Q2 Results\nWe were impressed by how significantly MSA Safety blew past analysts’ revenue expectations this quarter. We were also glad its EPS outperformed Wall Street’s estimates. The company maintained its low-single-digit full-year organic sales growth outlook for 2025, while acknowledging ongoing risk due to macroeconomic factors. Zooming out, we think this quarter featured some important positives but the commentary around guidance adds some uncertainty to the picture, something investors don't love. Shares traded down 1.4% to $175 immediately following the results.\n12. Is Now The Time To Buy MSA Safety?\nUpdated: August 11, 2025 at 11:08 PM EDT\nThe latest quarterly earnings matters, sure, but we actually think longer-term fundamentals and valuation matter more. Investors should consider all these pieces before deciding whether or not to invest in MSA Safety.\nWhen it comes to MSA Safety’s business quality, there are some positives, but it ultimately falls short. To begin with, the its revenue growth was decent over the last five years, and analysts believe it can continue growing at these levels. On top of that, MSA Safety’s impressive operating margins show it has a highly efficient business model, and its powerful free cash flow generation enables it to stay ahead of the competition through consistent reinvestment of profits.\nMSA Safety’s P/E ratio based on the next 12 months is 20.3x. Investors with a higher risk tolerance might like the company, but we think the potential downside is too great. We're pretty confident there are superior stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $191.80 on the company (compared to the current share price of $170.35)."
    }
  ],
  "argos_summary": "MSA Safety reported a positive first quarter driven by strong sales in its Detection segment, with revenue growth of 2.5% year-on-year, surpassing Wall Street expectations. Despite facing pressure on gross margins due to foreign currency fluctuations and a decline in operating margin, the company maintained a solid outlook for low-single-digit organic sales growth for 2025. Analysts express caution regarding MSA's long-term growth potential and suggest that there may be better investment opportunities available.",
  "argos_id": "MW8C8OLB9"
}