{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/ast-spacemobile-gains-on-launch-plan-and-new-contracts-video?srnd=all",
  "authorsByline": "bn",
  "articleId": "c0dcd21c593f411797448744c2e5e437",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i3fbFIrjy88c/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T17:33:41.149000+00:00",
  "addDate": "2025-08-12T17:44:21.587486+00:00",
  "refreshDate": "2025-08-12T17:44:21.587488+00:00",
  "score": 1.0,
  "title": "AST SpaceMobile Shares Gain on Launch Plan, and New Government Contracts",
  "description": "AST SpaceMobile shares climb after the satellite firm set out an ambitious plan to launch 45 to 60 satellites in 2025 and 2026. The firm also said it received two additional early-stage contracts for the US government. Bloomberg's  Bruce Einhorn reports. (Source: Bloomberg)",
  "content": "Key thing with HD Space mobile is they're building out their network of satellites. The goal is they want to have sufficient number of number of satellites, ultimately around 90 satellites in low-Earth orbit to be able to provide service worldwide. The moment they only have a handful of satellites up there, so they're in the process of getting those made and then launched. And they were pretty optimistic in their assessment yesterday in terms of how quickly they're going to be able to get those satellites up in orbit. They talked about having regular launches next year. And so I think that's one reason that investors seem to be enthusiastic about the company today. Here's another company I completely missed on East Space Mobile. I mean, it's got a market cap of $18.3 billion. The stock's up 11% today, up 140% this year, up 106% on a trailing 12 month basis. So clearly, the market likes this here. Bruce, who do they compete with? Because it isn't like SpaceX doing the StarLink thing and stuff like that. There you go. They're competing with Space X and that's one of the problems, is they're competing against space X because StarLink has a similar service that they're doing with T-Mobile direct a device at the same time that is T is competing with Space X in that business. They're also relying on space X to get their satellites into orbit. They're using AR. They plan on using space X rockets for some of their launches. They also want to use rockets from Blue Origin, the new Glenn Rocket, New Origin. Blue Origin I'm sorry, is the company that's backed by Jeff Bezos. That rocket has had some issues. It had its first launch earlier this year. They were hoping to have a second launch in the spring. That didn't happen. We're now just waiting to hear when there's going to be another launch for the new Glenn. That said, the company still seems to be pretty positive that they're going to get the rides to space that they need, whether it's from New Glenn or whether it's from Space X. Well, we saw AST Space Mobile really laying out an ambitious plan here, launching 45 to 60 satellites this year. And in 2026, they also said that they received two additional early stage contracts for the U.S. government. But when we look on a broader scale, who's the real leader here? Is it StarLink or who's getting the most government contracts? Well, it's it's in this business in particular, the direct to device business. It's still very, very early in this in the development of this business. So while it seems that at the moment StarLink has an edge because they have the satellites up there and they've started offering some service with T-Mobile, there's still quite a way to go. So there's plenty of room for first T here to catch up. Asked in their comments yesterday, did make the point that they need fewer satellites because their satellites are larger, so they don't need the thousands of satellites that StarLink has. And they're talking about fewer than 100 who, if they partnered with, asked who are their partners? Because I would think they would need some telecom partnerships here. Indeed, yes. And they do have some some big names. They they have agreements to team up with AT & T, with Verizon, with Vodafone. A lot of other companies around the world. So they do have some big names. They are talking about having some service, what they call intermittent service or not continuous coverage, but at least beginning to offer a service in the US by the end of the year and also in some other countries. And then their goal is sometime next year to have enough satellites so that they can ramp that up to more full fledged service. So when we're thinking about the industry more broadly, what is the estimate for when we actually expect to see that there will be no coverage gaps? Because the whole point here for this industry is that they're just trying to eliminate any sort of no signal. So you should be able to get signal whether you're in the ocean or some remote desert, right? Yes, I think that's a good point that you're making, that that is that is the goal. I think that while, you know, some people look at this and think I'll be able to use satellites for all of my cell phone stuff, all of my mobile devices, and I won't need to have a cellular network at all. I think for the most part, the idea is rather to fill in the gaps to make sure that there are no drops in coverage. So with HST, the big question is just how quickly can they get the satellites up? So they for the US and their other key markets, they say that they need around 60 satellites at the pace that they've laid out. They might be able to have those up by next year. We'll see.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "fewer satellites",
      "weight": 0.09323131
    },
    {
      "name": "satellites",
      "weight": 0.09041599
    },
    {
      "name": "enough satellites",
      "weight": 0.09018788
    },
    {
      "name": "AST Space Mobile",
      "weight": 0.07721544
    },
    {
      "name": "Space X",
      "weight": 0.0762921
    },
    {
      "name": "East Space Mobile",
      "weight": 0.07511408
    },
    {
      "name": "Launch Plan",
      "weight": 0.069309466
    },
    {
      "name": "intermittent service",
      "weight": 0.067433044
    },
    {
      "name": "first T",
      "weight": 0.06708427
    },
    {
      "name": "other companies",
      "weight": 0.066752166
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98095703125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.84326171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.7802734375
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.45458984375
    },
    {
      "name": "/News/Technology News",
      "score": 0.410888671875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.385009765625
    }
  ],
  "sentiment": {
    "positive": 0.5660038,
    "negative": 0.10237473,
    "neutral": 0.33162138
  },
  "summary": "HD SpaceMobile shares have risen 11% today and 140% this year, up 106% on a trailing 12-month basis. The company is building out its network of satellites, aiming to have around 90 satellites globally. The firm plans to launch 45 to 60 to 60 satellites this year and in 2026, they also received two additional early stage contracts for the U.S. government. However, the company is competing with Space X, which has a similar service they're using with T-Mobile and plans to use space X rockets for some of their launches. The stock is up 11% and the company's shares are up 140% year-on-year, indicating that it is confident in its ability to quickly get the satellites up in orbit. Analysts suggest that while StarLink has an edge due to their larger satellites, there is still a way to go in this business. The next step is to eliminate any gaps in coverage.",
  "shortSummary": "ASST Space Mobile's shares rose 11% on optimistic launch plans and new government contracts, aiming to expand global coverage coverage with 90 satellites by 2020.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5f49bc5adb0f4d57910f680315782a8a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "HD Space Mobile is working to expand its satellite network, aiming for around 90 satellites in low-Earth orbit to provide global service. Currently, they have only a few satellites and plan to launch 45 to 60 more this year, with optimism about regular launches next year. They face competition from SpaceX's StarLink, which has already begun offering services, but HD Space Mobile has secured partnerships with major telecom companies like AT&T and Verizon and aims to provide intermittent service by the end of the year.",
  "argos_id": "N4YIFS32S"
}