{
  "url": "https://www.washingtonexaminer.com/news/3497881/pete-buttigieg-trump-federalizing-dc-police-distraction-epstein-files/",
  "authorsByline": "Asher Notheis",
  "articleId": "db199e0d90964c6b9b336d836de37ac4",
  "source": {
    "domain": "washingtonexaminer.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonexaminer.com/wp-content/uploads/2025/08/Pete-Buttigieg-DC.webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:41:34+00:00",
  "addDate": "2025-08-12T22:01:58.058040+00:00",
  "refreshDate": "2025-08-12T22:01:58.058042+00:00",
  "score": 1.0,
  "title": "Buttigieg says Trump federalizing DC police is a 'distraction'",
  "description": "Buttigieg encouraged his followers to “stand up” to the president’s “authoritarian actions” and remain focused on the effects of Trump’s administration.",
  "content": "Former Transportation Secretary Pete Buttigieg said President Donald Trump has ulterior motives with federalizing police in Washington, D.C., adding that Trump needs his supporters focused on “something else.”\n\nTrump announced his move to address crime in the nation’s capital Monday, giving Attorney General Pam Bondi control over the Metropolitan Police Department. Buttigieg, however, said Trump is not taking this action to increase the city’s safety, but instead to “solve his own political problems.”\n\n“He needs to get his base talking and thinking about something besides his refusal to open up the Epstein files because he’s mixed up in them,” Buttigieg said in a video posted on X.\n\n“And he wants the rest of the country focused on something, anything, besides the work that he has done and continues to do to kick millions of Americans off of their health insurance, to close down rural hospitals, and to undermine basic functions of our government in order to pay for tax cuts for the wealthiest,” Buttigieg said.\n\nThe former secretary was hesitant to call this a “distraction,” but did say Trump is trying to distract people through “taking power in this way.” He also said Trump has warned he would take similar action in other cities.\n\nButtigieg encouraged his followers to “stand up” to the president’s “authoritarian actions” while remaining focused on the effects of Trump’s administration.\n\nAs part of Trump’s crime clean-up in Washington, White House press secretary Karoline Leavitt said Tuesday that the city’s homeless residents can leave their encampments for a homeless shelter. Those who refuse will be “susceptible to fines or to jail time.”\n\nWHY TRUMP’S DC POLICE TAKEOVER IS LIKELY TO AVOID LEGAL HURDLES\n\nTrump’s announcement to address crime in the nation’s capital was preceded by former Department of Government Efficiency staffer Edward Coristine, known for his moniker “Big Balls,” who was attacked and carjacked by two juveniles on Aug. 3.\n\nBoth teenagers will be held in custody at D.C.’s Youth Services Center after a request to move them was denied.",
  "medium": "Article",
  "links": [
    "https://www.washingtonexaminer.com/news/justice/3496167/why-trump-dc-police-takeover-is-likely-to-avoid-legal-hurdles/",
    "https://t.co/a3TZkbTp9H",
    "https://www.washingtonexaminer.com/policy/healthcare/3497776/dc-homeless-accept-treatment-face-jail-trump-plan/",
    "https://www.washingtonexaminer.com/policy/energy-and-environment/3497893/us-rejects-shipping-carbon-tax/",
    "https://www.washingtonexaminer.com/news/crime/3497153/teens-charged-doge-staffer-attack-kept-in-custody/",
    "https://twitter.com/PeteButtigieg/status/1955025306303058134?ref_src=twsrc%5Etfw"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Donald Trump",
      "weight": 0.097383276
    },
    {
      "name": "Trump",
      "weight": 0.09673509
    },
    {
      "name": "President Donald Trump",
      "weight": 0.09481978
    },
    {
      "name": "Former Transportation Secretary Pete Buttigieg",
      "weight": 0.078975834
    },
    {
      "name": "Pete Buttigieg",
      "weight": 0.0756785
    },
    {
      "name": "Buttigieg",
      "weight": 0.071203515
    },
    {
      "name": "White House press secretary Karoline Leavitt",
      "weight": 0.06677279
    },
    {
      "name": "similar action",
      "weight": 0.06610616
    },
    {
      "name": "DC police",
      "weight": 0.06606482
    },
    {
      "name": "Attorney General Pam Bondi",
      "weight": 0.063227735
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9677734375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.96044921875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.890625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.43603515625
    }
  ],
  "sentiment": {
    "positive": 0.047417562,
    "negative": 0.75932527,
    "neutral": 0.19325723
  },
  "summary": "Former Transportation Secretary, Pete Buttigieg, has accused President Donald Trump of having ulterior motives with federalizing police in Washington, D.C. He argues that the move is designed to distract from his supporters and distract them from his administration's work. Buttigigieg also warned that he would take similar action in other cities. As part of the crime clean-up, Buttigegieg suggested that homeless residents could leave their encampments for a homeless shelter, but those who refuse will face fines or jail time.",
  "shortSummary": "Former Transportation Secretary Pete Buttigieg criticizes President Donald Trump’s federalizing DC police, claiming it distracts his supporters from other policies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f60313761d794a7ebd388ef5320fb6c4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.washingtonexaminer.com/policy/healthcare/3497776/dc-homeless-accept-treatment-face-jail-trump-plan/",
      "text": "Homeless people in Washington have three options under President Donald Trump’s crime control directives: homeless shelter, mental health or addiction treatment, or jail.\nThe plans for homeless people, many of whom suffer from mental health illnesses, were laid out by White House press secretary Karoline Leavitt during a Tuesday afternoon briefing while discussing the administration’s move to federalize control of the Metropolitan Police Department and deploy the National Guard to control the “public safety emergency” in the District of Columbia.\n“Homeless individuals will be given the option to leave their encampment to be taken to a homeless shelter to be offered addiction or mental health services,” Leavitt said. “And if they refuse, they will be susceptible to fines or to jail time.”\nCleaning up the district was a campaign promise that Trump referenced at least 20 times during the 2024 election season, according to a Tuesday morning press release from the White House. His first promise to use federal law enforcement and the National Guard to restore the district came in February 2023.\nTrump said Monday that removing homeless encampments from the capital is an essential part of making Washington safer and more beautiful, but he did not make mention of the connection between homelessness and mental illness.\nAlthough statistics on the homeless population are difficult to collect, social scientists estimate that significant percentages of homeless people suffer from chronic mental health conditions.\nUpwards of 40% of those experiencing homelessness have a mental health disorder, and at least a quarter suffer from mental illness and addictions, according to the Canadian website Homeless Hub. The Health and Human Services website on the correlation between mental health and homelessness was down at the time of this reporting.\nLeavitt said Tuesday that “the homelessness problem has ravaged the city” and that improving safety in Washington “involves removing mentally disturbed individuals and homeless encampments.”\n“Homeless shelters, offered addiction and mental health services, or jail if they refuse, are the options on the table right now,” Leavitt said.\nLeavitt cited D.C. Criminal Code 22-1307 and Municipal Regulation 24-100 as giving the MPD the authority to disband homeless encampments, saying the local government has “completely ignored” the laws.\nNeither local code outlines a protocol for providing mental health or addiction treatment to homeless people after they have been engaged by police.\nTRUMP SAYS DC HOMELESS MUST ‘MOVE OUT IMMEDIATELY’ IN ANNOUNCING PRESS CONFERENCE\nA DOJ spokesperson referred the Washington Examiner to the MPD when asked for specifics on the plans for offering mental health and addiction treatment to homeless people.\nThe D.C. Deputy of Health and Human Services and the D.C. Department of Behavioral Health did not respond to the Washington Examiner’s request for comment."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/justice/3496167/why-trump-dc-police-takeover-is-likely-to-avoid-legal-hurdles/",
      "text": "President Donald Trump announced his plan Monday to take over law enforcement in the District of Columbia temporarily, and unlike many of his official actions, which have been stalled by lawsuits from left-wing groups, the laws he cited on Monday make it unlikely that his plan will succumb to a legal fight this time.\nTrump’s authority to combat crime in Washington by asserting federal control is clearly outlined in law, but certain time and use limitations apply, which could open the door to lawsuits down the line.\nHow Trump is taking over DC law enforcement\nTrump issued a pair of orders Monday that authorized the deployment of the D.C. National Guard and instituted federal control of the Metropolitan Police Department.\nFor the deployment of the National Guard, Trump authorized the use of the troops as commander in chief of the District of Columbia National Guard. While the commanders in chief of the National Guard in states are governors, the D.C. National Guard’s commander in chief is the president, rather than the mayor of the district.\nFor the federal takeover of the Metropolitan Police Department, the president invoked section 740 of the Home Rule Act to take emergency control of the local police department.\nThe Home Rule Act, which was passed in 1973, gave district residents more direct control over local affairs, including the creation of an elected mayor and council. The law divested some of the federal government’s direct authority in overseeing the district’s governance, but it also included a provision allowing for the president to take control of the police force if he “determines that special conditions of an emergency nature exist which require the use of the Metropolitan Police force for Federal purposes.”\nSection 740 of the Home Rule Act gives the president 48 hours of control of the Metropolitan Police Department, unless he has “notified the Chairmen and ranking minority members of the Committees on the District of Columbia of the Senate and the House of Representatives” of his intent to federalize the police force. If he gives the necessary notice to the relevant chairmen, the president may exert federal control of the MPD for 30 days before requiring an act of Congress for further extension beyond that.\nTrump issued an order declaring that “special conditions of an emergency nature exist,” requiring him to take control of the MPD on Monday morning.\nFederal takeover of DC law enforcement vs LA troop deployment\nTrump’s deployment of the National Guard to Washington has invited some comparisons to his deployment of the National Guard to quell protests that turned violent in Los Angeles in June, but there are key differences between the two deployments.\nTrump’s deployment of the National Guard in Los Angeles, which is facing a pair of legal challenges in federal court, is going to trial this week. California officials accuse the Trump administration of violating the Posse Comitatus Act, a law prohibiting troops from being used for regular law enforcement activities. The Trump administration has denied that its deployment of troops to Los Angeles violates the law, arguing the National Guard members were deployed to protect federal property and officers amid unrest over federal immigration operations in the city.\nTrump’s use of the National Guard in Washington differs from previous uses in two ways: the locations to which troops could be deployed and the force used.\nMuch of the District of Columbia is federally owned and operated property, including the National Mall, the U.S. Capitol complex, and various monuments, parks, and squares scattered throughout the city. The federal properties around the city are the responsibility of the federal government. Unlike Los Angeles, where there are few federal properties, they can be more directly policed by federal authorities.\nAnother factor that could work in Trump’s favor is that the Justice Department has recognized the D.C. National Guard for decades as having wider federal authorities for regular law enforcement than other National Guards.\nA legal opinion issued by the Justice Department under President George H.W. Bush in 1989 found that because the D.C. National Guard’s usage in the district is not being called into federal service and instead acts as a militia for the district, it is not subject to the restrictions of the Posse Comitatus Act, which bars regular law enforcement. Because the president is already the commander in chief of the D.C. National Guard, he does not need to call up troops into federal service but can activate them at the militia level.\nHave officials hinted at coming legal challenges?\nD.C. Attorney General Brian Schwalb said Monday that his office is “considering all of our options and will do what is necessary to protect the rights and safety of District residents.”\nDemocracy Forward, a left-wing law group that has launched various lawsuits against the Trump administration, also said it was “monitoring this situation and considering legal options” after Trump’s Monday announcement.\nWhile Trump’s federal takeover of the Metropolitan Police Department is authorized in the D.C. Home Rule Act, any bid to extend it beyond 30 days without congressional authorization would likely result in a lawsuit.\nMayor Muriel Bowser, at a press conference on Monday, deferred to Schwalb’s statement but also noted she would comply with the invocation of the Home Rule Act provision, giving Trump emergency control. She acknowledged that city officials could contest the emergency declaration federalizing the D.C. police force but conceded that the president’s authority “is pretty broad” under the statute.\nTRUMP FEDERALIZES DC POLICE AND ACTIVATES NATIONAL GUARD TO COMBAT CRIME: ‘TAKE OUR CAPITAL BACK’\nD.C. Councilman Charles Allen said in a statement that the president’s “unnecessary, unwarranted” and “dangerous escalation of power” was being done “simply because he can.”\nWhile the DOJ’s legal opinion on the D.C. National Guard’s deployment has stood for years, it could be tested by a lawsuit challenging the deployment. The D.C. National Guard has been deployed several times in recent years, including after the Capitol riot on Jan. 6, 2021, but the provision of the Home Rule Act, taking federal control of the MPD, has never been invoked."
    },
    {
      "url": "https://www.washingtonexaminer.com/news/crime/3497153/teens-charged-doge-staffer-attack-kept-in-custody/",
      "text": "Two juveniles charged in the attack of former Department of Government Efficiency staffer Edward Coristine will be held in custody at the District of Columbia’s Youth Services Center after a request to move them was denied.\nJudge Kendra Davis Briggs, a Biden-nominated associate judge for the D.C. Superior Court, denied the two Maryland juveniles’ requests for less restrictive detention conditions, according to the Washington Post.\nThe hearing follows the attack and carjacking targeting Coristine, 19, who goes by “Big Balls”, and Emily Bryant, his “significant other,” according to the filed police report of the incident. The carjacking occurred at 3:01 a.m. on Aug. 3 on the 1400 block of Swann Street NW.\nBriggs presided over Monday’s hearing following President Donald Trump’s press conference in which he declared a “crime emergency” in Washington, federalized the Metropolitan Police Department, and mobilized the D.C. National Guard. Trump, who has repeatedly floated threats of federalizing the capital city, amped up his rhetoric against D.C. home rule after the attack against Coristine.\n“Crime in Washington, D.C., is totally out of control,” Trump wrote in a Truth Social post on Aug. 5, which included an apparent photo of Coristine after the attack. “Local ‘youths’ and gang members, some only 14, 15, and 16-years-old, are randomly attacking, mugging, maiming, and shooting innocent Citizens, at the same time knowing that they will be almost immediately released. The most recent victim was beaten mercilessly by local thugs.”\nMetro police officers observed a group of about 10 youths who surrounded and began “assaulting” Coristine, while Bryant remained in Coristine’s vehicle parked on Swann Street, according to the police report. Coristine told officers in the report that leading up to the attack, “he saw the suspects approach and make a comment about taking the vehicle”. The police officer apprehended two suspects, whom Coristine and Bryant positively identified, while the other juveniles fled on foot.\nThe two 15-year-olds arrested by the officers appeared in court at the hearing on Monday, according to the Washington Post. The attorney for the juvenile girl requested a lesser detention level as she said there was no compelling evidence her client was one of Coristine’s attackers, though she was in the area. The attorney for the juvenile boy also requested a different detention, asking for his client to be put in a shelter house.\nDC POLICE UNION BLAMES COUNCILMAN FOR CRIME SURGE: ‘IT’S YOUR FAULT’\nThe D.C. Superior Court declined to comment on Briggs’s decision as the case is a juvenile case and therefore confidential in the D.C. Superior Court Family Court Division.\nD.C.’s Youth Services Center, where the two juveniles are reported to be held, is the district’s 88-bed youth detention center with an on-site youth education program through the Maya Angelou Academy and provides around-the-clock care for detainees, according to the D.C. Department of Youth Rehabilitation Services website."
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3497893/us-rejects-shipping-carbon-tax/",
      "text": "The United States has vehemently rejected the International Maritime Organization’s “Net-Zero Framework” proposal, established earlier this year, to reduce greenhouse gas emissions from the global shipping industry by imposing the first international carbon tax on vessels.\nSecretary of State Marco Rubio, Secretary of Commerce Howard Lutnick, Secretary of Energy Chris Wright, and Secretary of Transportation Sean Duffy released a statement Tuesday lambasting the framework, saying the administration would not accept any international agreement that would “unduly or unfairly burden” the U.S.\n“Whatever its stated goals, the proposed framework is effectively a global carbon tax on Americans levied by an unaccountable UN organization,” the statement read.\nThe secretaries claimed that the fuel standards detailed in the net-zero framework would ultimately benefit China and make it impossible to use lower-emissions options, such as liquified natural gas and biofuels, to fuel the shipping industry.\n“Under this framework, ships will have to pay fees for failing to meet unattainable fuel standards and emissions targets,” they continued. “These fees will drive up energy and transportation and leisure cruise costs. Even small vessels would incur millions of dollars in fees, directly driving up costs for American consumers.”\nMembers of the International Maritime Organization, a specialized agency within the United Nations that oversees the shipping industry, came to an agreement in April on charging shipping companies for greenhouse gas emissions released by their vessels.\nThe fee is intended to accelerate a transition to the use of cleaner fuels.\nIf ship owners exceed certain thresholds of emissions, they would face a minimum tax of $100 for every ton of carbon dioxide emitted over the lowest baseline.\nThose that exceed higher emissions thresholds will be forced to pay a $380 fee.\nIf adopted, the tax would go into effect in 2028.\nThe U.S. was notably absent from the agreement, as the Trump administration leveled threats against members who supported the fee at the time. U.S. officials reiterated those threats on Tuesday.\n“Our fellow IMO members should be on notice that we will look for their support against this action and not hesitate to retaliate or explore remedies for our citizens should this endeavor fail,” the secretaries said.\nThe international tax is expected to raise upward of $40 billion by 2030 and reduce emissions by 8% in the same time frame. The agreement did not go as far as some members had wanted, as several developing nations had hoped to see a blanket levy on the industry.\nOut of the 176 IMO member states, 63 voted in favor of the agreement in April, including China, Brazil, and the EU. Sixteen members voted against.\nThe framework could be adopted as soon as October, but it will require a two-thirds majority vote in favor.\nUN SETS CARBON TAX ON SHIPPING IN DEFIANCE OF TRUMP THREAT\nIt was not clear what type of reciprocal measures the Trump administration would impose if the framework is approved this fall. The U.S. only makes up roughly 0.57% of worldwide commercial shipping, with around 180 vessels bearing U.S. flags.\n“The Trump Administration unequivocally rejects this proposal before the IMO and will not tolerate any action that increases costs for our citizens, energy providers, shipping companies and their customers, or tourists,” the secretaries said Tuesday. “We will fight hard to protect the American people and their economic interests.”"
    }
  ],
  "argos_summary": "Former Transportation Secretary Pete Buttigieg criticized President Trump’s recent federalization of the Metropolitan Police Department in Washington, D.C., suggesting it serves as a distraction from Trump's political issues, including his ties to the Epstein case and healthcare policies. Trump’s plan includes options for homeless individuals to seek shelter or face fines and jail time, which has raised concerns about the treatment of those with mental health issues. Legal experts note that while Trump's actions are backed by the Home Rule Act, potential lawsuits could arise if he attempts to extend federal control beyond the initial 30 days.",
  "argos_id": "NJQGP0KM7"
}