{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/nvidia-chip-deal-helps-china-s-ai-goals-dave-lee-video?srnd=phx-markets",
  "authorsByline": "bn",
  "articleId": "042e4cf53f92426ca34cf7ad823921be",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ikTv2mc8MmQI/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:55:42.536000+00:00",
  "addDate": "2025-08-12T19:06:33.661980+00:00",
  "refreshDate": "2025-08-12T19:06:33.661983+00:00",
  "score": 1.0,
  "title": "Nvidia Chip Deal Helps China’s AI Goals: Dave Lee",
  "description": "Bloomberg Opinion Columnist Dave Lee says the US is giving up some of its AI advantage by letting Nvidia and AMD sell some AI chips to China. He joins Caroline Hyde and Ed Ludlow on “Bloomberg Tech.” (Source: Bloomberg)",
  "content": "We've been talking a lot about how China is urging its domestic firms, air firms, not to use Nvidia's H20 chips. This after the US agreed to revenue split for allowing AI semiconductors from NVIDIA from R & D to re-enter China. Now, Bloomberg opinion columnist Aly wrote about this yesterday about the decision by the White House and also what it would cost the US in terms of an advantage. The story moves on continually, but what was so striking about your story was, look, if there's a 50% cut taken by the US Government to allow AMD and NVIDIA to sell into China, the winners are NVIDIA, maybe less so now, but China. Why would China clearly seeming to push ahead in terms of its own semiconductor offerings? One of the things that Year 20 CHIP would allow more quickly is scale. Right. I mean, one of the things this chip is good at compared to what China's capabilities are now, is it can do more inference so it can run the applications that AI's built for. That's something that we don't think domestically they could catch up on for for a couple of years. And so this doesn't change China's aggression in trying to build its own chips as quickly as possible. But what it does do is kind of fill the interim there to allow them to start integrating AI into all aspects of of Chinese life and therefore, you know, continue to make it a global player. Question is, and where the story has moved on since I wrote those words. Is China now going to look to sort of almost stop that from happening in order to protect its domestic supply? How's it going to balance trying to make sure AI is as used as often, as much as it can in China, whilst making sure that its homegrown effort is still built upon as quickly as possible. So, Dave, on your your piece and I appreciate that a lot has changed actually in 24 hours. Just take mining carries word for it. It's been a nightmare doing this for the last 24 hours. But you actually your final point is that there are two inches here and vedere in China, but you don't say the United States is a winner if you get what I mean. You know, Trump is supposed to be the deal maker, but your conclusion seems to be actually a good deal from India. But America in aggregate, that's what I want to get from you. I mean, look, if if the concern over exporting these chips existed this time last week, I don't think the 15% revenue cut changes that calculation. It doesn't seem like a good enough change to warrant a what's essentially quite a dramatic change in national security policy. That would be my sort of overarching question here on why the US should go forward with this. I guess one of the dynamics that we're just starting to learn now is what this might mean for other parts of the trade deal between the US and China. We're hearing about rare earth metals being being a concern and there's other types of chips that could be used as leverage as well. I mean, this is becoming a hugely complex piece of negotiation between the two countries. I worry that China has a position now of sort of saying to him, video, well, look, you might have got your permission from from your masters over there in the US, but we also hold many cards as well. Unless we get more of what we want in these trade deals, then we may not allow the sale of these chips in the country and look for in video. China is a very, very important, important part of its business. It's billions of dollars revenue could be billions of dollars more. They have to write off billions of dollars when the restrictions on the h-20 were going to put in place. So I think, you know, it really matters to India to please both countries. And that to me just seems incredibly difficult at this point.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "China",
      "weight": 0.09230026
    },
    {
      "name": "Nvidia Chip Deal",
      "weight": 0.08565393
    },
    {
      "name": "chips",
      "weight": 0.06876545
    },
    {
      "name": "US",
      "weight": 0.067846075
    },
    {
      "name": "AI semiconductors",
      "weight": 0.060261033
    },
    {
      "name": "other parts",
      "weight": 0.05777632
    },
    {
      "name": "revenue split",
      "weight": 0.05568185
    },
    {
      "name": "China’s AI Goals",
      "weight": 0.054700527
    },
    {
      "name": "more inference",
      "weight": 0.054461975
    },
    {
      "name": "Bloomberg opinion columnist Aly",
      "weight": 0.05348712
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9111328125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.607421875
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.5830078125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.338623046875
    }
  ],
  "sentiment": {
    "positive": 0.21477169,
    "negative": 0.36333755,
    "neutral": 0.42189074
  },
  "summary": "The US government has agreed to a 50% revenue split for allowing AI semiconductors from NVIDIA from R & D to re-enter China, following a decision by the White House to allow AMD and NVIDIA to sell into China. This move aligns with China's ambitions to develop its own semiconductor capabilities faster than the ones currently in the US. The deal allows China to integrate AI into its own products into all aspects of Chinese life and make it a global player. However, this could potentially impact other aspects of the trade deal between the US and China, including rare earth metals and other types of chips that could potentially be used as leverage. The final question is whether the 15% revenue cut from the US will change national security policy.",
  "shortSummary": "A deal with the US to allow Nvidia's H20 chips in China boosts China's AI ambitions, despite domestic opposition and potential national security implications.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "adeb88928f574ad3b119ad2b1829397b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "China is urging its domestic firms to avoid using Nvidia's H20 chips, despite the US allowing a revenue split for AI semiconductors to re-enter China. This move raises questions about the balance between integrating AI into Chinese life and advancing its own semiconductor capabilities. The situation complicates US-China trade negotiations, as China may leverage its position to negotiate further concessions, impacting Nvidia's significant revenue potential in the region.",
  "argos_id": "O86C9YZYH"
}