{
  "url": "https://www.foxnews.com/us/new-uvalde-body-camera-video-captures-parents-pleading-officers-during-70-minute-delay",
  "authorsByline": "Greg Wehner",
  "articleId": "37c857dc8afe4626b8c0d965839cf2cb",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/uvalde-bodycam-police-footage-delay-fox-news-002.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:52:30-04:00",
  "addDate": "2025-08-13T02:08:05.469233+00:00",
  "refreshDate": "2025-08-13T02:08:05.469235+00:00",
  "score": 1.0,
  "title": "New Uvalde body camera video captures parents pleading with officers during 70-minute delay",
  "description": "Body cam video from Uvalde school shooting reveals parents pleading with officers to act. Nearly 400 law enforcement waited over 70 minutes to respond.",
  "content": "Newly released body camera video captures parents begging officers to storm Robb Elementary School in Uvalde, Texas, when a gunman killed 19 students and two teachers on May 24, 2022.The video was part of the final batch of documents local authorities withheld during a yearslong legal battle over public access, which was ultimately released this week.In July, board members of the Uvalde CISD unanimously voted in favor of releasing the records from the horrifying mass shooting at Robb Elementary, after 38 months of silence, grief and legal roadblocks.Parents could be heard on the released video begging police to storm the elementary school, minutes after the horrific mass shooting by 18-year-old gunman Salvador Ramos, marking one of the deadliest classroom attacks in U.S. history.ONE DEAD, ONE INJURED IN UNIVERSITY OF NEW MEXICO CAMPUS SHOOTING AS MANHUNT CONTINUESOne parent is heard asking, \"Whose class is he in?\" while another parent yells, \"Come on man, my daughter is in there!\"The Associated Press reported that several other videos show officers inside the building and standing outside, with some suggesting they throw gas through the window or search for a key to a locked classroom.Parents made their way toward a fence and yelled at officers to do something about the shooter.\"Either you go in or I’m going in, bro,\" an angry parent could be heard telling an officer. \"My kids are in there, bro… Please!\"UVALDE SCHOOL BOARD VOTES UNANIMOUSLY TO RELEASE ROBB ELEMENTARY SHOOTING INVESTIGATION RECORDSOfficers continued to tell the parents to get back and stand back.Videos also showed confusion among officers moments before they stormed the classroom from the school hallway that day.Along with six hours of body camera video, the documents disclosed that deputies visited Ramos’ home three months before the shooting after his mother said she was afraid of him.Body camera video released a year ago shows police officers moving through the hallways of Robb Elementary School, as well as audio from a frantic 911 call made by teachers inside the building.TEXAS BORDER PATROL SHOOTER DETAILS REMAIN SCANT AS VIOLENCE AGAINST ICE, CBP AGENTS SURGESOne of the terrified teachers who frantically dialed 911 described \"a lot, a whole lot of gunshots,\" while another sobbed into the phone as a dispatcher urged her to stay quiet.\"Hurry, hurry, hurry, hurry!\" the first teacher cried before hanging up.The delayed law enforcement response to the shooting — nearly 400 officers waited more than 70 minutes before confronting the gunman in a classroom filled with dead and wounded children and teachers — has been widely condemned as a massive failure.Just before arriving at the school, Ramos shot and wounded his grandmother at her home. He then took a pickup truck from the home and drove to Robb Elementary.The shooting has been the subject of multiple state and local investigations, which unilaterally condemned the police response.The police response included nearly 150 U.S. Border Patrol agents and 91 state police officials, as well as school and city police. While dozens of officers stood in the hallway trying to figure out what to do, students inside the classroom called 911 on cellphones, begging for help, and desperate parents who had gathered outside the building pleaded with officers to go in. A tactical team eventually entered the classroom and killed the shooter.Fox News Digital’s Christina Shaw and Anders Hagstrom, as well as The Associated Press, contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/us/dead-injured-university-new-mexico-campus-shooting",
    "https://www.foxnews.com/us/uvalde-school-board-votes-unanimously-release-robb-elementary-shooting-investigation-records",
    "https://www.foxnews.com/category/us/mass-shootings",
    "https://www.foxnews.com/politics/texas-border-patrol-shooter-details-remain-elusive-violence-against-ice-cbp-agents-surges",
    "https://www.foxnews.com/us/uvalde-shooting-independent-investigator-clears-officers-blame-sparks-outrage-from-heartbroken-parents",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/us/ex-uvalde-school-police-chief-officer-indicted-over-response-elementary-mass-shooting-reports",
    "https://www.foxnews.com/us/oxford-families-push-subpoenas-3-years-after-ethan-crumbley-killed-4-school-shooting",
    "https://www.foxnews.com/video/6376851979112",
    "https://www.foxnews.com/category/us/us-regions/southwest/texas"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "police officers",
      "weight": 0.089695
    },
    {
      "name": "Body camera video",
      "weight": 0.081442624
    },
    {
      "name": "body camera video",
      "weight": 0.081442624
    },
    {
      "name": "New Uvalde body camera video",
      "weight": 0.07984708
    },
    {
      "name": "officers",
      "weight": 0.07753424
    },
    {
      "name": "NEW MEXICO CAMPUS SHOOTING",
      "weight": 0.07271444
    },
    {
      "name": "Robb Elementary School",
      "weight": 0.07232507
    },
    {
      "name": "ROBB ELEMENTARY SHOOTING INVESTIGATION RECORDSOfficers",
      "weight": 0.07217006
    },
    {
      "name": "several other videos",
      "weight": 0.07080235
    },
    {
      "name": "Robb Elementary",
      "weight": 0.069404334
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.98291015625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9677734375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.931640625
    },
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.90771484375
    },
    {
      "name": "/News/Other",
      "score": 0.82470703125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.6875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.474853515625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.355712890625
    }
  ],
  "sentiment": {
    "positive": 0.056199726,
    "negative": 0.70742154,
    "neutral": 0.23637874
  },
  "summary": "Newly released body camera video from the May 2022 mass shooting at Robb Elementary in Uvalde, Texas, shows parents pleading with police officers during a 70-minute delay. The video was part of the final batch of documents withheld during a yearslong legal battle over public access. The incident occurred when 18-year-old gunman Salvador Ramos killed 19 students and two teachers at the school. The delayed law enforcement response to the shooting has been widely criticized as a failure. The school board unanimously voted in July to release the records, following 38 months of silence and legal hurdles. The police response included nearly 150 U.S. Border Patrol agents and 91 state police officials, as well as school and city police.",
  "shortSummary": "Newly released body camera video shows parents pleading with police for intervention during a 70-minute delay in confronting gunman Salvador Ramos at Robb Elementary School in Uvalde, Texas.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "461804b323e7445187f70b05a07cd62e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/us/oxford-families-push-subpoenas-3-years-after-ethan-crumbley-killed-4-school-shooting",
      "text": "Although the gunman who killed their children and his parents who gave him the gun are behind bars, families of the Oxford High School shooting victims say their fight for justice is far from over.\nVictims' parents gathered for the first time without their attorneys alongside members of the Oxford Board of Education, the town's chief of police, the county prosecutors office and other supportive parties to demand a full investigation into the events that led up to Ethan Crumbley's Nov. 30, 2021 attack on the Michigan school that killed four students and injured seven others, including a teacher.\n\"This is not about identifying people to prosecute – that's what the attorney general continues to get wrong on this,\" one of the gathered group said at the Monday press conference. \"While that is a part of the story, the bigger piece is to drive the chance to change the future... this is an opportunity to leverage the attack as a lesson learned.\"\nThe parents say that they are still in the dark about what could have been done differently leading up to that day and want accountability from the school district, officials and staff who they say have escaped liability over their roles in the tragedy.\nAlthough the Oxford Community Schools Board published a 590-page independent investigation carried out by Guidepost Solutions, the parents said only a third of involved parties cooperated.\n\"In certain critical areas, individuals at every level of the district... failed to provide a safe and secure environment,\" the investigation concluded.\nSchool counselor Sean Hopkins and former Dean of Students Nicholas Ejak – \"the two people with the most knowledge about the decision to allow the shooter to go back to class\" – refused to cooperate with the investigation, Guidepost wrote.\nOnly 51 of 143 current or former Oxford Community Schools employees responded to the company for interviews. Guidepost asked the district to require employees to participate, but they did not do so.\n\"How do we know what we don't know,\" said Steve St. Juliana, whose 14-year-old daughter Hana St. Juliana died in the shooting, which also claimed the lives of Tate Myre, 16; Madisyn Baldwin, 17; and Justin Shilling, 17.\nJENNIFER AND JAMES CRUMBLEY SENTENCED IN SON'S MICHIGAN SCHOOL SHOOTING\n\"What has the state done with [the Guidepost investigation]? They haven't even acknowledged it,\" another parent said. \"There's a lot already out there that needs to be turned into something, be turned into a countermeasure and turned into change.\"\nThe group wants the state of Michigan to carry out and fund this investigation, and use subpoena power to force those who refused to talk before to do so now.\nThe majority of the information the victims' parents have learned about the shooting came from the trials of James and Jennifer Crumbley, who became the first parents in the U.S. to be held criminally responsible for a mass school shooting carried out by their child.\nBoth Crumbleys were convicted of involuntary manslaughter, concluding that they were responsible for the deaths of the Michigan students because, among other things, they did not properly store the gun that their son snuck out of their house that day.\nProsecutors argued at both trials that the parents ignored indications that their son was depressed and crying out for help.\nThey said that the Crumbleys could have prevented their son's actions if they had disclosed that their son had access to a gun during a meeting at school on the morning of the shooting and brought their son home after learning during that meeting of a troubled drawing he made on a math worksheet. The drawing depicted a bleeding body, a gun and the words, \"The thoughts won't stop. Help me.\"\nEthan Crumbley is serving a life sentence without the possibility of parole after pleading guilty to all charges. He and his parents are appealing their sentences.\nHowever, the victims' parents on Monday insisted that the school was the fourth culprit in the massacre.\nNo government entity has weighed in on the Guidepost investigation or affirmed any of its findings; Michigan Attorney General Dana Nessel offered three times to review the school shooting, the Detroit Free Press reported, but the Oxford School Board rejected her offers.\nThe Oakland County Prosecutor's Office, which had representatives at Monday's meeting, gave multiple school officials confidential immunity agreements, including Hopkins and Ejak, according to the Free Press.\nCLICK HERE TO GET THE FOX NEWS APP\n\"The state [has] basic immunity unless they’re the ones pulling the trigger themselves, they’re covered, they have a union,\" one speaker said on Monday. \"Colorado changed their law after Columbine that in cases about school violence, that that immunity was not automatic. If you were grossly negligent, you could be held accountable.\"\n\"It’s quite clear, this is an epidemic that’s growing. It’s not a matter of if, it’s a matter of when this will happen again,\" another parent said. \"Even if it can’t be prevented, if we can come up with countermeasures… it’s all worth it.\"\n\"We’re infatuated at looking at the tool instead of thinking ‘Why are people feeling this way? Why are people feeling this way, where they want to do evil things?’ We’re only looking at the gun stuff.\""
    },
    {
      "url": "https://www.foxnews.com/us/dead-injured-university-new-mexico-campus-shooting",
      "text": "The alleged gunman in a fatal shooting at a University of New Mexico dormitory on Friday was taken into custody after an hours-long manhunt, New Mexico State Police confirmed.\nThe agency said John Fuentes, 18, was arrested after one person was killed and another was injured in a shooting on the Albuquerque campus. Fuentes was located and taken into custody in neighboring Valencia County without incident at around 2:30 p.m. on Friday – more than 12 hours after the shooting took place.\nHe is charged with first-degree murder, aggravated battery, aggravated assault and tampering with evidence.\nTEEN ENGINEERING STUDENT DIES AFTER 'INTENTIONAL' GUNFIRE PENETRATES FLOOR DURING PARTY\nFuentes is accused of killing a 14-year-old boy inside a dorm room in the Casas Del Rio housing complex on campus early Friday morning.\nNew Mexico State Police said campus police responded to an alarm at Mesa Vista Hall at 1:36 a.m. to find broken windows and what they believed was blood. Campus police also received a phone call from a woman stating that she had a family member on campus who heard gunshots.\nAround the same time, campus police received a call from the University of New Mexico Hospital stating a 19-year-old came in with a gunshot wound and said he had been shot on campus.\nCampus police then began sweeping the surrounding buildings, which is when they located the 14-year-old boy dead from gunshot wounds, New Mexico State Police said.\nAccording to police, Fuentes was hanging out in the room with three other people when he started firing a gun. The young teenager was struck and killed while the others, including Fuentes, ran from the room.\nTWO CHARGED IN GEORGIA COLLEGE STUDENT AND FORMER HIGH SCHOOL BEAUTY QUEEN'S MURDER\nThe investigation remains in the preliminary stages and it's unclear why Fuentes allegedly had a gun on campus and what led up to the shooting as of early Saturday morning.\nThe shooting happened as new students and their families were on campus for orientation, UNM President Garnett Stokes said in a statement.\n\"I am deeply saddened by the loss of life and horrified by this act of violence in our campus community,\" he said. \"Our thoughts and prayers go to the loved ones and friends of those lost and injured. This is certainly a difficult moment, and it’s okay to feel overwhelmed, angry, or afraid.\"\nUniversity officials temporarily closed its Albuquerque central campus and issued a shelter-in-place order.\nCLICK HERE TO GET THE FOX NEWS APP\nThe shooting remains under investigation and is being led by the New Mexico State Police Investigations Bureau.\nFox News Digital's Tessa Hoyos contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/us/uvalde-shooting-independent-investigator-clears-officers-blame-sparks-outrage-from-heartbroken-parents",
      "text": "Parents of the victims of the deadly Uvalde, Texas school shooting lashed out after results of an independent review were released that found local police officers blameless in the tragic shooting that left 19 children and two teachers dead.\nJesse Prado, an experienced investigator from the Austin, Texas area, conducted the Uvalde City Council report which investigated the Uvalde Police Department's response to the Robb Elementary School mass shooting in May 2022.\nPrado determined that none of the initial five Uvalde police officers who responded to the shooting violated policy or committed serious acts of misconduct.\nThe five Uvalde police officers were identified as Sgt. Donald Page, who was one of the first officers to discover children in other classrooms in the hallway, on-site commander Peter Arredondo, Lt. Javier Martinez, Uvalde Detective Louis Landry and Staff Sgt. Eduardo Canales.\nThe review pointed to non-comprehensive law enforcement training, faulty communication and poor equipment as responsible for the fumbled response.\n\"There were problems all day long with communication and lack of it. The officers had no way of knowing what was being planned, what was being said,\" Prado said. \"If they would have had a ballistic shield, it would have been enough to get them to the door.\"\nPrado said his review showed that officers showed \"immeasurable strength\" and \"level-headed thinking\" as they faced fire from the active shooter.\n\"They were being shot at from eight feet away from the door,\" Prado said.\nREPORT EVALUATES UVALDE SCHOOL SHOOTING RESPONSE\nPrado also said the families who rushed to the school hampered efforts to set up a chain of command as they had to navigate parents on the scene who attempted to go inside.\n\"At times they were difficult to control,\" Prado said. \"They were wanting to break through police barriers.\"\nParents, who were present at the findings of the Uvalde City Council report, erupted during Prado's comments.\n\"Cowards,\" one angered parent yelled.\nThese police officers signed up to do a job. They didn’t do it.\n\"My daughter was left for dead,\" Ruben Zamorra said. \"These police officers signed up to do a job. They didn’t do it.\"\nPolice previously said that, in total, 376 law enforcement officers descended upon the Robb Elementary School.\nA report by the Texas House of Representatives investigative committee previously said that the hoards of law enforcement officers waited 70 minutes on site, before a team breached the fourth grade classroom and confronted the 18-year-old gunman, who had been armed with an AR-15 style rifle and fired more than 140 rounds inside the school.\nUVALDE SCHOOL SHOOTING: ONE YEAR LATER\nA Department of Justice report released in January criticized the \"cascading failures\" of responding law enforcement.\nUvalde City Council member Hector Luevano said he was \"embarrassed\" and \"insulted\" by the city’s report.\nCLICK HERE TO GET THE FOX NEWS APP\n\"These families deserve more. This community deserves more,\" Luevano said. \"I don’t accept this report.\""
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/southwest/texas",
      "text": "Crime 43 mins ago New Uvalde body camera video captures parents pleading with officers during 70-minute delay Body cam video from Uvalde school shooting reveals parents pleading with officers to act. Nearly 400 law enforcement waited over 70 minutes to respond.\nTexas 3 hours ago Texas Dems begin to crack, confirm return to state after fleeing to obstruct GOP redistricting: report Texas House Democrats plan to return to the state after fleeing to block GOP redistricting efforts, local Texas media has confirmed.\nTexas 4 hours ago Texas state Senate passes new Republican drawn congressional map as House Dems remain on the lam Texas Senate approves Republican-drawn redistricting maps in 19-2 vote as nine Democrats walk out in protest while House Democrats remain out of state.\nTexas 4 hours ago Austin man charged with capital murder after deadly Target parking lot shooting spree Ethan Nieneker faces capital murder charges for allegedly shooting three people, including a 4-year-old girl, during a carjacking at an Austin Target store.\nTexas 4 hours ago Smoke pours from train derailment in Palo Pinto County, Texas Union Pacific train derailment involving 35 cars occurred 2 miles east of Gordon, Texas on Monday with emergency crews containing a grass fire at the scene.\nPolitics 11 hours ago Texas GOP seeks to ‘domesticate’ rogue Dems for breaking quorum through nationwide civil arrest warrants Texas GOP officials are seeking to enforce civil arrest warrants across state lines for the House Democrats who fled to prevent a Republican redistricting vote.\nImmigration 12 hours ago ICE Houston arrests more than 350 gang members -- and it's not just MS-13 In Trump’s first six months back in office, ICE Houston has arrested more than 350 illegal migrants tied to over 40 gangs — including violent street crews like MS-13 and Tren de Aragua.\nVIDEO 1 day ago McCarthy calls out Dems for being against redistricting, despite doing the same thing last cycle Former House Speaker Kevin McCarthy weighs in on Texas Democrats fleeing the state to avoid voting on redistricting on 'The Ingraham Angle.'\nTexas 1 day ago Gov. Abbot still beat Newsom in disaster relief despite Texas Democrats stalling, hiding out Despite Democratic lawmakers fleeing and holding up vital relief efforts, Texas Governor Abbott’s flood relief was faster than California Governor Gavin Newsom’s response to the L.A. wildfires.\nOpinion 1 day ago Texas gerrymandering battle doesn’t matter to voters. They lose either way Texas gerrymandering fight exemplifies why 78% of Americans believe political elites play by different rules while ignoring kitchen-table issues\nImmigration 2 days ago Trump border wall materials sold by Biden may soon find their way back to the feds, auctioneer claims Border wall materials once sold for pennies on the dollar will be returned to government at-cost through deal between GovPlanet and Trump's border czar office.\nOpinion 2 days ago DAVID MARCUS: Democrat New England is the most gerrymandered region in American history New England Democrats hold all 21 House seats across six states through gerrymandering while criticizing Texas Republicans for similar redistricting practices\nPolitics 2 days ago Abbott vows indefinite special sessions, says fleeing Dems could face arrest ‘for literally years’ Governor Greg Abbott warned Texas Democrats will face arrest upon returning amid the redistricting standoff, vows to order continuous special sessions.\nTexas 2 days ago WATCH: Texas state senator argues redistricting showdown could decide balance of power in future US Congress Texas state GOP Sen. Mayes Middleton argues Republican redistricting efforts in his state could be pivotal for Republicans to maintain control in Congress during mid-terms.\nVIDEO 3 days ago Texas reopens the gerrymander wars Democrats vow to retaliate with new maps of their own\nTexas 3 days ago Democratic strategist says party lacks 'moral authority' on Texas redistricting fight Texas redistricting battle intensifies as Republicans push for five new seats and California considers emergency measures to counteract Republican gains.\nTexas 3 days ago Owner of Trump-themed burger chain faces deportation after feds allege illegal status, 'sham' marriages Lebanese restaurateur Roland Beainy, the co-owner of a Trump-branded burger chain in Texas, is facing deportation for visa violations, according to ICE.\nGavin Newsom 3 days ago California launches redistricting fight to ‘nullify’ Texas GOP plan, with Dems poised to gain 5 seats California Gov. Gavin Newsom announced Friday that the Golden State will move forward with a special election in early November to place its own redistricting plan on a ballot measure before voters.\nOpinion 3 days ago Networks pounce on Republican redistricting. They didn’t care when Democrats did it Texas Democrats travel to blue states to block redistricting quorum as networks demonstrate double standard in covering Republican versus Democratic gerrymandering\nOpinion 3 days ago Trump sends military after the cartels and it’s long overdue U.S. military deployment targets Mexican cartels as DHS reports reveal corrupt military and law enforcement crossing border to assist drug trafficking organizations\nTexas 3 days ago Lone Star State rivals for US Senate compete to wrangle runaway Democrats Ken Paxton is challenging John Cornyn in a 2026 Texas Senate race, and a super PAC highlights the attorney general's role in a redistricting battle with fleeing Democrats.\nBeto O'Rourke 4 days ago Judge blocks Beto O'Rourke from funding Texas Dems who fled to stop GOP redistricting vote A Texas judge issued a temporary restraining order against Beto O’Rourke’s nonprofit after the state AG accused him of unlawfully fundraising for Democrats who fled to block GOP bills.\nVIDEO 4 days ago WATCH: Republican Texas state senator says new congressional redistricting bill could 'save America' GOP Texas state Senator Mayes Middleton discusses why he thinks Texas' redistricting effort could 'save America' and why Democrats' attempted challenges are 'meritless.'\nVIDEO 4 days ago Jesse Watters: Republicans are finally 'playing hardball' with direct deposit 'The Five' discusses Texas Democrats blowing off the deadline to return and debate the state's redistricted map.\nPolitics 4 days ago Crockett blames race for 'diva' label, says attacks prove she's 'arrived' Democratic Rep. Jasmine Crockett is firing back at her critics after a New York Post report citing former staffers accused her of creating a hostile work environment.\nTexas 4 days ago Texas AG investigates Beto O’Rourke PAC over support for quorum-breaking lawmakers Attorney General Ken Paxton examines PAC connected to Beto O'Rourke for allegedly assisting Texas Democrats who abandoned legislative duties during redistricting fight.\nTexas 4 days ago Party of 'crazies': Dems comply with outrageous redistricting stunts due to primary threats, state rep says Texas Democrats continue exodus to liberal states over GOP redistricting as Republicans launch bribery investigations and President Donald Trump supports the redistricting push.\nPolitics 4 days ago Texas asks Illinois court to enforce arrest warrants for Democratic lawmakers Texas pursues legal action to enlist Illinois assistance in apprehending Texas state Democratic lawmakers hunkered down in the Prairie State.\nU.S. 4 days ago Ghislaine Maxwell prison transfer called 'highly unusual' by former federal prison official A former assistant director at the Federal Bureau of Prisons says that Ghislaine Maxwell moving to a minimum security prison camp is \"highly unusual.\"\nVIDEO 5 days ago Katie Pavlich warns Mamdani could give the Left 'breath of life' Fox News contributor Katie Pavlich, Stagwell Inc. CEO Mark Penn and Hoover Institution senior fellow Victor Davis Hanson dissect the Democratic Party's 'radical' socialist movement on 'Hannity.'"
    },
    {
      "url": "https://www.foxnews.com/category/us/mass-shootings",
      "text": "In the United States, Mass shootings are widely classified as incidents in which a shooter kills at least four or more victims. The rise of mass shootings has been closely associated with calls for more regulations on firearms through the state and federal governments. In general, mass shootings are now classified in news media as events where a shooter kills a large group of individuals.\nSome mass shootings may involve gang violence, domestic violence, or terrorist acts. Several data centers and media outlets label the United States as the country with the most mass shootings annually in the world. However, mass shootings account for a small portion of the annual homicides, crimes, and deaths in the country. According to Mother Jones, between 1982 and 2022, the United States had on record 133 mass shootings, with most of those shootings occurring during the early 2000s and the present.\nThe deadliest mass shooting occurred on October 1, 2017, when 64-year-old Stephen Paddock opened fire on a crowd from his hotel room on the Las Vegas Strip in Nevada, killing 59 individuals and injuring 867 others. In the aftermath of the shooting, the US Justice Department under former President Donald Trump banned bump stocks; however, the action is still under review by the Supreme Court."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/us/uvalde-school-board-votes-unanimously-release-robb-elementary-shooting-investigation-records",
      "text": "Following 38 months of silence, legal roadblocks and grief, the board members of Uvalde CISD unanimously voted in favor of releasing the records from the horrifying mass shooting at Robb Elementary.\nThe board’s vote follows a recent decision by the Fourth Court of Appeals ruling in favor of several news outlets that have requested both school and county records regarding the widely criticized response from law enforcement during the 2022 massacre that claimed the lives of 19 children and two teachers.\nRonald Garza, the county commissioner, demanded that the board drop the appeal and release the records, calling the court ruling a victory for the families during the open forum.\nUVALDE SCHOOL SHOOTER’S UNCLE TRIED TO INTERVENE, BUT HIS CALL CAME 10 MINUTES AFTER GUNMAN WAS DEAD\n\"These attorneys representing UCISD and Uvalde County ultimately work for the taxpayers... the more this goes on, the more expense the taxpayers are incurring,\" Garza said.\nThe board reached a decision after approximately 50 minutes in a closed-door session where they heard from the public.\nThe vote comes after a lengthy period of legal resistance and appeals amidst the ongoing investigations.\nFamilies of the victims in attendance said that the moment was a long-overdue step toward healing.\n\"For over three years, families like mine have lived with unbearable pain, unanswered questions, and a silence that feels like yet another betrayal,\" said Gloria Cazares, mother of 9-year-old Jackie Cazares.\n\"It’s about making sure what happens to my daughter never happens to another child,\" Cazares said. \"I’m here today to demand the truth. You all owe it to Jackie, to her classmates, to her teachers.\"\nUVALDE MASS SHOOTING VICTIMS' FAMILIES SUING META, GUN MANUFACTURER AND VIDEO GAME MAKER\nThe board collectively apologized, and several members expressed remorse for their prior inaction, showing institutional change, not just compliance.\nErica Muñoz stated her reason for joining the board was the need to rebuild trust through transparency and compassion.\nCLICK HERE TO GET THE FOX NEWS APP\nBerinda Areola urged that their healing starts when the records are released.\n\"There’s nothing in those records that can hurt us more than the pain we’ve already endured,\" said Areola.\nBoard Secretary Jesse Rizo, who lost a niece in the tragedy, apologized during the meeting, saying, \"I’m sorry it took so long. I’m sorry we failed you.\""
    },
    {
      "url": "https://www.foxnews.com/us/ex-uvalde-school-police-chief-officer-indicted-over-response-elementary-mass-shooting-reports",
      "text": "The former police chief of Uvalde schools and another former officer were indicted for their response to the 2022 mass shooting at a Texas elementary school that left 19 children and two teachers dead, according to multiple reports on Thursday.\nA grand jury indicted former schools police Chief Pete Arredondo and former officer Adrian Gonzales on multiple counts of felony child endangerment, per reporting from the Uvalde Leader-News and the San Antonio Express-News.\nThe indictments would make Arredondo and Gonzales the first officers to face criminal charges in one of the deadliest shootings in U.S. history.\nFox News Digital has reached out to the Texas Department of Public Safety for comment.\nFBI REPORT REVEALS WHAT MOST ACTIVE SHOOTER SITUATIONS HAVE IN COMMON\nA scathing report by Texas lawmakers that examined the police response described Gonzales as one of the first officers to enter the building after the shooting began.\nThe indictments come more than two years after an 18-year-old gunman opened fire in a fourth grade classroom, where he remained for over an hour before officers confronted and killed him.\nIn total, nearly 400 law enforcement officers responded to Robb Elementary School on May 24, 2022, some waiting in the hallway outside the classroom, even as the gunman could be heard firing an AR-15-style rifle inside.\nArredondo lost his job three months later. Several officers involved were eventually fired, and separate investigations by the Department of Justice and state lawmakers faulted law enforcement with botching their response to the massacre.\nCLICK HERE TO GET THE FOX NEWS APP\nThe DOJ released a 600-page report earlier this year that cataloged what it described as \"cascading failures\" in training, communication, leadership and technology problems that day.\nThe Associated Press contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/politics/texas-border-patrol-shooter-details-remain-elusive-violence-against-ice-cbp-agents-surges",
      "text": "Details about the shooter who opened fire on Border Patrol agents at an annex in McAllen, Texas, Monday remain scant days later as assaults against federal immigration officials are on the rise.\nAuthorities identified Ryan Louis Mosqueda, 27, as the suspect Monday, confirming Mosqueda was killed at the scene.\n\"Both Border Patrol agents and local police helped neutralize the shooter,\" a Department of Homeland Security spokesperson said Monday. \"Two officers and a Border Patrol employee were injured, including one shot in the knee. All three have gone to the hospital. This is an ongoing investigation led by the FBI.\"\nSHOOTER WHO OPENED FIRE ON BORDER PATROL AGENTS IN SOUTH TEXAS IDENTIFIED BY POLICE CHIEF\nBut the motive of the shooter still remains unknown, and McAllen, Texas, Police Chief Victor Rodriguez did not have any additional information to share with reporters during a news conference Monday about why Mosqueda opened fire on the agents. .\nRodriguez said the gunman fired off \"many dozens\" of rounds at Customs and Border Protection's McAllen, Texas, station. Mosqueda is affiliated with a Michigan address, and his car had Michigan license plates.\nHowever, Rodriguez said Mosqueda was reported missing from an address in Weslaco, Texas, less than 20 miles away, and that \"an hour and a few minutes later he was at this particular location, opening fire on a federal building.\"\nMosqueda's brother, Joe, told Detroit's WDIV Local he'd never witnessed his brother speak about immigration issues or Immigration and Customs Enforcement (ICE) but said he suspected he was dealing with undiagnosed mental health challenges.\n\"Out of the blue,\" Joe Mosqueda told the outlet. \"I don’t know if he was intentionally targeting, I don’t know. I believe it was mental health issues.\"\nJoe Mosqueda or other family members could not be immediately reached for comment by email or phone calls by Fox News Digital.\nThe FBI and the Department of Homeland Security did not respond to a request for comment from Fox News Digital.\nThe Department of Homeland Security reported earlier in July that assaults against ICE officers and other federal immigration agents have risen nearly 700% compared to 2024. While the agency reported 10 assault incidents between Jan. 1, 2024, and June 30, 2024, that number rose to 79 reported assaults in the same time frame in 2025.\nOther recent episodes of violence against law enforcement include another shooting near ICE's Prairieland Detention Facility Friday, where a Texas police officer was shot in the neck. The Justice Department announced Tuesday that 10 individuals face charges in the shooting.\nThe White House has urged Democrats to scale back language toward federal immigration officials after the shooting and other similar instances of violence.\n\"We certainly call on Democrats to tone down their rhetoric against ICE and Border Patrol agents, who, again, are everyday men and women,\" White House press secretary Karoline Leavitt told reporters Monday.\n\"These are honorable Americans who are just simply trying to do their job to enforce the law. They go home to their families every night, just like we all do, and they deserve respect and dignity for trying to enforce our nation's immigration laws and to remove public safety threats from our communities.\"\nLawmakers, including Rep. Pramila Jayapal, D-Wash., have issued harsh statements about ICE in recent weeks. Jayapal accused ICE of acting \"like a terrorist force\" in June and defended her comments in a July 2 interview with CNN after the White House demanded an apology from the lawmaker.\nTRUMP'S 'BIG, BEAUTIFUL BILL' BOLSTERS BORDER SECURITY BY $100 BILLION\nRep. Michael Guest, R-Miss., who oversees the House Homeland Security committee’s subcommittee on border security and enforcement, said in a statement Wednesday to Fox News Digital that \"radical anti-law enforcement rhetoric\" has prompted the uptick in crime against federal immigration officials.\nCLICK HERE TO GET THE FOX NEWS APP\n\"This dangerous rhetoric from the far left jeopardizes the safety of our men and women in green. Violence against law enforcement will not be tolerated,\" Guest said. \"The Committee on Homeland Security is in close contact with DHS concerning this attack on our law enforcement, and we will support the FBI’s investigation into the individual responsible and their motives.\"\nFox News’ Peter Pinedo contributed to this report."
    }
  ],
  "argos_summary": "Newly released body camera footage from the Uvalde school shooting shows parents pleading with police to intervene as the gunman killed 19 students and two teachers. The footage was part of records released after a lengthy legal battle, revealing the chaotic response of law enforcement, who waited over 70 minutes before confronting the shooter. In a separate case, parents of victims from the Oxford High School shooting are demanding accountability from school officials, citing failures in safety measures leading up to the tragedy.",
  "argos_id": "OZYIEOIOC"
}