{
  "url": "https://www.investors.com/news/technology/life360-stock-surges-after-q2-outperformance/?src=A00220&yptr=yahoo",
  "authorsByline": "Investor's Business Daily",
  "articleId": "61309ab9bab84bc8bc38b5cb51e88dcf",
  "source": {
    "domain": "investors.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://www.investors.com/wp-content/uploads/2025/08/Stock-Life360-TileDevice-copmany.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T17:38:59+00:00",
  "addDate": "2025-08-12T17:50:54.373648+00:00",
  "refreshDate": "2025-08-12T17:50:54.373649+00:00",
  "score": 1.0,
  "title": "Family Safety Stock Life360 Surges As Parents Seek Peace Of Mind",
  "description": "Life360 stock jumped Tuesday after the family-tracking service reported better-than-expected second-quarter results late Monday.",
  "content": "Life360 (LIF) is seeing robust growth as the family-tracking service sells to parents seeking peace of mind. Life360 stock jumped Tuesday after the company's second-quarter report.\n\nThe San Mateo, Calif.-based company earned an adjusted 26 cents a share on revenue of $115.4 million in the June quarter. Analysts had expected adjusted earnings of 13 cents a share on sales of $110.3 million in the period. In the year-earlier period, it earned a penny a share on sales of $84.9 million, FactSet said.\n\nIn afternoon trades on the stock market today, Life360 stock jumped more than 11% to 82.32. Earlier in the session, it notched a record high 84.02.\n\nLife360 provides technology for tracking family members, pets and valuables. It sells small tracking devices than can be attached to key chains, backpacks and other items or slid into school IDs, passports, wallets and other thin spaces.\n\nLife360 finished the second quarter with 88 million monthly active users, up 25% year over year. Plus, it recorded 2.5 million paying users, also up 25%.\n\nLife360's new Chief Executive, Lauren Antonoff, told Investor's Business Daily that she intends to continue the company's central mission and grow and monetize its user base.\n\n\"Our job is to help members keep close to the ones they love and to keep the people, pets and things they love safe and connected,\" she said. \"So were going to find more ways to create member value and grow the company.\"\n\nLife360 allows users to know where their family members are and provides alerts for car accidents, severe weather and other situations.\n\nLife360 plans to expand its product line with a GPS-enabled pet tracker in time for the holiday season.\n\nAlso, Life360 is looking to monetize its free users by providing location-based advertising. It already started this initiative by inking a deal with ride-hailing service Uber (UBER).\n\n\"We see ourselves as becoming the family super app,\" Antonoff said.\n\nAt least five Wall Street analysts raised their price targets on Life360 stock after the company's Q2 report.\n\nEvercore ISI analyst Mark Mahaney reiterated his outperform rating on Life360 stock and raised his price target to 95 from 55.\n\n\"We view Life360 as an established leader in the family- and location-tracking space and a fundamentally attractive asset with a profitable business model,\" Mahaney said in a client note Tuesday.\n\nHe added, \"We believe Life360 has a multiyear lead vs. competitors, while the biggest risk is the potential for large and well-capitalized competitors to enter the space.\"\n\nOne competitor is Apple (AAPL) with its AirTags devices and FindMy app.\n\n\"What makes us different is our focus on family,\" Antonoff said. \"Apple's job is to find your devices. Our job is to keep your family safe and connected. I think we have different jobs, and we each do our job very well.\"\n\nLife360 Stock Is On Four IBD Lists\n\nOn a conference call with analysts, Life360 cofounder and Executive Chairman Christopher Hulls said the company's positive results reflect a cultural movement.\n\n\"Today, peace of mind isn't a luxury; it's essential,\" Hulls said. \"Families are budgeting for it, just like Wi-Fi or electricity. And that shift is fueling durable, values-driven growth.\"\n\nLife360 stock is on four IBD lists: IBD 50, IPO Leaders, Stock Spotlight and Tech Leaders.\n\nFollow Patrick Seitz on X at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks.\n\nYOU MAY ALSO LIKE:\n\nJoin IBD Live For Stock Ideas Each Morning Before The Open",
  "medium": "Article",
  "links": [
    "https://research.investors.com/stock-lists/ipo-leaders/",
    "https://www.investors.com/news/technology/life360-stock-lif-q2-2025-earnings/",
    "https://www.investors.com/news/stock-market-today-stock-market-news/",
    "https://research.investors.com/stock-lists/stock-spotlight",
    "https://research.investors.com/stock-lists/ibd-50/",
    "https://www.investors.com/news/technology/arlo-stock-leaps-as-home-security-camera-firm-beats-views/",
    "https://research.investors.com/quote.aspx?symbol=AAPL",
    "https://shop.investors.com/offer/splashresponsive.aspx?id=IBD-Live&intcode=invstcntnartcls%7Ccms%7Cibdlive%7C2020%7C07%7Cibdlive%7Cna%7C%7C727112&src=A00433A",
    "https://get.investors.com/marketsurge/?src=apa1bq",
    "https://research.investors.com/quote.aspx?symbol=LIF",
    "https://research.investors.com/quote.aspx?symbol=UBER",
    "https://www.investors.com/data-tables/ibd-tech-leaders-aug-11-2025/",
    "https://www.investors.com/news/technology/adobe-stock-downgraded-ai-is-eating-software/",
    "https://x.com/IBD_PSeitz",
    "https://www.investors.com/news/technology/micron-stock-memory-chip-maker-ups-outlook/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Life360 Stock",
      "weight": 0.10615939
    },
    {
      "name": "Life360 stock",
      "weight": 0.10615939
    },
    {
      "name": "Life360",
      "weight": 0.08830179
    },
    {
      "name": "Family Safety Stock",
      "weight": 0.08646115
    },
    {
      "name": "family members",
      "weight": 0.08046842
    },
    {
      "name": "Stock Ideas",
      "weight": 0.07123324
    },
    {
      "name": "Families",
      "weight": 0.06708546
    },
    {
      "name": "family",
      "weight": 0.06708546
    },
    {
      "name": "member value",
      "weight": 0.06183623
    },
    {
      "name": "other thin spaces",
      "weight": 0.060218275
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95068359375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91943359375
    }
  ],
  "sentiment": {
    "positive": 0.8492345,
    "negative": 0.030963589,
    "neutral": 0.11980188
  },
  "summary": "Life360 (LIF) is seeing significant growth as the company sells to parents seeking peace of mind. The company earned an adjusted 26 cents a share on revenue of $115.4 million in the June quarter, beating analysts' expectations of $110.3 million. Life360, which provides technology for tracking family members, pets and valuables, finished the second quarter with 88 million monthly active users, up 25% year over year, and 2.5 million paying users, also up 25%. The company plans to expand its product line with a GPS-enabled pet tracker in time for the holiday season and monetize its free users through location-based advertising. At least five Wall Street analysts have raised their price targets on Life360 stock.",
  "shortSummary": "Life360's stock surged over 11% after reporting strong growth, focusing on family tracking and monetizing, with multiple analyst upgrades and strong growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e65e5965ec074d09941c95ada2dde2d3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.investors.com/news/technology/adobe-stock-downgraded-ai-is-eating-software/",
      "text": "A Wall Street analyst on Monday downgraded Adobe (ADBE) stock to sell from hold as the digital media software firm is seen losing ground amid the disruption caused by artificial intelligence technology.\nMelius Research analyst Ben Reitzes turned negative from neutral on Adobe stock and cut his price target to 310 from 400.\nOn the stock market today, Adobe stock sank 2.2% to close at 333.65.\n\"The world is coming around to the reality that 'AI is eating software,'\" Reitzes said in a client note. Software-as-a-service companies are in the \"early innings\" of multiple contraction given the shift to AI, he said.\n\"Former darlings like Adobe, Atlassian and Salesforce are all down more than 20% year to date and still going,\" he said. \"It is still worth highlighting since it could actually get worse.\"\nThe worst is potentially yet to come for SaaS players like Adobe, Salesforce (CRM) and Workday (WDAY), he said. Value is shifting to \"infrastructure winners\" like Microsoft (MSFT) and Oracle (ORCL), he said.\nReitzes cut his sales and earnings estimates for Adobe for 2026 and 2027.\nAdobe Stock Has Weak Composite Rating\n\"AI is making it clear that almost anyone from an able-bodied startup to a big cloud (like Google) can create an application so great that it can compete quickly and potently,\" he said.\nHe noted the rise of Adobe rivals Figma (FIG), Canva and Runway.\n\"Our main concern right now is whether Adobe's recent price increases will accelerate moves toward AI-first alternatives,\" Reitzes said.\nAdobe stock has an IBD Composite Rating of 56 out of 99, according to IBD Stock Checkup. IBD's Composite Rating is a blend of key fundamental and technical metrics to help investors gauge a stock's strengths. The best growth stocks have a Composite Rating of 90 or better.\nFollow Patrick Seitz on X at @IBD_PSeitz for more stories on consumer technology, software and semiconductor stocks.\nYOU MAY ALSO LIKE:\nArlo Stock Leaps As Home Security Camera Firm Beats Views\nApple Stock Retakes Key Level After Dodging Tariff Bullet\nOuster Is Laser-Focused On Being The Eyes Of Physical AI. CEO Touts Lidar's Expanding Reach.\nFind Winning Stocks With MarketSurge Pattern Recognition & Custom Screens"
    },
    {
      "url": "https://shop.investors.com/offer/splashresponsive.aspx?id=IBD-Live&intcode=invstcntnartcls%7Ccms%7Cibdlive%7C2020%7C07%7Cibdlive%7Cna%7C%7C727112&src=A00433A",
      "text": "Get actionable trade ideas straight from the experts.\nNo obligation. After the 3 month trial, your IBD Live® subscription will auto-renew at the regular monthly rate as follows:\nIBD Member Rate: $69/month\nNon-Member Rate: $99.95/month\nGet actionable trade ideas straight from the experts.\nIBD Live is an interactive broadcast where our stock pickers, analysts and portfolio managers watch the market action and discuss the day’s top trade ideas. Listen to their conversations, see their screens and ask them questions—all in real time!\nIBD Live is an interactive broadcast where our stock pickers, analysts and portfolio managers watch the market action and discuss the day’s top trade ideas. Listen to their conversations, see their screens and ask them questions—all in real time!\nGet new trade ideas, research and analysis every day.\nWith IBD Live, you get professional market analysis from a team with decades of experience. Our experts do the research for you and give you actionable trade ideas backed by technical and fundamental analysis. Our team will even answer your questions during the live broadcast!\nWatch IBD’s experts pick winning stocks in real time.\nIBD Live gives you the experience of being in the room with professional market analysts every trading day. You’ll get a first look at the day’s potential breakouts before the opening bell rings, then get real-time reactions to the first hour of trading.\nNo obligation. After the 3 month trial, your IBD® Live subscription will auto-renew at the regular monthly rate as follows:\nIBD Member Rate: $69/month\nNon-Member Rate: $99.95/month\nIBD Live Reviews\nKelly C\n“I have learned more about the logistics of trading on IBD Live in the last 3 weeks than I have in the last 20 years.”\nDavid A\n“IBD Live is extremely valuable for both beginners and long-term investors.”\nMarvin S\n“IBD Live gives you that edge and confidence you need.”\nChoose your IBD Live Plan:\nSelect a plan based on whether you are an existing IBD customer or a new subscriber.\nIBD Member\nNon-Members\nIBD Member Rate Non-Member Rate\n$9.95\nfor your first 3 months\n$69/month $99.95/month\nthereafter.\nMust be a subscriber of IBD Digital, Leaderboard, SwingTrader or MarketSurge.\nAfter the 3-month trial, your IBD Live subscription will auto-renew at the regular monthly rate of $99.95/month.$69/month.\nFeatures\n- A 50% discount on IBD Live once your trial ends\n- Access to the live 90-minute broadcast every weekday\n- Live Q&A with the IBD Live team during the show\n- Recent episodes streaming on demand\n- Daily recap emails from the team\n- Special guest episodes every week\n- Access to the team’s curated stock watchlists\nNo obligation. After the 3 month trial, your IBD Live subscription will auto-renew at the regular monthly rate as follows:\nIBD Member Rate: $69/month |\nNon-Member Rate: $99.95/month\nMeet the IBD Live Team\nChris Gessel\nChief Content Officer\nInvestor’s Business Daily\n@IBD_CGessel\nDavid Saito-Chung\nDeputy Markets Editor\nInvestor's Business Daily\n@IBD_DChung\nAlissa Coram\nMultimedia Content Editor\nInvestor’s Business Daily\n@AlissaCoram\nJustin Nielsen\nMarket Research Director\nInvestor’s Business Daily\n@IBD_JNielsen\nKen Shreve\nSenior Markets Writer\nInvestor’s Business Daily\n@IBD_KShreve\nEd Carson\nNews Editor\nInvestor’s Business Daily\n@IBD_ECarson\nRachel Fox\nMarkets Writer\nInvestor’s Business Daily\n@foxonstocks\nScott St. Clair\nSenior Product Coach\nMarketSurge\n@Zeninthemarkets\nHarold Morris\nProduct Coach\nLeaderboard and MarketSurge\nDavid Ryan\n3-Time U.S. Investing Champion\n@dryan310\nChris Gessel\nChief Content Officer\nInvestor’s Business Daily\n@IBD_CGessel\nDavid Saito-Chung\nDeputy Markets Editor\nInvestor's Business Daily\n@IBD_DChung\nAlissa Coram\nMultimedia Content Editor\nInvestor’s Business Daily\n@AlissaCoram\nJustin Nielsen\nMarket Research Director\nInvestor’s Business Daily\n@IBD_JNielsen\nKen Shreve\nSenior Markets Writer\nInvestor’s Business Daily\n@IBD_KShreve\nEd Carson\nNews Editor\nInvestor’s Business Daily\n@IBD_ECarson\nRachel Fox\nMarkets Writer\nInvestor’s Business Daily\n@foxonstocks\nScott St. Clair\nSenior Product Coach\nMarketSurge\n@Zeninthemarkets\nHarold Morris\nProduct Coach\nLeaderboard and MarketSurge\nDavid Ryan\n3-Time U.S. Investing Champion\n@dryan310\nEpisode Highlights\nThese videos are short highlighted clips. IBD Live episodes are 90 minutes daily.\nMark Minervini: Why It's Time To Get Ready For An 'Explosive Period' In The Market\nIt could soon be time for traders to press the gas pedal aggressively if certain conditions are met, says trading expert Mark Minervini.\nHow To Handle 'Gigantic' Earnings Season That Means Everything To The Market Rally\nThis earnings season could be \"gigantic\" for the stock market rally, says hedge fund manager Jim Roppel. The Roppel Report founder discusses why he plans on holding his full stock positions into their quarterly reports.\nAssessing The Positive Buried In Negative Market Sentiment\nDon't let the Fed's aggressive rate hike cycle and market fears weigh you down, take a look at the sunnier side of the markets. Charles Harris, Portfolio Manager at O'Neil Global Advisors gives \"IBD Live\" the contrarian view.\nLoad More\nThe Stock Market Is At A Key Inflection Point. Microsoft's Chart Shows Why.\nJohn Kosar of Asbury Research tells \"IBD Live\" why the chart action of index heavyweight Microsoft (MSFT) shows the stock market is at a critical juncture right now.\nJoe Fahmy: Riding The Wave Of AI Stocks\nThe market might be in the early stages of a new bull cycle, even as Fed rate fears linger. Driving the market: a surge of interest in AI stocks and artificial intelligence applications.\nHow To Focus On Stock Setups Over Index Action: Mark Ritchie II\nMark Ritchie II of Minervini Private Access joined IBD Live for a discussion about win rate, trading in different environments and why it's important to focus on individual stock setups more than index-level action.\nMeet the IBD Live Team\nChris Gessel\nChief Content Officer\nInvestor’s Business Daily\n@IBD_CGessel\nJustin Nielsen\nMarket Research Director\nInvestor’s Business Daily\n@IBD_JNielsen\nAlissa Coram\nMultimedia Content Editor\nInvestor’s Business Daily\n@AlissaCoram\nDavid Saito-Chung\nDeputy Markets Editor\nInvestor's Business Daily\n@IBD_DChung\nKen Shreve\nSenior Markets Writer\nInvestor’s Business Daily\n@IBD_KShreve\nRachel Fox\nMarkets Writer\nInvestor’s Business Daily\n@foxonstocks\nEd Carson\nNews Editor\nInvestor’s Business Daily\n@IBD_ECarson\nScott St. Clair\nSenior Product Coach\nMarketSurge\n@Zeninthemarkets\nHarold Morris\nProduct Coach\nLeaderboard and MarketSurge\nDavid Ryan\n3-Time U.S. Investing Champion\n@dryan310\nWatch Video\nFrequently Asked Questions\nIBD Live is a real-time streaming video broadcast where IBD’s investing experts guide you through the market open and the first hour of trading. This innovative video broadcast lets you watch our team of market writers, analysts and portfolio managers as they identify and analyze leading stocks. Not only will you see and hear the IBD Live team, but you’ll also see exactly what’s on their computer screens!\nOur experts believe that the first hour of market action sets the stage for the rest of the trading day. That’s why IBD Live begins broadcasting every trading day at 9:20am ET (6:20am PT), 10 minutes before the opening bell. The live streaming ends around 10:30am ET (7:30am PT).\nYou can watch a week’s worth of recent episodes at your convenience. The shows will be added to the IBD Live archives shortly after the live broadcast concludes.\nGo to investors.com/IBDLive and log in with your investors.com account. The first time you watch IBD Live, you’ll be automatically prompted to install the Zoom client (this enables seamless video streaming between our computers and yours). The installation takes a minute or two and you’ll only have to do it once.\nIBD Member Rate: $49.95/month (Save 50%)\nNon-Member Rate: $99.95/month\nFor $99.95/month, you get unlimited access to IBD Live broadcasts and recent shows. If you’re a subscriber to an IBD premium product like IBD Digital, Leaderboard, SwingTrader or MarketSurge, then you can add IBD Live to your membership for only $49.95/month.\nYes, you can cancel at any time.\nTrade live with the pros.\nIBD Live is an interactive broadcast where our team of stock pickers, analysts and portfolio managers watch the market action and discuss their top trade ideas. They analyze charts, share their screens and answer questions from the audience—all in real time.\nWatch IBD’s experts pick winning stocks in real time\nStart your trading day with us\nIBD Live gives you the experience of being in the room with professional traders every day. You’ll get a first look at the day’s potential breakouts before the opening bell rings, then get real-time reactions to the first 90 minutes of trading.\nGet new trade ideas and analysis every day\nWith IBD Live, you get professional market analysis from a team with decades of experience. Our experts do the research and give you actionable trade ideas backed by technical and fundamental analysis.\nGet your investing questions answered live\nOne of the best perks of being an IBD Live member is the ability to ask questions and chat with the team during the live broadcast. The IBD Live panelists love interacting with members and creating a community of dedicated investors who want to take on the market together.\nAccess to our experts’ curated watch lists\nThe IBD Live team watches hundreds of stocks and keeps a hand-picked list of the ones with the highest potential for big gains. As a member, you get access to their Watch List and Ready List, which are updated daily and emailed to members every afternoon.\nHere's What Subscribers Love About IBD Live.\nKelly C\n“I have learned more about the logistics of trading on IBD Live in the last 3 weeks than I have in the last 20 years.”\nDavid A\n“IBD Live is extremely valuable for both beginners and long-term investors.”\nMarvin S\n“IBD Live gives you that edge and confidence you need.”\nEpisode Highlights\nThese videos are sample clips; full IBD Live episodes are 90 minutes.\nMark Minervini On How To Properly Manage Risk\nInvesting guru Mark Minervini talks about how he \"finances\" his trades by taking quick profits and how his win-loss ratio, average gain and average loss factor into the calculation.\nDavid Ryan On Determining When A Stock's Move Is Over\nWilliam O'Neil protege David Ryan explains how to determine when a leading stock's move is over.\nUse These Technical Indicators To Stay On Top Of Short-Term Trends\nIBD Chief Content Officer Chris Gessel shares technical indicators he uses to keep track of short-term market trends on the daily and 30-minute charts of QQQ in Thinkorswim.\nStream episodes anytime and get daily email recaps\nLife is busy and you probably can’t catch every minute of every IBD Live episode. That’s okay, we’ve got your back.\nAs an IBD Live subscriber, you can stream recent episodes any time on demand. You also get a recap of every episode emailed to you along with a list of the tickers discussed that day and a link to the full Q&A transcript.\nThese daily recaps make it easy to get up to speed with the market in just 5 minutes, even if you miss a show.\nWeekly Special Guests\nOn IBD Live, you don’t just hear from our in-house market analysts and portfolio managers. We also invite luminaries from the world of investing to share their insights and talk trading.\nPast guests include:\nMark Minervini\nTwo-time U.S. Investing Champion and Bestselling Author\nJon Najarian\nCo-Founder of Market Rebellion and CNBC Contributor\nCharles Harris\nPortfolio Manager at O’Neil Capital Management\nEve Boboch\nPortfolio manager and market strategist, Roppel Capital Management\nChoose your IBD Live plan:\nTrial\nCancel any time.\n$9.95\nBilled at $49.95/month for IBD members and $99.95/month for non-members after the trial period ends.\nMonthly (IBD Members)\nLog in to get your discount.\n$49.95/mo.\nMonthly (Non-Member)\n$99.95/mo.\n*No obligation. After the 3 week trial, your IBD Live subscription will auto-renew at the regular monthly rate as follows:\nIBD Member Rate: $49.95/month\n|\nNon-Member Rate: $99.95/month\nFrequently Asked Questions\nIBD Live is a real-time streaming video broadcast where IBD’s investing experts guide you through the market open and the first 90 minutes of trading. This innovative video broadcast lets you watch our team of market writers, analysts and portfolio managers as they identify and analyze leading stocks. Not only will you see and hear the IBD Live team, but you’ll also see exactly what’s on their computer screens!\nOur experts believe that the first hour of market action sets the stage for the rest of the trading day. That’s why IBD Live begins broadcasting every trading day at 9:20am ET (6:20am PT), 10 minutes before the opening bell. The live streaming ends around 10:30am ET (7:30am PT).\nYou can watch a week’s worth of recent episodes at your convenience. The shows will be added to the IBD Live archives shortly after the live broadcast concludes.\nGo to investors.com/IBDLive and log in with your investors.com account. The first time you watch IBD Live, you’ll be automatically prompted to install the Zoom client (this enables seamless video streaming between our computers and yours). The installation takes a minute or two and you’ll only have to do it once.\nIBD Member Rate: $49.95/month (Save 50%)\nNon-Member Rate: $99.95/month\nFor $99.95/month, you get unlimited access to IBD Live broadcasts and recent shows. If you’re a subscriber to an IBD premium product like IBD Digital, Leaderboard, SwingTrader or MarketSmith, then you can add IBD Live to your membership for only $49.95/month.\nYes, you can cancel at any time.\nMeet the IBD Live Team\nChris Gessel\nChief Content Officer\nInvestor’s Business Daily\n@IBD_CGessel\nJustin Nielsen\nMarket Research Director\nInvestor’s Business Daily\n@IBD_JNielsen\nAlissa Coram\nMultimedia Content Editor\nInvestor’s Business Daily\n@AlissaCoram\nDavid Saito-Chung\nDeputy Markets Editor\nInvestor's Business Daily\n@IBD_DChung\nKen Shreve\nSenior Markets Writer\nInvestor’s Business Daily\n@IBD_KShreve\nRachel Fox\nMarkets Writer\nInvestor’s Business Daily\n@foxonstocks\nEd Carson\nNews Editor\nInvestor’s Business Daily\n@IBD_ECarson\nScott St. Clair\nSenior Product Coach\nMarketSmith\n@Zeninthemarkets\nHarold Morris\nProduct Coach\nLeaderboard and MarketSmith\nDavid Ryan\n3-Time U.S. Investing Champion\n@dryan310\nAfter the initial 3-month term, the IBD Live subscription will auto-renew at the regular monthly rate of $99.95 for new subscribers and $69 for existing IBD product subscribers including IBD Digital, IBD Digital + Print, Leaderboard, SwingTrader and MarketSurge.\nIBD, IBD Digital, IBD Live, IBD Weekly, Investor's Business Daily, Leaderboard, MarketDiem, MarketSurge and other marks are trademarks owned by Investor's Business Daily, LLC.\n© Investor's Business Daily, LLC. All rights reserved.\nAbout Us\n|\nTerms of Use\n|\nPrivacy Notice\n|\nContact Us\n|\nDo Not Sell My Personal Information\nInformation in Investor’s Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. The information has been obtained from sources we believe to be reliable, but we make no guarantee as to its accuracy, timeliness, or suitability. Historical investment performances are no indication or guarantee of future success or performance. Authors/presenters may own the stocks they discuss. We make no representations or warranties regarding the advisability of investing in any particular securities or utilizing any specific investment strategies. Information is subject to change without notice. For information on use of our services, please see our Terms of Use."
    },
    {
      "url": "https://get.investors.com/marketsurge/?src=apa1bq",
      "text": "Stock research has surged into a new era.\nNo obligation. Try 6 weeks for $49.95, then only $149.95/month thereafter.\nMarketSurge isn’t like any other stock research platform––it’s better.\nDesigned by a Trading Legend for Investors Like You\nStock-picking guru William O’Neil created MarketSurge so individual investors could trade the way he and his professional portfolio managers do. If you want to trade like the best, get the tools they use.\nPowerful, Streamlined and Easy-to-Use\nWith MarketSurge, trading is simple as 1-2-3. Pick top-rated stocks from our proprietary lists, analyze them with exclusive ratings and tools, then see the ideal times to buy and sell overlaid right on the chart.\nThe Biggest Time-Saver in Stock Research\nYou could spend hours searching the web for earnings reports and squinting at free charts. With MarketSurge, you can conduct all your investing research in one platform so you can find more winning trades in less time.\nMarketSurge is trusted and recommended by top traders.\nI save hundreds of hours a year on research using IBD's MarketSurge service. Key data, pattern recognition, entry/exit prices, screeners, and the best stock ranking system available, all on one chart. My best newsletter picks come from MarketSurge charts.\nDr. Tom Carr\nBestselling author of Trend Trading for a Living and founder of DrStoxx.com\nThe screening tool I used to win the 2021 US Investing Championship was MarketSurge. With MarketSurge, I’m never going to miss potential big winners.\nMark Minervini\nBestselling author of Trade Like a Stock Market Wizard and founder of Minervini Private Access\nMarketSurge is one of my top go-to resources for investment research. It’s an ideal combination of easy-to-use and powerful. I get tons of the most important data I need in one place to make my decisions quickly, and I can’t imagine trading without it.\nHoward Lindzon\nVenture Capitalist and Co-founder of StockTwits.com\nMarketSurge is my best resource for a techno-fundamental overview of a stock. All of my trades are based on price action first. I like to know what the company does, who its competitors are, and have a snapshot of the industry's fundamentals. MarketSurge is a concise resource for me to find that information quickly and much more, all in one place.\nBrian Shannon\nCMT, author, trader and founder of AlphaTrends\nChoose your MarketSurge plan:\nTrial\nTry 6 weeks of MarketSurge for only $49.95. Cancel any time.\n$49.95\nFor the first 6 weeks\nBilled at $149.95/month after the trial period ends.\nAnnual\nSave over 16% off the monthly price when you sign up for an annual membership!\n$1,499/year.\nSave $300 annually\nMarketSurge members get more premium features than any other platform.\nDatabase of 18,000+ Stocks, ETFs and Mutual Funds\nFull-screen Interactive Charts\nProprietary 1-99 Ratings for Every Stock\nCurated Stock Lists Like Recent Breakouts and Top IPOs\nAlgorithmic Chart Pattern Recognition\nFully Customizable Stock Screener\nBuying Checklists for Investors Like O’Neil and Buffett\nReal-time Stock Data\nNEW! The Earnings Line\nNEW! David Ryan’s Ants Indicator\nNEW! Forward Earnings and Sales Estimates\nNEW! Optimized Intraday Volume\nPlus, you get all these valuable resources at no charge:\nFree App for Smartphones and Tablets\nFree Product Coaching\nFree Weekly Webinars for Members\nFree Welcome Kit and Quarterly Stock Guide\nFrequently Asked Questions\nYes, there are major improvements and new features in MarketSurge! We’ve added some of our users’ most-requested features, including the Earnings Line, which is a very helpful visualization of the quarterly earnings trend. We’ve also added David Ryan’s Ants Indicator, which flags stocks under heavy institutional accumulation. Not only that, but MarketSurge now includes four quarters of forward EPS and sales estimates for every stock and optimized intraday volume.\nMarketSurge was engineered from the ground up in order to bring professional-grade investing research to individual investors. Unlike professional software platforms and terminals that can cost $1,000+ per month, MarketSurge costs $149.95/month with all premium features included. You won’t pay extra for access to the powerful database or features like algorithmic Pattern Recognition—they’re all included with your membership.\nMarketSurge works for investors of all experience levels. If you’re just starting your investing journey, MarketSurge can help you dramatically shorten your learning curve with coaching, webinars, educational videos and a library of investing knowledge. If you’re a veteran trader, you’ll appreciate how powerful and well-thought-out every feature of MarketSurge is. Many professional and institutional investors are MarketSurge subscribers, as well.\nOur experienced MarketSurge Coaches are just a phone call or email away! They can answer any MarketSurge questions you have and help you get started faster. Coaching is 100% free for as long as you’re a member.\nYes! MarketSurge members get access to almost 100 new webinars a year, including weekly Take on the Market updates and monthly market recaps via Stay in Step with the Market. New webinars on educational topics like selling rules and portfolio management are added all the time, in addition to our extensive webinar and video archives.\nYes, your subscription allows you to use MarketSurge on all of your devices: desktop, tablet and mobile (both iOS and Android).\nIf you’re new to MarketSurge, you can try it for 6 weeks for only $49.95. After that, your membership will renew at $149.95/month. The best price: You can save over $300 per year by choosing an annual subscription at a rate of $1499/year!\nYou can cancel any time. Go to your MyIBD subscription settings or call our Customer Success Team at 800-831-2525.\nCall our best-in-the-business Customer Success Team at 800-831-2525 or email us at [email protected] and we’ll be glad to answer your questions.\n* After the initial 6-week term for $49.95, the MarketSurge Premium subscription will auto-renew at the regular monthly rate of $149.95 You can cancel at any time. Other conditions may apply.\nIBD Founder William O’Neil created MarketSurge to provide individual investors with a stock research platform packed with the data and tools he used to find true market leaders. The interface is streamlined and easy-to-use so you can conduct in-depth research in three easy steps: 1) Find trade ideas with our exclusive stocks lists; 2) Evaluate them with fundamental and technical data in one screen; 3) See when to buy and sell with AI-powered Pattern Recognition.\n© Investor's Business Daily, LLC. All rights reserved.\nQuestions? Call us at (800) 831-2525"
    }
  ],
  "argos_summary": "Life360, a family-tracking service, reported strong growth in its second-quarter earnings, surpassing analyst expectations with adjusted earnings of 26 cents per share on revenues of $115.4 million. The company saw a 25% increase in monthly active users, reaching 88 million, and plans to expand its product line with a GPS-enabled pet tracker. Life360's new CEO, Lauren Antonoff, aims to enhance user value and monetize its free users through location-based advertising, positioning the company as a leader in the family safety and tracking market.",
  "argos_id": "P7FR20X4N"
}