{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/druski-kicks-off-first-international-tour-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "d0b6782dad8f4348afb959f7f4090f97",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i6j4HWcKKneM/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:47:26.157000+00:00",
  "addDate": "2025-08-12T22:55:20.165142+00:00",
  "refreshDate": "2025-08-12T22:55:20.165144+00:00",
  "score": 1.0,
  "title": "Druski Kicks Off First International Tour",
  "description": "Druski, comedian, actor and entrepreneur, says he is still “mind-blown” about his arena tour and has more projects on the way, including a TV show and a movie. He speaks with Romaine Bostick on “The Close” about why he avoided signing brand deals early in his career, explaining that he wanted to build something on his own first. (Source: Bloomberg)",
  "content": "You started off on Instagram making comedy sketches, and now you're about to set off on a big national tour in arenas. My first arena tour. How does that feel? I'm actually very excited, man. We've transitioned through a lot of different stages of my career so far and like being able to say that this is my first arena tour is like still mind blowing. But yeah, it's definitely amazing. And we yeah, we're working on so much and now we've got TV shows. Now we have a movie on the way. Yeah, there's so much in store. So with always your goal to be a comedian, was that what you grew up wanting to be? Yeah, I think I just didn't know when I was younger. I used to just want to be funny in school. Yeah, but I got in trouble for it, so I was kind of confused early on because I didn't really know, Am I supposed to be doing this? You know what I mean? Because everybody was painted to be like a bad thing in school. So. Yeah, it is. It is amazing how it actually transpired throughout life. I had to figure out what my purpose was. But yeah, now I am curious about just the economics of your business. I mean, we talk about the big could a best tour, but you have all these other shows, the dating show that could have called a house show. And I'm no, I'm forgetting a few others out there as well. But you're producing all these yourself, right? Yes. Yes. Through your own company. So effectively, this is your business. Yes. You control it. Yes. 1,000%. Yeah. 2% ownership. That's what we promote. Yeah. Hundred percent. That's, that's No, but there's, there's a reason for it though. Like I know I make the joke all the time even we're kind of in records that, you know, we, we I do enjoy doing it, but I mainly do it for the fans knowing that I can do it myself. And now that I have money from brand deals and people that I work with in order to do it, it's like I don't need another company to come in, which is cool. I do enjoy that, but I think building my own IP in this area is probably the most like strongest thing that I enjoy developing in the process. From when you started to where you are now, were you ever tempted to maybe sign or take a job with a bigger company? Yeah. Yeah. Well, there's some deals out there. I'm still temporary, but I'm not saying it's not out of the picture. But the main thing I did start doing my own shows and giving it for free on YouTube was because I wanted to build something bigger by myself first. And then, you know, as as things happen, we are actually we have a lot of stuff coming up that will be with other companies as well. But yeah, no, I think I just wanted to build out my IP and like I looked up to, you know, the Adam Sandler story of how he built up Happy Madison and like just all his movies and his production company. So I wanted to do the same for mine. When you look at the opportunities out there for the next Jaroussky or whoever that may be coming up, do you think that that path that you took will still be there? Yes. With social media, is it so it's moving so fast and I think so many people are starting to find out that they can do it themselves, which is why I pride myself on what we have done. I hope others will follow that same process and know that if you are getting money from these companies, don't just think that you have to go buy a car or go buy a big house or go. It's just a splurge of money. A smart thing you can do is try to build your own IP and try to build your own business around you. So what I would do, like let's say Nike, we work with Nike. So if Nike gives me $1,000,000 check, I don't go and put that in my pocket and try to go get a bunch of cool stuff. I'll go and try to spend that money on one of the episodes of my TV shows, like, Yeah, and way it, maybe it may sound crazy, but like that money never goes just straight to the pocket. I try to always reinvest reinvested. And you mentioned Nike. I mean, you've had a lot of brand partnerships. Beats by Dre Nike raising Cane's Mountain Dew. Yeah Google Pixel I'm probably forgetting a few monster and and prospects is one of the good ones Wow And so they all came knocking on your door. Why? Because you're so popular out there. I just I don't think it's always about popularity. I think they they may feel like I have that pull on this next generation. Not to brag. I'm not I'm not a big bragger. I'm just saying I do think I also bring a good entertainment level to the brand deals that I have, being that we could do commercials on TV or commercials for social media. And my fans, they they adapt to it like they really do, like go and buy the stuff whenever we drop anything. So I think that that is probably worked out the best for me. There is sort of I mean, looking at some of the clips that have been put out with some of these brands, I mean, there is a level of authenticity. I mean, that word. Yes. That I see in what you do compared to other influencers. And I wonder, are you picking sort of brands or products that you maybe use or you have a love for, or are you kind of agnostic? Yeah, we're very picky about who we work with as well. Like majority of my company for life is entertainment. We tried to make sure that we have a say so in any of the stuff that we're. Putting out or any of the commercial stuff, like we want to make sure that this is just as funny as the content that I'm putting out by myself. So yeah, that's that's definitely marked in the contract before we sign anything with any company is to make sure that we have say so on any creative. I do have to ask you about just the idea of protecting your reputation. Yeah. And in the context, obviously for a Nike or racing came to whoever these big brands are taking a risk, right? I mean, normally they like to play it safe. They want to make sure that the people they're aligned with are going to say, You're funny, but you've had a few jokes, a few sketches that didn't quite land the right way. You got some pushback. So how do you navigate that? I mean, because you're trying to sort of, you know, not be controversial, but be provocative. Well, I think yeah, I think yeah, a lot of a lot of stuff. And I preach about this like relationships are key. And, you know, with comedy, they have to understand that comedy is comedy. And sometimes you do have to walk that line of what's funny and what's too far. So yeah, I think with having a good relationship with some of these brand partners are some of like, you know, some of the higher ups in that company. They understand like, okay, this is this is fine. And we trust him in this because we know this is how we found him. So being able to have these conversations with some of the higher ups of these companies, it's like, okay, they do have a certain sense of trust that, okay, this is risky and this is why we love him. So we can't cut ties because maybe you see a skit was too far or maybe this was this joke was too far left. So it's worked good just off of just having good relationships with majority of the people that we work with. I mean, how do you see social media comedy, Instagram comedy evolving, is headed in a great direction. I think social media now with just the streaming stuff and like, yeah, the Twitch world and us getting into that. So now I'm starting to develop. Yeah, even even pivoting my content into the streaming world and like how that works. So yeah, it's definitely headed in a good direction for sure.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other companies",
      "weight": 0.0708235
    },
    {
      "name": "brand deals",
      "weight": 0.066127606
    },
    {
      "name": "good relationships",
      "weight": 0.06541176
    },
    {
      "name": "TV shows",
      "weight": 0.060454175
    },
    {
      "name": "brand partnerships",
      "weight": 0.059919357
    },
    {
      "name": "social media comedy",
      "weight": 0.05957674
    },
    {
      "name": "First International Tour",
      "weight": 0.058287058
    },
    {
      "name": "comedy sketches",
      "weight": 0.05789858
    },
    {
      "name": "cool stuff",
      "weight": 0.057596877
    },
    {
      "name": "Instagram comedy",
      "weight": 0.054095943
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.958984375
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.69775390625
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Event Ticket Sales",
      "score": 0.458740234375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.39013671875
    }
  ],
  "sentiment": {
    "positive": 0.13153227,
    "negative": 0.5398879,
    "neutral": 0.32857975
  },
  "summary": "Comedian comedian Druski is set to embark on a national tour in arenas, his first arena tour. He credits his success to building his own IP and creating a successful business around himself. Despite being tempted to sign or take a job with larger companies, he believes that building your own IP in this area is the most like strongest thing he enjoys developing. He shares his philosophy of self-promoting and reinvesting in his comedy career. He also shares his thoughts on potential brand partnerships with Nike, Beats by Dre, and Google's Mountain Dew.",
  "shortSummary": "Despite starting on Instagram, comedian Druski is embarking on his first arena tour, focusing on building his own IP and securing sponsorship deals with brands like Nike.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7872b68a11244527b911060286529de1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article discusses a comedian's journey from creating comedy sketches on Instagram to embarking on his first national arena tour. He expresses excitement about his career growth, including upcoming TV shows and a movie, while emphasizing the importance of building his own brand and intellectual property. The comedian highlights his strategic approach to brand partnerships, focusing on authenticity and maintaining creative control, while also navigating the challenges of comedy and reputation management in the social media landscape.",
  "argos_id": "PKSZ428Y5"
}