{
  "url": "https://seekingalpha.com/article/4812878-clipper-realty-reit-undervalued-with-dividend-yield-thats-fully-covered-by-affo",
  "authorsByline": "Pacifica Yield",
  "articleId": "7e7920352f9c42f7b27337072909c5fb",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1742910518/image_1742910518.jpg?io=getty-c-w1536",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:09:00+00:00",
  "addDate": "2025-08-13T02:14:07.167382+00:00",
  "refreshDate": "2025-08-13T02:14:07.167384+00:00",
  "score": 1.0,
  "title": "Clipper Realty: Undervalued With A Dividend Yield That's Fully Covered By AFFO (NYSE:CLPR)",
  "description": "Clipper Realty's 9.5% dividend yield is backed by strong quarterly funds. See more on CLPR stock's risks like NYC rent freeze and benefits from stabilized assets.",
  "content": "Clipper Realty's (NYSE: CLPR ) secure dividend and deeply discounted valuation against a portfolio of high-quality New York multifamily properties have kept me bullish on the equity REIT even as the stock price has dipped year-to-date to push the\n\nThe equity market is a powerful mechanism as daily fluctuations in price get aggregated to incredible wealth creation or destruction over the long term. Pacifica Yield aims to pursue long-term wealth creation with a focus on undervalued yet high-growth companies, high-dividend tickers, REITs, and green energy firms.\n\nAnalyst’s Disclosure:I/we have a beneficial long position in the shares of CLPR either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Seeking Alpha",
      "weight": 0.09034491
    },
    {
      "name": "US investment adviser",
      "weight": 0.08351237
    },
    {
      "name": "stock ownership",
      "weight": 0.08241645
    },
    {
      "name": "secure dividend",
      "weight": 0.08047875
    },
    {
      "name": "incredible wealth creation",
      "weight": 0.07996261
    },
    {
      "name": "individual investors",
      "weight": 0.07854581
    },
    {
      "name": "investment bank",
      "weight": 0.076760106
    },
    {
      "name": "third party authors",
      "weight": 0.07038992
    },
    {
      "name": "CLPR",
      "weight": 0.06742918
    },
    {
      "name": "Past performance",
      "weight": 0.06305657
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.966796875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.95703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.94970703125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.728515625
    }
  ],
  "sentiment": {
    "positive": 0.28180128,
    "negative": 0.13101777,
    "neutral": 0.587181
  },
  "summary": "Clipper Realty (NYSE:CLPR) is undervalued with a high dividend and deeply discounted valuation compared to a portfolio of high-quality New York multifamily properties. This article discusses the power of the equity market to create wealth over the long-term. The article also mentions that past performance is no guarantee of future outcomes.",
  "shortSummary": "Clipper Realty is an undervalued equity REIT with a strong dividend and deep discounting, idealizing for long-term wealth creation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "59575c8c7108484c80a87361f17a3215",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Clipper Realty (NYSE: CLPR) is viewed positively due to its secure dividend and attractive valuation relative to its portfolio of quality multifamily properties in New York, despite a decline in stock price this year. The article emphasizes the importance of the equity market in wealth creation and highlights Pacifica Yield's strategy of focusing on undervalued, high-growth companies and high-dividend stocks. The author discloses a personal investment in CLPR and clarifies that the opinions expressed are their own.",
  "argos_id": "PYA56KR1F"
}