{
  "url": "https://www.usatoday.com/story/sports/mlb/2025/08/12/mlb-games-today-schedule-times-tv-08122025/85621689007/",
  "authorsByline": "Richard Morin",
  "articleId": "04ce85cfd3bd4cc1b3f1d21cc60ae3f8",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/02/18/USAT/79019616007-usatsi-25407393.jpg?crop=5999,3375,x0,y312&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:43:53+00:00",
  "addDate": "2025-08-12T08:46:50.359774+00:00",
  "refreshDate": "2025-08-12T08:46:50.359776+00:00",
  "score": 1.0,
  "title": "MLB games today: Schedule, times, how to watch for Aug. 12",
  "description": "Here's the full MLB schedule, for Aug. 12, including game times, TV channels, scores and how to stream.",
  "content": "Gambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our utmost to offer good advice and information we cannot be held responsible for any loss that may be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However, from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is up to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that may be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally or any sort of professional advice.\n\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside. It is your sole responsibility to act in accordance with your local laws.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Sports betting operators",
      "weight": 0.11127059
    },
    {
      "name": "sports betting operators",
      "weight": 0.11127059
    },
    {
      "name": "Sports betting",
      "weight": 0.10345796
    },
    {
      "name": "operator site",
      "weight": 0.097852975
    },
    {
      "name": "betting odds",
      "weight": 0.09757712
    },
    {
      "name": "betting services",
      "weight": 0.092762664
    },
    {
      "name": "betting",
      "weight": 0.092386454
    },
    {
      "name": "information",
      "weight": 0.07715433
    },
    {
      "name": "good advice",
      "weight": 0.07027731
    },
    {
      "name": "financial risk",
      "weight": 0.06766341
    }
  ],
  "topics": [
    {
      "name": "Baseball"
    },
    {
      "name": "MLB"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.85107421875
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.7138671875
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.5732421875
    }
  ],
  "sentiment": {
    "positive": 0.10811908,
    "negative": 0.3387706,
    "neutral": 0.55311036
  },
  "summary": "Gannett does not guarantee any success or financial gain in gambling. However, it is up to individuals to make bets based on the information provided on this site. The material is intended to inform, entertain and educate the reader and is not an inducement to gamble legally or illegally. Gannett may earn revenue from sports betting operators for audience referrals to these services. The National Council on Problem Gambling is available for help if someone has a gambling problem. The site's content is not dependent on the content of this article.",
  "shortSummary": "Gannett's betting tips for MLB games include accurate predictions, but only if you're 21-year-old or have a gambling problem.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e1da8ca70d684332b144d74c2e6291d6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article emphasizes the risks associated with gambling, advising individuals to only wager funds they can afford to lose. It clarifies that the site provides information and tips without guarantees of accuracy or financial gain, and it disclaims responsibility for any losses incurred from following its advice. Additionally, it mentions that Gannett may earn revenue from sports betting operators but asserts that this does not influence news coverage. Resources for gambling help are provided for those in need.",
  "argos_id": "Q30YISBBY"
}