{
  "url": "https://financialpost.com/pmn/business-pmn/air-canada-says-labor-talks-at-impasse-after-38-offer-to-union",
  "authorsByline": "Bloomberg News",
  "articleId": "3c14ce4b48db4f7aa522807644852ff6",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/776368285.jpg",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-12T20:23:53+00:00",
  "addDate": "2025-08-12T20:27:36.615555+00:00",
  "refreshDate": "2025-08-12T20:27:36.615556+00:00",
  "score": 1.0,
  "title": "Air Canada Says Labor Talks at Impasse After 38% Offer to Union",
  "description": "Air Canada, Canada’s largest airline, says labor negotiations are “at an impasse” after tabling a sweetened offer to the union representing its 10,000 flight attend…",
  "content": "In a statement Tuesday afternoon, the carrier said the union “submitted a counteroffer seeking exorbitant increases, beyond those presented in earlier submissions, and today rejected an offer by the company to enter binding, third-party arbitration.” The parties “remain far apart on key issues,” it added.\n\nAir Canada offered to increase total compensation, including benefits and bonuses, by 25% in the first year and 38% over four years, the company said. That’s more than a previous offer of 20% in the first year and 32.5% over four years, as reported by Bloomberg News.\n\nGet the latest headlines, breaking news and columns.\n• There was an error, please provide a valid email address. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Top Stories will soon be in your inbox. We encountered an issue signing you up. Please try again\n\nUnion members voted 99.7% to strike last week. The parties will be in a position to issue a 72-hour strike or lockout notice at 12:01 a.m. New York time on Wednesday, shutting down the airline as early as Aug. 16.\n\nReached by phone, a union spokesperson said, “The parties are still at the bargaining table. So all energies right now are being focused on trying to get to a deal.”\n\nAny labor action could, per day, ground about 700 mainline and Air Canada Rouge flights, and leave approximately 130,000 passengers behind. A strike or lockout would not impact the nearly 300 flights of Air Canada Express, which is operated by PAL Airlines Ltd.\n\nThe offer, disclosed on CUPE’s website, was rejected. “Arbitrators rely on precedent and the status quo to make their determinations,” the union’s bargaining committee wrote. “Air Canada wants an arbitrator to do their dirty work for them to keep the status quo intact.”\n\nThe airline also agreed to pay workers for some of the time they spend on the ground, but the union is seeking 100% pay for all hours worked. Currently, Air Canada flight attendants are only paid when the aircraft is in motion and not for work such as boarding — a common practice in the industry, but one that’s increasingly being challenged.\n\nAir Canada’s latest 10-year contract with its flight attendants expired at the end of March. The company and the union have been negotiating for the past eight months. The airline said it’s looking at all remaining options, including a request for government-directed arbitration.",
  "medium": "Article",
  "links": [
    "https://financialpost.com/video-centre/",
    "https://financialpost.com/subscribe"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Air Canada flight attendants",
      "weight": 0.10202933
    },
    {
      "name": "Air Canada",
      "weight": 0.09542702
    },
    {
      "name": "Air Canada Express",
      "weight": 0.093410544
    },
    {
      "name": "Air Canada Rouge",
      "weight": 0.09322525
    },
    {
      "name": "Union members",
      "weight": 0.08041458
    },
    {
      "name": "Union",
      "weight": 0.0792522
    },
    {
      "name": "New York time",
      "weight": 0.06318626
    },
    {
      "name": "key issues",
      "weight": 0.061446507
    },
    {
      "name": "work",
      "weight": 0.050685458
    },
    {
      "name": "Air Canada’s",
      "weight": 0.05060782
    }
  ],
  "topics": [
    {
      "name": "Airlines"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.93408203125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.75341796875
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.6728515625
    },
    {
      "name": "/News/Other",
      "score": 0.541015625
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.33837890625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.325927734375
    }
  ],
  "sentiment": {
    "positive": 0.053533606,
    "negative": 0.7357682,
    "neutral": 0.21069822
  },
  "summary": "Air Canada has announced that labor negotiations are at an impasse after a 38% offer from the union was rejected. The airline offered to increase total compensation by 25% in the first year and 38% over four years, more than a previous offer of 20%. The union is seeking 100% pay for all hours worked. A strike or lockout could disrupt about 700 mainline and Air Canada Rouge flights per day and leave approximately 130,000 passengers behind. The company's latest 10-year contract with its flight attendants expired in March.",
  "shortSummary": "Air Canada's labor negotiations are at an impasse after the union rejected an increased compensation offer, risking disruption to 700 flights.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4573f84d0dcb4063bb8fb4afc07f9488",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Air Canada and its flight attendants' union remain at an impasse in contract negotiations, with the airline offering a 25% pay increase in the first year and 38% over four years, which the union rejected as insufficient. Union members voted overwhelmingly in favor of a strike, which could ground around 700 flights and affect 130,000 passengers if initiated. The union is pushing for full pay for all hours worked, while Air Canada seeks to maintain the current pay structure during non-flight hours.",
  "argos_id": "Q4R8MTQAL"
}