{
  "url": "https://www.nasdaq.com/articles/why-tmc-metals-company-stock-sank-10-last-month-and-has-kept-falling-august",
  "authorsByline": "The Motley Fool",
  "articleId": "71b27859293b486dbeff9588fed14da9",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T02:21:50+00:00",
  "addDate": "2025-08-12T03:22:48.955168+00:00",
  "refreshDate": "2025-08-12T03:22:48.955170+00:00",
  "score": 1.0,
  "title": "Why TMC The Metals Company Stock Sank 10% Last Month and Has Kept Falling in August",
  "description": "Key PointsTMC stock lost ground in July as the U.S. made some significant concessions in order to advance trade negotiations with China.",
  "content": "Key Points\n• None TMC stock lost ground in July as the U.S. made some significant concessions in order to advance trade negotiations with China.\n• None Striking a deal for access to Chinese rare earth minerals is at the heart of the U.S.'s aims in trade negotiations, and this raises questions for TMC.\n• None A trade deal between the U.S. and China could soften TMC's growth trajectory, but the company still has big opportunities in domestic mineral sourcing.\n• 10 stocks we like better than TMC The Metals Company ›\n\nTMC The Metals Company (NASDAQ: TMC) stock got hit with a significant pullback in July's trading. The company's share price slumped 10% in a month of trading that saw the S&P 500 index rise 2.2% and the Nasdaq Composite index jump 3.7%.\n\nWhile the broader market rose in relation to developments that suggested that the U.S. and China could be moving closer to a trade deal that would lower tariffs and resolve other key issues, TMC stock saw a pullback as a result of the news. On the other hand, recent pullbacks for its share price come on the heels of a massive valuation run-up for the company this year.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Continue »\n\nLast month, the Trump administration announced that it was lifting licensing requirements and export restrictions that effectively prohibited high-end artificial intelligence (AI) chips from Nvidia and AMD from being sold to the Chinese market. Export restrictions and licensing requirements on semiconductor manufacturing equipment are also being lifted. The big shift on key tech exports to China represented a concession from President Donald Trump in order to increase the likelihood of getting serious negotiations for a trade deal initiated in the not-too-distant future.\n\nWhile the Trump administration has seemingly been willing to cede some key ground when it comes to some of the U.S.'s competitive advantages in AI, it's hoping that the move will help secure longer-term access to China's rare earth mineral supply. Adversarial relations between the U.S. and China have increased the strategic importance of domestic mineral sourcing operations and paved the way for TMC stock to see huge gains this year. With some recent steps toward trade negotiations between the U.S. and China, TMC's big rally has taken a bit of a breather.\n\nTMC's share price has continued to slide in August\n\nAs of this writing, TMC stock is down roughly 10% in August's trading. While there haven't been any major, negative business-specific catalysts for the company, investors have continued to take profits and reduce exposure to the stock in light of uncertain trade dynamics. Despite some recent sell-offs, the company's share price is still up roughly 378% year to date as of this writing.\n\nTMC now has a market capitalization of roughly $1.9 billion and is still in a pre-revenue state. While the company will still need to secure key permitting and other regulatory approvals in order to kick off its commercial seabed mining operations, there seems to be a good chance that increased government support for domestic rare earth mining projects will help facilitate TMC's operational launch and scaling.\n\nBetting on that outcome is still a risky proposition, but an executive order signed by President Trump to expedite the review of permitting applications for seabed-mining bodes well for the company. While a trade deal with China could help alleviate near-term concerns about rare earth mineral sourcing, increasing domestic production capabilities will likely continue to be a priority along economic and national security lines.\n\nShould you invest $1,000 in TMC The Metals Company right now?\n\nBefore you buy stock in TMC The Metals Company, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and TMC The Metals Company wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $653,427!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,119,863!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 1,060% — a market-crushing outperformance compared to 182% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nKeith Noonan has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=5461b0b3-e5f4-4707-b243-22bc867ab6a1&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17514%26ftm_veh%3Darticle_pitch_feed_partners%26company%3DTMC%2520The%2520Metals%2520Company&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=96eb3cd4-0cbe-44d1-9a94-ac2d3fa38f33",
    "https://www.fool.com/investing/stock-market/market-sectors/information-technology/ai-stocks/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=96eb3cd4-0cbe-44d1-9a94-ac2d3fa38f33",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=5461b0b3-e5f4-4707-b243-22bc867ab6a1&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17514&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=96eb3cd4-0cbe-44d1-9a94-ac2d3fa38f33",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=7070666c-1238-45dc-a72f-7d05f7300996&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001096%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dtop_incontent_pitch_feed_partner%26ftm_pit%3D17547&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=96eb3cd4-0cbe-44d1-9a94-ac2d3fa38f33",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=5f401ddd-457f-460d-9ab6-92d1a10e627a&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000069%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17995",
    "https://www.fool.com/terms/t/tariffs/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=96eb3cd4-0cbe-44d1-9a94-ac2d3fa38f33",
    "https://www.fool.com/author/6956/",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.nasdaq.com/market-activity/stocks/tmc"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "TMC stock",
      "weight": 0.10058781
    },
    {
      "name": "TMC",
      "weight": 0.07654905
    },
    {
      "name": "stock",
      "weight": 0.07431614
    },
    {
      "name": "rare earth mineral sourcing",
      "weight": 0.07133822
    },
    {
      "name": "Chinese rare earth minerals",
      "weight": 0.07042537
    },
    {
      "name": "domestic rare earth mining projects",
      "weight": 0.06964257
    },
    {
      "name": "trade negotiations",
      "weight": 0.06613847
    },
    {
      "name": "domestic mineral sourcing operations",
      "weight": 0.06528165
    },
    {
      "name": "domestic mineral sourcing",
      "weight": 0.06371901
    },
    {
      "name": "Motley Fool Stock Advisor",
      "weight": 0.061451282
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.92578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.916015625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.74658203125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.39453125
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.377197265625
    }
  ],
  "sentiment": {
    "positive": 0.5199942,
    "negative": 0.17549947,
    "neutral": 0.30450636
  },
  "summary": "TMC The Metals Company (NASDAQ: TMC) stock fell 10% in July, largely due to significant concessions made by the U.S. to advance trade negotiations with China. The company's share price has continued to fall in August, with the S&P 500 index rising 2.2% and the Nasdaq Composite index jumping 3.7%. Despite these setbacks, TMC's shares have risen by around 378% year to date. The firm still has significant opportunities in domestic mineral sourcing, despite recent setbacks. The Motley Fool Stock Advisor analyst team has named the 10 best stocks to buy now.",
  "shortSummary": "TMC The Metals Company's share price fell 10% in July due to significant concessions made by the U.S in trade negotiations with China, but potential growth opportunities remain uncertain.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "bbf22fd2377b43e190b42ececef62afd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/terms/t/tariffs/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=96eb3cd4-0cbe-44d1-9a94-ac2d3fa38f33",
      "text": "Government bodies can use tariffs to bolster domestic industries and achieve foreign trade and policy objectives. Read on to learn more about tariffs, the different ways these taxes can be applied, and the roles they can play in international economics and diplomatic relations.\nWhat are tariffs?\nWhat are tariffs?\nTariffs are a form of tax imposed by national or supranational government bodies on the import or export of goods. Tariffs are also sometimes referred to as duties.\nWhy are tariffs important?\nWhy are tariffs important?\nBeyond just being a source of tax revenue, tariffs are a way that governments can modify trade incentives. In particular, tariffs can be important in protecting domestic industries and economic interests.\nTariffs can be a form of economic protectionism, but the costs typically wind up being passed on to domestic shoppers through price hikes on consumer goods. Higher prices on imported goods may give domestically produced goods a competitive advantage, but governments try to strike a balanced approach to tariff policy that works for the good of the broader economy.\nHow do tariffs work?\nHow do tariffs work?\nTariffs are collected when goods exit the domestic area and cross into foreign borders. Import tariffs are far more common than export tariffs. When pursuing growth opportunities in international markets, businesses must be mindful of how tariffs could affect the market for their products and their pricing strategies.\nDifferent categories of products typically have different levels of tariffs applied. For example, vegetables, auto parts, and dairy products have relatively high import tariffs in the U.S., and tariffs on sneakers and tobacco are even higher. On the other hand, not all goods are subject to import duties.\nGovernments will also set tariff levels on a country-by-country basis. In general, countries with less-developed economies tend to have higher tariffs.\nAcademic views on tariffs\nAcademic views on tariffs\nRyan Monarch, PhD\nThe Motley Fool: What are the short and long-term economic effects of tariffs that matter most to investors?\nRyan Monarch: “In the short-run, tariffs are seen as inflationary, and all else equal, the more widespread the tariffs, the tighter Federal Reserve policy will likely be in order to tamp down upward price pressure. The exchange rate is also likely to appreciate – as U.S. interest rate policy remains tight relative that of other countries, the dollar is likely to strengthen. The short run is also characterized by significant uncertainty about what trade policy will look like, leading to the pulling back of investment and production for many companies.\nIn the long-run, inflation expectations may become less stable, and as consumers come to expect inflation, this itself can lead the Federal Reserve to take stronger tightening actions. If a global trade war truly breaks out, in which countries continue to escalate tariffs and other actions against each other, the economic consequences for all sides would be dire, and could lead to a major downturn in global growth.”\nThe Motley Fool: How do tariffs impact the economy?\nRyan Monarch: “A tariff is a tax on an imported good paid by an importer in order to obtain their purchase after passing through customs. The basic purpose of a tariff is to increase the price of imported goods from a particular country in order to protect domestic producers of that good.\nSince tariffs increase the price of imported goods, tariffs impact the economy in a number of ways. First, average import prices increase as the scope of imported products facing tariffs expands. Second, tariffs tend to lead the imports of the affected goods to decrease. In some cases, affected businesses may substitute to purchasing products from other source countries or domestic alternatives, though the availability of such alternatives varies greatly depending on the imported product. Third, increase in import prices lead to higher costs for businesses using tariffed products as inputs, and affected firms tend to reduce employment, investment, and production in response. In fact, research on the 2018-2019 trade war has shown that job losses at U.S. firms using tariffed inputs well-exceeded job gains in protected sectors, and U.S. exports weakened as a result of higher import tariffs. Finally, government revenue increases as a result of the tax being applied to importers, though tariff revenue is a small fraction of overall government revenue in the United States.”\nThe Motley Fool: Do tariffs cause inflation?\nRyan Monarch: “Tariffs cause the price of affected goods to rise. In fact, research into the 2018-2019 trade war has shown that the prices of U.S. imported goods affected by tariffs rose by nearly the entire amount of tariffs imposed, meaning that U.S. importers bore the brunt of the increase in costs. Additionally, if importers substitute toward alternatives that are more expensive than their original suppliers, this can also cause prices to rise.\nThe extent to which this causes inflation depends on many factors. One consideration is the scope of the tariffs: The more widespread tariffs are, the greater the inflationary pressures will be. It also depends on how importers respond to higher costs: In 2018-2019, many U.S. importers did not pass on the full amount of their cost increase to their consumers, and increases in consumer prices are the traditional metric of inflation. In addition, movements in exchange rates can counteract direct increases in import prices. For example, the dollar typically strengthens after tariffs are imposed, making imports cheaper. Central banks might also respond to widespread tariffs with tighter interest rate policies, also tamping down inflationary pressures. The exact measure of inflation along with the path of tariff increases also matters, as a one-off increase in prices due to tariffs would disappear quickly from short-run measures of inflation. All told, tariffs lead to higher prices, but there are numerous possibilities for how exactly these higher prices may be reflected in overall consumer price inflation.”\nJason Miller, PhD\nThe Motley Fool: Who pays for tariffs imposed on U.S. imports?\nJason Miller, PhD: “The importing entity pays the tariffs.”\nThe Motley Fool: Does the U.S. benefit from tariffs on Mexico and Canada?\nJason Miller, PhD: “The U.S. certainly does not economically benefit from tariffs, as tariffs will increase costs (thus contributing to inflation) and disrupt production networks. Prior research documents that U.S. manufacturers that export who saw larger increases in tariffs for the goods they imported from China saw reduced exports in 2019; we would expect the same mechanism to work regarding Canada and Mexico.”\nThe Motley Fool: Do tariffs have any impact on prices of domestically produced goods?\nJason Miller, PhD: “Yes, especially in the case of metals such as steel and aluminum, domestic producers will increase their prices when foreign goods are subject to more tariffs. We saw this play out in 2018, as steel prices rose sharply that year, roughly 20%.”\nDavid Ortega, PhD\nThe Motley Fool: How will tariffs impact the U.S. economy?\nDavid Ortega, PhD: “Tariffs function as taxes on imported goods, leading to increased costs for U.S. importers. These heightened costs often translate to higher prices for consumers and businesses relying on these imports to produce goods domestically.\"\nThe Motley Fool: Who pays for tariffs imposed on U.S. imports?\nDavid Ortega, PhD: “Importers pay the tariff, which raises their costs, and this gets passed down in the form of higher prices.”\nThe Motley Fool: Which products are going to cost more due to tariffs?\nDavid Ortega, PhD: \"Tariffs will increase the price of food, especially for items that we rely on our trading partners like produce. At the grocery store, the impact will be felt more immediately on perishable products that we import. Food products like avocados, tomatoes, peppers, berries, cucumbers, etc. — these are products that have a relatively short shelf-life and for which we can’t hold inventory for a prolonged period. Other food and beverage products like imported Mexican beer, tequila, Canadian maple syrup to name a few are likely to see prices increase when tariffs are imposed.”\nRelated investing topics\nExample\nAn example of tariffs in action\nDepending on their scope and application, tariffs can be a source of tension between governments. If one country implements or raises tariffs on another country's goods, there's a risk that the second country will respond in kind.\nIn recent years, the U.S. and China have increased tariffs imposed on each other's products. The U.S. began raising tariffs in 2018 under President Donald Trump, notably implementing a 25% tariff on steel imported from China and raising duties on other materials and products. In turn, China implemented its own tariff hikes on a wide range of goods. The trade squabble between the two countries escalated quickly.\nAlthough a subsequent trade deal helped reduce tensions to an extent, many of the tariffs implemented at the beginning of the trade dispute remain in place. Despite increasingly adversarial relations, trade between the U.S. and China has continued to reach new highs."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/information-technology/ai-stocks/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=96eb3cd4-0cbe-44d1-9a94-ac2d3fa38f33",
      "text": "Computers excel at crunching numbers but not at the things that many people do with ease, like language processing, visual perception, object manipulation, reasoning, planning, and learning. Artificial intelligence (AI), including its offshoots of deep learning and machine learning, uses computers to perform tasks that typically require human intelligence, such as language generation and facial recognition.\nHow do companies use AI?\nHow do companies use artificial intelligence?\nArtificial intelligence, or AI, is created through machine learning, which involves training a system with a tremendous amount of data. It then uses the trained system to make inferences about new data it's never seen.\nThe simplest example is a system designed to detect objects in images. Images containing those objects are provided to the system, which \"learns\" how to detect them in other images. The more objects it detects in images, the more accurate the detection system becomes.\nCompanies employ AI in two main ways. Many tech companies use it to make their existing operations more powerful through high-profile applications like robotics, self-driving cars, and virtual assistants. AI is used by Alphabet subsidiary (GOOGL -0.27%) (GOOG -0.3%) Google to filter spam in Gmail, by Amazon (AMZN -0.7%) to recommend products to customers, and by Netflix (NFLX 0.57%) to guide content creation and recommendations.\nMore recently, OpenAI's ChatGPT has shown how far generative AI -- a division of artificial intelligence capable of generating texts, images, sounds, and ideas -- has come. It can answer questions directly, write poems, and has even passed bar and medical exams. It has spawned a wave of new generative AI chatbots, including Anthropic's Claude, Alphabet's Gemini, and Meta AI from Meta Platforms (META -0.49%). The potential is enormous.\nThe next frontier for generative AI is AI agents or agentic AI. This is technology allows AI to perform to complete whole tasks without being prompted, such as automated customer service agents. AgentForce from Salesforce (CRM -3.51%) is one example of a new agentic AI tool.\nGenerative AI\nSome companies also profit directly from AI by selling hardware, software, services, or expertise that the technology requires. These are true AI stocks and include those listed and described below.\n5 AI stocks to buy in 2025\n5 AI stocks to buy in 2025\n| Company | AI Focus |\n|---|---|\n| Nvidia (NASDAQ:NVDA) | Data center GPUs and superchips. |\n| Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) | Generative AI and self-driving cars. |\n| Microsoft (NASDAQ:MSFT) | Memory chips for data centers and generative AI tools. |\n| CoreWeave (NASDAQ:CRWV) | Generative AI-focused cloud infrastructure platform. |\n| Meta Platforms (NASDAQ:META) | AI chatbots, LLMs, and wearable devices. |\n1. Nvidia\nLeading graphics processing unit (GPU) company Nvidia has taken advantage of the AI boom, with its GPUs becoming the de facto standard in data centers worldwide. Generative AI's training phase demands a lot of computing power; the phase that follows, the inference phase, typically requires less. GPU chips, which were once used primarily for rendering video games, support both phases well. Nvidia's ambitions have gone beyond GPUs, as the company now aims to build AI factories or data centers full of Nvidia components to run AI applications and programming.\nNvidia's data center business now makes up the vast majority of the company's revenue, thanks to the emergence of generative AI. Because it sells the building blocks for AI infrastructure, Nvidia became the first major company to see a significant revenue boost from AI. Revenue surged through 2023 and 2024, and the stock has soared as well. It's become the most valuable company in the world on several occasions and was No. 1 in mid-2025. In 2024, full-year revenue jumped 114% to $130.5 billion, driven by the surge in data center demand.\nIts chips are popular for running demanding workloads that applications like large language models require. The pure-play chip stock is now selling its new Blackwell platform, which major cloud infrastructure services are deploying in 2025, and demand is outstripping supply.\nSelf-driving cars and \"physical AI\" are other areas of focus. Nvidia develops hardware and software platforms that can power driver-assistance features and fully autonomous driving, which could be a significant source of revenue if that industry takes off. Automotive revenue is only a small fraction of the company's revenue, but that could change.\nWith Tesla (TSLA 2.85%) launching its robotaxi network in Austin, the autonomous vehicle race appears to be heating up, and that should be good news for the semiconductor sector.\nA self-driving car must process massive amounts of data from multiple sensors and cameras in real time, detect objects such as pedestrians and other vehicles, and make complex decisions. They require tremendous computing power, which is exactly what Nvidia's platform delivers.\nIts professional visualization segment, which includes its omniverse, also has potential in AI. Nvidia's chipsets could someday be supplanted by more specialized processors designed for AI, but the company is in an enviable position for now.\n2. Alphabet\nAlphabet has been preparing for the AI revolution for years, acquiring the AI research lab DeepMind in 2014. It's also among the leaders in autonomous vehicles through its Waymo subsidiary, which is now ferrying passengers in its driverless cars in cities including San Francisco and Phoenix.\nAlphabet launched Gemini, its own AI chatbot and the latest iteration in its competition with ChatGPT, which some see as a threat to Google Search. So far, concerns about a challenge to its search dominance seem to have been overblown as Alphabet's ad revenue continues to grow steadily. It said that its Gemini 2.5 has been \"widely recognized as the best model in the industry.\"\nWith information at the heart of its business, it's unsurprising that the company has prioritized AI. It's rolled out AI tools for Google Cloud and Google Workspace, including a generative AI assistant that helps write emails. Even its customer acquisition strategy in the cloud is based around AI -- the company has targeted AI start-ups for its cloud infrastructure service.\nAI also plays a role in improving its search engine and YouTube, where it can pinpoint a relevant section of a video and direct users straight to it.\nFinally, Alphabet is ramping up spending on capital expenditures with plans to spend $75 billion on AI infrastructure and related needs in 2025.\n3. Microsoft\nMicrosoft has gotten lots of buzz lately thanks to its partnership with OpenAI. The tech giant began investing in the tech start-up in 2019 and invested another $10 billion in OpenAI following the launch of ChatGPT.\nMicrosoft has incorporated GPT features across its product portfolio, including its Azure cloud infrastructure service, Edge web browser, Office productivity software suite, and Copilot for Microsoft 365. Azure OpenAI has seen a particularly strong uptake, now counting more than 65% of the Fortune 500 as customers.\nCEO Satya Nadella has repeatedly said that he sees AI as the next major computing platform, and the reported $13 billion investment in OpenAI is a sign of the company's conviction in AI and its belief that it needs to lead that transition or get left behind as it did with mobile.\nMore recently, Microsoft has begun diversifying away from OpenAI, adding both internal and third-party models to products like Microsoft 365 Copilot and Azure, including DeepSeek's R1. The long-term implications for its relationship with OpenAI are unclear, but Microsoft seems to think it's wise to hedge its bets in the AI race.\nMicrosoft is also harnessing the power of AI in other ways, including automated clinical documentation in healthcare to reduce paperwork and administrative needs. It's also using Azure to allow customers to build custom AI tools.\nThe company launched Azure AI Foundry in November 2024, which allows its customers to create and manage AI apps and agents. As of April 2025, developers at more than 70,000 companies are using it.\n4. CoreWeave\nCoreWeave, which had its initial public offering (IPO) in March 2025, may be the closest thing to a pure-play AI stock on the market, and it was the first major AI IPO.\nIts cloud infrastructure platform was designed specifically for AI, and it counts customers like Nvidia, OpenAI, Meta Platforms, and Microsoft as part of its core customer base; Nvidia and OpenAI are both investors in the company.\nCoreWeave has grown at an incredible pace over the last three years, going from generating almost nothing in revenue in 2022 to $1.9 billion in revenue in 2024. Between 2022 and 2024, revenue grew by more than 100 times.\nCoreWeave's business is risky since Microsoft accounted for 62% of its revenue, meaning the business would suffer significantly if Microsoft pulled back on spending with the platform. In its first quarter 2025 report, CoreWeave said that no single company accounted for more than half of its backlog, a sign that its customer concentration is improving.\nIf you're looking for direct exposure to AI, CoreWeave is a good option since essentially all of its revenue is driven by the demand for computing power to run generative AI programs. However, the stock is risky since CoreWeave has a high debt burden, has large capital expenditures, and is deeply unprofitable on a generally accepted accounting principles basis (GAAP).\n5. Meta Platforms\nUnlike the other big tech companies on this list, Meta Platforms doesn't have a cloud computing business, but the company is investing just as much in AI as peers like Alphabet.\nMeta AI, the company's chatbot that's available on its apps like Facebook, Instagram, and WhatsApp, now has 1 billion monthly active users as of May, and it continues to update its Llama large language model, which is now up to Llama 4.\nIt's also allowing its advertisers to use AI creative tools for things like background and video generation and ad copy. AI is also involved in ad targeting, and the company aims to fully automate advertising with AI by 2026.\nAdditionally, the company is incorporating AI in its hardware division, including its Ray-Ban smart glasses, which offer a built-in camera, open-ear audio, and a range of hands-free features. Its Meta Quest headsets are also connected to Meta AI, allowing users to tap into the power of AI through those headsets.\nManagement sees AI at the core of its business and driving its transformation across areas like advertising, experiences, and devices.\nMachine learning stocks\nMachine learning stocks\nAll the stocks above use machine learning technologies, but if you're looking for more options, here are two others worth considering:\n- Palantir (PLTR -2.27%): Palantir has been one of the top-performing AI stocks. The company provides cloud software and specializes in data fusion that helps its customers make important insights by connecting disparate pieces of information hidden in data. It also launched its AI Platform (AIP) in 2023, which has helped accelerate its growth. Palantir deploys machine learning models on top of data foundations and continuously improves them to ensure that they become more useful.\n- Tesla: Best known for its electric vehicles, CEO Elon Musk sees AI as the future of the company, and machine learning and neural networks are very much at the center of the company's autonomous vehicle and Optimus autonomous robot projects. Tesla introduced its driverless Cybercab in October 2024, and the company hopes to begin producing the vehicles by 2026. It launched its robotaxi network in June, though with just a handful of vehicles, and Musk envisions the company expanding to other cities in the near future. Musk has said Tesla's automation technology could make it the most valuable company in the world.\nDeep learning stocks\nDeep learning stocks\nDeep learning is a subset of machine learning that uses artificial neural networks inspired by the human brain. It's the most advanced kind of AI and is crucial in technologies like self-driving cars. Deep learning is advancing in areas such as preventive healthcare, where predictive algorithms are necessary. It differs from machine learning in that it doesn't require human input.\nNvidia is among the companies closely associated with deep learning. Its GPU chips use deep learning to power data centers and enable autonomous driving and cloud computing, among other functions.\nAlphabet has exposure to deep learning through a number of its businesses, including its autonomous vehicle start-up, Waymo. It also owns DeepMind, a deep learning platform that can diagnose eye diseases, predict the shapes of proteins, and accelerate the scientific discovery process.\nRelated investing topics\nA growth business\nAI is a growth business\nAccording to International Data Corporation, the global artificial intelligence market is expected to grow from $235 billion in 2024 to more than $631 billion in 2028.\nWhile the AI market is already large and still growing quickly, plenty of companies can profit from AI. Although picking stocks in a growth industry comes with a lot of uncertainty, these top AI stocks are all worth considering.\nFAQ\nArtificial intelligence stocks: FAQ\nWhat is the best AI stock to buy?\nArtificial intelligence is a fast-moving technology, and AI stocks will likely be volatile as the sector evolves. AI stocks that have attracted the most attention include Nvidia, Microsoft, and Alphabet, but finding the best stock to buy is also a matter of price and valuation, which changes quickly.\nIs it good to buy Nvidia stock?\nNvidia has jumped into the lead among semiconductor companies in making AI chips and accelerators, and it has the competitive advantages to help it stay there. The semiconductor sector can also be highly cyclical, and pricing can change rapidly. Additionally, there's the potential for unexpected surprises like the DeepSeek launch, which sent AI stocks like Nvidia plunging. If Nvidia can maintain its lead in AI chips, the stock should continue to be a winner, but it will likely be volatile since the AI landscape is still developing.\nWhat is the biggest AI company?\nCurrently, the biggest company that has made AI central to its business model is Nvidia, with a market cap that has soared past $3 trillion. The tech giant is at the center of the AI revolution as its components are fueling AI applications and are in high demand by major cloud infrastructure companies and others.\nIs AI good for investing?\nArtificial intelligence is likely to shake up the economy and the business world, creating opportunities in the stock market. Whether AI is good for investing will depend on the company, but there will be winners from the new technology.\nWhat company is No. 1 in AI?\nCurrently, Nvidia is broadly considered the leader in AI technology. The company has a monopoly-like market share in the data center GPU market, and its revenue has more than tripled since ChatGPT launched. Nvidia isn't guaranteed to remain the leader, though. Competition is on the way, and new technologies can change quickly.\nWill AI start-ups challenge tech giants?\nTech giants aren't feeling a significant threat from start-ups yet, but there are some signs that competition is on the rise. Alphabet stock, for example, fell when Apple said it was considering making AI search engines available on Safari, directly competing with Google.\nThe tensions between OpenAI and Microsoft also show that start-ups could begin to pose more of a threat to the \"Magnificent Seven\" stocks, though they are unlikely to derail their growth."
    }
  ],
  "argos_summary": "TMC The Metals Company (NASDAQ: TMC) experienced a significant stock pullback in July, dropping 10% despite a rising broader market, as trade negotiations between the U.S. and China progressed. The U.S. aims to secure access to Chinese rare earth minerals, which could impact TMC's growth trajectory, although the company still has opportunities in domestic mineral sourcing. As of August, TMC's stock continued to decline, down 10% for the month, but remains up 378% year-to-date, with a market cap of approximately $1.9 billion.",
  "argos_id": "Q9QAYS5U6"
}