{
  "url": "https://financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results",
  "authorsByline": "GlobeNewswire",
  "articleId": "6e6a8b20c2874d2592f613d81a7ee4c8",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/total-operating-costs-c1-us-per-pound.png",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-06T21:38:11+00:00",
  "addDate": "2025-08-06T21:47:08.874010+00:00",
  "refreshDate": "2025-08-06T21:47:08.874013+00:00",
  "score": 1.0,
  "title": "Taseko Announces Second Quarter Financial and Operational Results",
  "description": "VANCOUVER, British Columbia, Aug.  06, 2025  (GLOBE NEWSWIRE) — Taseko Mines Limited (TSX: TKO; NYSE American: TGB; LSE: TKO) (“Taseko” or the “Company”) reports se…",
  "content": "In the second quarter, Gibraltar completed the refurbishment and successfully restarted its solvent extraction and electrowinning (“SX/EW”) plant which had been idle since 2015 and produced 395 thousand pounds of copper cathode. Capitalized stripping costs totaling $30.8 million remained higher in the second quarter attributable to a higher than normal strip ratio for sulphide ore tons in the Connector pit. Total site costs* including capitalized stripping was $116.8 million in the quarter, higher than the prior quarter primarily due to higher mining rates. Total site costs were also higher than the prior year quarter due to mill downtime in 2024 related to a labour strike and crusher relocation project. Molybdenum production was 180 thousand pounds in the second quarter, comparable to 185 thousand pounds in the comparative prior year quarter. At an average molybdenum price of US$20.71 per pound for the quarter, molybdenum contributed a by-product credit of US$0.19 per pound of copper produced. Off-property costs of US$0.18 per pound of copper produced were consistent with the prior quarter and reflect Gibraltar’s 2025 offtake agreements with average treatment and refining charges (“TCRC”) of $nil for the year. Total operating (C1) costs* were US$3.14 per pound of copper produced in the second quarter compared to US$2.99 per pound of copper produced in the comparative prior year quarter. The increase in total operating (C1) costs was attributable to low site operating costs in the prior year from mill downtime, as well as lower copper production and lower molybdenum by-product credits in the current quarter, partially offset by higher capitalized stripping costs and lower off-property costs as outlined in the bridge graph below: Mining activity will continue to advance in the Connector pit, which will be the primary source of mill feed for the remainder of 2025 and the years ahead. Significant increases in head grades and recoveries, and higher mill throughput from processing the softer Connector pit ore, are expected in the second half of 2025 and continuing into 2026. Copper production for the year is expected to be 110 to 120 million pounds, including cathode production. Molybdenum production is also forecast to increase in the second half of 2025 as molybdenum grades are expected to be notably higher in Connector pit ore. The Company has offtake agreements covering Gibraltar concentrate production in 2025 and 2026, which contain significantly lower and in certain cases negative (premium) TCRC rates reflecting the tight copper smelting market. Offtake agreements are in place for substantially all of Gibraltar’s copper concentrate production in 2025 and 2026, and, based on the contract terms, the Company expects average TCRCs to be to around $nil in 2025 and 2026. The Company has a prudent hedging program in place to protect a minimum copper price and Gibraltar cash flow during the Florence Copper construction period. Currently, the Company has copper collar contracts in place that secure a minimum copper price of US$4.00 per pound for 54 million pounds of copper production for the remainder of 2025 (refer to “Financial Condition Review—Hedging Strategy” for details).\n\nThe Company has all the key permits in place for the commercial production facility at Florence and construction continues to advance on schedule. Over 900,000 project hours have been worked with no reportable injuries or environmental incidents. The Company has a fixed-price contract with the general contractor for construction of the SX/EW plant and associated surface infrastructure and activities are beginning to wind down from peak spend in the first quarter. All injection and recovery wells planned to be drilled during the construction phase were completed as of June 30, 2025. Remaining construction activities are advancing on plan and project areas will soon start transitioning to commissioning. Operational readiness remains a key focus for site management. Site activities are focused on hiring additional personnel and developing detailed operating plans for the ramp up of production, which is expected to begin before the end of this year. Florence Copper commercial facility construction costs were US$33.0 million in the second quarter and US$239.3 million has been incurred on the Florence Copper commercial facility construction as of June 30, 2025. The Company has a technical report titled “NI 43-101 Technical Report Florence Copper Project, Pinal County, Arizona” dated March 30, 2023 (the “Florence 2023 Technical Report”) on SEDAR+. The Florence 2023 Technical Report was prepared in accordance with National Instrument 43‑101 (“NI 43-101”) and incorporated the results of test work from the production test facility (“PTF”) as well as updated capital and operating costs (Q3 2022 basis) for the commercial production facility. Project highlights based on the Florence 2023 Technical Report are detailed below:\n• Net present value of US$930 million (at US$3.75 copper price, 8% after-tax discount rate);\n• Operating costs (C1) of US$1.11 per pound of copper produced;\n• Total life of mine production of 1.5 billion pounds of copper; and Based on the Florence 2023 Technical Report, the estimated construction costs for the Florence Copper commercial production facility were US$232 million and management continues to expect that total construction costs will be within 10% to 15% of this estimate. Taseko’s strategy has been to grow the company by acquiring and developing a pipeline of projects focused on copper in North America. We continue to believe this will generate long-term returns for shareholders. Our other development projects are located in BC, Canada. The Yellowhead copper project (“Yellowhead”) is expected to produce 4.4 billion pounds of copper over a 25-year mine life at an average C1 cost, net of by-product credit, of US$1.90 per pound of copper produced. During the first 5 years of operation, Yellowhead is expected to produce an average of 206 million pounds of copper per year at an average C1 cost, net of by-product credit, of US$1.62 per pound of copper produced. Yellowhead also contains valuable precious metal by-products with 282,000 ounces of gold production and 19.4 million ounces of silver production over the life of mine.\n\nThe converter pilot test is ongoing to provide additional process data to support the design of commercial process facilities, and final product samples to support product marketing initiatives. The Company is also conducting a scoping study to investigate the potential for Aley niobium oxide production to supply the growing market for niobium-based batteries. The Company’s Annual General Meeting was held on June 12, 2025 and shareholders voted in favor of all items of business before the meeting, including the continuation of the Company’s amended and restated shareholders rights plan for a 3-year period and the advisory resolution on executive compensation (Say-on-Pay), and the election of all director nominees. Detailed voting results for the 2025 Annual General Meeting are available on SEDAR+ at www.sedarplus.ca. In June 2025, the Company published its annual Sustainability Report titled C2 (Copper x Community) (the “Report”). The Report highlights Taseko’s operational and sustainability achievements, with an emphasis on the connection between copper production and the people, communities, and social environments that support and benefit from our operations and projects. With 20 years of successful operations under Taseko’s stewardship, 2024 marked a milestone year for the Company’s flagship operation, the Gibraltar mine. As Canada’s second-largest copper mine, Gibraltar continues to reflect Taseko’s commitment to operational excellence, health and safety, and delivering ‘360° of Value’ for all stakeholders. Florence Copper will soon become one of the lowest carbon and energy-intensive copper producers in the world, offering domestically produced, traceable and high-purity copper metal to support North American manufacturing and economic security. While profitable operations and return on investment are critical drivers for Taseko’s success, the Company also delivers value to its employees and operating communities, business partners, Indigenous Nations and governments. The Report is an opportunity to showcase the important benefits that the Company generates through its operations, investments and people. The full report can be viewed and downloaded at www.tasekomines.com/sustainability/overview. Conference Call and Webcast The Company will host a telephone conference call and live webcast on Thursday August 7, 2025 at 11:00 a.m. Eastern Time (8:00 a.m. Pacific) to discuss these results. After opening remarks by management, there will be a question and answer session open to analysts and investors. The conference call may be accessed by dialing 800-715-9871 toll free or 646-307-1963, using the access code 2521595. The webcast may be accessed at tasekomines.com/investors/events and will be archived until August 7, 2026 for later playback. For further information on Taseko, see the Company’s website at tasekomines.com or contact: No regulatory authority has approved or disapproved of the information contained in this news release This MD&A includes certain non-GAAP performance measures that do not have a standardized meaning prescribed by IFRS. These measures may differ from those used by, and may not be comparable to such measures as reported by, other issuers. The Company believes that these measures are commonly used by certain investors, in conjunction with conventional IFRS measures, to enhance their understanding of the Company’s performance. These measures have been derived from the Company’s financial statements and applied on a consistent basis. The following tables below provide a reconciliation of these non-GAAP measures to the most directly comparable IFRS measures.\n\nTotal operating cost includes all costs absorbed into inventory, as well as transportation costs and insurance recoverable. Site operating cost is calculated by removing net changes in inventory, depletion and amortization, insurance recoverable, and transportation costs from cost of sales. Site operating cost, net of by-product credit is calculated by subtracting by-product credits from site operating cost. Site operating cost, net of by-product credit per pound is calculated by dividing the aggregate of the applicable costs by pounds of copper produced. Total operating cost per pound is the sum of site operating costs, net of by-product credits and off-property costs divided by pounds of copper produced. By-product credit is calculated based on actual sales of molybdenum (net of treating costs) and silver during the period divided by the total pounds of copper produced during the period. These measures are calculated on a consistent basis for the periods presented. Average exchange rate for the period (Cdn$ / US$) Total site costs include site operating costs charged to cost of sales and mining costs capitalized to property, plant and equipment in the period. This measure is intended to capture total site operating costs incurred during the period calculated on a consistent basis for the periods presented. Adjusted net income (loss) removes the effect of the following transactions from net income (loss) as reported under IFRS:\n• Loss on settlement of debt, net of capitalized interest;\n• Gain on acquisition of control of Gibraltar;\n• Inventory write-ups to fair value that was sold or processed;\n• Tax effect of sale of non-recurring interest; and Management believes these transactions do not reflect the underlying operating performance of the Company’s core mining business and are not necessarily indicative of future operating results. Furthermore, unrealized gains and losses on derivative instruments, changes in the fair value of financial instruments, and unrealized foreign currency gains and losses are not necessarily reflective of the underlying operating results for the periods presented. Adjusted earnings per share (“Adjusted EPS”) is Adjusted net income attributable to common shareholders of the Company divided by the weighted average number of common shares outstanding for the period. Inventory write-ups to fair value that was sold or processed2 1 Other operating costs relate to the in-pit crusher relocation project and care and maintenance costs due to the June 2024 labour strike. 2 Inventory write-ups to net realizable value that was sold or processed relates to stockpile inventories that were written-up to fair value as part of the acquisition of control of Gibraltar. These write-ups have been included in Adjusted net (loss) income in the period when the inventories were sold or processed.\n\nLoss on settlement of debt, net of capitalized interest Gain on acquisition of control of Gibraltar2 Inventory write-ups to fair value that was sold or processed4 1 Other operating costs relate to the in-pit crusher relocation project and care and maintenance costs due to the June 2024 labour strike. 2 Gain on acquisition of control of Gibraltar relates to the write-up of copper concentrate inventory to fair value for Taseko’s 87.5% interest in Gibraltar at March 25, 2024. 3 Realized gain on sale of inventory relates to copper concentrate inventory held at March 25, 2024 that was written-up to fair value as part of the acquisition of control of Gibraltar, and subsequently sold. The realized portion of these gains have been added back to Adjusted net income in the period the inventory was sold. 4 Inventory write-ups to fair value that was sold or processed relates to stockpile inventories that were written-up to fair value as part of the acquisition of control of Gibraltar. These write-ups have been included in Adjusted net income in the period the inventories were sold or processed. Adjusted earnings before interest, taxes, depreciation and amortization (“Adjusted EBITDA”) is presented as a supplemental measure of the Company’s performance and ability to service debt. Adjusted EBITDA is frequently used by securities analysts, investors and other interested parties in the evaluation of companies in the industry, many of which present adjusted EBITDA when reporting their results. Issuers of “high yield” securities also present adjusted EBITDA because investors, analysts and rating agencies considering it useful in measuring the ability of those issuers to meet debt service obligations. Adjusted EBITDA represents net income before interest, income taxes, depreciation and amortization, and also eliminates the impact of a number of transactions that are not considered indicative of ongoing operating performance. Certain items of expense are added back and certain items of income are deducted from net income that are not likely to recur or are not indicative of the Company’s underlying operating results for the reporting periods presented or for future operating performance and consist of:\n• Gain on acquisition of control of Gibraltar;\n• Inventory write-ups to net realizable value that was sold or processed; and Inventory write-ups to fair value that was sold or processed1 1 Inventory write-ups to fair value that was sold or processed relates to stockpile inventories that were written-up to fair value as part of the acquisition of control of Gibraltar. These write-ups have been included in Adjusted EBITDA in the period when the inventories were processed. Gain on acquisition of control of Gibraltar1 Inventory write-ups to fair value that was sold or processed3 1 Gain on acquisition of control of Gibraltar relates to the write-up of copper concentrate inventories to fair value for Taseko’s 87.5% interest in Gibraltar at March 25, 2024. 2 Realized gain on sale of inventory relates to copper concentrate inventories held at March 25, 2024 that was written-up to fair value as part of the acquisition of control of Gibraltar, and subsequently sold. The realized portion of these gains have been added back to Adjusted EBITDA in the period the inventory was sold. 3 Inventory write-ups to fair value that was sold or processed relates to stockpile inventories that were written-up to fair value as part of the acquisition of control of Gibraltar. These write-ups have been included in Adjusted EBITDA in the period when the inventories were processed Earnings from mining operations before depletion, amortization and non-recurring items Earnings from mining operations before depletion, amortization and non-recurring items is earnings from mining operations with depletion and amortization, and any items that are not considered indicative of ongoing operating performance added back. The Company discloses this measure, which has been derived from the Company’s financial statements and applied on a consistent basis, to assist in understanding the results of the Company’s operations and financial position, and it is meant to provide further information about the financial results to investors. Earnings from mining operations before depletion, amortization and non-recurring items 1 Realized gain on sale of inventory relates to copper concentrate inventories held at March 25, 2024 that was written-up to fair value as part of the acquisition of control of Gibraltar, and subsequently sold. The realized portion of these gains have been added back to earnings from mining operations in the period the inventory was sold. 2 Realized gain on processing of ore stockpiles relates to stockpile inventories held at March 25, 2024 that was written-up to fair value as part of the acquisition of control of Gibraltar, and subsequently processed. These write-ups have been added back to earnings from mining operations in the period the inventories were processed. The Company discloses this measure, which has been derived from the Company’s financial statements and applied on a consistent basis, to provide assistance in understanding the Company’s site operations on a tons milled basis. The technical information contained in this MD&A related to Florence Copper is based on the report titled “NI 43‑101 Technical Report – Florence Copper Project, Pinal County, Arizona” issued on March 30, 2023 with an effective date of March 15, 2023, which is available on SEDAR+. The Florence 2023 Technical Report was prepared under the supervision of Richard Tremblay, P. Eng., MBA, Richard Weymark, P. Eng., MBA, and Robert Rotzinger, P. Eng. Mr. Tremblay is employed by the Company as Chief Operating Officer, Mr. Weymark is employed by the Company as Vice President, Engineering, and Mr. Rotzinger is employed by the Company as Vice President, Capital Projects. All three are Qualified Persons as defined by NI 43‑101. The technical information contained in this MD&A related to Yellowhead is based on the report titled “Technical Report Update on the Yellowhead Copper Project, British Columbia, Canada” issued on July 10, 2025 with an effective date of June 15, 2025, which is available on SEDAR+. The Yellowhead 2025 Technical Report was prepared under the supervision of Richard Weymark, P. Eng., MBA. Mr. Weymark is employed by the Company as Vice President, Engineering and is a Qualified Person as defined by NI 43-101. This document contains “forward-looking statements” that were based on Taseko’s expectations, estimates and projections as of the dates as of which those statements were made. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as “outlook”, “anticipate”, “project”, “target”, “believe”, “estimate”, “expect”, “intend”, “should” and similar expressions. Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the Company’s actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking statements. These included but are not limited to:\n• uncertainties about the future market price of copper and the other metals that we produce or may seek to produce;\n• changes in general economic conditions, the financial markets and in the market price for our input costs including due to inflationary impacts, such as diesel fuel, acid, steel, concrete, electricity and other forms of energy, mining equipment, and fluctuations in exchange rates, particularly with respect to the value of the U.S. dollar and Canadian dollar, and the continued availability of capital and financing;\n• inherent risks associated with mining operations, including our current mining operations at Gibraltar and our planned mining operations at Florence Copper, and their potential impact on our ability to achieve our production estimates;\n• uncertainties as to our ability to achieve reduced costs for Gibraltar (as defined below) and to otherwise control our operating costs without impacting our planned copper production;\n• our high level of indebtedness and its potential impact on our financial condition and the requirement to generate cash flow to service our indebtedness and refinance such indebtedness from time to time;\n• the increases in interest rates, by central banks may increase our borrowing costs and impact the profitability of our operations;\n• our ability to draw down on our financing arrangements for the construction of Florence Copper is subject to our meeting the required conditions for drawdown;\n• the amounts we are required to pay for our acquisition of Cariboo will increase with higher copper prices;\n• the risk of inadequate insurance or inability to obtain insurance to cover our business risks;\n• uncertainties related to the accuracy of our estimates of Mineral Reserves (as defined below), Mineral Resources (as defined below), production rates and timing of production, future production and future cash and total costs of production and milling;\n• the risk that we may not be able to expand or replace Mineral Reserves as our existing Mineral Reserves are mined;\n• the risk that the results from our development of Florence Copper will not meet our estimates of remaining construction costs, operating expenses, revenue, rates of return and cash flows from operations which have been projected by the technical report for Florence;\n• the risk of cost overruns or delays in our construction of the commercial facilities at Florence Copper, resulting in not commencing commercial production within our current projected timeline or within our current projected cost estimates;\n• uncertainties related to the execution plan for the construction of Florence Copper and the commencement of commercial operations resulting from inflation risk, supply chain disruptions, material and labour shortages or other execution risks;\n• our ability to comply with all conditions imposed under the APP and UIC permits for the construction and operation of Florence Copper;\n• the availability of, and uncertainties relating to, any additional financing necessary for the continued operation and development of our projects, including with respect to our ability to obtain any additional construction financing, if needed, to complete the construction and commencement of commercial operations at Florence Copper;\n• shortages of water supply, critical spare parts, maintenance service and new equipment and machinery or our ability to manage surplus water on our mine sites may materially and adversely affect our operations and development projects;\n• our ability to comply with the extensive governmental regulation to which our business is subject;\n• uncertainties related to our ability to obtain necessary title, licenses and permits for our development projects and project delays due to third party opposition;\n• uncertainties related to Indigenous people’s claims and rights, and legislation and government policies regarding the same;\n• our reliance on the availability of infrastructure necessary for development and on operations, including on rail transportation and port terminals for shipping of our copper concentrate production from Gibraltar, and rail transportation and power for the feasibility of our other British Columbia development projects;\n• changes in, and the effects of, the laws, regulations and government policies affecting our exploration and development activities and mining operations;\n• potential changes to the mineral tenure system in British Columbia, which is undergoing reform for compliance with the Declaration Act (British Columbia);\n• our dependence solely on our 100% interest in Gibraltar for our revenues and our operating cash flows;\n• our ability to extend existing concentrate off-take agreements or enter into new agreements;\n• environmental issues and liabilities associated with mining including processing and stockpiling ore;\n• labour strikes, work stoppages, or other interruptions to, or difficulties in, the employment of labour in markets in which we operate mines, industrial accidents, equipment failure or other events or occurrences, including third party interference that interrupt the production of minerals in our mines;\n• environmental hazards and risks associated with climate change, including the potential for damage to infrastructure and stoppages of operations due to extreme cold, forest fires, flooding, drought, earthquakes or other natural events in the vicinity of our operations;\n• litigation risks and the inherent uncertainty of litigation;\n• our actual costs of reclamation and mine closure may exceed our current estimates of these liabilities;\n• our ability to renegotiate our existing union agreement for Gibraltar when it expires in May 2027;\n• the capital intensive nature of our business both to sustain current mining operations and to develop any new projects including Florence Copper;\n• our ability to develop new mining projects may be adversely impacted by potential indigenous joint decision-making and consent agreements being implemented by the Government of British Columbia under the B.C. Declaration on the Rights of Indigenous Peoples Act;\n• the competitive environment in which we operate;\n• the effects of forward selling instruments to protect against fluctuations in copper prices and other input costs including diesel and acid;\n• the risk of changes in accounting policies and methods we use to report our financial condition, including uncertainties associated with critical accounting assumptions and estimates;\n• uncertainties relating to the war in Ukraine, the Israel-Hamas conflict and other future geopolitical events including social unrest, which could disrupt financial markets, supply chains, availability of materials and equipment and execution timelines for any project development;\n• recent changes to U.S. trade policies and tariff risks may adversely impact overall economic conditions, copper markets, supply chains, metal prices and input costs; and\n• other risks detailed from time-to-time in our annual information forms, annual reports, MD&A, quarterly reports and material change reports filed with and furnished to securities regulators, and those risks which are discussed under the heading “Risk Factors”. For further information on Taseko, investors should review the Company’s annual Form 40-F filing with the United States Securities and Exchange Commission www.sec.gov and home jurisdiction filings that are available at www.sedarplus.ca, including the “Risk Factors” included in our Annual Information Form.",
  "medium": "Article",
  "links": [
    "https://financialpost.com/category/financial-times/",
    "https://financialpost.com/news/condo-prices-suburbs-cratering?itm_source=trending",
    "https://pinterest.com/pin/create/button/?url=https://financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results&media=https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/total-operating-costs-c1-us-per-pound.png",
    "https://www.globenewswire.com/Tracker?data=pJi1wr0BI-Wz8Hb_P93L9N7MXoE7ZFoRgHSF3RPrBRCjkJ2pME9mkNDnZwjxgD95mOGhx4pGS-6XRiz63Wm7yA-t0I81lQQ8J1DmOpUl8lluGhi2363XdeRDRub1ue-4hZBBPCLFUol3vAYrnJBlIMc7hP_3_eqbFPgOqy6uMC4=",
    "https://www.linkedin.com/sharing/share-offsite/?url=https%3A//financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results",
    "https://www.globenewswire.com/Tracker?data=R9UV69RIu38IwhST9SdAs0iHmvOwKY0dlkMKOImlyhygxEz5td1eeE3j_3Eet8OmJoZL_-u3XX5ZvuzCBWQrHIHL1UbrX7JVAd81gAELEXI=",
    "https://financialpost.com/subscribe",
    "https://twitter.com/intent/tweet?url=https%3A//financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results&text=Taseko%20Announces%20Second%20Quarter%20Financial%20and%20Operational%20Results&via=",
    "https://financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results",
    "https://financialpost.com/commodities/steel-import-restrictions-spark-fear-shortages-western-canada?itm_source=trending",
    "https://financialpost.com/category/news/",
    "https://financialpost.com/category/fp-finance/banking/",
    "https://www.globenewswire.com/Tracker?data=mfm786XIsN800cVSuL8tajMuz-8omwUU5LbmRGEXxuUax-UUqCtEz8fgiUya3TjP2-e0p8rh3HL_9NQSTVYYT2uCgEnhIaF0eReq2OBblOhr0M3dEzcxtkWOKyBBmD8MDZn1xVwMCsQgHQiw4mxW-PvMlTpAU0AgWgd5HGWFdP0mzT8oZgJuUUdMekh3MT8dxo0-e1nR0RsZ4EYPZJ4umuBwxQQ2xh66cMxaElWNnfdn0mTBWIyj1pPqeIquguVxbrvnfvQxMPVb8e9H2kSMlg==",
    "https://financialpost.com/fp-finance/banking/imf-risks-canada-financial-system-bank-resilience?itm_source=trending",
    "https://financialpost.com/category/commodities/energy/oil-gas/",
    "https://financialpost.com/financial-times/berkshire-shares-tumble-as-warren-buffett-prepares-to-step-down?itm_source=trending",
    "https://www.tumblr.com/widgets/share/tool?canonicalUrl=https://financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results&title=Taseko%20Announces%20Second%20Quarter%20Financial%20and%20Operational%20Results",
    "https://financialpost.com/video-centre/",
    "https://www.reddit.com/submit?kind=link&url=https%3A//financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results&title=",
    "https://www.reddit.com/submit?kind=link&url=https%3A//financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results&title=Taseko%20Announces%20Second%20Quarter%20Financial%20and%20Operational%20Results",
    "https://financialpost.com/commodities/energy/oil-gas/trans-mountain-pipeline-revenue-oilpatch-windfall-governments?itm_source=trending",
    "https://financialpost.com/category/commodities/",
    "https://www.linkedin.com/sharing/share-offsite/?url=https://financialpost.com/globe-newswire/taseko-announces-second-quarter-financial-and-operational-results"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Other operating costs",
      "weight": 0.068701364
    },
    {
      "name": "Florence Copper commercial facility construction costs",
      "weight": 0.06587002
    },
    {
      "name": "Site operating cost",
      "weight": 0.06520887
    },
    {
      "name": "site operating cost",
      "weight": 0.06520887
    },
    {
      "name": "site operating costs",
      "weight": 0.06520887
    },
    {
      "name": "Copper production",
      "weight": 0.06512461
    },
    {
      "name": "copper production",
      "weight": 0.06512461
    },
    {
      "name": "total site operating costs",
      "weight": 0.06418016
    },
    {
      "name": "Total operating cost",
      "weight": 0.064157814
    },
    {
      "name": "lower copper production",
      "weight": 0.06321869
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97900390625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.8857421875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.87451171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.424560546875
    }
  ],
  "sentiment": {
    "positive": 0.5058594,
    "negative": 0.09979248,
    "neutral": 0.3942871
  },
  "summary": "Taseko has reported its second quarter financial and operational results, with Gibraltar completing the refurbishment and restarting its solvent extraction and electrowinning (SX/EW) plant, which had been idle since 2015 and produced 395 thousand pounds of copper cathode. Capitalized stripping costs remained higher at $30.8 million due to a higher than normal strip ratio for sulphide ore tons in the Connector pit. Total site costs including capitalized stripping increased to $116.8m, higher than the prior quarter due to higher mining rates and mill downtime in 2024 due to labour strike and crusher relocation project. Molybdenum production was 180 thousand pounds in the second quarter, comparable to 185 thousand pounds the previous year. The Company expects copper production for the year to be 110 to 120 million pounds, including cathode production, and expects molybondum production to increase in the future. The company also has offtake agreements in place for substantially all of Gibraltar’s copper concentrate production in 2025 and 2026. Construction costs for Florence Copper Project have been incurred at US$33.0m and US239239m as of June 2025. Over 900,000 project hours have been worked with no reportable injuries or environmental incidents. The firm has all the key permits in place and construction continues to progress on schedule.",
  "shortSummary": "Gibraltar completed a major refurbishment and restarted its SX/EW plant, despite higher site costs and higher molybdenum production, with future production expected.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "78bcfb8da1a44a5c8c80a530c1fa97ee",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://financialpost.com/fp-finance/banking/imf-risks-canada-financial-system-bank-resilience?itm_source=trending",
      "text": "IMF warns of rising risks in Canada's financial system despite bank resilience\nRising household debt, mortgage renewals and gaps in oversight could expose vulnerabilities in the years ahead, report says\nCanada’s financial system remains broadly resilient despite mounting economic uncertainty, the International Monetary Fund (IMF) said in its latest assessment — but warned that rising household debt, mortgage renewals and gaps in cyber and pension oversight could expose vulnerabilities in the years ahead.\nIn its 2025 Financial System Stability Assessment (FSSA), the IMF said Canada’s big banks, insurers and pension funds are well-capitalized and capable of withstanding major economic shocks.\nHowever, the report flagged growing risks tied to a wave of upcoming mortgage renewals, high household debt levels and a lack of coordination among financial regulators — including the Office of the Superintendent of Financial Institutions (OSFI), the Bank of Canada and provincial authorities — in responding to systemic threats such as cyberattacks, housing market shocks and climate-related disruptions.\nFor the banking and financial sector, the report said “total assets of financial institutions reached 756 per cent of GDP in 2024, increasing by 43.3 per cent since 2019.” Non-bank financial institutions (NBFIs) have become a dominant force in the sector, now accounting for 65 per cent of total assets.\nSince the last IMF review in 2019, the NBFI sector has expanded significantly, with investment fund assets growing from $2.6 trillion in 2020 to $3 trillion in 2023 — roughly 110 per cent of GDP. Canada’s insurance market ranked ninth globally in terms of written premiums, according to the report.\nPension funds continue to play an outsized role, holding $2.2 trillion in assets in 2023, or about 75 per cent of GDP — one of the largest pension sectors in the G7.\nThe IMF notes that while NBFIs remained resilient, data gaps and inconsistent oversight remain concerns, particularly for large pension plans. The sector has grown in size and importance since the 2019 assessment but regulatory coordination has not kept pace.\n- Cuts to Canada's growth 'stand out' in latest IMF economic outlook\n- Canada set to be fastest growing economy in G7 in 2025, IMF forecasts\n- Advertisement embed-more-topicStory continues below\nThe report said the banking sector’s Common Equity Tier 1 (CET1) ratio is 13 per cent. The CET1 ratio measures a bank’s core capital relative to its risk-weighted assets, indicating its ability to absorb losses. A higher ratio signals strong financial health and compliance with global regulatory standards.\nA 13 per cent CET1 ratio indicates that Canadian banks are well-capitalized — significantly above the international regulatory minimum of 4.5 per cent, and even above the commonly recommended levels of around 10–11 per cent. This gives them a strong buffer to absorb losses in times of economic stress.\nThe report raised concerns about the real estate market in Canada. “As of December 2024, approximately 60 per cent of mortgages will renew by 2026 at likely higher rates, which could increase payment burdens and delinquencies if economic conditions deteriorate,” it said.\nCanada has the highest household debt-to-GDP ratio among G7 countries, a key vulnerability flagged by the IMF. While it reflects strong credit access and homeownership, it also leaves households — and the broader economy — more exposed to rising interest rates, job losses or housing market downturns.\nOn the positive side, the report noted Canada’s mortgage delinquency rate stood at just 0.2 per cent in December 2024 — well below historical norms — suggesting most homeowners still managed to keep up with their payments despite rising rates in the last cycle.\nUnder the IMF’s 2025 adverse scenario, mortgage default rates are projected to rise to 0.9 per cent for uninsured loans and 1.4 per cent for insured loans, while corporate defaults could climb from 0.5 per cent to 1.3 per cent by 2027 — posing sharper risks than anticipated in 2019.\nThe report also warned that broader geoeconomic tensions — global conflict, shifting trade policies, reduced labour mobility and weak financial systems — posed a high risk to Canada’s economic outlook.\nOther emerging threats include cyber-attacks, climate change and a potential housing market correction. The IMF flags cyber risks as high, noting they could disrupt payment systems and undermine financial institutions’ ability to function.\nClimate-related disasters, such as wildfires and floods, carry medium-level risk, potentially triggering credit and liquidity stress. A sharp decline in home prices could drive up loan-to-value ratios, raise unemployment and curb household spending and investor confidence.\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/commodities/steel-import-restrictions-spark-fear-shortages-western-canada?itm_source=trending",
      "text": "‘We've got concerns’: Steel import restrictions spark fear of shortages in Western Canada\nMoves to shore up domestic steel mills risk creating price spikes and shortfalls that could reverberate through the economy\nTim McMenamin spent last week holding his breath: a vessel from the Philippines, carrying thousands of tonnes of steel rebar, was scheduled to land in the Port of Vancouver, and he didn’t know if he was going to owe millions of dollars in duties when it did.\nSince the U.S. trade war began, the federal government has repeatedly introduced new restrictions on steel imports — adding new risks for importers such as McMenamin, who is president of Jebsen & Jessen Hamburg GmbH.\nThe curbs on steel imports are designed to help Canada’s steel mills sell more products inside the country, and also to offset the losses they have suffered since the United States raised tariffs on foreign steel to 50 per cent earlier this year, which has essentially closed off their largest market.\nBut by Prime Minister Mark Carney’s own estimates, given at a July press conference, foreign-made steel accounts for two-thirds of all steel used in Canada — “a disproportionately high” amount compared to other countries, he said. Now, as Carney tries to shore up domestic steel mills, he runs the risk of creating price spikes and even steel shortages that could reverberate through the economy as importers pull back in the face of new policies that could saddle them with high duties.\n“Our customers are calling every week asking for our offers,” said McMenamin. “And we say we can’t because the government’s contemplating new trade measures, and we don’t know the rules.”\nThe situation cuts to the heart of a major policy dilemma that Carney must navigate: By restricting steel imports, he risks damaging the economy in parts of Canada that have historically relied on foreign steel for use in everything from new residential towers to bridges and other infrastructure projects.\nNot all steel is the same. There is rebar, the long steel rods that help prop up residential condo towers. There are also wide flange beams used in bridges and other projects. There are lampposts, and rails for trains and many other products — not all of which are produced or can be produced by Canada’s few remaining steel mills and fabricators.\n- Carney says Canada to curb steel imports to protect industry\n- Alcoa CEO says Trump tariffs force a pause for Canada growth projects\n- Advertisement embed-more-topicStory continues below\nAlthough Ottawa has taken a flexible approach, and continues to modify the steel restrictions, there is already concern that the latest wave of policies are too restrictive, particularly in Western Canada.\nRavi Kahlon, British Columbia’s minister of jobs and economic development, said his province imports about $4 billion worth of steel every year and he is concerned about shortages.\n“We’ve got concerns,” Kahlon said. “And we are having conversations with the federal government just to say, ‘We understand where you want to go. We understand why. But there has to be ways for us to get there without hurting ourselves along the way.’”\nB.C. and Western Canada may be at more risk than Eastern Canada, including Ontario and Quebec where there are more steel mills.\nThe challenge of matching steel demand to steel supply is that no one knows exactly how much steel is in the country: Construction companies typically bid on projects years in advance and keep inventory in lots. Some companies may also have stockpiled inventory at the first signs of the trade war.\nBut a lobbying group for the domestic steel production industry — which would be the biggest beneficiary of a reduction in foreign imports — continue to push for more restrictions, and so far Carney has gradually moved in their direction.\nIn June, for example, the federal government announced “tariff rate quotas” that limit countries that do not have a free trade agreement with Canada to importing no more steel than they imported last year.\nThen in mid-July, he announced a tightening of those policies. Non-free trade countries are now limited to importing half of the volume they imported in 2024 and free trade countries can only import the volume they sent to Canada in 2024. Any steel in excess of that quota triggers a 50 per cent tariff.\nCatherine Cobden, president of the Canadian Steel Producers Association, said the industry was hoping that non-free trade countries would be limited to 20 per cent of what they sent to Canada in 2024.\n“We are relieved to see some help,” she said, “It’s certainly a step in the right direction, but it won’t close the losses.”\nCobden said that Canada’s market is way too open: She noted that Carney said the U.S. relies on foreign steel for less than one third of its demand and foreign steel supplies one-sixth of the European Union’s demand, whereas in Canada that ratio is closer to two-thirds.\nEven many countries that signed free trade agreements with Canada have dumped steel here — a technical term for selling it below the cost of production, or less than what it sells for in their home market, Cobden added.\n“The world has a significant overcapacity in steel production,” she said. “Metal flows all over the world, and if it ends up in Canada, that’s the problem we need to address.”\nStill there is the issue of Canadian geography. While Cobden said the country’s domestic mills are capable of shipping products to Western Canada, builders and others in British Columbia and elsewhere say in practice it is often prohibitively expensive to ship steel by rail across the country.\nAs a result, British Columbia has repeatedly requested that Carney carve out their province from steel import restrictions because of the harmful effect it could have on its economy.\n“I think we’re not convinced at this point that we have the (domestic steel) capacity to meet the demand we have,” Kahlon said.\nMeanwhile, McMenamin and other steel importers say they understand why Ottawa would impose restrictions on certain types of steel, such as flat-rolled steel, which is primarily what domestic steel mills produce for the U.S. market.\nBut he and others argue that the measures announced in mid-July and formalized in a customs notice on Aug. 1 are actually more restrictive than anticipated because there are multiple layers.\nFor example, steel rebar had been subject to import quotas within the broader category of what is known as “long steel” products, but the new order creates a specific quota for rebar. It also says that no country can account for more than 29 per cent of the import quota.\nMcMenamin said his order from the Philippines contained 28,800 tonnes of steel rebar. But under the federal policy, no more than 33,613 tonnes of rebar can be imported per quarter from all non-free trade countries, of which the Philippines is only one of many. In addition, no more than 29 per cent of that can come from a single country, which amounts to about 9,700 tonnes.\nThat meant that while the ship was in transit, the federal government adjusted its policy such that he might have faced a 50 per cent tariff on about 19,000 tonnes, which he estimated would have added around $7 million to the total cost, if he did not already have an existing import licence for the shipment.\n“We would have (had) no choice but to increase the price in the market,” he said, adding that who would ultimately foot the bill would be a messy dispute between importers, distributors and developers.\nIn the end, the ship landed and cleared customs without having to pay the new duty, but McMenamin said he has paused making any new import deals because there’s too much uncertainty about how federal restrictions will evolve.\nMcMenamin said the current federal policy was “unfair” and “punitive,” and predicted that as steel prices rise, housing projects will be delayed, perhaps even cancelled.\n“That’s where the big pain is — when projects get cancelled,” he said.\n• Email: gfriedman@postmedia.com\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/financial-times/berkshire-shares-tumble-as-warren-buffett-prepares-to-step-down?itm_source=trending",
      "text": "Berkshire shares tumble as Warren Buffett prepares to step down\nConglomerate's stock underperforms market by second widest margin since 1990\nShares of Warren Buffett‘s Berkshire Hathaway Inc. have underperformed the wider market by one of the biggest margins in decades, as his retirement as chief executive nears and some investors head for the exits.\nBerkshire’s class A shares have tumbled 14 per cent since May 2, the last trading day before 94-year-old Buffett said he would hand control of Berkshire to top executive Greg Abel.\nBerkshire’s slide contrasts with a rally in the S&P 500 of 11 per cent, including dividends.\nBuffett is in the home stretch of a six-decade tour de force atop Berkshire, transforming a struggling textile mill into a financial conglomerate spanning sectors from insurance to natural gas pipelines. His returns, built on a buy-and-hold, value-driven strategy since he took over Berkshire in 1965, have outperformed the benchmark S&P 500 by more than five million percentage points.\nThat has created what CFRA analyst Cathy Seifert described as the “Buffett premium” on Berkshire shares — but one that may not immediately pass to his successor.\nThe lag to the S&P 500 is among the largest Berkshire has suffered over any three-month period stretching back to 1990, according to an analysis by the Financial Times. The company only trailed the index more on a three-month basis early in the pandemic, when investors slashed their equity positions, with insurers and financial services companies — core Berkshire holdings — particularly hard hit.\nIt is not yet known who has been selling class A shares, Berkshire’s original high-vote stock, which in May changed hands at a record US$812,855 apiece. The A shares have long been held by families who invested with Buffett earlier in his career, and passed down through generations. Quarterly reports from large institutional investors and hedge funds will not be disclosed until later this month.\nThe selling over the past three months has materialized even as Berkshire continued to report healthy operating results across its businesses, with the BNSF railroad, its handful of utilities and manufacturing, service and retailing divisions all reporting profit growth in the second quarter.\n- Can Bill Ackman create a 'modern-day' Berkshire Hathaway?\n- Warren Buffett's Canadian successor is a billionaire without many Berkshire shares\n- Advertisement embed-more-topicStory continues below\nOperating profits across the company were hit by currency moves, but excluding those shifts, Berkshire generated an eight per cent rise in earnings from a year earlier.\nBerkshire did not respond to a request for comment.\nBuffett’s investment horizon stretches over decades, and Berkshire shareholders said a three-month window was not a fair measure of the company’s performance.\nBerkshire shares had also surged in the months leading up to this year’s annual meeting in May, rising 18.9 per cent. Investors bought as markets whipsawed on United States President Donald Trump’s tariff war, turning to Berkshire as a haven.\n“As the worries about tariffs started to build…there were people rotating into the safety of Berkshire,” said Bill Stone, the chief investment officer of Berkshire investor Glenview Trust.\nThe Monday following Buffett’s May announcement, shares fell nearly five per cent.\nStone, who likened Berkshire’s US$344 billion cash and Treasury investment pile to Fort Knox, said investors have jumped back into fast-growing technology stocks in the ensuing months, as investor fears over a recession moderated.\n“What is really moving in this market is technology, and we know that’s not really his thing,” he added.\nThe rally in Berkshire shares earlier this year also pushed its valuation to heights it has rarely achieved since the global financial crisis. Berkshire’s price-to-book ratio, a measure of how its market capitalization compares to the value of its net assets, climbed to almost 1.8 times, its highest level since October 2008.\nBuffett, who oversees the company’s share repurchase program, stopped buying back Berkshire shares in May 2024. He repurchases stock when he “believes that the repurchase price is below Berkshire’s intrinsic value,” according to company filings.\n“The stock was overvalued,” said Christopher Bloomstran, the president of Berkshire shareholder Semper Augustus Investments. Bloomstran added that he believed the recent pullback might entice Buffett to start buying again soon.\nBuffett has also been taking chips off the table. Last year he sold a large portion of the company’s investment in iPhone maker Apple Inc., and Berkshire has now been a net seller of stocks for 11 consecutive quarters, pushing its cash levels to 30 per cent of total assets at the end of June.\nIn other periods of market exuberance, notably the dotcom bubble in 1999, Buffett sat on the sidelines. While that generated opprobrium from critics at the time, with Berkshire shares lagging the technology-heavy Nasdaq composite, the ensuing correction underscored his investment bona fides.\n© 2025 The Financial Times Ltd\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/news/condo-prices-suburbs-cratering?itm_source=trending",
      "text": "Posthaste: Condo prices in the suburbs are cratering\nSome regions seeing more than 50% drop from the peak\nCanada’s condo market has taken a beating recently, but nowhere more so than in the suburbs.\nPrices in communities surrounding Toronto such as Halton Hills, Ont., have plummeted by more than 50 per cent from their peak, says a report by Moody’s Analytics.\nBrampton, Mississauga and Oakville have also suffered “significantly” steeper losses than the City of Toronto itself.\nWhite Rock, B.C. and West Vancouver have seen peak-to-trough declines of 30 to 40 per cent compared with the national condo price drop of about 8 per cent.\n“Given the booming supply, proximity is commanding a premium, and periphery markets are giving back their pandemic gains,” said Brendan LaCerda, director of economic research at Moody’s.\nDuring COVID-19 lockdowns, prices soared in regions surrounding Toronto and Vancouver, as remote work prompted an exodus from downtown cores. In response, developers built more, and supply boomed, eroding the price premium on suburban condos, said the report.\nSince Canada’s housing market peaked in mid-2022, the performance of multifamily housing markets and that of single-family homes has diverged sharply, said Moody’s.\nBoth markets plunged when mortgage rates began to rise, but after bottoming out a year later, the single-family home market has made steady gains, while the multi-family market has suffered further declines.\nBy the first quarter of 2025, condo sales in the Toronto area had dropped 75 per cent from their peak in mid-2022, said Canada Mortgage and Housing Corporation in a separate report.\nMonths of inventory for pre-construction condominiums here hit a record high, 14 times higher than in 2022.\n- Why Canada's job market might be too good to be true\n- Canadian businesses cautiously optimistic as they absorb tariff challenges\n- Advertisement embed-more-topicStory continues below\nMoody’s said the outlook in the short run depends on how well the condo market can absorb the new inventory. Pre-construction sales were driven by low interest rates, but as these are reset at a higher rate, distressed borrowers could be forced to sell, putting more pressure on prices.\n“With a wave of new supply poised to hit the market and interest rates remaining elevated, the downward trend in condo prices is likely to endure,” said LaCerda.\nSign up here to get Posthaste delivered straight to your inbox.\nThe almighty American consumer seems to be taking a breather, and tariff price hikes may be to blame.\nAfter shrinking in May, U.S. real personal spending rose just 0.1 per cent in June, said Sal Guatieri, a senior economist with BMO Capital Markets.\n“Services spending was soft, but the real standout was a 0.5 per cent drop in durables even after a previous large decline,” he said.\nDurable goods have been hit by new duties, and as BMO’s chart shows, prices have climbed 3.2 per cent annualized over the past five months, the biggest increase in nearly three years.\nHousehold appliances spiked 16 per cent, computing equipment 14 per cent and home furnishings 5 per cent.\n“Further price increases are expected, which could depress consumption in the second half of the year,” said Guatieri.\n- The voting period for unionized Air Canada flight attendants on a strike mandate ends today.\n- Greater Vancouver realtors are expected to release July housing data today, followed by the Toronto Regional Real Estate Board Wednesday.\n- Today’s Data: Canada International merchandise trade, United States trade balance\n- Earnings: Suncor Energy Inc., Pfizer Inc., Great-West Lifeco Inc., Pet Valu Holdings Ltd., Molson Coors Beverage Co.\nIt’s mid-summer, and the markets — and the business world — just get weirder and weirder. From the meme stock revival to Donald Trump’s feud with Fed chair Jerome Powell, investing pro Peter Hodson looks at some of the summer’s more bizarre trends. Read on\nMcLister on mortgages\nWant to learn more about mortgages? Mortgage strategist Robert McLister’s Financial Post column can help navigate the complex sector, from the latest trends to financing opportunities you won’t want to miss. Plus check his mortgage rate page for Canada’s lowest national mortgage rates, updated daily.\nFinancial Post on YouTube\nVisit the Financial Post’s YouTube channel for interviews with Canada’s leading experts in business, economics, housing, the energy sector and more.\nToday’s Posthaste was written by Pamela Heaven with additional reporting from Financial Post staff, The Canadian Press and Bloomberg.\nHave a story idea, pitch, embargoed report, or a suggestion for this newsletter? Email us at posthaste@postmedia.com.\nBookmark our website and support our journalism: Don’t miss the business news you need to know — add financialpost.com to your bookmarks and sign up for our newsletters here\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    },
    {
      "url": "https://financialpost.com/commodities/energy/oil-gas/trans-mountain-pipeline-revenue-oilpatch-windfall-governments?itm_source=trending",
      "text": "Trans Mountain pipeline delivers $12.6 billion in new revenue to oilpatch, windfall to governments: report\nBut any new export pipeline may not bring the same kinds of financial benefits\nThe Trans Mountain pipeline — finished years behind schedule and massively over-budget — has delivered an estimated $12.6 billion in new revenues to the Canadian oilpatch and padded government budgets, according to a new report.\nStill, the report by the financial group Alberta Central says any new export pipeline that might be built under Prime Minister Mark Carney‘s nation-building infrastructure agenda would not likely bring in a similar windfall.\nThe expanded Trans Mountain pipe that stretches from Alberta to the British Columbia coast, which came into service in May 2024, has significantly boosted market access for Canadian oil and raised prices for the country’s producers, the report suggests.\n“Whether these benefits justify the $34 billion in cost is likely to remain a source of debate for many years to come, (but) our analysis suggests that the benefits from TMX will outweigh the costs in the long run,” Charles St-Arnaud, Alberta Central’s chief economist, said in the report.\nThe federal government under Justin Trudeau bought the Trans Mountain pipeline for $4.5 billion in 2018, but the price tag for the expansion later ballooned to $34 billion. And while it was the first new pipeline to the west coast in 70 years, it was finished six years behind schedule.\nStill, economists like St-Arnaud and the University of Calgary’s Trevor Tombe have argued it was worth every penny.\nTrans Mountain has increased Canadian oil shipments to refineries in the United States and more than tripled the share of exports to countries abroad, including China. This expanded market access has allowed Canadian oil producers to fetch higher prices.\nThe country’s heavy oil trades at a discount partly because the costs of refining it are higher. In recent years, the discount against North American prices expanded even more because there weren’t enough pipelines, leading to an oversupply.\n- Ottawa may not want to get out of the pipeline business just yet: Trans Mountain CEO\n- 'Northern Leg' to Trans Mountain pipeline attracts interest amid brewing trade war\n- Advertisement embed-more-topicStory continues below\nThe Trans Mountain expansion, which nearly tripled the pipeline’s capacity, has helped to ease that pressure and shave the discount to levels that are well below historical norms. As a result, the Alberta Central report suggests the pipeline boosted overall oilpatch revenues by $12.6 billion, an estimate that does not account for increased production made possible by the expansion.\nThe lift in prices is also expected to boost tax and royalty windfalls for the federal and provincial governments. Alberta could bring in $5.4 billion in additional funds, which would account for almost seven per cent of the province’s revenues for the 2024-25 fiscal year, according to the report.\nWhile the Trudeau government approved the pipeline project, the Liberals had also ushered in a spate of new policies that expanded environmental regulations and were widely seen in Alberta and Saskatchewan as hostile to the energy sector.\nThe Carney government is promising a change in tone with an agenda that favours oil and gas development. The prime minister has said a new oil export pipeline is “highly likely” to make a list of so-called nation-building projects that would receive much faster approvals from the federal government.\nStill, any new pipe may not bring the same kinds of financial benefits as Trans Mountain. A theoretical project — no private-sector proponent has come forward with a proposal — would not likely lead to even higher prices, according to the Alberta Central report. Instead, it would prevent Canadian prices from falling as companies produce more oil.\nAlready, there are signs that the country’s pipeline capacity may not be keeping pace with a rise in crude production. The energy analytics firm RBN Energy said in a recent note that the oilpatch could face bottlenecks within the next three years.\n“Things only get harder from here, because we don’t have additional pipeline capacity coming on now, and the pipeline capacity that we do have, we’re only going to keep filling it,” said Rory Johnston, publisher of oil market research report Commodity Context.\n“We’re going to run into pricing pressure earlier than you’d think.”\n• Email: rsouthwick@postmedia.com\nWith files from Meghan Potkins\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
    }
  ],
  "argos_summary": "In the second quarter, Gibraltar successfully restarted its SX/EW plant, producing 395 thousand pounds of copper cathode, while total site costs rose to $116.8 million due to increased mining rates and prior mill downtime. Molybdenum production remained stable at 180 thousand pounds, contributing a by-product credit of $0.19 per pound of copper. Looking ahead, copper production is projected to reach 110 to 120 million pounds for the year, with expectations of improved grades and recoveries from the Connector pit in 2025 and 2026. The Company is also advancing construction on the Florence Copper facility, with a focus on operational readiness and hiring additional personnel.",
  "argos_id": "QOI5AAHWE"
}