{
  "url": "https://time.com/7309176/trump-washington-dc-police-other-cities/",
  "authorsByline": "",
  "articleId": "fab6d7aa102f4aebb8fb3b22380f3d43",
  "source": {
    "domain": "time.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://api.time.com/wp-content/uploads/2025/08/GettyImages-2228827128.jpg?quality=85&w=1200&h=628&crop=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:01:22+00:00",
  "addDate": "2025-08-12T21:15:43.204871+00:00",
  "refreshDate": "2025-08-12T21:15:43.204872+00:00",
  "score": 1.0,
  "title": "Can Trump Take Over Police in Other Cities Like He Did D.C.?",
  "description": "Trump’s authority in cities that aren't Washington, D.C. is more limited.",
  "content": "President Donald Trump signed an executive order on Monday taking control of Washington, D.C.’s Police Department, part of a sweeping effort by his administration to crack down on crime. As 800 National Guard members and other federal law enforcement officers are fanning out across the nation’s capital, Democratic leaders elsewhere are wondering if their cities could be next. That speculation was fueled in part by Trump’s vow to intervene in other cities to fight crime, suggesting New York, Baltimore, Oakland as possible future targets. “They're so far gone,\" he said. “This will go further. We’re starting very strongly with D.C.\"\n\nBut Trump’s authority to take over local police forces and send troops to patrol streets beyond Washington, D.C. is severely limited by law, legal experts say, since most cities fall under state jurisdiction where governors control the National Guard and local law enforcement. The nation’s capital is not a state, giving the President a rare ability to deploy the National Guard and assume control of its police during declared emergencies. In other cities, the President cannot unilaterally commandeer police departments or deploy federal troops for ordinary law enforcement without state approval or a declared federal emergency, says Meryl Chertoff, an adjunct professor at Georgetown University Law School. “It was contemplated by the Founders that the states would retain a certain degree of autonomy and a certain degree of individuation,” Chertoff says. “Generally, the justification for the federal government to get involved is because either there's a commerce issue or a foreign policy issue that is national in scope.”\n\nShe adds, “When the President basically says ‘I govern all of it,’ the Constitution requires that there be some justification for that. And this notion that everything becomes an emergency is often used as a way of bypassing what would ordinarily be state autonomy.” In Washington, D.C., Trump invoked Section 740 of the District of Columbia Home Rule Act, which allows the president to take control of the city’s police during an emergency for up to 30 days. His declaration of the situation as a public safety emergency drew criticism from local officials, as violent crime in the city is at a 30-year-low. Attorney General Pam Bondi was named to oversee the Metropolitan Police Department, while 800 National Guard troops were deployed to patrol the streets. “Other cities are hopefully watching this,” Trump said. “They're all watching and maybe they'll self clean up and maybe they'll self do this and get rid of the cashless bail thing and all of the things that caused the problem.”\n\nThe law Trump invoked applies only to the District of Columbia because it lacks a governor to approve or deny the federal intervention. “Washington, D.C. is in a unique position and is uniquely powerless vis-à-vis the federal government,” Chertoff says. In contrast, cities like New York, Baltimore, and Oakland are in states with elected governors who have legal authority over the National Guard and local police. Many of those leaders have pushed back strongly against Trump’s threats to federalize their law enforcement. Baltimore Mayor Brandon Scott, who announced earlier this month that the city’s violent crime rate is at its lowest in decades, responded on social media: “This is the latest effort by the president to distract from the issues he should be focused on — including the roller coaster of the U.S. economy thanks to his policies,” Scott wrote. “When it comes to public safety in Baltimore, he should turn off the right-wing propaganda and look at the facts. Baltimore is the safest it’s been in over 50 years. Homicides are down 28% this year alone, reaching the lowest level of any year on record.”\n\nIllinois Governor J.B. Pritzker directly challenged Trump’s authority on X, writing, “Let’s not lie to the public, you and I both know you have no authority to take over Chicago,” after the president blamed him for crime in the city. While Trump can’t take over the police in other cities, he can deploy the military domestically under certain circumstances. Earlier this year, nearly 5,000 National Guard members and active-duty Marines were sent to Los Angeles to respond to immigration protests and protect federal agents, bypassing the state’s governor. In his first term, Trump sent federal agents and troops to patrol streets in cities like Portland in response to racial justice protests. In those situations, National Guard troops had specific mandates, and were not supposed to be involved in everyday policing. Legal experts argue that such deployments run afoul of the Posse Comitatus Act, a federal law that generally prohibits the use of the military for domestic law enforcement. Laura Dickinson, a professor at George Washington Law School, noted that while the president has broad authority to call up the National Guard in D.C., it is highly unusual—and legally fraught—to deploy military forces for routine crime control in cities without a clear federal emergency.\n\n“Democracies around the world and in our country, historically, don't use the military to do law enforcement on a regular basis,” Dickinson says, noting that the National Guard and Marines are not trained for every policing situation. “It's risky and harmful and impractical for all sorts of reasons.” A legal challenge over Trump’s declaration could soon be underway in D.C. Brian Schwalb, the city’s Attorney General, called the order “unlawful” but has not committed to filing a lawsuit against the Trump Administration. Any litigation would likely take longer than 30 days, the maximum period Trump can retain those emergency powers without Congressional approval. In California, courts are currently reviewing the legality of Trump’s order of federal troops to Los Angeles earlier this summer. Beyond direct intervention, Chertoff warns that the Trump Administration could leverage federal funding as a tool to pressure states and cities to comply with its law enforcement priorities “There is so much federal money going into states,” she says, “and what the President has done is say, if you don't cooperate with me on, let’s say, sanctuary city policies or immigration enforcement, I am going to withhold money that goes into your programs.”\n\nThis financial leverage, she says, is “doing indirectly what he cannot under the 10th Amendment, which provides states with a degree of autonomy.”",
  "medium": "Article",
  "links": [
    "https://x.com/MayorBMScott/status/1954941166690144610",
    "https://www.justice.gov/usao-dc/pr/violent-crime-dc-hits-30-year-low",
    "https://x.com/JBPritzker/status/1954949384875192606",
    "https://time.com/7309133/dc-crime-stats-trump-national-guard/",
    "https://time.com/7308904/dc-national-guard-trump-troops/",
    "https://time.com/7308788/trump-washington-dc-national-guard/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other federal law enforcement officers",
      "weight": 0.08680207
    },
    {
      "name": "Other Cities",
      "weight": 0.08357787
    },
    {
      "name": "Other cities",
      "weight": 0.08357787
    },
    {
      "name": "other cities",
      "weight": 0.08357787
    },
    {
      "name": "federal troops",
      "weight": 0.08127823
    },
    {
      "name": "National Guard troops",
      "weight": 0.08041887
    },
    {
      "name": "sanctuary city policies",
      "weight": 0.077182956
    },
    {
      "name": "cities",
      "weight": 0.07716688
    },
    {
      "name": "President Donald Trump",
      "weight": 0.076391466
    },
    {
      "name": "most cities",
      "weight": 0.0759087
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97412109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9580078125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.91259765625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.568359375
    }
  ],
  "sentiment": {
    "positive": 0.050906673,
    "negative": 0.7092949,
    "neutral": 0.23979843
  },
  "summary": "President Donald Trump has taken control of Washington, D.C.’s Police Department as part of a broader effort to combat crime. However, legal experts suggest that this authority is severely limited by law as most cities are under state jurisdiction. D. C. is not a state, giving the President a rare ability to deploy the National Guard and assume control of its police during declared emergencies. However in other cities, the President cannot unilaterally commandeer police departments or deploy federal troops for law enforcement without state approval or a declared federal emergency. The District of Columbia law only applies to D. Columbia as it lacks a governor to approve or deny the federal intervention. Critics argue that such deployments run afoul of federal law and are not involved in everyday policing.",
  "shortSummary": "President Donald Trump's executive order taking control of Washington, D.C, raises legal concerns about federal intervention in cities like New York and Baltimore.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "060fc0dddcb04ddf8aece9a63145c9ef",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://time.com/7308904/dc-national-guard-trump-troops/",
      "text": "President Donald Trump announced on Monday that he would take control of the police force in Washington, D.C. and deploy 800 National Guard troops to quell crime and remove homeless encampments in the city.\nFlanked by Defense Secretary Pete Hegseth and Attorney General Pam Bondi, Trump said he was deploying troops to “help reestablish law, order and public safety” in the nation’s capital, which he claimed had been “overtaken by violent gangs and bloodthirsty criminals.\" It comes just months after federal officials announced that violent crime in the city hit a 30-year low.\nThe move is the latest in a string of military deployments on home soil by Trump that experts say represents a marked departure from his predecessors.\nIt comes just two months after Trump deployed California’s National Guard to quell protests in Los Angeles over his immigration policies, after the protests had largely died down.\nRead more: ‘This Will Go Further’: Trump Puts D.C. Police Under His Control and Deploys National Guard\nWilliam Banks, professor of law at Syracuse University and an expert on the role of the military in domestic affairs, says Trump's move is likely intended as a “symbolic” show of power, especially after a former DOGE staffer’s assault in the city caught his attention.\n“Symbolism has always been very important to Trump,” Banks tells TIME. “Trump wants to clean the city up. He wants to make it look like the White House lawn.”\nBanks adds that the United States has always been “unique” in its allocation of law enforcement to civilians and its general refusal to use the military on its own citizens.\n“The [British] soldiers in the colonies ransacked people's homes, arrested people without cause, beat people up, stole their papers, [and] violated their privacy, so by the time of revolution and then the Constitution, we didn't have a good feeling about the presence of soldiers on our streets,” Banks says. “We want our members of our community, our neighbors, people that we know and recognize, in civilian uniform.”\nBanks acknowledges that the Constitution recognizes there may be “exceptional circumstances” where a military presence is required domestically, but that Presidents prior to Trump did so more sparingly. He points to what he calls “rights-promoting deployments” of the National Guard, including by Lyndon B. Johnson to desegregate schools in Alabama and Mississippi.\nThough Trump focused on D.C., he also hinted that the capital city is just the beginning, mentioning New York City, Baltimore, and Oakland—cities in which he has much less jurisdiction.\n“This will go further,” Trump said. “We are starting strongly with D.C.”\nHere is where Trump has chosen to deploy federal troops during his two terms.\nAlong the border\nDuring Trump’s first term, he deployed the National Guard to the U.S.-Mexico border in a bid to cut down on illegal immigration. Trump’s first term, much like his second, was defined by his aggressive immigration tactics.\nAt the time, Trump’s proclamation justified his deployment of troops by pointing to a surge of apprehensions at the border, while critics said that overall border crossings were at historic lows.\nThis deployment of the National Guard at the border continued during his second term. In May of this year, thousands of National Guard troops were deployed to the Southern Border, escalating his crackdown on immigration. “National Defense Areas” were established in New Mexico and Texas.\nImportantly, federal troops have been deployed at the border during previous Administrations, specifically to aid Border Patrol. Trump’s expansion of military zones along the U.S. border, though, has empowered the military to further act as a law enforcement body, detaining and searching those who they consider as trespassing in these defense areas.\nTypically, the President would need Congressional approval for defense areas and the creation of essentially a 170-mile military installation, but the President’s Day One declaration of a national emergency on the southern border in an Executive Order allowed him to sidestep this formalization.\nBlack Lives Matter protests, 2020\nIn May 2020, protests broke out across the country in response to the murder of George Floyd by a police officer. The protests marked one of the largest protest movements in U.S. history, with estimates of as many as 26 million people participating in the call for racial justice.\nTens of thousands of National Guard troops in over half of U.S. states were activated by state governors to deal with the Black Lives Matter protests, but Trump also used his own powers to deal with the unrest.\nIn August 2020, Trump deployed federal forces to Kenosha, Wisconsin, to quell protests in the aftermath of the shooting of Jacob Blake by a police officer.\nThe Department of Homeland Security (DHS) also sent hundreds of federal officers to Portland, Oregon, to handle protests, with some reports, including one from the ACLU, claiming that these federal agents grabbed protestors off the streets in unmarked vehicles. Tactical teams of the Customs and Border Patrol (CBP) were also sent to Seattle, Washington, though push back by former Washington Gov. Jay Inslee and former Mayor Jenny Durkan eventually led to their withdrawal.\nIn D.C., though, Trump, acting as Commander-in-Chief, deployed National Guard members from several states, despite public criticism from D.C. Mayor Muriel Bowser.\nTrump’s National Guard in D.C. also notoriously utilized tear-gas and rubber bullets against these Black Lives Matter protestors to disperse the demonstration and make room for a photo-op at St. John's Episcopal Church, which had been vandalized the night before during protests with a fire in the basement.\nEventually, Trump threatened to utilize the Insurrection Act to deploy military forces to suppress the protests, calling the protestors “terrorists.” Here, though, the Pentagon publicly broke from Trump, as Defense Secretary Mark Esper said he would prefer to not use active duty military on protests analyzed to have been mostly peaceful.\nBanks notes that Trump, as Commander-in-Chief of D.C., has more authority here than in the states, but adds “one of the ironies is that in one of the few instances where there really was a violent disturbance inside the district—January 6, [2021]—[Trump] did nothing.” He continued, stating that if Trump had deployed the National Guard during the Jan. 6 insurrection, “they could have stopped the Capitol rioting in 30 minutes.”\nLos Angeles, June 2025\nPresident Trump deployed the California National Guard and the Marines in June this year, ostensibly to quell protests in Los Angeles against Trump’s aggressive immigration policies and the intense escalation of deportations in the interior by Immigration and Customs Enforcement (ICE) agents.\nTrump’s deployment of the National Guard came with a Presidential Memorandum that invoked Title 10, Section 12406 of the U.S. Code, which allows for the federal deployment of National Guard forces in limited circumstances, including if “there is a rebellion or danger of a rebellion against the authority of the Government of the United States.”\nWhen deployed, however, the National Guard was tasked with protecting ICE agents and federal property, and troops were not authorized to perform any law enforcement activities. Trump was criticized for the move, with California Gov. Gavin Newsom calling the deployment “purposefully inflammatory” and the American Civil Liberties Union (ACLU) Southern California describing it as “akin to a declaration of war on all Californians.”\nCurrently, only 300 of the 5,000 troops deployed remain in Los Angeles, as a trial begins over the legality of Trump’s deployment in the first place. A California federal judge is to rule whether Trump’s use of the troops violates the Posse Comitatus Act, which limits the use of the military in domestic law enforcement."
    },
    {
      "url": "https://time.com/7309133/dc-crime-stats-trump-national-guard/",
      "text": "President Donald Trump promised on Monday to rescue Washington, D.C., from \"bloodshed, bedlam and squalor,\" describing a dystopian vision of the nation's capital that has been overtaken by \"violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged out maniacs and homeless people.\"\nInvoking section 740 of the District of Columbia Home Rule Act, Trump has deployed National Guard troops and is taking over the Metropolitan Police Department (MPD) to “help reestablish law, order and public safety” in the city.\nBut experts say the statistics don't match Trump's description of the city, and statements from his Administration have received pushback from local officials.\nAfter White House Deputy Chief of Staff Stephen Miller said that D.C. was “more violent than Baghdad,” D.C. Mayor Muriel Bowser said that “any comparison to a war-torn country is hyperbolic and false.”\nHere are the facts and figures regarding crime in Washington, D.C.\n“It's getting worse. Not getting better, it's getting worse.”\nThe primary justification for Trump’s intervention in Washington, D.C., appears to be that the city’s crime rate is getting increasingly worse. But that view is lagging by a couple of years.\nIn 2023, carjackings doubled and violent crime rates spiked to highs not seen in 20 years—part of a nationwide trend that followed the COVID-19 pandemic. But in the past two years, crime rates have in fact drastically decreased.\nTrump’s move on D.C. comes just months after the Department of Justice announced that violent crime in the city hit a 30-year low, and was down 35% in 2024 from the year before.\nAccording to data released by MPD covering this year to date, homicides are down 11% in comparison to the same period in 2024 and violent crime is down 26%.\nAlthough violent crime rates in Washington, D.C., are higher than the national average, the Council on Criminal Justice this week said that “there is an unmistakable and large drop in reported violence in the District since the summer of 2023 … consistent with what’s being reported in other large cities across the country.”\nRead more: Democrats Respond as Trump Targets Other Cities After D.C.\nPublic views on crime in D.C. haven’t quite caught up to the numbers, however. A 2024 Washington Post poll found that D.C. residents were growing more concerned about crime, despite figures showing declines. In the poll, 65% of residents said that they felt crime issues were “extremely serious” or “very serious.”\n“Caravans of mass youth rampage through city streets at all times of the day.”\nTrump specifically focused on juvenile crime, especially related to carjacking. That has been identified as an issue in the city in recent years.\nMPD data shows that 8 percent of D.C. arrests in 2024 were juveniles, but more than half of carjacking arrests involved a juvenile. Some reports have suggested that a rise in truancy in D.C. schools was behind an uptick in youth crime. Community leaders have spoken out previously about the “crisis” in youth crime.\nBut progress is being seen there, too. D.C. police data shows that the MPD made 900 juvenile arrests this year. That is down 20% from 2024.\nSince July 2025, a citywide curfew has been in force for youth in order to combat juvenile crime in the city, which statistically grows in summer months across the U.S., not just in D.C.\nViolence prevention groups have often touted the effectiveness of community violence intervention (CVI) efforts in these summer months, especially in cities like New York City in which gun violence has decreased.\n“The murder rate in Washington today is higher than that of Bogotá, Colombia, Mexico City, some of the places that you hear about as being the worst places on earth.”\nHere, Trump is technically correct. In 2024, Bogotá, Colombia, experienced a homicide rate of 15.2 per 100,000 inhabitants, according to its city council. Mexico City’s homicide rate, meanwhile, was reported to be around 10 per 100,000. Over the same period, meanwhile, Washington, D.C., saw a murder rate of approximately 27.3 per 100,000 residents.\nBut many people have taken issue with Trump’s description of those cities as “the worst places on earth.”\nPresident Claudia Sheinbaum of Mexico, a former Mexico City mayor, told reporters on Tuesday that while it was true that the city’s homicide rate is lower than D.C.’s, “What we don’t agree with is when he said it was the most insecure city in Latin America, because it’s not.”\nBogotá has also seen historic declines in its murder rate, and 2024 was a historic low. And most of Colombia’s violence in recent years has taken place in rural areas.\nD.C.’s crime rate is still far from those in “the worst places on earth.” Even in 2023, when the violent crime spike that Trump is discussing was occurring, at least 49 other cities in the world had higher homicide rates than D.C.\n“Every place in the country where you have no-cash bail is a disaster.”\nTrump has blamed a rise in crime on the use of “no-cash bail” in D.C., where cash bail has been effectively eliminated since 1992. This practice allows some defendants charged with lesser crimes to be released from jail without posting bail that would help ensure their return to court. In some cities, like New York City, bail reform has been put forward as a way to ensure that people do not wind up in jail just because they could not afford to post the required money.\nIn New York, part of the impetus for this bail reform was the story of Kalief Browder, a young man in the Bronx who was arrested at age 16 for allegedly stealing a backpack. His bail was initially set to $3,000, which his family could not afford, and he was sent to Rikers Island jail, though he maintained his innocence. Browder stayed in Rikers for three years before prosecutors dropped the case.\nAccording to the New York City Criminal Justice Agency, the percentage of those rearrested while awaiting trial has remained relatively the same since the bail reform.\nFurther, a report from the Brennan Center for Justice in August 2024 found that “there is no reason to believe that bail reform has led to increased crime.”"
    },
    {
      "url": "https://www.justice.gov/usao-dc/pr/violent-crime-dc-hits-30-year-low",
      "text": "Violent Crime in D.C. Hits 30 Year Low\nWASHINGTON - Total violent crime for 2024 in the District of Columbia is down 35% from 2023 and is the lowest it has been in over 30 years, according to data collected by the Metropolitan Police Department (MPD) and announced by United States Attorney Matthew M. Graves. A breakdown of the data is available here.\nIn addition to the overall violent crime reduction, homicides are down 32%; robberies are down 39%; armed carjackings are down 53%; assaults with a dangerous weapon are down 27% when compared with 2023 levels, with the District reporting the fewest assaults with dangerous weapons and burglaries in over 30 years.\n“The strategy this Office began to employ shortly after I came into this role has been to work with our law enforcement partners to focus on the drivers of violence - those gangs or crews of people who are dealing drugs, protecting turf, committing carjackings and other robberies, all while armed,” said U.S. Attorney Graves. “It takes time to develop these investigations and prosecutions, but this is the fruit of that labor - a reduction in the violent crime - that D.C. is now seeing.”\nA central component of this strategy has been targeting those crews who have preyed upon certain neighborhoods in our community, often operating drug trafficking networks in these neighborhoods. These proactive investigations and prosecutions have yielded immediate reductions in violence that have had lasting impact. For instance, an MPD analysis of crime trends in the area around MLK Mellon before and after a crew operating a drug market in that area was arrested revealed that there was a 66% reduction in violent crime in the area when comparing the six months prior to the arrests to the six months after the arrests. Even two years after these arrests, there was a 56% reduction in the number of homicides that occurred after the arrests when compared to the two years before.\nAnother key component of this proactive approach was implementing in April 2022, Project Safe Neighborhood - a daily review by the Office and our law enforcement partners of every firearms arrest in the District to determine, using objective criteria about the person arrested and the firearm recovered, whether the case should be charged in U.S. District Court or D.C. Superior Court. Since April 2022, the Office has accepted for prosecution in U.S. District Court more than 150 gun offenders under this initiative.\nFinally, the Office has continued to do all that it can to hold accountable those who commit violent crimes with firearms and those who illegally possess firearms. And the Office has committed to provide on a quarterly basis data related to these efforts - data that can be found here. This data reflects that in the first half of 2024, the Office was able to charge at the time of arrest more than 90% of arrests for violent crimes committed with guns and nearly 70% of gun possession arrests. The Office continues to investigate many of these arrests even if it does not charge on the day of arrest. Also in the first half of 2024, the Office obtained convictions in approximately 75% of these gun-related cases.\nThese numbers related to firearms offenses are critical and stand in stark contrast to the overall day-of-arrest charging rate for every arrest in the District of Columbia, which is a significantly less informative metric. The vast majority of arrests in the District of Columbia are for misdemeanor offenses that are often non-violent in nature. For such offenses, the Office has had a longstanding practice of giving great weight to victims’ wishes about whether they want charges brought. For a variety of reasons, a substantial number of victims do not want criminal charges brought for these relatively minor offenses.\nIn Fiscal Year 2019, the Office expanded into a new section the number of prosecutors devoted to reviewing arrests and examining body-worn camera (BWC) footage - Fiscal Year 2018 was the first Fiscal Year where BWC had been fully deployed for the entire year - to determine whether the BWC footage reflected issues that would later require the Office to dismiss a prosecution or if there were otherwise fatal flaws with the case. This section is called the Early Case Assessment Section (ECAS). The combination of BWC footage and ECAS’s early detection of arrests that, if charged, would later need to be dismissed led to relatively modest decreases in cases charged at the time of arrest in Fiscal Years 2018 and 2019.\nThe overall day-of-arrest charging rate dropped dramatically in Fiscal Years 2020, 2021, and 2022, as the global pandemic brought the criminal justice system to a halt and the D.C. Department of Forensic Sciences lost its accreditation in 2021.\nOur Office, along with our local partners, worked to overcome these challenges and the overall day-of-arrest charging rate in Fiscal Year 2024 of 57% is virtually identical to the 54% day-of-arrest charging rate that the Office reported in Fiscal Year 2019 after forming ECAS. More significantly, though, the Office dismissed far fewer of the cases it charged in Fiscal Year 2024 than it did in Fiscal Year 2018, so more arrests resulted in a prosecutorial outcome in Fiscal Year 2024 than in Fiscal Year 2018. For felonies, in particular, the percentage of cases with a prosecutorial outcome rose from 66% in Fiscal Year 2018 to 85% in Fiscal Year 2024.\nThere is value in addressing the issues, such as the lack of drug testing, that were preventing our Office from charging, at the time-of-arrest, non-violent misdemeanor offenses. While charging more non-violent offenses can benefit the community and offenders are often sentenced to periods of probation with services that hopefully aid in rehabilitation, these cases typically do not identify and remove violent offenders from the community. As is universally recognized, targeting the relatively limited number of individuals responsible for driving gun violence is the most impactful thing that prosecutors can do to contribute to the kinds of sharp declines in violent crime the District saw in 2024. To that end, multiple proactive investigations are already underway that should further reduce violent crime in 2025.\n##\nFollow us on Twitter, Instagram, and YouTube\nOr at https://www.justice.gov/usao-dc"
    },
    {
      "url": "https://time.com/7308788/trump-washington-dc-national-guard/",
      "text": "President Donald Trump announced Monday he was temporarily putting the Washington, D.C. police department under federal control and deploying the National Guard on the streets of the nation's capitol, a striking move taken over the objections of local leaders, who say Trump is exaggerating the city's crime problems.\nTrump said he declared a public safety emergency and invoked section 740 of the District of Columbia Home Rule Act, which gives the President of the United States the authority to commandeer DC's Police Department in “conditions of an emergency nature.” Attorney General Pam Bondi is now in charge of the Metropolitan Police Department, he said.\n\"It's time for dramatic action,\" Trump said at a press conference that stretched to over an hour as he took questions on a wide range of topics. He did not specify how long the federal takeover of D.C. would last, though the executive order signed on Monday declared the Administration would take over D.C. law enforcement “for the maximum period permitted” under the Home Rule Act, which is up to 30 days unless Congress authorizes an extension.\nTrump is launching a rare expansion of presidential authority over local government, and said he would not stop with the nation’s capital. In addition to Washington, Trump also mentioned other major cities where he wants to put police under federal control, including New York City, Baltimore, and Oakland. “They're so far gone,\" Trump said. “This will go further. We’re starting very strongly with D.C.\"\nIn recent days, Trump has deployed federal officers from the U.S. Park Police, Immigration and Customs Enforcement, the FBI, the Bureau of Alcohol, Tobacco and Firearms, and the U.S. Marshals Service on night patrols in D.C., according to ATF’s X account. On Monday, Defense Secretary Pete Hegseth suggested \"other\" specialized units will be deployed in Washington, D.C., at Trump's direction.\n“You will see them flowing into the streets of Washington in the coming week,” Hegseth said, without specifying how many. Trump added that he is prepared to send the military into D.C. “if needed,” a move some critics warn may be a prelude to the President declaring martial law, which involves military rule over a civilian population in times of crisis or emergency. Trump on Monday declared a “public safety emergency” in D.C., even though violent crime in the city is at a 30-year-low, and said that 800 National Guard members will soon be stationed in the city.\nTrump's deployment of the National Guard in Washington, D.C. is a rare use of military forces on U.S. soil and a potential violation of the Posse Comitatus Act that restricts the military from being used as a police force for domestic law enforcement. During racial justice protests in June 2020, Trump sent uniformed National Guard troops to Lafayette Park in front of the White House to help clear the park of protestors. Earlier this summer, Trump ordered nearly 5,000 National Guard troops to the Los Angeles area to quell immigration protests and protect federal agents.\nCrime in D.C. is down 7% so far in 2025 compared to the year before, and down significantly more from a recent peak in 2023, according to city police data. Violent crime, in particular, is down by 26%, while property crime is down 4%. In 2024, crime in D.C. was down 15% compared to the year before.\nBut Trump has long painted a different picture, with the President describing Washington as “one of the most dangerous cities anywhere in the World” in a post on Truth Social Saturday. On Sunday, Trump wrote, “I’m going to make our Capital safer and more beautiful than it ever was before. The Homeless have to move out, IMMEDIATELY. We will give you places to stay, but FAR from the Capital.”\nRead more: The Secret Presidential Crisis Powers Trump Could Deploy in a Second Term\nWashington, D.C. Mayor Muriel Bowser called the President’s police takeover “unsettling and unprecedented” but added that she isn't “totally surprised” by the move. “I think I speak for all Americans—we don't believe it's legal to use the American military against American citizens on American soil,” Bowser said at a press conference after Trump’s declaration. On MSNBC on Sunday, she said that Trump’s statements comparing the capital to a “war-torn country” are “hyperbolic and false.”\nIn a statement, the D.C. council warned that the National Guard has no public safety training or knowledge of local laws, and that its role does not include investigating or solving crimes. “Calling out the National Guard is an unnecessary deployment with no real mission,” the statement said, referring to Trump’s move as a “manufactured intrusion on local authority.”\nTrump’s takeover of the Metropolitan Police Department comes four years after the department’s officers were violently attacked by Trump supporters on Jan. 6, 2021. More than 140 police officers were injured during the seven hours that a mob laid siege to the Capitol demanding Congress overturn the results of the 2020 election. When Trump took office, he pardoned many rioters who had been convicted of assaulting D.C. police officers defending the Capitol building and lawmakers inside.\nSince Washington, D.C. does not have statehood, the President of the United States has broad leeway to deploy the National Guard. Democrats have often criticized Trump for not calling the National Guard to stop the violent attacks on Jan. 6, 2021. Trump has claimed without evidence that he did authorize sending the National Guard to the Capitol that day.\nSoon after Trump’s announcement on Monday, several hundred people had gathered outside the White House to protest Trump’s plans to take federal control of the police department.\nBowser, said on MSNBC on Sunday that Trump’s statements comparing the capital to a “war-torn country” are “hyperbolic and false.” According to city police data, violent crime in D.C. is down by 26% so far in 2025 compared to the year before.\nRep. Hakeem Jeffries, the New York Democrat and minority leader, excoriated Trump’s move on social media. \"Violent crime in Washington, D.C. is at a thirty-year low,\" he wrote. \"Donald Trump has no basis to take over the local police department. And zero credibility on the issue of law and order. Get lost.\"\nSeveral Democrats on Monday said they would introduce legislation to address Trump’s announcement, including one measure by D.C.’s non-voting delegate Rep. Eleanor Holmes Norton and Maryland Sen. Chris Van Hollen that would repeal the president’s authority to take temporary control of the D.C police and give the city’s mayor authority over the D.C. National Guard. The measure faces an uphill battle in the Republican-controlled Congress.\nTrump’s focus on public safety in the capital comes after former U.S. DOGE Service software engineer Edward Coristine, who is known by the nickname “Big Balls,” was injured during an alleged carjacking in DC early in the morning on Aug. 3. Two 15-year-old suspects were arrested in connection to the incident.\nJeanine Pirro, the U.S. Attorney for Washington, D.C., said that she wants to “change the law” so that early teens can be prosecuted as adults, claiming that juvenile offenders face little consequences in D.C., where the prosecution of juveniles is handled by the locally elected attorney general. “I can't touch you if you're 14, 15, 16, 17 years old and you have a gun,” she said. “They go to family court and they get to do yoga and arts and crafts. Enough. It changes today.”"
    }
  ],
  "argos_summary": "President Donald Trump signed an executive order to take control of the Washington, D.C. Police Department and deploy 800 National Guard troops, citing a public safety emergency despite local crime rates being at a 30-year low. Legal experts argue that Trump's authority to intervene in other cities is limited, as most fall under state jurisdiction, and local leaders have pushed back against his claims of rising crime. Critics, including D.C. Mayor Muriel Bowser, have labeled Trump's actions as exaggerated and unnecessary, warning of potential violations of the Posse Comitatus Act regarding military involvement in domestic law enforcement.",
  "argos_id": "QPC6MJU9L"
}