{
  "url": "https://www.theverge.com/law/758440/federal-courts-hacked-pacer-cm-ecf-russia",
  "authorsByline": "Richard Lawler",
  "articleId": "06befa3477cf4182a0eb59b6504959fe",
  "source": {
    "domain": "theverge.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/STK432_Government__CVirginia_C.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:18:29+00:00",
  "addDate": "2025-08-12T23:20:42.983862+00:00",
  "refreshDate": "2025-08-12T23:20:42.983863+00:00",
  "score": 1.0,
  "title": "Russia might be responsible for the PACER hack",
  "description": "It’s not the first time, either.",
  "content": "is a senior editor following news across tech, culture, policy, and entertainment. He joined The Verge in 2021 after several years covering news at Engadget.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nJust a few days after administrators announced that the “federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks,” the New York Times reports investigators have found evidence Russia is “at least partially responsible” for a recent hack. Politico reported on the breach last week, saying it was “believed to have exposed sensitive court data across multiple U.S. states” and that while the system’s managers had been aware of its impact since around July 4th, they are still trying to figure out its full extent.\n\nAfter the SolarWinds breach in 2021, new procedures called for highly sensitive documents to be filed using paper or a secure electronic device, and not uploaded to CM/ECF. In 2022, the DOJ reportedly informed the judiciary of another ongoing breach.\n\nAccording to the Times, district court chief judges were warned last month to keep cases with documents “related to criminal activity with an overseas tie” off of the usual document management system for federal cases, which is made up of the Case Management/Electronic Case Files (CM/ECF) where files are uploaded and managed, as well as PACER, a database that’s available to the public. It points to this order issued Friday by Eastern District of New York chief judge Margo Brodie, saying that, until further notice, “criminal cases and in cases related to criminal investigations are prohibited from being filed in CM/ECF,” and are instead to be uploaded to a separate system that doesn’t connect to PACER.\n\nThe vast majority of documents filed with the Judiciary’s electronic case management system are not confidential and indeed are readily available to the public, which is fundamental to an open and transparent judicial system. However, some filings contain confidential or proprietary information that are sealed from public view. These sensitive documents can be targets of interest to a range of threat actors. To better protect them, courts have been implementing more rigorous procedures to restrict access to sensitive documents under carefully controlled and monitored circumstances.\n\nFollow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates.",
  "medium": "Article",
  "links": [
    "https://www.theverge.com/2022/7/29/23283942/us-justice-department-federal-courts-data-breach-solar-winds",
    "https://www.theverge.com/2021/1/7/22219275/federal-judiciary-system-further-securing-sealed-documents-solarwinds-hack",
    "https://www.politico.com/news/2025/08/06/federal-court-filing-system-pacer-hack-00496916",
    "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system",
    "https://img.nyed.uscourts.gov/files/general-ordes/AdminOrder2025-10.pdf",
    "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system?utm_campaign=usc-news&utm_medium=email&utm_source=govdelivery"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "sensitive case documents",
      "weight": 0.11147347
    },
    {
      "name": "sensitive documents",
      "weight": 0.10147941
    },
    {
      "name": "sensitive court data",
      "weight": 0.08287458
    },
    {
      "name": "documents",
      "weight": 0.08228143
    },
    {
      "name": "federal cases",
      "weight": 0.08042093
    },
    {
      "name": "criminal cases",
      "weight": 0.080225214
    },
    {
      "name": "district court chief judges",
      "weight": 0.074346505
    },
    {
      "name": "cases",
      "weight": 0.07059119
    },
    {
      "name": "New York",
      "weight": 0.06408806
    },
    {
      "name": "the usual document management system",
      "weight": 0.061318405
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.86865234375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.75439453125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.72412109375
    },
    {
      "name": "/News/Other",
      "score": 0.5263671875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.491455078125
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.40185546875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.361083984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.31787109375
    }
  ],
  "sentiment": {
    "positive": 0.061469708,
    "negative": 0.60881424,
    "neutral": 0.3297161
  },
  "summary": "The federal Judiciary is reportedly taking additional steps to strengthen protections for sensitive case documents following a cyberattack that exposed sensitive court data across multiple U.S. states. The New York Times reports that investigators have found evidence that Russia is \"at least partially responsible\" for the hack. This follows a previous cyberattack on SolarWinds in 2021, which led to new procedures requiring highly sensitive documents to be filed using paper or a secure electronic device, not uploaded to the Case Management/Electronic Case Files (C/ECF) and PACER, a database available to the public. District court chief judges have been warned to keep cases with documents with an overseas tie off of the usual document management system for federal cases.",
  "shortSummary": "Russian hackers may have been behind the recent PACER hack that exposed sensitive court documents, prompting enhanced security for the federal Judiciary to enhance security.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "87aa5e2d512b41b69b93d8dc6436f9a0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system?utm_campaign=usc-news&utm_medium=email&utm_source=govdelivery",
      "text": "The federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks of a sophisticated and persistent nature on its case management system. The Judiciary is also further enhancing security of the system and to block future attacks, and it is prioritizing working with courts to mitigate the impact on litigants.\nThe Administrative Office of the United States Courts has continued to collaborate with Congress as well as the Department of Justice, the Department of Homeland Security and other partners in the executive branch to mitigate the risks and impacts of these cyberattacks.\nThe vast majority of documents filed with the Judiciary’s electronic case management system are not confidential and indeed are readily available to the public, which is fundamental to an open and transparent judicial system. However, some filings contain confidential or proprietary information that are sealed from public view.\nThese sensitive documents can be targets of interest to a range of threat actors. To better protect them, courts have been implementing more rigorous procedures to restrict access to sensitive documents under carefully controlled and monitored circumstances.\nEnhancing the security of its systems is a top priority for the Judiciary. Over the past few years, the Judiciary has added significant cybersecurity protections and safeguards to the case management system. The Chairman of the Judicial Conference’s Committee on Information Technology, Court of Appeals Judge Michael Y. Scudder, briefed the Conference and the media in September 2024 on potential threats to Judiciary IT systems and steps taken by the Judiciary to address them. Subsequently, in June of this year Judge Scudder testified before a House Judiciary subcommittee and underscored the Judiciary’s ongoing commitment to investing in and modernizing its IT systems in order to confront the constant and increasingly sophisticated cybersecurity threats the branch faces.\nAs other federal government and private entities likewise continue to experience, cyber risks continue to evolve as threat actors grow more sophisticated and change and adapt their tactics, and safeguarding legacy systems poses a particularly difficult challenge. In tackling cybersecurity threats, the Judiciary embraces its security obligations and remains committed to leveraging all available resources to include collaboration with law enforcement, national security and cybersecurity organizations, and other information sharing entities.\nSubscribe to News Updates\nSubscribe to be notified when the news section is updated."
    },
    {
      "url": "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system",
      "text": "The federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks of a sophisticated and persistent nature on its case management system. The Judiciary is also further enhancing security of the system and to block future attacks, and it is prioritizing working with courts to mitigate the impact on litigants.\nThe Administrative Office of the United States Courts has continued to collaborate with Congress as well as the Department of Justice, the Department of Homeland Security and other partners in the executive branch to mitigate the risks and impacts of these cyberattacks.\nThe vast majority of documents filed with the Judiciary’s electronic case management system are not confidential and indeed are readily available to the public, which is fundamental to an open and transparent judicial system. However, some filings contain confidential or proprietary information that are sealed from public view.\nThese sensitive documents can be targets of interest to a range of threat actors. To better protect them, courts have been implementing more rigorous procedures to restrict access to sensitive documents under carefully controlled and monitored circumstances.\nEnhancing the security of its systems is a top priority for the Judiciary. Over the past few years, the Judiciary has added significant cybersecurity protections and safeguards to the case management system. The Chairman of the Judicial Conference’s Committee on Information Technology, Court of Appeals Judge Michael Y. Scudder, briefed the Conference and the media in September 2024 on potential threats to Judiciary IT systems and steps taken by the Judiciary to address them. Subsequently, in June of this year Judge Scudder testified before a House Judiciary subcommittee and underscored the Judiciary’s ongoing commitment to investing in and modernizing its IT systems in order to confront the constant and increasingly sophisticated cybersecurity threats the branch faces.\nAs other federal government and private entities likewise continue to experience, cyber risks continue to evolve as threat actors grow more sophisticated and change and adapt their tactics, and safeguarding legacy systems poses a particularly difficult challenge. In tackling cybersecurity threats, the Judiciary embraces its security obligations and remains committed to leveraging all available resources to include collaboration with law enforcement, national security and cybersecurity organizations, and other information sharing entities.\nSubscribe to News Updates\nSubscribe to be notified when the news section is updated."
    },
    {
      "url": "https://www.theverge.com/2022/7/29/23283942/us-justice-department-federal-courts-data-breach-solar-winds",
      "text": "The federal courts’ document system was hit by a breach with a “startling breadth and scope” in early 2020, according to a report from Politico that cites testimony from House Judiciary Committee Chair Jerrold Nadler. The Department of Justice (DOJ) reportedly informed the judiciary about the breach in March and told lawmakers that an investigation is ongoing. Other lawmakers, such as Senator Ron Wyden (D-OR), expressed concern that the DOJ had been hiding information about the breach and was refusing to explain it to the public and Congress.\nNadler reportedly said that the “system security failure” was the work of “three hostile foreign actors,” though, according to Reuters, security officials for the DOJ didn’t specify which countries could be involved.\nThe courts have since moved their most sensitive files to paper or offline USB drives\nIn early 2021, the federal judiciary system announced that it would be going low-tech for its most sensitive documents, saying that they’d have to be delivered by hand instead of going through the publicly available Case Management and Electronic Case Files system. At the time, it cited the SolarWinds attack, which gave hackers access to the systems of dozens of businesses and government agencies, as the reason for the policy change. Although the SolarWinds attack is also thought to have begun in early 2020, the breach disclosed by Nadler is reportedly a separate incident.\nAt the moment, details about what the attackers had access to or how they managed to get into the judiciary’s systems aren’t publicly available. It’s also unclear when the attack was discovered by DOJ officials. The National Security Division of the Justice Department didn’t immediately respond to The Verge’s request for comment about the hack and subsequent investigation.\nMost Popular\n- Reddit will block the Internet Archive\n- GitHub just got less independent at Microsoft after CEO resignation\n- Ford reveals breakthrough process for lower priced EVs\n- RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks\n- This see-thru Game Boy is a work of art — because she designed a transparent circuit board"
    },
    {
      "url": "https://www.theverge.com/2021/1/7/22219275/federal-judiciary-system-further-securing-sealed-documents-solarwinds-hack",
      "text": "The list of companies and agencies discovering that they’ve been affected by the SolarWinds hack is still growing, and they’re working with a big unknown: how far the hackers got into their systems. The federal judiciary system is likely now one of them (via The Wall Street Journal), and it isn’t taking any chances. It’s worried enough that court workers will now have to physically deliver sensitive documents, despite the ongoing pandemic.\nThe judiciary’s new procedures sound rather intense:\nUnder the new procedures announced today, highly sensitive court documents (HSDs) filed with federal courts will be accepted for filing in paper form or via a secure electronic device, such as a thumb drive, and stored in a secure stand-alone computer system. These sealed HSDs will not be uploaded to CM/ECF.\nThe message here is clear: the judiciary does not want its most sensitive documents on the system until it figures out what the hackers have done to it, and it’s willing to add quite a bit of friction to the process of filing the documents. They can no longer just send them through the internet; they’ll have to hand-deliver actual paper or USB sticks.\nWe fully appreciate the practical implications of taking these steps and the administrative burden they will place on courts, yet any such burdens are outweighed by the need to preserve the confidentiality of sealed filings that are at risk of compromise.\nThe documents in question are not necessarily the regular sealed records of everyday court proceedings. The Wall Street Journal article points out that the HSDs could contain detailed explanations of how investigators work a case, as well as information on people who could currently be under surveillance. Knowing this information could help someone avoid detection or investigation, which is why it’s so important to keep it secure.\nWhile the measures show that the judiciary feels it can’t trust its existing networks, the public’s access to court records won’t be changing. Any records that would’ve been publicly available will still be uploaded to the Case Management and Electronic Case Files system.\nMost Popular\n- Reddit will block the Internet Archive\n- GitHub just got less independent at Microsoft after CEO resignation\n- Ford reveals breakthrough process for lower priced EVs\n- RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks\n- This see-thru Game Boy is a work of art — because she designed a transparent circuit board"
    }
  ],
  "argos_summary": "The federal Judiciary is enhancing protections for sensitive case documents due to recent cyberattacks, with evidence suggesting Russian involvement in a significant breach. In response, the Judiciary has implemented new procedures requiring that highly sensitive documents be filed using paper or secure electronic devices, avoiding the usual electronic case management system. This shift aims to safeguard confidential information from increasingly sophisticated cyber threats while maintaining public access to non-confidential court records.",
  "argos_id": "R141XL550"
}