{
  "url": "https://www.latimes.com/california/story/2025-08-12/curren-price-charges",
  "authorsByline": "By James Queally and Dakota Smith",
  "articleId": "b1a3e89c45bb403cae7fbd97ba88c1a7",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/f6a7587/2147483647/strip/true/crop/7472x3923+0+544/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff2%2F1d%2F44a625b5490c922aaa4c7b6f6815%2F1476108-me-0920-harris-dawson-council-president-gem-014.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:32:35.396000+00:00",
  "addDate": "2025-08-12T22:37:31.444976+00:00",
  "refreshDate": "2025-08-12T22:37:31.444977+00:00",
  "score": 1.0,
  "title": "L.A. City Councilman Curren Price to face new corruption charges, sources say",
  "description": "Prosecutors are expected to file additional charges against City Councilman Curren Price this week. He was first accused in 2023 of embezzlement, perjury and violating state conflict of interest laws for votes on city business that could have financially benefited his wife.",
  "content": "L.A. County prosecutors plan to file additional corruption charges this week against City Councilman Curren Price, who is already facing multiple counts of grand theft and perjury for allegedly voting in favor of projects his wife had a financial interest in, multiple sources told The Times.\n\nThe charges were expected to be made public Thursday during a pretrial hearing in downtown L.A., according to three people with knowledge of the situation, who requested anonymity in order to speak candidly about an ongoing criminal case.\n\nIn June 2023, Price was charged with 10 counts of grand theft by embezzlement, perjury and conflict of interest. Prosecutors said Price’s wife — Del Richardson, founder of the consulting company Del Richardson & Associates — received “payments totaling more than $150,000 between 2019 and 2021 from developers before [Price] voted to approve projects.”\n\nThe perjury charges stem from a claim that Price didn’t list his wife’s income on disclosure forms. Prosecutors also accused Price of theft by embezzlement for bilking the city out of tens of thousands of dollars by placing Richardson on his city-issued healthcare plan between 2013 and 2017, before they were legally married.\n\nPrice’s attorney, Michael Schafler, called the new charges “nothing more than an attempt to pile on to a weak case.”\n\n“They have gone back as much as 6 years, combing through thousands and thousands of votes, to find a couple more allegedly conflicted votes, hoping that the public will overlook the fact that there is no evidence whatsoever that Councilmember Price was aware of the alleged conflicts when he voted for the agenda items,” Schafler said in a statement.\n\nThe original criminal complaint was filed roughly four years after a Times investigation found Price had repeatedly cast votes that affected housing developers and other firms listed as clients of his wife’s consulting company.\n\nThe new charges relate to similar conduct related to votes that Price cast, according to two of the sources. One of the sources said the votes related to contracts for the Los Angeles County Metropolitan Transportation Authority and the city’s housing authority.\n\nA spokesman for the Los Angeles County district attorney’s office said a press release would be issued later on Tuesday.\n\nIn an October 2023 motion seeking to dismiss the charges, Price’s legal team argued prosecutors failed to show the payments to Richardson had any influence on the councilman’s votes. Many of the votes described in the criminal complaint were also approved by an overwhelming majority of the council, meaning Price did not swing any one decision that could financially benefit Richardson.\n\nSchafler also argued the embezzlement charges are invalid because Price did not have control over the funds used to pay for Richardson’s healthcare, which is a required element of the crime under California law. Price’s conduct might meet the definition of grand theft, Schafler wrote in 2023, but the statute of limitations for that crime had long expired.\n\nA judge rejected Schafler’s motion. Price is expected to face a preliminary hearing later this year.\n\nPrice, who was first elected in 2013, must leave office due to term limits at the end of 2026. Several candidates have already launched campaigns to replace him in a district that stretches from the Los Angeles Convention Center in downtown to 95th Street in South L.A.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/california/story/2023-10-13/la-city-councilman-curren-price-challenges-perjury-embezzlement-charges",
    "https://www.latimes.com/california/story/2024-05-08/kevin-de-leon-and-curren-price-get-back-onto-council-committees",
    "https://www.latimes.com/california/story/2025-05-22/former-irvine-city-councilmember-charged-with-perjury-multiple-felonies-in-alleged-election-fraud"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Curren Price",
      "weight": 0.10457285
    },
    {
      "name": "Price",
      "weight": 0.10366083
    },
    {
      "name": "Councilmember Price",
      "weight": 0.10231693
    },
    {
      "name": "City Councilman Curren Price",
      "weight": 0.09822703
    },
    {
      "name": "L.A. City Councilman Curren Price",
      "weight": 0.09800866
    },
    {
      "name": "new corruption charges",
      "weight": 0.08083669
    },
    {
      "name": "additional corruption charges",
      "weight": 0.075799614
    },
    {
      "name": "Del Richardson",
      "weight": 0.07228309
    },
    {
      "name": "Los Angeles County",
      "weight": 0.07217288
    },
    {
      "name": "L.A. County prosecutors",
      "weight": 0.07168644
    }
  ],
  "topics": [
    {
      "name": "Corruption"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.990234375
    },
    {
      "name": "/News/Local News",
      "score": 0.96533203125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.958984375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.93017578125
    },
    {
      "name": "/News/Other",
      "score": 0.6845703125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.63427734375
    }
  ],
  "sentiment": {
    "positive": 0.07218276,
    "negative": 0.66119254,
    "neutral": 0.2666247
  },
  "summary": "L.A. County prosecutors are planning to file additional corruption charges against City Councilman Curren Price, who is already facing multiple counts of grand theft and perjury for allegedly voting in favor of projects his wife, Del Richardson, had a financial interest in. The charges are expected to be made public during a pretrial hearing in downtown L.A., according to three people with knowledge of the situation. The original criminal complaint was filed four years ago after a Times investigation found Price had repeatedly cast votes that affected housing developers and other firms listed as clients of his wife's consulting company. In June 2023, Price was charged with 10 counts of felony grand theft by embezzlement, perjury and conflict of interest. His attorney, Michael Schafler, called the new charges an attempt to add weight to a weak case.",
  "shortSummary": "L.A. County prosecutors plan to file additional corruption charges against City Councilman Curren Price, accused of voting in favor of his wife’s financial interests.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "50f9e195474b4053912b2dbc68add60d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2023-10-13/la-city-councilman-curren-price-challenges-perjury-embezzlement-charges",
      "text": "L.A. City Councilman Curren Price challenges perjury, embezzlement charges\n- Share via\nIn the most full-throated defense yet against charges of perjury and embezzlement, a lawyer for L.A. City Councilman Curren Price has argued that a shoddy investigation by prosecutors failed to prove the veteran Democrat had a conflict of interest in votes he cast between 2019 and 2021.\nIn a 16-page court filing made public Friday, attorney Michael Schafler said prosecutors failed to show payments from housing developers to a consulting company owned by Price’s wife, Del Richardson Price, had any influence on Price’s votes to approve the sales of city property to those developers.\nSchafler said the district attorney’s office could not say Price knowingly violated laws governing conflict of interest “after conducting a superficial investigation in which it neglected to interview Councilmember Price, his wife, or even the members of Councilmember Price’s staff who screen agenda items for conflicts.”\nIn June, Price was charged with five counts of grand theft by embezzlement, three counts of perjury and two counts of conflict of interest, the latest in a string of city officials to face public corruption charges in recent years.\nThe councilman has denied all wrongdoing and described the charges against him as “unwarranted.” But he has yet to enter a plea in the case, and his arraignment was again delayed into December after a brief court hearing on Friday morning.\nProsecutors allege Price voted to approve the sale of land to, or fund projects for, developers who had paid his wife’s company, Del Richardson & Associates, for consulting work on multiple occasions. He then committed perjury, authorities said, by failing to identify those income sources on governmental financial disclosure forms.\nThe district attorney’s office asked for further work because of shortcomings in the LAPD’s initial investigation, according to two law enforcement sources familiar with the case.\nPrice was also accused of five counts of embezzlement because he listed Richardson as his wife on city forms from 2013 to 2017, collecting more than $30,000 in medical premiums for her despite the fact that he was legally married to another woman at the time.\nPrice’s lawyer called the connections between Price and the companies who had paid Richardson Price “gossamer thin,” noting in his court filing that the votes in which Price is charged with having a conflict were not controversial. Each measure would have passed with or without Price’s vote, records show.\n“The complaint is devoid of any allegation whatsoever that [Del Richardson & Associate’s] work or the developer’s payments had anything whatsoever to do with the approvals of the contracts, which were non-controversial and unanimously approved on the consent calendars,” Schafler wrote.\nThe attorney also argued prosecutors cannot charge Price with embezzlement because he did not have control over the funds used to pay for Richardson Price’s healthcare, which is a required element of the crime under California law. Price’s conduct might meet the definition of grand theft, Schafler wrote, but the statute of limitations for that crime had long expired.\nThe document Schafler filed is a challenge to the legal basis of a criminal filing but not an outright motion to dismiss the charges. L.A. County Deputy Dist. Atty. Casey Higgins, who is prosecuting the case, said Friday he believed the motion “will fail.”\nHiggins said prosecutors had no reason to interview Price’s staff, as any “implication that his staff dropped the ball” or failed to warn the councilman of a potential conflict of interest “is not a legal defense.” He also said Schafler’s argument that prosecutors missed the statute of limitations on any charges was inaccurate, since they had four years from the date they discovered the misconduct to file charges, not from the date of the actual crime.\nSchafler’s concerns echoed those raised by some of Price’s allies on the City Council. Councilmember Marqueece Harris-Dawson, who replaced Price as the No. 2 on the Council shortly after the charges were filed, said the charges left him and other elected officials “scratching their heads.”\n“It’s just unclear. I’ve not seen a felony charge for this type of activity. I’ve seen ethics violations for this type of activity,” Harris-Dawson said. “So it leaves me curious.”\nNo other council member has publicly spoken out in defense of Price."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-05-22/former-irvine-city-councilmember-charged-with-perjury-multiple-felonies-in-alleged-election-fraud",
      "text": "Former Irvine City Council member charged with perjury, multiple felonies in alleged election fraud\n- Share via\n- The Orange County district attorney’s office announced that Tammy Kim was charged with 10 felonies. The former Irvine City Council member is accused of lying about her residency.\nOnly a few months ago, former Irvine Vice Mayor Tammy Kim had aspirations of returning to the City Council she previously served on for four years.\nNow her immediate goal is to fight off charges that could put her in prison for several years.\nThe Orange County district attorney’s office announced Thursday afternoon that Kim was charged with 10 felonies tied to allegedly lying about her residency during her City Council tenure and while campaigning for mayor last fall.\nKim was formally charged with three felony counts of perjury by declaration, three felony counts of filing a false document, and one felony count each of a public official aiding the illegal casting of votes, of filing false nominations papers, of knowing of the registration of someone not entitled to vote and of voter registration fraud. She was also charged with a misdemeanor of making a false statement.\nShe could spend up to 11 years and two months in state prison and county jail if convicted on all counts.\nShe is scheduled to be arraigned Friday morning.\nKim briefly responded to a call from The Times, saying she was advised not to share too much per her attorney, Caroline Hahn.\n“We’re entering a not guilty plea,” Kim said.\nThree Korean American women win seats in Congress, including Young Kim and Michelle Steel from Southern California.\nHahn added that she and her client “planned to launch a vigorous defense” but did not answer further questions.\nKim is accused of using two fraudulent addresses while running for mayor in the November 2024 election and then in a City Council special election in early 2025, according to the criminal complaint. She owned a condo in the city’s 3rd District, where she had lived since 2015, according to a separate lawsuit filed against Kim to get her thrown off the City Council ballot.\nKim won election to the Irvine City Council in November 2020, receiving nearly 44,000 votes in a 14-person, top-three-candidate race.\nAt that time, city elections in Irvine used an at-large voting system, meaning candidates could live anywhere in the city.\nThe city moved to district elections in the fall 2024, requiring council members to live in the districts they represent. Only voters from those districts could vote for those candidates.\nKim served until November 2024 when she ran for and ultimately lost a mayoral campaign to Councilmember Larry Agran by a margin of nearly 5,000 votes.\nThe district attorney’s office believes Kim improperly used an address to run for mayor, no longer claiming to live in the 3rd District condo she had owned for a decade.\nTo run for mayor, Kim changed her California driver’s license and her voter registration to a home in the 5th District, where she never lived, according to the criminal complaint.\nThe home belonged to a family Kim met through a Korean teaching class, the complaint alleges. Kim did not inform the family that she was using their address, according to the complaint.\nShe has been charged with certifying that address as her own under the penalty of perjury.\nIrvine, like many California suburbs, is in the middle of a demographic transition to a majority minority population. The clashes between old residents and new reveal conflicting perspectives on war, U.S. history and what it means to be American.\nKim eventually finished her campaign and voted in November’s mayoral race based out of the 5th District home.\nShortly after her defeat, Kim declared her candidacy in December to fill the now-vacant 5th District seat, which Agran left after winning the mayoral election.\nKim eventually found a room in another 5th District home on Jan. 10 and changed her California driver’s registration that same day, according to the complaint. She then filed new nomination paperwork with the new 5th District address, according to the complaint.\nLater that month, former mayoral candidate Ron Scolesdang sued Kim, claiming that she was fraudulently using an incorrect address. Scolesdang had hired a private investigator to monitor Kim, according to that lawsuit.\nKim eventually dropped out of the race on Feb. 7, the same day a Superior Court judge removed her name from the ballot.\nBetty Martinez Franco won the special election."
    },
    {
      "url": "https://www.latimes.com/california/story/2024-05-08/kevin-de-leon-and-curren-price-get-back-onto-council-committees",
      "text": "Despite scandals, Curren Price and Kevin de León regain seats on L.A. council committees\n- Share via\nLos Angeles City Councilmembers Curren Price and Kevin de León, who have been caught up in separate scandals, were brought back onto a handful of committees by Council President Paul Krekorian in a decision announced Wednesday.\nPrice, who represents part of South L.A., voluntarily stepped down from his committees after he was charged with embezzlement, perjury and conflict of interest in June. He has repeatedly proclaimed his innocence.\nDe León, whose district includes part of the Eastside, appeared on a secretly recorded conversation featuring racist and derogatory remarks that became public in October 2022. In the uproar that followed, he was removed from all of his committees by acting Council President Mitch O’Farrell.\nNow running for a second term in the Nov. 5 election, De León has apologized to his constituents for what he said and didn’t say during the conversation.\nKrekorian, in a letter to City Clerk Holly Wolcott, said he has placed De León on four committees — those dealing with housing and homelessness, trade and tourism, energy and the environment, and transportation. De León also retained his seat on the Board of Referred Powers. That panel has not met since he joined it in 2022, said De León spokesperson Pete Brown.\nIn his letter, which also went to every council member, Krekorian said he has tapped Price to serve on committees that oversee public safety, trade and tourism, civil rights and personnel issues.\nThe changes go into effect immediately. Krekorian, who has the sole power to hand out committee assignments, gave no explanation, and his office did not immediately provide comment.\nThe announcement represents a sharp turnaround from the period that immediately followed the audio leak. De León faced widespread calls to resign over his participation in the conversation with two other council members and a union leader that featured, among other things, racist and derogatory remarks about then-Councilmember Mike Bonin, who is white, and Bonin’s son, who is Black.\nTwo weeks after the audio became public, Krekorian sent De León a letter saying the city would not “begin the process of healing” until he stepped down from public office. At that point, Council President Nury Martinez had already stepped down over her role in the recorded conversation.\n“There is no realistic possibility that you can effectively legislate as a member of this body,” Krekorian wrote at the time.\nOn Wednesday, De León issued a statement saying he is happy with the changes.\n“These specific assignments are particularly critical for the residents of my district,” he said, “and I’m looking forward to helping shape policies that will deliver tangible benefits to my constituents and Angelenos across Los Angeles.”\nPrice, for his part, said he is “deeply honored” to receive the new committee assignments.\n“I am ready to dive back in and participate in critical decisions that will have a substantial impact on both the current and future landscape of L.A.,” he said in a statement.\nL.A. County prosecutors have charged Price with perjury, saying he failed to disclose his wife’s business dealings with developers whose projects he voted on. They accuse him of violating conflict-of-interest laws by voting to support two of those developers’ affordable housing projects between 2019 and 2021. And they say he embezzled public funds by arranging for his now-wife to receive city health benefits at a time when their marriage was not legally valid.\nRob Quan, an organizer with Unrig LA, voiced disappointment in the council president’s moves, saying he does not understand what has changed for either Price or De León. Quan, whose organization focuses on anti-corruption efforts at City Hall, said it is “highly inappropriate” to put Price, who is facing 10 felony counts, on a council committee that deals with law enforcement.\nQuan also said it is “baffling” that De León has secured seats on so many committees.\n“There really don’t seem to be any standards on the council, or any type of consistency,” he said.\nPrice was facing serious political peril last year. Two of his former colleagues — Jose Huizar and Mark Ridley-Thomas — were suspended from the council after facing felony charges. Price publicly argued that he should not be suspended, saying he is innocent.\nThe council committee that recommends such disciplinary measures ultimately took no action.\nDe León, who is seeking a second four-year term, came in second in the March 5 primary behind Ysabel Jurado, a tenant rights attorney.\nOn Wednesday, his reelection campaign announced that he had secured endorsements from International Longshore and Warehouse Union Locals 13 and 63, which represent more than 8,000 workers in the region."
    }
  ],
  "argos_summary": "L.A. County prosecutors are set to file additional corruption charges against City Councilman Curren Price, who is already facing multiple counts of grand theft and perjury related to voting on projects benefiting his wife's consulting firm. Price's attorney claims the new charges are an attempt to strengthen a weak case, arguing that the payments to his wife did not influence his votes and that the embezzlement charges are invalid due to lack of control over the funds. Price, who has denied all wrongdoing, is expected to face a preliminary hearing later this year.",
  "argos_id": "R6RCVBM38"
}