{
  "url": "https://finance.yahoo.com/news/northwest-healthcare-properties-real-estate-210100721.html",
  "authorsByline": "Newsfile Corp.",
  "articleId": "ecc381db59be46f790fb3c8727f54efa",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/9700bf8d6ce9c55094420a3b473fd1fa",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:01:00+00:00",
  "addDate": "2025-08-12T21:09:29.814629+00:00",
  "refreshDate": "2025-08-12T21:09:29.814630+00:00",
  "score": 1.0,
  "title": "Northwest Healthcare Properties Real Estate Investment Trust Reports Second Quarter 2025 Results, Suspends Its Distribution Reinvestment Plan, and Appoints Zachary Vaughan to the Board of Trustees",
  "description": "Toronto, Ontario--(Newsfile Corp. - August 12, 2025) - Northwest Healthcare Properties Real Estate Investment Trust (TSX: NWH.UN) (the \"REIT\" or \"Northwest\"), a global investor and operator of healthcare infrastructure assets in North America, Australasia, Brazil, and Europe, announces results for the three and six months ended June 30, 2025. In addition, the REIT announces the suspension of its distribution reinvestment plan (the \"DRIP\") and the appointment of Zachary Vaughan to the Board of Tr",
  "content": "Strong operating performance in Q2 2025 was supported by a stable, long-term lease maturity profile with a weighted-average lease expiry (\"WALE\") of 13.5 years and a global portfolio occupancy rate of 97%.\n\nThe REIT's leverage was 48.5% at the end of Q2 2025, as compared to 50.0% as at December 31, 2024, driven by proactive debt repayment from dispositions; and\n\nDuring Q2 2025, the REIT recorded fair value gains on investment properties of $13.6 million, compared to fair value losses of $172.4 million in Q2 2024. The fair value movements were mainly attributable to changes in valuation parameters, incorporating market evidence when available and rent reviews. The REIT's portfolio cap rate as at June 30, 2025 is 6.3%;\n\nAdjusted funds from operations (\"AFFO\") was $0.10 per unit in Q2 2025 compared to $0.10 per unit in Q1 2025 and $0.09 per unit in Q2 2024, resulting in an AFFO payout ratio of 88% in Q2 2025 compared to 92% in Q1 2025 and 105% in Q2 2024 (see Exhibit 2);\n\nNet income for Q2 2025 was $32.6 million compared to net loss of $127.2 million in Q2 2024, primarily due to a decrease in mortgage and loan interest expense, positive fair value adjustment on investment properties, and unrealized foreign exchange gains, partially offset by fair value loss on revaluation of financial instruments and by lower net operating income as a result of disposition activity;\n\nGeneral and administrative expenses, excluding unit-based compensation and employee termination benefits and associated costs, were $12.6 million for Q2 2025, a decrease of $0.5 million from Q2 2024, primarily due to headcount reduction and simplification of the REIT's business;\n\nSame Property Net Operating Income (\"SPNOI\") increased by 2.8% to $73.2 million for Q2 2025, over Q2 2024, reflecting steady growth across all regions (see Exhibit 1);\n\nRevenue from investment properties was $99.0 million for Q2 2025, a decrease of 16.9% from Q2 2024 driven by the disposition of non-core assets during 2024 and 2025 to date, partially offset by solid same property revenue growth;\n\nHighlights for Q2 2025 and events subsequent to the quarter are set out below:\n\n\"Looking ahead, we're focused on disciplined capital allocation and unlocking value through strategic asset management and selective dispositions. This will provide us with flexibility to further reduce debt, reinvest in our core portfolio, and pursue accretive growth opportunities that drive long-term value for unitholders.\"\n\n\"Our Q2 2025 results reflect continued operational momentum, with improvements in AFFO per unit, a lower payout ratio, and continued execution of our capital recycling strategy with over $282 million in non-core asset sales completed year to date.\n\nZachary Vaughan, CEO of Northwest, commented, \"Having just joined Northwest in July, I am excited by the caliber of the portfolio and the strength of the team. The assets we own and operate are critical components of healthcare infrastructure. Our assets have long-term demand drivers, recession-resistant cash flows and very low obsolescence risk. Our cash flows are backed by outstanding underlying credit, often government supported, with long-term indexation. Given Northwest's unique position as a leader in healthcare infrastructure, we are well positioned for future growth.\n\nToronto, Ontario--(Newsfile Corp. - August 12, 2025) - Northwest Healthcare Properties Real Estate Investment Trust (TSX: NWH.UN) (the \"REIT\" or \"Northwest\"), a global investor and operator of healthcare infrastructure assets in North America, Australasia, Brazil, and Europe, announces results for the three and six months ended June 30, 2025. In addition, the REIT announces the suspension of its distribution reinvestment plan (the \"DRIP\") and the appointment of Zachary Vaughan to the Board of Trustees (the \"Board\").\n\nThe REIT's consolidated SPNOI increased by 2.8% in Q2 2025 compared to the prior year period, driven mainly by inflationary rent adjustments, rentalised capital spend, and improved recoveries reflecting steady growth in the REIT's underlying lease income. Regionally, SPNOI increased by 2.0% in North America, 4.6% in Brazil, 2.3% in Europe, and 2.6% in Australasia (see Exhibit 1).\n\nIn Q2 2025, the REIT completed 298,000 square feet of new, renewal and early leasing, achieving a strong renewal rate of 89%.\n\nAs previously disclosed, in March 2025, following sector margin pressures exacerbated by its capital structure, Healthscope Pty Ltd (\"HSO\"), the REIT's second largest tenant, occupying 12 properties and accounting for 6.1% of the REIT's proportionate revenues, requested temporary relief from its lender syndicate and landlords, including Northwest. In May 2025, HSO's parent entities entered receivership, with its lenders appointing McGrathNicol Restructuring to work with HSO management to complete an orderly sale of the business. All hospitals continue to operate as usual, and the company has received an additional A$100m facility to support operations.\n\nIn July 2025, (i) the HSO receiver repaid 50% of the previously announced rent deferral accrued to June 30, 2025, and (ii) Northwest agreed to an updated rent deferral arrangement with the HSO receiver starting July 1st whereby 10% of ongoing rent will be deferred. All deferrals are expected to be repaid by March 31, 2026 or upon completion of sale of material assets. The deferred rent has priority over senior debt.\n\nThe receiver-led sale process commenced in late July, and it is anticipated that a new owner will be confirmed in Q4 2025, with the transition process and timing of regulatory approvals to be determined. Northwest maintains constructive dialogue with the receiver and ongoing discussions with prospective operators participating in the process.\n\nAs of today, all rent owing to the REIT from HSO (other than the rent subject to rent deferral arrangements) has been paid and HSO continues to meet all lease obligations.\n\nThe REIT's capital recycling during the quarter, including subsequent events, has generated over $231 million of proceeds as detailed below.\n\nDuring Q2 2025, the REIT sold its shares in Assura through two on-market transactions for total proceeds of $209.3 million (£114.7 million) resulting in a full divestment of the shares. The REIT's investment in Assura was acquired as partial consideration for the REIT's disposition of its UK portfolio in August 2024 at a value of $177 million (£100 million), resulting in a gain on disposition of approximately $32.3 million (£14.6 million). Proceeds were used to repay related debt and corporate facilities.\n\nIn Q2 2025, the REIT completed the sale of one income producing property in North America, one development property in Europe, and one development property in Australasia, classified as assets held for sale at their fair value of $22.1 million. The proceeds were used to repay directly attributable debt and outstanding balances on credit facilities.\n\nAs at June 30, 2025, the REIT held one income producing property with a value of $34.3 million as classified as held for sale.\n\nDuring the quarter, the REIT also extended or refinanced several debt facilities including Canadian mortgages and Australasian term loans.\n\nOn July 29, 2025, the REIT amended the terms of its revolving credit facility. The amendment extends the maturity date of the facility to July 2027 and moves the REIT to grid pricing based on its credit rating, reducing the REIT's cost of borrowing by 65 basis points. The amendment also provides a $100 million accordion commitment, subject to incremental security and lender approval, that provides the REIT flexibility with mortgage maturities as it transitions away from amortizing debt. Subsequent to quarter end, the REIT repaid Canadian mortgages totaling $40.8 million, with a weighted average interest rate of 2.67%, using capacity on its revolving credit facility.\n\nAs of today, the REIT has $20.9 million of Canadian mortgages with 2025 maturities that will be repaid with capacity from the revolving credit facility and $11.7 million of European mortgages that will be renewed in the ordinary course. Of the REIT's proportionate 2026 debt maturities totaling $424 million, over 50% or approximately $226 million are maturing in the fourth quarter of 2026, with the remainder relating to mortgages. The REIT currently has approximately $230 million of available liquidity, consisting of cash and the unused portion of its credit facilities.\n\n(1) FFO and AFFO are not measures recognized under IFRS and do not have standardized meanings prescribed by IFRS. See Performance Measurement in the REIT's MD&A. The adjustments to determine FFO and AFFO have been presented on a proportionate basis. See \"Non-IFRS Financial Measures\", Exhibit 1 and Exhibit 2.\n\n(2) Included in FFO and AFFO for the six months ended June 30, 2024, is $6.7 million related to interest rate cap derivative arrangements, which matured during the three months ended March 31, 2024, the impact of which is $0.03 per unit.\n\n(3) For the three and six months ended June 30, 2025, FFO and FFO per unit excludes $1.4 million and $3.4 million of accelerated amortization of deferred financing charges due to the early repayment of debt using proceeds from the sale of Assura units during the quarter and the issuance of the $500 million senior unsecured debentures in February 2025. FFO and FFO per unit including accelerated amortization of deferred financing charges is $28.0 million or $0.11 per unit and $54.1 million or $0.22 per unit, respectively.\n\nThe REIT also announces today that it has suspended its DRIP until further notice. The REIT's unit price continues to trade at a meaningful discount to net asset value (\"NAV\") per unit, and the issuance of units under the DRIP runs counter to the REIT's focus of optimizing capital structure and driving superior growth in NAV per unit and returns over time.\n\nCommencing with the September 2025 distribution (payable on or about October 15, 2025), unitholders enrolled in the DRIP will receive distribution payments in cash. If the REIT elects to reinstate the DRIP in the future, unitholders that were enrolled in the DRIP at the time of its suspension and remain enrolled at the time of its reinstatement will automatically resume participation in the DRIP.\n\nAppointment of Zachary Vaughan to the Board of Trustees\n\nThe REIT is pleased to announce the appointment of Mr. Zachary Vaughan, the REIT's current CEO, to the Board effective today, August 12, 2025, as a non-independent trustee. Mr. Vaughan's strong real estate experience will be valuable to the Board.\n\nMr. Vaughan's appointment will fill the vacancy left following the retirement of Mr. Dale Klein on May 27, 2025 at the REIT's 2025 annual general meeting.\n\nThe REIT will be hosting its Q2 2025 conference call on Wednesday, August 13, 2025 at 10:00 a.m. ET. The dial-in numbers for the conference call are as follows:\n\nA replay will be available until August 20, 2025, by accessing:\n\nNorthwest provides investors with access to a portfolio of high-quality international healthcare real estate infrastructure comprised as at August 12, 2025, of interests in a diversified portfolio of 168 income-producing properties and 15.8 million square feet of gross leasable area located throughout major markets in North America, Australasia, Brazil and Europe. The REIT's portfolio of medical outpatient buildings, clinics, and hospitals is characterized by long-term indexed leases and stable occupancies. Northwest leverages its global workforce in eight countries to serve as a long-term real estate partner to leading healthcare operators. For additional information please visit: www.nwhreit.com.\n\nSome financial measures used in this press release, such as SPNOI, FFO, FFO per Unit, AFFO, AFFO per Unit, AFFO Payout Ratio, NAV, NAV per unit, and Proportionate Investment Properties are used by the real estate industry to measure and compare the operating performance of real estate companies, but they do not have any standardized meaning prescribed by IFRS.\n\nThese non-IFRS financial measures and non-IFRS ratios should not be construed as alternatives to financial measures calculated in accordance with IFRS. The REIT's method of calculating these measures and ratios may differ from the methods of other real estate investment trusts or other issuers, and accordingly may not be comparable. Further, the REIT's definitions of FFO and AFFO differ from the definitions recommended by REALPAC. These non-IFRS measures are more fully defined and discussed in the exhibits to this news release and in the REIT's Management's Discussion and Analysis (\"MD&A\") for the three and six months ended June 30, 2025, in the \"Performance Measurement\" and \"Results from Operations\" sections. The MD&A is available on SEDAR+ at www.sedarplus.ca.\n\nThis press release may contain forward-looking statements with respect to the REIT, its operations, strategy, financial performance and condition. These statements generally can be identified by words such as \"may\", \"will\", \"expect\", \"estimate\", \"anticipate\", \"intends\", \"believe\", \"normalized\", \"contracted\", or \"continue\" or the negative thereof or similar variations. Forward-looking statements in this press release may include statements concerning HSO's rent deferral arrangements. the ongoing operation of HSO's hospitals, the impact of its sustainability efforts, future debt repayment and renewal, and the REIT being well positioned for growth, to deliver on its objectives and create long term value for unitholders. The REIT's actual results and performance discussed herein could differ materially from those expressed or implied by such statements. The forward-looking statements contained in this press release are based on numerous assumptions which may prove incorrect, and which could cause actual results or events to differ materially from the forward-looking statements. Such assumptions include, but are not limited to (i) assumptions relating to the continued operation of HSO's hospitals and HSO's ability and willingness to pay its deferred rent in accordance with its agreements; (ii) the REIT's properties continuing to perform as they have recently, (iii) various general economic and market factors, including exchange rates remaining constant, local real estate conditions remaining strong, and interest rates remaining at current levels or decreasing, (iv) the availability of equity and debt financing to the REIT and the REIT's ability to refinance, or extend the maturity of, its existing debt, (v) the REIT's commitment to sustainability objectives and the impact thereof, (vi) savings resulting from the REIT's workforce reduction initiatives not being reallocated to other matters, and (vii) the impact that suspending the DRIP will have on the REIT's focus of optimizing capital structure and driving growth in NAV per unit and returns over time. Such forward-looking statements are qualified in their entirety by the inherent risks and uncertainties surrounding future expectations, including that the transactions contemplated herein are completed. Important factors that could cause actual results to differ materially from expectations include, among other things, general economic and market factors, competition, changes in government regulations, and the factors described under \"Risks and Uncertainties\" in the REIT's Annual Information Form and the risks and uncertainties set out in the MD&A which are available on SEDAR+ at www.sedarplus.ca.\n\nThese cautionary statements qualify all forward-looking statements attributable to the REIT and persons acting on its behalf. Unless otherwise stated, all forward-looking statements speak only as of the date of this press release, and, except as expressly required by applicable law, the REIT assumes no obligation to update such statements.\n\nConstant Currency Same Property NOI, sometimes also presented as \"Same Property NOI\" or \"SPNOI\", is a non-IFRS financial measure, defined as NOI for investment properties that were owned for a full reporting period in both the current and comparative year, subject to certain adjustments including: (i) straight-line rental revenue recognition; (ii) amortization of operating leases; (iii) lease termination fees; and (iv) non-recurring transactions that are not expected to recur (v) excluding properties held for redevelopment and (vi) excluding impact of foreign currency translation by converting the foreign currency denominated SPNOI from comparative period at current period average exchange rates. SPNOI is more fully defined and discussed in the REIT's MD&A (see \"Performance Measurement\").\n\n(1) Same property NOI is a non-IFRS measure, defined and discussed in the REIT's MD&A.\n\nExhibit 2 – Funds From Operations and Adjusted Funds from Operations Reconciliation\n\nFFO is a supplemental non-IFRS industry wide financial measure of a REIT's operating performance. The REIT calculates FFO based on certain adjustments to net income (loss) (computed in accordance with IFRS) as detailed below. FFO is more fully defined and discussed in the MD&A (see \"Performance Measurement\" and \"Funds From Operations\").\n\nFor the three and six months ended June 30, 2025, FFO was $26.5 million including accelerated amortization of deferred financing costs as a result of early repayment of the underlying debt, using proceeds from the senior unsecured debentures. Excluding the impact of $1.4 million of accelerated amortization of deferred financing costs, FFO for the three and six months ended June 30, 2025 is $28.0 million or $0.11 per unit.\n\n(1) FFO and AFFO are not measures recognized under IFRS and do not have standardized meanings prescribed by IFRS. See Performance Measurement in the REIT's MD&A. The adjustments to determine FFO and AFFO have been presented on a proportionate basis.\n\n(2) Included in FFO for the six months ended June 30, 2024 is $6.7 million related to premiums paid in connection with interest rate cap derivatives, the impact of which is $0.03 per unit.\n\n(3) Diluted units include the impact of vested deferred trust units and the convertible debentures, that would have a dilutive effect upon conversion.\n\nAFFO is a supplemental non-IFRS financial measure of a REIT's operating performance and is intended to reflect a stabilized business environment. The REIT calculates AFFO as FFO, plus/minus certain adjustments as detailed below. AFFO is more fully defined and discussed in the MD&A (see \"Performance Measurement\" and \"Adjusted Funds From Operations\").\n\n(1) FFO and AFFO are not measures recognized under IFRS and do not have standardized meanings prescribed by IFRS. See Performance Measurement in the REIT's MD&A. The adjustments to determine FFO and AFFO have been presented on a proportionate basis.\n\n(2) Included in FFO for the six months ended June 30, 2024 is $6.7 million related to premiums paid in connection with interest rate cap derivatives, the impact of which is $0.03 per unit.\n\n(3) Diluted units include the impact of vested deferred trust units and the convertible debentures, that would have a dilutive effect upon conversion.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/262222",
  "medium": "Article",
  "links": [
    "https://api.newsfilecorp.com/redirect/Q22KRIB5bM",
    "https://api.newsfilecorp.com/redirect/GzzJ5TV81J",
    "https://api.newsfilecorp.com/redirect/5WWZAfexvo",
    "https://api.newsfilecorp.com/redirect/B55VGHrqLQ",
    "https://api.newsfilecorp.com/redirect/mjjwXumLbY",
    "https://api.newsfilecorp.com/redirect/kXX2Ru8XyK"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "REIT",
      "weight": 0.08164232
    },
    {
      "name": "long term value",
      "weight": 0.054248977
    },
    {
      "name": "non-IFRS measure",
      "weight": 0.053327095
    },
    {
      "name": "non-IFRS measures",
      "weight": 0.053327095
    },
    {
      "name": "non-core asset sales",
      "weight": 0.052773654
    },
    {
      "name": "Non-IFRS Financial",
      "weight": 0.051617227
    },
    {
      "name": "non-IFRS financial",
      "weight": 0.051617227
    },
    {
      "name": "vested deferred trust units",
      "weight": 0.05146484
    },
    {
      "name": "non-core assets",
      "weight": 0.050626867
    },
    {
      "name": "Assura units",
      "weight": 0.05011771
    }
  ],
  "topics": [
    {
      "name": "Real Estate"
    },
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Health"
    },
    {
      "name": "Environment"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.95947265625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.9453125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.94482421875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.85595703125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.53173828125
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.447265625
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.330078125
    },
    {
      "name": "/Finance/Investing/Real Estate Investment Trusts",
      "score": 0.306884765625
    }
  ],
  "sentiment": {
    "positive": 0.6310715,
    "negative": 0.21045561,
    "neutral": 0.15847284
  },
  "summary": "Northwest Healthcare Properties Real Estate Investment Trust (NWH.UN), a global investor and operator of healthcare infrastructure assets in North America, Australasia, Brazil, and Europe, has suspended its distribution reinvestment plan and appointed Zachary Vaughan to the Board of Trustees. The REIT's strong operating performance in Q2 2025 was attributed to a stable, long-term lease maturity profile, a global portfolio occupancy rate of 97%. The company recorded fair value gains on investment properties of $13.6 million, compared to $172.4 million in Q 2 2024. Net income for Q 2 2025 was $32.6m, a decrease of 16.9% from Q2 2024, largely due to the decrease in mortgage and loan interest expense, positive fair value adjustment on investment property, and unrealized foreign exchange gains, partially offset by lower net operating income as a result of dispositions. Adjusted funds from operations was $0.10 per unit in QQ 2025 compared to Q1 2025 and Q2 2022, resulting in an AFFO payout ratio of 88% in Q Q2 2021. Looking ahead, Northwest is focused on disciplined capital allocation and unlocking value through strategic asset management and selective dispositions, allowing flexibility to further reduce debt, reinvest in its core portfolio.",
  "shortSummary": "Northwest Healthcare Properties Real Estate Investment Trust reports strong Q2 2025 results, suspending its distribution reinvestment plan and appointing Zachary Vaughan to the Board of Trustees.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a28bcf9b70ee4e7b98288d24af32edc1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.newsfilecorp.com/redirect/5WWZAfexvo",
      "text": "Northwest Healthcare Properties Real Estate Investment Trust Reports Second Quarter 2025 Results, Suspends Its Distribution Reinvestment Plan, and Appoints Zachary Vaughan to the Board of Trustees\nAugust 12, 2025 5:01 PM EDT | Source: Northwest Healthcare Properties REIT\nToronto, Ontario--(Newsfile Corp. - August 12, 2025) - Northwest Healthcare Properties Real Estate Investment Trust (TSX: NWH.UN) (the \"REIT\" or \"Northwest\"), a global investor and operator of healthcare infrastructure assets in North America, Australasia, Brazil, and Europe, announces results for the three and six months ended June 30, 2025. In addition, the REIT announces the suspension of its distribution reinvestment plan (the \"DRIP\") and the appointment of Zachary Vaughan to the Board of Trustees (the \"Board\").\nZachary Vaughan, CEO of Northwest, commented, \"Having just joined Northwest in July, I am excited by the caliber of the portfolio and the strength of the team. The assets we own and operate are critical components of healthcare infrastructure. Our assets have long-term demand drivers, recession-resistant cash flows and very low obsolescence risk. Our cash flows are backed by outstanding underlying credit, often government supported, with long-term indexation. Given Northwest's unique position as a leader in healthcare infrastructure, we are well positioned for future growth.\n\"Our Q2 2025 results reflect continued operational momentum, with improvements in AFFO per unit, a lower payout ratio, and continued execution of our capital recycling strategy with over $282 million in non-core asset sales completed year to date.\n\"Looking ahead, we're focused on disciplined capital allocation and unlocking value through strategic asset management and selective dispositions. This will provide us with flexibility to further reduce debt, reinvest in our core portfolio, and pursue accretive growth opportunities that drive long-term value for unitholders.\"\nQ2 2025 Highlights\nHighlights for Q2 2025 and events subsequent to the quarter are set out below:\nRevenue from investment properties was $99.0 million for Q2 2025, a decrease of 16.9% from Q2 2024 driven by the disposition of non-core assets during 2024 and 2025 to date, partially offset by solid same property revenue growth;\nSame Property Net Operating Income (\"SPNOI\") increased by 2.8% to $73.2 million for Q2 2025, over Q2 2024, reflecting steady growth across all regions (see Exhibit 1);\nGeneral and administrative expenses, excluding unit-based compensation and employee termination benefits and associated costs, were $12.6 million for Q2 2025, a decrease of $0.5 million from Q2 2024, primarily due to headcount reduction and simplification of the REIT's business;\nNet income for Q2 2025 was $32.6 million compared to net loss of $127.2 million in Q2 2024, primarily due to a decrease in mortgage and loan interest expense, positive fair value adjustment on investment properties, and unrealized foreign exchange gains, partially offset by fair value loss on revaluation of financial instruments and by lower net operating income as a result of disposition activity;\nAdjusted funds from operations (\"AFFO\") was $0.10 per unit in Q2 2025 compared to $0.10 per unit in Q1 2025 and $0.09 per unit in Q2 2024, resulting in an AFFO payout ratio of 88% in Q2 2025 compared to 92% in Q1 2025 and 105% in Q2 2024 (see Exhibit 2);\nDuring Q2 2025, the REIT recorded fair value gains on investment properties of $13.6 million, compared to fair value losses of $172.4 million in Q2 2024. The fair value movements were mainly attributable to changes in valuation parameters, incorporating market evidence when available and rent reviews. The REIT's portfolio cap rate as at June 30, 2025 is 6.3%;\nThe REIT's leverage was 48.5% at the end of Q2 2025, as compared to 50.0% as at December 31, 2024, driven by proactive debt repayment from dispositions; and\nStrong operating performance in Q2 2025 was supported by a stable, long-term lease maturity profile with a weighted-average lease expiry (\"WALE\") of 13.5 years and a global portfolio occupancy rate of 97%.\nOperations and Leasing\nThe REIT's consolidated SPNOI increased by 2.8% in Q2 2025 compared to the prior year period, driven mainly by inflationary rent adjustments, rentalised capital spend, and improved recoveries reflecting steady growth in the REIT's underlying lease income. Regionally, SPNOI increased by 2.0% in North America, 4.6% in Brazil, 2.3% in Europe, and 2.6% in Australasia (see Exhibit 1).\nIn Q2 2025, the REIT completed 298,000 square feet of new, renewal and early leasing, achieving a strong renewal rate of 89%.\nAs previously disclosed, in March 2025, following sector margin pressures exacerbated by its capital structure, Healthscope Pty Ltd (\"HSO\"), the REIT's second largest tenant, occupying 12 properties and accounting for 6.1% of the REIT's proportionate revenues, requested temporary relief from its lender syndicate and landlords, including Northwest. In May 2025, HSO's parent entities entered receivership, with its lenders appointing McGrathNicol Restructuring to work with HSO management to complete an orderly sale of the business. All hospitals continue to operate as usual, and the company has received an additional A$100m facility to support operations.\nIn July 2025, (i) the HSO receiver repaid 50% of the previously announced rent deferral accrued to June 30, 2025, and (ii) Northwest agreed to an updated rent deferral arrangement with the HSO receiver starting July 1st whereby 10% of ongoing rent will be deferred. All deferrals are expected to be repaid by March 31, 2026 or upon completion of sale of material assets. The deferred rent has priority over senior debt.\nThe receiver-led sale process commenced in late July, and it is anticipated that a new owner will be confirmed in Q4 2025, with the transition process and timing of regulatory approvals to be determined. Northwest maintains constructive dialogue with the receiver and ongoing discussions with prospective operators participating in the process.\nAs of today, all rent owing to the REIT from HSO (other than the rent subject to rent deferral arrangements) has been paid and HSO continues to meet all lease obligations.\nDisposition Activity and Assets Held for Sale\nThe REIT's capital recycling during the quarter, including subsequent events, has generated over $231 million of proceeds as detailed below.\nDuring Q2 2025, the REIT sold its shares in Assura through two on-market transactions for total proceeds of $209.3 million (£114.7 million) resulting in a full divestment of the shares. The REIT's investment in Assura was acquired as partial consideration for the REIT's disposition of its UK portfolio in August 2024 at a value of $177 million (£100 million), resulting in a gain on disposition of approximately $32.3 million (£14.6 million). Proceeds were used to repay related debt and corporate facilities.\nIn Q2 2025, the REIT completed the sale of one income producing property in North America, one development property in Europe, and one development property in Australasia, classified as assets held for sale at their fair value of $22.1 million. The proceeds were used to repay directly attributable debt and outstanding balances on credit facilities.\nAs at June 30, 2025, the REIT held one income producing property with a value of $34.3 million as classified as held for sale.\nFinancing Activity\nDuring the quarter, the REIT also extended or refinanced several debt facilities including Canadian mortgages and Australasian term loans.\nOn July 29, 2025, the REIT amended the terms of its revolving credit facility. The amendment extends the maturity date of the facility to July 2027 and moves the REIT to grid pricing based on its credit rating, reducing the REIT's cost of borrowing by 65 basis points. The amendment also provides a $100 million accordion commitment, subject to incremental security and lender approval, that provides the REIT flexibility with mortgage maturities as it transitions away from amortizing debt. Subsequent to quarter end, the REIT repaid Canadian mortgages totaling $40.8 million, with a weighted average interest rate of 2.67%, using capacity on its revolving credit facility.\nAs of today, the REIT has $20.9 million of Canadian mortgages with 2025 maturities that will be repaid with capacity from the revolving credit facility and $11.7 million of European mortgages that will be renewed in the ordinary course. Of the REIT's proportionate 2026 debt maturities totaling $424 million, over 50% or approximately $226 million are maturing in the fourth quarter of 2026, with the remainder relating to mortgages. The REIT currently has approximately $230 million of available liquidity, consisting of cash and the unused portion of its credit facilities.\nSelected Operating and Financial Information:\n| (unaudited) | June 30, 2025 | December 31, 2024 | ||||\n| as at | ||||||\n| Assets Under Management | $ | 8,220,857 | $ | 8,281,609 | ||\n| Number of properties | 168 | 172 | ||||\n| Gross leasable area (sf) | 15,750,688 | 15,886,309 | ||||\n| Occupancy | 96.6 % | 96.4 % | ||||\n| Weighted Average Lease Expiry (Years) | 13.5 | 13.6 | ||||\n| Debt | $ | 2,890,915 | $ | 3,027,154 | ||\n| Debt to Gross Book Value | 48.5 % | 50.0 % | ||||\n| Weighted average capitalization rate | 6.3 % | 6.2 % | ||||\n| Economic Weighted Average Interest Rate | 4.8 % | 5.5 % |\n| (unaudited) | Three months ended June 30, | Six months ended June 30, | ||||||||||\n| ($000's, except per unit amounts) | 2025 | 2024 | 2025 | 2024 | ||||||||\n| Net Operating Income | $ | 76,308 | $ | 93,976 | $ | 153,456 | $ | 189,428 | ||||\n| Net Income (Loss) attributable to unitholders | $ | 32,621 | $ | (127,224 | ) | $ | 17,091 | $ | (165,841 | ) | ||\n| Funds from Operations (\"FFO\") excluding accelerated amortization of deferred financing charges (1), (2), (3) | $ | 27,968 | $ | 22,314 | $ | 50,740 | $ | 49,271 | ||||\n| Adjusted Funds from Operations (\"AFFO\") (1) | $ | 25,407 | $ | 21,186 | $ | 49,755 | $ | 48,865 | ||||\n| FFO, excluding accelerated amortization of deferred financing charges, per unit - diluted (1), (2), (3) | $ | 0.11 | $ | 0.09 | $ | 0.22 | $ | 0.20 | ||||\n| AFFO per unit - diluted (1), (2) | $ | 0.10 | $ | 0.09 | $ | 0.20 | $ | 0.20 | ||||\n| Distributions per unit | $ | 0.09 | $ | 0.09 | $ | 0.18 | $ | 0.18 | ||||\n| AFFO Payout Ratio - diluted | 89 % | 105 % | 90 % | 90 % |\n(1) FFO and AFFO are not measures recognized under IFRS and do not have standardized meanings prescribed by IFRS. See Performance Measurement in the REIT's MD&A. The adjustments to determine FFO and AFFO have been presented on a proportionate basis. See \"Non-IFRS Financial Measures\", Exhibit 1 and Exhibit 2.\n(2) Included in FFO and AFFO for the six months ended June 30, 2024, is $6.7 million related to interest rate cap derivative arrangements, which matured during the three months ended March 31, 2024, the impact of which is $0.03 per unit.\n(3) For the three and six months ended June 30, 2025, FFO and FFO per unit excludes $1.4 million and $3.4 million of accelerated amortization of deferred financing charges due to the early repayment of debt using proceeds from the sale of Assura units during the quarter and the issuance of the $500 million senior unsecured debentures in February 2025. FFO and FFO per unit including accelerated amortization of deferred financing charges is $28.0 million or $0.11 per unit and $54.1 million or $0.22 per unit, respectively.\nDRIP Suspension\nThe REIT also announces today that it has suspended its DRIP until further notice. The REIT's unit price continues to trade at a meaningful discount to net asset value (\"NAV\") per unit, and the issuance of units under the DRIP runs counter to the REIT's focus of optimizing capital structure and driving superior growth in NAV per unit and returns over time.\nCommencing with the September 2025 distribution (payable on or about October 15, 2025), unitholders enrolled in the DRIP will receive distribution payments in cash. If the REIT elects to reinstate the DRIP in the future, unitholders that were enrolled in the DRIP at the time of its suspension and remain enrolled at the time of its reinstatement will automatically resume participation in the DRIP.\nAppointment of Zachary Vaughan to the Board of Trustees\nThe REIT is pleased to announce the appointment of Mr. Zachary Vaughan, the REIT's current CEO, to the Board effective today, August 12, 2025, as a non-independent trustee. Mr. Vaughan's strong real estate experience will be valuable to the Board.\nMr. Vaughan's appointment will fill the vacancy left following the retirement of Mr. Dale Klein on May 27, 2025 at the REIT's 2025 annual general meeting.\nCorporate Presentation\nDownload the Company's Updated Corporate Presentation:\nhttps://www.nwhreit.com/investors/unitholders/presentations\nQ2 2025 Results Conference Call\nThe REIT will be hosting its Q2 2025 conference call on Wednesday, August 13, 2025 at 10:00 a.m. ET. The dial-in numbers for the conference call are as follows:\nNorth America (toll free): 1-833-752-3625\nOverseas or local (Toronto): 1-647-846-8435\nLink to audio webcast: https://www.gowebcasting.com/14088\nA replay will be available until August 20, 2025, by accessing:\nUS/Canada (toll free): 1-855-669-9658\nInternational: 1-412-317-0088\nReplay Access Code: 7483273\nAbout Northwest\nNorthwest provides investors with access to a portfolio of high-quality international healthcare real estate infrastructure comprised as at August 12, 2025, of interests in a diversified portfolio of 168 income-producing properties and 15.8 million square feet of gross leasable area located throughout major markets in North America, Australasia, Brazil and Europe. The REIT's portfolio of medical outpatient buildings, clinics, and hospitals is characterized by long-term indexed leases and stable occupancies. Northwest leverages its global workforce in eight countries to serve as a long-term real estate partner to leading healthcare operators. For additional information please visit: www.nwhreit.com.\nContacts\nZach Vaughan, CEO, zach.vaughan@nwhreit.com.\nStephanie Karamarkovic, CFO, Stephanie.Karamarkovic@nwhreit.com.\nAlyssa Barry, Investor Relations, Alyssa.Barry@nwhreit.com, investors@nwhreit.com, (416) 366-2000 Ext. 2202\nNon-IFRS Measures\nSome financial measures used in this press release, such as SPNOI, FFO, FFO per Unit, AFFO, AFFO per Unit, AFFO Payout Ratio, NAV, NAV per unit, and Proportionate Investment Properties are used by the real estate industry to measure and compare the operating performance of real estate companies, but they do not have any standardized meaning prescribed by IFRS.\nThese non-IFRS financial measures and non-IFRS ratios should not be construed as alternatives to financial measures calculated in accordance with IFRS. The REIT's method of calculating these measures and ratios may differ from the methods of other real estate investment trusts or other issuers, and accordingly may not be comparable. Further, the REIT's definitions of FFO and AFFO differ from the definitions recommended by REALPAC. These non-IFRS measures are more fully defined and discussed in the exhibits to this news release and in the REIT's Management's Discussion and Analysis (\"MD&A\") for the three and six months ended June 30, 2025, in the \"Performance Measurement\" and \"Results from Operations\" sections. The MD&A is available on SEDAR+ at www.sedarplus.ca.\nForward-Looking Statements\nThis press release may contain forward-looking statements with respect to the REIT, its operations, strategy, financial performance and condition. These statements generally can be identified by words such as \"may\", \"will\", \"expect\", \"estimate\", \"anticipate\", \"intends\", \"believe\", \"normalized\", \"contracted\", or \"continue\" or the negative thereof or similar variations. Forward-looking statements in this press release may include statements concerning HSO's rent deferral arrangements. the ongoing operation of HSO's hospitals, the impact of its sustainability efforts, future debt repayment and renewal, and the REIT being well positioned for growth, to deliver on its objectives and create long term value for unitholders. The REIT's actual results and performance discussed herein could differ materially from those expressed or implied by such statements. The forward-looking statements contained in this press release are based on numerous assumptions which may prove incorrect, and which could cause actual results or events to differ materially from the forward-looking statements. Such assumptions include, but are not limited to (i) assumptions relating to the continued operation of HSO's hospitals and HSO's ability and willingness to pay its deferred rent in accordance with its agreements; (ii) the REIT's properties continuing to perform as they have recently, (iii) various general economic and market factors, including exchange rates remaining constant, local real estate conditions remaining strong, and interest rates remaining at current levels or decreasing, (iv) the availability of equity and debt financing to the REIT and the REIT's ability to refinance, or extend the maturity of, its existing debt, (v) the REIT's commitment to sustainability objectives and the impact thereof, (vi) savings resulting from the REIT's workforce reduction initiatives not being reallocated to other matters, and (vii) the impact that suspending the DRIP will have on the REIT's focus of optimizing capital structure and driving growth in NAV per unit and returns over time. Such forward-looking statements are qualified in their entirety by the inherent risks and uncertainties surrounding future expectations, including that the transactions contemplated herein are completed. Important factors that could cause actual results to differ materially from expectations include, among other things, general economic and market factors, competition, changes in government regulations, and the factors described under \"Risks and Uncertainties\" in the REIT's Annual Information Form and the risks and uncertainties set out in the MD&A which are available on SEDAR+ at www.sedarplus.ca.\nThese cautionary statements qualify all forward-looking statements attributable to the REIT and persons acting on its behalf. Unless otherwise stated, all forward-looking statements speak only as of the date of this press release, and, except as expressly required by applicable law, the REIT assumes no obligation to update such statements.\n| NORTHWEST HEALTHCARE PROPERTIES REAL ESTATE INVESTMENT TRUST | ||||||||||||\n| Condensed Consolidated Interim Statements of Income (Loss) and Comprehensive Income (Loss) | ||||||||||||\n| (in thousands of Canadian dollars) | ||||||||||||\n| Unaudited | Three months ended June 30, | Six months ended June 30, | ||||||||||\n| 2025 | 2024 | 2025 | 2024 | |||||||||\n| Net Property Operating Income | ||||||||||||\n| Revenue from investment properties | $ | 99,004 | $ | 119,141 | $ | 210,651 | $ | 252,686 | ||||\n| Property operating costs | 22,696 | 25,165 | 57,195 | 63,258 | ||||||||\n| 76,308 | 93,976 | $ | 153,456 | $ | 189,428 | |||||||\n| Other Income (loss) | ||||||||||||\n| Interest and other | 2,548 | 3,356 | 8,729 | 6,759 | ||||||||\n| Management fees | 3,590 | 3,366 | 7,363 | 7,216 | ||||||||\n| Share of profit (loss) of equity accounted investments | 4,648 | (13,299 | ) | (4,094 | ) | (9,984 | ) | |||||\n| 10,786 | (6,577 | ) | $ | 11,998 | $ | 3,991 | ||||||\n| Expenses and other | ||||||||||||\n| Interest expense | 30,775 | 53,756 | 65,865 | 109,189 | ||||||||\n| General and administrative expenses | 14,891 | 13,454 | 29,739 | 28,991 | ||||||||\n| Transaction costs | 2,390 | 4,567 | 11,822 | 6,934 | ||||||||\n| Foreign exchange (gain) loss | (5,474 | ) | 861 | (7,293 | ) | (12,869 | ) | |||||\n| 42,582 | 72,638 | $ | 100,133 | $ | 132,245 | |||||||\n| Income before finance income (expense), net gain (loss) on financial instruments, net gain (loss) on dispositions, and fair value adjustments | 44,512 | 14,761 | $ | 65,321 | $ | 61,174 | ||||||\n| Finance income (expense) | ||||||||||||\n| Amortization of financing costs | (2,796 | ) | (4,271 | ) | (6,145 | ) | (9,451 | ) | ||||\n| Class B exchangeable unit distributions | - | - | - | 63 | ||||||||\n| Fair value adjustment of Class B exchangeable units | - | - | - | (205 | ) | |||||||\n| Accretion of financial liabilities | (397 | ) | (424 | ) | (3,816 | ) | (4,432 | ) | ||||\n| Fair value adjustment of convertible debentures | (206 | ) | 4,283 | (10,691 | ) | (1,692 | ) | |||||\n| Convertible debenture issuance costs | - | - | - | (27 | ) | |||||||\n| Net gain (loss) on financial instruments | (8,377 | ) | 5,737 | 20,422 | 11,349 | |||||||\n| Fair value adjustment of investment properties | 13,619 | (172,417 | ) | (32,728 | ) | (244,120 | ) | |||||\n| Net loss on disposals of assets | (3,379 | ) | (4,905 | ) | (4,778 | ) | (10,097 | ) | ||||\n| Fair value adjustment of unit-based compensation liabilities | 588 | 806 | (882 | ) | 1,161 | |||||||\n| Income (loss) before taxes | 43,564 | (156,430 | ) | $ | 26,703 | $ | (196,277 | ) | ||||\n| Current tax expense | 3,529 | 3,628 | 7,138 | 6,394 | ||||||||\n| Deferred tax expense (recovery) | 7,414 | (32,834 | ) | 2,474 | (36,830 | ) | ||||||\n| Income tax expense (recovery) | 10,943 | (29,206 | ) | $ | 9,612 | $ | (30,436 | ) | ||||\n| Net income (loss) | $ | 32,621 | $ | (127,224 | ) | $ | 17,091 | $ | (165,841 | ) | ||\n| Net income (loss) attributable to: | ||||||||||||\n| Unitholders | $ | 25,960 | $ | (122,338 | ) | $ | 25,070 | $ | (169,945 | ) | ||\n| Non-controlling interests | 6,661 | (4,886 | ) | (7,979 | ) | 4,104 | ||||||\n| $ | 32,621 | $ | (127,224 | ) | $ | 17,091 | $ | (165,841 | ) |\nExhibit 1 – Constant Currency Same Property NOI\nConstant Currency Same Property NOI, sometimes also presented as \"Same Property NOI\" or \"SPNOI\", is a non-IFRS financial measure, defined as NOI for investment properties that were owned for a full reporting period in both the current and comparative year, subject to certain adjustments including: (i) straight-line rental revenue recognition; (ii) amortization of operating leases; (iii) lease termination fees; and (iv) non-recurring transactions that are not expected to recur (v) excluding properties held for redevelopment and (vi) excluding impact of foreign currency translation by converting the foreign currency denominated SPNOI from comparative period at current period average exchange rates. SPNOI is more fully defined and discussed in the REIT's MD&A (see \"Performance Measurement\").\n| SAME PROPERTY NOI | ||||||||||||||||||\n| Three months ended June 30, | Six months ended June 30, | |||||||||||||||||\n| 2025 | 2024 | Var % | 2025 | 2024 | Var % | |||||||||||||\n| Same property NOI (1) | ||||||||||||||||||\n| North America | $ | 20,505 | $ | 20,095 | 2.0% | $ | 41,135 | $ | 40,019 | 2.8% | ||||||||\n| Brazil | 13,876 | 13,271 | 4.6% | 27,849 | 26,658 | 4.5% | ||||||||||||\n| Europe | 8,409 | 8,221 | 2.3% | 16,527 | 16,176 | 2.2% | ||||||||||||\n| Australasia | 30,366 | 29,604 | 2.6% | 61,539 | 59,144 | 4.0% | ||||||||||||\n| Same property NOI (1) | $ | 73,156 | $ | 71,191 | 2.8% | $ | 147,050 | $ | 141,997 | 3.6% | ||||||||\n| Impact of foreign currency translation | - | 184 | - | 53 | ||||||||||||||\n| Straight-line rental revenue recognition | 59 | 595 | 812 | 1,831 | ||||||||||||||\n| Amortization of operating leases | (29 | ) | (34 | ) | (59 | ) | (72 | ) | ||||||||||\n| Lease termination fees | 14 | 33 | 14 | 102 | ||||||||||||||\n| Other transactions | (194 | ) | (42 | ) | (137 | ) | 449 | |||||||||||\n| Developments | 2,767 | 156 | 4,498 | 477 | ||||||||||||||\n| Dispositions | 535 | 21,893 | 1,278 | 44,591 | ||||||||||||||\n| NOI | $ | 76,308 | $ | 93,976 | (18.8)% | $ | 153,456 | $ | 189,428 | (19.0)% |\n(1) Same property NOI is a non-IFRS measure, defined and discussed in the REIT's MD&A.\nExhibit 2 – Funds From Operations and Adjusted Funds from Operations Reconciliation\nFFO is a supplemental non-IFRS industry wide financial measure of a REIT's operating performance. The REIT calculates FFO based on certain adjustments to net income (loss) (computed in accordance with IFRS) as detailed below. FFO is more fully defined and discussed in the MD&A (see \"Performance Measurement\" and \"Funds From Operations\").\nFor the three and six months ended June 30, 2025, FFO was $26.5 million including accelerated amortization of deferred financing costs as a result of early repayment of the underlying debt, using proceeds from the senior unsecured debentures. Excluding the impact of $1.4 million of accelerated amortization of deferred financing costs, FFO for the three and six months ended June 30, 2025 is $28.0 million or $0.11 per unit.\n| FUNDS FROM OPERATIONS (\"FFO\") | Three months ended June 30, | Six months ended June 30, | ||||||||||\n| (unaudited) | 2025 | 2024 | 2025 | 2024 | ||||||||\n| Net income (loss) attributable to unitholders | $ | 25,960 | $ | (122,338 | ) | $ | 25,070 | $ | (169,945 | ) | ||\n| Add / (Deduct): | ||||||||||||\n| Fair market value losses (gains) (2) | (6,995 | ) | 166,290 | 6,941 | 245,345 | |||||||\n| Finance cost - Exchangeable Unit distributions | - | - | - | (63 | ) | |||||||\n| Revaluation of financial liabilities | 397 | 424 | 3,816 | 4,432 | ||||||||\n| Unrealized foreign exchange loss (gain) | (4,201 | ) | 752 | (5,886 | ) | (13,291 | ) | |||||\n| Deferred taxes | 3,796 | (33,922 | ) | 1,502 | (38,512 | ) | ||||||\n| Transaction costs | 2,384 | 4,568 | 11,816 | 7,030 | ||||||||\n| Net loss on disposal of assets | 3,199 | 4,813 | 4,566 | 9,831 | ||||||||\n| Convertible Debenture issuance costs | - | - | - | 27 | ||||||||\n| Internal leasing costs | 439 | 293 | 839 | 651 | ||||||||\n| Property taxes accounted for under IFRIC 21 | 8 | (74 | ) | 28 | 61 | |||||||\n| Net adjustment for lease liabilities | 102 | (125 | ) | 21 | (250 | ) | ||||||\n| Employee termination benefits and related expenses | 1,234 | - | 1,616 | - | ||||||||\n| Other FFO adjustments | 198 | 1,633 | 411 | 3,955 | ||||||||\n| FFO (1) (2) | $ | 26,521 | $ | 22,314 | 50,740 | 49,271 | ||||||\n| FFO per Unit - Basic (1) (2) | $ | 0.11 | $ | 0.09 | $ | 0.20 | $ | 0.20 | ||||\n| FFO per Unit - Diluted (3) | $ | 0.11 | $ | 0.09 | $ | 0.20 | $ | 0.20 | ||||\n| Weighted average units outstanding | ||||||||||||\n| Basic | 248,856,278 | 246,032,139 | 248,482,289 | 245,706,653 | ||||||||\n| Diluted (3) | 249,941,309 | 247,415,816 | 249,528,523 | 247,062,996 |\n(1) FFO and AFFO are not measures recognized under IFRS and do not have standardized meanings prescribed by IFRS. See Performance Measurement in the REIT's MD&A. The adjustments to determine FFO and AFFO have been presented on a proportionate basis.\n(2) Included in FFO for the six months ended June 30, 2024 is $6.7 million related to premiums paid in connection with interest rate cap derivatives, the impact of which is $0.03 per unit.\n(3) Diluted units include the impact of vested deferred trust units and the convertible debentures, that would have a dilutive effect upon conversion.\nAFFO is a supplemental non-IFRS financial measure of a REIT's operating performance and is intended to reflect a stabilized business environment. The REIT calculates AFFO as FFO, plus/minus certain adjustments as detailed below. AFFO is more fully defined and discussed in the MD&A (see \"Performance Measurement\" and \"Adjusted Funds From Operations\").\n| ADJUSTED FUNDS FROM OPERATIONS | ||||||||||||\n| (unaudited) | Three months ended June 30, | Six months ended June 30, | ||||||||||\n| 2025 | 2024 | 2025 | 2024 | |||||||||\n| FFO (1)(2) | $ | 26,521 | $ | 22,314 | $ | 50,740 | $ | 49,271 | ||||\n| Add / (Deduct): | ||||||||||||\n| Amortization of transactional deferred financing charges | 1,447 | 2,031 | 3,350 | 4,816 | ||||||||\n| Unit-based compensation expense | 1,018 | 270 | 3,591 | 2,819 | ||||||||\n| Straight-line revenue | (543 | ) | (513 | ) | (1,849 | ) | (1,699 | ) | ||||\n| Leasing costs and non-recoverable maintenance capital expenditures | (3,036 | ) | (2,916 | ) | (6,077 | ) | (6,342 | ) | ||||\n| AFFO (1) | $ | 25,407 | $ | 21,186 | $ | 49,755 | $ | 48,865 | ||||\n| AFFO per Unit - Basic (1)(2) | $ | 0.10 | $ | 0.09 | $ | 0.20 | $ | 0.20 | ||||\n| AFFO per Unit - diluted (2) | $ | 0.10 | $ | 0.09 | $ | 0.20 | $ | 0.20 | ||||\n| Distributions per Unit | $ | 0.09 | $ | 0.09 | $ | 0.18 | $ | 0.18 | ||||\n| Weighted average units outstanding: | ||||||||||||\n| Basic | 248,856,278 | 246,032,139 | 248,482,289 | 245,706,653 | ||||||||\n| Diluted (2) | 249,941,309 | 247,415,816 | 249,528,523 | 247,062,996 |\n(1) FFO and AFFO are not measures recognized under IFRS and do not have standardized meanings prescribed by IFRS. See Performance Measurement in the REIT's MD&A. The adjustments to determine FFO and AFFO have been presented on a proportionate basis.\n(2) Included in FFO for the six months ended June 30, 2024 is $6.7 million related to premiums paid in connection with interest rate cap derivatives, the impact of which is $0.03 per unit.\n(3) Diluted units include the impact of vested deferred trust units and the convertible debentures, that would have a dilutive effect upon conversion.\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/262222"
    }
  ],
  "argos_summary": "Northwest Healthcare Properties REIT reported strong Q2 2025 results, with net income of $32.6 million compared to a net loss of $127.2 million in Q2 2024, driven by reduced interest expenses and fair value gains on investment properties. The REIT's adjusted funds from operations (AFFO) remained stable at $0.10 per unit, and the AFFO payout ratio improved to 88%. The REIT also announced the suspension of its distribution reinvestment plan and the appointment of Zachary Vaughan as a non-independent trustee, emphasizing a focus on disciplined capital allocation and strategic asset management.",
  "argos_id": "RE869C7YK"
}