{
  "url": "https://townhall.com/tipsheet/mattvespa/2025/08/12/texas-senate-passes-new-congressional-map-that-caused-dems-to-melt-down-n2661760",
  "authorsByline": "Matt Vespa",
  "articleId": "b5537270e7a546e1a221092a07bca15e",
  "source": {
    "domain": "townhall.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Arlington County",
      "city": "Arlington",
      "coordinates": {
        "lat": 38.8903961,
        "lon": -77.0841585
      }
    }
  },
  "imageUrl": "https://media.townhall.com/cdn/hodl/2021/323/64fd4631-4d4c-45a1-8a90-745db2dcbcf9.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T16:05:10-04:00",
  "addDate": "2025-08-12T20:12:12.622038+00:00",
  "refreshDate": "2025-08-12T20:12:12.622039+00:00",
  "score": 1.0,
  "title": "Texas Senate Passes New Congressional Map That Caused Dems to Melt Down",
  "description": "Texas Senate passes new congressional map amidst Democratic protests and quorum challenges.",
  "content": "Texas is inching closer to making its new congressional map for the 2026 midterms official. This move caused Democrats in the State House to flee to prevent a quorum, which has led to arrest warrants and threats of expulsion from Gov. Gregg Abbott. Still, governing must continue, with the Texas Senate effortlessly passing the new map on a 19-2 vote. Democrats in the upper chamber protested, but now the ball is truly in the State House’s court, though without Democrats, this process remains stalled (via Texas Tribune):\n\nThe Texas Senate approved new congressional lines on Tuesday in a rare mid-decade redistricting effort that could aid Republicans in their effort to keep control of the U.S. House of Representatives after the 2026 election. The vote was 19-2, with nine Democrats absent after exiting the Senate floor moments after the maps were taken up, a show of protest against what they framed as a \"corrupt process.\" \"This mid-decade redistricting isn’t about fair representation—it’s about politicians picking their voters instead of voters choosing their leaders,\" the Senate Democratic Caucus said in a statement. \"And it doesn’t stop here. If they can gerrymander now, they can and will do it before every election.\" The exit wasn't enough to deny a quorum, as their counterparts have done in the Texas House. Dozens of Democrats in the lower chamber have decamped to Illinois and other parts of the country, bringing work in the House to a halt for a second week as the chamber continued to lack the minimum headcount needed to conduct business. “We stand in solidarity with our House Democrat brothers and sisters,” said Houston Sen. Carol Alvarado, the Senate Democratic leader. “Our options here to push back and fight in the Senate are pretty limited, so we’re using every tool that we have.” The Senate-approved map now heads to the House, which must approve the lines. So far, the Democrats' absence has stalled the effort. On Tuesday, Lt. Gov. Dan Patrick and House Speaker Dustin Burrows said they would adjourn for the session if the lower chamber continued to lack a quorum on Friday. Gov. Greg Abbott said he would immediately call a second special session with the same agenda, while teasing the possibility of adding more items.\n\nThe FBI has received the green light to assist local and state law enforcement in hunting down these derelict Democrats. This map is going to happen, guys. And, again, no one cares. Democrats have a bad habit of thinking the American people are on their side on their most cherished agenda items. They’re pure lunacy and beyond niche—we all have better things to do. Also, gerrymandering isn’t illegal. Everyone does it, and as soon as everyone thought these Democrats fled the state, the messaging war was over.\n\nEditor’s Note: Do you enjoy Townhall's conservative reporting that takes on the radical left and woke media? Please support our work so that we can continue to bring you the truth.\n\nJoin TOWNHALL VIP and use the promo code FIGHT to get 60% off your VIP membership!",
  "medium": "Article",
  "links": [
    "https://t.co/5pcsRhvSQ8",
    "https://www.texastribune.org/2025/08/11/texas-redistricting-map-vote-senate/",
    "https://townhall.com/tipsheet/katiepavlich/2025/08/12/wait-what-happened-to-the-dc-evidence-lab-n2661695",
    "https://twitter.com/EndWokeness/status/1955347286021771447?ref_src=twsrc%5Etfw",
    "https://townhall.com/subscribe?tpcc=60salemv&promo_code=FIGHT"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Texas Senate",
      "weight": 0.089165315
    },
    {
      "name": "New Congressional Map",
      "weight": 0.08711273
    },
    {
      "name": "House",
      "weight": 0.07790347
    },
    {
      "name": "House Speaker Dustin Burrows",
      "weight": 0.076724485
    },
    {
      "name": "Senate",
      "weight": 0.07589093
    },
    {
      "name": "new congressional lines",
      "weight": 0.07325397
    },
    {
      "name": "Democrats",
      "weight": 0.073088765
    },
    {
      "name": "mid-decade",
      "weight": 0.059077356
    },
    {
      "name": "Lt. Gov. Dan Patrick",
      "weight": 0.058654737
    },
    {
      "name": "Texas Tribune",
      "weight": 0.058176752
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.994140625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.990234375
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.9404296875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.73193359375
    },
    {
      "name": "/News/Local News",
      "score": 0.70263671875
    }
  ],
  "sentiment": {
    "positive": 0.03778234,
    "negative": 0.7918107,
    "neutral": 0.17040698
  },
  "summary": "The Texas Senate has approved a new congressional map for the 2026 midterms, which caused Democrats in the State House to flee to prevent a quorum, leading to arrest warrants and threats of expulsion from Gov. Gregg Abbott. The Senate passed the new map on a 19-2 vote, with nine Democrats absent in protest against the \"corrupt process\". The map could aid Republicans in their bid to retain control of the U.S. House of Representatives. However, without the Democrats, this process remains stalled. The House must approve the lines. The FBI has been given the green light to assist local and state law enforcement in finding these Democrats.",
  "shortSummary": "The Texas Senate passed a new congressional map for the 2026 midterms, despite Democrats' exit from the lower chamber blocking the process, leading to arrest warrants and threats of expulsion.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "30ea993d468f4fa5af73bc5858b5927b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.texastribune.org/2025/08/11/texas-redistricting-map-vote-senate/",
      "text": "Texas Senate approves new congressional lines as House Democrats remain out of state\nSign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\nThe Texas Senate approved new congressional lines on Tuesday in a rare mid-decade redistricting effort that could aid Republicans in their effort to keep control of the U.S. House of Representatives after the 2026 election.\nThe vote was 19-2, with nine Democrats absent after exiting the Senate floor moments after the maps were taken up, a show of protest against what they framed as a \"corrupt process.\"\n\"This mid-decade redistricting isn’t about fair representation—it’s about politicians picking their voters instead of voters choosing their leaders,\" the Senate Democratic Caucus said in a statement. \"And it doesn’t stop here. If they can gerrymander now, they can and will do it before every election.\"\nThe exit wasn't enough to deny a quorum, as their counterparts have done in the Texas House. Dozens of Democrats in the lower chamber have decamped to Illinois and other parts of the country, bringing work in the House to a halt for a second week as the chamber continued to lack the minimum headcount needed to conduct business.\n“We stand in solidarity with our House Democrat brothers and sisters,” said Houston Sen. Carol Alvarado, the Senate Democratic leader. “Our options here to push back and fight in the Senate are pretty limited, so we’re using every tool that we have.”\nThe Senate-approved map now heads to the House, which must approve the lines. So far, the Democrats' absence has stalled the effort. On Tuesday, Lt. Gov. Dan Patrick and House Speaker Dustin Burrows said they would adjourn for the session if the lower chamber continued to lack a quorum on Friday. Gov. Greg Abbott said he would immediately call a second special session with the same agenda, while teasing the possibility of adding more items.\nTexas Republicans began to push for new political boundaries after President Donald Trump’s team insisted state lawmakers, who were initially wary, take up an opportunity to gain more GOP seats in Congress.\nThe Senate-approved map is identical to the initial draft introduced in the House. After that proposal was approved by a House committee, Democrats in the lower chamber left the state, depriving the chamber of the required number of lawmakers to pass legislation. The so-called quorum break stalled the map from passing the full House.\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nIn a statement, Patrick said the Senate \"will continue passing this map each legislative session to accurately reflect our state until House Democrats return from their ‘vacation’ and get back to work for the people of Texas.”\nWhile the Senate Democrats who walked out Tuesday labeled the map \"unconstitutional,\" the Republican leading the chamber's redistricting push argued otherwise.\n\"No one has presented data, or frankly any compelling case that this map violates any applicable laws,\" said Sen. Phil King, R-Weatherford.\nDemocrats in other states, including California Gov. Gavin Newsom and New York Gov. Kathy Hochul, have also promised their own retaliatory redistricting if Texas passes the new map.\nRepublicans in Texas have taken an offensive stance on the quorum break, with Burrows signing civil arrest warrants for the missing Democrats. Abbott and Attorney General Ken Paxton have also requested that some members be expelled from their seats by the state Supreme Court. Missing members are also facing $500-a-day fines for their absence.\nLatest in the series: 2025 Legislative Recap\nLoading content …\nIn crafting new districts that would likely elect Republican representatives, the proposed map could also pit incumbent Democratic representatives against one another in some districts, or risk them losing their seats in others. Under the new map, areas represented by progressive Reps. Greg Casar and Lloyd Doggett would both be under the new District 37, currently held by Doggett.\nDoggett has expressed interest in running again for the seat and pushed back in a post on X against claims he was “declaring war” on Casar in doing so. The new map would redraw Casar’s District 35 so that less than 10% of his current constituency would remain as it would no longer cover the Austin area.\n“Abandoning winnable majority Hispanic #TX35 to challenge me in #TX37 helps Trump, divides progressives,” Doggett wrote in the post on Monday.\nThis is a developing story and will be updated.\nShape the future of Texas at the 15th annual Texas Tribune Festival, happening Nov. 13–15 in downtown Austin! We bring together Texas’ most inspiring thinkers, leaders and innovators to discuss the issues that matter to you. Get tickets now and join us this November.\nTribFest 2025 is presented by JPMorganChase.\nInformation about the authors\nLearn about The Texas Tribune’s policies, including our partnership with The Trust Project to increase transparency in news."
    },
    {
      "url": "https://townhall.com/tipsheet/katiepavlich/2025/08/12/wait-what-happened-to-the-dc-evidence-lab-n2661695",
      "text": "It's been 24 hours since President Donald Trump declared a crime emergency in the Nation's Capitol, citing a failure of local political leadership to keep Washington D.C. safe from criminals.\n🚨 President Trump announces he is invoking the D.C. Home Rule Act to place the D.C. Metropolitan Police Department under direct federal control and deploy the National Guard.\n— Rapid Response 47 (@RapidResponse47) August 11, 2025\n\"This is Liberation Day in D.C. — and we're going to take our capital BACK.\" pic.twitter.com/aqov60mrCW\nThe aftermath of the announcement puts a microscope on how D.C. has handled crime in recent years.\nIn 2021 the Department of Forensic Sciences, the lab used by local law enforcement and prosecutors for cases in D.C., lost its accreditation over mishandling of evidence and other failed lab practices. Just this year, it received accreditation for some evidence analysis, including DNA, drugs, other substances and fingerprints, but is still unable to conduct ballistic testing.\n\"For years the D.C. crime lab wasn't allowed to process cases due to a lack of accreditation. The testing had to be outsourced, which took more time, hindering the possibility of catching suspects and exonerating others,\" local ABC News 7 reports. \"Then U.S. Attorney Matthew Graves said that 66 percent of cases that weren’t prosecuted in 2022 and more than half in 2023 were mostly misdemeanors that required testing that the lab couldn’t do.\"\nRecommended\nIt took four years for the lab to get its accreditation back. The result? A lack of prosecutions, criminals walking free and a failure to get justice for victims.\nDespite this failure, Democrats and their allies in the media continue to argue crime is \"down\" in the District. Crime is raging and it isn't being properly prosecuted.\nEditor’s Note: President Donald Trump is returning Washington D.C. to the American people by locking up violent criminals and restoring order.\nWe've covered D.C.'s decay for years. Support us today in our coverage of its comeback.\nJoin Townhall VIP and use promo code FIGHT to get 60% off your membership.\nJoin the conversation as a VIP Member"
    }
  ],
  "argos_summary": "The Texas Senate has approved a new congressional map aimed at benefiting Republicans in the upcoming 2026 midterms, with a vote of 19-2. This mid-decade redistricting has prompted protests from Democrats, who have fled the state to prevent a quorum in the House, leading to potential arrest warrants and threats of expulsion from Governor Greg Abbott. The absence of Democrats has stalled the legislative process, while Republicans are pushing forward with the map, which could significantly alter the political landscape in Texas.",
  "argos_id": "REOVWLO60"
}