{
  "url": "https://www.washingtonexaminer.com/news/white-house/3497097/muriel-bowser-trump-evolving-relationship-explained/",
  "authorsByline": "David Zimmermann",
  "articleId": "0e36a7838ae642dabb95894926bc9a07",
  "source": {
    "domain": "washingtonexaminer.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonexaminer.com/wp-content/uploads/2025/08/bowser.webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:20:44+00:00",
  "addDate": "2025-08-12T18:35:17.553566+00:00",
  "refreshDate": "2025-08-12T18:35:17.553568+00:00",
  "score": 1.0,
  "title": "Bowser cooperating with Trump's DC takeover despite past clashes",
  "description": "District of Columbia Mayor Muriel Bowser refused to categorize Trump's deployment of the National Guard as a \"complete disaster.\"",
  "content": "As President Donald Trump begins his takeover of Washington by federalizing the local police and activating the National Guard to combat the crime rate, it appears Mayor Muriel Bowser does not want to test her limits with the administration.\n\nThe mayor indicated on Monday that local officials would comply with the federal government’s directive, although she did call the administration’s actions “unsettling and unprecedented.” Still, she struck a more cooperative tone than Democratic lawmakers in Congress and on the District of Columbia Council, who have made their outrage known in the hours since Trump’s announcement.\n\nBowser’s cautious approach is in stark contrast to her adversarial messaging during Trump’s first term.\n\nTrump last deployed the National Guard in D.C. during the summer of 2020, when the Black Lives Matter riots were in full swing following the death of George Floyd at the hands of a Minneapolis police officer. At the time, Bowser demanded that Trump remove federal law enforcement and the military from the city as the riots continued.\n\nIn a letter to Trump, she said the increased law enforcement presence was further “inflaming demonstrators and adding to the grievances of those who, by and large, are peacefully protesting for change and reforms to the racist and broken systems that are killing Black Americans.”\n\nThe mayor was sympathetic to the racial justice movement, as seen in her decision to order the creation of the Black Lives Matter Plaza in 2020. The street once featured large yellow letters spelling out “Black Lives Matter.” The mural was removed earlier this year after Trump took office.\n\nIn 2022, Bowser testified to Congress that it would have been a “complete disaster” if Trump had federalized the Metropolitan Police Department in response to the racial riots. She also expressed concern that she would “lose the city” to violence.\n\nThis time around, she refused to categorize Trump’s deployment of the National Guard as a “complete disaster.”\n\nWhen asked by a reporter on Monday whether she feared losing control of the city, Bowser responded, “I’m going to work every day to make sure it’s not a complete disaster.”\n\nThere was also friction between the two leaders over the Jan. 6, 2021, Capitol riot, with Bowser blaming Trump for the incident at the time and calling him an “unhinged president.” She claimed the riot was a “textbook” example of domestic terrorism.\n\nTrump similarly blamed Bowser for not stopping the riot, but her advisers were trying to reach the president that day.\n\nBowser tried to set the record straight on her response to the Jan. 6 riot, saying in September 2024 that she offered the MPD to support the Capitol Police. She noted that Trump did not deploy the D.C. National Guard to quell the riot, even though he had the authority to do so.\n\nAbout 25,000 members of the National Guard, however, were deployed during the weeks after Jan. 6, including during Joe Biden’s inauguration. Soldiers maintained a visible presence in the district, with roughly 2,000 troops staying until May 2021.\n\nNow that Trump is back in office, Bowser has taken steps to maintain a good relationship with him. She met with Trump before his second inauguration to discuss their “shared priorities” and identify ways to “find common ground,” according to a December 2024 statement from the mayor’s office.\n\n“President Trump and I both want Washington, D.C., to be the best, most beautiful city in the world and we want the capital city to reflect the strength of our nation,” she said.\n\nBowser has an open line of communication with the second Trump administration. She has frequently spoken with the president over the phone, including one phone call over the weekend about deploying the National Guard. She did not expect the announcement to also be about federalizing D.C. police.\n\nOn Tuesday, Bowser and Metropolitan Police Chief Pamela Smith met with Attorney General Pam Bondi and other federal officials to discuss the takeover of the local police department.\n\nTrump has acknowledged his amicable relationship with the Democratic mayor but said the local government is not doing enough to target criminals and clean up the city.\n\nBowser stands by recent statistics showing the district experienced a 30-year low in violent crime last year, although she said more could always be done to lower crime rates. As of Tuesday, the MPD reports a 26% decrease in violent crimes and a 7% decrease in all crimes. Homicides are down 11%, compared to the same time last year.\n\nTrump is looking to drive those numbers down even further by invoking his emergency authority under the Home Rule Act that allows the federal government to take temporary control of the MPD. The federal takeover is expected to last 30 days unless the Republican-controlled Congress votes to extend it.",
  "medium": "Article",
  "links": [
    "https://wamu.org/story/21/01/07/what-happened-yesterday-is-textbook-terrorism-d-c-mayor-says/",
    "https://dc.gov/release/statement-mayor-bowser-meeting-president-trump",
    "https://www.cnbc.com/2020/06/05/george-floyd-protests-dc-mayor-tells-trump-to-remove-federal-officers-military-from-city.html",
    "https://www.washingtonpost.com/dc-md-va/2022/12/29/bowser-contee-jan6-transcripts/",
    "https://www.washingtonpost.com/politics/2022/04/07/trump-interview-jan6/",
    "https://mpdc.dc.gov/page/district-crime-data-glance",
    "https://x.com/MayorBowser/status/1833702410688025011",
    "https://www.washingtonexaminer.com/news/white-house/3496849/trump-dc-crime-push-puts-democrats-on-defense/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump",
      "weight": 0.08685522
    },
    {
      "name": "President Trump",
      "weight": 0.08560399
    },
    {
      "name": "Donald Trump",
      "weight": 0.0846345
    },
    {
      "name": "President Donald Trump",
      "weight": 0.081049025
    },
    {
      "name": "Muriel Bowser",
      "weight": 0.07204144
    },
    {
      "name": "Bowser",
      "weight": 0.07150655
    },
    {
      "name": "Mayor Muriel Bowser",
      "weight": 0.07006045
    },
    {
      "name": "Black Lives Matter",
      "weight": 0.06421553
    },
    {
      "name": "federal law enforcement",
      "weight": 0.06288473
    },
    {
      "name": "other federal officials",
      "weight": 0.058302466
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9970703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9580078125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.89990234375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.728515625
    }
  ],
  "sentiment": {
    "positive": 0.048333347,
    "negative": 0.777399,
    "neutral": 0.17426766
  },
  "summary": "D.C. Mayor Muriel Bowser has been cooperative with President Donald Trump's takeover of Washington, following a period of tension between her and the federal government. Despite past clashes with the administration, Bowser has shown a cautious approach towards the federal takeover, stating that local officials will comply with the federal mandate. This follows a period where she previously clashed with the White House, calling for the removal of federal law enforcement and military from the city during the Black Lives Matter riots. She also expressed concern that she might lose control of the city to violence and expressed a desire to prevent further violence. Despite this, Bowser remains committed to maintaining a good relationship with the second Trump administration and has spoken with the president over the phone.",
  "shortSummary": "Mayor Muriel Bowser is cooperating with President Donald Trump's takeover of Washington, despite past tensions and calls for national Guard intervention.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a2b3981aca8b4d9ba9b5e6dc2e8a8b8b",
  "places": [
    {
      "osmId": "48077383",
      "road": "Black Lives Matter Plaza Northwest",
      "city": "Washington",
      "state": "District of Columbia",
      "postcode": "20006",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Golden Triangle",
      "coordinates": {
        "lat": 38.9021027,
        "lon": -77.0360882486573
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.washingtonexaminer.com/news/white-house/3496849/trump-dc-crime-push-puts-democrats-on-defense/",
      "text": "President Donald Trump is painting Democrats as soft on crime ahead of the 2026 midterm elections as he seizes control of law enforcement in Washington and accuses liberals of presiding over a public safety crisis.\nTrump announced Monday morning that he, for the first time in the nation’s history, will federalize the Metropolitan Police Department of the District of Columbia and mobilize hundreds of National Guard troops to supplement a crackdown on violent crime in the district.\nTRUMP ANNOUNCES FEDERAL TAKEOVER OF DC POLICE TO FIGHT CRIME: WHAT TO KNOW\nThe move was followed by Trump’s threats to expand his law enforcement push to other cities led by Democrats, including Chicago, Los Angeles, New York, Baltimore, and Oakland, California.\n“We’re not going to lose our cities over this,” Trump said of crime. “And this will go further.”\nWhile Washington is unique because Congress controls it and the president can order up the National Guard, Trump’s calling out other blue cities put Democrats on defense, claiming that crime is not bad enough to warrant such federal interference.\n“Violent crime in Washington, D.C. is at a thirty-year low,” Rep. Hakeem Jeffries (D-NY) said. “Donald Trump has no basis to take over the local police department. And zero credibility on the issue of law and order. Get lost.”\nThe takeover of the MPD, which is expected to last 30 days, was met with outrage from leading Democratic lawmakers, including Govs. Gavin Newsom (D-CA), JB Pritzker (D-IL), and Wes Moore (D-MD), all possible 2028 presidential candidates.\n“He was just getting warmed up in Los Angeles,” Newsom wrote on social media following Trump’s Monday press conference, referencing the president’s use of National Guard assets earlier this year to quell protests and riots surrounding Immigration and Customs Enforcement raids in the Los Angeles area. “He will gaslight his way into militarizing any city he wants in America. This is what dictators do.”\n“Let’s not lie to the public, you and I both know you have no authority to take over Chicago,” Pritzker added in his statement. “By the way, where are the Epstein files?”\nMoore said, “Trump’s decision to mobilize the National Guard to conduct municipal policing in D.C. lacks seriousness and is deeply dangerous.”\nThe Democratic Mayors Association cited statistics showing that “crime is down in most major cities — including Washington, D.C.” to claim that Trump “only wants to create another political charade to serve his own interests and distract Americans from his failures.”\nSenior Republican operatives with close ties to the Trump White House told the Washington Examiner that Newsom, Pritzker, and other presidential hopefuls “predictably” fell into Trump’s political trap, one that pits them on the “losing side” of the issue.\n“There’s no denying that Washington is an absolute cesspool — wannabe teenage gangsters, weed smoke everywhere,” one former Trump administration official said. “President Trump is doing what any reasonable person would hope, making this city safe and livable. And instead of saying, ‘Thank you, Mr. President, for cleaning up our streets,’ the Democrats are coming out as pro-crime. It’s the perfect play.”\n“I certainly hope so,” a veteran operative with past work on Trump’s political campaigns laughed when asked if Trump’s move could put Democrats at a disadvantage ahead of next year’s elections.\nTrump has employed similar tactics in the past, albeit with mixed results. Throughout the 2020 campaign, which he lost, the president repeatedly sought to paint Democratic nominee Joe Biden and others in his party as soft on crime by linking them to the Black Lives Matter protests and national police reform movements.\nThat tactic proved much more successful during the 2024 election. However, as Trump was able to spin Biden and then-Vice President Kamala Harris’s border policies into electoral gold, he specifically sought to tie immigration to crime on Monday morning.\n“We’re not going to take it just like we did on our southern border,” he said during his press conference. “Nobody comes to our southern border anymore.”\nTrump’s intervention happened after a string of high-profile crimes in Washington, including the murder of two Israeli Embassy staffers, Yaron Lischinsky and Sarah Milgrim; the attack of Edward Coristine, a former Department of Government Efficiency engineer who goes by the nickname “Big Balls;” and the shooting death of 21-year-old congressional intern Eric Tarpinian-Jachym.\nTamara Tarpinian-Jachym, Eric’s mother, said she does not care that statistics show crime may be declining when far too many people are getting hurt.\n“I looked at Eric’s ashes, and I said, ‘Eric, you haven’t died in vain,'” Tarpinian-Jachym told Fox News in praising Trump’s announcement. “Things will change so other people are safe when they go visit D.C. or work at D.C. And that’s my goal, to make people safe.”\nEven the DC Police Union issued a statement on Monday welcoming Trump’s takeover announcement. Chairman Gregg Pemberton said his union stands “with the president in recognizing that Washington, DC, cannot continue on this trajectory.”\n“Crime is out of control, and our officers are stretched beyond their limits,” Pemberton wrote. “The federal intervention is a critical stopgap, but the MPD needs proper staffing and support to thrive. This can only happen by repealing the disastrous policies that have driven out our best officers and hindered recruitment.”\n“This is why Democrats continue to be so unpopular among everyday Americans — they think the President of the United States cracking down on crime in our nation’s capital is a bad thing,” White House spokesperson Taylor Rogers added in a statement when asked if Trump’s announcement is meant to put political pressure on the opposing party.\nHowever, Trump’s polling remains negative, with the RealClearPolitics average showing his approval rating sitting 6 points underwater as of Monday. Furthermore, only 4% of respondents to an Economist-YouGov tracking poll last week ranked crime as the most important issue to them, with inflation and prices (21%), jobs and the economy (14%), and healthcare (11%) all significantly outranking crime.\nAnd not all Democrats took Trump’s Monday bait.\nD.C. Mayor Muriel Bowser framed Trump’s announcement as an opportunity to supplement their existing police initiatives.\n“I can’t say that, given some of the rhetoric of the past, that we’re totally surprised,” she told reporters. “I can say to D.C. residents that we will continue to operate our government in a way that makes you proud.”\nThough Bowser did call Trump’s moves “unprecedented,” she also repeatedly declined to tell reporters that she would resist the federal takeover in any form or fashion, despite protests breaking out in the city demanding a “Free D.C.“\n“If people are concerned about the president being able to move the National Guard into our city, the time to do that would have been when Congress had a bill that it could have given control of the D.C. National Guard to D.C.,” the mayor continued.\nA Democratic National Committee spokesman declined to comment on whether Trump’s district takeover would put political pressure on Democrats regarding crime, instead citing Chairman Ken Martin’s statement from earlier in the day.\n“Donald Trump’s record as president is marked by gross abuses of power, and his latest move to supersede local law enforcement by deploying the National Guard to Washington, D.C. is no exception,” Martin wrote.\nDemocratic strategist Mike Nellis downplayed questions regarding whether Trump has potentially put pressure on Democrats concerning crime.\n“Federalizing the D.C. police is another wild swing from the president as his approval rating continues to crater,” Nellis told the Washington Examiner. “His decision-making is driven by erratic attempts to change the subject.”\nNellis, who worked for Harris’s 2020 Democratic primary campaign, during which she was pressured regarding crime, added, “Polls show him underwater on every major issue, including immigration. Most Americans don’t care about what happens in DC — they want action on the economy, and most say they’re worse off than before Trump took office.”\nA second Democratic strategist, Christopher Hahn, agreed.\nTRUMP FEDERALIZES DC POLICE AND ACTIVATES NATIONAL GUARD TO COMBAT CRIME: ‘TAKE OUR CAPITAL BACK’\n“This is the standard GOP playbook being taken to another level,” Hahn said.\n“Now that he’s involved, he owns all of it,” Hahn told the Washington Examiner regarding Trump. “And we all know how powerful a single crime can be in political ads.”"
    },
    {
      "url": "https://mpdc.dc.gov/page/district-crime-data-glance",
      "text": "2025 Year-to-Date Crime Comparison*\nAs of August 12, 2025\nThe statistics below reflect the data entered into MPD's records management system as of 12 am on the date above. These numbers are based on DC Code Offense definitions and do NOT reflect Part I crime totals as reported to the FBI’s National Incident-Based Reporting System (NIBRS). This report should be considered ‘preliminary’ in nature. The reports are subject to change due to subsequent determinations related to amendments in classification, unfounded cases or changes in offense definitions.\n| Offense | 2024 | 2025 | Percent Change |\n|---|---|---|---|\n| Homicide | 112 | 100 | -11% |\n| Sex Abuse | 110 | 55 | -50% |\n| Assault w/ a Dangerous Weapon | 668 |\n534 |\n-20% |\n| Robbery | 1,252 | 899 | -28% |\n| Violent Crime - Total |\n2,142 |\n1,588 | -26% |\n| Burglary | 546 |\n443 |\n-19% |\n| Motor Vehicle Theft | 2,915 | 2,919 | 0% |\n| Theft from Auto | 3,876 | 3,739 | -4% |\n| Theft (Other) | 7,459 | 7,047 | -6% |\n| Arson | 3 | 4 | 33% |\n| Property Crime - Total | 14,799 | 14,152 | -4% |\n| All Crime - Total | 16,941 | 15,740 | -7% |\n2024 Year End Crime Data\nYear-end 2024 data accurate as of January 1, 2025.\n| Offense | 2023 | 2024 | Percent Change |\n|---|---|---|---|\n| Homicide | 274 | 187 | -32% |\n| Sex Abuse | 191 | 143 | -25% |\n| Assault w/ a Dangerous Weapon | 1,412 |\n1,026 |\n-27% |\n| Robbery | 3,468 | 2,113 | -39% |\n| Violent Crime - Total |\n5,345 |\n3,469 | -35% |\n| Burglary | 1,095 | 1.001 |\n-9% |\n| Motor Vehicle Theft | 6,809 | 5,139 | -25% |\n| Theft from Auto | 7,795 | 6,698 | -14% |\n| Theft (Other) | 13,314 | 13,037 | -2% |\n| Arson | 11 | 4 | -64% |\n| Property Crime - Total | 29,024 | 25,879 | -11% |\n| All Crime - Total | 34,369 | 29,348 | -15% |\nRecovered Firearms\n| 2015 | 2016 | 2017 | 2018 | 2019 | 2020 | 2021 | 2022 | 2023 | 2024 |\n|---|---|---|---|---|---|---|---|---|---|\n| 1,706 | 1,870 | 2,191 | 1,928 | 2,299 | 2,371 | 2,310 | 3,152 | 3,135 | 2,895 |\n20-Year Homicide Trend\n| 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 |\n|---|---|---|---|---|---|---|---|---|---|\n| 187 | 274 | 203 | 226 | 198 | 166 | 160 | 116 | 135 | 162 |\n| 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 |\n|---|---|---|---|---|---|---|---|---|---|\n| 105 | 104* | 88 | 108 | 132 | 144 | 186 | 181 | 169 | 196 |\n*The citywide 2013 homicide statistics include the 12 victims of the Washington Navy Yard shooting incident that occurred on September 16, 2013."
    }
  ],
  "argos_summary": "President Trump has federalized the Metropolitan Police Department in Washington, D.C., and activated the National Guard to address rising crime rates, a move met with mixed reactions from local officials. Mayor Muriel Bowser, while calling the actions \"unsettling and unprecedented,\" has chosen a cooperative stance, contrasting her previous adversarial approach during Trump's first term. The federal takeover, expected to last 30 days, has sparked outrage among Democratic lawmakers, who argue that crime is already at a 30-year low in the district.",
  "argos_id": "RJNAAXSYU"
}