{
  "url": "https://www.usatoday.com/story/sports/ncaaf/acc/2025/08/12/tom-brady-bill-belichick-north-carolina-football/85634176007/",
  "authorsByline": "John Leuzzi",
  "articleId": "50f39db7da27453985c3afd2741cd83b",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/11/SUNC/85618967007-usatsi-12036772.jpg?crop=4835,2720,x0,y397&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:55:26+00:00",
  "addDate": "2025-08-12T23:59:35.644441+00:00",
  "refreshDate": "2025-08-12T23:59:35.644443+00:00",
  "score": 1.0,
  "title": "Tom Brady: Bill Belichick will prepare North Carolina players to play at 'next level'",
  "description": "In an appearance on Joel Klatt's podcast, former NFL quarterback Tom Brady discussed what players at UNC can expect from Bill Belichick and more.",
  "content": "North Carolina football made quite the splash with the hiring of Bill Belichick in December 2024, giving the six-time Super Bowl winner his first college football head coaching opportunity, past the age of 70.\n\nNow, with a little less than three weeks before the start of the Tar Heels' season, it remains to be seen what to expect from the Belichick-led Tar Heels this year.\n\nOne person, however, at least has an idea of what UNC football players can expect from the first-year college football coach. Tom Brady, Belichick's quarterback from 2000-19 with the New England Patriots, believes the Tar Heels can expect to be run like an NFL-style program.\n\n\"What they are going to get is obviously the most prepared, the most hardworking coach that I'd ever been around,\" said Brady, appearing on Fox college football analyst Joel Klatt's podcast on Monday, Aug. 11. \"If you go to that school, you will be prepared to play at the next level. He's going to teach you the right fundamentals and the right techniques. He's going to have a high expectation for you and you are going to grow.\"\n\nIt's well documented how Brady, now an NFL broadcaster for Fox and limited partner of the Las Vegas Raiders, developed from a sixth-round pick into one of the greatest NFL players ever under Belichick during their 20 seasons together in New England.\n\nThe seven-time Super Bowl champion (he won one more with the Tampa Bay Buccaneers in 2020) also shared some of his thoughts on what challenges his former coach could experience in the college ranks.\n\n\"I think the challenge for him is he's dealing with a lot of underdeveloped players because he's dealt with guys that are four, five, six years further along than what he's normally had to deal with,\" Brady said. \"So I think there's probably a learning curve for him. ...\"\n\nBrady also mentioned the amount of time Belichick will have with his players between games to go through film and work on their skills, considering they have to balance their workload as student-athletes.\n\n\"What makes Coach Belichick so unbelievable, tactically, (is how) he can break down an opponent. He watches so much film. He's so smart in how he approaches defensive schemes and offensive schemes,\" Brady said. \"How much can these young kids retain (that)?\n\n\"That may be an interesting challenge, as well, because in some ways they’re not professionals. They don’t have as much time as we had as professional athletes to go in there and study film and practice and meet. They don’t have that amount of time at the college level.\"\n\nHere's a look at Brady's appearance on Klatt's podcast:\n\nThe ACC preseason poll picked UNC to finish eighth among the 17 ACC teams under Belichick this season. Moreover, the Tar Heels were neither ranked nor received votes in either of the US LBM Coaches Poll or AP Top 25's preseason rankings.\n\nUNC is set to open the Belichick era on Monday, Sept. 1 at 8 p.m. ET against TCU at Kenan Stadium in Chapel Hill, North Carolina.\n\nThe USA TODAY app gets you to the heart of the news — fast. Download for award-winning coverage, crosswords, audio storytelling, the eNewspaper and more.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/sports/ncaaf/2024/12/12/bill-belichick-unc-football-hiring-coaching-decision/76946892007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/las-vegas-raiders/341",
    "https://www.usatoday.com/story/sports/college/football/2025/08/04/unc-football-preseason-coaches-poll-voting-bill-belichick/85507976007/",
    "https://www.usatoday.com/story/sports/ncaaf/acc/2025/07/25/bill-belichick-girlfriend-jordon-hudson-age-north-carolina-football/85365331007/",
    "https://www.youtube.com/watch?si=0UDj5Yg2AoBj2fr2&t=556&v=fG3kv2Vkbpw&feature=youtu.be",
    "https://sportsdata.usatoday.com/football/nfl/scores",
    "https://www.usatoday.com/story/sports/ncaaf/acc/2024/12/11/oldest-college-football-coaches-bill-belichick-north-carolina/76921615007/?tbref=hp",
    "https://sportsdata.usatoday.com/football/nfl/teams/new-england-patriots/348",
    "https://sportsdata.usatoday.com/football/nfl/teams/tampa-bay-buccaneers/362",
    "https://app.adjust.com/1el9h6z4",
    "https://sportsdata.usatoday.com/football/ncaaf/teams/north-carolina-tar-heels/3412",
    "https://sportsdata.usatoday.com/football/ncaaf/teams/north-carolina-tar-heels/3412/",
    "https://www.usatoday.com/picture-gallery/sports/nfl/2023/12/21/bill-belichick-patriots-coach-images/71911852007/",
    "https://www.usatoday.com/sports/ncaaf/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Bill Belichick",
      "weight": 0.08910311
    },
    {
      "name": "UNC football players",
      "weight": 0.088697486
    },
    {
      "name": "Belichick",
      "weight": 0.0848738
    },
    {
      "name": "Coach Belichick",
      "weight": 0.0845631
    },
    {
      "name": "North Carolina players",
      "weight": 0.07860065
    },
    {
      "name": "North Carolina football",
      "weight": 0.07671281
    },
    {
      "name": "Tar Heels",
      "weight": 0.073601164
    },
    {
      "name": "Tom Brady",
      "weight": 0.07271244
    },
    {
      "name": "Brady",
      "weight": 0.07033085
    },
    {
      "name": "underdeveloped players",
      "weight": 0.06783659
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "Sports Figures"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.99609375
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9951171875
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.94970703125
    },
    {
      "name": "/Sports/Sports Coaching & Training",
      "score": 0.759765625
    }
  ],
  "sentiment": {
    "positive": 0.3055448,
    "negative": 0.32463592,
    "neutral": 0.36981925
  },
  "summary": "North Carolina football has announced the appointment of Bill Belichick as its first college football head coach, set to take place in December 2024. This will be Brady's first time as a college football coach, following his successful run with the New England Patriots. Brady, who was Belichick's quarterback from 2000-19, expressed confidence in his ability to teach players the right fundamentals and techniques and expects them to grow. He also mentioned the challenge of dealing with underdeveloped players in the college ranks, given their limited time as student-athletes to balance their workload. The ACC preseason poll predicted UNC to finish eighth among the 17 ACC teams under Belichick.",
  "shortSummary": "Bill Belichick's tenure as North Carolina football coach will prepare players for the upcoming season like they've experienced underdeveloped players, according to Tom Brady.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d227c499e6214a0db1387a8c75ed9035",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://sportsdata.usatoday.com/football/ncaaf/teams/north-carolina-tar-heels/3412",
      "text": "Davion Gause flashed his potential early in 2024. The UNC sophomore running back is poised for a big 2025 – and here's why.\nMax Johnson or Gio Lopez will likely be UNC's starting quarterback this fall. USA TODAY Sports predicts the winner of that highly-anticipated battle.\nSingle game tickets for the North Carolina Tar Heels 2025 season, with game schedule, TV channel, past results, live stream information and more.\nUNC's 2026 football recruiting class continues to grow. The Tar Heels could be adding a Top-100 recruit soon.\nThe Florida State Seminoles have extended a scholarship offer to Raheem Floyd, a four-star cornerback from Illinois.\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/ncaaf/acc/2024/12/11/oldest-college-football-coaches-bill-belichick-north-carolina/76921615007/?tbref=hp",
      "text": "Oldest college football coaches: Where Bill Belichick ranks with North Carolina hiring\nBill Belichick is coming to college football.\nNorth Carolina announced Wednesday it has finalized a deal with the former New England Patriots coach and general manager to become the Tar Heels' next coach, landing them arguably the biggest hire of the offseason.\nBelichick will replace Mack Brown, who was fired on Nov. 26 after six years into his second tenure with the Tar Heels.\nThe hiring of Belichick is an interesting one on several levels, perhaps most notably because the legendary NFL coach hasn't coached at the collegiate level.\nThe other is his age.\nBrown, who was fired after three-plus decades of being a head coach across Appalachian State, Tulane, Texas and two stints at North Carolina, is 73 years old. But the coach coming in to replace him isn't much younger. Indeed, at 72 years old, Belichick replaces Brown as the oldest active coach in college football.\nBelichick brings an impressive head coach resume to North Carolina, including 333 career wins and six Super Bowl wins. Now he will be tasked with rebuilding the Tar Heels program, which had flashes of success under Brown but hasn't won a bowl game since 2019, hasn't had double-digit wins since 2015 and hasn't won the ACC since 1980 — eight years before Brown's first stint in Chapel Hill.\nHere's what you need to know about Belichick's age and where he now ranks among the oldest active college football coaches in the FBS:\nHow old is Bill Belichick?\nBill Belichick is 72 years old. He was born on April 16, 1952 in Nashville, Tennessee. He is just under eight months younger than Brown.\nOldest college football coaches\nWith North Carolina's hiring of the six-time Super Bowl coach, Belichick now becomes the oldest coach in college football, at 72 years old.\nBehind Belichick is Iowa football coach Kirk Ferentz, who is three years younger than him at 69 years old. Ferentz is currently in his 26th season coaching the Hawkeyes, a position that he has held since 1999.\nHere's an updated full list of the oldest active college football coaches:\nAges listed as of day of reported hiring on Wednesday, Dec. 11\n- Bill Belichick (North Carolina): 72\n- Kirk Ferentz (Iowa): 69\n- K.C. Keeler (Temple): 65 years, 4 months, 16 days\n- Kyle Whittingham (Utah): 65 years, 21 days\n- Willie Fritz (Houston): 64\n- Curt Cignetti (Indiana): 63 years, 6 months, 10 days\n- Brian Kelly (LSU): 63 years, 1 month, 17 days\n- Jim Mora (UConn): 63 years, 23 days\n- Sam Pittman (Arkansas): 63 years, 14 days\n- Jay Norvell (Colorado State): 61 years, 8 months, 14 days"
    },
    {
      "url": "https://www.usatoday.com/story/sports/ncaaf/2024/12/12/bill-belichick-unc-football-hiring-coaching-decision/76946892007/",
      "text": "Why did Bill Belichick continue coaching? New UNC coach explains decision in press conference\nBill Belichick hasn't lost his motivation for coaching or manning the sidelines.\nThe 72-year-old Super Bowl-winning coach made that known Thursday during his introductory news conference as the next head coach of UNC football.\n\"It beats working,\" Belichick said jokingly Thursday.\nBelichick replaced Mack Brown in Chapel Hill, who was fired on Nov. 26 after six years into his second tenure with the Tar Heels. Two of the more intriguing and polarizing components of UNC's decision to hire Belichick are his age and lack of experience coaching at the college level.\n\"My dad told me this, when you love what you do, it's not work. I love what I do. I love coaching. I love the interaction with the players,\" Belichick said.\n\"I love building a team, working with assistants, game planning, the game itself, which there's some good ones or some bad ones, but they're all learning experience. (And) working with young kids who with the energy, enthusiasm that want to be good and want to be successful. It's great every day to wake up and come into that environment.\"\nBelichick, who has hired former NFL executive and friend Michael Lombardi to serve as the Tar Heels' General Manager, will have to hit the ground running rebuilding the program through the transfer portal that has already opened. The Tar Heels haven't had a double-win season since 2015.\nWith his arrival at North Carolina, Belichick has surpassed Iowa's Kirk Ferentz as the oldest active college football coach. Belichick is also a year younger than his predecessor, who use to be the oldest coach in the sport.\n\"I didn't come here to leave,\" Belichick said later in his news conference, followed by applause.\nBelichick signed a 5-year/$50 million contract with the Tar Heels, which he said he \"feels like doing it all the time\" and is \"good to go,\" reassuring that he is committed to the program and its future.\nAssuming Belichick doesn't pull the unprecedented move of coaching UNC in the Fenway Bowl, his first game on the sidelines in Chapel Hill will be against the Big 12's TCU on Saturday, Aug. 30 inside Kenan Memorial Stadium."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/ncaaf/teams/north-carolina-tar-heels/3412/",
      "text": "Davion Gause flashed his potential early in 2024. The UNC sophomore running back is poised for a big 2025 – and here's why.\nMax Johnson or Gio Lopez will likely be UNC's starting quarterback this fall. USA TODAY Sports predicts the winner of that highly-anticipated battle.\nSingle game tickets for the North Carolina Tar Heels 2025 season, with game schedule, TV channel, past results, live stream information and more.\nUNC's 2026 football recruiting class continues to grow. The Tar Heels could be adding a Top-100 recruit soon.\nThe Florida State Seminoles have extended a scholarship offer to Raheem Floyd, a four-star cornerback from Illinois.\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/ncaaf/acc/2025/07/25/bill-belichick-girlfriend-jordon-hudson-age-north-carolina-football/85365331007/",
      "text": "Bill Belichick sounds like North Carolina football coach, not someone under a girlfriend's spell\nWere you waiting for a hoodwinked boyfriend to show up at ACC media days? Nothing to see here. Bill Belichick's still a coach, just with a 'muse' of a girlfriend by his side at North Carolina.\nI kept waiting for a besotted, hoodwinked boyfriend to show up at ACC media days.\nAll I saw was a football coach.\nIf you’re like me, you followed the breathless offseason coverage of NFL legend turned North Carolina coach Bill Belichick, his relationship with 24-year-old girlfriend Jordon Hudson, and her apparent sway over the veteran coach.\nSome even suggested Belichick’s self-described “muse” put him under her spell, like she’s some sort of Svengali who bamboozles her 73-year-old boyfriend.\nIf you’re like me, you see this situation as a molehill, built into a mountain during the slow news portion of the college football calendar.\nWhen Belichick spoke Thursday at his conference’s media days, he looked and sounded like a college football coach. He spoke to how he spent the offseason “reinforcing the roster.\" North Carolina’s transfer haul that 247Sports ranks as the third-best in the ACC supports this. He explained his excitement for coaching college players, because they're more receptive to coaching and have formed fewer bad habits than their older NFL counterparts.\nBelichick is longer in the tooth than most coaches, but he's a shade younger than Nick Saban, and, as he spoke to the evolution of the fullback position, he sounded like a man in possession of his wits. Belichick navigated this presser more coherently than a couple of U.S. presidents I’ve observed, anyway.\nAs for Hudson’s apparent influence over Belichick, I wouldn’t call that a nothing burger. It was strange to see the clout she wielded and roadblocks she erected during that now-infamous interview Belichick gave to CBS, while he attempted to promote his book.\nThis, though, seems more of a single-patty burger than a gut-busting triple patty, so long as Hudson doesn’t start calling plays or dictating recruiting strategies.\nJordon Hudson influences Bill Belichick's brand. So what?\nBelichick has said Hudson’s place in his life is personal and “doesn’t have anything to do with football.” She’s not employed by the university. She manages activities related to Belichick’s personal brand, and she clearly flexes muscle on his public appearances and messaging.\nBelichick is hardly the first coach to acquire an affection for a younger woman, and Hudson, a former cheerleader, is hardly the first WAG to massage her man’s media messaging.\nThe Athletic obtained and reported on emails Hudson sent to North Carolina's communications and marketing staff in which she suggested messaging strategies. In those emails, she came off as overbearing, but strategically sound.\nI’ve been in plenty of postgame news conferences where a spouse listens intently from the back of the room. I've covered a program where the coach's wife sometimes attended practice.\nAt North Carolina, wide receiver Jordan Shipp told an ESPN Radio affiliate that Sally Brown, wife of former coach Mack Brown, had an active and visible presence around the program.\nSaban occasionally credited his wife, Terry, for her suggestions on his messaging and how he comported himself, and he said she influenced his retirement decision. Terry Saban also helps steer her husband’s kids foundation.\nI’m not saying Belichick’s new-to-the-block “muse” will be the next Terry Saban, the ultimate stateswoman of coaches' spouses.\nBut, how can we be sure Hudson won’t help Belichick’s public persona?\nMississippi coach Lane Kiffin used to date a 20-something former cheerleader. He still raves about how she positively influenced his worldview.\nBelichick, with Hudson's help, botched the CBS appearance, but it’s not as if the man was loquacious while coaching the New England Patriots. At Thursday’s ACC event, Belichick came off calculated and confident and even mildly humorous.\nBelichick survived and thrived operating within the unrelenting spotlight of an east-coast NFL media market. Compared to that, navigating college football media should be a cakewalk. Not a single reporter asked Belichick about Hudson or her involvement with how he operates the Tar Heels during his media days news conference. He fielded nothing but softball questions from the gathered press.\nWill Bill Belichick succeed at North Carolina? Talent is the key\nHere are the brass tacks. Belichick will succeed at North Carolina if he maintains booster buy-in (meaning NIL dollars) and uses that to assemble and develop a roster capable of contending in the ACC.\nI don’t care who you’re dating or how often she interrupts your book-tour interview with CBS, college football is a profession of talent assembly. If Belichick attracts more talent than his peers and develops it well, the Tar Heels should fare OK, as long as he’s checked-in mentally. If he fails to do that, he won’t succeed.\nVeteran defensive back Will Hardy described sensing a “new spark” and a “new energy” injected into the program upon Belichick’s hire.\nThat extends to the fan base. UNC announced that all of its home games are sold out.\nBelichick and his staff flipped the roster after inheriting a squad that finished 6-7. UNC’s haul of more than 40 transfers includes capable players from schools like Penn State, Florida, Nebraska and Washington. The Tar Heels also acquired Gio Lopez, a top quarterback from the Group of Five ranks. High school recruiting seems to be going well enough.\nMany players transferred out, too. That happens whenever a coaching change occurs.\nThose who stayed, and the newcomers who arrived, feel like they have “something to prove,” transfer defensive back Thaddeus Dixon said.\nI’d imagine that feeling also applies to a coach who won six Super Bowls guiding the Patriots, before his NFL career fizzled after Tom Brady left his side. He returned to coaching with a muse at his side. So what?\nSMU showed it’s possible to quickly climb the ACC’s ladder. The Mustangs made the College Football Playoff in their first season as an ACC member.\nWith the right coach, UNC could become a playoff contender, too.\nIs Belichick the right coach? It’s too soon to wager more than a guess, but I wouldn’t bet against it just because his girlfriend inspires him. I didn’t see a hypnotized codger at media days, only a veteran coach who sounded intent on building a winning program.\nBlake Toppmeyer is the USA TODAY Network's national college football columnist. Email him at BToppmeyer@gannett.com and follow him on X @btoppmeyer."
    },
    {
      "url": "https://app.adjust.com/1el9h6z4",
      "text": "The USA TODAY news app gets you to the heart of the matter — fast. Whether it's money, sports, entertainment, or breaking news, get succinct, personalized coverage along with award-winning videos, captivating photography, and interactive user features. The point is — get major news coverage all in a compact device that fits right in the palm of your hand.\nAPP FEATURES\n• National and breaking news, including access to 200+ local publications.\n• News to the point: Easily keep up with news, sports, money, entertainment, health, and more with quick reads.\n• A personalized feed: Pick your favorite subjects in My Topics and receive a curated feed on the For You page.\n• eNewspaper: Just like our print edition but accessible on your mobile devices. And access to 200+ local eNewspapers.\n• Puzzles: Play Crossword, QuickCross, and Sudoku (tablet only) to keep your mind sharp.\n• Award-winning podcasts: Listen to your favorite USA TODAY NETWORK podcasts on demand.\n• Stay up-to-date with election news, analysis, and results.\nSubscription Information:\n• The USA TODAY app is free to download and all users can access a sampling of free articles every month.\n• Subscriptions are charged to your account at confirmation of purchase and automatically renew each month or year, unless turned off in your account settings at least 24 hours before the end of the current period. See \"Subscription Support\" in the app's Settings for more details and customer service contact information.\nMore Information:\n• Privacy Policy: https://cm.usatoday.com/privacy/\n• Terms of Service: https://cm.usatoday.com/terms/\n• Questions or comments? Visit http://www.usatoday.com/mobile-apps or email: mobilesupport@gannett.com"
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/scores",
      "text": "Gannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/college/football/2025/08/04/unc-football-preseason-coaches-poll-voting-bill-belichick/85507976007/",
      "text": "Bill Belichick, UNC football receive zero votes in preseason US LBM Coaches Poll\nLast week, North Carolina football learned it was chosen to finish eighth among the 17 ACC teams in the conference's preseason poll.\nA week later, the Tar Heels learned they will enter the Bill Belichick era without a single vote in the preseason US LBM Coaches Poll, which was released on Monday, Aug. 4. It is the first time since the 2019 college football season that North Carolina received zero votes in the preseason Coaches Poll.\nThe Tar Heels began last season unranked under Mack Brown, but did receive six votes.\nWhile it might have been expected following a 6-7 season and coaching change, the Tar Heels not receiving a single vote is significant, given Belichick, an NFL coaching legend, is leading the team. The votes for the Coaches Poll are comprised of other Division I coaches.\nHowever, it is a reminder of the challenge the six-time Super Bowl-winning head coach has in front of him in Chapel Hill, as he embarks on his first season coaching the college ranks.\nComing off a 6-7 season under Brown and interim head coach Freddie Kitchens — now the Tar Heels' offensive coordinator — North Carolina has hit the ground running with rebuilding the roster through the transfer portal. According to 247Sports, North Carolina brought in 40 players from the portal and built the No. 8-ranked transfer class in the country.\nThe Tar Heels also lost several key players from last year's roster to the portal in the same process, including linebacker Amare Campbell, defensive lineman Beau Atkinson and offensive lineman Zach Rice, among others.\nAs noted by the Fayetteville Observer, North Carolina didn’t have a single player listed on the preseason All-ACC team for the first time in six years. The Tar Heels have also not named a starting quarterback heading into the season, as senior Max Johnson, South Alabama transfer Gio Lopez and highly touted four-star recruit Bryce Baker all remain in the mix for it.\n\"We have a lot of new players, a little over 40 from the spring and 70 guys that weren’t on last year’s team,\" Belichick said at a media availability on Sunday, Aug. 3. \"The first portal, we’re just trying to find guys to fill the team. Second portal, we’re looking for good football players. We felt like any position, if the player wanted to come in and compete — and we thought it was a good player — then this is the right spot for him. We’ll give everybody an opportunity to compete. We’re going to have to earn our spots on the field.\"\nThe Tar Heels' Oct. 4 matchup vs. Clemson is the only scheduled conference regular season game vs. a preseason top 25 opponent. North Carolina is also set to face Syracuse and in-state rivals Duke and NC State this year.\nNorth Carolina will kick off the season with a nationally televised primetime game on Monday, Sept. 1 at 8 p.m. ET against TCU at Kenan Stadium."
    }
  ],
  "argos_summary": "Bill Belichick has been hired as the head coach of North Carolina football, marking his first college coaching role at the age of 72. Tom Brady, Belichick's former quarterback, predicts that the Tar Heels will operate like an NFL program under his leadership, emphasizing preparation and high expectations. However, challenges may arise as Belichick adjusts to coaching younger, less developed players and managing their academic commitments. The Tar Heels are set to begin their season on September 1 against TCU, but they enter the season unranked and with significant roster changes.",
  "argos_id": "RS9BXV7LR"
}