{
  "url": "https://www.latimes.com/california/story/2025-08-12/usps-carrier-stolen-cards-fund-luxury-purchases",
  "authorsByline": "By Summer LinStaff Writer  Follow",
  "articleId": "e3dcee415a624bb0b39a09f9d1925785",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/a5f4b62/2147483647/strip/true/crop/5707x2996+0+404/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb2%2F35%2F66789f094348a38bc73eca4baa7d%2Fpostal-robberies-72631.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:14:41.861000+00:00",
  "addDate": "2025-08-12T19:18:16.832421+00:00",
  "refreshDate": "2025-08-12T19:18:16.832423+00:00",
  "score": 1.0,
  "title": "Torrance postal worker stole mail to buy a Rolex, vacation in Aruba and Turks and Caicos, feds say",
  "description": "Despite a visit from law enforcement in December, prosecutors say a former U.S. Postal Service worker continued to make purchases with stolen credit and debit cards and a second search of her home yielded additional stolen items.",
  "content": "U.S. Postal Service trucks outside a post office in Wheeling, Ill. The number of robberies of postal carriers grew again in 2023 and the number of injuries nearly doubled, even as the U.S. Postal Service launched a crackdown addressing postal crime.\n\nA former U.S. Postal Service letter carrier in Torrance has pleaded guilty to stealing credit and debit cards and checks from the mail and flaunting her spending on luxury goods and vacations on Instagram, federal officials announced.\n\nMary Ann Magdamit, 31, of Carson, pleaded guilty Monday to one count of conspiracy to commit bank fraud, according to a U.S. attorney’s office for the Central District of California news release. Magdamit has been in federal custody since July 1 and previously worked as a letter carrier at the Torrance Main Post Office.\n\nBetween 2022 and July 2025, Magdamit allegedly stole mail containing checks, personal identifying information and debit and credit cards before activating the cards online and using them to make purchases, according to her plea agreement and court documents. She also allegedly sold some of the stolen cards to her co-conspirators.\n\nMagdamit allegedly had her co-conspirators cash the stolen checks, usually by using fake identity documents, according to the release. She also posted photos of her vacations and luxury goods, including a Rolex watch and stacks of hundred dollar bills, on Instagram.\n\nIn December 2024, law enforcement searched Magdamit’s apartment and found more than 130 stolen credit and debit cards, 16 U.S. Depatment of Treasury checks and an unserialized Glock-clone handgun, also known as a “ghost gun,” which was loaded with a 27-round extended magazine, according to the release. Prosecutors say she used the stolen goods to buy luxury goods and fund vacations to Turks and Caicos and Aruba.\n\nDespite the visit from law enforcement in December, prosecutors say Magdamit continued to make purchases with victims’ credit cards which led to her arrest last month, according to the release. A second search of her apartment resulted in the discovery of more stolen credit cards.\n\nMagdamit has a sentencing hearing scheduled for Oct. 27 and faces up to 30 years in federal prison if convicted.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/california/story/2025-08-12/adu-housing-shortage",
    "https://www.latimes.com/california/story/2025-08-11/catalin-man-sentenced-to-10-years-for-stealing-government-aid-funds",
    "https://www.latimes.com/topic/for-la-times-subscribers",
    "https://www.latimes.com/california/story/2025-08-11/what-would-a-future-san-andreas-earthquake-in-california-look-like-this-study-offers-clues"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "more stolen credit cards",
      "weight": 0.11321632
    },
    {
      "name": "U.S. Postal Service",
      "weight": 0.092682935
    },
    {
      "name": "Mary Ann Magdamit",
      "weight": 0.07532183
    },
    {
      "name": "Magdamit",
      "weight": 0.07507054
    },
    {
      "name": "U.S. Depatment",
      "weight": 0.07410851
    },
    {
      "name": "postal carriers",
      "weight": 0.07344669
    },
    {
      "name": "luxury goods",
      "weight": 0.07291134
    },
    {
      "name": "Torrance postal worker",
      "weight": 0.0710709
    },
    {
      "name": "U.S.",
      "weight": 0.06991482
    },
    {
      "name": "A former U.S. Postal Service letter carrier",
      "weight": 0.06668127
    }
  ],
  "topics": [
    {
      "name": "USPS"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Other",
      "score": 0.97412109375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.818359375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.3134765625
    }
  ],
  "sentiment": {
    "positive": 0.069976725,
    "negative": 0.65298957,
    "neutral": 0.27703375
  },
  "summary": "Mary Ann Magdamit, a former U.S. Postal Service letter carrier in Torrance, has pleaded guilty to stealing credit and debit cards and checks from the mail. She allegedly used the stolen goods to buy luxury goods and vacations, including a Rolex watch and several trips to Aruba. Despite being arrested in December, she continued to make purchases with victims' credit cards. She faces up to 30 years in federal prison if convicted.",
  "shortSummary": "Former Torrance postal worker Mary Ann Magdamit pleaded guilty to stealing mail and using it to fund luxury vacations and social activities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f55ba307d34748c5a6678424d2054337",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2025-08-11/catalin-man-sentenced-to-10-years-for-stealing-government-aid-funds",
      "text": "Man who overstayed his visa stole food aid from thousands of needy Californians, feds say\n- Share via\nA man believed to have been a part of a Romanian criminal organization was sentenced to 10 years in prison last week after he stole tens of thousands of welfare cards across California and New York.\nCatalin-Marius Graur, 43, was sentenced Aug. 4 after pleading guilty in October to one count of bank fraud. When he was arrested at a New York City Airbnb apartment in June 2024, he had over $37,000 in cash and nearly 1,500 stolen account access numbers in his possession, according to a statement from the Department of Justice.\nIn his scheme, officials said, Graur targeted those receiving Electronic Benefit Transfer funds, which are distributed by social services departments to help low-income communities receive food and cash aid. In California, these are accessed through programs like CalFresh — previously known as food stamps — and CalWORKS.\nAccording to DOJ officials, Graur would steal EBT card information by attaching “sophisticated skimming devices” to ATMs and other sales machines across Los Angeles and the Inland Empire. Once the victim entered their card, the device captured their information. Fraudulent cards can be made with the stolen information and used to withdraw EBT funds.\nGraur was not living in the United States legally, according to officials. A Romanian citizen, he entered the U.S. in 2020 on a tourist visa but overstayed his visit, the release said. He worked with multiple people internationally in the scheme, with one accomplice receiving more than 36,000 stolen EBT card numbers from Graur over the course of three years, the statement said. Another co-conspirator involved in the scheme, Mihai-Adrian Humoiu, was sentenced to over seven years in prison in May, according to the FBI.\nAccording to the Los Angeles division of the FBI, which investigated Graur’s case, there are multiple instances of Romanian citizens coming to the U.S. to commit bank fraud. The agency has investigated that crime route in particular for many years.\nIn 2023, The Times reported on a string of Romanian citizens who had been arrested for skimming EBT funds through ATMs, including Virgil Negru, a member of the Eforie City Council, who was charged with felony forgery and identity theft.\nBecause the process of skimming is complicated and requires lots of different steps, the crimes are often organized and conducted in groups. It’s a crime of opportunity, they said, and scammers travel anywhere they think they could find success — it’s not exclusive to California or Romania.\nUnlike modern debit or credit cards, EBT cards traditionally have not had microchips, making them especially easy to clone. But that changed in California in April, when the state rolled out new cards with microchips, said Gerry Bonilla, the division chief for program compliance in the state’s Social Services Department. Customers with the new cards can use the tap function for transaction at all businesses with the feature available on their sales machines.\nSince issuing the new cards, Bonilla said that the department has received fewer reports of EBT scamming. Nowadays, most of the reports his office receives of EBT card scamming come from stores without microchip readers on their point of sale machines.\nThe Times also reported that wait times for EBT fund reimbursement after reporting a scam could take weeks, as agencies became overwhelmed with requests. In California, this process has quickened in recent years, with the process now being nearly “instantaneous,” Bonilla said. Customers have to file a benefit reimbursement claim within 90 days starting on the day of the theft. The state requires that claim to be processed within 10 days, but Bonilla said it often only takes one or two days, depending on the circumstances of the theft.\nCalFresh has additional requirements for reimbursement. Customers cannot be reimbursed twice in one Federal Fiscal Year and the amount “cannot exceed the equivalent of two months’ worth of their monthly allotment per occurence,” Bonilla said in an email.\nSeparately, another person, also from Romania, pleaded guilty to bank fraud and asylum fraud in San Francisco for the same type of scam with EBT cards, according to another DOJ statement. Marius Marian, 39, illegally accessed over $500,000 in EBT funds through attaching skimming devices to ATMs. Marian is a Romanian citizen who illegally entered the U.S. and then was deported in 2019 after serving eight months in custody for bank fraud. In an application for asylum, submitted to the U.S. Department of Homeland Security around April 2023, he knowingly failed to disclose his previous deportation, the statement said. His sentencing is scheduled for October."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-11/what-would-a-future-san-andreas-earthquake-in-california-look-like-this-study-offers-clues",
      "text": "The next ‘Big One’ on the San Andreas fault might not be the earthquake we expect, researchers say\n- Share via\n- A new report studied a massive earthquake that ruptured in the southeast Asian country of Myanmar on March 28 — on a fault known for being eerily similar to California’s notorious San Andreas fault.\n- While the recent quake could hold vital clues for California’s next “Big One,” the study’s lead author notes that, “Earthquakes never come back exactly the same way.”\nWhat could the next mega-earthquake on California’s notorious San Andreas fault look like?\nWould it be a repeat of 1857, when an earthquake estimated at magnitude 7.7 to 7.9 ruptured the fault from Monterey County all the way through Los Angeles County? Would it be more akin to the great 1906 San Francisco earthquake, which began just offshore of the city and ruptured in two directions, toward Humboldt County and Santa Cruz County?\nDon’t bet on an identical sequel.\nThat’s the implication of a study published Monday in the journal Proceedings of the National Academy of Sciences. The report, coauthored by scientists at Caltech in Pasadena, studied a massive earthquake that ruptured in the southeast Asian country of Myanmar on March 28 — on a fault known for being eerily similar to the San Andreas.\nThe earthquake ended up rupturing a much longer section of the fault than scientists expected, given the seismology of the region.\nThe implications of this study are that “earthquakes never come back exactly the same way,” Solene L. Antoine, a postdoctoral fellow at Caltech and the study’s lead author, said in an interview.\n“It came as a surprise that you could get such a long rupture,” said Jean-Philippe Avouac, a coauthor of the study and a professor of geology and mechanical and civil engineering at Caltech.\nMarch’s Mandalay earthquake devastated Myanmar, killing at least 3,791 people and an additional 63 people in Thailand. High-rise buildings were damaged as far away as Ho Chi Minh City in Vietnam and homes were damaged in the Ruili area of China. Damage was estimated at $1.9 billion, according to the U.S. Geological Survey.\nIt was the most powerful earthquake in Myanmar in at least 79 years.\nThe magnitude 7.7 earthquake ruptured an astonishing 317 miles of the Sagaing fault, a finding based on Antoine’s analysis of satellite data showing earth movement after the quake. That’s the longest seismic rupture ever documented on a continent.\nBy comparison, California’s 1906 earthquake ruptured 296 miles of the San Andreas fault; and the 1857 earthquake, 225 miles. Longer seismic ruptures have been found only on subduction megathrusts deep underneath the ocean.\nWhat’s clear from the study is that while California’s next “Big One” may share some characteristics of previously documented devastating quakes, it’s unlikely to be an exact replay. As the recent experience in Myanmar shows, even well-documented faults can behave in surprising ways.\nThe next step is to develop a model simulating earthquakes over many millennia for the San Andreas fault, which the authors plan to do in the future. But the San Andreas fault “is far more complex,” Avouac said. “It’s not going to come soon, because it’s quite a heavy calculation.”\nStill, such simulations would provide a model of “all possible scenarios so that we have a better view of the range of possible ruptures that could happen.”\nFor instance, maybe the San Andreas fault will rupture in smaller, separate earthquakes, Avouac said.\nOr it could be a much larger earthquake — rupturing the fault not just from Monterey to Los Angeles counties, but perhaps all the way into San Bernardino, Riverside and Imperial counties, which would possibly exceed magnitude 8. Such a quake would be the largest simultaneous disaster in modern California history, with huge swaths of the state wracked by powerful seismic shaking all at once.\nBy comparison, the 1994 Northridge earthquake’s footprint was relatively constrained, severely affecting only a portion of Los Angeles County, especially the San Fernando Valley — related to its relatively smaller magnitude of 6.7.\nBut while modeling previous activity on the San Andreas fault will provide a glimpse into the wide range of possible outcomes, it will not pinpoint precisely when the next great quake will strike.\n“We can’t just expect the exact same thing to happen,” Antoine said. “It is a matter of just showing what scenarios are possible, the diversity of scenarios and seeing what are the consequences of each of those scenarios.”\nSometimes, Avouac said, “it’s quiet for a long time, nothing happens ... stress is building up, the fault is locked for a long time, nothing happens, and then, boom, you have a large earthquake.”\n“And then you have other periods during which you have a lot of [seismic] activity, but these earthquakes are all smaller,” Avouac said.\nBut “smaller” earthquakes, in the minds of researchers, are still big to the layperson. In the study’s simulations, there are periods where earthquakes around magnitude 7.7 are common. In other periods, earthquakes max out at magnitude 7.5 or so, but are more frequent.\nThe entire length of the Sagaing fault — including areas that didn’t rupture in the March earthquake — is 750 miles, north to south, from the Himalayas to the Andaman Sea, and helps accommodate the northward push of the Indian tectonic plate.\nThe fact that 317 miles of the Sagaing fault ruptured in March was surprising to scientists. Only about 170 miles had been quiet seismically for more than a century, having last ruptured in 1839.\nScientists call these “seismic gaps” — particular areas of a fault that haven’t recently ruptured.\nGenerally, scientists would’ve expected only this long-dormant 170-mile piece of the Sagaing fault to rupture, Avouac said, but not more recently ruptured sections. That includes a 100-mile stretch that ruptured in large earthquakes in 1929 and 1930, and a 50-mile stretch that went off in a pair of quakes in 1946 and 1956.\nInstead, even those fault segments ruptured in the big March earthquake.\nSo what gives?\nA possible explanation is the Sagaing fault’s extraordinary smoothness. “And people have observed that when the fault is very smooth, the rupture ... tends to propagate at a velocity” so fast that it results in an “extremely elongated rupture,” Avouac said.\nThe study also published the results of a computer model simulation looking at how earthquakes might rupture along sections of the entire 750-mile long Sagaing fault. The code, developed by study coauthor Kyungjae Im of Caltech, suggests that over a hypothetical 1,400-year period, there would be no repeatable patterns.\nIn other words, earthquakes didn’t seem to re-occur like clockwork, rupturing the same stretch of fault in a repeatable, predictable pattern.\n“There is complexity here. And this is because each time you have an earthquake, it redistributes the stress on the fault, which is going to influence the next earthquake,” Avouac said. “There’s a self-induced complexity in the process, and that leads to a bit of randomness.”\nThere is one certainty, which is bound to disappoint anyone who shares the hope that a “Big One” simply won’t ever strike California again.\n“There will be an earthquake at some point,” Antoine said. “If there is stress building up on the fault, the fault won’t hold forever.”\nFurther research and observations are essential to refine models of future possible earthquakes, including from the Sentinel satellites, which are operated by the European Space Agency, the authors said.\nThe other coauthors of the study are Rajani Shrestha and Chris Milliner of Caltech; Chris Rollins of Earth Sciences New Zealand; Kang Wang of the Washington-based EarthScope Consortium; and Kejie Chen of the Southern University of Science and Technology in Shenzhen, China."
    },
    {
      "url": "https://www.latimes.com/topic/for-la-times-subscribers",
      "text": "Latest\nExperts are divided: is any new development in California’s housing crisis welcome, or are certain types of housing more needed?\nExperts are divided: is any new development in California’s housing crisis welcome, or are certain types of housing more needed?\nAuthorities say illegal card games hosted at mansions in Encino, Sherman Oaks and the Hollywood Hills bring together Israeli organized crime figures, Latino gang members and gamblers who racked up debts as high as $1.5 million.\nBetween the destination-worthy margarita bar, the matcha martinis, the dives with killer cocktails, and the new Big Easy beverages, the only question is where to begin.\nFrom Windansea to Moonlight Beach to Swami’s Beach to North Torrey Pines State Beach to Fletcher Cove, here are the best beaches in San Diego County.\nDespite a growing narrative that California is hostile to businesses, experts say the state still has unmatched advantages.\nMore than a hot spot for buzzy restaurants and boba shops, this neighborhood reflects the legacy of Japanese immigrants.\nMexico once vowed to reform its police. That has been abandoned as the country deploys soldiers to fight cartels.\nCalifornia has new homeowners association rules. For most homeowners, fines are now capped at $100, thanks to a new housing bill.\nThe dispute drew in some of the city’s top lawyers, triggered calls to police, and led the Annenberg children to march into Los Angeles County Superior Court in a frantic effort to dislodge Vikki Levine from overseeing their mother’s medical care.\nManuel Quintero, alleged to be a member of the Mexican Mafia prison syndicate, is charged with killing the owner of El Farallon, a popular Lynwood nightclub.\nAI is supplying powerful new tools at a fraction of the cost, forcing below-the-line artists to wonder if the future of filmmaking has a place for them."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-12/adu-housing-shortage",
      "text": "The dark side of California’s backyard ADU boom: How much do they ease the housing shortage?\n- Share via\n- California has struggled to keep up with housing demand, increasing stock by only 0.84% in 2024, or 125,000 units. ADUs made up about one-fifth of that, according to California Department of Finance data.\n- But ADUs are different from building new apartments and homes. At least some ADU owners do not put their units on the market, using them instead for their own families or leaving them vacant.\nWith California facing a critical housing shortage, accessory dwelling units now account for a significant portion of the state’s meager growth in new homes, data reviewed by The Times show.\nCalifornia has struggled to keep up with demand, increasing housing stock by only 0.84% in 2024, or 125,000 units. ADUs made up about one-fifth of those units, according to California Department of Finance data.\nADU construction has been booming in some parts of California, with homeowners taking advantage of the opportunity to build a second housing unit in their backyard. The units often cost hundreds of thousands of dollars, but many residents see them as worthy investments that increase property value.\nBut ADUs are different from building new apartments and homes. Some ADU owners do not put their units on the market, using them instead for their own families, or leaving them vacant.\nAnd ADUs are more popular in some areas than others.\nEric McGhee, a senior fellow at the Public Policy Institute of California, said it’s hard to know whether new ADUs are being used to house people who wouldn’t otherwise be on the property, or whether they are just providing extra space for those already living there. As a result, it is likely that some ADUs do nothing to ease the housing shortage.\nOne clue comes from the San Diego Assn. of Governments, which calculated that 85% of permitted ADUs in the county were renter-occupied units, with only 15% occupied by owners.\nStill, in many cases, ADUs might be occupied by people spreading out within a property they already occupy, McGhee said, complicating analysis of the impact on the broader housing market.\n“Is it enough to just build anything,” he asked, “or do we need to build a certain kind of housing that fills demand better?”\nADU production was up 14.3% in 2024 over the previous year. In 2023, ADU production had grown by 10%. With statewide housing growth relatively steady year over year, ADUs have gained ground and represent a larger portion of new housing.\nL.A. Mayor Karen Bass is restricting duplex construction in Pacific Palisades after an executive order from Gov. Gavin Newsom to weaken a state housing law.\nA Times analysis of finance department data shows that the city of Los Angeles increased its housing stock by 6% between 2020 and 2025, the third-highest figure of Los Angeles County’s 88 cities. Only Duarte and Monrovia added more housing relative to existing stock.\nSome cities, such as Avalon, Westlake Village and Cerritos — the bottom three in Los Angeles County — hardly grew at all.\nADUs are sprouting up across California, especially in L.A. County. Here’s why some cities are seeing more construction than others.\nFor all of Los Angeles County, housing stock grew by 3.75% over those five years, roughly in line with the statewide figure of 3.87%.\nIn contrast, some of California’s fastest-growing counties far outpaced sluggish Los Angeles. Madera County grew its housing stock by 2.7% in 2024. Placer and San Benito counties approached 2% annual growth.\nAnd in smaller booming cities, one year of growth was comparable to five years in Los Angeles: in Huron (Fresno County), the housing stock grew by nearly 8% in 2024. Lathrop (San Joaquin County), Winters (Yolo County) and American Canyon (Napa County) all saw growth over 5% that year.\nBig cities such as Los Angeles, Oakland and San Diego have been relatively successful in producing new multi-unit complexes, McGhee said, with the vast majority of the new units being one- and two-bedroom rentals.\nWhere major metropolitan areas have been largely developed and mostly see infill, suburban, peripheral cities like Huron see “green edge development that is overwhelmingly single-family detached homes,” he said.\nL.A. County is a hotbed for ADUs. A 2024 Times analysis showed the county permitted more accessory dwelling units per capita than any other county in the state. The data showed lower- and middle-income cities approving the most construction. Among the cities that permitted the most construction: San Fernando, Rosemead, Temple City, Sierra Madre and Hidden Hills. The cities that built the fewest: Hawthorne, Commerce, Cudahy, Cerritos and Westlake Village.\nIn a 2024 research project for UCLA’s Lewis Center for Regional Policy Studies, master’s student Miles Austin Cressy studied the western San Fernando Valley — where more than 7% of single-family residence parcels had been granted ADU permits.\nCressy sought to answer the question that continues to bedevil housing experts: Will ADUs help solve California’s housing crisis?\nHe found that “ADU prevalence correlates with lower-income, renter-occupied, and younger households, denser populations, and areas with higher concentrations of non-white residents and registered Democrats.”\nADU developments were also less common in hillside and fire-prone areas, suggesting that they might be concentrated in more climate-resilient locations, Cressy wrote.\nFinally, the verdict: “ADUs are usually priced at or above market rates and so they have limited viability as a solution to the housing crisis,” the report said. The cheap, abundant housing that Californians crave might not be found in the backyard."
    }
  ],
  "argos_summary": "In 2023, the U.S. Postal Service reported an increase in robberies of postal carriers and a doubling of injuries, despite efforts to combat postal crime. A former letter carrier, Mary Ann Magdamit, pleaded guilty to stealing credit and debit cards from the mail and using them for luxury purchases, facing up to 30 years in prison. Additionally, a Romanian man, Catalin-Marius Graur, was sentenced to 10 years for stealing welfare card information, highlighting ongoing issues with organized crime targeting vulnerable populations.",
  "argos_id": "S4KQCGTQC"
}