{
  "url": "https://www.nasdaq.com/articles/team-reports-85-percent-q2-revenue-rise",
  "authorsByline": "The Motley Fool",
  "articleId": "15d20cc754f44a89b403cb2b47195194",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:40:00+00:00",
  "addDate": "2025-08-13T03:30:17.557738+00:00",
  "refreshDate": "2025-08-13T03:30:17.557740+00:00",
  "score": 1.0,
  "title": "Team Reports 8.5 Percent Q2 Revenue Rise",
  "description": "Key PointsRevenue rose 8.5% to $248.0 million (GAAP) in Q2 2025, driven by 15.2% growth in Inspection and Heat Treating.",
  "content": "Key Points\n• None Revenue rose 8.5% to $248.0 million (GAAP) in Q2 2025, driven by 15.2% growth in Inspection and Heat Treating.\n• None Adjusted EBITDA grew 12.4% to $24.5 million, with margin improving to 9.9% of revenue.\n• None Net loss (GAAP) widened to $(4.3) million; free cash flow (non-GAAP) remained negative but improved versus last year.\n• These 10 stocks could mint the next wave of millionaires ›\n\nTeam (NYSE:TISI), a provider of inspection, mechanical, and heat-treating services to industrial sectors, reported results for Q2 2025 on August 12, 2025. The earnings report highlighted 8.5% year-over-year growth in GAAP revenue and notable gains in operating metrics, particularly in the Inspection and Heat Treating segment. The quarter did not include published analyst estimates for direct comparison. Adjusted EBITDA improved by 12.4%, and cost optimization measures supported operating margin expansion. Despite operational progress, the company’s net loss (GAAP) widened compared to the prior year, and Free cash flow (non-GAAP) remained negative. Overall, the quarter showed Team advancing on its transformation initiatives, with strong performance in key segments but continued challenges from GAAP net losses and increased debt levels.\n\nTeam is an industrial services company delivering a range of inspection, heat-treating, and mechanical services to ensure asset integrity for customers in energy, manufacturing, and other critical industries. Its main offerings include non-destructive testing, which detects flaws in materials or structures, mechanical services such as repairs, and specialized heat-treating processes that alter material properties for durability and performance. The company operates in 13 countries and serves a broad customer base, with no single client accounting for more than 10 % of revenue.\n\nIn recent years, Team has focused on transformation efforts aimed at operational efficiency, margin improvement, and diversification of both services and industries served. A key success factor is its ability to provide integrated solutions, combining inspection, engineering, and repair in a single package. Regulatory compliance and the technical expertise of its workforce are also central to its competitive position, allowing it to navigate complex industry requirements and deliver reliable services to customers across sectors.\n\nInspection and Heat Treating (IHT) was the leading segment in Q2 2025. Segment revenue increased by 15.2%, or $17.2 million, reaching $130.4 million. U.S. IHT revenue rose by 13.4%, reflecting higher demand in turnaround and callout services. Canadian operations posted a 31.4% year-over-year gain in revenue. Operating income in IHT grew by 26.7% to $15.8 million, and Adjusted EBITDA for the Inspection and Heat Treating segment increased by 25% to $19.5 million. These gains reflect stronger activity levels with existing accounts and a shift toward services like laboratory testing and advanced non-destructive evaluation (NDE), which offer higher margins.\n\nThe Mechanical Services (MS) segment showed modest top-line growth in Q2 2025. Revenue increased 1.9% year over year to $117.6 million (GAAP). U.S. operations drove this gain with a 6.6% revenue rise, offset by a $2.3 million drop in international markets (GAAP). Operating income for the Mechanical Services segment fell 4.7% to $10.1 million, as international weakness offset U.S. improvements. Adjusted EBITDA for MS slipped 2.4% compared to last year, reflecting competitive and project delays outside the U.S.\n\nCompany-wide, adjusted selling, general, and administrative expenses (SG&A) were 18.9% of revenue, down from 19.8% in Q2 2024 despite a slight increase in total dollars spent. The company reported making progress on its cost optimization program, with actions taken during the quarter projected to yield $10 million in annualized savings and $6 million in benefits expected during the second half of 2025. This emphasis on discipline contributed to an adjusted EBITDA margin rise to 9.9% (non-GAAP), up 0.4 percentage points from the prior year.\n\nCash flow remains an area requiring attention. Free cash flow (non-GAAP) was negative again, though improved compared to Q2 2024. Net cash used in operating activities (GAAP) narrowed to $(3.3) million from $(6.4) million in Q2 2024, while Capital expenditures were $2.9 million. The company’s liquidity stood at $49.3 million, with $16.6 million in unrestricted cash and $32.7 million of available credit as of June 30, 2025. However, Total debt climbed to $370.2 million as of June 30, 2025, following a refinancing in March 2025, pushing shareholders’ equity (GAAP) was a deficit of $(22.9) million as of June 30, 2025. These figures highlight ongoing pressure from interest expense and working capital needs.\n\nTeam’s core services include conventional, specialized, and proprietary inspection, heat-treating, and mechanical repair. The Inspection and Heat Treating group focuses on non-destructive testing—methods that reveal flaws in pipes, pressure vessels, or infrastructure, without damaging the assets—plus heat-treating processes that strengthen materials. Mechanical Services covers planned and emergency repairs, as well as maintenance for complex industrial assets.\n\nThe company reports no customer concentration risk, with diversified revenue streams across its client base. Advanced NDE and laboratory testing—part of the IHT product set—were highlighted as drivers of higher activity. Management reiterated the company’s continuing focus on compliance, safety, and operational discipline as it seeks to improve efficiency and meet regulatory requirements. No dividend was paid or announced this quarter.\n\nLeadership stated it expects strong activity to continue into Q3 2025, with further revenue and adjusted EBITDA (non-GAAP) growth anticipated in both segments for the second half of 2025. Management reaffirmed its goal of at least 15% year-over-year growth in adjusted EBITDA (non-GAAP) for the full year 2025 and maintains its focus on cost savings, operational execution, and improving profitability, especially in Canadian and international operations.\n\nWhile management’s commentary outlined targets for top-line and margin improvement for Q1 2025, but did not provide specific guidance for revenue or earnings per share. The company is closely monitoring tariffs and supply chain developments, citing these as areas of potential cost pressure.\n\nRevenue and net income presented using U.S. generally accepted accounting principles (GAAP) unless otherwise noted.\n\nWhere to invest $1,000 right now\n\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 1,060%* — a market-crushing outperformance compared to 182% for the S&P 500.\n\nThey just revealed what they believe are the 10 best stocks for investors to buy right now, available when you join Stock Advisor.\n\nJesterAI is a Foolish AI, based on a variety of Large Language Models (LLMs) and proprietary Motley Fool systems. All articles published by JesterAI are reviewed by our editorial team, and The Motley Fool takes ultimate responsibility for the content of this article. JesterAI cannot own stocks and so it has no positions in any stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=a98bfefb-7aba-4e8a-8752-8dc845da2515&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17187&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=454a96ed-2c95-4df0-bb2d-8cfc072031c0",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=250576c8-3964-4625-9a31-3d0f428a6ba0&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D10969%26source%3Disaedikp0000070%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17996",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=a98bfefb-7aba-4e8a-8752-8dc845da2515&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17187%26ftm_veh%3Darticle_pitch_feed_partners&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=454a96ed-2c95-4df0-bb2d-8cfc072031c0"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "GAAP revenue",
      "weight": 0.074694246
    },
    {
      "name": "non-destructive testing",
      "weight": 0.07043097
    },
    {
      "name": "Segment revenue",
      "weight": 0.070019975
    },
    {
      "name": "U.S. IHT revenue",
      "weight": 0.06614836
    },
    {
      "name": "advanced non-destructive evaluation",
      "weight": 0.06428929
    },
    {
      "name": "GAAP net losses",
      "weight": 0.061869014
    },
    {
      "name": "last year",
      "weight": 0.061040774
    },
    {
      "name": "mechanical services",
      "weight": 0.0607431
    },
    {
      "name": "year",
      "weight": 0.059705578
    },
    {
      "name": "recent years",
      "weight": 0.05836979
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96142578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9482421875
    }
  ],
  "sentiment": {
    "positive": 0.86930484,
    "negative": 0.026820812,
    "neutral": 0.10387436
  },
  "summary": "Team (NYSE:TISI), a provider of inspection, mechanical, and heat-treating services to industrial sectors, has reported an 8.5% year-over-year growth in Q2 2025, driven by 15.2% growth in Inspection and Heat Treating. The company's Adjusted EBITDA grew 12.4% to $24.5 million, with margin improving to 9.9% of revenue. However, net loss (GAAP) widened compared to the previous year and free cash flow (non-GAAP), remained negative. Despite this progress, the company faced challenges from GAAP net losses and increased debt levels. Team operates in 13 countries and serves a broad customer base, with no single client accounting for more than 10% of its revenue.",
  "shortSummary": "Team's Q2 revenue rose 8.5% to $248.0 million, driven by 15.2% growth in Inspection and Heat Treating, despite ongoing losses and debt challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b0ec9799ae18444f92a6153a1b61f560",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "In Q2 2025, Team (NYSE:TISI) reported an 8.5% increase in GAAP revenue to $248 million, driven by a 15.2% growth in its Inspection and Heat Treating segment. Adjusted EBITDA rose by 12.4% to $24.5 million, improving the margin to 9.9% of revenue, although the company faced a widened net loss of $(4.3) million. Despite operational improvements and cost optimization efforts, free cash flow remained negative, and total debt increased to $370.2 million, highlighting ongoing financial challenges.",
  "argos_id": "SDN9QG2HC"
}