{
  "url": "https://www.dailymail.co.uk/news/article-14992303/Dozens-migrants-land-Algarve-beach-loved-Brits-immediately-taken-judge-ordered-leave-country-stark-contrast-soft-touch-UK.html",
  "authorsByline": "Andrew Young",
  "articleId": "1f56f89727a94bc3a247c576b9a91509",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/12/09/101134299-0-image-m-19_1754987229087.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T09:36:15+01:00",
  "addDate": "2025-08-12T08:42:09.498139+00:00",
  "refreshDate": "2025-08-12T08:42:09.498141+00:00",
  "score": 1.0,
  "title": "Migrants land on Algarve beach... and ordered to leave the country",
  "description": "The 38 asylum seekers arrived in Portugal after a perilous voyage of up to 250 miles in a tiny 15ft boat - and face being deported from Portugal within weeks",
  "content": "This is the moment a group of migrants land on an Algarve beach where thousands of wealthy Brits holiday every year.\n\nThe 38 asylum seekers arrived in Portugal after a perilous voyage of up to 250 miles in a tiny 15ft boat - and face being deported from Portugal within weeks.\n\nThey were rounded up by Portuguese police on Friday near Burgau on part of the Algarve coast which is a popular retreat for tourists, and only four miles from Praia da Luz where Madeleine McCann disappeared.\n\nOne of the Moroccan nationals claimed that four people on the flimsy wooden boat had died during their five days at sea in the Atlantic Ocean.\n\nBut in an example of Portugal’s no-nonsense policy on illegal immigration, the 25 men, six women and seven children face being quickly returned to Morocco.\n\nTourists and locals alike watched in amazement as the dehydrated and hungry migrants stumbled ashore on idyllic Boca do Rio beach.\n\nThree of the children, aged 12 months, eight and ten, were taken to a paediatric emergency clinic in Faro, and a man was taken to a hospital in Portimão, but all were soon discharged.\n\nThe group whose arrival was the largest on the Algarve coast in recent years were temporarily given makeshift camp beds at a sports hall in Vila do Bispo near Sagres and kept under guard.\n\nThey were given food kits containing biscuits, juice, milk, bread, pâté, fruit and water, along with toothpaste, toothbrushes, sanitary pads and bath products.\n\nBut 31 of them were taken to a court in Silves on Saturday afternoon where a duty judge gave them 20 days to voluntarily return to their country of origin.\n\nThe judge ordered that if they failed to board flights back to Morocco, they faced being forcefully returned within 60 days.\n\nA separate court hearing in Lagos is due to decide the fate of the remaining seven migrants – a mother and father, along with their three children, a 14-year-old boy and a man with kidney problems.\n\nAll the migrants have since been moved to secure detention centres in Lisbon, Faro and Porto.\n\nThe speed with which they have been dealt with contrasts starkly with the treatment of migrants arriving in small boats in the UK who are often housed for months in four star hotels at the expense of British taxpayers and left free to come and go.\n\nNone of the group in the Algarve have tried to claim asylum and any application on the grounds of race, religion, nationality or political opinions is unlikely to succeed due to Portugal regarding Morocco as a safe country.\n\nAntónio Leitão Amaro, the Minister of the Presidency in Portugal’s centre-right minority Government, said: ‘At the moment there is no request for asylum and it is not worth speculating on the subject.’\n\nHe praised Portuguese officials for the speedy way they had dealt with the migrants, while treating them with ‘dignity’ and providing ‘medical assistance’, and taking them to court which had ‘decided quickly and concluded the order of their removal from the national territory’.\n\nOfficials suggested that the group had headed for Portugal for ‘economic’ reasons as they were unhappy with work opportunities in Morocco.\n\nRute Silva, the mayor of Vila do Bispo, told the Observador newspaper: ‘We have a law, and it has to be complied with, because they entered our country illegally. But these people want a better life, they will not risk their own lives and those of their families for anything.’\n\nThe Daily Mail revealed last weekend how another group of nine Moroccan men who jumped off a speedboat which landed them on a beach at Castell de Ferro near Malaga, Spain, were being treated in a similar way.\n\nThe arrival of the group in Spain made headlines after a video clip showed several of the men being rugby-tackled and detained by tourists on the beach, including off duty police officers.\n\nThey are all now being held in a secure purpose-built unit behind ten foot fences in the harbour of the nearby town of Motril before being deported, according to local officials.\n\nWhile a huge number of migrants try and get into Spain by setting off from west Africa to the Canary Islands, a far smaller number head north towards Portugal.\n\nAround 140 migrants in seven boats are reported to have landed on the Algarve coast in southern Portugal over the last six years with the majority setting off around 250 miles away from the city of El Jadida, south of Casablanca.\n\nPolice have not yet been able to establish where the latest boat originated from and the report of four people dying during the voyage remains unconfirmed.\n\nBut it has been stated that the oldest person on board the boat which arrived on Friday was 44-years-old.\n\nPaulo Lourenço who runs a local dolphin watching tourism business said he spotted the migrants’ boat heading for the coast, and followed on his motorbike to film it landing beside the cliffs on Boca do Rio beach.\n\nHe told Observador how some of the migrants seemed relieved and happily yelled ‘Portugal’ when they realised where they were.\n\nMr Lourenço said: ‘I spoke to a family that had a one-year-old child. They said they came from Morocco. They asked me for water and tobacco, and also food. There was a couple on the beach who gave them food.\n\n‘They expressed joy at that moment, some were very grateful, with their arms in the air, for having arrived.’\n\nMr Lourneço said the migrants had mobile phones, groceries, backpacks with some food and ‘little else’ with them, and one of women had told him that four people had died during the trip.\n\nHe added: ‘They arrived at the beach parking lot, sat down and waited for help’.\n\nMajor Ilídio Barreiros, from the Coastal and Border Control Unit of Portugal’s National Republican Guard, said the group had also brought money and had left some groceries, clothes and shoes on their boat.\n\nHe added that there state of health was ‘representative of the hardship of the journey’, saying: ‘They were exposed to adverse weather conditions for a considerable period.’\n\nMajor Barreiros appeared to dismiss the possibility that the group had paid a people smuggling network to carry them from Morocco, due to their boat being so small.\n\nHe said: ‘This phenomenon exists but not in an organisation as informal as this and not in a five-metre vessel.’\n\nMahor Barreiros said the 31 migrants in court on Saturday showed little reaction when they learned through an interpreter that they were being sent home.\n\nHe explained: ‘When the translator spoke, we expected more emotional reactions. That was not the case. They accepted.’",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/news/madeleine-mccann/index.html",
    "https://www.dailymail.co.uk/news/article-12151653/Migrants-barricade-entrance-Comfort-Inn-hotel-London.html",
    "https://www.dailymail.co.uk/news/article-14982599/As-Keir-Starmers-UK-government-loses-grip-small-boats-crisis-heres-one-Spanish-resort-deals-migrants.html",
    "https://www.dailymail.co.uk/news/article-6025321/Costa-del-Crisis-1-500-migrants-poured-Europes-new-Spanish-gateway-just-one-week.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Algarve beach",
      "weight": 0.067972675
    },
    {
      "name": "Migrants",
      "weight": 0.06785577
    },
    {
      "name": "migrants",
      "weight": 0.06785577
    },
    {
      "name": "Portugal",
      "weight": 0.0632051
    },
    {
      "name": "southern Portugal",
      "weight": 0.06297738
    },
    {
      "name": "small boats",
      "weight": 0.062495902
    },
    {
      "name": "recent years",
      "weight": 0.04874636
    },
    {
      "name": "Algarve",
      "weight": 0.047842793
    },
    {
      "name": "Vila do Bispo",
      "weight": 0.04743308
    },
    {
      "name": "Major Ilídio Barreiros",
      "weight": 0.046217833
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.873046875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.7685546875
    },
    {
      "name": "/News/Other",
      "score": 0.5458984375
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.5078125
    }
  ],
  "sentiment": {
    "positive": 0.039844047,
    "negative": 0.77528816,
    "neutral": 0.1848678
  },
  "summary": "A group of 38 Moroccan asylum seekers landed on an Algarve beach, where thousands of wealthy Brits holiday every year, after a perilous journey of up to 250 miles in a 15ft boat. They were rounded up by Portuguese police near Burgau, a popular resort on the coast. The migrants, 25 men, six women, and seven children, were given temporary camp beds at a sports hall in Vila do Bispo near Sagres and kept under guard. However, 31 of them were taken to a court in Silves where a duty judge gave them 20 days to voluntarily return to their country of origin, with the possibility of being forcefully returned within 60 days. All of the migrants have since been moved to secure detention centres in Lisbon, Faro and Porto. The speed with which they have been dealt with contrasts with migrants arriving in the UK who are often housed in four star hotels at expense of British taxpayers.",
  "shortSummary": "Portuguese officials deported 38 Moroccan migrants, most of whom landed on a popular Algarve beach, within weeks, despite a claim of asylum.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5a28dc317b03404e929de88c67813813",
  "places": [
    {
      "osmId": "6985236239",
      "road": "Rua dos Pescadores",
      "town": "Vila do Bispo",
      "county": "Faro",
      "postcode": "8650-196",
      "country": "Portugal",
      "countryCode": "pt",
      "neighbourhood": "Salema",
      "coordinates": {
        "lat": 37.0664324,
        "lon": -8.8105436
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/news/article-14982599/As-Keir-Starmers-UK-government-loses-grip-small-boats-crisis-heres-one-Spanish-resort-deals-migrants.html",
      "text": "- Do YOU have a story? Email tips@dailymail.com\nWhen 13 Moroccan men jumped from a speedboat into the sea and ran onto Sotillo beach in the southern Spanish resort of Castell de Ferro, video footage of them arriving seemed pretty unremarkable.\nWhat happened next, however, was extraordinary.\nFor, as the unwelcome visitors from north Africa tried to make a run for it, they were rugby tackled to the ground by ordinary holidaymakers in swimming trunks – and held until police arrived to arrest them.\nNow the Daily Mail can reveal that the nine men who were detained by irate beach goers were immediately whisked off to a police station before being moved to a notoriously inhospitable secure unit.\nIn stark contrast to how migrants are welcomed to UK shores with four-star hotel stays at taxpayers' expense, the no-nonsense Spanish approach to illegal immigration means the men face being returned to Morocco within a matter of weeks.\nUnlike British arrivals who are free to come and go from their accommodation, the group in Spain are effectively being held behind ten-foot fences surrounded by floodlights and security cameras in the Centre for Migration and Repatriation, known as a CATE, which opened in April this year in the port of the nearby coastal city of Motril.\nThe Daily Mail has also been told that at least some of the bathers who were filmed detaining the men were off duty police officers who were enjoying a quiet Sunday on the beach with their families.\nThe CATE facility replaced an older one which had rows of tents to accommodate seized migrants when many more were crossing the Mediterranean and arriving in southern Spain.\nVideo footage shows 13 Moroccan men jumping from a speedboat into the sea before running onto Sotillo beach\nAs the unwelcome visitors from north Africa tried to make a run for it, they were rugby tackled to the ground by ordinary holidaymakers in swimming trunks\nThey were then held until police arrived to arrest them. The Daily Mail has revealed that the nine men who were detained were whisked off to a police station before being moved to a notoriously inhospitable secure unit\nThe Daily Mail has also been told that at least some of the bathers who were filmed detaining the men were off duty police officers who were enjoying a quiet Sunday on the beach\nPictured: Granada bathers hold back disembarked immigrants on Sotillo beach in Castell de Ferro\nThe no-nonsense Spainish approach to illegal immigration means the men face being returned to Morocco within a matter of weeks\nThe group in Spain are effectively being held behind ten-foot fences surrounded by floodlights and security cameras in the Centre for Migration and Repatriation, known as a CATE\nCATE opened in April this year in the port of the nearby coastal city of Motril\nBut Spain's tougher approach has paid off with the number making the perilous voyage to the Granada area slumping in recent years, meaning that so far only 29 migrants have been housed in the unit since it opened, including the most recent nine.\nThe boat which carried them on Sunday is only the second this year to have reached the 47-mile-long Costa Granadina, known as Costa Tropical, and famed for its glorious beaches.\nJosé Antonio Montilla Martos, the Spanish Government's sub-delegate in Granada, confirmed the nine migrants would remain at the CATE 'while their expulsion order from the national territory is processed.'\nTheir return to Morocco means that they will potentially be left thousands of euros out of pocket after paying the people smugglers who transported them on their doomed trip to Europe.\nThe Spanish authorities are known to regard Morocco as a safe country, meaning any asylum applications made by the men are likely to fail unless they can prove they have suffered political persecution or discrimination on LGBT grounds.\nA port worker at Motril who asked not to be named said: 'They deserve to be locked up until theycan be sent home. They are men who we know nothing about, and they should not be allowed to walk around our streets.\nA port worker at Motril who asked not to be named said: 'They deserve to be locked up until they can be sent home. They are men who we know nothing about, and they should not be allowed to walk around our streets.\n'They are being well fed and looked after in the CATE. It is proper that they remain there until they get home. Hopefully, they will tell others that it is a waste of time and money trying to get into Spain illegally.'\nWhen told of the system in the UK where asylum seekers can walk freely around towns and cities while staying in hotels, the worker said: 'That is crazy. They should be kept in a secure place.'\nThe opinion was echoed by locals in Castell de Ferro who witnessed the high-powered boat bringing the migrants ashore at around 1.30pm last Sunday when the beach was full of mainly Spanish families sheltering under umbrellas from the fierce midday sun.\nThe CATE facility (pictured) replaced an older one which had rows of tents to accommodate seized migrants when many more were crossing the Mediterranean and arriving in southern Spain\nSo far only 29 migrants have been housed in the unit since it opened, including the most recent nine. Pictured: The guarded entrance to the port of Motril, Spain\nPictured: The office of the Red Cross next to the CATE secure migrant detention centre which the charity helps to run in the port of Motril, Spain\nShocked witnesses described a 'surreal' scene as the boat approach at high speed, and stopped just a few metres from the shore before the migrants jumped off and swam to dry land.\nAlberto Garcia, who owns the beachfront Mare Nostrum restaurant, told the Daily Mail: 'It was a normal day, and we were providing service as usual when we suddenly saw the smuggling boat arrive and people jumping into the sea.\n'The police arrived quickly on the beach and there were swimmers who helped to catch the people on the boat. I think it is right that they should be detained. My opinion is that they should be deported once they step on Spanish territory illegally.'\nDescribing the scene as the boat arrived, he added: 'We thought it was a recreational boat, but when we saw them starting to throw objects into the water and people getting out, we realised it wasn't normal.\n'What surprised us most was that the boat was moving very slowly, as if they weren't in a hurry or afraid. 'They went in where there were most people, as if nothing had happened, and stopped close to the shore. Then they jumped off one by one, and the four remaining on board, some of them hooded, calmly turned around and left.' Juan\nManuel Peragon, 20, who is a lifeguard on the beach, said: 'I have seen three migrant boats arrive in the four years I have worked here – but this was the first for a long time.\n'The boat had three big outboard engines so it could go really fast. It stopped around 20m from the shore and around a dozen people jumped off. The boat left again after just ten seconds and was never caught.\n'Unfortunately for the immigrants, they came ashore right beside the police station which is beside the beach.\n'As it was a Sunday, there were a lot of police on a day off who had gone down to the beach at that spot with their families. At least one of the guys who grabbed the men was an off-duty policeman.\n'We ran to help, but police in uniforms quickly arrived and detained everyone. It looks like the immigrants came here to work. They can get jobs on farms growing vegetables because they are prepared to work hard for less money.\n'But they are coming here illegally and there should be a tough system to deal with them and send them back. More needs to be done to tackle the Mafia gangs who operate the boats.'\nHuman resources student Fabiola Escolano, 20, from Granada who was also on the beach said: 'People were running after the men and trying to catch them when they arrived. They did not want them to disappear.\n'Those who were detained were all taken to the Red Cross and are being dealt with in the correct way. There have been boats arriving here before – but they are not so common now. There were three which arrived at the same time early in the morning on December 21, 2023.'\nPictured: Lifeguard Juan Manuel Peragon, 20, who witnessed migrants storming ashore from a boat at Castell de Ferro, Spain\nFabiola Escolano, 20, who was on the beach at Castell de Ferro when migrants came ashore in a boat\nOthers on the beach felt more pity for the migrants including one filmed lying face down in the sand as he was subdued by a man in orange swimming shorts kneeling on his back.\nOne video clip featured a woman shouting: 'Leave the kid alone! How shameless!' The left leaning El Pais newspaper also criticised members of the public who had tried to detain the men, describing their actions as playing into the hands of the far right who had demonised migrants and others living legitimately in Spain.\nOfficial figures reveal that more than 61,000 illegal migrants or asylum seekers entered Spain last year, slightly more than the previous year, with the majority heading by boat on the highly dangerous route from west Africa to the Canary Islands.\nBut the numbers leaving from Morocco for mainland Spain have fallen, in part due to the Moroccan authorities trying to keep would-be migrants away from coastal areas.\nThere has also been greater security around the Spanish enclaves of Ceuta and Melilla, on the northern coast of Morocco which migrants try and enter to get a foothold in Europe.\nA further deterrent has been a clampdown on people smuggling gangs intent on bringing migrants and drugs into Spain.\nEight Spanish and Moroccan citizens in a 'highly organised network' which had allegedly used children to skipper boats to transport migrants from Morocco were arrested in June this year in Algeciras near Cadiz, Ibiza and Ceuta.\nThe gang is suspected of making about 2.8 million euros from charging more than 200 people 14,000 euros each to make the journey, although other sources suggested that the going rate was closer to 2,000 euros.\nA statement by Europol, the EU's law enforcement agency, said: 'The network used minors as skippers in maritime smuggling operations, often recruited and trained by the organisation itself.\n'This fact not only highlights and amplifies the risk of accidents and fatalities, but also exposes vulnerable youngsters to exploitation and coercion. This practice illustrates the ruthlessness and dehumanising nature of criminal networks which priorities profits over human life.'\nThe gang is also suspected of simultaneously trafficking large amounts of cannabis into Spain.\nAs well as arresting the eight people, authorities seized 22kgs of cannabis, 50,000 euros in cash, five vehicles, two boats, weapons, electronic devices and navigation equipment.\nLast year Spanish police also smashed a ring taking Syrian migrants through Lebanon to Algeria where they crossed the Mediterranean in overcrowded boats before being taken to unsanitary safe houses in Spain.\nBut right wing politicians in Spain demanded even tougher action to protect Spain's borders following the beach landing this week.\nCarlos Rojas Garcia, a former mayor of Motril and a People's Party member of Spain's Congress of Deputies since 2016, called for greater surveillance and security measures 'to decisively combat the gangs that traffic in human beings'\nA view of boats and fishing equipment in the harbour in Motril, Spain, where migrants are held in a secure CATE detention centre\nThe part of the beach at Castell de Ferro where migrants stormed ashore after arriving in a boat from Morocco\nHe said: 'The Spanish government cannot continue to look the other way while mafias operate with impunity on our coasts. 'Images like those seen in Castell de Ferro are sad and worrying; they reflect how there are organisations that take advantage of desperate people who risk everything, even at the risk of losing their lives.'\nThe Granada MP called on the Spanish government to 'urgently strengthen border control, provide more human and material resources for the State Security Forces and Corps, and intensify cooperation with the European Union.'\nAn organisation called Caminando Fronteras said it had recorded the suspected deaths of 1,865 migrants in 38 boats, including 112 women and 342 children, trying to reach Spain by sea from Africa in the first five months of this year.\nThe vast majority of those who died were trying to cross the Atlantic to the Canary Islands although 52 allegedly died while trying to cross the Strait of Gibraltar."
    },
    {
      "url": "https://www.dailymail.co.uk/news/madeleine-mccann/index.html",
      "text": "Advertisement\nMadeleine McCann\nMadeleine McCann is a British girl who disappeared from her family's holiday apartment in Praia da Luz, Portugal. Her parents, Kate and Gerry McCann, were dining nearby when she went missing. Despite extensive searches and investigations, Madeleine has never been found. The case remains one of the most widely reported missing person cases in modern history\nTrending Madeleine McCann News\nMadeleine McCann - Latest News and Updates\nPage\nMadeleine McCann suspect Christian Brueckner's hopes of early prison release could be dashed after mystery woman's plea to German cops\n04/07/25 07:44\nChristian Brueckner, the prime suspect in the disappearance of Madeleine McCann, may not be able to leave prison early, following a mystery woman's plea to German authorities. Prosecutors have been desperate to keep him behind bars, fearing he will immediately flee Germany and prevent them from further investigating Madeleine's 207 disappearance....read\nPolice officer 'is the reason' prime Maddie suspect could walk free\n24/06/25 10:30Investigators suspect Christian Brueckner, 48, played a part in young Madeleine vanishing from her family's holiday apartment in Praia da Luz, Portugal, in May 2007.Police officer 'is the reason' prime Madeleine McCann suspect could walk free in a matter of weeks... after cop 'paid sex offender's fine'\n24/06/25 00:45Investigators suspect Christian Brueckner, 48, played a part in young Madeleine vanishing from her family's holiday apartment in Praia da Luz, Portugal, in May 2007.Mystery donor ensures Madeleine McCann suspect Christian Brueckner's freedom from prison\n16/06/25 15:39Christian Brueckner, 48, who is currently serving a seven-year prison sentence in Germany for the 2005 rape of an American woman, is set to be released on September 17.Gun found in new Madeleine McCann search 'has not been ruled out as a game-changer' amid race against time to charge prime suspect Christian Bruekner\n12/06/25 09:22The gun retrieved from a well drained by firefighters last week during fresh Madeleine McCann searches on the Algarve has not been ruled out as a game changer by investigators.Madeleine McCann detectives discovered two buried GUNS during search of Portuguese land last week - with the firearms now being analysed by forensic experts\n11/06/25 07:44Investigators looking for new clues relating to Madeleine McCann's disappearance found two buried guns near the resort where she vanished from, it has been revealed.Madeleine McCann police probe samples of 'clothes and bone fragments found during their new search in Portugal'\n10/06/25 12:39Investigators launched fresh searches last week through a stretch of scrubland near to Praia da Luz littered with rubbish and graffiti-covered buildings linked by a network of dusty tracksMadeleine McCann suspect makes sick taunt in letter about police investigation as German paedophile's prison release date draws closer\n06/06/25 22:39Madeleine McCann suspect Christian Brueckner has disturbingly taunted police in a new sickening letter about the toddler's disappearance as his prison release date looms closer.Shocking new Madeleine McCann claim that 'drunk' German wife of British man ran the child over before couple dumped the body at sea emerges in Portuguese media report\n06/06/25 08:33German prosecutors refused to probe a couple suspected of running over Madeleine McCann in a drink-drive accident, it was sensationally claimed today.Portuguese police brand search for Madeleine McCann a 'waste of time' as sources claim three-day operation in Portugal turned up 'nothing'\n06/06/25 00:44Rainer Grimm, boss of the BKA, Germany's equivalent of the FBI, is in Portugal overseeing the search which ended yesterday.New search for Madeleine McCann ENDS with dozens of police seen packing up equipment at remote Portuguese site\n05/06/25 17:02The latest search for clues relating to the disappearance of Madeleine McCann has drawn to a close after three days.New search for Madeleine McCann enters final hours as police hunting rundown buildings prepare to call off the hunt tonight\n05/06/25 10:48A collection of sinister, ramshackle derelict barns and cottages on scrubland covering more than eight square miles, covered with thick vegetation.Witness who first linked Christian Brueckner to Madeleine McCann is 'convinced' prime suspect knows what happened to her and there is 'hope' for missing girl's parents\n05/06/25 00:04Helge Busching, a former friend of Brueckner, first linked the German to her abduction as long ago as 2008 - just a year after she disappeared.Madeleine McCann detectives begin digging with excavator on second day of new search for missing girl in Portugal after investigating run-down building\n04/06/25 11:50Teams of German and Portuguese cops, as well as firefighters, face the daunting task of hunting for clues 18 years on from the disappearance of the British three-year-old in 2007.Former Portuguese detective says new search for Madeleine McCann is over the top and German police 'have got nothing' on Christian Brueckner as hunt for clues continues\n04/06/25 07:29The ex-detective accused his own former police force of 'connivance' with 'shoddy' German cops in a foul-mouthed blast 24 hours after the start of a fresh operation to find Maddie's bodyMadeleine McCann cops prepare to drain two wells as they search derelict Portuguese farmhouse for signs of her body\n03/06/25 12:56Portuguese and German police launched joint searches of an area in the Algarve, a short distance from the resort of Praia da Luz where the British toddler disappeared.Madeleine McCann suspect suffered broken rib in prison assault by inmate: Jail beating revealed as Christian Brueckner gives first interview... while new police dig for clues begins in Portugal\n03/06/25 07:42Convicted paedophile Christian Brueckner , 48, is the man German investigators believe abducted Madeleine from her family's rented holiday apartment in Portugal in 2007.Madeleine McCann: Police explore abandoned farmhouse as search gets underway near suspect's former home\n03/06/25 06:49Recap MailOnline's coverage as police resume searches for Madeleine McCann in the Portuguese resort Praia da Luz where she vanished from 18 years ago during a family break.Revealed: The tip-off that gives Maddie McCann police their last chance to keep Brueckner behind bars - as German FBI bring in radar to scour trenches and fields looking for the missing Brit girl\n03/06/25 00:42Land near the former home of the main suspect in the disappearance of Madeleine McCann is to be searched by police this week.New Madeleine McCann dig in Portugal: Police to search 21 sites near former address of number one suspect Christian Brueckner\n02/06/25 17:03Portuguese police have this afternoon been seen closing dirt roads and setting up tents near the former address of Christian Brueckner.Madeleine McCann detectives begin fresh search for the missing girl where she was last seen\n02/06/25 12:41A well-placed Portuguese source confirmed this week's operation was scheduled get underway tomorrow but said some preparation work may take place beforehandChilling moment Madeleine McCann suspect Christian Brueckner SMIRKS as he is asked: 'Did you kill Maddie?'\n16/05/25 08:34Christian Brueckner was confronted as he left the court Germany after being convicted of insulting guards at the prison where he is serving a seven-year sentence for rape.Madeleine McCann's family find joy after heartbreak: Gerry and Kate McCann's gifted son is tipped to swim for Team GB at 2028 Olympics\n12/05/25 15:38The university chemical engineering student, who started swimming competitively at age eight, is also predicted to compete for Gerry's native Scotland at the 2026 Commonwealth Games.German cops probing disappearance of Madeleine McCann 'plead for the Met Police to reopen their investigation' before prime suspect walks free from prison\n08/05/25 00:14The materials, unearthed at a disused box factory in Germany , include a vile catalogue of depraved documents, children's clothing, small bikes and kids toys.Disturbing hard drive 'found buried in Madeleine McCann suspect's abandoned lair contains clues that the three-year-old is dead'\n07/05/25 00:33A cache of documents thought to belong to prime suspect Christian Brueckner has been uncovered - with police convinced they suggest Madeleine is dead.Madeleine McCann's parents release heartfelt message to their missing daughter on 18th anniversary of her disappearance ahead of her 22nd birthday this month\n02/05/25 23:05Kate and Gerry McCann updated their official Find Madeliene Facebook page just hours ahead of the milestone of when she went missing during a family holiday in Portugal on May 3 2007.'Polish Madeleine' and female acquaintance plead not guilty to 'turning up at the McCann family home after bombarding them with messages'\n22/04/25 10:49Polish national, 23-year-old Julia Wandel - who claims to be the couple's missing daughter Madeline - Karen Spragg, 60, of Cardiff pleaded not guilty to stalking the McCann familyThe eerie hidden details linking Disney's The Stolen Girl to the tragic Madeleine McCann case\n17/04/25 15:43The Stolen Girl delves into the search for a nine-year-old child, Lucia, who disappears during a visit to her new best friend's house.Madeleine McCann probe budget is CUT: Met Police team tasked with finding missing toddler has £84,000 slashed from investigation - ahead of 18th anniversary of her disappearance\n17/04/25 12:41They have been granted a further £108,000 to carry on the search for her - a drop of £84,000 on the amount awarded last year, MailOnline has learned.Rape survivor bringing case to EU over Portuguese investigation of Christian Bruckner: 'I'm standing up after being silenced and ignored for far too long'\n16/04/25 23:31Hazel Behan wants the European Court of Human Rights to investigate alleged failures in the investigation following the serious sexual assault she said she suffered in Portugal in 2004.'Polish Madeleine' 'turned up at the McCann family home with another female stalker after bombarding couple with calls, voicemails and WhatsApp messages', court hears\n28/03/25 12:45Karen Spragg (pictured), 60, is accused of turning up at Gerry and Kate McCann's home with co-accused Julia Wandel, 23, a Polish woman who has claimed to be their missing daughter Madeline.Woman, 60, charged over alleged stalking of Madeleine McCann's family - after they were 'bombed with calls, voicemails and WhatsApp messages'\n27/03/25 20:20Karen Spragg, of Caerau, Cardiff, has been charged with one count of stalking involving serious alarm or distress between May 3, 2024 and February 21 this year, Leicestershire Police said.Madeleine McCann police 'are rushing to charge prime suspect DAYS before he's set to walk free'\n24/03/25 01:52Christian Brueckner , 48, is the main suspect in the disappearance of three-year-old Madeleine McCann, who vanished from a holiday apartment in Praia da Luz, Portugal, in May 2007.Woman who says she was raped by Madeleine McCann suspect Christian Brueckner in 2004 opens up about 'guilt' that she couldn't 'prevent' abduction three years later\n06/03/25 15:13Speaking on the Irish Mirror's Shattered Lives podcast, the mother-of-three admitted she often blames herself for the horrors faced by the McCanns.American woman claims she's Madeleine McCann...and has DNA 'proof'\n25/02/25 19:00Eugenea Collins, 22, launched a social media campaign claiming she is the famous British child who went missing in 2007 while on vacation with her family in Praia da Luz, Portugal.Heartbroken parents of 'Polish Maddie McCann' are at their wits end over fantasist daughter's lies\n23/02/25 07:30The despairing parents of a Polish woman who claims to be Madeleine McCann are 'at their wits' end' and have fled their home after their fantasist daughter was arrested in England.Polish woman, 23, 'stalked Madeleine McCann's brother and sister by turning up at the family home, leaving voicemails and sending WhatsApp messages'\n21/02/25 08:24Julia Wandel, 23, from Lubin, Poland, has been remanded into custody after appearing at Leicestershire Magistrates' Court this morning.Polish woman claiming to be Madeleine McCann is ARRESTED as she touches down in the UK\n19/02/25 21:04Police swooped on Julia Wandelt at Bristol Airport and held her on suspicion of stalking and harassing Madeleine's parents Kate and Gerry McCann.Why does this woman insist she is Madeleine McCann? Her parents say it is nonsense, she claimed to be three other missing girls and has even apologised to the McCanns... but now the 'Maddie faker' is back\n18/02/25 01:31Julia Wendell became an internet sensation when she posted to Instagram under the account name '@IAmMadeleineMcCann' claiming to be the missing daughter of Kate and Gerry McCann.Woman claiming to be Madeleine McCann releases 'bombshell new DNA test results' - 18 years after the British toddler disappeared in Portugal\n17/02/25 10:57Julia Wandelt, 23, became an internet sensation in February 2023 when she posted to Instagram claiming to be the missing daughter of Kate and Gerry McCann.Madeleine McCann suspect Christian Brueckner 'plans to disappear and change his face' to dodge probes into missing girl - as he eyes up being freed from jail for raping an elderly woman\n25/01/25 00:32Madeleine McCann suspect Christian Brueckner is considering fleeing Europe and changing his face in a bid to avoid being recognised.Madeleine McCann suspect Christian Brueckner could walk free from prison as there is 'no prospect of an indictment in the Maddie case', German prosecutor says\n17/01/25 09:52Madeleine McCann suspect Christian Brueckner is likely to walk free from prison as there is 'no prospect of an indictment in the Maddie Case', a German prosecutor has revealed.Mother of missing X Factor and rugby star Levi Davis calls for police to 'pull out the stops' like they did for Jay Slater and Madeleine McCann two years after he vanished in Barcelona\n29/10/24 09:51Levi Davis, 26, was last seen alive outside a pub in Barcelona two years ago and Spanish police believe he has since drowned, but his mother Julie says she has not given up hope of finding his body.The night I was savagely raped near Praia da Luz - and why I am 100% certain my blue-eyed German attacker is the prime suspect for snatching Maddie\n19/10/24 01:02First there was blind terror, then brutal subjugation and a pain so excruciating it has seared into Hazel Behan's soul.Prosecutors officially lodge appeal against decision to clear Christian Brueckner of sex charges as Madeleine McCann investigators enter race against time\n17/10/24 07:44The prime suspect in the Madeleine McCann, 47, case was cleared last week of three rapes and two indecent exposures on children.Madeleine McCann suspect Christian Brueckner 'is plotting way to get an early release and £200,000 in damages' after being cleared of rape charges\n10/10/24 01:36Brueckner is currently scheduled to be released in September 2025, but the German is planning an appeal against the conviction keeping him behind bars.'There are a lot of people who think the parents were involved in the Maddie case': Christian Brueckner lawyer's cruel jibe at Gerry and Kate McCann as chief suspect is cleared of rape charges\n09/10/24 08:41Philipp Marquardt, a member of the German's defence team claimed the outcome of the trial will be interesting for those who believe the toddler's parents were involved in her disappearance.'Stressed' Maddie suspect Christian Brueckner 'will be delighted' after rape trial acquittal and could soon be allowed to 'to visit a cafe once a week' in managed release, his lawyer reveals\n08/10/24 13:09It comes as the prime suspect in the disappearance of Madeleine McCann was today found not guilty on seperate sex crimes chargesClock is ticking to charge Christian Brueckner over Maddie abduction - but we have evidence nobody knows: German prosecutors insist paedophile killed Brit toddler but admit he could vanish after rape acquittal\n08/10/24 09:55Ruling could have serious consequences for German prosecutors who want to pin Madeleine's disappearance on him but fear he could flee the country upon his release from jailInside Maddie suspect's life of crime: How Christian Brueckner spiralled into paedophilia, rape and drug trafficking after being 'beaten' by his adoptive parents and committing his first crime aged 15\n08/10/24 09:43Born Christian Fischer in Dettlebach near Wurzburg in Bavaria southern Germany , he was adopted by Brigitte and Fritz Brueckner who would discipline him and his two brothers with beatings.How Madeleine McCann suspect Christian Brueckner has protested his innocence in series of sinister letters and drawings sent from jail as he is cleared in sex crimes trial\n08/10/24 08:55The neat letters give an insight into Brueckner's mind and clearly show his obsession with trying to persuade the authorities and public that he is innocent of involvement in Madeleine's abduction.Madeleine McCann suspect Christian Brueckner to be released from jail\n08/10/24 08:29The prime suspect in the disappearance of Madeleine McCann was today found not guilty on separate [sexual intercourse] crimes charges.Madeleine McCann suspect Christian Brueckner is found NOT GUILTY in sex crimes trial - prompting race against time to charge German paedophile over toddler's disappearance\n08/10/24 08:06The court found Brueckner, 47, not guilty. The ruling could have devastating consequences for German prosecutors who want to pin Madeleine's disappearance on himA 'dangerous psychopathic sadist' in 'the absolute top league of dangerousness': The shocking assessment of Madeleine McCann suspect Christian Brueckner by his horrified psychologist\n08/10/24 07:37Prosecutors last week called for Brueckner to be sentenced to 15 years for the alleged crimes and said that if released from jail, there was a 'high degree of certainty' he would reoffend.Madeleine McCann suspect Christian Brueckner set to learn his fate TODAY with German court due to deliver verdict on sex crime charges\n08/10/24 07:26The case has been closely watched because, if he is acquitted, 47-year-old Brueckner - the prime suspect in Madeleine McCann's disappearance -could be set free as early as next year.Christian Brueckner speaks for the first time during rape trial as lawyer says he is only facing charges because he is a Madeleine McCann suspect - and judge prepares to give bombshell verdict\n07/10/24 12:50In his closing argument at the courthouse in Braunschweig, Brueckner's main lawyer Friedrich Fuelscher hinted that Brueckner was only on trial because of his link with Madeleine's caseMadeleine McCann's parents brace for Christian Brueckner verdict as German court prepares to announce ruling on suspect's sex crimes trial\n07/10/24 09:03Convicted rapist and paedophile Christian Brueckner was sensationally named as the prime suspect in the 2007 disappearance of Madeleine in June 2020 by German policePsychiatrist issues chilling warning about 'dangerous' Madeleine McCann suspect Christian Brueckner in bombshell court hearing\n27/09/24 16:08As he nears the end of his seven-year sentence, the only way German authorities could keep Brueckner in prison would be if Dr Christian Riedemann, deems him too 'dangerous' for society.Madeleine McCann suspect Christian Brueckner is 'in the absolute top league of dangerousness', says expert who will decide if he stays behind bars as he delivers bombshell verdict\n27/09/24 10:59Convicted pedophile and rapist Christian Brueckner is the man who German investigators believe abducted Madeleine, then aged three, from her parents' holiday apartment in Portugal in 2007.German detective issues Madeleine McCann update after bombshell claims that suspect Christian Brueckner 'had confessed to abducting girl from Algarve flat'\n26/09/24 14:54Convicted paedophile and rapist Christian Brueckner is the man who German investigators believe abducted and killed Madeleine, then aged just three, in Portugal in 2007.The chilling question Madeleine McCann suspect 'asked cellmate after confessing to abducting girl from Algarve apartment'\n26/09/24 14:20Convicted paedophile Christian Brueckner, 47, is said to have confessed to fellow inmate Laurentiu Codin that he took a child from an apartment while living in Portugal.Inside the warped life of Madeleine McCann suspect Christian Brueckner: Full timeline of German paedophile's crimes and links to missing Brit toddler\n26/09/24 13:58Born Christian Fischer in Bavaria in 1976, h e descended into a life of crime as a young teenager, and was convicted of his first burglary in his home town of Wurzburg in 1992, when he was just 15.Madeleine McCann suspect Christian Brueckner 'confessed to abducting girl from Algarve apartment' former cellmate claims\n25/09/24 13:59Madeleine McCann suspect Christian Brueckner confessed to a fellow inmate that he took a child from a Portuguese apartment, a court in Germany has heard today.Abby and Matt Howard break silence after being slammed for their 'morally unacceptable' parenting act on a cruise ship\n17/09/24 06:40Abby and Matt Howard have broken their silence after facing backlash from social media users after they took their two sons Griffin, 2, and August, 1, on a seven-night cruise.Madeleine McCann suspect Christian Brueckner 'bragged about how excited it made him to tie up, beat and rape an elderly woman'\n06/09/24 09:55Brueckner, 47 - who German investigators believe abducted Madeleine, then 3, in Portugal in 2007 - is currently being tried in Germany for a range of unrelated sex crimes.German prosecutor calls for 'biased' judges to be thrown off trial of Madeleine McCann suspect Christian Brueckner after they dramatically overturned order keeping him behind bars\n05/07/24 15:19Furious German prosecutors have called for the judges in the trial of Christian Brueckner to be dismissed after 'concerns about bias'.Christian Brueckner 'could be RELEASED from prison by Christmas' after order keeping him behind bars is dramatically overturned - in huge blow for Madeleine McCann investigators\n03/07/24 15:41An order keeping prime Madeleine McCann suspect Christian Brueckner behind bars has been dramatically overturned - dealing investigators a crucial blow.Madeleine McCann suspect Christian Brueckner 'could walk free from prison by Christmas' after his legal team launch bid to overturn arrest warrant keeping him in jail\n24/06/24 17:24The prime suspect in the Madeleine McCann trial could walk free from jail before Christmas after a dramatic new move from his legal team.German investigators illegally obtained hard drive while building case against Madeleine McCann suspect Christian Brueckner, his lawyers claim as they bid to have the evidence thrown out of court\n06/06/24 15:30German police were handed Brueckner's hard-drive by an unnamed female witness in Portugal containing sickening cartoons allegedly penned by Brueckner.German police discover Christian Brueckner emails linking him to Madeleine McCann - the first ever time investigators have found evidence connecting him to her case\n05/06/24 14:34The shock revelation is the first time an official working on the case has claimed to have evidence connecting Brueckner to the 2007 disappearance of Madeleine McCannWoman, 27, who was 'assaulted by Madeleine McCann suspect Christian Brueckner on Algarve beach when she was aged ten' tells court how he 'grinned at her while performing sex act'\n29/05/24 09:48A woman who was sexually assaulted by Christian Brueckner has revealed he grinned at her while performing a horrific sex act on her at an Algarve beach when she was just ten years old.Christian Brueckner whinges that the bread in his prison-food sandwiches is too thin and he has to have cold showers in courtroom moan as he faces rape charges\n17/05/24 14:42Brueckner is currently serving time in the isolation wing at Oldenburg high-security prison, 130 miles from Braunschweig, but is currently in SehndeWoman 'raped by Christian Brueckner' tells court she still suffers physical effects of brutal sex attack 20 YEARS later as she is forced to deny making love to her boyfriend immediately after the assault during merciless cross examination\n16/05/24 12:02A former tour guide has told a court how she still physically suffers from a brutal sex attack allegedly perpetrated by Christian Brueckner 20 years ago.Irish woman 'raped by Christian Brueckner' relives terrifying ordeal and tells his trial 'she lied she was pregnant to try and make him stop but smelt his condoms and knew it was going to happen'\n15/05/24 10:41A former tour guide has told a court how she was raped at knife point by the man suspected of snatching Madeleine McCann.Just four police officers are now probing the disappearance of Madeleine McCann, Met reveals\n12/05/24 20:27Just three UK police officers and a civilian member of staff continues to work on the case part-time, the force has revealed today.Madeleine McCann's parents share heartbreaking message as they mark their daughter's 21st birthday - saying, 'still missing, still missed, still looking'\n12/05/24 07:44The heartfelt post included a photo of Maddie in a pink dress and bucket hat - believed to be one of the last taken of her before she disappeared on May 3, 2007.Madeleine McCann's parents skipped their daughter's 17th anniversary vigil to escape on a secret 'much needed break' amid prime suspect Christian Brueckner's sex offences trial in Germany, friend reveals\n06/05/24 16:59Kate and Gerry chose not to attend Friday night's church prayers but instead escaped on a secret 'much needed break' to stop being photographed by supporters and invited media.Inside the world of the Madeleine McCann faker Julia Wendell: Polish woman who claimed to be lost girl went to 17th anniversary vigil despite tests proving she is NOT Maddie after she previously said she was also two other missing girls\n04/05/24 08:23Julia Wendell, 22, became infamous last year after she claimed on social media she was the missing girl, who disappeared from Praia da Luz in Portugal on May 3 2007.Madeleine McCann's parents Kate and Gerry fail to attend prayer vigil on 17th anniversary of her disappearance - as young Polish woman who insists SHE is Maddie attends and demands a DNA test to prove she's 'not a liar'\n03/05/24 21:50Kate and Gerry were said by a family member to be away at a secret location on a 'much needed' long weekend break. A message from them was read out, however.'It's 17 years since Madeleine was taken from us - the absence still aches': Madeleine McCann's parents share poignant message on 17th anniversary of her disappearance\n03/05/24 00:14The Home Office also committed an extra £192,000 towards Scotland Yard's investigation into the disappearance of Madeleine, now 20\nPage\nDON'T MISS\n-\nNicola Peltz and Brooklyn Beckham share pictures from their butterfly themed vow renewal afterparty where HER parents took centre stage again\n-\nPhillip Schofield, 63, appears worse-for-wear as he supports bleary-eyed male companion, 30, and gets cosy in the street following London lunch\n-\nEXCLUSIVE\nCat Deeley is snapped for the first time since her shock split from husband Patrick Kielty... with a male friend in Spain\n-\nEXCLUSIVE\nOlivia Rodrigo ENGAGED? Singer flashes huge new diamond ring on THAT finger... after romantic home tour with Brit actor boyfriend\n- Lila Moss shows off her figure in leopard print bikini during Formentera holiday with mum Kate - and sports a plaster after wearing diabetes monitor\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow up, and his dog Harry's VERY unusual traits\nAd Feature\n-\nHeartbroken David and Victoria Beckham fear Brooklyn has 'quit the family' after failing to invite ANY of his relatives to vow renewal with Nicola Peltz\n-\nInsiders tell KATIE HIND what 'furious' ITV production staff REALLY think of the 'rubbish' household names who are escaping jobs bloodbath\n-\n90s rocker looks unrecognisable with a full head of grey hair - can you guess who it is?\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nCristiano Ronaldo forked out eye-watering seven-figure sum on model Georgina Rodriguez's incredible diamond engagement ring\n-\nStrictly Come Dancing 2025: EastEnders star Balvinder Sopal revealed as the FIFTH contestant to join the line-up\n-\nThe Princess Diaries fans all say the same thing about rising star's relationship with big brother Junior after binge-watching every episode\n-\nMax Verstappen and his stylish girlfriend Kelly Piquet step out in the Sardinian sunshine with their kids on family trip - after buying plot of land in Portugal\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nPrincess Andre says she goes to her stepmum Emily for romantic advice after revealing the toll mum Katie's Price chaotic love life took on her\n-\nGemma Owen shares sexy bikini snap and flashes her chiselled abs in skimpy gym gear on idyllic getaway with boyfriend Red Morgan\n-\nMove over, Princess! Katie Price to front her OWN documentary about rise to fame as glamour model 30 years on from her first topless shoot\n-\nYou will never believe what Kimberley Davies looks like now! Neighbours star shocks as she return to the show after 20 years\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nMeghan Markle pays subtle tribute to Prince Harry in As Ever promo showing two 'profoundly connected' palm trees - after their Netflix deal was 'downgraded'\n-\nJack Osbourne is seen for the first time since father Ozzy's funeral as downcast star runs errands during solo outing\n-\nEXCLUSIVE\nRita Ora's husband Taika Waititi wears tone-deaf T-shirt on star-studded Ibiza trip for Chris Hemsworth's birthday\n-\nVictoria Beckham playfully mocks son Romeo's hunky shirtless snap as she stays silent on eldest boy Brooklyn snubbing the family amid secret vow renewal\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nTaylor Swift fans spot VERY telling Easter egg after new album announcement as they eagerly anticipate 'next pop bible'\n-\nTopless Nicola Peltz, 30, poses with her ageless mother Claudia, 70, as she shares a glimpse into the morning before she renewed her vows\n-\nZoe Ball is 'closer to ex Norman Cook than when they were married' - according to her dad Johnny Ball - after he's been a rock to her following difficult times\n-\nChris Hemsworth rings in his 42nd birthday with star-studded Ibiza bash attended by the likes of Rita Ora and Matt Damon - but wife Elsa Pataky remains at home\n-\nTaylor Swift's new era revealed: Pop megastar shocks fans by announcing 12th studio album The Life Of A Showgirl\n-\nEDEN CONFIDENTIAL: Erin finds the jewel in her Crown - a new leading lady\n-\nStacey Solomon wows in plunging black bikini as mother-of-five enjoys luxury family holiday and admits she felt 'beautiful' in stunning snaps\n-\nFans express concern as Kanye West's wife Bianca Censori poses in barely-there bodysuit in a bubble\n-\nMoment Christine McGuinness shares doubts over joining Celebs Go Dating as she panics 'this isn't normal' before quitting the show\n-\nJoshua Jackson sparks romance rumours with Bridgerton star two years after dramatic divorce from Jodie Turner-Smith\n-\nAngelina Jolie is the latest Hollywood star planning to sell up and LEAVE LA... as she plots sale of 'historic' home\n-\nS Club 7's Jon Lee, 43, reveals he hasn't had sex in SIX years on Celebs Go Dating after 'traumatic' dating past\n-\nKristin Cavallari sizzles in tiny bikini as she shows off new boob job in sultry snaps from picturesque Cabo vacation\n-\nOasis' future after their string of reunion gigs end 'revealed' as Gallagher brothers are flooded with performance opportunities\n-\nQueen Camilla's tense encounter with Princess Diana that silenced a room during a birthday bash\n-\nPrincess Beatrice just stepped out in a gorgeous ME+EM floral dress - and we've found it on sale with 50% off\n-\nMoment Meghan Markle was interrupted publicly during panel event: How actress Brooke Shields stopped Duchess's gender activism story\n-\nSharon Stone makes rare red carpet appearance with three adoptive sons who are seldom seen\n-\nHailey Bieber is all legs in minidress at Kylie Jenner's birthday bash as she reveals famous friend ignored her FaceTime call\n- Shoppers say this beauty buy for 'hair loss' actually works - and it's now 20% off at LookFantastic: 'I see less shedding already' SHOPPING\n-\nHow Jason and Travis Kelce reacted to Taylor Swift's bombshell album reveal live on their New Heights podcast\n-\nNicola Peltz wears her mother's dress in secret vow renewal officiated by her father Nelson... while David and Victoria are thousands of miles away\n-\nKylie Jenner shows Timothée Chalamet what he's missing as she posts sexy snaps after birthday snub amid split rumors\n-\nCelebrity SAS star Lucy Spraggan breaks down in floods of tears after revealing horrifying rape ordeal during her time on the X Factor\n-\nWhy pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch!\n-\nWill Smith's I, Robot co-star points the finger as he claims he was penalized for testing better than A-lister with audiences\n-\nEXCLUSIVE\nMyleene Klass' revenge wardrobe: Expert reveals how star is sending secret fashion signals amid Rochelle Humes 'feud'\n-\nJennifer Garner treats her teen Fin, 16, to a sweets shopping spree in LA\n-\nKelly Clarkson's late ex-husband Brandon Blackstock is remembered in moving tribute by son after shock death from cancer\n- Why this on-sale body balm with over 10,000 reviews is a must-have for dry skin: 'The BEST I've ever used' SHOPPING\n-\nCristiano Ronaldo and Georgina Rodríguez are engaged! Footballer's fiancee reveals GIANT diamond ring\n-\nStrictly Come Dancing 2025: Love Island winner, Doctor Who star and footballing legend confirmed to take part in the competition\n-\nEd Westwick and his wife Amy Jackson pack on the PDA in swimwear-clad snap as they share a look at their family holiday to Italy\n-\nStar of Netflix hit show The Hunting Wives reveals White House figure who inspired her notorious character\n-\nLiam Hemsworth and Gabriella Brooks spark engagement rumours after actress flaunts diamond ring in Ibiza\n-\nMaya Jama shows off her incredible bikini body as she parties with AJ Odudu on 24 hour trip to Ibiza\n-\nJennifer Lopez shows off famous derriere in sultry snaps after Ben Affleck romance\n-\nBrad Pitt burglary suspects arrested after cops link separate heist to A-lister's home break-in\n-\nCelebrity SAS Who Dares Wins axes ex army corporal for 'lying and cheating' on the show - resulting in an explosive row\n-\nPrincess Andre tipped to become the UK's answer to Kylie Jenner with her budding career as a makeup mogul\n-\nMaura Higgins shows off dramatic living room makeover after moving into her 'dream' £1.25m Essex mansion\n-\nTaylor Swift fans go wild after Empire State Building 'stunt' hints at new music from singer\n-\nEXCLUSIVE\nMatt Damon almost goes overboard on boozy Ibiza trip with star-studded group for Chris Hemsworth's birthday\n-\nKelly Clarkson's ex-husband Brandon Blackstock's cause of death confirmed after passing aged 48\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nPeter Andre's manager Claire Powell's glow-up 16 years on as she gives advice to his daughter Princess on her show amid Katie Price's comments\n-\nThe Bear's Jeremy Allen White displays his chiseled physique as he cools off on the beach\n-\nJennifer Aniston and Gwyneth Paltrow still gossip about their mutual ex Brad Pitt\n-\nLIZ JONES: Like Katie Price I transformed myself with surgery, went bankrupt and dated terrible men. But there's one key difference between us\n-\nGethin Jones announces the death of his father as the TV star pays an emotional tribute and is flooded with supportive messages\n-\nCHRISTOPHER STEVENS reviews Celebs Go Dating on E4: Television hits the most wretched abyss with this atrocity of a series\n-\n'There's a part of me that thinks this is better': Jennifer Aniston is glad Matthew Perry is 'no longer in pain' and says she mourned Friends co-star for a 'long time'\n- EXCLUSIVE She was a silver screen siren of the 70s and ex-wife of a Hollywood icon, but is unrecognisable as she walks her dogs...can you guess who?\n-\nNetflix back away from Harry and Meghan with new deal, on worse terms: Sussexes sign 'first-look' agreement after shows flopped\n-\nKelly Clarkson breaks down in tears on stage singing poignant song just days before ex-husband's death was announced\n-\nEXCLUSIVE\nMeghan Markle and Prince Harry's new Netflix deal 'IS a downgrade' and more like a 'we'll call you' than 'here's the chequebook', experts say\n-\nTerry and Heather Dubrow take a major financial hit as they finally offload their Beverly Hills mansion\n-\nEmma Stone reveals heart-wrenching reason she cried before shaving her head for new role\n-\nGwyneth Paltrow, 52, shows off her VERY fit physique after sharing exercise secrets\n-\nWoke Bravo star claims 'fat' Trump voters should be banned from Mexican restaurants in explosive rant\n-\nNew Rambo star is FINALLY revealed... and it's not the successor Sylvester Stallone wanted\n-\nMyleene Klass is accused of brutally 'ghosting' a close friend for contacting her ex-husband Graham Quinn - days after he ended their six-month marriage\n-\nKylie Jenner skips over-the-top Kardashian birthday bash for intimate party with homemade cake and kids\n-\nEXCLUSIVE\nRobin Thicke swarmed by female fans as he serenades crowd at Hamptons event following honeymoon with April Love Geary\n-\nMusic icon stops concert to shame parent for 'irresponsible' act in front of crowd of 26,000 fans\n-\nEXCLUSIVE\nMy dad and I were jailed for running an illegal steroid lab together and brawled in the courtroom - I can't believe how he betrayed me\n-\nEXCLUSIVE\nThe Chase star Mark Labbett's ex Hayley Palmer gives her verdict his Celebs Go Dating debut following their 'traumatic' relationship\n-\nKatie Price, 47, seen for the first time since tweaking SIXTH face lift - as she recovers in Turkey after Princess, 18, revealed she would never turn to surgery like her mum\n-\nJaw-dropping moment TOPLESS Katie Price derails Princess Andre's reality show - as teen screams 'no mum I'm filming!' and admits 'she's so unpredictable'\n-\nNelly Furtado's life as body positivity pin-up: How embracing her 'new silhouette', and becoming a mum again in her 40s has earned star, 46, 'icon' status\n-\nLiam Payne's ex Sophia Smith marries James Bridgwood as she stuns in a chic highneck gown during lavish London ceremony\n-\nRebecca Loos shoots down Richard Madeley on Good Morning Britain as they clash over David Beckham - swiping 'we don't need to talk about this'\n-\nA Place In The Sun's Laura Hamilton, 43, defiantly shows off her figure in blue swimwear after hitting back at trolls insisting she is 'too old to wear a bikini'\n-\nMeghan Markle has awkward Kardashians moment as she gifts As Ever merch to stars... who fail to acknowledge her\n-\nJennifer Aniston breaks silence on terrifying gate-crashing stalker: 'People are out of their minds'\n-\nFatboy Slim's Hove beachfront cafe slammed for his 'crazy' prices and 'shocking' waiting times\n-\nLorraine star reveals GP son was held at knifepoint in 'terrifying' ordeal at work - pleading 'it needs to stop' and begging for 'more protection'\n-\nBritish actor looks unrecognisable as he watches Oasis at Wembley with musician Tom Grennan - but can you guess who it is?\n-\nMolly-Mae Hague's sister Zoe totes £7K Chanel handbag as she heads to the gym weeks after being mocked for leaving Bali after 48 hours\n-\nPrincess Andre thought she'd be KILLED during 2018 carjacking - as she watched in horror while mum Katie Price was 'touched up' and made heart-wrenching plea\n-\nHulk Hogan's ex-wife Linda pays tribute to late wrestling icon on his birthday: 'Love and miss you so much'\n-\nMark Wright gives rare insight into family holiday with 5 month-old daughter Palma as he reveals 'disappointment'\n-\nShakira unleashes her inner She Wolf! Love Island's Khan sends fans wild as she shares VERY steamy bedroom snap with Harry Cooksley\n-\nKate Garraway's gorgeous floral midi dress is a must have for summer - and we've found it on sale with 50% off\n-\nGregg Wallace addresses claims he 'took his trousers down' on set of MasterChef - after being sacked in wake of inquiry into alleged misconduct\n-\nSam Thompson is forced to break news of his split from Zara McDermott to Jamie Lee Curtis after Hollywood star tipped the pair for marriage\n-\nLove Island stars send fans wild as they fuel romance rumours with telling Instagram snap in the same place: 'Definitely not a coincidence!'\n-\nLove Island's Arabella Chi shows off her figure in a crochet bikini in Palma just three months after welcoming baby daughter\n-\nBikini-clad Stacey Solomon addresses husband Joe Swash's whereabouts as they enjoy a family holiday at a swanky £1k-per-night hotel in Turkey\n-\nBombshell announcement Taylor Swift fans think singer will make in rumored appearance on Travis Kelce and brother Jason's podcast\n-\nOlivia Attwood reveals the bloody and bruised results of her latest beauty procedure after having fish DNA injected into her face\n-\nOne Direction fan caught up in Zayn Malik 'cheating' scandal finally breaks her silence - 13 years after leaked footage of their 'booty call' went viral\n-\nAdrian Thrills reviews The Black Keys' new album No Rain, No Flowers and finds the Ohio duo moving away from their fling with funk\n-\nTaylor Swift fans are CONVINCED she will announce next album on Travis Kelce's podcast after teasing 'new era'\n-\nI was branded 'the ugliest in the family' from nine years old - sick trolls mocked me for having a flat chest, admits Princess Andre in ITV documentary\n-\n'It felt like I was up there for everyone's entertainment': Tulisa claims a police officer mimed oral sex gestures at her when she was on trial for drug sting\n-\nEXCLUSIVE\nBlonde bombshell best known for playing a Bond Girl is seen on a rare outing... can you guess who?\n-\nLisa Rinna's daughter Amelia Gray DENIES promoting anorexia after sparking concern over 'skeletal' frame\n-\nLove Island's Dejon Noel-Williams breaks his silence over 'exposé' book - as he admits to 'questioning why people would do these things'\n-\nLottie Moss sets pulses racing in a skimpy leopard print bikini as she poses for sizzling snaps amid sun-soaked Spanish getaway\n-\nBBC axes beloved celebrity talk show after eight series - as broadcaster pays tribute to 'hardworking' host and admits cancellation was 'a difficult decision'\n-\nCynthia Nixon braves a dip in the Irish sea as she gives an insight into her travels with wife Christine Marinoni\n-\nMel B gushes her second wedding to husband Rory McPhee 'exceeded her expectations' after tying the knot in three-day ceremony in Morocco\n-\nMachine Gun Kelly offers dramatic three-word response to THOSE Sydney Sweeney dating rumors\n-\nTaylor Swift fans in meltdown as Travis Kelce and brother Jason tease singer will appear on their podcast\n-\nDenmark's party prince! Future King, 19, is caught smooching daughter of former Army captain at music festival\n-\nGeorgia May Foote slips into brown workout gear as she heads to the gym amid reports she and husband Kris Evans are 'headed for divorce'\n-\nFury over Katy Perry music video filmed in protected area without permission - as authorities in Majorca issue fine\n-\nLove Island besties Toni Laites and Shakira Khan put on a VERY racy display as they passionately kiss on a pool table in raunchy clip\n-\nCountry music star Spencer Hatcher's mother is stabbed to death in horrific home invasion\n-\nHot socialite summer! Lady Mary Charteris parties the night away with Lady Lola Bute, Lila Moss, Rita Ora's husband and Charlotte Tilbury\n-\nHit horror series with Hollywood A-lister AXED - as devastated fans fume 'how could they?!'\n-\nHalle Berry's ex is skewered by fans for saying he left her because she didn't cook, clean, or seem 'motherly'\n-\nShirtless David Beckham, 50, and wife Victoria, 51, continue soaking up the sun on their £16m superyacht amid lavish Italian getaway\n-\nRafael Nadal is a father for a second time! Tennis ace and wife Mery Perello welcome son as sweet meaning behind his name is revealed\n-\nMaya Jama displays her jaw-dropping figure in a skintight unitard as she runs last minute errands before jetting off to Ibiza\n-\nLily James hits back at Instagram moderators after her racy nude celebration is removed for breaching community guidelines\n-\nNicole Scherzinger sets pulses racing as she takes on Nicki Minaj pose challenge in a skimpy white bikini while balancing on a rock and sipping on a martini\n-\nThe moment that sparked Katie Price and Princess 'feud' as daughter makes modelling debut in Ibiza\n-\nMassive rock band announces long-awaited tour 20 years after hit song\n-\nAmelia Dimoldenberg reveals the A-list star who was her 'dream' Chicken Shop Date and opens up about her VERY flirty encounter with Andrew Garfield\n-\nAdam Rickitt shares news of heartbreaking family tragedy in emotional update\n-\nAnna Friel admits she was 'distraught' after being dumped by her first boyfriend Darren Day as she reveals his brutal move following split\n-\nKatie Price and ex Peter Andre's VERY public feud as daughter Princess reveals she sought counselling after realising her parents 'don't like each other'\n-\nPictured: Meghan Markle's California influence on Princess Eugenie's style - from '50 shades of beige' to Grecian draping\n-\nVictoria Beckham shares a snap of shirtless David as they holiday on the Italian riviera - after he was caught pinching her bottom during date\n-\n'Gutted' Lauren Goodger pulls out of scheduled This Morning appearance due to lack of childcare - as she shares sexy selfies from home instead\n-\nStrictly Come Dancing 2025's first star is REVEALED: Gladiators star Nitro set to compete in new series as the show battles a string of scandals\n-\nPamela Anderson's pickles will make Meghan green with envy! Fans go wild for Baywatch star's new product\n-\nBBC Breakfast guest slammed for 'harsh and disrespectful' swipe at late Blue Peter star Biddy Baxter - with shocked fans gasping 'he clearly wasn't a fan!'\n-\nFashion influencer gets slammed as she goes braless in 'hideous' designer dress\n-\nLucy-Jo Hudson showcases her incredible weight loss in before and after snaps following gruelling 30 day fitness challenge\n-\nWayne Lineker battles nerves ahead of his speech at daughter Tia's lavish wedding as she ties the knot with football manager Harry Agombar in Mallorca\n-\nEdinburgh Fringe luvvies claim 'Oasis effect' is 'catastrophic' as fans send hotel prices surging... and some moan they've been forced to live in cars\n-\nJames Whale's final words: Radio star said the past few months had been hard and expressed his sadness at missing Christmas in posthumous column\n-\nAaron Taylor Johnson's astronomical net worth revealed as actor becomes hot favourite to become the next James Bond after signing deal with 007 watch provider\n-\nSophie Turner hits back at critic that claimed she's 'forgotten' about her two daughters\n-\nKhloe Kardashian enjoys hamper from Meghan Markle's As Ever brand - as delighted Duchess reposts reality star's surprising social media shoutout\n-\nPrincess Andre's childhood trauma: Katie Price's daughter says she 'saw things kids shouldn't see' as she lays bare her mother's 'problems'\n-\nJenna Ortega looks quirky with bleached eyebrows as she promotes Wednesday in South Korea as series two of Netflix hit receives rave reviews\n-\nIsla Fisher and Kaitlyn Dever join pregnant Vanessa Hudgens as they lead the A-listers at star-studded event\n-\nHidden meaning in Princess Beatrice's husband Edoardo Mapelli Mozzi's birthday post for her as he takes inspiration from Prince William and Kate\n-\nPete Wicks admits he's 'in love' with a new woman six months on from his romance with Maura Higgins\n-\nBlue Peter icon Biddy Baxter dies aged 92: Tributes pour in for the 'pioneer' of children's television\n-\nNatalie Imbruglia and Delta Goodrem 'in talks to join cast of Strictly Come Dancing 2025' - as Gladiator Nitro is the first star announced\n-\nAlex Jones shares a kiss with husband Charlie Thomson as she celebrates 15 years on The One Show\n-\nKieran Hayler shows off new tattoo in Sellebrity Soccer match after Princess Andre laid bare her mother Katie Price's struggles following her split from the stripper\n-\nRebecca Loos breaks down in tears after being punched in the face in brutal Celebrity SAS boxing match - gasping 'f***ing hell!' and fighting for breath\n-\nLioness Ella Toone shows off her sparkling engagement ring as she celebrates her partner Joe Bunney's romantic beach proposal with pals\n-\nMaisie Smith breaks down in tears revealing Celebrity SAS moments 'worse than you can imagine' that were cut from 'brutal and torturous' show\n-\nRosie Huntington-Whiteley shows off her incredible figure in a white bikini top and TINY thong on the beach\n-\nVictoria Beckham shares a look at her family holiday as close-knit brood relax in St Tropez amid family rift - but Cruz isn't happy with one of her snaps!\n-\nMeghan Markle issues cryptic message about the UK as she teases As Ever update\n-\nJennifer Lopez's concert crashed by grasshopper as insect crawls up her NECK in nerve-wrecking moment\n-\nRochelle Humes 'gave Myleene Klass' ex-husband Graham Quinn a place to stay' following their split after she caught him 'cheating' with a celebrity\n-\nPaul Gallagher joins Oasis star brother Liam on Edinburgh-bound private jet ahead of looming court date after being charged with rape\n-\nMolly-Mae shows off her incredible figure in a black bikini while on family holiday in Turkey with boyfriend Tommy Fury and daughter Bambi\n-\nPrincess Andre says she 'hated' her appearance and fixated on her 'big nose' as she admits she doesn't have her mum Katie Price's confidence\n-\nCarmen Electra reveals risqué way Kim Kardashian has helped her turn heads\n-\nEXCLUSIVE\nPatrick Kielty's 'seething' family reveal heartbreaking moment they knew his marriage to Cat Deeley was over for good\n-\nLindsay Lohan looks fresh-faced as she visits Taronga Zoo with her rarely-seen husband Bader Shammas and their son in Sydney - and also brings the nanny\n-\nEXCLUSIVE\nMaura Higgins looks unrecognisable in a red wig and dramatic makeup as she poses for striking Original Magazine cover shoot\n-\nJacqueline Jossa shows her support for husband Dan Osborne at football match after Christine McGuinness texting accusations amid marital woes\n-\nIs Prince Louis following in Prince Harry's comedic footsteps? Royal shares a sense of humour with the Duke of Sussex and the late Queen\n-\nPeter Andre reacts to 'disgusting' online messages sent to daughter Princess, 18, by anonymous older men\n-\nGardener's World fans are moved to tears after star reveals his terminal cancer diagnosis during the show\n-\nDR MAX PEMBERTON: Meghan's deathly silence on Harry's woes says so much about their relationship. This is not what a successful marriage looks like..."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-6025321/Costa-del-Crisis-1-500-migrants-poured-Europes-new-Spanish-gateway-just-one-week.html",
      "text": "Costa del Crisis: Running on to Spanish beaches where Brits bask on holiday, these are just some of the 1,500 migrants who've poured through Europe's new gateway in just one week\n- So far in 2018 23,000 migrants have arrived in Spain hoping to make a new life\n- More than 1,500 have landed close to Algeciras on the Spanish coast in a week\n- The migrants from Africa are taking off from Morocco and paid £1,300 each\nThe promenade lined with palm trees overlooking Campamento port is where Spanish families enjoy a stroll in the cool of evening. They can gaze across the sea at the Rock of Gibraltar and the street lights of Morocco 13 miles away.\nAbove them is the white-walled town of San Roque, where 5,000 Spanish sought sanctuary after Anglo-Dutch forces seized control of Gibraltar in 1704. They fled carrying priceless relics: church records and statuettes dating back to the early 16th century, which are on show to tourists visiting this quiet corner of the Costa Del Sol.\nYet the pace of life is changing fast here. This week at Campamento, not far from the coastal city of Algeciras, a giant camp with orange tents and wood cabins was being given its finishing touches. It is a new reception centre for the thousands of illegal migrants who have sailed from Morocco to Spain on perilous journeys in rickety boats.\nThe camp has come as a complete surprise to many Spanish people. One young man on the prom, watching the tents and cabins being filled with army-style beds, whispered to me: 'This looks like Guantanamo Bay.'\nAnother resident, a slim lady in her 50s, shook her head. 'We want to help these people, but hope they won't stay long.'\nMoroccan migrants disembark from a dinghy at 'Del Canuelo' beach after they crossed the Strait of Gibraltar sailing from the coast of Morocco\nA third, writing on a popular local website, wrote sarcastically: 'A new camp like Calais in France…congratulations!'\nSpain is now the top destination for illegal migrants reaching Europe by sea. So far this year there have been 23,000 arrivals, almost four times more than at the same point last summer, according to the United Nations refugee agency.\nAnd the numbers reaching Spain grow daily. Sailings far outstrip those on the once-favoured route from Libya to Italy, which have fallen by 80 per cent since the interior minister of Italy's Right-wing government ordered a virtual halt to migrant boats entering Italian ports earlier this year.\nMore than 1,500 people have landed along the Spanish coast close to Algeciras since last Friday. In one amazing episode, dozens of migrants were filmed arriving on a beach by boat and racing up the sand a few miles south of the seaside city as shocked sunbathers — some of them naturists — looked on.\nEarlier this week, there were so few places for migrants to sleep in Algeciras that many lay wrapped in charity blankets or flattened cardboard boxes on the pavement. Pictures of their plight were beamed around the world as the mayor begged for help.\nJose Ignacio Landaluce said his city had become the 'new Lampedusa' in a reference to an Italian island south of Sicily which has been transformed from a holiday paradise by thousands of illegal migrants who live there in refugee camps after arriving by boat from North Africa.\nHe pleaded: 'I hope the EU is working on a global policy on this: it may be our [Spanish] problem now, but tomorrow, or in a week's time or a month's, it will be at the heart of Europe.'\nHis words ring true. For as I discovered this week in Algeciras, few of the new arrivals speak any Spanish, and they will find it hard to cope with life or find a job. They may simply use Spain as a stepping stone to travel north into France; already some have arrived and then simply disappeared.\nMost of them hail from the French-speaking countries of West Africa — Guinea, Mali, Niger, Cameroon and Chad. And the fact that Spain has high unemployment, with one young person in three out of work, means finding a job in the country will be a struggle at best.\nAll this does not bode well, for it is when large numbers of young men find themselves at a loose end for weeks that social problems can unfold.\nMembers of the NGO talking to rescued migrants aboard the French NGO's ship Aquarius, in the search and rescue zone in the Mediterranean sea.\nThe arriving migrants have been put in temporary accommodation: police stations, hostels and sports centres, where — as officials and charity workers struggle to cope — each one is given a bed, regular meals, free medical care and a foreigner's certificate allowing them to travel freely inside the country.\nNeedless to say, in the faraway tea-houses of impoverished West and North Africa, news of such largesse has got round fast. Spanish police this week estimated that 50,000 migrants from that part of the Third World now wait in Morocco, hoping to sail to Spain.\nThey are helped by people-trafficking gangs — often run by Moroccans — which charge migrants £1,300 each for a place on a small boat, or sell a group of them a rubber dinghy with paddles for an extortionate £500.\nMigrants are seen on a dinghy as they cross the Strait of Gibraltar sailing from the coast of Morocco\nThey are pushed off by the traffickers at night, in flotillas, from beaches along a 250-mile stretch of the Moroccan coast between the cities of Tangier and Nador. It is risky for the migrants, and hundreds have drowned already this year.\nHowever, refugee charities in Morocco regularly tip off the Spanish coastguards when a flotilla is about to sail. This means there is a rescue boat waiting in international waters (12 miles off the coast) to take the migrants on board and bring them safely into a Spanish port.\nUnder controversial EU rules, Spain, as a nearby country, also has a duty to help any vessel leaving Morocco that sounds a distress SOS signal. Migrants even send directions on social media via their mobile phones to alert the coastguards to their exact location at sea.\nCaptain Miguel Parcha, skipper of a coastguard vessel operating on the Costa Del Sol, told me: 'The migrants know we will rescue them when they set off. That is a fact. We do our work because otherwise they will die.'\nThe crisis in Spain has been heightened by events in May when a French-run charity vessel, Aquarius, was prevented by the new Italian government from bringing 630 migrants ashore, amid accusations that such foreign-flagged ships were acting as a taxi service for migrants and helped fuel the wicked trade of the traffickers.\nMigrants entering Spain from Morocco are sent to the migration camps where they are registered\nThe orange tents are set up to house those who arrive in Spain as migrants. Many hope to gain asylum status\nNext, Malta also refused to take the migrants. But Spain's new Left-wing government stepped into the breach and welcomed the ship as an act of humanity.\nIt arrived in the port of Valencia four days later, while politicians in Madrid told European leaders to stop playing 'ostrich' politics over the huge issue of illegal arrivals in Europe.\nThis week, Spain had not changed its tune. Josep Borrell, the foreign minister, denied the country was experiencing 'mass' immigration and said Europe needed 'new blood' to compensate for a low birth rate.\nThe Government is aiming to invest £26 million in an emergency plan for migrants, to reflect the fact that Spain is now the main destination for newcomers from Africa.\nAll this was good news for the migrants I met in Algeciras sitting outside the Casa Blanca cafe, near the port, before they took a walk on the city's beach.\nThe four, from Guinea, arrived in the tourist resort of Malaga, an hour's drive away, on the afternoon of Sunday, July 22, in a coastguard boat. They had been rescued from a flotilla of small craft that had set sail the night before from a beach in Nador, Morocco.\nOnce in Spain, they were driven by coach to Algeciras, where they were given a room each in the Pension Zagora in a narrow side street, paid for by the Spanish government.\nEvery day they can have three meals — also free — at the Casa Blanca cafe. Meanwhile, each has been given a registration document by the local social security office, certifying their arrival in Spain, their name, nationality and date of birth. It means they can travel anywhere in Spain while their rights to asylum are assessed.\nIt seems likely that Souleymane Diop, one of the quartet, will be lucky. The 20-year-old is a handsome boy with a wide smile and pearly teeth, dressed in a white charity T-shirt given to him by the Spanish Red Cross.\nHe says he is gay, which means he has a good chance of claiming asylum in Spain under EU human rights laws.\nHis claims his sexuality is why he left the home of his mother, a nurse, in Conakry, Guinea. 'They don't like men like me in my country. They kill us,' he says simply. 'My life was in danger and my family's, too. I have no father that I know of, so I could not do that to my mother.'\nSouleymane was in a small rubber boat for hours before he was rescued by the Spanish coastguard. It was another four hours before he reached Spain. 'I had been in Morocco for months waiting to get on a boat,' he explains. 'I had travelled from Guinea through Mali, Algeria and Morocco.\nMigrants Chief Souare, Souleymare Diop,Mohammed Keita, and Karim Kourama all from Guinea in West Africa\nFrom Morocco to Spain: This is the inside of the camps the migrants are sent to when they arrive - if they are caught\n'I was so relieved to arrive. Now, I want to stay in Spain because I am good at languages. I want to work in IT and get a training. The days are long here, but I am grateful to this country.'\nSouleymane is agnostic, unlike his Muslim friends Karim Kourama, 19, Souare Hadre, 25, and Mohammed Keita, 20. They spend their time playing on their mobile phones and sleeping. 'We can tell you where the best beach is,' laughs Souleymane.\nHe met Karim on the coastguard boat, and the two chatter together about what the future holds. Karim wants to go to England, where his uncle, Matiti Camara, has been living for eight years, working as a translator in Sunderland. Matiti arrived in Britain legally with a work visa, then returned to impoverished Guinea, where he married Marie and brought her back to live in the North-East, where they have four children.\nKarim, the son of a police officer, shows me pictures of Marie on Facebook and photos of three of the children on what he says was a trip to London.\n'I hope Spain will let me go to England. I hope England will have me,' he says, with Souleymane translating. 'I know it is cold there, but I have family so that is a start.'\nOf course, these young men are full of dreams. They are still very excited to get to Europe. They seem to have no inkling that there are many thousands like them with few qualifications and language problems who are already in Spain, with the same high hopes but a precarious future.\nBack at the newly built camp at Campamento port, a police officer showed me round, pointing out the bunk beds where 600 newly arrived migrants will sleep.\n'The first will be here by coach tonight or tomorrow,' he tells me. 'They will have a medical check first. We will also do DNA tests to make sure families are really families, and that there are no children or women being trafficked among them.\n'Those who claim to be children but look like adults will have tests on their bones to see if they are telling the truth. Only after several days will the migrants whose checks are clear be allowed to leave here to begin their life in Spain.'\nIt all sounds fine on paper. But what has this liberal country taken on?\nThe other day, the new leader of Spain's conservative opposition Popular Party, Pablo Casado, said the Left-wing government must change direction over its open-door policy, otherwise 'millions' more would arrive from Africa.\n(l to r) Mohammed Keita, Souleymare Diop , Chief Souare,and Karim Kourama in Spain where they hope to remain\nHe said it was not possible for every migrant to be allowed to live in Spain. 'Nor is it sustainable that a welfare state can absorb millions who want to come to Europe. We have to say it, even though it is politically incorrect.'\nYet his words are unlikely to be heeded by those who hold political sway in Spain. And the same goes for the concerns of ordinary Spaniards who fear trouble ahead.\nOn a local internet discussion forum discussing the influx to Algeciras, one man calling himself Miguel wrote this week: 'The other day I went to Tangier, where, near the central bullring, there are thousands and thousands of people waiting to be able to ride a boat [to Spain]. They even know they will be rescued by Spain and will then be Europeans.\n'Madness. This is only the beginning. It has to end.'\nThis week it was clear that many here in Spain believe the same.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Shocking moment man is gored to death after charging at bull\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment woman strikes flight attendant before being removed\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Father of children mowed down in Oatlands tragedy confronts killer\n- Tragic British rider Sarah Yorke seen jumping fences during training\n- Hawaii ferry is tossed by strong waves before being run aground\n- Nat Barr's tough message to Albo after recognising Palestine state\n- Family-friendly restaurant Cracker Barrel unveils bold new look"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-12151653/Migrants-barricade-entrance-Comfort-Inn-hotel-London.html",
      "text": "'People can't pay their mortgages and they're moaning about a free hotel': Neighbour's fury as migrants who came to the UK by boat and lorry protest over 'inhumane' conditions at £150-a-night London hotel\n- Group left three-star Comfort Inn in Westminster and decamped to pavement\nA group of 25 asylum seekers are staging a pavement protest after refusing to sleep four to a room in a budget hotel in central London - prompting anger among neighbours.\nThe group have vowed to remain outside the £150-a-night Comfort Inn until the Home Office finds them more suitable accommodation having rejected their rooms as 'inhumane'.\nOfficials have now made a series of concessions to the protesters, saying only two people would have to share a room before moving to alternative accommodation in Whitechapel in a fortnight.\nThe group rejected these suggestions and have now been handed a 24-hour ultimatum by the Home Office to accept their hotel accommodation - or be made homeless.\nLocal residents and hoteliers said the protest was having a detrimental effect on the area where mansion flats sell for over £1m. One woman walking into a restaurant said: 'People are struggling with their mortgage and they are complaining about having to stay rent free in a hotel. It really beggars belief.'\nA group of asylum seekers are camped outside the Comfort Inn in Westminster to protest about the conditions inside\nThis morning, around 20 people remained outside the hotel, with pictures showing suitcases and blankets strewn across the pavement\nA view of the scene outside the Comfort Inn hotel in Pimlico this afternoon\nToday, most of the group dozed in the afternoon sunshine or sat smoking or talking on their iPhones as four police officers kept watch.\nSuitcases and other possessions blocked the pavement just yards from £2m homes in Pimlico, one of London's most fashionable areas\nHoteliers also expressed dismay at the protest with one saying he has had several cancellations. Hotels in the area are expecting to be full with tourists given the location to the main sights in London.\nThe protest began two days ago after the Home Office moved the migrants from a hotel in Ilford, Essex, to the Comfort Inn.\nWhile they were allocated a room each at their previous hotel the budget option in London meant they had to share four to room. They also complained that the hotel was 'smelly' and they had no privacy.\nA man in his 20s, was from the Sudan, said the conditions were 'not human.'\n'There are four of us in a room and we have to sleep on bunk beds. There isn't even room to turn around once our suitcases are in the room.\n'The toilet is smelly because there are four people using it and it does not get cleaned.'\nThe migrant, who said he has been in the UK for 18 months waiting for his asylum application to be reviewed, vowed that the pavement protest would continue until they are moved to a new hotel.\nHe said he had been smuggled into the UK hidden in a lorry while many others had crossed the Channel in a dinghy.\nAnother migrant, an Iranian, added:' The rooms are like a cage. It makes us feel like we are back in a prison. The previous hotel meant we had some privacy, but it is not right that we have to share four to a room and sleep on a bunk bed.'\nOther migrants refused to speak or claimed they did not speak English.\nThe men are from Sudan, Somalia, Eritrea, Afghanistan, Iran and Kurdistan.\nTwo people - one wearing a trans rights T-shirt – handed out wet wipes for the men to wash their faces.\nAnother who said he supported the migrants told them to hide their faces from a photographer.\nThe group had previously stacked their suitcases outside the entrance to the hotel to stop people leaving, but that had been removed to allow police and Home Office officials to come and go.\nRough sleeping teams have been supporting the asylum seekers, according to the council, which claimed the Home Office had not put forward any resolution to the matter\nBedsheets, clothes and holdalls on the pavement outside the central London hotel today\nPolice officers at the scene of the protest outside the hotel today\nThe Comfort Inn is currently closed to paying guests but usually charges around £150 a night for what it describes as 'good value accommodation'\nA bathroom inside the Comfort Inn. There have been complaints the toilets are 'smelly'\nA kitchen area inside the hotel, which has received mixed reviews on TripAdvisor\nOne of the protesters, a 27-year-old Iranian, told the Telegraph: 'Two square metres is not enough for sleeping four people. And when you go to the toilet, the smell damages you.'\nAnother Iranian, who is 21 and had also crossed the Channel, said the Comfort Inn had looked 'nice' on Google maps but 'when you get in, it's like a jail'... 'they treat you like an animal'.\nMeanwhile, a 26-year-old from east Africa who crossed the Channel in a small boat said they had been given private rooms at another hotel in Ilford, Essex. He said: 'We need a private room. How do you live with four men?'\nIn a letter to the Home Secretary, the leader of Westminster City Council expressed his 'deep concern' that around 40 refugees were placed in the borough on Wednesday night 'without appropriate accommodation or support available' and no prior communication with the local authority.\nAdam Hug complained that asking people who 'are likely to have been through significant and traumatic events' to share 'an inappropriately-sized room with multiple strangers defies common sense and basic decency'.\nHe said the Government's demand created 'safeguarding and health risks', and noted that 'leaving them on the street for multiple nights is not an alternative'.\nRough sleeping teams have been supporting the asylum seekers, according to the council, which claimed the Home Office had not put forward any resolution to the matter.\nThe asylum seekers, who are from Iraq, Iran, Eritrea, Ethiopia, Somalia and Bangladesh, have put up posters at the hotel entrance and on traffic lights reading 'help us' and 'this is a prison, not a hotel'.\nThe Comfort Inn is currently closed to paying guests but usually charges around £150 a night for what it describes as 'good value accommodation'.\nThe guesthouse is rated three stars on TripAdvisor but the last eight reviews have all been one star.\nThe asylum seekers, who are from Iraq, Iran, Eritrea, Ethiopia, Somalia and Bangladesh, have put up posters at the hotel entrance and on traffic lights reading 'help us' and 'this is a prison, not a hotel'\nThe Comfort Inn is currently closed to paying guests but usually charges around £150 a night for what it describes as 'good value accommodation'\nThe group complain that instead of the ensuite single rooms they had at a guesthouse in Essex they are now being forced into singles with two bunk beds and a 'smelly toilet'\nAnother reviewer, who stayed in March 2023, wrote: 'Just really really grim. One of the smallest rooms I have ever had the misfortune to stay in (literally 30cm wider than the double bed in it) with a bathroom literally in a cupboard (you have to admire the audacity to even try and fit a toilet and shower in that space).'\nA second called it a 'hotel from hell' and complained of the 'horrendous conditions' inside their room, while others called it a 'dump' and warned 'avoid at all costs'.\nThe Home Office is currently housing 50,000 asylum seekers in hotels and officials are desperate to find ways to reduce the estimated £6million a day bill.\nMinisters are believed to be advocating the increased use of shared rooms over concerns smuggling gangs are trying to lure migrants with the promise of 'luxury' accommodation.\nAsylum seekers in hotels are allowed to come and go and receive £9.10 a week to cover any costs beyond bed and board, which is already paid for.\nA Home Office spokesperson said: 'Despite the number of people arriving in the UK reaching record levels, we continue to provide accommodation - at a cost of £6million a day - for asylum seekers who would otherwise be destitute to meet our legal obligation.\n'The accommodation offered to asylum seekers by providers, on a no choice basis, is of a decent standard and meets all legal and contractual requirements.'\nMailOnline has contacted the hotel for comment.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Shocking moment man is gored to death after charging at bull\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment woman strikes flight attendant before being removed\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Father of children mowed down in Oatlands tragedy confronts killer\n- Tragic British rider Sarah Yorke seen jumping fences during training\n- Hawaii ferry is tossed by strong waves before being run aground\n- Nat Barr's tough message to Albo after recognising Palestine state\n- Family-friendly restaurant Cracker Barrel unveils bold new look"
    }
  ],
  "argos_summary": "A group of 38 migrants, including men, women, and children, arrived on a beach in the Algarve, Portugal, after a dangerous journey from Morocco. They were quickly apprehended by Portuguese authorities and face deportation back to Morocco within weeks, as Portugal enforces strict immigration policies. The migrants received temporary shelter and basic necessities but have not claimed asylum, as Portugal considers Morocco a safe country. This situation contrasts sharply with the treatment of migrants in the UK, where they often receive more lenient accommodations.",
  "argos_id": "SFA63XU9C"
}