{
  "url": "https://www.independent.co.uk/news/donald-trump-inflation-asian-china-tokyo-b2805932.html",
  "authorsByline": "Yuri Kageyama",
  "articleId": "24a46036a21c4ad1a1cd9c70d95a8487",
  "source": {
    "domain": "independent.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static.independent.co.uk/2025/08/12/08/Japan_Financial_Markets_76807.jpg?width=1200&height=800&crop=1200:800",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T07:29:11+00:00",
  "addDate": "2025-08-12T07:47:25.318784+00:00",
  "refreshDate": "2025-08-12T07:48:01.741550+00:00",
  "score": 1.0,
  "title": "Asian shares advance on relief that Trump is delaying higher China tariffs",
  "description": "Asian shares are mostly higher after President Donald Trump delayed raising tariffs on China for another 90 days",
  "content": "Asian shares mostly advanced Tuesday after President Donald Trump delayed raising tariffs on China for another 90 days.\n\nTokyo's benchmark Nikkei 225 jumped 2.2% to 42,718.17, topping its past all-time record. Toyota Motor Corp.'s shares surged nearly 3% and other heavyweight shares also saw big gains after the U.S. confirmed that tariffs on imports from Japan would be taxed at 15% and not subject to “stacking” the rate on top of already existing duties.\n\nHong Kong's Hang Seng rose 0.3% to 24,979.55, while the Shanghai Composite climbed 0.5% to 3,665.92.\n\nTrump signed an executive order Monday putting on hold a possible showdown between the world’s two major economies to allow time for more talks on a broad trade agreement. Without an extension, taxes on Chinese imports might have jumped from an already high 30%.\n\nBeijing could have responded by raising retaliatory levies on U.S. exports to China but it issued a similar statement about the extension of the tariff pause.\n\nThe reprieve makes room for a possible deal with Trump, but it also prolongs the uncertainty that has bedeviled companies since the president began escalating his trade war.\n\n“The extension isn’t about goodwill; it’s about keeping oxygen in the room for deals that matter,” Stephen Innes of SPI Asset Management said in a commentary.\n\nElsewhere in Asia, Australia’s S&P/ASX 200 rose 0.3% to 8,880.80. South Korea’s Kospi lost 0.5% to 3,189.91.\n\nOn Monday, U.S. stocks edged back from their record highs ahead of an update on U.S. inflation. The S&P 500 dipped 0.3% to 6,373.45 after flirting with its all-time high, which was set two weeks ago.\n\nThe Dow Jones Industrial Average dropped 0.5% to 43,975.09, and the Nasdaq composite slipped 0.3% to 21,385.40.\n\nOn Tuesday, the government will report how bad inflation was across the country in July. Economists expect it to show U.S. consumers had to pay prices for groceries, gasoline and other costs of living that were 2.8% higher than a year earlier, a slight acceleration from June’s 2.7% inflation.\n\nInflation has remained above 2%, even if it has improved substantially from its peak above 9% three years ago. And the worry is that President Donald Trump’s tariffs could push prices still higher.\n\nThat in turn is raising fears about a potential, worst-case scenario called “stagflation” where the economy stagnates but inflation remains high. The Federal Reserve has no good tool to fix both at once, and it would need to concentrate on either the job market or inflation first. But helping one of those areas by moving interest rates would likely hurt the other.\n\nA top Fed official, Michelle Bowman, said on Saturday that she believes the job market is the bigger concern. She is still backing three cuts to interest rates by the Fed this year following this month’s stunning, weaker-than-expected report on the U.S. job market. Trump has also been angrily calling for cuts to interest rates to support the economy.\n\nOther Fed officials, led by Chair Jerome Powell, have been more hesitant. Powell has said he wants to wait for more data about how Trump’s tariffs are affecting inflation before the Fed makes its next move, and Tuesday’s update on the consumer price index may offer a big clue about that.\n\nThe price of gold eased after Trump said he would not place tariffs on the metal. That followed a brouhaha Friday in the gold market after the U.S. Customs and Border Patrol seemed to rule that some kinds of gold bars coming from Switzerland would face a tariff. That caused a disconnect between the prices of gold trading in New York versus in London, but the market has since calmed.\n\nGold for December delivery settled at $3,404.70 per ounce in New York, down 2.5%. Early Tuesday, it was down 0.3% at $3,394.00.\n\nIn other dealings early Tuesday, benchmark U.S. crude rose 12 cents to $64.08 a barrel. Brent crude, the international standard, added 19 cents to $66.82 a barrel.\n\nIn currency trading, the U.S. dollar edged up to 148.33 Japanese yen from 148.15 yen. The euro cost $1.1614, down from $1.1618.",
  "medium": "Article",
  "links": [
    "https://www.independent.co.uk/topic/china",
    "https://www.independent.co.uk/topic/inflation",
    "https://www.independent.co.uk/topic/tokyo",
    "https://www.independent.co.uk/topic/donald-trump",
    "https://www.independent.co.uk/donate?regSourceMethod=Donations",
    "https://www.independent.co.uk/topic/asian"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. inflation",
      "weight": 0.085688956
    },
    {
      "name": "U.S. consumers",
      "weight": 0.076735
    },
    {
      "name": "higher China tariffs",
      "weight": 0.07558117
    },
    {
      "name": "U.S. exports",
      "weight": 0.07310637
    },
    {
      "name": "U.S. stocks",
      "weight": 0.07228343
    },
    {
      "name": "U.S.",
      "weight": 0.07214095
    },
    {
      "name": "President Donald Trump",
      "weight": 0.071577534
    },
    {
      "name": "Donald Trump",
      "weight": 0.07121243
    },
    {
      "name": "Trump",
      "weight": 0.066792175
    },
    {
      "name": "Other Fed officials",
      "weight": 0.06602311
    }
  ],
  "topics": [
    {
      "name": "Asian"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98388671875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.87890625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.873046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.7802734375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.7001953125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.63134765625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.4287109375
    }
  ],
  "sentiment": {
    "positive": 0.13330498,
    "negative": 0.7742672,
    "neutral": 0.09242788
  },
  "summary": "Asian shares saw a surge in shares after President Donald Trump delayed raising tariffs on China for another 90 days. Tokyo's benchmark Nikkei 225 saw a 2.2% increase, while Hong Kong's Hang Seng rose 0.3% and the Shanghai Composite climbed 0.5%. The decision allows for more talks on a broad trade agreement, but prolongs uncertainty that has plagued companies since the president began escalating his trade war. The government will report how bad inflation was across the country in July, which is expected to show consumers had to pay prices 2.8% higher than the previous year, raising concerns about a potential \"stagflation\" where the economy stagnates while inflation remains high. The price of gold fell after Trump announced he would not place tariffs on the metal.",
  "shortSummary": "Asian shares rose as investors welcomed President Donald Trump's 90-day delay in raising tariffs on China, amid concerns over inflation and potential interest rate cuts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "19a82cf2b7284f91a296a350607ce8e0",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Asian shares rose on Tuesday following President Trump's decision to delay tariff increases on China for 90 days, with Japan's Nikkei 225 hitting a record high. The extension allows for further trade negotiations, although it prolongs uncertainty in the market. Meanwhile, U.S. stocks dipped ahead of inflation data, with concerns about rising prices potentially leading to stagflation. The Federal Reserve is cautious about interest rate cuts, focusing on the job market while monitoring the impact of tariffs on inflation.",
  "argos_id": "SK2NFBI0I"
}