{
  "url": "https://www.nytimes.com/2025/08/12/learning/word-of-the-day-inedible.html",
  "authorsByline": "The Learning Network",
  "articleId": "df001934940a4480b17debda905d3ae4",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/07/31/learning/WOTD-inedible/WOTD-inedible-facebookJumbo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T06:00:02.585000+00:00",
  "addDate": "2025-08-12T06:10:42.191368+00:00",
  "refreshDate": "2025-08-12T06:10:42.191371+00:00",
  "score": 1.0,
  "title": "Word of the Day: inedible",
  "description": "This word has appeared in 22 articles on NYTimes in the past year. Can you use it in a sentence?",
  "content": "The word inedible has appeared in 22 articles on NYTimes.com in the past year, including on July 9 in “Over 200 Children Hospitalized in China After School Serves Lead-Tainted Food,” by David Pierson and Berry Wang:\n\nThe police in Tianshui, a city in Gansu Province, have detained eight officials and employees of the privately owned kindergarten, including the principal and an investor. They found that school cooks used inedible pigments bought online to decorate buns and cakes that were served to the children, Chinese state media reported on Tuesday.\n\nCan you correctly use the word inedible in a sentence?\n\nBased on the definition and example provided, write a sentence using today’s Word of the Day and share it as a comment on this article. It is most important that your sentence makes sense and demonstrates that you understand the word’s definition, but we also encourage you to be creative and have fun.\n\nIf you want a better idea of how inedible can be used in a sentence, read these usage examples on Vocabulary.com. You can also visit this guide to learn how to use IPA symbols to show how different words are pronounced.\n\nIf you enjoy this daily challenge, try our vocabulary quizzes.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/spotlight/vocabulary-quizzes",
    "https://www.vocabulary.com/dictionary/inedible",
    "https://www.vocabulary.com/resources/ipa-pronunciation/",
    "https://www.nytimes.com/2025/07/09/world/asia/china-children-lead-poisoning.html"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "different words",
      "weight": 0.10350652
    },
    {
      "name": "Word",
      "weight": 0.097936995
    },
    {
      "name": "inedible pigments",
      "weight": 0.08947051
    },
    {
      "name": "Chinese state media",
      "weight": 0.08010691
    },
    {
      "name": "school cooks",
      "weight": 0.07691645
    },
    {
      "name": "Gansu Province",
      "weight": 0.07641572
    },
    {
      "name": "David Pierson",
      "weight": 0.07259234
    },
    {
      "name": "IPA symbols",
      "weight": 0.07114871
    },
    {
      "name": "School",
      "weight": 0.065673344
    },
    {
      "name": "Berry Wang",
      "weight": 0.06084798
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.87744140625
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.36572265625
    }
  ],
  "sentiment": {
    "positive": 0.1232244,
    "negative": 0.4276871,
    "neutral": 0.4490885
  },
  "summary": "The word inedible has been featured on numerous occasions in the past year, including in an article by David Pierson and Berry Wang. The police in Tianshui, China, have detained eight officials and employees at a privately-run kindergarten, including the principal and an investor, for using ineditable pigments in buns and cakes served to children. The challenge involves using the definition and example of the word inevitable.",
  "shortSummary": "The inedibility of ineditable is the word inescapic, a phrase many people refer to as \"Heck\" (We're Not) but \"Sheesh\" (Heck)",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8b833c5136e648a0a730f37ad85fb8d2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/spotlight/vocabulary-quizzes",
      "text": "Vocabulary in Context: TikTok Influencing\nTest your vocabulary and reading comprehension with this quiz based on the Times article “For Gen Z, Playing an Influencer on TikTok Comes Naturally.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “For Gen Z, Playing an Influencer on TikTok Comes Naturally.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Inside the ‘Top Chef’ Industrial Complex.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Pythons, Invasive and Hungry, Are Making Their Way North in Florida.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Snarl, You’re on Candid Camera.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Dance Like You’re Wednesday Addams.”\nCompiled by Katherine Schulten\nThis word has appeared in 12 articles on NYTimes.com in the past year. Can you use it in a sentence?\nBy The Learning Network\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Taking Back the Mountains.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “A Championship Season in Mariachi Country.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Behind Bad Bunny’s Summery Surprise, ‘Un Verano Sin Ti’.”\nCompiled by Katherine Schulten\nTest your vocabulary and reading comprehension with this quiz based on the Times article “Gen Z Knows What It Wants From Employers. And Employers Want Them.”\nCompiled by Katherine Schulten\nAdvertisement\nAdvertisement"
    }
  ],
  "argos_summary": "The term 'inedible' has been highlighted in recent articles, particularly in a report about over 200 children in China being hospitalized due to lead-tainted food served at a kindergarten. Authorities have detained several officials from the school after discovering that inedible pigments were used in food preparation. The article encourages readers to creatively use the word 'inedible' in sentences, while also promoting vocabulary quizzes related to various topics.",
  "argos_id": "SQO3QZY0N"
}