{
  "url": "https://www.foxnews.com/politics/texas-democrats-begin-crack-confirm-return-state-after-fleeing-obstruct-gop-redistricting",
  "authorsByline": "Alec Schemmel",
  "articleId": "30606398797047eea3a6e319c33b00ed",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/texas-democrat-rep.-gene-wu.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:22:53-04:00",
  "addDate": "2025-08-12T23:33:07.434027+00:00",
  "refreshDate": "2025-08-12T23:33:07.434028+00:00",
  "score": 1.0,
  "title": "Texas Dems begin to crack, confirm return to state after fleeing to obstruct GOP redistricting: report",
  "description": "Texas House Democrats plan to return to the state after fleeing to block GOP redistricting efforts, local Texas media has confirmed.",
  "content": "Texas House Democrats have reportedly confirmed they intend to return to their state after fleeing in an attempt to halt legislative proceedings, which included GOP attempts to redraw congressional districts in the state.\n\nMultiple sources confirmed to ABC 13 Houston on Tuesday that the absent House Democrats will return to the Lone Star State after feeling like they accomplished their mission of killing the special legislative session called by Republicans to pass redistricting legislation. The special session expires next Tuesday.\n\nThe outlet reported the exact time of the Democrats' return to the capital in Austin is not clear.\n\nTEXAS GOP SEEKS TO ‘DOMESTICATE’ ROGUE DEMS FOR BREAKING QUORUM THROUGH NATIONWIDE CIVIL ARREST WARRANTS\n\nNews of the lawmakers' imminent return to the state comes on the same day that Texas Senate Republicans were able to get the new congressional maps approved. They must now be passed in the House before Republican Gov. Greg Abbott can sign them into law.\n\nEarlier this week, Lt. Gov. Dan Patrick and Republican House Speaker Dustin Burrows indicated they would adjourn the special legislative session this Friday if Democrats had not returned by then.\n\nMeanwhile, Abbott has signaled plans to immediately call a second consecutive special session and has teased that he may also add additional agenda items.\n\nThe strategy by Texas Democrats to leave the state and abdicate their duties in an effort to stall Republican legislative efforts is a strategy they have used before.\n\nIn 2021, more than 50 Texas Democrats left the state for the nation's capital in an effort to stall Republican election security legislation following President Donald Trump's 2020 election loss.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe effort led to Abbott ultimately calling three consecutive special legislative sessions, with the election security bill passing during the second one in August.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/us/democratic-party",
    "https://www.foxnews.com/politics/abbott-vows-indefinite-special-sessions-says-fleeing-dems-could-face-arrest-literally-years",
    "https://www.foxnews.com/category/person/greg-abbott",
    "https://www.foxnews.com/video/6376846343112",
    "https://www.foxnews.com/category/us/us-regions/southwest/texas",
    "https://www.foxnews.com/apps-products",
    "https://www.foxnews.com/politics/texas-dems-also-skipped-town-2021-avoid-vote-several-caught-covid-19-dc",
    "https://abc13.com/post/texas-house-democrats-return-home-second-special-session-abc13-sources-confirm/17515302/",
    "https://www.foxnews.com/politics/texas-gop-seeks-domesticate-rogue-dems-breaking-quorum-through-nationwide-civil-arrest-warrants",
    "https://www.foxnews.com/category/politics/elections/republicans"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Texas House Democrats",
      "weight": 0.107627295
    },
    {
      "name": "Republican legislative efforts",
      "weight": 0.1002175
    },
    {
      "name": "Texas Democrats",
      "weight": 0.09949968
    },
    {
      "name": "Republican election security legislation",
      "weight": 0.09144808
    },
    {
      "name": "Republican Gov. Greg Abbott",
      "weight": 0.08731816
    },
    {
      "name": "Republican House Speaker Dustin Burrows",
      "weight": 0.08562337
    },
    {
      "name": "state",
      "weight": 0.08451395
    },
    {
      "name": "Democrats",
      "weight": 0.08181539
    },
    {
      "name": "Texas Senate Republicans",
      "weight": 0.0813876
    },
    {
      "name": "legislative proceedings",
      "weight": 0.080141
    }
  ],
  "topics": [
    {
      "name": "GOP"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9912109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.98193359375
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.92236328125
    },
    {
      "name": "/News/Local News",
      "score": 0.73046875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.65966796875
    }
  ],
  "sentiment": {
    "positive": 0.06718111,
    "negative": 0.63305426,
    "neutral": 0.2997646
  },
  "summary": "Texas House Democrats have confirmed they plan to return to the state after fleeing legislative proceedings in an attempt to obstruct GOP redistricting efforts. The move comes as Texas Senate Republicans have approved new congressional maps, which must be passed in the House before Republican Gov. Greg Abbott can legally sign them. The exact time of the Democrats' return is not clear.",
  "shortSummary": "Texas House Democrats will return to Austin after successfully blocking Republican redistricting efforts, pending the expiration of the current legislative session.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2b1dae0f1d724b22ba32b7722e309902",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/politics/texas-gop-seeks-domesticate-rogue-dems-breaking-quorum-through-nationwide-civil-arrest-warrants",
      "text": "Texas Republicans, Attorney General Ken Paxton and House Speaker Dustin Burrows are seeking nationwide civil arrest warrants for the Texas House Democrats who broke quorum when they fled the state for Illinois and California.\nIn the latest escalation of the redistricting debate taking national politics by storm, Paxton and Burrows are seeking to \"domesticate\" civil arrest warrants in Illinois and California for the Texas Democrats who fled the Lone Star State to block a Republican-led redistricting plan that could protect Republicans' slim U.S. House majority.\n\"We are pursuing every legal remedy at our disposal to hold these rogue legislators accountable,\" Paxton said in a statement. \"Texas deserves representatives who do their jobs instead of running away at the behest of their billionaire handlers. If there’s one thing Texans can’t stand more than losers, it’s cowards.\"\nBurrows emphasized that \"all options are on the table\" to ensure House members return home to Texas to \"fulfill their constitutional obligations.\"\nTEXAS ASKS ILLINOIS COURT TO ENFORCE ARREST WARRANTS FOR DEMOCRATIC LAWMAKERS\n\"The State has no choice but to pursue additional legal remedies to compel their return from other states. Our full focus is on stopping this dereliction of duty and restoring quorum in the Texas House as soon as possible so we may return our time, attention and resources where they most matter—on the critical issues of the special session call,\" the Republican House Speaker said.\nABBOTT, PAXTON LAUNCH LEGAL BLITZ ON FLEEING DEMOCRATS IN REDISTRICTING SHOWDOWN\nBurrows issued arrest warrants on Aug. 4 for the Democrats who fled Texas, under Article III, Section 10 of the Texas Constitution and Rule 5, Section 8, of the Rules of the Texas House of Representatives.\nAccording to the attorney general's office, it allows for \"[a]ll absentees for whom no sufficient excuse is made may, by order of a majority of those present, be sent for and arrested, wherever they may be found.\"\nMore than a week later, as Democrats have yet to return, Paxton and Burrows are seeking to implement their warrants in Illinois and California, through the Full Faith and Credit Clause of the U.S. Constitution.\nWhile the Texas Republicans argue that other states are obligated to adhere to official acts by the state of Texas, both Govs. J.B. Pritzker of Illinois and Gavin Newsom of California have come out in support of the rogue Texas Democrats, as their home states float their own redistricting plans to balance the scales if Texas Republicans are successful.\nThe Democrats will not be detained and escorted back to Texas unless a state court in Illinois and California accepts Texas' civil arrest warrants.\nOnce lawmakers leave the state, they are beyond the legal jurisdiction of Texas authorities who can compel their return, according to GovFacts, a nonpartisan educational resource that explains U.S. government legalities.\nHowever, if they were to return to Texas, the Texas Constitution would allow legislative leaders to \"physically compel the attendance\" of missing members through civil arrest warrants, allowing law enforcement to find the missing Democrats and return them to the Capitol.\nPaxton has also filed a lawsuit with the Texas Supreme Court, requesting that 13 House Democrats' seats are declared vacant because they fled the state to avoid the Trump-backed redistricting vote.\nThe conservative attorney general also filed a lawsuit against former U.S. Rep. Beto O'Rourke, D-Texas, for allegedly conspiring to aid and abet Democrats' effort to break the quorum.\nAccording to the Courthouse News Service, Republican Tarrant County Judge Megan Fay issued a temporary restraining order against O'Rourke and his Super PAC, Powered by People, hours after the suit was filed \"to stop using funds to pay for Democrats' travel expenses and conduct fundraising to pay for such expenses in the future.\"\nCLICK HERE TO GET THE FOX NEWS APP\nWhen reached for comment, a Pritzker spokesperson pointed to his past comments, addressing the threat of nationwide civil arrests, in which he said Illinois law enforcement will protect \"everybody\" in Illinois.\nAnd a Newsom spokesperson flagged his X posts, trolling the Texas Republicans and urging them to \"come and take\" democracy.\nO'Rourke did not immediately respond to Fox News Digital's request for comment."
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/southwest/texas",
      "text": "Texas 50 mins ago Texas state Senate passes new Republican drawn congressional map as House Dems remain on the lam Texas Senate approves Republican-drawn redistricting maps in 19-2 vote as nine Democrats walk out in protest while House Democrats remain out of state.\nTexas 54 mins ago Austin man charged with capital murder after deadly Target parking lot shooting spree Ethan Nieneker faces capital murder charges for allegedly shooting three people, including a 4-year-old girl, during a carjacking at an Austin Target store.\nTexas 1 hour ago Smoke pours from train derailment in Palo Pinto County, Texas Union Pacific train derailment involving 35 cars occurred 2 miles east of Gordon, Texas on Monday with emergency crews containing a grass fire at the scene.\nPolitics 7 hours ago Texas GOP seeks to ‘domesticate’ rogue Dems for breaking quorum through nationwide civil arrest warrants Texas GOP officials are seeking to enforce civil arrest warrants across state lines for the House Democrats who fled to prevent a Republican redistricting vote.\nImmigration 8 hours ago ICE Houston arrests more than 350 gang members -- and it's not just MS-13 In Trump’s first six months back in office, ICE Houston has arrested more than 350 illegal migrants tied to over 40 gangs — including violent street crews like MS-13 and Tren de Aragua.\nVIDEO 22 hours ago McCarthy calls out Dems for being against redistricting, despite doing the same thing last cycle Former House Speaker Kevin McCarthy weighs in on Texas Democrats fleeing the state to avoid voting on redistricting on 'The Ingraham Angle.'\nTexas 23 hours ago Gov. Abbot still beat Newsom in disaster relief despite Texas Democrats stalling, hiding out Despite Democratic lawmakers fleeing and holding up vital relief efforts, Texas Governor Abbott’s flood relief was faster than California Governor Gavin Newsom’s response to the L.A. wildfires.\nOpinion 1 day ago Texas gerrymandering battle doesn’t matter to voters. They lose either way Texas gerrymandering fight exemplifies why 78% of Americans believe political elites play by different rules while ignoring kitchen-table issues\nImmigration 2 days ago Trump border wall materials sold by Biden may soon find their way back to the feds, auctioneer claims Border wall materials once sold for pennies on the dollar will be returned to government at-cost through deal between GovPlanet and Trump's border czar office.\nOpinion 2 days ago DAVID MARCUS: Democrat New England is the most gerrymandered region in American history New England Democrats hold all 21 House seats across six states through gerrymandering while criticizing Texas Republicans for similar redistricting practices\nPolitics 2 days ago Abbott vows indefinite special sessions, says fleeing Dems could face arrest ‘for literally years’ Governor Greg Abbott warned Texas Democrats will face arrest upon returning amid the redistricting standoff, vows to order continuous special sessions.\nTexas 2 days ago WATCH: Texas state senator argues redistricting showdown could decide balance of power in future US Congress Texas state GOP Sen. Mayes Middleton argues Republican redistricting efforts in his state could be pivotal for Republicans to maintain control in Congress during mid-terms.\nVIDEO 3 days ago Texas reopens the gerrymander wars Democrats vow to retaliate with new maps of their own\nTexas 3 days ago Democratic strategist says party lacks 'moral authority' on Texas redistricting fight Texas redistricting battle intensifies as Republicans push for five new seats and California considers emergency measures to counteract Republican gains.\nTexas 3 days ago Owner of Trump-themed burger chain faces deportation after feds allege illegal status, 'sham' marriages Lebanese restaurateur Roland Beainy, the co-owner of a Trump-branded burger chain in Texas, is facing deportation for visa violations, according to ICE.\nGavin Newsom 3 days ago California launches redistricting fight to ‘nullify’ Texas GOP plan, with Dems poised to gain 5 seats California Gov. Gavin Newsom announced Friday that the Golden State will move forward with a special election in early November to place its own redistricting plan on a ballot measure before voters.\nOpinion 3 days ago Networks pounce on Republican redistricting. They didn’t care when Democrats did it Texas Democrats travel to blue states to block redistricting quorum as networks demonstrate double standard in covering Republican versus Democratic gerrymandering\nOpinion 3 days ago Trump sends military after the cartels and it’s long overdue U.S. military deployment targets Mexican cartels as DHS reports reveal corrupt military and law enforcement crossing border to assist drug trafficking organizations\nTexas 3 days ago Lone Star State rivals for US Senate compete to wrangle runaway Democrats Ken Paxton is challenging John Cornyn in a 2026 Texas Senate race, and a super PAC highlights the attorney general's role in a redistricting battle with fleeing Democrats.\nBeto O'Rourke 3 days ago Judge blocks Beto O'Rourke from funding Texas Dems who fled to stop GOP redistricting vote A Texas judge issued a temporary restraining order against Beto O’Rourke’s nonprofit after the state AG accused him of unlawfully fundraising for Democrats who fled to block GOP bills.\nVIDEO 3 days ago WATCH: Republican Texas state senator says new congressional redistricting bill could 'save America' GOP Texas state Senator Mayes Middleton discusses why he thinks Texas' redistricting effort could 'save America' and why Democrats' attempted challenges are 'meritless.'\nVIDEO 4 days ago Jesse Watters: Republicans are finally 'playing hardball' with direct deposit 'The Five' discusses Texas Democrats blowing off the deadline to return and debate the state's redistricted map.\nPolitics 4 days ago Crockett blames race for 'diva' label, says attacks prove she's 'arrived' Democratic Rep. Jasmine Crockett is firing back at her critics after a New York Post report citing former staffers accused her of creating a hostile work environment.\nTexas 4 days ago Texas AG investigates Beto O’Rourke PAC over support for quorum-breaking lawmakers Attorney General Ken Paxton examines PAC connected to Beto O'Rourke for allegedly assisting Texas Democrats who abandoned legislative duties during redistricting fight.\nTexas 4 days ago Party of 'crazies': Dems comply with outrageous redistricting stunts due to primary threats, state rep says Texas Democrats continue exodus to liberal states over GOP redistricting as Republicans launch bribery investigations and President Donald Trump supports the redistricting push.\nPolitics 4 days ago Texas asks Illinois court to enforce arrest warrants for Democratic lawmakers Texas pursues legal action to enlist Illinois assistance in apprehending Texas state Democratic lawmakers hunkered down in the Prairie State.\nU.S. 4 days ago Ghislaine Maxwell prison transfer called 'highly unusual' by former federal prison official A former assistant director at the Federal Bureau of Prisons says that Ghislaine Maxwell moving to a minimum security prison camp is \"highly unusual.\"\nVIDEO 4 days ago Katie Pavlich warns Mamdani could give the Left 'breath of life' Fox News contributor Katie Pavlich, Stagwell Inc. CEO Mark Penn and Hoover Institution senior fellow Victor Davis Hanson dissect the Democratic Party's 'radical' socialist movement on 'Hannity.'\nTexas 4 days ago Pentagon announces massive migrant detention facility at Fort Bliss in Texas with 5,000 beds Pentagon announces construction of 5,000-bed migrant detention facility at Fort Bliss began in July, with initial 1,000-bed capacity by late August.\nU.S. 4 days ago Ghislaine Maxwell blocked from puppy training program at Federal Prison Camp Bryan: report Ghislaine Maxwell has been barred from participating in service dog training programs at her new prison in Texas, according to a report."
    },
    {
      "url": "https://www.foxnews.com/category/us/democratic-party",
      "text": "Texas 9 mins ago Texas Dems begin to crack, confirm return to state after fleeing to obstruct GOP redistricting: report Texas House Democrats plan to return to the state after fleeing to block GOP redistricting efforts, local Texas media has confirmed.\nTexas 1 hour ago Texas state Senate passes new Republican drawn congressional map as House Dems remain on the lam Texas Senate approves Republican-drawn redistricting maps in 19-2 vote as nine Democrats walk out in protest while House Democrats remain out of state.\nOhio 4 hours ago MAGA-ousted Dem senator from key swing state launches comeback campaign after losing seat in 2024: report Ohio Democrat Sherrod Brown prepares Senate comeback bid after bruising defeat that saw him lose reelection for his fourth consecutive term.\nPolitics 8 hours ago Texas GOP seeks to ‘domesticate’ rogue Dems for breaking quorum through nationwide civil arrest warrants Texas GOP officials are seeking to enforce civil arrest warrants across state lines for the House Democrats who fled to prevent a Republican redistricting vote.\nMedia 8 hours ago Chuck Todd warns America is heading towards a 'cold civil war' as redistricting battle continues Former NBC host Chuck Todd argued that America is heading towards a \"cold civil war\" on \"The Chuck Toddcast\" on Tuesday as redistricting battles in states like Texas and California continue.\nElections Disputes 13 hours ago Dems suggest GOP redistricting has forced them to play partisan politics, Republicans argue nothing's changed Democrats say GOP redistricting efforts are forcing them into partisan retaliation, but Republicans argue that partisan map drawing has always been part of the Democrats' game plan.\n2025 Elections Coverage 15 hours ago GOP mocks Democrats with memo about wildly unpopular ‘Project 2026’ goals, Dems shoot back The National Republican Congressional Campaign Committee is mocking its Democratic counterpart for advancing “wildly unpopular\" policy proposals as part of their “Project 2026\" goals.\nTexas 1 day ago Gov. Abbot still beat Newsom in disaster relief despite Texas Democrats stalling, hiding out Despite Democratic lawmakers fleeing and holding up vital relief efforts, Texas Governor Abbott’s flood relief was faster than California Governor Gavin Newsom’s response to the L.A. wildfires.\nZohran Mamdani 1 day ago Cuomo proposes 'Zohran's law' to protect rent-stabilized housing from the wealthy A political feud erupted between former Gov. Andrew Cuomo and Zohran Mamdani over affordable housing policies and rent-stabilized apartments in NYC mayoral contest.\nOpinion 1 day ago DC Democrats risk losing public trust by dodging youth crime crisis Trump is addressing Democrats must address D.C.'s rising juvenile crime honestly rather than avoiding the issue, as federal overreach from Donald Trump threatens local autonomy.\nMedia 2 days ago Bernie Sanders calls out Kamala Harris' campaign for being 'heavily influenced by wealthy people' Sen. Bernie Sanders called out Kamala Harris' campaign for being influenced by billionaires on Sunday and failing to address the concerns of working families.\nIsrael 2 days ago Dem, GOP reps defend Netanyahu Gaza plan following Israel trip Democratic and Republican representatives endorsed Israeli Prime Minister Benjamin Netanyahu's plan for Israeli forces to temporarily take over Gaza.\nFox News Flash 2 days ago JD Vance calls on Republicans to take 'decisive action' to counter Democratic gerrymandering JD Vance argues illegal immigrants in population counts give blue states unfair congressional representation, urging an aggressive Republican redistricting response.\nPolitics 2 days ago Abbott vows indefinite special sessions, says fleeing Dems could face arrest ‘for literally years’ Governor Greg Abbott warned Texas Democrats will face arrest upon returning amid the redistricting standoff, vows to order continuous special sessions.\nOpinion 2 days ago It's not just Democrats. Socialist Mamdani's plans should worry Republicans nationwide Democrats' embrace of NYC mayoral candidate who wants to 'seize means of production' signals alarming shift in party ideology. And it has implications for Republicans, too.\nTexas 2 days ago WATCH: Texas state senator argues redistricting showdown could decide balance of power in future US Congress Texas state GOP Sen. Mayes Middleton argues Republican redistricting efforts in his state could be pivotal for Republicans to maintain control in Congress during mid-terms.\nMedia 3 days ago Stephen A. Smith calls out Dems like AOC and Jasmine Crockett as bad look for face of the party Stephen A. Smith blasted progressive Democrats on Bill Maher's \"Real Time\" on Friday, arguing that Republicans are having a \"field day\" with all of the coverage these progressives receive.\nGavin Newsom 3 days ago California launches redistricting fight to ‘nullify’ Texas GOP plan, with Dems poised to gain 5 seats California Gov. Gavin Newsom announced Friday that the Golden State will move forward with a special election in early November to place its own redistricting plan on a ballot measure before voters.\nCulture Trends 3 days ago The fight over charter schools in some of America's rural states Rural Republican states like Idaho, Tennessee and Wyoming overcame GOP resistance to pass universal school choice legislation despite concerns about local schools.\nTexas 4 days ago Party of 'crazies': Dems comply with outrageous redistricting stunts due to primary threats, state rep says Texas Democrats continue exodus to liberal states over GOP redistricting as Republicans launch bribery investigations and President Donald Trump supports the redistricting push.\nMedia 4 days ago Carville doubles down after getting called out for predicting Trump admin collapse, says it’s happening ‘now' Democratic strategist James Carville maintained that the Trump administration is collapsing despite polling showing 44-45% approval ratings during a Dan Abrams podcast appearance.\nDonald Trump 4 days ago EXCLUSIVE: Duncan says Trump’s attacks justify his switch from GOP to Democratic Party: 'He's making my case for me' Former Georgia Republican Lt. Gov. Geoff Duncan considers 2026 gubernatorial run as a Democrat after switching parties and facing GOP expulsion.\nMedia 4 days ago Former Democratic advisor says party's rhetoric on redistricting is getting 'a little out of control' Former Democratic advisor Dan Turrentine warned that his party's dramatic redistricting language could hurt their chances of retaking the House in the 2026 midterm elections.\nPolitics 4 days ago Texas asks Illinois court to enforce arrest warrants for Democratic lawmakers Texas pursues legal action to enlist Illinois assistance in apprehending Texas state Democratic lawmakers hunkered down in the Prairie State.\nGeorgia 4 days ago Former Georgia Lt. Gov. Geoff Duncan floats possible run for office after switching to Democratic Party Former Georgia Lt. Gov. Geoff Duncan said he is considering a run for higher office as a Democrat after announcing he was leaving the Republican Party.\nMedia 4 days ago Carville claims Democrats don't want to associate with anyone from failed 2024 Harris campaign in 2028 Carville told Harris, Walz and other 2024 Democratic campaign associates the party wants to chart new course without them for 2028 presidential election.\nGreg Abbott 5 days ago Gov. Greg Abbott threatens to redistrict 8 seats for GOP if Dem lawmakers don't return to Texas In a preview clip of Friday's \"Ruthless\" podcast,\" Republican Texas Gov. Greg Abbott threatened to create up to eight new seats for his party if Democratic state lawmakers don't return.\nSanctuary Cities 5 days ago $30K in migrant housing aid has Dem gov on hot seat for 'revolving door' policy As Gov. Maura Healey, D-Mass., closes down her state's migrant shelters, she is facing criticism for simultaneously making migrants eligible for tens of thousands in housing aid.\nMedia 5 days ago Carville calls on Democrats to 'unilaterally' pack Supreme Court, create new blue states 'to save democracy' James Carville urged Democrats should open \"Pandora's Box\"with controversial power grabs including statehood for Puerto Rico and D.C. to \"save\" democracy.\nGeorgia 5 days ago Former Georgia Lt. Gov. Geoff Duncan abandons GOP to join Democratic Party Former Georgia Lt. Gov. Geoff Duncan announced he is leaving the GOP and joining the Democratic Party, a move he says has been a long time coming."
    },
    {
      "url": "https://www.foxnews.com/politics/texas-dems-also-skipped-town-2021-avoid-vote-several-caught-covid-19-dc",
      "text": "Texas House Democrats departed the state Sunday in an attempt to halt a redistricting Monday vote, claiming that the legislation is \"using an intentionally racist map\" to undermine the voices of Black and Latino voters in the state of Texas.\nDemocrats’ absence means that Republicans are unable to go ahead with a scheduled vote under House rules, blocking the potential passage of redistricting legislation that would establish a new congressional map that could lead to five new GOP U.S. House seats in the 2026 midterm elections.\n\"This is not a decision we make lightly, but it is one we make with absolute moral clarity,\" state Rep. Gene Wu, the chair of the House Democratic Caucus, said in a statement Sunday.\nTEXAS DEMOCRATS FLEE STATE TO BLOCK TRUMP-BACKED REDISTRICTING VOTE IN DRAMATIC LEGISLATIVE MOVE\nMost of the House Democrats fled to Chicago, while others headed to New York and Boston.\nThe Texas House stipulates that at least 100 members of the 150-member chamber must be present to conduct business, and roughly 50 Democrats are absent — meaning the vote is stalled until they return. It's unclear how Democrats plan to proceed, and Wu told reporters that precise plans were still up in the air.\nThe redistricting legislation would shift Democrat voters from toss-up districts into ones that are more solidly Republican, and also move other Republican voters into districts that lean more toward Democrats — ultimately paving the way for more GOP seats.\nThis isn’t the first time Democrats have fled the state in protest of legislation.\nIn July 2021, more than 50 Democrats also left the state of Texas and headed to Washington, D.C., to tie up Texas legislation that would implement new voting restrictions in the aftermath of President Donald Trump’s loss of the 2020 election, which some Republicans claimed was \"stolen.\"\nSpecifically, the measure Democrats opposed included new voter ID restrictions for those voting by mail and prohibited drive-by voting and extended voting hours. Likewise, the measure included new limitations for those who work at the polls, and barred local election officials from distributing a mail-in ballot to anyone who hadn’t officially requested one.\nDemocrats ultimately returned to Texas weeks later, after multiple members caught COVID-19 while in D.C., and House Republicans finally passed the measure in August 2021 before Texas’ Republican Gov. Greg Abbott signed it into law in September 2021.\nTRUMP, REPUBLICANS RACE TO REDRAW TEXAS CONGRESSIONAL MAP AS DEMOCRATS THREATEN LEGAL WAR\nMeanwhile, Abbott threatened to arrest the Democrats who departed the state Sunday, should they not be back by 3 p.m. Monday when the Texas House reconvenes. Even so, there is no indication of when the Democrats plan to return to Texas.\n\"Rather than doing their job and voting on urgent legislation affecting the lives of all Texans, they have fled Texas to deprive the House of the quorum necessary to meet and conduct business,\" Abbot said in a statement late Sunday.\nCLICK HERE TO GET THE FOX NEWS APP\nThe Texas Democrats have attracted support from Illinois Gov. JB Pritzker, who labeled the Democrats’ decision to flee Texas a \"righteous act of courage,\" and accused Republicans of attempting to silence \"millions of voices, especially Black and Latino voters.\"\n\"Texas Democrats were left with no choice but to leave their home state, block a vote from taking place and protect their constituents,\" Pritzker said in a news conference Sunday.\nFox News’ Elizabeth Pritchett contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/person/greg-abbott",
      "text": "Texas 1 day ago Gov. Abbot still beat Newsom in disaster relief despite Texas Democrats stalling, hiding out Despite Democratic lawmakers fleeing and holding up vital relief efforts, Texas Governor Abbott’s flood relief was faster than California Governor Gavin Newsom’s response to the L.A. wildfires.\nPolitics 2 days ago Abbott vows indefinite special sessions, says fleeing Dems could face arrest ‘for literally years’ Governor Greg Abbott warned Texas Democrats will face arrest upon returning amid the redistricting standoff, vows to order continuous special sessions.\nTexas 4 days ago Texas AG investigates Beto O’Rourke PAC over support for quorum-breaking lawmakers Attorney General Ken Paxton examines PAC connected to Beto O'Rourke for allegedly assisting Texas Democrats who abandoned legislative duties during redistricting fight.\nGreg Abbott 5 days ago Gov. Greg Abbott threatens to redistrict 8 seats for GOP if Dem lawmakers don't return to Texas In a preview clip of Friday's \"Ruthless\" podcast,\" Republican Texas Gov. Greg Abbott threatened to create up to eight new seats for his party if Democratic state lawmakers don't return.\nDonald Trump August 5 WATCH: Trump says FBI 'may have to' help Texas round up AWOL Dem lawmakers The FBI “may have to\" round up a group of Democratic lawmakers who fled Texas to avoid voting on the state’s proposed redistricting map, President Donald Trump told reporters.\nArnold Schwarzenegger August 5 Schwarzenegger pushing back against Newsom redistricting bid in California Schwarzenegger opposes Newsom's plan to eliminate California's independent redistricting commission amid a national battle over congressional district maps.\nTexas August 4 'All-out war': Fleeing Texas Dems side with Newsom as redistricting standoff continues: 'fire with fire' Texas Democrats flee to Illinois to block redistricting vote while California's Newsom vows to counter Republican gerrymandering efforts with similar measures.\nTexas August 4 Texas Dems also skipped town in 2021 to avoid a vote, and several caught COVID-19 in DC Texas House Democrats flee state to block redistricting vote, claiming Republicans are using an intentionally racist map to undermine Black and Latino voters.\nTexas August 4 Abbott orders arrest of AWOL Texas House Dems after warrant issued by House Speaker Gov. Gregg Abbott says state Democrats who skipped town to derail a GOP-backed redistricting effort could face arrest and possibly expulsion from office.\nJ.B. Pritzker August 4 Texas Dems ripped for 'cartoonishly dumb' strategy to flee to blue state notorious for gerrymandering Texas Democratic lawmakers arrive in Illinois after fleeing their state to block a Republican redistricting vote that President Trump says could gain the GOP five new House seats\nTexas August 4 Abbott threatens to remove House Dems from office following dramatic departure to avoid vote Gov. Greg Abbott warned Texas House Democrats that they will be expelled from office if they don't return to vote on a proposed redistricting map.\nDonald Trump July 30 Trump, Republicans race to redraw Texas congressional map as Democrats threaten legal war Texas GOP prepares new congressional maps as House minority leader Jeffries travels to Austin calling Republican redistricting efforts cheating.\nHouse Of Representatives July 26 Texas congressional candidate dragged out, arrested after explosive redistricting hearing: 'It is a shame!' Democratic congressional candidate Isaiah Martin was dragged out of a Texas hearing and arrested after refusing to yield during a fiery speech attacking GOP lawmakers and Trump.\nDonald Trump July 21 Red state map battle heats up as Trump pushes Texas plan to reshape congressional districts President Trump and Texas GOP leaders push for mid-decade redistricting to create five new winnable seats, as both parties engage in mapping strategies to control the House in 2026.\nTexas July 17 Trump pushes Texas Republicans to redraw congressional maps to help defend GOP's House majority President Trump and Texas GOP leaders push for mid-decade redistricting to create five new winnable seats, as both parties engage in mapping strategies to control the House in 2026.\nDonald Trump July 12 Trump’s visit brings hope and unity after deadly flood, Kerrville residents say Kerrville residents who turned out in force Friday to welcome President Donald Trump said his visit brought hope and comfort — and marked an important step in the town’s long road to healing and rebuilding.\nWhite House July 11 Trump, first lady mourn young lives lost in Texas floods, praise first responders during Kerrville roundtable President Donald Trump and first lady Melania Trump met with local, state and federal officials and first responders who are navigating the aftermath of flash floods that devastated the Central Texas community in Kerrville.\nTexas July 9 Gov. Abbott demands comprehensive overhaul of Texas flood warning systems as death toll rises Texas special session called to address flood warning failures and emergency response after Hill Country flooding caused more than 100 deaths.\nPolitics July 7 Texas turns to faith as Gov. Abbott declares 'Day of Prayer' amid devastating floods Texas leaders across political lines urge prayer for flood victims as the state, ranked third most religious in the U.S., copes with devastating floods that have claimed at least 80 lives.\nVoter Fraud Concerns June 18 Red state AG investigating more than 30 potential noncitizens who voted in 2024 election Texas Attorney General Ken Paxton has launched an investigation into 33 potential noncitizens allegedly voting in the 2024 general election.\nGreg Abbott June 11 Texas Gov. Greg Abbott deploys National Guard across state ahead of anti-ICE protests The Texas National Guard is being deployed across the state to keep order amid anti-ICE protests, Gov. Greg Abbott announced on Wednesday.\nOpinion June 5 SEN JOHN CORNYN: Congress must reimburse Texas for Biden’s border security malpractice Congress is called to reimburse Texas for billions spent on border security under Operation Lone Star, highlighting the impact of Biden's immigration policies.\nVirginia June 3 Youngkin sets date for special election to fill deep-blue House seat A special election in Virginia's 11th Congressional District on Sept. 9 will fill the seat of late Rep. Gerry Connolly, with multiple candidates vying for the position.\nTexas May 26 Texas governor makes it 'crystal clear' only U.S. citizens can vote in state elections Texas Gov. Greg Abbott signed a resolution to amend the state constitution, ensuring only U.S. citizens can vote, pending voter approval in November.\nUS Education May 4 Texas Gov. Abbott signs $1 billion voucher program into law, capping off win for school choice advocates Texas Gov. Greg Abbott signed a school choice bill into law on Saturday that will allocate $1 billion for parents to pay for their child's private school tuition.\nGreg Abbott May 1 Republican gov slams city for considering 'antisemitic' resolution, threatens to pull funding Texas Gov. Greg Abbott wrote a letter to the mayor of San Marcos as its council prepares to vote on a Gaza ceasefire resolution. Abbott said the measure was \"antisemitic\" and \"anti-Texas.\"\nIllegal Immigrants April 30 Texas hospitals hit with $122 million bill for illegal immigrants' care in single month Texas hospitals were billed nearly $122 million in health care costs racked up by illegal immigrants for one month last year, according to a new report.\nDOGE April 23 Texas creates its own version of DOGE as Gov. Greg Abbott says regulatory environment is 'too burdensome' Texas has created its own version of DOGE that is intended to slash regulations and get rid of some rules that are too burdensome, officials said Wednesday.\nDOGE April 16 Texas poised to create its own version of DOGE as bill passes both chambers Texas lawmakers passed a bill that would establish a new Department of Government Efficiency (DOGE) following Elon Musk's federal model. The state agency will focus on cutting bureaucracy and improving government services.\nMedia March 26 'The View' hosts call out Jasmine Crockett for mocking Greg Abbott's disability, say it was 'beneath her' \"The View\" co-hosts denounced comments from Rep. Jasmine Crockett, D-Texas, aimed at Texas Gov. Greg Abbott and urged her to publicly apologize."
    },
    {
      "url": "https://abc13.com/post/texas-house-democrats-return-home-second-special-session-abc13-sources-confirm/17515302/",
      "text": "AUSTIN, Texas (KTRK) -- ABC13 has confirmed with multiple sources that House Democrats will return to Texas.\nEyewitness News has not confirmed the date, but we do know that Democrats believe they've accomplished their mission by killing the first special session and by raising national awareness about the mid-decade redistricting effort.\nIt is unclear which day they will be in Austin at the Capitol, but they stress that they will push for Hill Country flooding relief to be the priority.\nAfter our initial reporting online and on television, a spokesperson for the Texas Democratic Caucus sent the following statement to ABC News:\n\"Members are still assessing their strategies going forward and are in a private meeting to make decisions about future plans currently,\" he wrote. \"If and when Texas House Democrats breaking quorum decide to go home is squarely dependent on the actions the Governor, Speaker, and Texas Republicans in charge make with regard to prioritizing flood victims over redistricting that hurts Texans.\"\nAs of 5:30 p.m. on Tuesday, 90 minutes after ABC13 first reported the move, nobody from the HDC had reached out directly to ABC13 to refute our initial reporting.\nThis comes as the House went another session without a quorum on Tuesday, with just 95 members present for the second day in a row. Texas House Speaker Dustin Burrows said that assuming there is no quorum on Friday, the session will end, and a new one will begin.\nHours later, the Senate actually passed a new map that benefits Republicans ahead of the 2026 midterm elections. It's the same map that passed out of committee in the House and precipitated more than 50 House Democrats to break quorum.\nDemocrats in the Senate walked out in protest, but a quorum remained. Sources told ABC13 that Senate Democrats will not break quorum.\nRELATED:\nThis Week in Texas: Redistricting standoff in Austin and an effort to build political consensus\nTexas governor threatens to remove Democrats who left state over Trump-backed redistricting\nFor updates on this story, follow Tom Abrahams on Facebook, X and Instagram."
    },
    {
      "url": "https://www.foxnews.com/category/politics/elections/republicans",
      "text": "VIDEO 2 hours ago Greg Gutfeld: The Democratic Party was 'hijacked' by an 'unhinged' activist class 'The Five' discusses working-class voters being 'fed up' with Democrats as a historically Democratic labor union reportedly donated to Republicans in the upcoming midterms.\nState And Local 6 hours ago DeSantis picks ‘the Chuck Norris of Florida politics’ as new top deputy Florida Gov. Ron DeSantis appoints state Sen. Jay Collins, a combat veteran and amputee known as the \"Chuck Norris of Florida Politics,\" as lieutenant governor.\nMedia 22 hours ago Former Bravo star says Trump voters need to be banned from Mexican restaurants in profane rant “I’ve Had It\" podcast host Jennifer Welch went on an explicit rant calling for Trump voters to be barred from Chinese and Indians restaurants, too, during her show.\nLindsey Graham 1 day ago Trump continues supporting Sen. Lindsey Graham's re-election bid while phoning into Republican event President Donald Trump continues expressing support for Sen. Lindsey Graham as the long-serving Republican lawmaker aims to win re-election\nOpinion 1 day ago Texas gerrymandering battle doesn’t matter to voters. They lose either way Texas gerrymandering fight exemplifies why 78% of Americans believe political elites play by different rules while ignoring kitchen-table issues\nOpinion 2 days ago It's not just Democrats. Socialist Mamdani's plans should worry Republicans nationwide Democrats' embrace of NYC mayoral candidate who wants to 'seize means of production' signals alarming shift in party ideology. And it has implications for Republicans, too.\nTexas 2 days ago WATCH: Texas state senator argues redistricting showdown could decide balance of power in future US Congress Texas state GOP Sen. Mayes Middleton argues Republican redistricting efforts in his state could be pivotal for Republicans to maintain control in Congress during mid-terms.\nOpinion 3 days ago Sydney Sweeney jeans controversy making advertising great again American Eagle's response to criticism of Sydney Sweeney's jeans ad represents a cultural shift away from corporate apologies for marketing campaigns.\nVIDEO 4 days ago Jesse Watters: Republicans are finally 'playing hardball' with direct deposit 'The Five' discusses Texas Democrats blowing off the deadline to return and debate the state's redistricted map.\nMedia 4 days ago Nancy Mace accuses GOP rival of child sex crime leniency as blistering SC gubernatorial race heats up Rep. Nancy Mace accused South Carolina AG Alan Wilson of offering lenient plea deals to violent offenders, escalating their battle for the GOP gubernatorial nomination."
    },
    {
      "url": "https://www.foxnews.com/politics/abbott-vows-indefinite-special-sessions-says-fleeing-dems-could-face-arrest-literally-years",
      "text": "Texas Gov. Greg Abbott warned state Democrats that the threat of arrest upon returning to Texas will last \"for literally years\" on Sunday.\nAbbott made the statement during an interview on \"Fox News Sunday\" with host Shannon Bream. He argued it is within his authority to keep the Texas legislature in a special session indefinitely, extending the penalties for Democrats who fled the state.\n\"I'm authorized to call a special session every 30 days. It lasts 30 days. And as soon as this one is over, I'm gonna call another one, then another one, then another, then another one,\" Abbott said.\n\"If they show back up in the state of Texas, they will be arrested and taken to the Capitol. If they want to evade that arrest, they're gonna have to stay outside of the state of Texas for literally years,\" he added.\nTEXAS DEMOCRATS FLEE STATE TO BLOCK TRUMP-BACKED REDISTRICTING VOTE IN DRAMATIC LEGISLATIVE MOVE\nThe warning comes as Abbott is seeking to remove delinquent Democrats from office, arguing they have abdicated their roles under the state constitution.\n\"We have a situation where lawmakers are violating the law in Article 3 of the Texas Constitution where they are required to act on bills. Because they're violating that constitutional mandate, that means they are not fulfilling their oath of office, and they can be removed from office in this legal action that I'm taking,\" he said.\nTRUMP, REPUBLICANS RACE TO REDRAW TEXAS CONGRESSIONAL MAP AS DEMOCRATS THREATEN LEGAL WAR\nAt least 100 members of the 150-member Texas House must be present to conduct business, and approximately 50 of the Democrats have left. Abbott says their commitment to voting as elected state officials is a duty and is \"not optional.\"\nCOLBERT CONFRONTS JB PRITZKER WITH MAP SHOWING ILLINOIS GERRYMANDERING\nMost of the Democrats have set up in Illinois and New York, where they have received the backing of Democratic governors J.B. Pritzker and Kathy Hochul, respectively.\nAlongside Abbott's extended threat of arrest, the Republican governor has also threatened to increase the redistricting margin for his party if lawmakers don't return to Austin.\nCLICK HERE TO GET THE FOX NEWS APP\n\"What I'm thinking now is that if they don't start showing up, I may start expanding,\" Abbott said during an appearance on the \"Ruthless\" podcast. \"We may make it six or seven or eight new seats we're going to be adding on the Republican side.\"\nFox News' Joseph Wulfsohn contributed to this report"
    }
  ],
  "argos_summary": "Texas House Democrats plan to return to the state after fleeing to block a Republican-led redistricting vote, which they argue undermines Black and Latino voters. Their absence has stalled legislative proceedings, as a quorum is required for the House to conduct business. Governor Greg Abbott has threatened to arrest the Democrats upon their return and has indicated he will call consecutive special sessions to push through redistricting efforts that could benefit the GOP in upcoming elections.",
  "argos_id": "T4239H50H"
}