{
  "url": "https://www.bloomberg.com/news/audio/2025-08-12/stock-movers-coreweave-cava-etoro-podcast?srnd=phx-markets",
  "authorsByline": "Bloomberg",
  "articleId": "8cb43dc395b9424e8dbaf09d4cae431d",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ikP8v_9GZHFM/v0/500x500.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:30:19.435000+00:00",
  "addDate": "2025-08-12T21:37:21.957309+00:00",
  "refreshDate": "2025-08-12T21:37:21.957311+00:00",
  "score": 1.0,
  "title": "Stock Movers: CoreWeave, Cava, eToro",
  "description": "Bloomberg journalists discuss today's biggest winners and losers in the stock market. Listen for analysis on the companies making news on Wall Street.",
  "content": "On this edition of Stock Movers: - CoreWeave (CRWV) shares dropped after the company posted steeper losses as it continued to build to meet demand from artificial intelligence developers. The company’s shares fell 5% in after-hours trading. Second-quarter adjusted net losses in the period steeped significantly to $130.8 million, compared to $5 million last year, it said in a statement Tuesday. Analysts had projected losses of $96.3 million. “We are scaling rapidly as we look to meet the unprecedented demand for AI,” Chief Executive Officer Michael Intrator said in the statement. Revenue tripled to $1.21 billion, the company said, ahead of expectations for $1.08 billion. - Cava Group (CAVA) shares plummeted after the company trimmed its annual sales outlook after a sharp deceleration in the second quarter as skittish diners spent less on restaurant meals, showing the pressure the brand is facing to keep up with its speedy growth in recent years. Cava’s shares fell about 23% in postmarket trading in New York on Tuesday, which would be its largest decrease on record if it holds through Wednesday’s close. The company’s stock declined roughly 25% this year through Tuesday’s close, compared with the 3.8% slump in the S&P 400 Consumer Discretionary Index. The fast-casual Mediterranean chain now says sales at established locations will expand 6% at most this year, while it previously forecast an increase of as much as 8%. The cut follows Cava’s slowest advance for that metric going back to the first quarter of 2021, according to data compiled by Bloomberg. - eToro (ETOR) shares fell after the trading and investment platform reported second-quarter results. TD Cowen called the print “uneven” as the adjusted earnings per share beat was driven by a low tax rate.",
  "medium": "Article",
  "links": [
    "https://www.bloomberg.com/podcasts/series/stock-movers"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "share",
      "weight": 0.08441016
    },
    {
      "name": "last year",
      "weight": 0.077246934
    },
    {
      "name": "recent years",
      "weight": 0.07520891
    },
    {
      "name": "steeper losses",
      "weight": 0.071250126
    },
    {
      "name": "Chief Executive Officer Michael Intrator",
      "weight": 0.070249006
    },
    {
      "name": "Cava Group",
      "weight": 0.06801538
    },
    {
      "name": "postmarket trading",
      "weight": 0.06770599
    },
    {
      "name": "Second-quarter adjusted net losses",
      "weight": 0.066962264
    },
    {
      "name": "Cava",
      "weight": 0.063150816
    },
    {
      "name": "losses",
      "weight": 0.062977344
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98388671875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96533203125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.896484375
    }
  ],
  "sentiment": {
    "positive": 0.01830728,
    "negative": 0.9253299,
    "neutral": 0.056362864
  },
  "summary": "The following day, CoreWeave (CRWV) shares fell after the company reported steeper losses as it continues to build to meet demand from artificial intelligence developers. The company's second-quarter adjusted net losses rose significantly to $130.8 million, compared to $5 million the previous year. Cava Group (CAVA) also dropped sharply after cutting its annual sales outlook due to decreased consumer spending. The fast-casual restaurant chain now expects sales at established locations to increase by 6% this year, down from an expected increase of 8%. eToro's shares also fell after its second-month results.",
  "shortSummary": "Shares of CoreWeave, Cava Group, and eToro fell after reporting significantly lower losses and a slower sales outlook, despite strong financial performance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1399c8b1b51644cdb0568d0c748b854d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "CoreWeave (CRWV) shares fell 5% after reporting a significant increase in second-quarter losses to $130.8 million, despite tripling revenue to $1.21 billion. Cava Group (CAVA) experienced a 23% drop in shares after lowering its annual sales outlook due to decreased consumer spending, marking its largest potential decline on record. eToro (ETOR) shares also declined following mixed second-quarter results, with analysts describing the earnings report as 'uneven'.",
  "argos_id": "T60U4DCUT"
}