{
  "url": "https://www.nytimes.com/athletic/6550199/2025/08/12/chargers-training-camp-cornerback-competition/",
  "authorsByline": "Daniel Popper",
  "articleId": "de65fb6f3316407f8179cd6014379622",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/12211525/GettyImages-2226252852-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:20:24+00:00",
  "addDate": "2025-08-13T01:30:48.136578+00:00",
  "refreshDate": "2025-08-13T01:30:48.136580+00:00",
  "score": 1.0,
  "title": "Taking stock of Chargers’ ‘really competitive’ cornerback competition",
  "description": "Najee Harris also made some progress in his return from his fireworks-related eye injury, running with a football off to the side.",
  "content": "EL SEGUNDO, Calif. — The Los Angeles Chargers are now 18 practices into training camp, and the competition for the starting cornerback spots remains fluid.\n\nWhat is certain: Defensive coordinator Jesse Minter will be leaning heavily into three-safety packages this season, as he did in 2024, with Derwin James Jr., Alohi Gilman and Elijah Molden all on the field together. That includes five defensive back packages with James at nickel. That includes six defensive back packages with James at dime ’backer.\n\nWhat is not certain: Who exactly is going to be playing alongside the safeties in various packages, from base to nickel to dime.\n\nMinter said late last week that the Chargers are “not really that close” to settling on defined groupings at corner.\n\n“I think that there’s a bunch of guys doing some good things,” Minter added. “There are some inconsistencies there that we’re trying to kind of weed out.”\n\nThe Chargers returned to practice Tuesday after their preseason win over the New Orleans Saints, and Minter continued to rotate heavily at cornerback, a trend through this training camp.\n\nThe cornerback battle had seemed like a three-man race through the early stages of camp, with Tarheeb Still, Cam Hart and Donte Jackson earning a majority of the first-team reps. Late last week, that changed, as Benjamin St-Juste started rotating in at outside cornerback with the first team. And St-Juste continued to get reps with the first-team offense Tuesday.\n\n“Ben is on a really good trajectory,” Minter said. “I love how he plays, love his competitiveness.”\n\nA roadblock in evaluating the rotation has been the number of injuries. Still, Jackson, Hart and St-Juste have all missed practice time this camp. Still and St-Juste were not healthy enough to play in the preseason opener in the Hall of Fame Game. St-Juste missed his first practice July 22 and sat out of team drills for more than a week. Hart has missed the last two practices and did not play against the Saints.\n\nEven undrafted rookie Nikko Reed, who was ascending early in camp, has missed time with an injury. Reed was making a case for the 53-man. He had started working in occasionally with the first-team defense. But he did not practice last week and did not dress for the Saints game. Reed returned to team drills Tuesday and worked with the second team.\n\nDeane Leonard missed multiple practices early in camp with an injury. He returned, but now he is out of practice again after suffering another injury in the Saints game. Ja’Sir Taylor is the only veteran cornerback to not miss any practice time this camp. At this stage, Taylor is projected as a depth piece who will have a major role on special teams, most notably as a starting gunner on punt.\n\n“You really hope that maybe a guy or two does something and gets on a roll and it’s like, hey, we got to leave this guy where he’s at,” Minter said. “So we’ll kind of just try to let that sort out, get everybody different reps in different positions in different groupings right now.”\n\nThe spots are there for the taking, but no player has stacked enough good days to secure a full-time starting job. Tuesday’s practice was another example of some of the “inconsistencies” Minter referred to last week.\n\nSt-Juste was in tight coverage on a red-zone go ball to rookie receiver Dalevon Campbell down the right sideline, forcing an incompletion. He was also beaten badly by receiver Ladd McConkey on a slant route.\n\nJackson shut down a red-zone go ball to Brenden Rice down the left sideline. He stuffed a Kimani Vidal run. Vidal tried to bounce to the outside left, and Jackson was in perfect position to protect the edge. Jackson also gave up two second-and-10 conversion receptions, one to Rice on a dig and one to Campbell on a slant.\n\nStill was quick to contest a pass to Rice on a slant route early in practice. Rice made the catch, but Still drove him back after a short gain. Later on, Still was late to react to a deep ball to tight end Thomas Yassmin down the left sideline.\n\n“I don’t think we’re anywhere near a true pecking order in that room yet,” Minter said.\n\nJames’ versatility creates numerous permutations as far as how the Chargers structure their secondary from down to down. If James is at nickel or at safety in the base defense, the Chargers have two open spots at cornerback on the outside. If James is at safety in nickel packages or playing dime ’backer, the Chargers have three open spots, two on the outside and one at nickel.\n\nStill and Taylor can play both nickel and on the outside. St-Juste, Hart and Jackson have played solely on the outside in camp so far.\n\nMore time is needed to determine how all these pieces will fit together. Under Jim Harbaugh, the Chargers have not shied away from playing rotations at positions within individual games. They could feature some sort of in-game rotation at corner, especially early in the season.\n\n“It’s another position where we have depth,” Minter said. “Just try to take advantage of it. It’s situation-based, our personnel-based, their personnel-based. I think there’s a lot of factors in choosing those guys.”\n• McConkey was back in team drills Tuesday for the first time since July 27. He caught four passes in team drills from quarterback Justin Herbert. McConkey spoke after practice and declined to reveal the nature of his injury. When asked how close he is to 100 percent, “I feel like I’m there now. It’s just about building everything back up and … getting my conditioning back to where it needs to be.”\n• McConkey and receiver Keenan Allen were both on the field for multiple reps with the first-team offense. Allen played on the outside on those reps.\n\n“It’s really the great thing about our offense, is that we can all move around,” McConkey said. “Whoever is out there, we can all rotate and be in different positions and scheme it up the way they want.”\n\nRookie KeAndre Lambert-Smith also got reps in the slot Tuesday.\n• Joe Alt, who has moved to left tackle after Rashawn Slater’s season-ending knee injury, had an outstanding practice as a run blocker Tuesday. Alt’s athleticism and body control in space were on display on multiple runs. He cleared the way for two explosive runs in one period, one from Omarion Hampton and the other from Vidal. Hampton found space on two more runs behind Alt later in practice, and the rookie also had a red-zone touchdown run from 5 yards out.\n• Trey Lance did not participate in team drills Tuesday. Offensive coordinator Greg Roman said Lance sitting out was not injury-related. Roman added that “there were some things” the Chargers “wanted to get done” with Herbert in Tuesday’s practice. Factoring in all team drills, Herbert got 43 reps in the practice. At one point, the Chargers ran 50 straight plays of 11-on-11. Herbert was the first quarterback up, followed by Taylor Heinicke and DJ Uiagalelei, in order.\n\nRoman said the backup quarterback battle between Lance and Heinicke is “wide open.”\n• Chargers who did not practice Tuesday: receiver Derius Davis, Hart, safety RJ Mickens, Leonard, running back Jaret Patterson, cornerback Jordan Oladokun, cornerback Eric Rogers, receiver Jaylen Johnson, offensive lineman Branson Taylor, right guard Mekhi Becton, receiver Dez Fitzpatrick and receiver Jalen Reagor.\n• Becton has not practiced since July 28. He was working out in the weight room at the start of Tuesday’s practice. Roman said Becton will be “fine” and is “on schedule” to be ready for Week 1. Roman later added that he is “not putting anything in concrete” when it comes to Becton’s timetable.\n• The first-team offensive line Tuesday: LT Alt, LG Zion Johnson, C Bradley Bozeman, RG Jamaree Salyer and RT Trey Pipkins III. Andre James also got some first-team reps at center, rotating in with Bozeman, who missed two practices last week.\n• The Chargers did not feature any starter-on-starter reps in the heavy-workload practice. The starting offense faced the reserve defense. The starting defense faced the reserve offense. Not surprisingly, the Chargers’ star defenders had a productive day in the backfield. Edge rusher Khalil Mack had two sacks and two tackles for loss in the run game. Derwin James had two sacks and a tackle for loss in the run game. Linebacker Daiyan Henley also had two run stuffs.\n• Tight end Oronde Gadsden, receiver Quentin Johnston and tight end Tyler Conklin all caught red-zone touchdowns from Herbert. Johnston also had an explosive reception from Herbert earlier in practice on a deep crossing route.\n• Linebacker Kana’i Mauga had sacks on back-to-back plays while facing the first-team offense. Minter seemed to be getting a little deeper into his playbook Tuesday. Vidal missed a pass protection pickup on the first sack. Running back Hassan Haskins missed a pickup on the second sack.\n• Najee Harris, who remains on the non-football illness list, showed progress in his return from an eye injury. Harris was jogging early in practice. Later in practice, he was running with a football in his hands in between cones, which were set up to mimic offensive linemen.",
  "medium": "Article",
  "links": [
    "https://t.co/wtEshKLdvG",
    "https://www.nytimes.com/athletic/6541689/2025/08/08/chargers-rashawn-slater-injury-recovery/",
    "https://twitter.com/chargers/status/1955394111936110675?ref_src=twsrc%5Etfw",
    "https://t.co/U4KrMYe77R",
    "https://twitter.com/chargers/status/1955395491212169721?ref_src=twsrc%5Etfw",
    "https://www.nytimes.com/athletic/6545973/2025/08/10/chargers-preseason-saints-caleb-murphy/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "practice time",
      "weight": 0.07187677
    },
    {
      "name": "multiple practices",
      "weight": 0.069435
    },
    {
      "name": "practice",
      "weight": 0.0670349
    },
    {
      "name": "team drills",
      "weight": 0.061795432
    },
    {
      "name": "Chargers",
      "weight": 0.058636427
    },
    {
      "name": "rookie receiver Dalevon Campbell",
      "weight": 0.054645915
    },
    {
      "name": "receiver Ladd McConkey",
      "weight": 0.05297752
    },
    {
      "name": "multiple runs",
      "weight": 0.052900754
    },
    {
      "name": "special teams",
      "weight": 0.052668877
    },
    {
      "name": "receiver Jaylen Johnson",
      "weight": 0.052223593
    }
  ],
  "topics": [
    {
      "name": "NFL"
    },
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97802734375
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.95947265625
    }
  ],
  "sentiment": {
    "positive": 0.08948432,
    "negative": 0.53834355,
    "neutral": 0.3721721
  },
  "summary": "The Los Angeles Chargers' cornerback competition remains fluid, with 18 practices into training camp. The team's defensive coordinator, Jesse Minter, has been rotating heavily at cornerback, with Derwin James Jr., Alohi Gilman and Elijah Molden all on the field together. Despite this, Minter remains hopeful about finding a full-time starting spot. The number of injuries has hampered the evaluation of the rotation, with Tarheeb Still, Cam Hart and Donte Jackson all missing practice time. Deane Leonard missed multiple practices early in camp due to an injury, but is now out of practice again after suffering another injury. Ja'Sir Taylor is the only veteran cornerback to not miss any practice time this camp.",
  "shortSummary": "The Los Angeles Chargers' cornerback competition remains competitive, with multiple injuries and inconsistent performances, prompting coach Jesse Minter to shift focus to three-safety packages.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9e85c8c396454a7ca81c5726a2965406",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6545973/2025/08/10/chargers-preseason-saints-caleb-murphy/",
      "text": "INGLEWOOD, Calif. — The Los Angeles Chargers beat the New Orleans Saints, 27-13, on Sunday at SoFi Stadium in their second game of the preseason.\nCoach Jim Harbaugh highlighted a few players by name in his postgame news conference: cornerback Eric Rogers, edge rusher Caleb Murphy, linebacker Marlowe Wax, receiver Dalevon Campbell, quarterback Trey Lance and safety Kendall Williamson.\nAdvertisement\n“It just brings a smile to my face,” Harbaugh said. “I love guys that play like they want to be on this team. They want to show that they belong.”\nLet’s dive into some of the standout performances from Sunday and what those mean as the Chargers inch closer to finalizing their 53-man roster.\nMurphy is making his case\nThe Chargers entered training camp last month with the top three spots in their edge rusher group solidified: Khalil Mack, Tuli Tuipulotu and Bud Dupree. They drafted Kyle Kennard in the fourth round in April, and it seemed Kennard had an inside track to earning the fourth spot. Murphy has flipped that expectation upside down.\nMurphy has been working on the Chargers’ core-four special teams units throughout camp and the preseason. He has made plays on special teams in each of the first two preseason games. He assisted a tackle that led to a forced fumble on the opening kickoff of the Hall of Fame Game. Murphy added a tackle Sunday in punt coverage. His capabilities in this phase were already pushing him toward the 53-man roster, as coordinator Ryan Ficken looks for reliable pieces.\nMurphy’s performance this preseason has stretched beyond special teams, though. He is showing up on defense. And now Murphy is poised not just to make the 53-man but has a chance to jump Kennard on the depth chart and be the fourth edge rusher behind Mack, Tuipulotu and Dupree. Kennard has not practiced since the Hall of Fame Game, and he did not dress Sunday.\nMurphy officially had two sacks against the Saints, including a sack-fumble early in the second quarter that defensive lineman Justin Eboigbe recovered. He was dominant in one-on-one situations. Harbaugh said he believed Murphy should have been credited with three sacks. Murphy agreed with Harbaugh. Wax was credited with a sack on a third-and-9 in the third quarter, but it was really Murphy who finished the play on Saints quarterback Tyler Shough.\n“He’s making a good case,” Harbaugh said of Murphy. “A really good case.”\nlet's goooooo\n📺 | CBS2 LA pic.twitter.com/VxwdfHHQQ0\n— Los Angeles Chargers (@chargers) August 10, 2025\nThis game was a step forward for Murphy. Against the Detroit Lions in the Hall of Fame Game, Murphy flashed as a run defender. On Sunday, he produced in the pass rush.\n“Definitely feels like things are clicking,” Murphy said.\nHarbaugh said he predicted Murphy’s big game to the team. Harbaugh made Murphy a game captain for the coin toss.\nAdvertisement\nMurphy joined the Chargers practice squad in October, after he was waived by the Tennessee Titans. He was active for three games with the Chargers in the middle of the season, playing 12 defensive snaps and 37 special teams snaps.\nWhen asked in the postgame locker room about the case he is making for the 53-man, Murphy replied, “That’s not my job. My job is to come out here and perform. Just do my job to the best of my ability, and that’s that.”\n‘Rocket’ launches\nRunning back Najee Harris remains on the non-football injury list with an eye injury he sustained in a July 4 fireworks accident. With Harris out, rookie Omarion Hampton has been the clear lead back in training camp practices. The battle behind Hampton has turned into an interesting one. If Harris misses any regular-season action, the Chargers will need a second back to pair with Hampton within the offense.\nRaheim Sanders, who goes by the nickname Rocket, is now firmly in that mix.\nSanders led all running backs Sunday with 42 rushing yards on 10 carries. His vision and patience jumped out in the game, two attributes he had shown in practice. Sanders had a run of 14 yards in the third quarter. He let the blocking develop in front of him before hitting the hole and finding open field to his left. Sanders has a great feel of how to change speeds to make the most of his blocking. He also can be physical and drive through contact when necessary.\nSanders capped his day with an 11-yard touchdown run in the fourth quarter, extending the Chargers’ lead to 14 points. This is exactly what coaches want to see in a four-minute situation. The Chargers got the ball back with 3:38 remaining in a one-score game. They drove 65 yards on four plays to put it away. Rookie quarterback DJ Uiagalelei connected with Campbell on a 51-yard go ball to expedite the drive.\nAdvertisement\nOn the touchdown, Sanders showed off his vision. He started up the middle before bouncing to the outside and winning the race to the corner of the end zone. Sanders said after the game that he knew the bounce to the right would be available based on the Saints’ front. He also drew the Saints safeties into the box by initially starting up the middle, which left no one on the back end to cut off his angle to the end zone.\nrocket sanders 🚀\n📺 | CBS2 LA pic.twitter.com/mQJCYaKnL2\n— Los Angeles Chargers (@chargers) August 10, 2025\nSanders said he “blacked out” as soon as he crossed the goal line. He had not played in a real football game since Nov. 30, when his South Carolina Gamecocks beat Clemson. He had not scored a touchdown since a Nov. 23 game against Wofford.\n“I trusted my read,” Sanders said. “After that, it was history.”\nSanders is competing with Hassan Haskins, Kimani Vidal and Jaret Patterson for that No. 2 spot behind Hampton. Haskins also ran well Sunday, finishing with 33 yards on six carries. Vidal had 16 yards on six carries. Patterson did not play after suffering an injury in Thursday’s practice.\n“There’s a lot of good players there,” Harbaugh said. “They’re showing that.”\nSanders participated in the first practice of training camp. But after suffering an injury, he missed the next eight practices and did not play in the Hall of Fame Game.\nNow he is back and performing, and he could be carving out a role on offense — especially if Harris misses time early in the season. Sanders also made a quality adjustment on a third-and-2 conversion reception in the second quarter.\n“Every opportunity I get,” Sanders said, “just take advantage of it.”\nLance uses his legs\nLance started the Hall of Fame Game and was very solid throwing the ball in the win. He came off the bench Sunday, replacing Taylor Heinicke, and showed off a different element to his game.\nAdvertisement\nLance led the Chargers in rushing with 48 yards on seven carries. The protection up front was spotty, but Lance was able to mitigate that by escaping the pocket and scrambling to keep drives alive.\nLance engineered a 14-play, 85-yard touchdown drive late in the second quarter. On back-to-back plays, Lance scrambled for first downs. The first came on a third-and-7 and went for 14 yards. The second scramble went for 17 yards. Both were down the left sideline. Lance played on time and in structure in the Hall of Fame Game. On Sunday, he was forced to improvise when the protection broke down around him, and he created explosive plays with his legs.\n“It helps me out a lot getting out of sticky situations,” Lance said.\nLance capped the drive with a 5-yard touchdown run.\n“He was a good presence and poised and in control,” Harbaugh said. “You make the right decisions. That’s really what it comes down to. Not everybody can do it.”\ntrey lance is quick\n📺 | CBS2 LA pic.twitter.com/qXoE8bW9BK\n— Los Angeles Chargers (@chargers) August 10, 2025\nHeinicke started Sunday’s game after not playing in the Hall of Fame Game. He completed just 1 of 5 pass attempts for 8 yards. He missed a potential explosive play when he threw high to tight end Tyler Conklin off play action on the opening drive of the game.\nLance has looked like the better quarterback. He is trending toward being Justin Herbert’s backup this season.\nWhen asked about that battle, Harbaugh said, “I’m not going to talk about a second-string quarterback competition.”\nRogers emerges\nRogers, an undrafted rookie, had two interceptions in Sunday’s game. The first came on a third-and-6 in the third quarter, and it showed Rogers has a chance to play at this level. The Chargers were in a Cover 3 look, and Rogers was responsible for the deep outside third to his side. However, from his depth in the zone, he could see Shough gearing up to throw an out route to receiver Dante Pettis to the right sideline.\nAdvertisement\nRogers trusted his instincts and went to make a play, even though tight end Treyton Welch was running a corner route behind him into his zone. Rogers timed his break perfectly. He jumped the pass attempt to Pettis, picked it off and tumbled to the ground. He was not touched. He got up and returned it 43 yards for a touchdown.\n“That was as good of a play as I’ve ever seen,” Harbaugh said.\nhouse call 📞\n📺 | CBS2 LA pic.twitter.com/ZIEqOH745C\n— Los Angeles Chargers (@chargers) August 10, 2025\nRogers intercepted quarterback Jake Haener in the fourth quarter. He also had a pass breakup on a third-and-7 in the fourth quarter.\nLate in the game, Rogers injured his ankle while playing on the kickoff team. He was on crutches in the locker room after the game.\n(Photo of Caleb Murphy: Kirby Lee / Imagn Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6541689/2025/08/08/chargers-rashawn-slater-injury-recovery/",
      "text": "EL SEGUNDO, Calif. — Rashawn Slater’s path to the very top of his position was rooted in and fueled by the work.\nIt never stopped.\nNot when he was waking up at 6 a.m. on Saturdays as a sophomore in high school to train in the Houston heat.\nNot when his family went on a cruise after his freshman year at Northwestern, and Slater was doing pass protection sets on the deck while other cruise-goers looked on in disbelief.\nAdvertisement\nNot when he was drafted with the No. 13 pick in 2021. Not when he earned second-team All-Pro as a rookie. Not when he tore his bicep in 2022 and missed 14 games, including the Chargers’ first playoff appearance in four years.\nNot when he became the highest-paid offensive lineman in NFL history.\nAnd it won’t stop now. That can be guaranteed. Slater finds comfort in the work. Always has. Always will. Even as he faces this overwhelming challenge.\nThe unthinkable happened Thursday morning on the practice fields at The Bolt, the Los Angeles Chargers’ practice facility. Less than two weeks after signing a $114 million contract extension while surrounded by family, Slater tore his patellar tendon. He dropped into pass protection, a movement he has repeated thousands and thousands of times over his football life. He took a shove from edge rusher Tuli Tuipulotu. He planted his left foot. His leg gave out.\nSlater will undergo surgery and be placed on injured reserve. He will miss the 2025 season. What awaits is a recovery time of 10 to 12 months, according to Dr. Carlos Uquillas, an orthopedic surgeon at Cedars-Sinai Medical Center and a team physician for the Los Angeles Angels.\n“A lot of people do return from this injury,” Uquillas said. “Sometimes not at the same level.”\nThe Chargers are familiar with this injury. Cornerback J.C. Jackson tore his patellar tendon in Week 7 of 2022, eight months after he signed an $82.5 million free-agent contract with the team. Jackson suffered the injury in November. He was back for Week 1 of the 2023 season. Jackson played two games before he was traded to the New England Patriots. He has been out of the league since the end of the 2023 season.\nAccording to Uquillas, though, the recovery for “speed players” like receivers, running backs and defensive backs tends to be “a little harder” compared to linemen.\nAdvertisement\n“For linemen,” Uquillas said, “I think it’s potentially a little bit easier.”\nCleveland Browns tackle Jack Conklin, for instance, tore his patellar tendon in late November 2021. He returned in Week 3 of 2022 and played more than 900 snaps over 14 starts.\nSo there is some hope for 2026.\nIn this coming season, the Chargers will have to find a way forward without a franchise cornerstone.\nWhat coach Jim Harbaugh has brought, more than anything, is hope. Hope that organizational demons will be vanquished once and for all. Hope for competence and sustained success and, yes, finally, a Chargers Super Bowl victory.\nThis feels gut-wrenchingly familiar for a team that has an incomprehensible injury history. One could practically see and hear the hope dissipating into the California sunshine Thursday morning. How Harbaugh navigates this will reveal what he is truly building, or not building, with the team.\nThe positive: The Chargers have a rising star in Joe Alt who can take over for Slater at left tackle.\nAnother positive: The situation could have been worse for Slater. He could have gotten hurt before he signed his deal.\nAfter skipping organized team activities, Slater participated fully in three minicamp practices from June 10 to 12. He still had not signed his contract. Slater reported for camp on July 16. He participated in the first two training camp practices on July 17 and 18.\nSlater avoided the worst-case scenario in these five practices. He now has the financial security that he deserved and earned. It is an important example of why players — especially elite players — should exercise all their leverage in contract negotiations. Such players can be labeled in negative ways. But NFL owners are doing everything they can, all the time, to maximize their profits. Players should be doing the same. Their bodies are their businesses. Protecting that business does not make a player a bad teammate. It is necessary.\nAdvertisement\nAccording to Over the Cap, Slater was fully guaranteed $56 million at signing — his $29 million signing bonus plus his $27 million in base salary and roster bonuses over the next two seasons. If he is on the roster on March 15, 2026, his $26 million in 2027 base salary will become guaranteed.\nSlater has set himself and his family up for life. He toiled in the work to make that happen.\n“It doesn’t change anything,” Slater said a day after signing the deal. “I still got to wake up and give it my all every day.”\nSlater will have to dig more deeply than he ever has in the months ahead. The patellar tendon attaches the knee to the shin and, thus, the quad muscle to the shin. Without the tendon, Uquillas said, “you have no ability to extend your knee.”\nAtrophy will occur without movement.\n“It takes just a really long time to build the bulk and that strength back up,” Uquillas said. “Left tackles, their quads are massive. So to get back to that level takes a ton of time and effort.”\nSlater has drawn from a seemingly limitless pool of effort to make it here.\nHe has a ton. And quite a bit more.\n“I’ve been an underdog all my life,” Slater said the day he was drafted in 2021. “I’ve always had that chip on my shoulder, trained with that chip on my shoulder and played with that chip on my shoulder. It’s not leaving because that’s just part of who I am now.”\n(Top photo: Eric Thayer / Associated Press)"
    }
  ],
  "argos_summary": "The Los Angeles Chargers are navigating a competitive training camp, particularly in the cornerback position, where injuries have complicated evaluations. Defensive coordinator Jesse Minter is utilizing three-safety packages, but no cornerback has secured a starting role yet. Meanwhile, standout performances from players like edge rusher Caleb Murphy and running back Raheim Sanders are emerging as the team prepares for the upcoming season, despite the significant injury setback of left tackle Rashawn Slater, who will miss the entire season due to a torn patellar tendon.",
  "argos_id": "T8E94WW3X"
}