{
  "url": "https://www.startribune.com/trump-administration-calls-out-human-rights-records-of-some-nations-accepting-deported-migrants/601453800",
  "authorsByline": "MATTHEW LEE",
  "articleId": "30f66a6aeba0492a8ba3e8fe7aaea3cc",
  "source": {
    "domain": "startribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MN",
      "county": "Hennepin County",
      "city": "Minneapolis",
      "coordinates": {
        "lat": 44.9772995,
        "lon": -93.2654692
      }
    }
  },
  "imageUrl": "https://www.startribune.com/200.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:01:00.943000+00:00",
  "addDate": "2025-08-12T19:12:53.662249+00:00",
  "refreshDate": "2025-08-12T19:12:53.662253+00:00",
  "score": 1.0,
  "title": "Trump administration calls out human rights records of some nations accepting deported migrants",
  "description": "The Trump administration on Tuesday released human rights reports for countries worldwide, which eliminate mentions of discrimination faced by LGBTQ people, reduce a previous focus on reproductive rights and criticize restrictions on political speech by U.S. allies in Europe that American officials believe target right-wing politicians.",
  "content": "Charges: Girl, 15, taken by stranger to his northern Minnesota home and raped\n\nDining al fresco? Here are the best Twin Cities parks with amenity-filled picnic spots.\n\n4 arrests after home reportedly owned by Brad Pitt was ransacked by burglars, police say\n\nSpirit Airlines sounds the alarm on its future ability to stay in business\n\nBefore killing 3 in a Target parking lot, suspect had many run-ins with Texas police\n\nAnother defendant pleads guilty in massive Feeding Our Future fraud case; more than 50 convicted\n\nZelenskyy says Putin wants the rest of Ukraine's Donetsk region as part of a ceasefire\n\nWASHINGTON — The Trump administration on Tuesday released human rights reports for countries worldwide, which eliminate mentions of discrimination faced by LGBTQ people, reduce a previous focus on reproductive rights and criticize restrictions on political speech by U.S. allies in Europe that American officials believe target right-wing politicians. The reports, which cover 2024 before President Donald Trump took office, reflect his administration's focus on free speech and protecting the lives of the unborn. However, the reports also offer a glimpse into the administration's view of dire human rights conditions in some countries that have agreed to accept migrants deported from the United States under Trump's immigration crackdown. ''This year's reports were streamlined for better utility and accessibility in the field and by partners,'' the State Department said. The congressionally mandated reports in the past have been frequently used for reference and cited by lawmakers, policymakers, academic researchers and others investigating potential asylum claims or looking into conditions in specific countries. The reports were delayed by the Trump administration's changes The reports had been due to be released in March. The State Department said in an overview that the delay occurred because the Trump administration decided in March to ''adjust'' the reports, which had been compiled during the Biden administration. Among other deletions, the reports do not include accounts from individual abuse survivors or witnesses. ''Frequently, eyewitnesses are intimidated or prevented from reporting what they know,'' the overview said. ''On the other hand, individuals and groups opposed to a government may have incentive to exaggerate or fabricate abuses. In similar fashion, some governments may distort or exaggerate abuses attributed to opposition groups.'' Human rights groups decried the changes in focus and omissions of certain categories of discrimination and potential abuse.\n\nThe new reports ''reveal a disturbing effort by the Trump administration to purposefully fail to fully capture the alarming and growing attacks on human rights in certain countries around the globe,'' Amnesty International said in a statement. The reports do follow previous practices in criticizing widespread human rights abuses in China, Iran, North Korea and Russia. Laying out the poor human rights records of countries accepting migrant deportees Although such deportations did not begin until after Trump took office, the reports, with one notable exception, detail general poor human rights conditions in many of the countries that have agreed to accept migrants, even if they are not citizens of that nation. The exception is El Salvador, which was the first of several countries in Latin America and Africa to agree to accept non-citizen migrant deportees from the U.S. Despite claims from rights advocates to the contrary, the report about the country says ''there were no credible reports of significant human rights abuses'' in El Salvador in 2024 and that ''the government took credible steps to identify and punish officials who committed human rights abuses.'' Human rights groups have accused authorities of abuses, including at a notorious prison where many migrants are sent.\n\nHowever, for Eswatini — a small country in Africa formerly known as Swaziland — South Sudan and Rwanda, the reports paint a grimmer picture. All have agreed to accept third-country deportees from the United States. In all three countries, the reports noted ''significant human rights issues included credible reports of arbitrary or unlawful killings, torture and cruel, inhuman, or degrading treatment or punishment … serious restrictions on freedom of expression and media freedom, prohibiting independent trade unions or significant or systematic restrictions on workers' freedom of association.'' Those governments ''did not take credible steps or action to identify and punish officials who committed human rights abuses,'' the reports said. Singling out the treatment of white South Africans South Africa was also singled out for its human rights situation ''significantly worsening.'' The report pointed to unfair treatment of white Afrikaners following the signing of major land reforms that the Trump administration has said discriminate against that minority, which ran the country's apartheid government. That system brutally enforced racial segregation, which oppressed the Black majority, for 50 years before ending in 1994.\n\nWith the signing of that law in December, the report said that ''South Africa took a substantially worrying step towards land expropriation of Afrikaners and further abuses against racial minorities in the country.'' It also said the government ''did not take credible steps to investigate, prosecute and punish officials who committed human rights abuses, including inflammatory racial rhetoric against Afrikaners and other racial minorities, or violence against racial minorities.'' This year, the administration admitted as refugees some groups of white Afrikaners. The reports take issue with what the Trump administration believes are restrictions on free speech imposed against generally right-wing voices in the United Kingdom, France and Germany. The reports use identical language to say that human rights conditions in each of the three NATO allies ''worsened during the year.'' The executive summaries for each of the three reports say ''significant human rights issues included credible reports of serious restrictions on freedom of expression, including enforcement of or threat of criminal or civil laws in order to limit expression; and crimes, violence, or threats of violence motivated by antisemitism.''",
  "medium": "Article",
  "links": [
    "https://www.startribune.com/news-politics/nation"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "human rights reports",
      "weight": 0.11631676
    },
    {
      "name": "human rights abuses",
      "weight": 0.10703272
    },
    {
      "name": "significant human rights abuses",
      "weight": 0.10397805
    },
    {
      "name": "human rights",
      "weight": 0.10198278
    },
    {
      "name": "widespread human rights abuses",
      "weight": 0.10040186
    },
    {
      "name": "Human rights groups",
      "weight": 0.10021926
    },
    {
      "name": "human rights conditions",
      "weight": 0.09958382
    },
    {
      "name": "human rights records",
      "weight": 0.096839435
    },
    {
      "name": "significant human rights issues",
      "weight": 0.09560506
    },
    {
      "name": "dire human rights conditions",
      "weight": 0.09365359
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.970703125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.87890625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.8408203125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.6455078125
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.52685546875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.5263671875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.369140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.35400390625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.3154296875
    }
  ],
  "sentiment": {
    "positive": 0.056167286,
    "negative": 0.6919855,
    "neutral": 0.25184724
  },
  "summary": "The Trump administration has released human rights reports for countries worldwide, which focus on free speech and protecting the lives of the unborn, but also highlight dire human rights conditions in some countries accepting deported migrants. The reports eliminate mentions of discrimination faced by LGBTQ people, reduce a previous focus on reproductive rights, and criticize restrictions on political speech by U.S. allies in Europe that American officials believe target right-wing politicians. The State Department stated that the reports were streamlined for better utility and accessibility. However, they were delayed due to changes made by the Trump administration. Amnesty International criticised the changes, suggesting an attempt by the administration to hide the growing attacks on human rights in certain countries.",
  "shortSummary": "The Trump administration's human rights reports criticize countries that accept deported migrants, omit discrimination, and prioritize political speech instead.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3c442d6f995e45f7ab95c5d3af17cb60",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.startribune.com/news-politics/nation",
      "text": "Three firefighters were injured after a blaze that started in a restaurant's kitchen scorched century-old buildings in Salt Lake City's nightlife hub, officials said Tuesday.\nMore from Nation\nSherrod Brown, Ohio's highest-profile Democrat, expected to seek a return to the US Senate in 2026\nFormer U.S. Sen. Sherrod Brown, Ohio's best-known Democrat, is expected to make another run for the U.S. Senate next year, giving Democrats a likely boost as they wage an uphill fight to win control of the chamber.\nAugust 12, 2025\nThe Latest: National Guard arrives in Washington DC for Trump's federal takeover of local police\nwithout substantiation — a lawless city.\nAugust 12, 2025\nAndrew Cuomo swipes at Zohran Mamdani over a classic New York topic: rent\nAndrew Cuomo is demanding that his opponent in New York City's mayoral race, Zohran Mamdani, vacate his rent stabilized apartment, while pushing a longshot proposal that would bar other middle-class renters from accessing much of the city's housing.\nAugust 12, 2025\nDesperate parents pleaded with officers to act during Uvalde school shooting, video shows\nDesperate parents begged law enforcement officers to storm an elementary school in Uvalde, Texas, in the frantic minutes after a gunman opened fire in one of the deadliest classroom attacks in U.S. history, police body camera video released Tuesday shows.\nAugust 12, 2025\nCampaign groups urge judge to further limit new restrictions on getting measures on Florida's ballot\nAttorneys for grassroots campaigners are again asking a federal judge to halt enforcement of parts of a new Florida law that restricts the state's process to get citizens' initiatives on the ballot.\nAugust 12, 2025\nNFL appeals Nevada Supreme Court ruling allowing Jon Gruden's lawsuit to proceed\nThe NFL will appeal the Nevada Supreme Court's ruling Monday that former Las Vegas Raiders coach Jon Gruden can proceed with his lawsuit and not go through the league for arbitration.\nAugust 12, 2025\nTrump's takeover of Washington law enforcement begins as National Guard troops arrive\nThe new picture of law enforcement in the nation's capital began taking shape Tuesday as some of the 800 National Guard members deployed by the Trump administration began arriving as police and federal officials took the first steps in an uneasy partnership to reduce crime in what President Donald Trump called — without substantiation — a lawless city.\nAugust 12, 2025\nJets' Justin Fields says his focus on his faith the past 6 months has helped him shake off criticism\nJustin Fields heard all the criticisms — and occasional kudos — that came his way from fans and media during his first four NFL seasons.\nAugust 12, 2025\nTrump administration calls out human rights records of some nations accepting deported migrants\nThe Trump administration on Tuesday released human rights reports for countries worldwide, which eliminate mentions of discrimination faced by LGBTQ people, reduce a previous focus on reproductive rights and criticize restrictions on political speech by U.S. allies in Europe that American officials believe target right-wing politicians.\nAugust 12, 2025"
    }
  ],
  "argos_summary": "The Trump administration released human rights reports that notably omit references to LGBTQ discrimination and reproductive rights, while emphasizing free speech and critiquing political speech restrictions in Europe. The reports highlight poor human rights conditions in countries accepting U.S. deportees, such as South Sudan and Rwanda, while controversially stating that El Salvador had no significant human rights abuses. Human rights groups criticized the reports for failing to adequately address alarming global human rights issues.",
  "argos_id": "T9GDZDW8I"
}