{
  "url": "https://www.independent.co.uk/health-and-fitness/sexual-wellness-censorship-b2804367.html",
  "authorsByline": "The Independent",
  "articleId": "e06f8d3b7d37445294c15735fb4ecd0c",
  "source": {
    "domain": "independent.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static.independent.co.uk/2025/08/08/16/59/SHE-SPOT_01.jpg?trim=0,0,1,0&width=1200&height=800&crop=1200:800",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-09T05:00:00+00:00",
  "addDate": "2025-08-09T05:08:09.055116+00:00",
  "refreshDate": "2025-08-09T05:08:09.055117+00:00",
  "score": 1.0,
  "title": "How censorship is harming your relationship with your sexual health",
  "description": "Entrepreneurs in the sexual wellness space face a daily battle as their social media and bank accounts are deactivated says sexologist Georgia Rose",
  "content": "A sexual revolution has been taking place over the past decade. It’s not loud or brash, because it’s not allowed to be. The women leading it are entrepreneurs, sexual health practitioners, sex toy company founders, sextech disruptors, non-profits, thought leaders and digital creators.\n\nThey’re fighting a historic smear campaign that has stigmatised sex and undermined female and queer sexual agency for centuries. I am one of them. A clinical sexologist, certified sex coach and writer, who’s worked in this space for almost a decade helping women and couples rescue their sexual relationships.\n\nMy peers and I offer the perspective that sexual wellness is an integral part of our overall wellbeing. We exalt sex-positive values around consent, pleasure, communication, inclusivity and body autonomy. We empower people to define the kind of sex and pleasure they want, on their terms.\n\nThis work cuts across every stage of life – from helping teenagers unravel porn-fuelled myths about sex and millennials worrying about the pleasure gap to dismantling the view that sex should fall off a cliff after menopause. In fact, the sexual wellness movement has inspired midlife women to re-write their sexual script and reclaim sexual agency, without shame.\n\nWe’ve all seen Stephen Graham’s hit show Adolescence and grasped what it represents. We’re living through a societal crisis of viral digital misogyny. Easy-access porn is shaping children’s sexual attitudes and gender-based violence is on the rise. Sexual wellness initiatives, such as modern sex education platforms, consent-focused workshops, age-appropriate pleasure-positive books and shame-free digital conversations are the antidote.\n\nWhile public interest and need for services like those I offer are sky-high – a 2022 study by Sex Education Forum showed that only 35 per cent UK students believed they had received “good” or “very good” sex education and 90 per cent of girls had been sent explicit pictures or videos they did not want to see – building a sustainable business within sexual wellness is a constant uphill battle. The industry is vulnerable to fragmentation, fraught with significant financial challenges and faces global censorship which leaves us all teetering on the edge of burnout.\n\nAt the crux of this is a serious PR problem. Our businesses are routinely misclassified and lumped into the “adult” industry, discouraging investors, spooking banks and terrifying the algorithm.\n\nAs Cindy Gallop, founder of the educational and ethical erotica platform Make Love Not Porn, expressed in her inspiring SXSW 2025 talk: “Every piece of business infrastructure other tech start ups take for granted, we can’t. The small print always says ‘no adult content’. I can’t get funded. I can’t get banked. [We were] debanked three times in the last two months.”\n\nThis is not an unfamiliar experience for Kalia Bolton and Holly Jackson, co-founders of SheSpot – a pleasure product and education platform for women. Securing insurance has been a major hurdle for them, with male brokers struggling (or refusing) to understand the nature of their business.\n\nBolton explained: “One insurance company cancelled our policy mid-term.The brokers said our businesses breached their company values, but when we asked to see these ‘values’, they said they ‘weren’t written down’. We were rejected by twelve insurance companies before finally securing cover but with a high premium. They charge us thousands more compared to regular retail businesses, and with extensive exclusions.”\n\nSheSpot also had its Paypal account suspended and was refused savings accounts “on the grounds of us being a ‘high risk’ business, with our services being lumped in the same restricted category as firearms.” says Bolton.\n\nSex sells, but only under certain conditions. The result? Innovations have been stifled due to lack of business infrastructure and investment and growth in the sexual wellness category has been hindered. This is an industry awash with small start-ups and exhausted solopreneurs clawing through a system that feels like it’s rigged against them.\n\n“A real challenge is collaboration with non-sexual wellness businesses (those that are more strictly health related) who may be fearful of being associated with ‘higher risk’ partners”. Jackson notes.\n\nWe are satellites in orbit, unable to collaborate, scale or sustain each other. Largely unable to reach our full potential because we cannot operate like other businesses.\n\nBut it gets worse. A digital gag censors us online. Education content about “seggs” (yes, that’s how we have to spell it to dodge algorithmic policing) is censored and routinely “shadowbanned”. In my experience, content I publish that uses sexual language – regardless of its empowering or educational context – will reach less than 0.01 per cent of my followers.\n\nThis constricted reach impacts sales for those of us relying on social media to stay visible and advertise our services. And on top of that, without warning and with no explanation, Meta – and other major platforms – can remove content, suspend our accounts and block us from running ads. Cindy Gallop’s Make Love Not Porn Instagram account was recently disabled by Meta with no warning.\n\nAs sex coach Amy White explains, “it’s not just the censoring on social media, I’m pretty sure my newsletters end up in most people’s junk boxes. It’s so frustrating and disheartening. How are we supposed to promote healthy, shame-free sex when we’re banned from using the word?”\n\nPart of Big Tech’s compliance policy is a vow to crack down on content that facilitates sex trafficking, but the maths doesn’t quite math here. Is the algorithm really so archaic that, despite the giant leaps we’ve made in modern technology, it can't differentiate between empowering sexual content and criminal activity?\n\nThe sexual wellness community has been trading horror stories about censorship for years. But in 2025, a global investigation published by The Center for Intimacy Justice confirmed what we already knew: Big Tech is actively suppressing sexual and reproductive health content, particularly for women and gender-diverse people, globally.\n\nThe report, which analysed the experiences of 159 non-profits, business and content creators in the industry across 180 countries, found that 84 per cent of sexual and reproductive health businesses had ads rejected by Meta. A further 66 per cent had their ads rejected by Google and 64 per cent had product listings removed from Amazon.\n\nThe report also illuminated the shocking gender bias at play. While Meta happily runs ads for Viagra and erection enhancers, it blocks promotions for breast cancer checks, UTIs and vaginal health screenings. Female-founded sex toy company Unbound noted that it only received approval for its vibrator ads after reframing campaigns to focus on male pleasure instead of female pleasure.\n\nBlood-boiling double standards aside, this is about more than just visibility. The digital duct tape is blocking access to lifesaving information, forcing businesses to close down and “reinforcing outdated ideas around who is ‘allowed’ pleasure”, says Jackson.\n\nAdding insult to injury, censorship decisions are erratic. Dr Carolina Are is a researcher at Northumbria University’s Centre for Digital Citizens who specialises in social media censorship of sexuality. She explains that, “this censorship is applied unevenly – celebrities for instance often don’t face it, meaning it relies on the presence or absence of offline clout.”\n\n“It feels like the censorship is tightening”, says White, “I’ve seen a big shift since I started my business in 2020”. White is not wrong. Our industry isn’t immune to the global swell of conservative politics. What we’re witnessing is part of a broader cultural regression around the world, one that’s rolling back hard-won reproductive rights, imposing anti-LGBTQ+ policies, and blocking young people from accessing comprehensive sex education.\n\nSocial media platforms are “very much aware” of the over-enforcement of their policies and the damage being inflicted, confirms Dr Are. “But given most platforms’ North American origin, and the broligarchy’s wish to appease the Trump presidency, they prefer to over-moderate.The effects [of this censorship] are just not as worrisome to them as some other enforcement issues may be.”\n\nIt’s a far cry from the hopeful momentum that sexual wellness experienced during the pandemic. Lockdown triggered a “sexplosion” as sex toy sales soared, celebrities like Cara Delevingne and Dakota Johnson backed pleasure brands, and high-end retailers like Sephora launched sexual wellness lines – which have since closed. Female pleasure went mainstream, re-framed as self care, whilst an interest in sexual exploration surged. This coincided with the rollout of a new, reformed and inclusive Relationship and Sex Education curriculum which was made compulsory in all UK schools in 2020.\n\nThe pendulum is swinging the other way on the world stage today. The new RSE curriculum has been changed following political pushback, with some LGBTQ+ content deemed too “ideological” for teens, and sex education now considered inappropriate for children below nine years old. This is happening against a grim cultural reality, highlighted in the Children’s Commission for England’s 2023 report which revealed the average age children first see pornography is thirteen, whilst 10 per cent had seen pornography by age nine and 27 per cent had seen it by age 11. Against this worrying reality, conservative ideals about protecting childhood innocence feel flimsy and misguided.\n\nRead more: Almost half of Gen Z is using AI to help with dating apps\n\nWe’re also seeing the rise of so-called “puriteens” – Gen Zers who are reappraising the sexual scripts handed down to them and, statistically, having less sex. It’s hotly debated whether it’s a sign of self-assured boundaries or a quiet fear of romantic relationships after lockdown. But what’s clear is that young people don’t have sufficient access to honest and open conversations about sex on the digital platforms they know best, bereaving them of resources to easily navigate their questions and anxieties.\n\nSex has always been political, but for those of us in the sexual wellness space – helping people let go of sexual shame and adopt healthier sexual expression – it can feel like we’re on the streets protesting day-in and day-out, while water cannons are fired at us from all directions.\n\nWhy do we bother? “It’s sadomasochism,” I joke to my friends. But in truth, it’s because we can’t un-see how important this work is. It’s because we see how exposure to our products and services can genuinely change lives and society for the better. Our shared struggle has fostered a unique sense of solidarity with very few sharp elbows between competitors in the space. “If someone wins we all win,” says Jackson.\n\nAnd the wins are profound, not just inside the bedroom but out in society at large. Several studies prove that comprehensive RSE boosts contraception use and lowers teen pregnancy rates. Sexual satisfaction supports mental, physical, and relationship health. Pleasure and consent education reduces gender-based violence and fosters personal agency.\n\nSexual wellness isn’t niche, it’s necessary and like it or not, this PR problem is everyone’s problem. What I and so many others do is frontline work, but we are being sidelined. All we ask is that we are respected, funded and platformed like any other business, because we aren’t going anywhere.\n\nRead more: 11 best lubes to help ease friction and elevate your sex life",
  "medium": "Article",
  "links": [
    "https://www.independent.co.uk/news/health/trump-us-aid-birth-control-contraception-b2802877.html",
    "https://www.independent.co.uk/health-and-fitness/sti-hpv-test-tampon-b2762194.html",
    "https://www.independent.co.uk/topic/sexual-health?CMP=ILC-refresh",
    "https://www.independent.co.uk/life-style/love-sex/cara-delevingne-planet-sex-female-pleasure-b2236301.html",
    "https://www.independent.co.uk/extras/indybest/outdoor-activity/best-libido-boosters-aphrodisiac-b2748211.html",
    "https://www.templeofthefeminine.com/",
    "https://www.independent.co.uk/life-style/love-sex/cindy-gallop-make-love-not-porn-social-sexual-revolution-sex-toys-watch-ted-talk-gender-equality-hardcore-porn-a7598046.html",
    "https://www.sexeducationforum.org.uk/news/news/new-polling-shows-young-people-are-being-failed-poor-relationships-and-sex-education",
    "https://www.independent.co.uk/tech/meta-london-kings-cross-facebook-b2362941.html",
    "https://www.independent.co.uk/news/uk/home-news/meta-google-sexist-adverts-iwd-b2711249.html",
    "https://www.independent.co.uk/news/uk/politics/abc-opinium-balance-b2607282.html",
    "https://www.independent.co.uk/donate?regSourceMethod=Donations",
    "https://www.independent.co.uk/health-and-fitness/best-lube-b2125627.html",
    "http://redirect.viglink.com?u=https%3A%2F%2Fshespot.co.uk%2F&articleId=b2804367&key=5b1a6400a3c0d931ed2037885e1a27a3",
    "https://www.independent.co.uk/news/uk/home-news/menopause-divorce-reduced-sex-drive-b1889562.html",
    "https://www.independent.co.uk/arts-entertainment/tv/reviews/adolescence-netflix-review-episodes-stephen-graham-b2716952.html",
    "https://www.independent.co.uk/news/world/americas/gen-z-ai-dating-apps-b2788743.html",
    "https://www.independent.co.uk/life-style/love-sex/women-sex-bedroom-relationships-b2531428.html",
    "https://www.intimacyjustice.org/report2025",
    "https://www.sexeducationforum.org.uk/resources/evidence/relationships-and-sex-education-evidence",
    "https://www.northumbria.ac.uk/about-us/our-staff/a/carolina-are/",
    "https://www.independent.co.uk/life-style/health-and-families/women-self-care-sex-mental-health-b2415940.html",
    "https://www.independent.co.uk/health-and-fitness/threesomes-tantra-bros-god-spirituality-influencers-b2767901.html",
    "https://assets.childrenscommissioner.gov.uk/wpuploads/2023/02/cc-a-lot-of-it-is-actually-just-abuse-young-people-and-pornography-updated.pdf",
    "https://www.independent.co.uk/extras/indybest/house-garden/bedroom/harry-styles-pleasing-yourself-lube-sex-toys-vibrator-b2796010.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Sexual wellness",
      "weight": 0.08106231
    },
    {
      "name": "sexual wellness",
      "weight": 0.08106231
    },
    {
      "name": "non-sexual wellness businesses",
      "weight": 0.07828992
    },
    {
      "name": "Sexual wellness initiatives",
      "weight": 0.07562856
    },
    {
      "name": "sexual wellness lines",
      "weight": 0.075482644
    },
    {
      "name": "empowering sexual content",
      "weight": 0.07400693
    },
    {
      "name": "sexual shame",
      "weight": 0.07256852
    },
    {
      "name": "sexual health practitioners",
      "weight": 0.07106621
    },
    {
      "name": "sexual agency",
      "weight": 0.070890516
    },
    {
      "name": "sex education",
      "weight": 0.06991751
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.69775390625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.65673828125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.56494140625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.491455078125
    }
  ],
  "sentiment": {
    "positive": 0.06518555,
    "negative": 0.7036133,
    "neutral": 0.2310791
  },
  "summary": "The article discusses how censorship is negatively impacting the relationship between sexual health and sexuality, with the author highlighting the importance of sexual wellness as an integral part of our overall wellbeing. The author argues that this movement is fighting a historic smear campaign that has stigmatised sex and undermined female and queer sexual agency for centuries. While public interest and demand for services like these offered are high, building a sustainable business within sexual wellness is a constant battle. The authors also highlight the difficulty of securing insurance for these businesses, which have been difficult due to male brokers unfamiliar with their business. They also highlight a lack of infrastructure and investment in the sexual wellness category, which has been hindered by a system that is rigged against them. The article concludes by highlighting the need for collaboration with non-profit organizations and non-governmental thought leaders.",
  "shortSummary": "The sexual revolution is underway, but its leaders face challenges of stigma, financial challenges, and pervasive online censorship to reclaim sexual agency.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f559bd0a1b41449296cb25ef132f6dba",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.independent.co.uk/news/uk/home-news/menopause-divorce-reduced-sex-drive-b1889562.html",
      "text": "Almost half of women say they stopped ‘having sex while going through menopause’\nExclusive: ‘The menopause is a very difficult time emotionally for many women,’ says lawyer\nAlmost half of women say they stopped having sex while going through the menopause, new research has found.\nThe polling, which was carried out exclusively for The Independent, also discovered around a quarter of women live in fear their partner will separate or divorce them due to the menopause killing their sex drive.\nStowe Family Law, which polled 534 women who were aged 40 and older, found 65 per cent of women say being menopausal has impacted their marriage. While almost half believed their relationship could have been rescued if the NHS had better help for those struggling with symptoms of menopause.\nRachel Roberts, a lawyer at Stowe Family Law, the largest family law firm in the UK, told The Independent they are seeing a rise in cases of perimenopausal and menopausal women getting in touch as their relationship is struggling due to the hormonal changes they are experiencing.\nMs Roberts added: “Currently, over 50 per cent of our divorce enquiries from women are in their 40s and 50s and we are seeing this number rise.\n“The perimenopause and the menopause is a very difficult time emotionally for many women, who find themselves worrying about their relationship on top of dealing with hormonal changes.\n“We all too often see women coming to us to start divorce proceedings because they feel their partners don’t understand the emotional and mental struggles they are going through, or men who are unable to understand why their partner’s behaviour has changed so much.”\nShe said it was “troubling” to discover the high numbers of women surveyed who said their relationship could have been saved if the NHS provided better support for women experiencing the menopause.\n“It’s time for more awareness to be placed on the emotional impacts of menopause so that women are better supported in their lives and in their relationships,” Ms Roberts added.\nThe majority of the 3.4 million women between 50 and 64 in the UK will be experiencing symptoms of menopause – with these ranging from heart palpitations to hot flushes, vaginal pain, anxiety and depression.\nThe latest study, which polled a nationally representative sample of women around the country, found almost half of women say the menopause has had repercussions on their mental health and wellbeing.\nTwo thirds of women said they do not think their spouse or partner properly grasps the physical, mental and emotional repercussions the menopause causes.\nStowe Family Law, which specialises in family law and divorce across the UK, is growing in size - with the firm attributing its growth to mounting demand for its services in the wake of the pandemic.\nIt comes after Carolyn Harris, the Labour MP for Swansea East, recently introduced legislation to parliament seeking to overhaul “menopause rights, entitlements and education”.\nThe politician, who has also set up an All-Party Parliamentary Group (APPG) of MPs which is focused on the menopause, told The Independent: ”When women go through the menopause, they will produce less testosterone. This results in a great loss of libido.\n“In the UK you can only get an NHS prescription for eostrogen and progesterone. You cannot get a prescription for testorone unless you go private. Women should be able to get testosterone on the NHS to save marriages.”\nThe Independent recently reported almost half of women going through the menopause say they were left with no option but to seek private healthcare.\nHealthcare providers said menopausal women are resorting to private treatment due to failing to get proper support or correct prescriptions from NHS doctors. While campaigners warned some women are racking up debt by borrowing money from the bank or relatives as private treatment can spiral into costing thousands of pounds.\nData from the Menopause Support network, which was shared exclusively with The Independent, found 48 per cent of just over 600 women they polled said they had been “left with no option but to seek private menopause care”.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.independent.co.uk/life-style/love-sex/women-sex-bedroom-relationships-b2531428.html",
      "text": "Mind the pleasure gap: Why are women having such a bad time in the bedroom?\nWith such a big focus on sex positivity and wellness, why does a new survey reveal women are feeling let down by what’s actually happening in bed? Olivia Petter talks to the experts to try and discover what’s going on and how to fix it…\nIf you’re a woman in 2024, you should be having an incredible sex life. Think about it: we are living in an extraordinarily sexually liberated time when nothing is off the table and you can now buy vibrators and sexaccesories in almost any high street lingerie shop.\nSex positivity feels like it is everywhere, but apparently not in our bedrooms. A new survey has shown that two in three women are doing things during sex that they don’t enjoy and, more worryingly, one in four saying they find it hard to say “stop” to a partner doing something they don’t like.\nThese statistics, from a survey of 3,000 adults conducted by dating app Pure, may sound shocking, but not me. Nor would they, I suspect, surprise any of the women I know who are very aware of the pleasure gap between what is meant to be happening in the bedroom and what is actually happening in there.\nSeveral other recent studies support these findings. The International Academy of Sex Research found that while gay and straight men climax during about 85 per cent of their sexual encounters, women having sex with men reach orgasm just 63 per cent of the time. This gap widens significantly during first-time hookups, with 80 per cent of men reaching orgasm compared with only 40 per cent of women.\nGiven the sheer volume of books, TV shows, and marketing campaigns that are coming out around the subject of female sexuality, you’d be forgiven for thinking the orgasm gap was something we closed a long time ago.\nEvidently, that’s not the case. “I can’t remember the last time I had an amazing sexual experience with someone new,” says Yas*, 34. “You have to be patient because things do generally improve with time as you learn more about each other’s bodies. But we have to work so hard at it.”\nBut it’s not just men who lack the knowledge (or even care) to give us pleasure, many women also lack the sexual literacy to communicate what they want to. “I don’t feel comfortable telling new partners what I do and don’t enjoy,” says Maggie*, 29. “It’s too awkward and I’m too worried I’ll damage their ego and it might scare them off.”\nThis major disconnect between what we’re being told culturally and socially and what we’re actually experiencing is captured brilliantly by Katherine Rowland in her book, The Pleasure Gap: American Women and the Unfinished Sexual Revolution. Her interviews with hundreds of women show just how far we have to go to achieve meaningful change.\n“For women, sex is often presented as either existing in terms of reproduction, in terms of pathology, or in terms of service,” says Rowland. “And despite so many social advances and generational differences, I think women still deeply internalise this idea that they are sexual objects and their partners still expect of them the idea that they are sexual objects built for providing pleasure but not necessarily for receiving it, and that pleasure is merely something they need to perform for their partner’s benefit.”\nThe performative aspect is why so many heterosexual women fake orgasms with their partners. In her viral TED talk on the subject, clinical psychologist and author of Mind The Gap: The Truth About Desire and How to Futureproof Your Sex Life Dr Karen Gurney explained why there is still such a distinct gap between how we talk about sex today and how we actually have it.\n“There’s been a huge move towards focus on sexual wellness in the last decade and this is very welcome,” says Dr Gurney. “Despite the surface level focus on the importance of sexual wellbeing, though, many are very much still struggling with not feeling sexually liberated, feeling oppressed and feeling restricted or unable to access sexual pleasure.”\nFor my friends and I, part of this boils down to how we were taught about sex at school. As stereotypical as it may sound, we were shown how to put a condom on a banana and sent on our way. That was it. And that was at a boarding school, where pupils were having so much sex on campus that teachers regularly had to patrol around at night to try and catch them. Thankfully, the sex education syllabus has been significantly updated since then and now includes mandatory units around consent, sexual exploitation, online abuse, grooming, coercion, harassment, and more. But is there still something missing?\n“There needs to be sex education that is inclusive of pleasure,” says Rowland. “There is no mention of the clitoris in these textbooks, for example, and this is an organ in the body. It’s not a mysterious entity. It’s not a product of fantasy. But by excluding it, we eradicate women’s pleasure as a subject of scientific and social validity.”\nThe sheer volume of companies plugging “sexual wellness”, both in their advertising and on social media, can also feel overwhelming. And, in truth, a sex toy isn’t going to do much to solve the wider issue at play here. Rowland reflects: “Vibrators will probably increase the number of orgasms that women are having but it doesn’t increase the extent to which they’re able to advocate for their pleasure in different spaces.”\nGood sex isn’t just about buying the right vibrator, it’s about connecting with your partner and, more importantly, with yourself. “To close the pleasure gap we need to find the right kind of touch, stimulation or pleasure, communicate that to our partner, and to stay present in the moment rather than letting the mind wander,” says Kate Moyle, psychosexual therapist and author of The Science of Sex. “These factors become compromised when we don’t speak up to our partners, or fake orgasms, or when we start to stress about not reaching orgasm.”\nWe also need to change the way we talk about sex on a societal level and bring pleasure into that conversation. There is still too much shame attached to the subject – can you remember the last time you spoke to a married person about how often they have sex? While outwardly society feels like it is having loud conversations about sex, inwardly we are still a culture ill-at-ease which is prohibiting us from further progression.\n“We should be able to have a non-judgemental dialogue around sex, bodies, pleasure and sexuality where pleasure rather than risk is centred,” says Dr Gurney. “Young people need to go into their first sexual experience knowing that the most likely result of this experience will be affirmation, pleasure and fun, not an overfocus on STIs, pregnancy and risk of reputational damage.”\nOf all the things I wish I’d learnt about sex when I was younger, it is that sex is supposed to feel good – a message that gets drowned out by all the warnings. And we should be able to communicate when it doesn’t to our partners – male or female – without worrying about them feeling crushed. “Bringing men into this conversation is vital,” adds Rowland. “Because if women feel more comfortable in their own skin, more entitled to their pleasure and more fluent in what sexual experiences can be, everybody is going to benefit from that.”\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.independent.co.uk/health-and-fitness/threesomes-tantra-bros-god-spirituality-influencers-b2767901.html",
      "text": "Meet the men who say their threesomes were sanctioned by God\nAs spiritual influencers, ‘tantra bros’ purport to educate us about sacred sexuality practices that can bring deeper emotional connection and enlightenment. Which is great, says Emilie Lavinia, as long as they aren’t used for manipulation and abuse\nIn recent years, a resurgence of New Age belief systems and an interest in wellness has given rise to a new kind of lexicon. Many of us now talk about relationships with friends, family, and partners through the lens of spirituality. We talk about our intuition, divine timing, and the “energy” that others project as though these concepts are intrinsic to us all.\nFor some, these concepts are a no-brainer. Some people simply find it much easier to understand, plan and justify their own behaviours and those of others by applying a framework rooted in spirituality and self-help. Star signs, love languages, human design – these frameworks are all common in New Age thinking and often blend psychology, religious symbolism and other modern philosophies about self-worth, purpose and connection created by self-development gurus.\nBut while I fully understand why people embrace this kind of thing, especially in an uncertain and anxiety-inducing world, there can be a dark side to New Age beliefs and the spiritual language they rely on, especially when it comes to our relationships.\nOn social media, the number of influencers who promote ideas about sacred or spiritual sexuality is rising. You might have seen them posting about divine unions, twin flames and the “divine masculine”. “Spiritual sexuality is an ancient practice that dates back thousands of years. It contextualises sex as sacred, infusing the act with deeper meaning and ritualising it through a set sequence of actions and prayer or intention setting,” explains sexologist Aisha Paris Smith, who works with individuals and couples to improve their sexual wellbeing.\nBut, explains tantra expert Henika Patel, although these New Age concepts are rooted in the Vedic tradition of tantra, most of these modern interpretations are very far from the original ideas touted by Indian philosophers. For example, the concept of “divine physical union” comes from the path of something dubbed “neo-tantra”.\n“It’s important to recognise that neo-tantra is a New Age concept and does not represent traditional tantra, which is a spiritual and mystical path stemming from the 6th century in India.” says Patel. “It seems that much like yoga was transported and commercialised for ‘stretching’, this element of tantra has been cherry-picked and transported for ‘sex’.”\nRead more: The best Pilates moves for beginners and how to do them, according to an expert\nFor some, the idea of sacred sexuality is both empowering and freeing – particularly in a culture that demonises sexual expression and where fear and abstinence-based sex education still exist. Social media accounts that instruct women on how to step into their “goddess era” and channel their “divine feminine” now amass millions of followers on social media and there are thousands of influencers selling coaching courses that teach followers how to channel spiritual sexual energy and connect more deeply with a partner.\n“Tantra bros” seem to be all over social media these days and while most have noble intentions, others seem to be selling ideas that veer on a blueprint for how to coax women into sex. It harks back to the pick-up artists of the early noughties, but instead of advice to “wear a memorable outfit” or “be negative about her looks” the advice is now to “tell the woman she’s used her heavenly light to power your sacral chakra”.\nInfluencers like Aubrey Marcus – outspoken podcaster and Joe Rogan’s ex-business partner – have recently been criticised for posting about their “sacred relationships” online. In his own podcast, Marcus claimed that a divine message was delivered to him. The message told him to open Raya, meet a woman and then open his marriage. Essentially, God said, “be in a throuple”.\nMany spiritual sexuality influencers justify fairly mundane actions, interests and proclivities using New Age jargon and they encourage us to do the same. However, this presents an issue. Presenting sexual desires as “sacred” could hold the door open for predators to use the language of spirituality and self-help to coerce, manipulate and potentially harm others.\nMen have used the “message from god” excuse to manifest and justify relationship dynamics and sexual behaviours across myriad cultures for centuries. Many so-called gurus have ended up behind bars as a result. However, we have the New Age boom to thank for a new particularly toxic form of sexual coercion and exploitation disguised as empowerment.\nRead more: Wellness is turning people into right-wing conspiracy theorists – here’s how\nThe idea that a person might frame sexual access to another person as a holy pilgrimage and justify that access according to God’s plan could be seen as worrying at best and, at worst, predatory.\n“It’s important to distinguish a ‘subjective spiritual experience’ with ‘universal spiritual principles’ and question whether a statement is a human desire wrapped in spiritual jargon,” says Patel.\nThe kinds of men who use the New Age lexicon of sex positivity and sacred union to serve their own desires are usually engaging in what’s known as spiritual bypassing – a term coined by American psychotherapist John Welwood. Bypassing describes the way in which spiritual beliefs and practices can be used to mask problematic behaviours.\nMen who use spiritual bypassing to access certain relationship dynamics without accountability are all too common in spiritual circles and the wellness landscape. I know this because I have met so many of them.\nI have seen a lack of self-control, a shirking of personal responsibility and a tendency to coerce and mistreat members of a wider community validated by hyper-individualistic healing journeys and presented as a form of enlightenment and higher consciousness. Setting a boundary, especially a physical one, will often see you labelled as “un-evolved” or “repressed” by these kinds of men.\n“There is unfortunately, a high level of abuse of power in the spiritual communities, particularly where there is a hierarchy, imbalance of power or implied moral authority, at the cost of invalidations of feelings, agency or experience of others,” says Patel.\nPatel explains that this also becomes problematic due to “the influence and power involved.” She urges an awareness of “language being used to avoid accountability, promote power imbalance, manipulate actions, undermine consent or cause emotional or energetic harm. Especially, when the person using it has any kind of 'superiority' or influence’.”\n“There is a growing awareness between new age spirituality being a mask for predatory behaviour,” agrees Paris Smith. “In many spiritual circles, there’s a pattern where mostly men in positions of spiritual authority will use spiritual language to justify sexual boundary violations. This can include claims such as their penis is a healing force, or that a spirit told them to act or a woman’s discomfort speaks to her lack of spiritual development.”\nJustifying your desires and behaviour, or your urge to use a dating app, on the basis that a divinity has willed it is exactly why many New Age spiritual concepts, especially those related to sexuality, receive bad press..\nThe sad part about all this is that sacred sexuality can be an incredible tool for deepening a partnership, growing confidence, and removing the element of shame from your relationship with sex and your body. But when those we used to call out for reading The Game are now using these New Age concepts to their own self-gratifying ends, they may not be as enlightened as they think they are and we should be wary.\nRead more: I tried a temazcal ceremony in Mexico and it was nothing like your average sauna\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.independent.co.uk/life-style/love-sex/cara-delevingne-planet-sex-female-pleasure-b2236301.html",
      "text": "All hail Cara Delevingne: conversations about female pleasure can’t come quick enough\nAs the model and actor hosts a new docuseries all about sex, Olivia Petter examines why conversations around women’s sexuality are so vital\nNothing mystifies the world quite like female pleasure. Even in 2022, the very words feel at odds beside one another. Because we don’t live in a society that even understands it, let alone celebrates it. Take the “orgasm gap”, which is the subject of the first episode of Cara Delevingne’s new BBC Three documentary, Planet Sex.\nFor those who don’t know, the phrase relates to the fact that 95 per cent of men climax during sex compared to just 65 per cent of women. In truth, I think that statistic is far too high, as does Delevingne. But in these supposedly progressive times, why is it that female sexuality is still so widely misunderstood? And why are we no closer to closing the orgasm gap?\nOne suggestion posited by Delevingne is that men are simply “not equipped with the right tools to be able to handle women, especially sexually”. That might be true. But I think the issue stems from something deeper, tapping into a narrative that has plagued women for a millennium: that female pleasure is wrong, or even malignant in some way.\nConsider the popular myth that Victorian women were treated for hysteria with vibrators. Yes, really. For years it was suggested that male physicians saw female pleasure as a means to cure so-called hysterical women. But in 2018, that theory was more or less disproven, with two historians at the Georgia Institute of Technology claiming that there is no evidence this ever even happened. And yet, the idea spawned countless articles, pop culture references, and even a romcom starring Maggie Gyllenhaal.\nThe fact that this myth was so widely accepted without clear proof is an indictment of society’s total ignorance of female pleasure, and its negligence to truly interrogate the subject. This was something I experienced firsthand at school. Like many millennials, my sex education amassed to little more than being shown how to put a condom on a banana. That and being shown some unnecessarily graphic photographs of gonorrhoea. The idea that sex could be pleasurable was never mentioned. In fact, it seemed terrifying, particularly if a woman enjoyed it.\nThis is very much the picture that is painted in popular culture, too. Think back to that scene in Black Swan where Natalie Portman’s character is masturbating in her bedroom when her mother walks in and scorns her as though she’s caught her committing a crime. Coupled with the music and cinematography, it presents female pleasure as this sinister thing we should all fear. Later, in 2020, Billie Piper and Lucy Prebble dedicated a whole episode of their show I Hate Suzie to the quest for an orgasm that wasn’t in some way infected by male desire.\nAnd so when my female friends and I started having sex, we had all subconsciously accepted that it wasn’t really for us. Instead, it was something we did to please the boys. Even if it hurt. And even if we bled. As long as they thought we were having a good time, that was all that mattered.\nGod forbid any of us ever admitted to masturbating. To this day I can remember who, out of the sixth-form girls, owned sex toys – and how they were ridiculed and mocked for having the audacity to use them. Their names became fodder for gossip among all of us, vehicles on which we could carry our sexual shame.\nSadly, all this persists today. Because if it didn’t, the orgasm gap wouldn’t exist. As Planet Sex highlights, straight women are typically speaking the least sexually satisfied demographic. For queer men and women, for example, the rates of orgasm are often much higher, as attested to by Delevingne, who identifies as bisexual. “I mean, I get it,” the model deadpans. “It’s a lot more complicated for a woman to have to tell you, you know, you’re not doing it right. It’s an ego killer, which most men can’t handle.”\nFor some straight men, this might be hard to hear. But they are the ones that need to watch this documentary most of all. Because closing the orgasm gap is partly their responsibility. And taking the time to prioritise their partner’s pleasure is a great way to get started. There’s a reason why research has found that as many as 80 per cent of women have faked an orgasm.\nBut it’s going to take some effort from women, too. As Planet Sex goes on to highlight, the shame that society attaches to female sexuality is one of the biggest barriers to sexual equality. Because not only does it stop women from being able to speak openly about their desires, it prevents them from being able to recognise them in the first place. How can you tell someone what you want in bed if you have no idea yourself?\nHad my friends and I felt sexually liberated enough to talk about our bodies and masturbation when we were at school, I have no doubt that we would have all avoided a lot of bad sex. I also think watching Planet Sex would have helped enormously. Because elsewhere in the show, we see Delevingne speak to experts about the science behind masturbation and how the brain is affected when we orgasm. We see detailed diagrams of vaginas. And at one point, we even see the model making a clay replica of her own. This is powerful stuff when you consider that Delevingne is one of the world’s most photographed people – and an integral part of the LGBTQ+ community.\nAll of this is to say that watching this docuseries would have made a seismic difference had it been released when I was younger – and I know many others would say the same. But there is progress elsewhere, too, however slow it may feel. Conversations around female pleasure are becoming more prominent across popular culture. In 2019, there was an entire documentary dedicated to the vulva. Conversations around vaginal health often go viral on TikTok. Even Gwyneth Paltrow has done some decent PR for vaginas. I can see the difference among my friends, too, who now speak openly about what they like in bed, and which sex toys they’ve started using.\nA few years ago, it would have been virtually impossible to imagine we’d start talking like this. But we are. And change is happening – the arrival of Planet Sex is proof of that.\n‘Planet Sex’ is streaming now on BBC Three\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.independent.co.uk/life-style/health-and-families/women-self-care-sex-mental-health-b2415940.html",
      "text": "Study finds women only give themselves 30 minutes of self-care a week\nWhen it comes to sexual pleasure, almost a third (31 per cent) of women are more likely to climax alone than with their partner\nNearly one in five women say they never commit any time to their own pleasure.\nA study of 1,000 women found they typically reserve just 30 minutes a week for “me time,” when they indulge in something alone that they enjoy.\nThe research also revealed seven in 10 consider solo sexual pleasure to be key to their wellness and self-care.\nYet less than half (48 per cent) feel they have enough time to fit it into their schedules.\nA spokesperson for celebrity-founded wellness drinks brand G Spot, which commissioned the study to launch its new flavour, ‘Arouse’, said: “We believe taking time for self-pleasure isn’t just an intimate act, it is an act of self-care.\n“Pleasure is an essential part of holistic well-being - it is not a selfish pursuit, but the truest form of self-care and discovery.\n“We want to empower women to have the confidence to find time for themselves - which we all need and deserve.”\nWhen it comes to sexual pleasure, almost a third (31 per cent) of women are more likely to climax alone than with their partner.\nAmong the top reasons for this include knowing their body better (63 per cent), tapping into their own fantasies (33 per cent) and not feeling rushed (32 per cent).\nOther key factors are feeling more comfortable (26 per cent) and inhibitions and insecurities going out the window (19 per cent).\nThe top tactics to get in the mood for some self-indulgence include fantasising (28 per cent), watching adult content (26 per cent) and reading erotic literature (23 per cent).\nOthers include setting up a comfortable space (22 per cent) and having a warm bath or shower (20 per cent).\nThe majority of women admitted they had an open dialogue with their partner, as three-quarters said they felt comfortable talking about what they do and don’t like in bed with their other half.\nYet 23 per cent of those polled via OnePoll said they do have sexual fantasies or taboos which they haven’t told their partner about.\nWhile one in 10 are not comfortable at all when it comes to talking about their own desires.\nAnd nearly a tenth (nine per cent) hide the fact they own a sex toy from their partner.\nOn average, women are having sex six times a month – but would ideally be having private moments with a partner at least eight times a month.\nThe spokesperson from G Spot, which offers non-alcoholic drinks that are low in natural sugars and calories and created by a nutritionist and mixologist, added: “Every individual’s body is unique, and what brings pleasure can vary greatly.\n“Women have an incredible capacity to understand their own bodies, desires, and boundaries, and it’s through self-pleasure, that they unlock the key to their own satisfaction.\n“Far too often, the topic of women’s sexuality is viewed as taboo and laden with feelings of guilt.\n“Inspiring the confidence in women to do what feels good whether that be in relation to sexual pleasure and wellness - or simply the choices we make around food and drink, is central to our ethos.\n“Wellness is due a fresh take – one which is less intense and anxiety-inducing and makes you feel good, without guilt or inhibition.”\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.independent.co.uk/news/health/trump-us-aid-birth-control-contraception-b2802877.html",
      "text": "Trump’s destructive plan ‘will deny 1.4m women and girls birth control’\nThe supplies could prevent an estimated 174,000 unintended pregnancies and 56,000 unsafe abortions if they were handed out, the International Planned Parenthood Federation says\nThe Trump administration’s plan to destroy a warehouse full of contraceptives, rather than distribute them to low-income countries, will leave more than 1.4 million people without essential medical care, the International Planned Parenthood Federation (IPPF) has found.\nMore than three-quarters of the $9.7m (£7.2m) worth of supplies were destined for just five countries: the Democratic Republic of the Congo (DRC), Kenya, Tanzania, Zambia, and Mali. Tanzania, which was due to receive more than 40 per cent of the stock, will be the hardest hit.\nThe Reproductive Health Supplies Coalition, which brings together governments, private companies and charities to make contraception accessible, has projected that without these supplies there will be 174,000 more unintended pregnancies and 56,000 unsafe abortions.\nThe plan forms part of wide-ranging cuts to US foreign aid, which includes stopping providing birth control to lower-income countries. A State Department spokesperson said the US had “avoided an additional $34.1 million in taxpayer costs by negotiating no-cost cancellations of pending orders”. However the destruction of these supplies – which have already been paid for – is estimated to cost $167,000, according to the US government.\nIPPF said its offers to take on the costs of donating the contraception - which includes pills, implants and injections - rather than letting it go to waste had been rejected. The supplies were largely not due to expire for between two and five years.\nThe United States Agency for International Development (USAID) was one of the world’s biggest providers of contraception.\nWithout these contraceptives, women and girls are unable to choose how to protect themselves, Dr Bakari Omary, project coordinator at Tazanian sexual and reproductive health NGO Umati explained.\n“The impact of the USAID funding cuts has already significantly affected the provision of sexual and reproductive health services in Tanzania - leading to a shortage of contraceptive commodities, especially implants. This shortage has directly impacted clients' choices regarding family planning uptake.”\nIn many of these countries, options like implants and long-acting injectable contraception are particularly popular because they grant women discretion and control when their partners may not approve of them taking pills for example.\nIn Tanzania, a million injectable contraceptives and more than 350,000 implants have been earmarked to be burnt - almost a third of the contraception needed for a whole year.\nIn Mali, more than a million contraceptive pills and almost 100,000 implants are being withheld and risk being destroyed - a quarter of the country’s annual needs, while in Kenya more than 100,000 promised implants are not being distributed.\nExecutive Director for the Reproductive Health Network in Kenya, Nelly Munyasia, said these setbacks had come at a time when unmet need for contraception was already high - with profound implications for the lifechances of women and girls.\n“Nearly 1 in 5 girls aged 15–19 is already pregnant or has given birth. Unsafe abortions remain among the five leading causes of maternal deaths in Kenya,” she said.\nA US State Department spokesperson confirmed that a “preliminary decision was made to destroy certain birth control commodities from terminated USAID contracts”.\nHowever, the current status of the supplies remains somewhat of a mystery. While The Independent has been told that at least some of the contraceptives were in transit, the Belgian, French and US governments would not confirm whether any of the stock had reached France.\nA Belgian government spokesperson said the country remained committed to exploring, “all possible avenues to prevent the destruction of these stocks and continues to engage in discussions with the American authorities”.\nMajor waste management companies including Veolia and SUEZ have denied involvement in the incineration. Hormonal contraceptives require specialised disposal to prevent the hormones from polluting the environment and entering the water supply.\nPresident of IPPF’s French member association, Le Planning familial, Sarah Durocher, said: “We call on the French government to take responsibility and act urgently to prevent the destruction of USAID-funded contraceptives.\n“It is unacceptable that France, a country that champions feminist diplomacy, has remained silent while others, like Belgium, have stepped in to engage with the US government. In the face of this injustice, solidarity with the people who were counting on these life-saving supplies is not optional: it is a moral imperative.”\nThis article was produced as part of The Independent’s Rethinking Global Aid project\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.independent.co.uk/arts-entertainment/tv/reviews/adolescence-netflix-review-episodes-stephen-graham-b2716952.html",
      "text": "Netflix’s gripping Adolescence asks whether the Andrew Tate ‘manosphere’ drove a 13-year-old to murder\nThis one-shot exploration of teenage knife crime and the pernicious influence of the manosphere is harrowing but compelling\nHow do you solve the problem of today? That’s the question that therapists often pose to people experiencing the wide range of life’s traumas. Don’t relitigate the past, don’t attempt to fix the future, try and solve the problem of today. It’s a mantra that crops up in Netflix’s Adolescence, a four-part drama looking at the fallout from an unthinkable crime, and the many todays that must be solved, over and over, as a consequence.\nIt’s 6am on an apparently normal morning. Normal, that is, until armed police, led by DI Bascombe (Ashley Walters) storm into a family home and arrest a 13-year-old boy, Jamie Miller (Owen Cooper). His parents, Eddie and Manda (played by Stephen Graham and Christine Tremarco), watch on in horror as their little boy is dragged to the local police station, processed and placed in a cell. Jamie is suspected of murdering a schoolmate, and alongside Eddie, as his appropriate adult, and a solicitor, must face the evidence that the police have compiled against him. It is a nightmarish frenzy, transporting the Miller family from their pocket of suburban calm to the fear, recrimination and revelations of a murder inquiry.\nIt is a stunning opening. Each of the show’s four episodes is filmed in one continuous take, a technique mastered by its star Graham (who co-created this project with extremely busy scribe Jack Thorne) and director Philip Barantini on the 2021 film Boiling Point. In real-time, we watch the Miller family from the moment the police enter their home, to the terrible presentation, less than an hour later, of the authorities’ smoking gun against Jamie. The confusion and tension are palpable, as is a sense of sorrow. “I hate juvenile cases,” a duty nurse says, after testing Jamie’s understanding of his situation. “No one likes them,” the desk sergeant replies. And yet, everyone does their job methodically, the camera swimming around the station to capture the minutiae of Jamie’s terminal arrival in the justice system.\nThat is day one. The other three episodes are spread across the next year and a half, as the investigation progresses. Bascombe and his deputy DS Frank (Faye Marsay) visit the victim’s school; Jamie is assessed in prison by psychologist Briony Ariston (Erin Doherty); and, finally, Jamie’s plea comes through on Eddie’s 50th birthday. None of these episodes beg the one-shot technique in the same way that the first does. Indeed, they sometimes feel stifled by it, because the criminal justice system is a glacial thing, and rarely operates in kinetic hour-long slots. This makes the series feel lop-sided: a virtuoso first episode that catches you clean in the gut, followed by three episodes that feel more instructional. After all, the first hour of Jamie’s incarceration is a natural starting point, but what does the creative decision to focus on day three, or months seven or thirteen, tell us about the story?\nGraham and Thorne seem to want to place the accusations against Jamie into context, both familial and social. Words like “incel”, “manosphere”, and “red pill” are rapidly deployed (“Andrew Tate shite,” comes DS Frank’s judgment). At home, his parents deal with their guilt; a guilt focused far more on their son than his victim. “He was in his room, wasn’t he?” Eddie despairs. “We thought he was safe.” It is a challenging but miserable premise, one in which no one is spared their share of the blame. Violent misogyny being fomented in Britain’s schools, families blind to their kids’ internet activities, parents handing down destructive traits. We are all part of the problem that leads to Jamies, and leads to children dead from knife wounds in bleak, empty car parks.\nCooper’s performance as the accused is very able, nimbly shifting the audience’s sympathies for Jamie. The two-handed episode that he shares with Doherty is troubling yet compelling, and the acting throughout the series (Graham is, once again, likely the standout) is a masterclass (and that’s putting aside the self-imposed constraints of the one-shot technique). The episodes themselves are more of a mixed bag: investigations at a school feel too much like a bog-standard police procedural meets Grange Hill, while the show’s resolution feels calculated towards despair. It is a fine line when creating a show that fictionalises the real experiences faced by real families, between empathy inducement and misery porn. And for Adolescence, that line becomes blurry at times.\nYet there is no doubting the intensity of that first episode. It is television in its purest distillation: unflinching, pulse-quickening. It caters both to our morbid fascination with crimes at the exotic extremes, and the sense of unravelling a moral knot. The fact that the rest of the series can’t quite match those heights is both a problem and a testament to the impact of that opener. Never less than well-made, Adolescence sustains a rawness that makes it a tough but compulsive watch.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.independent.co.uk/news/uk/home-news/meta-google-sexist-adverts-iwd-b2711249.html",
      "text": "Meta, Google accused of ‘censorship’ for blocking women’s health ads but allowing erectile dysfunction campaigns\nExclusive: One company had posts on endometriosis, postnatal recovery and vaginal health removed for promoting ‘illegal products and services’\nOnline platforms are blocking posts and adverts about women’s health while allowing posts about erectile dysfunction, it has been claimed.\nA group of femtech companies – businesses involved in technology products addressing women’s health and wellbeing issues – have accused Meta, which owns Facebook and Instagram, along with LinkedIn, Google and Amazon, of “systemic bias and discrimination” against women’s health content.\nThey said the platforms have given “vague and inconsistent” reasons for repeatedly blocking, removing and restricting content about women’s health, including posts on menopause, endometriosis and infertility.\nThis week, six UK and European companies have issued formal complaints about the platforms to the European Commission, which regulates social media sites and search engines under the Digital Services Act.\nThey have requested it investigates the platforms’ moderation polices – which they say appear to be “biased” against women – and find out why women’s health content is being removed or restricted.\n“We have evidence [of] multiple cases where medically accurate, expert-led content has been blocked or labelled as ‘adult content’ or ‘political’,” said co-founders of the anti-censorship campaign group CensHERship, Clio Wood and Anna O’Sullivan.\n“We can’t improve women’s health if we can’t talk about our bodies using anatomically-correct language.”\nIn one example, a company which makes lubricants for women struggling with painful sex had its educational posts on endometriosis, postnatal recovery and vaginal health removed from LinkedIn for promoting “illegal products and services”.\nA breastfeeding support app had ads restricted by Instagram because they showed an image of a baby breastfeeding. It was also not allowed to use the word “nipple” in educational posts.\nAnd although Meta classes erectile dysfunction as a health condition and allows adverts for treatments, it has repeatedly blocked adverts and posts about a product which helps boost women’s libido, citing its policy which bans promotion of “sexual pleasure or enhancement”.\nOne advert that was restricted under this policy stated: “Finally, a natural libido supplement… Perfect for menopause, gynae-designed, natural supplement.”\nYet an advert for a male libido treatment was allowed, which stated: “Are you tired of performance anxiety ruining your erections? We’ve helped over 500,000 men overcome erection issues… ‘I found that I was more confident about sex. Almost like I was 18 again.’”\nCompany Bea Fertility, which sells at-home fertility testing kits, said it tried to post diagrams and guides to using its products on its Amazon store page, but these were rejected because they contained the word “vagina” – although the word “semen” was allowed.\nThe graphics, which have been seen by The Independent, included practical medical advice such as: “It isn’t safe for you to use [the product] if… you have had vaginal/cervical surgery within the last three months.”\nThese were automatically rejected, with the reason given being: “These keywords violate our community guidelines: vagina.”\nThe action has been organised by CensHERship and women-focused investment group The Case For Her, with companies involved including Bea Fertility, vaginal health brand Aquafit Intimate, the sexual health and wellbeing platforms Geen and HANX, breastfeeding support app Lactapp, and sustainable period care brand Daye.\nThey are calling on the platforms to implement “clear, non-discriminatory advertising guidelines that protect, rather than silence women’s health conversations”.\nCristina Ljungberg, co-founder of The Case For Her, said: “When femtech companies face digital suppression and censorship by the big tech platforms, they struggle to reach customers, limiting their ability to advertise and generate revenue.”\nShe warned that this not only restricted women’s access to health products and services but put off investors funding research and innovation into women’s health.\nAmazon said it had not taken action against the Bea Fertility store or products over its use of the word “vagina”. It said there were multiple products whose titles contained the word sold through its site.\nA LinkedIn spokesperson said: “Our policies outline what is and isn’t allowed. Educational or awareness-related content on health topics is allowed on LinkedIn, as long as it does not promote specific products or services. If an author believes their content has been removed in error, they have the option to appeal and we’ll take a second look.”\nMeta and Google did not respond to requests for comment.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.sexeducationforum.org.uk/news/news/new-polling-shows-young-people-are-being-failed-poor-relationships-and-sex-education",
      "text": "PRESS RELEASE - 1 FEBRUARY 2022\nNew poll reveals the shocking gaps in the provision of Relationships and Sex Education lessons\nA major new survey by the Sex Education Forum shows that young people are still not receiving the comprehensive and quality Relationships and Sex Education (RSE) they were promised when the subject became mandatory over 18 months ago.\nThe survey comes amid growing concerns about the prevalence of sexual harassment in schools, with a 2021 report by Ofsted warning that nearly 90% of girls, and nearly 50% of boys, said being sent explicit pictures or videos of things they did not want to see happens a lot or sometimes to them or their peers.\nDespite this, the survey, commissioned by the Sex Education Forum which represents a broad coalition of organisations linked to the delivery of RSE, has shown over a third (37%) of young people have learned nothing about ‘power imbalances in relationships’, and almost three in ten (29%) learned nothing about how to recognise grooming for sexual exploitation.\nLegislation making RSE statutory in all schools in secondary schools and Relationships Education statutory in all primary schools in England came into effect in September 2020 and was expected to be followed in full since September 2021.\nDisruption due to COVID-19 has impacted the delivery of RSE over the last two years but training and long-term funding is urgently needed by the UK Government to support teachers to deliver RSE.\nThe survey of 1,002 young people aged 16-17 in England has uncovered the extent to which lessons are being inconsistently delivered, often with few opportunities for pupils to even ask questions or influence how RSE lessons can be improved.\nBasics are still not being covered in lessons\nSchools are expected to follow statutory RSE guidance issued by the Department for Education in 2019, which sets out a range of topics. However, many young people report still not receiving the basic information they need about mandatory topics, such as how to recognise healthy relationships (28%). This includes four in ten (40%) of young people saying they learned nothing about FGM.\nDespite young people under 25 experiencing the highest rate of unplanned pregnancy and accounting for the highest rates of new STI diagnoses in England, nearly half of all new cases of sexually transmitted infections in England, one in three (33%) said they didn’t learn about how to access local sexual health services.\nThe topic least likely to be discussed was sexual pleasure, with 46% of young people reporting they learned nothing about this.\nThere is good news in that the traditional topics of RSE, including puberty, pregnancy, and condoms, are among some of the most likely to be discussed in RSE lessons with schools getting the scientific element of RSE right. There had also been some improvements in consent being taught, compared to the 2019 polling.\nHowever, the broader picture is that topics more associated with healthy relationships and the realities of young people’s lives still do not have parity with the more biological aspects of RSE.\nThe quality of lessons fails to improve\nCompared to findings from a survey commissioned by the Sex Education Forum in 2019, there has been no overall improvement in the quality of RSE, in fact the latest poll suggests it is getting worse, with the overall quality down 6 percentage points. Just over one-third (35%) of young people rated the quality of their school RSE as ‘good’ or ‘very good', down 6 percentage points on the rating in 2019. More than one in five (22%) rated the quality of RSE as ‘bad’ or ‘very bad’, an increase of 4 percentage points since 2019.\nJust one in five young people (20%) said they had an ‘opportunity to ask my questions and get answers’ and only one in seven (14%) recalled ‘being asked my opinion about how RSE could be improved' over the last year.\nRSE is not being discussed at home\nThe polling has also shone a light on the gap in conversations about RSE at home. For around one in four young people there has been no RSE from parents and carers; with those who did receive some reporting this was in the form of one big talk or a few separate discussions. Only one in six (17%) of the young people surveyed had regular discussions with parents and carers about RSE.\nWorryingly, one in five respondents said they do not have any trusted adult with whom they feel comfortable discussing matters relating to relationships and sex. The survey also shows boys are less likely than girls to have a trusted adult to have these types of discussions with. Where young people do have a trusted adult they are a female in over three-quarters (77%) of cases.\nMinisters must get a grip on this RSE crisis\nThere was cross-party support for RSE to be made compulsory in schools, and during hearings in Parliament over five years ago, testimonials were heard by MPs from young people about the poor quality of these lessons.\nUrgent attention and investment are now needed to address the lack of progress with delivering the mandatory curriculum and ensuring high-quality RSE for all children and young people. Ministers are being urged to turn this situation around by properly funding RSE training and monitoring progress more closely.\nLucy Emmerson, Chief Executive, Sex Education Forum, said: ‘Relationships and Sex Education lessons became mandatory in all schools because it was the right thing to do after decades of inconsistent delivery of RSE but this new polling shows the extent to which young people are continuing to be failed. Even the basic building blocks of RSE are still being missed and the knock-on effect is young people lacking the skills and knowledge for healthy and respectful relationships.\n‘COVID-19 has had a serious disruption to young people’s education and it has worsened the physical and mental health challenges experienced by young people. However, the poor quality of RSE has long been evidenced and yet Ministers have failed to provide schools with adequate funding to develop the skills and confidence of teachers and provide high-quality support for pupils. We know many schools are getting RSE right, but this isn’t the picture nationally, with teachers urging Ministers to get a grip of this situation, we stand with them in demanding action is taken now with proper and long-term investment in training and resources.\n‘Young people are clear that they want RSE to be discussed at home, through open and supportive conversations, that better equip them for the challenges they face on a daily basis. Parents and carers are willing but need support to get started.\nToday's polling must be a wake-up call to the Government to change course. Without an immediate intervention, we seriously risk letting down another generation of young people.’\nLewis Ruddock, Externals and Press Director, Sexpression:UK, said ‘The results of the poll exemplify what we have long known, young people want and need more RSE. We must listen to young people and tailor RSE to what they find relatable and useful.\n‘The introduction of statutory RSE was a huge step, yet it is heavily reliant on quality implementation across England to be a success. Due to the variable support available to schools, young people are still missing out on high-quality comprehensive RSE. With gaps at home, many young people depend on schools for RSE, as such, schools need adequate support to facilitate this. Sexpression:UK fully supports the Sex Education Forum in pushing for relevant measures including training, monitoring and funding to ensure schools are fully equipped to deliver RSE that young people need, want and deserve.’\nAbout Sexpression:UK\nSexpression:UK, a partner of the Sex Education Forum, is a near-peer independent UK charity with the goal of empowering young people to make decisions about relationships and sex by running informal and comprehensive RSE in the community.\nAbout the Sex Education Forum\nAs the voice of Relationships and Sex Education (RSE) in England we promote and protect the physical and mental health of children and young people by improving their access to RSE.\nWe bring together our partners and wider stakeholders to share best practice, research, monitor the provision of RSE, explore and respond to new themes and identify gaps. Working together with our partners, members and wider stakeholders is central to everything we do. We support educators with high-quality training, resources and a membership scheme, so they can be competent and confident providers of RSE, in partnership with parents, carers, children and young people.\nEmail: [email protected]\nTel: 07523 911016\nRead the Young People's RSE Poll 2021 report in full\nENDS\nShare"
    },
    {
      "url": "https://www.independent.co.uk/life-style/love-sex/cindy-gallop-make-love-not-porn-social-sexual-revolution-sex-toys-watch-ted-talk-gender-equality-hardcore-porn-a7598046.html",
      "text": "Cindy Gallop: Meet the woman who wants you to join the social sexual revolution\nBadass, kickass and everything else positive about the ass - that's the passionate, feminist entrepreneur who is determined to make her adult video company part of mainstream culture\nI first met Cindy Gallop after watching 40 minutes of sex.\nAt a recent event at the Ace Hotel in Manhattan, Cindy, with her signature blonde bob and black jumpsuit, took to the stage.\nShe introduced her company, Make Love Not Porn, and told us we were about to watch real couples having real sex. It was a celebration of the messiness and the awkwardness of real intimacy, she said, as well as a fabulous chance to see what everyone else is really doing in bed. She had also been working on the TV channel for four years and already made $500,000 revenue.\nWe were going to watch sex together - now? I shifted in my chair and considered walking out. That was when she hit the play button.\nWe watched - delighted, horrified, aroused - as couples engaged in bedroom activity, including a lesbian couple alternately coughing on a dildo and a man masturbating in a sea cave. Some of the videos came with commentary: \"This is for you, John\", or, \"God, doesn’t he have a nice bum?\" In one video, a marmalade cat jumped onto the bed and settled down for a nap while its two owners loudly reached climax. The cat flicked its tail, positively uninterested. Everyone laughed.\nAfter the showreel, Cindy insisted that the motivations and social dynamics of couples filming themselves were no different to couples who post pictures of their romantic weekend on Facebook.\n\"'We are madly in love and here we are in Paris, kissing in front of the Eiffel Tower, or strolling along the Seine’,\" she said. \"'With Make Love Not Porn, it’s here are, madly in love, and here’s the great sex we had in the hotel room'.\"\nCindy is a champion and advocate for what she terms the sex tech revolution - any form of technology that disrupts, enhances or improves the human sexual experience. In her ideal world, her 200 MLNP stars would be as big as YouTube celebrities (FYI, she needs more content from gay men and couples of colour) and people would generate and source sharable content to learn about and enjoy sex online - all age appropriate, of course.\nBut most social media websites shut down users for posting such content, another serious hurdle for Cindy’s business model. She pays the stars 50% of rental proceeds for videos that they film themselves, and which are vetted and curated by MLNP. The videos are protected by very strict privacy settings. If a couple breaks up, the videos are taken down. But the \"fear of what other people will think\" is a curse on innovation, Cindy said, and the journey has been a long slog.\nWhat is so frustrating for her is that the company could be a multi-million dollar platform.\nMake Love Not Porn was born out of massive response to Cindy’s 2009 Ted Talk about her experience of dating younger men.\n\"I was the first person on Ted Talks to say 'come on my face' six times,\" she said proudly.\nIt got 1.8 million views. She realised she had uncovered a massive social issue. The issue, she said, is when \"hardcore porn meets a reluctance to talk openly about sex, and porn becomes sex education.\"\n“When you normalise sex, you end sexual abuse; when you talk openly about sex, you don’t bring Brock Turners into this world; you end a situation where perpetrators can rely on their victims’ shame and humiliation to not speak up,\" she said.\nWhile men and even young boys are increasingly being fed hardcore porn, women grow up with chick-flicks, what Cindy calls a \"pink it and shrink it\" industry.\n\"Bollocks to that condescension,\" she said. \"That’s just because white guys are talking to other white guys at the top of the publishing and film industries. Women enjoy sex just as much as men and men are just as romantic as women.\"\nThe vision and Cindy’s passion remains the same after nine years, but despite intense media coverage, she is still mostly known as the woman who talked about having sex with younger men.\nAt her Fifth Avenue penthouse on two sleek grey sofas - again dressed in black leather - she said she decided to take ownership of the word \"cougar\" and make it into something positive.\n\"We don’t have enough role models who demonstrate that you can live your life as you choose and still be happy,\" she said.\nHer one criteria for dating younger men on cougar websites? The young man has to be a really nice person. Empathy, loyalty and generosity are all qualities that should be applied in the bedroom - or the bathroom, living room or kitchen - just like in the office or down the pub.\nWhat happens, I asked tentatively, if you fall for one of these men?\n\"I’m not a relationship person,\" she replied. \"I actively look forward to dying alone.\"\nLike all serious entrepreneurs, her life appears to be dominated by work. After three decades in advertising, she spent the next raising cash for MLNP and travelling the world, speaking about the social sex revolution and convincing people that they want to buy gender diversity-friendly sex videos.\n\"Oh, God,\" Cindy said, briefly putting her face in her hands when I bring up the question of fundraising. \"I would never have wanted to fundraise again but the reason I have to is that there is often 'no adult content' in the small print and we need funding and resources to overcome that.\"\nBut after nine years, she realised something - she had to invest in the infrastructure of the sex tech market.\n\"If you truly want to change shit up, you have to change the world to make it fit,\" she said.\nThat philosophy led to her next plan: to raise $10 million and launch a fund that invests in a small portfolio of sex tech companies. One of the companies will be MLNP. She also mentioned Tina Gong, who invented an app called HappyPlayTime for women to work out how to get themselves off. Also on the list is Dame, which invented a vibrator called Eva for women to use during penetrative sex, and wearable sex toy company Wisp - among its range is a bracelet which emits air onto your skin like a lover’s breath.\nCindy’s vision is for the fund to hit $100 million.\n\"I’m looking for people who understand what we are about and also those who want to make a shit ton of money,\" she said.\nShe plans to expand the MLNP website (it's only 30 per cent finished) to include sexual education. No one, she said, is making money from sexual education, although it’s valuable work. Written erotica is also on the cards. She gets sent screeds of the stuff already.\n\"I’m so glad people write to us but oh my god it’s awful,\" she confided. \"The vocab is so limited. It’s cliche.\"\nSo how long do women and men have to wait for this social sex revolution to become mainstream culture? Even women who post pictures of themselves breast-feeding their children are kicked off social media.\n\"We are going backwards as a society,\" she nodded. \"But at MLNP, we are a celebration of body positivity and intimacy. Couples and individuals tell us that they love themselves more after filming. Couples say the filming has transformed their relationships, because it forces them to talk to each other.\"\nIn an age where everyone is insecure with their bodies and people are desperate for information, MLNP seems like a good place to start adopting Cindy’s philosophy of \"sexual education through demonstration”.\"\nPut simply, everyone in her videos is having a bloody good equal time.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "url": "https://www.intimacyjustice.org/report2025",
      "text": "Menopause, menstrual cups, vulva, endometriosis, abortion, and UTI aren’t bad words…\nSo why are these topics censored by Meta, TikTok, Google, and Amazon?\nFrom account suspensions to content removal, Meta, Amazon, TikTok, and Google are suppressing content on sexual and reproductive health for women and people of diverse genders.\n“Censorship has impacted our ability to reach a wider audience on social media, which is preventing people from receiving potentially life saving sexual health information.”\nCenter for Intimacy Justice’s new 2025 report is the most comprehensive, publicly available investigation to date on Big Tech’s suppression of sexual and reproductive health information for women and people of diverse genders.\nWe analyzed experiences of 159 non-profits, businesses, and content creators that serve people in over 180 countries exploring the tumultuous landscape of digital suppression across Meta, Amazon, Google, and TikTok.\nWe believe that every person deserves access to the information they need to maintain their sexual and reproductive health – from information about self-screening for breast cancer to having safe and pleasurable sex during menopause. When we block information supporting women and people of underrepresented genders online, we are encouraging stigma, bias, and discrimination offline.\nBig Tech can’t block us now.\nJoin our movement.\nSign up to receive updates and information\nContact Information (For Press): press@intimacyjustice.org"
    },
    {
      "url": "https://www.independent.co.uk/extras/indybest/house-garden/bedroom/harry-styles-pleasing-yourself-lube-sex-toys-vibrator-b2796010.html",
      "text": "Harry Styles’s new venture is sex toys – here’s what to know\nThe former One Direction singer has entered the sexual wellness space\nBreaking the mould of celebrity beauty brands (see Hailey Bieber and Selena Gomez), Harry Styles has unveiled his latest business venture: sex toys.\nThe singer launched his unisex lifestyle brand Pleasing in 2021. In the years since, he’s sold an eclectic mix of nail polishes, hand creams, apparel, accessories, skincare sets, and fragrances. Now, he’s dipping his toe into the sexual wellness world with two new products: a double-sided vibrator (£68) and pleasing lube (£25).\nIn the teaser clip on Instagram, Styles’ voiceover says: “Please yourself like you mean it.” Naturally, the announcement has sent fans of the former One Direction singer into a frenzy. In the comments, one writes: “Does the vibrator come with this message playing on loop? Asking for a friend.” Another reads: “My body’s jumped right OUT of menopause.”\nStyles isn’t the first celebrity to tap into this industry – Lily Allen famously launched a sell-out sex toy line with Womaniser, while Dakota Johnson is creative co-director of the sexual wellness brand Maude. The Pleasing launch is set to further tackle the taboo around women taking control of their own pleasure.\nIn fact, the brand will continue to develop products in the sexual wellness space, including a collaboration with Planned Parenthood Federation of America, launching condoms and creating educational videos.\nHere’s everything you need to know about Harry Styles’s new range of sex toys.\nPleasing double-sided vibrator: £68, Pleasing.com\nPleasing designed its sex toy in collaboration with sex educator (and self-confessed “dildo duchess”) Zoë Ligon.\nWhile we’re yet to test this vibrator, it’s said to cater for a range of bodies, sexualities and desires. The double-sided toy features a rounded head for external use, with the handle doubling up as an insertable vibrator. It also has seven speed settings and two motors, and is water-resistant (but don’t take it in the bath as it can’t be submerged).\nTalking about the launch on the brand’s website, Ligon said it’s “a great toy for both those new to sex toys and experienced users alike; it’s versatile, offers many ways to play”.\nYou can sign up for a notification when the sex toy is available to buy.\nPleasing lube: £25, Pleasing.com\nPleasing has also launched a silicone lube, which is FDA-approved and is compatible with most condoms and non-silicone sex toys. We’re yet to test the product, so we can’t vouch for its efficacy, but it’s said to offer long-lasting moisture and a smooth glide. Of course, it’s bottled up in Pleasing’s signature stylish aesthetic.\nYou can sign up for a notification when the lube is available to ship.\nDiscover more of the best sex toys, tested by our resident expert"
    },
    {
      "url": "https://www.northumbria.ac.uk/about-us/our-staff/a/carolina-are/",
      "text": "-\nStudy\n-\nClearing 2025\n- Clearing FAQs\n- Clearing VIP\n- Clearing Case Studies\n- Unlock Your Potential\n- Scholarships\n- Search Clearing\n-\nUndergraduate\n- UCAS Clearing & Confirmation 2025\n- Application Guides\n- UCAS Exhibitions\n- Foundation Years\n- School & College Outreach\n- Information for Parents\n-\nPostgraduate\n- Application Guide\n- Postgraduate Research Degrees\n- Flexible Learning\n- Change Direction\n- Register your Interest\n-\nStudent Life\n- Students' Union\n- The Hub - Student Blog\n- Accommodation\n- Northumbria Sport\n- Support for Students\n-\nLearning Experience\n- Real-World Learning\n- Research-enriched learning\n- Graduate Futures\n- The Business Clinic\n- Study Abroad\n-\n-\nInternational\nInternational\nNorthumbria’s global footprint touches every continent across the world, through our global partnerships across 17 institutions in 10 countries, to our 277,000 strong alumni community and 150 recruitment partners – we prepare our students for the challenges of tomorrow. Discover more about how to join Northumbria’s global family or our partnerships.\nView our Global Footprint-\nQuick Links\n- Course Search\n- Undergraduate Study\n- Postgraduate Study\n- Information for Parents\n- London Campus\n- Northumbria Pathway\n- Cost of Living\n- Sign up for Information\n-\nInternational Students\n- Information for Students\n- International Events\n- Application Guide\n- Entry Requirements and Education Country Agents\n- Global Offices\n- English Requirements\n- English Language Centre\n- International student support\n- Cost of Living\n-\nInternational Fees and Funding\n- International Undergraduate Fees\n- International Undergraduate Funding\n- International Masters Fees\n- International Masters Funding\n- International Postgraduate Research Fees\n- International Postgraduate Research Funding\n-\nInternational Partners\n- Agent and Representatives Network\n- Global Partnerships\n- Global Community\n-\nInternational Mobility\n- Study Abroad\n- Information for Incoming Exchange Students\n-\n-\nBusiness\nBusiness\nThe world is changing faster than ever before. The future is there to be won by organisations who find ways to turn today's possibilities into tomorrows competitive edge. In a connected world, collaboration can be the key to success.\nMore on our Business Services -\nResearch\nResearch\nNorthumbria is a research-rich, business-focused, professional university with a global reputation for academic quality. We conduct ground-breaking research that is responsive to the science & technology, health & well being, economic and social and arts & cultural needs for the communities\nDiscover more about our Research-\nQuick Links\n- Research Peaks of Excellence\n- Academic Departments\n- Research Staff\n- Postgraduate Research Studentships\n- Research Events\n-\nResearch at Northumbria\n- Interdisciplinary Research Themes\n- Research Impact\n- REF\n- Partners and Collaborators\n-\nSupport for Researchers\n- Research and Innovation Services Staff\n- Researcher Development and Training\n- Research Ethics and Integrity\n- University Library\n- Vice Chancellors Fellows\n-\nResearch Degrees\n- Postgraduate Research Overview\n- Doctoral Training Partnerships and Centres\n- Academic Departments\n-\nResearch Culture\n- Research Culture\n- Research Culture Action Plan\n- Concordats and Commitments\n-\n-\nAbout Us\n-\nAbout Northumbria\n- Our Strategy\n- Our Staff\n- Place and Partnerships\n- Leadership & Governance\n- Academic Departments\n- University Services\n- History of Northumbria\n- Contact us\n- Online Shop\n-\n-\nAlumni\nAlumni\nNorthumbria University is renowned for the calibre of its business-ready graduates. Our alumni network has over 246,000 graduates based in 178 countries worldwide in a range of sectors, our alumni are making a real impact on the world.\nOur Alumni - Work For Us"
    },
    {
      "url": "https://www.independent.co.uk/news/uk/politics/abc-opinium-balance-b2607282.html",
      "text": "Seven in 10 children exposed to harmful content online – research\nFigures also show that a fifth of children in the nine to 13 age group have been contacted by a stranger.\nSeven in 10 children aged between nine and 13 say they have been exposed to harmful experiences or content online, according to new research.\nFigures also show that a fifth of children in the same age group have been contacted by a stranger.\nThe data, released on Thursday by charity Internet Matters in partnership with Opinium, found 17% of nine to 13-year-olds have seen content that promotes online stunts or challenges.\nOther harmful online experiences reported by children in this age group include coming across hate speech (13%), coming across mis/disinformation (15%) and one in ten have seen violent content or content that promotes violence.\nThe children were also reported to be spending 23.2 hours online each week, two hours more than their parents realise.\nInternet Matters warned parents were “underestimating” the amount of time their children spend online, “which unknowingly may further expose and leave them open to further risks”.\nThe study is based on research conducted between May and June among 1,000 children aged nine to 17, 2,000 parents of children aged three to 17 and a further 1,000 parents of children aged five to 17.\nThe group said it chose to research this age group as it is a time “where many may be getting their first smartphone and have increased access to the digital world”.\nAbout three-quarters (74%) of parents surveyed said they do not use browser safe search settings or filters, potentially leaving children just a few clicks away from accessing harmful content – even if they are not intentionally searching for it.\nMeanwhile, about two-thirds (67%) of parents do not use parental controls on their home broadband.\nIn a bid to help parents, Internet Matters has launched a Government-supported “ABC online safety checklist” which covers a series of actions for parents to take.\nThe ABC checklist is:\nActivate parental controls – Use the controls and tools available from broadband providers, online platforms and apps to install safe search settings, block inappropriate content and prevent contact from strangers.\nBalance screen time – Agree a good balance for your children’s screen time, taking education and leisure content into account. Explore whether your child’s screen time is more passive than active and consider setting limits for the total hours spent online each day.\nCheck and chat – Check which apps your children are using and the relevant age limits for each platform. Talk regularly about online safety and what they might come across – it might seem daunting , but your children will benefit. Reassure them that you can work together to manage any risks and make their online experiences as positive as possible.\nBaroness Jones, minister for online safety, said: “Creating a safer online world is vital for children and the health of our wider society.\n“The Online Safety Act will introduce major obligations to protect children from harmful content online and we are committed to getting these protections in place as quickly as possible.\n“It is also important parents are supported to make informed choices about their children’s social media use and resources like Internet Matters’ online safety checklist will help parents get the online balance right for their families.”\nRachel Huggins, co-chief executive of Internet Matters, said: “With technology constantly evolving, there’s so much to think about when it comes to online safety that parents and carers are quite simply overwhelmed. We want to help them protect their children online while still enjoying all the benefits the internet has to offer.\n“Thinking about online safety comes on top of all the jobs parents already have, so the ABC checklist gives them a place to start with some actionable tasks that can make a real difference and give them added peace of mind.”"
    },
    {
      "url": "https://www.independent.co.uk/tech/meta-london-kings-cross-facebook-b2362941.html",
      "text": "Meta rejects accusation of censorship of language around female body\nDemonstrators gathered outside the company’s London office in King’s Cross on Friday morning.\nTechnology giant Meta has rejected an accusation of online censorship as protesters called for language around women’s bodies to be normalised.\nDemonstrators gathered outside the company’s London office in King’s Cross on Friday morning.\nShe Oath, described as a female empowerment charity, joined representatives from period product firm Bodyform, which is running a campaign aimed at normalising use of words such as vagina, clitoris and vulva online.\nBodyform said that since launching its campaign it has been “slapped with multiple violations of Meta’s ad policy – deeming their content as too sexual and labelling it with an 18+ warning”.\nIt says menstrual health “shouldn’t be censored” and doing so makes “important subjects, that are already taboo, almost impossible to talk about”, affecting lives and health.\nBut Meta said some adverts had been removed by mistake and had since been reinstated, and apologised for any confusion.\nThe company said it has no blanket ban on words like menopause or vagina, adding that adverts are governed by a stricter set of policies “because they receive paid distribution to appear in people’s feeds”.\nShe Oath’s founder Brookmorgan Henry-Rennie said: “We use our platform to educate, entertain and inform around subject matters like authentic confidence, women’s health and well-being.\n“So this shadow-banning is not just depriving trauma-experienced girls and women from gaining access to our resources, it’s putting them in further danger. These are our bodies and we shouldn’t be shamed or cast into the shadows for what we naturally have to experience.\n“If it wasn’t for Bodyform’s ads being banned, we wouldn’t have even realised that our posts were being deprioritised.\n“Meta really does need to do better.”\nRuth Gresty, spokesperson for Bodyform, said: “It’s unfortunate but not surprising that our latest campaign, which calls out the unnecessary censorship of words commonly used to talk about, describe and define women’s bodies and their experiences, has been censored by some social media companies.\n“In doing so, these companies have simply underlined the need for campaigns of this nature that seek to break down the barriers that prevent women from being able to speak openly and confidently about their bodies.\n“We at Bodyform will not be deterred from our mission to make talking about the female body normal.”\nA spokesperson for Meta, which owns Facebook, said: “We want Facebook to be a place where people can express themselves and we are proud of the way our community uses the platform to have important and open conversations about women’s health.\n“The adverts were removed by mistake by our automated review systems and have since been reinstated. We apologise for any confusion caused.”"
    }
  ],
  "argos_summary": "A sexual revolution led by women in the wellness and sextech industries is challenging long-standing stigmas surrounding female and queer sexual agency. Despite the rising demand for sexual wellness services, these businesses face significant hurdles, including censorship from major tech platforms that often misclassify their content as 'adult', limiting their visibility and funding opportunities. This censorship not only stifles innovation but also restricts access to vital sexual health information, particularly for women and gender-diverse individuals, exacerbating issues like the pleasure gap and inadequate sex education.",
  "argos_id": "TH7RT2V7M"
}