{
  "url": "https://www.usatoday.com/press-release/story/11925/diamond-drilling-begins-at-tolmer-discovery/",
  "authorsByline": "accesswire",
  "articleId": "44538d9304c54920b71d6c3b4e92ba25",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "http://usatoday.xpr-gannett.com/wp-content/uploads/sites/3/2025/08/bart111.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:24:10+00:00",
  "addDate": "2025-08-13T01:34:34.885175+00:00",
  "refreshDate": "2025-08-13T01:34:34.885176+00:00",
  "score": 1.0,
  "title": "Diamond Drilling Begins at Tolmer Discovery",
  "description": "HIGHLIGHTS March 2025 Tolmer discovery hole ranked 5th highest-grade silver intersection reported globally during H1 2025, with an interval of 6m @ 4,747 g/t Ag from only 46m depth1 New assays have extended high grade silver horizons, and added coincident high-grade gold up to ~13g/t Au, within a highly mineralised footprint now ~1.5km wide2 ADELAIDE, […]",
  "content": "• March 2025 Tolmer discovery hole ranked 5th highest-grade silver intersection reported globally during H1 2025, with an interval of 6m @ 4,747 g/t Ag from only 46m depth1\n• New assays have extended high grade silver horizons, and added coincident high-grade gold up to ~13g/t Au, within a highly mineralised footprint now ~1.5km wide2\n\nADELAIDE, AUSTRALIA / ACCESS Newswire / August 10, 2025 / Barton Gold Holdings Limited (ASX:BGD)(FRA:BGD3)(OTCQB:BGDFF) (Barton or Company) is pleased to confirm diamond drilling (DD) has commenced at the Tolmer prospect, located at the Company’s South Australian Tarcoola Gold Project (Tarcoola). An initial program of 3 holes totalling ~550 metres drilling is planned in the ‘eastern gold zone’ to investigate local structural controls and guide future targeting.\n\nFull details are contained in the complete announcement, which can be accessed on the ASX website, the investor section of Barton’s website, or directly by clicking here.\n\nCommenting on the Tolmer diamond drilling, Barton Managing Director Alexander Scanlon said:\n\n“Tolmer is an exciting new discovery located between our existing Central Gawler Mill and planned Tunkillia mill. With gold and silver grades up to 83.6g/t Au and 17,600g/t Ag, Tolmer has clear potential to add significant value to our regional development strategy. This diamond drilling will help improve our local structural knowledge as we work to identify the origins of such high-grade mineralisation.”\n\n1 According to Rock Report analysis available here and at https://rockreportnews.com/graphics/; refer to ASX announcement dated 27 March 2025\n\n2 Refer to ASX announcement dated 5 August 2025\n\nAuthorised by the Managing Director of Barton Gold Holdings Limited.\n\nFor further information, please contact:\n\nAbout Barton Gold\n\nBarton Gold is an ASX, OTCQB and Frankfurt Stock Exchange listed Australian gold developer targeting future gold production of 150,000ozpa with 2.1Moz Au & 3.1Moz Ag JORC Mineral Resources (78.9Mt @ 0.85 g/t Au), brownfield mines, and 100% ownership of the region’s only gold mill in the renowned Gawler Craton of South Australia.*\n\nCompetent Persons Statement & Previously Reported Information\n\nThe information in this announcement that relates to the historic Exploration Results and Mineral Resources as listed in the table below is based on, and fairly represents, information and supporting documentation prepared by the Competent Person whose name appears in the same row, who is an employee of or independent consultant to the Company and is a Member or Fellow of the Australasian Institute of Mining and Metallurgy (AusIMM), Australian Institute of Geoscientists (AIG) or a Recognised Professional Organisation (RPO). Each person named in the table below has sufficient experience which is relevant to the style of mineralisation and types of deposits under consideration and to the activity which he has undertaken to quality as a Competent Person as defined in the JORC Code 2012 (JORC).\n\nThe information relating to historic Exploration Results and Mineral Resources in this announcement is extracted from the Company’s Prospectus dated 14 May 2021 or as otherwise noted in this announcement, available from the Company’s website at www.bartongold.com.au or on the ASX website www.asx.com.au. The Company confirms that it is not aware of any new information or data that materially affects the Exploration Results and Mineral Resource information included in previous announcements and, in the case of estimates of Mineral Resources, that all material assumptions and technical parameters underpinning the estimates, and any production targets and forecast financial information derived from the production targets, continue to apply and have not materially changed. The Company confirms that the form and context in which the applicable Competent Persons’ findings are presented have not been materially modified from the previous announcements. This document may contain forward-looking statements. Forward-looking statements are often, but not always, identified by the use of words such as “seek”, “anticipate”, “believe”, “plan”, “expect”, “target” and “intend” and statements than an event or result “may”, “will”, “should”, “would”, “could”, or “might” occur or be achieved and other similar expressions. Forward-looking information is subject to business, legal and economic risks and uncertainties and other factors that could cause actual results to differ materially from those contained in forward-looking statements. Such factors include, among other things, risks relating to property interests, the global economic climate, commodity prices, sovereign and legal risks, and environmental risks. Forward-looking statements are based upon estimates and opinions at the date the statements are made. Barton undertakes no obligation to update these forward-looking statements for events or circumstances that occur subsequent to such dates or to update or keep current any of the information contained herein. Any estimates or projections as to events that may occur in the future (including projections of revenue, expense, net income and performance) are based upon the best judgment of Barton from information available as of the date of this document. There is no guarantee that any of these estimates or projections will be achieved. Actual results will vary from the projections and such variations may be material. Nothing contained herein is, or shall be relied upon as, a promise or representation as to the past or future. Any reliance placed by the reader on this document, or on any forward-looking statement contained in or referred to in this document will be solely at the readers own risk, and readers are cautioned not to place undue reliance on forward-looking statements due to the inherent uncertainty thereof. *Refer to Barton Prospectus dated 14 May 2021 and ASX announcement dated 25 July 2025. Total Barton JORC (2012) Mineral Resources include 1,049koz Au (39.7Mt @ 0.82 g/t Au) in Indicated category and 1,095koz Au (39.2Mt @ 0.87 g/t Au) in Inferred category, and 3,070koz Ag (34.5Mt @ 2.80 g/t Ag) in Inferred category as a subset of Tunkillia gold JORC (2012) Mineral Resources.",
  "medium": "Article",
  "links": [
    "https://www.accessnewswire.com/newsroom/en/metals-and-mining/diamond-drilling-begins-at-tolmer-discovery-1058851",
    "https://www.accessnewswire.com/",
    "https://pr.report/d4ud",
    "https://pr.report/d4u4",
    "https://pr.report/d4ue",
    "https://pr.report/d4up",
    "https://pr.report/d4uo"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mineral Resource information",
      "weight": 0.07460768
    },
    {
      "name": "ASX announcement",
      "weight": 0.07077665
    },
    {
      "name": "JORC Mineral Resources",
      "weight": 0.06970969
    },
    {
      "name": "Barton Gold",
      "weight": 0.06734172
    },
    {
      "name": "t Au",
      "weight": 0.06643482
    },
    {
      "name": "Mineral Resources",
      "weight": 0.06520606
    },
    {
      "name": "Barton Gold Holdings Limited",
      "weight": 0.065121375
    },
    {
      "name": "information",
      "weight": 0.06493257
    },
    {
      "name": "further information",
      "weight": 0.06361441
    },
    {
      "name": "forecast financial information",
      "weight": 0.06315725
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.8525390625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.83642578125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.78564453125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.73681640625
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.6416015625
    }
  ],
  "sentiment": {
    "positive": 0.5191256,
    "negative": 0.030290594,
    "neutral": 0.45058385
  },
  "summary": "Diamond drilling has begun at the Tolmer prospect in South Australia, with an interval of 6m @ 4,747 g/t Ag from only 46m depth. The discovery was located at Barton Gold's Tarcoola Gold Project (Tarcoola). Initial program of 3 holes totalling ~550 metres is planned to investigate local structural controls and guide future targeting. The company's Managing Director, Alexander Scanlon, stated that the drilling will help improve local structural knowledge and help identify the origins of high-grade mineralisation. The information relating to historic Exploration Results and Mineral Resources is based on information prepared by the Competent Person, who is an employee of or independent consultant to the Company and is a Member or Fellow of the Australasian Institute of Mining and Metallurgy (AusIMM), Australian Institute of Geoscientists (AIG), or Recognised Professional Organisation (RPO).",
  "shortSummary": "Barton Gold Holdings Limited has begun diamond drilling at the Tolmer discovery in South Australia, aiming to improve structural knowledge and gold resource estimates.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "44190fa7e78945be81bf95682ef70d15",
  "places": [
    {
      "osmId": "3020054285",
      "county": "Pastoral Unincorporated Area",
      "state": "South Australia",
      "country": "Australia",
      "countryCode": "au",
      "coordinates": {
        "lat": -30.70256,
        "lon": 134.45587
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Barton Gold Holdings Limited has commenced diamond drilling at the Tolmer prospect in South Australia, following the discovery of high-grade silver and gold intersections, including 6m @ 4,747 g/t Ag and up to 13 g/t Au. The drilling program aims to explore local structural controls and enhance targeting for future development. The Tolmer site has shown significant potential to contribute to the company's regional development strategy, with impressive mineralization grades reported.",
  "argos_id": "TMBH86H70"
}