{
  "url": "https://www.washingtontimes.com/news/2025/aug/12/ice-ordered-judge-improve-conditions-nyc-immigration-detainees/",
  "authorsByline": "Michael R. Sisak, The Washington Times https://www.washingtontimes.com",
  "articleId": "2705cece38c84373b1669b89906e8e49",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/12/US_Immigration_Detention_14929_c0-200-4800-3000_s1200x700.jpg?be02a3e95bf7d82084e600722760380ca065441f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:17:19+00:00",
  "addDate": "2025-08-13T00:22:18.036146+00:00",
  "refreshDate": "2025-08-13T00:22:18.036148+00:00",
  "score": 1.0,
  "title": "Judge orders ICE to improve conditions after NYC immigration detainees complain of mistreatment",
  "description": "A federal judge ordered the Trump administration Tuesday to immediately improve conditions at a New York City immigration holding facility, acting on complaints by jailed migrants that it is dirty, smelly and overcrowded.",
  "content": "NEW YORK — A federal judge ordered the Trump administration Tuesday to immediately improve conditions at a New York City immigration holding facility, acting on complaints by jailed migrants that it is dirty, smelly and overcrowded.\n\nJudge Lewis A. Kaplan, ruling in a lawsuit filed on behalf of detainees, issued a temporary restraining order requiring U.S. Immigration and Customs Enforcement to limit capacity, ensure cleanliness and provide sleeping mats in so-called hold rooms at 26 Federal Plaza, a government building in Manhattan.\n\nCellphone video recorded last month by a detainee showed about two dozen men crowded in one of the building’s four hold rooms, many lying on the floor with thermal blankets but no mattresses or padding.\n\nIn court filings, detainees complained they had no soap, toothbrushes or other hygiene products. They said they were fed inedible “slop” and endured the “horrific stench” of sweat, urine and feces, in part because the rooms have open toilets. One woman having her period couldn’t use menstrual products because women in her room were given just two to divvy up, the lawsuit said.\n\nKaplan ordered immigration officials to allocate 50 square feet (4.6 square meters) per person - shrinking the largest hold room’s capacity to about 15 people after detainees said 40 or more were being jammed in. The building, home to immigration court and the FBI‘s New York field office, has become an epicenter of President Donald Trump’s crackdown on illegal immigration.\n\nThe judge ordered the government to thoroughly clean the cells three times a day and provide an adequate supply of hygiene products. Addressing concerns that detainees weren’t able to communicate with lawyers, Kaplan ordered the government to make accommodations for confidential legal telephone calls.\n\n“My conclusion here is that there is a very serious threat of continuing irreparable injury, given the conditions that I’ve been told about,” Kaplan said at a hearing Tuesday where a government lawyer conceded that some of the complaints were valid.\n\n“I think we all agree that conditions at 26 Federal Plaza need to be humane, and we obviously share that belief,” government lawyer Jeffrey S. Oestericher said, adding that he agreed “inhumane conditions are not appropriate and should not be tolerated.”\n\nThe lawsuit - filed by the immigrant rights organization Make the Road New York, the New York Civil Liberties Union and the American Civil Liberties Union - sought court intervention to end what plaintiff lawyer Heather Gregorio called “inhumane and horrifying conditions.”\n\nSome detainees have been held at 26 Federal Plaza far longer than the 72-hour norm, Gregorio said.\n\nMurad Awawdeh, the president and CEO of the New York Immigration Coalition, welcomed Kaplan’s ruling as a “step forward” but said the facility “must be shut down permanently.”\n\nNew York City Comptroller Brad Lander, who was arrested at 26 Federal Plaza in June after he tried to lock arms with a person authorities were attempting to detain, said the decision “is a much-needed rebuke of Trump’s cruel immigration policies.”\n\nIn a sworn declaration, Nancy Zanello, of ICE’s New York City Field Office of Enforcement and Removal Operations, wrote that as of Monday, a total of 24 people were held in the building’s four hold rooms - well shy of the city fire marshal’s 154-person cap.\n\nEach room has at least one toilet and sink, and hygiene products are available, including soap, teeth cleaning wipes and feminine products, Zanello said.\n\nSergio Barco Mercado, the lawsuit’s named plaintiff, said in a court filing that he was held at 26 Federal Plaza for two days last week after his arrest there while leaving an immigration court hearing.\n\nBarco Mercado, a native of Peru who said he sought asylum in the U.S. in 2022, said his hold room was “extremely crowded,” cold and “smelled of sewage,” and that the conditions exacerbated a tooth infection that swelled his face and altered his speech.\n\n“We did not always get enough water,” Barco Mercado said. “There was one guard who would sometimes hold a bottle of water up and people would wait to have him squirt some into our mouths, like we were animals.”\n\nAnother detainee, Carlos Lopez Benitez, said he fled violence in Paraguay in 2023 and was seeking asylum in the U.S. when he was arrested in July while leaving an immigration hearing. He said officers told him he’d be in detention until a 2029 hearing on his asylum application.\n\nLopez Benitez said an officer showed him a cellphone photo of his arrest and mocked him for crying. In his holding cell, he said, officers blasted air conditioning and doled out meals that “looked like dog food.”",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "NYC immigration detainees",
      "weight": 0.07507678
    },
    {
      "name": "New York City",
      "weight": 0.074708834
    },
    {
      "name": "New York",
      "weight": 0.07202083
    },
    {
      "name": "immigration court",
      "weight": 0.06944966
    },
    {
      "name": "New York City Comptroller Brad Lander",
      "weight": 0.067400746
    },
    {
      "name": "inhumane conditions",
      "weight": 0.06270012
    },
    {
      "name": "government lawyer Jeffrey S. Oestericher",
      "weight": 0.06015394
    },
    {
      "name": "detainees",
      "weight": 0.05972259
    },
    {
      "name": "immigration officials",
      "weight": 0.059580952
    },
    {
      "name": "a New York City immigration holding facility",
      "weight": 0.05909757
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "US Politics"
    },
    {
      "name": "Immigration"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.9248046875
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.9208984375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.91259765625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.66650390625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.576171875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.56787109375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.451416015625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.3505859375
    }
  ],
  "sentiment": {
    "positive": 0.0485938,
    "negative": 0.7634827,
    "neutral": 0.1879235
  },
  "summary": "A federal judge has ordered the U.S. Immigration and Customs Enforcement (ICE) to immediately improve conditions at a New York City immigration holding facility, 26 Federal Plaza, following complaints by detainees that it is dirty, smelly and overcrowded. The judge, Lewis A. Kaplan, issued a temporary restraining order requiring ICE to limit capacity, ensure cleanliness and provide sleeping mats in the holding rooms. The detainees had complained about lack of soap, toothbrushes, and open toilets, and said they were fed inedible slop and were fed \"slop\" of sweat, urine and feces. The lawsuit was filed by the immigrant rights organization Make the Road New York, the New York Civil Liberties Union and the American Civil Liberties Association. The New York Immigration Coalition called for the facility to be shut down permanently.",
  "shortSummary": "A federal judge ordered ICE to improve conditions at 26 Federal Plaza, New York City, amid complaints of overcrowding, dirty, and inadequate hygiene products.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "43739abe12a04cd68fdaae698e8255b0",
  "places": [
    {
      "osmId": "75363907",
      "road": "Lafayette Street",
      "quarter": "Lower Manhattan",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10278",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Manhattan Community Board 1",
      "coordinates": {
        "lat": 40.715468200000004,
        "lon": -74.0042024829076
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "A federal judge has ordered the Trump administration to improve conditions at a New York City immigration holding facility following complaints from detainees about overcrowding, unsanitary conditions, and lack of basic hygiene products. Judge Lewis A. Kaplan issued a temporary restraining order mandating U.S. Immigration and Customs Enforcement to limit capacity, ensure cleanliness, and provide adequate hygiene supplies. The lawsuit, filed by immigrant rights organizations, highlighted severe issues including inadequate food, lack of privacy for legal communications, and prolonged detention times.",
  "argos_id": "TNHPW6BRP"
}