{
  "url": "https://finance.yahoo.com/news/cvd-equipment-corporation-reports-second-200000588.html",
  "authorsByline": "Business Wire",
  "articleId": "7a53e35cc98644b387d31dd1629409d7",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/business-wire.com/a59df9d739d2751883dfb242e2ab9ef6",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:00:00+00:00",
  "addDate": "2025-08-12T20:08:30.954809+00:00",
  "refreshDate": "2025-08-12T20:08:30.954811+00:00",
  "score": 1.0,
  "title": "CVD Equipment Corporation Reports Second Quarter 2025 Financial Results",
  "description": "CENTRAL ISLIP, N.Y., August 12, 2025--CVD Equipment Corporation (NASDAQ: CVV), today announced its financial results for the second quarter ended June 30, 2025.",
  "content": "CENTRAL ISLIP, N.Y., August 12, 2025--(BUSINESS WIRE)--CVD Equipment Corporation (NASDAQ: CVV), today announced its financial results for the second quarter ended June 30, 2025.\n• Revenue of $5.1 million, a decrease of 19.4% from the prior year quarter. Year to date revenue of $13.4 million was 19.2% higher than the prior year period.\n• Gross margin declined to 21.0% as compared to 24.3% in the prior year quarter.\n• Net loss of $1.1 million or $0.15 per basic and diluted share, compared to a net loss of $0.8 million or $0.11 per basic and diluted share during the prior year second quarter.\n• Cash and cash equivalents of $7.0 million as of June 30, 2025, as compared to $12.6 million as of December 31, 2024. Accounts receivable increased by $3.6 million during the second quarter as we achieved certain contract milestones; we expect to collect these receivables in the third quarter.\n• Orders for the second quarter were $4.5 million primarily driven by demand in our SDC segment for gas delivery equipment. Orders for the first six months of 2025 were $7.3 million as compared to $16.9 million for the first six months of 2024.\n• SDC segment continued to experience strong demand for its gas delivery systems and its backlog increased significantly during the quarter. Revenue was lower as compared to the prior year second quarter and the first quarter of 2025 due to the timing of orders received.\n• Backlog as of June 30, 2025 of $13.2 million, a decrease from $13.8 million as of March 31, 2025.\n• During 2025, we improved our operating efficiency and continue to evaluate opportunities to further reduce our operating costs. Manny Lakios, President and CEO of CVD Equipment Corporation, commented, \"Our bookings and revenue during the second quarter reflected several factors, including the uncertainties related to proposed tariffs, reduced US government funding for universities as well as a lag in the adoption of our products and the dynamic nature of the emerging growth markets we serve. We are actively monitoring the evolving customer demand, geopolitical landscape and potential tariff impacts and planning accordingly. We are tightly managing our operating expenses and headcount. \"We believe CVD Equipment Corporation is well positioned to provide solutions across our key target markets — aerospace and defense, industrial applications including silicon carbide (SiC) on graphite, SiC high-power electronics, and electric vehicle (EV) battery materials. \"In aerospace and defense, our key product offerings include chemical vapor infiltration (CVI) systems used in the production of ceramic matrix composites (CMCs) for commercial jet engines, and silicon bond coat systems for coating CMC components. For industrial customers, our systems include SiC coating reactor systems and potential uses for the nuclear energy market. Related to the SiC high-power power electronics, our core products include PVT150™ and PVT200™ SiC crystal growth systems. In the EV battery materials market, we are pursuing new opportunities for our PowderCoat™ systems, which can be used in the production of advanced anode materials.\n\n\"In early July 2025, we shipped the first CVD4000™ SiC coating reactor system to an industrial customer. These systems will be used to apply a protective silicon carbide coating on graphite OEM components. The resources allocated to our new product launch of the CVD4000TM partially attributed to the reduced revenue from other contracts in progress. \"We remain committed to our long-term strategy—growing our presence across key markets while maintaining disciplined expense management to support our goal of achieving sustained profitability and positive cash flow.\" A conference call reviewing these results has been scheduled for today, August 12, 2025 starting at 5:00 PM ET. To join the call, dial 1-877-407-2991 or 1-201-389-0925. A live and archived webcast of the call will also be available on the company's website at www.cvdequipment.com/events. The archived webcast will be available approximately two hours following the end of the conference call. A telephone replay will be available for 7 days. To access the replay, dial 1-877-660-6853 or 1-201-612-7415. The replay passcode is 13754557. CVD Equipment Corporation (NASDAQ: CVV) designs, develops, and manufactures a broad range of chemical vapor deposition, thermal processing, physical vapor transport, gas and chemical delivery control systems, and other equipment and process solutions used to develop and manufacture materials and coatings for industrial applications and research. Our products are used in production environments as well as research and development centers, both academic and corporate. Major target markets include aerospace & defense (ceramic matrix composites), silicon carbide (SiC) high-power electronics, electric vehicle (EV) battery materials (carbon nanotubes, graphene and silicon nanowires), and industrial applications. Through its application laboratory, the Company allows customers the option to bring their process tools to our laboratory and to work collaboratively with our scientists and engineers to optimize process performance. The Private Securities Litigation Reform Act of 1995 provides a \"safe harbor\" for forward-looking statements. Certain information included in this press release (as well as information included in oral statements or other written statements made or to be made by CVD Equipment Corporation) contains statements that are forward-looking. All statements other than statements of historical fact are hereby identified as \"forward-looking statements, \"as such term is defined in Section 27A of the Securities Exchange Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such forward looking information involves a number of known and unknown risks and uncertainties that could cause actual results to differ materially from those discussed or anticipated by management. Potential risks and uncertainties include, among other factors, market and business conditions, the success of CVD Equipment Corporation’s growth and sales strategies, the possibility of customer changes in delivery schedules, cancellation of, or failure to receive orders, potential delays in product shipments, delays in obtaining inventory parts from suppliers and failure to satisfy customer acceptance requirements, competition in our existing and potential future product lines of business, including our PVT systems; our ability to obtain financing on acceptable terms if and when needed; uncertainty as to our ability to develop new products for the high power electronics market; uncertainty as to our future profitability; uncertainty as to any future expansion of the Company; uncertainty as to our ability to adequately obtain raw materials and components from foreign markets in light of geopolitical developments; and other risks and uncertainties that are described in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 and the Company’s other filings with the Securities and Exchange Commission. For forward-looking statements in this release, the Company claims the protection of the safe harbor of the Private Securities Litigation Reform Act of 1995. The Company assumes no obligations to update or supplement any forward-looking statements whether as a result of new information, future events or otherwise. Past performance is not a guarantee of future results. This earnings release should be read in conjunction with the Company’s filings with the Securities and Exchange Commission, including the Annual Report on Form 10-K for fiscal year ended December 31, 2024.",
  "medium": "Article",
  "links": [
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcvdequipment.com%2Fevent%2Fsecond-quarter-2025-financial-results%2F&esheet=54305686&newsitemid=20250812098981&lan=en-US&anchor=www.cvdequipment.com%2Fevents&index=2&md5=a4f985bddc2f015038ce2627a678f580",
    "https://www.businesswire.com",
    "https://www.businesswire.com/news/home/20250812098981/en/",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cvdequipment.com%2Fcompany%2Finvestor-relations%2Fstock-information%2F&esheet=54305686&newsitemid=20250812098981&lan=en-US&anchor=CVV&index=3&md5=2ed0dd77eaa6060eb3237f91e16206cc",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cvdequipment.com%2Fcompany%2Finvestor-relations%2Fstock-information%2F&esheet=54305686&newsitemid=20250812098981&lan=en-US&anchor=CVV&index=1&md5=2cea87a89131f9ef61236f97a2aa3843"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "CVD Equipment Corporation",
      "weight": 0.07070088
    },
    {
      "name": "SiC coating reactor systems",
      "weight": 0.0691262
    },
    {
      "name": "WIRE)--CVD Equipment Corporation",
      "weight": 0.06359386
    },
    {
      "name": "silicon bond coat systems",
      "weight": 0.061940886
    },
    {
      "name": "new products",
      "weight": 0.06143775
    },
    {
      "name": "key markets",
      "weight": 0.060064785
    },
    {
      "name": "other written statements",
      "weight": 0.059210204
    },
    {
      "name": "foreign markets",
      "weight": 0.05535427
    },
    {
      "name": "future results",
      "weight": 0.05498579
    },
    {
      "name": "Major target markets",
      "weight": 0.05423367
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.984375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93701171875
    }
  ],
  "sentiment": {
    "positive": 0.29017314,
    "negative": 0.57556564,
    "neutral": 0.13426118
  },
  "summary": "CVD Equipment Corporation (NASDAQ: CVV) has reported its financial results for the second quarter of 2025, which saw a decrease of 19.4% from the prior year quarter. The company reported a gross margin of 21.0% and a net loss of $1.1 million or $0.15 per basic and diluted share, compared to the prior-year net loss. Year-to-date revenue of $13.4 million was 19.2% higher than the previous year period. Orders were primarily driven by demand from the SDC segment for gas delivery equipment. The SDC business saw strong demand for its gas delivery systems and its backlog increased significantly during the quarter. Backlog as of June 30, 2025 of $14.0 million was decreased from March 31, 2025. CVD Equipment CEO Manny Lakios stated that the company remains committed to growing its presence across key markets while maintaining disciplined expense management to achieve sustained profitability and positive cash flow. A conference call with the company is scheduled for August 12, 2025 starting at 5:00 PM ET.",
  "shortSummary": "CVD Equipment Corporation's second quarter results saw a 19.4% decline in revenue, while improving operating efficiency and targeting future growth in key markets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5c0f842bf84546468f052b7a7ca5560f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "CVD Equipment Corporation reported a revenue of $5.1 million for Q2 2025, a 19.4% decrease from the previous year, while year-to-date revenue increased by 19.2% to $13.4 million. The company experienced a net loss of $1.1 million, up from a loss of $0.8 million in the same quarter last year, and gross margin declined to 21.0%. Despite a strong demand for gas delivery systems in their SDC segment, overall orders fell significantly compared to the previous year. The company is focused on improving operational efficiency and managing expenses while navigating uncertainties related to tariffs and government funding.",
  "argos_id": "TOS3WS0EC"
}