{
  "url": "https://www.usmagazine.com/entertainment/news/matthew-atkinson-teases-bold-and-the-beautiful-return/",
  "authorsByline": "Erin Doyle",
  "articleId": "95eeef719c204dc09182506e662ef7b3",
  "source": {
    "domain": "usmagazine.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.usmagazine.com/wp-content/uploads/2025/08/GettyImages-1404983410-The-Bold-and-the-Beautiful-Alum-Matthew-Atkinson-Teases-Return.jpg?crop=451px%2C83px%2C1489px%2C782px&resize=1200%2C630&quality=86&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T02:52:16-04:00",
  "addDate": "2025-08-12T06:57:06.508535+00:00",
  "refreshDate": "2025-08-12T06:57:06.508536+00:00",
  "score": 1.0,
  "title": "Matthew Atkinson Teases Bold and the Beautiful Return",
  "description": "Matthew Atkinson hinted at a potential return to 'The Bold and the Beautiful,' sharing cryptic Instagram footage from the show's filming location",
  "content": "The Bold and the Beautiful alum Matthew Atkinson teased he could be set to make a return to the long-running soap.\n\nPosting to Instagram on Monday, August 11, the actor, 36, shared footage of himself playing corn hole on the lot where The Bold and the Beautiful is filmed. In the background, the show’s distinctive title could be seen on a sign.\n\nAtkinson did not confirm he was on set to film new scenes during the post. Instead, he cryptically captioned the Instagram post, “Second time’s a charm.”\n\nFans wondered whether the actor was simply referencing his corn hole game, or whether the post is a not-so-subtle hint that Atkinson’s character, Thomas Forrester, will soon be back in town.\n\nFlocking to the comments section, B&B fans were desperate to know if the fan favorite would be back, urging him to confirm if it was the case.\n\n“Are you employed with the show again? Let me know so i can care about bold again,” wrote one follower, with another begging, “Please let this mean you’re coming back! We need you!”\n\nEchoing the sentiment, another soap fan commented, “Miss that handsome face.. I hope you come back to B&B as you can see, you have many fans that want you to come back. The story line is getting boring and everyone talks about the same thing. You and Hope kept it alive!! Come back!! ❤️❤️❤️”\n\nAtkinson joined the CBS series back in 2019, taking over the Thomas Forrester role from his predecessor, Pierson Fodé.\n\nHis last onscreen appearance on the show took place in July 2024. While Atkinson’s departure from The Bold and the Beautiful was never officially announced, he scrubbed all mention of the soap from his Instagram bio in November, according to Parade. The actor also did not appear in the show’s new opening the following month, leading to speculation he was gone for good.\n\nSpeaking to Soap Opera Digest in June 2024 following an earlier break from the show, Atkinson recalled some of the show’s fans having strong emotions when he first left temporarily.\n\n“I just never expected the response that I’ve gotten and we’ve gotten from the fans, especially [with] Thomas leaving,” Atkinson told the outlet. “I can’t speak for all the fans, but there’s a wealth of people that are either really, really upset that Thomas is gone for a period or really sad. [They] reach out and they’re like, ‘Hey, when are you back? When are you back? When are you back?’”\n\nHe added: “That just speaks to their care for this character. And that means a lot to me because I would have fun doing this in a vacuum, but it’s really great to have a response that shows that these people care about what you’re doing. And so it’s just been so much love from so many fans that comes out in so many different ways.”",
  "medium": "Article",
  "links": [
    "https://www.usmagazine.com/celebrity-news/news/inside-brandon-blackstocks-final-months-at-his-montana-ranch/",
    "https://www.usmagazine.com/entertainment/news/the-bold-and-the-beautiful-tom-arnold-brings-forresters-to-monte-carlo/",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
    "https://www.usmagazine.com/entertainment/news/the-bold-and-the-beautiful-to-have-its-1st-all-female-episode/",
    "https://apple.news/TdBoH5or6Q0afHo2MxaGA6A",
    "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
    "https://www.instagram.com/reel/DNPAA7rOnve/?utm_source=ig_embed&utm_campaign=loading",
    "https://www.usmagazine.com/entertainment/news/is-prime-videos-upcoming-period-drama-the-next-game-of-thrones/",
    "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
    "https://www.usmagazine.com/entertainment/pictures/shocking-soap-opera-exits-kristian-alfonso-alison-sweeney-more/",
    "https://www.usmagazine.com/celebrity-news/news/mgk-addresses-sydney-sweeney-dating-speculation/",
    "https://www.amazon.com/MEROKEETY-Womens-Summer-Striped-Pockets/dp/B085WKKJ9V?&linkCode=sl1&tag=dotd-merokeety-striped-shirt-dress-sale-8-11-25-20&linkId=f7feced7a5edeb9678c4a84f1b3dacde&language=en_US&ref_=as_li_ss_tl",
    "https://www.instagram.com/p/DNPAA7rOnve/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "many fans",
      "weight": 0.09859593
    },
    {
      "name": "B&B fans",
      "weight": 0.09818206
    },
    {
      "name": "Fans",
      "weight": 0.09195479
    },
    {
      "name": "Matthew Atkinson",
      "weight": 0.082921565
    },
    {
      "name": "Thomas Forrester",
      "weight": 0.08094151
    },
    {
      "name": "Atkinson",
      "weight": 0.07819306
    },
    {
      "name": "Thomas",
      "weight": 0.06930503
    },
    {
      "name": "corn hole",
      "weight": 0.065822884
    },
    {
      "name": "Instagram",
      "weight": 0.057096936
    },
    {
      "name": "new scenes",
      "weight": 0.05545426
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98388671875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.97314453125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.71484375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.326904296875
    }
  ],
  "sentiment": {
    "positive": 0.08419595,
    "negative": 0.53735685,
    "neutral": 0.3784472
  },
  "summary": "Matthew Atkinson, an actor known for his role as Thomas Forrester on The Bold and the Beautiful, has hinted at a return to the show. He posted a video on Instagram showing himself playing corn hole near the set where the show is filmed. Atkinson did not confirm he was on set to film new scenes during the post. Fans were eager to know if he would be returning, with one fan suggesting he should return. Atkinson joined the CBS series in 2019 and his last onscreen appearance was in July 2024. His departure from the show was never officially announced, but he scrubbed all mention of the soap from his Instagram bio in November.",
  "shortSummary": "Matthew Atkinson hinted at a potential return to The Bold and the Beautiful by posting a video of himself playing corn hole on set.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "55705c1f8edb4aeab683dea9cbdc35e8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usmagazine.com/entertainment/news/the-bold-and-the-beautiful-to-have-its-1st-all-female-episode/",
      "text": "The Bold and the Beautiful is set to debut the soap’s first-ever all-female episode this month.\nHeather Tom, who plays Katie Logan Spencer, will write, act in and direct the first all-female episode in the series’ history, Deadline reported on Friday, March 21. The Women’s History Month-themed episode, which will air on March 27, 2025, will star Tom as well as Rebecca Budig (Taylor), Annika Noelle (Hope), Katherine Kelly Lang (Brooke), Jennifer Gareis (Donna) and Jacqueline MacInnes Wood (Steffy).\n“Brad Bell actually came to me and said, ‘This is your 35th year. You’ve been writing and directing. You’ve also been acting the whole time, and I think that it would be amazing if you did all three in one show,” Tom told the outlet. “I was like, oh, that’ll be interesting! So logistically it was just, well, let’s figure out how I can be on stage acting in the scenes and then directing those scenes. I thought it was very important and agree that it should air during Women’s History Month because it’s historical.”\nThe episode will primarily focus on the existing mother-daughter relationships on the show.\n“The mother daughter relationships are so interesting to me and so formative,” Tom explained. “And now this is going to make me cry because I lost my mother last year. I wanted to kind of pay homage to her because I certainly wouldn’t be here without her literally and figuratively. So I got a little bit of her in there with Katie and Donna, who are sisters who lost their mom.”\nThe episode also fits into the preexisting plot from this season. “It does fit within the story of where they are in the series,” Tom added. “We considered doing something that was more of a standalone, but Brad felt, and I agreed that it needed to just kind of flow with the story and it made sense.”\nBefore she joined the cast of The Bold and the Beautiful, Tom starred on ABC’s One Life to Live. She also spent another 13 years starring as Victoria Newman on The Young and the Restless.\nTo date, Tom is also the only female actor in television history to win an Emmy in all three performer categories: Younger, Supporting and Lead Actress. She has also received 19 nominations throughout her career.\nShe has been doubling as a director since 2016 and has previously directed several episodes of The Bold and the Beautiful as well as of Dynasty, The Young and the Restless and Good Trouble."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
      "text": "The official cause of death for Kelly Clarkson’s ex-husband, Brandon Blackstock, has been confirmed.\nSilver Bow County Coroner Dan Hollis told Us Weekly on Monday, August 11, that Blackstock’s cause of death was melanoma, a form of skin cancer, and the manner of his death was natural causes. “Brandon Blackstock passed away peacefully at his home in Butte, Montana on August 7th under hospice care surrounded by his family,” Hollis said in a statement.\nBlackstock died on August 7 after privately battling cancer for three years. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nOne day earlier, Clarkson, 43, alerted fans to Blackstock’s illness when she put her Las Vegas residency on pause, though she didn’t reveal the nature of his condition at the time.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she announced via Instagram on August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock wed in October 2013 and went on to welcome daughter River, 11, and son Remington, 9. During their marriage, Blackstock worked as the singer’s manager. Clarkson ultimately filed for divorce in June 2020 after nearly seven years. The pair finalized the proceedings in March 2022 following a messy legal battle.\nPrior to his relationship with Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The exes shared daughter Savannah, 23, and son Seth, 18.\nIn January 2022, Blackstock became a first-time grandfather when Savannah gave birth to her and now-husband Quentin Lee’s son, Lake. Savannah announced in July that the couple are expecting their second baby.\nOutside of his marriage to Clarkson, Brandon had another Hollywood connection via his father, Narvel Blackstock, who was Clarkson’s manager earlier in her career. Narvel was previously married to Reba McEntire from 1989 to 2015, during which time she was stepmom to Brandon and his two sisters, Chassidy and Shawna. Narvel and McEntire’s son, Shelby, who was born in 1990, was Brandon’s half-brother."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
      "text": "Billy Joel’s ex-wife Elizabeth Weber is opening up about where she stands with the famed singer after their infamous affair and nearly decade-long marriage.\n“If I wanna talk to him or if I have something to say, I am able to contact him whenever I want to,” Weber exclusively told Us Weekly on Friday, August 8. “But he has a wife and he has children and right now, he’s struggling with something that’s… that’s a big thing.”\nIn May, Joel, 76, canceled the remaining dates of his 2025 tour after revealing he had been diagnosed with normal pressure hydrocephalus, a brain condition in which an abnormal amount of cerebrospinal fluid builds up, causing walking, memory, balance and bladder control problems.\n“So, [our relationship] is as close as it needs to be for two people who decided to divorce 40 years ago,” Weber continued, adding that “of course” she reaches out to her ex amid his health diagnosis.\nWeber first met Joel when she was married to his best friend and former bandmate, Jon Small. The pair engaged in a subsequent affair, which led to the band breaking up and Joel battling a severe depression that included two suicide attempts. (The affair and its aftermath were discussed in the two-part HBO documentary Billy Joel: And So It Goes, which premiered in July.)\nThe pair later reconnected after Weber’s divorce and married in 1973, going on to spend nearly 10 years together before ending their marriage in 1982. Joel went on to marry Christie Brinkley in 1985, welcoming daughter Alexa Ray Joel before calling it quits in 1994. Joel then married cookbook author Katie Lee in 2004 — the pair divorced five years later in 2009. In 2015, Joel married Alex Roderick. The pair share two children, Della Rose Joel and Remy Anne Joel.\nWeber, for her part, shares a son, Sean Weber-Small, with her first husband.\nWhile speaking with Us, Weber said that her son and her grandchildren also know and are even somewhat close to Joel.\n“I have my grandchildren that he knows and they know him,” she explained. “My granddaughter Ella taught Bill what TikTok was and showed him what was happening. And his relationship with Sean is important to both of them.”\nShe added, “So, we’re not distant but we’re, you know, and he lives in Florida and I live in California. But it’s all good. “\nWeber said that her son Sean and Joel “were very close,” adding that during their marriage the three “lived on top of the mountain.”\n“We entertained each other,” she explained. “Bill and I worked all day long and the whole writing process was never done — in the years that Bill and I were together — was never done remotely or in [a] studio. It happened in our living room, and Sean was an integral part.”\nIf you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat at 988lifeline.org."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/is-prime-videos-upcoming-period-drama-the-next-game-of-thrones/",
      "text": "Game of Thrones wrapped up its eight-season run in 2019, and there have been a few contenders to be the next GoT, including the prequel series House of the Dragon.\nHowever, Amazon Prime Video‘s upcoming miniseries King & Conqueror is giving off some serious Game of Thrones vibes, and there isn’t a dragon in sight.\nThis story is based on the conflict between Harold Godwinson and William the Conqueror in 1066 for the throne of England.\nWhile only a few previews have been released so far, Watch With Us is sharing three reasons to watch King & Conqueror when it debuts on Prime Video later this year.\nThe ‘Game of Thrones’ Connection\nIf you thought William the Conqueror looked familiar in the trailer, you’re not wrong. Game of Thrones‘ Nikolaj Coster-Waldau — who portrayed Jaime Lannister on the series — is playing William on this show. William is a vastly different character from the one that Coster-Waldau played for eight seasons, but the actor just seems to fit in well within a medieval setting.\nJames Norton is also leading the cast as William’s rival, Harold Godwinson. The rest of the performers include several veteran British actors, including Clémence Poésy, Emily Beecham, Luther Ford and Eddie Marsan. They may not be household names in America, but that’s a solid cast by any standard.\n‘King & Conqueror’ Looks Like It Has High Production Values\nAdmittedly, we haven’t seen a lot of trailers from King & Conqueror yet, so our impressions may change. But even from the early look at the show, it looks like a big budget was spent to bring this show to life in a convincing way.\nEverything from the costumes to the battle scenes suggests that King & Conqueror is going all-out with its production. It may not hit on the same level as last year’s incredible Shogun adaptation, but it seems very promising for now.\nThe Series Will Tackle One of the Most Famous Battles in History\nUnless you’re a student of history, you may not be familiar with the Battle of Hastings. Nearly a thousand years later, that battle is still considered to be one of the bloodiest encounters in English history. William and Harold’s forces met on the battlefield, and the winner went on to rule the country and consolidate their power.\nHistorical details about what happened at the Battle of Hastings are incomplete, and there are also conflicting accounts. So there will probably be some creative liberties taken with it. But we do know how it ends, and it should be entertaining to see this fight play out.\nKing & Conqueror will premiere on Prime Video later this year."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/mgk-addresses-sydney-sweeney-dating-speculation/",
      "text": "Machine Gun Kelly publicly addressed rumors of a romance with Sydney Sweeney.\nDuring an appearance on the Sunday, August 10, episode of Watch What Happens Live With Andy Cohen, MGK, whose real name is Colson Baker, was asked point-blank about his relationship with Sweeney, 27.\nAndy Cohen read from a question card that contained a viewer query from “Kyle P.” The TV host said, “MGK, Kyle P wants to know if there’s any truth to the rumor that you and Sydney Sweeney were more than just friends.”\nMGK, 35, responded while shaking his head and looking directly down the camera barrel, “Kyle P, shut up, dude,” at which Cohen and the audience laughed loudly.\nIn May, photos published by Page Six showed the musician and Sweeney hugging at a Las Vegas club opening. Later that month, MGK shared an Instagram carousel that included a snap of himself posing alongside Sweeney as they flashed peace signs at the camera. (Patrick Schwarzenegger and Hollywood hair stylist Glen Oropeza were also in the snap.)\nAn Instagram Story shared by Sweeney at the time, published by the outlet, also featured a photo of herself posing with Schwarzenegger, 31, and MGK at the Vegas event.\nBoth MGK and Sweeney are currently single after the musician’s split from Megan Fox was confirmed by Us Weekly in December 2024, and Sweeney’s engagement to Jonathan Davino was called off in May. (MGK shares a daughter, Saga, 4 months, with Fox, 39, in addition to daughter Casie, 16, whom he shares with ex Emma Cannon.)\nMGK and Sweeney have been friends for years, with Sweeney starring in MGK’s 2021 directorial debut, Downfalls High. The pair also appeared in the 2019 film Big Time Adolescence alongside MGK’s close friend Pete Davidson.\nMGK’s appearance on WWHL also saw an audience member ask him who his dream musical collaboration would be, living or dead, to which he responded, “ I like Frank, man, Frank Sinatra. I’ll do that.”\nHe was also asked by Cohen about how age, which garnered an interesting response from MGK: “It’s a weird thing, dude, I don’t know if it exists.”\nCohen likened MGK’s “connection to” his age to that of Mariah Carey, who told Harper’s Bazaar in July that she doesn’t “allow” herself to age, which drew MGK to say, “I just don’t know many facts about my life, so I’m starting to just be like, like, my skin, if it just rips open, it heals really quick, there’s just things where I’m starting to be, like, who’s my dad, you know?”\nHinting that he may have otherworldly origins, MGK noted that he once asked his mother if there was any “period of time where you went missing,” which provided an unusual answer.\n“She told me she got abducted at one point so I was just, like,” MGK said with a shrug."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/the-bold-and-the-beautiful-tom-arnold-brings-forresters-to-monte-carlo/",
      "text": "Tom Arnold is coming to The Bold and the Beautiful — and he couldn’t be more excited for fans to meet the Forrester’s new pilot, Captain Deuce Stevens.\nUs Weekly can exclusively reveal that Arnold will appear on two episodes of the beloved CBS soap, airing Tuesday, July 30, and Wednesday, July 31, when Ridge (Thorsten Kaye), Brooke (Katherine Kelly Lang) and Steffy (Jacqueline MacInnes Wood) head back to Monte Carlo, where they will be relaunching the iconic “Brooke’s Bedroom” fashion line for Forrester Creations.\n“It was great fun!” Arnold, 65, told Us. “People love The Bold and the Beautiful. The loyalty, the fans, the opinions … I started going online and listening to fans argue about certain things. It’s like sports.”\nThe veteran comedian and TV star gushed about his time on set, praising both the stars and crew — and telling a funny story about his first interaction with Kaye. “Every 12 minutes, The Bold and the Beautiful does another scene. It’s a well-oiled machine. They’re just so on top of their stuff,” Arnold said. “I was in makeup and this guy comes in and goes, ‘Hey, can I get you anything?’ I go, ‘I don’t know, do you have Sugar Free Red Bull?’ This guy who I thought was the crew — he had a very hard handshake — was Thorsten. The rich, wealthy father [Ridge]!”\nArnold previously appeared on General Hospital in the 90s and noted he’s been a fan of soap operas since skipping school as a kid to tune in. His fandom continued into adulthood with famous ex-wife Roseanne Barr.\n“Roseanne and I loved soap operas. [After I was on General Hospital], we ended up having all these folks on [Roseanne] from the show on,” Arnold told Us of his time as a writer and actor on the classic sitcom. “Because soap operas are very good actors. They don’t mess around.”\nArnold said that he channeled a story from his days with Barr to play a pilot Deuce. “It was helpful that back in the day I had a private jet and a pilot. I thought at the time about [when] Roseanne and I got to the airport to fly to New York [and] we got into an argument. She left without me. I had to get another jet to fly behind her,” he began.\nOn B&B, Us can tease that Steffy will be running late to the flight and flustered without her passport. “One thing that is true is you have a window to land at the airport. And if you mess around and you’re late, you will miss that [window]. I like when there’s some reality to this stuff. It heightened the scene because Steffy forgot her passport,” Arnold continued. “You expect [the drama] for a character, but it opens the doors for some hilarious stuff. It’s very funny because things are so dramatic that it lends itself to comedy.”\nArnold credited showrunner Brad Bell, whom he’s known for years, for writing the comedic scene. “I appreciated that. But I felt that everyone in the scene was pretty good about a little improvising too,” he told Us. “[Jacqueline] had to do some Lucy stuff with the comedy, ripping stuff out of her bag. … It’s not easy when you have props and you have to do this and this, but it worked.”\nArnold concluded that he was going to call Bell to campaign to get himself back on the show — and continue to brag to kids Quinn and Jax, whom he shares with ex Ashley Groussman.\n“I’m a single dad with an 11-year-old and an 8-year-old. I’m just gonna keep repeating, ‘I was on The Bold and the Beautiful. They’re always like, ‘Dad, you’re old.’ Dude, I was on The Bold and the Beautiful!” he said. “You don’t get on there unless you are bold and beautiful.”\nThe Bold and the Beautiful is broadcast weekdays on CBS at 1:30 ET (and 12:30 PT)."
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    }
  ],
  "argos_summary": "Matthew Atkinson, known for his role as Thomas Forrester on The Bold and the Beautiful, hinted at a possible return to the soap opera through a cryptic Instagram post. Fans expressed their eagerness for his comeback, especially as the show prepares for its first all-female episode, which will air in March 2025. Meanwhile, the article also covers the recent passing of Brandon Blackstock, Kelly Clarkson's ex-husband, due to melanoma, and highlights Tom Arnold's upcoming guest appearance on The Bold and the Beautiful.",
  "argos_id": "TPDZ2KN1C"
}