{
  "url": "https://people.com/jenna-ortega-latest-wednesday-press-look-made-her-struggle-up-the-stairs-11789880",
  "authorsByline": "Starr Bowenbank",
  "articleId": "63278d46f6e64a96809fdf087dd5c066",
  "source": {
    "domain": "people.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://people.com/thmb/5yn9bI-LtyIejzVhQ0JxAzKD90Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Jenna-Ortega-63-081225-c8ea4e19bf464a039217c311e95c9f26.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:08:50+00:00",
  "addDate": "2025-08-12T23:13:10.018506+00:00",
  "refreshDate": "2025-08-12T23:13:10.018507+00:00",
  "score": 1.0,
  "title": "Jenna Ortega's Latest 'Wednesday' Press Look Left Her Struggling to Get Up the Stairs, According to Her Stylist",
  "description": "Jenna Ortega's stylist, Enrique Melendez, revealed that the actress couldn't properly walk up the stairs because of her 'Wednesday' press look in Seoul, South Korea.",
  "content": "Jenna Ortega 's goth glam fashion streak continues — but not without a hitch.\n\nThe Wednesday actress is continuing her season 2 press tour for the show, and stopped in Seoul to meet with fans while wearing a black patent leather crocodile embossed dress that hailed from Dilara Findikoglu's autumn/winter 2025 collection.\n\n Never miss a story — sign up for to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. \n\nThe dress featured several silver lace-up grommet details through the corset bust, angular sleeves, and an ultra fitted skirt. She completed the look with black eyeliner, faint blush, nude pink lipstick and her edgy bleached eyebrows.\n\nAfter Ortega shared an Instagram carousel of her look Monday, her stylist, Enrique Melendez , shared what was really going on behind the scenes on his Instagram Stories.\n\n\"As I let her struggle up the stairs in a super slim pencil skirt to take a video,\" he captioned a video of Ortega inching her way up the steps.\n\n Never miss a story — sign up for to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. \n\nOrtega and Melendez have been working together since 2016, and have evolved the actress' style in the process. The stylist revealed that Ortega's day-to-day fashion is much more subdued, but she allows him to put her in more over-the-top, fashion-forward goth looks.\n\n\"Jenna's personal style is super simple, super streamlined. She would wear the same thing if she could every single day,\" he said in an Aug. 7 interview with . \"I tell her thank you, because a lot of times, it's just for me.\"\n\nMelendez explained that Ortega is an easygoing client and appreciates \"the arts, a cinephile, music.\" He added, \"I think after Wednesday came out, it just became her thing — goth glam — but it wasn't something that we forced or that we tried to do, it was natural.\"\n\nOrtega's Wednesday press tour style has contained an array of dark looks with a whimsical and gothic edge. For the Aug. 11 season 2 press conference in Seoul, South Korea, she wore a mint green Simone Rocha top from the brand's spring 2025 collection that was printed with abstract painted faces, and paired the top with a layered Simone Rocha skirt from the fall 2025 collection.\n\nEven off duty, Ortega has continued to incorporate gothic glamour into her party looks. On July 30, she attended the Wednesday season 2, part 1, after party at The Royal Opera House in London and went ghostly for the evening .\n\nShe wore a champagne-colored scoop neck dress from DKNY’s resort 2004 collection that contained delicate chiffon straps and a delicate flared skirt. Ortega completed the look with a black snakeskin Kurt Geiger clutch, Santoni pumps and jewelry by Zales.",
  "medium": "Article",
  "links": [
    "https://people.com/jenna-ortega-keeps-bleached-eyebrows-in-latest-gothic-look-celebrating-wednesday-11783056",
    "https://people.com/jenna-ortega-puts-serpentine-twist-naked-dress-wednesday-premiere-11782339",
    "https://people.com/jenna-ortega-wants-to-direct-star-in-movie-she-s-been-writing-for-10-years-11724911",
    "https://people.com/people-news-daily-newsletter-sign-up-8692701",
    "https://www.instagram.com/p/DNQAsiVOC6q/?img_index=1",
    "https://www.instagram.com/mrenriquemelendez/",
    "https://www.youtube.com/watch?v=kDK6KTIAqIc",
    "https://people.com/style/jenna-ortega-says-she-only-wore-black-while-filming-wednesday/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ortega",
      "weight": 0.08126768
    },
    {
      "name": "dark looks",
      "weight": 0.07354236
    },
    {
      "name": "Ortegas Wednesday press tour style",
      "weight": 0.0671547
    },
    {
      "name": "compelling human interest stories",
      "weight": 0.06660585
    },
    {
      "name": "Jenna Ortega s goth glam fashion streak",
      "weight": 0.06043557
    },
    {
      "name": "Wednesday",
      "weight": 0.060261752
    },
    {
      "name": "black eyeliner",
      "weight": 0.059526358
    },
    {
      "name": "Enrique Melendez",
      "weight": 0.05857649
    },
    {
      "name": "Simone Rocha",
      "weight": 0.057324145
    },
    {
      "name": "nude pink lipstick",
      "weight": 0.05557501
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9951171875
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.890625
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.6865234375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.67822265625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.65625
    }
  ],
  "sentiment": {
    "positive": 0.28527388,
    "negative": 0.24104717,
    "neutral": 0.47367895
  },
  "summary": "Jenna Ortega's latest goth glam fashion trend has seen her struggle to get up the stairs during her season 2 press tour in Seoul, South Korea. Her stylist, Enrique Melendez, shared his thoughts on her style behind the scenes on his Instagram Stories. Ortertega and Melendez have been working together since 2016 and have evolved her style significantly. Ortegan's gothic looks have been featured on numerous occasions during her press appearances, including in Seoul and London.",
  "shortSummary": "Jenna Ortega's goth glam looks continue, including one in a black patent leather crocodile embossed dress in Seoul, despite her recent struggles in the stairs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d9846d26a50e4eab9a093f5201544293",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://people.com/jenna-ortega-puts-serpentine-twist-naked-dress-wednesday-premiere-11782339",
      "text": "Jenna Ortega Puts a Serpentine Twist on the Naked Dress at Wednesday Premiere The 'Wednesday' star's snakeskin-inspired dress had a shedding effect By Ingrid Vasquez Ingrid Vasquez Ingrid Vasquez is a Digital News Writer at PEOPLE. She graduated from The University of Texas at Austin with a Bachelor in Journalism. Before joining the team, she worked as an Editor at FanSided and provided work in the celebrity and lifestyle space for brands that include Teen Vogue, Cosmopolitan, EW, and more. People Editorial Guidelines Published on July 30, 2025 11:31PM EDT 5 Comments Jenna Ortega attends the \"Wednesday\" Season 2, Part 1 woreld premiere on July 30, 2025 in London, England. Credit : Samir Hussein/WireImage NEED TO KNOW Jenna Ortega turned heads at the Wednesday Season Two: Part One World Premiere in LondonThe actress wore an Ashi Studio FW25 Couture gownThe new episodes will debut on Netflix on Wednesday, Aug. 6, followed by part 2 on Wednesday, Sept. 3. Jenna Ortega is ushering in season 2 of Wednesday with a slithering twist. The actress, 22, who stars in the titular role, turned heads at the Season Two: Part One World Premiere of the show in London, in an Ashi Studio FW25 Couture gown styled by Enrique Melendez. The serpentine-inspired figure-hugging nude dress features a snakeskin design that runs from its high neck to its peplum skirt, accentuating Ortega's curves and creating a shedding effect. The PEOPLE Puzzler crossword is here! How quickly can you solve it? Play now! Samir Hussein/WireImage Ortega paired the unique gown with Jimmy Choo shoes and brought the look together by with nude nails and a slicked back ponytail, showcasing her beauty glam: bleached eyebrows, a berry red lip color, spider lashes, and a hint of purple mascara. Our new app is here! Free, fun and full of exclusives. Scan to download now! Ortega completed her look with silver Rainbow K jewelry that added contrast. This isn't the first time Ortega has found some style inspiration from her character. During the filming of the first season, Ortega only wore black. \"When I was working on Wednesday, I suddenly only ever wore black,\" she told New York Magazine's The Cut in a March 2023 interview. \"I didn't know why. For some reason, my closet just lost all its color.\" Samir Hussein/WireImage Ortega would go on and carry a similar outfit inspiration for many red carpets, including the 2023 SAG Awards, where she wore an all-black Versace gown with a sculpted bodice, and at the Saint Laurent Menswear Fall/Winter 2023 runway show, where she wore a backless hooded gown. Further speaking to how her character has inspired her style, Ortega told Harper's Bazaar in May, \"I definitely feel like I have a bit more Gothic taste than I did when I was a teenager.\" Related Stories 'Wednesday' Season 2 Trailer: Jenna Ortega Has Visions of a Beloved Character's Death and Vows She'll ‘Die Trying’ to Save Them Wednesday Season 2: Everything to Know About the Hit Netflix Series' Next Chapter (Including Lady Gaga's Guest-Starring Role!) According to an official synopsis, season 2 of Wednesday finds Ortega's character navigating \"family, friends, and old adversaries, propelling her into another year of delightfully dark and kooky mayhem.” Jenna Ortega as Wednesday Addams. Courtesy of Netflix “Armed with her signature razor-sharp wit and deadpan charm, Wednesday is also plunged into a new bone-chilling supernatural mystery,\" the synopsis adds. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Season 2, part 1 of Wednesday will debut on Netflix on Wednesday, Aug. 6, followed by part 2 on Wednesday, Sept. 3. Season 1 of Wednesday is available to stream in full on Netflix. Close Leave a Comment Read more: Lifestyle Beauty & Style Red Carpet Style"
    },
    {
      "url": "https://people.com/jenna-ortega-wants-to-direct-star-in-movie-she-s-been-writing-for-10-years-11724911",
      "text": "Jenna Ortega, 22, Reveals She's Been Writing a Screenplay for 'Almost 10 Years' That She Plans to Direct The ‘Wednesday’ star also said she views acting as a “stepping stone” to her real dream: get behind the scenes By Bailey Richards Bailey Richards Bailey Richards is a writer-reporter at PEOPLE. She has been working at PEOPLE since 2023 and interned with the brand in 2022. Her work has previously appeared in digital publications like Paper Magazine and TV Insider. People Editorial Guidelines Published on April 30, 2025 11:49AM EDT Leave a Comment Jenna Ortega. Credit : Ethan Miller/Getty Jenna Ortega has been working on an original screenplay for \"almost 10 years,\" she revealed in an April 28 V magazine interviewThe actress, 22, is now \"starting to take the steps to get it made,\" and wants to not only direct but star in it, she revealedElsewhere in the interview, Ortega said she does not \"want to be in the things that I create in the future,\" and acting has been a \"stepping stone\" to behind-the-scenes work While her peers were worried about homework, 12-year-old Jenna Ortega was writing a movie — which she now wants to direct. For the past few years, the Disney Channel alum, 22, has been booked and busy, establishing herself as a household name through her work in Wednesday, the Scream franchise and more. Now, she wants to get behind the camera — and with the screenplay she’s been workshopping for a decade, no less. While chatting with her Hurry Up Tomorrow costar and collaborator Abel Tesfaye (a.k.a. The Weeknd) for V magazine, Ortega revealed that she has been working on an original script for “almost 10 years,” and she has big plans for it. Jenna Ortega Shares Mom's 2010 Facebook Video That Launched Her Career: 'The Rest Is History' (Exclusive) “I have a script that I’ve known that I was going to make for almost 10 years,” she said in the interview, published Monday, April 28. “It’s weird because it’s something that I thought of when I was younger and when I first started out in this field, and it’s only now that I’m actually starting to take the steps to get it made, which is really interesting.” Jenna Ortega in 'Hurry Up Tomorrow'. Andrew Cooper/Lionsgate But the actress would not have done it any other way, she told Tesfaye, 35. The screenplay’s decade-long incubation period, Ortega explained, was informed by her own experience in the industry in a valuable way. “There’s so much that goes on behind the scenes that I wasn’t aware of. I’m just putting the puzzle pieces together in my head,” the Death of a Unicorn star explained in the V chat. “So I think I needed a few years of that under my belt to understand the order of doing things.” Jenna Ortega Admits She 'Could Have Used My Words Better' After Facing Controversy for Rewriting Her Wednesday Lines \"Everything that I’ve done in my career, I feel like there’s a reason why I didn’t make this story at an earlier time, but I’m really excited about it,” the X star continued. “I think learning how to produce and being a part of projects in that way has informed me so much.” Now, the original screenplay — the content of which she did not share, or even hint at — is in the early stages of development, Ortega revealed. But she has a few other projects coming down the pike first. Jenna Ortega and The Weeknd in 'Hurry Up Tomorrow'. Andrew Cooper/Lionsgate “Then there are a couple of other things I’m trying to develop right now, but it’s strictly off of being inspired by another actor or a writer, characters that I’ve never really gotten the opportunity to play before,” the Beetlejuice Beetlejuice star told Tesfaye. “They’re very different preparation processes.” “So for me,” the actress continued, “it’s always fun to try something new. But I think oftentimes to get the stories that you want to get made nowadays, you kind of have to start them yourself.” Jenna Ortega Responds to Miller's Girl Sex Scene Controversy: 'It's Not Supposed to Be a Comfortable Movie' And, after Tesfaye asked Ortega if she wants to star in the film, she revealed that more than anything, she wants to direct it. “This one in particular, I see myself in it, but I really want to direct,” she said. “That’s probably the main thing that I want to do. I see that for myself. I just feel that’s the way my brain wants to work and think, and that’s how I even view my acting sometimes.” Elsewhere in the chat, Ortega said she views acting as a “stepping stone” to what she really wants to do — direct, produce and all-around be behind the scenes. Jenna Ortega. Taylor Hill/FilmMagic \"It’s hard to develop something that you’re starring in or you’re leading. I’m sure you experienced that firsthand now, where it’s just this weird kind of mind f---,” she told Tesfaye, who not only stars in Hurry Up Tomorrow alongside Ortega, but also co-wrote and produced the film. (Ortega is also credited as an executive producer on the movie.) “I don’t want to be in the things that I create in the future,” she continued in the V chat, “but starting out, because I’ve created more leverage for myself with a name as an actor, I may as well use that as a stepping stone.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human-interest stories. Hurry Up Tomorrow is in theaters May 16. Close Leave a Comment Read more: Celebrity Celebrity News"
    },
    {
      "url": "https://people.com/style/jenna-ortega-says-she-only-wore-black-while-filming-wednesday/",
      "text": "Jenna Ortega Only Wore Black While Filming 'Wednesday' : 'My Closet Just Lost All Its Color' Jenna Ortega stars as the titular character on Netflix's comedy horror series Wednesday By Ingrid Vasquez Ingrid Vasquez Ingrid Vasquez is a Digital News Writer at PEOPLE. She graduated from The University of Texas at Austin with a Bachelor in Journalism. Before joining the team, she worked as an Editor at FanSided and provided work in the celebrity and lifestyle space for brands that include Teen Vogue, Cosmopolitan, EW, and more. People Editorial Guidelines Published on March 1, 2023 07:27PM EST Jenna Ortega. Credit : Vivien Killilea/Getty Jenna Ortega found herself channeling the character of Wednesday Addams in more ways than one. As the face behind the titular role in the Tim Burton-helmed Netflix series, the actress drew inspiration from the character to develop her personal style. 'Wednesday' Costume Designer Colleen Atwood Details the Stories Behind the Characters' Iconic Looks \"When I was working on Wednesday, I suddenly only ever wore black,\" she explained in an interview with New York Magazine's The Cut. \" I didn't know why. For some reason, my closet just lost all its color.\" Wednesday. Courtesy of Netflix The 20-year-old star became the latest actress to take on the character created by cartoonist Charles Addams, bringing a whole new side to the death-obsessed little girl previously played by stars like Lisa Loring and Christina Ricci. While she says that she has played characters whose outfits are not a \"good representation\" of what she would wear, Wednesday Addams' fashion continues to inspire her as she takes on a role as Adidas' latest ambassador. Jenna Ortega Has a Lot in Common with Her 'Wednesday' Character: 'I Have a Pretty Dark Sense of Humor' \"I like the purple pieces,\" she explained while describing the athletic line's new sportswear drop to the outlet. \"Maybe it's because, after Wednesday, I just don't wear a lot of color. Now I feel like I tend to stick to darker and more earthy tones, so I like them because they look really good on everyone but also kind of push me to try something new.\" The iconic role also caused her to push herself as an actress. Speaking to PEOPLE in December, she said: \"I had to do things a bit different with my physicality and the way I carried myself. She almost has a social awkwardness. So when she does toxic, manipulative things, you know it's not coming out of malicious intent.\" Following the show's highly successful season 1 premiere, she's also been leaning into the character's goth-inspired fashion on the red carpet, including at the 2023 SAG Awards on Sunday. Chelsea Lauren/Shutterstock Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. The actress wore an all-black Versace gown with a sculpted bodice for the event. The high-low hemline was gathered at her waist and cinched with a belt with Versace's signature gold enclosure. She capped off her look with Tiffany & Co. jewels and black platform heels. She kept her glam light, opting for peachy cheeks, lips, and shimmery eyeshadow. She wore her hair down and tousled with her bangs parted down the middle. Close Read more: From the Magazine Digital Covers"
    },
    {
      "url": "https://people.com/jenna-ortega-keeps-bleached-eyebrows-in-latest-gothic-look-celebrating-wednesday-11783056",
      "text": "Jenna Ortega Keeps Bleached Eyebrows in Latest Gothic Look Celebrating Wednesday The actress looked ethereal in a spooky design from Andreas Kronthaler for Vivienne Westwood from the designer's fall 2025 collection By Ingrid Vasquez Ingrid Vasquez Ingrid Vasquez is a Digital News Writer at PEOPLE. She graduated from The University of Texas at Austin with a Bachelor in Journalism. Before joining the team, she worked as an Editor at FanSided and provided work in the celebrity and lifestyle space for brands that include Teen Vogue, Cosmopolitan, EW, and more. People Editorial Guidelines Published on July 31, 2025 08:04PM EDT 1 Comment Jenna Ortega in France for the 'Wednesday' Paris premiere on Thursday, July 31, 2025. Credit : Kristy Sparow/Getty NEED TO KNOW Jenna Ortega attended Wednesday's season 2, part 1 premiere in Paris, France, on Thursday, July 31The actress looked ethereal in a spooky design from Andreas Kronthaler for Vivienne Westwood from the designer's fall 2025 collectionOrtega is currently on a promotional run for the show Jenna Ortega is adding a touch of glamour to Wednesday Addams' trademark look. The actress, 22, is currently on a promotional tour for season 2 part 1 of Wednesday, set to debut on Netflix on Wednesday, Aug. 6. She arrived in France for the show's Paris premiere on Thursday, July 31, in a brown, ethereal design from Andreas Kronthaler for Vivienne Westwood from the designer's fall 2025 collection. The goth fairytale look features a deep V ruffled design, paired with an exposed nude corset, all brought together by a thin brown belt. The bottom of the dress had a short train and a knee-high slit. The PEOPLE Puzzler crossword is here! How quickly can you solve it? Play now! Jenna Ortega in France for the 'Wednesday' Paris premiere on Thursday, July 31, 2025. Kristy Sparow/Getty Similar to her appearance at the Season Two: Part One World Premiere of the show in London just a day prior on Wednesday, July 30, Ortega kept her bleached eyebrows, but this time opted for a softer pink lip, rosy cheeks, and mascara. Our new app is here! Free, fun and full of exclusives. Scan to download now! She accessorized with a black statement necklace with a large pendant in the shape of a cross and wore her hair down in soft waves. Her accessories also included Bondeye Jewelry Yellow Gold Aphrodite Diamond and Black Spinel Hoop Earrings. The look was a contrast to the champagne-colored silk Donna Karen archival gown that Ortega wore to Wednesday's Season Two: Part One World Premiere afterparty in London. Jenna Ortega attends the 'Wednesday' season 2, part 1 world premiere afterparty on July 30, 2025. JP/RV/TM / BACKGRID The brown and nude color scheme is one Ortega has been following as she attended the show's London red carpet event in a nude Ashi Studio FW25 Couture gown. The serpentine-inspired figure-hugging dress features a snakeskin design that runs from its high neck to its peplum skirt. Ortega wore the look with Jimmy Choo shoes and silver Rainbow K jewelry that added contrast. Related Stories Wednesday Season 2: Everything to Know About the Hit Netflix Series' Next Chapter (Including Lady Gaga's Guest-Starring Role!) Jenna Ortega Reveals 'Very Patronizing' Aspect of Working on 'Wednesday' That She Has Found 'Annoying' Bringing together the look were Ortega's nude nails and slicked back ponytail that showcased her glam: bleached eyebrows, a berry red lip color, spider lashes, and a hint of purple eyeliner. Ortega's style inspiration from her character comes as no surprise, as she previously told Vogue in April 2023 that she has \"always respected goth culture.\" Jenna Ortega attends the 'Wednesday' season 2, part 1 world premiere on July 30, 2025. Samir Hussein/WireImage \"I've always had a darker sense of humor, but I never felt like I was able to express that. Now I feel like I can embrace those qualities in myself,\" she said. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Season 2, part 1 of Wednesday will debut on Netflix on Wednesday, Aug. 6, followed by part 2 on Wednesday, Sept. 3. Season 1 of Wednesday is available to stream in full on Netflix. Close Leave a Comment Read more: Lifestyle Beauty & Style Celebrity Fashion"
    }
  ],
  "argos_summary": "Jenna Ortega continues to showcase her goth glam fashion during the press tour for the second season of 'Wednesday,' recently wearing a striking black patent leather dress in Seoul. Her stylist, Enrique Melendez, shared behind-the-scenes moments highlighting the challenges of her fitted outfits. Ortega's evolving style, influenced by her character, has led her to embrace darker, more whimsical looks, which she has incorporated into various appearances, including premieres and after parties.",
  "argos_id": "TSWJ6IGEA"
}