{
  "url": "https://www.express.co.uk/news/royal/2094132/prince-harry-meghan-markle-thrilled-netflix-deal-latest",
  "authorsByline": "Sophia Papamavroudi",
  "articleId": "150d8e4172c1409a968b61b8d50439d2",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/106/1200x630/6354669.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T09:25:00+01:00",
  "addDate": "2025-08-12T08:43:19.592166+00:00",
  "refreshDate": "2025-08-12T08:43:19.592170+00:00",
  "score": 1.0,
  "title": "Prince Harry and Meghan Markle 'thrilled' about latest Netflix update",
  "description": "A source close to the Sussexes speaks out about the \"wild speculation\" of the last few weeks.",
  "content": "Prince Harry and Meghan Markle are said to be \"thrilled\" to be able to \"put rumours to bed\" over their Netflix contract, sources have claimed. The Duke and Duchess of Sussex have struck a new \"multi-year first look\" deal with the streaming giant, five years after their lucrative, exclusive one, reportedly worth around £74million, ended. The first-look deal, which means Netflix will have the first option on Harry and Meghan's projects, was described by the Sussexes as \"extending their creative partnership\". The latest announcement followed various reports claiming that Netflix would end up axing its partnership with the Montecito couple, following a series of flops. The Sussexes' most successful series has been Harry & Meghan - their controversial tell-all 2022 documentary about stepping back from royal duties and their struggles with the royal family.\n\nStay up-to-date with the latest Royal news Join us on WhatsApp Our community members are treated to special offers, promotions, and adverts from us and our partners. You can check out at any time. Read our Privacy Policy\n\nIt totalled 23.4 million views and is Netflix's fifth most popular documentary series of all time. The rest of them, Live to Lead, Heart of Invictus, Polo and With Love Meghan, failed to attract similar views. But according to a source close to the couple, Harry and Meghan had to suffer through a \"frustrating\" silence after what was described as \"wild and inaccurate speculation\" in recent weeks. The source told GB News: \"The couple are pretty thrilled with the deal. It’s been a long time in the planning.\"\n\n\"They’re over the moon. It’s great to be able to continue making great programmes with Netflix.\" They added: \"It’s been frustrating, we haven’t been able to say too much and put [the rumours] to bed during contract negotiations. \"Some of the reporting shows you how much wild and inaccurate speculation there is around the Duke and Duchess.\" The source said that the Sussexes are \"still box office\" and argued that Netflix \"would not have renewed the deal\" if they thought Harry and Meghan \"wouldn't sell\".",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/whatsapp-group-web/1?utm_source=article_widget&utm_medium=referral&utm_campaign=article_widget&utm_content=whatsapp-group-signup-in-article",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/news/royal/2093965/prince-harry-meghan-markle-netflix-deal",
    "https://www.express.co.uk/latest/prince-harry",
    "https://www.express.co.uk/news/royal/2094102/prince-harry-meghan-markle-netflix-deal-latest",
    "https://www.express.co.uk/news/royal/2094090/royal-family-live-meghan-markle-harry-netflix",
    "https://www.express.co.uk/latest/meghan-markle",
    "https://www.express.co.uk/latest/netflix",
    "https://www.express.co.uk/news/royal/2094004/prince-harry-meghan-markle-netflix-deal-reaction",
    "https://www.gbnews.com/royal/meghan-markle-prince-harry-frustrating-rumours-latest-royal-news",
    "https://www.express.co.uk/privacy-notice"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Meghan Markle",
      "weight": 0.09768203
    },
    {
      "name": "latest Netflix update",
      "weight": 0.09539017
    },
    {
      "name": "Meghan",
      "weight": 0.0903952
    },
    {
      "name": "Netflix",
      "weight": 0.08898583
    },
    {
      "name": "Prince Harry",
      "weight": 0.082268216
    },
    {
      "name": "Harry",
      "weight": 0.07895934
    },
    {
      "name": "royal duties",
      "weight": 0.06867455
    },
    {
      "name": "special offers",
      "weight": 0.062159326
    },
    {
      "name": "multi-year",
      "weight": 0.061120227
    },
    {
      "name": "Harry & Meghan",
      "weight": 0.060012225
    }
  ],
  "topics": [
    {
      "name": "Royal Family"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9921875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.88525390625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.81201171875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.55078125
    },
    {
      "name": "/Law & Government/Government/Royalty",
      "score": 0.53125
    }
  ],
  "sentiment": {
    "positive": 0.08648001,
    "negative": 0.6263402,
    "neutral": 0.28717983
  },
  "summary": "Prince Harry and Meghan Markle have reportedly signed a new multi-year first-look deal with Netflix, five years after their previous exclusive one ended. The deal allows Netflix to have the first option on Harry and Markle's projects, despite reports of ending the partnership due to series of flops. The most successful series of the Sussexes, Harry & Meghan, is their controversial tell-all 2022 documentary about stepping back from royal duties and their struggles with the royal family. However, a source close to the couple stated that Netflix would not have renewed the deal if they believed Harry and Megan would not sell.",
  "shortSummary": "Prince Harry and Meghan Markle have secured a new multi-year Netflix deal, ending speculation about their future partnership, despite recent flops.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "148917e21dbe41d7aca173d3023f4a62",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gbnews.com/royal/meghan-markle-prince-harry-frustrating-rumours-latest-royal-news",
      "text": "Meghan and Prince Harry delighted to ‘put rumours to bed’ after ‘frustrating’ silence\nThe Duke and Duchess of Sussex celebrated after 'a long time in the planning'\nDon't Miss\nMost Read\nPrince Harry and Meghan Markle have celebrated the opportunity to \"put rumours to bed\" after suffering through a \"frustrating\" silence.\nThe Duke and Duchess of Sussex railed against what they described as \"wild and inaccurate speculation\" in recent weeks.\nTheir comments come as they announced a renewed deal with Netflix and a host of new projects with the US streaming giant.\n**ARE YOU READING THIS ON OUR APP? DOWNLOAD NOW FOR THE BEST GB NEWS EXPERIENCE**\nSpeaking to GB News, a source close to the Sussexes said: \"The couple are pretty thrilled with the deal. It’s been a long time in the planning.\"\nMeghan and Prince Harry have shared their delight at being able to 'put rumours to bed'\n|GETTY\n\"They’re over the moon. It’s great to be able to continue making great programmes with Netflix,\" they continued.\nThe source explained having to remain tight lipped about the news, amid speculation the deal may not be continued, had caused the couple distress.\n\"It’s been frustrating we haven’t been able to say too much and put [the rumours] to bed during contract negotiations,\" the insider added.\n\"Some of the reporting shows you how much wild and inaccurate speculation there is around the Duke and Duchess.\"\nThe Duke and Duchess shared their 'frustrations' with having to remain silent amid speculation about their Netflix deal\n|GETTY\nThe Duke and Duchess of Sussex were also said to welcome to chance to put to right the apparent naysaying among elements of the press regarding their media ventures.\n\"Harry and Meghan are still box office despite what the British press might want to think, and prefer to promote a negative agenda,\" the source added.\n\"Netflix would not have renewed the deal if they thought The Duke and Duchess wouldn’t sell,\" the comments concluded.\nOn Monday, Netflix declared it would continue its \"creative partnership\" with Prince Harry and Meghan Markle, through their production company Archewell, in a \"multi-year, first look deal for film and television projects\".\nNetflix announced a new 'creative partnership' with Harry and Meghan\n|GETTY\nThrilled about the announcement, the Duchess said: \"We're proud to extend our partnership with Netflix and expand our work together to include the As Ever brand.\n\"My husband and I feel inspired by our partners who work closely with us and our Archewell Productions team to create thoughtful content across genres that resonates globally, and celebrates our shared vision,\" she added.\nBela Bajaria, Netflix’s Chief Content Officer, added: \"Harry and Meghan are influential voices whose stories resonate with audiences everywhere.\nLATEST ROYAL NEWS:\nMeghan also shared she and Harry were 'proud' and 'inspired' to continue their work with Netflix\n|GETTY\n\"The response to their work speaks for itself — Harry & Meghan gave viewers an intimate look into their lives and quickly became one of our most-watched documentary series.\n\"More recently, fans have been inspired by With Love, Meghan, with products from the new As Ever line consistently selling out in record time. We’re excited to continue our partnership with Archewell Productions and to entertain our members together.\"\nThe streaming company will also advance their partnership with Meghan's lifestyle brand, As Ever, and extend the current product range."
    },
    {
      "url": "https://www.express.co.uk/",
      "text": "Minister asked about reports more than 50,000 migrants have crossed the Channel in small boats since Labour came to power\nBrooklyn Beckham and Nicola Peltz's vow renewal took an unexpected turn as family...\nThe Chancellor has sunk the UK economy, but the stock market stands firm. That could...\nMotoring experts have called for a new \"maximum driving age\" with individuals pulled...\nThe fire occurred near St Helens in Merseyside.\nThe deal is a looser arrangement than the couple's previous deal.\nThe Russian Embassy in London has hit out at the UK ahead of Putin-Trump peace talks.\nA former England player has accumulated business debts of more than £1.5million.\nThe latest person taking part in this year's Strictly Come Dancing was revealed on Good Morning Britain\nSantander will close its branches in Brixton, Formby and Sidcup on August 11, followed...\nNicola Sturgeon describes the late Queen Elizabeth II as an \"incredible woman\" in her...\nThe USGS warned there is a tsunami risk in light of the massive tremor.\nDaily Express\nBuckingham Palace is synonymous with the Royal Family, but there are a number of...\nHospitality and retail have been hit hardest, with pubs, restaurants and shops...\nAmazon is dishing out the Galaxy Tab S10 FE+ at a handsomely discounted rate.\nThese beaches are stunning and untouched, as tourists largely don't know about them.\nBusiness owners and visitors have described antisocial behaviour, with rough sleepers in shop doorways and teenagers in balaclavas.\nAfternoons are peak activity time and this year's colonies are bigger and more...\nThe Google Pixel 9a costs less on contract over two years than if you buy it outright,...\nEXCLUSIVE: More than 50,000 people have entered the country via small boat crossings...\nDonald Trump is continuing with business as usual while his vice president enjoys a break\nMany tourists are unaware of the regulations which could land them hefty fines.\nMySweetSmile are the UK's number one teeth whitening brand, and they're celebrating...\nExclusive: As a traveller, I always want to follow what the locals do, but in this...\nEducation minister Baroness Jacqui Smith spoke to BBC Breakfast after new figures showed the number of migrants who've crossed the Channel\nBBC Breakfast viewers issued the same complaint during an interview on Tuesday's show\nVirgin Media is offering free TVs to those signing up for certain bundles but this...\nIf the popularity of this cafe is anything to go by I don't think it will be long...\nWARNING: DISTRESSING CONTENT A chilling broadcast left an Arizona family grappling...\nThe DWP has confirmed that people over State Pension age who need to claim this year's...\nA Good Morning Britain star has been hit with a wave of criticism following her...\nAs whispers of discontent echo across the UK, Eamonn Holmes' startling observations on...\nLabour is looking into a major overhaul of UK motoring rules with new eye checks, drink-driving limits and tough seatbelt penalties among the updates.\nA British expat living in Benidorm has warned UK tourists of one \"dangerous\" area.\nAn experienced traveller has highlighted an 'underrated city' in Europe that has...\nIn a small Illinois town, a shocking revelation has left a community reeling. A...\nIt turns out you need to be very careful which room you keep orchids in your home, as...\nThe Metropolitan Police worked with the Motor Insurers' Bureau (MIB) to impound...\nFrom plugging in appliances incorrectly to botched DIY projects...\nNewcastle striker Alexander Isak has reportedly made his views on his Magpies career...\nA new petition is calling for state pension to match the National Living Wage and begin payments six years earlier\nCesar Delgadillo, 39, has been charged with homicide, child endangerment, evidence...\nIn the midst of a relentless heatwave, a dramatic overnight storm has left thousands...\nCNN's senior data analyst Harry Enten exposed Donald Trump's approval ratings on the...\nA plane has burst into flames after crashing at Kalispell Airport in Montana, US.\nOne of the first web pioneers is finally about to hang up the phone.\nDonald Trump has officially taken control of the Washington, D.C. police and vowed to...\nWhether you're trying for a baby, going through perimenopause or struggling with...\nEXCLUSIVE: A royal expert has revealed how the Royal Family will be feeling after Prince Harry and Meghan Markle's Netflix announcement today.\nPeter Phillips' royal wedding is on the cards as he recently announced his engagement...\nIt had been reported that Prince Harry and Meghan Markle's Netflix deal was coming to...\nRussia risks losing 130 small towns amid collapsing industries, poor infrastructure...\nMichael James was found guilty of rape, attempted rape and assault by penetration and...\nEmma Raducanu suffered another close defeat to Aryna Sabalenka in a thrilling match at...\nWho owns which side of the fence is often a sore subject for neighbours and the number...\nThe 2025 Strictly cast announcements have officially begun\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Prince Harry and Meghan Markle have expressed their excitement over a new multi-year first-look deal with Netflix, allowing them to continue their creative partnership after previous speculation about the end of their collaboration. The couple, who described the recent period of silence amid contract negotiations as 'frustrating,' are pleased to dispel rumors regarding their media ventures. Their most successful project to date, the documentary 'Harry & Meghan,' has garnered significant viewership, reinforcing their appeal to audiences.",
  "argos_id": "TUK7T98T6"
}