{
  "url": "https://www.newsweek.com/trump-ukraine-russia-war-eu-putin-alaska-2112105",
  "authorsByline": "Robert Birsel, Shane Croucher",
  "articleId": "f11ebc03d30b416eb53ce7cef91a1c9b",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2700768/us-president-donald-trump.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T03:33:59-04:00",
  "addDate": "2025-08-12T07:37:39.755384+00:00",
  "refreshDate": "2025-08-12T07:37:39.755387+00:00",
  "score": 1.0,
  "title": "Trump's EU allies send him new Ukraine plea ahead of Putin summit",
  "description": "In Alaska, Presidents Donald Trump and Vladimir Putin are due to discuss ending Russia's war against Ukraine.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nEuropean Union (EU) leaders issued a fresh joint appeal to U.S. President Donald Trump on Ukraine, imploring him ahead of his crunch summit with Russian President Vladimir Putin in Alaska on Friday, August 15.\n\nKyiv and its European allies fear Trump will consent to the concession of Ukrainian territory Moscow has seized during its invasion, which they say will reward Russia for its unlawful aggression and signal that it could take similar action elsewhere.\n\nTwenty-six EU leaders—Hungary being the only member state that did not want to co-sign—said in the statement Tuesday that they welcomed Trump's efforts to end Russia's invasion and seek \"a just and lasting peace and security for Ukraine\".\n\nBut they warned: \"A just and lasting peace that brings stability and security must respect international law, including the principles of independence, sovereignty, territorial integrity and that international borders must not be changed by force.\n\n\"The people of Ukraine must have the freedom to decide their future. The path to peace in Ukraine cannot be decided without Ukraine. Meaningful negotiations can only take place in the context of a ceasefire or reduction of hostilities.\n\n\"Russia's war of aggression against Ukraine has wider implications for European and international security. We share the conviction that a diplomatic solution must protect Ukraine's and Europe's vital security interests.\"\n\nThis is a developing article. Updates to follow.",
  "medium": "Article",
  "links": [
    "https://www.newsweek.com/topic/vladimir-putin",
    "https://www.newsweek.com/topic/eu",
    "https://www.newsweek.com/topic/donald-trump"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new Ukraine plea",
      "weight": 0.098520756
    },
    {
      "name": "Ukraine",
      "weight": 0.09714983
    },
    {
      "name": "U.S. President Donald Trump",
      "weight": 0.090786606
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.08227655
    },
    {
      "name": "Donald Trump",
      "weight": 0.08127133
    },
    {
      "name": "international law",
      "weight": 0.07672498
    },
    {
      "name": "international borders",
      "weight": 0.07609516
    },
    {
      "name": "Trump",
      "weight": 0.07462175
    },
    {
      "name": "Putin summit",
      "weight": 0.07186154
    },
    {
      "name": "Vladimir Putin",
      "weight": 0.06761204
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    },
    {
      "name": "European Union"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9873046875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.93603515625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.88134765625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.794921875
    },
    {
      "name": "/News/World News",
      "score": 0.71630859375
    }
  ],
  "sentiment": {
    "positive": 0.12700675,
    "negative": 0.5092363,
    "neutral": 0.36375704
  },
  "summary": "European Union (EU) leaders have issued a joint plea to U.S. President Donald Trump, ahead of his summit with Russian President Vladimir Putin. The statement praised Trump's efforts to end Russia's invasion and seek \"a just and lasting peace and security for Ukraine\". However, they warned that respect for international law and the freedom of the people involved in peace cannot be achieved without a ceasefire or reduction of hostilities.",
  "shortSummary": "EU leaders urge President Donald Trump to respect international law and protect Ukraine's sovereignty ahead of a crucial summit with Russia's leader.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5762e2836ddb41ce870c3493183a759d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/topic/donald-trump",
      "text": "Putin preparing for new offensive after Trump meeting: Zelensky\nThe Ukrainian president said that Vladimir Putin is \"definitely not preparing for a ceasefire.\"\nTrump's EU allies send him new Ukraine plea ahead of Putin summit\nIn Alaska, Presidents Donald Trump and Vladimir Putin are due to discuss ending Russia's war against Ukraine.\nDonald Trump to keep National Guard in Washington DC for weeks\nNational Guard members deployed to D.C. to combat \"lawlessness\" will remain until late September, according to a leaked memo.\nPete Hegseth responds to claims that he and Trump want \"martial law\"\nTrump invoked Section 740 of the 1973 D.C. Home Rule Act, allowing federal control for 30 days, with congressional approval required for extensions.\nGolf\nBryson DeChambeau Opens Up About Plans for President's Sports Council\nBryson DeChambeau hasn't quite settled into his new role on the President's Council on Sports, Fitness and Nutrition but already has grand plans.\nWho is E.J. Antoni? Trump taps new labor statistics chief\nAntoni has served as chief economist for the conservative Heritage Foundation think tank.\nTrump-appointed judge deals legal blow to the White House\nA Trump-appointed judge ruled against the administration, concluding that it improperly withheld congressionally-approved funds.\nLaura Loomer fires back at Marjorie Taylor Greene: \"Low life degenerate\"\nLoomer went scorched earth on Greene, calling her a \"whore,\" a \"degenerate\" and questioning her Christian faith.\nElon Musk reacts as Grok account gets temporarily suspended\nFollowing its reinstatement within minutes, the Grok account provided contradictory explanations for the suspension across different languages.\nFull list of America's most dangerous cities as Trump cracks down on D.C.\nTrump has indicated he could \"go further\" in his actions to address crime, though violent crime has dropped recently.\nDC Mayor Muriel Bowser reacts to Donald Trump deploying national guard\nMuriel Bowser, mayor of Washington, D.C., says she has reached out to Attorney General Pam Bondi and hopes to hold a meeting soon.\nDonald Trump gives major China tariff update\nPresident Donald Trump has reportedly signed an executive order granting a 90-day extension to the China tariff deadline.\nDonald Trump gives update on gold tariffs after market turmoil\nThe White House said last week it was preparing an executive order to \"clarify misinformation\" regarding tariffs on gold bars.\nSatellite photo shows Israel military buildup near Gaza\nA new image reveals Israel is massing troops, signaling a possible ground invasion as the government approves a plan to seize Gaza City.\nGavin Newsom issues new warning to Donald Trump: \"Playing with fire\"\nThe GOP majority in Texas wants to redraw districts so that five more Republicans can be elected to the U.S. House.\nUS to take cut of AI chip sales to China. Security risk or easy money?\nNvidia and AMD agreed to share 15 percent of their revenues from AI chip sales to China with the U.S. government in an unusual export deal.\nRecession is still coming, warns Reagan economic adviser\nSteve Hanke, a member of Ronald Reagan's Council of Economic Advisers, believes the U.S. will slip into a recession this year.\nDonald Trump's chip revenue deal comes under scrutiny\nThe deal, which ties government permission to a revenue-sharing requirement, has been criticized by some as unconstitutional.\nDonald Trump approval rating numbers have become \"very boring\"—Nate Silver\nPollster Nate Silver said the president's approval rating had steadied after a period of decline.\nPeanut the squirrel's owners seek $10M over death of \"irreplaceable\" animal\nMark Longo and Daniela Bittner are suing New York for $10 million, claiming state officials unlawfully killed their famous squirrel and raccoon.\nDonald Trump says major marijuana decision coming soon\nReclassifying marijuana would significantly ease restrictions on buying and selling cannabis.\nGhislaine Maxwell Holds Key to Trump's Murdoch Lawsuit—and Her Jail Cell\nGhislaine Maxwell can put money in Donald Trump's pocket. Here's how she'll do it.\nThe Right Keeps Getting Social Security Disastrously Wrong | Opinion\nTreasury Secretary Scott Bessent was filmed saying the new \"Trump Accounts\" would be a \"backdoor for privatizing Social Security.\"\nWhy Lara Trump photo is causing a stir in the Middle East\nA photo of President Donald Trump's daughter-in-law with an Egyptian artist, taken at a music charity event, has gone viral.\nTrump names 5 cities as he says National Guard deployment will \"go further\"\nThe president's remarks came as he discussed his decision to formally declare a public safety emergency in Washington, D.C.\nRussia using Donald Trump peace talks to divide US and Europe: ISW\nMoscow wants to weaken cohesion between the U.S, Ukraine and Europe, the think tank said.\nMarjorie Taylor Greene hits out at net worth claims: \"Go to hell\"\n\"I'm fed up with the outright slander and lies about me,\" the congresswoman wrote on X.\nJD Vance and Marco Rubio's odds of being Trump MAGA heir\nJD Vance and Marco Rubio are leading contenders to succeed Donald Trump and take up the MAGA mantle.\nElon Musk's Grok calls Trump \"most notorious criminal\" in Washington, DC\nThe AI chatbot told users that Trump was the most notorious criminal in the city \"based on convictions and notoriety.\"\nWhy OSINT Must Be a Cornerstone of U.S. National Security | Opinion\nThe time has come to give OSINT the attention, investment, and respect it has long deserved."
    },
    {
      "url": "https://www.newsweek.com/topic/eu",
      "text": "Trump's EU allies send him new Ukraine plea ahead of Putin summit\nIn Alaska, Presidents Donald Trump and Vladimir Putin are due to discuss ending Russia's war against Ukraine.\nEurope to escape new Trump pharmaceutical tariffs\nIn a recent interview with CNBC, President Donald Trump threatened to place a 250 percent tariff on all pharmaceutical imports.\nDonald Trump threatens 250% tariff on pharmaceuticals\nThe threat comes as Trump's administration pressures pharmaceutical companies to lower drug prices for Americans.\nMap shows what Trump tariff rates are for each country\nAfter two pauses, President Trump has now reinstated his \"adjusted\" reciprocal tariffs on dozens of America's trading partners.\nPresident Trump and the tariffs debate: The week in your words\nNewsweek once again takes a look at your comments of the week—this time focusing on the U.S. administration's trade policies.\nAmerica Needs a Digital Dollar | Opinion\nThe question isn't whether digital currencies will reshape global finance, it's whether America will lead this transformation or watch from the sidelines as others determine the future of money.\nExclusive: EU ambassador reveals next challenges after Trump trade deal\nEU Ambassador Jovita Neliupšienė discusses China, Russia, U.S. ties and the 'existential' issue of security with Newsweek.\nPeter Navarro says Trump might get Nobel economics prize\n\"He's basically taught the world trade economics,\" Trump's senior trade adviser told Fox Business Thursday morning.\nTrump's EU deal may not hurt Putin\nThe EU's Ursula von der Leyen said too much Russian energy still enters Europe, despite sanctions.\nTrump's EU deal could cost pharma industry $19 billion, analyst warns\nThe 15 percent tariff rate agreed under the new deal could significantly impact pharma firms reliant on European imports.\nDonald Trump's trade deal splits Europe\nFrance and Germany have warned about the economic fallout from the 15 percent tariffs European goods face in the U.S.\nRussia says Nazism making comeback in West\nSergey Lavrov claimed \"the vaccine against Nazism has begun to wear out\" in the West.\nTrump's EU trade deal explained\n\"I think it's the biggest deal ever made,\" Trump said of the new agreement, which will reduce the bloc's tariff rate to 15 percent.\nGlobal markets welcome US-EU trade deal\nMarket relief as the United States and European Union avert a trade war.\nTrump announces US-EU trade framework before tariff deadline\nTrump and the EU reached a trade framework to avoid 30 percent tariffs, with EU committing $750 billion in energy purchases and $600 billion investment.\nDonald Trump hits out at Europe: \"get your act together\"\nU.S. president told reporters in Scotland that immigration is \"killing Europe.\"\nChina's Xi makes Trump wait for leader talks\nAnalysts say the Chinese leader expects deliverables before reengaging with the White House.\nExclusive: Wilbur Ross outlines Trump's biggest tariffs challenge\nIn an exclusive interview with Newsweek, the former Commerce Secretary discusses trade, China and tariffs under Trump 2.0.\nHow Will Putin React to Trump's Ukraine Pivot? Newsweek Contributors Debate\nWill Vladimir Putin back down? What should Trump's next move be? And what does the future hold for Ukraine?\nCan Patriot missiles help Ukraine turn the tide?\nThe president announced the US will send additional Patriot air-defense systems to Ukraine, part of a European Union–funded deal.\nJohn Bolton warns Trump's Ukraine shift won't win him a Nobel prize\nBolton told Newsweek that Trump's pursuit of a Nobel Prize has clouded his foreign policy, particularly on the war in Ukraine.\nEU threatens Donald Trump with $24.5 billion tariff list\nItaly's foreign minister warned that, while he hopes for successful negotiations, the EU will respond resolutely to Trump's latest tariff threat.\nTrade chief issues Trump tariff warning: \"almost impossible\"\nPresident Donald Trump said a 30 percent tariff was coming for goods imported from the EU bloc.\nGermany seeks Trump tariff agreement extension as deadline looms\nGerman Chancellor Friedrich Merz is working with EU leaders to prevent 30 percent U.S. tariffs before the August 1 deadline amid escalating trade tensions.\nEuropean leaders respond to Donald Trump's tariff announcement\nPresident Donald Trump on Saturday announced 30 percent tariffs on all European goods entering the U.S., prompting pushback from European allies.\nDonald Trump reveals new tariffs for Mexico and Europe\nPresident Trump warned Mexican President Claudia Sheinbaum and European Commission President Ursula von der Leyen against taking retaliatory measures.\nNATO ally bordering Russia withdraws from international weapons treaty\nPoland and the Baltic states also withdrew from the Ottawa Convention despite pleas from some leaders to maintain decorum in the face of Russian aggression.\nMap shows where China is accused of targeting rivals with lasers\nChina has been accused of targeting rivals with lasers since 2018.\nChina reacts to laser accusation by US's NATO ally\nGermany has accused the Chinese military of disrupting a reconnaissance aircraft over the Red Sea during an operation.\nChina military uses laser on US ally's aircraft: What to know\nThe laser was used to disrupt an EU operation, the German Foreign Office said."
    },
    {
      "url": "https://www.newsweek.com/topic/vladimir-putin",
      "text": "Putin preparing for new offensive after Trump meeting: Zelensky\nThe Ukrainian president said that Vladimir Putin is \"definitely not preparing for a ceasefire.\"\nTrump's EU allies send him new Ukraine plea ahead of Putin summit\nIn Alaska, Presidents Donald Trump and Vladimir Putin are due to discuss ending Russia's war against Ukraine.\nRussia using Donald Trump peace talks to divide US and Europe: ISW\nMoscow wants to weaken cohesion between the U.S, Ukraine and Europe, the think tank said.\nZelensky warns Russia \"must not receive any rewards\" ahead of Alaska summit\nTrump and Putin are set to meet on Friday in talks where exchanging land for peace is likely on the agenda.\nNordic countries send message to Trump over Ukraine peace deal\n\"We welcome the initiative of President Trump to help bring this war to an end,\" said the Nordic-Baltic Eight.\nRussia says nations plotting to derail Trump-Putin Alaska Talks\nThe summit is poised to be a high-stakes negotiation over the direction of the Ukraine conflict, amid concerns from Europe and Kyiv.\nWhat Russia and Ukraine are demanding ahead of Putin-Trump Alaska meeting\n\"The presidents will undoubtedly focus on discussing ways to reach a sustainable settlement to the Ukraine crisis,\" a Kremlin aide said on Saturday.\nGraham wants to \"crush\" Russian oil customers: \"Putin could give a damn\"\nThe GOP senator has remained hawkish on Russia and China, hitting out at Russian President Vladimir Putin over his seeming lack of care about deaths in Ukraine.\nUkraine reacts to reports Trump may invite Zelensky to Alaska talks\nThe planned summit between U.S. President Donald Trump and Russian leader Vladimir Putin is a \"highly anticipated meeting,\" the Republican said.\nTrump envoy slammed for \"damaging incompetence\" over Putin talks\nMichael McFaul, a former U.S. ambassador to the Russian Federation, accused Steve Witkoff of \"deeply damaging incompetence.\"\nAlaska governor reacts to Trump-Putin meeting: \"most strategic location\"\n\"It's fitting that discussions of global importance take place here,\" Mike Dunleavy said in an X post.\nHow Ukraine's critical \"fortress belt\" could be lost under Putin's demands\nSurrendering a strategically significant part of Donetsk could leave Ukraine vulnerable, said the Institute for the Study of War.\nZelensky reacts to Trump-Putin Alaska meeting: \"We will not reward Russia\"\nPresident Donald Trump and his Russian counterpart, Vladimir Putin, are to meet in Alaska on August 15.\nKey Putin ally says he will not seek reelection\nBelarusian President Alexander Lukashenko has played a key role for Russian President Vladimir Putin throughout his invasion of Ukraine.\nDonald Trump reveals location of summit with Vladimir Putin\nPresident Trump revealed the location where he and Russian President Vladimir Putin will meet for a high-stakes summit over Ukraine.\nUS-Russia peace deal proposed, huge win for Putin: Report\nThe proposed peace deal would lock in Russia's gains in Ukraine, handing Putin a huge win, a report from Bloomberg stated.\nMap shows how Russia and Ukraine could swap land to end war\nBloomberg reported that a land swap would be discussed in a meeting between Trump and Putin, although Kyiv has rejected this idea before.\nPutin reveals where Trump meeting could take place\nVladimir Putin has said the United Arab Emirates would be \"one of the more suitable locations\" for talks with Trump regarding the Ukraine war.\nRussia lends nuclear support to new combat ally\nA report raises concerns that the Kim regime is receiving technical expertise in exchange for joining Russia's war against Ukraine.\nTrump's relationship with Modi sours over Putin\nThe rapport between the leaders of the U.S. and India has dived over New Delhi's purchase of Russian oil.\nTrump gives update on Russia talks after calling Kremlin a \"threat\"\nTrump touted a meeting between special envoy Steve Witkoff and Russian President Vladimir Putin in a Truth Social post.\nTrump and Putin are flexing their way toward a nuclear stand-off\n\"Rhetoric sometimes turns into action in unpredictable ways,\" a former senior U.S. arms control official told Newsweek.\nUS to auction Russian oligarch's seized $300 million superyacht\nThe Amadea was seized from billionaire Suleiman Kerimov who is linked to Vladimir Putin.\nDonald Trump aims new US sanctions at Russian fleet: report\nBlacklisting ships in the fleet would represent the first U.S. sanctions on Moscow since Trump returned to the White House in January.\nRussia issues nuclear weapons warning: 'No limits'\nRussia has said it is no longer restricted in the deployment of intermediate and shorter-range missiles, which can carry nuclear warheads.\nRussia's richest billionaires are getting wealthier fast\nThe country's wealthiest individuals have added more than $20 billion to their wealth so far this year, despite international sanctions.\nWho is Luiza Rozova? Putin's 'illegitimate' daughter breaks silence\nElizaveta Krivonogikh, also known as Luiza Rozova, has criticized Russian President Vladimir Putin, her alleged father, after more than a year of silence.\nPutin gives update on Zelensky talks\nThe Kremlin announced that the Russian president was prepared to meet his Ukrainian counterpart after \"preparatory work at the expert level.\"\nTrump's envoy Steve Witkoff to visit Russia this week: What we know\nThe U.S. envoy is set to discuss with Russia how to end the war President Vladimir Putin began, U.S. President Donald Trump said.\nRussian lawmaker responds to Trump moving nuclear subs\nViktor Vodolatsky hit back at Trump's recent announcement about moving two U.S. nuclear submarines, saying his country has better ones."
    }
  ],
  "argos_summary": "European Union leaders have urged U.S. President Donald Trump to uphold Ukraine's sovereignty ahead of his summit with Russian President Vladimir Putin, expressing concerns that any concessions could embolden further Russian aggression. The 26 EU leaders emphasized that peace negotiations must respect international law and include Ukraine's voice, warning against rewarding Russia for its invasion. As the summit approaches, fears grow that discussions may involve territorial compromises, which Ukraine firmly opposes.",
  "argos_id": "UANM2RGKZ"
}