{
  "url": "https://seekingalpha.com/article/4812778-super-micro-computer-gross-margin-compression-is-temporary",
  "authorsByline": "Oliver Rodzianko",
  "articleId": "d3e702a0f0df456f8903a740c897150e",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/600999888/image_600999888.jpg?io=getty-c-w1536",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:15:08+00:00",
  "addDate": "2025-08-12T20:19:58.017334+00:00",
  "refreshDate": "2025-08-12T20:19:58.017335+00:00",
  "score": 1.0,
  "title": "Super Micro Computer's Gross Margin Compression Is Temporary (NASDAQ:SMCI)",
  "description": "Super Micro Computer, Inc. stock fell to $45 amid margin concerns. Analysts see margin expansion by FY26. Click for why a tactical buy of SMCI shares makes senses.",
  "content": "Oliver Rodzianko is the Founder and Chief Executive Officer of Invictus Origin, a pioneering high-alpha investment company launched in May 2025 that is on trajectory to deliver among the highest annual returns in the world. Invictus Origin is developing innovative portfolio strategies, notably through its flagship High-Alpha Black Swan Portfolio (also known as the Invictus Hydra Portfolio), strategically designed to sustainably and significantly outperform leading indices, including the Nasdaq-100. Distinctively, the Invictus Hydra Portfolio maintains approximately 20% in dynamic cash reserves, providing growth from downside through strategic value investing at opportune moments during significant market disruptions.Oliver brings extensive experience as a macro-focused investment analyst specializing in public equities, with a disciplined approach emphasizing fundamental valuation, long-term market cycles, and sector expertise in technology, semiconductors, artificial intelligence, and energy. His investment process integrates U.S. market specialization with comprehensive international market awareness. Oliver has established a strong reputation through his work on leading platforms such as Seeking Alpha, TipRanks, and GuruFocus, consistently providing high-level, actionable insights to a broad audience of sophisticated investors, including industry-leading public figures. He collaborates with an extensive team of top-tier editors to deliver elite content to his dedicated readers.As CEO of Invictus Origin, Oliver leverages this expertise to establish a firm characterized by resilience, performance, and disciplined capital stewardship, further supported by the ongoing development of a complementary family office structure dedicated to lower-volatility capital preservation.\n\nAnalyst’s Disclosure:I/we have a beneficial long position in the shares of SMCI, NVDA either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Seeking Alpha",
      "weight": 0.08172865
    },
    {
      "name": "US investment adviser",
      "weight": 0.07363595
    },
    {
      "name": "Invictus Origin",
      "weight": 0.072609566
    },
    {
      "name": "investment bank",
      "weight": 0.072162256
    },
    {
      "name": "U.S. market specialization",
      "weight": 0.06527975
    },
    {
      "name": "disciplined capital stewardship",
      "weight": 0.063866116
    },
    {
      "name": "comprehensive international market awareness",
      "weight": 0.0628204
    },
    {
      "name": "sophisticated investors",
      "weight": 0.06241749
    },
    {
      "name": "significant market disruptions",
      "weight": 0.062072188
    },
    {
      "name": "individual investors",
      "weight": 0.061547138
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97998046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.966796875
    },
    {
      "name": "/News/Technology News",
      "score": 0.418701171875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.337646484375
    }
  ],
  "sentiment": {
    "positive": 0.54545254,
    "negative": 0.04140869,
    "neutral": 0.41313884
  },
  "summary": "Oliver Rodzianko, founder and CEO of Invictus Origin, a high-alpha investment company, is on track to deliver among the highest annual returns in the world. The company's flagship portfolio, the Invictous Hydra Portfolio, is designed to outperform leading indices including the Nasdaq-100 and maintain approximately 20% in dynamic cash reserves during significant market disruptions. Rodzanko brings extensive experience as a macro-focused investment analyst specializing in public equities with a disciplined approach emphasizing fundamental valuation, long-term market cycles, and sector expertise in technology, semiconductors, artificial intelligence, and energy.",
  "shortSummary": "Oliver Rodzianko, CEO of Invictus Origin, leads a pioneering high-alpha investment company with innovative portfolio strategies, enhancing resilience and value for shareholders.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "dceae5e5eab449e49e2767178d7c6a2e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Oliver Rodzianko is the CEO and Founder of Invictus Origin, a high-alpha investment firm established in May 2025, aiming to achieve top-tier annual returns. The company is known for its High-Alpha Black Swan Portfolio, which strategically allocates 20% in cash reserves to capitalize on market disruptions. Rodzianko, an experienced macro-focused investment analyst, emphasizes fundamental valuation and long-term market cycles, particularly in technology and energy sectors, while also providing insights through platforms like Seeking Alpha.",
  "argos_id": "UGNVMXA5Z"
}