{
  "url": "https://www.engadget.com/cybersecurity/russia-reportedly-implicated-in-hack-on-us-federal-courts-databases-204029993.html",
  "authorsByline": "Anna Washenko",
  "articleId": "8ac53d66fe2f454d8beeb2162a59f3a6",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/YIO29ASp8kwwfRJqPkp9Lw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/36c97480-77ba-11f0-bfaf-44de3d9a89eb",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-12T20:40:30+00:00",
  "addDate": "2025-08-12T20:47:20.591831+00:00",
  "refreshDate": "2025-08-12T20:47:20.591833+00:00",
  "score": 1.0,
  "title": "Russia reportedly implicated in hack on US federal courts' databases",
  "description": "Databases used by US federal courts for sharing and managing case documents have been hacked, according to reports from Politco and The New York Times.",
  "content": "Databases used by US federal courts for sharing and managing case documents have been hacked. first reported on the hack last week on August 6; today, an investigation from states that Russia is suspected to be involved in the attack. The Administrative Office of the US Courts initially identified the severity of the cyberattack in July, although the extent of the breach by \"persistent and sophisticated cyber threat actors\" has not been disclosed and may still not be known by national officials.\n\nBoth the Case Management/Electronic Case Files (CM/ECF) and PACER systems have been impacted by the attack. CM/ECF is used by legal professionals and courts to store documents, while PACER grants the public limited access to those same files. Anonymous officials told Politico that chief judges for federal courts in the 8th Circuit were briefed on the attack, but were unable to confirm what agency provided the briefing. The 8th Circuit includes Arkansas, Iowa, Minnesota, Missouri, Nebraska, North Dakota and South Dakota.\n\nPolitico's original report said the hack may have \"compromised the identities of confidential informants involved in criminal cases at multiple federal district courts.\" The Times coverage added that some of the searches by the intruders \"included midlevel criminal cases in the New York City area and several other jurisdictions, with some cases involving people with Russian and Eastern European surnames.\" However, there have been no additional details revealed about what entity is behind the attack, whether a branch of Russian intelligence may have been involved, or what evidence the investigators have discovered tying the hack to Russia.\n\nThe isn't the only time CM/ECF has been a hacking target. The courts introduced new protections for the system in response to a cyberattack; a similar arrived on August 7. At this time, the courts have been ordered to move files for cases that may have been of interest off the compromised systems, although some districts have ordered even more limited use of CM/ECF or PACER as a preventive measure.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2025/08/12/us/politics/russia-hack-federal-court-system.html",
    "https://www.uscourts.gov/data-news/judiciary-news/2021/01/06/judiciary-addresses-cybersecurity-breach-extra-safeguards-protect-sensitive-court-records",
    "https://www.politico.com/news/2025/08/06/federal-court-filing-system-pacer-hack-00496916?is=59f038ac2c743808162856c43ee55d07259e5f5ccbf3e54292556163a66576d1",
    "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US federal courts",
      "weight": 0.10498038
    },
    {
      "name": "federal courts",
      "weight": 0.09976853
    },
    {
      "name": "multiple federal district courts",
      "weight": 0.09723976
    },
    {
      "name": "criminal cases",
      "weight": 0.08856167
    },
    {
      "name": "midlevel criminal cases",
      "weight": 0.08842986
    },
    {
      "name": "case documents",
      "weight": 0.08630912
    },
    {
      "name": "courts",
      "weight": 0.08198758
    },
    {
      "name": "PACER systems",
      "weight": 0.08197715
    },
    {
      "name": "cases",
      "weight": 0.07780424
    },
    {
      "name": "hack",
      "weight": 0.06516355
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.88134765625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.83984375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.7802734375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.69775390625
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.66650390625
    },
    {
      "name": "/News/Technology News",
      "score": 0.6328125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.458251953125
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.334228515625
    }
  ],
  "sentiment": {
    "positive": 0.05487373,
    "negative": 0.6191668,
    "neutral": 0.3259595
  },
  "summary": "The databases used by US federal courts for sharing and managing case documents have been hacked, with both the Case Management/Electronic Case Files (CM/ECF) and PACER systems affected. The attack may have compromised the identities of confidential informants involved in criminal cases in multiple federal district courts. The Administrative Office of the US Courts identified the severity of the cyberattack in July, but the extent of the breach has not yet been disclosed. The hack occurred in the 8th Circuit, which includes several states including Arkansas, Iowa, Minnesota, Missouri, Nebraska, North Dakota and South Dakota. The courts have been ordered to move files for cases that may have been of interest off the compromised systems.",
  "shortSummary": "A massive cyberattack on US federal courts' databases, involving Russia, may have compromised confidential information and prompted increased security measures for the judicial system.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "88316d2e89c44b8e9412dcc2f633290e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.uscourts.gov/data-news/judiciary-news/2021/01/06/judiciary-addresses-cybersecurity-breach-extra-safeguards-protect-sensitive-court-records",
      "text": "After the recent disclosure of widespread cybersecurity breaches of both private sector and government computer systems, federal courts are immediately adding new security procedures to protect highly sensitive confidential documents filed with the courts.\n“The federal Judiciary’s foremost concern must be the integrity of and public trust in the operation and administration of its courts,” James C. Duff, Secretary of the Judicial Conference of the United States, the Judiciary’s national policy-making body, said in a January 6, 2021, communication to the courts.\nIn mid-December, the Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency issued an emergency directive regarding “a known compromise involving SolarWinds Orion products that are currently being exploited by malicious actors.” The Administrative Office of the U.S. Courts (AO) immediately notified courts of this development and in response, the Judiciary has suspended all national and local use of this IT network monitoring and management tool.\nThe AO is working with the Department of Homeland Security on a security audit relating to vulnerabilities in the Judiciary’s Case Management/Electronic Case Files system (CM/ECF) that greatly risk compromising highly sensitive non-public documents stored on CM/ECF, particularly sealed filings. An apparent compromise of the confidentiality of the CM/ECF system due to these discovered vulnerabilities currently is under investigation. Due to the nature of the attacks, the review of this matter and its impact is ongoing.\nUnder the new procedures announced today, highly sensitive court documents (HSDs) filed with federal courts will be accepted for filing in paper form or via a secure electronic device, such as a thumb drive, and stored in a secure stand-alone computer system. These sealed HSDs will not be uploaded to CM/ECF. This new practice will not change current policies regarding public access to court records, since sealed records are confidential and currently are not available to the public.\nIf they have not done so already, courts will issue standing or general orders regarding these new procedures. While they are intended to apply to all HSDs filed with a court, not all currently sealed filings should be considered an HSD. It is anticipated that court orders will address the type of filings a court does and does not consider to be HSDs. For example, most documents similar to and including presentence reports, pretrial release reports, pleadings related to cooperation in most criminal cases, Social Security records, administrative immigration records, and sealed filings in many civil cases likely would not be sufficiently sensitive to require HSD treatment and could continue to be sealed in CM/ECF as necessary. Each court’s standing or general order or equivalent procedure should address the types of filings it does and does not consider to be HSDs. Courts will work with their local bar regarding implementation of the new case filing procedures.\n“The federal Judiciary has long applied a strong presumption in favor of public access to documents,” Duff said. “Court rules and orders should presume that every document filed in or by a court will be in the public domain, unless the court orders it to be sealed, and that documents should be sealed only when necessary,” Duff said in his January 6 memo to the courts.\n“We fully appreciate the practical implications of taking these steps and the administrative burden they will place on courts, yet any such burdens are outweighed by the need to preserve the confidentiality of sealed filings that are at risk of compromise.”\nThe Judicial Conference and its committees will continue to consider and develop policy and guidance when necessary and the AO will continue to provide the courts with support and resources as they address this critical matter.\nSubscribe to News Updates\nSubscribe to be notified when the news section is updated."
    },
    {
      "url": "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system",
      "text": "The federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks of a sophisticated and persistent nature on its case management system. The Judiciary is also further enhancing security of the system and to block future attacks, and it is prioritizing working with courts to mitigate the impact on litigants.\nThe Administrative Office of the United States Courts has continued to collaborate with Congress as well as the Department of Justice, the Department of Homeland Security and other partners in the executive branch to mitigate the risks and impacts of these cyberattacks.\nThe vast majority of documents filed with the Judiciary’s electronic case management system are not confidential and indeed are readily available to the public, which is fundamental to an open and transparent judicial system. However, some filings contain confidential or proprietary information that are sealed from public view.\nThese sensitive documents can be targets of interest to a range of threat actors. To better protect them, courts have been implementing more rigorous procedures to restrict access to sensitive documents under carefully controlled and monitored circumstances.\nEnhancing the security of its systems is a top priority for the Judiciary. Over the past few years, the Judiciary has added significant cybersecurity protections and safeguards to the case management system. The Chairman of the Judicial Conference’s Committee on Information Technology, Court of Appeals Judge Michael Y. Scudder, briefed the Conference and the media in September 2024 on potential threats to Judiciary IT systems and steps taken by the Judiciary to address them. Subsequently, in June of this year Judge Scudder testified before a House Judiciary subcommittee and underscored the Judiciary’s ongoing commitment to investing in and modernizing its IT systems in order to confront the constant and increasingly sophisticated cybersecurity threats the branch faces.\nAs other federal government and private entities likewise continue to experience, cyber risks continue to evolve as threat actors grow more sophisticated and change and adapt their tactics, and safeguarding legacy systems poses a particularly difficult challenge. In tackling cybersecurity threats, the Judiciary embraces its security obligations and remains committed to leveraging all available resources to include collaboration with law enforcement, national security and cybersecurity organizations, and other information sharing entities.\nSubscribe to News Updates\nSubscribe to be notified when the news section is updated."
    }
  ],
  "argos_summary": "US federal court databases, including the Case Management/Electronic Case Files (CM/ECF) and PACER systems, have been hacked, with investigations suggesting Russian involvement. The breach may have compromised the identities of confidential informants and has prompted the courts to implement new security measures, including filing sensitive documents in paper form or via secure devices. The Administrative Office of the U.S. Courts is working with various federal agencies to enhance cybersecurity and mitigate risks from ongoing cyber threats.",
  "argos_id": "UKGMXVFTN"
}