{
  "url": "https://www.buzzfeed.com/morgansloss1/pete-hegseth-video-women-shouldnt-vote-reactions",
  "authorsByline": "Morgan Sloss",
  "articleId": "7902e4b47abd416d9b031053bb6159ed",
  "source": {
    "domain": "buzzfeed.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://img.buzzfeed.com/buzzfeed-static/static/2025-08/12/19/thumb/IVxIVGIhS.jpg?crop=2400:1257;0,0%26downsize=1250:*",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:41:34+00:00",
  "addDate": "2025-08-12T20:57:49.359650+00:00",
  "refreshDate": "2025-08-12T20:57:49.359651+00:00",
  "score": 1.0,
  "title": "People Are Livid That Pete Hegseth Reposted A Video Saying Women Shouldn't Have The Right To Vote",
  "description": "\"If politicians don’t want me to vote, then they can give me back most of the tens of thousands of dollars of taxes I've paid over the decades.\"",
  "content": "The segment is filled with proud Christian nationalists who believe women should submit to their husbands and blah blah blah. Doug also called for the return of sodomy laws and had some terrible things to say about \"decent human beings\" who owned slaves. Obviously, not the kind of people you'd invite over for dinner.\n\nDid the Secretary of Defense repost the video to call it out or shame these church leaders? Of course not! He simply added the caption: \"All of Christ for All of Life.\" You'll remember Pete, of course, as the incompetent fool who allegedly sent war plans to a journalist . THAT GUY is promoting content saying women shouldn't have the right to vote.\n\nNaturally, the internet has a lot to say about all this: Comments were included from Reddit threads here, here, here, and here.\n\n Editor's Note: While we can't endorse what X has become, we can bring you the worthwhile moments that still exist there, curated and free of the surrounding chaos.\n\n\"If politicians don’t want me to vote, then they can give me back most of the tens of thousands of dollars of taxes I've paid over the decades. If I'm paying their salaries, then I absolutely get to vote in their elections. And I don’t give a fuck what any religious figure says.\"\n\n\"This should be a much bigger deal than it's going to be. Trump will change tariffs or tweet something out in a few hours, and we'll move on. But the guy who leads our entire military just shared a post that says women exist to give birth, maintain the home, and they shouldn't have a right to vote. This should be a career ending deal. In the Trump admin, it's just Friday afternoon.\"\n\n\"Just to be clear, this is the U.S. Secretary of Defense—who multiple women voted to confirm—sharing content advocating for women to not vote. I wouldn’t have believed it if I hadn’t seen it with my own eyes. This is why we must organize and stay in the fight!\"",
  "medium": "Article",
  "links": [
    "https://www.buzzfeed.com/topic/politics",
    "https://x.com/canonpress/status/1953553752721649806",
    "https://twitter.com/PeteHegseth/status/1953626931234054558?ref_src=twsrc%5Etfw",
    "https://www.buzzfeed.com/briangalindo/pete-hegseth-group-chat-reactions",
    "https://www.reddit.com/r/politics/comments/1mnqizd/pete_hegseth_shares_video_of_pastor_calling_to/",
    "https://www.reddit.com/r/TwoXChromosomes/comments/1mlsu12/hegseth_reposts_video_on_social_media_featuring/",
    "https://www.npr.org/2025/08/07/nx-s1-5494710/trump-birth-control-contraception",
    "https://www.reddit.com/r/centrist/comments/1ml6nnl/pete_hegseth_shares_video_of_man_who_says_women/",
    "https://www.buzzfeed.com/michaelabramwell/reactions-viral-idaho-church",
    "https://www.politico.com/news/2024/07/18/trump-abortion-rnc-00169304",
    "https://www.buzzfeed.com/tag/pete-hegseth",
    "https://www.reddit.com/r/fednews/comments/1mmf9ea/defense_secretary_pete_hegseth_reposts_video_of/",
    "https://t.co/QqXhqZFStv",
    "https://twitter.com/PeteHegseth/status/1953626931234054558",
    "https://www.cnn.com/2025/08/08/politics/video/christian-nationalist-doug-wilson-pam-brown-digvid"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "multiple women",
      "weight": 0.091864266
    },
    {
      "name": "Women",
      "weight": 0.0883868
    },
    {
      "name": "women",
      "weight": 0.0883868
    },
    {
      "name": "proud Christian nationalists",
      "weight": 0.0664808
    },
    {
      "name": "Pete Hegseth",
      "weight": 0.06635335
    },
    {
      "name": "war plans",
      "weight": 0.05698687
    },
    {
      "name": "sodomy laws",
      "weight": 0.055635743
    },
    {
      "name": "Pete",
      "weight": 0.05488275
    },
    {
      "name": "Defense",
      "weight": 0.051973
    },
    {
      "name": "content",
      "weight": 0.050643243
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.94482421875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.8662109375
    },
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.65234375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.46630859375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.377197265625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.3046875
    }
  ],
  "sentiment": {
    "positive": 0.059965253,
    "negative": 0.72095853,
    "neutral": 0.21907619
  },
  "summary": "Pete Hegseth, the Secretary of Defense, has been criticized for reposting a video by Christian nationalists who believe that women shouldn't have the right to vote. The video, which was posted alongside the video's Christian nationalists, also advocated for the return of sodomy laws and criticized \"decent human beings\" who owned slaves. The internet responded with outrage, with some arguing that this should be a career ending deal for the military. The comments were shared from Reddit threads and by some, with others suggesting that women exist to give birth, maintain the home, and shouldn't be allowed to vote in their elections.",
  "shortSummary": "Pete Hegseth reposted a video advocating women's rights, sparking outrage from social media users and calls for legal reforms from politicians.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0a192d777e0e4b64aeb6b4bc1074da26",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.npr.org/2025/08/07/nx-s1-5494710/trump-birth-control-contraception",
      "text": "Trump cuts threaten access to birth control for millions of women\nHow the Trump administration is rolling back access to birth control in the U.S.\nContraception is a routine part of life for many Americans and polls show people across political parties agree that it should be legal and accessible.\nBut the Trump administration is walking back access to birth control for some people — including withholding funding from a Nixon-era program that guarantees access to contraception for low income people.\nTitle X under threat\nIt's only been a few generations since birth control was widely accessible in the U.S. Married women were not legally allowed to use contraception in some states, until the 1965 Supreme Court decision Griswald v. Connecticut. Shortly after that, in 1970 – facing poor health outcomes for mothers and babies – Congress created Title X.\nEnacted under the Nixon administration, the program guaranteed free contraception for people who needed it. In a special message to Congress in July 1969, Nixon wrote: \"It is my view that no American woman should be denied access to family planning assistance, because of her economic condition.\"\nThe program has existed ever since. The 2025 budget provided $285.6 million in Title X funds.\nNow, a group of 15 public health organizations is suing the Trump administration, arguing that the federal government jeopardized access to services including birth control for more than 800,000 people due to illegal withholding of Title X dollars.\nOne of the plaintiffs in the lawsuit is Bridgercare in Montana, which distributes funding to 20 reproductive health clinics across the state. Stephanie McDowell, Bridgercare's executive director, recalls receiving a letter from the Department of Health and Human Services on March 31st, notifying her that her organization's funding would be suspended the next day. The letter said Bridgercare had violated the Civil Rights Act and Executive Orders issued by President Trump. Other plaintiffs received similar letters.\n\" They were citing statements of anti-racism — statements that might be what we would commonly understand as DEI (Diversity, Equity and Inclusion) efforts,\" says McDowell.\nA message on the organization's website underscores that they welcome patients of different identities, including \"teens, LGBTQ+ individuals, and survivors of sexual assault.\"\nMcDowell says she believes these kinds of statements are what HHS is referring to.\n\" We meet people where they are, and that oftentimes means letting people know that we're a safe, welcoming space for them, regardless of their income, regardless of their identity,\" says McDowell.\nThe Department of Health and Human Services did not respond to a request for comment on this story.\nMcDowell says her organization has been limping by since their funding was revoked, largely relying on donations. Though services haven't been interrupted for patients, the organization is not in a sustainable position without federal funds, she says.\nOther organizations have not been able to shield their patients from the impact of reduced funding.\nIn Utah, Planned Parenthood representatives said they've had to close two clinics as a result of Title X funds being withheld, as well as implement a fee for some contraception services that were previously free.\n\"People are living paycheck to paycheck in our communities,\" says Shireen Ghorbani, who is the interim director of Planned Parenthood Association of Utah. \"We are not able to count on the federal government to keep the promise it made to access low cost care and to plan and space their families.\"\nThe National Family Planning and Reproductive Health Association, which is representing the organizations that brought the Title X lawsuit against the government, note that some grant recipients have received notice that their Title X funding will be restored.\nPermission to limit contraception\nIt's not only Title X funds that are jeopardizing access to contraception, says Kimi Chernoby, an attorney with the National Women's Law Center. She points to cuts to Medicaid included in the Republican spending bill that was recently signed into law, which jeopardize access to healthcare — including contraception — for millions of women in coming years.\nA number of state efforts have also sought to limit birth control. In Indiana, Republican lawmakers removed IUDs and condoms from a program that aimed to increase access to birth control, replacing them with \"fertility awareness based methods.\" After a Right to Contraception bill passed with bipartisan support in Virginia, Republican Governor Youngkin vetoed it.\nChernoby says the Trump administration has created a permission structure for these kinds of efforts. She points to Project 2025, the Heritage Foundation's \"blueprint\" for the new Republican administration. President Trump has adopted many of its policies.\nProject 2025 suggests changing requirements that employer-provided insurance and the Affordable Care Act cover contraception.\nThe Trump administration also included a provision in the most recent budget law that would withhold Medicaid funds from Planned Parenthood clinics across the country. The change could potentially cripple the organization and prevent it from providing healthcare services including contraception.\nThat provision is currently blocked in court, though Planned Parenthood officials say they are preparing for an appeal and underscore that 200 clinics across 24 states are at risk of closure.\n\"They are intent on expanding the population\"\nNeither the Trump administration nor the Heritage Foundation responded to a request for comment on this story or explained why they seek to reduce access to contraception.\nPlanned Parenthood's Ghorbani has a theory.\n\"It is very clear that they are intent on expanding the population,\" says Ghorbani. She points out that the Trump administration has called on Americans to have more babies, and says limits to reproductive care are a means of achieving that goal. \"That can be everything from contraception to access to abortion care,\" she says.\nGhorbani says even though these cuts have hit low-income patients the hardest, attacks on public health impact the whole ecosystem of healthcare.\n\"All of this is building a structure that makes it harder and harder for individuals to control their sexual and reproductive lives, to plan their families and have kids when they want to.\"\nKimi Chernoby, with the National Women's Law Center, draws parallels between the administration's effort to limit contraception with successful efforts to limit abortion.\n\" We are seeing the anti-abortion folks just repurpose their playbook,\" says Chernoby, who notes that contraception may be more difficult to limit than abortion given its widespread popularity.\n\"We see them testing these restrictions on minors and low income communities, but we should regard it very much as a litmus test — and expect that they are going to expand these restrictions to affect all of us.\""
    },
    {
      "url": "https://www.cnn.com/2025/08/08/politics/video/christian-nationalist-doug-wilson-pam-brown-digvid",
      "text": "The Christian nationalist pastor with ties to Defense Secretary Pete Hegseth\nSelf-described Christian nationalist pastor Douglas Wilson is part of an ascendent group of Christian religious leaders finding influence among MAGA conservatives. US Defense Secretary Pete Hegseth is Wilson’s most prominent and public follower in the Trump administration. CNN's Pamela Brown reports from Moscow, Idaho where Wilson's Christ Church is based.\n06:47\n- Source:\nCNN\nPolitics of the Day\n19 videos\nThe Christian nationalist pastor with ties to Defense Secretary Pete Hegseth\nJasmine Crockett: Democratic base wants to see a fight over redistricting\nTapper pushes back on Abbott over calls to remove Dem lawmaker\nSanders: US run by ‘extremely greedy people’ who ‘want it all’\nBorder Patrol chief asked why Home Depots are targeted during immigration raids\nTrump says he thinks 'we have a shot at' peace between Russia and Ukraine\nTrump to meet with Putin in Alaska\nStalemate in Texas House continues. Here's how it ended previously\n'South Park' mocks Kristi Noem in new episode\nThese young Democrats are trying to win over Gen Z voters, just like Charlie Kirk\nTrump says he's considering taking over DC police and bringing in National Guard\nNYT obtains previously undisclosed images of Epstein's home\n'Wrong, wrong, and wrong': CNN fact checks Trump's job report claims\nNebraska congressman met with boos and jeers at town hall\nDemocrat who fled Texas reacts to Abbott issuing arrest warrant for skipping special session\nKorean Purdue student and daughter of priest released by ICE after 48 hours\n'Racist, gerrymandered map': Texas Democrat blasts GOP-drawn congressional map\n'An extraordinary move': CNN reporter explains why Texas Democrats left the state\nSen. Booker was asked about Democrats’ credibility. Hear his response"
    },
    {
      "url": "https://www.buzzfeed.com/michaelabramwell/reactions-viral-idaho-church",
      "text": "A Christian church in Moscow, Idaho, has gone viral due to a recent segment on CNN, where church members openly discussed their controversial views on religion, the role of women, voting rights, slavery, and more.\nThe head of \"Christ Church,\" Senior Pastor Doug Wilson, began the interview by directly stating he wanted a \"Christian world.\" \"I'd like to see the nation be a Christian nation...I'd like to see the world be a Christian world,\" Wilson told CNN.\nLater on, Wilson was questioned on his decision to open another \"Christ Church\" location in Washington, DC.\nWilson also expressed his \"views\" on women and motherhood...\nAnd that's when things became a bit tense between Wilson and the interviewer...\nElsewhere, members of the church spoke about a man's and a woman's role in a family. \"He is the head of our household, yes, and I do submit to him,\" one member said happily, as her husband smiled.\nAnother member shared his view on voting rights, stating that every household should only get one vote. \"In my ideal society, we would vote as households. And I would ordinarily be the one that would cast the vote, but I would cast the vote having discussed it with my household.\"\nAnother member expressed his support for the repeal of the 19th Amendment, which gave women the right to vote. \"I would support that. And I would support it on the basis that the atomization that comes with our current system is not good for humans.\"\nAnd one of the most shocking opinions shared was Wilson's take on slave owners...\nOver 5 million people have watched CNN's interview with several \"Christ Church\" members, which spawned reactions from thousands of comments.\nCommonly, people were angry about CNN's decision to give this group media attention...\n...and argued that churches with these types of controversial opinions should be taxed.\n\"WHY ARE MEN SO THREATENED BY US?!??? Jesus Christ I'm tired,\" one commenter wrote.\n\"this is absolutely terrifying and I'm a conservative Christian Republican. they are taking the Bible out of context,\" one person commented.\n\"I was raised this way. Married a man like this. Now I’m happily divorced for over 10yrs & haven’t spoken to my father in almost 5yrs. Happiest I’ve ever been in my life,\" one commenter wrote. \"Single and a thriving mother with a Master’s degree and an amazing job that I love. F the Patriarchy.\"\nWhat are your thoughts? Let us know in the comments."
    },
    {
      "url": "https://www.buzzfeed.com/tag/pete-hegseth",
      "text": "Pete Hegseth\nIt's Official — The Defense Department Accepted A Luxury Boeing 747 From Qatar For Trump\nThe Pentagon says it will \"work to ensure proper security measures\" on the aircraft.\n\"As A Christian, This Is Disgusting\": People Are Appalled That Secretary Of Defense Pete Hegseth Shared A Video Of Church Leaders Saying Women Shouldn't Have The Right To Vote\n\"If politicians don’t want me to vote, then they can give me back most of the tens of thousands of dollars of taxes I've paid over the decades.\"\nPeople Cannot Believe This Video From Pete Hegseth Isn't A Parody\n\"This video hits really hard if you're 12,\" one user said.\nTrump Found Someone At The Pentagon Who Might Actually Let Him Turn Guns On Americans\nDefense Secretary Pete Hegseth at his confirmation hearing refused to rule out opening fire on protesters if Trump ordered it.\nTrump Had A Complete Meltdown When Asked A Basic Question And His Response Was Unhinged\nThe president’s critics urged reporters to ignore the demand and keep bringing it up.\n\"Only Took 3 Days For This To Age Like Milk\": 27 Of The Very Best Political Tweets From The Last Week\n\"In a perfect world, the town drunk and the Secretary of Defense would be two different people.\"\nConservatives Are Reacting To Pete Hegseth Spilling Secret War Plans In A Group Chat With A Journalist, And It's Not What I Expected\n\"These are exactly the type of weaknesses our enemies will wait for and exploit.\"\nThese Are The Funniest (And Most Absurd) Internet Reactions To Pete Hegseth Adding A Journalist To A Secret War Plans Group Chat\n\"Dance like no one is watching. Text like the editor of the Atlantic was accidentally added to the group chat and is reading everything.\""
    },
    {
      "url": "https://www.buzzfeed.com/topic/politics",
      "text": "PopularLisa Kudrow’s Hilarious Impersonation Of A MAGA Spokesperson In 2020 Is Wayyyy More Spot-On Today😂👍20👍5❤️1😂10😭2🤯1😡🙄😬1 The amount of the post comments: 35\nOop— 🫢The villain could be hiding anywhere!The villains lair: https://t.co/k8A8gVsG8C— Greg the Sorcerer (@gregthesorcerer) April 16, 2025 ❤️😂10👍1❤️4😂2😭1🤯2😡🙄😬\nPopular5 hrs ago“America, You Are In Grave Danger”: The Internet Is VERY Worried About Donald Trump’s Disturbing Latest Move😡😭71👍❤️😂1😭4🤯3😡59🙄2😬2 The amount of the post comments: 356\nPopular2 hrs agoDC Residents Are Commenting The Same Thing On This Video Of DEA Officers Patrolling The National Mall😂😡20👍❤️😂11😭🤯😡7🙄1😬1 The amount of the post comments: 13\n1 hr agoPeople Are Calling Out Pete Hegseth For Sharing That “Disgusting” Video Of Church Leaders Saying Women Shouldn’t Have The Right To Vote😡🤯6👍❤️😂😭🤯1😡5🙄😬 The amount of the post comments: 9\n1 hr agoResearchers Studied Which Generation Believes The Most Conspiracy Theories, And The Results Are Genuinely SurprisingReact👍❤️😂😭🤯😡🙄😬 The amount of the post comments: 3\n4 hrs agoGavin Newsom’s ALL CAPS Tweet Mocking Donald Trump Is Way Funnier Than It Should Be👍😂62👍33❤️7😂21😭🤯😡🙄1😬 The amount of the post comments: 16\n5 hrs ago“South Park” Somehow Went Even Harder In On Kristi Noem In This Unaired Scene😂👍62👍6❤️2😂46😭4🤯1😡2🙄1😬 The amount of the post comments: 44\nJohn Oliver Did Not Hold Back On Calling Out This '90s Actor, Whom He Thought Had “Died,\" For Joining ICE❤️😂57👍5❤️25😂20😭🤯😡3🙄3😬1 The amount of the post comments: 56\nTrump Thought Alaska Was Russia, And The Internet Is Having An Absolute Field Day With It😂😬79👍1❤️1😂43😭2🤯6😡6🙄3😬17 The amount of the post comments: 181\nThe Youngest Woman In Congress Is Going Viral For Her Response To A Wild Fox News Take😡❤️53👍2❤️7😂1😭🤯2😡34🙄5😬2 The amount of the post comments: 65\nPopularGavin Newsom’s Response To Donald Trump Moving Obama’s Portrait To A Hidden Staircase Is Going Viral😡😂154👍9❤️4😂15😭2🤯2😡106🙄11😬5 The amount of the post comments: 147\nPopularThis Idaho Church Is Going Viral For Its “Terrifying” Christian Nationalist Views. Here’s How The Internet Is Reacting To It😡😬194👍5❤️3😂2😭2🤯7😡157🙄4😬14 The amount of the post comments: 270\nPopularA Furious MAGA Voter’s Post Breaking Down The “Ridiculous” Cost Of Their Diabetes Medicine Due To Donald Trump’s Tariffs Is Going Viral🙄😂93👍7❤️1😂26😭3🤯4😡11🙄40😬1 The amount of the post comments: 182\nPeople Are In Utter Disbelief After The Owner Of “Trump Burger” — A Donald Trump-Themed Restaurant — Was Arrested By ICE And Faces Deportation😂🙄67👍❤️2😂60😭1🤯😡🙄3😬1 The amount of the post comments: 110\nPopularJD Vance Just Responded To Trump Name-Dropping Marco Rubio As A Potential “MAGA Heir”😡😬37👍4❤️2😂4😭1🤯😡17🙄4😬5 The amount of the post comments: 40\nDan Rather’s Facebook Post About Normalizing Donald Trump Is Going Viral❤️👍194👍28❤️149😂4😭2🤯1😡4🙄4😬2 The amount of the post comments: 136\nPopular“Cool They’re Just Doing Nazi Propaganda Now”: 28 Political Tweets Of The Week That Are So Brutal But So True😡😭94👍12❤️3😂2😭20🤯3😡49🙄4😬1 The amount of the post comments: 175\nPopularDonald Trump’s Midnight Truth Social Meltdown Is Exactly What You’d Expect From A 79-Year-Old Who Can’t Handle Criticism👍😂110👍59❤️3😂25😭4🤯4😡3🙄10😬2 The amount of the post comments: 174\nPopularPeople Just Noticed What Donald Trump Did To The Oval Office Door, And They’re Not Happy About It😡😂457👍9❤️4😂54😭18🤯15😡313🙄14😬30 The amount of the post comments: 364\nPopular“South Park’s” Response To Kristi Noem’s Complaint About Her Episode Is A++++++❤️😂1.4K👍116❤️872😂409😭15🤯9😡9🙄12😬8 The amount of the post comments: 217\nTrump Was Not Happy When Asked About JD Vance Reportedly Hosting A Dinner To Discuss A Strategy Over The Epstein Fallout😡😂32👍3❤️😂5😭🤯😡20🙄😬4 The amount of the post comments: 56\n13 People Shared Their “Last Straw” Moments Before Cutting Off Their MAGA Family Members🤯😡42👍4❤️1😂2😭1🤯15😡12🙄6😬1 The amount of the post comments: 224\nStephen Colbert Just Absolutely Dragged Trump For Doing Something So Ridiculously “Dumb”👍😂36👍18❤️5😂12😭1🤯😡🙄😬 The amount of the post comments: 32"
    },
    {
      "url": "https://www.buzzfeed.com/briangalindo/pete-hegseth-group-chat-reactions",
      "text": "Earlier today, the Atlantic published a story about Fox & Friends Weekend co-host turned Defense Secretary Pete Hegseth that would be a huge, huge, huge scandal if it were any other administration, but with this one, we just call it a Monday.\nIn the story, the editor-in-chief of the Atlantic, Jeffrey Goldberg, revealed that he had been added to a Signal group chat by Mike Waltz called \"Houthi PC Small Group.\" The group chat included 18 other Trump administration officials, including Hegseth, who in the chat discussed a secret war attack against the Houthi in Yemen. This is a significant security breach, so much so that Goldberg thought it wasn't real.\nNeedless to say, people are shocked, but they are probably also not too surprised that something like this would happen. So, I rounded up some of the funniest Twitter (X) reactions to this spectacular train wreck of a security breach:\nEditor’s Note: We dive into X so you don't have to scrub your eyeballs afterward. Here's the good stuff we found floating in the chaos.\nSo there you have it, folks. When he isn't busy deleting the word \"gay\" from the Defense Department, Hegseth is blowing up the group chat! As always, sound off below because, truly, this feels straight out of Veep."
    }
  ],
  "argos_summary": "The article discusses the controversial views of Christian nationalist pastor Doug Wilson and his followers, including U.S. Secretary of Defense Pete Hegseth, who shared a video promoting the idea that women should not have the right to vote. This has sparked significant backlash online, with many expressing disbelief and outrage over Hegseth's endorsement of such views. Additionally, the article highlights the Trump administration's efforts to roll back access to birth control and reproductive health services, raising concerns about the implications for women's rights and healthcare access.",
  "argos_id": "ULSAA4PQ6"
}