{
  "url": "https://finance.yahoo.com/news/revvity-avantor-azenta-bio-techne-182041320.html?_guc_consent_skip=1755023550",
  "authorsByline": "Max Juang",
  "articleId": "602550c74b9e4adea99797ff665f3136",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/014fQFEsHFs3T5qYb0hNQg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/stockstory_922/42e0745ee22a9e328bec28f1fa036266",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:20:41+00:00",
  "addDate": "2025-08-12T18:35:32.802611+00:00",
  "refreshDate": "2025-08-12T18:35:32.802614+00:00",
  "score": 1.0,
  "title": "Revvity, Avantor, Azenta, Bio-Techne, and Amneal Shares Skyrocket, What You Need To Know",
  "description": "A number of stocks jumped in the afternoon session after positive inflation data fueled hopes for an interest rate cut by the Federal Reserve. The latest Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This cooler-than-expected data prompted a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing as investors grew more optimistic. The prevailing view is that easing inflation gives the central bank room to lower inte",
  "content": "A number of stocks jumped in the afternoon session after positive inflation data fueled hopes for an interest rate cut by the Federal Reserve. The latest Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This cooler-than-expected data prompted a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing as investors grew more optimistic. The prevailing view is that easing inflation gives the central bank room to lower interest rates. Lower rates typically reduce borrowing costs for businesses and make stocks more attractive relative to bonds, contributing to widespread gains across sectors like healthcare.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks.\n\nAmong others, the following stocks were impacted:\n• Research Tools & Consumables company Revvity (NYSE:RVTY) jumped 3%. Is now the time to buy Revvity? Access our full analysis report here, it’s free.\n• Research Tools & Consumables company Avantor (NYSE:AVTR) jumped 3.9%. Is now the time to buy Avantor? Access our full analysis report here, it’s free.\n• Drug Development Inputs & Services company Azenta (NASDAQ:AZTA) jumped 4.1%. Is now the time to buy Azenta? Access our full analysis report here, it’s free.\n• Research Tools & Consumables company Bio-Techne (NASDAQ:TECH) jumped 3.3%. Is now the time to buy Bio-Techne? Access our full analysis report here, it’s free.\n• Generic Pharmaceuticals company Amneal (NASDAQ:AMRX) jumped 3%. Is now the time to buy Amneal? Access our full analysis report here, it’s free.\n\nAzenta’s shares are very volatile and have had 26 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\n\nThe previous big move we wrote about was 5 days ago when the stock gained 3.3% after an upgrade from investment firm Raymond James, which lifted its rating to 'outperform' from 'market perform'. The investment firm set a new price target of $35.00, which indicated a potential upside of over 30% from the stock's previous price. This upgrade followed Azenta's fiscal third-quarter results. Raymond James described the report as \"noisy,\" noting that while the company beat earnings per share forecasts, it missed on revenue. Despite the mixed results, the analysts suggested the stock had potentially reached a bottom, which prompted the more optimistic rating.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nyse/avtr?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
    "https://stockstory.org/us/stocks/nasdaq/amrx?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_4&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
    "https://stockstory.org/us/stocks/nyse/rvty?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_0&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
    "https://stockstory.org/us/stocks/nasdaq/tech?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_3&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
    "https://stockstory.org/us/stocks/nasdaq/azta?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_2&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "stocks",
      "weight": 0.08267522
    },
    {
      "name": "Generic Pharmaceuticals company Amneal",
      "weight": 0.07685709
    },
    {
      "name": "positive inflation data",
      "weight": 0.073533356
    },
    {
      "name": "Amneal Shares",
      "weight": 0.06930126
    },
    {
      "name": "interest rates",
      "weight": 0.068747394
    },
    {
      "name": "investment firm Raymond James",
      "weight": 0.06722619
    },
    {
      "name": "big price drops",
      "weight": 0.06695707
    },
    {
      "name": "-Techne",
      "weight": 0.064631514
    },
    {
      "name": "market perform",
      "weight": 0.06462906
    },
    {
      "name": "Research Tools & Consumables company Bio-Techne",
      "weight": 0.06446291
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9931640625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97705078125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.96240234375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.5390625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.40576171875
    }
  ],
  "sentiment": {
    "positive": 0.6981356,
    "negative": 0.061301,
    "neutral": 0.24056341
  },
  "summary": "A number of stocks saw a surge in the afternoon session due to positive inflation data, fuelling hopes for an interest rate cut by the Federal Reserve. The Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This led to a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing. The prevailing view is that easing inflation gives the central bank room to lower interest rates. Stocks such as Revvity, Avantor, Azenta, Bio-Techne, and Amneal were impacted by this news. The previous big move was 5 days ago when the stock gained 3.3% after an upgrade from investment firm Raymond James.",
  "shortSummary": "A positive inflation data boosted stocks like Revvity, Avantor, Azenta, and Amneal, with hopes of an interest rate cut boosting investor sentiment.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "67ff1d08f3c44879b588369e9890ccdf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/azta?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_2&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
      "text": "Azenta (AZTA)\nWe wouldn’t buy Azenta. Not only did its demand evaporate but also its negative returns on capital show it destroyed shareholder value.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think Azenta Will Underperform\nServing as the guardian of some of medicine's most valuable materials, Azenta (NASDAQ:AZTA) provides biological sample management, storage, and genomic services that help pharmaceutical and biotechnology companies preserve and analyze critical research materials.\n- Performance over the past five years shows each sale was less profitable as its earnings per share dropped by 18.7% annually, worse than its revenue\n- Increased cash burn over the last five years raises questions about the return timeline for its investments\n- Negative returns on capital show that some of its growth strategies have backfired\nWhy There Are Better Opportunities Than Azenta\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Azenta\nAt $28.35 per share, Azenta trades at 37x forward P/E. Not only is Azenta’s multiple richer than most healthcare peers, but it’s also expensive for its revenue characteristics.\nWe’d rather invest in similarly-priced but higher-quality companies with more reliable earnings growth.\n3. Azenta (AZTA) Research Report: Q2 CY2025 Update\nLife sciences company Azenta (NASDAQ:AZTA) missed Wall Street’s revenue expectations in Q2 CY2025, with sales flat year on year at $143.9 million. Its non-GAAP profit of $0.14 per share was in line with analysts’ consensus estimates.\nAzenta (AZTA) Q2 CY2025 Highlights:\n- Revenue: $143.9 million vs analyst estimates of $149.6 million (flat year on year, 3.8% miss)\n- Adjusted EPS: $0.14 vs analyst estimates of $0.14 (in line)\n- Adjusted EBITDA: $18 million vs analyst estimates of $17.29 million (12.5% margin, 4.1% beat)\n- Operating Margin: -0.5%, up from -4.9% in the same quarter last year\n- Free Cash Flow was $14.97 million, up from -$2.18 million in the same quarter last year\n- Market Capitalization: $1.48 billion\nCompany Overview\nServing as the guardian of some of medicine's most valuable materials, Azenta (NASDAQ:AZTA) provides biological sample management, storage, and genomic services that help pharmaceutical and biotechnology companies preserve and analyze critical research materials.\nAzenta operates through three main business segments that together form a comprehensive cold chain solution for life sciences research. The Sample Management Solutions segment offers automated storage systems that can maintain millions of biological samples at temperatures ranging from ambient to cryogenic (-190°C), along with the specialized containers, tubes, and tracking systems needed to preserve sample integrity.\nThe Multiomics segment provides genomic analysis services including gene sequencing, synthesis, and editing that allow researchers to understand genetic material and develop new therapies. Scientists can submit samples to Azenta's network of 13 laboratories worldwide for analysis, with results delivered in as little as 24 hours for simple requests.\nThe B Medical Systems segment rounds out Azenta's offerings with temperature-controlled storage and transportation solutions that ensure sensitive biological materials remain viable during transit across the global supply chain. These products are particularly critical for vaccine distribution in developing regions, with solutions including solar-powered refrigeration units.\nA pharmaceutical company developing a new cancer therapy might store thousands of patient tissue samples in Azenta's automated biorepositories, send portions to Azenta's genomics labs for DNA sequencing to identify biomarkers, and then use Azenta's temperature-controlled shipping containers to transport promising compounds to clinical trial sites worldwide.\nAzenta generates revenue through equipment sales, consumable products like specialized storage tubes, and recurring service contracts for sample storage and analysis. The company serves approximately 14,000 customers globally, including major pharmaceutical companies, research hospitals, academic institutions, and biotechnology startups across North America, Europe, and Asia.\n4. Drug Development Inputs & Services\nCompanies specializing in drug development inputs and services play a crucial role in the pharmaceutical and biotechnology value chain. Essential support for drug discovery, preclinical testing, and manufacturing means stable demand, as pharmaceutical companies often outsource non-core functions with medium to long-term contracts. However, the business model faces high capital requirements, customer concentration, and vulnerability to shifts in biopharma R&D budgets or regulatory frameworks. Looking ahead, the industry will likely enjoy tailwinds such as increasing investment in biologics, cell and gene therapies, and advancements in precision medicine, which drive demand for sophisticated tools and services. There is a growing trend of outsourcing in drug development for nimbleness and cost efficiency, which benefits the industry. On the flip side, potential headwinds include pricing pressures as efforts to contain healthcare costs are always top of mind. An evolving regulatory backdrop could also slow innovation or client activity.\nAzenta's competitors include Hamilton Company and Liconic AG in the automated storage systems market, Laboratory Corporation of America and Thermo Fisher Scientific in sample storage and services, and genomics service providers like BGI Genomics, Eurofins Scientific, and Twist Bioscience.\n5. Revenue Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith just $585.7 million in revenue over the past 12 months, Azenta is a small company in an industry where scale matters. This makes it difficult to build trust with customers because healthcare is heavily regulated, complex, and resource-intensive.\n6. Revenue Growth\nA company’s long-term sales performance is one signal of its overall quality. Any business can have short-term success, but a top-tier one grows for years. Over the last five years, Azenta’s demand was weak and its revenue declined by 7.2% per year. This wasn’t a great result and is a sign of poor business quality.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Azenta’s annualized revenue declines of 3.6% over the last two years suggest its demand continued shrinking.\nAzenta also breaks out the revenue for its most important segment, Sample Management. Over the last two years, Azenta’s Sample Management revenue averaged 4.5% year-on-year growth. This segment has outperformed its total sales during the same period, lifting the company’s performance.\nThis quarter, Azenta missed Wall Street’s estimates and reported a rather uninspiring 0.2% year-on-year revenue decline, generating $143.9 million of revenue.\nLooking ahead, sell-side analysts expect revenue to grow 5.8% over the next 12 months, an improvement versus the last two years. This projection is above the sector average and implies its newer products and services will catalyze better top-line performance.\n7. Operating Margin\nOperating margin is one of the best measures of profitability because it tells us how much money a company takes home after subtracting all core expenses, like marketing and R&D.\nAlthough Azenta broke even this quarter from an operational perspective, it’s generally struggled over a longer time period. Its expensive cost structure has contributed to an average operating margin of negative 7.3% over the last five years. Unprofitable healthcare companies require extra attention because they could get caught swimming naked when the tide goes out. It’s hard to trust that the business can endure a full cycle.\nLooking at the trend in its profitability, Azenta’s operating margin decreased by 3 percentage points over the last five years, but it rose by 6 percentage points on a two-year basis. Still, shareholders will want to see Azenta become more profitable in the future.\nThis quarter, Azenta generated a negative 0.5% operating margin. The company's consistent lack of profits raise a flag.\n8. Earnings Per Share\nWe track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.\nSadly for Azenta, its EPS declined by 18.7% annually over the last five years, more than its revenue. This tells us the company struggled because its fixed cost base made it difficult to adjust to shrinking demand.\nWe can take a deeper look into Azenta’s earnings to better understand the drivers of its performance. As we mentioned earlier, Azenta’s operating margin expanded this quarter but declined by 3 percentage points over the last five years. This was the most relevant factor (aside from the revenue impact) behind its lower earnings; interest expenses and taxes can also affect EPS but don’t tell us as much about a company’s fundamentals.\nIn Q2, Azenta reported adjusted EPS at $0.14, up from $0.07 in the same quarter last year. This print beat analysts’ estimates by 1%. Over the next 12 months, Wall Street expects Azenta’s full-year EPS of $0.37 to grow 105%.\n9. Cash Is King\nFree cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.\nWhile Azenta posted positive free cash flow this quarter, the broader story hasn’t been so clean. Azenta’s demanding reinvestments have consumed many resources over the last five years, contributing to an average free cash flow margin of negative 12.9%. This means it lit $12.85 of cash on fire for every $100 in revenue.\nTaking a step back, we can see that Azenta’s margin dropped by 18.8 percentage points during that time. Almost any movement in the wrong direction is undesirable because it is already burning cash. If the trend continues, it could signal it’s becoming a more capital-intensive business.\nAzenta’s free cash flow clocked in at $14.97 million in Q2, equivalent to a 10.4% margin. Its cash flow turned positive after being negative in the same quarter last year\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nAzenta’s five-year average ROIC was negative 3.9%, meaning management lost money while trying to expand the business. Its returns were among the worst in the healthcare sector.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Unfortunately, Azenta’s ROIC has stayed the same over the last few years. If the company wants to become an investable business, it must improve its returns by generating more profitable growth.\n11. Balance Sheet Assessment\nOne of the best ways to mitigate bankruptcy risk is to hold more cash than debt.\nAzenta is a well-capitalized company with $318.9 million of cash and $52.63 million of debt on its balance sheet. This $266.2 million net cash position is 17.9% of its market cap and gives it the freedom to borrow money, return capital to shareholders, or invest in growth initiatives. Leverage is not an issue here.\n12. Key Takeaways from Azenta’s Q2 Results\nWhile revenue missed, EPS was in line. Overall, this quarter could have been better. Still, the stock traded up 2% to $33.06 immediately after reporting.\n13. Is Now The Time To Buy Azenta?\nUpdated: August 12, 2025 at 12:02 AM EDT\nThe latest quarterly earnings matters, sure, but we actually think longer-term fundamentals and valuation matter more. Investors should consider all these pieces before deciding whether or not to invest in Azenta.\nAzenta falls short of our quality standards. To kick things off, its revenue has declined over the last five years. On top of that, Azenta’s declining EPS over the last five years makes it a less attractive asset to the public markets, and its cash profitability fell over the last five years.\nAzenta’s P/E ratio based on the next 12 months is 37x. At this valuation, there’s a lot of good news priced in - you can find more timely opportunities elsewhere.\nWall Street analysts have a consensus one-year price target of $33 on the company (compared to the current share price of $28.35).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/amrx?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_4&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
      "text": "Amneal (AMRX)\nWe’re skeptical of Amneal. Its weak returns on capital indicate management was inefficient with its resources and missed opportunities.― StockStory Analyst Team\n1. News\n2. Summary\nWhy Amneal Is Not Exciting\nFounded in 2002 and growing into one of America's largest generic drug producers, Amneal Pharmaceuticals (NASDAQ:AMRX) develops, manufactures, and distributes generic medicines, specialty branded drugs, biosimilars, and injectable products for the U.S. healthcare market.\n- Low returns on capital reflect management’s struggle to allocate funds effectively\n- On the plus side, its earnings per share have outperformed the peer group average over the last five years, increasing by 10.5% annually\nWhy There Are Better Opportunities Than Amneal\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Amneal\nAmneal is trading at $8.80 per share, or 12.6x forward P/E. This multiple is lower than most healthcare companies, but for good reason.\nIt’s better to pay up for high-quality businesses with higher long-term earnings potential rather than to buy lower-quality stocks because they appear cheap. These challenged businesses often don’t re-rate, a phenomenon known as a “value trap”.\n3. Amneal (AMRX) Research Report: Q2 CY2025 Update\nPharmaceutical company Amneal Pharmaceuticals (NASDAQ:AMRX) missed Wall Street’s revenue expectations in Q2 CY2025 as sales rose 3.2% year on year to $724.5 million. On the other hand, the company’s full-year revenue guidance of $3.05 billion at the midpoint came in 1.1% above analysts’ estimates. Its non-GAAP profit of $0.25 per share was 42.9% above analysts’ consensus estimates.\nAmneal (AMRX) Q2 CY2025 Highlights:\n- Revenue: $724.5 million vs analyst estimates of $742.8 million (3.2% year-on-year growth, 2.5% miss)\n- Adjusted EPS: $0.25 vs analyst estimates of $0.17 (42.9% beat)\n- Adjusted EBITDA: $183.7 million vs analyst estimates of $175 million (25.3% margin, 5% beat)\n- The company reconfirmed its revenue guidance for the full year of $3.05 billion at the midpoint\n- Management raised its full-year Adjusted EPS guidance to $0.73 at the midpoint, a 7.4% increase\n- EBITDA guidance for the full year is $675 million at the midpoint, in line with analyst expectations\n- Operating Margin: 15.4%, up from 13.6% in the same quarter last year\n- Free Cash Flow Margin: 8.4%, up from 4.1% in the same quarter last year\n- Market Capitalization: $2.49 billion\nCompany Overview\nFounded in 2002 and growing into one of America's largest generic drug producers, Amneal Pharmaceuticals (NASDAQ:AMRX) develops, manufactures, and distributes generic medicines, specialty branded drugs, biosimilars, and injectable products for the U.S. healthcare market.\nAmneal operates through three main business segments: Generics, Specialty, and AvKARE. The Generics segment forms the backbone of the company with over 260 product families spanning oral solids, liquids, injectables, nasal sprays, and topicals. Amneal focuses on developing complex generics with high barriers to entry, giving it opportunities to be first-to-file or first-to-market with products that can command higher margins.\nThe company has significantly expanded its injectable portfolio for hospitals, launching products like esmolol hydrochloride in large volume bags. In 2022, Amneal entered the biosimilar market with Alymsys (referencing Avastin), followed by Releuko and Flynetra, biosimilars for cancer supportive care.\nAmneal's Specialty segment focuses on branded medications for central nervous system disorders and endocrine conditions. Key products include RYTARY for Parkinson's disease, UNITHROID for hypothyroidism, and recently acquired ONGENTYS, an add-on treatment for Parkinson's patients experiencing \"off\" episodes.\nThe AvKARE segment primarily serves U.S. government agencies, particularly the Department of Defense and Veterans Affairs. This division repackages pharmaceuticals and distributes medical supplies to institutional customers, with a focus on 340b-qualified entities that receive discounted pricing.\nWhen patients fill prescriptions at their local pharmacy, they might receive Amneal's generic version of a common medication without realizing it. For example, a patient with high blood pressure might be prescribed Amneal's generic lisinopril, while a hospital might use Amneal's injectable antibiotics for post-surgical care.\nAmneal generates revenue by selling its products through major wholesalers and distributors who then supply retail pharmacies, hospitals, and government institutions. The company maintains manufacturing facilities in the United States, India, and Ireland, with a global supply chain that supports its diverse product portfolio.\n4. Generic Pharmaceuticals\nThe generic pharmaceutical industry operates on a volume-driven, low-cost business model, producing bioequivalent versions of branded drugs once their patents expire. These companies benefit from consistent demand for affordable medications, as they are critical to reducing healthcare costs. Generics typically face lower R&D expenses and shorter regulatory approval timelines compared to branded drug makers, enabling cost efficiencies. However, the industry is highly competitive, with intense pricing pressures, thin margins, and frequent legal challenges from branded pharmaceutical companies over patent disputes. Looking ahead, the industry is supported by tailwinds such as the role of AI in streamlining drug development (reverse engineering complex formulations) and manufacturing efficiency (optimize processes and remove inefficiencies). Governments and insurers' focus on reducing drug costs can also boost generics' adoption. However, headwinds include escalating pricing pressure from large buyers like pharmacy chains and healthcare distributors as well as evolving regulatory hurdles.\nAmneal's primary competitors in the generic pharmaceutical market include Teva Pharmaceutical Industries, Viatris (formerly Mylan), Sandoz Group, and Sun Pharmaceutical Industries. In the specialty pharmaceutical segment, Amneal competes with companies like Supernus Pharmaceuticals and Alkermes, while its AvKARE division faces competition from major pharmaceutical wholesalers such as Cardinal Health, McKesson, and Cencora (formerly AmerisourceBergen).\n5. Economies of Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith $2.85 billion in revenue over the past 12 months, Amneal has decent scale. This is important as it gives the company more leverage in a heavily regulated, competitive environment that is complex and resource-intensive.\n6. Revenue Growth\nReviewing a company’s long-term sales performance reveals insights into its quality. Any business can put up a good quarter or two, but many enduring ones grow for years. Luckily, Amneal’s sales grew at a decent 10.4% compounded annual growth rate over the last five years. Its growth was slightly above the average healthcare company and shows its offerings resonate with customers.\nLong-term growth is the most important, but within healthcare, a half-decade historical view may miss new innovations or demand cycles. Amneal’s annualized revenue growth of 11.1% over the last two years aligns with its five-year trend, suggesting its demand was stable.\nThis quarter, Amneal’s revenue grew by 3.2% year on year to $724.5 million, falling short of Wall Street’s estimates.\nLooking ahead, sell-side analysts expect revenue to grow 8.9% over the next 12 months, a slight deceleration versus the last two years. Despite the slowdown, this projection is commendable and implies the market sees success for its products and services.\n7. Operating Margin\nAmneal was profitable over the last five years but held back by its large cost base. Its average operating margin of 6.2% was weak for a healthcare business.\nOn the plus side, Amneal’s operating margin rose by 6.6 percentage points over the last five years, as its sales growth gave it operating leverage. Zooming in on its more recent performance, we can see the company’s trajectory is intact as its margin has also increased by 4.8 percentage points on a two-year basis.\nIn Q2, Amneal generated an operating margin profit margin of 15.4%, up 1.8 percentage points year on year. This increase was a welcome development and shows it was more efficient.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nAmneal’s remarkable 10.5% annual EPS growth over the last five years aligns with its revenue performance. This tells us its incremental sales were profitable.\nIn Q2, Amneal reported adjusted EPS at $0.25, up from $0.16 in the same quarter last year. This print easily cleared analysts’ estimates, and shareholders should be content with the results. Over the next 12 months, Wall Street expects Amneal’s full-year EPS of $0.74 to shrink by 5.6%.\n9. Cash Is King\nFree cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.\nAmneal has shown decent cash profitability, giving it some flexibility to reinvest or return capital to investors. The company’s free cash flow margin averaged 7.7% over the last five years, slightly better than the broader healthcare sector.\nAmneal’s free cash flow clocked in at $60.99 million in Q2, equivalent to a 8.4% margin. This result was good as its margin was 4.3 percentage points higher than in the same quarter last year, but we wouldn’t put too much weight on the short term because investment needs can be seasonal, causing temporary swings. Long-term trends are more important.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nAmneal historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 3.7%, lower than the typical cost of capital (how much it costs to raise money) for healthcare companies.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Fortunately, Amneal’s ROIC has increased significantly over the last few years. This is a good sign, and if its returns keep rising, there’s a chance it could evolve into an investable business.\n11. Balance Sheet Assessment\nAmneal reported $71.54 million of cash and $2.56 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $666.5 million of EBITDA over the last 12 months, we view Amneal’s 3.7× net-debt-to-EBITDA ratio as safe. We also see its $119 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Amneal’s Q2 Results\nWe were impressed by how significantly Amneal blew past analysts’ EPS expectations this quarter. We were also happy its full-year EPS guidance outperformed Wall Street’s estimates. On the other hand, its revenue missed. Overall, this print had some key positives. The stock remained flat at $8.03 immediately following the results.\n13. Is Now The Time To Buy Amneal?\nUpdated: August 12, 2025 at 12:08 AM EDT\nBefore deciding whether to buy Amneal or pass, we urge investors to consider business quality, valuation, and the latest quarterly results.\nAmneal isn’t a terrible business, but it doesn’t pass our bar. Although its revenue growth was good over the last five years, it’s expected to deteriorate over the next 12 months and its mediocre ROIC lags the market and is a headwind for its stock price.\nAmneal’s P/E ratio based on the next 12 months is 12.6x. While this valuation is fair, the upside isn’t great compared to the potential downside. We're fairly confident there are better stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $12 on the company (compared to the current share price of $8.80).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/tech?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_3&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
      "text": "Bio-Techne (TECH)\nBio-Techne keeps us up at night. Its weak sales growth and declining returns on capital show its demand and profits are shrinking.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think Bio-Techne Will Underperform\nWith a catalog of hundreds of thousands of specialized biological products used in laboratories worldwide, Bio-Techne (NASDAQ:TECH) develops and manufactures specialized reagents, instruments, and services that help researchers study biological processes and enable diagnostic testing and cell therapy development.\n- Modest revenue base of $1.22 billion gives it less fixed cost leverage and fewer distribution channels than larger companies\n- Sales trends were unexciting over the last two years as its 3.6% annual growth was below the typical healthcare company\n- Estimated sales growth of 2% for the next 12 months implies demand will slow from its two-year trend\nWhy There Are Better Opportunities Than Bio-Techne\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Bio-Techne\nAt $50.15 per share, Bio-Techne trades at 24.4x forward P/E. This multiple is higher than that of healthcare peers; it’s also rich for the business quality. Not a great combination.\nThere are stocks out there similarly priced with better business quality. We prefer owning these.\n3. Bio-Techne (TECH) Research Report: Q2 CY2025 Update\nLife sciences company Bio-Techne (NASDAQ:TECH) reported revenue ahead of Wall Street’s expectations in Q2 CY2025, with sales up 3.5% year on year to $317 million. Its non-GAAP profit of $0.53 per share was 6.1% above analysts’ consensus estimates.\nBio-Techne (TECH) Q2 CY2025 Highlights:\n- Revenue: $317 million vs analyst estimates of $314.7 million (3.5% year-on-year growth, 0.7% beat)\n- Adjusted EPS: $0.53 vs analyst estimates of $0.50 (6.1% beat)\n- Adjusted EBITDA: $115.6 million vs analyst estimates of $110.2 million (36.5% margin, 4.9% beat)\n- Operating Margin: -7.5%, down from 15% in the same quarter last year\n- Free Cash Flow Margin: 29.4%, up from 18.8% in the same quarter last year\n- Organic Revenue rose 3% year on year (0.7% in the same quarter last year)\n- Market Capitalization: $8.57 billion\nCompany Overview\nWith a catalog of hundreds of thousands of specialized biological products used in laboratories worldwide, Bio-Techne (NASDAQ:TECH) develops and manufactures specialized reagents, instruments, and services that help researchers study biological processes and enable diagnostic testing and cell therapy development.\nBio-Techne operates through two main segments: Protein Sciences (about 72% of sales) and Diagnostics & Genomics. The Protein Sciences segment provides critical biological components like cytokines, growth factors, antibodies, and small molecules that researchers use to investigate cellular functions and disease mechanisms. These products serve as essential tools for scientists trying to understand complex biological pathways or develop new therapeutic approaches.\nThe company's analytical instruments help researchers quantify and analyze proteins in biological samples. For example, a pharmaceutical company developing a cancer treatment might use Bio-Techne's automated western blotting systems to measure how their experimental drug affects specific protein levels in tumor cells.\nIn the Diagnostics & Genomics segment, Bio-Techne offers spatial biology tools that allow researchers to visualize gene expression within intact tissue samples, preserving the crucial spatial context of cellular interactions. The segment also includes molecular diagnostic tests like the ExoDx Prostate test, which helps physicians determine if a prostate biopsy is necessary by analyzing exosomes (tiny vesicles) in urine samples.\nBio-Techne sells directly to researchers in academic institutions, pharmaceutical companies, biotechnology firms, and contract research organizations. The company also supplies diagnostic reagents to instrument manufacturers on an OEM basis, providing the calibrators and controls needed for clinical diagnostic tests.\nThe cell and gene therapy market represents a significant growth opportunity for Bio-Techne. The company has invested heavily in facilities to produce GMP-grade (Good Manufacturing Practice) proteins and reagents required for therapeutic applications. These specialized materials must meet strict quality standards as they're used in the development and production of advanced therapies that modify a patient's cells to treat diseases.\n4. Research Tools & Consumables\nThe life sciences subsector specializing in research tools and consumables enables scientific discoveries across academia, biotechnology, and pharmaceuticals. These firms supply a wide range of essential laboratory products, ensuring a recurring revenue stream through repeat purchases and replenishment. Their business models benefit from strong customer loyalty, a diversified product portfolio, and exposure to both the research and clinical markets. However, challenges include high R&D investment to maintain technological leadership, pricing pressures from budget-conscious institutions, and vulnerability to fluctuations in research funding cycles. Looking ahead, this subsector stands to benefit from tailwinds such as growing demand for tools supporting emerging fields like synthetic biology and personalized medicine. There is also a rise in automation and AI-driven solutions in laboratories that could create new opportunities to sell tools and consumables. Nevertheless, headwinds exist. These companies tend to be at the mercy of supply chain disruptions and sensitivity to macroeconomic conditions that impact funding for research initiatives.\nBio-Techne competes with several life sciences tools providers including Thermo Fisher Scientific (NYSE:TMO), Danaher (NYSE:DHR), Agilent Technologies (NYSE:A), and Abcam (NASDAQ:ABCM). In the spatial biology and diagnostics space, competitors include 10x Genomics (NASDAQ:TXG) and NeoGenomics (NASDAQ:NEO).\n5. Revenue Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith just $1.22 billion in revenue over the past 12 months, Bio-Techne is a small company in an industry where scale matters. This makes it difficult to build trust with customers because healthcare is heavily regulated, complex, and resource-intensive.\n6. Revenue Growth\nA company’s long-term sales performance can indicate its overall quality. Any business can experience short-term success, but top-performing ones enjoy sustained growth for years. Thankfully, Bio-Techne’s 10.5% annualized revenue growth over the last five years was decent. Its growth was slightly above the average healthcare company and shows its offerings resonate with customers.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Bio-Techne’s recent performance shows its demand has slowed as its annualized revenue growth of 3.6% over the last two years was below its five-year trend.\nWe can better understand the company’s sales dynamics by analyzing its organic revenue, which strips out one-time events like acquisitions and currency fluctuations that don’t accurately reflect its fundamentals. Over the last two years, Bio-Techne’s organic revenue averaged 3.1% year-on-year growth. Because this number aligns with its two-year revenue growth, we can see the company’s core operations (not acquisitions and divestitures) drove most of its results.\nThis quarter, Bio-Techne reported modest year-on-year revenue growth of 3.5% but beat Wall Street’s estimates by 0.7%.\nLooking ahead, sell-side analysts expect revenue to grow 5.1% over the next 12 months, an improvement versus the last two years. This projection is above the sector average and implies its newer products and services will spur better top-line performance.\n7. Operating Margin\nOperating margin is an important measure of profitability as it shows the portion of revenue left after accounting for all core expenses – everything from the cost of goods sold to advertising and wages. It’s also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.\nBio-Techne has been an efficient company over the last five years. It was one of the more profitable businesses in the healthcare sector, boasting an average operating margin of 20.6%.\nLooking at the trend in its profitability, Bio-Techne’s operating margin decreased by 17.1 percentage points over the last five years. The company’s two-year trajectory also shows it failed to get its profitability back to the peak as its margin fell by 17.9 percentage points. This performance was poor no matter how you look at it - it shows its expenses were rising and it couldn’t pass those costs onto its customers.\nThis quarter, Bio-Techne generated an operating margin profit margin of negative 7.5%, down 22.5 percentage points year on year. This contraction shows it was less efficient because its expenses grew faster than its revenue.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nBio-Techne’s remarkable 11.2% annual EPS growth over the last five years aligns with its revenue performance. This tells us it maintained its per-share profitability as it expanded.\nIn Q2, Bio-Techne reported adjusted EPS at $0.53, up from $0.49 in the same quarter last year. This print beat analysts’ estimates by 6.1%. Over the next 12 months, Wall Street expects Bio-Techne’s full-year EPS of $1.93 to grow 7.1%.\n9. Cash Is King\nFree cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.\nBio-Techne has shown robust cash profitability, giving it an edge over its competitors and the ability to reinvest or return capital to investors. The company’s free cash flow margin averaged 23.4% over the last five years, quite impressive for a healthcare business.\nTaking a step back, we can see that Bio-Techne’s margin dropped by 12 percentage points during that time. Continued declines could signal it is in the middle of an investment cycle.\nBio-Techne’s free cash flow clocked in at $93.31 million in Q2, equivalent to a 29.4% margin. This result was good as its margin was 10.6 percentage points higher than in the same quarter last year, but we wouldn’t put too much weight on the short term because investment needs can be seasonal, causing temporary swings. Long-term trends trump fluctuations.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nBio-Techne’s management team makes decent investment decisions and generates value for shareholders. Its five-year average ROIC was 8.3%, slightly better than typical healthcare business.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Unfortunately, Bio-Techne’s ROIC has decreased over the last few years. We like what management has done in the past, but its declining returns are perhaps a symptom of fewer profitable growth opportunities.\n11. Balance Sheet Assessment\nBio-Techne reported $162.2 million of cash and $444.1 million of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $429.6 million of EBITDA over the last 12 months, we view Bio-Techne’s 0.7× net-debt-to-EBITDA ratio as safe. We also see its $1.44 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Bio-Techne’s Q2 Results\nIt was good to see Bio-Techne narrowly top analysts’ organic revenue expectations this quarter. We were also happy its EPS outperformed Wall Street’s estimates. Overall, this print had some key positives. Investors were likely hoping for more, and shares traded down 2.2% to $53.40 immediately after reporting.\n13. Is Now The Time To Buy Bio-Techne?\nUpdated: August 12, 2025 at 12:35 AM EDT\nBefore making an investment decision, investors should account for Bio-Techne’s business fundamentals and valuation in addition to what happened in the latest quarter.\nWe cheer for all companies helping people live better, but in the case of Bio-Techne, we’ll be cheering from the sidelines. Although its revenue growth was good over the last five years, it’s expected to deteriorate over the next 12 months and its cash profitability fell over the last five years. And while the company’s impressive operating margins show it has a highly efficient business model, the downside is its subscale operations give it fewer distribution channels than its larger rivals.\nBio-Techne’s P/E ratio based on the next 12 months is 24.4x. This valuation tells us a lot of optimism is priced in - we think there are better stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $65.29 on the company (compared to the current share price of $50.15).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nyse/avtr?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF12aG0DZkU%3D&utm_ticker=RVTY",
      "text": "Avantor (AVTR)\nWe’re skeptical of Avantor. Its weak sales growth and low returns on capital show it struggled to generate demand and profits.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think Avantor Will Underperform\nWith roots dating back to 1904 and embedded in virtually every stage of scientific research and production, Avantor (NYSE:AVTR) provides mission-critical products, materials, and services to customers in biopharma, healthcare, education, and advanced technology industries.\n- Core business is underperforming as its organic revenue has disappointed over the past two years, suggesting it might need acquisitions to stimulate growth\n- 2% annual revenue growth over the last five years was slower than its healthcare peers\n- A positive is that its efficient business processes manifest in an adjusted operating margin of 17.5%, higher than most healthcare companies\nWhy There Are Better Opportunities Than Avantor\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Avantor\nAvantor is trading at $12.26 per share, or 11.2x forward P/E. Avantor’s valuation may seem like a bargain, especially when stacked up against other healthcare companies. We remind you that you often get what you pay for, though.\nWe’d rather pay up for companies with elite fundamentals than get a bargain on weak ones. Cheap stocks can be value traps, and as their performance deteriorates, they will stay cheap or get even cheaper.\n3. Avantor (AVTR) Research Report: Q2 CY2025 Update\nLife sciences company Avantor (NYSE:AVTR) reported Q2 CY2025 results exceeding the market’s revenue expectations, but sales fell by 1.1% year on year to $1.68 billion. Its non-GAAP profit of $0.24 per share was in line with analysts’ consensus estimates.\nAvantor (AVTR) Q2 CY2025 Highlights:\n- Revenue: $1.68 billion vs analyst estimates of $1.67 billion (1.1% year-on-year decline, 0.6% beat)\n- Adjusted EPS: $0.24 vs analyst estimates of $0.25 (in line)\n- Adjusted EBITDA: $279.8 million vs analyst estimates of $289.7 million (16.6% margin, 3.4% miss)\n- Operating Margin: 7.7%, down from 10.3% in the same quarter last year\n- Free Cash Flow Margin: 7.4%, down from 13.8% in the same quarter last year\n- Organic Revenue was flat year on year (-2% in the same quarter last year)\n- Market Capitalization: $9.16 billion\nCompany Overview\nWith roots dating back to 1904 and embedded in virtually every stage of scientific research and production, Avantor (NYSE:AVTR) provides mission-critical products, materials, and services to customers in biopharma, healthcare, education, and advanced technology industries.\nAvantor operates as a comprehensive supplier for scientific endeavors, offering everything from ultra-high purity chemicals and lab consumables to specialized equipment and on-site services. The company's portfolio includes millions of products across three main categories: materials and consumables (like chemicals, reagents, and lab supplies), equipment and instrumentation (such as filtration systems and analytical instruments), and services (including lab management and biopharmaceutical scale-up support).\nScientists and researchers rely on Avantor's products for precision and consistency in their work. For example, a pharmaceutical researcher developing a new cancer treatment might use Avantor's ultra-pure J.T.Baker chemicals during initial testing, their specialized filtration systems during production scale-up, and their logistics services to manage inventory throughout the process.\nThe company generates revenue through direct sales of products and services to a diverse customer base spanning approximately 180 countries. Its business model is designed to support customers throughout their entire workflow – from initial discovery research through full-scale production. This integrated approach allows Avantor to become deeply embedded in customers' operations, with approximately 40% of sales coming from relationships lasting 15 years or more.\nAvantor maintains a significant digital presence, with about 76% of transactions flowing through its e-commerce platforms. These digital tools help streamline procurement for customers while providing Avantor with valuable data on customer needs and trends. The company also employs approximately 3,500 sales professionals, including over 200 specialists with deep technical knowledge who can advise customers on complex applications.\nManufacturing capabilities are a key strength, particularly for high-purity materials. The company produces proprietary products under brands like J.T.Baker chemicals and NuSil silicones, which can achieve purity levels as stringent as one part-per-trillion – critical for applications in life sciences and electronics.\n4. Research Tools & Consumables\nThe life sciences subsector specializing in research tools and consumables enables scientific discoveries across academia, biotechnology, and pharmaceuticals. These firms supply a wide range of essential laboratory products, ensuring a recurring revenue stream through repeat purchases and replenishment. Their business models benefit from strong customer loyalty, a diversified product portfolio, and exposure to both the research and clinical markets. However, challenges include high R&D investment to maintain technological leadership, pricing pressures from budget-conscious institutions, and vulnerability to fluctuations in research funding cycles. Looking ahead, this subsector stands to benefit from tailwinds such as growing demand for tools supporting emerging fields like synthetic biology and personalized medicine. There is also a rise in automation and AI-driven solutions in laboratories that could create new opportunities to sell tools and consumables. Nevertheless, headwinds exist. These companies tend to be at the mercy of supply chain disruptions and sensitivity to macroeconomic conditions that impact funding for research initiatives.\nAvantor competes with other life sciences suppliers including Thermo Fisher Scientific (NYSE:TMO), Danaher Corporation (NYSE:DHR), MilliporeSigma (a division of Merck KGaA), and Bio-Rad Laboratories (NYSE:BIO), as well as more specialized suppliers in specific product categories.\n5. Economies of Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith $6.67 billion in revenue over the past 12 months, Avantor has decent scale. This is important as it gives the company more leverage in a heavily regulated, competitive environment that is complex and resource-intensive.\n6. Revenue Growth\nExamining a company’s long-term performance can provide clues about its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Unfortunately, Avantor’s 2% annualized revenue growth over the last five years was tepid. This was below our standards and is a rough starting point for our analysis.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Avantor’s performance shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 3.6% annually.\nAvantor also reports organic revenue, which strips out one-time events like acquisitions and currency fluctuations that don’t accurately reflect its fundamentals. Over the last two years, Avantor’s organic revenue averaged 3.3% year-on-year declines. Because this number aligns with its two-year revenue growth, we can see the company’s core operations (not acquisitions and divestitures) drove most of its results.\nThis quarter, Avantor’s revenue fell by 1.1% year on year to $1.68 billion but beat Wall Street’s estimates by 0.6%.\nLooking ahead, sell-side analysts expect revenue to grow 1.9% over the next 12 months. While this projection indicates its newer products and services will catalyze better top-line performance, it is still below the sector average.\n7. Adjusted Operating Margin\nAdjusted operating margin is a key measure of profitability. Think of it as net income (the bottom line) excluding the impact of non-recurring expenses, taxes, and interest on debt - metrics less connected to business fundamentals.\nAvantor has managed its cost base well over the last five years. It demonstrated solid profitability for a healthcare business, producing an average adjusted operating margin of 17.5%.\nLooking at the trend in its profitability, Avantor’s adjusted operating margin decreased by 1.8 percentage points over the last five years. This performance was caused by more recent speed bumps as the company’s margin fell by 2.9 percentage points on a two-year basis. We’re disappointed in these results because it shows its expenses were rising and it couldn’t pass those costs onto its customers.\nThis quarter, Avantor generated an adjusted operating margin profit margin of 15%, down 1.3 percentage points year on year. This reduction is quite minuscule and indicates the company’s overall cost structure has been relatively stable.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nAvantor’s EPS grew at a solid 7.4% compounded annual growth rate over the last five years, higher than its 2% annualized revenue growth. However, we take this with a grain of salt because its adjusted operating margin didn’t improve and it didn’t repurchase its shares, meaning the delta came from reduced interest expenses or taxes.\nIn Q2, Avantor reported adjusted EPS at $0.24, down from $0.25 in the same quarter last year. This print missed analysts’ estimates, but we care more about long-term adjusted EPS growth than short-term movements. Over the next 12 months, Wall Street expects Avantor’s full-year EPS of $1 to grow 8.1%.\n9. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nAvantor has shown impressive cash profitability, giving it the option to reinvest or return capital to investors. The company’s free cash flow margin averaged 10.6% over the last five years, better than the broader healthcare sector.\nTaking a step back, we can see that Avantor’s margin dropped by 4.5 percentage points during that time. If its declines continue, it could signal increasing investment needs and capital intensity.\nAvantor’s free cash flow clocked in at $124.8 million in Q2, equivalent to a 7.4% margin. The company’s cash profitability regressed as it was 6.4 percentage points lower than in the same quarter last year, suggesting its historical struggles have dragged on.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nAvantor historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 7.4%, somewhat low compared to the best healthcare companies that consistently pump out 20%+.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. On average, Avantor’s ROIC decreased by 1.3 percentage points annually over the last few years. Paired with its already low returns, these declines suggest its profitable growth opportunities are few and far between.\n11. Balance Sheet Assessment\nAvantor reported $449.4 million of cash and $4.24 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $1.16 billion of EBITDA over the last 12 months, we view Avantor’s 3.3× net-debt-to-EBITDA ratio as safe. We also see its $105.1 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Avantor’s Q2 Results\nIt was good to see Avantor narrowly top analysts’ revenue expectations this quarter. We were also happy its organic revenue was in line with Wall Street’s estimates. On the other hand, its EPS missed. Overall, this quarter could have been better. The stock traded down 6.8% to $12.53 immediately after reporting.\n13. Is Now The Time To Buy Avantor?\nUpdated: August 12, 2025 at 12:10 AM EDT\nBefore making an investment decision, investors should account for Avantor’s business fundamentals and valuation in addition to what happened in the latest quarter.\nAvantor’s business quality ultimately falls short of our standards. First off, its revenue growth was uninspiring over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while its sturdy operating margins show it has disciplined cost controls, the downside is its organic revenue declined. On top of that, its cash profitability fell over the last five years.\nAvantor’s P/E ratio based on the next 12 months is 11.2x. Investors with a higher risk tolerance might like the company, but we think the potential downside is too great. We're pretty confident there are superior stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $14.12 on the company (compared to the current share price of $12.26).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    }
  ],
  "argos_summary": "Positive inflation data led to a market rally, with the S&P 500, Dow, and Nasdaq all climbing as investors anticipated potential interest rate cuts by the Federal Reserve. Stocks such as Revvity, Avantor, Azenta, Bio-Techne, and Amneal saw significant gains, although analysts express skepticism about the long-term prospects for companies like Azenta and Amneal due to weak returns on capital and declining revenue growth. Despite some positive quarterly results, concerns remain about the sustainability of growth and profitability in the healthcare sector.",
  "argos_id": "UNN6EPUSH"
}