{
  "url": "https://www.ksl.com/article/51359858/the-little-league-world-series-has-had-its-share-of-drama-before-even-getting-to-williamsport",
  "authorsByline": "Deseret Digital Media",
  "articleId": "8fde0d15b0384aa1b0b1ec972c153a59",
  "source": {
    "domain": "ksl.com",
    "location": null
  },
  "imageUrl": "https://img.ksl.com/slc/3105/310588/31058888.jpg?filter=kslv2/responsive_story_lg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:29:22+00:00",
  "addDate": "2025-08-12T21:37:04.827726+00:00",
  "refreshDate": "2025-08-12T21:37:04.827729+00:00",
  "score": 1.0,
  "title": "The Little League World Series has had its share of drama before even getting to Williamsport",
  "description": "The road to Williamsport was filled with more drama than usual for a couple Little League World Series participants this year, including a Venezuelan team that needed visa exemptions to make the trip and an American club that narrowly knocked off a defending champ.",
  "content": "SOUTH WILLIAMSPORT, Pa. — The road to Williamsport was filled with more drama than usual for a couple Little League World Series participants this year, including a Venezuelan team that needed visa exemptions to make the trip and an American club that narrowly knocked off a defending champ.\n\nBaseball's preeminent youth baseball tournament resumes Wednesday in central Pennsylvania. The festivities begin with a look at what makes the 20-team event special.\n\nESPN is airing a documentary called \"Big Dreams: Little League World Series 2024\" on Tuesday night. The filmmakers had great raw material. Lake Mary, Florida, defeated Taiwan 2-1 in eight tense innings last August to win the title. But director Rudy Valdez wanted to go deeper than wins and losses.\n\n\"These are kids, you know, I want you to remember that,\" Valdez said. \"We're showing them how to navigate life, and we're showing them how to take wins and take losses and be good sports and how to get back up when you fall.\n\n\"We have to give them the space to learn and I wanted that to be the feeling of this, that you were really navigating this year of the Little League World Series through the eyes and experiences of them.\"\n\nThe film was set to premiere Tuesday at 9:30 p.m. ET on ESPN and is available for streaming through ESPN+.\n\nCardenales Little League from Barquimesto, Venezuela, will represent Latin America for the second straight year, but this time the team required a special exemption from President Donald Trump's travel ban. The team only learned of the exemption less than a week before its opening game Wednesday at 1 p.m. against Puerto Rico.\n\nCardenales' exemption came after a different Venezuelan team was denied entry into the United States for the Senior Baseball World Series last month.\n\nThis year's Cardenales team has a different roster and coaching staff than the 2024 group. Last year's team survived two rounds in the elimination bracket to advance to the international final. It lost 4-1 to Taiwan but beat Texas for third place.\n\nVenezuela only has two Little League World Series titles, the last 25 years ago.\n\nDefending champion Lake Mary was one out away from making its return to central Pennsylvania, but there will be a different team representing the Southeast Region this year: South Carolina's Irmo Little League.\n\nIn the regional final, Irmo trailed 4-0 in the bottom of the sixth — the last inning in Little League ball — with the bottom of their lineup headed to the plate and the goal of getting Joe Giulietti, the team's best hitter, to bat.\n\nIrmo succeeded but Joe never swung at a pitch. Lake Mary intentionally walked him with the bases loaded to make the score 4-2. Brady Westbrooks was up next and, down to his last strike, he found the fastball he was looking for, hammering a three-run double.\n\nPlayers were running around the stadium, carrying the Southeast Region champions banner, while their manager, Dave Bogan, was brought to tears.\n\n\"While we had confidence, we were the underdog,\" Bogan said. \"When this team was forming, there was a lot of local excitement about our potential and our possibilities. But with that excitement comes pressure and it was a sense of relief that we did it.\"\n\nLake Mary previously defeated Irmo 14-0, and before the regional final, Bogan told his players they needed to believe they were \"going to shock the Little League baseball world.\"\n\nIrmo is only the fourth South Carolina team, and second since 1950, to play in South Williamsport. It'll play Braintree American Little League, the Massachusetts team representing the New England region, on Thursday.\n\n\"Our motto is nothing is given, everything is earned and they really work hard to earn everything through this process,\" Bogan said. \"They absolutely love to grind.\"\n\nTaiwan's 17 Little League World Series championships are the most by any country other than the United States, which always gets a team in the championship because of the way the LLWS brackets are set up.\n\nBut it has been nearly 30 years since Taiwan won its most recent title in 1996.\n\nTen years ago, current manager Min-Nan Lai's club went 2-2 in the tournament, losing its second game in the double-elimination tournament to Mexico.\n\nNow, Lai is back with the Tung-Yuan Little League team after defeating South Korea in the Asia-Pacific regional final. The 2025 LLWS marks Taiwan's fourth consecutive and 33rd appearance in tournament history, and its first game will be against Mexico on Thursday.\n\nThe Little League World Series first-round bracket matchups were announced not long before the Asia-Pacific regional tournament, something Lai and his team noted. They wanted to get another chance at the team that ended Taiwan's chances 10 years ago.\n\n\"A famous Taiwanese saying is you always want to do hard work for 10 years for one minute to shine,\" Lai said through an interpreter.\n\nTung-Yuan brings strong pitching to South Williamsport and Lai believes this is one of the best teams to represent Taiwan in recent history. Unlike last year's Taiwan club, his team doesn't seem to have any issues hitting. In the regional tournament, Taiwan outscored opponents 60-1 in the six games the team won.\n\nTaiwan also boasts five pitchers capable of reaching over 70 mph and Chin-Tse Lin throws at 80 mph, which looks much faster to the hitter because of how close the mound is to home plate. There are pitch count rules in Little League, requiring a certain amount of days rest depending on how many pitches a player throws.\n\nThe Kuei-Shan Little League team from Taoyuan reached the final of the international bracket the past two years but wasn't able to win it all. Lai hopes for a different result for Tung-Yuan — he wants to bring Taiwan that 18th championship.\n\n\"That's the number one expectation,\" Lai said.\n\nAmanda Vogt is a student in the John Curley Center for Sports Journalism at Penn State.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/venezuela-little-league-denied-visas-d296bcf7296e849e27de1b1f8cd30edb",
    "https://apnews.com/sports"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Little League World Series",
      "weight": 0.10288795
    },
    {
      "name": "Little League",
      "weight": 0.096488155
    },
    {
      "name": "Irmo Little League",
      "weight": 0.094192214
    },
    {
      "name": "Cardenales Little League",
      "weight": 0.092466414
    },
    {
      "name": "Little League ball",
      "weight": 0.09086351
    },
    {
      "name": "Braintree American Little League",
      "weight": 0.08512488
    },
    {
      "name": "two Little League World Series titles",
      "weight": 0.06667143
    },
    {
      "name": "The Little League World Series",
      "weight": 0.06563099
    },
    {
      "name": "the Little League World Series",
      "weight": 0.06563099
    },
    {
      "name": "a couple Little League World Series participants",
      "weight": 0.06560403
    }
  ],
  "topics": [
    {
      "name": "World Series"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9931640625
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.86474609375
    }
  ],
  "sentiment": {
    "positive": 0.124511965,
    "negative": 0.49522743,
    "neutral": 0.38026065
  },
  "summary": "The Little League World Series (LWS) has seen more drama this year, with a Venezuelan team needing visa exemptions to make the trip and an American club that narrowly defeated defending champion. ESPN is airing a documentary called \"Big Dreams: Little LeagueWorld Series 2024\" about the unique experiences of the 20-team event. The documentary was commissioned to convey the true story of the event. Other participants include South Carolina's Irmo Little League, who will represent the Southeast Region, and Venezuela's Cardenales Little League. This year's team required a special exemption from President Donald Trump's travel ban, and their opening game will be against Puerto Rico. The tournament resumes in central Pennsylvania.",
  "shortSummary": "The Little League World Series returns in South Williamsport, with notable entries like Venezuelan team Cardenales and Irmo, highlighting the importance of hard-earned victories.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5abda3811e8342b9a16c88f62a4ff876",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/venezuela-little-league-denied-visas-d296bcf7296e849e27de1b1f8cd30edb",
      "text": "Venezuelan baseball team denied visas into US, Little League International says\nA Venezuelan baseball team was denied visas into the United States and will miss this year’s Senior Baseball World Series, Little League International confirmed Friday.\nThe Cacique Mara team, from Maracaibo, Venezuela, was scheduled to participate in the tournament after winning the Latin American championship in Mexico.\n“The Cacique Mara Little League team from Venezuela was unfortunately unable to obtain the appropriate visas to travel to the Senior League Baseball World Series,” Little League International said in a statement, adding that it is “extremely disappointing, especially to these young athletes.”\nThe Venezuelan team traveled to Colombia two weeks ago to apply for their visas at the U.S. embassy in Bogotá.\nThe embassy did not immediately respond to an Associated Press request for comment.\n“It is a mockery on the part of Little League to keep us here in Bogotá with the hope that our children can fulfill their dreams of participating in a world championship,” the team said in a statement. “What do we do with so much injustice, what do we do with the pain that was caused to our children?”\nVenezuela is among a list of countries with restrictions for entering the U.S. or its territories. President Donald Trump has banned travel to the U.S. from 12 other countries, citing national security concerns.\nEarlier in the month, the Cuban women’s volleyball team was denied visas to participate in a tournament in Puerto Rico.\n“They told us that Venezuela is on a list because Trump says Venezuelans are a threat to the security of his state, of his country,” said Kendrick Gutiérrez, the league’s president in Venezuela. “It hasn’t been easy the situation; we earned the right to represent Latin America in the World Championship.”\nThe Senior League Baseball World Series, a tournament for players aged 13-16, is played each year in Easley, South Carolina. It begins Saturday.\nThe tournament organizers replaced the Venezuelans with the Santa Maria de Aguayo team from Tamaulipas, Mexico, the team that was a runner-up in the Latin American championship.\n“I think this is the first time this has happened, but it shouldn’t end this way. They’re going to replace us with another team because relations have been severed; it’s not fair,” Gutiérrez added. “I don’t understand why they put Mexico in at the last minute and left Venezuela out.”\n___\nAP MLB: https://apnews.com/hub/mlb"
    },
    {
      "url": "https://apnews.com/sports",
      "text": "Sports\nVideo\nAP Top 25 Preseason Poll Arrives Monday\n1:03\nFans are throwing sex toys on WNBA courts. Here’s how the league is cracking down\n0:45\nShedeur Sanders discusses his dad’s health issues\n0:54\nAdam Sandler says the ‘Happy Gilmore’ golf swing might actually work\n1:08\nSwimming stars and a 12-year-old phenom race at world championships in Singapore\n0:42\nDeion Sanders insists early cancer detection saved his life\n0:41\nAP photographer offers behind-the-scenes look at Tour de France\n1:19\nJudge says 12-year-old who was suspended for bat flip can play\n0:30\nWNBA players seek bigger salaries, more revenue sharing in next CBA\n1:03\nDamian Lillard calls Portland return a basketball and family decision\n1:00\nWhite House says Trump is serious about wanting Washington Commanders to go back to its former name\n0:27\nDon’t blame Americans for calling football ‘soccer’\n1:07\nBritish Open brings a major test like no other\n1:05\nScottie Scheffler says being a golfer is not a ‘fulfilling life’\n0:34\nThe world’s oldest marathon runner dies in road accident aged 114\n0:18\nBehind the scenes at Wimbledon with The AP\n1:23\nRed Bull fires F1 star Christian Horner after 20 title-filled years\n1:01\nLittle green man becomes little green woman with soccer ball for Euro 2025\n0:20\nConversation about players’ mental health returns to tennis at Wimbledon\n0:47\nMalik Beasley’s career year overshadowed by off-court issues\n1:02\nWomen’s soccer at Euro 2025 aims for global impact\n0:53\nEverything you need to know about F1\n1:11\nOklahoma City Thunder stars struggle to pop champagne after their NBA Finals title triumph\n0:38\nThe Club World Cup is here and still facing some big questions\n0:53\nCaitlin Clark is ready to get back on the court after quadriceps injury\n0:43\nTaylor Swift and Travis Kelce attend game 4 of Stanley Cup finals\n0:14\nNBA mock draft: Duke’s Cooper Flagg nears No. 1 pick status\n0:55\nAaron Rodgers reveals he’s married\n0:14\nCheeseheads are everywhere at the NFL draft - how did they become so popular?\n0:54\nWhich celebrity would you have play you?\n0:33"
    }
  ],
  "argos_summary": "The Little League World Series in South Williamsport, Pennsylvania, features notable stories this year, including a Venezuelan team that received a special visa exemption to participate and an American team, Irmo Little League from South Carolina, that made a dramatic comeback to replace the defending champion. A documentary titled \"Big Dreams: Little League World Series 2024\" aired on ESPN, highlighting the personal journeys of the young athletes. Taiwan's Tung-Yuan Little League team, aiming for its 18th championship, is also a key contender, showcasing strong pitching and a desire to reclaim past glory.",
  "argos_id": "US1XAVN7H"
}