{
  "url": "https://finance.yahoo.com/news/cava-nyse-cava-misses-q2-202503921.html",
  "authorsByline": "Radek Strnad",
  "articleId": "1e7ca92e3b1047299da72b2b188b6ce6",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/baWtxhwsMQDyHT8IURqU.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/f739504feccd9a05d4cb5d932ae09ed2",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:25:03+00:00",
  "addDate": "2025-08-12T20:47:15.479016+00:00",
  "refreshDate": "2025-08-12T20:47:15.479018+00:00",
  "score": 1.0,
  "title": "CAVA (NYSE:CAVA) Misses Q2 Sales Expectations, Stock Drops 22%",
  "description": "Mediterranean fast-casual restaurant chain CAVA (NYSE:CAVA) missed Wall Street’s revenue expectations in Q2 CY2025, but sales rose 20.2% year on year to $280.6 million. Its non-GAAP profit of $0.16 per share was 18.7% above analysts’ consensus estimates.",
  "content": "Mediterranean fast-casual restaurant chain CAVA (NYSE:CAVA) missed Wall Street’s revenue expectations in Q2 CY2025, but sales rose 20.2% year on year to $280.6 million. Its non-GAAP profit of $0.16 per share was 18.7% above analysts’ consensus estimates.\n\nIs now the time to buy CAVA? Find out in our full research report.\n• EBITDA guidance for the full year is $155.5 million at the midpoint, below analyst estimates of $159.1 million\n• Operating Margin: 7%, in line with the same quarter last year\n• Free Cash Flow Margin: 7.8%, down from 9.7% in the same quarter last year\n• Locations: 398 at quarter end, up from 352 in the same quarter last year\n• Same-Store Sales rose 2.1% year on year (14.4% in the same quarter last year)\n\n“During the second quarter of 2025, we continued to grow market share and firmly establish our category-defining leadership position,” said Brett Schulman, Co-Founder and CEO.\n\nExamining a company’s long-term performance can provide clues about its quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul.\n\nWith $1.08 billion in revenue over the past 12 months, CAVA is a mid-sized restaurant chain, which sometimes brings disadvantages compared to larger competitors benefiting from better brand awareness and economies of scale. On the bright side, it can still flex high growth rates because it’s working from a smaller revenue base.\n\nAs you can see below, CAVA’s sales grew at an incredible 24% compounded annual growth rate over the last four years (we compare to 2019 to normalize for COVID-19 impacts) as it opened new restaurants and increased sales at existing, established dining locations.\n\nThis quarter, CAVA generated an excellent 20.2% year-on-year revenue growth rate, but its $280.6 million of revenue fell short of Wall Street’s high expectations.\n\nLooking ahead, sell-side analysts expect revenue to grow 22% over the next 12 months, a slight deceleration versus the last four years. Despite the slowdown, this projection is commendable and suggests the market is baking in success for its menu offerings.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nyse/cava?utm_source=earningsArticle&utm_medium=yahoo&utm_campaign=top&utm_article=CF12aGIFYUI%3D&utm_ticker=CAVA"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Q2 Sales Expectations",
      "weight": 0.086594075
    },
    {
      "name": "year",
      "weight": 0.086090796
    },
    {
      "name": "CAVA",
      "weight": 0.08075612
    },
    {
      "name": "high growth rates",
      "weight": 0.07997885
    },
    {
      "name": "quarter end",
      "weight": 0.07488008
    },
    {
      "name": "the same quarter last year",
      "weight": 0.07426303
    },
    {
      "name": "market share",
      "weight": 0.07422632
    },
    {
      "name": "sales",
      "weight": 0.072541095
    },
    {
      "name": "new restaurants",
      "weight": 0.07076228
    },
    {
      "name": "revenue",
      "weight": 0.06869382
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9697265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8701171875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.701171875
    }
  ],
  "sentiment": {
    "positive": 0.80577505,
    "negative": 0.11670807,
    "neutral": 0.077516906
  },
  "summary": "Mediterranean fast-casual restaurant chain CAVA (NYSE:CAVA) fell behind Wall Street's revenue expectations in Q2 CY2025, with sales rising 20.2% year on year to $280.6 million. The company's non-GAAP profit of $0.16 per share was 18.7% above analysts’ consensus estimates. EBITDA guidance for the full year is $155.5 million at the midpoint, below analyst estimates of $159.1 million. Despite this, CAVA continues to grow market share and establish a category-defining leadership position.",
  "shortSummary": "CAVA missed Q2 sales expectations, despite a 20.2% growth rate, with operating margins at 7%, and its stock dropping 22%",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "27abe3f49e6743bda7866112fb915274",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nyse/cava?utm_source=earningsArticle&utm_medium=yahoo&utm_campaign=top&utm_article=CF12aGIFYUI%3D&utm_ticker=CAVA",
      "text": "CAVA (CAVA)\nCAVA catches our eye. Its fast sales growth, strong unit economics, and bright outlook suggest it will win more market share.― StockStory Analyst Team\n1. News\n2. Summary\nWhy CAVA Is Interesting\nStarting from a single Washington, D.C. location, CAVA (NYSE:CAVA) operates a fast-casual restaurant chain offering customizable Mediterranean-inspired dishes.\n- Annual revenue growth of 25.7% over the last three years was superb and indicates its market share is rising\n- Notable projected revenue growth of 21.8% for the next 12 months hints at market share gains\n- On the flip side, its negative returns on capital show that some of its growth strategies have backfired\nWhy Should You Watch CAVA\nHigh Quality\nInvestable\nUnderperform\nWhy Should You Watch CAVA\nAt $82.54 per share, CAVA trades at 135.1x forward P/E. The lofty valuation multiple means there’s plenty of good news priced into shares; short-term volatility could result if anything (e.g. a mediocre quarter) rains on that parade.\nCAVA can improve its fundamentals over time by putting up good numbers quarter after quarter, year after year. Once that happens, we’ll be happy to recommend the stock.\n3. CAVA (CAVA) Research Report: Q2 CY2025 Update\nMediterranean fast-casual restaurant chain CAVA (NYSE:CAVA) fell short of the market’s revenue expectations in Q2 CY2025, but sales rose 20.2% year on year to $280.6 million. Its non-GAAP profit of $0.16 per share was 18.7% above analysts’ consensus estimates.\nCAVA (CAVA) Q2 CY2025 Highlights:\n- Revenue: $280.6 million vs analyst estimates of $285.6 million (20.2% year-on-year growth, 1.8% miss)\n- Adjusted EPS: $0.16 vs analyst estimates of $0.13 (18.7% beat)\n- Adjusted EBITDA: $42.1 million vs analyst estimates of $40.49 million (15% margin, 4% beat)\n- EBITDA guidance for the full year is $155.5 million at the midpoint, below analyst estimates of $159.1 million\n- Operating Margin: 7%, in line with the same quarter last year\n- Free Cash Flow Margin: 7.8%, down from 9.7% in the same quarter last year\n- Locations: 398 at quarter end, up from 352 in the same quarter last year\n- Same-Store Sales rose 2.1% year on year (14.4% in the same quarter last year)\n- Market Capitalization: $9.51 billion\nCompany Overview\nStarting from a single Washington, D.C. location, CAVA (NYSE:CAVA) operates a fast-casual restaurant chain offering customizable Mediterranean-inspired dishes.\nThe company was founded by a group of friends with a desire to bring modern Mediterranean flavors to a broader audience. Starting as a local restaurant, CAVA built its reputation on a build-your-own concept that lets customers choose from a variety of fresh proteins, toppings, and sauces.\nCAVA’s restaurants typically feature an open, assembly line-style setup, inviting guests to watch their meals come to life as they move down the line. To reach even more consumers, the brand has expanded beyond its own stores, offering dips and spreads through grocery channels, and further strengthening its presence through the acquisition of Zoës Kitchen. This acquisition helped CAVA break into new markets and scale its operations by converting former Zoës Kitchen sites into new CAVA locations.\nIn today’s digital age, CAVA provides online ordering and delivery options through its website and mobile app, streamlining the process with real-time tracking and exclusive promotions.\n4. Modern Fast Food\nModern fast food is a relatively newer category representing a middle ground between traditional fast food and sit-down restaurants. These establishments feature an expanded menu selection priced above traditional fast food options, often incorporating fresher and cleaner ingredients to serve customers prioritizing quality. These eateries are capitalizing on the perception that your drive-through burger and fries joint is detrimental to your health because of inferior ingredients.\nCompetitors offering similar menus and service models include Chipotle (NYSE:CMG), Sweetgreen (NYSE:SG), and Noodles & Company (NASDAQ:NDLS).\n5. Revenue Growth\nReviewing a company’s long-term sales performance reveals insights into its quality. Any business can experience short-term success, but top-performing ones enjoy sustained growth for years.\nWith $1.08 billion in revenue over the past 12 months, CAVA is a mid-sized restaurant chain, which sometimes brings disadvantages compared to larger competitors benefiting from better brand awareness and economies of scale. On the bright side, it can still flex high growth rates because it’s working from a smaller revenue base.\nAs you can see below, CAVA grew its sales at an incredible 24% compounded annual growth rate over the last four years (we compare to 2019 to normalize for COVID-19 impacts) as it opened new restaurants and increased sales at existing, established dining locations.\nThis quarter, CAVA generated an excellent 20.2% year-on-year revenue growth rate, but its $280.6 million of revenue fell short of Wall Street’s high expectations.\nLooking ahead, sell-side analysts expect revenue to grow 22% over the next 12 months, a slight deceleration versus the last four years. Despite the slowdown, this projection is commendable and implies the market is forecasting success for its menu offerings.\n6. Restaurant Performance\nNumber of Restaurants\nA restaurant chain’s total number of dining locations often determines how much revenue it can generate.\nCAVA operated 398 locations in the latest quarter. It has opened new restaurants at a rapid clip over the last two years, averaging 17% annual growth, much faster than the broader restaurant sector. This gives it a chance to become a large, scaled business over time.\nWhen a chain opens new restaurants, it usually means it’s investing for growth because there’s healthy demand for its meals and there are markets where its concepts have few or no locations.\nSame-Store Sales\nA company's restaurant base only paints one part of the picture. When demand is high, it makes sense to open more. But when demand is low, it’s prudent to close some locations and use the money in other ways. Same-store sales gives us insight into this topic because it measures organic growth at restaurants open for at least a year.\nCAVA has been one of the most successful restaurant chains over the last two years thanks to skyrocketing demand within its existing dining locations. On average, the company has posted exceptional year-on-year same-store sales growth of 11.8%. This performance along with its meaningful buildout of new restaurants suggest it’s playing some aggressive offense.\nIn the latest quarter, CAVA’s same-store sales rose 2.1% year on year. This was a meaningful deceleration from its historical levels. We’ll be watching closely to see if CAVA can reaccelerate growth.\n7. Gross Margin & Pricing Power\nCAVA has great unit economics for a restaurant company, giving it ample room to invest in areas such as marketing and talent to grow its brand. As you can see below, it averaged an excellent 37.6% gross margin over the last two years. Said differently, roughly $37.57 was left to spend on selling, marketing, and general administrative overhead for every $100 in revenue.\nCAVA produced a 39% gross profit margin in Q2, in line with the same quarter last year. Zooming out, the company’s full-year margin has remained steady over the past 12 months, suggesting its input costs (such as ingredients and transportation expenses) have been stable and it isn’t under pressure to lower prices.\n8. Operating Margin\nCAVA was profitable over the last two years but held back by its large cost base. Its average operating margin of 4.1% was weak for a restaurant business. This result is surprising given its high gross margin as a starting point.\nOn the plus side, CAVA’s operating margin rose by 1.7 percentage points over the last year, as its sales growth gave it operating leverage.\nThis quarter, CAVA generated an operating margin profit margin of 7%, in line with the same quarter last year. This indicates the company’s cost structure has recently been stable.\n9. Cash Is King\nAlthough earnings are undoubtedly valuable for assessing company performance, we believe cash is king because you can’t use accounting profits to pay the bills.\nCAVA has shown decent cash profitability, giving it some flexibility to reinvest or return capital to investors. The company’s free cash flow margin averaged 3.2% over the last two years, slightly better than the broader restaurant sector.\nTaking a step back, we can see that CAVA’s margin expanded by 3.3 percentage points over the last year. This is encouraging, and we can see it became a less capital-intensive business because its free cash flow profitability rose more than its operating profitability.\nCAVA’s free cash flow clocked in at $21.9 million in Q2, equivalent to a 7.8% margin. The company’s cash profitability regressed as it was 1.9 percentage points lower than in the same quarter last year, but it’s still above its two-year average. We wouldn’t read too much into this quarter’s decline because investment needs can be seasonal, causing short-term swings. Long-term trends carry greater meaning.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nAlthough CAVA has shown solid business quality lately, it struggled to grow profitably in the past. Its five-year average ROIC was negative 8.7%, meaning management lost money while trying to expand the business.\n11. Balance Sheet Assessment\nOne of the best ways to mitigate bankruptcy risk is to hold more cash than debt.\nCAVA is a profitable, well-capitalized company with $290.2 million of cash and no debt. This position is 3.1% of its market cap and gives it the freedom to borrow money, return capital to shareholders, or invest in growth initiatives. Leverage is not an issue here.\n12. Key Takeaways from CAVA’s Q2 Results\nWe enjoyed seeing CAVA beat analysts’ EBITDA expectations this quarter. We were also glad its EPS outperformed Wall Street’s estimates. On the other hand, its same-store sales missed and its full-year EBITDA guide fell short. Overall, this was a weaker quarter. The stock traded down 22% to $65.98 immediately following the results.\n13. Is Now The Time To Buy CAVA?\nUpdated: August 12, 2025 at 4:25 PM EDT\nBefore deciding whether to buy CAVA or pass, we urge investors to consider business quality, valuation, and the latest quarterly results.\nWe think CAVA is a good business. To kick things off, its revenue growth was exceptional over the last four years. And while its projected EPS for the next year is lacking, its marvelous same-store sales growth is on another level. On top of that, its new restaurant openings have increased its brand equity.\nCAVA’s P/E ratio based on the next 12 months is 137x. At this valuation, there’s a lot of good news priced in. Add this one to your watchlist and come back to it later.\nWall Street analysts have a consensus one-year price target of $109.57 on the company (compared to the current share price of $65.98)."
    }
  ],
  "argos_summary": "CAVA (NYSE:CAVA) reported Q2 CY2025 results with a 20.2% year-on-year revenue growth to $280.6 million, although it fell short of Wall Street's expectations. The company's non-GAAP profit of $0.16 per share exceeded estimates, but its EBITDA guidance for the year was below analyst forecasts. CAVA continues to expand, operating 398 locations, and analysts project a 22% revenue growth over the next year, despite a slight deceleration from previous years.",
  "argos_id": "UW8CQG2VF"
}