{
  "url": "https://finance.yahoo.com/news/eden-gainful-join-forces-support-183700313.html",
  "authorsByline": "PR Newswire",
  "articleId": "9de615808fe745c6af909c7901854ebb",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/ef847378b486055868d8f0f75eec87f4",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:37:00+00:00",
  "addDate": "2025-08-12T18:45:36.448252+00:00",
  "refreshDate": "2025-08-12T18:45:36.448254+00:00",
  "score": 1.0,
  "title": "Eden and Gainful® Join Forces to Support the GLP-1 Journey With Personalized Nutrition",
  "description": "Eden, the health platform that connects members with independent, licensed providers for personalized health care, today announced a partnership with Gainful, the leader in clean, personalized performance nutrition. The collaboration unites Eden's provider-led treatment ecosystem with Gainful's customizable protein, hydration and gut-health formulas, creating an end-to-end experience designed specifically for individuals approved by licensed providers to use GLP-1-based therapies.",
  "content": "Collaboration launches integrated pathway pairing licensed-provider GLP-1 programs with personalized protein, hydration and greens bundles for comprehensive metabolic support.\n\nDENVER, Aug. 12, 2025 /PRNewswire/ -- , the health platform that connects members with independent, licensed providers for personalized health care, today announced a partnership with , the leader in clean, personalized performance nutrition. The collaboration unites Eden's provider-led treatment ecosystem with Gainful's customizable protein, hydration and gut-health formulas, creating an end-to-end experience designed specifically for individuals approved by licensed providers to use GLP-1-based therapies.\n\n\"Members told us they wanted a simple, science-backed way to match their medications with everyday nutrition,\" said Josh Khan, President of Eden \"By weaving Gainful's personalized supplements and on-demand dietitian chat into our provider network, we're empowering people to protect muscle, stay hydrated and feel their best while pursuing sustainable metabolic health.\"\n\nGainful's new GLP-1supplementation bundle, featuring Lean Protein, Electrolytes, Daily Greens and Gut-Health Performance Boost, addresses common needs such as muscle preservation, electrolyte balance and digestive comfort. Eden members who initiate or maintain GLP-1 treatment through Eden's licensed clinicians will receive exclusive access to these products, plus tailored guidance from both Gainful registered dietitians and Eden nutritional educators.\n\nJahaan Ansari, Founder of Gainful, added, \"Our mission has always been to make science-backed customizable performance nutrition accessible to everyone. Partnering with Eden lets us extend that promise to a fast-growing community that deserves coordinated medical and nutritional support.\"\n• Integrated Assessment. Eden's onboarding now offers an optional Gainful nutrition quiz, pre-filled with GLP-1-specific questions, to generate a personalised supplement plan alongside the member's clinical evaluation.\n• Co-Branded Bundles & Fulfilment. Qualifying Eden members can add Gainful GLP-1 bundles to their monthly treatment shipments for seamless doorstep delivery.\n• Dual-Expert Support. Members gain complimentary nutrition guidance from Gainful plus follow-up consults with Eden-connected providers to fine-tune dosing, protein targets and lifestyle habits.\n• Education Hub. A new content series, \"Fueling Your GLP-1 Journey,\" will be published across both brands, featuring practical tips from Eden's Nutritional Educator Joe Ghafari and Gainful's Science Advisory Board.",
  "medium": "Article",
  "links": [
    "https://c212.net/c/link/?t=0&l=en&o=4486953-1&h=3960505048&u=https%3A%2F%2Fwww.tryeden.com%2Flp%2Fgainful&a=Eden",
    "https://c212.net/c/link/?t=0&l=en&o=4486953-1&h=2519389431&u=https%3A%2F%2Fgainful.com%2Fpages%2Feden&a=Gainful"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gainful GLP-1 bundles",
      "weight": 0.11511966
    },
    {
      "name": "Eden members",
      "weight": 0.09809961
    },
    {
      "name": "Qualifying Eden members",
      "weight": 0.09258092
    },
    {
      "name": "Gainful",
      "weight": 0.08885378
    },
    {
      "name": "Personalized Nutrition",
      "weight": 0.08383074
    },
    {
      "name": "Eden",
      "weight": 0.08259252
    },
    {
      "name": "Eden nutritional educators",
      "weight": 0.08205818
    },
    {
      "name": "licensed providers",
      "weight": 0.08052654
    },
    {
      "name": "personalized health care",
      "weight": 0.08010943
    },
    {
      "name": "GLP-1",
      "weight": 0.07795228
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.89599609375
    },
    {
      "name": "/News/Health News",
      "score": 0.7939453125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.62744140625
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.48388671875
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.43310546875
    }
  ],
  "sentiment": {
    "positive": 0.5847115,
    "negative": 0.036477823,
    "neutral": 0.37881067
  },
  "summary": "Eden Health Platform, a health platform connecting members with independent, licensed providers for personalized health care, has partnered with Gainful, the leader in clean, personalized performance nutrition. The collaboration unites Eden's provider-led treatment ecosystem with Gain's customizable protein, hydration and gut-health formulas, designed for individuals approved by licensed providers to use GLP-1-based therapies. The partnership includes an integrated assessment, co-branded Bundles & Fulfilment, complimentary nutrition guidance from Gainful and follow-up consults with Eden-connected providers to fine-tune dosing, protein targets and lifestyle habits.",
  "shortSummary": "Eden and Gainful's partnership integrates comprehensive GLP-1 treatment with personalized performance nutrition bundles, providing comprehensive nutrition and hydration support for patients.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "592b901b18c046879c7d39b52daa9fc9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4486953-1&h=2519389431&u=https%3A%2F%2Fgainful.com%2Fpages%2Feden&a=Gainful",
      "text": "Hooray! You just scored free shipping.\nDr. Holland Chen, MD,\nChief Medical Innovation Officer,\nEden\nFor many, it's tied to medical conditions that make traditional methodsless effective. Prescription medication can help address these underlyingissues. Your journey to better health is unique, and Eden is here to supportyou every step of the way to make real progress toward your health goals.”\nDr. Rebecca Emch\nVP of Pharmacy Operations,\nEden\nTake the first step and Join 75,000+ members supporting their fitness and wellness goals.*\nIf you’re exploring GLP-1 treatment options but aren’t sure where to start, Eden can help connect you with independent, licensed healthcare providers for a medical evaluation. These providers can assess your eligibility for GLP-1-based medications, available in oral or injectable forms, and prescribe them if appropriate through state-licensed pharmacies.\nAccess same-day, online consultations to review your health profile and discuss whether a GLP-1 medication, such as semaglutide, injectable or oral, may be an option for you.\nOur clean supplements help you maintain energy, preserve muscle, and feel your best throughout your journey.\nBoth Eden and Gainful provide ongoing coaching, monitoring, and education. You're never alone in this.\nFixed, transparent pricing with no contracts, hidden fees, or insurance barriers. Just patient-first care at every stage.\nGLP-1s are good tools to support weight management, but you may notice changes in appetite or eating habits. While Gainful products aren't designed to treat or prevent any effects of medication, their GLP-1 Starter Pack was created to help support general wellness goals like staying hydrated, getting enough protein, and maintaining a nutrient rich diet, especially when your routine changes.\nPrevent fatigue, dizziness, and muscle cramps, common with reduced food and water intake.\nMaintain muscle and metabolism with science-backed daily protein.\nEase constipation and bloating with clinically effective prebiotic fiber and probiotics.\nSupport immunity, energy, and nutrient balance, without overwhelming your stomach."
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4486953-1&h=3960505048&u=https%3A%2F%2Fwww.tryeden.com%2Flp%2Fgainful&a=Eden",
      "text": "Personalized weight care meets performance nutrition\nYour wellness routine just got smarter\nEden and Gainful have partnered to bring together personalized care and focused nutrition for metabolic support, personalized to your goals and grounded in science.\nExclusive Offer for Gainful Members - Up to $120 OFF* your first month*\nPersonalized GLP-1 care starts now\nAccess to FDA-approved medications such as Ozempic®, Wegovy®, Zepbound® and other GLP-1 medications.*\nLose up to 20% of your weight with the help of diet and exercise.*\nNo insurance required. FSA/HSA eligible. 100% online.\nEden is a platform through which you may connect with independent, licensed healthcare providers. Eden does not manufacture or make medications. You must undergo a medical evaluation for any medication. Eligibility is not guaranteed. Pricing structure subject to change.\nGLP-1 Treatments\nPersonalized doctor-led plans starting at $156 first month* for Gainful members\n$120 OFF\nMy Custom Weight Loss Kit\nWeight loss and appetite support starting at $34 first month* for Gainful members\n$15 OFF\nPrescription weight loss, made simple\nSubmit your application and meet with a doctor\nStep 3\nComplete a form and meet with a licensed medical provider 100% online to determine if a personalized treatment plan is right for you.\nGet your medication delivered at home\nStep 3\nIf eligible, your custom prescription will be shipped directly to your door, fast and free.\nLose weight with 24/7 support and ongoing care\nStep 3\nWe’ll be with you every step of the way, with regular check-ins and on-demand medical support.\nEden members gained nothing but power\n29\nlbs\nAverage Eden member\nweight loss in the first six months\nBased on self reported data from 111 Eden members while on GLP-1 injections, while combined with diet and exercise\n98\n%\nEden members that\nreported weight loss\nduring treatment\nBased on self reported data from 4,633 members enrolled in Eden’s personalized weight loss programs.\n91\n%\nEden members that\nrecommend treatments to friends and family\nBased on self reported data from 4,633 members enrolled in Eden’s personalized weight loss programs.\nGLP-1 treatments have been clinically shown to*\nReset your metabolism and burn more calories\nHelp lower your blood pressure\nHelp lower your cholesterol\nStop food noise and reduce cravings\nHelp improve your blood sugar\n*Along with a reduced calorie diet and increased exercise. Based on two separate Wegovy® clinical studies. In a 68-week study, about 1 in 3 adults with obesity or overweight and weight-related conditions achieved 20% weight loss. Average weight loss achieved was 15%. In a 104-week study, mean weight loss achieved at 2 years was 15.2% vs. 2.6% for placebo. Individual results may vary. Stopping treatment may result in weight regain.\n**Wegovy® is indicated to treat weight loss, but also has been shown to improve blood pressure, cholesterol, or blood glucose levels.\n**Wegovy® is indicated to treat weight loss, but also has been shown to improve blood pressure, cholesterol, or blood glucose levels.\nClean, simple, and effective\nYour health and well-being are our absolute top priority. That is why we never avoid any effort to ensure you get the best treatment every time, starting from day one.\n- Cruelty\nFree - Eco\nFriendly - Paraben\nFree - Silicone\nFree - Sulphate\nFree - Gluten\nFree\nEvery Eden weight loss plan includes\n- Free, same-day consultation, 100% online, no in-person visits required\n- Access to GLP-1 medications, if prescribed\n- Transparent, upfront pricing with no memberships or hidden fees\n- Plus exclusive access to:\n- Community chat\n- Cooking classes\n- Nutritional coaching\n- On-demand workouts\nYou're not alone\n75,000+ members\nhave already started this journey\nPaid endorsement. Individual results vary. These experiences are personal and may not be typical. No claims verified.\nFrequently asked questions\nWhat is Eden and why is Gainful partnering with them?\nDo I have to stop using Gainful products while on GLP‑1s or can I continue?\nHow is this different from other weight loss programs or clinics?\nWhat is Eden's \"Same Price at Every Dose\" guarantee?\nHow long does it take to start seeing results?\nCan I use a GLP-1 with pre-existing medical conditions?\nWhat weight loss treatment options are available to me?\nWhat’s included with my plan?\nCan my provider adjust my medication or dosage if I’m not seeing results?\nIs a long-term commitment necessary?\nWhat if I get side effects?\nWho are the providers at Eden?\nWhat pharmacies do you work with?\nAre in-person visits required?\nDo your plans include prescriptions and medications?\nDo you take insurance?"
    }
  ],
  "argos_summary": "Eden has partnered with Gainful to create an integrated health platform that combines licensed-provider GLP-1 programs with personalized nutrition bundles, including protein, hydration, and greens. This collaboration aims to provide comprehensive metabolic support for individuals using GLP-1 therapies, offering tailored supplements and expert guidance from dietitians. Members can access customized nutrition plans, co-branded product bundles, and ongoing support to enhance their health journey.",
  "argos_id": "UZ0S4SLCR"
}