{
  "url": "https://www.yahoo.com/news/articles/youth-activists-sound-off-experts-214500491.html",
  "authorsByline": "Yei Ling Ma",
  "articleId": "1bca03781b834beab774c91eede71d79",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/2578fcb0d654138ddf68c80d4a249d6b6ce97cef3490ed3ac3ca0186100d8ba4/ynews/resizefill_w1200/https://media.zenfs.com/en/the_cool_down_737/4e29a444d32418b3fe8bdd53fec76c2a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:45:00+00:00",
  "addDate": "2025-08-12T22:19:20.547488+00:00",
  "refreshDate": "2025-08-12T22:19:20.547489+00:00",
  "score": 1.0,
  "title": "Youth activists sound off on expert's dire prediction about worsening global crisis: 'There is hope'",
  "description": "\"It's not a binary.\"",
  "content": "In an exclusive interview with CBC's On the Coast, two youth activists responded to Canadian environmentalist David Suzuki's recent remarks about the fight against climate change.\n\nSuzuki told the digital news outlet iPolitics in early July, \"I've never said this before to the media, but it's too late.\"\n\nOn the Coast host Gloria Macarenko invited two young climate activists to share their thoughts on Suzuki's seemingly dejected claim.\n\nCBC youth columnist Aishwarya Puttur and Canada's youth delegate to the 2025 United Nations High-Level Political Forum, Lily YangLiu, both rejected the hopelessness that many took from Suzuki's comments.\n\n\"I do agree that there are irreversible consequences that we will be facing. But I always, always, always believe that there is always time and there is hope to ensure that these consequences are not as devastating as they will be if we were to do nothing,\" said Puttur in the mid-July panel discussion.\n\n\"For me, climate change — it's not a binary. There's no single point where we either survive or collapse. … Every single degree counts,\" YangLiu said.\n\nLowering the planet's warming by even one or two degrees could translate into tangible, real-world impacts, YangLiu said, including preventing millions of people from experiencing extreme heat.\n\nIt may be hard to stay positive about climate progress given the severity of the environmental, health, and economic consequences that scientists project. But this may also be made more difficult by a culture of growing skepticism and despair.\n\nSuzuki has since clarified that he hasn't given up the fight himself. But, for his part, he's now prioritizing community action over governments.\n\n\"Do we just give up? No,\" he told CBC in his own mid-July interview. \"Get together with your local block or your series of blocks and start finding out who's going to need help in an emergency.\"\n\nThe climate optimism of younger generations, together with the experience of elders long devoted to the climate fight, may well be just the fuel to keep changemakers motivated to combat rising global temperatures.\n\nWhile individual and local efforts to tackle Earth's intensifying weather events are important, YangLiu still emphasizes that effective solutions may require government action and meaningful policy change.\n\nClimate conversations must involve the world's biggest polluters — businesses and industries — she says, as well as the voices of young people, who will live with the outcome of today's decisions.\n\nJoin our free newsletter for good news and useful tips, and don't miss this cool list of easy ways to help yourself while helping the planet.",
  "medium": "Article",
  "links": [
    "https://www.ipolitics.ca/2025/07/02/its-too-late-david-suzuki-says-the-fight-against-climate-change-is-lost/",
    "https://www.thecooldown.com/future-newsletter/?rec9bBsF09VCV97kf",
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=2&article=rec9bBsF09VCV97kf",
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=4&article=rec9bBsF09VCV97kf",
    "https://guide.thecooldown.com/actions/take-local-action/",
    "https://rb.gy/ivhzmj",
    "https://www.cbc.ca/news/science/david-suzuki-climate-change-1.7582418",
    "https://www.cbc.ca/player/play/video/9.6831667",
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=3&article=rec9bBsF09VCV97kf",
    "https://guide.thecooldown.com/recording-votes/do-you-think-america-does-a-good-job-of-protecting-its-natural-beauty/?answer=1&article=rec9bBsF09VCV97kf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "climate change",
      "weight": 0.08062531
    },
    {
      "name": "climate progress",
      "weight": 0.07847961
    },
    {
      "name": "Climate conversations",
      "weight": 0.076112464
    },
    {
      "name": "CBC youth columnist Aishwarya Puttur",
      "weight": 0.07398229
    },
    {
      "name": "Youth activists",
      "weight": 0.07296359
    },
    {
      "name": "mid-July",
      "weight": 0.070428416
    },
    {
      "name": "young people",
      "weight": 0.06998972
    },
    {
      "name": "Lily YangLiu",
      "weight": 0.06887163
    },
    {
      "name": "David Suzuki",
      "weight": 0.06718933
    },
    {
      "name": "YangLiu",
      "weight": 0.06387443
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Environment"
    },
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.93701171875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.93115234375
    },
    {
      "name": "/News/Other",
      "score": 0.814453125
    },
    {
      "name": "/Science/Ecology & Environment/Climate Change & Global Warming",
      "score": 0.64453125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.6376953125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.323974609375
    }
  ],
  "sentiment": {
    "positive": 0.10244133,
    "negative": 0.58093673,
    "neutral": 0.3166219
  },
  "summary": "Two youth activists, Aishwarya Puttur and Lily YangLiu, have responded to Canadian environmentalist David Suzuki's prediction of a worsening global crisis by stating that there is still hope in the fight against climate change. Despite the dire predictions, these activists believe that there are still time and hope to prevent irreversible consequences from occurring. They also highlighted the potential value of lower global warming by even one or two degrees, which could significantly reduce the number of people suffering from extreme heat. Despite this, Suzuki clarified that he hasn't given up on the fight but is prioritizing community action over governments.",
  "shortSummary": "Two young climate activists, including Aishwarya Puttur and Lily YangLiu, defended David Suzuki's pessimistic remarks on climate change, emphasizing the need for community action and sustained efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d1cbc5150f6b4c6c96b93a6809a51490",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cbc.ca/news/science/david-suzuki-climate-change-1.7582418",
      "text": "No, David Suzuki hasn't given up on the climate fight — but his battle plan is changing\nEnvironmentalist says the movement now needs to focus on local community action\nCanadian environmentalist David Suzuki made headlines last week when he said in an interview with iPolitics that humanity has lost its fight against climate change.\n\"We're in deep trouble,\" Suzuki told the outlet. \"I've never said this before to the media, but it's too late.\"\nThough he made it clear that he hasn't entirely given up, Suzuki says that rather than getting caught up in trying to force change through legal, political and economic systems, we now need to focus on community action.\n'We've passed too many boundaries'\n\"I look at what the straight science says and that is that we've passed too many boundaries,\" said Suzuki in an interview with CBC News on Monday.\n\"It's going to get hotter, there's going to be floods, and all kinds of other things that we can't predict at this point,\" he said. \"As the temperature rises, even half a degree to a degree warmer, the repercussions ecologically are going to be immense.\"\nSuzuki says he goes by Johan Rockström's work with the Potsdam Institute for Climate Impact Research to define nine planetary boundaries, or safe limits, for human pressure on certain critical processes.\nDuring an interview with CBC in June about deep-sea mining, Rockström discussed how humanity is approaching tipping points when it comes to climate change.\n\"We have more and more scientific evidence that we are pushing these systems to the brink of potential collapse,\" he said.\nSuzuki says that we passed the seventh boundary this year and are now in the extreme danger zone, noting that Rockström says we have five years to get out of it.\nAccording to Suzuki, it's not likely we'll be able to pull back on these boundaries within five years.\n\"It's crystal clear: we're going to overshoot.\"\nFor example, there have been 12 consecutive months where temperatures warmed 1.5 C above pre-industrial levels — the threshold set by scientists to avoid some of the worst impacts of climate change.\n\"And that was the level we were supposed to reach by 2100,\" said Suzuki, noting that we haven't capped emissions and they continue to climb.\n\"At some point, you have to say, we're not going to do it.\"\nWhy Suzuki has given up on politics\nClimate advocates have long said that one of the biggest things people can do to impact climate change is to vote, contact politicians and get involved.\nBut now, Suzuki says he's changing his advice to environmental advocates. He says he hasn't given up on finding solutions, just on waiting for governments and institutions to take meaningful action.\n\"It's an unpredictable world that we're heading to, and so much of our efforts in the environmental movement have been spent on assuming that politicians are going to take the right steps,\" he said.\nAs an example, he recalls approaching an MP at a fundraiser gala for his non-profit environmental foundation. Suzuki says he believed the MP understood the severity of the climate crisis and urged him to reach out across party lines to take action because climate change couldn't remain political.\nBut he says the MP responded by saying he was worried about the next election.\n\"And I said, 'Are you saying that you're not going to do what should have been done years ago that must be done immediately because of the political possibility that you'll lose the next election?' \" Suzuki recalled.\n\"And he said, 'Yeah, that's politics — politics prevents you from doing the right thing.' \"\nFocus on community and resilience\nHaving abandoned politics as a solution, Suzuki says he's turning to community.\n\"Do we just give up? No,\" he said. \"Get together with your local block or your series of blocks and start finding out who's going to need help in an emergency.\"\nSuzuki says the Kitsilano neighbourhood in Vancouver where he's lived for 50 years is having a block party next week that he hopes will help combat the isolation and loneliness he says will be major challenges for what lies ahead.\nThere are other places in Canada that are also prioritizing community.\nThe town of Lytton, B.C., is still rebuilding after a 2021 wildfire destroyed most of its homes and businesses. Part of their rebuilding plan includes a Community Hub project.\n\"We're calling it a hub because we plan to have a number of services within that building … and an outdoor space like a covered festival, farmers market multi-purpose space as well,\" Lytton Mayor Denise O'Connor told CBC News.\nThe community hub will be net zero and will also have climate resilience built in, with a swimming pool that can double as a water reservoir.\nSuzuki says this kind of community resilience will be key.\n\"Mother Nature is going to come down so hard that we're going to have to face up to the big changes, but I'm saying to environmental groups now, 'focus on the local community, get them to be as self-sufficient and self-reliant as you can possibly be,' \" he said.\n\"The science says that we're done for, but I'm saying at least the time that we've got left, let's fight like mad to be as resilient as we can in the face of what's coming.\"\nCorrections\n- A previous version of this story said that Earth surpassed the Paris Agreement threshold of 1.5 C of warming above pre-industrial levels. In fact, Earth experienced 12 months where temperatures warmed 1.5 C, but that timeframe doesn't necessarily mean failure of the Paris Agreement goal.Jul 11, 2025 10:16 AM EDT"
    },
    {
      "url": "https://rb.gy/ivhzmj",
      "text": "TCD\nMarketplace\nYour go-to resource for helping yourself while\nhelping the planet💡\nMarketplace Spotlight\n💡Connect with these trusted partners to save more, waste less, and upgrade your life\nAt The Cool Down, we're all about making it easy to help yourself while helping the planet.\nThe lifestyle solutions we've curated here feature partners we've vetted across a wide range of everyday activities — everything from the way you power your home to the way you buy your food to the way you get rid of your old stuff. Check out the list below, and don't miss the TCD Guide for a deep dive into all the smart choices you can make for yourself and your family.\nPS: We regularly add new partners to our marketplace, so be sure to sign up for alerts below, and please drop us a line at hello@thecooldown.com if you have specific problems you're trying to solve.\nJump to...\n🏠 Upgrade your home and lower your bills\n🍔 Eat better food and save money on groceries\n💸 Declutter your life and make money on your stuff\n🏠 Upgrade your home and lower your bills\nThanks to massive tax credits and rapid innovation, it's never been cheaper or easier to cut your utility bills by upgrading your home and using less energy. Here's how to get started:\n✅ Rewiring America can help you make sense of all the tax incentives available to you.\n✅ EnergySage makes it easy to save thousands on home solar by comparing quotes from trusted installers — and depending on where you live, they can help you save big on a heat pump or take advantage of community solar too.\n✅ Duxtop offers a sleek, affordable induction burner that lets you try the hottest, healthiest cooking technology without tearing out your old stove.\nMore from the TCD Guide\n🍔 Eat better food and save money on groceries\nGrocery bills are officially out of control these days, but there are more options than ever before to save money on delicious food and contribute to waste reduction along the way. These are our favorites:\n✅ Flashfood's free app makes it easy to browse for massive deals at local grocery stores on fresh food that's nearing its expiration date.\n✅ Too Good To Go's free app lets you pick up surprise bags of extra food from local restaurants at ridiculous discounts.\n✅ Martie and Misfits Market both give you ultra-convenient options for steep discounts on home deliveries.\nMore from the TCD Guide\n💸 Declutter your life and make money on your stuff\nIf you're like us, you probably have a closet (or closets) full of old stuff you need to get rid of but feel bad about trashing. Fortunately, the circular revolution means there are plenty of ways to give your stuff a second life and make money in the process:\n✅ GotSneakers will pay you cash every time you send in a free bag of your old shoes.\n✅ Trashie's convenient Take Back Bag can handle everything from clothes to shoes to towels to sheets — and earns you $30 in rewards every time you use it.\n✅ For that junk drawer full of old electronics, Walmart, Best Buy, Target, Costco, and Apple will all give you store credit when you bring in old devices."
    }
  ],
  "argos_summary": "In response to David Suzuki's recent comments about the climate crisis, youth activists Aishwarya Puttur and Lily YangLiu expressed a belief in the possibility of positive change despite the challenges ahead. They emphasized the importance of community action and resilience, arguing that even small reductions in global warming can have significant impacts. Suzuki, while acknowledging the severity of the situation, has shifted his focus from political solutions to local community efforts, urging individuals to prepare for the future by fostering self-sufficiency and collaboration.",
  "argos_id": "UZQQT63DN"
}