{
  "url": "https://www.marketwatch.com/story/agl-energy-shares-drop-12-on-annual-profit-guidance-miss-8a1d99a3",
  "authorsByline": "",
  "articleId": "e28b1ae98cee482aa90d2dee03b35fbc",
  "source": {
    "domain": "marketwatch.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:32:00+00:00",
  "addDate": "2025-08-13T00:37:25.375335+00:00",
  "refreshDate": "2025-08-13T00:37:25.375337+00:00",
  "score": 1.0,
  "title": "AGL Energy Shares Drop 12% on Annual Profit, Guidance Miss",
  "description": "AGL Energy Shares Drop 12% on Annual Profit, Guidance Miss",
  "content": "SYDNEY--Power producer AGL Energy's share price declines sharply after its annual profit and outlook fell short of consensus expectations, putting it on course for its lowest close since April 2024.\n\nAGL stock dropped 12% to A$9.00 within minutes of Australia's share market opening on Wednesday, wiping more than 600 million Australian dollars, equivalent to $392 million, off its valuation.\n\nAGL reported an underlying net profit of A$640 million for the 12 months through June, undershooting consensus expectations by some 5%. Barrenjoey said the miss reflected weak earnings from AGL's Integrated Energy business after the Bayswater and Loy Yang power plants experienced planned and unexpected outages.\n\nAGL's forecast of an underlying net profit of A$500 million to A$700 million in fiscal 2026 also left the market unimpressed. Jefferies said the midpoint of the range is some 11% below market expectations of A$670.8 million ahead of the company's result. It attributed the miss to higher-than-anticipated depreciation and amortization, along with finance costs.\n\nStill, AGL expects an improvement in earnings before interest, tax, depreciation and amortization in the new fiscal year. It forecast annual Ebitda of A$1.92 billion to A$2.22 billion, which would represent an on-year rise of 3% at the midpoint of the range.\n\n\"While FY 2026 will still be a year of growth in Ebitda terms, the lower net profit guidance is the area of concern, particularly if the market remains of the view that management will be unable to offset the headwinds of recontacting gas and coal in 2027,\" Jefferies analyst Anthony Moulder says.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AGL Energy Shares",
      "weight": 0.111757785
    },
    {
      "name": "Annual Profit",
      "weight": 0.10703736
    },
    {
      "name": "AGL Energy",
      "weight": 0.103374355
    },
    {
      "name": "market expectations",
      "weight": 0.09912399
    },
    {
      "name": "AGL stock",
      "weight": 0.08782797
    },
    {
      "name": "AGL",
      "weight": 0.085402936
    },
    {
      "name": "annual Ebitda",
      "weight": 0.08396652
    },
    {
      "name": "consensus expectations",
      "weight": 0.082573794
    },
    {
      "name": "Integrated Energy",
      "weight": 0.07765667
    },
    {
      "name": "Jefferies analyst Anthony Moulder",
      "weight": 0.076306164
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.95703125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.91748046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.845703125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.408935546875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.362060546875
    }
  ],
  "sentiment": {
    "positive": 0.022521855,
    "negative": 0.90580326,
    "neutral": 0.07167486
  },
  "summary": "AGL Energy's share price has dropped 12% after its annual profit and outlook fell short of consensus expectations. The company reported an underlying net profit of A$640 million for the 12 months through June, which exceeded expectations by 5%. The miss was attributed to weak earnings from AGL's Integrated Energy business following unexpected outages at two power plants. AGL also forecasted a net profit forecast for A$500 million to A$700 million in fiscal 2026, which is 11% below market expectations. However, the company expects an improvement in earnings before interest, tax, depreciation and amortization in the new fiscal year.",
  "shortSummary": "AGL Energy's share price dropped 12% after annual profit and outlooks missed expectations, with investors concerned about weak earnings from its Integrated Energy business.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "180858dfe77f4a34960836e1a59694fb",
  "places": [
    {
      "osmId": "11692892",
      "state": "Victoria",
      "postcode": "3844",
      "country": "Australia",
      "countryCode": "au",
      "coordinates": {
        "lat": -38.2496425,
        "lon": 146.57932678823602
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "AGL Energy's share price fell 12% to A$9.00 after the company reported an annual profit of A$640 million, which was 5% below market expectations. The decline was attributed to weak earnings from its Integrated Energy business due to outages at key power plants. Additionally, AGL's profit forecast for fiscal 2026, ranging from A$500 million to A$700 million, disappointed investors, as it was 11% below prior market estimates. Despite this, AGL anticipates a rise in earnings before interest, tax, depreciation, and amortization (Ebitda) for the upcoming fiscal year.",
  "argos_id": "V3HZNA77H"
}