{
  "url": "https://thehill.com/homenews/5449332-vaccine-misinformation-blamed-for-fatal-cdc-shooting/",
  "authorsByline": "Joseph Choi, Alejandra O'Connell-Domenech, Nathaniel Weixel",
  "articleId": "2ea02745e4734f8c8f9fda0d6c816c39",
  "source": {
    "domain": "thehill.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://thehill.com/wp-content/uploads/sites/2/2024/09/AP22293644415042-e1727201908801.jpg?w=1280",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:51:07+00:00",
  "addDate": "2025-08-12T22:55:20.191815+00:00",
  "refreshDate": "2025-08-12T22:55:20.191816+00:00",
  "score": 1.0,
  "title": "Vaccine misinformation blamed for fatal CDC shooting",
  "description": "Click in for more news from The Hill{beacon} Health Care Health Care   The Big Story  Vaccine misinformation blamed for fatal CDC shooting  A prominent federal employee union and fo…",
  "content": "A prominent federal employee union and former health leaders are blaming the rise of vaccine information for fueling the fatal shooting at the Atlanta headquarters of the Centers for Disease Control and Prevention (CDC) last week. Georgia law enforcement officials confirmed during a Tuesday press conference that 500 shots were fired and about 200 rounds struck six different CDC buildings. Though no employees were hurt, DeKalb County police officer David Rose was fatally shot. The alleged shooter, Patrick White, died of a self-inflicted gunshot wound. Authorities said they found documentation in his house expressing his discontent with the COVID-19 vaccinations. Chris Hosey, director of the Georgia Bureau of Investigation, said the content of the documents was more about making the public aware of his distrust of the vaccine, though no direct threats were made. The American Federation of Government Employees (AFGE) union called out vaccine misinformation for putting agency staffers at risk. In a statement following the shooting, AFGE Local 2884 demanded a “clear and unequivocal stance in condemning vaccine disinformation by CDC and HHS leadership.” “Their leadership is critical in reinforcing public trust and ensuring that accurate, science-based information prevails. This condemnation is necessary to help prevent violence against scientists that may be incited by such disinformation,” the organization said. Former U.S. Surgeon General Jerome Adams, who served during President Trump’s first term, echoed these sentiments. In an op-ed for Stat, Adams said the shooting was a reflection of threats to public health workers brought on by a climate of “misinformation, politicization, and inflammatory rhetoric.” Health Secretary Robert F. Kennedy Jr., who Adams criticized for being slow to respond to the shooting, was not named by the AFGE, but has long spread vaccine misinformation. During an interview with Scripps News this week, he defended his decision to end funding for mRNA shots and reiterated his concerns about coronavirus vaccine injuries. When asked directly about a plan to quell misinformation and prevent something like the CDC shooting from happening again, Kennedy deflected any direct link. “We don’t know enough about what the motive was of this individual, but people can ask questions without being penalized,” Kennedy said, before criticizing the federal government’s messaging about the coronavirus vaccine. Kennedy previously criticized CDC during his unsuccessful presidential campaign, calling it a “cesspool of corruption” in a post on X, saying he would “force the public health agencies to come clean about Covid vaccines.” During his Scripps interview, Kennedy sounded a different tone. “They work in silence, saving us all and protecting our health. They should not be the targets of this kind of violence from anybody,” Kennedy said. Welcome to The Hill’s Health Care newsletter, we’re Nathaniel Weixel, Joseph Choi and Alejandra O’Connell-Domenech — every week we follow the latest moves on how Washington impacts your health. Did someone forward you this newsletter? Subscribe here.",
  "medium": "Article",
  "links": [
    "https://x.com/RobertKennedyJr/status/1767176567678017604?email=467cb6399cb7df64551775e431052b43a775c749&emaila=12a6d4d069cd56cfddaa391c24eb7042&emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&utm_source=Sailthru&utm_medium=email&utm_campaign=08.12.25%20Health%20Care%20JC",
    "https://www.scrippsnews.com/health/rfk-jr-in-interview-with-scripps-news-trusting-the-experts-is-not-science?email=467cb6399cb7df64551775e431052b43a775c749&emaila=12a6d4d069cd56cfddaa391c24eb7042&emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&utm_source=Sailthru&utm_medium=email&utm_campaign=08.12.25%20Health%20Care%20JC",
    "https://www.afge2883ga.org/post/in-solidarity-after-the-cdc-roybal-shooting?email=467cb6399cb7df64551775e431052b43a775c749&emaila=12a6d4d069cd56cfddaa391c24eb7042&emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&utm_source=Sailthru&utm_medium=email&utm_campaign=08.12.25%20Health%20Care%20JC",
    "https://nxslink.thehill.com/join/7aa/signup"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vaccine misinformation",
      "weight": 0.08975713
    },
    {
      "name": "vaccine misinformation",
      "weight": 0.08975713
    },
    {
      "name": "fatal CDC shooting",
      "weight": 0.08606262
    },
    {
      "name": "vaccine disinformation",
      "weight": 0.07996293
    },
    {
      "name": "vaccine information",
      "weight": 0.07920678
    },
    {
      "name": "coronavirus vaccine injuries",
      "weight": 0.074829265
    },
    {
      "name": "Covid vaccines",
      "weight": 0.07426098
    },
    {
      "name": "public health workers",
      "weight": 0.0737556
    },
    {
      "name": "Health Secretary Robert F. Kennedy Jr.",
      "weight": 0.068798624
    },
    {
      "name": "Robert F. Kennedy Jr.",
      "weight": 0.068270594
    }
  ],
  "topics": [
    {
      "name": "Coronavirus"
    },
    {
      "name": "CDC"
    },
    {
      "name": "Media"
    }
  ],
  "categories": [
    {
      "name": "Health"
    },
    {
      "name": "Politics"
    },
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.93115234375
    },
    {
      "name": "/News/Other",
      "score": 0.76318359375
    },
    {
      "name": "/News/Local News",
      "score": 0.73681640625
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.583984375
    },
    {
      "name": "/News/Health News",
      "score": 0.49755859375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.45068359375
    }
  ],
  "sentiment": {
    "positive": 0.05002984,
    "negative": 0.75963223,
    "neutral": 0.19033794
  },
  "summary": "A prominent federal employee union and former health leaders are blaming the rise of vaccine misinformation for the fatal shooting at the Atlanta headquarters of the Centers for Disease Control and Prevention (CDC). The alleged shooter, Patrick White, died of a self-inflicted gunshot wound. The American Federation of Government Employees (AF) union has called for a clear statement condemning vaccine disinformation by CDC and HHS leadership. Former Surgeon General Jerome Adams, who served during President Trump's first term, echoed these sentiments. Health Secretary Robert F. Kennedy Jr., who has long spread vaccine misinformation, was not named by the AFGE, but has long criticized the CDC.",
  "shortSummary": "A prominent federal employee union and former health leaders blame vaccine misinformation for the fatal shooting of a CDC employee.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b2cd574986884defa333ce2c7a177aee",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.scrippsnews.com/health/rfk-jr-in-interview-with-scripps-news-trusting-the-experts-is-not-science?email=467cb6399cb7df64551775e431052b43a775c749&emaila=12a6d4d069cd56cfddaa391c24eb7042&emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&utm_source=Sailthru&utm_medium=email&utm_campaign=08.12.25%20Health%20Care%20JC",
      "text": "Health and Human Services Secretary Robert F. Kennedy Jr. sat down with Scripps News for a wide-ranging interview, discussing mRNA vaccine funding policy changes, a recent shooting at the Centers for Disease Control and Prevention, federal research funding tied to university compliance, the role of diet in public health, and efforts to protect athletes from brain injuries.\nHalting mRNA vaccine technology funding\nKennedy explained the administration’s decision to cancel millions of dollars in contracts to develop vaccines using mRNA technology. The vaccines were being developed to fight respiratory viruses like COVID-19 and the flu.\nRELATED STORY | RFK Jr. pulls $500 million in funding for vaccine development\nWATCH THE FULL SCRIPPS NEWS INTERVIEW WITH RFK Jr.\nKennedy questioned the effectiveness of the vaccines despite overwhelming scientific research. He also warned against virus mutations and dosage control issues.\n\"You can't control the amount of antigen that everybody is getting,\" he said. \"When you give a vaccine, you want to know exactly how much antigen is because some people react very, very badly and can get very, very badly injured.\"\nKennedy emphasized that the technology is still being researched for cancer treatments, where it may prove effective.\nResponding to criticism from medical experts, Kennedy questioned the reliability of safety data and pointed to \"5,000 peer-reviewed studies\" that point to vaccine-related injuries.\n\"Trusting the experts is not a feature of either a science or democracy,\" Kennedy said.\nHe added, \"There's always questions and we're always encouraged to have them. Science is always evolving.\"\nRELATED STORY | Former CDC director warns 'many people will suffer' from funding cuts to mRNA vaccine development\nCDC shooting and vaccine skepticism\nKennedy addressed Friday's deadly shooting at the CDC in Atlanta, reportedly motivated by COVID-19 vaccine concerns. He expressed condolences to the victims’ families and support for CDC employees.\n“They work in silence, saving us all and protecting our health. They should not be the targets of this kind of violence from anybody,\" Kennedy said.\nKennedy said his priority is ensuring employee safety and restoring public trust by telling the truth, even when he believes scientific uncertainty exists.\nCombating misinformation and public trust\nWhen asked how to prevent violence tied to health misinformation, Kennedy stressed the need for transparency and “Gold Standard\" science.\n“People can ask questions without being penalized,\" Kennedy said.\nHe added, \"The way we make the public believe in us is by telling the truth — what we know and what we don’t know.”\nKennedy criticized past government messaging during the height of the COVID-19 pandemic for what he described as officials overstating certainty, which he believes eroded trust.\nFederal research funding and university compliance\nKennedy discussed the Trump administration’s policy of withholding federal funding from universities accused of not being forceful enough to root out antisemitism or permitting transgender women in women’s sports. Critics say this could harm medical research.\n“Universities that are now being defunded because they’re breaking the law should stop breaking the law, and then they will get that funding,\" he said.\nHe also said research funding should be distributed more widely to avoid centralized control that could stifle scientific dissent.\nHealthy eating and processed foods\nKennedy identified sugar and ultra-processed foods as major threats to public health, citing rising rates of diabetes linked to dietary changes.\n“We are giving the poorest members of our society diabetes when they’re young, and then we’re paying for it later with Medicaid.”\nRELATED STORY | New SNAP rules: Candy and soda no longer covered in additional states\nKennedy added that the federal government will issue dietary guidelines based on public health rather than commercial interests.\nAddressing food deserts\nKennedy acknowledged challenges in underserved areas but argued that “cheap food is an illusion” if it causes long-term health costs. He insisted that public-private partnerships can provide healthy meals at competitive prices.\n\"A Big Mac costs, you know, I think $9 now... You can get high-quality food as we change these rules to incentivize people to buy better food. You're going to see the markets respond, and you're going to see better food going into these food deserts.\"\nProtecting athletes from CTE\nDuring the interview, Kennedy criticized reports about a shooter in New York targeting NFL headquarters because he reportedly believed he had chronic traumatic encephalopathy, also known as CTE.\nRELATED STORY | Shooter who killed 4 in NYC claimed he had CTE, blamed NFL\nKennedy was pressed on whether the government has a plan to protect children or even adults in contact sports.\nKennedy said his department's role is to conduct research and provide data to policymakers and organizations like the NFL.\n\"Our job is not to go out and tell people what they can do or what they cannot do,\" he said. \"It's to give good information, so that groups like the NFL and private groups and public officials can then make good policies that are going to advance the health of the American people.\"\nEditor's Note: A previous version of this article contained an error in a quote, stating \"energy\" instead of \"antigen.\""
    },
    {
      "url": "https://www.afge2883ga.org/post/in-solidarity-after-the-cdc-roybal-shooting?email=467cb6399cb7df64551775e431052b43a775c749&emaila=12a6d4d069cd56cfddaa391c24eb7042&emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&utm_source=Sailthru&utm_medium=email&utm_campaign=08.12.25%20Health%20Care%20JC",
      "text": "In solidarity after the CDC Roybal Shooting\n- AFGE 2883 Executive Committee\n- 3 days ago\n- 4 min read\nUpdated: 2 days ago\nTo our CDC colleagues,\nWe are heartbroken and outraged by the traumatic violence that unfolded yesterday afternoon at CDC’s Roybal Campus, in which DeKalb County Police Officer David Rose was killed in the line of duty while courageously protecting his community and saving lives. We honor his service and will forever remain deeply indebted to his family for his heroism.\nThis tragedy was not random and it compounds months of mistreatment, neglect, and vilification that CDC staff have endured. The deliberate targeting of CDC through this violent act is deeply disturbing, completely unacceptable, and an attack on every public servant. Early reports indicate the gunman was motivated by vaccine disinformation, which continues to pose a dangerous threat to public health and safety.\nSome of you were trapped in various buildings throughout campus well into the late evening hours, including the 90+ children locked down inside CDC's Clifton School. Those of us not directly part of the lockdowns watched in fear for our colleagues as the events unfolded. The terror, the uncertainty, and the trauma of what happened, as well as what could have happened, are still very present. Trauma doesn’t end once the lockdown is lifted.\nAFGE Local 2883 stands with you. We see your fear, anger, and exhaustion. We share it.\nWe are here to defend each other through concrete and comprehensive action. This attack violated our collective safety. We will not accept this as “business as usual,” and temporary fixes won't cut it. You deserve more.\nMany of you are probably asking—what happens next and what will be done? We are, too.\nWe promise this: AFGE Local 2883 will not stop fighting for your safety, your dignity, and your healing.\nWe are committed to advocating for:\nFlexible leave, expanded telework, and remote options for those who need time to process and heal, while not forcing those who still feel unsafe back into the office before they’re ready.\nSafe and delayed return to the office. Staff should not be required to return to the office until the windows and buildings are fixed and completely secure. Staff should not be required to work next to bullet holes. Forcing a return under these conditions risks re-traumatizing staff by exposing them to the reminders of the horrific shooting they endured. A safe and psychologically supportive workspace must be prioritized before resuming in-person work.\nFair and comprehensive telework policies across all CDC campuses and divisions, recognizing that the threat and fear extend beyond one campus.\nAccess to trauma-informed mental health resources. CDC’s Employee Assistance Program (EAP), while a valuable resource, is understaffed and intended for short-term assistance only. CDC staff need access to meaningful, ongoing care.\nA clear and unequivocal stance in condemning vaccine disinformation by CDC and HHS leadership. Their leadership is critical in reinforcing public trust and ensuring that accurate, science-based information prevails. This condemnation is necessary to help prevent violence against scientists that may be incited by such disinformation.\nPerimeter security on all campuses until a full investigation is completed and findings are shared transparently with staff.\nComplete transparency around building repairs, reopening timelines, and safety upgrades.\nA seat at the table for 2883 when decisions are being made about employee safety. As CDC employees ourselves, we can represent the voices and concerns of affected employees.\nClear, compassionate communication from leadership, with space for staff to voice their thoughts, concerns, and experiences.\nCongressional action to end the reckless politicization of federal employees and hold leaders accountable for rhetoric that incites hostility and vilifies public servants.\nCongressional support to provide dedicated funding for workplace safety upgrades and comprehensive trauma recovery programs for federal workers.\nThis list is not complete. If there’s something you need, something we’ve missed, or something you want to see prioritized, please tell us. Your voice matters, and we are listening. Please feel free to share your thoughts with us by emailing: info@afge2883ga.org or completing this anonymous form.\nWe will be replacing our regular monthly union meeting with a space for collective support. A licensed clinical psychologist with expertise in immediate response after mass violence and shootings will be present to guide and support. This space is open to all who need a moment to process, reflect, or simply be in community. We will send out details and meeting link soon.\nPlease be aware of some of the immediate resources available to you, such as:\nNational Mass Violence Center’s (NMVC) free self-help app, Transcend NMVC, is available free on Apple and Android\nNMVC’s Virtual Resiliency Center\nNMVC’s Twelve Self-Help Tips for Coping in the Aftermath of Mass Violence Incidents\nSAMHSA’s Coping with Grief After a Disaster or Traumatic Event\nSAMHSA’s Tips for Survivors of a Disaster or Other Traumatic Event\nSAMHSA’s Tips for Talking With and Helping Children and Youth Cope After a Disaster or Traumatic Event\nNMVC’s How to Identify an Experienced Trauma-Focused Therapist\nRecovery in the Aftermath of Workplace Violence: Guidance for Workers\nMental Health America’s Coping with Gun Violence\nAmerican Psychological Association’s Managing your distress in the aftermath of a shooting\nEverytown Survivor Network’s Resources for Victims and Survivors of Gun Violence\nSandy Hook Promise’s Help for Victims and Survivors of Gun Violence\nThe 988 mental health hotline: free, confidential support 24/7 via call, text, or chat\nWe are working to provide additional resources as soon as we can.\nIn solidarity and community,\nAFGE Local 2883"
    }
  ],
  "argos_summary": "A recent shooting at the CDC's Atlanta headquarters, which resulted in the death of a police officer, has been linked to vaccine misinformation, prompting calls from the American Federation of Government Employees (AFGE) for stronger condemnation of such disinformation. The alleged shooter, Patrick White, expressed distrust towards COVID-19 vaccines in documents found at his home. Health Secretary Robert F. Kennedy Jr. acknowledged the need for transparency in addressing vaccine concerns and emphasized the importance of protecting public health workers from violence fueled by misinformation.",
  "argos_id": "V4O4Q72BV"
}