{
  "url": "https://www.foxnews.com/politics/mexico-extradite-26-top-cartel-leaders-us-trump-administration-deal",
  "authorsByline": "Brie Stimson",
  "articleId": "b02c35ff44604fed864ba67aa0ee6166",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/mexico-army-member.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:12:56-04:00",
  "addDate": "2025-08-12T23:22:28.875503+00:00",
  "refreshDate": "2025-08-12T23:22:28.875504+00:00",
  "score": 1.0,
  "title": "Mexico to extradite 26 top cartel leaders to US in Trump administration deal",
  "description": "The Trump administration secures the extradition of 26 Mexican cartel figures, including a Los Cuinis leader and a suspect in 2008 U.S. deputy murder case.",
  "content": "Mexico is handing over 26 top cartel leaders to the United States this week in a deal with the Trump administration.\n\nThe cartel figures were scheduled to fly to the U.S. on Tuesday.\n\n\"Today is the latest example of the Trump administration's historic efforts to dismantle cartels and foreign terrorist organizations,\" Attorney General Pam Bondi told Fox News Digital. \"These 26 men have all played a role in bringing violence and drugs to American shores -- under this Department of Justice, they will face severe consequences for their crimes against this country. We are grateful to President Sheinbaum and the Mexican government for their collaboration in this matter.\"\n\nAbigael González Valencia, a leader of the \"Los Cuinis,\" cartel, which is aligned with the notorious Jalisco New Generation cartel (CJNG) and Roberto Salazar, who is accused of participating in the 2008 killing of a Los Angeles sheriff’s deputy, are among those being handed over to the U.S.\n\nUS ACCUSES VENEZUELAN REGIME OF NARCO-TERRORISM OVER ALLIANCES WITH TREN DE ARAGUA, SINALOA CARTEL\n\nThe Trump administration has classified the CJNG as a terrorist organization.\n\nMexico’s Attorney General’s Office and Security Ministry confirmed the men were being handed over, saying the deal was made after the U.S. Justice Department said it wouldn’t seek the death penalty for any of the men.\n\nThe deal comes amid the Trump administration’s focus on border security and attempt to crack down on Mexican cartels that send drugs across the border.\n\n\"President Trump’s top priority is protecting the homeland, which is why he took the bold step to designate several cartels and gangs as foreign terrorist organizations,\" deputy White House press secretary Anna Kelly previously said in a statement to Fox News Digital.\n\nAMERICANS IN VACATION HOT SPOT MAY SEE MORE MILITARY THAN MARGARITAS THIS SUMMER\n\nMexican President on Friday said the U.S. military would not be entering Mexican territory following reports that Washington could take action to combat the cartels.\n\n\"We co-operate, we collaborate, but there is not going to be an invasion,\" she said. \"It’s off the table, absolutely off the table.\"\n\nPresident Donald Trump has also reportedly secretly authorized U.S. military force against cartels in Latin America designated by the U.S. as terrorist organizations, which would allow U.S. forces to engage with them.\n\nIt also comes ahead of 25% tariffs on Mexican goods coming into the U.S. imposed by Trump.\n\nTrump spoke with Sheinbaum, who has been more aggressive than the last president about going after cartels, and told her he would delay 30% tariffs on the country for 90 days for negotiations.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMexico also extradited 29 cartel leaders in February, including Rafael Caro Quintero, who prosecutors say was behind the torture and murder of a DEA agent in 1985.\n\nThe Associated Press contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/us/americans-vacation-hot-spot-may-see-more-military-than-margaritas-summer",
    "https://www.foxnews.com/us/us-accuses-venezuelan-regime-narco-terrorism-alliances-tren-de-aragua-sinaloa-cartel",
    "https://www.foxnews.com/category/world/world-regions/location-mexico",
    "https://www.foxnews.com/category/topic/mexican-cartel-violence",
    "https://www.foxnews.com/download",
    "https://nypost.com/2025/08/08/us-news/trump-secretly-authorized-military-force-against-latin-american-drug-cartels-classified-as-foreign-terrorist-organizations/",
    "https://www.foxnews.com/politics/trump-approves-military-action-latin-american-cartels-classified-terrorist-organizations",
    "https://www.foxnews.com/video/6376797168112"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mexican cartels",
      "weight": 0.11045636
    },
    {
      "name": "cartels",
      "weight": 0.096898265
    },
    {
      "name": "several cartels",
      "weight": 0.096235305
    },
    {
      "name": "Trump administration deal",
      "weight": 0.09144232
    },
    {
      "name": "U.S. military force",
      "weight": 0.08291327
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07981058
    },
    {
      "name": "U.S. forces",
      "weight": 0.07972856
    },
    {
      "name": "Mexican President",
      "weight": 0.077318594
    },
    {
      "name": "foreign terrorist organizations",
      "weight": 0.075830236
    },
    {
      "name": "U.S.",
      "weight": 0.07447226
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98828125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.91357421875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.86328125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.32080078125
    }
  ],
  "sentiment": {
    "positive": 0.08273909,
    "negative": 0.62464064,
    "neutral": 0.29262027
  },
  "summary": "Mexico is extraditing 26 top cartel leaders to the United States in a deal with the Trump administration. The cartel figures, including Abigael González Valencia and Roberto Salazar, are set to fly to the U.S. on Tuesday. This comes amid the administration's focus on border security and efforts to crack down on Mexican cartels that send drugs across the border. The men were being handed over after the US Justice Department announced it wouldn't seek the death penalty for any of the men. The deal comes ahead of 25% tariffs on Mexican goods coming into the US imposed by President Donald Trump. The Mexican President also announced that the US military would not be entering Mexican territory to combat the cartels.",
  "shortSummary": "Mexico is extraditing 26 top cartel leaders to the United States, part of Trump's efforts to dismantle cartels and terrorist organizations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b9745db4b9d14bc1a333bad05c8cf6cd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/world/world-regions/location-mexico",
      "text": "Opinion 3 days ago Trump sends military after the cartels and it’s long overdue U.S. military deployment targets Mexican cartels as DHS reports reveal corrupt military and law enforcement crossing border to assist drug trafficking organizations\nCrime 5 days ago Border crisis shifts to Caribbean: Homeland Security fights silent war in Puerto Rico Homeland Security Investigations in Puerto Rico reports significant reduction in smuggling load, higher fentanyl presence following enhanced enforcement and new funding under Trump.\nDemocratic Party August 4 House Dem declares she is a 'proud Guatemalan' before American at Progressive International conference Rep. Delia Ramirez declared she's prouder to be Guatemalan than American at leftist Panamerican Congress attended by progressive lawmakers.\nWhite House August 2 Trump closes week with plans to reposition subs amid heightened Russia tension, new tariffs Trump orders nuclear submarines repositioned after Russian tensions escalate, while implementing new tariffs on Canada and other countries this week.\nTravel August 1 Americans in vacation hot spot may see more military than margaritas this summer Mexico deploys over 7,000 security personnel including National Guard and military to protect tourists in Cancun and Riviera Maya amid rising cartel violence concerns.\nRepublicans July 30 Border county Republicans say Trump policies improve security while Democrats cite 'cruelty' Southern Arizona community officials note reduced illegal crossings under President Trump, but also ongoing drug smuggling issues and effects of previous policies.\nSouth America July 29 US accuses Venezuelan regime of narco-terrorism over alliances with Tren de Aragua, Sinaloa Cartel The U.S. Department of the Treasury has sanctioned the Cartel de los Soles as a global terrorist group for allegedly supporting violent organizations like Tren de Aragua and the Sinaloa Cartel.\nUS Environment July 25 US-Mexico Tijuana River sewage crisis deal is ‘massive’ win for Americans, EPA says EPA Administrator Lee Zeldin announces US-Mexico deal to resolve the Tijuana River sewage crisis, calling it a massive environmental win for San Diego-area residents.\nAirlines July 23 Delta plane aborts takeoff in Mexico City after plane nearly lands on top of aircraft A Delta Boeing jet bound for Atlanta safely stopped takeoff when pilots observed another aircraft landing in front of them on the same runway in Mexico City.\nCulture Trends July 19 Border Patrol morale goes through the roof, 'dramatically' changed under Trump administration Border Patrol agents in Tucson revealed to Fox News Digital how their frontline duties have been affected while defending the border under the Trump administration.\nSoft Drinks July 18 Why Mexican Coke is a fan favorite and where to buy it after Trump's sweet announcement Mexican Coca-Cola’s cult following is due to the beverage's cane sugar recipe, which fans say delivers a “completely different\" taste, though experts warn it’s not much healthier\nTravel July 18 Officials at popular tourist spot cave to protesters who called out Americans Mexico City officials announce plans to address gentrification after locals protest mass tourism, with demonstrators targeting American visitors amid a 70% increase in U.S. residents.\nImmigration July 18 Feds' California Home Depot raid nabs 11 illegal migrants, one with 67 prior jail bookings Border Patrol in Sacramento arrested 11 illegal migrants during a raid at a Home Depot parking lot — including one man with 67 prior bookings in California since 1986.\nOpinion July 18 PAM BONDI & ROBERT MURPHY: Team Trump is fighting deadly drug cartels to save American lives Under Trump, federal agencies seized over 44 million fentanyl pills and 68,000 pounds of meth while designating cartels as Foreign Terrorist Organizations\nUS July 14 Chinese illegal immigrant crossings that surged during Biden admin a 'national security concern,' expert warns A border security expert said the large number of Chinese illegal immigrants who crossed the southern border during the Biden administration poses a national security risk.\nBoxing July 8 Boxing legend Julio César Chávez defends son after arrest by US immigration officials Boxing legend Julio César Chávez defended his son in an interview with Mexican media after he was arrested in the U.S. and faces deportation.\nTravel July 8 Americans targeted in Mexico City as locals protest against tourism and soaring rents Anti-tourism protests erupted in Mexico City as locals face gentrification challenges similar to Barcelona and Venice demanding stricter housing laws and legislation to regulate tourism levels.\nCrime July 6 American with 'CIA' credentials and variety of weapons arrested in Mexico Mexican authorities arrested an American with alleged CIA credentials and six firearms, magazines, ammunition and tactical equipment for disturbing the peace.\nBoxing July 4 Mexico President expects boxer Julio César Chávez Jr. to be deported, hopes he serves sentence in home country Mexican President Sheinbaum confirms hope for former boxing champion Julio Cesar Chávez Jr. to serve weapons trafficking sentence in Mexico\nBoxing July 3 Mexican boxer Julio Cesar Chavez Jr arrested by ICE days after fighting Jake Paul Julio Cesar Chavez Jr., who fought Jake Paul just four days ago, was arrested by ICE as the Department of Homeland Security announced his \"expedited removal\" from the U.S.\nImmigration July 2 Federal judge orders Mexican migrant seeking asylum to be released by ICE A federal judge in Oregon has ordered the release of Mexican migrant who had been held in an ICE detention facility for nearly a month after agents arrested him moments after a routine asylum hearing.\nBorder wall July 2 Mexican border town sees fewer crossing attempts, deportations than expected under Trump Local business owners in Nogales, Mexico, discuss Trump's impact on border security, revealing fewer crossing attempts and unexpected calm despite deportation preparations.\nMexico July 1 Twenty dead bodies discovered in Mexico, including corpses hanging from bridge Four decapitated bodies were found hanging from a bridge and 16 additional corpses were discovered in a van amid ongoing cartel violence in the capital of Mexico's Sinaloa state.\nNew Jersey June 29 New Jersey lawmaker proposes legislation renaming Delaware Bay to 'The Bay of New Jersey' A New Jersey Republican has proposed renaming the Delaware Bay as \"The Bay of New Jersey\" a few months after Trump's Gulf of America executive order.\nMexican Cartel Violence June 27 Sinaloa cartel hacker turned Mexico City cameras against FBI, leading to killings, DOJ says Justice Department reveals cartel hacker compromised FBI attaché's phone data and used city surveillance to eliminate witnesses, the DOJ said.\nUS June 27 Human smugglers sentenced in horrific Texas truck deaths of 53 migrants Two human smugglers who were convicted of causing the deaths of 53 migrants whom they were trying to sneak into the U.S. in a sweltering hot tractor trailer were sentenced today.\nBorder wall June 21 Mexican mayor applauds Trump’s 'cleaning house' deportation plan The mayor of the border city of Nogales in Sonora, Mexico, Juan Francisco Gim Nogales, discusses the reality of how Trump's deportation plans have affected his community.\nMexico June 19 Border Patrol agents shut down massive drug smuggling tunnel between Tijuana and San Diego Border Patrol agents uncovered a sophisticated narcotics smuggling tunnel connecting Tijuana and San Diego, featuring electrical and ventilation systems.\nDonald Trump June 14 Mexican Senate president says LA is essentially Mexico: I'd ‘pay for the wall’ if it ceded US southwest Mexican Senate President Gerardo Fernández Noroña displayed a 1830s map showing California and Texas as Mexican territory during the LA immigration debate.\nSoccer June 13 Mexico president calls for US immigration forces to spare fans at LA soccer game Amid curfews and protests over ICE operations, Mexican President Sheinbaum calls for immigration authorities to refrain from enforcement at an LA soccer match."
    },
    {
      "url": "https://www.foxnews.com/category/topic/mexican-cartel-violence",
      "text": "Mexican Cartel Violence 1 hour ago Mexico to extradite 26 top cartel leaders to US in Trump administration deal The Trump administration secures the extradition of 26 Mexican cartel figures, including a Los Cuinis leader and a suspect in 2008 U.S. deputy murder case.\nDonald Trump 4 days ago Trump approves military action against Latin American cartels classified as terrorist organizations Trump administration secretly approves military action targeting drug cartels classified as terrorist groups that traffic fentanyl across the US-Mexico border.\nCrime 5 days ago Border crisis shifts to Caribbean: Homeland Security fights silent war in Puerto Rico Homeland Security Investigations in Puerto Rico reports significant reduction in smuggling load, higher fentanyl presence following enhanced enforcement and new funding under Trump.\nTravel August 1 Americans in vacation hot spot may see more military than margaritas this summer Mexico deploys over 7,000 security personnel including National Guard and military to protect tourists in Cancun and Riviera Maya amid rising cartel violence concerns.\nCulture Trends July 19 Border Patrol morale goes through the roof, 'dramatically' changed under Trump administration Border Patrol agents in Tucson revealed to Fox News Digital how their frontline duties have been affected while defending the border under the Trump administration.\nIllegal Immigrants July 18 DHS accuses 'activist' judge of pushing radical gender ideology by releasing trans migrant The Department of Homeland Security has ripped a federal judge in Washington for releasing a transgender migrant from detention, saying the release was caused by the judge bowing to activist pressure.\nDrugs July 16 DEA, FBI seize $10 million in cryptocurrency 'directly linked to the Sinaloa cartel' The Justice Department announced that \"over $10 million dollars in cryptocurrency, directly linked to the Sinaloa cartel\" has been seized in Miami, Florida.\nDrugs July 11 War on cartels yields results as 'El Chapo' heir confesses to running violent drug empire El Chapo's son, Ovidio Guzman Lopez, pleaded guilty to running the Sinaloa Cartel and coordinating massive shipments of fentanyl, heroin and cocaine to the United States.\nMexico July 1 Twenty dead bodies discovered in Mexico, including corpses hanging from bridge Four decapitated bodies were found hanging from a bridge and 16 additional corpses were discovered in a van amid ongoing cartel violence in the capital of Mexico's Sinaloa state.\nJustice Department July 1 DOJ directs US attorneys to seek to revoke citizenship of naturalized Americans over crime Justice Department memo outlines priority categories for citizenship revocation, focusing on security threats, violent criminals, and financial fraudsters.\nMexican Cartel Violence June 27 Sinaloa cartel hacker turned Mexico City cameras against FBI, leading to killings, DOJ says Justice Department reveals cartel hacker compromised FBI attaché's phone data and used city surveillance to eliminate witnesses, the DOJ said.\nPolitics June 9 Trump admin sanctions El Chapo's children, violent fentanyl-trafficking cartel arm Los Chapitos El Chapo's sons and Los Chapitos faction sanctioned by Treasury Department following cartel-linked killing of US Marine veteran as officials target Sinaloa cartel finances.\nChina June 5 Chinese chemical bust by border officials underscores multifront effort by CCP to undermine US U.S. authorities intercepted precursor chemicals from China meant for the Sinaloa Cartel, highlighting one of many avenues China is using to undermine American security\nSupreme Court June 5 Supreme Court sides with US gunmakers in case centered on Mexican cartel violence The Supreme Court on Thursday ruled in favor of U.S. gun manufacturers who were sued by Mexico over allegations they aided and abetted illegal gun sales to Mexican cartels.\nOpioid Crisis June 2 Liberal news outlet mocked for reporting on ‘mysterious’ drop in fentanyl flowing across border A liberal newspaper is being mocked online and by the White House for “pathetic\" reporting on what the outlet calls a “mysterious\" decline in fentanyl flowing across the border.\nUS June 2 US government taking ‘dramatically different approach’ using terrorism charges against drug cartels: FBI alum A former FBI official says the Department of Justice's decision to hit two Sinaloa cartel members with terrorism-related charges marks a significant shift in strategy.\nPolitics May 28 DHS video honors Marine killed by Mexican cartel, touts Trump's crackdown on 'terrorists' The Department of Homeland Security released a video honoring the memory of Marine Corps veteran Nicholas Quets, while touting the moves it has made to crack down on cartels.\nChicago May 27 Feds won't seek death penalty for El Chapo's son in major drug trafficking case Joaquin Guzman Lopez, son of El Chapo, faces U.S. drug trafficking charges. Prosecutors decide against the death penalty amid Sinaloa Cartel's fentanyl operations.\nMexico May 22 Hundreds of animals flee cartel chaos, violence after wildlife refuge faced with threats Exotic animals in Culiacán's Ostok Sanctuary are evacuated amid cartel violence. Staff face threats and government inaction as Sinaloa Cartel factions clash.\nSanctions May 21 Violent Mexican drug gang's high ranking members sanctioned by Trump The Trump administration on Wednesday sanctioned two high-ranking members of the Cartel del Noreste — one of the most violent drug trafficking organizations in Mexico and a U.S.-designated foreign terrorist organization, Fox News Digital has learned.\nMexico May 16 TikTok influencer in Mexico shot and killed on livestream A Mexican social media influencer was fatally shot during a TikTok livestream and authorities suspect she was the victim of targeted hit.\nOpinion May 16 Trump targets northern border security as Canada's 'open border' policies create new threats President Trump prioritizes northern border security as Canada's lax immigration controls allow criminal networks to exploit the US-Canada border for drug trafficking.\nMexican Cartel Violence May 14 El Chapo's family members cross US border in apparent deal with Trump administration Sinaloa Cartel family members, including El Chapo's ex-wife, entered the U.S. under a deal with the government, as confirmed by Mexican Security Secretary.\nPolitics May 3 Mexican president declines Trump's offer of US troops to help fight drug cartels Mexican President Claudia Sheinbaum recently confirmed President Donald Trump offered U.S. military assistance to address cartel concerns, and she declined.\nSupreme Court April 17 Justice Kagan denies emergency appeal to halt deportation of Mexican nationals claiming asylum from cartel Justice Kagan denies emergency appeal from four Mexican nationals facing deportation, allowing removal to proceed without referral to full Supreme Court.\nJustice Department April 16 US charges leaders of 'brutal Mexican cartel,' offers $8M reward for brothers' capture The U.S. is offering an $8 million reward for the capture of two brothers accused of running a \"brutal Mexican cartel\" that officials say is \"poisoning Americans.\"\nMexican Cartel Violence April 10 Mexican drug lord convicted in killing of DEA agent Enrique ‘Kiki’ Camarena is freed Mexican drug lord Ernesto \"Don Neto\" Fonseca Carrillo was released from custody after being convicted in the 1985 killing of DEA agent Enrique ‘Kiki’ Camarena.\nUS April 9 Bondi, Patel announce seizure of over $509M in cocaine linked to cartels Attorney General Pam Bondi and FBI Director Kash Patel said Coast Guard cutters interdicted almost 45,000 pounds of cocaine and 3,800 pounds of marijuana worth over $509 million.\nTrump's First 100 Days April 3 Father of Marine vet murdered in Mexico praises Trump admin sanctions on Sinaloa cartel: 'Palpable' momentum The father of Marine veteran Nicholas Quets praised Treasury Secretary Scott Bessent's sanctions against the Sinaloa cartel after his son's murder in Mexico.\nMexican Cartel Violence April 1 Sinaloa cartel slapped with Trump admin sanctions in blow to drug empire The U.S. Department of the Treasury announced sanctions against six individuals and seven entities allegedly involved in a money laundering network that supports the Sinaloa cartel."
    },
    {
      "url": "https://www.foxnews.com/us/us-accuses-venezuelan-regime-narco-terrorism-alliances-tren-de-aragua-sinaloa-cartel",
      "text": "The U.S. government has named the Cartel de los Soles, a Venezuela-based criminal group led by President Nicolás Maduro, a global terrorist organization.\nCartel de los Soles, or Cartel of the Suns, is being sanctioned by the U.S. for providing support to foreign terrorist organizations, including the violent Tren de Aragua and Sinaloa Cartel, according to a news release from the U.S. Department of the Treasury.\n\"Today’s action further exposes the illegitimate Maduro regime’s facilitation of narco-terrorism through terrorist groups like Cartel de los Soles,\" Treasury Secretary Scott Bessent said in a statement.\n\"The Treasury Department will continue to execute on President Donald Trump’s pledge to put America First by cracking down on violent organizations, including Tren de Aragua, the Sinaloa Cartel and their facilitators, like Cartel de los Soles.\"\nTren de Aragua, a Venezuelan gang, is involved in a range of criminal activities, including human smuggling and the illicit drug trade. The Sinaloa Cartel, a violent and powerful Mexican cartel, is responsible for trafficking drugs like fentanyl into the U.S., according to the Treasury Department.\nSINALOA CARTEL LEADERS CHARGED WITH NARCO-TERRORISM AFTER AUTHORITIES SEIZE 1.65 TONS OF FENTANYL\nIn an X post, the Drug Enforcement Administration wrote that it is seeking information leading to the arrests and convictions of Maduro, Minister of Interior, Justice and Peace Diosdado Cabello Rondón and Minister of Defense Vladimir Padrino López.\nIn January, the U.S. increased an reward to $25 million for information leading to Maduro's arrest and/or conviction. The U.S. has not recognized Maduro as the Venezuelan president since 2019.\nCLICK HERE TO GET THE FOX NEWS APP\nIn May, the U.S. advised citizens to avoid traveling to Venezuela and its borders. According to the U.S. Department of State, citizens were warned not to travel to Venezuela due to severe risks, including wrongful detention, torture in detention, terrorism, kidnapping, arbitrary enforcement of local laws, crime, civil unrest and poor health infrastructure."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-approves-military-action-latin-american-cartels-classified-terrorist-organizations",
      "text": "President Donald Trump has secretly authorized military force against Latin American drug cartels designated by the United States as foreign terrorist organizations, according to reports.\nThe move, reported by the New York Times, would give U.S. forces permission to engage the cartels, which traffic drugs like fentanyl across the US-Mexico border,\n\"The president is determined to not just dismantle – but completely destroy – [Venezuelan dictator Nicolas] Maduro’s Cartel de Los Soles and obliterate their operations in the Western Hemisphere,\" a source close to the White House said, the New York Post reported.\nUS ACCUSES VENEZUELAN REGIME OF NARCO-TERRORISM OVER ALLIANCES WITH TREN DE ARAGUA, SINALOA CARTEL\nThe anti-cartel effort is being coordinated among several departments, including the Department of Defense, Justice Department, Department of Homeland Security, Office of the Director of National Intelligence and the Treasury, the source added.\n\"President Trump’s top priority is protecting the homeland, which is why he took the bold step to designate several cartels and gangs as foreign terrorist organizations,\" deputy White House press secretary Anna Kelly said in a statement to Fox News Digital.\nMexican President Claudia Sheinbaum on Friday said the U.S. military would not be entering Mexican territory following reports that Washington could take action to combat the cartels.\n\"It has nothing to do with Mexican territory,\" she said. \"It has to do with their country. It does not involve our territory.\"\nTrump has previously discussed using military force against drug cartels in an effort to stop the flow of drugs and illegal immigrants across the southern border. He has also sanctioned high-ranking members of Cartel del Noreste, one of the most violent drug-trafficking organizations in Mexico and a U.S.-designated foreign terrorist organization.\nMost recently, he has used the threat of tariffs to force Mexico and Canada to actively participate in anti-smuggling efforts.\nIn relation to Latin American cartels, the administration has also singled out Venezuelan President Nicolas Maduro, who is wanted by the U.S. On Thursday, Attorney General Pam Bondi announced a $50 million reward for information leading to his arrest.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Maduro uses foreign terrorist organizations like TdA (Tren de Aragua), Sinaloa and Cartel of the Suns (Cartel de Soles) to bring deadly violence to our country,\" Bondi said in a video message. \"He is one of the largest narco-traffickers in the world and a threat to our national security.\"\nWeeks after taking office, the White House announced the extradition of 29 members of various Mexican drug cartels.\n\"The previous Administration allowed these criminals to run free and commit crimes all over the world. The Trump Administration is declaring these thugs as terrorists, because that is what they are, and demanding justice for the American people,\" the White House said at the time."
    },
    {
      "url": "https://nypost.com/2025/08/08/us-news/trump-secretly-authorized-military-force-against-latin-american-drug-cartels-classified-as-foreign-terrorist-organizations/",
      "text": "Trump secretly authorized military force against Latin American drug cartels classified as foreign terrorist organizations\nWASHINGTON — President Trump has secretly authorized the military to use force against Latin American drug cartels classified as foreign terrorist organizations, The Post has learned.\nThe move is the most aggressive action Trump has yet taken against gangs trafficking drugs like fentanyl across the US-Mexico border, the activities of which were previously the purview of federal law enforcement.\nThe order, first reported Friday by the New York Times, gives US forces official permission to engage cartels on land and sea.\n“The president is determined to not just dismantle – but completely destroy – [Venezuelan dictator Nicolas] Maduro’s Cartel de Los Soles and obliterate their operations in the Western Hemisphere,” a source close to the White House said.\nThe State Department’s list of foreign terrorist organizations involved in drug trafficking include Venezuela’s Tren de Aragua and Cartel de Los Soles, as well as El Salvador-rooted Mara Salvatrucha, known as MS-13.\nTrump, 79, publicly mulled authorizing the military to target drug cartels inside Mexico on the 2024 campaign trail.\nSince taking office, the president has upped tariffs on Canada and Mexico, citing their inability to shut down drug and people smuggling into the US — and directing immigration agents to go after new arrivals with gang ties.\nTrump has also hosted families impacted by gang violence at the White House and has vowed to strip cartels of their assets to give to families impacted by “migrant crime.”\nMaduro, Venezuela’s president since 2013, has been a particular focus of the administration.\nThe Justice and State departments announced Thursday they would award $50 million to anyone providing details leading to his arrest for violating US drug laws.\nThe anti-cartel effort is being coordinated among several departments, including the Department of Defense, Justice Department, Department of Homeland Security, Office of the Director of National Intelligence and the Treasury, the source added.\n“President Trump’s top priority is protecting the homeland,” deputy White House press secretary Anna Kelly said in a statement, “which is why he took the bold step to designate several cartels and gangs as foreign terrorist organizations.”"
    },
    {
      "url": "https://www.foxnews.com/us/americans-vacation-hot-spot-may-see-more-military-than-margaritas-summer",
      "text": "Tourists visiting Cancún and Mexico’s Riviera Maya this summer are being greeted not just with ocean breezes and poolside cocktails, but by heavily armed patrols.\nIn response to escalating cartel violence and crimes against travelers, the Mexican government has deployed more than 7,000 troops and security personnel to safeguard the country’s most popular vacation zones. Since 2021, Mexico has turned to deploying troops and local enforcement to patrol the beaches and tourist hot spots.\nFormer Drug Enforcement Administration (DEA) Senior Special Agent Michael Brown, currently the global director of counter-narcotics technology at Rigaku Analytical Devices, told Fox News Digital that the sight of military rifles may do more to remind travelers of the danger than reassure them of their safety.\n\"The fluidity of Mexican organized crime, gang activity, is constantly moving from one side of the country to the next,\" he said. \"Unfortunately, these high-end tourist areas represent an easy opportunity for organized crime to come, steal, assault, and rob.\"\nAMERICAN TOURISTS IN POPULAR VACATION SPOT FACE INCREASED RISK OF BEING KILLED, ROBBED\nMilitary muscle on patrol\nThis summer, the Mexican government has launched an aggressive security campaign across popular tourist destinations in the state of Quintana Roo — home to Cancún, Playa del Carmen, Tulum, and Cozumel.\nDubbed \"Operation Summer Vacation 2025,\" the initiative was formally announced on July 18 and involves the deployment of more than 7,000 security personnel, including members of the National Guard, Navy, Army, and state and local police. While Operation Summer Vacation 2025 is the largest coordinated seasonal deployment to date, it follows a multi-year pattern of heightened military involvement in Mexico’s most lucrative tourist zones.\nThe goal is to safeguard the expected 2 million tourists throughout the summer and early fall months with a coordinated presence of land, air, and sea patrols.\n\"We will not tolerate abuses, illegal fees, or practices that harm individuals. To our tourism service providers, I reiterate: you are the best ambassadors of our state. Your conduct, your ethics, and your commitment will make the difference,\" Gov. Mara Lezama Espinosa of Quintana Roo said in a news conference, according to Spanish-speaking regional media outlets.\nBrown views the militarization as a red flag rather than a reassurance.\n\"You're sitting on a beach looking at soldiers. I'm worried about something happening. That really works against the concept of a vacation,\" he said. \"If I'm sitting on a beach looking at the armed military, is that really going to make me relax?\"\nAMERICANS TOURISTS WARNED OF INCREASED THREAT IN SUMMER VACATION HOTSPOT\nConcerns about traveling to Mexico as an American are not overstated as cases of rampant crime against tourists have prompted the U.S. State Department to issue warnings.\nThe agency issued a Level 2 travel advisory to Quintana Roo, meaning travelers should \"exercise increased caution\" due to elevated risks connected to property crimes, scams, and occasional violent incidents - even in tourist areas.\nThe U.S. Embassy in Mexico encourages U.S. citizens to remain vigilant at all times, especially in the downtown zones of Cancun, Playa del Carmen, and Tulum after dusk, and to stick to well-lit, populated areas to reduce vulnerability. Travel alerts also remind visitors of incidents where cartel-related violence and rival gang disconnects, though not necessarily targeted at tourists, have injured innocent bystanders.\n\"If you're going to go to places which represent a certain level of danger, you have to have a plan in place to mitigate that threat, because once it happens, you're not going to see it happen,\" Brown said.\nSmart travel\nWhile military patrols may offer some comfort, Brown stressed that personal vigilance is still the most effective safety tool for American tourists, especially women traveling alone or in small groups.\nBrown recommends tourists carry personal GPS trackers, ideally concealed in a handbag, bracelet, or necklace, and set designated check-in times with family members back home.\nHe also urges travelers to only use transportation arranged by the hotel when staying at resorts and pre-verify the driver's identification and license plate.\nWhen it comes to nightlife, the former DEA special agent suggests never accepting drinks from strangers, only consuming beverages opened in front of you, and never leaving the resort alone, especially at night.\nFor cruise-goers or those venturing into local towns, he advises leaving all jewelry, designer items, and large amounts of cash onboard to avoid being targeted.\n\"Have a plan,\" he said. \"Your awareness has to increase significantly the moment you step off that plane.\"\nCLICK HERE TO GET THE FOX NEWS APP\nFox News Digital has reached out to the U.S. State Department for comment."
    }
  ],
  "argos_summary": "Mexico is extraditing 26 top cartel leaders to the United States as part of a deal with the Trump administration, which aims to dismantle drug trafficking organizations classified as terrorist groups. Among those being handed over are leaders from the Los Cuinis cartel and suspects linked to violent crimes against U.S. law enforcement. This move aligns with the Trump administration's broader strategy to enhance border security and combat drug trafficking, including potential military action against cartels in Latin America.",
  "argos_id": "V50X572B5"
}