{
  "url": "https://www.inc.com/reuters/ai-startup-perplexity-makes-bold-34-5-billion-bid-for-googles-chrome-browser/91226672",
  "authorsByline": "Reuters",
  "articleId": "7423fb515c234410bdf0117106a19c04",
  "source": {
    "domain": "inc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/08/perplexity-ai-inc-GettyImages-2185275083.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:53:35+00:00",
  "addDate": "2025-08-12T21:04:48.888791+00:00",
  "refreshDate": "2025-08-12T21:04:48.888792+00:00",
  "score": 1.0,
  "title": "AI Startup Perplexity Makes Bold $34.5 Billion Bid for Google's Chrome Browser",
  "description": "The bid for Chrome is far above Perplexity's own valuation.",
  "content": "The bid for Chrome is far above Perplexity’s own valuation.\n\nRun by Aravind Srinivas, Perplexity is no stranger to headline-grabbing offers: it made a similar one for TikTok US in January, offering to merge with the popular short-video app to resolve U.S. concerns about TikTok’s Chinese ownership. OpenAI, Yahoo and private-equity firm Apollo Global Management have also expressed interest in Chrome as regulatory pressure threatens Google’s grip on the industry. Google did not immediately respond to Reuters requests for comment. The company has not offered Chrome for sale and plans to appeal a U.S. court ruling last year that found it held an unlawful monopoly in online search. The Justice Department has sought a Chrome divestiture as part of the case’s remedies.\n\nPerplexity did not disclose on Tuesday how it plans to fund the offer. The three-year-old company has raised around $1 billion in funding so far from investors including Nvidia and Japan’s SoftBank. It was last valued at $14 billion. Multiple funds have offered to finance the deal in full, Perplexity said, without naming the funds. Alphabet’s shares were up 1.6 percent in afternoon trading. As a new generation of users turns to chatbots such as ChatGPT and Perplexity for answers, web browsers are regaining prominence as vital gateways to search traffic and prized user data, making them central to Big Tech’s AI ambitions.\n\nPerplexity already has an AI browser, Comet, that can perform certain tasks on a user’s behalf and buying Chrome would allow it to tap the browser’s more than three billion users, giving it the heft to better compete with bigger rivals such as OpenAI. The ChatGPT parent is also working on its own AI browser. Perplexity’s bid pledges to keep the underlying browser code called Chromium open source, invest $3 billion over two years and make no changes to Chrome’s default search engine, according to a term sheet seen by Reuters. The company said the offer, with no equity component, would preserve user choice and ease future competition concerns.\n\nAnalysts have said Google would be unlikely to sell Chrome and would likely engage in a long legal fight to prevent that outcome, given it is crucial to the company’s AI push as it rolls out features including AI-generated search summaries, known as Overviews, to help defend its search market share. A federal judge, Amit Mehta, is expected to issue a ruling on remedies in the Google search antitrust case sometime this month. “Judge Mehta is a pretty orthodox guy. It’s very possible that he would hold off on requiring a sale until the appeals process is worked out and that could be a very lengthy period of time,” said Herbert Hovenkamp, professor at University of Pennsylvania Carey Law School.\n\n“It would go to the DC Circuit, which is skeptical of forced divestitures, and it’s possible it would even go to the Supreme Court after that. So that process could run out for a couple of years.” Perplexity’s bid is also below the at least $50 billion value that rival search engine DuckDuckGo’s CEO, Gabriel Weinberg, suggested Chrome may command if Google was forced to sell it. Reporting by Akash Sriram in Bengaluru and Krystal Hu in New York; editing by Devika Syamnath.",
  "medium": "Article",
  "links": [
    "https://www.inc.com/ben-sherry/cant-keep-up-with-the-ai-browser-wars-heres-what-businesses-need-to-know/91215743",
    "https://incbestinbusiness.secure-platform.com/bib/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chrome",
      "weight": 0.07712868
    },
    {
      "name": "AI Startup Perplexity",
      "weight": 0.07531697
    },
    {
      "name": "search traffic",
      "weight": 0.071940385
    },
    {
      "name": "online search",
      "weight": 0.07049945
    },
    {
      "name": "Perplexity",
      "weight": 0.06832122
    },
    {
      "name": "user choice",
      "weight": 0.065157704
    },
    {
      "name": "prized user data",
      "weight": 0.06472325
    },
    {
      "name": "web browsers",
      "weight": 0.06419886
    },
    {
      "name": "users",
      "weight": 0.061807156
    },
    {
      "name": "Google",
      "weight": 0.06037579
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Startups"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9931640625
    },
    {
      "name": "/News/Technology News",
      "score": 0.95703125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.5185546875
    }
  ],
  "sentiment": {
    "positive": 0.4595655,
    "negative": 0.060223024,
    "neutral": 0.48021156
  },
  "summary": "AI startup Perplexity has made a $34.5 billion bid for Google's Chrome Browser, far exceeding its own valuation. The company, led by Aravind Srinivas, plans to appeal a U.S. court ruling that found Google had an unlawful monopoly in online search. The Justice Department has sought a Chrome divestiture as part of its remedies. Perplexic has raised around $1 billion in funding so far from investors including Nvidia and Japan’s SoftBank. The acquisition would allow the company to tap Chrome's more than three billion users to compete with larger rivals like OpenAI. However, analysts predict that Google would be unlikely to sell Chrome, given its crucial role in its AI push.",
  "shortSummary": "Perplexity bids $34.5 billion for Google’s Chrome Browser, outbidding Google”s Chrome by $3 billion, amid regulatory regulatory concerns and potential legal battles over Chrome's future.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9bd0fff4445341f99f29436fdf59e5fc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://incbestinbusiness.secure-platform.com/bib/",
      "text": "National Recognition\nEarn distinction from Inc. as one of America’s Best in Business and automatically be considered for Inc.’s prestigious Company of the Year award!\ndouble-click to edit, do not edit in source\nThe Inc. Best in Business awards celebrate the projects and initiatives that were true business wins for your company over the past year. Whether it is about a new innovation, a standout marketing campaign, a creative use of AI, or a bold move that paid off, we want to hear your story.\nTell us about a successful project or business win and find your company among the winners that will be featured on Inc.com and in the pages of Inc. magazine. Hundreds of companies will be named to the Best in Business list, with even more recognized in several standout categories.\nNow’s your chance to earn national—and global—recognition for the success you’ve had. Submit your project today and let the world see what makes your company the best in business.\nFor over 40 years, Inc. magazine has been devoted to recognizing America’s most dynamic businesses and honoring the great things they do. This year, hundreds of companies will make the cut and be honored in print and online. Honorees in 2025 will enjoy the following benefits:\nEarn distinction from Inc. as one of America’s Best in Business and automatically be considered for Inc.’s prestigious Company of the Year award!\nBe featured in the Winter issue of Inc. magazine, get a dedicated company profile on Inc.com, and receive national and local media coverage.\nEvery application will be seen and evaluated directly by Inc.’s editors, who will source stories and articles directly from the honorees and applicant pool.\nShow your current employees that all of their long days and nights of hard work are paying off, and improve recruiting opportunities with prospective employees.\nApplying is simple! Fill out the online application, where you will enter a few details about your company and answer three questions about your company’s achievement:\nDescribe a specific project, initiative, or innovation your organization achieved over the past year that is noteworthy.\nExplain how the outcome of this project is a win for your company, leadership team, or industry, and how it sets you apart from your competitors.\nCite some metrics over the past 12 months, directly related to this project, that show positive business outcomes resulting in a win.\nYou will then select which business categories you’d like to apply for—the more categories you apply to, the higher the chances of being recognized. You can see a list of award categories below. That’s it!\nApply Now\nPreferred-Rate Deadline: August 15\nAll applicants must first apply to the prestigious Best in Business main list—celebrating hundreds of companies for standout projects and initiatives over the past 12 months. Then, boost your chances for recognition by adding any of our exclusive award categories, with multiple winners honored in each.\nCelebrating AI projects and initiatives that have delivered tangible results—whether through increased efficiency, cost savings, improved customer experiences, or new revenue opportunities— by demonstrating clear, measurable wins for the organization.\nCelebrating successful projects or initiatives built without external funding—highlighting the creativity, resilience, and resourcefulness of founders and teams.\nRecognizing the branding, guerrilla marketing, pop-up, experiential, and social media campaigns of upstart companies that have successfully challenged industry leaders and won devoted communities of customers.\nRecognizing successful projects or initiatives that resulted from the partnership of two or more companies.\nHonoring projects or initiatives that have successfully built new communities or deepened engagement within existing ones—fostering connection, participation, and lasting value for their members.\nRecognizing outstanding projects or initiatives from family-owned businesses.\nRecognizing projects or initiatives that successfully attracted investment or were a direct result of investment.\nRecognizing groundbreaking innovations, inventions, or products of all types that have delivered meaningful outcomes, marking them as true wins worth celebrating.\nCelebrating bold brand marketing and other strategies and campaigns that truly moved the needle. Advertising, brand marketing, digital marketing, and performance marketing will be recognized in this category.\nCelebrating projects or initiatives that have made a measurable, positive impact on society, whether by addressing social challenges, advancing equity, improving well-being, or fostering sustainable change in communities.\nHonoring social media campaigns or innovations that have driven significant results, such as increased engagement, brand awareness, audience growth, or business impact.\nGet recognized as one of the top companies in your region, whether you’re leading in the Mid-Atlantic, Midwest, Northeast, Pacific, Rocky Mountain, Southeast, or Southwest.\nWhether you’re a scrappy startup or a powerhouse enterprise, get recognized for achieving excellence at your scale: Small and Mighty (0-49 employees), Medium (50-99 employees), Large (100-499 employees), Extra Large (500+ employees).\nWhether you’re building momentum or leading your market, get recognized for what you’ve accomplished at your revenue level: Lean and Mean (under $5 million in gross revenue), Prosperous and Thriving ($5 million to $50 million in gross revenue), Robust and Powerful ($50 million and up in gross revenue).\nFrom rising stars to legacy leaders, showcase how your company is making its mark at every stage of growth: On the Rise (0-4 years in business), Established Excellence Companies (5-14 years in business), Legacy Companies (15+ years in business).\nHonoring outstanding leaders who have successfully guided a key project or initiative, delivering significant results for their organization through strategic vision, effective execution, and impactful leadership.\nThe early-rate deadline is Friday, July 18, at 11:59 p.m. PT.\nThe preferred-rate deadline is Friday, August 15, at 11:59 p.m. PT.\nThe final deadline to apply is Friday, September 12, at 11:59 p.m. PT.\nAll applicants will be notified via email if they were chosen for the list.\nWe’ll send you a complimentary honoree toolkit to help you promote this incredible honor.\nAll Inc. Best in Business honorees will appear in the Winter issue of Inc. magazine and on Inc.com\nPreferred-Rate Deadline: August 15\nThe Inc. Best in Business awards are open to all companies—public, private, nonprofit, U.S.-based, and international. Applicants must apply to the Main List to showcase standout work across industries, and may apply to optional additional categories for more visibility.\nInc. editors will review all entries. Honorees will be announced on Inc.com in December 2025 and in the Winter 2025/2026 issue of Inc. magazine. Applicants will be notified by mid-November 2025 whether they have made the list.\nSee your win immortalized in pages of the Winter issue of Inc. magazine, get a dedicated company profile on Inc.com, and receive national and local media coverage.\n2024 List"
    }
  ],
  "argos_summary": "Perplexity has made a significant bid for Google's Chrome browser, which is reportedly above its own valuation of $14 billion. The company, which has previously sought to merge with TikTok, aims to leverage Chrome's vast user base to enhance its competitive position against larger rivals like OpenAI. Despite the bid, analysts suggest that Google is unlikely to sell Chrome due to its importance in the company's AI strategy and the ongoing legal battles regarding its monopoly status.",
  "argos_id": "VPL329J7A"
}