{
  "url": "https://9to5mac.com/2025/08/12/apple-responds-to-elon-musks-accusation-of-unequivocal-antitrust-violation-on-the-app-store/",
  "authorsByline": "Marcus Mendes",
  "articleId": "1738ffb2811c43e6974c2592539ea4a8",
  "source": {
    "domain": "9to5mac.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/01/grok-iphone-ipad-app.webp?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:03:07+00:00",
  "addDate": "2025-08-12T22:12:01.303069+00:00",
  "refreshDate": "2025-08-12T22:12:01.303071+00:00",
  "score": 1.0,
  "title": "Apple responds to Elon Musk’s App Store \"antitrust\" accusation",
  "description": "Last night Elon Musk complained about the fact that Apple never seems to feature X or Grok on the App Store. Today, Apple responded.",
  "content": "Last night Elon Musk took to X to complain about the fact that Apple never seems to feature either X or Grok on the App Store. He claimed the company was unfairly favoring ChatGPT, and said xAI would take “immediate legal action”. Today, Apple responded.\n\nIn a statement to Bloomberg’s Mark Gurman, Apple said:\n\nMusk’s claims came after he grew frustrated that, despite the X app topping the News chart yesterday, it never seemed to be featured on the App Store, apparently making it harder to climb the overall rankings.\n\nLikewise, over the past few days, and despite launching new features and making Grok 4 free for all users, the Grok app only reached fifth place overall and second in the Productivity category.\n\nBy contrast, he claimed that Apple’s constant promotion of ChatGPT made it “impossible for any AI company besides OpenAI to reach #1 in the App Store,” a claim quickly and easily debunked by xAI’s own Grok, following a heated exchange between Musk and OpenAI CEO Sam Altman.:\n\nAs for the lawsuit, despite Musk’s promise of “immediate legal action” by xAI, no suit appears to have been filed today.\n\nApple’s statement to Gurman suggests it’s taking the threat seriously, but its pointed use of the word “safe” is a not-so-subtle nod to Grok’s recent controversies (including antisemitic content and the release of sexualized companion chatbots), which may disqualify it as a recommendation-worthy app in the company’s view.\n\nWhat did you think of Apple’s response to Musk’s threat? Let us know in the comments.",
  "medium": "Article",
  "links": [
    "https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJ7HYG1/?tag=marcmendes-20",
    "https://www.amazon.com/Apple-Bluetooth-Headphones-Personalized-Effortless/dp/B0DGHMNQ5Z/?tag=marcmendes-20",
    "https://x.com/markgurman/status/1955383762247897412",
    "https://www.amazon.com/Apple-Cancellation-Transparency-Personalized-High-Fidelity/dp/B0D1XD1ZV3/?tag=marcmendes-20",
    "https://9to5mac.com/2025/08/11/elon-musk-accuses-apple-of-favoring-openai-in-app-store-rankings-promises-legal-action/",
    "https://twitter.com/grok/status/1955284926611537983?ref_src=twsrc%5Etfw",
    "https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJC52FP/?tag=marcmendes-20",
    "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
    "https://twitter.com/markgurman/status/1955383762247897412?ref_src=twsrc%5Etfw"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Elon Musk",
      "weight": 0.10084334
    },
    {
      "name": "App Store",
      "weight": 0.098331116
    },
    {
      "name": "Musk",
      "weight": 0.09311379
    },
    {
      "name": "Apple",
      "weight": 0.08484649
    },
    {
      "name": "Grok",
      "weight": 0.08455804
    },
    {
      "name": "immediate legal action",
      "weight": 0.07693995
    },
    {
      "name": "OpenAI CEO Sam Altman",
      "weight": 0.07525425
    },
    {
      "name": "sexualized companion chatbots",
      "weight": 0.07036588
    },
    {
      "name": "X",
      "weight": 0.06641733
    },
    {
      "name": "xAI",
      "weight": 0.06601789
    }
  ],
  "topics": [
    {
      "name": "App Store"
    },
    {
      "name": "Business Leaders"
    },
    {
      "name": "Lawsuits"
    },
    {
      "name": "Antitrust"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.98388671875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9462890625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.419921875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.39990234375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.3212890625
    }
  ],
  "sentiment": {
    "positive": 0.064482585,
    "negative": 0.7163079,
    "neutral": 0.21920954
  },
  "summary": "Apple has responded to Elon Musk's accusation that Apple never appears to feature either X or Grok on the App Store, making it harder for them to climb the overall rankings. Musk had accused Apple of unfairly favoring ChatGPT and promised to take legal action against the company. Despite this, no lawsuit has been filed yet. Apple responded by emphasizing that it is taking the threat seriously, highlighting recent controversies with Grok, including antisemitic content and the release of sexualized companion chatbots.",
  "shortSummary": "Apple responded to Elon Musk’s \"antitrust\" accusation, which he claimed favoritism of ChatGPT over X and Grok, by highlighting their respective achievements.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "958979ade93a44148c4ff6a259807b78",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://9to5mac.com/2025/08/11/elon-musk-accuses-apple-of-favoring-openai-in-app-store-rankings-promises-legal-action/",
      "text": "Elon Musk is (once again) going after Apple, this time accusing the company of an “unequivocal antitrust violation” for allegedly favoring OpenAI in the App Store’s AI rankings. Here are the details.\nA bit of context\nLast month, xAI released Grok 4, its latest large language model, promising major performance gains over leading competitors. Since then, the company has also rolled out features like Grok Imagine, its image and video generator, as well as customizable “companion” chatbots.\nDuring the same time period, according to data from App Figures, the Grok app climbed from around 60th to 29th place in the overall App Store rankings last week.\nEarlier today, xAI made Grok 4 free for users worldwide, helping the app climb further to fifth place in the overall App Store rankings, and second in the Productivity category.\nStill, that hasn’t been enough to dethrone OpenAI’s ChatGPT, which has spent the better part of the past year hovering at, or near, the top of Apple’s charts.\nFor the past year, Apple has also repeatedly featured ChatGPT in its App Store editorial content. More significantly, it partnered with OpenAI as part of its new Apple Intelligence rollout, which includes direct Siri integration and support for the Writing Tools feature.\nBut what about the lawsuit?\nEarlier tonight, Elon Musk posted the following on X:\nIt’s unclear what exactly triggered his threat of legal action, but if history is any guide, he’ll likely post more about it as his supporters egg him on. So his reasoning behind the move may become more apparent as the hours and days progress.\nMusk, of course, co-founded OpenAI before parting ways with the organization early on. More recently, he sued the company in an effort to block its transition to a for-profit model, a case still making its way through the courts.\nAt the same time, he’s also been competing directly with OpenAI with xAI. So it’s possible his latest grievance with the App Store is just an extension of that broader fight, and that he sees Apple’s platform as playing a key and anticompetitive role in OpenAI’s continued success.\nBe that as it may, Musk has a history of threatening legal action without always following through, so whether tonight’s post amounts to anything remains to be seen. For now, we’ll have to wait and see if he offers more context, or if xAI actually moves forward with a lawsuit in the coming days.\nDo you think Apple is giving OpenAI an unfair advantage on the App Store? Let us know in the comments.\nUpdate 10:25 p.m. ET: A few hours before the lawsuit threat, Musk had published this post in which he asked Apple why it “refuse(d) to put either 𝕏 or Grok in your ‘Must Have’ section when 𝕏 is the #1 news app in the world and Grok is #5 among all apps.” His post quoted a Tesla fan account, claiming that “the people” had spoken, and that X was the top news app in the U.S.\nAirPods deals on Amazon\n- AirPods Max, USB-C Charging: $479.99 ($549 off)\n- AirPods Pro 2, USB-C Charging: $169 ($80 off)\n- AirPods 4 USB-C Charging: $99 (was $129)\n- AirPods 4, USB-C and Wireless Charging: $148.99 (was $179)\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    }
  ],
  "argos_summary": "Elon Musk criticized Apple for allegedly favoring OpenAI's ChatGPT over his xAI's Grok app in the App Store rankings, claiming it constitutes an antitrust violation. Despite Grok's recent updates and a climb to fifth place in the overall rankings, Musk expressed frustration over its lack of promotion by Apple. In response, Apple acknowledged Musk's concerns but hinted that Grok's controversies might affect its recommendation status, while no legal action has been initiated by Musk as of yet.",
  "argos_id": "VS5HH72BD"
}