{
  "url": "https://www.dailymail.co.uk/news/article-14986975/Rise-stay-home-student-Gen-Z-living-mum-dad-university-rent-costs.html",
  "authorsByline": "Sophie Carlin",
  "articleId": "d3a1db53d9f94b82aeba8db74f6b647a",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/10/10/101079113-0-image-a-37_1754818374409.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-10T10:47:50+01:00",
  "addDate": "2025-08-10T09:52:37.577625+00:00",
  "refreshDate": "2025-08-10T09:52:37.577628+00:00",
  "score": 1.0,
  "title": "More Gen Z living with mum and dad at university - as rent costs soar",
  "description": "Nearly a third of 18-year-old applicants in the UK for the academic year 2024-25 planned to stay at home, Ucas said. Pictured: Stay-at-home students",
  "content": "For many, university is remembered as a time full of messy house shares, raucous parties and bleary group debriefs the morning after the night before.\n\nBut it has now been revealed more Gen Z students than ever are giving up the chaotic joys of student digs to live with mum and dad instead, according to new figures.\n\nNearly a third of 18-year-old applicants in the UK for the academic year 2024-25 planned to stay at home, the Universities and Colleges Admissions Service (Ucas) said.\n\nThis some 30 per cent figure is more than double that seen around 20 years ago, the Times reports - and also the highest recorded in this same timeframe.\n\nIn 2007, only 14 per cent of teens said they would not be moving out during their studies - and even more recently, in 2015, this figure had only risen to 21 per cent.\n\nIt comes as the financial burden of a degree balloons, with rents as high as £1,000 a month, parents unable to help out and an alive and well cost-of-living crisis.\n\nAn average student's debts at graduation typically tot up to an eye-watering £53,000.\n\nAnd this is likely to only get worse after next month, when annual tuition fees will increase from £9,250 to £9,535.\n\nStay-at-home student living started to peak sharply after the Covid pandemic, which saw families get used to rubbing along together at home during lockdowns.\n\nIt came after a similar rise after the 2008 financial crash, after which family budgets suddenly became tight.\n\nBack in 1984-85, only around eight per cent of freshers lived at home, according to a 2020 report from the now-defunct Higher Education Funding Council for England.\n\nThe number of home-dwelling students first really began to rise in the nineties - the same decade as tuition fees were introduced, in 1998.\n\nPassing on student accommodation is particularly common in London, where rents are famously high, and Scotland, where students go tuition fee-free.\n\nMeanwhile, applicants in Wales, the south east and throughout the south west seem largely to stick with a traditional student room.\n\nThe most common reasons mentioned for living with the parents were saving money (64 per cent) and being near family (46 per cent), as per a survey of 1,000 UK students by Leeds Beckett University.\n\nMore than half (53 per cent), meanwhile, said it motivated them to consistently attend classes - perhaps with mum and dad there to keep them in line.\n\nUcas chief executive Jo Saxton pointed out some students stay at home as it is close to the best course or university for them or to caring and family responsibilities.\n\nBut the former school leader emphasised, generally speaking: 'More needs to be done to ensure the cost of living doesn't become a limit on young people's ambition.'\n\nShe added how this affects students often varies vastly depending on which part of the country they come from and study in.\n\nFor instance, Glasgow Caledonian University is the UK institution with the most students living at home, at a whopping nearly half (45 per cent) of its intake.\n\nIt is followed by SOAS University of London (44 per cent) and University of Wolverhampton, Birmingham City University and the University of Bradford (all 43 per cent).\n\nMeanwhile, a mere one per cent of those at Oxford and Cambridge stay with their parents.\n\nMany Oxbridge colleges offer an appealing lifestyle of ease, with three meals a day, room cleaning and in some cases, even a free laundry service.\n\nAlso down at the lower end are the University of Durham and Aberystwyth University, at 2 per cent, and the universities of Lancaster and St Andrew's, at 3 per cent.\n\nMore than half of the most disadvantaged students plan to live with their parents instead of in halls - compared to fewer than one in five of the most well-off.\n\nUcas plans to roll out a scholarships and bursaries tool next year to try to even out students' access to the monetary support they need.\n\nGabrielle Williamson, 26, lived with her parents in the town of Blantyre, around 15 miles away from Glasgow University, where she studied for six years, graduating in 2023.\n\nNow a dentist, she said she stayed at home to save money but also to enjoy the homebody benefits of her mum making her meals and washing her clothes.\n\nShe said her parents had been upset at the thought of her potentially moving to Dundee for her degree.\n\nAnd with friends in student accommodation she could crash in at the weekends, Ms Williamson did not feel she missed out.\n\nA typical drive on a UK motorway in September might see drivers surrounded by cars stacked with pots, pans and duvets as freshers head to university for the first time.\n\nUcas strategy director Ben Jordan recalled his own drive to Cardiff University, 'with the bedding on the front seat of my Fiesta muffling Oasis's Definitely Maybe'.\n\nBut he emphasised it is likely far more students than we might think will not be driving across the country - but simply logging on to Zoom from home.\n\n'This stereotypical view of a literal journey into higher education isn't the case for everyone', he said.\n\nAnd it seems it can no longer be the baseline assumption.\n\nStudents now rate being 'close to home' as their fourth biggest priority, up from ninth a decade ago, a recent Ucas survey has shown.\n\nJoel Gilvin, 23, lived with his parents in Mile End, east London, during his degree in finance and accounting at Birkbeck University, which he graduated from summer.\n\nHis family were not happy about this at first, with his dad especially wanting him to have the full digs experience, like he did after moving from Liverpool to Warwick.\n\nBut Mr Gilvin was put off by the downsides of independent student living - a maintenance loan to repay, tricky housemates, messy flats and high rents.\n\nHe admits he might have made friends and memories by living out.\n\nBut this actually encouraged him to make more of an active effort to do this back home, through his hobbies of playing guitar, piano and cello.\n\nThe student said he felt most of his fellow pupils were moving away from home simply for social life reasons - and that just was not enough to motivate him to do it.\n\nKarly Nuttall, 23, lived with her parents in Altrincham, Greater Manchester, while she studied just over ten miles away, at the city centre's School of Journalism.\n\nShe had originally not intended to study in Manchester - with Covid and lockdown hitting and bringing the end of her social life any way, she thought she may as well.\n\nAnd the student has no regrets - she loved her time living in Manchester.\n\nHari Gautama, 21, who is about to enter the final year of his chemistry degree at King's College London (KCL), lives with his parents in the northeast of the capital.\n\nHe had seen his sister pay an arm and a leg for student accommodation in the city - 'a very small space right by some train tracks in Vauxhall' - and he was put right off.\n\nThe student was concerned the basic maintenance loan would not cover this kind of rent.\n\nAnd his life - friends, a band, the capital's vibrant music scene - was back in the capital, with his parents not fussed if he came back at 3am in order to live it.\n\nThe maximum maintenance loan - paid to those whose parents' household income is less than £25,000 - is £13,348.\n\nThis is less than the average annual student rent in London (£13,595), according to a report from student housing charity Unipol and the Higher Education Policy Institute.\n\nAnd digs these days keep getting more and more luxe in both specification and price tag.\n\nGarden Halls, for instance, which serves London universities like KCL, Goldsmith's and UCL, charges up to £1,675 a month for an en-suite room.\n\nIt also boasts tennis courts, landscaped gardens and catering.\n\nFusion Students, meanwhile, in the capital's Brent Cross area, charges up to £1,711 a month.\n\nBut it seems living at home does not even stop beyond graduation day either.\n\nThe proportion of 25-to-34-year-olds living with their parents has risen by more than a third in less than two decades, research from earlier this year found.\n\nAbout 450,000 more young adults are now in the family home compared to 2006 - and it is especially evident among men and those in their late 20s.\n\nThe trend, like that with students, has been fuelled by rent and house price increases with young people moving home to save, according to the study from the Institute for Fiscal Studies (IFS).\n\nThose living with parents are more likely to have seen 'large declines in net wealth', it found - and move back in with mum and dad following breakups or redundancies.\n\nThis figure hit a peak of 21 per cent during Covid before falling back slightly after lockdown restrictions were eased.\n\nMeanwhile, the share of 25 to 29-year-olds living at a parental home increased from 20 per cent to 28 per cent in the same time frame.\n\nIt suggests the age people traditionally flee the nest is rising.\n\nBee Boileau, a research economist at IFS, said: 'For some, living with parents provides an opportunity to build up savings more quickly than if they were renting - which is an especially valuable advantage in high-cost places like London.\n\n'However, others are likely to be living at a parental home due to a bad shock of some kind - such as the end of a relationship or a redundancy - or simply because they cannot afford to live independently.'\n\nYoung people living with their parents would otherwise be paying £560 per month on average if privately renting, the study said - with this figure rising to £1,000 in London.\n\nSome 14 per cent of young adults living with their parents saved more than £10,000 over a two-year period, equal to an additional £400 each month.\n\nThis rate is more than a third higher than similar young adults who are living in private rented accommodation.\n\nBusiness appears to be booming at both the bank and the hotel of mum and dad.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/news/article-13871443/Gen-Z-clueless-traditional-cookers-hoovers-university-survey-reveals-parents-robot-vacuum-cleaners-air-fryers.html",
    "https://www.dailymail.co.uk/news/article-13903727/Gen-Z-students-ditching-booze-freshers-week-Hummus-societies.html",
    "https://www.dailymail.co.uk/news/article-14519653/peter-hitchens-useless-university-degrees-gen-z-sarah-vine-podcast.html",
    "https://www.thetimes.com/uk/education/article/stay-at-home-university-student-rise-w2qwxz7d5",
    "https://www.dailymail.co.uk/news/article-14568109/Gen-Z-lazy-masters-effort-management-Oxford-professor.html",
    "https://www.dailymail.co.uk/femail/article-13869351/Gen-Z-Students-sober-freshers-weeks.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "student accommodation",
      "weight": 0.08084119
    },
    {
      "name": "Students",
      "weight": 0.079303294
    },
    {
      "name": "students",
      "weight": 0.079303294
    },
    {
      "name": "student digs",
      "weight": 0.079259805
    },
    {
      "name": "more Gen Z students",
      "weight": 0.07812642
    },
    {
      "name": "independent student living",
      "weight": 0.076511204
    },
    {
      "name": "student housing charity Unipol",
      "weight": 0.069125496
    },
    {
      "name": "parents",
      "weight": 0.064365216
    },
    {
      "name": "home",
      "weight": 0.061523993
    },
    {
      "name": "high rents",
      "weight": 0.05733614
    }
  ],
  "topics": [
    {
      "name": "Academia"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.810546875
    },
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.74462890625
    },
    {
      "name": "/News/Local News",
      "score": 0.52392578125
    }
  ],
  "sentiment": {
    "positive": 0.05368042,
    "negative": 0.69384766,
    "neutral": 0.25268555
  },
  "summary": "The number of Gen Z students living with their parents at university has increased as rent costs rise, according to new figures from the Universities and Colleges Admissions Service (Ucas). Nearly a third of 18-year-old applicants in the UK for the academic year 2024-25 planned to stay at home, a figure more than double the figure seen around 20 years ago. This comes as the financial burden of a degree increases due to high rents, parents unable to help out, and a cost-of-living crisis. The rise in stay-at-home student living began to rise in the nineties, the same decade as tuition fees were introduced, in 1998. The most common reasons for living with the parents were saving money (64%) and being near family.",
  "shortSummary": "More Gen Z students are living with parents, driven by rising rents and financial constraints, though this trend remains widespread across regions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f52152c3d2cd499893b14a60b20892ad",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/news/article-14519653/peter-hitchens-useless-university-degrees-gen-z-sarah-vine-podcast.html",
      "text": "'It's been a CATASTROPHE': PETER HITCHENS hammers 'worthless' university degrees and surge in Gen Z joblessness in latest episode of the Alas Vine and Hitchens podcast with SARAH VINE\n- PODCAST: Acclaimed columnists Sarah Vine & Peter Hitchens tackle one big idea each week on our new politics podcast – Alas Vine & Hitchens. Listen here\nAcclaimed broadcaster Peter Hitchens has surprisingly defended Gen Z in their struggle to find stable and fulfilling work, blaming universities for offering 'useless' degrees that have left a generation unfit for the job market.\nIn response to new figures which show one in four young adults are not either working or seeking a job, the best-selling author told co-host Sarah Vine that the statistic is unsurprising given the opportunities for 'exciting or taxing' work being so limited.\nHitchens went on to criticise higher education, declaring that 'so few jobs having anything to do with university', in the latest episode of the Alas Vine & Hitchens podcast.\nHitchens said: 'Gen Z can't get work, the poor things, which is either exciting or taxing, it is almost impossible.\n'They are either stuck at a screen, or sitting at a desk, or indeed sitting at home staring at a screen; we used to be able to go and get hard jobs.\n'It is a catastrophe. In many cases, young people have been sent off to universities for worthless degrees which have produced nothing for them at all.\n'They'd have been much better off being apprentices to plumbers or electricians: they would have been able to look forward to a much more abundant and satisfying life.'\nEach week, acclaimed columnists Sarah Vine and Peter Hitchens pull apart and debate one 'big idea' on the Mail's new politics show, Alas Vine & Hitchens. Listen wherever you get your podcasts\nSarah Vine and Peter Hitchens discuss work and Gen Z on their new Mail podcast Alas Vine & Hitchens. Listen here\nHitchens warned listeners that the result of this monetised education system would be an increasing number of people claiming benefits, risking the future of the 'entire economy'.\n'There's a huge problem coming', Hitchens explained. 'The amounts of money we're spending on paying people not to work is not just disastrous in its own right.\n'It destroys the lives of those we pay. It will destroy the economy.\n'In the end, what will happen is that our entire civilisation will be swept away by such a gigantic wave of inflation, that the only solution to a welfare state as chaotically grotesquely huge as ours will be a catastrophe.\n'The lack of urgency among politicians in dealing with this problem just gives me the shivers.'\nPeter Hitchens: 'Young people have been sent off to universities for worthless degrees which have produced nothing for them at all.' Listen here\nSarah Vine: 'There seems to be this notion that that all work must be fulfilling and wonderful.' Listen to Alas Vine & Hitchens here.\nMail columnist Sarah Vine disagreed with her outspoken counterpart, arguing instead that the young people of this generation are uniquely workshy.\nShe added that Gen Z seem incapable of viewing jobs as a 'stepping stone', where people start at the bottom and gradually move on to bigger and better things.\nVine argued: 'There seems to be this notion that that all work must be fulfilling and wonderful. I did a lot of rubbish jobs and then I was very lucky.\n'I have always tried to teach that when you get a job, try and be the solution, not the problem. It'll be a stepping stone towards something more interesting.\n'Generally, if you have the right attitude, people will put more things your way.'\nListen to Alas Vine & Hitchens, with Sarah Vine and Peter Hitchens wherever you get your podcasts now. New episodes released every Wednesday."
    },
    {
      "url": "https://www.dailymail.co.uk/femail/article-13869351/Gen-Z-Students-sober-freshers-weeks.html",
      "text": "- UK students have shared their experiences of sober living at university on TikTok\n- READ MORE: The reluctant 'heroin chic' pioneer who turned away from fashion\nFor many graduates, freshers' week was all about cheap booze, club nights, and a lack of sleep.\nBut for a new cohort of Gen Z students across the UK, it's shaping up to be a completely different experience, with many opting for a teetotal week.\nMany of Scotland's universities have replaced freshers' week with 'Welcome Week', offering students a programme of events reflecting modern trends, instead of binge drinking and all-night parties.\nIn Bristol, student newspaper Epigram has shared information on the 'best non-drinking events for sober students' over freshers' week. These activities include cold water swimming, drum and bass boxing, and park yoga.\nStudents have taken to TikTok to share their experiences of sober living at university, revealing their top tips on avoiding alcohol.\nStudents, including Elysia Sanders at University of Durham, have shared content discussing staying sober during freshers' week\nIn Edinburgh, Stirling, Strathclyde and St Andrews, students can take part in other alcohol-free activities, including Taylor Swift parties, singalongs and tribute acts.\nYoga classes have proven to be a particularly popular choice, with some universities even offering 'puppy yoga' featuring '30 minutes of puppy cuddles and yoga poses' for students.\nFor those keen to share their green credentials, some universities are holding vegan picnics and walking tours featuring environmentally friendly local businesses.\nOther alcohol-free fun can be had at sober ceilidhs, as well evenings where students can enjoy pizza, board games, and bracelet-making workshops.\nSai Shraddha Viswanathan, president of the National Union of Students Scotland, said: 'It is encouraging to hear examples of welcome weeks becoming more varied, reflecting Scotland's diverse student body, which includes carers, parents, and people of different faiths and perspectives.\n'As students struggle with crises in housing, the cost of living and under-funding of education, they need and deserve to have fun and blow off steam.\n'There is nothing inherently wrong in partying but this trend towards a more diverse range of activities benefits everyone.'\nWelcome Week has been introduced at Edinburgh, Glasgow, Aberdeen, Dundee, Stirling, Abertay, Napier, Heriot-Watt, Queen Margaret, and West of Scotland.\nTikTok content creator Freya (pictured) explained why Loughborough University is a good choice for those who don't drink alcohol\nAccommodation for Students' TikTok account also shared some top tips for how teetotal students can enjoy freshers' week\nAt Edinburgh, with 6,500 new undergraduates arriving this month, the student association stated: 'We do not use Fresher's terminology. All official events will be under the banner 'Welcome Week' - an opportunity to have fun, make friends and find out what's on offer.'\nThere are visits to a farmers' market, a 'books and coffee crawl' exploring the city's literary heritage, pony trekking in the Pentland Hills and sustainable food demonstrations.\nThe only official pub crawls are organised by the Actuarial and Chemical Engineering Societies.\nAt Glasgow, there is a murder mystery event, charity shop crawl, houseplant sales and a trip to Ikea.\nMeanwhile, at Aberdeen, yoga classes are on offer as well as pizza-making sessions, a games night and a girls pamper event.\nHowever, freshers' week is still honoured at Glasgow Caledonian and Robert Gordon universities as well as Strathclyde, where students can enjoy a Glow Rave and Sunday Sesh.\nMeanwhile, in Bristol - a city renowned for its partying scene - the student newspaper, called Epigram, highlighted ways in which sober students can enjoy freshers' week.\n'As more and more young people are embracing a sober curious lifestyle, alcohol-free meetups and nights out and now becoming popular social alternatives, and Bristol is no exception,' the article read.\nStudents at the University of Bristol have a choice of 101 boozeless activities to pick from, like drum and bass boxing or playing frisbee in the park.\nA second-year teetotal student spoke to the newspaper and explained that the university offers sober students places to enjoy 'without judgment' allowing them to feel like a 'part of a community'.\nThe article also highlighted a group called Sober Circle; a non-profit Facebook group that helps young people connect with each other without alcohol, which has gained 1,800 members since its genesis in 2019.\nElsewhere, student discount brand Student Beans has promoted studying without alcohol since last year.\nRepresentatives for the organisation took to the streets of Manchester to ask students about their attitudes to drinking. Alongside a TikTok video featuring the vox pops, it shared the caption: 'Let's normalise student sobriety. Freshers is still fun without the drink.'\nIn the video, the first interviewee said: 'So, I actually don't drink...you can have a good time without needing to drink.'\nThe second added: 'There are tonnes of activities in Manchester where people don't drink, there's a board game society... and even then, you can still go to clubs and stuff with your friends and not drink, you need to find people who respect your choice.'\nMeanwhile, a student accommodation search engine TikTok account, called Accommodation for Students, also took it upon themselves to give advice to sober students.\n'How to enjoy freshers' week sober,' the post began. It continued: 'Here are some ways you can enjoy it sober.\n'First, check out your welcome week app and sign up to lots of events, freshers' week is a great chance to try hobbies that you always wanted to do.\n'Secondly, use the time to explore your new city and do lots of tourist things that you won't have time for once term has started.'\n'If you do decide to go out, it's totally ok not to drink and you'll be surprised at the amount of people who are in exactly the same boat as you,' it concluded.\nStudent content creators have taken to TikTok to share their experiences of being sober at university and during freshers' week.\nContent creator Freya explained the university choice she thought is the best for sober students.\nShe said: 'Loughborough is probably one of the better universities to go to if you don't drink... I know that in freshers' week, my halls had a whole freshers' schedule for sober activities.\n'There is so much to do that doesn't involve drinking, I'm involved in multiple societies where we do stuff that doesn't involve drinking... there is definitely a lot to get involved in.'\nElsewhere, Elysia Sanders, who is now in her third year at the University of Durham, explained what she would do differently during freshers' week if she was to go back in time.\nShe said: 'I'm in my third year now, I've had a lot of time to reflect. The first thing I'd do is I'd care a lot less about what people thought about how much alcohol I drink.\n'I just came off the back of a post A Level summer where I didn't drink anything... I came to university and thought, \"everybody is going to think I'm weird if I don't drink\"... but do whatever you need to do to have fun.'\nShe added: 'Particularly if you're up front about it and not trying to come up with excuses for it."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-13903727/Gen-Z-students-ditching-booze-freshers-week-Hummus-societies.html",
      "text": "Hummus societies, sober spa evenings and macramé crafts nights: How Gen-Z students are ditching the booze this freshers' week\n- Are you a sober fresher? Email: cameron.roy@mailonline.co.uk\nA typical freshers' week experience involves a sweaty nightclub, a greasy kebab and a raging hangover in a lecture hall.\nBut this year more universities than ever are catering to first-time students who want to ditch the booze altogether and go sober.\nInstead they are offering hummus societies, sober spa evenings and macrame craft nights to entertain students as they get to know each other at the start of term.\nThe University of Manchester has put on a bunch of alcohol-free options including beatboxing classes and technical theatre training.\nAnd the University of Edinburgh has a schedule that includes yoga classes and screenings of Disney films.\nStudents, including Elysia Sanders at University of Durham, have shared content discussing staying sober during freshers' week\nInstead of boozy nights out, universities are catering to first-time students by offering them hummus societies, sober spa evenings and macrame craft nights. Pictured: University of Manchester’s sober freshers’ week poster\nSober activities such as drum and bass boxing, meditation classes and movie nights have been a feature for universities this year\nBut perhaps the biggest selection of sober activities comes from the University of Bristol, which is holding 101 teetotal events, including drum and bass boxing and meditation classes.\nA survey by Drinkaware found that 21 per cent of 18-to-24-year-olds were teetotal, up from 14 per cent in 2017. The proportion of non-drinkers in that group was the highest of any age group, with just 13 per cent of over-25s saying they do not drink.\nAnd although young people still binge drink, they do it less than they used to, with fewer than three-quarters of Gen Z-ers surveyed in 2023 reporting binge drinking at least once in the past year, down from 82 per cent in 2017.\nIn a bid to meet changing student behaviour, universities have been doing more than sober events during freshers week.\nThe University of Bradford has completely transformed one of its student union bars into an alcohol-free social space that serves hot drinks, bubble tea, mocktails and smoothies.\nA university spokesperson said student life was 'quite different to years ago' and it had 'acted on what students wanted in order to be more inclusive'.\nElysia Sanders, a third-year student at Durham University who completed her second year sober, gave advice to younger students who would be going to university for the first time\nAccommodation for Students' TikTok account also shared some top tips for how teetotal students can enjoy freshers' week\nAlthough it has ditched the pints and pitchers, the venue still features many traditional bar features, including large TV screens for watching sports, a dancefloor, darts, pool and shuffleboard.\nAleem Bashir, chief executive of University of Bradford Union of Students, said students were feeling the cost of living crisis and had less money to spend on going out.\nHe told the BBC: 'A lot of students now have part-time jobs, some may have multiple jobs. When you have to wake up early morning for a shift you can't be going in there hungover,' he said.\n'It's about diversifying the offering for students now and just making the options of non-alcoholic drinks available to them.'\nGen Z-ers grew up in the age of social media apps which have become packed with influencers promoting healthy lifestyles based on exercise and diet.\nOther factors turning them away from alcohol include an increased awareness of health risks, the impact of social media and hangover-induced anxiety dubbed 'hangxiety'.\nBars and breweries have been meeting the rising demand for sober options by swapping out the once-watery cans of lager for more premium and well-made alcohol-free drinks.\nBut ultimately the decision to stop drinking is down to the individual, and in true Gen Z style, dozens of young people have been taking to social media to discuss why they decided to go sober.\nThe University of Bradford has completely transformed one of its student union bars into an alcohol-free social space that serves hot drinks, bubble tea, mocktails and smoothies\nA Bradford University spokesperson said student life was 'quite different to years ago' and it had 'acted on what students wanted in order to be more inclusive'\nAleem Bashir, chief executive of University of Bradford Union of Students, said students were feeling the cost of living crisis and had less money to spend on going out\nMillie Gooch, 31, stopped drinking when she was 26 because of mental health reasons\nElysia Sanders, a third-year student at Durham University who completed her second year sober, gave advice to younger students who would be going to university for the first time.\nShe said: 'I'm in my third year now, I've had a lot of time to reflect. The first thing I'd do is I'd care a lot less about what people thought about how much alcohol I drink.\n'I just came off the back of a post A Level summer where I didn't drink anything... I came to university and thought, \"everybody is going to think I'm weird if I don't drink\"... but do whatever you need to do to have fun.'\nShe added: 'Particularly if you're up front about it and not trying to come up with excuses for it.\nThe Accommodation for Students' TikTok account featured a student at the University of Edinburgh who posted a guide for students looking to do freshers week sober.\nShe said: 'I did my entire freshers week sober and still had a great time. If you do decide to go out it's totally okay not to drink and you'll be surprised by the amount of people who are in exactly the same boat as you.\n'The most important thing is just to be yourself whether that involves drinking or not.'\nShe also gave students ideas for alternative activities other than drinking, such as signing up for societies, exploring the city and looking around the university.\nTikTok content creator Freya explained why Loughborough University is a good choice for those who don't drink alcohol\nEllie Hanson, 25, said she has been sober for one year after she gave it up after being unwell on a big night out with her friends.\n'I've always had a really strange relationship with alcohol. In uni I was a proper binge drinker, I was the last one awake to all hours of the morning, I didn't like who I'd become.\n'Over time alcohol became part of my personality, I was making decisions that I wouldn't have made sober which were putting me at risk, putting my friends in awkward situations, causing arguments, causing a lot of drama.\n'There was never that much positive that came out of the end of a night out for me personally.\n'I also always felt like the next day I was a bit of a laughing stock because I done something that was stupid. And it is still brought up to this day the things I did and I cringe.\nMillie Gooch, 31, stopped drinking when she was 26 because of mental health reasons.\nShe said she still wanted to do fun things so she started Sober Girl Society, which was where other sober women can meet up to do things while sober.\nTikTok user Tatty Lomas said she has been sober for 600 days and she says her generation are consuming less alcohol than their parents due to mental health\nThe club is now the largest community for sober and sober curious women in the UK.\nElsewhere content creator Freya explained the university choice she thought is the best for sober students.\nShe said: 'Loughborough is probably one of the better universities to go to if you don't drink... I know that in freshers' week, my halls had a whole freshers' schedule for sober activities.\n'There is so much to do that doesn't involve drinking, I'm involved in multiple societies where we do stuff that doesn't involve drinking... there is definitely a lot to get involved in.'\nTikTok user Tatty Lomas said she has been sober for 600 days and she says her generation are consuming less alcohol than their parents due to mental health.\nShe said: 'I think drinking is so ingrained in British culture that we are the first generation to think \"wait a minute I don't actually enjoy so why am I doing it? I is actually affecting me really negatively\".'"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-14568109/Gen-Z-lazy-masters-effort-management-Oxford-professor.html",
      "text": "Gen Z aren’t lazy, they’re masters of ‘justified effort management’, says Oxford professor\nGeneration Z are not lazy they are simply masters of ‘justified effort management’, according to an Oxford University professor.\nKatrien Devolder, a professor of applied ethics who researches ‘laziness’, said that many older people are workaholics and Gen Z instead chooses to make ‘strategic choices about their energy’.\nThe researcher believes that older workers could even benefit from following Gen Z’s lead - by drawing stricter boundaries around their work.\nProfessor Devolder said that young people are ‘immersed in a culture that expects constant achievement’ and as a result a perception that Gen Z and millennials are ‘lazy’ or ‘entitled’ persists.\nShe added that this is particularly the case for Gen Z - those born between 1997 and 2012 - ‘in the era of working from home’.\nKatrien Devolder, a professor of applied ethics at Oxford University, (pictured) argues Gen Z are not lazy they are simply masters of ‘justified effort management’\nIn a recent essay published on The Conversation website, Professor Devolder wrote: ‘If you’re a young person today, you’ve probably felt the sting of being called lazy, or caught yourself wondering if you are.\n‘Do you sometimes feel guilty when not being productive, or find yourself pretending to be busy?\n‘You’re not alone. Self-doubt about productivity is very common and no wonder: we’re immersed in a culture that expects constant achievement.’\nAs part of her research, Professor Devolder has come up with a working definition of laziness, with someone who fits this definition lacking ‘a good reason for not trying harder, for limiting your effort’.\nHowever she said that, conversely, if somebody has a valid reason to hold back - such as burnout, or ‘discrimination against those who work differently’ - then they are not lazy, just rational.\nPictured: woman working from home, sat on the sofa with a laptop on her lap. More and more Brits are now working from home\nThe researcher said that judging someone as lazy ‘reinforces a harmful myth that emerged from the Protestant work ethic and was further entrenched by capitalist values’.\nShe added: ‘Before labelling someone as lazy, consider whether there might be good reasons for their approach.\n‘Perhaps they’re making strategic choices about their energy, dealing with invisible challenges or prioritising differently.\n‘Sometimes, taking it easier isn’t laziness - it’s wisdom.’\nAnd professor Devolder said that accusations of idleness from older people often reveal more about the accuser than the accused.\n‘The tendency to judge others as indolent or shiftless often results from overvaluing effort, long hours and constant busyness,’ she told The Times.\n‘What might appear to be laziness is actually justified effort management: you have good reasons to rest or genuine limitations on how much effort you can exert.’\nShe added: ‘I’m not suggesting we should only think about what matters to us personally. Fulfilling responsibilities to colleagues, family and community is important.\n‘But within those boundaries, you can question the common idea that more productivity and trying harder is always better.’"
    }
  ],
  "argos_summary": "A significant shift is occurring among Gen Z students in the UK, with nearly a third of 18-year-old applicants for the 2024-25 academic year planning to live at home instead of moving into student accommodation, a figure that has more than doubled in the past two decades. This trend is largely attributed to rising living costs, including high rents and tuition fees, as well as the financial burdens of student debt, which averages £53,000 at graduation. The preference for staying at home is particularly pronounced in cities with high living costs, such as London, and reflects changing priorities among students, who increasingly value proximity to family and financial savings over traditional student living experiences.",
  "argos_id": "W5ECDHODW"
}