{
  "url": "https://www.nytimes.com/athletic/6539101/2025/08/12/tottenham-season-betting-preview-odds/",
  "authorsByline": "The Athletic Staff",
  "articleId": "09c97cdc4cb54e7aa6ab914b0cd90ec9",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/06171106/GettyImages-2227112682-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:00:51+00:00",
  "addDate": "2025-08-12T07:06:04.410789+00:00",
  "refreshDate": "2025-08-12T07:06:04.410791+00:00",
  "score": 1.0,
  "title": "Tottenham season betting preview: A bounce-back in the league or more struggles?",
  "description": "Tottenham were all the way down in 17th in the Premier League table, but managed to qualify for the Champions League. Will Spurs improve?",
  "content": "Thomas Frank has probably never had a job like this in his career. How often do you take over a club that finished 17th in the Premier League last season, yet ambitions are the highest they’ve ever been?\n\nTottenham finally ended their trophy drought by winning the Europa League in May to cap off a disastrous season that finished with 22 defeats in the league, the most by any team without getting relegated. It was an incredibly bad season for Spurs and one that cost Ange Postecoglou his job.\n\nBut the club have tried to eradicate memories of that rotten domestic run and instead focus on building upon their European triumph. At least that’s the impression chairman Daniel Levy gives.\n\n“It’s not enough,” Levy told the club’s official media channels when asked why he decided to sack Postecoglou. “We want to win the Premier League. We want to win the Champions League.”\n\nIn a later interview with Gary Neville on Sky Bet’s The Overlap, he said that while Frank didn’t have to deliver the title this season, he hoped the Dane could win it “as soon as possible.”\n\nLevy has certainly backed his new manager after spending around £120m so far, and more arrivals are expected through the door soon. Frank’s main objective at Spurs this season will be to improve a handful of players who haven’t quite hit the heights expected of them. During Postecoglou’s two years, it’s hard to think of one player who really went to another level under his leadership.\n\nThere’s plenty of work to do in order to get this squad delivering the quality expected of them, but Frank’s work at Brentford shows he knows how to make his teams well-drilled, organised and lethal in attack.\n\nIf Frank doesn’t have to win the Premier League this season, what should he aim for? In that same interview with Neville, Levy said the club simply wanted to compete at the highest level.\n\nThe team got lucky in securing Champions League football last season via their Europa League success, when teams like Nottingham Forest, Aston Villa missed out despite having much better seasons. Spurs have to make sure the 2024-25 campaign was just a blip — and must qualify for the Champions League again this term.\n\nOf course, Tottenham have no divine right to waltz straight back into contention for European places after coming closer to battling relegation, but Champions League football is what this club craves — and what it desperately needs. The prize money the competition offers is vital for Spurs in paying off their glitzy new stadium, which cost more than £1billion to build.\n\nThat must be the minimum expectation. It’s achievable given that fifth was enough to secure a place in Europe’s elite competition. That should be the case again this term if England’s UEFA co-efficient remains the same.\n\nWhat about trophies? That famous night in Bilbao has only left Spurs fans craving more success — they don’t want to wait another 17 years for the next parade down Tottenham High Road.\n\nIt’s still been 17 years since Spurs last won a domestic trophy so that should be a goal — finish the season in the top five and with either the Carabao Cup or FA Cup. Newcastle pulled off that same feat last season so it’s possible with the right application.\n\nTottenham’s lofty ambitions of winning the Premier League might have to be put on ice for a few years at least given the scale of the task in front of manager Frank. They are very much outsiders with Betfair for the title after being rated at 50/1.\n\n \n\n \n\n \n\n They are much more likely to finish in the top four after being backed at 5/1 to do so. Seven sides have shorter odds for a top-four finish. For a top-five finish, they have even shorter odds at 12/5.\n\nIn terms of their season objectives, Spurs are rated at 4/1 to win any of the Premier League, FA Cup, League Cup or Champions League.\n\nIt might come as a surprise that Tottenham have actually made six signings in this window. Two of them were permanent moves for players who were already at the club as defender Kevin Danso and winger Mathys Tel joined after their loan spells.\n\nFrank has also been bolstered with more defensive options after the arrivals of young Japanese centre back Kōta Takai and Croatian star Luka Vušković, who Spurs technically signed in 2023 before being loaned out for two years.\n\nSome midfield steel has been secured too in the form of João Palhinha, who joined on loan from Bayern Munich. He should give Spurs more solidity defensively and allow them to break up play much more effectively. It’s a top signing considering Bayern snapped him up from Fulham for £47m last summer.\n\nIn the attack, winger Mohammed Kudus joined from West Ham for around £55m and he can also play as a No 10. Tottenham might have had a seventh signing if a move for Nottingham Forest star Morgan Gibbs-White hadn’t collapsed. Kudus will have to help fill the void left by Son Heung-min’s departure after a legendary tenure with the club.\n\nSpurs will have a chance to compete for a trophy in their first competitive game of the season as they take on feared Champions League winners Paris Saint-Germain in the UEFA Super Cup, which will take place at Udinese’s stadium on August 13.\n\nThat’s three days before their Premier League opener against Burnley at the Tottenham Hotspur Stadium, which will be followed by a tough trip to Manchester City on August 23. They then face Bournemouth at home on August 30 to round off the month.\n\nAfter the international break, they’ll travel to West Ham on September 13 before another trip to Brighton on September 20.\n\nBetting/odds links in this article are provided by partners of The Athletic. Restrictions may apply. The Athletic maintains full editorial independence. Partners have no control over or input into the reporting or editing process and do not review stories before publication.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6522100/2025/08/04/son-heung-min-is-tottenham-tottenham-is-son-heung-min/",
    "https://youtu.be/MVEgt7ZU470"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Premier League",
      "weight": 0.077468336
    },
    {
      "name": "Champions League",
      "weight": 0.07510475
    },
    {
      "name": "last season",
      "weight": 0.07491396
    },
    {
      "name": "Tottenham season betting preview",
      "weight": 0.074724905
    },
    {
      "name": "Champions League football",
      "weight": 0.07419967
    },
    {
      "name": "League Cup",
      "weight": 0.07298644
    },
    {
      "name": "Europa League",
      "weight": 0.06923967
    },
    {
      "name": "feared Champions League winners",
      "weight": 0.0691982
    },
    {
      "name": "season",
      "weight": 0.06804161
    },
    {
      "name": "seasons",
      "weight": 0.06804161
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9853515625
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.93505859375
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.6474609375
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.45458984375
    }
  ],
  "sentiment": {
    "positive": 0.08759195,
    "negative": 0.6218196,
    "neutral": 0.2905884
  },
  "summary": "Tottenham Hotspur is set to embark on a new season with a strong start to the season, following a disappointing season that saw the team finish 17th in the Premier League and lose 22 games in the league, the most by any team without getting relegated without a loss. The club's chairman, Daniel Levy, stated that the club's ambitions are the highest they've ever been and they aim to win the Champions League. The team's main aim is to improve players who have not quite met expectations. Despite this, Tottenham has made six signings this year, including six permanent players and two temporary players. The Champions League is crucial for the club for its financial needs and for its future, as it must qualify for the Champions Champions League again this term.",
  "shortSummary": "Tottenham's season starts with a potential top-four finish, while manager Thomas Frank aims to improve on previous successes and secure a long-term trophy.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4b8926a25b5444cb86df34796fe72e95",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6522100/2025/08/04/son-heung-min-is-tottenham-tottenham-is-son-heung-min/",
      "text": "Son Heung-min’s Tottenham career ended in Seoul, but his 10-year journey with them was completed in Bilbao.\nThat was where he lifted the Europa League trophy in May, the single moment which suddenly made sense of everything else. All of the effort, all of the loyalty, all of the goals, all of the tears. Justified by that night in northern Spain and the celebrations that followed.\nAdvertisement\nAnd it was in Bilbao where Son’s embodiment of Tottenham — and Tottenham’s of Son — became complete.\nNobody understood this before that final better than their head coach at the time, Ange Postecoglou. And he used it as motivation.\n“I made him a big focus of our Europa run because I thought he was symbolic of where people saw the club,” Postecoglou tells The Athletic. “Obviously he’s an outstanding player but was missing that key piece of success.”\nPostecoglou told the players that victory against Manchester United would change perceptions of both Son and the club in an instant.\nThe players went out and did it for Son, just as they did for Spurs. There was no longer any distinction between the two.\nIt is rare to see that sort of unity between player and club. But that is what Son reached over the course of his decade in north London. It is a profound achievement, an unquestioning love, more so than anything won merely on the pitch. His place in the history and memory of the club and their community is deep, permanent and unambiguous.\n“Sonny is Tottenham,” said an emotional James Maddison on Saturday, preparing to play with his captain and close friend for the final time. “And Tottenham is Sonny. It’s weird to think about Tottenham Hotspur without Son.”\nFor the start of the story of Son and Tottenham, you have to go back not 10 years but 12. Back to 2012-13, when he was a 20-year-old at Hamburg, starting to make an impression in the Bundesliga. It had been hard work establishing himself in German football but people were starting to take notice of this fast, graceful forward who was already starting to cut through teams.\nTottenham sent their former manager David Pleat over to watch the South Korean in action, but he was not initially convinced. He thought Hamburg looked terrible and Son, recovering from an injury at that time, did not look fit. Still, Spurs were curious enough to open talks with Hamburg about a move. Remember, this was the point when they were starting to think about life after Gareth Bale, who joined Real Madrid in the summer of 2013. Young, dynamic forwards were very much on their mind.\nDespite Tottenham’s interest, it was another English club who got closest to signing him from Hamburg. Mauricio Pochettino had only been Southampton manager for a few months but knew that he needed more speed and goals in their forward line for the following season. “Sonny represented exactly the profile that we liked: dynamic, good on transitions, could play vertically, could play off both sides,” Paul Mitchell, then Southampton’s head of recruitment, tells The Athletic. “We wanted to play high pressing, high-octane football in and out of possession. He was perfect.”\nAdvertisement\nSo it was Southampton rather than Spurs who were front of the queue in summer 2013, but Son decided it was not the right time to try his luck in the Premier League. He stayed in Germany, moving to Bayer Leverkusen.\nPochettino, of course, left Southampton for Spurs in summer 2014. Six months later, Mitchell followed him. Pochettino and Mitchell knew they had an exciting young team at White Hart Lane, but one that needed an extra cutting edge. They remembered Son, now playing for a Leverkusen team whose style perfectly mapped onto Pochettino’s own brand of pressing. “We never lost the idea of how well he aligned to principles we wanted to build in our teams,” Mitchell says.\nThe fact that Son was shining in a team that put so much emphasis on running and pressing was important, but so was his physical robustness. Over his two years with Leverkusen, he only missed four matchday squads out of 94, and they were all because of international commitments or suspensions.\nIn February 2015, Tottenham sent a scout to Leverkusen to watch a game against Wolfsburg. In the first half, Kevin De Bruyne and Bas Dost ripped through Leverkusen, building a 3-0 lead. The second half belonged to Son. He started by nicking the ball from the hands of Diego Benaglio and rolling it in. For his second goal, he sprinted after a long pass, took it down calmly, then lifted it over Benaglio with the outside of his right boot. To complete his hat-trick, Son cut in from the right and thumped a shot with his left foot through a busy penalty area into the bottom corner.\nLeverkusen lost 5-4 that day, Son’s hat-trick bested by Dost scoring four times. But Spurs had seen enough. The scouting feedback to the club was not just about those three goals, but his intangible qualities that had to be seen up close: How relaxed he was in front of goal. The efficiency of his actions in the final third. His two-footedness, but especially his unique capacity to surprise opponents by getting unpredictable shots off from either side of the goal.\nTottenham had also been interested in West Bromwich Albion striker Saido Berahino, but then learned of an issue between Leverkusen manager Roger Schmidt and Son. “It gave us this little window of opportunity,” Mitchell recalls. “Because we had done all the background checks, all the profiling, checking his alignment to the style, we could move really, really quickly.” So fast, in fact, that some Spurs staff were frantically Googling their new player’s name on the day he signed.\nOn August 28, 2015, Son joined Tottenham for £22million ($29m at the current rate). Mitchell is still proud of the deal: “That fee for a player of that quality is maybe one of the best investments any of us have ever made in our careers.”\nKevin Wimmer still remembers Son’s first day at Spurs. Austrian defender Wimmer had arrived at the start of that summer from Koln, Leverkusen’s local rivals. But this was the start of a long friendship.\n“On the first day, he was already always smiling,” Wimmer recalls, 10 years on. “He knew that I spoke German, so from the first day on, we had a special connection. You could just feel that he’s such an amazing character. He was so nice to everyone — and to me — from the start.”\nAdvertisement\nThis was an exciting summer at the club, a moment of rejuvenation for an improving team. Pochettino and Mitchell had put together a group of hungry young players who all looked like they would run through brick walls for their new manager and new team-mates. The surprising thing, given what a difficult first year Son ended up having, was how easy it looked at the very start.\nOn September 17, Tottenham hosted Qarabag of Azerbaijan in their opening Europa League group-stage fixture. Son and a 19-year-old Dele Alli made their second starts for the club that night. It felt like a window into Spurs’ future, and the Korean was shining bright. He swept in an Andros Townsend corner for the first goal of a 3-1 win. He scored a second a couple of minutes later from a beautiful one-two with Dele. Three days later, Son started again, in the Premier League, bursting down the left to score the only goal to defeat visitors Crystal Palace. He looked like the Son of the Bundesliga already.\nBut this was a false dawn.\nOne week later, Son injured his plantar fascia, an important band of tissue on the bottom of the foot, against Manchester City. And his debut season never recovered. He did not make another start for Spurs for two months. He did not score for them again until after Christmas. For the biggest league games, it was clear that Pochettino wanted Erik Lamela, Dele and Christian Eriksen in the three behind striker Harry Kane. Son only started another 10 league games all season after that September injury. Three of them at the very end, the last two when Tottenham’s title challenge was over and Leicester City were surprise champions.\nThe big question over the second half of that season was not just whether Son was playing, but whether he was even enjoying it. Nine years on, recollections differ about this point. “He has such a positive mindset and attitude,” remembers Mitchell, “coming in with a big smile, working hard, we never felt at any time that he was ever even considering giving up.” But there were certainly those at the club who feared Son’s head was dropping, that his application in training was not as good as it could have been. And that he did not look as if he was enjoying the challenge of trying to win his place back.\nIn August 2016, Son went to Brazil to play for his country at the Olympics. When he came back to Spurs, he knew there was an offer for him to return to the Bundesliga with Wolfsburg. On one level, it made sense: Son had already proved that he could excel in the Bundesliga. And he had not been reluctant in the past to move for the good of his career.\nSon’s mind was made up. “I came close to leaving,” Son told London’s Evening Standard newspaper in 2019. “I went to (Pochettino)’s office and told him I didn’t feel comfortable and wanted to leave for Germany.” Fortunately, Tottenham had other ideas. Partly because having invested £22million in him a year earlier, they did not want to lose him on the cheap, even if there were some internal doubts about him. But also because the football staff knew how good he could be. Players like that — with that pace, quality, versatility and attitude — do not come along very often. He would have been impossible to replace at short notice.\nAdvertisement\nSo Pochettino explained to Son, in that special way he had with players, that the best solution was for him to stay and fight for his place in the team. “We were clear with Son that he has to earn his right to play, as we tell everyone,” Pochettino later recounted in his book, Brave New World. “He wanted to leave after a bad year, but I told him that he was part of my plans and we weren’t going to let him go on the cheap. He decided to stay.”\nThe uncertainty about Son’s future — combined with his participation in the Olympics through the first two weeks of August — meant he was not involved in Spurs’ start to the new season. It is hard to plan around someone who had “almost both feet out of the door”, as one insider put it.\nSon didn’t feature at all before the first international break began in late August, in which he played in one of South Korea’s two World Cup qualifiers that window then came straight back to England. But he trained so well on his return that Pochettino told staff that he had to start their next league game — away at Stoke City on September 10.\nIt was an inspired choice. Son was electric, scoring twice, the second beautifully curled into the top corner from the edge of the box, and setting up another goal for Kane in a 4-0 win.\nIn a very real sense, this was the true start of his Tottenham career.\nTwo weeks later, he scored both as Middlesbrough were beaten, 2-1. Then he got the goal in a 1-0 defeat of CSKA Moscow in the Champions League. Five days after that, Pep Guardiola’s Manchester City came to White Hart Lane. With Kane injured, Son started as a false nine and ran City ragged, inspiring a 2-0 win that showed the world how good he and this Spurs team could be.\nSo was there ever any real doubt?\n“We had to be patient and accept the noise, because it was a fair early reflection,” Mitchell says. “But we had done the work. We had seen how he had been in the Bundesliga. We knew the quality. We could feel it in the sessions. We could see how dynamic he was, how intelligent, the finishing ability off both sides. We were adamant: he will be a top player.”\nAdvertisement\nLooking back, the most crucial part of Son’s story is not that he came to Tottenham in summer 2015. It was inevitable that he would have left Germany for the Premier League at some point. Far more important was what happened in summer 2016.\nThe fact that he considered giving up and waving goodbye to Spurs after one difficult year, before staying and succeeding is far more interesting and surprising. And significantly more decisive to his eventual triumph.\nBoth he and the club continued to reap the rewards for years to come.\nThe remarkable thing about Son’s peak is how long it lasted.\nIt started in that autumn of 2016 and lasted for at least six years — maybe even eight, depending on your view. During that time, he firmly established himself as one of the best forwards in football.\nThere is very little new that can be said about how good Son was at his peak. It was not just that he was fast, although when he hit top speed, few defenders in the game could keep up. It was not just that his movement was good, although there was barely an offside line he could not catch off-guard. It was not just that he was a good finisher, although he would outscore his expected goals figure by bigger margins than even Kane year after year. And it was not just that he was two-footed, although Mitchell, who signed him, says he has never in his life seen a better player with both feet.\nIt was all of these things in combination, all of it done with a grace and efficiency which made Son look like a feat of engineering. He looked so effortlessly smooth and elegant as he burst down the left, opened his body up at full speed, and whipped the ball into the far corner. As he did so, he radiated a sense of inevitability. One that could be felt by everyone in the stadium. Including in the Tottenham dugout.\n“When you think about players, particularly in the Premier League, who played his position, the output he had of goals and assists was quite extraordinary,” says Postecoglou. “He was as good a finisher as you could find from wide areas. Even last year, there were times when Sonny breaks through on the left and puts it in the bottom corner, across the goalkeeper. You know it’s a goal before he’s even struck it.”\nAdvertisement\nBut with Son it was about more than just the aesthetics or even just the numbers (his 127 goals make him the Premier League’s joint-16th highest scorer). Because his great strength at Tottenham was the importance of the goals he scored.\nDuring those peak Pochettino years, the feeling inside the club was that they had three top players, three ‘number ones’ in their squad. There was Kane, the ultimate high-volume goalscorer. There was Dele, whose unique talent meant that he could break open the biggest games. And then there was Son, whose gift was for the difficult matches, and the important goals — the openers and the winners.\nJust think back to the most memorable Son goals, and how much they mattered.\nThe 89th-minute winner at Watford as Spurs chased a top-four place, and Champions League qualification, in his first season. The decider at Borussia Dortmund in the Champions League in 2017. The opener against the same opposition in the first leg of a last-16 tie in that competition in 2019. The first ever official goal at the Tottenham Hotspur Stadium against Palace later that spring. The winner against City in a Champions League quarter-final first leg six days later.\nBest of all, the ultimate Son performance, was when Spurs went to the Etihad Stadium to try to defend that one-goal lead.\nCity were all over them from the start and had already pulled level in the tie when, in the seventh minute, a loose ball fell to Son on the edge of the box. First touch, right foot, in off goalkeeper Ederson’s legs. Two minutes later, after Lucas Moura broke down the right, Eriksen found him and he produced a moment of pure Son genius: a perfect first touch away from Kyle Walker, opening his body up, and then whipping the ball into the far top corner.\nEverything good about Son was encapsulated in that moment: clinical, graceful, in a moment with the highest possible stakes.\nAdvertisement\nEven after that, he kept getting better — and more decisive. He scored a stoppage-time winner at Aston Villa in February 2020, the second of his two goals that day, when playing with a broken arm, and the first goals in 2-0 home defeats of City and Arsenal behind closed doors, due to the pandemic, that autumn.\nHis best season of all was 2021-22. It started with Son getting the first goal of the brief Nuno Espirito Santo era, another winner against City, and it ended with him scoring 12 times in the last 10 league games as Antonio Conte’s Spurs stormed past Arsenal to seal fourth, the Korean ending up sharing the Golden Boot with Mohamed Salah of Liverpool on 23 Premier League goals.\nSpurs fans will all have their own favourite Son moment. When he scored his 100th Premier League goal — becoming one of only 34 players to do so — in a win over Brighton in April 2023, his friends chose to mark the achievement. Ben Davies — Son’s long-time Tottenham team-mate and best friend — hosted a dinner party at his house to celebrate.\nAnd it’s not just Davies and Wimmer — Son has had an incredible bond with dozens of the players he has shared a dressing room with at Spurs. It’s not hard to see why.\nWhen Tottenham went to South Korea in the 2022 pre-season, every member of the travelling party arrived at their hotel to find personalised gifts in their rooms from Son to thank them for coming to his homeland.\nIt was the same story when they went there again last year. Everyone on the tour got gifts from Son’s personal brands. Even Postecoglou got a cap, shorts, a T-shirt and some toiletries. He made sure to impress upon his squad the importance of Son’s gesture.\n“I would constantly tell the players, because we had a young group, that the measure of any person is not always their achievements,” Postecoglou says. “It’s about how they treat other people. Sonny didn’t have to do those things, it’s his generosity. I could see that the players understood: giving back is just as important as any accomplishments you make.\nAdvertisement\n“He was constantly doing that, constantly giving back. It was a great example to everyone, myself included, that irrespective of how great a career you have and how high the esteem you’re held in, it’s the way you treat people that’s a greater measure than anything else.”\nWhen Son was given gifts by adoring fans on such tours — and he got a lot — he took time to say thanks and treasured every one of them, having them loaded into a van to take home with him.\nThis has always been the way with Son.\nFrom the time in his first few months at Spurs when he organised and paid for a big Korean banquet at the training ground for players and staff. Or how Son would always invite Wimmer to his home after training, so that his mother could cook for his team-mate. (“His mum is such a lovely person,” Wimmer says, “she always took care of me, like I was also her son.”)\nOr just the little acts of kindness that he imparts every single day. His generosity in meeting fans, recording videos for them, signing photographs after training when everyone else has driven home, anything to brighten their day. Anyone who knows Son or has worked with him will tell an identical story of him being delighted to see them, asking how they are, how their family is. People who have not seen Son for a long time will get messages out of the blue checking in on them and their loved ones.\nWhich is why people who know Son say that, however impressive he is as a footballer, he is even more impressive as a person. He is idolised by millions but still sees himself in other people, and makes time for every single one.\n“He is exactly as you see him,” says Postecoglou. “Sometimes, the public perception of a person is a lot different to how they actually are. But with Sonny, there was no difference in the way the public perceived him to how he was in private.\nAdvertisement\n“The one thing about Sonny that people don’t understand is that he’s lived in a goldfish bowl for pretty much the entirety of his career, he’s always had eyes on him. To live in that sort of cauldron for as long as he has, and I doubt you could find one person to say something negative about him, is just incredible.”\nIf deciding not to leave Tottenham in summer 2016 was the making of Son, it was another decision four years later that built his legacy.\nThe 2020-21 season was a strange time at Spurs. Jose Mourinho was in charge, football was still being played behind closed doors due to Covid-19, and after a strong start, the team went into a sharp decline. Kane already knew that City wanted him, and at the end of that season he would try to escape there. Son was 28 then, and at his physical peak. He was good enough to play for any team in the world. But it was at this point — when he could have done anything he wanted — that he again decided to stay.\nA new long-term contract was agreed that autumn, then announced in July 2021. It was for another four seasons, which have turned out to be Son’s last four at the club.\nKane finally got his move, to Bayern Munich, in 2023 — the summer Postecoglou arrived as head coach. With Hugo Lloris also on his way out, it was time for a new captain. And Postecoglou had a decision to make. “I thought the key thing in looking for a leader was a unifier,” the Australian explains. “And this is who Sonny is. He could literally sit at any table in the lunch room, whether it was staff or players, and get a conversation going. That was going to be important for us.\n“His demeanour at the training ground, and the way he trained, was almost like he was a first-year player every time he was out there. If your leaders are not engaged, or lack enthusiasm, at any stage, that filters through to the whole group. But he would not allow that to happen.”\nIn Postecoglou’s second season, Son’s last at Spurs, their captain struggled with injuries. He only scored two league goals after Christmas. He looked like he had lost some of his explosive pace, the burst that always gave him the space to shoot. He was absent for the big games — Eintracht Frankfurt away in the quarter-final’s second leg, both legs of the semi against Bodo/Glimt — on Spurs’ way to Bilbao.\nAdvertisement\nBut Postecoglou still knew how important Son was going into that final. Even though he knew his skipper was not fit enough to start the game, and that Richarlison had proven how useful he could be playing on the left. So Postecoglou reminded his players of Son’s significance, as the living representation of the club. Lifting that trophy would change perceptions of him, just as it would of Tottenham as a club.\n“If we can elevate Sonny to a level above some of the best players that have ever played for this club by winning something and having him lift a trophy, we’re all going to be part of something special,” Postecoglou told his players. “We’re going to be part of his legacy.”\nThis is why the images at the end of the match, with Son overwhelmed by emotion, were so powerful. The fact he had stayed through the hard times made his eventual triumph, leading Spurs to the promised land, even more emphatic. His journey was Tottenham’s journey. His vindication was Tottenham’s vindication. His tears were Tottenham’s tears.\nFew players get to leave after a moment this perfect or this fulfilling. His 10-year arc at Spurs was complete. But even fewer players deserve the perfect ending like Son did.\nBecause he embodied the joy of football played well, the shared thrill as he burst past a defender, the graceful way he found the corner of the net. But also because he embodied the joy of people. He never hid his emotions on the pitch, or his love for his team-mates or colleagues or the fans who supported him.\nWhen he scored, or Spurs won, he radiated happiness, as if he felt he was the luckiest man in the world to be getting these goals for this team. And he wanted fans to share that luck and share that joy with him, too.\nAdditional reporting: Charlie Eccleshare, Jay Harris, Dan Kilpatrick"
    }
  ],
  "argos_summary": "Thomas Frank has taken over as manager of Tottenham Hotspur, aiming to improve a squad that finished 17th in the Premier League last season despite winning the Europa League. Chairman Daniel Levy has high ambitions for the club, including a desire to compete for the Premier League title and secure Champions League qualification. Frank has already made significant signings to bolster the team, and Spurs are looking to build on their recent European success while also pursuing domestic trophies.",
  "argos_id": "W72PTITPC"
}