{
  "url": "https://www.yahoo.com/news/articles/typhoon-podul-intensifies-nears-taiwan-021301820.html",
  "authorsByline": "I-Hwa Cheng and Akio Wang, with Amber Wang and Joy Chiang in Taipei",
  "articleId": "c95c52f10c1e4273b36fe533163000b9",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/6dff2e52908aa8a43e867b1b51364bf732228d3f91ae2d54347205e2279fd2d6/ynews/resizefill_w1200/https://media.zenfs.com/en/afp.com/e0763e772a4a809d40c347220da7cc58",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:13:01+00:00",
  "addDate": "2025-08-13T02:40:02.395099+00:00",
  "refreshDate": "2025-08-13T02:40:02.395103+00:00",
  "score": 1.0,
  "title": "Typhoon Podul intensifies as it nears Taiwan",
  "description": "Thousands of people sheltered and fishermen secured their boats across storm-battered southern Taiwan on Wednesday as Typhoon Podul intensified on its approach to the island.More than 5,500 people have been evacuated from their homes ahead of Podul, disaster officials said Wednesday, as the typhoon threatens to pound central and southern regions still recovering from storms last month.",
  "content": "Thousands of people sheltered and fishermen secured their boats across storm-battered southern Taiwan on Wednesday as Typhoon Podul intensified on its approach to the island.\n\nThe typhoon is packing wind speeds of 155 kilometres (96 miles) per hour at its centre and \"is strengthening\", Central Weather Administration (CWA) forecaster Lin Ting-yi told AFP.\n\nPodul is on track to hit lightly populated Taitung County at around noon (0400 GMT) before sweeping across the island and into the Taiwan Strait.\n\n\"We are worried about this typhoon,\" Kaohsiung fisherman Huang Wei told AFP as he used more ropes to tie down his boat and checked on other vessels.\n\n\"We had already made general typhoon preparations yesterday, but this morning I woke up and saw news reports that the typhoon has intensified to be as strong as the last, (Typhoon) Krathon,\" Huang said.\n\n\"Last time, the two boats behind us weren't tied properly and hit my boat.\"\n\nKrathon slammed into Kaohsiung in October, with wind gusts of 162kph. Podul has gusts of 191kph, Lin said.\n\nMore than 5,500 people have been evacuated from their homes ahead of Podul, disaster officials said Wednesday, as the typhoon threatens to pound central and southern regions still recovering from storms last month.\n\nMountainous areas of Kaohsiung City and neighbouring Pingtung County, as well as Hualien and Taitung counties, could see torrential rain, the CWA said.\n\nTaitung resort worker Lo Wan-chun told AFP by telephone that locals feared the storm could be as strong as Typhoon Nepartak in 2016, when the county recorded its strongest gusts since 1901.\n\n\"After 8:00 am, the storm began to intensify,\" she said.\n\n\"It's still getting stronger. You can hear the wind is loud right now.\n\n\"We don't recommend guests go out.\"\n\nAll domestic flights across the island of 23 million people have been cancelled for Wednesday, along with dozens of international journeys.\n\nMany ferry services have been suspended and businesses and schools across the south are closed.\n\nMore than 31,500 soldiers were ready to assist in typhoon preparations as well as rescue and relief efforts, disaster officials said.\n\nThe CWA expects Kaohsiung and Pingtung could be drenched with a cumulative 400-600 millimetres (16-24 inches) of rain from Tuesday to Thursday.\n\nTyphoon Danas, which hit Taiwan in early July, killed two people and injured hundreds as the storm dumped more than 500mm of rain across the south over a weekend.\n\nThat was followed by torrential rain from July 28 to August 4, with some areas recording more than Taiwan's rainfall of 2.1 metres for 2024.\n\nThe week of bad weather left five people dead, three missing, and 78 injured, a disaster official said previously.\n\nTaiwan is accustomed to frequent tropical storms from July to October.\n\nScientists say human-driven climate change is causing more intense weather patterns that can make destructive floods more likely.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Typhoon Podul",
      "weight": 0.08954832
    },
    {
      "name": "typhoon preparations",
      "weight": 0.08389243
    },
    {
      "name": "general typhoon preparations",
      "weight": 0.08104493
    },
    {
      "name": "Typhoon Danas",
      "weight": 0.07639175
    },
    {
      "name": "Kaohsiung fisherman Huang Wei",
      "weight": 0.07294127
    },
    {
      "name": "frequent tropical storms",
      "weight": 0.070543915
    },
    {
      "name": "storms",
      "weight": 0.06752583
    },
    {
      "name": "torrential rain",
      "weight": 0.06751323
    },
    {
      "name": "Taiwan",
      "weight": 0.0672876
    },
    {
      "name": "disaster officials",
      "weight": 0.066642806
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Weather",
      "score": 0.9677734375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.91845703125
    },
    {
      "name": "/News/Local News",
      "score": 0.322509765625
    }
  ],
  "sentiment": {
    "positive": 0.049323626,
    "negative": 0.7844673,
    "neutral": 0.16620916
  },
  "summary": "Typhoon Podul is intensifying as it approaches Taiwan, with winds reaching 155 kilometres per hour and is expected to hit Taitung County at around noon (0400 GMT) before moving across the island and into the Taiwan Strait. Over 5,500 people have been evacuated from their homes and over 31,500 soldiers are ready to assist in typhoon preparations. The Central Weather Administration (CWA) forecaster Lin Ting-yi said that the storm is strengthening and could bring heavy rain to mountainous areas and potentially cause significant amounts of rainfall. All domestic flights across Taiwan have been cancelled and many businesses and schools across the south are closed.",
  "shortSummary": "Typhoon Podul, a powerful typhoon approaching southern Taiwan, has caused widespread evacuations and disruption, with warnings of potentially deadly storms and heavy rain expected.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fa80cac86fd042efa602c0a557e564d1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Typhoon Podul is intensifying as it approaches southern Taiwan, with wind speeds reaching 155 km/h and gusts up to 191 km/h. Over 5,500 people have been evacuated, and all domestic flights have been canceled as the storm threatens to bring heavy rainfall, particularly to Kaohsiung and Pingtung. Authorities have mobilized over 31,500 soldiers for disaster preparedness and response, as locals express concerns about the storm's potential impact, recalling the devastation from previous typhoons.",
  "argos_id": "WEQVSUEO4"
}