{
  "url": "https://www.yahoo.com/news/articles/france-adopts-law-upholding-ban-072858363.html",
  "authorsByline": "AFP",
  "articleId": "3b0aa01f39cb4edd825f5e86cff6965b",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/afp.com/9ab57453835fba8feb8300fdfef6e591",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:28:58+00:00",
  "addDate": "2025-08-12T07:54:12.647702+00:00",
  "refreshDate": "2025-08-12T07:54:12.647705+00:00",
  "score": 1.0,
  "title": "France adopts law upholding ban on controversial insecticide",
  "description": "French President Emmanuel Macron signed into law a modified bill that bars a bee-killing pesticide from being reintroduced after a petition signed by more than two million people.After the ruling, Macron had said he intended to quickly enact the law and rejected further parliamentary debate.",
  "content": "French President Emmanuel Macron signed into law a modified bill that bars a bee-killing pesticide from being reintroduced after a petition signed by more than two million people.\n\nThe legislation has been at the heart of a major debate in France and sparked a student-initiated petition that was wildly successful.\n\nCritics of the bill, adopted in July in a fractured lower house of parliament, say it was rushed through without proper debate.\n\nThe law was published in the government's official journal on Tuesday after the Constitutional Council, the country's highest court, struck down the contested provision about the reintroduction of acetamiprid.\n\nThe court said that the insecticides known as neonicotinoids posed \"risks to human health\" and was unconstitutional as it undermined the right to live in a balanced and healthy environment as guaranteed in the country's environmental charter.\n\nBanned in France since 2018, acetamiprid is legal in the European Union and proponents say French farmers need it to help them compete with their European counterparts.\n\nThe main farmers' union has railed against the court ruling.\n\nSupporters of the petition said their frustration with the legislation went beyond environmental concerns.\n\nCommentators have said it may be a sign of exasperation with deadlock in a hung parliament and a desire to have a greater say in political matters.\n\nAfter the ruling, Macron had said he intended to quickly enact the law and rejected further parliamentary debate.\n\nThe controversial legislation has been dubbed the Duplomb law, after its author, Laurent Duplomb, a senator for the right-wing Republicans party.\n\nFrench Health Minister Yannick Neuder has called for a European reassessment of the impact of acetamiprid on human health.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "law",
      "weight": 0.08198325
    },
    {
      "name": "French Health Minister Yannick Neuder",
      "weight": 0.0762925
    },
    {
      "name": "French President Emmanuel Macron",
      "weight": 0.0761408
    },
    {
      "name": "French farmers",
      "weight": 0.07571792
    },
    {
      "name": "human health",
      "weight": 0.06980526
    },
    {
      "name": "further parliamentary debate",
      "weight": 0.06816661
    },
    {
      "name": "environmental concerns",
      "weight": 0.06655293
    },
    {
      "name": "proper debate",
      "weight": 0.06408554
    },
    {
      "name": "France",
      "weight": 0.0633766
    },
    {
      "name": "Laurent Duplomb",
      "weight": 0.06310337
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.95166015625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.876953125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.626953125
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.51416015625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.431640625
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.42041015625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.395263671875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.3046875
    }
  ],
  "sentiment": {
    "positive": 0.043743607,
    "negative": 0.7644719,
    "neutral": 0.19178456
  },
  "summary": "French President Emmanuel Macron has signed into law a modified bill that prevents the reintroduction of the bee-killing pesticide acetamiprid, a controversial insecticide that has been subject to significant debate in France. The Constitutional Council, the country's highest court, ruled that the insecticides known as neonicotinoids posed \"risks to human health\" and was unconstitutional as it undermined the right to live in a balanced and healthy environment. Critics of the bill, who argue it was rushed through without proper debate, have called for a European reassessment of its impact on human health.",
  "shortSummary": "French President Emmanuel Macron signed a modified bill to prevent the reintroduction of controversial insecticide acetamiprid, following a major petition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "097f46aa12d34a499533c74ec1465c26",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "French President Emmanuel Macron has enacted a law preventing the reintroduction of the pesticide acetamiprid, following a petition signed by over two million people. The law, which has sparked significant debate and criticism for being rushed through parliament, was upheld by the Constitutional Council, citing risks to human health and the environment. While banned in France since 2018, acetamiprid remains legal in the EU, leading to contention among farmers who argue it is necessary for competitiveness.",
  "argos_id": "WGIM2XL5W"
}