{
  "url": "https://finance.yahoo.com/news/cleantech-acquires-significant-package-fluorspar-185600531.html",
  "authorsByline": "Newsfile Corp.",
  "articleId": "56dee06738df4c07a2b627fd1a0d14cf",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/31217174eacadb1367746ee513c4ad13",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:56:00+00:00",
  "addDate": "2025-08-12T19:08:53.128149+00:00",
  "refreshDate": "2025-08-12T19:08:53.128151+00:00",
  "score": 1.0,
  "title": "CleanTech Acquires Significant Package of Fluorspar Projects Totaling 7,180 Acres for US$4,000,000 in Illinois-Kentucky Fluorspar District",
  "description": "Vancouver, British Columbia--(Newsfile Corp. - August 12, 2025) - CleanTech Vanadium Mining Corp. (TSXV: CTV) (OTCQB: CTVFF) (\"CleanTech\" or the \"Company\") is pleased to announce that, through its 100%-owned subsidiary, it has entered into a binding option-to-purchase agreement (the \"OTP\") with an arm's-length private party (the \"Vendor\") to acquire a package of Fluorspar mining projects, several with historic Fluorspar production, totaling approximately 7,180 acres in Kentucky and Illinois, USA",
  "content": "\"With this transaction, CleanTech has now become one of largest Fluorspar players in the USA in terms of Fluorspar resource holdings and Fluorspar project land size in the heart of the Kentucky-Illinois Fluorspar District,\" commented Ron Espell, President of CleanTech. \"CleanTech's goal is to be the leading Fluorspar mining company to supply Florine, a critical mineral and essential ingredient in uranium enrichment to produce nuclear fuel to power plants, in battery electrolytes in most electric vehicles and large-scale energy storage systems, and as a fluxing agent for steel and aluminum production,\" further commented by Ron Espell.\n\nThe district's unique geological setting, established transportation infrastructure, and proximity to major industrial consumers positions CleanTech's Fluorspar Projects as highly strategic domestic fluorspar assets in an import-dependent market in the United States.\n\nCleanTech's Fluorspar Projects consist of over a dozen distinct Fluorspar deposits with over 720 historic drill holes, covering over 7,180 acres and collectively control key segments of the Western Kentucky Fluorspar District's most productive fault systems, representing approximately 60,000 feet of fault length across major geological structures. Those Fluorspar Projects provide long-term exploration potential across underexplored extensions of proven systems.\n\nThe Fluorspar Projects are divided into two groups, CleanTech has the option to acquire both groups for the Purchase Price or choose any one of the two groups in the Fluorspar Projects and pay a total of only $2,250,000 instead, less any money paid as of the date CleanTech exercises the option to purchase the chosen group of Fluorspar Projects.\n\nUnder the OTP executed on August 7, 2025, the Vendor agreed to sell to CleanTech, the Fluorspar Projects for a total of US$4,000,000 (the \"Purchase Price\"), consisting of:\n\nVancouver, British Columbia--(Newsfile Corp. - August 12, 2025) - CleanTech Vanadium Mining Corp. (TSXV: CTV) (OTCQB: CTVFF) (\"CleanTech\" or the \"Company\") is pleased to announce that, through its 100%-owned subsidiary, it has entered into a binding option-to-purchase agreement (the \"OTP\") with an arm's-length private party (the \"Vendor\") to acquire a package of Fluorspar mining projects, several with historic Fluorspar production, totaling approximately 7,180 acres in Kentucky and Illinois, USA (\"Fluorspar Projects\").\n\nTable 1. The Fluorspar Projects Under Option by CTV in Illinois - Kentucky Fluorspar District\n\n* Campbell Crotser is under a separate OTP as described in the Company's news release dated July 2, 2025\n\nThe key assumptions, parameters, and methods used to prepare this historical resource estimate are not available. The Company has not reviewed or validated the historic data, and caution should be taken as a qualified person has not done sufficient work to classify these historical resource estimates as a current mineral resource and the Company is not treating them as a current mineral resource. The historic resource does not demonstrate economic viability and should not be relied on. The Company considers the historical estimate relevant as it indicates significant fluorspar mineralization within the project area; however, the reliability is uncertain given the age of the data, and differences between historical estimation methods and current Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") Definition Standards. The historical resource categories were defined prior to the adoption of current CIM Definition Standards and differ materially from current categories such as 'Inferred Mineral Resource.' The historical estimates do not meet current CIM requirements for mineral resource classification because of insufficient verification, lack of documented estimation methodology, and absence of QA/QC protocols. Steps to verify and upgrade the historical estimates to current CIM standards include (i) compilation and validation of all historical drill data, (ii) twin drilling of select historical holes, (iii) confirmatory drilling in key areas of mineralization, (iv) updated geological modeling, and (v) preparation of a new mineral resource estimate in accordance with NI 43-101.\n\nThe Western Kentucky Fluorspar District represents one of North America's most strategically important mineral provinces, containing the United States' largest known fluorspar districts and most prolific production history from approximately 1896-1975. Located in Crittenden and Livingston counties, Kentucky, and extending into southern Illinois, the Illinois-Kentucky Fluorspar District (\"IKFD\") has been the focus of extensive exploration[10] and development activities more than 150 years[11]. Mining operations have extracted 12.5 million tons of refined fluorspar in the IKFD since the late 1800s[12]. The neighboring Illinois portion of the district (north of the Ohio River) is documented in having produced over 20 million tons of crude fluorspar throughout its history[13].\n\nA thorough review of historic and current geological reports by the Company revealed significant mineral resource potential supported by over 720 historic drill holes across CleanTech's Fluorspar Projects covering approximately 7,180 acres within the heart of Western Kentucky Fluorspar District. Each CleanTech's Flursopar Project is strategically positioned along major fault systems that have historically controlled mineralization throughout the 1,000-square-mile district.\n\nGeologically, CleanTech's Fluorspar Projects are within the Kentucky-Illinois fluorspar district, where Mississippian-age limestones are cut by NW-SE normal faults and locally by dikes to which may be related to subsurface intrusive activity. Fluorspar is the principal commodity and accessory sphalerite and galena, occurring in steep fault-fill veins, breccia zones, and localized carbonate replacements along favorable beds. Shoots typically thicken at bends, step-overs, relay ramps, and fault-dike intersections, providing predictable structural controls and repeatable targets across the belt[14],[15].\n\nThe IKFD represents one of the most significant fluorspar provinces globally, hosted within Mississippian sedimentary rocks that have been extensively faulted into a complex block pattern[16]. The primary deposits (optioned by CleanTech) - Campbell-Crotser, Tabb, Babb-Barnes, and Robinson-Lasher - occur along steeply-dipping normal faults (70-90°) that displace favorable limestone formations, particularly the St. Genevieve and St. Louis limestones. These fault-hosted vein deposits formed through replacement of pre-existing calcite by fluorite, with ore shoots typically ranging 200-1000 feet in strike length, 200-500 feet in height, and 3-10 feet in width[17]. The Campbell deposit, for example, occurs along the Big Creek Fault with a 12-foot average width and 26-foot total vein width, containing approximately 805,000 tons grading 37% CaF2 and 3.2% zinc[18]. The Tabb fault system, historically the most productive in Kentucky, extends 19 miles through the district with mineralization varying both laterally and vertically along strike.\n\nThese deposits are geochemically linked to deeper carbonatite-lamprophyre magmatism, as evidenced by the widespread occurrence of mafic dikes throughout the district and their spatial association with zinc-rich mineralization[19]. The cryptovolcanic Hicks Dome structure, dated at approximately 270 Ma (million years ago), represents a key thermal and geochemical center that likely provided both heat and fluorine-rich volatiles for regional mineralization. The dome is underlain by alkalic igneous rocks and explosive breccias, visible in aeromagnetic data, may reflect deeper ultramafic intrusive activity and suggests that the observed surface mineralization represents the upper expression of a much larger magmatic-hydrothermal system driven by mantle-derived carbonatitic melts[20].\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/8597/262229_bb934cbc54390a60_002full.jpg\n\nOptioned under a separate OTP by CleanTech described in the Company's news release dated July 2, 2025, the Campbell-Crotser stands as the flagship asset, hosting a historic resource estimate of 805,841 tons of fluorspar grading 37.10% CaF2, 3.23% zinc, and 0.99% lead. Located along the Rock Creek Fault system near Carrsville, Kentucky, the project controls a critical 3,300-foot segment of what represents a much larger 30,000-foot fault system extending from Illinois into Kentucky[21].\n\nThe Rock Creek Fault system, striking northeast at N20°E with a 75° northwest dip, exhibits 650 feet of stratigraphic displacement. The fault places Degonia Formation against Golconda Formation at surface, creating optimal conditions for fluorspar mineralization. Of the total 30,000-foot system length, approximately 6,200 feet shows confirmed mineralization, with Campbell-Crotser controlling the most prospective central segment[22]. The project underwent systematic exploration beginning with Pennwalt Chemicals Corporation's 13-hole drilling program from 1946-1948. The major exploration effort was conducted by Cerro Corporation from 1972-1974, involving 69 total core holes with approximately 39,600 feet of drilling[23]. The Campbell Deposit shows some of the highest-grade intervals, with individual drill holes reporting 48-60% CaF2 over significant thicknesses. Borehole 37, for example, intersect a 6.6 foot-wide (true-width) vein of 83.65% CaF2 at approximately 775 feet below ground surface.\n\nThe Tabb Fault system represents the district's most significant geological structure, extending 19 miles (100,320 feet) through southern Crittenden and western Caldwell counties. This large fault system has historically produced 30% of all fluorspar mined in the Kentucky portion of the district, totaling over 1.05 million tons[24].\n\nRecent exploration by Honeywell's Project Joust program focused on the K-4 cluster, a 4,000-foot segment of the eastern Tabb system. Honeywell's 2012-13 \"Project Joust\": 59 HQ holes (of which 50 intersect fluorite bodies on the project), 55,105 ft; 2.41 million tons of historic resource grading 21.26% CaF2 (cut-off 15% CaF2) within a larger historical resource of 6.56 million tons grading 14.02% CaF2[25]. Of the total resource in the system, approximately 496,433 tons are thought to be acid-grade fluorspar. The Tabb system's mineralized zones typically occur as shoots 250-400 feet long, 100-200 feet high, and averaging 5 feet wide, with mineralization extending to depths exceeding 1,000 feet[26]. The Project Joust drilling revealed substantial continuity with the T33A-2 hole showing nearly 20% CaF2 over 141 feet.\n\nBabb-Barnes Shows Production-Ready Infrastructure\n\nThe Eagle Babb-Barnes represents an immediately viable operation, featuring complete mine infrastructure including an 800-foot shaft with stations at 300, 500, and 700-foot levels. The project sits on the Babb Fault system, which extends over 15,000 feet with a 3,300-foot mineralized segment controlled by the operation[27].\n\nHistoric production totaled 145,335 tons grading 38% CaF2 and 1.5% zinc between 1973-1979. Estimated historic resource stand at 424,000 tons grading 44% CaF2[28]. This project has also been thoroughly explored with 86 surface HQ holes (45 original + 41 infill) and 172 underground holes; surface footage is approximately 45,000 ft[29]. The minerals are fault controlled and dominated by Veins dip 70-85° NW; true widths 5-10 ft (avg. 7.6 ft) over 3,300 ft strike; mined on the 500, 600 & 700 levels from an 800 ft, three-compartment shaft[30].\n\nThe Robinson-Lasher, encompassing 1,524 acres in Livingston County, sits along the Robinson Fault, a near-vertical structure with 20,000 feet of total strike length. The project controls approximately 1,700 feet of the fault system, where bedded replacement deposits have been developed through a 1,270-foot decline to 240 feet vertical depth[31].\n\nThis project has undergone extensive exploration with 232 core holes to at least 9,855 ft with a historic resource of 70,000 tons grading 32% CaF2 (Bethel Horizon), 105,000 tons grading 30% CaF2 (Shetlerville Horizon) for 175,000 tons fluorite. (1, pp. 68-70). There is additionally another 387,225 tons grading 14% Zn in lower sub-Rosiclare with 5-10% fluorite according to an internal Dynamex company report[32],[33]. Total footage comes from a Boyce Moodie memo dated April 20, 19761. Dynamex exploration[34] demonstrated that 77% CaF2 grades are achievable in certain intervals, though typically over smaller thicknesses.\n\nCarr: The Carr is located 12 miles northwest of Salem, Kentucky, on the Crittenden-Livingston County line at the confluence of Deer Creek with the Ohio River, covering 30 acres of mineral rights[35]. The entire project lies in the floodplain of the Ohio River, where the Ellis Mine fault is projected onto the project for 1,400 feet[36]. Vein and bedded fluorite-barite mineralization is present at the nearby Ellis Mine, where 300,000 tons of material grading 25% CaF2 and 20% BaSO were mined1. Past exploration on the Carr consisted of one angled diamond drill hole that intercepted a narrow width of good-grade fluorite and barite[37]. The project is now inundated due to completion of the Smithland Dam on the Ohio River, limiting its exploration potential but potentially offering value as a barge loading site1.\n\nBig Four: Controls 12,000 feet of the Commodore3. At least 25 boreholes have been drilled on this project totaling approximately 15,000 feet1.\n\nPittillo: The Pittillo (or Pattillo) is in Crittenden County, 6 miles north of Salem, Kentucky, with mineral rights covering 3 tracts containing a total of 170 acres[38]. The project is situated within one of the major horsts of the district, bounded by the Sheridan fault system, containing two north to northwest-trending faults with small stratigraphic displacement that host known mafic dikes1. Alcoa conducted drilling on the structures and discovered narrow zones of zinc mineralization, primarily sphalerite, in fractured and brecciated St. Louis limestone walls1. The prospect contains sphalerite-dike occurrences like other known deposits in the district, most notably the Hutson zinc mine, but these targets have been inadequately explored[39]. Several vertical core holes are recommended to be drilled in the breccia structures to establish the presence of mineralization in favorable beds within the St. Louis and Salem limestones, with potential for small but high-grade zinc mineralization1.\n\nMemphis: Positioned on the Levias-Crittenden Springs system, controlling 5,600 feet of untested western fault segments plus historic gravel estimates of 23,600 tons grading 18% CaF24. There have been 25 boreholes drilled on this project totaling ~15,000 feet1.\n\nFranklin: The Franklin is in Crittenden County, 6 miles northeast of Salem, Kentucky, encompassing mineral rights under two tracts totaling 104 acres1. The prospect is positioned along the southern portion of the Levias-Crittenden Spring fault system, where the Fredonia formation forms the footwall and the Tar Springs formation forms the hanging wall, with apparent stratigraphic displacement of 700 feet accommodated by four northeast-trending step faults1. The Franklin Mine operated on the project with two shafts and extensive drifting, producing an estimated 40,000 to 60,000 tons of fluorspar of unknown grade based on old mine maps1. The northeast-trending fault structures have never been systematically drilled and appear to represent good targets for additional small-scale fluorspar-zinc mineralization[40].\n\nKirk-Tyner-Wring: Located on the 26-mile Moore Hill Fault system, controlling 2,500 feet of the principal mineralized zone with a historic estimate of 72,000 tons grading 43% CaF2[41]. This project has been explored by approximately 26 boreholes[42].\n\nEagle-Watson: Located 3 miles east of Salem, Kentucky on the northeast-trending Moore Hill Fault System, the Eagle-Watson lies on one of the most productive fault systems in the district. The Moore Hill fault system extends approximately 26 miles in length and is one of the longest fault systems in the Kentucky district. Approximately 99 acres of surface and mineral rights are controlled on the Eagle Watson. This project has been explored by at least 9 boreholes and several shallow auger holes of unspecified length[43].\n\nBeard-Jones: The Beard-Jones is located 11 miles northeast of Salem, Kentucky, in Crittenden County, covering 1,584 acres of mineral rights[44]. The project is situated on the northern portion of the Commodore fault system, one of the principal northeast-trending fault systems in the district, with a fault system approximately 2,000 feet wide and stratigraphic separation of at least 450 feet[45]. Historical production from the prospect came from a narrow footwall graben, totaling approximately 15,000 to 20,000 tons of fluorspar from the Beard mine1. Alcoa acquired the properties and drilled approximately 53 holes to explore the footwall graben, with four additional holes drilled on other fault structures1. The available information suggests that 12,000 feet of fault structure remains untested, with geological mapping indicating potential for rotational movement that could produce extraordinary wide vein widths[46].\n\nSusie Beeler: The Susie Beeler is located 2.5 miles east of Salem, Kentucky, encompassing 299 acres of surface rights and 341.9 acres of mineral rights[47]. The project is positioned on the Claylick fault system, one of the principal northeast-trending fault systems in the district, bounded by footwall and hanging wall faults with surface width varying from 500 to 1,000 feet and stratigraphic separation of 550 to 650 feet[48]. Historical production prior to 1945 amounted to approximately 18,000 tons from shafts on two different veins of the fault system1. Alcoa acquired the properties in 1945 and drilled 33 holes, though core recovery was poor due to badly broken ground, with only two holes cutting promising mineralization1. Frontier Spar Corporation conducted additional exploration including nine shallow percussion holes and nine angle diamond holes, revealing a 350-foot-wide breccia zone with some mineralization but determined that most structures contained small shoots[49].\n\nLee Mine (Hardin Co. IL): Located in Hardin County, Illinois, this is the only project in the portfolio situated outside Kentucky. The project contains 271 acres of mineral rights controlled. The Lee Fault Mine has never been thoroughly explored and remains largely speculative with no established historic estimate or production history documented in the available materials[50].\n\nAccording to United States Geological Survey, China produced over 60% of the world's fluorspar in 2024[51]. China produced 5.9 million tons in 2024, followed by Mexico (1.2 million tons) and Mongolia (1.2 million tons). The remaining countries combined produced approximately 1 million tons.\n\nChina has shifted from being a net exporter to a significant importer of fluorspar since 2023, due to rising demand from the booming energy storage system including batteries. Chinese customs data indicate that full-year 2024 fluorspar imports (all grades) rose 32% year-on-year to about 1.30 million tons, with Mongolia supplying roughly 88 % of the tonnage[52]. Over the same period China's outbound shipments contracted sharply: fluorspar exports fell 35% year-on-year to roughly 245,000 tons in 2024, the second annual decline as China prioritized domestic supply. The US fluorspar price has risen from approximately $300 per ton in 2020 to over $450 per ton in 2025.\n\nThe technical and scientific information contained in this news release has been reviewed and approved by Carlos Zamora, CPG, a member of the American Institute of Professional Geologists (AIPG) since 2024, who is an independent Qualified Person as defined by National Instrument 43-101.\n\nCleanTech is a mining company focused on critical mineral resources in the USA. The Company has an option to acquire 7,180 acres of mineral rights with historic Fluorspar resources across multiple projects in in Illinois-Kentucky Fluorspar district. CleanTech also owns a 100% interest in the Gibellini Vanadium Mine Project in Nevada.\n\nFurther information on CleanTech can be found at www.cleantechvanadium.com.\n\nON BEHALF OF THE BOARD\n\n\"Ron Espell\"\n\nPresident\n\nFor more information about CleanTech, please contact:\n\nPhone: 1.877.664.2535\n\ninfo@cleantechvanadium.com\n\nwww.cleantechvanadium.com\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nFORWARD-LOOKING INFORMATION\n\nThis news release contains \"forward-looking information\" and \"forward-looking statements\" (collectively, \"forward-looking information\") within the meaning of applicable securities laws. Forward-looking information is generally identifiable by use of the words \"believes,\" \"may,\" \"plans,\" \"will,\" \"anticipates,\" \"intends,\" \"could\", \"estimates\", \"expects\", \"forecasts\", \"projects\" and similar expressions, and the negative of such expressions. Such forward-looking information, which reflects management's expectations regarding CleanTech's future growth, results of operations, performance, business prospects and opportunities, is based on certain factors and assumptions and involves known and unknown risks and uncertainties which may cause the actual results, performance, or achievements to be materially different from future results, performance, or achievements expressed or implied by such forward-looking information. Forward-looking information in this news releases includes: the acquisition of ownership in the Campbell Crotser Project, the presence of a land grab for fluorspar projects and Fluorspar as CleanTech's major vertical, logistical advantages at the Campbell Crotser Project, the ability to advance the Project in both the near and long term, the availability of infrastructure that would assist in the advancement of the Project. Forward-looking statements are based on the opinions and estimates of management of CleanTech at the date the statements are made and are based on a number of assumptions and subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking statements. Many of these assumptions are based on factors and events that are not within the control of CleanTech, there is no assurance they will prove to be correct and are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements.\n\nForward-looking information involves significant risks and uncertainties, should not be read as a guarantee of future performance, events or results, and may not be indicative of whether such events or results will actually be achieved. A number of risks and other factors could cause actual results to differ materially from expected results discussed in the forward-looking information, including but not limited to: changes in operating plans; ability to secure sufficient financing to advance the Company's project; conditions impacting the Company's ability to mine at the project, such as unfavorable weather conditions, development of a mine plan, maintaining existing permits and receiving any new permits required for the project, and other conditions impacting mining generally; maintaining cordial business relations with strategic partners and contractual counter-parties; meeting regulatory requirements and changes thereto; risks inherent to mineral resource estimation, including uncertainty as to whether mineral resources will be further developed into mineral reserves; political risk in the jurisdictions where the Company's projects are located; commodity price variation; and general market, industry and economic conditions. Additional risk factors are set out in the Company's latest annual and interim management's discussion and analysis, available on SEDAR+ at www.sedarplus.ca.\n\nForward-looking information is based on reasonable assumptions by management as of the date of this news release, and there can be no assurance that actual results will be consistent with any forward-looking information included herein. Readers are cautioned that all forward- looking statements in this news release are made as of the date of this news release. The Company undertakes no obligation to update or revise any forward-looking information in this news release to reflect circumstances or events that occur after the date of this news release, except as required by applicable securities laws.\n\n[9] Adamson, R.S., 1993, Summary report on the West Kentucky fluorite-zinc properties, Livingston and Crittenden Counties, Kentucky; Hardin County, Illinois: consulting report for Silverspar Minerals Inc., 32 p.\n\n[12] Denny, F.B., Nelson, W.J., Breeden, J.R., and Lillie, R.C., 2020, Mines in the Illinois portion of the Illinois-Kentucky Fluorspar District: Illinois State Geological Survey Circular 604\n\n[13] Denny, F.B., Nelson, W.J., Breeden, J.R., and Lillie, R.C., 2020, Mines in the Illinois portion of the Illinois-Kentucky Fluorspar District: Illinois State Geological Survey Circular 604\n\n[15] Adamson, R.S., 1993, Summary report on the West Kentucky fluorite-zinc properties, Livingston and Crittenden Counties, Kentucky; Hardin County, Illinois: consulting report for Silverspar Minerals Inc., 32 p.\n\n[18] Adamson, R.S., 1993, Summary report on the West Kentucky fluorite-zinc properties, Livingston and Crittenden Counties, Kentucky; Hardin County, Illinois: consulting report for Silverspar Minerals Inc., 32 p.\n\n[19] Denny, F.B., Nelson, W.J., Breeden, J.R., and Lillie, R.C., 2020, Mines in the Illinois portion of the Illinois-Kentucky Fluorspar District: Illinois State Geological Survey Circular 604\n\n[20] Trela, J., Freiburg, J.T., Gazel, E., Nuelle, L., Maria, A.H., Malone, D.H., and Molinarolo, J.M., 2024, Petrologic relationship between lamprophyres, carbonatites, and heavy rare-earth element enriched breccias at Hicks Dome: Terra Nova, https://doi.org/10.1111/ter.12712.\n\n[21] Adamson, R.S., 1993, Summary report on the West Kentucky fluorite-zinc properties, Livingston and Crittenden Counties, Kentucky; Hardin County, Illinois: consulting report for Silverspar Minerals Inc., 32 p.\n\n[22] Adamson, R.S., 1993, Summary report on the West Kentucky fluorite-zinc properties, Livingston and Crittenden Counties, Kentucky; Hardin County, Illinois: consulting report for Silverspar Minerals Inc., 32 p.\n\n[24] Adamson, R.S., 1993, Summary report on the West Kentucky fluorite-zinc properties, Livingston and Crittenden Counties, Kentucky; Hardin County, Illinois: consulting report for Silverspar Minerals Inc., 32 p.\n\n[30] Adamson, R.S., 1993, Summary report on the West Kentucky fluorite-zinc properties, Livingston and Crittenden Counties, Kentucky; Hardin County, Illinois: consulting report for Silverspar Minerals Inc., 32 p.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/262229",
  "medium": "Article",
  "links": [
    "https://api.newsfilecorp.com/redirect/7nnZwcka8P",
    "https://api.newsfilecorp.com/redirect/xEEZPc8xRK",
    "https://api.newsfilecorp.com/redirect/nooEJseO8A",
    "https://images.newsfilecorp.com/files/8597/262229_bb934cbc54390a60_002full.jpg",
    "https://api.newsfilecorp.com/redirect/KLLkjcKR0K",
    "https://api.newsfilecorp.com/redirect/877ZgTjW4L",
    "https://api.newsfilecorp.com/redirect/EZZjXHYyxa",
    "https://api.newsfilecorp.com/redirect/ejjKNhva8z"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fluorspar Projects",
      "weight": 0.061717667
    },
    {
      "name": "major fault systems",
      "weight": 0.06108029
    },
    {
      "name": "Fluorspar mining projects",
      "weight": 0.060193617
    },
    {
      "name": "historic Fluorspar resources",
      "weight": 0.059765924
    },
    {
      "name": "Western Kentucky Fluorspar District",
      "weight": 0.057081018
    },
    {
      "name": "Fluorspar project land size",
      "weight": 0.05448284
    },
    {
      "name": "historic Fluorspar production",
      "weight": 0.05443959
    },
    {
      "name": "significant mineral resource potential",
      "weight": 0.052543685
    },
    {
      "name": "fault structure",
      "weight": 0.052485097
    },
    {
      "name": "Fluorspar resource holdings",
      "weight": 0.052480754
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96875
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.7158203125
    }
  ],
  "sentiment": {
    "positive": 0.4836104,
    "negative": 0.0213107,
    "neutral": 0.49507883
  },
  "summary": "CleanTech Vanadium Mining Corp. has acquired a significant package of Fluorspar Projects worth US$4,000,000 in Illinois-Kentucky fluorspar District. The projects cover over a dozen different Fluorsper deposits, with over 720 historic drill holes covering over 7,180 acres, and collectively control key segments of the Western Kentucky Fluorsp District's most productive fault systems. The district's unique geological setting, established transportation infrastructure, and proximity to major industrial consumers positions CleanTech's Fluorspr Projects as highly strategic domestic fluorsper assets in an import-dependent market in the US. The historical estimates do not meet current requirements for mineral resource classification due to insufficient verification, lack of documented estimation methodology, and absence of QA/QC protocols.",
  "shortSummary": "CleanTech acquired a significant package of Fluorspar Projects totaling 7,180 acres in the Illinois-Kentucky Fluorsarc District for US$4,000,000; uncertainties remain overstated and uncertain.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0412459fe89345baa91846de5d35d329",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.newsfilecorp.com/redirect/ejjKNhva8z",
      "text": "China - Fluorspar - Market Analysis, Forecast, Size, Trends And Insights\nGet instant access to more than 2 million reports, dashboards, and datasets on the IndexBox Platform.\nView PricingChina's Fluorspar Market to Grow at a CAGR of +1.7% Over Next Decade\nIndexBox has just published a new report: China - Fluorspar - Market Analysis, Forecast, Size, Trends And Insights.\nThe fluorspar market in China is expected to continue its upward consumption trend due to increasing demand. Market performance is projected to grow with a CAGR of +1.7% in volume and +1.8% in value from 2024 to 2035. By the end of 2035, the market volume is estimated to reach 8M tons and the market value to be $3.1B.\nMarket Forecast\nDriven by increasing demand for fluorspar in China, the market is expected to continue an upward consumption trend over the next decade. Market performance is forecast to decelerate, expanding with an anticipated CAGR of +1.7% for the period from 2024 to 2035, which is projected to bring the market volume to 8M tons by the end of 2035.\nIn value terms, the market is forecast to increase with an anticipated CAGR of +1.8% for the period from 2024 to 2035, which is projected to bring the market value to $3.1B (in nominal wholesale prices) by the end of 2035.\nConsumption\nChina's Consumption of Fluorspar\nIn 2024, consumption of fluorspar increased by 8.4% to 6.7M tons, rising for the second consecutive year after two years of decline. In general, the total consumption indicated pronounced growth from 2013 to 2024: its volume increased at an average annual rate of +4.5% over the last eleven-year period. The trend pattern, however, indicated some noticeable fluctuations being recorded throughout the analyzed period. Based on 2024 figures, consumption increased by +23.1% against 2022 indices. Over the period under review, consumption reached the maximum volume in 2024 and is likely to see steady growth in the immediate term.\nThe value of the fluorspar market in China reached $2.6B in 2024, with an increase of 8.3% against the previous year. This figure reflects the total revenues of producers and importers (excluding logistics costs, retail marketing costs, and retailers' margins, which will be included in the final consumer price). Overall, consumption enjoyed a strong expansion. Over the period under review, the market attained the maximum level in 2024 and is expected to retain growth in the immediate term.\nProduction\nChina's Production of Fluorspar\nIn 2024, the amount of fluorspar produced in China totaled 5.6M tons, approximately mirroring the year before. Overall, the total production indicated a tangible increase from 2013 to 2024: its volume increased at an average annual rate of +2.1% over the last eleven years. The trend pattern, however, indicated some noticeable fluctuations being recorded throughout the analyzed period. Based on 2024 figures, production decreased by -0.9% against 2022 indices. The growth pace was the most rapid in 2020 when the production volume increased by 26%. Fluorspar production peaked at 5.6M tons in 2022; afterwards, it flattened through to 2024.\nIn value terms, fluorspar production amounted to $2.2B in 2024 estimated in export price. Over the period under review, production enjoyed notable growth. The most prominent rate of growth was recorded in 2018 when the production volume increased by 41% against the previous year. Fluorspar production peaked at $2.3B in 2022; however, from 2023 to 2024, production failed to regain momentum.\nImports\nChina's Imports of Fluorspar\nIn 2024, purchases abroad of fluorspar increased by 32% to 1.3M tons, rising for the second consecutive year after two years of decline. Over the period under review, imports saw significant growth. The most prominent rate of growth was recorded in 2023 when imports increased by 263% against the previous year. Over the period under review, imports attained the peak figure in 2024 and are likely to continue growth in the immediate term.\nIn value terms, fluorspar imports surged to $213M in 2024. Overall, imports continue to indicate a significant expansion. The most prominent rate of growth was recorded in 2018 when imports increased by 229% against the previous year. Over the period under review, imports reached the maximum in 2024 and are expected to retain growth in the near future.\nImports By Country\nIn 2024, Mongolia (1.2M tons) constituted the largest fluorspar supplier to China, with a 88% share of total imports. Moreover, fluorspar imports from Mongolia exceeded the figures recorded by the second-largest supplier, Zambia (42K tons), more than tenfold. Thailand (31K tons) ranked third in terms of total imports with a 2.3% share.\nFrom 2013 to 2024, the average annual growth rate of volume from Mongolia amounted to +22.4%. The remaining supplying countries recorded the following average annual rates of imports growth: Zambia (+58.8% per year) and Thailand (+56.8% per year).\nIn value terms, Mongolia ($166M) constituted the largest supplier of fluorspar to China, comprising 78% of total imports. The second position in the ranking was held by Zambia ($15M), with a 7% share of total imports. It was followed by Thailand, with a 4.5% share.\nFrom 2013 to 2024, the average annual growth rate of value from Mongolia stood at +21.5%. The remaining supplying countries recorded the following average annual rates of imports growth: Zambia (+66.6% per year) and Thailand (+64.8% per year).\nImport Prices By Country\nIn 2024, the average fluorspar import price amounted to $158 per ton, increasing by 5% against the previous year. Over the period under review, the import price showed a relatively flat trend pattern. The most prominent rate of growth was recorded in 2022 an increase of 24% against the previous year. As a result, import price reached the peak level of $205 per ton. From 2023 to 2024, the average import prices remained at a lower figure.\nThere were significant differences in the average prices amongst the major supplying countries. In 2024, amid the top importers, the country with the highest price was Mexico ($514 per ton), while the price for Mongolia ($139 per ton) was amongst the lowest.\nFrom 2013 to 2024, the most notable rate of growth in terms of prices was attained by Vietnam (+7.8%), while the prices for the other major suppliers experienced more modest paces of growth.\nExports\nChina's Exports of Fluorspar\nIn 2024, shipments abroad of fluorspar decreased by -35.2% to 245K tons, falling for the second year in a row after two years of growth. Over the period under review, exports continue to indicate a deep contraction. The pace of growth was the most pronounced in 2022 with an increase of 128% against the previous year. As a result, the exports reached the peak of 478K tons. From 2023 to 2024, the growth of the exports remained at a lower figure.\nIn value terms, fluorspar exports plummeted to $107M in 2024. Overall, exports continue to indicate a perceptible slump. The pace of growth appeared the most rapid in 2022 with an increase of 142%. As a result, the exports reached the peak of $212M. From 2023 to 2024, the growth of the exports remained at a somewhat lower figure.\nExports By Country\nIndonesia (65K tons), Japan (40K tons) and India (34K tons) were the main destinations of fluorspar exports from China, with a combined 57% share of total exports.\nFrom 2013 to 2024, the biggest increases were recorded for Indonesia (with a CAGR of +34.4%), while shipments for the other leaders experienced mixed trend patterns.\nIn value terms, Indonesia ($29M), Japan ($18M) and India ($15M) appeared to be the largest markets for fluorspar exported from China worldwide, with a combined 58% share of total exports.\nIndonesia, with a CAGR of +36.8%, saw the highest growth rate of the value of exports, in terms of the main countries of destination over the period under review, while shipments for the other leaders experienced mixed trend patterns.\nExport Prices By Country\nThe average fluorspar export price stood at $438 per ton in 2024, remaining constant against the previous year. Overall, export price indicated a temperate expansion from 2013 to 2024: its price increased at an average annual rate of +3.4% over the last eleven years. The trend pattern, however, indicated some noticeable fluctuations being recorded throughout the analyzed period. Based on 2024 figures, fluorspar export price decreased by -1.3% against 2022 indices. The growth pace was the most rapid in 2018 an increase of 39%. Over the period under review, the average export prices reached the maximum at $444 per ton in 2022; however, from 2023 to 2024, the export prices remained at a lower figure.\nAverage prices varied noticeably for the major export markets. In 2024, amid the top suppliers, the countries with the highest prices were the United States ($484 per ton) and Taiwan (Chinese) ($482 per ton), while the average price for exports to India ($439 per ton) and the Netherlands ($441 per ton) were amongst the lowest.\nFrom 2013 to 2024, the most notable rate of growth in terms of prices was recorded for supplies to Taiwan (Chinese) (+5.6%), while the prices for the other major destinations experienced more modest paces of growth.\nThis report provides an in-depth analysis of the fluorspar market in China. Within it, you will discover the latest data on market trends and opportunities by country, consumption, production and price developments, as well as the global trade (imports and exports). The forecast exhibits the market prospects through 2030.\nProduct coverage:\n- Fluorspar\nCountry coverage:\nData coverage:\n- Market volume and value\n- Per Capita consumption\n- Forecast of the market dynamics in the medium term\n- Trade (exports and imports) in China\n- Export and import prices\n- Market trends, drivers and restraints\n- Key market players and their profiles\nReasons to buy this report:\n- Take advantage of the latest data\n- Find deeper insights into current market developments\n- Discover vital success factors affecting the market\nThis report is designed for manufacturers, distributors, importers, and wholesalers, as well as for investors, consultants and advisors.\nIn this report, you can find information that helps you to make informed decisions on the following issues:\n- How to diversify your business and benefit from new market opportunities\n- How to load your idle production capacity\n- How to boost your sales on overseas markets\n- How to increase your profit margins\n- How to make your supply chain more sustainable\n- How to reduce your production and supply chain costs\n- How to outsource production to other countries\n- How to prepare your business for global expansion\nWhile doing this research, we combine the accumulated expertise of our analysts and the capabilities of artificial intelligence. The AI-based platform, developed by our data scientists, constitutes the key working tool for business analysts, empowering them to discover deep insights and ideas from the marketing data.\n1. INTRODUCTION\nMaking Data-Driven Decisions to Grow Your Business\n- REPORT DESCRIPTION\n- RESEARCH METHODOLOGY AND THE AI PLATFORM\n- DATA-DRIVEN DECISIONS FOR YOUR BUSINESS\n- GLOSSARY AND SPECIFIC TERMS\n2. EXECUTIVE SUMMARY\nA Quick Overview of Market Performance\n- KEY FINDINGS\n- MARKET TRENDSThis Chapter is Available Only for the Professional EditionPRO\n3. MARKET OVERVIEW\nUnderstanding the Current State of The Market and its Prospects\n- MARKET SIZE: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035)\n- MARKET STRUCTURE: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035)\n- TRADE BALANCE: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035)\n- PER CAPITA CONSUMPTION: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035)\n- MARKET FORECAST TO 2035\n4. MOST PROMISING PRODUCTS FOR DIVERSIFICATION\nFinding New Products to Diversify Your Business\n- TOP PRODUCTS TO DIVERSIFY YOUR BUSINESS\n- BEST-SELLING PRODUCTS\n- MOST CONSUMED PRODUCTS\n- MOST TRADED PRODUCTS\n- MOST PROFITABLE PRODUCTS FOR EXPORTS\n5. MOST PROMISING SUPPLYING COUNTRIES\nChoosing the Best Countries to Establish Your Sustainable Supply Chain\n- TOP COUNTRIES TO SOURCE YOUR PRODUCT\n- TOP PRODUCING COUNTRIES\n- TOP EXPORTING COUNTRIES\n- LOW-COST EXPORTING COUNTRIES\n6. MOST PROMISING OVERSEAS MARKETS\nChoosing the Best Countries to Boost Your Export\n- TOP OVERSEAS MARKETS FOR EXPORTING YOUR PRODUCT\n- TOP CONSUMING MARKETS\n- UNSATURATED MARKETS\n- TOP IMPORTING MARKETS\n- MOST PROFITABLE MARKETS\n7. PRODUCTION\nThe Latest Trends and Insights into The Industry\n- PRODUCTION VOLUME AND VALUE: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035)\n8. IMPORTS\nThe Largest Import Supplying Countries\n- IMPORTS: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035)\n- IMPORTS BY COUNTRY: HISTORICAL DATA (2012–2024)\n- IMPORT PRICES BY COUNTRY: HISTORICAL DATA (2012–2024)\n9. EXPORTS\nThe Largest Destinations for Exports\n- EXPORTS: HISTORICAL DATA (2012–2024) AND FORECAST (2025–2035)\n- EXPORTS BY COUNTRY: HISTORICAL DATA (2012–2024)\n- EXPORT PRICES BY COUNTRY: HISTORICAL DATA (2012–2024)\n10. PROFILES OF MAJOR PRODUCERS\nThe Largest Producers on The Market and Their Profiles\nLIST OF TABLES\n- Key Findings In 2024\n- Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Market Value: Historical Data (2012–2024) and Forecast (2025–2035)\n- Per Capita Consumption: Historical Data (2012–2024) and Forecast (2025–2035)\n- Imports, In Physical Terms, By Country, 2012–2024\n- Imports, In Value Terms, By Country, 2012–2024\n- Import Prices, By Country, 2012–2024\n- Exports, In Physical Terms, By Country, 2012–2024\n- Exports, In Value Terms, By Country, 2012–2024\n- Export Prices, By Country, 2012–2024\nLIST OF FIGURES\n- Market Volume, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Market Value: Historical Data (2012–2024) and Forecast (2025–2035)\n- Market Structure – Domestic Supply vs. Imports, in Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Market Structure – Domestic Supply vs. Imports, in Value Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Trade Balance, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Trade Balance, In Value Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Per Capita Consumption: Historical Data (2012–2024) and Forecast (2025–2035)\n- Market Volume Forecast to 2035\n- Market Value Forecast to 2035\n- Market Size and Growth, By Product\n- Average Per Capita Consumption, By Product\n- Exports and Growth, By Product\n- Export Prices and Growth, By Product\n- Production Volume and Growth\n- Exports and Growth\n- Export Prices and Growth\n- Market Size and Growth\n- Per Capita Consumption\n- Imports and Growth\n- Import Prices\n- Production, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Production, In Value Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Imports, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Imports, In Value Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Imports, In Physical Terms, By Country, 2024\n- Imports, In Physical Terms, By Country, 2012–2024\n- Imports, In Value Terms, By Country, 2012–2024\n- Import Prices, By Country, 2012–2024\n- Exports, In Physical Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Exports, In Value Terms: Historical Data (2012–2024) and Forecast (2025–2035)\n- Exports, In Physical Terms, By Country, 2024\n- Exports, In Physical Terms, By Country, 2012–2024\n- Exports, In Value Terms, By Country, 2012–2024\n- Export Prices, By Country, 2012–2024"
    },
    {
      "url": "https://api.newsfilecorp.com/redirect/nooEJseO8A",
      "text": "Campbell Crotser Fluorspar Project\nCleanTech's Campbell Crotser Fluorspar Project covers 250 acres in Livingston County, Kentucky, within America's most prospective Illinois-Kentucky Fluorspar District spanning 540 squared miles with 3.5 million tons of historic fluorspar production.*\nA historic mineral resource estimate by Boyce Moodie Ill in 1974 for Cerro Spar Corporation on the Project, reported reported 805,841 tons grading 37.10% CaF2, 3.23% n, and 0.99% Pb.**\nChina produced over 60% of the world’s fluorspar in 2023. Find out more\nHistory of Kentucky Fluorspar Mining. Find out more\n*Denny et al., Mines in the Illinois Portion of the Illinois-Kentucky Fluorspar District, ISGS Circular 604 (2020) - Production History section citing Anderson & Sparks 2012 (3.5 Mt Kentucky output\n**The key assumptions, parameters, and methods used to prepare this historical resource estimate are not available. The Company has not reviewed or validated the historic data, and caution should be taken as a qualified person has not done sufficient work to classify these historical resource estimates as a current mineral resource and the Company is not treating them as a current mineral resource. Find out more\nCleanTech's Gibellini vanadium project is located in battle mountain region, Nevada, a state ranked as the number one mining investment destination by the Fraser Institute. Covering 21 km,\nGibellini holds 127 million pounds of measured and indicated and 195 million pounds inferred vanadium pentoxide (V2O5)\ndescribed in a 2024 technical report by Woods Plc. The project features an open-pit, heap-leach\noperation with a 0.2 strip ratio and over 60% recovery, targeting 99% pure V2O5 production.\nWater and sage credits are secured through a nearby Company's owned 3,000-acre ranch. Find out more.\nVanadium is a critical mineral and key ingredient in vanadium redox flow batteries, military and space-age alloys, and high-strength reinforcement steel bars for high rise buildings.\nChina produces over 60% of the world's Vanadium. Find out more."
    },
    {
      "url": "https://api.newsfilecorp.com/redirect/KLLkjcKR0K",
      "text": "Campbell Crotser Fluorspar Project\nCleanTech's Campbell Crotser Fluorspar Project covers 250 acres in Livingston County, Kentucky, within America's most prospective Illinois-Kentucky Fluorspar District spanning 540 squared miles with 3.5 million tons of historic fluorspar production.*\nA historic mineral resource estimate by Boyce Moodie Ill in 1974 for Cerro Spar Corporation on the Project, reported reported 805,841 tons grading 37.10% CaF2, 3.23% n, and 0.99% Pb.**\nChina produced over 60% of the world’s fluorspar in 2023. Find out more\nHistory of Kentucky Fluorspar Mining. Find out more\n*Denny et al., Mines in the Illinois Portion of the Illinois-Kentucky Fluorspar District, ISGS Circular 604 (2020) - Production History section citing Anderson & Sparks 2012 (3.5 Mt Kentucky output\n**The key assumptions, parameters, and methods used to prepare this historical resource estimate are not available. The Company has not reviewed or validated the historic data, and caution should be taken as a qualified person has not done sufficient work to classify these historical resource estimates as a current mineral resource and the Company is not treating them as a current mineral resource. Find out more\nCleanTech's Gibellini vanadium project is located in battle mountain region, Nevada, a state ranked as the number one mining investment destination by the Fraser Institute. Covering 21 km,\nGibellini holds 127 million pounds of measured and indicated and 195 million pounds inferred vanadium pentoxide (V2O5)\ndescribed in a 2024 technical report by Woods Plc. The project features an open-pit, heap-leach\noperation with a 0.2 strip ratio and over 60% recovery, targeting 99% pure V2O5 production.\nWater and sage credits are secured through a nearby Company's owned 3,000-acre ranch. Find out more.\nVanadium is a critical mineral and key ingredient in vanadium redox flow batteries, military and space-age alloys, and high-strength reinforcement steel bars for high rise buildings.\nChina produces over 60% of the world's Vanadium. Find out more."
    }
  ],
  "argos_summary": "CleanTech Vanadium Mining Corp. has entered into a binding option-to-purchase agreement to acquire a package of Fluorspar mining projects covering approximately 7,180 acres in the Illinois-Kentucky Fluorspar District, positioning the company as a significant player in the U.S. fluorspar market. The projects include over a dozen distinct deposits with substantial historic production and exploration potential, aimed at supplying critical minerals for various industrial applications. CleanTech's strategic assets are crucial in an import-dependent market, especially as global demand for fluorspar rises.",
  "argos_id": "X20VIK7WW"
}