{
  "url": "https://www.forbes.com/sites/feliciajackson/2025/08/12/the-trillion-pricing-gap-why-insurance-models-ignore-natures-value/",
  "authorsByline": "Felicia Jackson",
  "articleId": "60ce943c846e4c0f93cceae909b6a806",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://specials-images.forbesimg.com/imageserve/6897121957c7f91f5ba218e7/The-Mosquito-Fire-Burns-In-The-Sierra-Nevada-Mountains-Forcing-Thousands-To-Evacuate/960x0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:21:46+00:00",
  "addDate": "2025-08-12T07:33:51.515307+00:00",
  "refreshDate": "2025-08-12T07:33:51.515311+00:00",
  "score": 1.0,
  "title": "The $Trillion Pricing Gap: Why Insurance Models Ignore Nature’s Value",
  "description": "Insurers mispricing climate risks by ignoring nature-based solutions expose the financial system to greater risk, missing opportunities to boost resilience and cut costs.",
  "content": "Nature is not just environmental capital. In the age of climate volatility, it is a form of financial infrastructure, a stabilizing asset that can reduce losses, protect markets, and preserve economic stability. Yet in most underwriting and pricing, the protective value of ecosystems remains invisible — even when the data exists to prove it.\n\nA report by the Environmental Defense Fund (EDF), Nature for Insurance and Insurance for Nature , reveals a growing body of evidence that ecosystems can significantly reduce disaster risks while stabilizing insurance markets. Wetlands can absorb floodwaters, mangroves can blunt storm surge, and forests can mitigate wildfire spread — yet the insurance market still struggles to treat these services as risk-relevant assets.\n\nTalley Burley, climate risk and insurance manager at EDF and co-author of the report puts it plainly, “The conversation about working with nature-based solutions is new for many in the insurance industry... the industry is still in learning-mode about how nature works to minimize climate risk to communities... It’s not necessarily that the data doesn’t exist, but it may be that it’s not getting to insurers and modelers in a way that helps them see the benefits of nature from a risk management perspective.”\n\nThe proof points are no longer theoretical. In the Missouri River, have allowed floodwaters to spread naturally across reconnected floodplains, reducing damage and creating vital habitat. In California’s Sierra Nevada, a community-wide ecological forestry initiative led not only to a lower wildfire threat but also to .\n\nBurley notes, \"A recent pilot out of California priced insurance based on investments in forestry practices, helping lead to an almost 40% reduction in premiums because of the resulting lower risk of catastrophic wildfire.\" These cases demonstrate the potential of nature-based solutions to reduce financial exposure to environmental risks.\n\nOther pilots are putting these principles into practice. Coastal communities in the Gulf of Mexico are factoring marshland restoration into insurance products, while urban resilience initiatives are beginning to reflect the cooling and water-retention benefits of green infrastructure. In Mexico, coral reefs are now protected by insurance policies that pay out immediately after hurricanes to fund emergency repairs. These examples signal a broader shift in how risk can be managed, and how ecosystems are beginning to be treated not as externalities, but as investable risk buffers.\n\nDespite these advances, policy frameworks often work against nature-based risk reduction. For decades in the U.S., the National Flood Insurance Program has underpriced flood coverage. FEMA’s Risk Rating 2.0 reform was meant to correct this, but its 18% annual cap on increases means it will take a decade or more for rates to reflect actual exposure. The result is a misaligned affordability signal that dulls incentives to adapt and crowds out private innovation.\n\nSean Harper, chief executive of Kin Insurance, is blunt about the stakes. In an interview he says,“When risk is mispriced, mitigation becomes optional rather than essential. In the face of a rapidly changing climate, delay is not a neutral act – it’s a compounding risk.” He warns that subsidized pricing can actively raise risk for everyone else adding, “NFIP actually encourages the building of houses and other infrastructure in wetland areas by offering below-cost insurance in those areas. That destruction of the wetlands actually increases the risk for everyone else.”\n\nCalifornia’s experience with wildfire insurance shows the dangers of ignoring shifting risk. Before the 2018 Camp Fire, many insurers and catastrophe models had already identified rising wildfire risk, but regulatory limits kept rate adjustments from signaling that danger to homeowners. The feedback loop broke down: households had little reason to invest in mitigation, carriers could not recalibrate exposure, and reinsurance costs rose as global capacity reassessed the peril.\n\n“When there is a delay in recognizing changes in risk or enabling appropriate rate adjustments to correspond with those changes, it disrupts the healthy function of this feedback loop,” Harper says. “Costs are not signaling the increased risk, which prevents the signal for people to understand things are changing and to adapt their behavior to reduce risk.”\n\nClosing the gap between narrative and pricing requires moving nature into the quantifiable core of risk modeling. Harper’s argues that, “Ecosystem-based resilience should be as verifiable as elevation certificates or mitigation retrofits. This means defining how natural defenses perform during loss events and embedding those assumptions into risk analysis models. Without that clear connection, insurers will find it hard to offer differentiated pricing or incentivize the use of these protective landscapes.”\n\nBurley adds, “Insurers need deep analysis that proves a solution performs multiple times over, a history that shows it performs.” Updating models is costly and time-consuming and localized, project-level data is still scarce in formats that modelers can readily use. Regulators in turn need actuarial evidence that ties specific ecological conditions or interventions to changes in expected loss, not just to broad resilience narratives.\n\nThere are signs that the policy environment is shifting. The U.S. Army Corps of Engineers now requires that nature-based alternatives be fully considered in project planning. Regulators in California and Colorado are starting to factor landscape-scale mitigation into insurance oversight, including ecological interventions. Large carriers and intermediaries, including AXA, Munich Re and Guy Carpenter, are piloting products that reflect nature’s protective value, from parametric cover that trigger on environmental indices, to initiatives that link pricing to verified land management.\n\nAt the same time, the research base is getting more precise. As Burley points out, “A recent study from the Swiss Re Institute found coastal wetlands in Florida reduce the frequency of flood insurance claims from lower severity storms that are responsible for around 40% of all flood claims.” This is the kind of evidence that helps move nature from a general good to a quantifiable component of loss prevention.\n\nThe stakes are not limited to insurance line items. When carriers retreat from high-risk areas without nature-based risk reduction in place, the consequences cascade through the economy. It accelerates , where coverage gaps can block mortgage approvals, erode property values, and weaken municipal tax bases, shifting disaster recovery costs onto public budgets and, ultimately, other taxpayers.\n\nLeft unchecked, such dynamics can trap communities in a cycle of declining investment, rising financial risk, and reduced resilience . Recognizing nature as financial infrastructure is therefore not only about protecting ecosystems. It is also about safeguarding credit access and local fiscal stability, and about maintaining the conditions for investment and growth.\n\nThe EDF report does more than argue for pricing nature in however, it flips the equation to show how insurance can support nature. With vast pools of capital and influence over how risk is managed across supply chains and geographies, insurers can drive better outcomes through underwriting standards, portfolio choices, client engagement, and policy advocacy. Some carriers have already stepped back from insuring deforestation-linked activities or oil and gas exploration in protected areas. Others are channeling funds to biodiversity restoration or coral reef protection, sometimes paired with innovative coverage that keeps ecosystems functioning after a shock.\n\nGlobally, investor coalitions like Nature Action 100 are now urging insurers to align their portfolios with biodiversity targets. With trillions of dollars under management, insurers can channel capital into nature-positive infrastructure, conservation finance, and the restoration economy. Doing so is not just climate-aligned but also financially prudent in an era of mounting systemic risk.\n\nBurley cautions that equity must be part of the equation adding, “Without deliberate effort, nature-positive insurance could deepen inequity. But when designed with inclusion in mind, it offers a pathway to more just, resilient systems.” Lower-income and marginalized communities often lack both natural protections and affordable coverage, which makes the integration of nature into insurance both a financial and a social imperative.\n\nThe next generation of insurance will model more than wind speed, elevation, and fuel load. It will model the health of mangroves, wetlands, forests, dunes, and reefs, and it will translate those conditions into expected loss and price. That transformation will not happen by accident. This transformation will require leadership willing to build the data standards, modeling capacity, and regulatory recognition to make nature’s value visible at the point of pricing.\n\nBurley’s conclusion is straightforward when she says, “Insurers must be able to quantify the value of nature in reducing losses.” The companies that act on that premise now will reduce claims, open new markets, and set the standard for resilience in a more volatile world, while helping to preserve the very infrastructure that keeps risk insurable at all.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/ninaseega/2024/03/01/why-the-insurance-industry-must-wake-up-to-the-harsh-reality-of-climate-change/",
    "https://library.edf.org/AssetLink/uky3347ks0532vxm44um360jb0x2uwup.pdf",
    "https://www.nature.org/content/dam/tnc/nature/en/documents/ImprovingFloodResilienceThroughInsuranceandNatureBasedMitigation_21NOV01.pdf",
    "https://www.forbes.com/sites/jennifercastenson/2025/06/27/on-the-brink-of-collapse-housing-needs-solutions-for-climate-risk/",
    "https://www.law.berkeley.edu/wp-content/uploads/2025/04/Wildfire-Resilience-Insurance_Technical-Report_CLEE_040225.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "climate risk",
      "weight": 0.07839232
    },
    {
      "name": "rising financial risk",
      "weight": 0.0770007
    },
    {
      "name": "rising wildfire risk",
      "weight": 0.0762481
    },
    {
      "name": "shifting risk",
      "weight": 0.07552251
    },
    {
      "name": "risk",
      "weight": 0.075427264
    },
    {
      "name": "disaster risks",
      "weight": 0.07500307
    },
    {
      "name": "environmental risks",
      "weight": 0.0749658
    },
    {
      "name": "risk modeling",
      "weight": 0.0741596
    },
    {
      "name": "risk analysis models",
      "weight": 0.07353509
    },
    {
      "name": "wildfire insurance",
      "weight": 0.06906393
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.916015625
    },
    {
      "name": "/Science/Ecology & Environment/Other",
      "score": 0.486572265625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.391357421875
    }
  ],
  "sentiment": {
    "positive": 0.37792036,
    "negative": 0.17699802,
    "neutral": 0.44508162
  },
  "summary": "A report by the Environmental Defense Fund (EDF), Nature for Insurance and Insurance for Nature reveals that ecosystems can significantly reduce disaster risks while stabilizing insurance markets. However, the insurance market still fails to recognize these services as risk-relevant assets. The report suggests that the industry is still in learning mode about nature's ability to mitigate climate risk. Examples include the Missouri River allowing floodwaters to spread over reconnected floodplains, and California's Sierra Nevada offering a community-wide ecological forestry initiative leading to a lower wildfire threat and a 40% reduction in premiums due to the resulting lower risk of catastrophic wildfire. Despite these advances, policy frameworks often hinder nature-based risk reduction. The National Flood Insurance Program in the US has underpriced flood coverage for decades and its 18% annual cap on increases means it will take a decade or more for rates to reflect actual exposure.",
  "shortSummary": "The insurance industry faces a $ trillion pricing gap due to a lack of understanding about nature’s value and risk management, risking market stability and innovation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f455db6d60de420e80ed7b037dab777d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/jennifercastenson/2025/06/27/on-the-brink-of-collapse-housing-needs-solutions-for-climate-risk/",
      "text": "A storm brings immediate devastation—damaged homes, power outages, and lost lives—but its long-term impact often stretches years into the future. Beyond cleanup and rebuilding, many homeowners face climate risk in terms of rising insurance costs, diminished property values, and unaffordable living conditions.\nClimate risk is now a defining force in the U.S. housing market. It’s not just a matter of weather—it's a financial, economic, and insurance crisis unfolding in real time.\nClimate Risks Are Widespread\nGlobal property data firm Cotality estimates that more than 33 million U.S. homes are at risk of hurricane wind damage this year, with a combined $12 trillion in reconstruction value. Additionally, more than 6.4 million homes, worth $2.2 trillion, face moderate or greater flood risk.\nThis risk is growing—and costly. According to the State of the Nation’s Housing 2025 report by Harvard’s Joint Center for Housing Studies, 20.3 million homeowners (24%) were cost-burdened in 2023. A key driver are rising property insurance premiums, which increased 57% from 2019 to 2024.\nIn high-risk states such as California, Florida, and Louisiana, homeowners are already grappling with unaffordable insurance, reduced coverage, or losing coverage altogether.\nForeclosures Are Rising\nThe financial toll of climate events extends beyond insurance. It’s reshaping credit risk and destabilizing lending models.\nAccording to a report by First Street Foundation, Climate, the Sixth ‘C’ of Credit, the impact of Hurricane Sandy provides a real world example. Home prices in affected areas dropped 14% annually for five years, destroying home equity and causing foreclosures to go up.\nThese property-level losses rippled through the financial system, resulting in $68 million in unpaid principal and interest. Under a standard 50% loss-given-default assumption, this translated to $34 million in credit losses—losses not captured by traditional credit risk models.\nRecognizing this gap, First Street proposes a sixth “C” in credit assessment: climate, which would exist beside the five traditional credit metrics, character, capacity, capital, collateral, and conditions.\nThe future is troubling. First Street projects that credit losses due to climate risk could rise from $1.2 billion in 2025 to $5.4 billion by 2035. By then, climate-related foreclosures could account for 30% of all foreclosure activity—up from 6.7% in 2025.\nClimate Risk Shrinks The Buyer Pool\nClimate events are upending the insurance market. Insurers are pulling out of high-risk areas or raising rates dramatically. Every 1 percentage point increase in annual insurance premiums is associated with a 1.05 percentage point rise in foreclosure rates, according to Kin Insurance.\nA recent Kin survey found that 72% of homeowners consider insurance unaffordable. Without adequate insurance, homeowners can’t qualify for a mortgage—shrinking the buyer pool and pushing more families out of reach of homeownership, especially in coastal areas.\nForecasting storm severity is becoming more difficult. NOAA predicts a 60% chance of an above-average hurricane season in 2025 with up to 19 named storms. Yet actual outcomes have repeatedly gone way above forecasts. Kin estimates that NOAA’s models may be underestimating severity by up to 90%.\nClimate Risk Destroying Home Values\nHurricane risk is already altering housing demand, even in traditionally stable markets.\nAccording to Cotality, more than 656,000 homes in Charleston, S.C., Wilmington, N.C., and Virginia Beach, Va., are vulnerable to storm surge if a hurricane makes landfall. Home sales are slowing—properties in Virginia Beach stayed on the market 32% longer in 2025 compared with early 2024, while homes in Wilmington lingered 19% longer.\n“Buyers are factoring environmental risks into decisions in ways we haven’t seen before,” said Selma Hepp, chief economist at Cotality in a press release. “They’re pricing in insurance premiums, future storms, and resale challenges. That’s reshaping demand in coastal markets—even where past storm activity has been minimal.”\nHome values are also dropping. Properties in Miami’s 100-year flood zone have declined by up to 18% per square foot. But any savings are often wiped out by skyrocketing insurance costs—if coverage is even available.\nIn states like Florida and Texas, several insurers have exited the market or gone bankrupt, forcing state-backed insurers to step in. Premiums are also climbing in Virginia and South Carolina, straining affordability.\nThe Case For Affordable Mitigation\nMitigation doesn’t have to be expensive. Hurricane risks, particularly wind, have the biggest impact a home’s roof. According to Kin Chief Insurance Officer Angel Conlin, simple upgrades like roof clips and secondary water barriers can make a significant difference.\n“It costs less than $1,500 to add clips that hold down the roof—and Kin offers credits that help homeowners recover the cost in the first year,” she said.\nKin also conducts follow-up inspections after underwriting to recommend safety improvements that lower risk and insurance costs.\nDesign To Defend Against Climate Risk\nArchitects and builders can help mitigate risks through smarter design. Features like hip roofs, “peel and stick” underlayment, and reinforced garage doors improve storm resilience. Metal roofs last longer and are more wind-resistant—though they carry a higher upfront cost.\n“Shingle roofs in Florida rarely last their full lifespan,” said Conlin. “Most carriers won’t write a shingle roof over 10 years old.”\nOther best practices include removing overhanging trees, elevating electrical systems, and incorporating backup power through generators or solar.\nMany home builders are creating home designs with panel or modular solutions that can withstand the strongest storm conditions, and even delivering them at an affordable price point offsetting the rising insurance premiums.\nA Financial System Under Pressure\nFlooded homes have a 40% higher foreclosure rate than their neighbors. And in a broader economic downturn, these risks compound—lowering home values, weakening financial institutions, and destabilizing the mortgage system.\nAfter Hurricane Sandy, banks underestimated foreclosures by nearly 400 cases due to ignoring flood risk. The result was $68 million in unpaid principal, and $34 million in credit losses. Response measures can be helpful, but also carry long-term costs for lenders.\nFirst Street’s model shows that, without major changes to lending criteria and mitigation efforts, climate risk will continue to drive foreclosures through rising premiums, slow price growth, and more frequent disasters.\nClimate Risk Demands Solutions\nThe risks tied to climate events are not just environmental—they are deeply economic and structural. From soaring insurance costs to rising foreclosures, the climate crisis is pushing the U.S. housing system to a tipping point.\nMore real estate data companies are tracking the impacts and making them visible, which also is showing certain markets at higher risk than others, and inspiring the need for updated building codes as a viable solution.\nClimate risk solutions are available, but require action: smarter construction, insurance reform, updated lending models, and proactive mitigation. Without these changes, more Americans will find themselves priced out, uninsured, or underwater—both financially and literally."
    },
    {
      "url": "https://www.forbes.com/sites/ninaseega/2024/03/01/why-the-insurance-industry-must-wake-up-to-the-harsh-reality-of-climate-change/",
      "text": "Insurance sits at the forefront of physical risk analysis. In simple terms, it means purchasing protection against unexpected financial losses that may arrive in the future. So as climate-related disasters become both more frequent and severe, the risk of abrupt loss increases.\nUp until very recently, the industry has not been as loud in the climate conversation as asset owners, investment managers or banks. But that’s starting to change as the world wakes up to the gravity of the climate crisis.\nPhysical sources of risk, such as hotter-than-usual summers which bring higher-than-usual mortality rates, are manifestations of global heating. These risks can be deemed “acute” when they take the form of a very extreme weather event, which happens more often than expected, or “chronic” when they demonstrate a longer term shift in climatic patterns.\nAccording to Munich Re, in 2023, natural catastrophe losses globally amounted to $250 billion and more than 74,000 deaths. One distinguishing element of these figures was the absence of mega disasters. Instead, economic losses came from a large number of severe regional storms.\nThe size of these financial losses may sound colossal, but the financial consequences of the physical risks of climate change remain underestimated within the system. This is partly because they fall within the unspoken assumptions of how individual financial actors will behave in a catastrophe. For example, banks consider physical sources of risk to be insurable and make the assumption that insurance companies will cover the losses when they materialise.\nBest High-Yield Savings Accounts Of 2024\nBest 5% Interest Savings Accounts of 2024\nThis assumption is true to an extent. Insurance companies will cover the losses after an initial event, but once the (often) annual policy lapses there is the possibility of either repricing or withdrawing coverage.\nWe have already seen the impact of this practice in California and Florida, where home insurance is becoming prohibitively expensive. Two global insurers have pulled out of the home insurance market in California because of the increased risk of wildfires, the growing costs of rebuilding and higher reinsurance premiums (essentially the costs of protection that insurance companies seek for their exposures). In these situations the risk shifts to home owners and ultimately their lenders if the house is mortgaged.\nThe actual financial risk within the system is therefore shifting towards consumers and banks, increasing the protection gap, namely the difference between potential losses from an event and insured losses.\nIn 2023, insured losses globally amounted to $95 billion, meaning that $155 billion of losses had to be absorbed by somebody else. Comparatively, in 2022 the amount of total losses was about the same, but insured losses were $125bn, meaning that over 2023 uninsured losses grew substantially.\nThis trend is one of the reasons why climate stress tests, usually conducted by financial regulators, should be done on the banking and insurance industries together.\nA climate stress test is performed to understand how resilient the financial system is to a particular climate scenario. A number of these have been performed over the last couple of years, including in France, the UK and in the European Union by the European Central Bank. The Fed in the US in 2023 also conducted a pilot climate scenario exercise. The Bank of England tested the insurance and banking industries together in 2021 as part of the climate biennial exploratory scenario test to flush out contradicting assumptions about who will have to absorb ever increasing financial losses from natural catastrophes. The results suggested that both banks and insurers project the lowest costs with early well-managed action to bring down greenhouse gas emissions. Further, the results showed that while initially costs will be borne by banks and insurers, ultimately they may be passed to customers.\nIt is largely because of this state of affairs that we are hearing more and more from the insurance industry on the topic of building climate resilience and transitioning to a more sustainable economy.\nThe ClimateWise Principles are a set of seven climate-related disclosure principles to be followed, which insurance companies commit to disclose when joining the initiative. Convened by the sustainable finance team at CISL, we conduct an annual, public review highlighting the progress made by the ClimateWise members. The 2023 edition, published in January 2024, shows more engagement from the insurance industry in conversations with clients and partners about the importance of understanding, measuring and managing physical sources of risk and engaging with partners on building climate resilience.\nWith greenhouse gas emissions continuing to rise, the impacts of climate change will only get worse. Insurance companies can no longer pretend they can continue with business-as-usual.\nInstead they need to engage fully in work to better comprehend the physical sources of risk and how they, along with other members of the financial community, can best protect interests and ensure that people are not left out in the cold, unable to insure their home or to recuperate losses after extreme weather events."
    }
  ],
  "argos_summary": "The Environmental Defense Fund's report highlights the critical role of ecosystems in reducing disaster risks and stabilizing insurance markets, yet their protective value remains largely unrecognized in insurance pricing. Nature-based solutions, such as wetlands and forests, have demonstrated their effectiveness in mitigating climate risks, but policy frameworks often hinder their integration into risk management. As climate risks escalate, the insurance industry must adapt by quantifying nature's value in loss prevention and embracing innovative approaches to underwriting and pricing, while also addressing equity concerns to avoid deepening social disparities.",
  "argos_id": "X7I36524Q"
}