{
  "url": "https://www.pymnts.com/study_posts/small-business-growth-monitor-q2-2025-from-headwinds-to-hope-on-main-street//",
  "authorsByline": "Ashley McLeod",
  "articleId": "9de85ab2f6be4b8ba825c66148af4e1f",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/small-business-growth-monitor-q2-2025-from-headwinds-to-hope-on-main-street-hero.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:00:49+00:00",
  "addDate": "2025-08-12T08:04:18.925696+00:00",
  "refreshDate": "2025-08-12T08:04:18.925697+00:00",
  "score": 1.0,
  "title": "Small Business Growth Monitor Q2 2025: From Headwinds to Hope on Main Street",
  "description": "SMBs’ confidence has hit a three-year high as costs rise. Discover what’s driving growth and the risks ahead in PYMNTS’ latest report.",
  "content": "By completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nEven amid broad economic uncertainty due to the President Donald Trump administration’s global trade agenda, many small- to medium-sized businesses (SMBs) in the United States are now feeling good about their near-term future. More than 8 in 10 said in early June that they expect to still be in operation two years from now, the highest share since PYMNTS Intelligence began tracking business confidence just over three years ago. It’s a shift from only four months ago. In early February, when global tariffs were in the air but the April “Liberation Day” levies regime hadn’t yet unfolded, nearly 1 in 5 small businesses were pessimistic about their odds of survival. Nearly 7% said they might not make it. By early June, just 5.3% said it was likely they won’t survive.\n\nBut the newly rosier outlook isn’t spread evenly across all businesses. Much depends on a business’s size and industry. Construction and utilities firms, as well as retailers, are by and large seeing improved financial health. While the smallest and largest of SMBs are feeling more optimistic, mid-sized businesses (those with annual revenues between $150,000 and $1 million) saw a slight decrease in confidence in June compared to prior months. Hospitality businesses, including hotels and restaurants, are struggling the most.\n\nA recent, small boost in consumer spending may have helped business outlooks.\n\nThe fresh data comes as consumers slightly boosted their spending in June by 0.3%, Bureau of Economic Analysis data shows. The increase, driven by slightly more purchases of food, beverages, apparel and recreational goods, came alongside an identical-sized uptick in disposable income. It seems that as consumers weather economic uncertainty and maintain their spending in certain categories, particularly essentials and discretionary items related to experiences and personal care, some SMBs are showing resilience amid widespread uncertainty about the economy and consumer spending.\n\nMore positive outlook notwithstanding, things are far from uniformly smooth sailing. Rising costs of imported goods, services and labor pose challenges, hurting some SMBs’ financial health.\n\nThese are just some of the findings detailed in “Small Business Growth Monitor Q2 2025: From Headwinds to Hope on Main Street,” a PYMNTS Intelligence exclusive report. This edition examines the current financial health of SMBs and their future expectations. It draws on insights from a survey of 513 SMBs conducted from June 2, 2025, to June 17, 2025.\n• SMBs Are More Optimistic Than Ever About Their Long-Term Survival\n• Despite Widespread Confidence, Micro-SMBs Are Facing Cost and Cash Flow Challenges\n\nSMBs Are More Optimistic Than Ever About Their Long-Term Survival\n\nSmall businesses are the backbone of the American economy, with nearly 35 million driving close to half (43.5%) of U.S. GDP, Small Business Administration data shows. Independent retailers, accounting firms, mom-and-pop restaurants, local construction firms and the like are crucial to the nation’s financial health, making the sector a bellwether of consumer spending and economic growth.\n\nSMBs are more optimistic about their future than they’ve been in three years. As of early June, 82% expected to be still operating two years from now. This marks the highest share on record since PYMNTS Intelligence began tracking SMB sentiment in July 2022. It is also an uptick from the 76% who said this in early February. Additionally, 12% now believe it is only somewhat likely that they will survive the next two years, compared to 17% in the February survey. Just 5.3% now say they are only slightly or not at all likely to survive, compared to 6.9% in the February survey. It seems that, for the time being, SMBs are feeling better about their prospects.\n\nA component of the rise in confidence is the micro-SMB segment—businesses with $150,000 or less in annual revenue. Among these tiny companies, 3 in 4 say they are very or extremely likely to survive the next two years. While this share is smaller than that of larger SMBs, it marks an increase from 68% in March and February. Among large SMBs with revenues exceeding $1 million, the confidence share held flat at 91%.\n\nBy contrast, medium-sized SMBs with revenues between $150,000 and $1 million saw a slight decrease in optimism. The share reporting high levels of confidence fell to 83% in June from 87% in March.\n\nBolstering this confidence, a range of variables is positively affecting SMBs’ performance, from exogenous factors to the strategic decisions companies have recently made about their operations. For SMBs of all sizes, increased customer demand is the most common positive contributor. All told, 40% of SMBs say they are seeing benefits from rising demand. Consumers have stated that they may reduce their purchases of certain goods and services if tariffs, many of which took effect on Aug. 7, drive up inflation. But they have also indicated that they plan to stick to some of their discretionary spending, particularly on household and lifestyle items, personal care products and extracurricular activities for children—areas where many small businesses, such as nail salons and summer camps, excel.\n\nOther favorable factors include reduced operating costs and more effective marketing.\n\nThe largest SMBs (those with more than $1 million in annual revenue) are the most likely to benefit from introducing new products and services and from efficiency-boosting technology upgrades. The smallest firms (with annual revenues of less than $150,000) are more likely to cite more effective marketing or customer outreach.\n\nIn general, an SMB’s financial health is boosted by factors both within its control, such as internal technology upgrades and marketing, and outside its reins, such as the level of customer demand and improved supplier terms.\n\nDespite Widespread Confidence, Micro-SMBs Are Facing Cost and Cash Flow Challenges\n\nBut while micro-SMBs are increasingly optimistic, a few are the most likely to be facing declining financial health. Specifically, 14% report being worse off financially than they were six months earlier. This percentage is double the share of high-revenue SMBs that said the same.\n\nConstruction and utilities businesses report being the most financially stable. Nearly 2 in 3 said in June that they’re doing better than they were six months ago. This share is 20% higher than the cross-industry average. Conversely, hospitality businesses such as hotels and restaurants are struggling the most. Nearly 1 in 4 is worse off than they were six months ago.\n\nRising costs for imported goods or for services, poor cash flow and late customer payments disproportionately affect micro-SMBs. Among firms with annual revenues less than $150,000, 38% say higher goods and service costs have negatively impacted them. This share is higher than the 3 in 10 SMBs with revenues of more than $1 million that said the same. The gap may be due in part to smaller businesses having less negotiating power with suppliers favoring larger businesses. Additionally, 18% of micro-SMBs report being hurt by poor cash flow or late customer payments. This figure is twice the share of high-revenue SMBs that said the same.\n\nMeanwhile, the largest SMBs are now the hardest hit by rising labor costs and by supply chain disruptions. According to the Bureau of Labor Statistics, wages and salaries in June were up 1% from three months prior. Nearly 25% of SMBs are negatively impacted by labor cost inflation versus 12% of micro-SMBs. Additionally, 15% are adversely affected by supply chain disruptions compared to 8.6% of micro-SMBs.\n\nPYMNTS Intelligence is the leading provider of information on the consumer trends driving innovation in consumer finance, digital payments and financial inclusion. To stay up to date, subscribe to our newsletters and read our in-depth reports.\n• SMB Growth Monitor: How Firms Use and Choose Credit Cards\n• Brewing Storm: Why 1 in 5 Smaller Businesses Without Financing Fear They May Not Survive Tariffs\n\n“Small Business Growth Monitor Q2 2025: From Headwinds to Hope on Main Street” is based on a survey of 513 SMBs conducted from June 2, 2025, to June 17, 2025. The report examines the financial health of SMBs and their future expectations. Our sample consisted of SMBs of varying sizes and industries: 27% of them generate annual revenues of more than $1 million and 36% revenues of less than $150,000. The sample included SMBs in retail (17%), construction (18%), hospitality (9.4%), professional services (11%) and consumer services (9.8%).",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/study/smb-growth-credit-card-usage/",
    " https://advocacy.sba.gov/2024/07/23/frequently-asked-questions-about-small-business-2024/",
    " https://www.pymnts.com/study_posts/brewing-storm-why-1-in-5-smaller-businesses-without-financing-fear-they-may-not-survive-tariffs/",
    "https://www.bls.gov/news.release/pdf/eci.pdf",
    "https://www.pymnts.com/study_posts/brewing-storm-why-1-in-5-smaller-businesses-without-financing-fear-they-may-not-survive-tariffs/",
    "https://www.pymnts.com/subscribe/",
    " https://www.pymnts.com/economy/2025/exclusive-lights-flash-red-for-1-in-5-us-small-businesses-as-tariff-economy-sets-in/",
    " https://www.bea.gov/data/consumer-spending/main",
    " https://www.bea.gov/news/2025/personal-income-and-outlays-june-2025",
    "https://www.pymnts.com/study/fast-funds-steady-cash-flow-instant-payments-smbs/",
    "https://www.pymnts.com/study_posts/navigating-the-shifting-sands-of-consumer-spending-amid-rising-prices-and-new-tariffs/",
    " https://www.pymnts.com/study_posts/navigating-the-shifting-sands-of-consumer-spending-amid-rising-prices-and-new-tariffs"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "large SMBs",
      "weight": 0.09219475
    },
    {
      "name": "larger SMBs",
      "weight": 0.09219475
    },
    {
      "name": "SMBs",
      "weight": 0.08938163
    },
    {
      "name": "SMB sentiment",
      "weight": 0.086064756
    },
    {
      "name": "Small businesses",
      "weight": 0.08410416
    },
    {
      "name": "smaller businesses",
      "weight": 0.08410416
    },
    {
      "name": "many small businesses",
      "weight": 0.083019
    },
    {
      "name": "business confidence",
      "weight": 0.08007868
    },
    {
      "name": "Small Business Growth Monitor",
      "weight": 0.079447486
    },
    {
      "name": "larger businesses",
      "weight": 0.07642792
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.849609375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.7998046875
    },
    {
      "name": "/Business & Industrial/Small Business/Other",
      "score": 0.462158203125
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.39013671875
    }
  ],
  "sentiment": {
    "positive": 0.12212757,
    "negative": 0.748122,
    "neutral": 0.12975043
  },
  "summary": "Despite economic uncertainty due to the President Donald Trump administration’s global trade agenda, many small- to medium-sized businesses (SMBs) are now feeling good about their near-term future. Over 80% of SMBs expect to still operate two years from now, the highest share since PYMNTS began tracking business confidence three years ago. This is a shift from nearly 1 in 5 small businesses in early February, when global tariffs were in the air. However, the optimism is not evenly distributed across all businesses, with construction and utilities firms seeing improved financial health. Despite this, rising costs of imported goods, services and labor pose challenges for some SMBs. Despite these challenges, SMBs are more optimistic about their future than they've been in three years.",
  "shortSummary": "Despite economic uncertainty, many small businesses are more optimistic about their long-term survival, driven by increased consumer spending and rising costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a36e9f302a534bf1b7d0c449141f8590",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/study_posts/brewing-storm-why-1-in-5-smaller-businesses-without-financing-fear-they-may-not-survive-tariffs/",
      "text": "Cash flow is always top of mind for any business. That’s even more true when economic, policy and regulatory conditions shift. As the Trump administration applies sweeping global tariffs, consumers are pulling back on spending. Along with uncertainty about the levies’ longer-term status, the rapid changes are creating a newly volatile operating environment that is severely pressuring some enterprises. Fewer than 1 in 2 U.S. small and medium-sized businesses (SMBs) currently have access to any form of financing, new PYMTS Intelligence data shows. Thirteen percent with no access to financing consider their survival at risk in the next two years. Overall, 6.9% think they might not survive.\nWhile such pessimism pervades nearly 20% of smaller businesses, the situation is potentially precarious for half. Some 50% currently rely solely on their daily sales or owners’ personal savings to survive. By contrast, those with business credit cards report high levels of satisfaction. Meanwhile, others that can’t secure financing through mainstream credit sources—perhaps because they’re seen as high risk or don’t have sufficient collateral—often turn to riskier options, such as unsecured loans or personal credit cards. It should thus come as no surprise that businesses with access to traditional sources of financing are more confident in their ability to navigate current economic headwinds and their chances of survival in the long term.\nAt the same time, many SMBs that lack access to any form of financing, whether traditional or alternative, also claim not to need it. That is a counterintuitive finding amid an uncertain business environment where survival depends on the ability to tap timely funding.\nThese are just some of the findings detailed in “Brewing Storm: Why 1 in 5 Smaller Businesses Without Financing Fear They May Not Survive Tariffs,” a PYMNTS Intelligence report. This edition examines SMBs’ access to and use of varied financing sources. The report draws on insights from a survey of 560 SMBs conducted from Feb. 5, 2025, to Feb. 12, 2025.\nSurvival at Risk\nOne in five SMBs are worried about staying open.\nPYMNTS Intelligence finds that businesses without access to traditional financing are much less confident in their ability to adapt to a changing economic environment and remain in operation. During the survey in early to mid-February, some 6.9% of all SMBs said they were unlikely to survive the next two years. This figure spikes to 13% among SMBs without access to financing, an 86% increase.\nPYMNTS Intelligence found that 44% of SMBs had access to any form of financing. Just 36% had access to readily available cash, including another 8% that also had cash in the bank.\nFewer than 3 in 10, or 28%, of all SMBs have business credit cards. But those cardholders are satisfied with that form of financing. Sixty-four percent of businesses with access to any form of financing use their corporate cards to withdraw money for business operations. The cards offer SMBs many advantages, allowing them to access cash on a moment’s notice for generally low fees, as long as repayments are made on time. Four in 10 businesses with access to financing use personal credit cards held by their owners. This is a riskier financing method as it intertwines the owner’s personal and business finances. Instability in either area could potentially wreck the owner’s or their company’s financial well-being.\nTwenty-eight percent of SMBs used other financing sources, such as bank loans or investment assets. These credit options carry risks, such as higher fees or penalties if repayments aren’t made promptly.\nSignificantly, most SMBs did not have access to any financing. Such businesses instead relied solely on money from day-to-day sales or cash in the bank for survival. These SMBs have little to no safety net in the event of economic changes or declining revenue. A single slow business day could potentially jeopardize vendor payments or payroll, putting their financial future in peril. PYMNTS Intelligence found that 16% of SMBs did not have access to cash. Four in 10 had only cash in the bank. Specific industries are more vulnerable than others. For example, 64% of hotel, restaurant and entertainment companies’ sole financing option was cash they had in the bank.\nThe more precarious a business’s financial health, the more likely it correlates with financing access. More than 1 in 3, or 35%, of SMBs with decreasing revenue had no access to cash in the bank or readily available cash, compared to just 8% of firms with increasing revenue. Banks and credit card providers are more willing to extend credit to successful businesses, as there is a greater chance of them making repayments on time.\nSMBs Weigh Risky Financing Options\nBusiness credit cards are a favorite source of financing, but many SMBs turn to riskier options when they are desperate.\nBusiness credit cards are clearly the favorite option for SMBs with access to financing. This is because these cards offer instant access to cash up to a credit limit at any time. Our research finds that 44% of SMBs with access to financing used these cards in the last 12 months, with no other source of financing used by more than 15% of these firms—a testament to the cards’ reputation for convenience and reliability among SMB owners. SMBs see business credit cards as a safety net. These cards are popular with businesses regardless of their optimism about survival. Forty-four percent of SMBs who said it was very likely they would survive the next two years used such cards. That’s similar to the 45% of those who said their survival was somewhat likely and 40% who said the chances of survival were slim or not at all likely.\nDespite business credit cards being the top financing choice, SMBs that were more pessimistic about their long-term survival were much more likely to use riskier sources of financing as they maxed out their card limits. Twenty-seven percent of businesses that said it was unlikely they would survive the next two years used personal credit cards. Some 19% used unsecured bank loans, which typically have higher interest rates.\nIn general, companies with lower revenues were more likely to use personal credit sources for financing. Owners of firms with $150,000 or less in annual revenue used personal loans, personal investment assets, loans from employees, loans from family and friends and home mortgages much more often compared to firms with higher revenues. Each of these options carries personal and reputational risk, but businesses this cash-poor often do not qualify for better options.\nFinancing for Navigating Economic Troubles\nSMBs with access to financing are more confident in their ability to weather economic turbulence.\nHaving access to cash and financing means that a business can continue to pay its vendors, make payroll and cover other day-to-day functionalities, even if revenues slow down. One example of this can be seen in SMBs’ plans to navigate potential tariffs. Businesses with access to financing and cash are 23% more likely to be very confident in their ability to navigate tariffs compared to those who do not have access to financing or cash. Meanwhile, SMBs that do not have access to financing are 75% more likely to have no plan to help offset any additional costs from tariffs.\nBusinesses in different industries also said they would deploy different tactics to combat the adverse effects of tariffs. The retail industry is the most likely to replace foreign suppliers with domestic ones, with 36% of retailers saying they would leverage this strategy. Hotels and restaurants said they would negotiate with suppliers and use alternative materials. Professional services firms were the least likely to have a plan to respond to tariffs. However, those businesses rely the least on imported goods and are the least likely to be directly affected by the levies.\nSMBs Cope With Lack of Financing\nMany SMBs claim not to need financing. But they also don’t have access to it.\nBusinesses have many reasons for not using credit financing, ranging from high fees and interest rates (cited by 27% of survey respondents) to high repayments (17%) to concerns about data security (8%). The most oft-cited reason was lack of need. We found that 43% of SMBs that did not use any financing in the past 12 months said they did not require it. Surprisingly, 3 in 4 SMBs without any access to financing claimed they did not need it.\nRead More\nPYMNTS Intelligence is the leading provider of information on the trends driving SMB growth. To stay up to date, subscribe to our newsletters and read our in-depth reports.\nMethodology\n“Brewing Storm: Why 1 in 5 Smaller Businesses Without Financing Fear They May Not Survive Tariffs” is based on a survey of 560 U.S. SMBs conducted from Feb. 5, 2025, to Feb. 12, 2025. The report details the different sources those companies use for financing."
    },
    {
      "url": "https://www.pymnts.com/study_posts/navigating-the-shifting-sands-of-consumer-spending-amid-rising-prices-and-new-tariffs/",
      "text": "Many consumers have been re-evaluating their spending priorities amid higher prices on goods and services over the past 12 months, with the potential for tariffs to cause further increases sharpening that reconsideration. Yet new data from PYMNTS Intelligence reveals surprising areas where consumption stays steadfast, along with widening disparities in how consumers across different financial lifestyles plan to adapt to price increases. The data uncovers the critical price thresholds that can trigger a widespread pullback in spending across technology and digital services, groceries and dining out, household and lifestyle, and personal care.\nPYMNTS Intelligence finds that the share of consumers living paycheck to paycheck—65% of U.S. adults in March 2025—remained stable throughout the first three months of the year. For these shoppers, especially those who struggle to pay their monthly bills (22% of all consumers), rising prices are not an abstract economic trend but a daily decision-making challenge.\nFrom changing where they shop to skipping entire categories of purchases, the picture is one of consumers feeling increasingly pushed to make difficult decisions in every aisle. Yet insights into shoppers’ evolving spending habits reveal surprising resilience, especially in the household/lifestyle and personal care sectors. For instance, a vast majority of consumers who have had at least one manicure within the last 12 months say they will continue to indulge even if costs go up, indicating the inherent value they place on such services.\nBut even loyal consumers will walk away when prices reach double their prior levels. These shifts, compounded by uncertainty surrounding the Trump administration’s constantly shifting global tariff regime, hold significant implications for retailers as they strategize pricing in an increasingly cost-conscious and economically sensitive market.\nThese are just some of the findings detailed in this edition of “New Reality Check: The Paycheck-to-Paycheck Report,” a PYMNTS Intelligence exclusive series. This edition, “Navigating the Shifting Sands of Consumer Spending Amid Rising Prices and New Tariffs,” examines the impact of inflation on the financial lifestyles of U.S. consumers through insights from a survey of 2,280 U.S. consumers conducted from March 12, 2025, to March 31, 2025. The report explores the impact of inflation and tariffs on consumers’ purchasing habits.\nPrice-Proof Products: Personal Care and Child-Related Spending Show Resilience\nAs prices climb, the average consumer negotiates a complex landscape of needs and wants, making tough choices about where to tighten their belt and what to keep purchasing at all costs. Buying less of something or cheaper variants are popular options, with more than two-thirds of consumers combined taking these routes. Yet certain expenditures show remarkable price inelasticity, meaning they are resistant to pullbacks from price increases.\nData shows that 30% and 23% of all consumers surveyed, respectively, would continue to buy personal care and household/lifestyle products when faced with price increases. Notably, only 5.1% of consumers who have visited a nail salon in the last 12 months would forgo professional manicures or pedicures if prices were to rise. These findings underscore the service’s deeply ingrained value or perceived necessity among consumers, making them willing, to a degree, to pay higher prices.\nConsumer loyalty to household/lifestyle and personal care products reflects both the inherent value placed on these items and demographic purchasing. For instance, 81% of high-income individuals earning more than $100,000 a year made a select personal care purchase in the past year, compared to 50% of their lower-income (those earning less than $50,000) counterparts. In other words, since these product categories (household/lifestyle and personal care) are consumed at higher rates by high-income individuals, any price increases would likely not have as much of an impact on purchasing compared to other product categories with a wider consumer base, such as dining out.\nPrice inelasticity is mirrored in spending related to children. While 34% of parents would buy cheaper and 19% would buy less, just 2.9% report they would stop paying for children’s extracurricular activities even if their cost increased. At 42%, consumers are more likely to buy less designer clothing, while vacationers are more likely to buy cheaper when prices rise. In contrast to children’s extracurricular activities, vacations, at 7.1%, and designer clothing, at 14%, face significantly higher abandonment rates, signaling where consumers draw the line on discretionary spending.\nThese findings highlight the priority many consumers place on these personal well-being and developmental activities as they embed them into essential household spending. Moreover, inclusion of child-related costs within the household and lifestyle categories further contributes to their overall price stickiness, reflecting strong parental emphasis on these investments.\nWithin consumer spending on groceries and dining out, a clear hierarchy of necessity emerges. Again, two-thirds of consumers—half of them buying less, the other half, cheaper—report that they would take either of those routes when purchasing groceries or dining out. But while restaurant dining is viewed as discretionary, just 14% of consumers are willing to eliminate it entirely after price increases. Only 3.4% would stop purchasing milk (dairy or plant-based), demonstrating its essential status in household budgets. These findings underscore specific areas where consumer demand demonstrates less sensitivity to price increases, providing valuable insights for businesses operating in these sectors.\nThe Economic Resilience Gap: How Finances Impact Spending Choices\nWhat shoppers are willing to cut back on or abandon altogether varies significantly according to their financial lifestyle (which does not always correlate with income, as some high-income consumers live paycheck to paycheck). Consumers who do not live that way are 2.4 times more likely to keep their purchasing habits at the same level amid price increases compared to those struggling financially. Specifically, 31% of financially secure consumers reported they would continue buying at their current quantity and frequency. By contrast, only 13% of paycheck-to-paycheck consumers with issues paying their monthly bills indicate the same.\nThis “economic resilience gap” illustrates the profound relationship between financial security and consumer price elasticity. Furthermore, paycheck-to-paycheck consumers are more inclined than those not living that financial lifestyle to seek cheaper alternatives or reduce the quantity or frequency of their purchases when prices increase.\nConcerns about tariffs are also influencing consumer responses to rising prices. Across all financial lifestyles, 8.2% of consumers who think tariffs will negatively impact their finances plan to stop buying certain goods and services if prices increase, compared to 6.1% of those who view tariffs in a positive light—a 34% difference. Again, most shoppers say they will buy less or buy cheaper, further indicating how broader economic concerns can amplify a consumer’s sensitivity to prices.\nAcross all product categories, consumers not living paycheck to paycheck are more inelastic, meaning they are more likely to continue purchasing all types of products and services when faced with higher prices. Across financial lifestyles, however, certain purchases show more vulnerability. Whereas 41% of consumers not living paycheck to paycheck would continue buying personal care products regardless of how much more they cost, only 14% of paycheck-to-paycheck consumers struggling to meet their monthly financial obligations would do the same. In fact, financially stable consumers are 193% more likely to keep buying personal care products than struggling consumers. Likewise, data on spending habits shows that financially stable consumers are 93%, 114%, 169% and 150%, respectively, more likely than crimped consumers to keep buying technology, groceries and dining out, and household and lifestyle goods and services. This disparity in consumers’ purchasing decisions highlights the constrained options faced by financially vulnerable consumers and their heightened sensitivity to price fluctuations, contrasting with the greater capacity of financially stable consumers to absorb cost increases.\nPrice Sensitivity Threshold: When Prices Double\nBeyond gradual price increases, a critical point is reached when prices rise 10%. Nearly 52 million consumers would abandon spending on select types of technology and digital devices—from laptops to Netflix subscriptions—as well as on groceries and dining out, household and lifestyle items, and personal care products and services, once the price goes up by 10%. Nearly 11 million more would draw the line at prices doubling. Collectively, 62.8 million individuals would stop making certain purchases. Notably, more than 1 in 4, or 27%, of shoppers said they would abandon purchases in the household/lifestyle category when their prices doubled. This suggests that even categories initially showing price inelasticity have a limit to consumer tolerance.\nWhile overall trends show increased abandonment at higher prices across all product categories, an interesting exception emerges among financially struggling consumers. Consumers living paycheck to paycheck with issues paying bills (14%) are less likely to give up their retail memberships compared to financially secure consumers (15%) when prices increase, suggesting the perceived value of savings from retailers such as Costco and Amazon Prime. This unique pattern suggests that membership-based savings models provide essential economic utility to financially vulnerable households, prioritizing maintaining their memberships even under price pressure. Meanwhile, other discretionary categories, including dining out, video streaming subscriptions and premium cosmetics, show the expected pattern, with struggling consumers much more likely to abandon purchases. Consumer sensitivity to price thresholds thus underscores the potential for a drop-off in buying if retailers’ pricing strategies lead to extreme price hikes across various product categories.\nRead More\nPYMNTS Intelligence is the leading provider of information on the trends driving the economy and how paycheck-to-paycheck consumers respond. To stay up to date, subscribe to our newsletters and read our in-depth reports.\nMethodology\n“New Reality Check: The Paycheck-to-Paycheck Report—Navigating the Shifting Sands of Consumer Spending Amidst Rising Prices and New Tariffs,” examines the impact of price increases on the spending patterns of U.S. consumers and draws on insights from a survey of 2,280 U.S. consumers conducted from March 12, 2025, to March 31, 2025. The report explores the impact of inflation and tariffs on consumers’ purchasing habits. Our sample was balanced to match the U.S. adult population in a set of key demographic variables: 51% of respondents identified as female, 33% were college-educated and 28% declared incomes of between $50,000 and $100,000 per year."
    }
  ],
  "argos_summary": "Despite economic uncertainty, over 82% of small- to medium-sized businesses (SMBs) in the U.S. are optimistic about their survival over the next two years, marking the highest confidence level since tracking began. This positive outlook varies by industry, with construction and retail sectors faring better, while hospitality businesses struggle. However, rising costs and cash flow challenges remain significant issues, particularly for micro-SMBs, as they navigate the impacts of tariffs and inflation on consumer spending.",
  "argos_id": "XJPCNIMRT"
}