{
  "url": "https://lifehacker.com/entertainment/why-your-old-sd-card-wont-work-with-the-switch-2",
  "authorsByline": "Eric Ravenscraft",
  "articleId": "60d0be88ef6f4f8eb105a81e630915bc",
  "source": {
    "domain": "lifehacker.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://lifehacker.com/imagery/articles/01K2FMRW3Q1JVFZY48M3W3WG10/hero-image.fill.size_1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:00:00+00:00",
  "addDate": "2025-08-12T21:09:09.678637+00:00",
  "refreshDate": "2025-08-12T21:09:09.678638+00:00",
  "score": 1.0,
  "title": "Why Your Old SD Card Won't Work With the Switch 2",
  "description": "The Switch 2 requires newer, faster microSD Express cards—the old SD cards you used with the original Switch won't work. Here's why, and some advice on which Express card to buy.",
  "content": "The Switch 2 comes with 256GB of internal storage, a generous amount compared to its predecessor, which started at only 32GB. However, if you want more storage so you can load , you might've noticed the Switch 2 won't accept your old SD cards. The new console only uses SD Express cards.\n\nThat means if you have data from an older Switch on an SD card, you won't be able to just plug it into the Switch 2 and get playing. Doing so will give you an error like the one above. Instead, if you want to migrate data on your old card to your new console, your best bet is to for setting up your new Switch 2.\n\nUnfortunately, this also means you'll need a new SD Express card for the Switch 2. If you're not familiar with this particular type of card or why it matters, let's break it down.\n\nAt a glance, SD Express cards might look identical to any other microSD card you've seen before, but they have very different capabilities. Typical microSD cards have a pretty wide range of speeds, and classifying them . But the short version is that while extremely fast SD cards often have read/write speeds as high as 300MB/s, they are usually much lower. For example, the Nintendo-branded micro SD card I used in my Switch OLED only reads at speeds around 90MB/s.\n\nSD Express cards—marked by an EX on the card—on the other hand, use PCIe and NVMe interfaces similar to the kind that you see on solid state hard drives. That means they can theoretically reach speeds up to 985MB/s, and in practice, they get pretty darn close. The Lexar Play PRO card, for example, reads at up to 900MB/s speeds, and can write at 600MB/s. That extra speed can come at a higher cost, with 256GB microSD Express cards .\n\nFaster speeds provide two main benefits: quicker downloads, and shorter load times. Downloading a new game to your console can involve any number of bottlenecks, from your internet speed, to the load on download servers, and, of course, your storage's speed. Using faster SD cards means it can potentially take less time to download a new game.\n\nOnce the game is downloaded, though, load times are the real winner. If you regularly sit through every loading screen tip twice, you know that waiting for your game to load data after a fast travel or entering a new map is a huge annoyance. For games saved to your SD card, faster speeds means less time waiting.\n\nWhy does the Switch 2 need SD Express cards?\n\nIt might be tempting to ask why Nintendo is forcing this upgrade, but put it into context with other consoles, it's frankly a surprise that it's taken this long. For the Xbox Series X, for example, are little more than proprietary dress up on top of a regular SSD. For the PS5? You can literally just .\n\nEven on comparable handheld platforms like the Steam Deck, the standard for expanding storage has been to use internal SSD expansions, which often require . Doable for the average tech-savvy Lifehacker reader, sure, but perhaps a too-high demand for the general population.\n\nSD Express cards are, at least for now, probably the best compromise between the increasingly insufficient speeds of traditional microSD cards, and committing to complex SSD storage options. And even SD Express cards could feel too slow in a few years: , they're already a bit slower than the Switch 2's internal storage (though, surprisingly, faster than official cartridges).\n\nWhich SD Express cards should you get?\n\nARight now, there are only so many options for SD Express cards on the market, and the highest capacities come with pretty eye-watering price tags. I'm gonna go out on a limb and guess that if you just dropped $500 on a Switch 2 bundle, you're probably not super hyped to drop $220 on a 1TB SD Express card. Fortunately, there are a few good options at more reasonable price points.\n• None starts at $60 and is one of the most affordable options around. It cites a 900MB/s read and 600MB/s write speed, which is among the fastest I've seen so far. Lexar also offers 512GB and 1TB variants, though they're more expensive and sometimes out of stock.\n• None starts around $68, and boasts 880MB/s read speeds, and 650MB/s write speeds. In practice, that's probably not going to feel too different from the Lexar card. It's a touch more expensive, but it might be easier to find in stock.\n• None comes with Nintendo's official seal of approval, but no listed speeds. It's still likely to be faster than typical SD cards, but without specs, we can't say how much faster. If Nintendo's official seal of approval is reassuring, though, this one also starts at $60.\n\nOver time, there are likely to be more options, and prices for SD Express cards will ( ) fall. For now, it's more expensive to add storage to your new Switch 2 than it was for the old model. But at least that storage will be much faster. And with 256GB already built-in, you might not even need it.",
  "medium": "Article",
  "links": [
    "https://zdcs.link/985Z8w?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Nintendo-branded%20micro%20SD%20card%20I%20used%20in%20my%20Switch%20OLED&short_url=985Z8w&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2&event_label=Nintendo-branded%20micro%20SD%20card%20I%20used%20in%20my%20Switch%20OLED",
    "https://cc.lifehacker.com/v1/otc/06ZVRiLmglGs4QA6plTXzTC?url=https%3A%2F%2Fzdcs.link%2FQOb7BB&template=Explainers&module=product-list&element=offer&item=offer-btn&position=2&element_label=256GB+SanDisk+microSD+Express+card&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2%3Futm_medium%3DRSS&short_code=https%3A%2F%2Fzdcs.link%2FQOb7BB",
    "https://www.kingston.com/en/blog/personal-storage/memory-card-speed-classes",
    "https://cc.lifehacker.com/v1/otc/06ZVRiLmglGs4QA6plTXzTC?merchant=05kie42h3YvHwjr4G1w80Qq&url=https%3A%2F%2Fwww.amazon.com%2Fgp%2Fproduct%2FB0DYB7ZGR3%2Fref%3Dox_sc_act_title_1%3Fsmid%3DATVPDKIKX0DER%26psc%3D1&template=Explainers&module=product-list&element=offer&item=offer-btn&position=1&element_label=256GB+Lexar+Play+PRO+microSD+Express+card&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2%3Futm_medium%3DRSS&product_uuid=00aMRUAaCTgrJNcKcyuNr96&offer_uuid=07DJXAyETXcg9mxOcrY8Y3t&object_type=07DJXAyETXcg9mxOcrY8Y3t&object_uuid=00aMRUAaCTgrJNcKcyuNr96&data-aps-asin=B0DYB7ZGR3&data-aps-asc-tag=lifehack088-20&data-aps-asc-subtag=07DJXAyETXcg9mxOcrY8Y3t",
    "https://cc.lifehacker.com/v1/otc/06ZVRiLmglGs4QA6plTXzTC?url=https%3A%2F%2Fzdcs.link%2FQp73pZ&template=Explainers&module=product-list&element=offer&item=offer-btn&position=3&element_label=Nintendo-branded+256GB+Samsung+microSD+Express+card&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2%3Futm_medium%3DRSS&short_code=https%3A%2F%2Fzdcs.link%2FQp73pZ",
    "https://zdcs.link/Qp73ql?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=The%20Nintendo-branded%20Samsung%20microSD%20Express%20card&short_url=Qp73ql&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2&event_label=The%20Nintendo-branded%20Samsung%20microSD%20Express%20card",
    "https://lifehacker.com/tech/how-tariffs-are-affecting-gaming-prices",
    "https://zdcs.link/aXW0eY?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=dedicated%20storage%20cards&short_url=aXW0eY&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2&event_label=dedicated%20storage%20cards",
    "https://zdcs.link/QbbBqr?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=The%20256GB%20SanDisk%20microSD%20Express%20card&short_url=QbbBqr&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2&event_label=The%20256GB%20SanDisk%20microSD%20Express%20card",
    "https://www.wired.com/story/how-to-install-ssd-steam-deck/",
    "https://zdcs.link/9yD672?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=slot%20in%20an%20actual%20M.2%20SSD&short_url=9yD672&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2&event_label=slot%20in%20an%20actual%20M.2%20SSD",
    "https://www.youtube.com/watch?v=nUQnJaEh-bA",
    "https://lifehacker.com/entertainment/setup-nintendo-switch-2-guide",
    "https://www.polygon.com/nintendo-switch-2/583421/switch-2-game-install-sizes-gb-storage-microsd-express/",
    "https://zdcs.link/91jR0k?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=starting%20around%20%2460&short_url=91jR0k&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2&event_label=starting%20around%20%2460",
    "https://zdcs.link/91jR0k?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=The%20256GB%20Lexar%20Play%20PRO%20microSD%20Express%20card&short_url=91jR0k&u=https%3A%2F%2Flifehacker.com%2Fentertainment%2Fwhy-your-old-sd-card-wont-work-with-the-switch-2&event_label=The%20256GB%20Lexar%20Play%20PRO%20microSD%20Express%20card"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "SD Express cards",
      "weight": 0.13221905
    },
    {
      "name": "typical SD cards",
      "weight": 0.11932619
    },
    {
      "name": "faster SD cards",
      "weight": 0.117640704
    },
    {
      "name": "card",
      "weight": 0.11060606
    },
    {
      "name": "Typical microSD cards",
      "weight": 0.105874486
    },
    {
      "name": "traditional microSD cards",
      "weight": 0.105334155
    },
    {
      "name": "SD Express",
      "weight": 0.09922126
    },
    {
      "name": "Faster speeds",
      "weight": 0.09062933
    },
    {
      "name": "faster speeds",
      "weight": 0.09062933
    },
    {
      "name": "a new SD Express card",
      "weight": 0.08388403
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.544921875
    }
  ],
  "sentiment": {
    "positive": 0.17378356,
    "negative": 0.24487974,
    "neutral": 0.58133674
  },
  "summary": "The Switch 2, the predecessor of the previous generation of consoles, has replaced its predecessor with the Switch 2 with a new console that only uses SD Express cards. This means that if you have data from an older Switch on an SD card, it will not be possible to import it into the new console. SD Express, or SD cards, use different capabilities than traditional microSD cards and can reach speeds up to 985MB/s, which can significantly increase download and load times. These faster speeds can potentially reduce bottlenecks in downloading games and waiting for game data to load data after a fast travel or entering a new map. However, this also requires a new SD Express card for the new Switch 2. The highest-costed SD Express devices can be purchased for around $60, with prices starting at $60 and $220.",
  "shortSummary": "The Switch 2 lacks internal storage, necessitating SD Express cards for increased storage, and potentially increasing game download times with affordable options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "276f6240a19145539904c196c047daa8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.kingston.com/en/blog/personal-storage/memory-card-speed-classes",
      "text": "Video Speed Class\nThe latest Video Speed Class was created to enable higher video resolution and recording features, such as multiple video streams, 360-degree capture, VR content, and 4K- or 8K-resolution videos. They’re usually denoted with the “V” symbol. There are five ratings for the Video Speed Class:\n- V6 (Video Speed Class 6): minimum write speed of 6MB/s\n- V10 (Video Speed Class 10): minimum write speed of 10MB/s\n- V30 (Video Speed Class 30): minimum write speed of 30MB/s\n- V60 (Video Speed Class 60): minimum write speed of 60MB/s\n- V90 (Video Speed Class 90): minimum write speed of 90MB/s\nThe Video Speed Class is unique because it’s capable of utilising both the UHS-I and UHS-II bus interfaces. V6 to V90 speed class memory cards can use the UHS-II bus interface, but the UHS-I bus interface can only support V6 to V30 speed class memory cards.\nThe Video Speed Class offers the fastest speeds available and is ideal for ultra-high-resolution videos, high-quality videos and multi-file recording in drones and 360-degree cameras. It supports HD formats up to 8K video in drones, 360-degree cameras, action cams and VR cameras.\nYou can find the best card for your hardware device by choosing the same speed class or higher than the one required for your device. For example, if your device requires a Class 4 memory card, you can use Speed Class 4, 6 or 10. If your device requires a UHS Speed Class 1 card, you can use UHS Speed Class 1 or 3. The same functionality applies to the Video Speed Class as well. Note, using a higher-rated card that goes beyond the speed class requirement for a device will still work, but you won’t be experiencing the full benefits of the higher speed class since the device only supports the lower speed class.\n#KingstonIsWithYou"
    },
    {
      "url": "https://lifehacker.com/tech/how-tariffs-are-affecting-gaming-prices",
      "text": "Contrary to the White House's assertions, we consumers are indeed footing the bill for all these tariffs. Companies from across industries have been stopping sales or raising prices over the past month or so, and the chaos continues on.\nIt doesn't help that the actual tariff situation is so volatile. President Donald Trump kept escalating the tariffs against China in particular, all the way up to 145%. Then, the administration made a deal with China to suspend most of the tariffs until August, but some tariffs still remain. As such, companies are scrambling to figure out the best way to protect their bottom lines and shareholder values—part of that strategy involves raising costs.\nGaming is no exception to this reality. Many gaming companies manufacture their components in China, which means their devices face tariffs if they ship to the U.S. Here's where the situation currently stands with the biggest gaming companies.\nMicrosoft\nXboxes are apparently an appreciating asset. On May 1, Microsoft raised the prices on all Xbox consoles, and some Xbox accessories—including controllers and headsets. These price hikes were actually pretty steep: Both the standard and digital Series X models jumped by $100, while the 2TB model jumped a whopping $130. On April 30, Series X with 2TB of internal storage would have set you back $600. Now, you're out $730.\nGames aren't wholly exempt here, either, but the news is a bit better: Existing titles will keep the same MSRP they did before the price hikes, while select new titles will cost $80 this holiday season.\nTo be fair, Microsoft doesn't directly attribute the tariffs to these raised prices, instead referring to \"market conditions and the rising cost of development.\" However, seeing as tariffs are the driving force of current market conditions, it seems a safe assumption that Microsoft is recouping some increased costs due to these import fees.\nSony\nSony, too, raised the prices on its flagship consoles—but only in select markets.\nThe company increased the price of certain PS5 units in Europe, the UK, Australia, and New Zealand. The price increases, as well as which console received them, depends on the region: Europe, for example, only saw an increase on the PS5 Digital Edition by €50, while the disc drive PS5 remained the same. Australia and New Zealand, on the other hand, were not so lucky, seeing price increases on both. New Zealand has the highest MSRP for a PS5 on the list at NZD $949.95 (or roughly $560 USD at this time).\nHowever, that doesn't mean those of us in the U.S. are safe from PS5 price increases. As reported by The Verge, Sony says that it expects tariffs to cost the company 100 billion yen ($681 million), and is considering both relocating manufacturing to the U.S., as well as raising costs for consumers.\nSony is a massive company, so that could involve raising prices on products other than PS5. However, the lack of a definitive answer on which products would be affected means that Sony may raise PS5 prices in the future.\nNintendo\nHere's the good news: Nintendo did not raise the MSRP of the Switch 2, nor any of its existing Switch consoles. The Switch 2 will remain $450, or $500 if you buy the Mario Kart World bundle.\nHowever, Nintendo has reacted to the tariffs in other ways. First, it paused preorders for the Switch 2 in the U.S. and Canada, \"to assess the potential impact of tariffs and evolving market conditions.\" We already know it ultimately kept the Switch prices the same, but once Nintendo picked a new preorder date, it also announced new price increases for Switch 2 accessories.\nThe Pro Controller is now $15 more than it was, and while the Joy-Con 2 controllers are only $5 more, they now cost an astounding $95. The Switch 2 camera is also $55, when originally it was $50. The rest of the Switch 2 accessories remain the same.\nPC gaming\nPC gaming is a more complicated beast than console gaming. Unless you opt for a gaming laptop, you most likely are looking to build your own PC, which requires purchasing a number of parts—many of which are made in China. Luckily computers, phones, and PC cases were exempt from the full 145% tariff, but not other PC components.\nAccording to PCMag, most PC parts haven't been hit that hard by tariffs yet—at least when it comes to April prices. The outlet observed that PC cases, processors, and memory kits all had modest increases ($10, $15, and $3, respectively), while a liquid cooler unit actually dropped in price by $60.\nHowever, they did find a concerning price increase when it came to one particularly important component: graphics cards. In January, the MSI SHADOW GeForce RTX 5070 Ti graphics card cost $750. In April, it cost $840, a $90 increase. PCMag found a similar trend across other popular graphics cards, with price increases ranging from $250 all the way to $750.\nGraphics cards had been in hot demand long before Trump was even elected, largely due to their use in processing AI. Increased tariffs are now only putting more pressure on that product category.\nGaming laptops largely haven't taken much of a hit yet, but Razer was one of the companies to pause direct sales to the U.S. last month.\nYou can't predict the future\nThis is where the market stands now, but there's no telling what will change in the coming days, weeks, and months. Sony could raise PS5 prices in the U.S. tomorrow; Nintendo could decide that the OG Switch needs to cost more now, too.\nNothing is certain, but one thing seems reasonable to assume: The prices you see today are the best they're going to be for a while. If you're holding out for the Xbox Series X to drop in cost, or crossing your fingers that Mario Kart World won't actually cost $80 on release, you're probably not going to be happy with the future.\nAnything's possible, but given where we are with tariffs and global markets, prices only seem to be going up. Remaining the same is perhaps the best we can hope for—unless you're willing to give the secondhand market a try."
    },
    {
      "url": "https://www.polygon.com/nintendo-switch-2/583421/switch-2-game-install-sizes-gb-storage-microsd-express/",
      "text": "Nintendo recently started taking pre-orders for Switch 2 games through its online store, coinciding with the opening of Switch 2 console pre-orders. Out of habit, I immediately scrolled to the “Game file size” section on each page to see how much storage each game will require. Some Switch 2 game file sizes are bigger than I expected, closer in size to Windows PC counterparts than original Switch ports were.\nThis makes sense given that Nintendo’s upcoming console is powerful enough to run games at 1080p and beyond at fast frame rates. And yet, it’ll only take a handful of games to completely fill up your Switch 2’s built-in 256 GB storage. Here are some file sizes of forthcoming Switch 2 ports:\n- Madden NFL 26 will be a 62 GB download\n- Split Fiction will be 73 GB\n- Cyberpunk 2077: Ultimate Edition and Hitman World of Assassination: Signature Edition will each be around 59 GB\n- Even Yakuza 0 Director’s Cut comes in at 53.7 GB.\nAll of those games together clock in at just over 300 GB — now you need a microSD Express card.\nAs usual, Nintendo’s first-party games are among the tiniest Switch 2 games in terms of install sizes. Mario Kart World is 23.4 GB, while Donkey Kong Bananza is, somehow, just 10 GB. Switch 2 Edition upgrade packs range in size, with Tears of the Kingdom taking up an extra 3.6 GB beyond the base install, and Kirby and the Forgotten Land taking up an extra 11 GB.\nIt might seem nuts to buy add-on storage for a console you don’t yet possess, but we think it’s smart to grab the biggest microSD Express card you can afford for use in the Switch 2. They’re much faster (and pricier) compared to the microSD cards used in the Switch and other devices like the Steam Deck. Note: your old microSD cards won’t be compatible with the Switch 2 for anything buy looking at screenshots and video clips you’ve captured on an original Switch.\nSamsung microSD Express card\nLaunching June 5, but available to pre-order now.\n$60 at Walmart$60 at Best Buy$60 at GameStop"
    },
    {
      "url": "https://lifehacker.com/entertainment/setup-nintendo-switch-2-guide",
      "text": "So, you’ve braved the pre-order sites, or maybe you’ve just gotten lucky while waiting in line—either way, you’ve got yourself a Nintendo Switch 2. Congratulations! But before you start gaming, there are a few things you’ll need to keep in mind while setting up your console. Nintendo is known for being user friendly, but also a bit particular. Case in point: You can only do a full transfer of your Switch 1 data to your Switch 2 during setup, and if you miss this opportunity, you’ll have to reset your device to try again, or manually copy over your games and save data piece-by-piece later on.\nLuckily, I’ve got your back. Read on for a quick guide on how to set up your Nintendo Switch 2, and the three other features you should set up before you start playing.\nHow to start setting up a Nintendo Switch 2\nFor the most part, setting up a new Switch 2 out of the box is straightforward, but you’ll still want to pay close attention to each step before moving on, especially when it comes to transferring console data.\nFirst, remove your Switch 2 and your joy-con controllers from their packaging. Then, plug your joy-cons into their respective slots (they’ll attach magnetically, so it’s much simpler than on the first Switch). If you don’t know which joy-con goes where, the one with red highlights goes to the right of the screen, and the one with blue highlights goes to the left.\nNext, plug your Switch into power using the included charging brick and cable, and power it on. On the screens that follow, select your language and region, then read and accept the end-user license agreement.\nYou’ll see a screen to connect to the internet and download the console’s day-one system update. This technically isn’t mandatory, and skipping it (with the X button on the right joy-con) will instead take you to time zone settings. However, most features will be locked down, including backward compatibility, until you download it, so I recommend doing it during setup if possible. If you do skip this step, you can access the update later under Settings > System > System Update.\nOnce you’re connected to the internet and you’ve started downloading the update, you’ll be able to continue setup while it downloads. Now, you’ll pick your time zone and click through a couple of tutorial pages. These will instruct you about portable and TV play, tell you how to use the kickstand and extra USB-C port, and walk you through detaching your joy-con from the console (press in the button on the back of the joy-con, underneath the trigger, and pull). You can also click through an optional tutorial on connecting your Switch 2 to a TV, if you like, after which you’ll get quick guides on using the included joy-con grip accessory and the joy-con wrist straps.\nIf your console hasn’t finished updating, it’ll finish that now, and then take you to your first big decision: do you want to transfer your Switch 1 data to your Switch 2?\nTransferring Switch 1 data to the Switch 2\nDuring Switch 2 setup, Nintendo will allow you to transfer your Switch 1 data to your Switch 2, but there are a few caveats.\nYou’ll know you’re ready for this once your system update is downloaded and you’re on a screen that says “To Nintendo Switch Console Owners,” above a graphic of someone holding a Switch 1 and Switch 2.\nNext to the graphic, you’ll see two buttons: Begin System Transfer, Don’t Transfer Data, plus a third button below that explains the process to you, but leaves out a few key details.\nBefore you make your decision, the most important thing to remember is this: There are actually two ways to transfer data from the Switch 1 to the Switch 2, and despite what you might have read elsewhere, locally transferring your Switch 1 data to the Switch 2 during setup will not factory reset your original Switch. Unless you’ve taken extra steps beforehand, this is the option Nintendo’s setup process will recommend to you, so most users don’t need to be scared about accidentally erasing their original consoles.\nIf you stick with a local transfer, it will simply copy over your data to your Switch 2, so that it exists on both systems. There are a few specific cases where some data will get removed from your original device as it makes its way over to your new one, but for the most part, you’ll be able to keep using your original device as usual after the transfer, and there are ways to get that data back later on (I’ll get into that). Just know that save data for specific games, as well as some free-to-play games, may have been deleted from your Switch 1 and moved over to your Switch 2. Don’t worry— Nintendo will warn you about which software will be affected during the transfer process. Additionally, screenshots and video captures stored on a microSD card attached to the Switch 1 will need to be moved over manually later on.\nHow to transfer your Switch 1 data locally\nWith that in mind, if you want to transfer your data locally, which is what most people should do, click the Begin System Transfer button and follow the instructions—this involves signing into your Nintendo account, keeping your original Switch powered on and in close proximity to the Switch 2, and activating the transfer on your original Switch under Settings > System Settings > System Transfer to Nintendo Switch 2.\nHow to transfer your Switch 1 data using Nintendo's servers\nThe confusion about factory resets comes from this data transfer option, which involves using the Nintendo servers. This will factory reset your Switch, and is best if you plan to sell it anyway, or if you expect to be away from your original Switch during Switch 2 setup and don’t mind setting up your original console from scratch when you get back to it. To start this kind of transfer, power on your original Switch, navigate to the System Transfer page mentioned above, then select I don’t have a Nintendo Switch 2 yet. Take note of the Download Deadline for later. Conveniently, that does point to one upside to this method: you can start it before you even have a Switch 2 in hand.\nNow, click Next, then Upload Data, then OK, followed by another OK. Click Start Initialization to begin factory resetting your original Switch.\nFrom here, your original Switch will revert to how it was before you bought it, and you’ll need to move over to your Switch 2, click Begin System Transfer, and sign into your Nintendo account. If the system detects that you have transfer data to download from the cloud, it’ll walk you through the process. Note, however, that if you don’t download your transfer data before the deadline you jotted down earlier, you’ll lose access to it.\nIf you want to skip the data transfer process...\nIf you’d rather not transfer your data, that’s also fine, but you won’t have an opportunity to do so later, and will instead need to move games and save data over manually. Click the Don’t Transfer Data button, then Continue to move to the next step.\nAdding a user and parental controls\nWith system transfers out of the way, you’re through the hardest part of setting up your new console. Now, you’ll be prompted to add a user to the system. Here, you can sign in with your Nintendo Account to get access to your Switch Online subscription and your collection of downloadable games, or create a local user profile. After that, you can add more users as you like, or you can save that for later (simply navigate to System Settings > User > Add User).\nNext up, parental controls. Like with additional users, you can set these up later under System Settings > Parental Controls, but there’s no harm to setting them up now as well. To do so, click Set Parental Controls.\nYou’ll have a few options. Most of these will prompt you to use Nintendo’s Parental Controls app, but you can also click the X button on the right-hand joy-con to set up limited parental controls directly on the console. Doing so will allow you to select from a number of presets that will block access to certain games and communication features, but not much else. Using the app, meanwhile, will let you set a daily play time limit, bedtime settings, restrictions on the new GameChat feature, and see reports on play time and games played. It also doesn’t require a Switch Online subscription, so it’s worth using if you have a smart device.\nTo set up parental controls using the app, first download it for either iOS or Android using the information on the screen, then click the “If You’ve Already Downloaded the App” button. Enter the registration code from your app into your Switch 2 system, then follow the instructions in the app to finish setup. Which buttons you’ll need to click will depend on the controls you’d like to activate, as well as for which users and systems, but it’s fairly straightforward.\nMicroSD card limitations\nJust a couple more screens. First, a quick warning about microSD cards. Unlike the Switch 1, the Switch 2 is only compatible with microSD Express cards, which are faster, but options for them are also a bit more limited—in other words, there’s a good chance you won’t be able to use the same microSD card from your Switch 1 on your Switch 2. To use a microSD card on Switch 2, it’ll need either of the two logos shown in the image below. A bit of a bummer, but at least a microSD card is optional (it’ll help you store more games, but the included storage on the Switch 2 is more generous than on the Switch 1).\nOh, and like on the Switch 1, the microSD slot is hidden under the kickstand, in case you’re having trouble finding it.\nVirtual Game Cards\nYou’re technically through setup at this point, but there are still a few features you’ll probably want to configure before you start gaming. The most obvious of these is Virtual Game Cards, Nintendo’s new system for managing games purchased digitally.\nEssentially, like the name implies, these work similarly to physical game cards, but over the internet. This means that, unlike with your Steam library, you can only load a game to one console at a time. \"Loading\" is Nintendo specific term, but for the most part, it just means your game is downloaded and ready to play.\"(Technically, you can still play the same game on two separate consoles at the same time, even if it isn't loaded on one, but doing so is a bit obtuse—click through here for more details.)\nTo access your Virtual Game Cards, click the Virtual Game Card icon in the bottom row on your Switch 2’s home screen—it’ll look like a game cartridge. From here, if you’ve signed into your Nintendo account, you’ll see all your digital purchases and will be able to download and play them from here. If you haven’t signed into your Nintendo Account, you’ll have the option to do so.\nNow, you’ll have a few options. First, if a game isn’t loaded onto your original Switch, you can simply download it to your Switch 2 by clicking Load to This Console. If the console isn’t set as your primary device (likely the case if you didn’t do a transfer), you might see a warning if you try to open a game, depending on how up-to-date your original Switch's software is. If your original Switch doesn't have the Virtual Game Cards update yet, you can click the If You Don’t Have That Console button to download your game anyway. It will simply cease being playable on the other console while you use it on this one, although that’s always the case when moving a Virtual Game Card between systems.\nOtherwise, you might need to link your two systems by bringing them close together and following the instructions on screen before you can load a Virtual Game Card on your new device. If you're not able to do this, like if you've gotten rid of your original Switch while it's still set as your primary device, you can remove your old Switch from your account by deregistering it. After deregistering your old console, you can set your Switch 2 as your new primary device by connecting it to the eShop. If you're able to link your old console to your new one, this won’t be necessary for simply accessing your library, but it will extend any Nintendo Online benefits to all users on your new primary device, rather than the one associated with your Nintendo Account.\nAlternatively, if you've managed to link your devices, you can use the device that currently has your Virtual Game Card (i.e. your Switch 1) on it to load it to your new one (i.e. your Switch 2). Simply open your games, click Load to Another Console, and follow the instructions on screen. This will have the same effect as the Load to This Console Button. Also, if you'd like to be able to continue playing a game on a device even after moving its Virtual Game Card to another device, you can enable Use Online License under System Settings > User Settings > Online License Settings to do just that. You'll need to be connected to the internet for this to work, whereas you can play a Virtual Game Card offline, but it's better than nothing. Plus, this enables that workaround from earlier in this section that allows you to play the same game on both devices at once.\nHow to lend a Virtual Game Card to someone else\nYou’ll also notice that you can lend a Virtual Game Card to members of a “Family Group.” To do this, you’ll first need to set up a Family Group online. On Nintendo’s website, log into your Nintendo Account, then click the Family Group tab on the left hand side of your account page. Here, you can invite members to join your Family Group via email, or create a Family Group account for your child. Note that if you have a Nintendo Switch online Family Plan subscription, members of your Family Group will be able to use its benefits (for up to eight accounts), although accounts that are part of your family group can also still use their individual subscriptions.\nWith a Family Group set up, on the Virtual Game Card page, click the game you’d like to lend out, then Lend to a Family Group Member. Next, bring your Switch 2 in close proximity with that Family Group Member’s device—this needs to be done in person.\nFinally, click Select a User to Lend to. You can lend up to three games to three different accounts at once, and borrowers will be able to play these games for 14 days. During that time, you won’t be able to play the Game Card, and the borrower won’t get access to your save data while borrowing. However, they will keep their own save data for their next borrowing period, or if they choose to buy the game themselves. There are no limits to how often you can lend out a game, and you can re-lend games immediately upon the borrowing period expiring. Also, while you’ll need to lend out your games in person, they’ll return to you remotely.\nTransferring save data\nEven if you didn’t transfer your Switch 1 data to your Switch 2 during setup, you can still access its save data on your new device. You have a couple of options here.\nFirst, the free option. On your original Switch, go to System Settings > Data Management > Transfer Your Save Data. Click Send Data to Another Console, then pick the user whose saves you want to send to your Switch 2. Pick the saves you want to send over, then click OK. Note that these saves will be deleted from your original console once moved over.\nNext, with your Switch 2 in close proximity to your Switch 1 (this also needs to be done in person), navigate to System Settings > Data Management > Transfer Your Save Data. Click Receive Save Data.\nTo move data from your Switch 2 to your Switch 1, simply perform these steps in reverse.\nSecond, the paid option. If you have a Nintendo Switch Online membership, you can also use cloud saves to move save data between devices. By default, these are enabled automatically and will keep both of your systems up to date with the most recent saves. However, you can also manually download cloud saves either from a game’s software menu (press + or - while hovering over it on the Switch home screen) or from System Settings > Data Management > Save Data Cloud. You can also disable automatic save data download from here, if you like.\nLock your home screen behind a passcode\nFinally, you can lock your Switch 2 with a PIN for some added security, kind of like a cell phone. To set this up, simply go to Settings > System > Console Lock. Click OK, then follow the instructions on the screen that pops up to enter your PIN.\nThere’s plenty more to dive into with the Switch 2, which I’ll cover over the following week. For now, though, this should be enough to get you started. Happy gaming!"
    }
  ],
  "argos_summary": "The Nintendo Switch 2 features 256GB of internal storage but requires new SD Express cards for additional storage, making old SD cards incompatible. SD Express cards offer significantly faster read/write speeds, enhancing download and load times for games, which are increasingly larger in size. While the Switch 2's built-in storage is generous, users may still need to invest in these new cards for optimal performance, especially as game file sizes approach or exceed the console's capacity.",
  "argos_id": "XLZ83N226"
}