{
  "url": "https://apnews.com/article/rockies-cardinals-score-7ad4a9134273f75b561dd8bbbdc6b6af",
  "authorsByline": "",
  "articleId": "a44e68f5ac09431882feb2e84e812026",
  "source": {
    "domain": "apnews.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://dims.apnews.com/dims4/default/2a4320a/2147483647/strip/true/crop/8640x4860+0+450/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9d%2F1e%2Fb417f6022187767a18a47c7abe9f%2Fa43005701d4f4f2a832648768c67cc73",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T03:01:18+00:00",
  "addDate": "2025-08-13T03:12:38.148221+00:00",
  "refreshDate": "2025-08-13T03:12:38.148222+00:00",
  "score": 1.0,
  "title": "Freeland tosses 7 1/3 strong innings to help Rockies beat Cardinals 3-0",
  "description": "Kyle Freeland gave up five hits in a season-high 7 1/3 innings, Hunter Goodman hit a home run, and the Colorado Rockies beat the St.",
  "content": "ST. LOUIS (AP) — Kyle Freeland gave up five hits in a season-high 7 1/3 innings, Hunter Goodman hit a home run, and the Colorado Rockies beat the St. Louis Cardinals 3-0 on Tuesday night to snap an eight-game losing streak.\n\nFreeland (3-12) walked two and struck out two in his longest outing since a career-best 8 1/3-inning outing on July 9, 2017 against the Chicago White Sox.\n\nVictor Vodnik pitched the final 1 2/3 innings to earn his third save and clinch the Rockies’ second shutout of the season after they blanked the Cardinals in Denver on July 23.\n\nCardinals starter Matthew Liberatore (6-10) allowed three runs on four hits and a walk in four-plus innings after striking out the side in the first inning and retiring the first nine batters he faced.\n\nGoodman hit his two-run homer in the fourth inning and Kyle Farmer singled up the middle off Matt Svanson with one out in the fifth inning to expand the Rockies’ lead to 3-0.\n\nCardinals first baseman Willson Contreras left the game after the fifth inning with a right foot contusion after being hit by a pitch in the fourth inning.\n\nGoodman hit his team-leading 23rd homer of the season 442 feet over the lower-deck seats in left and on to the concourse to give Colorado a 2-0 lead. It was the longest home run at Busch Stadium this season. Goodman has now homered in five of his last 12 games.\n\nFreeland struck out Jordan Walker to end the seventh inning for his 900th career strikeout. He became the third pitcher to record 900 strikeouts with the Rockies, joining Jorge De La Rosa and Germán Márquez.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/cardinals-willson-contreras-foot-c66d332a7aa56922b2e28aa0206961cf",
    "https://apnews.com/article/dodgers-brock-stewart-tony-gonsolin-2d321b4d56e63ba2fb661aa4d63f7c3a",
    "https://apnews.com/article/nationals-royals-score-6d5fae9a130e4d7fdf3674c2397b4209",
    "https://apnews.com/article/pirates-brewers-score-skenes-f8016e03e6a751d0c74987e675571a9e",
    "https://apnews.com/hub/mlb"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Cardinals first baseman Willson Contreras",
      "weight": 0.08894092
    },
    {
      "name": "Rockies",
      "weight": 0.08392693
    },
    {
      "name": "Cardinals starter Matthew Liberatore",
      "weight": 0.08343368
    },
    {
      "name": "Cardinals",
      "weight": 0.07452862
    },
    {
      "name": "Jorge De La Rosa",
      "weight": 0.074028134
    },
    {
      "name": "Hunter Goodman",
      "weight": 0.073876515
    },
    {
      "name": "Kyle Freeland",
      "weight": 0.07236674
    },
    {
      "name": "ST. LOUIS",
      "weight": 0.070868336
    },
    {
      "name": "Goodman",
      "weight": 0.067012794
    },
    {
      "name": "Kyle Farmer",
      "weight": 0.061023563
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.994140625
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.92236328125
    }
  ],
  "sentiment": {
    "positive": 0.442231,
    "negative": 0.17364587,
    "neutral": 0.38412318
  },
  "summary": "The Colorado Rockies defeated the St. Louis Cardinals 3-0, ending their eight-game losing streak. Kyle Freeland pitched a season-high 7 1/3 innings, giving up five hits and two walks, while Hunter Goodman hit a two-run homer. Victor Vodnik pitched the final 1 2 3 innings to secure the Rockies' second shutout of the season. The game ended with a win for the Cardinals' first baseman Willson Contreras, who left the game with a foot contusion after being hit by a pitch.",
  "shortSummary": "The Colorado Rockies defeated the St. Louis Cardinals 3-0, with Kyle Freeland posting a season-high 7 1-3 innings, and Hunter Goodman hitting a home run.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f7b3142e35124e2a923d787c4b1003ea",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/dodgers-brock-stewart-tony-gonsolin-2d321b4d56e63ba2fb661aa4d63f7c3a",
      "text": "Dodgers trade acquisition Brock Stewart goes on IL, but Friedman is confident in champs’ pitching\nANAHEIM, Calif. (AP) — Dodgers reliever Brock Stewart went on the injured list Tuesday with right shoulder inflammation, sidelining Los Angeles’ most significant addition from their quiet trade deadline.\nDodgers president of baseball operations Andrew Friedman said he doesn’t wish he had done more to improve his slumping club through trade, expressing confidence that the defending World Series champions will get it together in time for October.\n“First we have to qualify for October,” Friedman said at Angel Stadium. “If we’re fortunate enough to do that, I think we will have arguably our most talented pitching staff that we’ve ever had, with some really good pitchers left off.”\nStewart will undergo more testing Wednesday, and the Dodgers aren’t sure how long he will be out. He struggled in his appearances with the Dodgers this month after returning to the club from Minnesota at the deadline.\nLos Angeles is also playing without key relievers Tanner Scott, Evan Phillips, Brusdar Graterol, Michael Kopech and Kirby Yates.\nKopech, Scott and Yates are all expected to return by the end of August, but nothing is certain in another year of overwhelming injuries to the Dodgers’ pitching staff. Los Angeles overcame those injuries last year to win it all, largely by relying heavily on its bullpen while several starters were out.\nThe Dodgers’ starting rotation is largely healthy now, with Blake Snell and Tyler Glasnow rejoining the group and Roki Sasaki on the way. Instead, the Dodgers’ bullpen is struggling to stay afloat — particularly while high-leverage veteran Blake Treinen is struggling.\nThe Dodgers also announced that former All-Star starter Tony Gonsolin had an internal brace procedure that typically requires eight to 10 months of recovery time. Gonsolin made only seven starts this season in his return from Tommy John surgery in 2023.\n___\nAP MLB: https://apnews.com/MLB"
    },
    {
      "url": "https://apnews.com/article/pirates-brewers-score-skenes-f8016e03e6a751d0c74987e675571a9e",
      "text": "Frelick and Turang homer off Skenes as the Brewers beat the Pirates 14-0 for their 11th straight win\nFrelick and Turang homer off Skenes as the Brewers beat the Pirates 14-0 for their 11th straight win\nMILWAUKEE (AP) — Sal Frelick and Brice Turang homered off Paul Skenes, and the Milwaukee Brewers pounded the Pittsburgh Pirates 14-0 on Tuesday night for their 11th consecutive victory.\nChristian Yelich, Andrew Vaughn and Caleb Durbin also went deep as major league-leading Milwaukee improved to 27-5 in its last 32 games. Freddy Peralta (14-5) pitched six innings of three-hit ball in his second straight win.\nThe Brewers’ 11-game winning streak is their second of the season and the second-longest in franchise history.\nSkenes (7-9) permitted four runs and six hits in four innings. The ace right-hander struck out four and walked two.\nIt was Skenes’ first loss since July 11. He allowed a total of four runs in his previous four starts.\nFrelick hit a leadoff drive in the first for his ninth homer. Turang added a solo shot in the fourth for his 12th homer, lifting the Brewers to a 3-0 lead.\nYelich’s 23rd homer — a two-run drive off Yohan Ramírez in the fifth — made it 6-0, and Vaughn capped Milwaukee’s six-run sixth with a three-run shot. Durbin tacked on a two-run homer in the eighth against Pirates infielder Jared Triolo.\nCoupled with the Cubs’ loss in Toronto, Milwaukee increased its NL Central lead to 7 1/2 games — the largest cushion in the majors.\nKey moment\nThe last-place Pirates were down 2-0 when they put runners on first and second in the fourth. But Andrew McCutchen bounced into an inning-ending double play.\nKey stat\nThe Brewers have a major league-high 23 homers in August. Six of those have come from Turang, doubling his season total.\nUp next\nRight-hander Brandon Woodruff (4-0, 2.29 ERA) starts for the Brewers in the series finale on Wednesday. Right-hander Mitch Keller (5-10, 3.86 ERA) get the ball for the Pirates.\n___\nAP MLB: https://apnews.com/hub/mlb"
    },
    {
      "url": "https://apnews.com/article/nationals-royals-score-6d5fae9a130e4d7fdf3674c2397b4209",
      "text": "Pasquantino doubles, homers, drives in 5, leading the Royals past the Nationals 8-5\nPasquantino doubles, homers, drives in 5, leading the Royals past the Nationals 8-5\nKANSAS CITY, Mo. (AP) — Vinnie Pasquantino doubled, homered and drove in five runs as the Kansas City Royals topped the Washington Nationals 8-5 to reach the .500 mark for the second time since mid-June.\nAfter a two-out, third-inning walk by Maikel Garcia and Bobby Witt Jr.’s infield hit, Pasquantino hit Mitchell Parker’s first-pitch fastball into the second row of the right field stands, a few feet inside the foul pole, expanding Kansas City’s lead to 4-0.\nPasquantino opened the scoring with a first-inning sacrifice fly and capped the Royals scoring with an RBI double in the seventh.\nJonathan India’s two-run homer extended Kansas City’s lead to 7-2 in the sixth.\nMichael Wacha (7-9) allowed two runs on five hits and two walks with three strikeouts in 5 2/3 innings, his sixth consecutive start permitting fewer than three runs.\nLucas Erceg earned his second save with a hitless ninth.\nIn 5 1/3 innings, Parker (7-13) allowed five runs on two hits with three walks and three strikeouts. Over his last three starts — all losses — Parker has allowed 17 runs in 14 1/3 innings.\nLeaping at the center field wall, Robert Hassell III robbed Randal Grichuk of a solo home run in the fifth.\nIn the sixth, CJ Abrams scored when Witt misplayed Paul DeJong’s deep pop fly, cutting the Royals lead to 4-2.\nAbrams and James Wood collected two-out RBIs in the seventh. Wood recorded his fourth straight multihit game.\nKey moment\nOn Witt’s soft ground out between the plate and mound, Garcia hustled from first to third before scoring on Pasquantino’s sacrifice fly as Kansas City took a 1-0 lead in a hitless first inning.\nKey stat\nPasquantino leads the Royals 32 two-out RBIs and ranks second in the majors with 23 go-ahead RBIs.\nUp next\nNationals RHP Jake Irvin (8-7, 4.90 ERA) opposes Royals RHP Seth Lugo (8-6, 3.46)\n___\nAP MLB: https://apnews.com/hub/mlb"
    }
  ],
  "argos_summary": "Kyle Freeland pitched 7 1/3 innings, leading the Colorado Rockies to a 3-0 victory over the St. Louis Cardinals, ending an eight-game losing streak. Hunter Goodman hit a two-run homer, marking his team-leading 23rd of the season. Meanwhile, the Milwaukee Brewers secured their 11th consecutive win by defeating the Pittsburgh Pirates 14-0, with multiple players contributing home runs. In another game, Vinnie Pasquantino's strong performance helped the Kansas City Royals beat the Washington Nationals 8-5, bringing them to a .500 record.",
  "argos_id": "XRWOFXBSD"
}