{
  "url": "https://www.thesun.co.uk/news/36250431/body-found-playpark-assault/",
  "authorsByline": "Douglas Simpson",
  "articleId": "00bf07453d0f4d3d8710d8aee6d1663d",
  "source": {
    "domain": "thesun.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "county": "West Yorkshire",
      "city": "Leeds",
      "coordinates": {
        "lat": 53.7440745,
        "lon": -1.5988598
      }
    }
  },
  "imageUrl": "https://www.thesun.co.uk/wp-content/uploads/2025/08/naburn-police-investigation-launched-mans-1015823954.jpg?strip=all&quality=100&w=810&h=539&crop=1",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T08:28:43+01:00",
  "addDate": "2025-08-12T07:33:04.172479+00:00",
  "refreshDate": "2025-08-12T07:33:04.172481+00:00",
  "score": 1.0,
  "title": "Body of man found in children's playpark after woman attacked inside home",
  "description": "A BODY has been found in a playpark in the wake of a violent assault that left a woman seriously injured. Cops raced to the village of Naburn near York yesterday after a member of the public report…",
  "content": "Cops have launched an investigation into both incidents\n\nGRIM FIND Body of man found in children’s playpark after woman attacked inside home and left with serious head injury\n\nA BODY has been found in a playpark in the wake of a violent assault that left a woman seriously injured.\n\nCops raced to the village of Naburn near York yesterday after a member of the public reported an assault.\n\nWhen they arrived a woman was found with a serious head injury and rushed to hospital by air ambulance to be treated.\n\nPolice then launched a hunt for a suspect which led them to a nearby playpark where they discovered the body of a man.\n\nCops say they are not looking for anyone else in connection with the incident.\n\nNorth Yorkshire Police have thanked members of the public who helped the injured woman in the wake of the violence.\n\nA beige coloured whippet dog escaped from the property during the chaos with officers asking anyone who finds the pup to contact them.\n\nNorth Yorkshire Police said: \"We realise the events in Naburn will have caused shock and concern in the village.\n\n\"However, officers believe that the wider community were not at risk and that both parties involved in the incident knew each other.\"",
  "medium": "Article",
  "links": [
    "https://www.thesun.co.uk/news/36249703/horror-child-raped-pub-hunt/",
    "https://www.thesun.co.uk/news/36249998/boy-screamed-after-man-beaten-to-death-kent/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "North Yorkshire Police",
      "weight": 0.096168034
    },
    {
      "name": "serious head injury",
      "weight": 0.09287655
    },
    {
      "name": "woman",
      "weight": 0.08357566
    },
    {
      "name": "Body",
      "weight": 0.073650934
    },
    {
      "name": "Naburn",
      "weight": 0.07322795
    },
    {
      "name": "air ambulance",
      "weight": 0.07120802
    },
    {
      "name": "members",
      "weight": 0.06967107
    },
    {
      "name": "GRIM FIND",
      "weight": 0.06841533
    },
    {
      "name": "officers",
      "weight": 0.066354126
    },
    {
      "name": "Cops",
      "weight": 0.06462902
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97998046875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.93701171875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.93408203125
    }
  ],
  "sentiment": {
    "positive": 0.0597176,
    "negative": 0.72928756,
    "neutral": 0.21099485
  },
  "summary": "The body of a man has been discovered in a children's playpark following a violent assault that left a woman seriously injured. The police are currently investigating the incident and are not looking for any other suspects. The incident occurred in the village of Naburn near York, where a beige coloured whippet dog was found.",
  "shortSummary": "A man's body was found in a children's playpark after a woman was attacked in North Yorkshire, prompting an investigation by police.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "25a9284558d041afa5308bfc86461b38",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "An investigation is underway in Naburn, near York, following a violent incident where a woman sustained serious head injuries and was airlifted to the hospital. During the police response, the body of a man was discovered in a nearby playpark. Authorities have stated that they are not seeking any additional suspects and believe the individuals involved were known to each other, assuring the community that there is no wider threat.",
  "argos_id": "YJBPM1YKX"
}