{
  "url": "https://www.yahoo.com/news/articles/rapper-youtuber-ddg-briefly-detained-021147562.html",
  "authorsByline": "Andrew J. Campa",
  "articleId": "b1120fcbc0594c05aeb82052833ee2b6",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/ffbb23fce75a9cfe43a53c8d13a0c6cd9bc21177e17a66e14e1b875144646516/ynews/resizefill_w1200/https://media.zenfs.com/en/la_times_articles_853/22c9ef3017318406912bbec8e75eb86b",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:11:47+00:00",
  "addDate": "2025-08-13T02:40:02.396776+00:00",
  "refreshDate": "2025-08-13T02:40:02.396778+00:00",
  "score": 1.0,
  "title": "Rapper, YouTuber DDG briefly detained in SoCal; possible victim of swatting incident",
  "description": "Rapper and YouTuber DDG posted on social media that sheriff's deputies drew their weapons and briefly detained him in what he believes was a swatting incident.",
  "content": "A popular YouTube streamer posted on social media that he \"almost [died] today\" after Los Angeles County Sheriff's Department deputies drew their weapons on him and briefly detained him Sunday afternoon in what he said appears to be a swatting incident.\n\nvideo that he was at a paintball tournament in Castaic when police surrounded him and other participants.\n\n“I turned around and there’s like six police cars and I’m like, ‘OK, what’s going to happen?'\" he said in the post.\n\nDDG said he expected law enforcement would inform him of what was happening. Instead, he said, he was detained without an explanation.\n\nVideo on social media shows DDG being searched and being walked to and placed inside a sheriff’s vehicle just before 6 p.m.\n\nRead more: 'Swatting' calls spark panic, fear, massive police responses. Can California finally crack down?\n\n\"Bro, he pulled up. Ain’t no 'what’s up,' ain’t no nothing, ain’t no, ‘dude, we got a call.’ Nothing,\" DDG said.\n\nHe then mimicked the pointing of a gun and said police yelled at him, \"Hands in the air!\"\n\nDDG said that he had \"just got done smoking ... so, you’ve got to think what’s going through my mental, bro.”\n\nHe didn't elaborate on what he was smoking but added, \"I’m thinking to myself the whole time, ‘is this real?\"\n\nMultiple calls to the Sheriff’s Department’s Santa Clarita station went unanswered. The department’s main media relations office said it had no information about the incident.\n\nRead more: L.A. County 18-year-old pleads guilty to making 375 'swatting' calls throughout the U.S.\n\nAs he sat in the back of the sheriff's vehicle, DDG said, he told deputies he believed he was being swatted, which occurs when a false report of a crime or emergency is made to provoke an aggressive law enforcement response.\n\nThe most extreme examples of swatting have involved responses from Special Weapons and Tactics, or SWAT, teams.\n\nWhile sitting in the sheriff's vehicle, DDG said, he read information about the potential swatting call on an open sheriff’s laptop. He believed someone provided the Sheriff’s Department with a description of the exact type of car he drove. He added that whoever called in the complaint said that the rapper was armed and was going to hurt himself and others.\n\nDDG said he was held for 20 minutes before being released.\n\n“Enjoy life, life life like there’s no tomorrow,” he said on his stream, “because you never know.”\n\nSign up for Essential California for news, features and recommendations from the L.A. Times and beyond in your inbox six days a week.",
  "medium": "Article",
  "links": [
    "https://x.com/FearedBuck/status/1954706665216881105",
    "https://www.latimes.com/newsletters/essential-california?utm_source=yahoo&utm_medium=newsletter_module&utm_campaign=essential-california",
    "https://www.latimes.com/california/story/2025-08-12/rapper-popular-youtuber-ddg-briefly-detained-possible-victim-of-swatting-incident",
    "https://x.com/FearedBuck/status/1954710243650249001",
    "https://www.youtube.com/watch?v=6rDpSdFEx-g&t=1s",
    "https://www.latimes.com/california/story/2024-11-13/l-a-county-teen-pled-guilty-to-making-375-swatting-calls-throughout-the-u-s?utm_source=yahoo&utm_medium=promo_module&utm_campaign=rss_feed",
    "https://www.latimes.com/california/story/2025-03-26/california-lawmakers-seek-crackdown-on-swatting-violent-threats?utm_source=yahoo&utm_medium=promo_module&utm_campaign=rss_feed"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "massive police responses",
      "weight": 0.081020996
    },
    {
      "name": "swatting incident",
      "weight": 0.07866599
    },
    {
      "name": "DDG",
      "weight": 0.077521436
    },
    {
      "name": "swatting",
      "weight": 0.0704885
    },
    {
      "name": "police",
      "weight": 0.06969529
    },
    {
      "name": "Multiple calls",
      "weight": 0.067433
    },
    {
      "name": "L.A. County",
      "weight": 0.067345396
    },
    {
      "name": "life life",
      "weight": 0.06708208
    },
    {
      "name": "social media",
      "weight": 0.06538442
    },
    {
      "name": "law enforcement",
      "weight": 0.06072218
    }
  ],
  "topics": [
    {
      "name": "Influencer"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.96240234375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.890625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.79931640625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.79541015625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.69091796875
    },
    {
      "name": "/News/Local News",
      "score": 0.51708984375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.4189453125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Urban & Hip-Hop",
      "score": 0.408203125
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.328857421875
    }
  ],
  "sentiment": {
    "positive": 0.058453426,
    "negative": 0.67454004,
    "neutral": 0.26700655
  },
  "summary": "YouTube streamer, YouTuber DDG, was briefly detained by Los Angeles County Sheriff's Department (L.A. County) deputies during a paintball tournament in Castaic, California, on Sunday afternoon. He posted on social media that he was searched and placed in a sheriff's vehicle by officers without explanation. DDG claimed he was detained without explanation and was held for 20 minutes before being released. The incident is part of a swatting incident, which occurs when a false report of a crime or emergency is made to provoke an aggressive law enforcement response. The most extreme examples of swatting have involved responses from Special Weapons and Tactics (SWAT) teams.",
  "shortSummary": "YouTube streamer DDG was briefly detained by Los Angeles Sheriff deputies in a suspected swatting incident involving police at a paintball tournament, sparking concerns about his mental health.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "35e897b870be4dba8928dbb339cad3a9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2024-11-13/l-a-county-teen-pled-guilty-to-making-375-swatting-calls-throughout-the-u-s?utm_source=yahoo&utm_medium=promo_module&utm_campaign=rss_feed",
      "text": "L.A. County 18-year-old pleads guilty to making 375 ‘swatting’ calls throughout the U.S.\n- Share via\nA Lancaster 18-year-old pleaded guilty Wednesday to phoning in hundreds of false threats of imminent bombings, mass shootings and violence targeting locations across the U.S., including places of worship and schools.\nAlan W. Filion pleaded guilty to four counts of making interstate threats to injure people, federal authorities said.\nFrom August 2022 to January 2024, Filion made more than 375 “swatting” and threatening hoax calls, including calls in which he threatened to detonate bombs or conduct mass shootings at targeted locations, according to the U.S. Department of Justice.\nSwatting occurs when a false crime or emergency is reported at a specific location to provoke an aggressive law enforcement response, often by a SWAT team. According to federal officials, it was Filion’s intention to cause large-scale deployment of police and emergency services units at targeted locations.\nFilion, who was 16 when he made a majority of the calls, targeted religious institutions, high schools, colleges and universities, as well as government officials and numerous individuals across the nation.\nSimon Cowell, Justin Bieber, Ashton Kutcher and Miley Cyrus are all victims of the hoax known as ‘swatting.’ No one’s been arrested, and laws haven’t caught up.\nWhen he placed a swatting call at a targeted location, Filion would call emergency responders and provide them with false information about having placing dangerous explosives, telling authorities that he and others had firearms and explosives, and that he or other individuals had committed or intended to imminently commit violent crimes.\nIn an online post, Filion claimed that when he conducts a “swatting” call he “usually get[s] the cops to drag the victim and their families out of the house, cuff them and search the house for dead bodies.”\n“Swatting poses severe danger to first responders and victims, wastes significant time and resources, and creates fear in communities,” said Paul Abbate, FBI deputy director.\nIn 2023 Filion tried to turn the hoax calls into a business and made posts on social media, advertising his services and swatting-for-a-fee structure.\nIt’s unclear if he was ever paid to make a hoax call or had any clients.\nFilion was arrested in January in California on Florida state charges arising from a May 2023 threat he made to carry out a mass shooting at Masjid Al Hayy, a mosque in Sanford, Fla.\nAlan Winston Filion has been arrested on suspicion of swatting Masjid Al Hayy mosque in Sanford, Fla. Authorities say he may be connected to other incidents.\nIn his call to authorities about the mosque, he claimed that he had an illegally modified AR-15, a Glock 17 pistol, pipe bombs and Molotov cocktails. During the call he played an audio of gunfire in the background, according to Florida prosecutors.\nFilion has remained in custody since his arrest on state charges. He faces a maximum penalty of five years in prison on each count. A sentencing date has not yet been set.\nFilion has also pleaded guilty to making three other threatening calls, according to the Department of Justice. One call was made in October 2022 to a public high school in Washington, in which he threatened to commit a mass shooting and claimed to have planted bombs throughout the school, authorities said.\nAnother call was made in May 2023 to a predominantly Black college in Florida, in which he claimed to have placed bombs in the walls and ceilings of campus housing and threatened to detonate them in about an hour.\nThe third call occurred in July 2023 and was made to a local police department dispatch number in Texas, in which he falsely identified himself as a senior federal law enforcement officer, provided the officer’s residential address to the dispatcher, claimed to have killed the officer’s mother, and threatened to kill any responding police officers.\n“He caused profound fear and chaos and will now face the consequences of his actions,” said Lisa Monaco, deputy attorney general."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-12/rapper-popular-youtuber-ddg-briefly-detained-possible-victim-of-swatting-incident",
      "text": "Rapper, YouTuber DDG briefly detained in SoCal; possible victim of swatting incident\n- Share via\n- Popular rapper and YouTube streamer DDG posted on social media that L.A. County sheriff’s deputies drew their weapons on him and briefly detained him Sunday in Castaic in what appears to be a swatting incident.\nA popular YouTube streamer posted on social media that he “almost [died] today” after Los Angeles County Sheriff’s Department deputies drew their weapons on him and briefly detained him Sunday afternoon in what he said appears to be a swatting incident.\nRapper DDG posted on a YouTube video that he was at a paintball tournament in Castaic when police surrounded him and other participants.\n“I turned around and there’s like six police cars and I’m like, ‘OK, what’s going to happen?’” he said in the post.\nDDG said he expected law enforcement would inform him of what was happening. Instead, he said, he was detained without an explanation.\nVideo on social media shows DDG being searched and being walked to and placed inside a sheriff’s vehicle just before 6 p.m.\nCalls have triggered huge deployments of law enforcement and caused panic at schools, churches and other institutions. But prosecuting threats in California can be a challenge.\n“Bro, he pulled up. Ain’t no ‘what’s up,’ ain’t no nothing, ain’t no, ‘dude, we got a call.’ Nothing,” DDG said.\nHe then mimicked the pointing of a gun and said police yelled at him, “Hands in the air!”\nDDG said that he had “just got done smoking ... so, you’ve got to think what’s going through my mental, bro.”\nHe didn’t elaborate on what he was smoking but added, “I’m thinking to myself the whole time, ‘is this real?”\nMultiple calls to the Sheriff’s Department’s Santa Clarita station went unanswered. The department’s main media relations office said it had no information about the incident.\nAn 18-year-old from Lancaster has pleaded guilty to making hundreds of calls falsely threatening to conduct shootings or detonate bombs at public facilities.\nAs he sat in the back of the sheriff’s vehicle, DDG said, he told deputies he believed he was being swatted, which occurs when a false report of a crime or emergency is made to provoke an aggressive law enforcement response.\nThe most extreme examples of swatting have involved responses from Special Weapons and Tactics, or SWAT, teams.\nWhile sitting in the sheriff’s vehicle, DDG said, he read information about the potential swatting call on an open sheriff’s laptop. He believed someone provided the Sheriff’s Department with a description of the exact type of car he drove. He added that whoever called in the complaint said that the rapper was armed and was going to hurt himself and others.\nDDG said he was held for 20 minutes before being released.\n“Enjoy life, life life like there’s no tomorrow,” he said on his stream, “because you never know.”"
    },
    {
      "url": "https://www.latimes.com/california/story/2025-03-26/california-lawmakers-seek-crackdown-on-swatting-violent-threats?utm_source=yahoo&utm_medium=promo_module&utm_campaign=rss_feed",
      "text": "‘Swatting’ calls spark panic, fear, massive police responses. Can California finally crack down?\n- Share via\nEarlier this month, the Claremont Police Department received a chilling 911 report: A caller said they were holding someone captive inside a Claremont McKenna College restroom, carrying a bomb and preparing to shoot anyone they saw on campus.\nThe call triggered a massive deployment of law enforcement and SWAT team members and sent waves of panic coursing through campus as students scrambled to find cover.\nBut the crisis was fake, the result of a “swatting” call, a hoax 911 report made in the hope of generating a large law enforcement response. The incident took place one day after a similar threat prompted a lockdown of Loma Linda University’s Children’s Hospital.\nSwatting is a growing problem across the state and country. But California law can make it challenging to hold people accountable for the chaos their threats cause.\nAlthough falsely reporting an emergency to 911 is a misdemeanor offense, lawmakers are seeking tougher penalties for threats that cause mass disruption and target vulnerable populations such as schoolchildren or hospital patients.\nA false call for an armed shooter triggered a massive police response at Clarement McKenna College; L.A.’s second ‘swatting’ incident in two days\nUnder current law, threats are only considered to be a crime when they are made against an individual — not an institution, such as a school or hospital. Now, state legislators are backing new legislation to close that loophole.\n“Right now, California law falls short,” state Sen. Susan Rubio (D-Baldwin Park) said in a statement. “Unless a threat names a specific individual, officials have limited options, even when the danger is clear.”\nRubio is the author of Senate Bill 19, known as the Safe Schools and Places of Worship Act, which would allow prosecutors to charge individuals who make credible threats of mass violence against schools and places of worship, even if they don’t name a specific person. The goal is to hold people accountable for making intentional threats, recognizing that even hoax threats can cause mass panic, school closures and expensive law enforcement responses.\nAssemblymember Darshana R. Patel (D-San Diego) has proposed similar legislation, Assembly Bill 237, which would close the same loophole and also apply to threats made against day-care centers, hospitals and workplaces.\n“AB 237 will make it clear that threats against schools and religious institutions and hospitals and other locations will not be taken lightly and there are consequences,” Chula Vista Police Chief Roxana Kennedy said at a recent news conference to promote the legislation. “This bill empowers law enforcement to hold individuals accountable for wasting valuable resources and instilling fear in schools and in our community.”\nA major motivator for both proposed bills was an incident involving Shoal Creek Elementary School in San Diego.\nA 38-year-old man sent hundreds of emails threatening a mass shooting at the school, but a judge dismissed the case against him because the threats didn’t target a specific person, even though a gun and a map of the school were found at his home. Prosecutors have since refiled the case, naming the school principal as the target of the threats.\n“The claim that you cannot threaten an entity is beyond false,” said Shoal Creek parent Jenny Basinger while testifying on behalf of AB 237. “We are the entity. We are Shoal Creek Elementary. The students, the staff, and the community are the ones left picking up the pieces of the threat.”\nRubio said she focused her bill on schools and places of worship because these are the most frequently threatened institutions; the senator said she also supported Patel’s more expansive bill. Should both bills pass, legislators would work together to combine them into a single law, she said.\nThe FBI reported in January 2024 that agents opened investigations into more than 100 separate threats targeting more than 1,000 institutions in 42 states during a one-month period.\nSynagogues and Jewish community centers constituted the largest category of targeted institutions, with more than 400 saying they’d been threatened during that period. The second most frequent target was schools and school districts, followed by hospitals and hospital networks.\nAn 18-year-old from Lancaster has pleaded guilty to making hundreds of calls falsely threatening to conduct shootings or detonate bombs at public facilities.\n“These incidents cause fear and potentially dangerous interactions with law enforcement,” the Department of Homeland Security said in a 2024 bulletin. “Swatting calls and hoax threats are a daily occurrence, often come in clusters across the U.S., and are typically made to harass, intimidate, and/or retaliate against their intended target.”\nLast month, a Lancaster teen was sentenced to four years in prison after making more than 375 hoax calls that included threats to detonate bombs, conduct mass shootings and “kill everyone he saw,” according to the U.S. Department of Justice. However, many of the cases were difficult to prosecute under current state law.\nBevin Handel, a spokesperson for the city of Claremont, said it is the city Police Department’s goal to file charges against the perpetrator of the Claremont McKenna College call, but there are several challenges.\n“The biggest hurdle in holding perpetrators of swatting calls accountable is determining their identities,” she said. “Advances in technology allow callers to mask their voices, phone numbers or IP addresses (‘spoofing’) or make their false 911 calls sound more credible.”\nIn addition, she said, current state law makes it challenging to file charges against swatters that “truly reflect the magnitude of the response and the fear and trauma they can cause.”"
    }
  ],
  "argos_summary": "YouTube streamer DDG reported a swatting incident where he was briefly detained by Los Angeles County Sheriff's deputies during a paintball tournament, claiming he was not informed of the situation and was treated aggressively. He believed someone falsely reported that he was armed and posed a threat, leading to a significant police response. Meanwhile, an 18-year-old from Lancaster pleaded guilty to making over 375 swatting calls across the U.S., highlighting the growing issue of swatting and the challenges in prosecuting such incidents under current California law.",
  "argos_id": "YJR7B57RN"
}