{
  "url": "https://www.benzinga.com/pressreleases/25/08/g47074440/archrock-announces-dual-listing-on-nyse-texas",
  "authorsByline": "Globe Newswire",
  "articleId": "a29c4cabc86b4e7eb41457b15a09ecc3",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T16:15:10-04:00",
  "addDate": "2025-08-12T20:38:29.622828+00:00",
  "refreshDate": "2025-08-12T20:38:29.622831+00:00",
  "score": 1.0,
  "title": "Archrock Announces Dual Listing on NYSE Texas - Archrock (NYSE:AROC)",
  "description": "HOUSTON, Aug. 12, 2025 (GLOBE NEWSWIRE) -- Archrock, Inc. (NYSE:AROC) (\"Archrock\") announced today the dual listing of its common stock on NYSE Texas, the newly launched fully electronic equities exchange headquartered",
  "content": "HOUSTON, Aug. 12, 2025 (GLOBE NEWSWIRE) -- Archrock, Inc. AROC (\"Archrock\") announced today the dual listing of its common stock on NYSE Texas, the newly launched fully electronic equities exchange headquartered in Dallas, Texas.\n\n\"Our listing history with the New York Stock Exchange, through Archrock and its predecessor companies, began in 1997. We are pleased to join the NYSE Texas and support this pro-business initiative in the Lonestar State, which is home to our corporate headquarters and a majority of our compression operations,\" said Brad Childers, President and CEO.\n\n\"We are delighted to welcome Archrock to NYSE Texas. As a Texas-based, energy infrastructure company, Archrock is a great addition to our community of Founding Members,\" said Chris Taylor, Chief Development Officer, NYSE Group.\n\nArchrock will maintain its primary listing on the New York Stock Exchange and trade with the same \"AROC\" ticker symbol on NYSE Texas.\n\nArchrock is an energy infrastructure company with a primary focus on midstream natural gas compression and a commitment to helping its customers produce, compress and transport natural gas in a safe and environmentally responsible way. Headquartered in Houston, Texas, Archrock is a premier provider of natural gas compression services to customers in the energy industry throughout the U.S. and a leading supplier of aftermarket services to customers that own compression equipment. For more information on how the Company embodies its purpose, WE POWER A CLEANER AMERICATM, visit .",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/e10d337c-42e2-4d12-81d6-f4411a97f96e",
    "https://arrivedhomes.go2cloud.org/aff_c?offer_id=15&aff_id=1006&aff_sub=widget",
    "https://www.benzinga.com/money/wiseradvisor-retirement-planning-bzwidget",
    "https://www.benzinga.com/go/point-com",
    "https://www.globenewswire.com/Tracker?data=V76Z_iCHYHY08O9YphkHJ6he9LeWFv3tcxiTWj3OFOwoqMh72uhcNh-aM7XXr3zAYeJHIYwW8je1l2ROamXyOYVIqyZC-iFbtjhuXPvU3SI=",
    "https://www.benzinga.com/go/robinhood-retirement"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "NYSE Texas",
      "weight": 0.11613051
    },
    {
      "name": "natural gas compression services",
      "weight": 0.11000392
    },
    {
      "name": "midstream natural gas compression",
      "weight": 0.10588302
    },
    {
      "name": "natural gas",
      "weight": 0.09505559
    },
    {
      "name": "Archrock",
      "weight": 0.0914568
    },
    {
      "name": "Texas",
      "weight": 0.090271994
    },
    {
      "name": "NYSE Group",
      "weight": 0.08568785
    },
    {
      "name": "Dual Listing",
      "weight": 0.08410933
    },
    {
      "name": "NYSE",
      "weight": 0.08380363
    },
    {
      "name": "compression equipment",
      "weight": 0.07705976
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98291015625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97900390625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9716796875
    }
  ],
  "sentiment": {
    "positive": 0.79425496,
    "negative": 0.019290855,
    "neutral": 0.18645422
  },
  "summary": "Archrock, a Texas-based energy infrastructure company, has announced a dual listing on the newly launched New York Stock Exchange (NYSE) and will continue to trade with the same \"AROC\" ticker symbol on NYSE. The company is known for its services in the mid-century and for its aftermarket services.",
  "shortSummary": "Archrock has announced a dual listing on NYSE Texas, maintaining its primary market presence in Houston, Texas.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2e8f4f20009a4ec1a3b39e061dba1772",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=V76Z_iCHYHY08O9YphkHJ6he9LeWFv3tcxiTWj3OFOwoqMh72uhcNh-aM7XXr3zAYeJHIYwW8je1l2ROamXyOYVIqyZC-iFbtjhuXPvU3SI=",
      "text": "Natural Gas Contract Compression\nOur contract operations business is comprised of our owned fleet of natural gas compression equipment that we use to provide operations services to our customers. Capitalize on the highest-quality natural gas compression fleet including traditional and Electric Motor Drive (EMD) natural gas compression packages, mobilized strategically and proactively maintained by the most experienced team of natural gas compressor technicians in the U.S.\nEngage Our Techs\nElectric Motor Drive Technology\nArchrock is the leading provider of contract Electric Motor Drive (EMD) for natural gas compression services in the U.S. Our Electric Motor Drive compression packages reduce CO2 emissions to nearly zero, significantly reduce methane loss, and run a cleaner and more cost-effective compression site.\nGo All-Electric\nAftermarket Services\nOur aftermarket services business provides a full range of services to support the natural gas compression needs of our customers that own compression equipment, including operations, maintenance, overhaul and reconfiguration services and sales of parts and components. Our predictive, preventive maintenance exceeds the highest standards. we are strategically placed in or near every major oil & gas producing region in the U.S.\nExplore Services\nMethane Reduction Solutions\nMethane emissions occur in all sectors of the natural gas industry, from production, through processing and transmission, to distribution. They primarily result from normal operations, routine maintenance, fugitive leaks, and system upsets. Our solutions include the Carbon Hawk™ Methane Capture System and Ecotec Methane Monitoring.\nMethane Solutions\nNatural Gas Liquids Recovery Solution\nThe MaCH4™ NGL Recovery Solution is a proven, robust, and energy efficient gas separation solution developed and patented by Coldstream Energy for gas fired engines at natural gas compression stations.\nNGL Recovery"
    },
    {
      "url": "https://www.benzinga.com/money/wiseradvisor-retirement-planning-bzwidget",
      "text": "Retirement, ideally a period of relaxation and enjoyment after years of hard work, is often envisioned as a time to pursue hobbies, travel or simply unwind. But without a solid financial plan, many Americans worry they’ll outlive their money. This fear is often more acute among married couples, who face the added complexity of planning for two people with varying financial needs.\nIf you're 50 or older and have over $100,000 in investable assets, now is the time to take retirement planning seriously. Finding a financial advisor doesn't have to be difficult. WiserAdvisor's free tool matches you with a vetted financial advisor that meets your needs, with no obligation to hire.\n60% of Americans Lack a Retirement-Specific Account– Do you?\nA NerdWallet study, using the 2022 Survey of Consumer Finances, indicates that 60% of Americans lack a retirement-specific account. The disparity in average household retirement savings by age group further illustrates this issue:\n- Under 35: $49,130 (median: $18,880)\n- Ages 35 to 44: $141,520 (median: $45,000)\n- Ages 45 to 54: $313,220 (median: $115,000)\n- Ages 55 to 64: $537,560 (median: $185,000)\n- Ages 65 to 74: $609,230 (median: $200,000)\nThese figures show a significant gap between average and median savings, pointing to a broad spectrum of financial preparedness across different age groups. Those nearing retirement, especially those with $250,000 or more in retirement savings, stand to benefit most from expert, fiduciary guidance.\nTo guide couples in their retirement planning, T. Rowe Price, a reputable global investment management firm, provides savings benchmarks as multiples of income, varying by household income and marital status.\nFor example, a dual-income married couple with an annual income of $75,000 at age 55 should have retirement savings equal to five times their income, which should increase to 8.5 times by age 65. These benchmarks scale up for higher-income brackets, and for those with $250,000 or more in assets, strategic investment planning becomes especially important.\nFind a Vetted Financial Advisor\nIf you’ve worked hard to build a nest egg of $100,000 or more, WiserAdvisor can connect you with a trusted, independent fiduciary advisor who understands the unique financial needs of pre-retirees and retirees.\nFiduciary advisors are legally required to put your interests first. They can help you:\n- Create a tax-smart drawdown plan\n- Manage and grow a diversified investment portfolio\n- Maximize Social Security strategies\n- Protect assets for your spouse or heirs\n- The matching service is fast and free—and designed specifically for individuals with significant investable assets who are looking for personalized, high-quality advice.\nTake the first step toward a more confident retirement. If you have at least $100,000 in investable assets, WiserAdvisor can match you with a pre-screened fiduciary financial advisor in your area.\nBook here to get started; no cost, no obligation.\nBenzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser."
    }
  ],
  "argos_summary": "Archrock, Inc. announced the dual listing of its common stock on NYSE Texas, complementing its primary listing on the New York Stock Exchange. The company, which focuses on midstream natural gas compression, aims to support Texas's pro-business initiatives while maintaining its commitment to environmentally responsible operations. Archrock's CEO expressed enthusiasm for joining NYSE Texas, highlighting the company's significant presence in the energy sector.",
  "argos_id": "YMGDKLMHR"
}