{
  "url": "https://www.independent.co.uk/travel/news-and-advice/madrid-wildfires-spain-greece-heat-b2805971.html",
  "authorsByline": "Rich Booth",
  "articleId": "e0b8c7d7220f4de1aff66280087faf99",
  "source": {
    "domain": "independent.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static.independent.co.uk/2025/08/11/10/20/SPAIN-WILDFIRE-CLIMATE-WEATHER-22snmmen.jpeg?trim=0,100,0,100&width=1200&height=800&crop=1200:800",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T08:36:39+00:00",
  "addDate": "2025-08-12T08:39:21.593123+00:00",
  "refreshDate": "2025-08-12T08:39:21.593126+00:00",
  "score": 1.0,
  "title": "Europe burns under ‘nightmare’ wildfires as alerts issued for tourism hotspots",
  "description": "A man in Madrid died after suffering burns as the fire ravaged more than 1,000 hectares of land",
  "content": "A devastating wildfire near Madrid, which claimed one life and forced the evacuation of 180 people, has been successfully contained by firefighters.\n\nIt comes amid a swarm of heatwaves across Europe.\n\nA heatwave gripping parts of Europe sent temperatures over 40C in southern France and the Western Balkans on Monday, fuelling wildfires, triggering top-level weather alerts and forcing evacuations in several countries across what scientists warn is the world's fastest-warming continent.\n\nRegional authorities confirmed on Tuesday that overnight conditions allowed crews to bring the blaze in the Tres Cantos area under control.\n\nThe Community of Madrid reported that a man, who had suffered burns to 98 per cent of his body, died after being airlifted to La Paz hospital. The fire ravaged more than 1,000 hectares of land.\n\nA prolonged heatwave in Spain continued on Tuesday, with temperatures set to reach 44 degrees Celsius (111.2 F) in some regions, according to meteorology service AEMET.\n\nFires burned in France's Aude wine region, along Bulgaria's southern borders, near Montenegro's capital and coast, and in Turkey's north west - and Hungary recorded record-breaking weekend temperatures.\n\n2025 is predicted to be the second or third-warmest year on record, according to the UK-based Carbon Brief.\n\nThe extreme heat in Europe fits that global pattern but the continent is heating far faster than the rest of the world.\n\nLand temperatures have risen about 2.3C above pre-industrial levels, nearly twice the global average, intensifying heatwaves and driving record fire seasons.\n\nWith major outbreaks in Spain, Portugal and deadly blazes in Greece since late June, the burned area is already far above the seasonal norm.\n\nOn Monday, the French national weather authority, Meteo-France, placed 12 departments on red alert, the country's highest heat warning, anticipating exceptional heat stretching from the Atlantic coast to the Mediterranean plains.\n\nForty-one other departments were under lower-level orange alerts, as was the neighbouring microstate of Andorra, between France and Spain.\n\n\"Don't be fooled - this isn't 'normal, it's summer.' It's not normal, it's a nightmare,\" agricultural climatologist Serge Zaka told broadcaster BFMTV from Montauban in France's Tarn-et-Garonne department, where the blistering heat pressed relentlessly throughout the day.\n\nSocial media images showed shuttered streets in Valence, residents shielding windows with foil to reflect the light, and tourists huddling under umbrellas along the Garonne in Toulouse. Across the south, cafe terraces stood empty as people sought cooler corners indoors.\n\nIn France's Aude department, a patchwork of vineyards and Mediterranean scrubland, hundreds of firefighters remained in the rolling wine country guarding the edges of a massive, deadly blaze that scorched 40,000 acres last week.\n\nOfficials say the fire is under control but warn it will not be fully extinguished for weeks, with hot spots still smouldering and at risk of reigniting.\n\nThe red alert in France has been issued only eight times since it was created in 2004 after a deadly summer the year before.\n\nIt is reserved for extreme, prolonged heat with major health risks and the potential to disrupt daily life.\n\nThe heatwave, France's second of the summer, began on Friday and is expected to last all week, carrying into the August 15 holiday weekend.\n\nMontenegro reported wildfires near the capital Podgorica and along the Adriatic coast, prompting urgent appeals for help from neighbouring countries.\n\nFamilies were evacuated from an area north of the capital as army units worked to protect the ruins of the ancient city of Duklja.\n\nEmergency official Nikola Bojanovic described the situation as \"catastrophic\", with strong winds driving the flames. Authorities urged residents to conserve drinking water to avoid restrictions.\n\nBosnia's southern city of Mostar reached 43C, while Croatia's Dubrovnik hit 34C in the morning.\n\nIn Serbia, farmers on the Suva Planina mountain renewed appeals for emergency water supplies for livestock after streams and ponds dried up.\n\nIn Bulgaria, temperatures were expected to exceed 40C Monday on Monday, with maximum fire danger alerts in place.\n\nNearly 200 fires have been reported; most have been brought under control, localised and extinguished, but the situation remains \"very challenging\", said Alexander Dzhartov, head of the national fire safety unit.\n\nIn Turkey, a wildfire fuelled by high temperatures and strong winds forced authorities to evacuate holiday homes and a university campus and to suspend maritime traffic in the country's north west.\n\nSunday brought a new national high of 39.9C on Sunday in the south east of Hungary, breaking a record set in 1948. Budapest also recorded a city record at 38.7C. Authorities imposed a nationwide fire ban amid extreme heat and drought.",
  "medium": "Article",
  "links": [
    "https://www.independent.co.uk/topic/serbia",
    "https://www.independent.co.uk/topic/turkey",
    "https://www.independent.co.uk/topic/bosnia",
    "https://www.independent.co.uk/topic/wildfire",
    "https://www.independent.co.uk/topic/spain",
    "https://www.independent.co.uk/topic/portugal",
    "https://www.independent.co.uk/topic/madrid",
    "https://www.independent.co.uk/topic/croatia",
    "https://www.independent.co.uk/topic/greece",
    "https://www.independent.co.uk/topic/dubrovnik",
    "https://www.independent.co.uk/topic/fires",
    "https://www.independent.co.uk/donate?regSourceMethod=Donations",
    "https://www.independent.co.uk/topic/bulgaria",
    "https://www.independent.co.uk/topic/hungary",
    "https://www.independent.co.uk/topic/montenegro",
    "https://www.independent.co.uk/topic/france",
    "https://www.independent.co.uk/topic/wildfires"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "maximum fire danger alerts",
      "weight": 0.06930175
    },
    {
      "name": "southern France",
      "weight": 0.06700844
    },
    {
      "name": "France",
      "weight": 0.05993212
    },
    {
      "name": "Fires",
      "weight": 0.058951706
    },
    {
      "name": "red alert",
      "weight": 0.058867965
    },
    {
      "name": "extreme heat",
      "weight": 0.058093406
    },
    {
      "name": "record fire seasons",
      "weight": 0.057492714
    },
    {
      "name": "high temperatures",
      "weight": 0.05638476
    },
    {
      "name": "alerts",
      "weight": 0.053981476
    },
    {
      "name": "neighbouring countries",
      "weight": 0.0537966
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.984375
    },
    {
      "name": "/News/Weather",
      "score": 0.9462890625
    },
    {
      "name": "/News/Local News",
      "score": 0.85400390625
    },
    {
      "name": "/Law & Government/Public Safety/Emergency Services",
      "score": 0.6787109375
    },
    {
      "name": "/News/Other",
      "score": 0.33740234375
    }
  ],
  "sentiment": {
    "positive": 0.07063347,
    "negative": 0.7088589,
    "neutral": 0.22050755
  },
  "summary": "A wildfire near Madrid has been contained after claiming one life and forcing the evacuation of 180 people. The fire, which ravaged over 1,000 hectares of land, was contained overnight due to favourable conditions. This comes amid a series of heatwaves across Europe, with temperatures reaching over 40C in southern France and the Western Balkans, fuelling wildfires and leading to top-level weather alerts and evacuations in several countries. The French national weather authority, Meteo-France, placed 12 departments on red alert, the country's highest heat warning, anticipating exceptional heat stretching from the Atlantic coast to the Mediterranean plains. Meanwhile, Hungary recorded record-breaking weekend temperatures. The continent is heating faster than the rest of the world, with land temperatures rising about 2.3C above pre-industrial levels, nearly twice the global average.",
  "shortSummary": "A heatwave in Europe has caused major wildfires and forced evacuations, particularly in Spain, France, Bulgaria, and Hungary, with temperatures soaring above 40C in several regions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8ec29c6470b44f9db1203ad0e9d6c0ae",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A severe wildfire near Madrid has been contained after claiming one life and forcing the evacuation of 180 people, amidst a widespread heatwave across Europe with temperatures exceeding 40C. The heatwave has intensified wildfires in several countries, including France, Bulgaria, and Turkey, leading to emergency alerts and evacuations. Experts warn that Europe is experiencing unprecedented warming, with land temperatures rising significantly above pre-industrial levels, contributing to record fire seasons and extreme weather conditions.",
  "argos_id": "YMLGK18WP"
}