{
  "url": "https://nypost.com/2025/08/12/sports/gary-cohen-keith-raads-call-of-pete-alonso-mets-record-home-run/",
  "authorsByline": "Christian Arnold",
  "articleId": "7836e11f27ab4f45ba2875013fb5af36",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-yyodh4e30-1755046522631.jpg?quality=75&strip=all&1755032176&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:17:13+00:00",
  "addDate": "2025-08-13T01:19:09.718018+00:00",
  "refreshDate": "2025-08-13T01:19:09.718019+00:00",
  "score": 1.0,
  "title": "Pete Alonso’s Mets record home run gets electric Gary Cohen call",
  "description": "Pete Alonso solidified his place in Mets history, which Gary Cohen punctuated by describing it as “the Polar bear on his own private iceberg” during his historic home run call.",
  "content": "Pete Alonso solidified his place in Mets history Tuesday, and Gary Cohen punctuated the moment by describing it as “the Polar bear on his own private iceberg” during his historic home run call on SNY.\n\nAlonso surpassed Darryl Strawberry with his franchise-record 253rd home run during Tuesday night’s game against the Braves at Citi Field.\n\n“It’s outta here, outta here!” Cohen, the Mets’ TV play-by-play man, exclaimed as the ball sailed over the right-center field fence. “Pete Alonso stands alone. The Polar Bear on his own private iceberg. Pete Alonso, the most prolific home run hitter in New York Mets history.”\n\nThe Citi Field crowd roared as Alonso celebrated the milestone and waved to the fans after he embraced Brandon Nimmo and Jeff McNeil.\n\nThe SNY broadcasters allowed the moment to play out with the crowd noise doing the talking after Cohen’s initial call.\n\nOn the radio, Keith Raad was on the mic as Alonso hit his third-inning homer to put the Mets ahead 5-1.\n\n“It is gone! A missile into right center field,” Raad said. “A two-run home run and history. Number 253 for Pete Alonso. All alone as the franchise leader in home runs.”\n\nBroadcaster Howie Rose has been synonymous with some of the franchise’s biggest moments, but was not on the call on Tuesday.\n\nIn a post on X, he praised Raad’s radio call.\n\n“This one is splendid with many more to come. I’m thrilled he has this slice of Mets broadcast history,” Rose wrote.\n\nAlonso had been chasing Strawberry’s record and tied it on Saturday in the Mets’ 7-4 loss to the Brewers.\n\nThe slugger added a second home run Tuesday, a solo shot in the sixth inning.\n\nAlonso is in the middle of his seventh season with the Mets after getting drafted out of the University of Florida in the second round of the 2016 MLB Draft.",
  "medium": "Article",
  "links": [
    "https://x.com/HowieRose/status/1955425350386847886",
    "https://nypost.com/2025/08/12/sports/pete-alonso-belts-253rd-career-home-run-to-break-mets-record/",
    "https://nypost.com/2025/08/12/sports/frankie-montas-demoted-to-bullpen-in-34-million-mets-disaster/",
    "https://nypost.com/2025/08/12/sports/tyrod-taylor-undergoes-knee-surgery-to-throw-wrench-into-jets-qb-plans/",
    "https://nypost.com/2025/08/11/sports/jen-pawols-ump-scorecard-for-mlb-home-plate-debut-revealed/",
    "http://nypost.com/account/subscribe/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mets history",
      "weight": 0.10781717
    },
    {
      "name": "home runs",
      "weight": 0.107692964
    },
    {
      "name": "Mets broadcast history",
      "weight": 0.10537752
    },
    {
      "name": "Pete Alonso",
      "weight": 0.10417524
    },
    {
      "name": "New York Mets history",
      "weight": 0.1009293
    },
    {
      "name": "Pete Alonso’s Mets record home run",
      "weight": 0.096790574
    },
    {
      "name": "Mets",
      "weight": 0.09568417
    },
    {
      "name": "Alonso",
      "weight": 0.095261596
    },
    {
      "name": "New York Mets",
      "weight": 0.094847
    },
    {
      "name": "electric Gary Cohen call",
      "weight": 0.088941716
    }
  ],
  "topics": [
    {
      "name": "New York Mets"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.986328125
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.96044921875
    }
  ],
  "sentiment": {
    "positive": 0.41098538,
    "negative": 0.2123333,
    "neutral": 0.3766813
  },
  "summary": "Pete Alonso achieved a record 253rd home run for the New York Mets during a game against the Braves. The milestone was celebrated by Mets TV play-by-play man Gary Cohen, who described it as “the Polar Bear on his own private iceberg” during his historic home run call on SNY. Alonso had been chasing Darryl Strawberry's record and had tied it on Saturday in a Mets' 7-4 loss to the Brewers. On the radio, Keith Raad was on the mic as Alonso hit his third-inning homer to put the Mets ahead 5-1.",
  "shortSummary": "Pete Alonso's record-breaking 253rd home run by surpassing Darryl Strawberry was celebrated with an electric Gary Cohen call, highlighting his place in Mets history.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8024c094b4564fcaa73381858f11d385",
  "places": [
    {
      "osmId": "604023701",
      "road": "Seaver Way",
      "suburb": "Queens",
      "city": "New York",
      "state": "New York",
      "postcode": "11368",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.757277849999994,
        "lon": -73.84587884942417
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/11/sports/jen-pawols-ump-scorecard-for-mlb-home-plate-debut-revealed/",
      "text": "Umpire Jen Pawol’s first MLB game behind the plate went about as expected for a rookie.\nThe major leagues’ first female umpire, who made her debut on the bases during Saturday’s Braves-Marlins doubleheader, called 92.72 percent of balls and strikes accurately during Sunday’s series finale, getting 140 of the 151 taken pitches accurate, according to UmpScorecards.\nThe umpire average for the 2025 season is 94.23 percent, per UmpScorecard data.\nPawol’s called ball accuracy was 95 percent, with five of 104 balls called inaccurately; the average is 97 percent, per UmpScorecards.\nHer called strike accuracy was 88 percent, with six of 47 strikes called inaccurately; the average is 88 percent.\n“I think Jen did a really nice job,” Marlins manager Clayton McCullough said after his team’s 7-1 loss on Sunday.\n“I think she’s very composed back there. She handled and managed the game very well. And big day for her. Big day for Major League Baseball. I congratulated her again on that because it’s quite the accomplishment.”\nPawol, 48, is a West Milford, N.J., native who played softball at Hofstra. She has more than 1,200 minor league games on her résumé across the last 10 seasons.\nShe received support from Braves fans in Atlanta when she made history on Saturday.\n“It was amazing when we took the field,” Pawol said. “It seemed like quite a few people were clapping and calling my name. That was pretty intense and emotional.”\nPawol worked first base during the first game of Saturday’s doubleheader and third base for the second game.\n“She did a good job,” Braves manager Brian Snitker said Saturday. “You can tell she knows what she does.”\nPawol is a rover called up from the minors, so her next MLB assignment is unclear."
    }
  ],
  "argos_summary": "Pete Alonso made history by hitting his 253rd home run, surpassing Darryl Strawberry to become the New York Mets' all-time home run leader during a game against the Braves. The moment was celebrated by broadcasters and fans alike, with play-by-play announcer Gary Cohen highlighting the achievement. Additionally, Jen Pawol made her debut as the first female umpire in Major League Baseball, receiving praise for her performance in her initial games.",
  "argos_id": "YW9RWAE5Z"
}