{
  "url": "https://www.bloomberg.com/news/videos/2025-08-13/bloomberg-opinion-china-s-long-game-on-trade-is-working-video?srnd=phx-markets",
  "authorsByline": "bn",
  "articleId": "d1af5bc09b0c4cdda81fb4848a57df8d",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iui1MsFw3xCo/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:39:41.716000+00:00",
  "addDate": "2025-08-13T04:48:38.698445+00:00",
  "refreshDate": "2025-08-13T04:48:38.698446+00:00",
  "score": 1.0,
  "title": "Bloomberg China's Long Game on Trade Is Working",
  "description": "China is playing the long game and willing to endure short-term pain in its trade war with the US, Bloomberg Opinion’s Karishma Vaswani says. She explains how President Xi Jinping’s Mao-era strategy and focus on long-term advantage could shape a final deal with Washington. (Source: Bloomberg)",
  "content": "China is winning the long game, as you say. Why do you think that's the case? Well, David, I think as we've talked about before on your program, the fact that China has been able to go through these various rounds of trade negotiations with the United States without giving up much in terms of actual concessions, you know, they have been sort of small compromises made, but very far away from American demands. And and what's resulted from the outcome of these negotiations is just a commitment to simply talk again. And what that does, David, is it gives more time to the Chinese Communist Party to go ahead and make plans for what it's going to do with the slowing economy. As you talked about, of course, it is a very precarious trade position in China. The economic picture is pretty bleak. But it does allow the Chinese and in particular President Xi Jinping, to lay out a plan for the country and to figure out how to become more self-reliant in the face of these higher tariffs that the U.S. has threatened to impose on China. Okay. You mentioned that the self reliance sort of theme. So tell us a bit more about that and how this delay will actually help China. Well, you know, the Chinese have been on this path of self-reliance for some time as as as you well know, Yvonne, and one of the interesting things in the research that I did for this column was looking through the details of a rand that's a think tank, a Rand research report that looked at the areas where China is pushing ahead in terms of this self-reliance. Now, obviously, in order to do that, it does need access to a degree of high end American technology. But what this research report and many people that I've talked to have said to me is that the innovative push within China, particularly in the tech sector, has been accelerated as a result of the pressure that it's getting from the United States. So, ironically, the more time that Jinping has in terms of the delaying of any concrete trade negotiation, the more time he gets to be able to accelerate that push of self-reliance. And it's a very compelling argument to citizens at home. The narrative that's quite well worn by now in terms of the fact that the US and the West is trying to keep China down. And it's this idea that the country has to rally together. It has to endure this bitterness and pain in the short term to get long term results. Yeah. So charisma, the if time is on your side and I think you've you've also alluded to this as well that when you look at state run commentary this you know the the philosophy of protracted war for example that I think was in some ways evident, for example, during the Mao era to help get through this trade war. What does that mean in in today's context? Yeah, well, I find this really interesting. This kind of language started creeping up a few months ago in commentary from statement. A state run media, I should say. And what it's alluding to is this essay that emerged during the Mao. You're called a protracted war when it was espousing the fact that the Chinese would have to fight and sort of hold their ground against a much more powerful and stronger competitor. And this kind of language is now being used to describe the strategy that China should use with regards to the trade war. And you hear this time and time again, David, and what I think it shows or what I think it displays about the Chinese resolve to withstand the impact of this trade war is they're in it for the long haul. Right? They are willing to take on the pain of what happens to the economy in the short term, because they have sort of propagated this idea that being in this and enduring it together is what's going to get them victory in the end. And that is a victory they're willing to wait for.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "more time",
      "weight": 0.083429016
    },
    {
      "name": "long term results",
      "weight": 0.081788205
    },
    {
      "name": "trade negotiations",
      "weight": 0.08108914
    },
    {
      "name": "China",
      "weight": 0.07777383
    },
    {
      "name": "terms",
      "weight": 0.07248284
    },
    {
      "name": "time",
      "weight": 0.070111156
    },
    {
      "name": "Trade",
      "weight": 0.06963008
    },
    {
      "name": "protracted war",
      "weight": 0.06752051
    },
    {
      "name": "high end American technology",
      "weight": 0.06362866
    },
    {
      "name": "state run commentary",
      "weight": 0.06115464
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.9892578125
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.7890625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.7685546875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.71240234375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.6044921875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.470703125
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.43212890625
    },
    {
      "name": "/News/World News",
      "score": 0.30224609375
    }
  ],
  "sentiment": {
    "positive": 0.15925762,
    "negative": 0.47117984,
    "neutral": 0.3695625
  },
  "summary": "China is winning the long game in trade negotiations with the United States, argues David Gergen, author of The New York Times, that China has been able to avoid significant concessions from the US without giving up much in terms of actual concessions. Gergen suggests that this gives the Chinese Communist Party more time to plan for a more self-reliant response to threats of higher tariffs the U.S. has threatened to impose on China. He argues that this allows the Chinese to develop a more assertive stance towards self-independence within the country, particularly in the tech sector, as a result of pressure from the U., and argues that China is in it for the long haul and willing to endure the pain in the short term to achieve long-term gains. Gergan: China's strategy of avoiding the impact of this trade war is being used as a means of keeping the US and the West at bay, highlighting the potential for a protracted war.",
  "shortSummary": "China's long-term strategy of self-reliance and economic resilience amid trade tensions is effective, benefiting its self- reliance efforts despite a challenging economic environment.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "21749bcf310c4ee899064b60b53d26db",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "China is strategically using the time gained from ongoing trade negotiations with the U.S. to bolster its self-reliance, particularly in the tech sector, despite facing economic challenges. The delay allows President Xi Jinping to formulate long-term plans and rally domestic support by framing the trade war as a necessary struggle against Western pressures. This approach echoes historical strategies from the Mao era, emphasizing endurance and collective effort for eventual victory.",
  "argos_id": "Z1NZ7CBC7"
}