{
  "url": "https://9to5mac.com/2025/08/12/threads-crosses-400m-monthly-active-users-as-it-gains-on-x/",
  "authorsByline": "Marcus Mendes",
  "articleId": "7c601bdcd2474a0e938db89bc539a337",
  "source": {
    "domain": "9to5mac.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/08/Cross-post-from-Instagram-and-Facebook-to-Threads.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:11:12+00:00",
  "addDate": "2025-08-13T00:17:09.259052+00:00",
  "refreshDate": "2025-08-13T00:17:09.259054+00:00",
  "score": 1.0,
  "title": "Threads crosses 400M monthly active users as it gains on X",
  "description": "Following a series of welcome improvements, Meta CEO announced today Threads crossed the 400 million monthly active users mark.",
  "content": "Following a recent series of welcome updates as Threads turned two, Meta CEO Mark Zuckerberg announced today that his X competitor crossed 400 million monthly active users (MAUs), a 50 million boost since April.\n\nThe last time Meta detailed its monthly active user number was on April 30, during its Q1 2025 earnings call, up from 320 million in Q4 2024 in late January.\n\nIf it keeps it stride, this means Meta could see north of 100M MAUs added to Threads in 2025 alone, putting it well past the halfway mark toward catching up with X in terms of monthly active users.\n\nSince going private, X has stopped reporting concrete user data, and the figures it does share can’t be independently verified or audited. Still, former CEO Linda Yaccarino claimed last April that the platform had ‘nearly 600 million’ MAUs, up slightly from 586 million in January.\n\nThreads has been on a good run lately. It added its own Instagram-unbound direct messaging system, support for spoiler taghing, a dedicated fediverse feed, a highlighting tool, and more.\n\nOn their own, these changes might seem innocuous. But taken together, they suggest that Meta is finally adjusting its roadmap for the app not just based on its rigid vision of what Threads should be or how it should be used, but by listening to its users while at the same time making it more appealing to those open to switching from X.\n\nIt is worth mentioning that Threads also announced a leadership shift, with executive Connor Hayes set to take over Adam Mosseri’s day-to-day responsibilities for the app starting next month, while still reporting to him. So it will be interesting to see how, if at all, that might affect the app’s direction or growth rate.\n\nDo you use Threads? Do you always ask if anybody uses Threads? Let us know in the comments.",
  "medium": "Article",
  "links": [
    "https://www.amazon.com/Apple-Bluetooth-Headphones-Personalized-Effortless/dp/B0DGHMNQ5Z/?tag=marcmendes-20",
    "https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJC52FP/?tag=marcmendes-20",
    "https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJ7HYG1/?tag=marcmendes-20",
    "https://9to5mac.com/2025/07/17/adam-mosseri-steps-back-from-threads-app-to-be-overseen-by-metas-ai-lead/",
    "https://techcrunch.com/2025/04/30/threads-tops-350m-monthly-users-after-adding-30m-in-the-quarter/?utm_source=chatgpt.com",
    "https://www.amazon.com/Apple-Cancellation-Transparency-Personalized-High-Fidelity/dp/B0D1XD1ZV3/?tag=marcmendes-20",
    "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
    "https://www.threads.com/@zuck/post/DNQtqzGRWA7",
    "https://digiday.com/marketing/with-600-million-users-xs-linda-yaccarino-doubles-down-on-dismissing-journalism/?utm_source=chatgpt.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "monthly active users",
      "weight": 0.11578678
    },
    {
      "name": "concrete user data",
      "weight": 0.09297134
    },
    {
      "name": "Threads",
      "weight": 0.09003782
    },
    {
      "name": "Meta CEO Mark Zuckerberg",
      "weight": 0.087311916
    },
    {
      "name": "Meta",
      "weight": 0.075577155
    },
    {
      "name": "last April",
      "weight": 0.07538904
    },
    {
      "name": "its monthly active user number",
      "weight": 0.071281895
    },
    {
      "name": "monthly",
      "weight": 0.07072518
    },
    {
      "name": "former CEO Linda Yaccarino",
      "weight": 0.06843859
    },
    {
      "name": "X",
      "weight": 0.065607496
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.984375
    },
    {
      "name": "/News/Technology News",
      "score": 0.619140625
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.369384765625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.33203125
    }
  ],
  "sentiment": {
    "positive": 0.5015049,
    "negative": 0.08263148,
    "neutral": 0.41586363
  },
  "summary": "Meta CEO Mark Zuckerberg has announced that his competitor, X competitor, Threads, has crossed 400 million monthly active users (MAUs), a 50 million increase since April. This is a significant increase from the last time Meta revealed its monthly active user number on April 30, when it announced it could add north of 100 million MAUs to the platform in Q1 2025. This could put Meta at the halfway point of catching up with X in terms of active users. The company has also announced a leadership shift, with executive Connor Hayes set to take over Adam Mosseri's day-to-day responsibilities.",
  "shortSummary": "Meta's Threads surpassed 400 million monthly active users, with strong growth and a leadership shift, moving Meta closer to catching up with X, which has since gone private.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7959ae8e9c0046feb341a38a48ccae6a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://techcrunch.com/2025/04/30/threads-tops-350m-monthly-users-after-adding-30m-in-the-quarter/?utm_source=chatgpt.com",
      "text": "Instagram Threads, Meta’s X competitor, has now grown to over 350 million monthly active users, CEO Mark Zuckerberg revealed during the company’s Q1 2025 earnings call on Wednesday. That’s an increase of 30 million users since the prior quarter, where Meta reported that Threads had 320 million users.\nThe new figure represents increased growth, as Threads added 30 million in the first quarter of this year, compared with 20 million in Q4 2024. It’s also worth noting that in a single quarter, Threads added nearly the same number of users to its network as one of its newer competitors, Bluesky. The latter, a decentralized social app, today has roughly 35 million users.\nX, meanwhile, now has north of 600 million monthly active users, according to statements made by its CEO, Linda Yaccarino, on Wednesday.\nWhile Threads is still small in comparison to Meta’s other social apps — Facebook, Instagram, Messenger, and WhatsApp — its growth is helping to cement its place in the microblogging app ecosystem. In total, Meta says that more than 3.4 billion people now use at least one of Meta’s apps daily.\nOn Wednesday’s call, Zuckerberg told investors that the growth indicates that Threads “continues to be on track to become our next major social app.” He additionally noted that there’s been a 35% increase in time spent on Threads as a result of improvements to the app’s recommendations systems."
    },
    {
      "url": "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://digiday.com/marketing/with-600-million-users-xs-linda-yaccarino-doubles-down-on-dismissing-journalism/?utm_source=chatgpt.com",
      "text": "Hear from execs at The New York Times, Thomson Reuters, Trusted Media Brands and many others\nWith 600 million monthly active users, X’s Linda Yaccarino doubles down on dismissing journalism\nDigiday is at Possible giving you the latest industry news out of the event in Miami. More from the series →\nLinda Yaccarino continues to cast X as the anti-media media company — a disruptive alternative to what she and Elon Musk believe is the dusty, broken fourth estate.\nIt’s a contentious claim, especially in an era when President Donald Trump is once again at war with the press. But sitting for a fireside chat with Anthony Pompliano, creator of From the Desk of Anthony Pompliano, on X at Possible this afternoon in Miami, Yaccarino insisted the platform’s (self-reported) numbers back her up.\nAccording to the platform’s CEO, X has nearly amassed 600 million monthly active users (MAUs) globally — a small increase on the 586 million MAUs that were reported in X’s own tools in January, but not a huge increase on the 570 million MAUs X claimed it had reached back in September 2024.\nStill, nearly a third (31%) of that user growth is coming from Gen Z — drawn in, apparently, by a taste for authenticity and disposable income. Yaccarino pointed to their projected $36 trillion in spending power by 2024 as proof.\n“X has emerged as the world’s most powerful culture signal, it really has become the global town square,” she said. “Where ideas collide, debate happens, truth rises and truly every voice is welcome.”\nSuggesting that X has “bypassed or leap frogged legacy media,” Yaccarino claimed that 65% of its users identify the platform as their No. 1 news app.\n“The new population, new generation, fueled by technology which has freed information, all of data and content consumption has changed forever,” she said.\nIn many ways, these comments reflect the twisted reinvention of Twitter’s premise. Before Musk bought it in October 2023, the social network prided itself on being a hub for credible news and trusted sources. Now, the divisive billionaire wants X to be the source — arguing again and again that unfiltered speech should replace what he dismisses as “legacy media.”\nNowhere is that shift clearer than in how X handles misinformation, hate speech and other content most users would rather avoid. The company scrapped many of its automated moderation systems in favor of “Community Notes” — crowdsourced fact checks and context from the user base — which now, according to Yaccarino, has 1 million “community noters” globally. In her view, the feature is “good for the world” because it’s “retraining us to respect the truth,” she noted.\n“I think it’s really, really hard for legacy media to fact check and fight misinformation in real time, at the scale, the way X can, and now Community Notes, being the ecosystem leader,” she said.\nBut the tool was never meant to carry the full weight of content moderation. It was designed to supplement, not replace, more robust systems like internal review teams and AI tools for flagging obvious falsehoods.\nSince X launched this feature globally in December 2022, others have followed suit, from Meta to TikTok, effectively deciding that people don’t need journalism when they have each other.\n“We’re super excited that first Google, then Meta, more recently TikTok is partnering and following our lead in a dramatic ecosystem change of fact checking and aggressively fighting misinformation,” Yaccarino added.\nIf X’s higher ups want to position the platform as the antidote to news then AI is the engine driving the drive. That’s how Yaccarion spun Musk’s decision to sell X to his AI startup xAI. While its widely seen as a financial play — fold X into the AI boom and benefit from the revenue bump But its just as likely a data play: merging the two companies would give xAI access to the digital exhaust of X’s users to help train its models.\n“When you bring those two things together, you have this profound differentiator because the other AI offerings are static, and they are not powered by the real time data of X combined with the super, super capabilities of X,” said Yaccarino.\nFor better or worse, X is unique\nLike many of the other platform CEOs, Yaccarino certainly wasn’t afraid to talk her platform up and discredit the competition during her conversation with Pompliano.\n“If you compare X to the other platforms, the other platforms are where you go to lean back, dare I say tune out,” she said. “X is number one in attentiveness compared to all the other social platforms. So you’re leaning in, you’re seeking out information.”\nCompared to Yaccarino’s previous stage efforts as CEO of arguably one of the most talked about and controversial platforms, this time around at Possible, she had confidence in abundance.\nBut what was very absent from the chat, given Possible is an advertiser event, was any real clue about how X is managing to sway those advertisers to spend on the platform. And it seems like that thought wasn’t lost on the audience either.\nIn the queue to get into Inspiration Hall ahead of Yaccarino’s stage moment, Digiday asked execs waiting in line about how they thought the audience would receive her this time around, given the series of mixed headlines about X and its leadership over the past couple of years.\nTwo media agency execs, who asked not to be named, expressed mixed opinions. “I think there is some simmering resentment that might uncork, but we’ll see,” said the first agency exec, who was barely audible as an onstage DJ spun earsplitting Reggaetón as the audience trickled into their seats.\n“I think it would be very disrespectful,” if she was heckled in any way, said the second exec. “But we’d like to hear some assurances that ad sales negotiations with X will take place in the marketplace and not in court,” they added.\nBut Pompliano never touched on lingering brand safety concerns on the platform, or the legal actions it has brought to advertisers that have been reticent to market via X.\n— Jim Cooper contributed reporting to this story\nMore in Marketing\nCMO Strategies: How marketers are spending and measuring across social media in 2025 — from Meta to TikTok\nThe fifth installment of Digiday’s CMO Strategies series examines how marketers are spending and measuring across social media platforms in 2025 — from Meta to TikTok.\nAt Carbone Fine Food, tariffs are putting pressure on its ‘most important ingredient’\nThe CPG company could face additional long-term costs on its ‘most important ingredient’: tomatoes from the San Marzano region of Italy.\nX’s automated ad vision left advertisers underwhelmed\nDuring X’s recent Spaces event, Elon Musk unveiled the vision for Grok to automate as much of the ad process as possible."
    },
    {
      "url": "https://9to5mac.com/2025/07/17/adam-mosseri-steps-back-from-threads-app-to-be-overseen-by-metas-ai-lead/",
      "text": "After two years under Instagram head Adam Mosseri, Meta is officially handing off Threads to a new leader. Here’s what the change could mean for the app’s future.\nAs first reported by Axios, Meta is naming longtime executive Connor Hayes, formerly head of generative AI product, as the new head of Threads starting in September.\nThe move marks the first time someone outside Instagram will take the reins of the text-based social app, in yet another sign that Meta seems to be finally getting serious about treating Threads as more than just an Instagram sidekick.\nUntil now, Threads had been overseen by Instagram chief Adam Mosseri, who helped launch the app back in 2023. But in a staff memo sent Thursday, Mosseri said it’s time for dedicated leadership:\n“Given Threads’ maturity, we think we need a dedicated app lead who can focus all of their time on helping Threads move forward.”\nOne would agree.\nWhat will this mean for the future of Threads?\nHayes has been with Meta since 2011, and he’s held product roles across Instagram and Facebook. He was also part of the original team that build the first version or Threads.\nHis new position begins in mid-September, and once onboarded, he’ll manage all product, design, engineering, and research teams working on Threads.\nHe’ll still report to Mosseri, but the day-to-day responsibilities are shifting.\n9to5Mac’s take\nToday’s move comes at an interesting time for Threads. Just a few days ago, Similarweb reported that despite being behind X in global web traffic, Threads has been bridging the gap on mobile, averaging around 115 million mobile daily active users, compared to X’s 132 million.\nPutting a gen AI exec in charge of Threads could hint at where Meta wants to take the app next, especially as it continues testing AI-generated content in users’ feeds.\nIt is possible that, with Threads still being relatively small compared to other Meta apps, the company might be thinking about using it as a testbed for AI features, before rolling them out more broadly to its other apps.\nDo you use Threads? Do you always ask if anybody still uses Threads? Let us know in the comments.\nAirPods deals on Amazon\n- AirPods Pro 2, USB-C Charging: $169 (down from $249)\n- AirPods 4 USB-C Charging: $89.99 (down from $129)\n- AirPods 4, USB-C and Wireless Charging: $119 (down from $179)\n- AirPods Max, USB-C Charging, Midnight: $529.99\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJC52FP/?tag=marcmendes-20",
      "text": "Apple AirPods Max Wireless Over-Ear Headphones, Pro-Level Active Noise Cancellation, Transparency Mode, Personalized Spatial Audio, USB-C Charging, Bluetooth Headphones for iPhone - Midnight\nAmazon's Choice highlights highly rated, well-priced products available to ship immediately.\nAmazon's Choice\nThis item cannot be shipped to your selected delivery location. Please choose a different delivery location.\nBrief content visible, double tap to read full content.\nFull content visible, double tap to read brief content.\nColor: Midnight\nMake a Color selection\nSet: Without AppleCare+\nMake a Set selection\nWith AppleCare+ (2 Years)\nWithout AppleCare+\nStyle:\nUSB-C\nBrand\nApple\nColor\nMidnight\nEar Placement\nOver Ear\nForm Factor\nOver Ear\nNoise Control\nActive Noise Cancellation\nAbout this item\nULTIMATE OVER-EAR LISTENING EXPERIENCE — Apple-designed dynamic driver provides high-fidelity audio. Computational audio combines custom acoustic design with the Apple H1 chip and software for breakthrough listening experiences.\nFIVE FRESH COLORS — AirPods Max come in five fresh colors: Midnight, Starlight, Blue, Purple, and Orange. A color-matched Smart Case is also included.\nFOCUS ON WHAT’S PLAYING — Pro-level Active Noise Cancellation removes up to 2x more background noise, so you can immerse yourself in music.*\nHEAR THE WORLD AROUND YOU — Transparency mode lets you comfortably hear and interact with the world around you.\nPERSONALIZED SPATIAL AUDIO — With sound that suits your unique ear shape along with dynamic head tracking, AirPods Max deliver an immersive listening experience that places sound all around you.* You can also listen to select songs, shows, and movies in Dolby Atmos.\nACOUSTIC-FIRST DESIGN — Designed with a knit-mesh canopy and memory foam ear cushions for an exceptional over-ear fit that perfectly seals in sound.\nMAGICAL EXPERIENCE — Pair AirPods Max by simply placing them near your device and tapping Connect on your screen.* AirPods Max pause audio when you take them off. And Automatic Switching makes listening between your iPhone, iPad, and Mac completely effortless.*\nPRECISION CONTROL — Use the Digital Crown to play and pause music; to answer, end, and mute yourself on calls; and to control volume and skip between tracks.\nWITH USB-C CHARGING — The USB-C connector lets you charge your AirPods Max with the same cable you use to charge your iPhone, iPad, Mac, or other Apple devices.\nLEGAL DISCLAIMERS — This is a summary of the main product features. See below to learn more."
    }
  ],
  "argos_summary": "Meta's Threads has reached 400 million monthly active users, marking a significant increase of 50 million since April, as announced by CEO Mark Zuckerberg. The app has been enhancing its features, including direct messaging and improved content recommendations, which have contributed to a 35% increase in user engagement. Meanwhile, X claims to have nearly 600 million monthly active users, but its user data remains unverifiable since going private. Additionally, Threads is undergoing a leadership change with Connor Hayes taking over day-to-day operations, indicating Meta's commitment to developing the app further.",
  "argos_id": "ZJIA2SSUE"
}