{
  "url": "https://finance.yahoo.com/news/martinrea-international-inc-reports-second-210100935.html?.tsrc=rss",
  "authorsByline": "Martinrea International Inc.",
  "articleId": "aa52309dc42740518f71680f7a9c8f5e",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/globenewswire.com/e8c8e9d8d0968edf02afb496fbac0191",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:01:00+00:00",
  "addDate": "2025-08-12T21:52:38.401903+00:00",
  "refreshDate": "2025-08-12T21:52:38.401904+00:00",
  "score": 1.0,
  "title": "Martinrea International Inc. Reports Second Quarter Results and Declares Dividend",
  "description": "TORONTO, Aug. 12, 2025 (GLOBE NEWSWIRE) -- Martinrea International Inc. (TSX : MRE), a diversified and global automotive supplier engaged in the design, development and manufacturing of highly engineered, value-added Lightweight Structures and Propulsion Systems, today announced the release of its financial results for the second quarter ended June 30, 2025, and declared a quarterly cash dividend of $0.05 per share. SECOND-QUARTER HIGHLIGHTS Total sales of $1,275.5 million, production sales of $",
  "content": "1 The Company prepares its financial statements in accordance with IFRS Accounting Standards (“IFRS”). However, the Company considers certain non-IFRS financial measures as useful additional information in measuring the financial performance and condition of the Company. These measures, which the Company believes are widely used by investors, securities analysts and other interested parties in evaluating the Company’s performance, do not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similarly titled measures presented by other publicly traded companies, nor should they be construed as an alternative to financial measures determined in accordance with IFRS. Non-IFRS measures, included anywhere in this press release, include “Adjusted Net Income”, “Adjusted Net Earnings per Share (on a basic and diluted basis)”, “Adjusted Operating Income”, “Adjusted EBITDA”, “Free Cash Flow”, “Free Cash-Flow (after IFRS 16 lease payments)” and “Net Debt”. The relevant IFRS financial measure, as applicable, and a reconciliation of certain non-IFRS financial measures to measures determined in accordance with IFRS are contained in the Company’s Management Discussion and Analysis for the three and six months ended June 30, 2025 and in this press release.\n\nPat D’Eramo, Chief Executive Officer, stated: “We are very pleased with our performance in the second quarter. Margins were notably higher compared to the first quarter, reflecting continued progress. Vehicle production volumes increased quarter over quarter, as inventories returned to a more normal level. We continue to execute well and are driving results through operating improvements and efficiencies, cost reductions, and ongoing investments in machine learning and other innovations that are enhancing productivity. On the trade front, USMCA-compliant auto parts are exempt from tariffs, which is positive for us and our industry. We have tariffs on some product that we get from our Tier 2 suppliers and from parts affected by steel and aluminum tariffs but, overall, our exposure is manageable. Given operational improvements, actions we are taking with our previously announced SG&A improvement program, and anticipated recoveries from customers, we expect to offset a substantial portion of the impact. As such, we are maintaining our 2025 outlook, which calls for total sales of $4.8 to $5.1 billion, Adjusted Operating Income Margin ( 1 ) of 5.3% to 5.8%, and Free Cash Flow ( 1 ) of $125 to $175 million.”\n\nNet Debt-to-Adjusted EBITDA (1) ratio, excluding the impact of IFRS 16, ended the second quarter at 1.50x, down from 1.64x in the first quarter of 2025 and at our target of 1.50x or better.\n\nFree Cash Flow ( 1 ) (excluding principal payments of IFRS 16 lease liabilities) was $72.0 million, up almost 40% year over year.\n\nAdjusted Operating Income Margin ( 1 ) of 6.8%, up 50 basis points year over year, and 150 basis points over the first quarter of 2025.\n\nDiluted net earnings per share of $0.52 and Adjusted Net Earnings per Share ( 1 ) of $0.66.\n\nTORONTO, Aug. 12, 2025 (GLOBE NEWSWIRE) -- Martinrea International Inc. (TSX : MRE), a diversified and global automotive supplier engaged in the design, development and manufacturing of highly engineered, value-added Lightweight Structures and Propulsion Systems, today announced the release of its financial results for the second quarter ended June 30, 2025, and declared a quarterly cash dividend of $0.05 per share.\n\nHe continued: “I am pleased to announce that we have been awarded new business representing approximately $40 million in annualized sales at mature volumes, consisting of $18 million in Lightweight Structures with Stellantis and other customers, and $22 million in our Flexible Manufacturing Group with Volkswagen’s new Scout Motors division, and Volvo Truck. New business awards over the last four quarters total $175 million in annualized sales at mature volumes.”\n\nPeter Cirulis, Chief Financial Officer, stated: “Overall, we are pleased with our financial performance in the second quarter and first half of 2025. We are in good shape operationally and doing well managing what is in our control. Sales for the second quarter, excluding tooling sales of $76.3 million, were $1,199.2 million. Adjusted Operating Income(1) was $86.1 million, and Adjusted Operating Income Margin(1) of 6.8% was up 50 basis points year over year and 150 basis points over the first quarter of 2025. Free Cash Flow(1) (excluding principal payments of IFRS 16 lease liabilities) was $72.0 million, up almost 40% year over year, mainly reflecting positive working capital flows. We are confident in our ability to meet our 2025 outlook, particularly on Free Cash Flow(1), which is likely to come in at the high end of the range or better, given opportunities we are seeing to reduce capital expenditures and optimize working capital. We said we would become a consistently solid Free Cash Flow(1) generator, and we are proving that to be the case.\n\nRob Wildeboer, Executive Chairman, stated: “We are pleased with our second quarter results, which demonstrate that we are exceptional operators. We invested in the business in the second quarter, and paid down debt, which brought our Net Debt-to-Adjusted EBITDA(1) ratio to our target of 1.50x or better. While we are encouraged by the latest developments on trade, particularly as it relates to tariff exemption for USMCA-compliant auto parts, we will wait to see how the tariff discussion and overall macro environment unfolds over the coming months before committing to further share buybacks. In the meantime, we are prioritizing balance sheet strength and debt repayment. On behalf of the executive management team, we would like to thank our people for their hard work and flexibility in these dynamic times, as well as our shareholders and other stakeholders for their ongoing support.”\n\nAll amounts in this press release are in Canadian dollars, unless otherwise stated; and all tabular amounts are in thousands of Canadian dollars, except earnings per share and number of shares.\n\nAdditional information about the Company, including the Company’s Management Discussion and Analysis of Operating Results and Financial Position for the three and six months ended June 30, 2025 (“MD&A”), the Company’s interim condensed consolidated financial statements for the three and six months ended June 30, 2025 (the “interim financial statements”) and the Company’s Annual Information Form for the year ended December 31, 2024 can be found on the Company’s profile at www.sedarplus.ca.\n\nResults of operations may include certain items which have been separately disclosed, where appropriate, in order to provide a clear assessment of the underlying Company results. In addition to IFRS Accounting Standards (\"IFRS\") measures, management uses non-IFRS measures in the Company’s disclosures that it believes provide the most appropriate basis on which to evaluate the Company’s results.\n\nThe following tables set out certain highlights of the Company’s performance for the three and six months ended June 30, 2025 and 2024. Refer to the Company’s interim financial statements for the three and six months ended June 30, 2025 for a detailed account of the Company’s performance for the periods presented in the tables below.\n\nThe Company prepares its interim financial statements in accordance with IFRS. However, the Company considers certain non-IFRS financial measures as useful additional information in measuring the financial performance and condition of the Company. These measures, which the Company believes are widely used by investors, securities analysts and other interested parties in evaluating the Company’s performance, do not have a standardized meaning prescribed by IFRS and therefore may not be comparable to similarly titled measures presented by other publicly traded companies, nor should they be construed as an alternative to financial measures determined in accordance with IFRS. Non-IFRS measures include “Adjusted Net Income”, “Adjusted Net Earnings per Share (on a basic and diluted basis)”, “Adjusted Operating Income”, \"Adjusted EBITDA”, “Free Cash Flow”, \"Free Cash Flow (after IFRS 16 lease payments)\", and “Net Debt”.\n\nThe following tables provide a reconciliation of IFRS “Net Income” to Non-IFRS “Adjusted Net Income”, “Adjusted Operating Income” and “Adjusted EBITDA”:\n\n*Adjustments are explained in the \"Adjustments to Net Income\" section of this Press Release\n\n*Adjustments are explained in the \"Adjustments to Net Income\" section of this Press Release\n\nThree months ended June 30, 2025 to three months ended June 30, 2024 comparison\n\n\n\nThe Company’s consolidated sales for the second quarter of 2025 decreased by $26.3 million or 2.0% to $1,275.5 million as compared to $1,301.8 million for the second quarter of 2024. The total decrease in sales was driven by year-over-year decreases across all operating segments.\n\nSales for the second quarter of 2025 in the Company’s North America operating segment decreased by $4.2 million or 0.4% to $980.4 million from $984.6 million for the second quarter of 2024. The decrease was due to lower year-over-year OEM production volumes on certain light vehicle platforms, including the Jeep Grand Cherokee and Wagoneer, the Ford Escape and Maverick, and Nissan Pathfinder and Rogue; and programs that ended production during or subsequent to the second quarter of 2024, specifically the Chevrolet Malibu, an aluminum engine block for Stellantis, and the Ford Edge. These negative factors were partially offset by an increase in tooling sales of $48.3 million, which are typically dependent on the timing of tooling construction and final acceptance by the customer; higher year-over-year production volumes of certain platforms including the Ford Mustang Mach E, General Motors' Equinox/Terrain, General Motors' large pick-up truck and SUV platforms, Mercedes' electric vehicle platform (EVA2), a transmission for the ZF Group, and the Lucid Air; the launch and ramp up of new programs during or subsequent to the second quarter of 2024, including General Motors' new electric vehicle platforms (BEV3/BET), and the Toyota Tacoma; and the impact of foreign exchange on the translation of U.S. denominated production sales, which had a positive impact on overall sales for the second quarter of 2025 of $25.7 million. Overall second quarter industry-wide OEM light vehicle production volumes in North America decreased by approximately 3% year-over-year.\n\nSales for the second quarter of 2025 in the Company’s Europe operating segment decreased by $18.3 million or 6.4% to $268.7 million from $287.0 million for the second quarter of 2024. The decrease was due to a decrease in tooling sales of $9.7 million, which are typically dependent of the timing of tooling construction and final acceptance by the customer; lower year-over-year OEM production volumes on certain platforms, including aluminum engine blocks for Ford and Mercedes, the Mercedes' electric vehicle platform (EVA2), and Jaguar Land Rover; and programs that ended production during or subsequent to the second quarter of 2024, specifically the BMW Mini. These negative factors were partially offset by the launch and ramp up of new programs during or subsequent to the second quarter of 2024, including Volkswagen's new electric vehicle platform (PPE), and a transmission for Audi; higher year-over-year OEM production volumes on certain platforms, including a transmission for the ZF Group, and the Lucid Air; and the impact of foreign exchange on the translation of Euro denominated production sales, which had a positive impact on overall sales for the second quarter of 2025 of $13.8 million. Overall second quarter industry-wide OEM light vehicle production volumes in Europe decreased by approximately 2% year-over-year.\n\nSales for the second quarter of 2025 in the Company’s Rest of the World operating segment decreased by $5.4 million or 14.5% to $31.8 million from $37.2 million in the second quarter of 2024. The decrease was largely driven by lower year-over-year production volumes with Jaguar Land Rover and BMW in China, and a decrease in tooling sales of $1.5 million.\n\nOverall tooling sales increased by $38.2 million (including outside segment sales eliminations) to $76.3 million for the second quarter of 2025 from $38.1 million for the second quarter of 2024.\n\nSix months ended June 30, 2025 to six months ended June 30, 2024 comparison\n\n\n\nThe Company’s consolidated sales for the six months ended June 30, 2025 decreased by $181.9 million or 6.9% to $2,443.8 million as compared to $2,625.7 million for the six months ended June 30, 2024. The total decrease in sales was driven by year-over-year decreases across all operating segments.\n\nSales for the six months ended June 30, 2025 in the Company’s North America operating segment decreased by $83.1 million or 4.3% to $1,865.4 million from $1,948.5 million for the six months ended June 30, 2024. The decrease was due generally to lower year-over-year OEM production volumes on certain light vehicle platforms, including the Jeep Grand Cherokee and Wagoneer, the Ford Escape and Maverick, Nissan Pathfinder and Rogue, General Motors' large pick-up truck and SUV platforms, and Mercedes' electric vehicle platform (EVA2); and programs that ended production during or subsequent to the corresponding period of 2024, specifically the Chevrolet Malibu, the Ford Edge, and an aluminum engine block for Stellantis. These negative factors were partially offset by the impact of foreign exchange on the translation of U.S. denominated production sales, which had a positive impact on overall sales for the six months ended June 30, 2025 of $71.0 million; the launch and ramp up of new programs, including General Motors' new electric vehicle platforms (BEV3/BET), and the Toyota Tacoma; higher year-over-year production volumes on certain platforms, including Ford Mustang Mach E, the Lucid Air, General Motors' Equinox/Terrain, and a transmission for the ZF Group; and an increase in tooling sales of $58.3 million which are typically dependent on the timing of tooling construction and final acceptance by the customer. Overall industry-wide OEM light vehicle production volumes during the six months ended June 30, 2025 decreased in North America by approximately 4% year-over-year.\n\nSales for the six months ended June 30, 2025 in the Company’s Europe operating segment decreased by $97.0 million or 15.6% to $524.0 million from $621.0 million for the six months ended June 30, 2024. The decrease was due to lower year-over-year OEM production volumes on certain platforms, including aluminum engine blocks for Ford and Mercedes, the Mercedes' electric vehicle platform (EVA2), and Jaguar Land Rover; programs that ended production during or subsequent to the corresponding period of 2024, specifically the BMW Mini; and a decrease in tooling sales of $41.9 million which are typically dependent on the timing of tooling construction and final acceptance by the customer. These negative factors were partially offset by the launch and ramp up of new programs, including Volkswagen's new electric vehicle platform (PPE), and a transmission for Audi; higher year-over-year production volumes of certain platforms including the Lucid Air, and a transmission for the ZF Group; and the impact of foreign exchange on the translation of Euro denominated production sales, which had a positive impact on overall sales for the six months ended June 30, 2025 of $18.1 million. Overall industry-wide OEM light vehicle production volumes during the six months ended June 30, 2025 decreased in Europe by approximately 3% year-over-year.\n\nSales for the six months ended June 30, 2025 in the Company’s Rest of the World operating segment decreased by $3.4 million or 4.9% to $65.6 million from $69.0 million for the six months ended June 30, 2024. The decrease was largely driven by a decrease in tooling sales of $2.6 million, and lower year-over-year production volumes with Jaguar Land Rover and Mercedes.\n\nOverall tooling sales increased by $14.4 million (including outside segment sales eliminations) to $118.9 million for the six months ended June 30, 2025 from $104.5 million for the six months ended June 30, 2024.\n\nThree months ended June 30, 2025 to three months ended June 30, 2024 comparison\n\n\n\nThe gross margin percentage for the second quarter of 2025 of 14.5% increased as a percentage of sales by 0.4% as compared to the gross margin percentage for the second quarter of 2024 of 14.1%. The increase in gross margin as a percentage of sales was generally due to productivity and efficiency improvements at certain operating facilities and other improvements; partially offset by an increase in tooling sales which typically earn low margin for the Company, and operational inefficiencies at certain other operating facilities.\n\nSix months ended June 30, 2025 to six months ended June 30, 2024 comparison\n\n\n\nThe gross margin percentage for the six months ended June 30, 2025 of 13.8% increased as a percentage of sales by 0.2% as compared to the gross margin percentage for the six months ended June 30, 2024 of 13.6%. The increase in gross margin as a percentage of sales was generally due to productivity and efficiency improvements at certain operating facilities and other improvements; partially offset by:\n• overall lower production sales volume and corresponding contribution;\n• an increase in tooling sales which typically earn low margin for the Company; and\n• operational inefficiencies at certain other operating facilities.\n\n\n\nOverall market related inflationary pressures on labour, material and energy costs, along with offsetting commercial settlements, were generally stable year-over-year.\n\nAdjusted Net Income excludes certain items as set out in the following tables and described in the notes thereto. Management uses Adjusted Net Income as a measurement of operating performance of the Company and believes that, in conjunction with IFRS measures, it provides useful information about the financial performance and condition of the Company.\n\nThree months ended June 30, 2025 to three months ended June 30, 2024 comparison\n\nSix months ended June 30, 2025 to six months ended June 30, 2024 comparison\n\n\n\n(1) Restructuring costs\n\n\n\nAdditions to the restructuring provision during the three and six months ended June 30, 2025 totalled $13.8 million and $30.6 million, respectively, and represent employee-related severance resulting from the rightsizing of certain operations in Germany, Canada, Mexico, and the United States.\n\nAdditions to the restructuring provision during the three and six months ended June 30, 2024 totalled $5.4 million and $11.6 million, respectively, and represent employee-related severance resulting from the rightsizing of certain operations in Germany, Mexico Canada, and the United States.\n\nThree months ended June 30, 2025 to three months ended June 30, 2024 comparison\n\n\n\nNet Income, before adjustments, for the second quarter of 2025 decreased by $2.9 million to $38.1 million or $0.52 per share, on a basic and diluted basis, from Net Income of $41.0 million or $0.54 per share, on a basic and diluted basis, for the second quarter of 2024. Excluding the adjustments explained in Table A under \"Adjustments to Net Income\", Adjusted Net Income for the second quarter of 2025 increased by $3.4 million to $47.8 million or $0.66 per share, on a basic and diluted basis, from $44.4 million or $0.58 per share, on a basic and diluted basis, for the second quarter of 2024.\n\nAdjusted Net Income for the second quarter of 2025, as compared to the second quarter of 2024, was positively impacted by the following:\n• a $2.7 million year-over-year decrease in finance expense as a result of decreased debt levels and lower borrowing rates on the Company's revolving bank debt; and\n• a lower effective tax rate (28.8% for the second quarter of 2025 compared to 29.4% for the second quarter of 2024).\n\n\n\nThese factors were partially offset by the following:\n• a net foreign exchange loss of $1.7 million for the second quarter of 2025 compared to a gain of $1.9 million for the second quarter of 2024; and\n• a $1.2 million year-over-year increase in research and development costs driven generally by increased new product and process development activity.\n\nSix months ended June 30, 2025 to six months ended June 30, 2024 comparison\n\n\n\nNet Income, before adjustments, for the six months ended June 30, 2025 decreased by $29.1 million to $55.6 million or $0.76 per share, on a basic and diluted basis, from Net Income of $84.6 million or $1.10 per share, on a basic and diluted basis, for the six months ended June 30, 2024. Excluding the adjustments explained in Table B under “Adjustments to Net Income”, Adjusted Net Income for the six months ended June 30, 2025 decreased by $15.2 million to $77.3 million or $1.06 per share on a basic and diluted basis, from $92.5 million or $1.20 per share on a basic and diluted basis, for the six months ended June 30, 2024.\n\nAdjusted Net Income for the six months ended June 30, 2025, as compared to the six months ended June 30, 2024, was negatively impacted by the following:\n• a net foreign exchange loss of $3.9 million for the six months ended June 30, 2025 compared to a gain of $6.8 million for the six months ended June 30, 2024; and\n• a higher effective tax rate (29.3% for the six months ended June 30, 2025 compared to 27.0% for the six months ended June 30, 2024).\n\n\n\nThese factors were partially offset by the following:\n• a year-over-year decrease in SG&A expense, as previously explained; and\n• a $6.2 million year-over-year decrease in finance expense as a result of decreased debt levels and lower borrowing rates on the Company's revolving bank debt.\n\nA cash dividend of $0.05 per share has been declared by the Board of Directors payable to shareholders of record on September 30, 2025, on or about October 15, 2025.\n\nMartinrea International Inc. is a leader in the development and production of quality metal parts, assemblies and modules, fluid management systems, and complex aluminum products focused primarily on the automotive sector. Martinrea currently operates in 56 locations in Canada, the United States, Mexico, Brazil, Germany, Slovakia, Spain, China, South Africa, and Japan. Martinrea’s vision is making lives better by being the best supplier we can be in the products we make and the services we provide. For more information on Martinrea, please visit www.martinrea.com. Follow Martinrea on X and Facebook.\n\nA conference call to discuss the financial results will be held on Tuesday, August 12, 2025 at 5:30 p.m. Eastern Time. To participate, please dial 416-641-6104 (Toronto area) or 800-952-5114 (toll free Canada and US) and enter participant code 8079440#. Please call 10 minutes prior to the start of the conference call.\n\nThe conference call will also be webcast live in listen-only mode and archived for twelve months. The webcast and accompanying presentation can be accessed at: https://www.martinrea.com/investor-relations/events-presentations/.\n\nThere will also be a rebroadcast of the call available by dialing 905-694-9451 or toll free 800-408-3053 (Conference ID – 2150717#). The rebroadcast will be available until September 12, 2025 at 5:00 p.m.\n\nIf you have any teleconferencing questions, please call Ganesh Iyer at 416-749-0314.\n\nThis Press Release and the documents incorporated by reference therein contains forward-looking statements within the meaning of applicable Canadian securities laws including those related to the Company’s expectations as to, or its views or beliefs in or on, the impact of, or duration of, or factors affecting, or expected response to or growth of, improvements in, expansion of and/or guidance or outlook (including for 2025) as to future results, revenue, sales, margin, gross margin, earnings, and earnings per share, adjusted earnings per share, free cash flow, volumes, adjusted net earnings per share, operating income margins, operating margins, adjusted operating income margins, leverage ratios, net debt to adjusted EBITDA(1), debt repayment, Adjusted EBITDA(1), capex levels, working capital levels, cash tax levels, progress on commercial negotiations, the growth of the Company and pursuit of, and belief in, its strategies, the strength, recovery and growth of the automotive industry and continuing challenges, the impact of and/or uncertainty of tariffs and trade issues in the Company’s business and its industry, as well as other forward-looking statements. The words “continue”, “expect”, “anticipate”, “estimate”, “may”, “will”, “should”, “views”, “intend”, “believe”, “plan” and similar expressions are intended to identify forward-looking statements. Forward-looking statements are based on estimates and assumptions made by the Company in light of its experience and its perception of historical trends, current conditions and expected future developments, as well as other factors that the Company believes are appropriate in the circumstances, such as expected sales and industry production estimates, current foreign exchange rates, timing of product launches and operational improvement during the period, and current Board approved budgets. Many factors could cause the Company’s actual results, performance or achievements to differ materially from those expressed or implied by the forward-looking statements, including, without limitation, the following factors, some of which are discussed in detail in the Company’s AIF and MD&A for the year ended December 31, 2024 and other public filings which can be found on the Company’s profile at www.sedarplus.ca:\n• North American and Global Economic and Political Conditions (including war) and Consumer Confidence\n• Changes in Laws and Governmental Regulations\n• Pandemics and Epidemics, Force Majeure Events, Natural Disasters, Terrorist Activities, Political and Civil Unrest or War, and Other Outbreaks\n• Financial Viability of Suppliers and Key Suppliers and Supply Disruptions (Material Availability or Disruption)\n• A Shift Away from Technologies in Which the Company is Investing\n• Sustainability (ESG) Regulation, Including Environmental Regulation and Climate Change and Human Rights and Supply Chain Issues\n• Risks of Conducting Business in Foreign Countries, Including China, Brazil, Mexico and Other Growing Markets\n• Internal Controls Over Financial Reporting and Disclosure Controls and Procedures\n• Loss of Use of Key Manufacturing Facilities\n• Availability of Consumer Credit or Cost of Borrowing\n• The Company’s Ability to Shift its Manufacturing Footprint to Take Advantage of Opportunities in Growing Markets\n• Change in the Company’s Mix of Earnings Between Jurisdictions with Lower Tax Rates and Those with Higher Tax Rates\n\nThese factors should be considered carefully, and readers should not place undue reliance on the Company’s forward-looking statements. The Company has no intention and undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nThe common shares of Martinrea trade on The Toronto Stock Exchange under the symbol “MRE”.\n\nFor further information, please contact:\n\nSee accompanying notes to the interim condensed consolidated financial statements.\n\nOn behalf of the Board:\n\nMartinrea International Inc.\n\nInterim Condensed Consolidated Statements of Operations\n\n(in thousands of Canadian dollars, except per share amounts) (unaudited)\n\nSee accompanying notes to the interim condensed consolidated financial statements.\n\nSee accompanying notes to the interim condensed consolidated financial statements.\n\nMartinrea International Inc.\n\nInterim Condensed Consolidated Statements of Changes in Equity\n\n(in thousands of Canadian dollars) (unaudited)\n\nSee accompanying notes to the interim condensed consolidated financial statements.\n\n*As at June 30, 2025, $35,663 (December 31, 2024 - $78,547) of purchases of property, plant and equipment remain unpaid and are recorded in trade and other payables.\n\nSee accompanying notes to the interim condensed consolidated financial statements.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=KRnAdRIvowoEARWpRhhmZkPGMH_iqKfNDabIGrFD8PK6SSWO45fStYWUWJk_XKpY0jNatSembgYIFhcbte6xTl0r9pQZlNZTQK8K7FwWKBaZXTfc_UgGgdiEW-7vI2Gn-LsJwOclficaO3xlW8CJE2SbgEEof7cHRLb_qQVmt230zfur03tnpYz-MLJC5PSPGapLbhRpV74AYdksCPuSz7_jEvkuWhT27G_w2HTk8c4womEqJhm6z8JKRsaYJbCsyL41kOSQAKprHEYog1_nmgGvMz2wYrqm3Y3Y2MqBOEv6Il4x5vUz5BWdFhDHHJKTeZq_AENo4DchBsp_9_7pxdXxI0AHR2CoOtV90L1BoHgtHSvYEICrBhfsDVgax3vGVjgmKyFRyyxyEyRSbbPQ1g==",
    "https://www.globenewswire.com/Tracker?data=EBVZNOrmFG3Q7nXtu6XGtqt6J8rnXoSGvE2VbiZXoIS6y1zgVFUoRPOzpTNjV11ItCrjA_n_CSXjE86hEdKdsl4Rnquy-vpZeRsQvBazmkmrBh50xMHMcqoUGs68SacBfzJJEA47zyI4FipPUeyO2zdL61_rf1ex0m88FA-EGsasTYI-tB0L6a-hcjjaJzjHbxhhwSNCR8zTDu2PthPfp3Ld66-GXEsHXhpj_hHcToJPz4V-XOAW8RumVFk9PwWfj0Mk6Br01CilYAUv47jWrLFHbMJQ_iv3HVE1zMKAebkvrgN8k3zyePntuGbf7uQVHmcyyxjjxoZhpLwjIJIJC6K-I-G2a3RzbFUUVPRMBCqevfQXwQNhoENuDs22SoDetfpRoY6fWen7mE_D97q5Tg==",
    "https://www.globenewswire.com/Tracker?data=Zagg743U5U0AKEIJXp5qpwsy2V4gyF-TBo7cdz7d9GUJ6xCUOPkF30DekKjarccXIi4xJd-by8tzB1spPTSJuhBWYrKX1ywH2LdwsBFiWLk6xqQS3LalNQA1-Doy4HMvZ1g06PVL_D_q5bTUnLqOuvzLm1sqTKNlMcV4eBoEP0pRYPA63THHONRJ6qYBdkAGWpyVcLiVu8YM7OM72xMW1vlvLrKO3FqY-H_e444ofsdmb4JWKWefC1wFTavRps025ogwOVbdCBU440Z4kUDfJ6ElwR_yNoDwOA84Vg53bsT9DU-evEHN-iB6JqvCEn9SzZCDj78_JY6OMWfQdGMAzKMwtSGDgV6MFEXfvFY_hVraHxF9MlDPJWxasgKITJs18tBqnT5rshuhEYEH6KU3AMSYaFErcrZFsC_-MMvbjh5ZFmf2z-GUH9kL4CTKv3kk1HXDNdfDK4gYg-I-7-xvgFfBYDsDOopJlytl30269VQrhqo8ZQZv2Tku8Jif9JhfgPprzbakA7-01iatSIbynQ==",
    "https://www.globenewswire.com/Tracker?data=EBVZNOrmFG3Q7nXtu6XGtv24nniTsVnii3hNXNBbFgR6wfKitOXldaWkzZw3TQo5lXFfI0uKTLyhOAT_PZKMNlniwDmIagZ45cBgXpSuRIbswEjgA8mP55P8IacK91ztCcJDJ99MZQoJS1kPnuvuxr-HPjKO9VHXjXQZumFDZruzl4Q4dbzAEIAs2wIP1LVGInbYqj1WdFav30INeUgYAndHaU2YfaNLOtfjGhLK1sOdAbELHx8dT1f1CH6Dc7fOvc7RF1Ahj6vnmytXLXQN0gSTd6AOuWcJff2l8KrEflkj_Ip9PX_LQN3ntvePdkq6YjHEA_pxGUNAbZGd1x7Ub3Z92BFsSA25sFXBQhtjp9GGp4vBBB23x9FpJO3LJnvIpmVs99Dx5C4Ct5aL096Jzw==",
    "https://www.globenewswire.com/Tracker?data=7twT4u2EmbeDoz8Y-OEZNUmoXTvYYF8hju7rprsXDpTQzwKa9oNGhpQoW7VxKNGYaNsKvcGmygf3ykm4D_DBhW9kQYOM1Swo5dFIxa0HPf3zOIYU63FJvhuPeu1H1OTKBdy2bm0HS-94IqdcCzkN_vEXlFwzYooFuwqOw1siv_JYR9G9fg3FRE-Njj7HgfAYTovUcaQmuPgJfmNFFsX_qeNq8Kl7CbtBSvKb-WBBZKAh32akzxriWiZPVHS5DSm_m32lUIwv9qo3RYJQUZLp2q6GgsxLTZG2WnFJnNmstrWgajMRK3pYyDc2dA1ISYcL-0eb1_CIUOOVAJ_5vmQomg8K8Ua07T5FQIkdQ_sm07MYABdEbZk2Ouhy4Vz1QqXoJ3dnPKLpxv0Q7y_kXlbDGfb7kRsrUcAsKlZlkU51Ptc=",
    "https://www.globenewswire.com/Tracker?data=_lCxI3hxoi5JdFufqUuaoWb1nDa043pZmhEJ4dpnSHT2Q3wG3mBVHXnemssREcLbuUHtieoFUR2s21CClIkwRDbp2_gdh-m1or5M4V31zcZcIUlficc6C33ZhKTNlA5BcYLbS1eVUdVKW2D9zyV6ctot5x3kMPKSRfJOzh3XSEIOPF-Omvr0vuhBsCvpHFdy_Iar5GlpyC6ePEqnVXk1xkQCGoPmJ-oL3jUBt8Aawth0e1RS7sEjuF1SHKzwHLecq1S_NILKqe8AP2xCwwOstShiw2pkRUvuDX4IQn1i6OxvMjqVzYan0Q2CVS-eV8o5EjoDOWtCacIxTdyCmL-tlbi1f59A2Ihtnu0Oop1Fi7qY3HsHSeYYvW1yJIiNAqToDq-tfl5pDDYkkG4umhMIFy3mrmvhkcT7m4-JtKXkDlf27KLPgRr2TdyaAbW-KpA6BkDhFXG5-oOPxMmYGWAqb_8O4ke4xjgbJZRuVp0LR8BYkAdvZCSsleWpno_AXWdcW15JYypw5z-2k_iWGaztVTAJwhctB-_OjBUsRUSNnvaQg_GxZsP2bUZKdreNSyDaj-O_bBkU14gcHc-yE_WYzBFUUYZLZbQ_WkB4BGxGBxk0lkXdTfDbi6yxDTkRYKmElRGqaHARrhYhv-0OOD0eSjKF0X7cz3mRHrw_DTNylPzdTk29FJxSBJ1e5wcqT0JPIA93JdAZVJSmuZxMNMApUpNI9YVmopBfqYhoAvDT1VPs2LV35ip47favLwF82P-kxPE3CZpdVnPNgct2fHH9h6SeT-ynI-_7drePzUoGnAB8l2g2luu22jJO97NE3FksiXLFp47eSaiqyMR4OcLZBKoK4FylKowpl2OhWrrPIDMaPSqX6p4Y42LqoPIInRCV"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Second Quarter Results",
      "weight": 0.06747718
    },
    {
      "name": "Second Quarter",
      "weight": 0.06503122
    },
    {
      "name": "second quarter",
      "weight": 0.06503122
    },
    {
      "name": "certain non-IFRS financial measures",
      "weight": 0.05974406
    },
    {
      "name": "Vehicle production volumes",
      "weight": 0.059377063
    },
    {
      "name": "Company",
      "weight": 0.058560487
    },
    {
      "name": "year",
      "weight": 0.05853215
    },
    {
      "name": "Euro denominated production sales",
      "weight": 0.0583674
    },
    {
      "name": "U.S. denominated production sales",
      "weight": 0.0583674
    },
    {
      "name": "Overall tooling sales",
      "weight": 0.058359426
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.990234375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9697265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96533203125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.53271484375
    }
  ],
  "sentiment": {
    "positive": 0.81037164,
    "negative": 0.025973149,
    "neutral": 0.16365515
  },
  "summary": "Martinrea International Inc. (TSX: MRE) has reported its second quarter results and declared a quarterly cash dividend of $0.05 per share. The company considers certain non-IFRS financial measures as useful additional information to measure its financial performance and condition. These measures, which do not have a standardized meaning prescribed by IFRS, do not necessarily represent those of other publicly traded companies. The Company's performance was particularly pleased with margins significantly higher in Q2, with vehicle production volumes increasing quarter over quarter and a 6.8% Adjusted Operating Income Margin. Free Cash Flow (1), excluding principal payments of IFRS 16 lease liabilities, was $72.0 million, up almost 40% year over year. The Net Debt-to-Adjusted EBITDA ratio ended at 1.50x, down from 1.64x in the first quarter of 2025 and at its target of 1.60x or better. The CEO, Pat D’Eramo, stated that the company's exposure to tariffs was manageable and that USMCA-compliant auto parts are exempt from tariffs, given operational improvements and anticipated recoveries from customers, and that it is maintaining its 2025 outlook for total sales of $4.8 to $5.1 billion.",
  "shortSummary": "Martinrea International reported a 46% increase in second quarter profit to $72.0m, driven by operational improvements and increased vehicle production volumes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5e25aa44cbee49a2bbe6ee686211fb81",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Martinrea International Inc. reported its financial results for the second quarter of 2025, showing a decrease in consolidated sales by 2.0% year-over-year to $1,275.5 million. The company achieved an Adjusted Operating Income Margin of 6.8%, up 50 basis points from the previous year, and Free Cash Flow increased by nearly 40% to $72.0 million. CEO Pat D’Eramo expressed satisfaction with operational improvements and maintained the 2025 sales outlook of $4.8 to $5.1 billion, while also announcing a quarterly cash dividend of $0.05 per share.",
  "argos_id": "ZJXZY784J"
}