{
  "url": "https://news.crunchbase.com/health-wellness-biotech/revalia-bio-seed-raise-human-data-trials/",
  "authorsByline": "Mary Ann Azevedo",
  "articleId": "5657127655374628bf250d840f023db3",
  "source": {
    "domain": "news.crunchbase.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://news.crunchbase.com/wp-content/uploads/Biotech_Privacy.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T06:00:33-07:00",
  "addDate": "2025-09-04T13:19:28.262728+00:00",
  "refreshDate": "2025-09-04T13:19:28.262731+00:00",
  "score": 1.0,
  "title": "Exclusive: Revalia Bio Raises $14.5M To ‘Revolutionize’ Drug Development With Human Data Trials",
  "description": "New Haven, Connecticut-based Revalia Bio, a startup that helps companies test new therapies on human organs, has raised $14.5 million in seed funding, the company told Crunchbase News exclusively.",
  "content": "Revalia Bio, a startup that helps companies test new therapies on human organs, has raised $14.5 million in seed funding, the company told Crunchbase News exclusively.\n\nNew Haven, Connecticut-based Revalia launched operations in March 2023 as a spinout from Yale University. The company claims to be a pioneer of what it has dubbed “‘human data trials,” or as executives describe it, a new category of pre-clinical research that aims to give drug developers early and “predictive” insights from real, functional human organs.\n\nThe organs used in the trials have been revived and sustained using proprietary perfusion technology and come from donors whose organs aren’t viable for transplant.\n\nRevalia is seeing “significant demand” for its human data trial platform and, in its most recent year of operations, achieved multimillion-dollar top-line revenue, according to co-founder and CEO Greg Tietjen. It recently signed two of the world’s top 10 pharmaceutical companies as customers, he said.\n\nTietjen believes that Revalia’s early growth is at least in part due to what he describes as the field of biomedical innovation “moving rapidly to human-centered development driven by recent changes at FDA and NIH that seek to remove our dependence on animal models that simply don’t translate to human biology.”\n\n“Historically, this type of preclinical or translational research was done either in large animal models or petri-dish models using human cells,” he told Crunchbase News. “Our new approach to integrated human data provides better patient relevance than these traditional approaches and allows us to dramatically reduce the timeline, cost and risk profile of developing a new therapy.”\n\nA biophysicist and former assistant professor at Yale, Tietjen ran an academic lab focused on perfusion science. He left his tenure-track position in 2023 to work on the human, data-driven trials that serve as the premise of Revalia.\n\n“The old model of drug development is broken — decade-long timelines, 90% failure rates, and billion-dollar costs are no longer sustainable,” he said.\n\nIn its first year of operation, Revalia worked to validate demand for its human data trials and identify “the optimal product and payment models,” according to Jenna DiRito, the company’s co-founder and chief product officer.\n\nOne advantage of these types of human data trials, DiRito claims, is that researchers no longer have to “guess from animal models or in vitro chips.” (The FDA in April announced a plan to phase out animal trials for monoclonal antibodies and other drugs, she pointed out.)\n\n“We make it possible to study human disease directly in living organs, revealing insights into human biology that were previously impossible,” DiRito noted. “These living organs act as the Rosetta Stone of human data because they allow us to align patient history, anatomy, physiology, cellular and molecular profiles into a single complete picture.”\n\nThrough its human data, the startup then aims to transform the information gleaned into “decision grade evidence on safety, dosing and efficacy“ without putting patients at risk.\n\n“Just as importantly, human data trials create a new path for organ donation when a donor’s organs cannot be used for clinical transplant,” added DiRito, a Forbes 30 Under 30 transplant scientist who’s perfused human organs and is now scaling that expertise through product at Revalia.\n\nAmerica’s Frontier Fund and Sierra Ventures co-led Revalia’s seed raise, which also included participation from Roger Ferguson, former vice chair of the U.S. Federal Reserve and a member of the board of directors at Alphabet, as well as other existing backers.\n\nEarly investor and neuroscientist Milad Alucozai believed in the company’s mission so much that he joined the company to help scale it.\n\nThe startup also previously raised $5 million in pre-seed funding in the form of SAFE notes from a mix of institutional investors, angels, friends and family.\n\nCustomers can start with an initial starter trial package. For those ready to go beyond the trial package, Revalia offers a recurring subscription model.\n\nFor now, Revalia is focused on running its human data trials in kidney disease and oncology. Looking ahead, the company plans to expand to include new diseases and applications, such as medical device testing.\n\n“We are especially excited to expand human data trials as a companion to existing clinical trials, providing integrated data that better supports adaptive trial designs,” DiRito said.\n\nIt is now launching the beta version of its platform.\n\nBrian Wilcove, managing partner at America’s Frontier Fund, said his firm invested in Revalia because it believes that “drug development needs a revolution.”\n\n“And it starts with finally understanding human biology,” he told Crunchbase News via email. “The ability to generate high-fidelity, human-specific data at scale is one of the most important advancements in biomedicine today,” Wilcove added in a written statement. “Revalia’s platform has the potential to not only transform clinical trials, but to strengthen national health resilience.”",
  "medium": "Article",
  "links": [
    "https://www.crunchbase.com/organization/revalia-bio",
    "https://www.crunchbase.com/person/brian-wilcove",
    "https://www.crunchbase.com/person/jenna-dirito",
    "https://www.crunchbase.com/organization/america-s-frontier-fund",
    "https://www.domguzman.com/",
    "https://www.crunchbase.com/person/greg-tietjen-7a3f",
    "https://www.crunchbase.com/organization/u-s-food-and-drug-administration",
    "https://www.crunchbase.com/organization/yale-university",
    "https://www.fda.gov/news-events/press-announcements/fda-announces-plan-phase-out-animal-testing-requirement-monoclonal-antibodies-and-other-drugs",
    "https://www.crunchbase.com/organization/national-institutes-of-health",
    "https://www.crunchbase.com/organization/sierra-ventures",
    "https://www.crunchbase.com/person/roger-ferguson",
    "https://www.crunchbase.com/organization/alphabet",
    "https://www.crunchbase.com/person/milad-alucozai",
    "https://www.crunchbase.com/discover/saved/venture-funding-to-biotech-startups/933a81a6-a1c8-4dc9-8b33-2e51db94bf59",
    "https://www.crunchbase.com/organization/federal-reserve-system",
    "https://www.sciencedirect.com/topics/nursing-and-health-professions/organ-perfusion",
    "https://www.biopharmadive.com/news/fda-animal-testing-phase-out-antibodies-requirements/745129/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Human Data Trials",
      "weight": 0.11869333
    },
    {
      "name": "human data trials",
      "weight": 0.11869333
    },
    {
      "name": "human data",
      "weight": 0.10693115
    },
    {
      "name": "integrated human data",
      "weight": 0.10001537
    },
    {
      "name": "human organs",
      "weight": 0.09867774
    },
    {
      "name": "human biology",
      "weight": 0.09160715
    },
    {
      "name": "human disease",
      "weight": 0.09149218
    },
    {
      "name": "human cells",
      "weight": 0.086941175
    },
    {
      "name": "animal trials",
      "weight": 0.0839372
    },
    {
      "name": "clinical trials",
      "weight": 0.08291663
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97607421875
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.92919921875
    },
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.78173828125
    },
    {
      "name": "/News/Health News",
      "score": 0.642578125
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.370361328125
    }
  ],
  "sentiment": {
    "positive": 0.51190263,
    "negative": 0.079973005,
    "neutral": 0.40812436
  },
  "summary": "Revalia Bio, a startup that helps companies test new therapies on human organs, has raised $14.5 million in seed funding. The company, which launched in March 2023 as a spinout from Yale University, claims to be a pioneer in ‘human data trials’ which aim to give drug developers early and “predictive” insights from real, functional human organs. The organs used in these trials are revived and sustained using proprietary perfusion technology and come from donors whose organs are not viable for transplant. Revalia is seeing significant demand for its human data trial platform and has signed two of the world’s top 10 pharmaceutical companies as customers. The startup also plans to expand to include medical device testing and applications such as medical device and medical device.",
  "shortSummary": "Revalia Bio raises $14.5 million in seed funding to revolutionize drug development with human data-driven trials, enhancing patient relevance and efficiency, and enhancing organ donation capabilities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3c596427211b43bd80beb3d87e4255d3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fda.gov/news-events/press-announcements/fda-announces-plan-phase-out-animal-testing-requirement-monoclonal-antibodies-and-other-drugs",
      "text": "FDA News Release\nFDA Announces Plan to Phase Out Animal Testing Requirement for Monoclonal Antibodies and Other Drugs\n- For Immediate Release:\nToday, the U.S. Food and Drug Administration is taking a groundbreaking step to advance public health by replacing animal testing in the development of monoclonal antibody therapies and other drugs with more effective, human-relevant methods. The new approach is designed to improve drug safety and accelerate the evaluation process, while reducing animal experimentation, lowering research and development (R&D) costs, and ultimately, drug prices.\nThe FDA’s animal testing requirement will be reduced, refined, or potentially replaced using a range of approaches, including AI-based computational models of toxicity and cell lines and organoid toxicity testing in a laboratory setting (so-called New Approach Methodologies or NAMs data). Implementation of the regimen will begin immediately for investigational new drug (IND) applications, where inclusion of NAMs data is encouraged, and is outlined in a roadmap also being released today. To make determinations of efficacy, the agency will also begin use pre-existing, real-world safety data from other countries, with comparable regulatory standards, where the drug has already been studied in humans.\n“For too long, drug manufacturers have performed additional animal testing of drugs that have data in broad human use internationally. This initiative marks a paradigm shift in drug evaluation and holds promise to accelerate cures and meaningful treatments for Americans while reducing animal use,” said FDA Commissioner Martin A. Makary, M.D., M.P.H. “By leveraging AI-based computational modeling, human organ model-based lab testing, and real-world human data, we can get safer treatments to patients faster and more reliably, while also reducing R&D costs and drug prices. It is a win-win for public health and ethics.”\nKey Benefits of Replacing Animal Testing in Monoclonal Antibody Safety Evaluation:\n- Advanced Computer Simulations: The roadmap encourages developers to leverage computer modeling and artificial intelligence to predict a drug’s behavior. For example, software models could simulate how a monoclonal antibody distributes through the human body and reliably predict side effects based on this distribution as well as the drug’s molecular composition. We believe this will drastically reduce the need for animal trials.\n- Human-Based Lab Models: The FDA will promote the use of lab-grown human “organoids” and organ-on-a-chip systems that mimic human organs – such as liver, heart, and immune organs – to test drug safety. These experiments can reveal toxic effects that could easily go undetected in animals, providing a more direct window into human responses.\n- Regulatory Incentives: The agency will work to update its guidelines to allow consideration of data from these new methods. Companies that submit strong safety data from non-animal tests may receive streamlined review, as the need for certain animal studies is eliminated, which would incentivize investment in modernized testing platforms.\n- Faster Drug Development: The use of these modern techniques should help speed up the drug development process, enabling monoclonal antibody therapies to reach patients more quickly without compromising safety.\n- Global Leadership in Regulatory Science: With this move, the FDA reaffirms its role as a global leader in modern regulatory science, setting new standards for the industry and encouraging the adoption of innovative, humane testing methods. In recent years, Congress and the scientific community have pressed for more human-relevant testing methods. Today’s announcement is a step by the FDA towards its commitment to modernize regulatory science as technology advances.\nWorking in close partnership with federal agencies such as the National Institutes of Health, the National Toxicology Program and the Department of Veterans Affairs, the FDA aims to accelerate the validation and adoption of these innovative methods through the Interagency Coordinating Committee on the Validation of Alternative Methods (ICCVAM). The FDA and federal partners will host a public workshop later this year to discuss the roadmap and gather stakeholder input on its implementation. Over the coming year, the FDA aims to launch a pilot program allowing select monoclonal antibody developers to use a primarily non-animal-based testing strategy, under close FDA consultation. Findings from an accompanying pilot study will inform broader policy changes and guidance updates expected to roll out in phases.\nCommissioner Makary noted the far-reaching significance of this proposal. “For patients, it means a more efficient pipeline for novel treatments. It also means an added margin of safety, since human-based test systems may better predict real-world outcomes. For animal welfare, it represents a major step toward ending the use of laboratory animals in drug testing. Thousands of animals, including dogs and primates, could eventually be spared each year as these new methods take root.”\nRelated Information\n###\nThe FDA, an agency within the U.S. Department of Health and Human Services, protects the public health by assuring the safety, effectiveness, and security of human and veterinary drugs, vaccines and other biological products for human use, and medical devices. The agency also is responsible for the safety and security of our nation’s food supply, cosmetics, dietary supplements, radiation-emitting electronic products, and for regulating tobacco products."
    },
    {
      "url": "https://www.biopharmadive.com/news/fda-animal-testing-phase-out-antibodies-requirements/745129/",
      "text": "Dive Brief:\n- The Food and Drug Administration aims to phase out animal toxicology testing for experimental drugs, announcing Thursday a plan to reduce, revise or replace such requirements in favor of newer methods that are more “human relevant.”\n- The agency’s plan outlines several steps by which it intends to move away from considering animal testing the default approach, including by encouraging drugmakers to adopt other methods, like “organ-on-a-chip” systems or computational modeling. The FDA will also lower its “routine” requirement for six months of toxicology testing in primates for monoclonal antibody drugs.\n- The FDA will start by asking companies to submit data from these alternative approaches with Investigational New Drug applications, which are used to request permission to begin human testing. The agency also intends to consider pre-existing human toxicity data obtained in other countries, if it exists.\nDive Insight:\nThe FDA’s plan, which acts on changes to law made through the 2022 FDA Modernization Act 2.0, is the first major regulatory policy of Commissioner Martin Makary’s tenure.\n“This initiative marks a paradigm shift in drug evaluation and holds promise to accelerate cures and meaningful treatments for Americans while reducing animal use,” said Makary, who was sworn in April 1. “By leveraging AI-based computational modeling, human organ model-based lab testing, and real-world human data, we can get safer treatments to patients faster and more reliably, while also reducing R&D costs and drug prices.”\nThe FDA’s statement framed the policy as part of the agency’s efforts to be a “global leader in modern regulatory science” and set new standards for the pharmaceutical and biotechnology industries.\nThe agency has been building toward this point for some time, pushed by the 2022 legislation as well as by recommendations from its science board last year. But implementation may now be more challenging as the FDA struggles through potentially crippling staff cuts ordered by Health and Human Services Secretary Robert F. Kennedy Jr.\nThe layoffs have been sweeping, affecting roughly 20% of the FDA’s workforce and effectively shuttering some offices within key agency divisions. Policy staff, who do the difficult work of assembling the guidance documents the FDA uses to establish new rules, were particularly hard hit, including at the Center for Drug Evaluation and Research, which oversees many of the agency’s drug reviews.\nThe Trump administration has also issued an executive order requiring agencies to eliminate 10 regulations for every new regulation they establish. Importantly, this order covers guidance documents, not just formal regulations.\nThis backdrop could complicate major new policy efforts like the planned change to animal testing requirements. For instance, the plan calls for the agency to develop new guidance, stand up new workshops, collect data and track outcomes — work policy teams within the agency would likely help carry out.\nStill, even if early work is slow to get going, reduction in animal testing requirements could have significant impacts on the industry down the road. Animal studies are widely used as a preliminary gauge of the safety and efficacy of new medicines before testing in humans begin. However, these studies are costly and, because biological systems in animals often differ substantially from humans, don’t always provide an accurate assessment of a drug’s true safety and efficacy.\nUsing more relevant in vitro systems, provided their utility is sufficiently validated, could help drugmakers move more quickly at lower cost.\nInitially, the FDA will ask drugmakers to submit data obtained via these newer methods alongside traditional animal data, building up a “repository of experience” for how they align. The agency will pilot non-animal-based testing with select monoclonal antibody developers and host a public workshop this year to collect input on its plans.\nOver time, the FDA expects to make broader policy changes across other kinds of drugs. Ultimately, it aims to “make animal studies the exception rather than the norm” for preclinical toxicology testing."
    }
  ],
  "argos_summary": "Revalia Bio, a Yale spin‑out, raised $14.5 M in seed funding to expand its human‑organ trial platform that replaces animal models with perfused donor organs. The company has already signed two top‑10 pharma clients and is targeting kidney disease and oncology, with plans to add medical device testing. The funding comes amid FDA plans to phase out animal testing for monoclonal antibodies, boosting demand for human‑relevant preclinical methods. Investors include America’s Frontier Fund, Sierra Ventures, and former Fed official Roger Ferguson, reflecting confidence in the technology’s potential to cut drug development timelines and costs.",
  "argos_id": "0PCPN27BK"
}