{
  "url": "https://finance.yahoo.com/news/empire-metals-limited-announces-interim-060000096.html",
  "authorsByline": "Empire Metals Limited",
  "articleId": "8d05ab36141b475e9102fbf217368fbd",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/accesswire.ca/87d8bad407197307b6d0ebb42ac3871f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T06:00:00+00:00",
  "addDate": "2025-09-04T06:20:03.813377+00:00",
  "refreshDate": "2025-09-04T06:20:03.813380+00:00",
  "score": 1.0,
  "title": "Empire Metals Limited Announces Interim Results",
  "description": "LONDON UNITED KINGDOM / ACCESS Newswire / September 4, 2025 / Empire Metals Limited (LON:EEE)(OTCQX:EPMLF), the resource exploration and development company, is pleased to announce its interim results for the six-month period ended 30 June 2025. Highlights: ...",
  "content": "\"From an operational standpoint, we are now on the cusp of delivering our maiden MRE, which we believe will firmly establish Pitfield among the world's leading titanium assets. Beyond that, the pathway is clear: complete our expanded testwork, progress to pilot-scale operations, and begin engaging directly with end-users - particularly in high-value markets such as aerospace and defence, where titanium's strategic importance is growing rapidly.\n\n\"Metallurgical testwork has shown that we can achieve a product of extraordinary purity using straightforward, conventional processing methods.This rare combination of scale, grade and simplicity underpins our confidence that Pitfield can emerge as one of the world's leading titanium projects, capable of supplying high-value sectors such as aerospace and defence for decades to come.\n\nShaun Bunn, Managing Director, commented: \"The first half of 2025 has been a period of remarkable activity and momentum for Empire. Pitfield is no longer just a discovery story - it is fast becoming recognised as a project of global importance, with results that continue to exceed expectations. Our drilling campaigns have delivered some of the highest TiO₂ grades we've seen to date, confirming not only the exceptional quality of the deposit but also its scale consistency and simplicity.\n\nCommenced US trading on the OTCQX in the US , broadening international investor access.\n\nFurther strengthening of board and technicial team with appointment of Phil Brumit as Non-Executive Director, Alan Rubio as Study Manager and Pocholo Aviso as Hydro-metallurgist.\n\nProcess development work has confirmed that Pitfield's weathered ore is ideally suited to conventional mineral separation and refining , differentiating it from ilmenite-based projects which typically face lower recoveries, higher costs, and significant environmental challenges.\n\nLargest drilling campaign to date launched at the Thomas Prospect delivered outstanding results and identified a large high-grade near-surface core, averaging ~6% TiO₂ over a continuous 3.6km strike.\n\nPitfield confirmed as the world's most significant new titanium discovery , with unparalled scale, consistency of high-grade and purity.\n\nLONDON UNITED KINGDOM / ACCESS Newswire / September 4, 2025 / Empire Metals Limited (LON:EEE)(OTCQX:EPMLF), the resource exploration and development company, is pleased to announce its interim results for the six-month period ended 30 June 2025.\n\n\"It is also encouraging to see the strength of market support for what we are building and I am confident that Empire can bring this once-in-a-lifetime discovery to commercial fruition in an expedient manner. With a world-class asset, a strengthened technical team, and strong financial backing, we are exceptionally well positioned for the next phase of growth.\"\n\nCertain information contained in this announcement would have been deemed inside information for the purposes of Article 7 of Regulation (EU) No 596/2014, as incorporated into UK law by the European Union (Withdrawal) Act 2018, until the release of this announcement.\n\nFor further information please visit www.empiremetals.com or contact:\n\nThe progress we have made during 2025 at our flagship Pitfield Project in Western Australia has been nothing short of transformational, positioning the Company at the forefront of what we believe is the most significant titanium discovery globally. This represents a generational opportunity rapidly moving from exploration success toward commercial reality.\n\nOver the past six months, our team has demonstrated not only technical excellence but also the ability to deliver results that have redefined the perception of the Company in the market. We have moved from exploration to successfully establishing Pitfield's potential to support long-term, large-scale, and high-value titanium supply. This achievement is reflected in the strong support we continue to receive from institutional investors, with £4.5 million raised in May 2025, and in the remarkable performance of our share price, which has risen more than 500% since the beginning of the year in response to a series of consequential milestone achievements.\n\nWhat sets Pitfield apart is not just its extraordinary scale, but the exceptional quality of its titanium mineralisation. Unlike many other titanium projects around the world, Pitfield benefits from high-grade mineralisation from surface which has been proven to be of exceptional purity, being very low in deleterious contaminants but also amenable to simple, conventional mining methods due to its unique geological profile. Equally important, our metallurgical work has confirmed that simple, conventional processing can deliver an exceptionally pure titanium dioxide product, grading 99.25% TiO₂.\n\nThis combination of scale, grade, purity, and processing simplicity puts Pitfield in a league of its own. The Project is also located in Western Australia - a Tier One mining jurisdiction with world-class infrastructure, stable governance, a skilled workforce and a deeply rooted mining culture. Together, these advantages create a foundation for Pitfield to become a globally significant source of titanium supply.\n\nDuring the first half of 2025, we advanced Pitfield across multiple fronts. A major drilling campaign was launched in February that provided not only the bulk metallurgical samples that enabled a significant scale-up of our metallurgical test work programme during the period, but also represented the next step towards defining a Mineral Resource Estimate (\"MRE\") for Pitfield.\n\nA further drill campaign was launched in June 2025, the largest at Pitfield to date. The programme covered more than 11 square kilometres and targeted high-grade titanium mineralisation within the in-situ weathered cap at the Thomas Prospect, with the objective of delivering the MRE. This programme delivered some of the highest titanium dioxide grades recorded to date, with selected intercepts including: 44m @ 7.87% TiO from surface (AC25TOM159); 50m @ 7.84% TiO from 4m (AC25TOM130); 54m @ 7.41% TiO from surface (AC25TOM118); 98m @ 7.05% TiO from 2m (RC25TOM062); and 98m @ 7.05% TiO from 2m (RC25TOM068). A large, high-grade central core was identified from this drilling which averaged ~6% TiO across a continuous 3.6km strike length. In addition, nearly two thirds of all drillholes averaged > 4% TiO , with over 90% exceeding a 2% TiO cut-off grade.\n\nWe are now on the cusp of delivering our maiden MRE, which is expected in the coming weeks. Based on the results to date, we expect the MRE to be world-class and to serve as a foundation for the next phase of project development including mine scoping studies.\n\nFollowing the process development breakthrough announced post period end in August 2025, we are progressing through the bench-scale and large-scale batch metallurgical testwork programme, which we expect to complete by early 2026. This work will feed into the design of a continuous pilot plant, enabling us to refine the commercial flowsheet and to produce bulk samples for evaluation by prospective end-users.\n\nWhile most of the world's titanium feedstock is used to produce titanium dioxide for pigments in paints, coatings, and plastics, Pitfield's unique quality opens doors to higher-value markets. In particular, titanium sponge (for use in titanium metal production) stands out as a strategic growth opportunity. Titanium metal is essential in defence and aerospace applications due to its remarkable strength-to-weight ratio and resistance to extreme conditions. These attributes make it critical for fighter jets, naval vessels, spacecraft, and next-generation technologies.\n\nAt a time when the geopolitical landscape is shifting rapidly, the security of titanium supply has never been more important. China has tripled its titanium sponge output since 2018 and now controls nearly 70% of global supply. The United States is 95% reliant on imports of titanium sponge and 86% reliant on imports of mineral concentrates. Similarly, the European Union is exposed to supply risks, with no meaningful domestic production. Pitfield therefore represents a unique opportunity for Empire to establish itself as a secure, Western-aligned generational supplier of titanium. This strategic positioning is already resonating strongly with investors and potential industry partners.\n\nAs Pitfield advances toward development, we have made strategic additions to our team to ensure we have the right expertise in place. In January 2025, we were delighted to welcome Phil Brumit to the Board as a Non-Executive Director and Chair of our Technical Committee. Phil brings more than 40 years of operational and project management experience across leading global mining companies, including Freeport-McMoRan, Lundin Mining, and Newmont Corporation. His proven track record in overseeing large-scale projects from development through to production will continue to be invaluable as we pursue an expeditious development of Pitfield.\n\nFollowing the period end, we further strengthened our technical leadership with the appointments of Alan Rubio as Study Manager and Pocholo Aviso as Hydrometallurgist. Alan brings nearly three decades of experience in project evaluation and development, and will play a central role in assessing mining and infrastructure scenarios, as well as overseeing key economic studies. Pocholo, with his background in the TiO₂ pigment industry and metallurgical expertise, will lead the product development programme, optimising process flowsheets and assessing market pathways. Together, these appointments significantly enhance our ability to quickly advance Pitfield toward feasibility study stage with confidence and precision.\n\nAlongside our operational and corporate progress, we have also been proactive in broadening awareness of the Empire investment proposition to a wider international audience. A key part of this strategy was our decision to commence trading of our shares on the OTCQB Market in the United States in March 2025. We were particularly pleased to be upgraded to the OTCQX Market only a few months later, which is a significant step forward in providing US investors with greater visibility of, and access to, Empire.\n\nTrading on OTCQX opens the Company to a deep and diverse pool of new shareholders, many of whom are actively seeking exposure to strategic metals. Titanium is formally recognised as a critical mineral in numerous jurisdictions, including the United States, and our marketing initiatives across North America have confirmed the strong appetite for high-quality investment opportunities in this sector. Empire is therefore exceptionally well positioned to capture growing international investor interest as Pitfield advances toward commercialisation.\n\nAs an exploration and development group which has no revenue, we are reporting a loss for the six months ended 30 June 2025 of £1,704,821 (30 June 2024: loss of £1,389,318).\n\nIn May 2025, the Company announced that it had raised £4.5 million before expenses by way of a placing of 47,368,423 new ordinary shares of no par value to new and existing investors at 9.5p per share.\n\nThe Group's cash position as at 30 June 2025 was £6.3 million.\n\nThe months ahead will be a busy and exciting time for Empire Metals. The maiden MRE will provide a foundation for detailed project evaluation, while ongoing metallurgical testwork will further optimise our flowsheet and advance our understanding of Pitfield's product potential. As we transition into the pilot testing phase, we will be engaging more closely with potential customers, including those in the titanium metal supply chain, to position Pitfield as a long-term, strategic source of secure supply.\n\nAt the same time, we will continue to strengthen our team and capabilities to match the scale of the opportunity before us. With a world-class asset, a highly experienced team, strong financial backing, and a supportive market, we are exceptionally well placed to deliver on the unprecendented opportunity Pitfield presents.\n\nI would like to thank our shareholders for their continued support and confidence in Empire. The progress we have made in such a short time has been extraordinary, and I firmly believe we are only at the beginning of a highly rewarding journey that will see Pitfield become established as one of the most important titanium projects globally.\n\nWith Pitfield, we are building the foundations of a secure, generational-scale titanium supply business that has the potential to reshape the global titanium industry. The coming months promise to be both exciting and defining, and I look forward to updating you on our continued progress.\n\nCONDENSED CONSOLIDATED STATEMENT OF CHANGES IN SHAREHOLDERS' EQUITY\n\nNOTES TO THE INTERIM FINANCIAL STATEMENTS\n\nThe principal activity of Empire Metals Limited ('the Company') and its subsidiaries (together 'the Group') is the exploration and development of precious and base metals. The Company's shares are quoted on the AIM Market of the London Stock Exchange. The Company is incorporated in the British Virgin Islands and domiciled in the United Kingdom. The Company was incorporated on 10 February 2010 under the name Gold Mining Company Limited. On 10 October 2016 the Company changed its name from Noricum Gold Limited to Georgian Mining Corporation and subsequently on 10 February 2020 changed its name from Georgian Mining Corporation to Empire Metals Limited.\n\nThe address of the Company's registered office is Craigmuir Chambers, PO Box 71, Road Town, Tortola BVI.\n\nThe condensed consolidated interim financial statements have been prepared in accordance with the requirements of the AIM Rules for Companies. As permitted, the Company has chosen not to adopt IAS 34 \"Interim Financial Statements\" in preparing this interim financial information. The condensed interim financial statements should be read in conjunction with the annual financial statements for the year ended 31 December 2024, which have been prepared in accordance with International Financial Reporting Standards (IFRS) as adopted by the European Union.\n\nThe interim financial information set out above does not constitute statutory accounts. They have been prepared on a going concern basis in accordance with the recognition and measurement criteria of International Financial Reporting Standards (IFRS) as adopted by the European Union. Statutory financial statements for the year ended 31 December 2024 were approved by the Board of Directors on 5 June 2025. The report of the auditors on those financial statements was unqualified.\n\nThe Directors, having made appropriate enquiries, consider that adequate resources exist for the Group to continue in operational existence for the foreseeable future and that, therefore, it is appropriate to adopt the going concern basis in preparing the condensed interim financial statements for the period ended 30 June 2025.\n\nThe factors that were extant in the 31 December 2024 Annual Report are still relevant to this report and as such reference should be made to the going concern note and disclosures in the 2024 Annual Report.\n\nThe Board continuously assesses and monitors the key risks of the business. The key risks that could affect the Group's medium-term performance and the factors that mitigate those risks have not substantially changed from those set out in the Group's 31 December 2024 Annual Report and Financial Statements, a copy of which is available on the Group's website: https://www.empiremetals.co.uk. The key financial risks are liquidity risk, foreign exchange risk, credit risk, price risk and interest rate risk.\n\nThe preparation of condensed interim financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, income and expenses, and disclosure of contingent assets and liabilities at the end of the reporting period. Significant items subject to such estimates are set out in note 4 of the Group's 31 December 2024 Annual Report and Financial Statements. Actual amounts may differ from these estimates. The nature and amounts of such estimates have not changed significantly during the interim period.\n\nThe same accounting policies, presentation and methods of computation have been followed in these condensed interim financial statements as were applied in the preparation of the Group's annual financial statements for the year ended 31 December 2024.\n\n3.1 Changes in accounting policy and disclosures\n\n(a) New and amended standards mandatory for the first time for the financial periods beginning on or after 1 January 2025.\n\nThe International Accounting Standards Board (IASB) issued various amendments and revisions to International Financial Reporting Standards and IFRIC interpretations. The amendments and revisions were applicable for the period ended 30 June 2025 but did not result in any material changes to the Financial Statements of the Group.\n\nb) New standards, amendments and interpretations in issue but not yet effective or not yet endorsed and not early adopted.\n\nThere are a number of standards, amendments to standards, and interpretations which have been issued by the IASB that are effective in future accounting periods and which have not been adopted early.\n\nNo dividend has been declared or paid by the Company during the six months ended 30 June 2025 (2024: nil).\n\nThe Exploration & Evaluation additions in the current period primarily relates to work performed at the Company's Pitfield project.\n\nThe Directors do not consider the asset to be impaired.\n\nThe Company continue to work on a potential divestment of the Eclipse project and are actively engaged with a number of Australian companies operating in the gold mining sector to find a buyer. Management are committed to the sale of the Eclipse licence.\n\nThe calculation of the total basic loss per share of 0.260 pence (30 June 2024: 0.230 pence) is based on the loss attributable to equity owners of the parent company of £1,704,821 (30 June 2024: £1,389,318 ) and on the weighted average number of ordinary shares of 651,359,884 (30 June 2024: 595,703,671) in issue during the period.\n\nDetails of share options that could potentially dilute earnings per share in future periods are disclosed in the notes to the Group's Annual Report and Financial Statements for the year ended 31 December 2024.\n\n2,000,000 options were granted during the period. The total number of options outstanding at 30 June 2025 is 67,200,000.\n\nCommitments stated in the Group's Annual Financial Statements for the year ended 31 December 2024 remain.\n\nThere have been no events after the reporting date of a material nature.\n\nThe condensed interim financial statements were approved by the Board of Directors on 3 September 2025.\n\nCertain information contained in this announcement would have been deemed inside information for the purposes of Article 7 of Regulation (EU) No 596/2014, as incorporated into UK law by the European Union (Withdrawal) Act 2018, until the release of this announcement.\n\nThis information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.",
  "medium": "Article",
  "links": [
    "https://www.accessnewswire.com/newsroom/en/metals-and-mining/empire-metals-limited-announces-interim-results-1068684",
    "https://pr.report/dus7",
    "https://pr.report/dus8",
    "https://pr.report/dus9"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "condensed interim financial statements",
      "weight": 0.059419602
    },
    {
      "name": "titanium supply",
      "weight": 0.057829365
    },
    {
      "name": "many other titanium projects",
      "weight": 0.055585943
    },
    {
      "name": "Titanium metal",
      "weight": 0.05551918
    },
    {
      "name": "titanium dioxide",
      "weight": 0.054637764
    },
    {
      "name": "Pitfield",
      "weight": 0.054532144
    },
    {
      "name": "titanium metal production",
      "weight": 0.05422795
    },
    {
      "name": "Pitfield Project",
      "weight": 0.05392528
    },
    {
      "name": "titanium sponge",
      "weight": 0.05386877
    },
    {
      "name": "Titanium",
      "weight": 0.05345461
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96875
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.7939453125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.39501953125
    },
    {
      "name": "/Business & Industrial/Manufacturing/Other",
      "score": 0.33544921875
    }
  ],
  "sentiment": {
    "positive": 0.8777994,
    "negative": 0.019640883,
    "neutral": 0.10255974
  },
  "summary": "Empire Metals Limited, the UK-based resource exploration and development company, has announced its interim results for the six-month period ended 30 June 2025, with its flagship project, Pitfield, confirmed as the world's most significant new titanium discovery. The company believes that the project, located in Western Australia, can be one of the world’s leading titanium projects capable of supplying high-value sectors such as aerospace and defence for decades. The largest drilling campaign launched at the Thomas Prospect identified a large high-grade near-surface core averaging 6% TiO₂ over a continuous 3.6km strike. Process development work has confirmed that Pitfield's ore is ideal suited to conventional mineral separation and refining, differentiating it from other projects that typically face lower recoveries, higher costs, and significant environmental challenges. The Project is also located in a Tier-class mining jurisdiction, with a stable mining workforce and a highly skilled workforce. Shaun Bunn, Managing Director, is confident that Empire can bring this once-in-a-lifetime discovery to commercial fruition in an expedient manner. The Company's share price has also risen over 500% since the start of the year.",
  "shortSummary": "Empire Metals Limited reports significant progress at its flagship Pitfield project, emphasizing its exceptional quality, consistency, and potential for significant mining and engineering projects.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "722e98aada7b4484a078a02dae3d9f06",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://pr.report/dus7",
      "text": "About us\nEmpire Metals is an AIM and OTC-traded exploration & resource development company.\nOur primary focus is on developing Pitfield, an emerging giant titanium project in Western Australia.\nOur primary focus is on developing Pitfield, an emerging giant titanium project in Western Australia.\nThe company has additional highly prospective copper and gold exploration assets in Australia and Austria.\nMost titanium dioxide (TiO₂) goes into the pigment industry, where high grade feedstocks are in short supply. The overall titanium market is growing at 3.7% pa. Titanium metal specifically is highly sought after due to its high strength to weight ratio and its demand is expected to outpace GDP growth."
    },
    {
      "url": "https://pr.report/dus9",
      "text": "Benefits of using RNS\nRNS can help you meet your financial communications needs. RNS is both a regulatory and financial communications channel for companies to communicate with the professional investor.\nCreating an effective investor relations strategy is an increasingly complicated challenge. You need to fulfil domestic and international regulatory obligations, communicate with shareholders, analysts and institutional investors, at the same time explaining your company news to the markets.\nRNS is the UK’s leading service for regulatory news announcements. The provider of choice for companies traded on the London Stock Exchange, RNS helps companies and their intermediaries fulfil their UK and other global regulatory disclosure obligations in the most efficient way possible.\nApproaching 350,000 announcements are processed by RNS each year, with over 75% of all regulatory and potentially price-sensitive UK company announcements originating from RNS. Clients include the vast majority of Britain's leading benchmark companies as well as all the leading financial public relations firms and corporate advisers.\nRNS is widely recognised by the investment community for its stable and secure web-based input system, industry knowledge, product flexibility and 24 x 7 support structure. RNS is proud of its track record of service excellence, reliability and commitment to continuous improvement.\nReleasing announcements through RNS ensures company information is distributed immediately and accurately in full text and in industry-leading formats. Announcements are visible on over 2 million market professional terminals, databases and financial websites across the world, including key vendor services such as Refinitiv, Bloomberg, Dow Jones as well as the LSE's own corporate website.\nRegulatory Announcement Distribution Services\nGiving you the power to fulfil your home market and international obligations with a single partner.\nReach & other media services\nInvestors expect corporate communications to go beyond mere regulatory requirements. Shareholders, analysts and institutional investors want to receive company news via the desktop tools and financial media that they use every day. Increasingly, this is what regulatory authorities in the UK, Europe and the US are recommending to ensure broad and fair disclosure throughout the international capital markets.\nRNS has the tools that enable you to adapt your regulatory announcements into best practice communications to shareholders and potential investors – wherever they are:\n- Simultaneously target institutional investors and analysts in the UK, Europe and the US\n- Tailor communications to the needs and communication channels of each financial market\n- Use the information news services for direct distribution to desktops of institutional investors\n- Disclose company news to trade publications, online databases, research tools and the Internet.\nIn addition to the many regulatory disclosure services available, RNS also offers customers these media distribution services as standard, with other more bespoke distribution channels possible on request:\n- Reach\n- UK Financial Media\n- European Financial Media\n- Nordic Newswires\n- Canadian Media\n- US Financial Wire\n- Japanese Wires\nReach\nReach is an investor communication service aimed at assisting listed and unlisted companies to deliver non-regulatory news such as marketing messages, corporate and product information. It is based on the existing RNS UK-Regulatory service and has the same levels of efficiency, control and broad dissemination.\nReach also enables unlisted and foreign-listed companies to deliver their news to a professional UK financial audience. Announcements are released automatically on the London Stock Exchange corporate website (“Market News” section) as well as other data vendors such as Bloomberg, Thomson Reuters (Refinitiv) and Dow Jones terminals.\nOther vendors subscribing for Reach announcements will receive announcements sent through this channel but may choose not to display for editorial reasons.\nWhat type of announcements can appear on Reach?\n- Intention to Float – on AIM (main market is Regulatory)\n- Launch of new website/product/services\n- New production/distribution/retail agreements\n- New contracts/orders/ventures\n- Financial results/accounts (for non-listed companies)\n- Management Appointments\n- Financing/investment arrangements\n- Company presentations/events\nSee examples of announcements published by Reach\nEuropean Communication Services\nThe European communication services enable you to broaden your investor base and meet best practice guidance in Europe. Simply executed alongside ad hoc regulatory disclosures, you can communicate in English or in other languages, using our translation services.\nDirect distribution and financial media\nDistribution in English to the specialist information services used in each country by financial professionals and the financial media, including on-line databases.\nTrade press\nDistribution of news to trade and specialist press with the circulation list tailored to your specific requirements.\nSecure PDF service\nThe Secure PDF document distribution service allows you to provide access to documents that include graphs and other visual aids alongside your RNS announcements, ensuring that analysts and investors get the full picture – and give you the attention that you deserve.\nWhy use the Secure PDF service?\nThe service can now assist issuers with Prospectus Rules requirements by enabling the publication of prospectuses on the London Stock Exchange website.\n- Enrich your linear textual announcements and explain complex issues with deeper, more meaningful communication.\n- Save time by allowing RNS to release your PDF simultaneously with your annual results presentation.\n- Disclose a PDF alongside your doc re: announcements and provide investors with the full picture.\n- Use the PDF to provide graphical directions to where your annual results presentation will be held.\nUS communication services\nThe US communication services enable you to broaden your investor base and meet best practice guidance in the US. Simply executed alongside SEC (EDGAR) filings, these services meet SEC guidance on public disclosure.\nDirect distribution\nThe US communication services enable you to broaden your investor base and meet best practice guidance in the US. Simply executed alongside SEC (EDGAR) filings, these services meet SEC guidance on public disclosure.\n- US Financial Wire - Distribution to the US best practice disclosure points and key financial media.\n- Pan-US Wire - Distribution to the financial media and over 250 online services and databases throughout the US (includes US Financial Wire).\nTrade press\n- Distribution of news to trade and specialist press with the circulation list tailored to your specific requirements.\n- Please contact the RNS team to discuss your requirements.\nContact the RNS team\nRNS prides itself on, and is highly regarded for, its customer service excellence. Instant editorial and technical assistance is available across a 24-hour support structure, with onsite support commencing at 21:30 hours UK time each Sunday through to 20:30 hours UK time each Friday (barring UK bank holidays)\nEscalation is available via the normal helpdesk outside of these core hours.\nCustomer support & New Business Enquiries : +44 (0) 20 7797 4400\nEmail: rns@lseg.com\nRNS Pricing - For Data Vendors\nPlease find below documents relating to the distribution of RNS information by data vendors and its use by end consumers."
    },
    {
      "url": "https://pr.report/dus8",
      "text": "About us\nEmpire Metals is an AIM and OTC-traded exploration & resource development company.\nOur primary focus is on developing Pitfield, an emerging giant titanium project in Western Australia.\nOur primary focus is on developing Pitfield, an emerging giant titanium project in Western Australia.\nThe company has additional highly prospective copper and gold exploration assets in Australia and Austria.\nMost titanium dioxide (TiO₂) goes into the pigment industry, where high grade feedstocks are in short supply. The overall titanium market is growing at 3.7% pa. Titanium metal specifically is highly sought after due to its high strength to weight ratio and its demand is expected to outpace GDP growth."
    }
  ],
  "argos_summary": "Empire Metals Limited reports strong progress on its Western Australian Pitfield titanium project, with drilling delivering a high‑grade, high‑purity resource and the company nearing its maiden Mineral Resource Estimate. The company has raised £4.5 million in equity, seen its share price jump over 500 % year‑to‑date, and is expanding its technical team to accelerate feasibility studies. Empire’s focus on titanium sponge for defence and aerospace markets positions it as a potential secure supply source amid U.S. and EU dependence on imports. Trading has moved to the OTCQX, broadening U.S. investor access.",
  "argos_id": "1PD0QUPD3"
}