{
  "url": "https://www.usatoday.com/story/sports/tennis/2025/09/04/osaka-vs-anisimova-tv-time-results-updates/85968384007/",
  "authorsByline": "Elizabeth Flores",
  "articleId": "a046143e8bfd4e18a6506cdeb99f4ddb",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/09/04/USAT/85968385007-usatsi-26994991-168402560-lowres.jpg?crop=2268,1276,x0,y42&width=2268&height=1276&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T19:30:56+00:00",
  "addDate": "2025-09-04T19:36:44.526915+00:00",
  "refreshDate": "2025-09-04T19:36:44.526917+00:00",
  "score": 1.0,
  "title": "Naomi Osaka vs. Amanda Anisimova: How to watch US Open women's semifinal match",
  "description": "The U.S. Open continues with a must-see women's singles semifinal matchup between No. 23 seed Naomi Osaka and No. 8 seed Amanda Anisimova.",
  "content": "The 2025 U.S. Open heads into the women's singles semifinals with two crucial matches taking center stage at Arthur Ashe Stadium on Thursday.\n\nIn a match that lasted just 57 minutes, No. 8 seed Amanda Anisimova pulled off an upset, defeating No. 2 seed Iga Swiatek, 6-4, 6-3 in the quarterfinals. This victory comes six months after Anisimova lost to Swiatek in the Wimbledon final, and it marks her advancement to her third major semifinal.\n\nAnisimova is set to compete against No. 23 seed Naomi Osaka in the semifinals at Flushing Meadows. Osaka secured her place by defeating No. 11 seed Karolina Muchova, 6-4, 7-6 (3) in the quarterfinals. This marks Osaka's first semifinal appearance since she won the title in 2020.\n\nHere is how to watch the must-see match between Amanda Anisimova and Naomi Osaka on Thursday.\n\nHow to watch Naomi Osaka vs. Amanda Anisimova\n\nNo. 23 seed Naomi Osaka will face off against No. 8 seed Amanda Anisimova in the U.S. Open women's semifinal match on Thursday.\n\nHow to watch 2025 US Open: Dates, TV, streaming",
  "medium": "Article",
  "links": [
    "https://www.fubo.tv/stream/tv/?irad=343747&irmp=1205322&subId1=USAT&subId2=Tennis&subId3=2025",
    "https://www.usatoday.com/story/sports/tennis/open/2025/09/03/amanda-anisimova-iga-swiatek-results-tv-streaming/85952046007/",
    "https://www.usatoday.com/story/sports/tennis/wimb/2025/07/12/shortest-womens-finals-wimbledon-iga-swiatek-amanda-anisimova/84829887007/",
    "https://www.usatoday.com/story/sports/tennis/2025/09/02/us-open-2025-bracket-results-quarterfinal-schedule-tv/85930826007/",
    "https://www.usatoday.com/picture-gallery/sports/tennis/open/2025/08/24/us-open-2025-top-photos-from-the-years-final-tennis-grand-slam/85810493007/",
    "https://www.usatoday.com/story/shopping/2025/09/03/wilsons-us-open-tennis-apparel-how-to-buy-players-gear/85946228007/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Amanda Anisimova",
      "weight": 0.1332093
    },
    {
      "name": "Naomi Osaka",
      "weight": 0.12253297
    },
    {
      "name": "No. 8 seed Amanda Anisimova",
      "weight": 0.11869602
    },
    {
      "name": "No. 23 seed Naomi Osaka",
      "weight": 0.115363054
    },
    {
      "name": "Anisimova",
      "weight": 0.111279406
    },
    {
      "name": "US Open",
      "weight": 0.10775929
    },
    {
      "name": "U.S. Open",
      "weight": 0.10529523
    },
    {
      "name": "No. 2 seed Iga Swiatek",
      "weight": 0.104184665
    },
    {
      "name": "US Open womens semifinal match",
      "weight": 0.1026225
    },
    {
      "name": "No. 11 seed Karolina Muchova",
      "weight": 0.100882806
    }
  ],
  "topics": [
    {
      "name": "Tennis"
    },
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.994140625
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.94921875
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.36669921875
    }
  ],
  "sentiment": {
    "positive": 0.25184822,
    "negative": 0.11430949,
    "neutral": 0.63384235
  },
  "summary": "The 2025 U.S. Open is set to take place in the women's singles semifinals, with No. 8 seed Amanda Anisimova defeating No. 2 seed Iga Swiatek in a match that lasted 57 minutes. This victory marks Anisimmova's third major semifinal. No. 23 seed Naomi Osaka secured her place by defeating No.-11 seed Karolina Muchova in the quarterfinals. The match will be televised.",
  "shortSummary": "The 2025 US Open will see a notable match between No. 8 seed Amanda Anisimova and No. 23 seed Naomi Osaka, following their recent victories.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1263f099d2894e89899855e4534d637f",
  "places": [
    {
      "osmId": "284859611",
      "road": "Roosevelt Avenue",
      "suburb": "Queens",
      "city": "New York",
      "state": "New York",
      "postcode": "11368",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.74989615,
        "lon": -73.84704281162813
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/tennis/open/2025/09/03/amanda-anisimova-iga-swiatek-results-tv-streaming/85952046007/",
      "text": "2025 US Open results: Amanda Anismova takes down Iga Swiatek in back-to-back sets\nNEW YORK – Iga Swiatek knew that it wouldn't be an easy matchup this time around against Amanda Anisimova.\nThe last time these two met was at the Wimbledon finals in July, where it took Swiatek just 57 minutes to beat Anisimova 6-0, 6-0 for her sixth Grand Slam title.\nThat double bagel in a Grand Slam women's singles final was a rarity and the first since the 1988 French Open, when Steffi Graf beat Natasha Zvereva in just 32 minutes.\nBut the results were much different this time, as Anisimova exacted revenge from that thumping to upset the No. 2 seed Swiatek and 2022 US Open champion, with a 6-4, 6-3 quarterfinal win at Arthur Ashe Stadium.\nAnisimova, the No. 8 seed, certainly got off to a better start in the US Open quarterfinals, finally securing her first point in the two matchups in the first set's second game, and used her forehand effectively to keep Swiatek on the run. She also played a much cleaner first set than at Wimbledon, when she had three double faults and 12 unforced errors. She cut the errors in half and broke Swiatek, taking the first set when her forehand return went wide, leading to loud applause from the sellout crowd.\nAnisimova, one of two Americans left in the singles draw, will face the winner of Naomi Osaka and Karolína Muchová on Thursday night for a spot in the finals.\n\"The first day I got here, I was like, okay, let's try to make it through one round. This has been such a dream,\" Anisimova said after the match. \"To come back from Wimbledon like that, is really special to me. I feel like I worked so hard so try to turn around from that. And today proved everything for me. I can do it, so this is really special.\"\nIt has been quite a turnaround for the 24-year-old Anisimova, who took a hiatus from the sport in 2023 and returned to Wimbledon the following year, ranked 189th in the world. But after making the Wimbledon finals, while beating No. 1-ranked Aryna Sabalenka in the semifinals of that Grand Slam, she will rise to a career-high No. 5 in the next WTA rankings following her victory over Swiatek.\nAnisimova dominates second set\nIga Swiatek goes down!\nAfter a humiliating defeat their last time on the court together, American Anisimova has overcome her previous demons, taking down the U.S. Open's No. 2 seed in back-to-back sets: 6-4, 6-3.\nThe second set was partciularly impressive. After Swiatek took the first two games, Anisimova won six of the next seven to emerge victorious. Anisimova's win advances her to the semifinals, where she'll play the winner of Naomi Osaka and Karolina Muchova.\nSwiatek's 2-0 lead ousted quickly in second set\nWith her back against the wall, the tournament's No. 2 seed Swiatek came out swinging to stay alive, winning each of the first two games against Anisimova in the second set.\nAmericans were glad to see Anisimova bounce back though, winning the third and fourth games without much of a sweat to tie things back up.\nThe longer this match goes, the more opportunities Swiatek will have to take advantage of her opponent's mistakes. So, Anisimova's best chance to win may be right now.\nAnisimova wins first set\nAfter failing to win a single game in their last matchup, Anisimova proved that she was out for blood in the first set. Though it was back and forth at first, with each player tied at four games apiece to start, Anisimova won each of the final two games, coming back to do so in both, and win 6-4.\nAnisimova needs just one more set now to avenge her previous loss.\nSwiatek wins first game, Anisimova breaks streak right after\nWell, Anisimova will have to wait to break her 13-game loss streak to Swiatek. It was back-and-forth to start, with both players reaching 30-30 to begin the match, but Swiatek would eventually pull it out.\nThankfully, Anisimova would retaliate immediately, dominating the next game, going up 40-0 before Swiatek would win a single rally. Anisimova would win the game on her third break point opportunity.\nWhen is Amanda Anisimova vs. Iga Swiatek match?\nNo. 8 seed Amanda Anisimova will play No. 2 seed Iga Swiatek in a women's quarterfinal on Wednesday. The match at Arthur Ashe Stadium will start after the completion of the men's quarterfinal between No. 8 Alex de Minaur and No. 25 Felix Auger-Aliassime.\n“At this stage of the game you're going to play a really tough opponent, regardless,\" Anisimova said after defeating Beatriz Haddad Maia on Monday. \"So, to be able to have a rematch, to face her again and give myself another chance, I'm really, really happy about that.\"\nHow to watch Amanda Anisimova vs. Iga Swiatek\n- When: Approximately 3:10 p.m. ET\n- Where: USTA Billie Jean King National Tennis Center (Flushing Meadows, New York)\n- TV: ESPN, Tennis Channel\n- Streaming: ESPN+, Fubo\nAmanda Anisimova vs. Iga Swiatek head-to-head record\nAmanda Anisimova and Iga Swiatek have only met once in their professional careers.\nSwiatek blanked Anisimova 6-0, 6-0 in this year's Wimbledon final.\nWatch Anisimova vs. Swiatek live on Fubo"
    },
    {
      "url": "https://www.usatoday.com/story/shopping/2025/09/03/wilsons-us-open-tennis-apparel-how-to-buy-players-gear/85946228007/",
      "text": "Wilson U.S. Open collection allows you to dress like your favorite pros\nWilson has long been one of the most famous and well-respected brands in tennis.\nRoger Federer, Jimmy Connors, Chris Evert, Pete Sampras and many more legends of the game used a Wilson racquet throughout their careers.\nIn the upcoming semifinals of the 2025 U.S. Open, we already have at least two players who use Wilson racquets in 25-time major champion Novak Djokovic and World No. 1 Aryna Sabalenka.\nHowever, Wilson is also very well known for their tennis apparel, and the new U.S. Open collection is no different.\nIf you've been watching the tournament, you probably have been seeing the bright reds, sharp whites and other Wilson clothing on many of the athletes.\nCheck out the collection below, including the men's and women's lines.\nWilson tennis Women's Collection\nSee more Wilson tennis Women's Collection\nWilson tennis Men's Collection\nSee more Wilson tennis Men's Collection\nU.S. Open tennis tickets\nThere are only a few days left to see the pros in action at the final major of the year. Get your tickets today to watch the semifinals in both the men's and the women's singles and doubles tournaments."
    },
    {
      "url": "https://www.usatoday.com/story/sports/tennis/wimb/2025/07/12/shortest-womens-finals-wimbledon-iga-swiatek-amanda-anisimova/84829887007/",
      "text": "Shortest women's Wimbledon finals: Iga Swiatek beats Amanda Anisimova in 57 minutes\nThere was not a more dominant player in the Wimbledon women's singles side of the bracket than Iga Swiatek, and she's a champion for it.\nSwiatek, the No. 4 player in the world, shut out American Amanda Anisimova in straight sets 6-0, 6-0 in the women's singles finals at the 2025 Wimbledon Championship on July 12. It was her sixth straight-sets victory at the All England Lawn Tennis & Croquet Club in the last two weeks.\nSwiatek's big day on the grass court surface turned out to be a historic one for the Polish women's tennis player, who took social media by storm this past week with her favorite meal: strawberries and pasta. The 24-year-old, who has now won six Grand Slam majors, won her first Wimbledon title in timely record fashion: seventh-fastest of the Open era, at 57 minutes.\nThat wasn't the only history made by Swiatek. Her double bagel win over Anisimova also marked just the second ever such score for a women's singles final at Wimbledon — and the first since 1911. It was also the first double bagel in a Grand Slam women's singles final since the 1988 French Open.\nAs noted by ESPN, Swiatek became just the eighth woman tennis player, and the only active WTA player, to win major titles on all three surfaces. She won her first Grand Slam major title on the clay court surface at the French Open in 2020, while winning her first title on the hard court surface at the US Open in 2022.\nHere's what you need to know on Swiatek's Wimbledon championship:\nHow fast was 2025 Wimbledon women's singles final?\nSwiatek needed just 57 minutes to beat Anisimova in the women's singles finals at the 2025 Wimbledon Championships for her first Wimbledon title.\n\"Honestly, I didn't even dream (of this) because for me it was just way too far,\" Swiatek said post-match on the court of winning Wimbledon. \"I feel like I'm already an experienced player, after winning Slams before, but I never really expected this one.\"\nWhat is the shortest women's singles final at Wimbledon?\nAccording to the Wimbledon website, the shortest match time in the women's singles final at Wimbledon is 23 minutes long, which happened back in 1992 when Suzanne Lenglen of France defeated the American player Molla Bjurstedt Mallory in straight sets, 6-2, 6-0.\nShortest women's singles finals at Wimbledon\nThe 57 minutes it took Swiatek to defeat Anisimova is tied for the 19th-fastest time in Wimbledon finals history and seventh-fastest of the Open era. Here's a look at where Swiatek's time of 57 minutes in the 2025 Wimbledon women's singles final stacks up with other women's singles finals at Wimbledon, per the Wimbledon website:\n- 1. Suzanne Lenglen (FRA) defeats Molla Bjurstedt Mallory (USA) in 23 minutes (1992)\n- T-2. Dorothea Lambert Chambers (BRI) defeats Penelope Dora Harvey Boothby (BRI) in 25 minutes (1911)\n- T-2. Suzanne Lenglen (FRA) defeats Joan Craddock Fry (GBR) in 25 minutes (1925)\n- 4. Alice Marble (USA) defeats Kay Stammers (GBR) in 30 minutes (1939)\n- 5. Doris Hart (USA) defeats Shirley Fry (USA) 4 in 35 minutes (1951)\n- 6. Billie Jean King (USA) defeats Evonne Goolagong Cawley (AUS) in 38 minutes (1975)\n- 7. Maria Bueno (BRA) defeats Darlene R. Hard (USA) in 43 minutes (1959)\n- T-8. Helen Wills Moody (USA) defeats Helen Hull Jacobs (USA) in 50 minutes (1932)\n- T-8. Maureen Connolly (USA) defeats Louise Brough (USA) in 50 minutes (1954)\n- T-8. Shirley Fry (USA) defeats Angela Buxton (GBR) in 50 minutes (1956)\n- T-8. Althea Gibson (USA) defeats Darlene R. Hard (USA) in 50 minutes (1957)\n- T-8. Billie Jean King (USA) defeats Evonne Goolagong Cawley (AUS) in 50 minutes (1972)\n- 13. Margaret Smith (AUS) defeats Billie Jean King (USA) in 51 minutes (1963)\n- 14. Billie Jean King (USA) defeats C. Evert (USA) in 53 minutes (1973)\n- 15. Martina Navratilova (USA) defeats Andrea Jaeger (USA) in 54 minutes (1983)\n- 16. Petra Kvitova (CZE) defeats Eugenie Bouchard (CAN) in 55 minutes (2014)\n- T-17. Margaret Smith (AUS) defeats Maria Bueno (BRA) in 56 minutes (1965)\n- T-17. Simona Halep (ROU) defeats Serena Williams (USA) in 56 minutes (2019)\n- T-19. Dorothea Katherine Douglass defeats May Godfrey Sutton in 57 minutes (1906)\n- T-19. Karen Susman (USA) defeats Vera Sukova (TCH) in 57 minutes (1962)\n- T-19. Iga Swiatek (POL) defeats Amanda Anisimova in 57 minutes (2025)"
    },
    {
      "url": "https://www.usatoday.com/story/sports/tennis/2025/09/02/us-open-2025-bracket-results-quarterfinal-schedule-tv/85930826007/",
      "text": "2025 US Open bracket: Results, quarterfinal schedule, how to watch matches\nThe 2025 US Open Round of 16 featured an exciting match between No. 23 seed Naomi Osaka and No. 3 seed Coco Gauff that had Arthur Ashe Stadium buzzing with excitement.\nOsaka, who described herself as \"locked in,\" played flawlessly to defeat Gauff 6-3, 6-2, securing her place in the women’s singles quarterfinals. Osaka, a two-time US Open champion, will be back in action on Wednesday. In addition, the fourth round also saw No. 2 seed Iga Swiatek advance to the quarterfinals after a dominant 6-3, 6-1 victory against No. 13 seed Ekaterina Alexandrova.\nIn the men’s bracket, the quarterfinals are shaping up to be a thrilling spectacle. No. 25 seed Felix Auger-Aliassime's defeated No. 15 seed Andrey Rublev in a gripping 7-5, 6-3, match, while No. 8 seed Alex de Minaur cruised to a 6-3, 6-2, 6-1 victory over Leandro Riedi.\nThe men's and women's singles quarterfinals are set to begin on Tuesday Sept. 2 and feature some of the world's top players.\nThe action kicks off with American No. 4 seed Jessica Pegula in Arthur Ashe Stadium, followed by No. 2 seed Carlos Alcaraz. The night session features reigning women's champion and No. 1 seed Aryna Sabalenka, before one of the biggest matches of the tournament: No. 4 seed Taylor Fritz, last year's runner-up, vs. No. 7 seed and four-time US Open champion Novak Djokovic.\nAs the US Open progresses into the quarterfinals, here's the updated bracket.\n2025 US Open scores, schedule\nAll times Eastern\nTuesday, September 2\nMen's singles quarterfinals\n- No. 2 Carlos Alcaraz defeated No. 20 Jiri Lehecka, 6-4 6-2, 6-4\n- No. 7 Novak Djokovic defeated No. 4 Taylor Fritz, 6-3, 7-5, 3-6, 6-4\nWomen's singles quarterfinals\n- No. 4 Jessica Pegula defeated Barbora Krejcikova, 6-3, 6-3\n- No. 1 Aryna Sabalenka defeated Marketa Vondrousova, injury walkover\nWednesday, September 3\nMen's singles quarterfinals\n- No. 25 Felix Auger-Aliassime defeated No. 8 seed Alex de Minaur, 4-6, 7-6 (9-7), 7-5, 7-6 (7-4)\n- No. 1 Jannik Sinner defeated No. 10 Lorenzo Musetti, 6-1, 6-4, 6-2\nWomen's singles quarterfinals\n- No. 8 Amanda Anisimova defeated No. 2 Iga Swiatek, 6-4, 6-3\n- No. 23 Naomi Osaka defeated No. 11 Karolina Muchova, 6-4, 7-6 (7-3)\nMonday, September 1\nMen's singles – Fourth round\n- No. 25 Felix Auger-Aliassime defeated No. 15 Andrey Rublev, 7-5, 6-3, 6-4\n- No. 8 Alexi De Minaur defeated Leandro Riedi, 6-3, 6-2, 6-1\n- No. 10 Lorenzo Musetti defeated Jaume Munar, 6-3, 6-0, 6-1\n- No. 1 Jannik Sinner defeated No. 23 Alexander Bublik, 6-1, 6-1, 6-1\nWomen's singles – Fourth round\n- No. 23 Naomi Osaka defeated No. 3 Coco Gauff, 6-3, 6-2\n- No. 2 Iga Swiatek defeated No. 13 Ekaterina Alexandrova, 6-3, 6-1\n- No. 11 Karolina Muchova defeated No. 27 Marta Kostyuk, 6-3, 6-7 (0-7), 6-3\n- No. 8 Amanda Anisimova defeated No. 18 Beatriz Haddad Maia, 6-0, 6-3\nWatch the 2025 US Open on Fubo (free trial)\nHow to watch 2025 US Open: Dates, TV, streaming\n- Dates: Sunday, Aug. 24-Sunday, Sept. 7\n- Location: USTA Billie Jean King National Tennis Center (New York)\n- TV channels: ABC, ESPN, ESPN2, ESPN Deportes (Spanish language)\n- Streaming: ESPN+ and Fubo (free trial)"
    }
  ],
  "argos_summary": "The 2025 U.S. Open women's semifinal will feature No. 23 seed Naomi Osaka against No. 8 seed Amanda Anisimova at Arthur Ashe Stadium on Thursday. Anisimova upset No. 2 seed Iga Swiatek in the quarterfinals, while Osaka defeated No. 11 seed Karolina Muchova. The match is scheduled for Thursday night and will be broadcast on ESPN, Tennis Channel, and streamed via ESPN+ and Fubo.",
  "argos_id": "2VVR42COQ"
}