{
  "url": "https://www.yahoo.com/entertainment/celebrity/articles/supernanny-jo-frost-bachelor-alum-203945395.html?_guc_consent_skip=1757019083",
  "authorsByline": "Kayla Aldecoa",
  "articleId": "c422071f13c648a49d069979a5bd7533",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/tn6xZDKZ2T7GzVT3SgUdAg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/national_enquirer_328/f0ae4c79885e3311a310cd42ff26422e",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T20:39:45+00:00",
  "addDate": "2025-09-04T20:54:09.552912+00:00",
  "refreshDate": "2025-09-04T20:54:09.552914+00:00",
  "score": 1.0,
  "title": "‘Supernanny’ Jo Frost on ‘Bachelor’ Alum Madi Prewett’s Plan to ‘Spank’ Her Daughter: ‘Should Be Banned’",
  "description": "Supernanny Jo Frost has entered the chat! The reality star shared her reaction to Bachelor alum Madison Prewett and husband Grant Troutt admitting they plan to spank their 6-month-old daughter. “It holds no benefit for the relationship of the child or for the parent,” Frost, 55, told E! News. “We have laws where it is […]",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nSupernanny Jo Frost has entered the chat! The reality star shared her reaction to Bachelor alum Madison Prewett and husband Grant Troutt admitting they plan to spank their 6-month-old daughter.\n\n“It holds no benefit for the relationship of the child or for the parent,” Frost, 55, told E! News. “We have laws where it is a criminal offense to commit grievous bodily harm or to hit another adult, and to think that we can just bypass that with our youngest, most vulnerable citizens? They are human beings, too.”\n\nAccording to Frost, spanking demonstrates a “lack of control” and “emotional regulation” in the parent.\n\n“If we’re going to protect every human being, then we do so for children as well because they are citizens of this country,” she continued, adding that she believes “smacking should be banned in this country.”\n\nFrost’s comments come after the Bachelor Nation star, 29, was hit with a wave of backlash for her stance on disciplining her children.\n\n“It will be hilarious when we start spanking hosanna. Which we will, on the record,” Troutt, 29, shared in a July episode of their “Stay True” podcast. “Because the Bible so clearly says, ‘Folly is bound up in a child.’”\n\nPrewett clarified that the Bible specifically mentions the use of a “rod,” disagreeing with people who say “you can discipline [children] with time outs.”\n\n“There are consequences to disobedience,” she added.\n\nFrost strongly disagreed, saying, “Corporal punishment should be banned.”\n\n“Children that receive that corporal punishment are those that have visible and invisible disabilities,” the famous nanny added.\n\nListeners seemed to side with Frost’s stance as many called the couple’s views “so upsetting.”\n\n“Hilarious is a wild word with this context,” one follower commented.\n\n“‘The rod’ means to keep them in line like a shepherd would do with their sheep. Not physically beat them with a rod.. ?? A CHILD??” another added.\n\n“The Bible also specifically says to give away all of your wealth… so why aren’t they taking that literal?” a third wrote.",
  "medium": "Article",
  "links": [
    "https://www.eonline.com/news/1421991/supernannys-jo-frost-on-madison-prewett-spanking-kids",
    "https://www.youtube.com/watch?v=q0oxb_5IC2Q"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jo Frost",
      "weight": 0.089903995
    },
    {
      "name": "Supernanny Jo Frost",
      "weight": 0.089258984
    },
    {
      "name": "Frost",
      "weight": 0.08400218
    },
    {
      "name": "Children",
      "weight": 0.08262059
    },
    {
      "name": "children",
      "weight": 0.08262059
    },
    {
      "name": "Bachelor alum Madison Prewett",
      "weight": 0.077838615
    },
    {
      "name": "Bachelor Nation",
      "weight": 0.0665558
    },
    {
      "name": "husband Grant Troutt",
      "weight": 0.06486057
    },
    {
      "name": "Madison Prewett",
      "weight": 0.06334331
    },
    {
      "name": "Corporal punishment",
      "weight": 0.06287656
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9873046875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.96875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.86767578125
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.56787109375
    },
    {
      "name": "/People & Society/Family & Relationships/Troubled Relationships",
      "score": 0.325439453125
    }
  ],
  "sentiment": {
    "positive": 0.06439752,
    "negative": 0.699816,
    "neutral": 0.23578651
  },
  "summary": "Reality star, 'Supernanny' Jo Frost, has commented on the controversy surrounding the plans to spank her 6-month-old daughter by Bachelor alum Madison Prewett and husband Grant Troutt, stating that spanking demonstrates a lack of control and emotional regulation in a parent. She believes that such behavior should be banned in the US, citing laws that make it a criminal offence to commit grievous bodily harm or to hit another adult as a reason for such behavior. The comments come after Prawett was hit with backlash for her stance on disciplining her children, arguing that the Bible clearly mentions the use of a \"rod\" for discipline.",
  "shortSummary": "Supernanny Jo Frost criticized Madi Prewett and her husband for planning to spank their daughter, advocating for a ban on corporal punishment.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7b5417c839024a70985f2632ade22ea0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.eonline.com/news/1421991/supernannys-jo-frost-on-madison-prewett-spanking-kids",
      "text": "Jo Frost does not agree with Madison Prewett's views on spanking as a form of child discipline.\nIn fact, the former Supernanny star believes it's an \"outdated practice.\"\n\"It holds no benefit for the relationship of the child or for the parent,\" Jo exclusively told E! News' Francesca Amiker. \"We have laws where it is a criminal offense to commit grievous bodily harm or to hit another adult, and to think that we can just bypass that with our youngest, most vulnerable citizens? They are human beings, too.\"\nThe 55-year-old continued, \"If we're going to protect every human being, then we do so for children as well because they are citizens of this country.\"\nAnd for Jo, she thinks spanking \"shows a lack of control\" and \"a lack of emotional regulation\" on the parent's part, adding, \"Smacking should be banned in this country.\"\nIn recent years, studies have advised against physical punishment for child discipline, including the National Library of Medicine’s research finding spanking “harmful” and “ineffective.”\nHowever, according to Madison and her husband Grant Troutt, they plan on spanking their 6-month-old daughter Hosanna when she's older for a more religious reason.\n\"Because the Bible so clearly says, 'Folly is bound up in a child,'\" Grant shared in a July episode of Madison's Stay True podcast, paraphrasing Proverbs 22:15, \"'but discipline drives it far away.'\"\nMadison agreed and emphasized that the Bible specifically mentions \"'with a rod,'” though she clarified that she’ll discipline her daughter in a \"really loving way.\"\n“Like, ‘Hey sweetheart, do you know why you’re being disciplined? Mommy does not want to discipline you. Mommy does not enjoy having to spank you,’\" the Bachelor Nation star explained. \"But there are consequences to disobedience.”\nSo, what can parents do to discipline their children without any physical harm? For Jo, who has partnered with FARE (Food Allergy Research & Education) to advocate for kids with life-threatening allergies, it's important to show \"emotional intelligence\" and \"energetically connect with your child\" through communication.\n\"Corporal punishment should be banned,\" she said. \"Children that receive that corporal punishment are those that have visible and invisible disabilities.\""
    }
  ],
  "argos_summary": "Supernanny Jo Frost criticized Bachelor alum Madison Prewett and her husband for planning to spank their 6‑month‑old daughter, calling the practice harmful and advocating a ban on corporal punishment. Frost argued that spanking shows a lack of parental control and emotional regulation, and that children are protected citizens under the law. She emphasized the need for non‑violent discipline and emotional intelligence in parenting.",
  "argos_id": "2XK1ETQ3U"
}