{
  "url": "https://www.pymnts.com/artificial-intelligence-2/2025/ants-antom-debuts-agentic-payment-solution/",
  "authorsByline": "PYMNTS",
  "articleId": "a98f283d60a14d04a986d08fe6f91a98",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/09/Antom-agentic-payment.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T13:20:41+00:00",
  "addDate": "2025-09-04T13:32:02.834332+00:00",
  "refreshDate": "2025-09-04T13:32:02.834335+00:00",
  "score": 1.0,
  "title": "Ant’s Antom Debuts Agentic Payment Solution",
  "description": "Ant International-owned merchant payment and digitization services provider Antom has launched its agentic payment solution. The new",
  "content": "Ant International-owned merchant payment and digitization services provider Antom has launched its agentic payment solution.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe new offering, announced Thursday (Sept. 4), features what the company calls a “first-of-its-kind” secure alternative payment method (APM) checkout solution, and makes Antom among the first Visa and Mastercard partners to pilot card-based transaction capabilities for artificial intelligence (AI) agents.\n\n“In a commercial setting, one of the most critical capabilities for AI agents is to complete payments flexibly and reliably to meet user expectations,” the company said in a news release.\n\n“Antom’s agentic payment solution is expected to meet this need with broad payment method coverage, offering convenient checkout through APMs and cards.”\n\nAccording to the release, the solution is built upon the Model Context Protocol (MCP) and supports embedded payment flows through “dialogue-based interactions” with AI agents, covering both confirmed purchase requests and conditional, pre-authorized transactions, such as purchases within a preset spending limit or scheduled flash sales.\n\nThe release also notes that Antom is one of the first partners to work with Mastercard via Mastercard Agent Pay and Visa through Visa Intelligent Commerce in the Asia Pacific region to explore tokenized card-based agentic payments.\n\n“They will pilot reliable and personalized agentic payments with tokenization, authentication and transaction control tools,” the company said.\n\nAs PYMNTS noted last month, the MCP is part of the new stack for intelligent commerce, with Visa and other companies using it for intelligent commerce, allowing AI agents to interact with payments and other tools to autonomously and securely carry out tasks.\n\n“The goal is to extend the trust of the Visa brand into the future of agentic commerce,” Visa Senior Vice President and Global Head of Growth Rubail Birwadker said in an interview with PYMNTS published Thursday. “An MCP layer removes friction for developers and drives standardization at scale.”\n\nVisa had just announced it was opening access to its MPC server so developers can plug AI agents directly into Visa Intelligent Commerce application programming interfaces (APIs).\n\nAfter testing MPC in-house and with partners since launching Visa Intelligent Commerce in the spring, the company now wants to “extend the edges of our network to make it even easier for agents and other companies to build on,” Birwadker said.\n\nHe added that he expects access layers like MCP to become “a relatively important tool,” as websites today or even developer docs “were not really designed with agents in mind.”",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/tag/ai-agents/",
    "https://www.mastercard.com/us/en.html",
    "https://www.pymnts.com/wp-content/uploads/2025/08/PYMNTS-The-Prompt-Economy-August-2025.pdf",
    "https://www.pymnts.com/subscribe/",
    "https://www.pymnts.com/tag/apms/",
    "https://www.pymnts.com/visa/2025/visa-powers-ai-shopping-agents-with-intelligent-commerce-payment-rails/",
    "https://tv.pymnts.com/detail/video/6378175808112/visa-gives-developers-new-tools-to-accelerate-agentic-commerce",
    "https://www.pymnts.com/mastercard/2025/mastercard-debuts-agent-pay-to-promote-agentic-commerce-future/",
    "https://www.pymnts.com/news/payments-innovation/2025/visa-gives-developers-new-tools-to-accelerate-agentic-commerce/",
    "https://www.linkedin.com/in/rubail",
    "https://www.businesswire.com/news/home/20250903092575/en/Ant-Internationals-Antom-Debuts-Agentic-Payment-Solution-Pioneering-APM-Checkout-Solution-and-Trusted-AI-for-Secure-Transactions"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Agentic Payment Solution",
      "weight": 0.09212291
    },
    {
      "name": "Visa Intelligent Commerce",
      "weight": 0.09070183
    },
    {
      "name": "payments",
      "weight": 0.086511314
    },
    {
      "name": "AI agents",
      "weight": 0.08487824
    },
    {
      "name": "broad payment method coverage",
      "weight": 0.08445436
    },
    {
      "name": "embedded payment flows",
      "weight": 0.08433249
    },
    {
      "name": "Visa Intelligent Commerce application programming interfaces",
      "weight": 0.0824105
    },
    {
      "name": "Visa",
      "weight": 0.07743682
    },
    {
      "name": "other companies",
      "weight": 0.07665525
    },
    {
      "name": "agentic commerce",
      "weight": 0.071250334
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.93505859375
    },
    {
      "name": "/Business & Industrial/Business Services/E-Commerce Services",
      "score": 0.55224609375
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.31103515625
    }
  ],
  "sentiment": {
    "positive": 0.56700146,
    "negative": 0.031522874,
    "neutral": 0.40147567
  },
  "summary": "Ant International-owned merchant payment and digitization services provider Antom has launched its agentic payment solution. The new offering features a secure alternative payment method (APM) checkout solution and makes Antom among the first Visa and Mastercard partners to pilot card-based transaction capabilities for artificial intelligence (AI) agents. The solution is built upon the Model Context Protocol (MCP) and supports embedded payment flows through “dialogue-based interactions” with AI agents. Additionally, Antom is one of the first partners to work with Mastercard via Mastercard Agent Pay and Visa through Visa Intelligent Commerce in the Asia Pacific region.",
  "shortSummary": "Antom has launched an agentic payment solution, integrating AI agents into secure APM checkout systems, and collaborating with Visa and Mastercard globally.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "827fd8f2283f4e45b1784c8af7d39e0a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/visa/2025/visa-powers-ai-shopping-agents-with-intelligent-commerce-payment-rails/",
      "text": "Unveiled Wednesday (April 30) at the company’s Global Product Drop, the Visa Intelligent Commerce program opens the network’s rails to developers building AI agents that search, recommend and now pay on behalf of consumers.\nThe stakes are considerable. Generative AI (GenAI) platforms are influencing what people buy. The missing link is a payment mechanism that is both invisible to consumers and accepted, quite literally, by merchants.\n“This is going to transform shopping and buying — we’re letting AI developers and engineers use the Visa network to allow AI agents to find, and buy, on [the consumer’s] behalf in a seamless and safe way,” Mark Nelsen, Visa’s global head of consumer products, told PYMNTS’ Karen Webster on the eve of the announcement.\nAt the center of the effort is an AI-ready card, a credential developers can spin up through a bundle of Visa application programming interfaces (APIs). As Nelsen put it: “The APIs will have an AI-ready card. In a hypothetical search for the cheapest flight to Cancún, for example, a traveler uploads an existing Visa credential, while in the background Visa authenticates the cardholder with payment passkeys, tokenizes the 16-digit number and seats the token inside the AI agent.”\nThat behind-the-scenes swap shields account data, eliminating the clunky step of keying in card numbers every time the agent hops to a new site.\nIt also takes card-on-file commerce to an entirely new, contextually powered ecosystem, allowing consumers to leave their physical and digital wallets at home.\nFive Building Blocks\nNelsen walked through an inventory of five modules that developers can cherry-pick or adopt wholesale. Modules, he said, are built on three decades of Visa’s work in using AI to fight fraud. Visa says its AI engines blocked roughly $40 billion in fraud last year. Visa Intelligent Commerce imports the same models into agent-driven transactions.\n- Authentication: Confirms the AI agent is authorized to act for a specific consumer, extending identity verification to AI commerce.\n- Tokenization: Replaces card data with network tokens that work anywhere Visa is accepted while keeping sensitive details under wraps.\n- Payment Instructions: Lets the user preset dollar limits, merchant categories or real-time approval prompts — guardrails that load directly into VisaNet.\n- Personalization: With the shopper’s consent, the module shares basic spend patterns so the agent can rank offers by preferred airline, hotel-price comfort zone or dining habits.\n- Signals: Streams transaction signals back to Visa in real time to trigger risk controls and aid dispute resolution.\nNelsen emphasized that, together, the tools aim to make AI-powered buying as routine and secure as tapping a phone at checkout.\nPersonalization Power\nBut here’s where it can get interesting and where AI agents and AI cards can simplify the complexity of shopping.\nGenAI chatbots can already present a short list of hiking boots or boutique hotels. What they can’t yet do is close the sale without punting the consumer to a checkout page. Or in the case of a complex search that asks for the most stylish hiking boots for the summer trip to Cinque Terre, and what restaurants are best to watch the sunset, there are multiple searches, steps and a big gap from information and intent to purchase. That gap, Nelsen argued, is where cart abandonment and lost revenue lurk.\n“We ask the consumer … whether they would like to share information around their spend behavior with the agent so that it knows their preferences, such as the airline you prefer and the typical amount of money that you spend on hotels. ‘Where do you like to go for dinner?’” he said. “That’s personalization.”\nOnce a shopper sets, for instance, a $500 ceiling for a hotel or an airline ticket, the AI agent scours sites, picks seats or rooms and pays, constrained by the limits embedded in the token created by the AI card.\n“[Visa] verifies your instruction,” Nelsen said, “and loads that instruction into VisaNet, and the agent will work on their behalf. … If everything matches, we’ll send the transaction to the issuing bank to be approved.”\nNelsen said that a consumer has all the security, control and protections in place that come with using their Visa card, even though it is the AI agent that is “making” the transaction.\nThe same tokenization that reassures consumers also signals to merchants that the purchase request is legitimate, not a bot fraudster. Users can require the AI agent to ping them for approval above a certain spend, or to pause before purchasing from unfamiliar sellers.\nSpeed to Market\nUnlike fledgling AI startups, Visa doesn’t have to lay new rails. Its tokenization framework already covers more than 200 countries and territories, and the Intelligent Commerce APIs are live now for partners ranging from Anthropic and OpenAI to Microsoft, Samsung and Stripe. “Any Visa credential can work,” Nelsen said, because the underlying technology has been field-tested for years.\nThat global footprint means an AI agent could book a table at an impossible-to-get-into Manhattan restaurant — or a last-minute villa on Italy’s Lake Como — without exposing card data or tripping fraud filters.\nMerchants, bruised by fraud losses and rising customer-acquisition costs, want conversions. Consumer want friction-free checkout. And regulators want proof that AI won’t introduce new risk. Visa’s bet is that sliding its fraud models and dispute-resolution tools under the hood will let all three constituencies adopt AI commerce faster.\n“It’s not only safe for the consumers,” Nelsen said. “It’s safe for the whole ecosystem, for the banks and the merchants as well. We’re excited about what the program will enable.” And, he added, “search used to be simple, and then it got complicated — now we can make it personalized and simple at the same time.”\nVisa isn’t predicting how quickly consumers will surrender purchase decisions to software agents, but it is positioning itself as the payments backbone when they do. By turning card numbers into tokens, layering on spend controls and piping in real-time fraud defenses, Intelligent Commerce tries to ensure the AI agent economy is born with same adult-grade security that exists in the digital and mobile ecosystems today.\nDevelopers can start coding today. Pilots are expected to surface in the coming months. If the model sticks, shopping bots could soon move from novelty to necessity, with Visa swiping the AI-powered card."
    },
    {
      "url": "https://www.pymnts.com/mastercard/2025/mastercard-debuts-agent-pay-to-promote-agentic-commerce-future/",
      "text": "The new offering, announced Tuesday (April 29), introduces Mastercard’s Agentic Tokens, which the company said builds upon tokenization capabilities that power global commerce solutions like mobile contactless payments, along with programmable payments such as recurring expenses and subscriptions.\n“This helps unlock an agentic commerce future where consumers and businesses can transact with trust, security, and control,” the company said in a news release. “Mastercard Agent Pay will enhance generative AI conversations for people and businesses alike by integrating trusted, seamless payments experiences into the tailored recommendations and insights already provided on conversational platforms.”\nThat means, the company said, that someone planning a party could chat with an AI agent to curate outfits and accessories or plan a venue. The agent can then make purchases based on that customer’s preferences and feedback, while also recommending the best way to pay.\nAccording to the release, Mastercard plans to collaborate with a number of tech companies on the program: Microsoft on new use cases to scale agentic commerce, IBM to accelerate B2B use cases and companies like Braintree and Checkout.com to enhance tokenization capabilities already in use.\n“The launch of Mastercard Agent Pay marks our initial steps in redefining commerce in the AI era, including new merchant interfaces to distinguish trusted agents from bad actors using agentic technology,” said Jorn Lambert, Mastercard’s chief product officer.\n“Recognizing the seismic implications of this evolution, we are keen to collaborate with industry players to advance the standards for agentic payments, such as applying the Model Context Protocol to Secure Remote Commerce,” he added. “This lays the foundation for scale and builds trust in agentic commerce.”\nIn other agentic AI news, PYMNTS explored the technology’s use in things like loan underwriting, fraud detection and cross-border payments in a recent interview with TerraPay Co-founder and Chief Operating Officer Ram Sundaram.\nHe noted that while automated decision making and streamlined processes will continue to transform global money movement, there’s still a need for have some human interaction.\n“Obviously, in the best-case scenario, everything goes smoothly, but when things are not going smoothly, that’s when the customer queries come in,” Sundaram said.\nIt’s not always easy to immediately determine where a transaction is, as company analysts and representatives have to examine logs and query partner systems.\n“A lot of that work is done manually,” Sundaram said, adding that the agents “know the corridors and the markets that they are working in, but it still takes some time.”"
    },
    {
      "url": "https://www.linkedin.com/in/rubail",
      "text": "Activity\n-\n💳💸 🚀 Just a few weeks into leading #VisaFlex and #Installments and energized about how we can help Issuers attract new customers, deepen card…\n💳💸 🚀 Just a few weeks into leading #VisaFlex and #Installments and energized about how we can help Issuers attract new customers, deepen card…\nLiked by Rubail Birwadker\n-\n🚀 It’s been a whirlwind few months — and while this isn’t exactly \"new\" news for many of my colleagues — I’m excited to share my next chapter at…\n🚀 It’s been a whirlwind few months — and while this isn’t exactly \"new\" news for many of my colleagues — I’m excited to share my next chapter at…\nLiked by Rubail Birwadker\n-\nJust returned from a market visit in the Philippines, where I spent valuable time with our team and met our clients and partners – listening…\nJust returned from a market visit in the Philippines, where I spent valuable time with our team and met our clients and partners – listening…\nLiked by Rubail Birwadker\nExperience & Education\nVolunteer Experience\nMore activity by Rubail\n-\nJust two months after announcing it on stage at Money20/20 with David Sandstrom, the Klarna Card is now officially rolling out across Europe!…\nJust two months after announcing it on stage at Money20/20 with David Sandstrom, the Klarna Card is now officially rolling out across Europe!…\nLiked by Rubail Birwadker\n-\nAfter an incredible 1,019 days - Friday marked the end of my time at Uber. WHAT. A. RIDE. I’ll forever be grateful for this experience, and for…\nAfter an incredible 1,019 days - Friday marked the end of my time at Uber. WHAT. A. RIDE. I’ll forever be grateful for this experience, and for…\nLiked by Rubail Birwadker\n-\nToday marks my last day at Curve Before closing this chapter of my career I want to take a moment to thank Shachar Bialick and the whole Curve…\nToday marks my last day at Curve Before closing this chapter of my career I want to take a moment to thank Shachar Bialick and the whole Curve…\nLiked by Rubail Birwadker\n-\nI’m honoured to return as CEO of Thunes, the company I co-founded and have been proud to help build from the very beginning. Thunes has never been…\nI’m honoured to return as CEO of Thunes, the company I co-founded and have been proud to help build from the very beginning. Thunes has never been…\nLiked by Rubail Birwadker\n-\nResponsiveness is one of the most powerful superpowers you can have in work and in life. Was on a run this morning with some engineering leaders who…\nResponsiveness is one of the most powerful superpowers you can have in work and in life. Was on a run this morning with some engineering leaders who…\nLiked by Rubail Birwadker\n-\nExciting opportunity at Workiva! Join us as a Senior Manager of Applied Science and be part of shaping the AI/ML vision. At Workiva, we are focused…\nExciting opportunity at Workiva! Join us as a Senior Manager of Applied Science and be part of shaping the AI/ML vision. At Workiva, we are focused…\nLiked by Rubail Birwadker\n-\nThis week, we welcomed over 1400 customers and partners at Stripe Tour Singapore! Stripe is now rapidly expanding in Asia to help businesses reach…\nThis week, we welcomed over 1400 customers and partners at Stripe Tour Singapore! Stripe is now rapidly expanding in Asia to help businesses reach…\nLiked by Rubail Birwadker\n-\nWorld Cup hopefuls – mark your calendars for Sept 10-19! The 2022 World Cup final was one of the greatest World Cup finals of all time. The back…\nWorld Cup hopefuls – mark your calendars for Sept 10-19! The 2022 World Cup final was one of the greatest World Cup finals of all time. The back…\nLiked by Rubail Birwadker\nOther similar profiles\n-\nDiego Szteinhendler\nConnect -\nJagdeep Singh Sahota, ETA-CPP\nConnect -\nOtto Abasi Williams\nConnect -\nJohn Ghirardelli\nConnect -\nVeronica Fernandez\nConnect -\nClark Ainsworth, MBA\nConnect -\nBob Hedges\nConnect -\nMichael Isaacs\nConnect -\nTom Bradley\nConnect -\nJoseph Smolen\nExecutive Vice President, Core & Institutional Markets at Empower\nConnect\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top content"
    },
    {
      "url": "https://www.pymnts.com/news/payments-innovation/2025/visa-gives-developers-new-tools-to-accelerate-agentic-commerce/",
      "text": "“There’s almost a reimagining of the internet going on right now,” Visa Senior Vice President and Global Head of Growth Rubail Birwadker told PYMNTS CEO Karen Webster. For the past 30 years, eCommerce has been about keeping bad bots out. The fraudsters, scrapers and hostile traffic. Now, the challenge is flipped. The bots showing up represent consumers and real intent to buy.\nVisa’s answer is to give developers the connective tissue to work with these new agents instead of blocking them.\nOpening the MCP Server\nVisa announced Thursday (Sept. 4) it will open access to its production Model Context Protocol (MCP) server so developers can plug artificial intelligence (AI) agents directly into Visa Intelligent Commerce application programming interfaces (APIs). The company is also piloting an Acceptance Agent Toolkit that lets nontechnical teams generate invoices, create payment links and run analytics using plain prompts.\nThe goal is to compress the path from idea to functioning, payment-enabled agent while keeping every transaction tied to Visa’s security framework.\n“If this works really well for just 5% or 10% of consumer experiences, that’s not the bar,” Birwadker said. “It needs to work for nearly all consumer experiences, the way Visa’s card experience works everywhere.”\nWhy Developers Matter\nBirwadker described the MCP server as a secure integration layer that standardizes how agents and large language models interact with Visa’s services. Starting with Visa Intelligent Commerce and extending across more APIs, it reduces weeks of custom development to hours, he said.\nOn top of that sits the Acceptance Agent Toolkit, which lets business teams trigger prebuilt workflows like invoices or ad hoc revenue summaries with plain commands inside chat.\n“The goal is to extend the trust of the Visa brand into the future of agentic commerce,” Birwadker said. “An MCP layer removes friction for developers and drives standardization at scale.”\nVisa has been testing MCP internally and with partners since the spring launch of Visa Intelligent Commerce. Now, the company wants to “extend the edges of our network to make it even easier for agents and other companies to build on.”\nBirwadker expects access layers like MCP to become “a relatively important tool” because websites today or even developer docs “were not really designed with agents in mind.”\nMCP lets developers “build once, reuse everywhere,” making agent behaviors portable across markets and use cases. He said that teams are already testing real checkout flows: how fast transactions complete, how multi-merchant purchases work, and how to keep legitimate agent traffic from being misclassified as bots.\n“This all works,” Birwadker said. “We just need to work the kinks out,” given the abstraction and automation unique to agent-led buying.\nMerchant On-Ramps\nFor merchants, the Acceptance Agent Toolkit provides on-ramps that do not require code. A simple command such as “Create an invoice for $100 for John Doe, due Friday” returns a secure payment link. Asking “Summarize today’s revenue in New York State” retrieves permitted transaction data.\nThe aim is to give Visa Acceptance customers fast, practical wins on repetitive tasks that make agentic commerce real and scalable.\nBirwadker sees three merchant camps forming as agentic AI’s relatively short life has already shifted from curiosity to the reality that this new channel is how their customers want to discover products and pay for them.\nSome embrace it as a new channel for discovery and sales, eager to be found inside agent experiences. Established retailers are rethinking acquisition economics as agent channels capture more traffic and traditional strategies are no longer effective. A cautious group focuses on protecting margins and controlling fraud.\nDespite their differences, Birwadker said, “the consensus is that agentic commerce is not a trend … it’s a new paradigm.”\nEven right away. Several large retailers are already exploring pilots during the holiday peak. “Yes, a number of large retailers are,” Birwadker confirmed. “We’re working through it.”\nBuilding Trust\nWebster noted that trust will become the gating factor of agentic success for merchants, issuers and consumers. And building it is dependent on one factor alone.\nBirwadker agreed, saying it starts with identity: anchoring agents to authenticated credentials through a consumer’s bank. Layering in enriched data payloads before, during and after each transaction ensures disputes can be resolved fairly. If an agent buys a blue bag instead of a black one, standardized data must show what happened so liability can be assigned between issuers and merchants.\n“Identity followed by the right data payloads with the right authentication is the way to do this at scale,” he said, pointing to Visa’s broader work tokenizing credentials.\nA Standardized Future\nThe path forward will not be seamless. Developers and merchants must adapt infrastructure built for human browsing to a world where agents shop and transact. That is why Visa is putting MCP in developers’ hands and a no-code toolkit in merchants’ hands, to standardize the connective layer and accelerate real-world learning.\nFor Birwadker, the endgame is ubiquity. A technology that only works in a handful of scenarios will not move the needle. Agentic commerce must be as seamless and trusted as swiping a Visa card is today. The company intends to iterate quickly, he said, until the trust quotient, usability and standardization is built.\n“The easier it is for developers and merchants to build on MCP, the more likely it becomes the default,” he said. “Our bar isn’t niche adoption. It’s ubiquity.”\nPYMNTS CEO Karen Webster is one of the world’s leading experts in payments innovation and the digital economy, advising multinational companies and sitting on boards of emerging AI, healthtech, and real-time payments firms. She founded PYMNTS.com in 2009, a top media platform covering innovation in payments, commerce, and the digital economy. Webster is also the author of the NEXT newsletter and a co-founder of Market Platform Dynamics, specializing in driving and monetizing innovation across industries.\nRubail Birwadker has been Visa’s senior vice president and global head of growth since November. He leads numerous growth functions, including global partnerships and AI and agentic commerce products."
    },
    {
      "url": "https://www.pymnts.com/tag/apms/",
      "text": "The travel industry can call to mind pink sand beaches, loyalty points and upgrades. But behind the scenes, the sector is defined by the way...\nThis holiday season, consumers want it their way. And when it comes to the payments that fuel seasonal commerce, their way is fast, secure and...\nBruce Parker, founder and CEO of Modo, contributed the following piece as part of PYMNTS’ 2018 year-end eBook. Get the Full Story Complete the form...\nPPRO Group, a U.K. cross-border ePayment provider, announced a partnership with Credorax to boost its Alternative Payment Methods (APMs) offerings throughout Europe. Get the Full Story...\nAs eCommerce grows — and increased top lines beckon — navigating through the payments preferences and practices in foreign markets proves tricky. PPRO has opened...\nGetting paid is a worker’s number one priority — including the fraudster. And that’s why they have turned to alternative payments as a way to both..."
    },
    {
      "url": "https://www.pymnts.com/tag/ai-agents/",
      "text": "Watch more: Agentic AI Needs Strong Verification to Unlock Safe, Scalable Commerce Get the Full Story Complete the form to unlock this article and enjoy...\nAuditoria.AI said Wednesday (Aug. 27) that it enhanced its intelligent applications for corporate finance during the first half of the year by adding a new...\nEven as artificial intelligence reshapes corporate finance, a trust gap is emerging around its most autonomous form, agentic AI, among the very executives poised to...\nRiskified and HUMAN Security have partnered to help merchants prevent fraud and abuse when dealing with artificial intelligence (AI) shopping agents. Get the Full Story Complete...\nPinterest CEO Bill Ready said Friday (Aug. 8) that it will be some time before consumers are ready to let artificial intelligence (AI) agents do their...\nChina has proposed creating an organization to promote global artificial intelligence (AI) cooperation. Get the Full Story Complete the form to unlock this article and...\nCompanies of all sizes are being deluged by vendors who want them to deploy the artificial intelligence (AI) trend du jour: AI agents. Get the...\nAmazon Web Services (AWS) has launched a new artificial intelligence (AI) agent marketplace aimed at simplifying how businesses find, deploy and manage these autonomous bots....\nAmazon Web Services (AWS) and Vonage have partnered to deliver “natural-sounding” artificial intelligence (AI) voice agents for use in customer support and proactive outbound engagement..."
    }
  ],
  "argos_summary": "Ant International-owned Antom has launched a first‑of‑its‑kind agentic payment solution that lets AI agents complete card‑based transactions via secure tokenization and the Model Context Protocol. Built on MCP, the platform supports both confirmed purchases and conditional pre‑authorized transactions, and is among the first Visa and Mastercard partners to pilot such capabilities in the Asia Pacific. The launch signals a broader industry push toward AI‑enabled commerce, with Visa and Mastercard expanding token‑based, AI‑ready cards and APIs to facilitate frictionless, secure agent‑driven payments.",
  "argos_id": "339Y8UX2W"
}