{
  "url": "https://nypost.com/2025/09/04/sports/next-wave-of-japanese-stars-nearing-jump-to-mlb-one-could-help-mets/",
  "authorsByline": "Jon Heyman",
  "articleId": "1c5883062b93424f9f1681e2f04d41a1",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-ulpfb3sd8-1757026691172.jpg?quality=75&strip=all&1757012341&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T23:33:03+00:00",
  "addDate": "2025-09-04T23:35:31.706655+00:00",
  "refreshDate": "2025-09-04T23:35:31.706657+00:00",
  "score": 1.0,
  "title": "Next wave of Japanese stars nearing jump to MLB — one could fill potential Pete Alonso Mets gap",
  "description": "Mets president of baseball operations David Stearns scouted in Japan, and some rivals are speculating which players the Mets could be in the market for.",
  "content": "Noted Yakult Swallows slugger Munetaka Murakami isn’t the only Japanese star moving to MLB this winter. Yomiuri Giants star Kazuma Okamoto, another big-hitting third baseman/first baseman who’s comped to Seiya Suzuki, and Seibu Lions pitching star Tatsuya Imai, who has a 1.50 ERA and throws 98 mph with a plus slider, are being posted, too, sources say.\n\nMets president of baseball operations David Stearns scouted in Japan, and some rivals are speculating the Mets may play for Murakami if they can’t re-sign Pete Alonso. Stearns saw Imai, a 27-year-old right-hander, and Okamoto, as well.\n\nThe latest best guess heard for Aaron Judge’s return to right field is this home stand, maybe early next week. (But of course, many guesses have been made already.)\n\nThe Judge-Cal Raleigh MVP debate is great, but if the Mariners continue flopping (and four teams are within three games for the final wild-card spot), his first-place case goes away.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/28/sports/pete-alonsos-looming-free-agency-market-could-include-astros/",
    "https://nypost.com/2025/09/04/sports/albert-pujols-could-find-himself-in-mlbs-managerial-mix/",
    "https://nypost.com/2025/08/31/sports/what-inconsistent-mets-need-to-go-right-for-an-october-chance/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Japanese stars",
      "weight": 0.10356664
    },
    {
      "name": "Seibu Lions pitching star Tatsuya Imai",
      "weight": 0.103420936
    },
    {
      "name": "Yomiuri Giants star Kazuma Okamoto",
      "weight": 0.09786858
    },
    {
      "name": "potential Pete Alonso Mets gap",
      "weight": 0.09616718
    },
    {
      "name": "Pete Alonso Mets",
      "weight": 0.095301956
    },
    {
      "name": "Noted Yakult Swallows slugger Munetaka Murakami",
      "weight": 0.08813478
    },
    {
      "name": "first baseman",
      "weight": 0.08513065
    },
    {
      "name": "right field",
      "weight": 0.078461185
    },
    {
      "name": "Pete Alonso",
      "weight": 0.07768605
    },
    {
      "name": "Tatsuya Imai",
      "weight": 0.0764896
    }
  ],
  "topics": [
    {
      "name": "MLB"
    },
    {
      "name": "Baseball"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9375
    }
  ],
  "sentiment": {
    "positive": 0.20986639,
    "negative": 0.22461502,
    "neutral": 0.56551856
  },
  "summary": "Notable Japanese stars are expected to join the ranks of the baseball team, including notable Yakult Swallows slugger Munetaka Murakami and Yomiuri Giants' Kazuma Okamoto, and Seibu Lions pitching star Tatsuya Imai. The Mets president of baseball operations, David Stearns, is reportedly interested in these players if they cannot re-sign Pete Alonso.",
  "shortSummary": "Munetaka Murakami, Kazuma Okamoto, and Tatsuya Imai are among several Japanese stars being considered for potential roles in Major League Baseball.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "295160310b7f4c3691b22515a6fbf47b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/31/sports/what-inconsistent-mets-need-to-go-right-for-an-october-chance/",
      "text": "The most obvious piece of good news for the Mets is they’ll almost surely still make the National League playoffs despite a season tilting decidedly downward since a near-perfect start that seems like a dream now.\nAccess the Mets beat like never before\nDon’t miss Mike Puma’s text messages from Queens and beyond — he’s giving Sports+ subscribers the inside buzz on the Mets.\nSign up NowThe better news: The Nats and Marlins — two second-division teams that transform into killers against them — will not be among October opponents.\nThe Mets’ schizophrenic season was neatly encapsulated this week, which went from exciting and enthralling (a three-game whipping of the first-place Phillies) to dreary and downright worrisome (losing three of four games to the feisty Marlins, who had a lot more trouble with the PitchCom device than their gracious Citi Field hosts).\n“There’s a lot to like, but there’s also room for improvement. We’ve been inconsistent,” Mets manager Carlos Mendoza said before the latest debacle vs. the Marlins, a 5-1 defeat, in what qualifies as a fair if somewhat understated summary of a season that could go either way and at any moment."
    },
    {
      "url": "https://nypost.com/2025/08/28/sports/pete-alonsos-looming-free-agency-market-could-include-astros/",
      "text": "The Astros are said to be considering a run at Pete Alonso as a surprise suitor in free agency. The all-time Mets home run champion has talked about how he’d love to stay a Met, but his free agency should go better this time around — not only because he’s ineligible to receive a qualifying offer, but also because he’s having a much better season this year than last.\nAlonso, who’ll surely opt out of the $24 million remaining for 2026, should draw much more interest this time around considering his improved clutch and overall hitting (29 HR, 106 RBI, .265) in a year when he’s said to be “concentrating on contact.”\nThe Astros would be a surprise because they signed Christian Walker to a three-year, $60M deal last winter, but they continue to show their willingness to spend to win, with the trade for Carlos Correa the latest example. The Mets will try to bring back Alonso, who could draw interest from Texas, Boston, Seattle, the Yankees and others.\nDon’t look now, but the favored Dodgers have their whole rotation back together, and it’s thriving. They won the 2024 World Series with a makeshift, three-man rotation of Yoshinobu Yamamoto, a surgically-repaired Walker Buehler and short-timer Jack Flaherty. But now Yamamoto, Blake Snell, Tyler Glasnow, Shohei Ohtani and a rejuvenated Clayton Kershaw (5-0, 1.88 ERA in August) are all healthy and pitching well. Roki Sasaki is still rehabbing in the minors, but he’s back throwing 99 mph."
    }
  ],
  "argos_summary": "Japanese slugger Munetaka Murakami, third baseman Kazuma Okamoto, and pitcher Tatsuya Imai are all being posted for MLB teams this winter, with Mets president David Stearns scouting them. The Mets are considering acquiring Murakami to fill a potential gap left by Pete Alonso if they cannot re-sign him. Meanwhile, Alonso’s free‑agency prospects are attracting interest from teams like the Astros, who may pursue him after a strong season. The article also notes speculation about Aaron Judge’s return and the Mets’ playoff prospects amid a fluctuating season.",
  "argos_id": "37IWTK4LP"
}