{
  "url": "https://www.theverge.com/news/769300/aukey-magfusion-ark-wireless-charger-qi2-2",
  "authorsByline": "Andrew Liszewski",
  "articleId": "a0fa075bf55744a18194e5b7feabd923",
  "source": {
    "domain": "theverge.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/aukey_ark1.jpg?quality=90&strip=all&crop=0,10.788057246499,100,78.423885507002",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T06:00:00+00:00",
  "addDate": "2025-09-04T06:02:02.308765+00:00",
  "refreshDate": "2025-09-04T06:02:02.308768+00:00",
  "score": 1.0,
  "title": "Aukey’s new wireless charger gives you more freedom through the power of the orbs",
  "description": "Wireless charging with more freedom.",
  "content": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nAukey has announced a new modular charging solution called the MagFusion Ark. It combines a base station featuring up to three Qi2.2 charging pads with spherical power banks that each have their own Qi2.2-compatible pads. The spheres support passthrough charging and can wirelessly charge another device while they’re on the base station, but they can also be removed and used as standalone wireless chargers powered by either their 6,700mAh battery or a USB-C port.\n\nPricing will be announced closer to the MagFusion Ark’s release in Q1 of 2026, but it will be available in three different configurations: a bundle that includes a base with three pads and three spheres, as well as one- and two-pad bases with the spheres sold separately. The Ark is entirely Qi2.2-compatible, and both the base and spheres will wirelessly charge Qi2.2 devices at rates up to 25W.\n\nOn battery power alone, the number of times that the spheres can be used to fully recharge a device like a smartphone will depend on the capacity and health of that device’s own battery. But given the battery in the spheres is also used to power a cooling fan, you can probably expect to get at least one full smartphone charge out of them, or a handful of top-ups.\n\nEach sphere also features a 30W USB-C port. You can use it to maximize the sphere’s battery capacity by sidestepping the inefficiencies of wireless charging, charge devices that aren’t Qi2-compatible, or even keep the sphere plugged in to use as a charging stand. You can also charge two devices simultaneously from each sphere — one from the USB-C port and one from the Qi2 pad— but wireless charging rates drop to 15W while the USB-C port’s output drops to 20W.\n\nAlthough Aukey says the MagFusion Ark offers a “total of six charging points,” you’ll only be able to wirelessly charge three devices at a time on the base station, excluding the spheres. When the spheres are each being used independently to charge other devices, that then frees up the pads on the base for other devices. That’s a bit limiting given the relatively large footprint of the Ark’s base, but the added flexibility of being able to grab one of the spherical chargers and use it anywhere in your home could be worth the tradeoff.\n\nFollow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates.",
  "medium": "Article",
  "links": [
    "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/aukey_ark2.jpg?quality=90&strip=all&crop=0.012500000000003,0,99.975,100",
    "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/aukey_ark3.jpg?quality=90&strip=all&crop=0,0,100,100"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "wireless charging",
      "weight": 0.09880722
    },
    {
      "name": "wireless charging rates",
      "weight": 0.09773203
    },
    {
      "name": "spheres",
      "weight": 0.088846296
    },
    {
      "name": "other devices",
      "weight": 0.087258436
    },
    {
      "name": "standalone wireless chargers",
      "weight": 0.08398711
    },
    {
      "name": "devices",
      "weight": 0.083243795
    },
    {
      "name": "passthrough charging",
      "weight": 0.08290688
    },
    {
      "name": "battery power",
      "weight": 0.07751457
    },
    {
      "name": "spherical power banks",
      "weight": 0.0725611
    },
    {
      "name": "Ark",
      "weight": 0.067516714
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.93603515625
    },
    {
      "name": "/Computers & Electronics/Electronics & Electrical/Power Supplies",
      "score": 0.744140625
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.40966796875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.3798828125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.374755859375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.322998046875
    }
  ],
  "sentiment": {
    "positive": 0.1466835,
    "negative": 0.2413094,
    "neutral": 0.61200714
  },
  "summary": "Aukey has launched a modular charging solution called the MagFusion Ark, which combines a base station with three Qi2.2-compatible spherical power banks. Each sphere has a 6,700mAh battery or a USB-C port, which can be removed and used as standalone wireless chargers. Pricing will be announced in Q1 of 2026. The device will be available in three different configurations.",
  "shortSummary": "Aukey's new MagFusion Ark wireless charger integrates Qi2.2-compatible pads with spherical spheres, allowing flexibility and flexibility to charge multiple devices simultaneously.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1e150a8c42e54d8eb8d00404f99c8b6c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Aukey unveiled the MagFusion Ark, a modular wireless charging system that includes a base station with up to three Qi2.2 pads and detachable spherical power banks. Each sphere can wirelessly charge a device while also providing a 30W USB‑C port, allowing simultaneous charging of two devices. The system supports passthrough charging, offers up to 25W Qi2.2 rates, and is expected to launch in Q1 2026 with pricing to be announced.",
  "argos_id": "45K4DXWU6"
}