{
  "url": "https://www.techspot.com/news/109324-new-hollow-core-fiber-outperforms-glass-pushing-data.html",
  "authorsByline": "Skye Jacobs",
  "articleId": "df6e193f5ece475cafd2c4820eb56a32",
  "source": {
    "domain": "techspot.com",
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.techspot.com/images2/news/bigimage/2025/09/2025-09-03-image-37.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T08:24:00-05:00",
  "addDate": "2025-09-04T13:32:50.313905+00:00",
  "refreshDate": "2025-09-04T13:32:50.313908+00:00",
  "score": 1.0,
  "title": "New hollow-core fiber outperforms glass, pushing data closer to light speed",
  "description": "This novel fiber, utilizing a design known as double-nested antiresonant nodeless fiber (DNANF), exhibits an attenuation of just 0.091 dB/km at the 1,550-nm wavelength. For comparison, today's...",
  "content": "What just happened? A Microsoft-backed research team has set a new benchmark for optical fiber performance, developing a hollow-core cable that posts the lowest optical loss ever recorded in the industry, according to findings published in Nature Photonics. The milestone comes after years of effort by Lumenisity, a spinout from the University of Southampton's Optoelectronics Research Center, now operating under Microsoft's wing following an acquisition in 2022.\n\nThis novel fiber, utilizing a design known as double-nested antiresonant nodeless fiber (DNANF), exhibits an attenuation of just 0.091 dB/km at the 1,550-nm wavelength. For comparison, today's best silica fibers bottom out at roughly 0.14 dB/km – a figure that has remained relatively unchanged since the 1980s.\n\nFrancesco Poletti, who co-authored the research paper and helped invent the design, told The Register that the development ranks as \"one of the most noteworthy improvements in waveguided optical technology for the past 40 years.\"\n\nThe main draw behind hollow-core fiber is the medium: while standard optical fiber guides photons through solid glass, limiting signal speed to just under 200 million meters per second, the hollow variant lets light travel through air, which increases velocity closer to the maximum of 300 million meters per second.\n\nMore speed means lower latency – an especially important metric for moving data between cloud datacenters and accelerating mobile network performance. However, earlier hollow-core designs suffered high energy loss (over 1 dB/km), restricting practical use to short and specialized links.\n\nThe DNANF fiber counters this by using concentric, micron-thin glass tubes acting as tiny mirrors, bouncing light through an air core while suppressing unwanted transmission modes. Tests conducted on kilometer-scale spools confirmed attenuation below the critical 0.1 dB/km mark using multiple measurement methods, including optical time-domain reflectometry.\n\nThe researchers report that loss remained under 0.2 dB/km across a 66-terahertz spectral band – significantly more bandwidth and flexibility than conventional fibers can offer. They also measured chromatic dispersion at levels seven times lower than those of legacy architectures, which could simplify transceiver designs and reduce network energy costs. \"So you need to amplify less,\" Poletti explained. \"It can lead to greener networks if this is how you want to exploit it.\"\n\nMicrosoft's acquisition of Lumenisity in 2022 signaled its intention to move hollow-core technology from academic circles into real-world infrastructure. Initial iterations achieved losses of 2.5 dB/km – respectable but uncompetitive with legacy glass fiber. Through ongoing development, Microsoft confirmed to Network World that approximately 1,200 kilometers of the new fiber are already carrying live cloud traffic. At the 2024 Ignite conference, CEO Satya Nadella announced plans to deploy 15,000 kilometers of DNANF fiber across Azure's global backbone within two years, aiming to support the explosive growth in AI workloads.\n\nWhile the technology promises transmission speeds up to 45 percent faster than current solid-core options and holds the potential for five to ten times wider bandwidth, certain hurdles remain. Scaling production will require new manufacturing tools, and the fiber must undergo international standardization processes before entering mass-market use – a milestone that could take around five years. Still, the latest results mark the first time fiber that carries light through air has outpaced and outperformed the glass it was engineered to replace – a watershed moment for telecom and cloud infrastructure.",
  "medium": "Article",
  "links": [
    "https://www.theregister.com/2025/09/01/hollowcore_optical_fiber_research/",
    "https://www.techspot.com/news/109272-nearly-40-nvidia-revenue-tied-two-mystery-customers.html",
    "https://www.techspot.com/news/108670-tired-slow-speeds-two-michigan-residents-building-their.html",
    "https://www.tomshardware.com/tech-industry/hollow-core-fiber-research-smashes-optical-loss-record"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "optical fiber performance",
      "weight": 0.09498927
    },
    {
      "name": "legacy glass fiber",
      "weight": 0.09485586
    },
    {
      "name": "standard optical fiber",
      "weight": 0.09324261
    },
    {
      "name": "DNANF fiber",
      "weight": 0.09093669
    },
    {
      "name": "fiber",
      "weight": 0.08724993
    },
    {
      "name": "conventional fibers",
      "weight": 0.08617899
    },
    {
      "name": "New hollow-core fiber",
      "weight": 0.06796795
    },
    {
      "name": "waveguided optical technology",
      "weight": 0.06639716
    },
    {
      "name": "solid glass",
      "weight": 0.063160025
    },
    {
      "name": "hollow-core fiber",
      "weight": 0.06307188
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.97705078125
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.517578125
    },
    {
      "name": "/Science/Engineering & Technology/Other",
      "score": 0.48388671875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.4736328125
    },
    {
      "name": "/Computers & Electronics/Electronics & Electrical/Electronic Components",
      "score": 0.321044921875
    }
  ],
  "sentiment": {
    "positive": 0.18884471,
    "negative": 0.3824326,
    "neutral": 0.4287227
  },
  "summary": "A Microsoft-backed research team has developed a hollow-core cable that posts the lowest optical loss ever recorded in the industry, according to findings published in Nature Photonics. The fiber, named double-nested antiresonant nodeless fiber (DNANF), exhibits an attenuation of just 0.091 dB/km at the 1,550-nm wavelength, compared to current silica fibers. This development comes after years of effort by Lumenisity, a spinout from the University of Southampton's Optoelectronics Research Center, which Microsoft acquired in 2022. The technology allows for transmission speeds up to 45 percent faster than current solid-core options and potentially offers five to ten times wider bandwidth. However, scaling production will require new manufacturing tools and international standardization processes before entering mass-market use.",
  "shortSummary": "Microsoft-backed research team Lumenisity has developed a low-loss optical fiber, achieving sub-zero attenuation and potentially revolutionizing telecommunications and cloud infrastructure.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ce81f03ef54e48f7b312243c3196d8dc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.tomshardware.com/tech-industry/hollow-core-fiber-research-smashes-optical-loss-record",
      "text": "Microsoft-backed research team builds hollow-core cable with lowest signal loss recorded in optical fiber\nBreakthrough hollow-core design pulls ahead of glass after 40 years.\nA Microsoft-backed research team from Lumenisity (a spinout of the University of Southampton Optoelectronics Research Center) has built a hollow-core cable with what it claims is the lowest signal loss ever recorded in any optical fiber. Published in Nature Photonics on Sept. 1, the team claims to have achieved 0.091 dB/km at 1,550nm using a design known as double nested antiresonant nodeless fiber (DNANF).\nThis figure undercuts the ~0.14 dB/km floor of today’s best silica fibers — and that number hasn't meaningfully improved since the 1980s. According to the researcherrs, this is “one of the most noteworthy improvements in waveguide technology for the past 40 years.”\nConventional single-mode fiber guides light through glass, slowing signals to roughly 200 million meters per second, which is two-thirds of their potential vacuum speed. In contrast, hollow-core fibers route photons mostly through air — reducing latency by nearly half and minimizing nonlinear effects. This, however, comes with a steep penalty: hollow-core designs leak energy at rates exceeding 1 dB/km, effectively confining them to short, specialist links.\nThe DNANF design solves this by using concentric glass tubes that are just microns thick. These act like tiny mirrors, bouncing the light back into the air core and suppressing higher-order modes. Testing this on 15km spools using multiple measurement methods, including optical time-domain reflectometry, confirmed attenuation under 0.1 dB/km.\nEqually important: loss remained below 0.2 dB/km across a 66THz spectral band. That’s far broader than the narrow telecom windows where silica performs best. Also, chromatic dispersion — which is where different wavelengths of light travel at different speeds through a medium — is reported to be seven times lower than it is in legacy fiber, which could simplify transceiver design and reduce energy use in network gear.\nMicrosoft’s 2022 acquisition of Lumenisity was a clear sign that it intended to push hollow-core tech out of the lab and into production. At the time, the company’s hollow-core fibers were achieving around 2.5 dB/km loss, which was still a far cry from the traditional ~0.14 dB/km floor of glass fiber.\nFollowing a pilot project conducted alongside the team’s research, Microsoft told Network World that some 1,200 km of the new fiber is actively carrying live traffic. During 2024’s Microsoft Ignite conference, CEO Satya Nadella announced that the company plans to deploy 15,000 km of fiber across the Azure network over the next two years to support AI connectivity.\nFrancesco Poletti, who co-invented the design, said that the low levels of loss achieved could let operators “skip one in every two or three amplifier sites, resulting in significant reductions in both capital and operational expenditure.”\nOf course, there are still some challenges. Scaling production will require new tooling, and standards have yet to be written. But for the first time ever, a fiber that carries light through air is both faster and less lossy than the glass it's trying to replace.\nGet Tom's Hardware's best news and in-depth reviews, straight to your inbox.\nLuke James is a freelance writer and journalist. Although his background is in legal, he has a personal interest in all things tech, especially hardware and microelectronics, and anything regulatory.\n-\nhotaru251 Replyhollow-core designs leak energy at rates exceeding 1 dB/km, effectively confining them to short, specialist links.\nso they'll end up in extremely niche devices & the most likely use: \"ai\" clusters. -\nMr Majestyk Reply\ndid you read the entire article?hotaru251 said:so they'll end up in extremely niche devices & the most likely use: \"ai\" clusters.\nPublished in Nature Photonics on Sept. 1, the team claims to have achieved 0.091 dB/km at 1,550nm using a design known as double nested antiresonant nodeless fiber (DNANF).\nOld hollow cores design sure, but this is the point of this new research, crazy low loss per km, beating glass fibres 0.14dB/km (theoretical minimum). It could be used for long-haul telecommunications if their claims hold up.\nAlso, even if loss were much higher say 1dB/km, that makes it easily good enough for medium haul like within a suburb or city, not just for local WAN say. -\nscottsoapbox Reply\nThat’s the old design that’s being replaced.hotaru251 said:so they'll end up in extremely niche devices & the most likely use: \"ai\" clusters.\nTry reading more than two sentences of the article. -\nthestryker I'm really curious how close they are to the cost of manufacture making it a realistic choice. I always find it sad when there are good technologies that end up simply never making financial sense.Reply -\nMr Majestyk Reply\nHaving worked in fibre optics for a decade, they are cheap to make, fibre's not the main cost. Looking at $300-1500 (speciality fibre) /km. Often it's the protective jacket that pushes costs way higher. Submarine cables cost a metric shit ton per kmthestryker said:I'm really curious how close they are to the cost of manufacture making it a realistic choice. I always find it sad when there are good technologies that end up simply never making financial sense. -\nthestryker Reply\nExcept that these are a new fiber design which has no existing infrastructure to manufacture at scale. On top of that it's certainly going to cost more to make given that it's a hollow core design. Microsoft is justifying the expense now because of ai, but currently that's basically a blank check. The question becomes is it also viable for other long distance installations.Mr Majestyk said:Having worked in fibre optics for a decade, they are cheap to make, fibre's not the main cost. Looking at $300-1500 (speciality fibre) /km. Often it's the protective jacket that pushes costs way higher. Submarine cables cost a metric shit ton per km\nI do hope you're right about the increased cost not really mattering though because it seems like it'd be great for infrastructure."
    },
    {
      "url": "https://www.theregister.com/2025/09/01/hollowcore_optical_fiber_research/",
      "text": "Microsoft-backed boffins show mega speed boost with hollow-core fiber\nCould dramatically reduce latency between datacenters and on mobile nets\nA team of networking boffins has published fresh research on hollow fiber cables that it claims could offer the lowest ever recorded optical loss for a fiber – meaning the signal would weaken less as it travels, leading to faster speeds and lower latencies.\nWhat happens when we can't just build bigger AI datacenters anymore?\nREAD MOREThose lower latencies, crucially, could cut the time needed to move data between cloud datacenters, and well as speeding up mobile networks.\nA few years ago, Microsoft bought Lumenisity, a spinoff from the University of Southampton that had already trialed its hollow-core fiber (HCF) cables with UK incumbent telco BT. The team, which is still attached to the university but now also enjoys Microsoft's hefty resources, said on Monday that it had finally come up with a design that could significantly beat conventional optical fibers on both loss and bandwidth.\nSo you need to amplify less .... It can lead to greener networks if this is how you want to exploit it\nFrancesco Poletti, who came up with the concept more than a decade ago, co-founded Lumenisity, and co-authored the team's new Nature Photonics paper, told The Register that the design would allow for faster networks that benefit everything from AI model training to remote surgery and self-driving cars.\nIn the paper, the researchers call their HCF design \"one of the most noteworthy improvements in waveguided optical technology for the past 40 years\" and \"a potential revolution in optical communications.\"\n\"These are big claims but we truly believe this is a breakthrough,\" Poletti told The Register in an interview.\nThe idea of hollow-core fiber is decades old, and was attractive to researchers because while light runs through glass fiber at about 200 million meters per second, it travels through air at about 300 million meters per second (the index of refraction for glass is roughly 1.5. However, earlier iterations of HCF were impractical because the signal lost too much power. Today's typical, solid-core optical fibers have a minimum loss of 0.14 decibels per kilometer, and first-generation HCF couldn't get below 1 dB km−1, which would create the need for more optical amplifiers to boost the signal in the network.\nWhat Microsoft's team just announced is a refinement of the more recent \"double nested antiresonant nodeless hollow core fiber\" (DNANF) approach, in which extremely thin glass membranes around the hollow core help guide the light. The new design is the first to demonstrate a loss of below 0.1 dB km−1. (They managed 0.091 dB km−1 in their best result, though Poletti noted that the average loss was slightly higher.)\n\"So you need to amplify less,\" Poletti says. \"It can lead to greener networks if this is how you want to exploit it.\"\nThe team is promising transmission speeds 45 percent faster than what's possible with solid-core fiber. With further refinement, they say the design could support five to ten times wider bandwidth, too.\n- Why did Microsoft just buy fiber optic cable company Lumenisity?\n- BT hails hollow-core fibre trials as 'critical advancement' for secure communications\n- UK's BT starts trials of new hollow-core optical fibre networks\n- New 'iPhoD' can 'adjust the speed of light by turning a knob'\nThis sets the design apart from a similar advance announced earlier this year by a team of Chinese researchers. Their approach involves a slightly different configuration with thicker membranes that might make for cheaper production, but at the expense of bandwidth. \"It could have a big impact, though maybe not as big as the fiber we report in this paper,\" Poletti says.\nMicrosoft currently has \"a huge internal demand for the fiber,\" he says, adding that the mothership would gobble up everything that the unit can produce for the next couple of years. \"We will scale up as fast as possible,\" he said.\nPoletti said datacenter operators may be able to purchase and install the technology in around five years' time, once it has gone through international standardization and more players have entered the market. ®"
    }
  ],
  "argos_summary": "Microsoft-backed Lumenisity has unveiled a hollow‑core fiber (DNANF) with record‑low loss of 0.091 dB/km, beating the 0.14 dB/km floor of conventional glass fiber. The design uses micron‑thin glass mirrors to guide light through air, cutting latency by up to 45 % and reducing amplifier needs, which could lower energy costs and improve AI data‑center links. Microsoft plans to deploy 15,000 km of the new fiber across its Azure backbone in two years, but mass production and international standardization are expected to take roughly five years.",
  "argos_id": "4ANOO3SS6"
}