{
  "url": "https://nypost.com/2025/09/04/real-estate/manhattan-has-highest-rate-of-vacant-homes-in-nyc/",
  "authorsByline": "Mary K. Jacob",
  "articleId": "18a7c78769284f4eb5f4e1fe5c812583",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-joas3yqsa-1757009504265.jpg?quality=75&strip=all&1756995157&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T20:41:01+00:00",
  "addDate": "2025-09-04T20:44:16.899358+00:00",
  "refreshDate": "2025-09-04T20:44:16.899360+00:00",
  "score": 1.0,
  "title": "Manhattan leads the city in empty residences — with 1 ZIP code leading the charge",
  "description": "Even in the borough that rarely sleeps, silence reigns in more homes than one might expect, according to data provider Attom.",
  "content": "Even in the borough that rarely sleeps, silence reigns in more homes than one might expect.\n\nManhattan now claims the highest percentage of vacant residences across New York City, with an estimated 1,400 apartments — or around 1.2% of its housing inventory — lying empty, according to a third-quarter analysis by real estate data provider Attom obtained by The Real Deal.\n\nThat figure has barely shifted from last year and closely matches the national vacancy rate of 1.3%.\n\nWhile Brooklyn may appear more vacant in raw numbers — with some 29% of the city’s nearly 5,900 unoccupied units — its overall vacancy ratio aligns with the city average of 0.7%.\n\nThe Bronx follows closely behind Manhattan with a rate of 1.1%, highlighting pockets of underuse even amid New York’s broader housing crunch.\n\nIn terms of Manhattan, the contrasts between neighborhoods are stark.\n\nIn ZIP code 10012, which includes Soho and the East Village, roughly 4.3% of residences sit empty — more than triple the borough and national norms. Both prime areas, it may seem high prices may be the cause, but there’s more than meets the eye.\n\n“The scale of residential construction and conversions has been higher in downtown Manhattan, particularly in specific neighborhoods such as Soho and the East Village, which represent this trend,” said appraiser Jonathan Miller, of Miller Samuel.\n\n“Coming out of the pandemic, Manhattan experienced the highest rate of population growth, particularly downtown, which was further aided by many office-to-residential conversions, with many more expected,” he added. “This has resulted in a potentially higher vacancy rate compared to other boroughs, but it’s not excessive.”\n\nBy contrast, in Staten Island’s Great Kills and Jackson Heights in Queens, just two homes in each community were unoccupied, representing vacancy rates so low they are practically negligible.\n\nBut fear not, demand for city living is still ferocious, at least when it comes to renting.\n\nManhattan recently ranked among the five most competitive rental markets in the country, with new leases in June commanding a record median rent of $4,625, The Post reported.\n\nAbout 70% of tenants renewed their leases in the first quarter of 2025, leaving slim pickings for newcomers. Apartments that did hit the market attracted an average of 11 interested renters apiece, up from seven a year earlier.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/07/14/real-estate/nyc-sees-11-renters-compete-for-each-open-apartment-study/?utm_source=chatgpt.com",
    "https://nypost.com/2025/09/03/real-estate/insurance-companies-are-secretly-using-drones-to-inspect-homes/",
    "https://therealdeal.com/data/new-york/2025/manhattan-has-nycs-highest-vacancy-rate/",
    "https://nypost.com/2025/09/04/real-estate/barbara-corcorans-nyc-neighbor-asks-11-5m-for-their-penthouse/",
    "https://nypost.com/2025/09/03/real-estate/ilana-goor-asks-19m-for-her-stunning-nyc-carriage-house/",
    "https://www.attomdata.com/solutions/market-trends-data/zombie-foreclosures-report/vacancy-market-in-new-york/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "vacancy rates",
      "weight": 0.09168321
    },
    {
      "name": "downtown Manhattan",
      "weight": 0.08352903
    },
    {
      "name": "more homes",
      "weight": 0.07614523
    },
    {
      "name": "high prices",
      "weight": 0.07579911
    },
    {
      "name": "empty residences",
      "weight": 0.074798174
    },
    {
      "name": "Manhattan",
      "weight": 0.07352642
    },
    {
      "name": "city living",
      "weight": 0.070139855
    },
    {
      "name": "vacant residences",
      "weight": 0.06882242
    },
    {
      "name": "New York City",
      "weight": 0.06781563
    },
    {
      "name": "real estate data provider Attom",
      "weight": 0.06585263
    }
  ],
  "topics": [
    {
      "name": "Real Estate"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Real Estate/Other",
      "score": 0.9404296875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.916015625
    },
    {
      "name": "/News/Local News",
      "score": 0.88037109375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.53857421875
    },
    {
      "name": "/Real Estate/Real Estate Listings/Residential Sales",
      "score": 0.517578125
    }
  ],
  "sentiment": {
    "positive": 0.33837935,
    "negative": 0.36618808,
    "neutral": 0.29543257
  },
  "summary": "Manhattan has the highest percentage of vacant residences across New York City, with an estimated 1,400 apartments, or around 1.2% of its housing inventory, according to a third-quarter analysis by real estate data provider Attom. This figure has barely shifted from last year and closely matches the national vacancy rate of 1.3%. While Brooklyn may appear more vacant, its overall vacancy ratio aligns with the city average of 0.7%. The Bronx follows closely behind Manhattan's 1.1%. In ZIP code 10012, roughly 4.3% of residences sit empty, more than triple the borough and national norms. Despite this, demand for city living remains high, with new leases commanding a record median rent of $4,625.",
  "shortSummary": "Manhattan leads New York with the highest vacancy rate, with 1.2% of its housing inventory lying empty, reflecting high apartment prices.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5931f65029594616b48fcac77cb62dc5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/09/03/real-estate/ilana-goor-asks-19m-for-her-stunning-nyc-carriage-house/",
      "text": "One of Israel’s greatest artists asks $19M for her rare NYC home — and it stands to sell for the first time in decades\nHome is where the art is.\nThe celebrated Israeli artist Ilana Goor — whose seaside residence and museum in Jaffa, south of Tel Aviv, is filled to the brim with her curiosities for all visitors to explore — has put her New York City home back on the market for $19 million.\nBuilt in 1903, Goor and her husband, Leonard Lowengrub, have owned the 6,600-square-foot residence since the 1970s. Not only does this mark the first time in decades for the property to turn a new chapter, but — being a carriage house — it’s a rare dwelling to get.\nNew York’s carriage houses are disappearing relics, with some 75 still in existence, and few rise beyond two or three stories. At 178 E. 75th St., however, Goor’s stands defiantly taller.\nIts return to market also marks a dramatic reduction from its original $37.75 million ask.\nOver the years, Goor — a sculptor and designer whose work is also displayed in museums around the world — used the space as both a private home and exhibition hall, similar to what she has in Israel, layering modern interventions over exposed brick, skylights and iron.\nCurbed once described the interiors as “teeming with the widest possible range of eccentric art,” from medieval-style tapestries to rainbow abstractions and even a pink-and-blue sheep perched atop built-ins.\nListing agent Smitha Ramchandani of Christie’s International Real Estate said the home defies easy categorization.\n“It’s such an extraordinary carriage home. It’s truly rare to be on that block,” she told The Post. “It offers a blend of the historic charm and modern luxury. It has an elevator and it also has about 1,200 square feet of rooftop, which is extremely rare to have that in a townhome.”\nGoor spearheaded an ambitious renovation that added floors, a primary suite level and a rooftop terrace designed for entertaining.\n“She designed the whole thing,” Ramchandani noted. “They added and redid the whole townhouse. So the design of it was having levels of privacy in her home and her entertainment, which is the kitchen, the living room and the dining room is basically where she practically lives.”\nThe layout reflects that vision: a dramatic gallery with 22-foot ceilings adjoins a three-car drive-in garage.\nAbove, a solarium-style living room opens to a south-facing garden, while the entire fifth floor is devoted to a master suite complete with dual walk-in closets, a fireplace and roof access.\nWellness amenities include a sauna, gym, and lounge in the English basement, while terraces and the 1,200-square-foot roof deck provides outdoor retreats.\nThe townhouse is also a reflection of Goor’s wider career.\nHer home in Jaffa operates as the Ilana Goor Museum, where works by Giacometti and Albers mingle with her own industrial bronzes and welded furniture.\nAt East 75th Street, that same eclectic spirit has left its mark, with Ramchandani recalling that “when you come into this home, your eyes will never rest just because you see such beautiful things around.”\nFor decades, the couple hosted prime ministers and presidents here. Photographs displayed throughout the home capture meetings with world leaders and celebrities alike.\nAt 89 and 93, Goor and Lowengrub are reluctantly parting with the property.\n“They are coming to a different phase in their lives,” Ramchandani explained. “With their age, they’re at a point in their lives where they have to let go, but it’s very hard for them to. But at some point in your life, you can’t fight time.”\nShe describes the property as “the love house” because of the couple’s enduring partnership.\n“There’s so much love between them and when you see them and when you talk to them, it’s just incredible,” she said. “You feel amazing energy in this home.”\nDespite its artistic and personal history, the home has struggled to find a buyer in the past.\nAttempts to sell in 2007, 2008, and 2013 were unsuccessful, StreetEasy records show.\nThe current price cut reflects both market realities and the owners’ readiness to move forward.\n“This is not just real estate,” Ramchandani said. “This is a jewel, a once-in-a-lifetime opportunity to own something rare, historic and deeply inspiring.”"
    },
    {
      "url": "https://nypost.com/2025/09/03/real-estate/insurance-companies-are-secretly-using-drones-to-inspect-homes/",
      "text": "Furious homeowner says her insurance company flew a drone over her house and refused renewal — for 1 minor reason\nWhen Lynne Schueler looked up at the branches of a beloved tree in her Massachusetts yard, she never expected that a drone might be looking down on her.\nSchueler, who had held a policy with the same insurer for more than a decade, was shocked to receive an email containing an aerial photo of her home and a warning that she had six weeks to cut back limbs hanging over her roof — or lose her coverage.\n“It was very invasive, because they had taken a picture of my house without me knowing, which was really kind of crazy,” she told CBS News Boston in an interview.\nThe longtime policyholder said she felt trapped: removing the branches cost $1,200, but losing coverage could have jeopardized her mortgage.\n“I had insurance with this company for the last 12 years, with no claims,” she said. “I’ve been a good customer to them.”\nIndustry critics say Schueler’s experience is increasingly common as insurers adopt aerial imaging to assess risk.\n“I think it’s becoming very, very common,” Amy Bach, executive director of consumer group United Policyholders, told CBS.\nShe added that insurers are now dropping customers based on images that show “mold on your roof,” “damaged roof tiles” or “trees touching your house.”\nOther homeowners across the country have faced similar surprises.\nMike Arman, near Daytona Beach, Fla., previously told the Daily Mail he was twice “spied on” by insurers despite not having made a claim in 52 years.\nHe recalled being told his roof had problems based on satellite footage which “looked like it was taken in 1936,” and said the company “refused to come and see his home in person” despite being located just three miles away.\nIn California, longtime customer Joan Van Kuren told CBS she was stunned when her insurer of almost four decades dropped her after a drone captured what it labeled “hazardous” renovation clutter.\nInsurers contend that aerial photos are less intrusive than sending adjusters to homes. Lawmakers, however, are beginning to push back.\nIn Massachusetts, State Rep. David LeBoeuf has introduced legislation that would require companies to provide homeowners with copies of any photos taken, noting on social media that the bill “would give homeowners date stamped copies of the images and an opportunity to repair any identified damages or identify errors in the findings of the image analysis.”\nCalifornia Assemblymember Lisa Calderon has advanced a similar proposal, warning that “we are in the middle of an insurance crisis and Californians are facing nonrenewals or policy cancellations, sometimes without justification,” in a press release.\nShe said constituents “deserve to have access to important information regarding the coverage of one of their most valuable assets.”\nBut advocates argue these efforts still fall short.\n“This can be done through time stamps on aerial images and set timeframes on how old they can be,” Emily Rogan, senior program officer at United Policyholders, said.\nShe added that customers should “have the chance to correct misinformation or errors and stay insured.”\nFor Schueler, whose branches were cut just in time to keep her policy, the experience has left a lasting unease.\n“I wasn’t home because my car wasn’t in the driveway,” she said. “It ended up costing $1,200. I had no choice.”"
    },
    {
      "url": "https://nypost.com/2025/09/04/real-estate/barbara-corcorans-nyc-neighbor-asks-11-5m-for-their-penthouse/",
      "text": "Real-estate mogul Barbara Corcoran sold her Fifth Avenue penthouse in just one day in May — and it appears her next-door neighbor took note of the success.\nAn 11-room penthouse alongside Corcoran’s former pad listed for $11.5 million this week, according to a StreetEasy listing update.\nThis isn’t the first time the rare Fifth Avenue duplex has attempted to sell, but if Corcoran’s recent deal is anything to go by, it might not be on the market for long.\nThe Upper East Side home is perched atop the 15th floor of 1158 Fifth Ave., a white-glove co-op circa 1924.\nThe prewar building, located at Fifth Avenue and 97th Street, boasts Central Park and city skyline views.\nThe listing, held by Linda Maloney of Sotheby’s International Realty, calls the home’s wraparound terrace its “crown jewel.”\nThe listing advertises five bedrooms and five full bathrooms, including a primary bedroom with a private terrace. The sprawling residence also features an eat-in chef’s kitchen and a formal dining room.\nAmenities include ample built-ins, laundry rooms on both floors and two fireplaces — one gas, one woodburning.\nThe fresh listing comes less than four months after the home’s high-profile neighbor listed and sold her similarly well-appointed home in less than 24 hours.\nCorcoran, founder of the Corcoran Group, purchased the duplex next-door for $10 million in 2015, according to city records. She undertook extensive renovations of the 4,600-square-foot aerie, including flipping the floor plan, installing a chef’s kitchen and transforming her terrace greenhouse into a dining area.\nThe $12 million asking price was below her total investment, the New York Times reported. Corcoran told the outlet that she “never thought” she would leave. She has since relocated to a one-story apartment in the same Carnegie Hill neighborhood.\nCorcoran’s penthouse remains in contract, so its eager buyer and their final price remain under wraps until the sale officially closes.\nThe newly listed duplex was purchased in 2005 for $3.01 million, according to city records. The owners tried to sell for $8.9 million in 2010, according to StreetEasy, but they ultimately removed the listing after 6 months.\nBoth homes atop the 1158 Fifth Ave. edifice enjoy a 24-hour doorman and concierge, a live-in resident manager, a fitness center and bike storage — but if you can get views like this, you can probably afford a cab."
    },
    {
      "url": "https://nypost.com/2025/07/14/real-estate/nyc-sees-11-renters-compete-for-each-open-apartment-study/?utm_source=chatgpt.com",
      "text": "Here’s how many renters compete for 1 NYC apartment — but it’s worse elsewhere in the nation\nSurprise, surprise: Manhattan currently ranks among the top five most competitive rental markets in the country.\nThe Big Apple rose the ranks of RentCafe’s most recent report on rental competitiveness nationwide. Manhattan is currently the fifth most competitive rental market in the country, according to the data. Demand is high, turnover is low and vacancies are brief.\nIt’s the rental market that never sleeps.\nManhattan’s median rent reached another record high in June, according to a report by appraiser Miller Samuel and Douglas Elliman, marking the fourth broken record in five months.\nNot only was the median rent on a new Manhattan lease a whopping $4,625 last month, but the competition for these units is fiercer than ever.\nIn Manhattan, 25% of rentals incurred bidding wars in June — a fraught process typically reserved for homeowners.\nMore than half of Manhattan renters understandably chose to stay put in the first quarter of 2025, according to RentCafe’s analysis of Yardi data. Lease renewals reached 70% in that period. Fewer vacant apartments meant crowded open houses — 11 renters were competing for each open apartment, the report found. That’s an increase from just seven renters pet unit during the same period last year.\nThe high-pressure environment is resulting in vacant apartments leaving the market five days faster than the same period last year, resulting in the typical rental unit spending an average of 45 days for rent.\nManhattan certainly isn’t the only city where renters are feeling the heat. Miami renters are facing far greater competition for housing, according to RentCafe. The Sunshine State’s largest city boasts an occupancy rate of 96.6% in the first quarter of 2025, with 21 prospective renters per unit and average vacancies of just over a month.\nSuburban Chicago and Broward County, Florida took second and third places, followed by Eastern Los Angeles and suburban Philadelphia.\nFierce competition for rentals in Florida locales like Miami and Broward County contrast sharply with reports of stalling home sales across the state. Broward County saw an 18% year-over-year decline in home sales and a 24% drop in condo closings in May, according to recent data from the Miami Association of Realtors.\nHomebuyer hesitancy extends from the Floridian coast to the Big Apple.\n“With high mortgage rates and economic uncertainty, renting is looking more attractive than buying for many people right now,” said Doug Ressler, manager of business intelligence at Yardi Matrix, which provides data to RentCafe."
    },
    {
      "url": "https://therealdeal.com/data/new-york/2025/manhattan-has-nycs-highest-vacancy-rate/",
      "text": "Manhattan has the greatest share of empty homes among New York City’s boroughs.\nNearly 1,400 out of Manhattan’s 122,000 homes — 1.2 percent — are vacant in the Big Apple’s third most populous county, a figure relatively unchanged from the same time last year, according to a third-quarter analysis of Attom data by The Real Deal.\nThat’s in line with the national vacancy rate of roughly 1.3 percent, which covers some 1.4 million homes and also has remained fairly constant for more than three years, according to Attom.\nThe real estate data provider looked at public records on foreclosure status, equity and owner-occupancy status and vacancy data for metro areas with at least 100,000 residential properties, counties with at least 50,000 residential properties and zip codes with at least 1,000 residential properties. Attom defined homes as residential properties with one to four housing units.\nBronx had the second-highest vacancy rate among the boroughs. About 840 out of nearly 76,500 are empty, or 1.1 percent.\nSubscribe to TRD Data to unlock this content\nThe Manhattan zip code with the largest share of empty residential properties is 10012, which covers Soho and the East Village. The vacancy rate there was about 4.3 percent, almost three and a half times greater than Manhattan’s and the country’s rates and nearly flat from the quarter before.\nThe zip code with the second-highest percentage of vacant homes, of just under 4 percent, covers Fordham, Little Italy and Jerome Park in the Bronx.\nOverall, the vacancy rate for New York City is about 0.7 percent, nearly flat from the second quarter.\nIt’s also the same as Brooklyn’s vacancy rate. Brooklyn, the city’s most populous borough, has the greatest share of the city’s nearly 5,900 vacant homes, at just over 29 percent.\nSubscribe to TRD Data to unlock this content\nMeanwhile, the zip codes with the lowest vacancy rates are in Staten Island and Jackson Heights, Queens. Staten Island’s Great Kills area, so far for the quarter, had a vacancy rate of 0.02 percent, and Jackson Heights’ rate was 0.08 percent. Just two homes in each of those neighborhoods are vacant.\nSubscribe to TRD Data to unlock this content\nThis article has been updated to clarify Attom’s definition of homes as it pertains to the data set."
    }
  ],
  "argos_summary": "Manhattan now has the highest vacancy rate among NYC boroughs, with about 1,400 apartments (1.2% of inventory) empty, largely driven by conversions and high prices. The 4.3% vacancy in ZIP 10012 (Soho/East Village) is triple the borough average, while other boroughs like Brooklyn and Bronx have lower rates. Despite the vacancy, Manhattan remains one of the most competitive rental markets, with record median rents of $4,625 and high demand.",
  "argos_id": "5KA1VGBXO"
}