{
  "url": "https://www.bloomberg.com/news/videos/2025-09-04/balance-of-power-late-edition-9-02-2025-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "69ffc56dff7a461db891c52cd76c3181",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i7Hcup5_2AuY/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T00:07:06.516000+00:00",
  "addDate": "2025-09-04T00:32:25.091250+00:00",
  "refreshDate": "2025-09-04T00:32:25.091252+00:00",
  "score": 1.0,
  "title": "Stephen Miran Faces Senate Hearing",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, Massachusetts Senator Elizabeth Warren says she believes the senate banking committee should be having a hearing Thursday but she believes there should be an oversight committee investigating the President's attacks on the federal reserve. Representative Byron Donalds (R-FL) states he does support the release of the Jeffrey Epstein files and discusses the two different provisions that are being moved in Congress. United States Energy Secretary Chris Wright discusses the Trump Administration’s moves impacting the energy sector. (Source: Bloomberg)",
  "content": "> > THIS IS \"BALANCE OF POWER,\" LIVE FROM WASHINGTON, D.C. JOE: FROM BLOOMBERG'S WASHINGTON DC STUDIOS TO OUR TV AND RADIO AUDIENCES WORLDWIDE, WELCOME TO \"BALANCE OF POWER.\" I'M JOE MATHIEU ALONGSIDE KRITI GUPTA. TRUMP ACCUSES CHINA OF CONSPIRING AGAINST THE U.S. WITH VLADIMIR AND KIM. > > I THOUGHT IT WAS A BEAUTIFUL CEREMONY, VERY IMPRESSIVE. BUT I UNDERSTAND THE REASON THEY ARE DOING IT AND HOPING I WAS WATCHING. AND I WAS WATCHING. MY RELATIONSHIP WITH ALL OF THEM IS VERY GOOD. WE ARE GOING TO FIND OUT HOW GOOD IT IS OVER THE NEXT WEEK OR TWO. JOE: PRESIDENT TRUMP MEETING WITH POLAND'S PRESIDENT GIVING OXYGEN TO HIS CONSPIRACY THEORY AGAINST THE LEADERS OF CHINA, RUSSIA, AND IT NORTH KOREA AS THE NEW SHOW OF FORCE WAS ON FULL DISPLAY IN BEIJING. KRITI: THE PRESIDENT STRIVE TO RESHAPE THE FEDERAL RESERVE REACHES A NEW MILESTONE. WE PREVIEW THE SENATE HEARING TAKING PLACE TOMORROW, STEPHEN MIRON PREPARES TO TAKE THE HOT SEAT, SENATOR ELIZABETH WARREN JOINS US IN MOMENTS. JOE: D.C., L.A., AND SOON NEW ORLEANS. THE PRESIDENT PUBLICLY THREATENS TO SEND THE NATIONAL GUARD IN THE BIG EASY. WHAT HE SAID AS HIS OWN ATTORNEY GENERAL AND HOMELAND SECURITY SECRETARY WERE ON THE GROUND. A LIVE REPORT COMING UP. WE WILL SPEAK WITH CONGRESSMAN BYRON DONALDS ABOUT THAT AND MORE. KRITI: THE ADMINISTRATION WRAPPING ITS -- REPORTING THE WHITE HOUSE WORKING TO BLOCK THE DEVELOPMENT OF ONSHORE WIND PROJECTS. THE IMPACT OF THOSE MOVES ARE HAVING ON THE INDUSTRY WHEN THE ENERGY SECRETARY JOINS US UP AHEAD. WE HAVE ALL THAT PLUS EXCLUSIVE REPORTING ON APPLES PUSHING TO AI. WE GO TO ROMAINE BOSTICK FOR THE POWER MOVES. WE START AT THE WHITE HOUSE. DONALD TRUMP SITTING DOWN WITH POLAND'S PRESIDENT COMMENTING ON EVERYTHING FROM THE UKRAINE WAR AND RELATIONS WITH CHINA TO THE NATIONAL GUARD, ECONOMY, AND MORE. JOINING US IN WASHINGTON IS NICK WADHAMS. WE GOT OF TON OF INFLOW OF INFORMATION. > > A COUPLE OF THINGS, VERY SUCCESSFUL VISIT FOR THE POLISH PRESIDENT. HE ESSENTIALLY GOT A GUARANTEE FROM PRESIDENT TRUMP THE U.S. WOULD NOT ABANDON POLAND AS IT LOOKS TO POTENTIALLY REORIENT ITS TROOPS AROUND EUROPE. YOU SAW THE SOLIDITY OF THAT RELATIONSHIP, POLAND HAS WALKED A TRICKY BALANCE BETWEEN BEING A STRONG ALLY OF THE PRESIDENT AND A KEY SUPPORTER OF UKRAINE. IF YOU DID NOT SEE A LOT OF DISTANCE OR SEPARATION. IN THE SIGNALING BY THE PRESIDENT AS WE SAW AT THE TIME OF THE SHOW ON THIS MEETING IN CHINA THE FACT WE THOUGHT IT WAS AN IMPRESSIVE CEREMONY. IT WAS CLEARLY AN EVENT THAT ORIENTED TO HAVE THREE LEADERS THUMB THEIR NOSE AT THE PRESIDENT AND SOLIDIFY THEIR OWN RELATIONSHIP, WHICH IN PREVIOUS TIMES WAS EXACTLY WHAT U.S. PRESIDENTS HAD SOUGHT TO AVOID. JOE: HE SEEMED TO NOTICE THAT AND WROTE TO PRESIDENT XI, GIVE MY WARMEST REGARDS TO VLADIMIR PUTIN KIM JONG-UN AS YOU CONSPIRE THE U.S. OF AMERICA. WHAT ARE THEY CONSPIRING ON? > > IT IS ALWAYS DIFFICULT TO GET INSIDE THE PRESIDENT'S HEAD. THIS IS A RELATIONSHIP BETWEEN THE THREE OF THEM THAT HAS BEEN GROWING FOR QUITE SOME TIME. CHINA HAS A LONG-STANDING RELATIONSHIP WITH NORTH KOREA. DESPITE THE BEST U.S. EFFORTS, CHINA AND RUSSIA SEEM TO BE SOLIDIFYING THE RELATIONSHIP EVEN THE BIDEN ADMINISTRATION SOUGHT TO PULL CHINA AWAY FROM RUSSIA. WHAT YOU SEE THE PRESIDENT SIGNAL IS CONCERNED ABOUT WHAT HAPPENS NEXT IN UKRAINE. CHINA HAS PROVIDED SOME SUPPORT. THOUGH THE PAST ADMINISTRATION WAS CAREFUL TO SAY IT WAS NOT PROVIDING DIRECT BATTLEFIELD SUPPORT TO RUSSIAN FORCES IN UKRAINE. WE KNOW NORTH KOREA HAS SENT TROOPS TO UKRAINE, WHICH HAS BEEN A CRUCIAL ASSET FOR VLADIMIR PUTIN. AS PRESIDENT TRUMP SEEKS TO WITHDRAW U.S. SUPPORT FOR UKRAINE. WHAT HAPPENS ON THE OTHER SIDE, WHAT DO THEIR ADVERSARIES DO? DOES IT TRIGGER THE PRESIDENT TO SAY WE HAVE TO DO SOMETHING TO SUPPORT? POSSIBLE THAT IS WHAT HE WAS ALLUDING TO AND YOU WILL SEE IT IN A WEEK OR TWO. HARD TO SAY. > > YOU WONDER IF YOU WOULD HAVE MADE THE SAME REMARKS WITH THOSE OPTICS OUT OF BEIJING. THANK YOU FOR GETTING US STARTED. A MAJOR STEP IN PRESIDENT TRUMP'S EFFORT TO RESHAPE THE FEDERAL RESERVE STARTS TOMORROW. DURING A MUCH-ANTICIPATED COMMITTEE HEARING WITH THE PRESIDENT'S CHAIR ON THE COUNCIL OF ECONOMIC ADVISOR, WHO YOU HAVE HEARD AND SEEN ON THIS PROGRAM. TESTIFYING FOR AN INTERIM ROLE ON THE FEDERAL RESERVE. THE PIMCO MANAGING DIRECTOR OF PUBLIC POLICY SAID THIS ABOUT THE PROCESS. > > THE MARKETS ASSUME WHOEVER THE PRESIDENT, ANY PRESIDENT NOMINATES WILL LIKELY GET CONFIRMED. IN MOST CASES, THAT IS TRUE. FOR THIS PARTICULAR POSITION, WE DO THINK ANY SORT OF FED NOMINEE IS GOING TO BE REALLY QUESTIONED. BY DEMOCRATS OF COURSE. BUT ALSO BY REPUBLICANS. THE FIRST STEP TOWARDS SENATE CONFIRMATION IS THE SENATE BANKING COMMITTEE. > > HELPING SET THE TABLE FOR WHAT WOULD BE A HEARING BEGINNING TOMORROW MORNING AND ENDING AROUND LUNCHTIME. STEPHEN MIRON MAY NOT HAVE SIGNED UP TO TAKE THE FLAK SURROUNDING LISA COOK WHICH I SUSPECT WILL MOTIVATE DEMOCRAT QUESTIONS. > > A LOT OF QUESTIONS, A LOT ABOUT THE PREPARED REMARKS ARE DRESSED IN TERMS OF THE INDEPENDENCE HE SUGGESTS IS NEEDED. A LOT OF DOUBTS CAST ON THAT. > > WE WILL TALK SOMEONE WHO KNOWS ABOUT THIS. JOINING US FROM CAPITOL HILL IS A DEMOCRATIC SENATOR ELIZABETH WARREN OF MASSACHUSETTS. THE RANKING MEMBER ON THE SENATE BANKING COMMITTEE I SUSPECT HAS A FEW QUESTIONS. WELCOME BACK TO BLOOMBERG TV AND RADIO. THE FIRST HEARING FOR STEPHEN MIRON TO JOIN THE FEDERAL RESERVE BOARD OF GOVERNORS. WE WILL SEE THIS TOMORROW. OPENING REMARKS, PREPARED REMARKS RELEASED. THE MOST IMPORTANT JOB OF THE CENTRAL BANK IS DEPRESSIONS OF HYPERINFLATION'S. DO YOU AGREE, -- > > CAN WE BACK A TINY LITTLE BIT? THE BANKING COMMITTEE SHOULD BE HOLDING A HEARING TOMORROW. IT SHOULD NOT BE A BUSINESS AS USUAL, LESS GREASE THE SKIDS AND RUN THROUGH DONALD TRUMP'S NOMINEE FOR THE FED. INSTEAD WE SHOULD BE HAVING A WHOLE OVERSIGHT HEARING ABOUT DONALD TRUMP'S UNPRECEDENTED ATTACKS ON THE INDEPENDENCE OF THE FED. HE'S MADE THREE HARD RUNS AT THE FED OVER THE PAST FEW MONTHS TRYING TO FIRE JEROME POWELL, TRYING TO FIRE HIM FOR CAUSE, TRUMPING UP CHARGES AROUND HOW MUCH MONEY HE HAD SPENT IN THE FED BUILDING REHABILITATION. NOW TRYING TO FIRE LISA COOK. DONALD TRUMP IS MAKING A MOVE TO TRY TO DESTROY THE INDEPENDENCE OF THE FEDERAL RESERVE BANK. UNLIKE ANYTHING THAT HAS EVER BEEN DONE IN AMERICAN HISTORY. RIGHT NOW, THE REPUBLICANS WHO RUN THE COMMITTEE ARE SAYING LET'S HAVE A BUSINESS AS USUAL, LET'S BRING THE DONALD TRUMP NOMINEE IN AND MOVE HIM THROUGH. I WANT TO BE CLEAR IT IS A MISTAKE. IT IS A RESPONSIBILITY TO ADDRESS THE QUESTION OF FED INDEPENDENCE FIRST. > > SENATOR WARREN, LET'S TALK ABOUT LISA COOK. YOU'RE CALLING FROM NORTH CAROLINA SAID HE WOULD NOT CONSIDER NOMINATING SOMEONE TO TAKE HER PLACE WHILE THE LITIGATION WAS ONGOING. THE SUPREME COURT FOR EXAMPLE DOES RULE IN FACT WHILE THE LITIGATIONS ARE GOING TO FIGURE OUT WHETHER HER FIRING WAS LEGAL, WOULD YOU BE WILLING TO BLOCK DONALD TRUMP'S NOMINEE TO FILL THAT SEAT? > > DONALD TRUMP CANNOT FIRE LISA COOK BASED ON AT LEAST THE FACTS OR NON-FACTS PRESENTED THUS FAR. THIS IS ABOUT INDEPENDENCE OF THE FED AND DONALD TRUMP'S EFFORTS TO SEIZE CONTROL OVER THE FED. I WOULD TRYING TO BLOCK THAT AND I WOULD THINK THE REPUBLICAN SENATORS WHO ALSO CARE ABOUT INDEPENDENCE OF THE FED WOULD DO THE SAME. I WANT TO REMIND EVERYONE WHY WE HAVE AN INDEPENDENT FED. THAT IS TRUE WHETHER YOU HAVE A DEMOCRAT IN THE WHITE HOUSE OR REPUBLICAN IN THE WHITE HOUSE. IN THEORY, YOU HAVE A GROUP OF PEOPLE WHO LOOK AT THE ECONOMIC NUMBERS AND THEY MAKE DECISIONS ON THINGS LIKE INTEREST RATES AS BEST THEY CAN BASED ON THOSE NUMBERS. NOT BASED ON POLITICAL PRESSURE FROM THE PRESIDENT OF THE UNITED STATES. IF DONALD TRUMP DESTROYS THAT, HE MAY BE ABLE TO GET WHAT HE WANTS ON INTEREST RATES IN THE SHORT TERM. BUT HE UNDERMINES CONFIDENCE IN THE FED AND ITS DECISION-MAKING AND ITS RATESETTING. WE HAVE SEEN THIS BEFORE. WHEN AUTOCRATS HAVE TAKEN OVER CENTRAL BANK IN PLACES LIKE TURKEY, WHAT HAPPENS IS INTEREST RATES SHOOT THROUGH THE ROOF. THAT IS A REAL PROBLEM FOR OUR ECONOMY. EVERYBODY HAS A STAKE IN AN INDEPENDENT FED. AND TO LET DONALD TRUMP DESTROY THAT WITHOUT EVEN PUSHING BACK IS A TERRIBLE MISTAKE. KRITI: IF THE SUPREME COURT RULES A NOMINEE CAN ACTUALLY TAKE HER PLACE, HOW WOULD YOU PLAN ON BLOCKING THAT? > > I'M IN THE MINORITY. I UNDERSTAND THAT. BUT I WOULD TRY TO PERSUADE MY REPUBLICAN COLLEAGUES THAT IT WOULD BE A TERRIBLE MISTAKE TO HELP DONALD TRUMP IN EFFECT, DESTROY THE INDEPENDENCE OF THE FED. THIS IS NOTHING NEW IN THE SENSE , GO BACK AND LOOK AT IT. THERE ARE MANY REPUBLICAN SENATORS WHO IN TIMES PAST HAVE TALKED ABOUT THE IMPORTANCE OF THE INDEPENDENCE OF THE FED. THAT IS NOT LIKE A DEMOCRATIC POSITION OR A REPUBLICAN POSITION, IT IS A POSITION THAT THOSE OF US TRYING TO WATCH THIS ABOUT HOW REGULATION OF THE ECONOMY WORKS. UNDERSTAND THAT FROM THE BEGINNING, PROVIDING SOME INSULATION FOR THE FINANCIAL DECISION-MAKERS LIKE THE PEOPLE WHO SET INTEREST RATES, TO INSULATE THEM FROM THE POLITICAL SIDE OF THE HOUSE FROM THE PRESIDENT OF THE UNITED STATES. IT IS ULTIMATELY GOOD FOR THE ECONOMY AND THAT IS WHY OUR FED INTEREST RATES SETTING IS THE GOLD STANDARD FOR THE WORLD AND DONALD TRUMP WANTS TO BURN THAT DOWN. JOE: SENATOR, I KNOW THIS SOUNDS LIKE IT IS TURNING INTO A HEARING THAT WILL BE ATYPICAL AND SOMETHING WE ARE WATCHING AND BRINGING TO OUR VIEWERS AND LISTENERS ON BLOOMBERG. I WANT TO ASK ABOUT OTHER STORIES MAKING NEWS. ONE FROM THE NEW YORK TIMES HAS TO DO WITH THE NEW YORK MAYORAL RACE. NOTHING I WOULD TEND TO ASK YOU ABOUT, BUT DONALD TRUMP IS REPORTEDLY CONSIDERING GIVING ROLES TO SOME OF THE CANDIDATES. INCLUDING ERIC ADAMS FOR A JOB AT HUD. THE IDEA BEING COURTEOUSLY AS WELL. THE CLEAR LANE FOR ANDREW CUOMO. I DON'T KNOW IF YOU BUY THAT REPORTING, BUT YOU WOULD HAVE TO CLEAR A NOMINEE TO RUN HUD. IS THAT SOMETHING YOU WOULD BE PREPARED TO DO? > > IT DEPENDS ON WHAT SECRETARY ADAMS IS NOMINATED FOR. THERE'S A LOT OF JOBS AT HUD THAT DON'T REQUIRE SENATE CONFIRMATION. WE ALREADY HAVE A HEAD OF HUD. I DON'T KNOW IF DONALD TRUMP IS PROPOSING THE PART THAT IS TRIPLE UNDERLINED IS DONALD TRUMP SUPPORTS ANDREW CUOMO TO BE MAYOR OF NEW YORK. THAT IS ALL THIS IS ABOUT. AND HE'S WILLING TO BRING THE FORCE OF THE UNITED STATES GOVERNMENT TO USE HIS TOOLS, HIS PRESIDENT OF THE UNITED STATES, NOT ON BEHALF OF THE PEOPLE OF THE UNITED STATES, NOT ON BEHALF OF FINDING THE BEST NOMINEE FOR POSITION AT HUD. BUT TO BE ABLE TO MANIPULATE THE MAYORAL RACE IN ANDREW CUOMO, IN NEW YORK CITY. THAT IS NOT ONLY WRONG TO DONALD TRUMP, I CAN'T IMAGINE THIS IS GOING TO MAKE THE PEOPLE OF NEW YORK CITY SAY WOOHOO, ANDREW CUOMO IS MY GUY. I THINK IT WILL MAKE THE PEOPLE OF NEW YORK CITY SAY OUR CITY IS NOT FOR SALE TO DONALD TRUMP. > > WE WILL SEE WHERE THE STORY GOES. CANNOT GET AWAY FROM THE STORY SURROUNDING JEFFREY EPSTEIN FILES. IT WOULD BE A SERIES OF APPROACHES ON CAPITOL HILL TO GET THE FILES RELEASED AND SHED LIGHT ON THE STORIES OF VICTIMS WHO HELD THE NEWS CONFERENCE. PRESIDENT TRUMP WAS ASKED ABOUT THIS, PART OF HIS RESPONSE WAS IT IS REALLY A DEMOCRAT HOAX. I KNOW THAT NO MATTER WHAT YOU DO, IT IS GOING TO KEEP GOING. IS HE RIGHT THIS IS A DEMOCRAT HOAX? > > NO. THIS IS NOT THE DEMOCRATS. THIS IS DONALD TRUMP'S OWN STATEMENTS WHEN HE WAS RUNNING FOR PRESIDENT OF THE UNITED STATES. GO BACK AND PLAY THE CLIPS. WHEN HE AND OTHER REPUBLICANS PROMISED, PROMISED, PROMISED IF DONALD TRUMP BECAME PRESIDENT AND REPUBLICANS WERE IN CONTROL, THEY WOULD RELEASE ALL OF THE EPSTEIN FILES. SO DO IT. JUST DO IT. I DON'T MEAN PART OF THEM, DO A LITTLE BLACKOUT, A LITTLE HERE OR THERE, THAT IS KEEPING THIS STORY ALIVE AND YOU HAVE TO ASK YOURSELF IF DONALD TRUMP WANTS THIS STORY TO THE STORY TO GO AWAY, THE WAY TO DO THAT IS TO RELEASE THE DOCUMENTS. IF HE THINKS THAT IS NOT GOING TO WORK, WHAT IS IN THOSE FILES? > > A FINAL QUESTION TO YOU. PERHAPS CIRCLING BACK TO WHERE WE STARTED ON THE ECONOMY. ONE OF THE CRITICISMS WE KNOW JAY POWELL HAS FACED FROM VARIOUS MEMBERS OF WASHINGTON INCLUDING TRUMP, IS NOT CUTTING INTEREST RATES IN THE FACE OF INFLATION. SOMETHING STEPHEN MIRON HAS BEEN TALKING ABOUT SIGNIFICANTLY AS WELL. CAN YOU EXPLAIN TO OUR WALL STREET AUDIENCE WHY RATE CUTS MAKE SENSE IF THERE IS A RISK OF EXASPERATING THE IMPACT OF DONALD TRUMP'S TARIFFS ON INFLATION? > > I STARTED TWO YEARS AGO SAYING THE DATA ON INFLATION, SHOWING INFLATION WAS COMING DOWN, UNDER BETTER CONTROL, MEANT POWELL SHOULD START RATE CUTS. I THOUGHT IT WAS ENTIRELY APPROPRIATE. I DID MY BEST TO PERSUADE HIM IN A VERY PUBLIC WAY. AND I DID NOT SUCCEED. THEY DID ONE RATE CUT BUT THAT WAS IT. NOW WHAT POWELL HIMSELF SAID IN DONALD TRUMP AT NOT CREATED SO MUCH CHAOS WITH THE TARIFFS AND WHAT HE HAS DONE TO THE ECONOMY, THAT THE FED WOULD HAVE CUT RATES LAST FEBRUARY. THAT MEANS BASICALLY FOR SIX MONTHS, AMERICANS HAVE BEEN PAYING MORE ON THEIR CREDIT CARDS, INTEREST ON THEIR CAR LOANS, MORE INTEREST ON HOME MORTGAGE, HOME EQUITY LINES OF CREDIT. PAYING MORE BECAUSE OF THE CHAOS THAT DONALD TRUMP HAS CREATED WITH TARIFFS. I HAVE BEEN SOMEONE WHO THINKS INTEREST RATES SHOULD COME DOWN. BUT THE BIGGEST OBSTACLE TO THAT HAPPENING IS DONALD TRUMP HIMSELF. IF HE WANTS TO SEE INTEREST RATES COME DOWN, THEN STOP CREATING THE CHAOS IN THE ECONOMY AND STOP THIS TARIFF 50%, 10%, 100 27%. IT KEEPS BUSINESSES FROM BEING ABLE TO PLAN, FROM BUYING NEW EQUIPMENT AND MAKING INVESTMENTS KEEPS BUSINESSES FROM HIRING MORE PEOPLE. DONALD TRUMP IS IN THE NUMBER ONE REASON IN AMERICA THAT WE DO NOT HAVE A LOWER INTEREST RATE TODAY. > > SENATOR WARREN, WE WILL HAVE TO WRAP UP THE CONVERSATION. THANK YOU FOR YOUR TIME. JOE: WITH A CLOSER LOOK ON WHERE MARKETS CLOSED, POWER MOVES WITH ROMAINE BOSTICK WHO JOINS US FROM WORLD HEADQUARTERS. > > ALL OF THE POWER IN THE MARKETS CAME FROM APPLE AND ALPHABET. WITHOUT THOSE NAMES, THE S & P WOULD HAVE FINISHED THE DAY IN THE RED. IT DID GAIN ABOUT .5%. THIS ON THE BACK OF THE U.S. ANTITRUST RULING THAT WAS FAVORABLE TO ALPHABET AND ITS GOOGLE CHROME SERVER. MORE IMPORTANTLY FAVORABLE TO THE RELATIONSHIP APPLE HAS WITH GOOGLE AS WELL. AND A LITTLE BIT EARLIER TODAY, MARK GURMAN SIDING FROM PEOPLE FAMILIAR WITH THAT RELATIONSHIP. IT WILL DEEPEN AS APPLE IS SET SOMETIME EARLY NEXT YEAR TO UNVEIL ITS A.I. STRATEGY WITH SIRI INTEGRATION THAT WOULD INCLUDE A PARTNERSHIP WITH GOOGLE AND GEMINI. THOSE ARE THE BIG MOVERS. THE BIGGEST MOVER IN THE AFTER HOURS TRADE RIGHT NOW IS AMERICAN PEOPLE. THE RETAILER UP MORE THAN 20%. EARNINGS WHO QUITE FRANKLY WERE NOT ACTUALLY GOOD. SALES WERE DOWN ABOUT 1%. A STOCK THAT HAS ONE WAY OR THE OTHER BECOME THRUST INTO THE CULTURE WARS. RALLYING MORE THAN 20% SINCE LATE JULY AFTER THE COMPANY UNVEILED THAT SIDNEY SWEENEY THAT PEOPLE FOUND OFFENSIVE AND FOLKS ON THE OTHER SIDE OF THE AISLE -- I DON'T KNOW IF ENCOURAGING IS THE RIGHT WORD. RAISING ITS GUIDANCE, REINSTATING ITS GUIDANCE, NOW A LOT OF PEOPLE SPECULATING HE WILL ANTICIPATE AN ACCELERATION IN SALES. THAT CAME ON JULY 23. THE QUARTER ENDED ON AUGUST 2 SO WE HAVE NOT SEEN MUCH OF AN IMPACT. FOR THOSE COMPANIES THINKING THEY DON'T WANT TO BE CAUGHT UP IN THE CULTURE WAR, THE COMPANY SAYING THE SIDNEY SWEENEY CAMPAIGN WILL CONTINUE. MAYBE A NOD TO THE LATE GREAT OSCAR WILDE WHO ONCE QUIPPED THE ONLY THING WORSE THAN BEING TALKED ABOUT IS NOT BEING TALKED ABOUT AT ALL. KRITI: THE HORROR, THE SCANDAL. ROMAINE BOSTICK GOING THROUGH. BACK HERE IN WASHINGTON, SURVIVORS OF JEFFREY EPSTEIN SEX TRAFFICKING RING CALLED ON CONGRESS. IT WOULD REQUIRE THE TRUMP ADMINISTRATION TO RELEASE ALL UNCLASSIFIED MATERIAL GATHERED IN A FEDERAL INVESTIGATION OF THE OPERATION INCLUDING INFORMATION ON CLIENTS WHO ABUSE UNDERAGE GIRLS. > > TRANSPARENCY IS JUSTICE. RELEASE THE FILES. STAND WITH US DECLARING NO ONE, NO BILLIONAIRES ARE POLITICIANS, NOT WORLD LEADERS IS ABOVE THE LAW. NOW TO AS SURVIVORS, WE WILL CONFIDENTIALLY COMPILE THE NAMES WE ALL KNOW WERE REGULARLY IN THE EPSTEIN WORLD. AND FOR SURVIVORS. A HEART-WRENCHING DAY IN WASHINGTON. BYRON DONALDS OF FLORIDA IS RUNNING TO BE STATES GOVERNOR. THANK YOU SO MUCH FOR YOUR TIME TODAY. A VERY SIMPLE QUESTION GIVEN THE EVENTS OF THE DAY. SHOULD SPEAKER MIKE JOHNSON BRING THAT ABOUT TO THE FLOOR? HOW WOULD YOU VOTE? > > LET'S BE CLEAR ABOUT WHAT IS HAPPENING IN CONGRESS. I DO SUPPORT THE RELEASE OF THE FILES. THERE ARE TWO PROVISIONS MOVING THROUGH CONGRESS. ONE IS THE DISCHARGE PETITION BY REPRESENTATIVE MASSIE, BROUGHT BY CHAIRMAN COMEAU OF THE OVERSIGHT COMMITTEE. WHAT I SUPPORT IS THE OVERSIZE COMMITTEE APPROACH TO ENSURE THAT INFORMATION IS GONE THROUGH. IN THOSE FILES ARE RELEASED. THERE ARE CONCERNS ON THE HILL ABOUT REPRESENTATIVE MASSIE'S APPROACH THAT IT WOULD NOT PROTECT SURVIVORS WHO BY THE WAY, SOME OF WHICH HAVE NOT COME FORWARD. SOME OF WHICH MAY CHOOSE NOT TO BE KNOWN PUBLICLY. IT HAS TO BE A SYSTEMATIC PROCESS OF HOW WE RELEASE THE FILES IF CONGRESS WILL MAKE THAT ORDER. WE HAVE NEVER RELEASED THE FILES FROM A CRIMINAL INVESTIGATION BEFORE, NOT TO MY KNOWLEDGE. THIS HAS TO BE DONE IN A SYSTEMATIC PROCESS IN MY VIEW. JOE: YES ON THE OVERSIGHT, NO ON THE DISCHARGE POSITION. WE APPRECIATE THE ANSWER. I WONDER IF YOU HEARD WHAT PRESIDENT TRUMP TODAY HAD TO SAY ABOUT THIS? HE WAS IN THE OVAL OFFICE AND REPORTERS WERE ASKING ABOUT DIFFERENT STORIES. THIS IS SOMETHING HE WAS ASKED ABOUT BECAUSE OF THE SURVIVORS WHO WERE SPEAKING TODAY. I WANT TO LISTEN TO WHAT HE SAID, HAVE OUR AUDIENCE RESPOND. > > I UNDERSTAND WE WERE SUBPOENAED TO GIVE FILES, WE HAVE GIVEN THOUSANDS OF PAGES OF FILES. I KNOW THAT NO MATTER WHAT YOU DO, IT WILL KEEP GOING. WE ARE HAVING THE MOST SUCCESSFUL EIGHT MONTHS OF ANY PRESIDENT EVER. THAT IS WHAT I WANT TO TALK ABOUT. I'M NOT THE EPSTEIN HOAX. > > HE ALSO WENT ON TO SAY IT IS A DEMOCRATIC HOAX TODAY. IS HE RIGHT? > > WHAT THE PRESIDENT IS SPEAKING ABOUT HIS DEMOCRATS HAVE BEEN FAILURES WHEN IT COMES TO PUBLIC POLICY FACING THE AMERICAN PEOPLE. SO DONALD TRUMP COMES BACK TO WASHINGTON AS PRESIDENT OF THE U.S., COMMANDER-IN-CHIEF. AND FOR THE LAST EIGHT MONTHS HAS HAD THE MOST SUCCESSFUL PRESIDENTIAL ADMINISTRATION IN THE MODERN ERA. THE ONLY THING DEMOCRATS CAN HANG ON HIS EPSTEIN. I THINK THAT IS WHAT THE PRESIDENT IS TALKING ABOUT, THE DEMOCRATS ARE USING -- LET'S BE CLEAR, THE DEMOCRATS ARE USING THE EPSTEIN FILES AS A WAY TO DISTRACT FROM THE SUCCESSES DONALD TRUMP IS HAVING. IF ANY CHIEF EXECUTIVE WOULD BE FRUSTRATED WITH THAT. THAT IS AN HONEST THING TO BE FRUSTRATED ABOUT. WE KNOW DEMOCRATS DON'T CARE ABOUT THE EPSTEIN FILES WHEN JOE BIDEN WAS PRESIDENT, NANCY PELOSI WAS SPEAKER. THEY DID NOT MOVE HEAVEN AND EARTH TO RELEASE THOSE FILES. THEY WANTED TO HIDE WHAT WAS GOING ON WITH THE EPSTEIN FILES UNLESS IT MEANT TRYING TO HARM DONALD TRUMP BUT THEY KNEW THEY COULD NOT DO THAT. THAT IS WHERE THE FRUSTRATION FROM THE PRESIDENT IS COMING. I THINK THE PRESIDENT ON THE WAY DOWN IS ABOUT BEING TRANSPARENT WITH THE AMERICAN PEOPLE. WE HAVE A RESOLUTION THAT WILL MOVE FORWARD IN A SYSTEMATIC PROCESS TO RELEASE THAT INFORMATION TO THE PUBLIC. BUT BE CLEAR, THE DEMOCRATS DON'T CARE ABOUT EPSTEIN. AND THEY DON'T CARE ABOUT THE SURVIVORS, LET'S BE CLEAR ABOUT THAT. WHAT THEY CARE ABOUT IS CREATING A POLITICAL CIRCUS TO TRY TO DAMAGE DONALD TRUMP -- JOE: WE WANT TO QUESTION THE MOTIVATIONS OF DEMOCRATS WHEN IT COMES TO SURVIVORS. I DON'T KNOW WHAT THEIR THOUGHTS ARE. I REALIZE YOU ARE QUESTIONING THEIR POLITICS BEHIND THIS, BUT YOU'RE NOT SUGGESTING THE CRIMES PERPETRATED BY JEFFREY EPSTEIN ARE HOAX? > > I'M NOT SAYING THAT AT ALL. REMEMBER, DONALD TRUMP WHEN HE FOUND OUT WHAT EPSTEIN WAS DOING AROUND MAR-A-LAGO, WHAT DID HE DO? HE KICKED HIM OUT, REVOKED HIS MEMBERSHIP AND REMOVED HIM. LET'S NOT SIT HERE AND SAY THE PRESIDENT WAS COVERING UP FOR THIS GUY. THAT IS NOT ACCURATE. IN THE HISTORY DEMONSTRATES THAT. BUT WHAT PRESIDENT TRUMP IS TALKING ABOUT IS LOOK AT THE SUCCESSES HAPPENING IN OUR COUNTRY TODAY. DON'T LET THE DEMOCRATS TRY AND STEAL A NEWS CYCLE SO THE AMERICAN PEOPLE LOSE FOCUS ON THE POSITIVE THINGS HAPPENING IN OUR COUNTRY TO FOCUS ON THE JEFFREY EPSTEIN FILES. WHAT JEFFREY EPSTEIN DID WAS A TRAVESTY. IT WAS A MONSTROSITY TO WOMEN WHO WERE VICTIMIZED BY HIM AND JUST LAY IN MY. BUT LET'S MAKE SURE WE ARE FOCUSING ON THE GOOD THINGS HAPPENING IN THE COUNTRY. THAT IS MY POINT. THE DEMOCRATS ARE USING THIS FOR POLITICS. THEY DON'T CARE ABOUT THE SURVIVORS. > > REPRESENTATIVE DONALDS. LET'S TALK ABOUT THE SHUTDOWN DISCUSSION OR THE FEARS PLAGUING WASHINGTON. WE KNOW YOU ARE A CRITICAL VOTE IN THE DISCUSSIONS. QUICKLY, TELL US WHAT YOU ARE PUSHING FOR IN THE BUDGET NEGOTIATIONS? > > RIGHT NOW WE NEED TO FIND A PATHWAY TO CUT SPENDING. I HAVE BEEN CONSISTENT ABOUT THAT WITH THE WHITE HOUSE, HOUSE LEADERSHIP, MY TIME ON THE HILL. LET'S CUT SPENDING AND BE RESPONSIBLE WITH THE DOLLARS OF THE AMERICAN PEOPLE AND SPEND THEIR MONEY EFFICIENTLY AND APPROPRIATELY. WE WILL SEE WHAT HOUSE LEADERSHIP COMES UP WITH. SOME DISCUSSIONS AROUND A CONTINUING RESOLUTION. IT IS IMPORTANT FOR THE AMERICAN PEOPLE TO KNOW CONTINUING RESOLUTION WOULD BE A SPENDING DECREASE YEAR-OVER-YEAR. SO THERE ARE POSITIVE ELEMENTS. JOE: WE HAVE 10 SECONDS LEFT. WILL WE AVOID A SHUTDOWN? > > I THINK SO. JOE: GOOD TO HAVE YOU BACK. THANK YOU FOR BEING WITH US. ALONGSIDE KRITI GUPTA, I'M JOE MATHIEU. THIS IS BLOOMBERG. KRITI: THIS IS A BALANCE OF POWER ON BLOOMBERG TELEVISION AND RADIO. AND JUST MOMENTS, ENERGY SECRETARY CHRIS WRIGHT WILL JOIN THE PROGRAM TO DISCUSS THE ADMINISTRATION MOVES IMPACTING THE ENERGY SECTOR. HERE ARE THE STORIES WE ARE WATCHING TONIGHT IN OUR POWER BRIEF. A DAY AFTER PRESIDENT TRUMP DRAMATICALLY STEPPED UP THE MILITARY'S ROLE IN THE CARIBBEAN A STRIKE ON A VENEZUELAN DRUG CARTEL, SECRETARY OF STATE MARCO RUBIO MET WITH MEXICO'S PRESIDENT FOR TRADE AND SECURITY AT THE TOP OF THE AGENDA. SHE'S VOICED FEARS OF THE U.S. ENCROACHING ON MEXICAN SOVEREIGNTY. RUBIO FOLLOWING THE MEETING UP WITH A BILATERAL PRESS CONFERENCE WITH HIS MEXICAN COUNTERPART. > > SEVERAL STATES BANDING TOGETHER IN THE WAKE OF THE EXODUS OF LEADERS AT THE CDC WITH THE GOVERNORS OF CALIFORNIA, OREGON, AND WASHINGTON ANNOUNCING THE CREATION OF A WEST COAST HEALTH ALLIANCE AIMED AT PROTECTING ACCESS TO VACCINES. THE ALLIANCE BY BLUE STATE GOVERNORS COMING AMID GROWING TURMOIL AT HHS AND PUBLIC CRITIQUES OF RFK JR.'S LEADERSHIP. AT A JOINT NEWS RELEASE, THEY SAID THE CDC HAD BECOME A POLITICAL TOOL THAT INCREASINGLY PEDALS IDEOLOGY INSTEAD OF SCIENCE. HARVARD UNIVERSITY SCORING A MAJOR LEGAL VICTORY IN ITS BATTLE WITH THE TRUMP ADMINISTRATION AFTER A COURT RULED THE U.S. ILLEGALLY FROZE MORE THAN $2 BILLION IN RESEARCH FUNDING. U.S. GOVERNMENT VIOLATED HARVARD'S FREE-SPEECH RIGHTS AND DID NOT FOLLOW PROPER PROCEDURES WHEN IT SUSPENDED A WIDE RANGE OF RESEARCH GRANTS IN APRIL. IT PAVES THE WAY FOR THE FUNDING TO BE RELEASED TO THE SCHOOL. THE ADMINISTRATION CAN STILL APPEAL. > > THE TRUMP ADMINISTRATION MOVING TO BLOCK THE DEVELOPMENT OF MORE OFFSHORE WIND PROJECTS. THE LATEST IN A SERIES OF SETBACKS FOR THE INDUSTRY THAT HAS CUT THE PRESIDENT'S ATTENTION. THE ADMINISTRATION IS WORKING TO WITHDRAW A PERMIT FOR THE NEW ENGLAND WIND ONE AND TWO OFFSHORE PROJECTS IN MASSACHUSETTS. THE TOTAL VALUATION OF THE PROJECTS IS MORE THAN 14 BILLION DOLLARS. MASSACHUSETTS GOVERNOR MOORE HEALY SPOKE WITH BLOOMBERG EARLIER AND CALLED FOR THE ADMINISTRATION TO WORK WITH THE STATES RATHER THAN AGAINST THEM. > > AS GOVERNOR, AND FOCUSED ON LOWERING COSTS FOR RESIDENTS, BUSINESSES. INCLUDING ENERGY COSTS. ONE THING WE DON'T NEED HIS ENERGY SUPPLIER TO OUR REACH AND CUT OFF. THAT IS WHAT WE ARE SEEING BY THE TRUMP ADMINISTRATION'S MOVE TO KILL JOBS AND TAKE AWAY POWER BY DISMANTLING WIND OPERATIONS ON THE EAST COAST. JOE: GREAT TIME TO HAVE THE U.S. ENERGY SECRETARY WITH US TO TALK ABOUT THIS AND THE OTHER MAJOR DEVELOPMENTS IN THE ENERGY SPACE. THAT REVIEW WE WERE JUST TALKING ABOUT FOLLOWS LAST WEEK'S CANCELLATION OF THE REVOLUTION WIND PROJECTS IN NEW ENGLAND. SHOULD WE ASSUME THROUGH THE EYES OF THIS ADMINISTRATION, AND WE'VE HEARD THE PRESIDENT TALK ABOUT WIND, THAT IT IS NOT A VIABLE RESOURCE FOR THE GRADE? IS THE DOMESTIC WIND INDUSTRY DEAD? > > I THINK IF -- IN THE ONE BIG BEAUTIFUL BILL, PRESIDENT TRUMP ADVOCATED WE REMOVE THE SUBSIDIES FOR WIND. OFFSHORE WIND IS TWICE AS EXPENSIVE AS ONSHORE AND WE WOULD NOT HAVE A BIG ONSHORE WIND INDUSTRY WITHOUT SUBSIDIES. I WOULD SAY THE ECONOMIC OUTLOOK FOR OFFSHORE WIND IN THE U.S. IS NOT PROMISING. THAT IS NOT JUST IN THE UNITED STATES, THREE COUNTRIES WENT ALL IN IN OFFSHORE WIND. GERMANY, DENMARK, THE U.K.. THEY COMPETE FOR THE MOST ELECTRIC -- EXPENSIVE ELECTRICITY IN THE WORLD. THAT IS NOT THE PATH TRUMP WANTS US HEADING DOWN. > > THOSE ARE THE THREE COUNTRIES THAT INVEST IN THE WIND SECTOR IN THE U.S., NOTABLY DENMARK. SOME OF THE OTHERS IN SCANDINAVIA. FOR AND IT ADMINISTRATION PUSHING TOWARD DIRECT INVESTMENT ONTO THE STATES, DOESN'T THIS DISINCENTIVIZE THAT FROM THE COUNTRIES YOU ARE SPEAKING ABOUT? > > WE ABSOLUTELY WANT TO FOREIGN DIRECT INVESTMENT IN THE U.S. FROM ALL OVER THE PLACE. BUT THESE SHOULD BE PROJECTS VIABLE WITHOUT SUBSIDIES. ADD TO OUR ECONOMY AND THE PROPHETS OF INVESTORS. OFFSHORE WIND HAS BEEN AN ENTIRELY GOVERNMENT MANDATED AND FUNDED BUSINESS. THE U.S. HAD FOR YEARS GOING DOWN THE EUROPEAN PATHWAY OF EXPENSIVE GOVERNMENT DRIVEN UNRELIABLE ENERGY. PRESIDENT TRUMP RAN ON REVERSING THAT. SURPRISE, SURPRISE, HE GOT IN POWER AND IS REVERSING IT. THIS GOAL IS AFFORDABLE, RELIABLE, SECURE ENERGY THAT MAKES ALLIES AMERICANS BETTER. > > LET'S TALK ABOUT ANOTHER SOURCE OF ENERGY. OIL. WE HEARD THE PRESIDENT TALK ABOUT SECONDARY. SANCTIONS WHEN IT COMES TO BUYERS OF RUSSIAN OIL. TALK ABOUT WHO THAT COULD INCLUDE OUTSIDE OF INDIA? ARE YOU THINKING ABOUT HUNGARY, SLOVAKIA, TURKEY? > > THE GOAL FOR PRESIDENT TRUMP, THIS IS ENTIRELY BASED ON WAR. HE'S TRYING TO BRING PEACE TO THE RUSSIAN UKRAINIAN CONFLICT WHICH HAS BEEN A BRUTAL 3.5 YOUR CONFLICT SO FAR. LOOKING FOR ANYWAY HE CAN TO BRING THE PARTIES TO THE TABLE AND GET PEACE. RUSSIA'S MAIN SOURCE OF REVENUE IS FUNDING IS WAR MACHINE. EXPORTS OF OIL AND NATURAL GAS. MOST OF RUSSIAN EXPORTED OIL IS BOUGHT BY CHINA AND INDIA. HERE'S A WAY HE'S TRYING TO DRAMATICALLY REDUCE RUSSIA'S ABILITY TO EXPORT OIL SO THEY CANNOT FUND THE WERE MISSING AND IT WILL BRING PEACE. JOE: SHED SOME LIGHT ON THE PLAN IF IT DOES NOT GO THE WAY THE PRESIDENT WANTS. PRESIDENT TRUMP REFERRED IN THE OVAL OFFICE TO A SECOND OR EVEN THIRD PHASE OF SECONDARY SANCTIONS. DO YOU PLAN TO UNPACK THEM IN LAYERS OF RUSSIA DOES NOT STOP KILLING CIVILIANS IN UKRAINE? > > THE PRESIDENT IS A MASTER NEGOTIATOR. I'M CERTAINLY NOT GOING TO LEAK HIS PLANS THAT MIGHT BE COMING. HIS GOAL IS TO PUT AS LITTLE PRESSURE POSSIBLE AND GET TO THE RIGHT RESULT. RIGHT NOW HE'S WAITING TO SEE IF THE TRAJECTORY WE ARE ON BRINGS THE PARTIES TOGETHER FOR PEACE AND IF IT DOESN'T, THERE'S ADDITIONAL STEPS. BUT I CERTAINLY WILL NOT BE LEAKING THOSE TODAY. > > HAVE YOU DONE THE MATH ON WHAT THE COST IS TWO AMERICAN ENERGY CONSUMPTION? ANY TIME SANCTIONS ARE PUT ON INDIA, RUSSIA, CHINA, THAT HAS A COST ON THE GLOBAL OIL MARKET AND FEEDS BACK INTO THE COST ON AMERICAN CONSUMERS. > > THE MATH ON THAT IS THE WAY YOU KEEP OIL PRICES DOWN IS YOU ENCOURAGE SUPPLY. PARTICULARLY IN THE U.S. IT IS A NET OIL EXPORTER. PRESIDENT TRUMP HAS TAKEN A NUMBER OF ACTIONS THROUGH HIS EXECUTIVE PEN, DEPARTMENT OF ENERGY, AND THE ONE BIG BEAUTIFUL BILL TO GROW AMERICAN OIL PRODUCTION WHICH IS AT ALL-TIME HIGHS AND GASOLINE ON AN INFLATION ADJUSTED PRICE IS AS LOW AS IT HAS BEEN INTO DECADES. WE ARE ON A GOOD TRACK. HE WANTS MORE ENERGY PRODUCED IN THE U.S., LOWER ENERGY PRICES, AND MORE ENERGY CONSUMING INDUSTRIES TO LOCATE IN THE U.S. I THINK HE'S ON A GREAT PATH. > > YOU ARE TALKING ABOUT MORE SUPPLY HITTING THE MARKET. BUT THE ACCOUNT HAS BEEN DOWN BY A SIGNIFICANT MARGIN. MOST OF THE SUPPLY IS NOT COMING FROM THE STATES, IT IS COMING FROM OPEC. HOW DO YOU JUSTIFY THAT TO THE AMERICANS CONSUMER DEPENDING ON THAT ENERGY PRODUCTION? > > THE RIG COUNT IS DOWN BECAUSE OIL PRICES HAVE COME DOWN. THAT IS A BENEFIT FOR CONSUMERS. IT MAKES IT TOUGHER FOR OIL AND GAS COMPANIES. BUT IT IS STILL AT RECORD HIGHS. WE HAVE GASOLINE, DIESEL PRICES, INPUT CHEMICALS FOR PETROCHEMICALS. ALL AT A VERY HEALTHY PLACE. I THINK WE WILL CONTINUE TO SEE THAT TRAJECTORY. HE'S LOWERING THE COST OF OIL PRODUCERS AS WELL. WE HAVE TO DO EVERYTHING WE CAN TO LOWER THEIR COSTS SO INCREASINGLY LOW OIL PRICES, THEY CAN MAKE A PROFIT AND DRILL. THAT IS WHAT HE DID HIS FIRST TERM AND WHAT HE'S DOING HIS SECOND TERM. QUITE EXCITED ABOUT THE TRAJECTORY WE ARE ON. JOE: WE HAVE TALKED WITH YOU A BIT ABOUT THE HUNGER FOR MORE ENERGY. THANKS TO THE INCREDIBLE NUMBER OF DATA CENTERS SPROUTING UP LIKE WEEDS AROUND THE COUNTRY. WE ARE NO STRANGER TO THEM NEAR NORTHERN VIRGINIA. SO THERE IS A BIG QUESTION ABOUT HOW WE CAN CONTINUE TO PROVIDE MORE CLEAN RENEWABLE ENERGY. NUCLEAR MAY BE A LONG-TERM ANSWER, BUT IN THE MEANTIME IT SEEMS TO BE LNG. WHEN WILL YOU CUT THE RIBBON ON A NEW PIPELINE TO DELIVER LNG TO THE DATA CENTERS THAT NEED IT? > > THERE IS A LOT OF THAT GOING ON. THESE ARE MOSTLY SMALLER OR LOCAL PIPELINES. THAT IS A GOOD REMINDER NOTE TO ME. I NEED TO GO OUT TO ONE OF THOSE FOR NEW CONNECTOR PIPELINES. AS YOU SAID, THE NATURAL GAS WE CONSUME IN THE U.S. IS NOT LNG, IT STAYS IN A GASIFYING FORM. IT IS MUCH CHEAPER, TRANSPORTED BY PIPELINE. HUGE ENERGY COSTS FOR THE U.S. BY FAR OUR BIGGEST SOURCE OF ELECTRICITY. I THINK THE MARKET SHARE WILL ONLY GROW AS IT EXPANDS. IT WILL BE THE DOMINANT SUPPLY OF THE NEW ENERGY FOR ARTIFICIAL INTELLIGENCE. WE NEED A HUNDRED GIGAWATTS OF MORE CONFIRMED CAPACITY IN THE NEXT FOUR TO FIVE YEARS. THAT IS A STRETCH BUT I THINK TEAM AMERICA AND WITH PRESIDENT TRUMP LEADERSHIP, WE WILL GET IT DONE. > > YOU TALKED ABOUT RECLAIMING MARKET SHARE. OVER THE WEEKEND WE HAVE SEEN CHINA AND INDIA REINFORCING THEIR COMMITMENTS AND INCREASING THEM WHEN IT COMES TO BUYING THE GAS SUPPLY SPECIFICALLY FROM RUSSIA. DOES IT EAT INTO YOUR MARKET SHARE WHEN IT COMES TO U.S. LNG EXPORTS TO ASIAN CONSUMERS? > > IT IS THE FASTEST GROWING ENERGY SOURCE ON THE PLANET. RUSSIA, ALMOST ALL OF RUSSIAN GAS WENT WEST INTO THE EUROPEAN MARKET FOUR PIPELINES. THE RUSSIANS PROVED WHAT A RELIABLE SUPPORTER THEY ARE. IN ALL THE EUROPEAN CUSTOMERS, THEY ARE NOT ALL RUSSIAN GAS, BUT THEY ARE RUSHING TO DO THAT. AMERICAN LNG IS FILLING THE HOLE. RUSSIA HAD ONE PIPELINE GOING EAST. NOW THEY HAVE MADE AN AGREEMENT TO BUILD A SECOND LINE THAT WILL BE THE POWER OF SIBERIA THAT WILL GO TO CHINA. RUSSIA HAS ONE CUSTOMER, THE UNITED STATES HAS ABOUT 50 CUSTOMERS AROUND THE WORLD. I THINK WE WILL HAVE 100 CUSTOMERS IN THE NEXT FEW YEARS. OF COURSE RUSSIA IS GOING TO SELL GAS TO CHINA. THAT IS OK. BUT I FEEL GOOD ABOUT U.S. COMPETITION IN SUPPLYING NATURAL GAS AROUND THE WORLD. IT IS OUR FASTEST GROWING EXPORT. JOE: A COUPLE OF WEEKS AGO, THE END OF JULY, AROUND CLIMATE IMPACTS FROM ENERGY PRODUCTION. WE SPENT TIME IN THE NEWS FROM TODAY. IS THE CLIMATE NO LONGER A CONCERN FOR THE ENERGY DEPARTMENT? > > WE HAVE JUST PUT CLIMATE CHANGE IN ITS RIGHTFUL PLACE. IT IS IT'S A REAL PHYSICAL PHENOMENON, A SLOW-MOVING PHENOMENON I HAVE STUDIED FOR 20 YEARS. AS HAVE MANY SCIENTISTS AROUND THE COUNTRY. WE NEED TO PUT IT IN ITS RIGHTFUL PLACE. WE HEAR IT IS A CRISIS CAUSING EVERY STORM OR HURRICANE OR FLOOD. THOSE THINGS ARE FALSE. WHAT WE DID WITH THE CLIMATE REPORT, 90% OF WHAT IS IN IT IS STRAIGHT OUT OF THE INTERGOVERNMENTAL PANEL ON CLIMATE CHANGE REPORTS DONE EVERY SIX OR SEVEN YEARS FROM SCIENTISTS AROUND THE WORLD. FOR PEOPLE THAT ARE SCIENTIFICALLY LITERATE, IT IS NOT CONTROVERSIAL WHAT IS IN THE REPORT. WE JUST PUBLISHED THE QUIET PART SO AMERICANS CAN HAVE A MORE REALISTIC VIEW. IT IS NOT EVEN CLOSE TO THE WORLD'S GREATEST PROBLEM BUT THAT IS THE ONLY REASON WE HAVE JUSTIFIED PUTTING EXPENSIVE WIND TURBINES. WHY SHOULD WE BURDEN AMERICANS WITH ELECTRICITY PRICES AND SCARE OUT CHILDREN AND PUSH BUSINESSES AWAY IN THE NAME OF A CRISIS THAT WITHIN THE WORLD IN A FEW YEARS? NONE OF IT IS IN THE CLIMATE SCIENCE. WE ARE EXCITED TO HAVE AN OPEN, ROBUST DATA FACT BASED CLIMATE DEBATE. I'M THRILLED ABOUT THAT PAPER AND COULD NOT BE MORE PLEASED WITH THE FIVE AUTHORS WHO WROTE IT. > > SECRETARY RIGHT, VISITING IN WASHINGTON FROM LONDON, I'M SAD TO BE HERE BECAUSE I FEEL LIKE I'M MISSING YOUR TRIP TO EUROPE. WALK US THROUGH YOUR MESSAGE TO YOUR EUROPEAN PARTNERS WHEN YOU MAKE IT TO MILAN NEXT MONTH. > > OF COURSE I WILL TALK ABOUT WHAT HAS HAPPENED IN NATURAL GAS. IT IS 40% OF EXPANSION OF WORLD ENERGY PRODUCTION IN THE LAST 14 YEARS. 40% FROM ONE SOURCE NATURAL GAS. WE GOT A LOT OF CREDIT FROM THE AMERICAN SHALE REVOLUTION. WE MORE THAN DOUBLED AMERICAN NATURAL GAS PRODUCTION, LOWERED THE COST BY MORE THAN HALF, IT ALLOWS US TO WIN THE AI RACE, RESHORE MANUFACTURING BUT ALSO SUPPLY AROUND THE WORLD SO THEY CAN GET ENERGY FROM SECURE ALLIES AS OPPOSED TO ADVERSARIES AND FOES THAT ARE UNCERTAIN. THINK ABOUT THE MONEY THAT WENT INTO BUILDING THOSE RUSSIAN PIPELINES IN EUROPE. RUSSIAN TROOPS GO ALONG ONE OF THOSE PIPELINES THAT GOES THROUGH UKRAINE AND INVADE THAT COUNTRY AND THAT NEIGHBOR. ENERGY IS ABSOLUTELY CRITICAL. CRITICAL TO ECONOMIC SECURITY, NATIONAL SECURITY. THOSE POINTS ARE WHY PRESIDENT TRUMP GOT ELECTED, THAT IS THE CENTER OF HIS AGENDA. JOE: ENERGY SECRETARY CHRISTOPHER WRIGHT, THANK YOU. MORE ON TODAY'S TOP STORIES WHEN WE CONVENE OUR POLITICAL PANEL AND THE NEWS FROM ATTORNEY GENERAL BONDI AND HOMELAND SECURITY SECRETARY GNOME ON THE GROUND IN LOUISIANA AS THEY LOOK TO EXTEND THEIR IMMIGRATION CRACKDOWN. WE WILL HAVE A REPORT AHEAD ON BALANCE OF POWER > > WE ARE MAKING A DETERMINATION NOW, DO WE GO TO CHICAGO, OR DO WE GO TO A PLACE LIKE NEW ORLEANS, WHERE WE HAVE A GREAT GOVERNOR, WHO WANTS US TO COME IN AND STRAIGHTEN OUT A VERY NICE SECTION OF THIS COUNTRY? THAT HAS BECOME QUITE TOUGH. QUITE BAD. SO WE ARE GOING TO BE GOING TO MAY BE LOUISIANA. JOE: THIS IS \"BALANCE OF POWER.\" I'M JOE MATHIEU ALONGSIDE KRITI GUPTA IN WASHINGTON. PRESIDENT TRUMP SPOKE ON THE TENTATIVE PLANS TO SEND FEDERAL TROOPS TO PATROL LOUISIANA. THE REPUBLICAN GOVERNOR IS ALSO BACKING PLANS TO SEND IMMIGRANTS AND DETAINEES TO THE NOTORIOUS PRISON IN. THE SECRETARY OF HOMELAND SECURITY AND ATTORNEY GENERAL PAM BONDI IN THE BACK SECURITY PRISON THAT COULD PROVIDE UP TO 450 BEDS ON MYLES MILLER. > > THAT IS RIGHT, WE ARE WAITING FOR THAT ANNOUNCEMENT. THEY ARE SOME MIGRANTS BEING HOUSED BEHIND ME. IT IS BEING CALLED CAMP 57. THE 57TH GOVERNOR OF THE STATE IS JEFF LANDRY. THEY ARE CALLING IT THE LOUISIANA LOCKUP. WE KNOW IT HAS THE CAPACITY TO HOLD ROUGHLY JUST UNDER ABOUT 420 MIGRANTS. IT WILL BE THE WORST OF THE WORST OFFENDERS WHO WILL BE HERE. THIS IS AN ANNOUNCEMENT BEING HELD WITH PAM BONDI AS WELL AS KRISTI NOEM, THE DEPUTY DIRECTOR OF ICE. THE FOCUS IS TO HOLD THESE FOLKS IN DETENTION, WHICH IS ONE OF THE LARGEST MAXIMUM-SECURITY FACILITIES IN THE COUNTRY. WE ARE SITUATED AGAINST THE MISSISSIPPI RIVER. ONE OF THE MOST SECURE PLACES. IT DOES GET OUT A POLICY WITH ICE, AND PEOPLE WHO ARE DETAINED BY ICE ARE NOT SUPPOSED TO BE IN PUNITIVE SETTINGS. HERE AT CAMP 57, MOST IS BEING SET UP AS -- KRITI: I THINK WE LOST MYLES MILLER. REPORTING FOR US FROM LOCATION. WE THANK YOU SO MUCH. I'M SURE WE WILL COME BACK TO HIM. WE TALKED TO BYRON DONALDS ABOUT THE ONGOING BATTLE OVER THE RELEASE OF THE EPSTEIN FILES. > > WHAT I DO SUPPORT IS THE OVERSIGHT COMMITTEE APPROACH TO MAKING SURE THAT INFORMATION IS GONE THROUGH, THAT SURVIVORS ARE PROTECTED, AND THOSE FILES ARE RELEASED. THERE ARE CONCERNS ON THE HILL ABOUT REPRESENTATIVE MASSIE'S APPROACH THAT IT WOULD NOT PROTECT SURVIVORS WHO BY THE WAY , SOME OF WHICH HAVE NOT COME FORWARD, SOME OF WHICH MAY CHOOSE NOT TO BE KNOWN PUBLICLY. THE PROCESS ABOUT HOW WE RELEASED THOSE FILES. JOE: WHY DON'T WE TURN AWAY FROM THAT DETENTION CENTER WHERE MILES WAS. JEFFREY EPSTEIN HAS BEEN OCCUPYING A LOT OF TIME IN CONVERSATION. WITH US, OUR POLITICAL PANEL FOR THIS EVENING. MATT GORMAN IS BACK. EXECUTIVE VICE PRESIDENT AT TARGETED VICTORY ALONGSIDE KRISTEN HAWN. GREAT TO SEE YOU BOTH. WE ARE STILL TALKING ABOUT IT WHERE WE LEFT OFF BEFORE EVERYONE WENT HOME FOR AUGUST RECESS. WHAT WILL BE THE IMPACT OF EPSTEIN VICTIMS BROUGHT FORTH TO HOLD A NEWS CONFERENCE IN TOWN? REPUBLICANS PICKING WITH THE OVERSIGHT COMMITTEE OR DISCHARGE POSITION TO HAVE THE FILES RELEASED. > > AT ITS CORE, REPUBLICANS ARE THE BENEFIT FROM HAVING THE LEADER OF THIS FROM THE REPUBLICAN SIDE NOT BEING VERY POPULAR IN THE PARTY AT ALL TO SAY THE LEAST. IT HELPS AND GIVE DISTANCE BETWEEN HIM AND THE REST OF THE PARTY. REPUBLICANS ARE LOOKING FOR A PLAY, HOW TO HANDLE THIS. VERY IMPACTFUL CEREMONY OR PRESS CONFERENCE WITH THE EPSTEIN VICTIMS. THAT SHOULD BE RESPECTED. I THINK PEOPLE ARE LOOKING FOR WHAT CAN THEY DO? HOW CAN THEY LISTEN, HAVE SOME SORT OF MOVEMENT TOWARDS THE VICTIMS BUT NOT GIVEN WHAT DEMOCRATS ARE LOOKING FOR? > > WHAT IS THE MIDDLE GROUND? > > IT IS ALSO WHAT MASSEY IS LOOKING FOR AND WHAT A LOT -- THE PRESIDENT KEEPS SAYING IT IS A DEMOCRATIC MANUFACTURED THING. AND IT IS NOT. IT CAME UP FROM HIS OWN SUPPORTERS WHO HE TOLD HE WAS GOING TO LOOK INTO IT. I THOUGHT IT WAS VERY COMPELLING YOU HAD THE VICTIM SPEAKING, A LOT OF WHOM HAVE NOT COME OUT BEFORE AND IT WAS A BIPARTISAN GROUP OF MEMBERS OF CONGRESS. I UNDERSTAND GETTING TOO MUCH IN THE WEEDS ON WHETHER IT IS A DISCHARGE POSITION OR SOMETHING THAT COMES OUT OF THE COMMITTEE, IT IS SOMETHING WE PAID, I'M NOT SURE PEOPLE OUTSIDE CARE ABOUT THAT. JOE: THE PRESIDENT CALLED IT A DEMOCRAT HOAX. WE ASKED BYRON DONALDS ABOUT THAT. HE SUGGESTED THE DEMOCRATS DON'T CARE ABOUT THIS, IT IS A POLITICAL MOTIVATION, AND SAID REPEATEDLY THE DEMOCRATS DO NOT CARE ABOUT THE VICTIMS. HOW WOULD YOU RESPOND? > > I'VE ALWAYS SAID THIS. EVEN SPENDING 23 YEARS AND D.C., I'M NOT SO CYNICAL I THINK JUST BECAUSE YOU HAVE AN R OR D ATTACHED TO YOUR NAME THAT YOU DON'T CARE ABOUT VICTIMS LIKE THIS OR PEOPLE IN GENERAL. I THINK IT TOOK A LOT OF GUTS FOR THESE MEMBERS TO COME TOGETHER FROM BOTH SIDES OF THE AISLE TO STAND WITH THE VICTIMS. I CHOOSE TO DECIDE TO BELIEVE THAT THERE IS HONESTY AND EARNESTNESS IN WHAT THEY WERE DOING. > > IN THE COMMENTS TODAY, WE PUT TOGETHER A CLIENT LIST. MAYBE NOT TAKING THE GOVERNMENT OUT OF IT TOGETHER. IF THERE IS THAT INEVITABILITY, WHAT IS THE FALLOUT? > > WE WILL SEE WHAT COMES OF THAT. IF THE CLIENT LIST EXISTED, THE CLEAR DEBATE. I THINK WHAT I COME BACK TO IS IF IT WERE SUCH AN IMPORTANT THING FOR DEMOCRATS, WHERE WERE THEY DURING THE FOUR YEARS IT WAS LINGERING UNDER JOE BIDEN? THAT IS A VERY FAIR CRITIQUE. NUMBER TWO, WHILE IT MIGHT HAVE BUBBLED UP ON THE RIGHT, ONE OF THE THINGS THAT HAS GALVANIZED THE RIGHT IS HAVING FOLKS LIKE JAMIE RASKIN AND FOLKS ON THE LEFT TAKING THE FRONT TIP OF THE SPEAR. I THINK HAVING THE RIGHT ENEMY, SO TO SPEAK, IT HELPS KEEP CONSERVATIVES AT BAY. JOE: MARJORIE TAYLOR GREENE KEEPING THE WRONG COMPANY? > > THAT IS CLEAR. THOMAS MASSIE BEING THE HEAD OF THIS. IT HELPS OUR SIDE IN A WAY WERE RECEIVED BYRON DONALDS STICKING IN THE TENT SO TO SPEAK. KRITI: LET'S TALK ABOUT THE OTHER PIECE OF NEWS. THAT IS SOME POTENTIAL THOUGHTS AND REPORTING FROM THE NEW YORK TIMES. TALKING ABOUT THE MAYORAL ELECTION AND WHERE DONALD TRUMP MAY CONSIDER THE POSSIBILITY OF TAKING ERIC ADAMS AND OTHER CONTENDERS TO MAKE WAY FOR CUOMO. THAT IS HOW WORRIED HE IS. YOUR INITIAL TAKE? > > YOU LOOK AT A CITY LIKE NEW YORK, I DON'T SIT IN THE SAME TYPE OF POLITICAL SPACE HE DOES HAS A DEMOCRAT. I SEE HOW HE CAN BE CAPTIVATING TO VOTERS. HE'S TALKING ABOUT THE THINGS THEY CARE ABOUT. AND TOO OFTEN WE DON'T TALK ABOUT THIS. AND THERE WAS SOMETHING THAT THEY GLOMMED ONTO. INTERESTING THE PRESIDENT IS CONSIDERING, EVERYONE IS PUTTING THEIR STATEMENTS ON THE PRESS, AND DO WE KNOW IF ERIC ADAMS WILL TAKE A POTENTIAL APPOINTMENT FROM THE PRESIDENT OF THE UNITED STATES? DONALD TRUMP WILL CLEAR ELAINE FOR A DEMOCRAT TO BE -- > > THAT IS THE OTHER THING. HE'S NOT A NORMAL MAGA REPUBLICAN. MIGHT NOT BE GUARANTEED TO TAKE THAT SLOT EITHER. SOMETIMES IT LOOKS TO BE ENGINEERED TOWARD CUOMO. THERE IS ALIGNMENT THAT HURTS HIM AS WELL. AT ITS HEART, IT IS THE RIGHT SORT OF MOVE. PEOPLE GETTING 20% WHEN HE GETS 28, SO THEY NEEDED TO BE SOMETHING. HOW THEY GO ABOUT IT. > > HE IS GOOD FOR BUSINESS. > > VERY TRUE, BUT HE LOVES NEW YORK. > > IT IS ONLY THE REPORT FOR NOW. THANKS FOR YOUR INSIGHTS ON ALL OF THE STORIES. YOU CAN READ A LOT MORE BY CHECKING OUT THE WASHINGTON EDITION NEWSLETTER ON THE TERMINAL AND ONLINE. THANK YOU FOR JOINING US. ALONGSIDE KRITI IN WASHINGTON, THIS IS BLOOMBERG TV AND RADIO.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9853515625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.97998046875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9677734375
    }
  ],
  "sentiment": {
    "positive": 0.21162975,
    "negative": 0.37351325,
    "neutral": 0.41485703
  },
  "summary": "The article discusses \"BALANCE OF POWER,\" a series of stories from Washington, D.C. including a Senate Hearing where Stephen Miran is testifying before the Senate. The article also includes a look at the White House, where President Donald Trump accused China of conspiring against the U.S. with VLADIMIR and KIM. The President also discusses a recent meeting with Poland's President, where he presented a new show of force against the leaders of the country. The ADMINISTRATION also reports on the work of the President, including the work on blocking the development of ONSHORE WIND PROJECTS and the potential impact on the industrial sector. The show also includes exclusive reports on an inflowing of information from the ADMISTRADITIONAL EPA. Additionally, the article discusses a visit to the Polish President, highlighting the importance of their strong relationship with the country's President.",
  "shortSummary": "Stephen Miran faces a Senate hearing on \"Balance of Power,\" highlighting tensions between the United States and China, with President Donald Trump seeking to strengthen bilateral ties.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "52e81c18b25346d79c99026aebab8159",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg’s \"Balance of Power\" highlighted a Senate hearing on Stephen Miran’s Fed nomination, with Senator Elizabeth Warren urging oversight of the President’s attacks on the Federal Reserve. Representative Byron Donalds supported releasing Jeffrey Epstein files and discussed congressional provisions. Energy Secretary Chris Wright detailed Trump administration moves affecting the energy sector, including offshore wind and LNG policies.",
  "argos_id": "5W5B2TXIU"
}