{
  "url": "https://www.macworld.com/article/2898597/the-iphone-17-pro-could-cost-an-extra-200-this-year.html",
  "authorsByline": "Michael Simon",
  "articleId": "601e694d205f4aeab452cb16e8e30b21",
  "source": {
    "domain": "macworld.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.macworld.com/wp-content/uploads/2025/09/iPhone-16-Pro-Max-titanium-frame.jpg?quality=50&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T13:44:19+00:00",
  "addDate": "2025-09-04T13:52:19.247947+00:00",
  "refreshDate": "2025-09-04T13:52:19.247949+00:00",
  "score": 1.0,
  "title": "The iPhone 17 Pro could cost an extra $200 this year",
  "description": "A new report claims Apple will up the price and increase the storage.",
  "content": "With Apple’s “Awe Dropping” event just days away, there isn’t much we don’t know about the upcoming iPhone 17 lineup. But a new report today could bring an unpleasant surprise for people looking to buy an iPhone 17 Pro next week.\n\nAccording to TrendForce, both iPhone 17 Pro phones will feature the A19 Pro chip, along with 12GB of RAM (up from 8GB on the iPhone 16 Pro phones) and a minimum 256GB of storage. With the smaller Pro’s 128GB option gone, its price would be expected to jump accordingly. However, TrendForce’s report expects the new phone to start at $1,199, a full $200 more than the previous Pro model.\n\nThat’s a surprisingly big increase. Apple previously bumped the price of the iPhone 15 Pro Max by $100, from $1,099 to $1,199, when it added a then-exclusive 5X optical zoom camera and eliminated the 128GB storage option. The smaller iPhone Pro got the same camera last year, but kept its lower price and storage option–until now.\n\nTrendForce reports that Apple will also increase the price of the iPhone 17 Pro Max to $1,299, even though it will come with the same starting allocation of storage as the 16 Pro Max did last year.\n\nPricing for the new iPhones has been difficult to predict because of several factors, including tariffs and the introduction of the iPhone 17 Air. Several reports have claimed Apple will hike the Pro models by $50-$100, but TrendForce is the first to predict such a high price for the smaller Pro. TrendForce, like others, expects the standard iPhone 17 to retain its $799 starting price.\n\nIt may be worth noting that TrendForce predicted that the iPhone 16 Pro would start at $1,099, yet Apple retained its $999 price tag. So take this latest prediction with a pinch of salt.",
  "medium": "Article",
  "links": [
    "https://www.macworld.com/article/2872882/the-iphone-17-pro-could-cost-more-than-ever.html",
    "https://go.skimresources.com?id=111346X1569486&xs=1&url=https://www.trendforce.com/presscenter/news/20250904-12700.html&xcust=1-1-2898597-1-0-0-0-0&sref=https://www.macworld.com/article/2898597/the-iphone-17-pro-could-cost-an-extra-200-this-year.html",
    "https://www.macworld.com/article/2393967/iphone-17-release-date-specs-features-rumors.html",
    "https://go.skimresources.com?id=111346X1569486&xs=1&url=https://www.trendforce.com/presscenter/news/20240906-12295.html&xcust=1-1-2898597-1-0-0-0-0&sref=https://www.macworld.com/article/2898597/the-iphone-17-pro-could-cost-an-extra-200-this-year.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "iPhone Pro",
      "weight": 0.1660439
    },
    {
      "name": "Pro",
      "weight": 0.1281108
    },
    {
      "name": "A19 Pro",
      "weight": 0.12703338
    },
    {
      "name": "The smaller iPhone Pro",
      "weight": 0.093974456
    },
    {
      "name": "iPhone 16 Pro",
      "weight": 0.088058084
    },
    {
      "name": "iPhone 17 Pro",
      "weight": 0.088058084
    },
    {
      "name": "TrendForce",
      "weight": 0.079103075
    },
    {
      "name": "Apple",
      "weight": 0.07637877
    },
    {
      "name": "Several reports",
      "weight": 0.07578412
    },
    {
      "name": "last year",
      "weight": 0.074131854
    }
  ],
  "topics": [
    {
      "name": "iPhone"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.88427734375
    },
    {
      "name": "/News/Technology News",
      "score": 0.82373046875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7705078125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.70458984375
    }
  ],
  "sentiment": {
    "positive": 0.50394404,
    "negative": 0.10348818,
    "neutral": 0.39256778
  },
  "summary": "A report by TrendForce suggests that the price of the iPhone 17 Pro could increase by $200, a significant increase from the previous model. The new phone will feature the A19 Pro chip, 12GB of RAM, and a minimum of 256GB of storage. This increase is significant for Apple, which previously increased the cost of its iPhone 15 Pro Max by $100 when it added a 5X optical zoom camera and eliminated the 128GB storage option. The report also suggests that Apple will increase the price for the iPhone 18 Pro Max to $1,299, despite the same starting allocation of storage as the 16 Pro Max.",
  "shortSummary": "Apple may increase the iPhone 17 Pro's price by $200, potentially increasing the smaller Pro to $1,199, with features like 12GB of RAM and 256GB of storage included.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "baad5438df684eb2816740ea12f3494a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.macworld.com/article/2872882/the-iphone-17-pro-could-cost-more-than-ever.html",
      "text": "We here at Macworld love to get on our soapbox and complain about the specs where Apple shortchanges customers. We complained about RAM on Macs until Apple finally had to upgrade the baseline to 16GB to accommodate Apple Intelligence. Our latest cause is the base storage configuration for iPhones: it needs to be 256GB, not the current 128GB.\nAccording to a Weibo post by Setsuna Digital, that upgrade may finally happen. Setsuna Digital, who has a reputation for accurate iPhone leaks, states that, “In 2025, Pro will finally start at 256GB. This is really not easy for Apple.😂” That would be a boost from the 128GB that the iPhone 16 Pro offers at its base configuration. (The larger iPhone 16 Pro Max starts at 256GB.)\nWhich seems like good news, but Setsuna Digital said in a subsequent post that the starting price will go up by $50, which means that the iPhone 17 Pro would start at $1,049 or $1,149 for the base configuration, depending on whether the post takes into account the extra $100 Apple already charges for the 256GB model.\nWe’ve seen other reports that state that the iPhone 17 lineup may have higher prices. It seems unavoidable, considering the state of the economy, tariffs, and rising costs. One way for Apple to soften to blow of a higher price tag is to shift its storage offerings. For example, when Apple released the iPhone 15 Pro Max, it started with 256GB of storage, eliminating the 128GB tier that was the base for the iPhone 14 Pro Max–but the starting price went up $100 to $1,199. That’s the same price Apple charged for the 256GB iPhone 14 Pro Max, so Apple wasn’t technically charging more, just eliminating one of the lower price options.\nSo it seems like we’ll see a similar tactic to raise the price of the iPhone 17 Pro. One way to look at it–and it could be something Apple will point out–is that a $1,049 price for 256GB is actually a price drop, since Apple sells the 256GB iPhone 16 Pro for $1,099. That’s assuming Apple doesn’t bump the entry-level price by $150, of course.\nAs far as the non-Pro model, Apple is expected to keep the same $799 price for the iPhone 17. The iPhone 17 Air, which is replacing the $899 iPhone 16 Plus, could cost more, possibly $949 or $999, to take the place of the higher-priced Pro model.\nWe’ll learn how much everything soon enough, as Apple is expected to unveil the iPhone 17 next month, possibly on September 9. Until then, you can track all the rumors and reports in our iPhone 17 superguide."
    },
    {
      "url": "https://go.skimresources.com?id=111346X1569486&xs=1&url=https://www.trendforce.com/presscenter/news/20250904-12700.html&xcust=1-1-2898597-1-0-0-0-0&sref=https://www.macworld.com/article/2898597/the-iphone-17-pro-could-cost-an-extra-200-this-year.html",
      "text": "Apple is set to unveil four flagship devices—the iPhone 17, the iPhone 17 Air (tentative name), iPhone 17 Pro, and iPhone 17 Pro Max. Beyond a refreshed design, the new lineup will feature enhancements in processor performance, thermal management, and imaging capabilities, all of which are expected to help stimulate demand. TrendForce projects that total shipments of the iPhone 17 series will rise by 3.5% compared with the iPhone 16 lineup in 2024, with the Pro series remaining the main sales driver. However, sluggish global economic conditions and the potential for higher prices on premium models may temper overall demand.\nThe introduction of the iPhone 17 Air signals Apple’s official entry into the thin-and-light flagship category. Yet, the Air may fall short of satisfying consumers who prioritize large batteries and high-end photography by reducing battery capacity and trimming camera specifications. TrendForce expects initial shipments of the Air to align with historical levels of the Plus series, though its actual sales performance remains to be seen.\nThe iPhone 17 and Air are expected to feature the A19 processor, while the Pro series will adopt the A19 Pro. DRAM capacity will be increased to 12 GB on the Air, Pro, and Pro Max, and NAND Flash storage will start at 256 GB for these models, scaling up to 1 TB.\nThe Air model will use a silicon anode battery and eSIM configuration to balance slimness with endurance. Notably, the entire iPhone 17 series will see major camera upgrades, with the front camera moving from 12MP to 24MP and all rear cameras raised to 48MP. The Pro models will go a step further, featuring a redesigned rectangular array and optimized software algorithms to enhance optical zoom and image resolution.\nIn terms of pricing, the base iPhone 17 model is expected to hold last year’s levels, while the Air, Pro, and Pro Max will see increases of US$50–$100 per comparable capacity to reflect their design breakthroughs and hardware enhancements. The Air’s price point is expected to compete directly with Samsung’s Galaxy S25 Edge, underscoring Apple’s strategy of strengthening brand appeal through product differentiation.\nThe launch of the Air, together with next year’s anticipated foldable model, highlights Apple’s broader strategy to diversify its product portfolio and capture a wider user base. TrendForce notes that Apple may adjust its release cycle going forward, launching a sub-flag shipment model in the first half of the year, followed by the Air, Pro, Pro Max, and foldable in the second half—creating a richer, more clearly segmented product matrix.\nFor more information on reports and market data from TrendForce’s Department of Semiconductor Research, please click here, or email the Sales Department at SR_MI@trendforce.com\nFor additional insights from TrendForce analysts on the latest tech industry news, trends, and forecasts, please visit https://www.trendforce.com/news/\nSubject\nRelated Articles\nRelated Reports"
    },
    {
      "url": "https://www.macworld.com/article/2393967/iphone-17-release-date-specs-features-rumors.html",
      "text": "Apple iPhone 17: Summary\n- iPhone 17 will arrive at Apple’s Awe Dropping event on September 9 in expected standard, Pro, Pro Max, and new Air variants, with preorders kicking off September 12 ahead of a September 19 onsale date. iPhone 17e will likely follow in Spring 2026.\n- Tariffs may cause the base model entry point to rise from $799 to $849.\n- iPhone 17 Air is tipped to be the slimmest iPhone ever, while iPhone 17 Pro Max may have the highest-capacity battery to date.\n- All models are expected to receive LTPO displays, A19/A19 Pro processors, 50W MagSafe charging, multiple camera improvements including a 24MP TrueDepth front camera, plus iOS 26 software.\n- A broader range of colorways will see specific hues tailored to each model in the iPhone 17 series.\nWe’re now less than a month away from Apple’s September Awe Dropping event, which will take place on Tuesday, September 9. While not officially confirmed, Apple is widely expected to announce the new iPhone 17 lineup with significant internal and external changes during the keynote.\nWhile many of the most exciting changes rumored to come to the iPhone line are being held for the foldable iPhone, expected to debut in 2026, the iPhone 17 family is set to get a number of important upgrades. This September, we will see not only the thinnest iPhone ever, but also the longest-lasting iPhone ever.\nWhile a new super-thin ‘Air’ model is tipped to replace the Plus variant, reportedly just 6.25mm thick, the Pro Max is expected to get a 5,000mAh battery–along with various tweaks that help it better manage the heat generated by all that power.\nWe’re also anticipating a range of new color options with different hues for each iPhone 17 model, a switch to LTPO displays that power 120Hz refresh rates in even the two cheapest iPhone 17 models that lack ProMotion, a huge upgrade to MagSafe that enables speedier 50W charging, a doubling of pixels allowing for clearer selfies from the front-facing TrueDepth camera, faster A19/A19 Pro processors with extra RAM in the Pro models to support Apple Intelligence, and the iOS 26 update with all the software enhancements that brings.\nIn this article, the Macworld team uses its expert knowledge of Apple and iPhone history to define the iPhone 17 rumors most likely to be true. Read on to find out everything you need to know about the soon-to-launch iPhone 17 series, including when the next iPhone will come out, the expected preorder and sale date, design, camera and display specs, and lots more.\nAt a glance: What to expect from iPhone 17 series\niPhone 17\n- 6.27-inch, 120Hz LTPO display\n- Black, White, Steel Gray, Green, Purple, Light Blue colorways\n- A19 processor\n- 24MP TrueDepth camera\n- 50W MagSafe charging\n- iOS 26\n- Starting from $799-$849\niPhone 17 Air\n- Replaces the ‘Plus’ model as the thinnest iPhone to date – just 6.25mm thick\n- 6.65-inch, 120Hz LTPO display\n- Titanium-aluminum alloy build to prevent bending\n- Black, White, Light Blue, Light Gold colorways\n- 48MP Fusion camera with 24MP TrueDepth front camera\n- 2,800mAh battery\n- 50W MagSafe charging\n- iOS 26\n- Starting from $899-$949\niPhone 17 Pro\n- 6.27-inch LTPO display with 120Hz ProMotion and Always-On display\n- Black, White, Gray, Dark Blue, Orange colorways\n- A19 Pro processor with vapor chamber\n- 12GB RAM\n- Upgraded 48MP Telephoto camera, plus 24MP TrueDepth front camera\n- 50W MagSafe charging\n- iOS 26\n- Starting from $999-$1,049\niPhone 17 Pro Max\n- 5,000mAh battery – the highest capacity in any iPhone to date\n- 6.86-inch LTPO display with 120Hz ProMotion and Always-On display\n- Steel body for improved heat dissipation\n- Black, White, Gray, Dark Blue, Orange colorways\n- A19 Pro with vapor chamber\n- 12GB RAM\n- Upgraded 48MP Telephoto camera, plus 24MP TrueDepth front camera\n- 50W MagSafe charging\n- iOS 26\n- Starting from $1,199-$1,249\niPhone 17e\n- To follow in Spring 2026\nRead on for more detailed analysis of the rumored iPhone 17 devices, colors, cameras, specs, features and software, plus our thoughts on the iPhone 17 release date and pricing.\nA brand-new iPhone line: The iPhone 17 Air\n- Rumored to be the thinnest iPhone ever\n- Could get 120Hz refresh rate, but without ProMotion screen\n- May be constructed from titanium-aluminum alloy metal frame to prevent bending\n- Single 48MP rear camera, smaller battery, no physical SIM card slot (eSIM only)\nBecause it’s a brand-new iPhone format we have given the iPhone 17 Air some extra attention. This new iPhone is expected to replace the existing Plus line and will sport a significantly thinner design and a larger display.\nSeveral analysts have reported that the existing Plus model will be replaced by a new “Slim” model with a larger screen size and a much thinner body.\nThe much slimmer size will come at the expense of battery capacity, as there just isn’t room for a battery as thick as you find in other iPhones. Leaker yeux1122 has said the battery capacity is to be around 2,800mAh, which is over 20% less than the battery in any iPhone 16 model.\nAccording to Korea’s Sisa Journal in January 2025, the so-called iPhone 17 Air will be 6.25mm thick and cost in the same price range as the iPhone 16 Plus (starting at $899 U.S.). Analyst Ming-Chi Kuo stated that the “thinnest part” of the new ultra-slim iPhone is just 5.5mm thick, but it’s difficult to know what that means without more context.\nThe camera bump, according to Weibo leaker Ice Universe, will be 4.0mm thick, bringing the total phone thickness to 9.5mm at the camera. Additionally, a report from Majin Bu in July claims the selfie cam will shift from the right side of the Face ID sensors to the left.\nWe’re unsure if the iPhone 17 Air will have the A19 or A19 Pro processor (reports vary), but it is expected to have only a single 48MP rear camera and the new 24MP front camera that all iPhone 17 models will get.\nThe iPhone 17 Air is also expected to feature a titanium frame, while the other iPhones will be made of aluminum. This may be due to titanium’s greater resistance to bending, which could be necessary given how thin the phone is.\nAn episode of the YouTube channel Unboxed Therapy featured a “dummy model” version of the phone from a third-party supplier. It’s our best look yet at the overall size and thin design.\nSources: yeux1122 | Sisa Journal | Ice Universe\niPhone 17 series color options\n- Confirmation of the Pantone color codes for each iPhone 17 model\n- Broader and more varied color palette tailored to individual models\nWe’ve heard a lot of rumors of the iPhone 17 colors over the past few months. Now we have independent confirmation from internal documents that list the Pantone colors of the various models.\nThe iPhone 17 line-up is expected to feature a broader and more varied color palette than previous generations, with specific hues tailored to each model.\niPhone 17 colors\n- Black (same as iPhone 16)\n- White (same as iPhone 16)\n- Steel Gray (Pantone 18-4005-TPG)\n- Green (Pantone 2282 U)\n- Purple (Pantone 530 U)\n- Light Blue (Pantone 658 U)\niPhone 17 Air colors\n- Black (same as iPhone 16)\n- White (brighter/colder than the iPhone 16)\n- Light Blue (Pantone 657 U)\n- Light Gold (Pantone 11-0604 TPG Gardenia)\nFoundry\niPhone 17 Pro / Pro Max colors\n- Black (same as iPhone 16 Pro)\n- White (same as iPhone 16 Pro)\n- Gray (similar to Natural Titanium)\n- Dark Blue (Pantone 19-4025 TPG Mood Indigo)\n- Orange (Pantone 1501243 TCX Papaya)\nFoundry\niPhone 17 cameras\n- iPhone 17 models said to feature a 24MP front-facing camera for 2x zoom and improved selfies\n- iPhone 17 Pro rumored to include a new 48MP telephoto camera with a 3.5x optical zoom\n- Redesigned ‘camera bar’ spanning width of the iPhone (Pro, Pro Max, and Air)\n- Extra camera control button and mechanical aperture expected for Pro models\nThe iPhone 17 series is expected to bring several camera enhancements across each models, focusing on improved resolution and advanced telephoto capabilities.\nAll iPhone 17 models are rumored to feature a 24MP front-facing camera. This would be a substantial upgrade from the 12MP lens found in the iPhone 16. It would improve selfie quality and potentially enable 2x zoom while maintaining sharpness.\nAn October 2024 research note from analyst Jeff Pu indicated that the iPhone 17 Pro would also feature a 48MP telephoto camera. According to a later report from Majin Bu, the 48MP telephoto camera will have a zoom of 3.5x (85mm), with an optical “crop zoom” mode similar to today’s 48MP wide camera, so you can shoot 12MP 7x (160mm) shots before the digital zoom kicks in.\nA report from The Information in July 2024 claims that “at least one” new iPhone model will feature a mechanical aperture, which would be new for iPhones, but has been seen in a handful of Android phones so far. A variable aperture would let users decide how much light passes through, giving more control over the depth of field.\nThe iPhone 17 Pro and Air models are also expected to feature a new “camera bar” design, where the large rectangular bump holding the rear cameras now stretches across the entire width of the iPhone. The regular iPhone 17 should have its two camera stacked vertically in a narrow bump, similar to the iPhone 16 today.\nIn late June 2025, Majin Bu posted photos of an iPhone 17 Pro dummy unit and its new camera bar.\nAccording to a leak from a MacRumors source, the iPhone 17 Pro is expected to have 8x telephoto. That could be a 4x telephoto lens with a 2x “crop zoom” function from a 48 megapixel sensor, similar to what is done with the regular Wide camera today. The leak also says Apple is planning a new Pro camera app for photos and videos, and even that the iPhone 17 Pro models will have an additional camera control button on the top edge.\nBloomberg’s Mark Gurman has said Apple wants vloggers and content creators to move to using iPhones instead of standalone cameras, and will do more to emphasize video quality and features in the iPhone 17 line.\niPhone 17 specs and features\n- Pro Max to feature 5,000mAh battery, plus a steel case for improved heat dissipation and structural resistance\n- LTPO displays with 120Hz refresh rate\n- Dynamic Island could get smaller\n- Apple A19 chipset for iPhone 17, and A19 Pro for Pro/Pro Max\n- RAM boosted to 12GB in Pro models\n- 50W MagSafe charging thanks to Qi 2.2 compliance\nBattery\nThe iPhone 17 Air battery capacity is said to be around 2,800mAh, based on a leak from yeux1122.\nThe iPhone 17 Pro Max battery is said to be around 5,000mAh, from the Weibo account Instant Digital. This would be the biggest iPhone battery ever, and about 8% more capacity than the iPhone 16 Pro Max.\nDisplay\nThe always-on display is supposed to finally be available on the non-Pro models. In addition, some believe that ProMotion will come to the non-Pro models, since the same LPTO technology that enables the always-on display is what makes ProMotion possible, in Apple’s iPhone implementation. If true, it would be the first time Apple has offered ProMotion on a non-Pro device. Others claim that the non-Pro models will get a 120Hz display, but without the variable refresh rate of ProMotion.\nApple is also said to be working with Corning on a new anti-glare and scratch-resistant glass for the iPhone 17 line-up. It was said to have production volume issues that might cause it to miss this year’s iPhones, but a July 2025 rumor says it will be on the iPhone 17 Pro after all.\nDynamic Island\nThe iPhone 17 Pro Max may have a smaller dynamic island. Rumors have changed back and forth—Jeff Pu said the dynamic island (or rather, the hardware “pill” that the island surrounds) will be smaller in the iPhone 17 Pro Max. Then Analyst Ming-Chi Kuo said it will be the same size as current models. Then leaker Digital Chat Station on Weibo said it will indeed be smaller.\nProcessor\nWe don’t know much about what chips will power the iPhone 17 line, but we expect the high-end models will get an A19 Pro, while the non-Pro models may get a standard or cut-back version of the A19, or perhaps a more souped up variant of the A18.\nA persistent rumor claims Apple will use a vapor chamber plate to distribute heat in the iPhone 17 Pro models, and leaker Majin Bu has an image of some production parts for it.\nCharging\nIn June, 91mobiles spotted a new MagSafe charger compliant with the Q1 2.2 standard. That could mean that the iPhone 17 will support 50W charging over MagSafe, a massive boost over the current 25W capabilities in the iPhone 16. A rumor in August claimed Apple had been testing reverse wireless charging for the iPhone 17 Pro models, which would let you charge another phone or an AirPods case by using the back as a charging mat.\nRAM\nSince Apple bumped every iPhone 16 model to 8GB of RAM due to the demands of Apple Intelligence, rumors have suggested Apple will increase the memory in the iPhone 17 Pro models to 12GB. In a report concerning RAM suppliers, Ming-Chi Kuo says that Apple wants the regular iPhone 17 to feature 12GB as well, but supply shortages may be an issue.\nWireless\nWhen it comes to wireless, the cellular modem is likely to still be supplied by Qualcomm; the C1 modem isn’t quite good enough for Apple’s top-tier iPhones yet, and the C2 won’t be ready in time.\nApple has its own Wi-Fi and Bluetooth chip that is expected to appear in the iPhone 17, however.\nOn August 11, Majin Bu reported that Apple is going to put the cellular antenna on the iPhone 17 Pro around the big camera bar. On the camera bar, the antenna would be “less prone to shielding and interference, improving performance in congested environments and ensuring a stable connection on the go,” according to Bu. This would enhance 5G mmWave performance, reduce latency, improve efficiency, and optimize the main body for the battery and thermal components. Bu specifically addresses the iPhone 17 Pro with this structural change. It’s not clear if the standard iPhone 17 or the rumored iPhone 17 Air will have the same antenna implementation. It’s possible that the camera bars on those phones are not large enough to accommodate an antenna.\nSources: yeux1122 | Instant Digital | Digital Chat Station | Majin Bu | Ming-Chi Kuo\niPhone 17 software – What’s coming in iOS 26?\nApple didn’t reveal anything new about the iPhone 17 at WWDC, but we did learn that iOS 26 will bring a lot of exciting new features to all iPhone users. A new Liquid Glass design language uses translucent layers and specular highlights to give all the interface elements a glass-like look that adds depth and realism to the user experience – a look and feel that will be consistent across all Apple devices.\nMany of the iPhone apps are getting updates as well. The Phone app will feature a Call Screening option for vet incoming calls, and a Hold Assist function to detect hold music and let you know when someone has picked up.\nMessages will gain the ability to create polls in group texts for quick and easy consensus-taking on dates to meet or places to eat, and the like. Maps will use AI to make navigation more personalized with preferred routes and previously visited places.\nMoreover, a report by Mark Gurman in late June claims that Apple held back some iOS 26 features at WWDC, so there will likely be some new tricks for the iPhone 17.\nSee our article on how iOS 26 changes everything and what is new in iOS 26 to learn more about these features and many others.\niPhone 17 release date\n- iPhone launch event to take place on Tuesday September 9, 2025\n- Pre-orders likely from September 12, 2025\n- Could go on sale from September 19, 2025\nWant to know when the next iPhone will come out? We have the answer: Apple has announced that its annual iPhone event will be held on Tuesday, September 9, 2025, exactly a year after the iPhone 16 event:\n- iPhone 16: Monday, September 9, 2024\n- iPhone 15: Tuesday, September 12, 2023\n- iPhone 14: Wednesday, September 7, 2022\n- iPhone 13: Tuesday, September 14, 2021\n- iPhone 12: October 13, 2020 (delayed due to Covid)\nHistorically, preorders for the iPhone begin on the Friday after the announcement, and the phones ship a week later. On occasion, some models may ship a couple of weeks later than others due to production issues. So expect pre-orders around September 12 and on sale from September 19.\niPhone 17 price\n- Similar pricing expected\n- $50 price hike in response to tariffs suggested by analyst\nWe haven’t yet heard if the iPhone 17 line will cost the same as the iPhone 16 line, which starts at $599 for the iPhone 16e and $799 for the iPhone 16.\nIf the line-up followed the formula of the past few years (Plus, Pro and Pro Max) we wouldn’t expect a change to the pricing but, because Apple is expected to replace one of the handsets with the iPhone 17 Air model, some changes to pricing are possible.\nIt’s not clear where in the line-up the iPhone 17 Air will sit. Most rumors suggest the “Plus” model will be replaced by the new super-slim “Air” model. This new model could maintain the same price as the iPhone 16 Plus, starting at $899, so the line-up could be priced as follows:\n- iPhone 17: 6.27-inch LTPO display, A19/8GB/128GB ($799)\n- iPhone 17 Air: 6.65-inch LTPO display, A19/8GB/128GB ($899)\n- iPhone 17 Pro: 6.27-inch LTPO display, A19 Pro/12GB/256GB ($999)\n- iPhone 17 Pro Max: 6.86-inch LTPO display, A19 Pro/12GB/256GB ($1,199)\nHowever, a Jeffries analyst has predicted a $50 price increase to the iPhone 17, in line with tariffs, so we could see the price raise across the range.\nWhat of the iPhone 16e? Apple introduced the $599 iPhone 16e in February 2025, so it’s not yet been on sale for a year. There may be an iPhone 17e joining the line-up, but we think that this won’t happen until spring 2026. The price is likely to be $599 for the iPhone 17e, unless Apple introduces an iPhone 17e in place of the iPhone 15, with a price of $699, in which case the iPhone 16e could remain in the line-up with its $599 price tag.\niPhone 17 FAQ\nFAQ\nWhen is iPhone 17 coming out?\nApple has announced that the iPhone 17 event, titled Awe Dropping, will be held on September 9, 2025. Therefore, iPhone 17 preorders will likely begin at 8am ET on September 12, 2025, with the new iPhone available in stores on September 19, 2025.\nHow much will iPhone 17 cost?\nThe iPhone 17 line-up is expected to match iPhone 16 series pricing, with at most a $50 price hike. This means iPhone 17 should start at between $799 and $849, iPhone 17 Pro between $999 and $1,049, and Pro Max between $1,199 and $1,249. The iPhone 17 Air is a brand-new model in the family, but if it matches the pricing of the Plus model it replaces we should be looking at a starting price of between $899 and $949.\nWhat will iPhone 17 look like?\nThe standard iPhone 17 will look very much like iPhone 16, except it will come in new color options. The iPhone 17 Pro and Air models are expected to get a new ‘camera bar’ design, in which the rectangular bump on the rear now stretches across the entire width of the iPhone. These models may also have an additional camera control button on the phone’s top edge, while Dynamic Island could get smaller. iPhone Air will be the thinnest iPhone to date, just 6.25mm thick, and may feature a titanium frame to prevent it bending. Meanwhile, the big-battery iPhone 17 Pro Max could feature a steel body to help it better dissipate heat.\nWhat colors will iPhone 17 be available in?\niPhone 17 is expected to be available in Black, White, Steel Gray, Green, Purple, and Light Blue. The new iPhone 17 Air is thought to come in Black, White, Light Blue, and Light Gold. Both iPhone 17 Pro and iPhone 17 Pro Max could feature Black, White, Gray, Dark Blue, and Orange color options.\nWhat are the iPhone 17 specs and features?\niPhone 17 is expected to get Apple’s new A19 processor, while the iPhone 17 Pro and Pro Max will get the A19 Pro, plus a boost to 12GB of RAM. All iPhone 17 models will use LTPO displays, which support a 120Hz refresh rate and always-on display. Various camera improvements include a 24Mp TrueDepth selfie camera across the range, while all models will also benefit from 50W MagSafe charging, according to sources.\nWill the next iPhone be called iPhone 26?\nNo. While Apple is moving its software naming convention in line with the year of release (affecting iOS 26, macOS 26, iPadOS 26, and watchOS 26), the same is not expected for its hardware. The next iPhone will be iPhone 17, likely with Air, Pro and Pro Max variants. Slightly confusingly, these software versions will actually be released in 2025, but for the majority of their lifetime it will be 2026.\niPhone history\nThe iPhone 16 range and the iPhone 16e are the current-generation models available from Apple. Below you can find links to our reviews of all iPhone models, including the latest generation. Learn more about all the new Apple products coming this year and when is the next Apple event. You might also want to check out our advice on when is the best time to buy a new iPhone, our iPhone buying guide, and our comparison of every iPhone that is available to buy today.\n- Original iPhone (2007) review\n- iPhone 3G (2008) review\n- iPhone 3GS (2009) review\n- iPhone 4 (2010) review\n- iPhone 4s (2011) review\n- iPhone 5 (2012) review\n- iPhone 5c (2013) review\n- iPhone 5s (2013) review\n- iPhone 6 (2014) review\n- iPhone 6 Plus (2014) review\n- iPhone 6s (2015) review\n- iPhone 6s Plus (2015) review\n- iPhone SE (1st generation; 2016) review\n- iPhone 7 (2016) review\n- iPhone 7 Plus (2016) review\n- iPhone 8 (2017) review\n- iPhone 8 Plus (2017) review\n- iPhone X (2017) review\n- iPhone XR (2018) review\n- iPhone XS (2018) review\n- iPhone XS Max (2018) review\n- iPhone 11 (2019) review\n- iPhone 11 Pro (2019) review\n- iPhone 11 Pro Max (2019) review\n- iPhone SE (2nd generation; 2020) review\n- iPhone 12 (2020) review\n- iPhone 12 Mini (2020) review\n- iPhone 12 Pro (2020) review\n- iPhone 12 Pro Max (2020) review\n- iPhone 13 (2021) review\n- iPhone 13 mini (2021) review\n- iPhone 13 Pro (2021) review\n- iPhone 13 Pro Max (2021) review\n- iPhone SE (3rd generation; 2022) review\n- iPhone 14 (2022) review\n- iPhone 14 Plus (2022) review\n- iPhone 14 Pro (2022) review\n- iPhone 14 Pro Max (2022) review\n- iPhone 15 (2023) review\n- iPhone 15 Plus (2023) review\n- iPhone 15 Pro (2023) review\n- iPhone 15 Pro Max (2023) review\n- iPhone 16 & 16 Plus review\n- iPhone 16 Pro & Pro Max review\n- iPhone 16e review"
    },
    {
      "url": "https://go.skimresources.com?id=111346X1569486&xs=1&url=https://www.trendforce.com/presscenter/news/20240906-12295.html&xcust=1-1-2898597-1-0-0-0-0&sref=https://www.macworld.com/article/2898597/the-iphone-17-pro-could-cost-an-extra-200-this-year.html",
      "text": "TrendForce reports that Apple's upcoming iPhone 16 series will be powered by the new A18 and A18 Pro processors and will feature a comprehensive DRAM upgrade to support Apple Intelligence. The excitement around Apple Intelligence has been building since WWDC24, and with a relatively low base in 2023, Apple’s four new models are expected to have a combined production volume of 86.7 million units in the second half of 2024, marking an 8% year-on-year increase. Looking at total production for 2024, Apple is currently close to Samsung, the market leader, and could potentially surpass Samsung by the end of the year to become the top smartphone manufacturer by market share for the first time.\nAll four iPhone 16 models will utilize TSMC's new 3nm process for the A18 and A18 Pro processors, breaking from the usual practice of reusing the previous generation's processor in some models. This shift is likely driven by cost considerations, as the previous generation's 3nm process (N3B) is more expensive than the current N3E process. As a result, Apple has chosen to use the more cost-effective N3E technology across all models.\nTrendForce also notes that the display sizes for both iPhone 16 Pro models will be slightly larger than those of the previous generation. Despite earlier rumors suggesting the iPhone 16 and 16 Plus would have a frame rate upgrade to 90Hz, they will remain at 60Hz. Additionally, the DRAM capacity for the iPhone 16 and 16 Plus has been upgraded, meaning all four new models will feature LPDDR5X 8GB to support Apple Intelligence.\nApple Intelligence is a major highlight of the iPhone 16 series this year. While the LLM parameters on Apple’s devices are not as extensive as those on Android phones, Apple is expected to achieve superior system integration thanks to its closed ecosystem, self-developed processors, and strong control over app development.\nThe company is also focusing on improving Siri’s accuracy and has partnered with ChatGPT to boost AI performance. TrendForce points out that Apple Intelligence will gradually roll out more features and support for additional languages. However, its functionality in China remains unclear, and the lack of significant AI-centric applications could potentially impact sales of the iPhone 16 series this year.\nThe overall cost of the new iPhone models has slightly increased due to a significant rise in memory prices over the past year. However, considering the current downturn in the smartphone industry, Apple is expected to maintain a cautious pricing strategy. TrendForce suggests that the USD pricing for the four new models launched this year is likely to remain on par with the iPhone 15 series or see a slight increase to balance higher costs while driving sales and maintaining profitability. The iPhone 16 Pro, featuring a periscope lens, may follow last year's Pro Max strategy by starting with a base storage capacity of 256GB, which could help mitigate the perception of a price increase by offering more storage.\nTrendForce also notes that even if prices remain the same, consumer behavior—such as capturing and storing high-resolution photos and videos, downloading music and large games, and frequently installing apps—will continue to drive up demand for average storage capacity. Given Apple’s strategy of charging premiums for storage upgrades and the corresponding costs of NAND Flash, this trend could allow Apple to achieve greater profitability.\nFor more information on reports and market data from TrendForce’s Department of Semiconductor Research, please click here, or email the Sales Department at SR_MI@trendforce.com\nFor additional insights from TrendForce analysts on the latest tech industry news, trends, and forecasts, please visit https://www.trendforce.com/news/\nSubject\nRelated Articles\nRelated Reports"
    }
  ],
  "argos_summary": "Apple is expected to raise the iPhone 17 Pro starting price to $1,199, a $200 increase over the previous model, driven by a shift to 256GB storage and higher RAM. TrendForce predicts the Pro Max will also see a $100 hike to $1,299. The price bump aligns with broader cost pressures and tariff impacts, while the standard iPhone 17 is likely to stay at $799-$849. Apple’s event is slated for September 9, 2025, with pre‑orders beginning September 12 and sales on September 19.",
  "argos_id": "6GFVILGPX"
}