{
  "url": "https://www.fool.com/earnings/call-transcripts/2025/09/03/chargepoint-chpt-q2-2026-earnings-transcript/",
  "authorsByline": "Motley Fool Transcribing",
  "articleId": "3ba407e935ec45b59155c9730462a4ef",
  "source": {
    "domain": "fool.com",
    "location": {
      "country": "us",
      "state": "VA",
      "city": "Alexandria",
      "coordinates": {
        "lat": 38.8051095,
        "lon": -77.0470229
      }
    }
  },
  "imageUrl": "https://cdn.content.foolcdn.com/images/1umn9qeh/production/b4204f36ed605fc54d4ba32e2cb31d1dd892afd6-800x450.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T23:03:55+00:00",
  "addDate": "2025-09-03T23:21:33.117639+00:00",
  "refreshDate": "2025-09-03T23:21:33.117641+00:00",
  "score": 1.0,
  "title": "ChargePoint (CHPT) Q2 2026 Earnings Transcript",
  "description": "ChargePoint (CHPT) Q2 2026 Earnings Transcript",
  "content": "Need a quote from a Motley Fool analyst? Email [email protected]\n• CEO Wilmer explicitly cited, \"The forthcoming expiration of the Consumer 30D EV tax and 30C alternative fuel vehicle refueling credit are also sources of concern for future EV adoption,\" indicating potential demand risk in North America.\n• CEO Wilmer referenced \"delays for major projects we have won extended expansion build-outs,\" which has caused the company to delay its non-GAAP adjusted EBITDA breakeven timeline beyond this year.\n• Revenue-- $99 million in revenue for fiscal Q2 2026 (period ended July 31, 2025), at the top of guidance, sequentially higher, but down 9% year-over-year.\n• Non-GAAP gross margin-- 33% non-GAAP, the highest since going public, up three percentage points sequentially and eight percentage points year-over-year for fiscal Q2 2026.\n• Cash on hand-- $195 million in cash on hand at the end of fiscal Q2 2026, essentially flat compared to the prior quarter ($196 million), supported by structural OpEx changes and minimal cash usage of less than $2 million.\n• Network footprint-- Over 363,000 managed ports globally, including more than 37,000 DC fast chargers and 123,000 in Europe as of fiscal Q2 2026; overall, the company's drivers have access to nearly 1,300,000 charging ports worldwide.\n• Subscription revenue-- $40 million, comprising 40% of total revenue, up 5% sequentially and 10% year-over-year, reflecting an expanding installed base in fiscal Q2 2026.\n• Non-GAAP operating expenses-- Non-GAAP operating expenses were $59 million in fiscal Q2 2026, up 3% sequentially due to increased R&D, but down 12% year-over-year.\n• Non-GAAP adjusted EBITDA loss-- Non-GAAP adjusted EBITDA loss — $22 million in the second quarter, improving from a $23 million loss in the prior quarter and a $34 million loss in the same quarter last year.\n• Inventory-- $212 million, virtually flat quarter-over-quarter in fiscal Q2 2026, with ongoing initiatives to gradually reduce inventory and free up cash.\n• Geographic revenue split-- North America accounted for 84% and Europe for 16% of revenue in fiscal Q2 2026, consistent with Q1.\n• Product mix-- Network charging systems generated $50 million (51%), subscriptions $40 million (40%), and other $8 million (8%) in fiscal Q2 2026, with component figures not summing due to rounding or allocation.\n• Guidance-- Fiscal 2026 revenue is expected to be $90 million to $100 million, with a cautious outlook and non-GAAP adjusted EBITDA breakeven now delayed beyond the current year.\n• Strategic partnership developments-- Operationalization of Eaton partnership progressing, with co-branded and new DC express line products launching, expanding channel reach and revenue opportunities.\n\nChargePoint (CHPT 1.68%) now targets non-GAAP adjusted EBITDA breakeven in future quarters rather than within the year, directly attributing the change to project build-out delays and a shifting macroeconomic environment. Management confirmed that all major project delays are postponements, not cancellations, though revenue growth trajectories were impacted in fiscal Q2 2026. The new express line of DC charging solutions and bidirectional home charging -- developed with Eaton -- are expected to improve hardware gross margins (non-GAAP) and broaden the company’s addressable markets. Subscription gross margin reached a GAAP record high of 61% in fiscal Q2 2026, and management indicated further expansion is likely due to economies of scale and support cost optimization. Annual cash burn has declined sharply over the past few quarters, attributed to improved working capital management and lower spending, with CFO Katani noting the possibility of generating cash in a quarter before non-GAAP adjusted EBITDA profitability is reached.\n• Initial deployments from the Eaton partnership began generating revenue in fiscal Q2 2026, and early Flex Plus and DC solutions are strategically positioned for growth in European markets.\n• CEO Wilmer described the macro conditions in Europe as \"looking better right now than they are in North America,\" indicating a shift of focus and stronger pipeline overseas.\n• CFO Katani stated, \"Our $150 million revolving credit facility remains undrawn, and we have no debt maturities until 2028,\" providing additional financial flexibility.\n• Management reported the ongoing industry consolidation, with Wilmer describing the landscape as \"quite active,\" though no specific transactions were disclosed during the call.\n• DC fast charger: Direct current charging station capable of rapidly replenishing electric vehicle batteries, typically used for public or high-throughput locations.\n• 30D EV tax credit: U.S. federal tax credit for consumers purchasing electric vehicles, scheduled for expiration and referenced as a source of market uncertainty.\n• 30C alternative fuel vehicle refueling credit: U.S. federal tax credit for installing alternative fuel vehicle refueling infrastructure, including EV charging stations, also approaching expiration as noted on the call.\n• OpEx: Operating expenses, including R&D and G&A, crucial for understanding company cost management priorities stated in the call.\n• NRE: Non-recurring engineering -- one-time R&D costs, referenced in context to elevated spend for new product development.\n• B2G: Bidirectional-to-grid, enabling energy transfer between a vehicle and the grid, cited as a feature of the new DC express line.\n\nAJ Gosselin: Good afternoon, and thank you for joining us on today's conference call to discuss ChargePoint Holdings, Inc.'s Second Quarter Fiscal 2026 Earnings Results. This call is being webcast and can be accessed on the Investors section of our website at investors.chargepoint.com. With me on today's call are Rick Wilmer, our Chief Executive Officer, and Manzi Katani, Chief Financial Officer. This afternoon, we issued our press release announcing results for the quarter ended July 31, 2025, which can be found on our website. We would like to remind you that during the conference call, management will be making forward-looking statements, including our outlook for 2026.\n\nThese forward-looking statements involve risks and uncertainties, many of which are beyond our control and could cause actual results to differ materially from our expectations. These forward-looking statements apply as of today, and we undertake no obligation to update these statements after the call. For a more detailed description of certain factors that could cause actual results to differ, please refer to our Form 10-Q filed with the SEC on June 6, 2025, and our earnings release posted today on our website and filed with the SEC on Form 8-K.\n\nAlso, please note that we use certain non-GAAP financial measures on this call, which we reconcile to GAAP in our earnings release and for certain historical periods in the investor presentation posted on the Investors section of our website. And finally, we will be posting a transcript of this call to our investor relations website under the Quarterly Results section. Thank you. I will now turn the call over to our CEO, Rick Wilmer.\n\nRick Wilmer: Good afternoon, and thank you for joining the ChargePoint Holdings, Inc. second-quarter fiscal 2026 earnings call. We are pleased to report solid results for the quarter. Second quarter revenue was $99 million, landing at the top of our guidance range. Non-GAAP gross margin improved sequentially, with Q2 results coming in at 33%. This figure is notable as the highest gross margin we have reported since becoming a public company, and we successfully mitigated tariffs to achieve it. Cash management was exceptional, with our ending balance at $195 million, only $2 million below Q1's close, largely driven by structural OpEx changes we have been making over the last year.\n\nOur collaboration with GM is also progressing, with nearly a dozen sites and more than 50 new fast charging ports and many more scheduled to launch this year. Overall, ChargePoint Holdings, Inc. now manages over 363,000 ports, including more than 37,000 DC fast chargers and 123,000 located in Europe. Globally, ChargePoint Holdings, Inc. drivers can access nearly 1,300,000 charging ports. We achieved this performance despite the uncertainty, particularly in North America. Within the US, passenger EV sales growth slowed to a 3% year-over-year increase. The forthcoming expiration of the Consumer 30D EV tax and 30C alternative fuel vehicle refueling credit are also sources of concern for future EV adoption.\n\nAlong with the evolving tariff landscape, this has translated into delays for major projects we have won extended expansion build-outs, but no project cancellations. So we are making solid progress on our path, as we saw over the past year, to non-GAAP adjusted EBITDA breakeven. Considering these delays and their impact on revenue, we have determined we will be best positioned if we push out our EBITDA breakeven beyond this year. This is to ensure we can fund product innovation and commercialization efforts, which we expect to drive durable revenue growth. Uncertainty aside, we believe our go-to-market strategy and innovation put us on a firm footing to drive growth, win market share, and hit EBITDA positive in the coming quarters.\n\nRegarding our go-to-market strategy, we are rapidly operationalizing our partnership with Eaton, and that work will be largely completed this quarter. Since this partnership was announced in May, we continue to build confidence that together we will accelerate the deployment of electric vehicle charging infrastructure across North America and Europe. We have already introduced our co-branded product, expanded our channel reach, accessed new strategic accounts, and started generating new streams of revenue together. We are delivering innovation, which has been accelerated and expanded because of our partnership with Eaton.\n\nThe express line of DC charging solutions powered by Eaton and announced last week combines the strength of both companies to deliver more power in less space with massive scalability along with the easiest and fastest installation. It features Eaton hardware for grid connectivity plus B2G capabilities. The net result will be substantially lower CapEx and operating costs and faster deployment timelines. It will change the game in terms of the economics of DC fast charging for our customers. We are also co-developing a bidirectional home charging solution with advanced energy management.\n\nThe integration of ChargePoint Holdings, Inc.'s Flex Plus chargers with Eaton's Able Edge smart panels and breakers enables vehicles to supply backup power to homes and also automatically adjust EV charging based on the home energy usage. To allow homeowners to install EV charging, the behind-the-meter insights will help utilities manage grid stress and transformer loads. We expect this synergistic type of innovation will deliver real value to homeowners, utilities, and auto OEMs while at the same time driving market share gains. Both the new express line of DC solutions and flex product line are designed to not only deliver market differentiation but also cost-effectiveness. We expect both product lines to have a positive impact on our hardware gross margins.\n\nMoving to markets, Europe seems promising going forward. Roadmotion reports a 26% year-over-year increase in European EV sales during the first half of the year, which is a strong indicator of future charging demand in Europe. We believe the current infrastructure cannot support such growth. With the innovation and new products we are delivering, we will be well situated to capture much of this demand. In summary, despite an uncertain environment causing delays, we delivered strong results. We are operationalizing our strategic Eaton partnership, which accelerates innovation and expands our reach. We are delivering game-changing products poised to strengthen our market share and profitability. Internally, the team continues to execute with excellence.\n\nOur long-term thesis remains intact, validated by the strength of our pipeline, the positive reaction to our new products, and the new partners and customers we are actively signing. I will now turn the call over to our Chief Financial Officer, Manzi Katani.\n\nManzi Katani: Thanks, Rick. As a reminder, please see our earnings press release where we reconcile our non-GAAP results to GAAP. Our principal exclusions are stock-based compensation, amortization of intangible assets, and certain costs related to restructuring settlements, and nonrecurring legal expenses. Revenue for the second quarter was $99 million at the high end of our guidance range, sequentially higher than the prior quarter and down 9% year-on-year. Network charging systems at $50 million accounted for 51% of second quarter revenue. Subscription revenue at $40 million was 40% of total revenue, 5% higher sequentially and up 10% year-on-year as our total installed base continued to increase. Other revenue at $8 million was 8% of total revenue.\n\nTurning to verticals, which we report from a billings perspective, second quarter billings percentages were commercial 75%, fleet 11%, residential 10%, and other 4%. From a geographic perspective, North America made up 84% of revenue, and Europe was 16%. This was relatively consistent with the first quarter. Non-GAAP gross margin was 33%, growing by three percentage points sequentially and eight percentage points year-on-year. This is attributable to higher hardware margins, higher subscription margins, as well as subscription revenue growing as a percentage of total revenue. I would like to point out that this was our seventh straight quarter of sequential non-GAAP gross margin improvement. Hardware gross margin increased 1% sequentially despite the impact of higher tariffs.\n\nSubscription margin continued to grow, reaching another record high of 61% on a GAAP basis and was even higher on a non-GAAP basis, reflecting economies of scale and continued optimization of support costs. Non-GAAP operating expenses were $59 million, up 3% sequentially and down 12% year-on-year. The small sequential increase this quarter was mainly due to a temporary increase in R&D spend as a result of higher NRE and contractor spend related to the development of our recently announced new AC and DC charging product architecture. This increase will persist in the third quarter, but we should see the spend gradually coming down in Q4 and then further reducing next year.\n\nWe are continuing to closely manage operating expenses, balancing investments that we believe will lead to significant future growth and margin expansion while also being mindful of current constraints. Non-GAAP adjusted EBITDA loss was $22 million. This compares with a loss of $23 million in the prior quarter and a loss of $34 million in the second quarter of last year. Stock-based compensation was $18 million, flat to last quarter and down from $19 million in the second quarter of last year. Our inventory balance remained virtually flat to the prior quarter at $212 million.\n\nWhile this balance did not decrease due to existing commitments with contract manufacturers, we continue to drive towards a gradual reduction in inventory over the next few quarters, which will free up cash. Speaking of cash, we ended the quarter with $195 million of cash on hand versus $196 million in the prior quarter, resulting in cash usage of less than $2 million. This compares with $49 million of cash usage in Q2 of last year and $29 million in Q1 this year. We have been able to significantly reduce cash burn over the past few quarters mainly due to spend reductions and working capital management.\n\nOur $150 million revolving credit facility remains undrawn, and we have no debt maturities until 2028. Turning to guidance, for 2026, we expect revenue to be between $90 million to $100 million. While we continue to guide cautiously given the challenging and constantly changing macro backdrop, delivering revenue growth, and ultimately reaching non-GAAP adjusted EBITDA breakeven and generating positive cash flow remain our primary focus areas.\n\nAs Rick mentioned, given the macroeconomic headwinds, the trajectory of revenue growth required to get to non-GAAP adjusted EBITDA breakeven in a quarter will take longer to materialize than this year, but we expect to continue to make progress towards profitability and reducing cash burn, which we have managed to do well over the past year. We will now open the call for questions. Thank you.\n\nOperator: We will now begin the question and answer session. We also ask that you limit yourself to one question and one follow-up. Your first question comes from the line of Colin Rusch with Oppenheimer. Please go ahead.\n\nColin Rusch: Thanks so much, guys. Now, can you just talk a little bit about what the trajectory is on OpEx? Obviously, R&D is remaining at some elevated levels along with G&A. Just want to get a sense of how that should trend over the balance of this fiscal year.\n\nManzi Katani: Yeah. Hi, Colin. I will take that one. Yes. As I mentioned in my prepared remarks, OpEx is slightly higher than Q1 because of some investment we did on the R&D front. We have spent on prototyping as we are releasing these new products and releasing the new AC and DC architecture. Those are temporary one-time, if you will, NRE costs. And then we also had elevated expenses on the contractor side this quarter. Now we expect this to persist in the next quarter because we are really in the middle of releasing all of these products. There is a lot of activity going on around that. But I think it should come down gradually in Q4.\n\nAnd then we will manage it better next year.\n\nColin Rusch: Great. And then just from a sales perspective, you know, we all know what is going on in North America and then, you know, kind of a digestion of the new policy. But I am curious, you know, in Europe, other geographies where you are seeing any potential higher growth opportunities, you know, particularly with this Eaton relationship and global footprint there? Are there other areas that you see, you know, the products ending up that could surprise us in some way around the growth trajectory?\n\nRick Wilmer: Yeah. I think hey, Colin. I think the overall macro conditions in Europe are looking better right now than they are in North America. Hopefully, things will start to clarify in North America once we get through the tax credit expiration in September. But in Europe, a lot of the products that are driving some of the incremental OpEx spend that Manzi alluded to are targeted at Europe, where we did not have solutions to serve those use cases in the past. So the flex product line that we have announced a month or so ago will launch in Europe. Here soon. In fact, we have now got inventory position in Europe to begin fulfilling early sales.\n\nAnd then the new DC Express architecture that we also announced will be targeted at Europe, where in the past we have not had a DC product that was developed by us available in Europe. So we are as we move forward into the new year. It is a combination of a more positive macro environment and new products to serve that market that we believe are quite differentiated.\n\nColin Rusch: Great. Thanks so much, guys. I will hop back in queue.\n\nOperator: Your next question comes from the line of Chris Dendrinos with RBC Capital Markets. Please go ahead.\n\nChris Dendrinos: Hi. Good evening, and thank you. I guess maybe to start here, just wanted to follow-up on that question in regards to the AC architecture or the new AC launch in Europe. Can you maybe speak to the initial kind of interest levels there? And mentioned inventory? I guess, maybe what is the channel like, and what has been the response from the dealerships? Dealer channel there? Thanks.\n\nRick Wilmer: Yeah. So it is very early, Chris. We have just moved the first bit of inventory into Europe. We have had successful early access customers. And we are beginning to build up our channel interest and target our end customer base in three major geographies in Europe. The UK, France, and Germany. We have got all the approvals to serve all the markets, all those different product configurations based on the requirements in each of those major European geos. So we will be really getting clarity on the overall demand that we expect early on with this new product as we move through this quarter, but early indications have been positive.\n\nChris Dendrinos: Got it. Okay. And then, you know, maybe as a follow-up here, you know, we are only, I guess, a month or two removed from the passage of the OB3, but just kind of thinking about the demand outlook in sort of, call it, lower for longer outlook in the US. I guess, how are you thinking about, you know, the company's positioning here just given the changes in that dynamic? Are you financially in the right place? Do you need to change personnel or strategy at all or slow down maybe some of the development going forward? Thanks.\n\nRick Wilmer: No. I think just the opposite. I mean, within the constraints of our OpEx envelope, I really believe the path to success is to deliver innovation to the market, which we have clearly been doing as we have moved through the year with some of the more significant innovations just announced recently that we mentioned a minute ago. You know, the market, this whole industry went through a hype cycle. It collapsed in 2023. I think there is going to be ongoing demand for EVs. There are indications of that happening.\n\nI think I have seen data from Cox that July will be a record sales for EVs in North America, largely as a result of the tax credit expiration coming up this month. But what that tells us is that there is interest in EVs and demand for EVs if the price point is right. And I think we are seeing a lot of good innovation on the vehicle side. You can look at Ford's new platform announcement. Slate Auto, they announced their new vehicle.\n\nThere is just a bunch of things happening out there that are going to bring the selection up and the price down on EVs, which we believe will drive overall demand for EVs and thus charging going forward into the future. This down cycle is obviously putting pressure on everybody. And I think the industry is going to ultimately consolidate as a result of that. And I believe we are in the best position to capitalize on that. We are the biggest company with the biggest balance sheet. We serve both North America and Europe.\n\nWe have got a strong product portfolio spanning from home all the way up to DC fast charge, along with all the software to manage it for every use case. So I think we are in a great position going forward.\n\nChris Dendrinos: Got it. Thank you.\n\nOperator: Your next question comes from the line of Mark Delaney with Goldman Sachs. Please go ahead.\n\nMark Delaney: Yes. Good afternoon. Thank you for taking my questions. Was hoping first you could elaborate more on what you are hearing from customers with respect to their project plans, in particular for North America. Rick, you mentioned some projects are being delayed but not canceled. Can you share more on what you think it would take for customers to move forward with those delayed projects? Then any context they are sharing about how they are thinking about project timing, especially with the 30C tax credits for charging stations set to go away.\n\nRick Wilmer: Yeah. Good question. And I think there is, you know, like, we have got, you know, some being cautious about our look forward. I think our customers are as well. They all again, remain committed to their projects. We have literally not heard of one project cancellation, but I think once the tax credits go away and we see what that means to EV sales, you will see some more decisive in the market regarding moving forward and hopefully not, you know, canceling or pausing, but we are waiting for that to happen, you know, to provide some clarity. Beyond that, it is the typical stuff that causes project delays. It is getting grid upgrades. It is construction timelines.\n\nIt is all the things that we have historically seen in the past where customers that are doing big projects, particularly often have kind of best-case timelines as if everything goes well, and then a permit gets delayed, the weather disrupts a construction project, and all of a sudden things are moving out. So that factor continues to persist, but it has not changed much.\n\nMark Delaney: Okay. Thank you for that detail, Rick. My other question was for you, Manzi, on the gross margin. Nice to see the improvement you reported this quarter. You have spoken in the past about the potential for the hardware gross margins to continue to improve as you work off inventory of older products and shift your mix toward the lower-cost product that you are building with contract manufacturers. Maybe you can share more where you are in that process and as you fully make the transition, how much do you think it could help the hardware gross margins? Thank you.\n\nManzi Katani: Yeah. Hi, Mark. So what we saw this quarter was, you know, hardware margins improved sequentially by a percentage point. By a percentage point, and this was because we actually did see some products coming from Asia, lower cost, but we also saw improvement in warranty cost. And we saw efficiencies in non-bomb related cost, which drove the margins up. Going forward, I think those factors will continue to benefit us. And then depending on inventory and sell-through, we should start seeing the benefit of the Asia manufacturing as well.\n\nOperator: Your next question comes from the line of Mickey Legg with The Benchmark Company. Please go ahead.\n\nMickey Legg: Hey, guys. Thanks for taking my question. Wanna dig in on the competitive landscape and how that is evolving a little bit. Could you talk about how you view your software and the moat you built around that, now that peers to be moving a bit harder into operation and software platforms?\n\nRick Wilmer: Thanks. Yeah. Hi, Nikki. Good question. I think we have got a state-of-the-art software platform that continues to evolve and modernize. We have now got a hybrid cloud solution. The amount of AI that we are integrating into the product is very interesting and exciting. I think it is going to unleash some real value for our customers. I also believe and know, quite frankly, that we can unlock all kinds of value by having our software work with our hardware. While we are happy to have our software manage third-party hardware, which we do all the time, which is oftentimes a requirement for customers, we will continue to do that.\n\nBut we remain committed to developing hardware as well because we know that our hardware plus software can create more value and do things that cannot be done with just stand-alone software.\n\nMickey Legg: Okay. Great. That is all for me. Thanks.\n\nOperator: Your next question comes from the line of Chris Pearce with Needham and Company. Please go ahead.\n\nChris Pearce: Hey. Good afternoon, Rick and Manzi. I was just curious. At least out in California, we are seeing a lot of increased DC charging setups, money going into DC charging. Yeah. I was curious, do you think that is taking share from level two where people thought level two might have higher share in, you know, if we look back a couple of years to what people might see now or what are you guys doing around that, or do you think the idea behind the question is wrong? I just kind of like a sense of level two demand, DC charging demand, how you are kind of fitting both those buckets and what you are seeing.\n\nRick Wilmer: We do not see, you know, DC cannibalizing AC demand. I mean, there are different use cases and as we have talked about more than once, the vast majority of charging is done at home and at work, which is typically level two charging. On the financial side, though, we are seeing a lot of interest or a reasonable amount of interest, I would say increased interest, from financing partners behind, you know, DC fast charging for general public charging. We have had some good success with partners that we have found that want to work with us to deploy DC fast charging for the general public.\n\nChris Pearce: And then if we go back to the inventory, Manzi, this one is sort of be for you. Is that something you have in the inventory now? And I guess with the inventory dollars staying where they are, but things are changing under the surface, I just wanted to kind of check-in on any outsourcing risk or DCAC, new product versus old product, you kind of frame all that?\n\nManzi Katani: Yeah. No. I mean, you know, our inventory balance has, you know, a variety of different products and different volumes of all the different products. And we are managing that, you know, based on the arrival of the new products. We are watching that closely. Again, the release date of the new product and the, you know, the general availability and, you know, increased volume is going to take some time, and we are kind of watching each product level with their release dates and inventory balance. And managing that.\n\nBut in terms of if your question is about, you know, shortage or, you know, any kind of movement needed from one product to the other or the need to kind of source more. We do not see any of that.\n\nChris Pearce: Okay. Thank you for your time.\n\nOperator: Your next question comes from the line of Craig Irwin with Roth Capital. Please go ahead.\n\nCraig Irwin: Hi, good evening. Thanks for taking my question. So cash use this quarter was really tight, right? You guys have been squeezing a lot of cash out of, you know, receivables, inventories, prepaid, I mean, payables, everything was a contribution this quarter. Can you talk about the ability to continue squeezing the balance sheet for cash and, you know, the new products that are launching for the end of the year, did they need a cash contribution for inventory for us to see the revenue start to ramp? Or, you know, can that be offset by continued progress bringing down balances from other products?\n\nManzi Katani: Yeah. Hi, Craig. And so I think, you know, there may be quarterly fluctuations in cash usage. Obviously, Q2 was fantastic in terms of cash usage, use less than $2 million, but there may be slight quarterly fluctuations depending on the timing of receivables, pay of sale of inventory, etcetera. But we do anticipate that the overall trend of declining annual cash usage will continue and it is entirely possible that because of our capitalized business model, we might get to the point where we generate cash in a quarter before we achieve EBITDA profitability. And we anticipate that we will particularly benefit from this when we start to bring inventory balance down.\n\nIn terms of the new products, I do not think it will impact inventory because, I mean, I think the overall inventory reduction trajectory should still happen, and it should release cash because obviously, the inventory number as it stands now is pretty high.\n\nRick Wilmer: The other comment I will make, Craig, is that the supply chain timeline or lead time is pretty balanced with the sales cycles now in many cases. So you would be, unlike the COVID days, for example, we do not need to build far in advance of demand such that we can adhere to customer lead time requirements. We can balance that pretty effectively now.\n\nCraig Irwin: Understood. And if I could squeeze another one in on the gross margin side. Can you maybe talk about the commonality of parts in the new products that you are launching? You know, I know a lot of your products introduced to date have had substantial commonality in the architecture and components to drive purchasing leverage. You know, is there maybe a change in architecture or an evolution here? How much do the new products benefit from the pre-existing buy? And, you know, would you expect these products to potentially be margin accretive heading into the end of the year?\n\nRick Wilmer: Yes. So at a part level, there is probably not that much commonality between the old products and the new. There are some exceptions. For example, charging cables or charging cables. They do not change very much from product to product depending on level two, level three, for example. What is common is the vendor base. And the leverage we have with the supply base is really driven by the amount of business we concentrated in certain suppliers as opposed to specific individual parts that we buy from them. That may change as we move on from product generation to product generation.\n\nCraig Irwin: Thank you for that. Congratulations again on the progress this quarter.\n\nOperator: Your next question comes from the line of Ryan Sings with B. Riley. Please go ahead.\n\nRyan Sings: Hey, guys. Thanks for taking my questions. I will just ask a couple of follow-ups on Europe. Looks like it is almost 20% of revenue right now. I am curious where you think Europe could go in terms of ChargePoint Holdings, Inc.'s overall revenue mix over the next few years? And could you remind us if there are any material differences in terms of your economics in Europe compared to in North America?\n\nRick Wilmer: The economics are a lot different. The different European countries have different regulations and requirements, which makes it a bit more complex from an standpoint to make sure you have the right product for the right country, for example. But that is fairly minor relative to the overall dynamics of the business comparing North America to Europe. We are not guiding, you know, revenue beyond this quarter. But the fact that we have got hardware products going into Europe that are our products that we have not been able to offer previously implies that, you know, Europe will definitely be growing for us.\n\nRyan Sings: Got it. Appreciate that color, Rick.\n\nOperator: Your next question comes from the line of Bill Peterson with JPMorgan. Please go ahead.\n\nBill Peterson: Yeah. Hi. Good afternoon, and thanks for taking my questions. I would like to follow-up on gross margins. Been asked a few different ways. But just looking ahead, how should we think about steady-state margins for hardware when you are really past any sort of existing inventory and you are on, I guess, an optimized platform, what should that look like over the long term or, I guess, on a go-forward basis? As well as subscriptions? Could you been doing some work there to optimize that part of the business as well. I am just trying to get a sense for how we should think about steady-state margins.\n\nAnd I guess, you mentioned you are navigating tariffs, but could you quantify the impact so we can at least understand what level of impact there is? Should we get any relief? Or conversely, if tariffs become more, I guess, impactful?\n\nManzi Katani: Yeah. Hi, Bill. I will take that one. So I started this margins. I think subscription margins should continue to improve with economies of scale and ongoing efficiency in our support organization. Our, you know, revenue keeps growing, but we do not have to scale costs up. So that the improvement should continue. As you said, it is, you know, more than 61% on a non-GAAP basis this quarter. I think that trend continues. On the hardware side, again, as we see products coming in from Asia, it, you know, margins should get better. We saw improvement in warranty cost. Other efficiencies, and non-bomb cost, all of that could help.\n\nHowever, on the hardware side, the overall margin really depends on the mix of products sold, which is difficult to predict. So it is hard to call out an ideal state. There are a lot of moving parts there. And also overall, for margins, there is a factor of subscription revenue as a percentage of overall revenue. If that improves, obviously, go up. But as we start selling more hardware, that could impact overall margins.\n\nRick Wilmer: The other comment I will make, Bill, is that the new products we expect to have higher baseline margin profiles than any of our existing products. We have been very focused on not only designing for features, functionality, broad applicability, but also for cost profile.\n\nManzi Katani: Yep. And then on the tariffs, so we have a lot of tariff mitigation already in place. We have, you know, a spread-out manufacturing base across the globe, which we are kind of leveraging to manage tariffs. It was not really meaningful within this quarter, and like I said, we were able to mitigate the tariffs that we had and whatever we did incur, we actually, you know, we had improvements that kind of overcame that. So I do not think there is that much of an impact on what we know today. Of course, if that tariff environment changes, then things could change.\n\nBill Peterson: Okay. Thanks for that. One of the\n\nOperator: My apologies. Please repress star one. Your next question comes from John Winham with UBS. Please go ahead.\n\nJohn Winham: Hi. This is John. Hopefully, you can hear me okay?\n\nJohn Winham: Yeah. Perfect. You have mentioned a potential for consolidation in the industry. I was wondering if you could talk through if there have been any early signs of that in Europe or the US or anywhere you can sort of point to. Appreciate it. Thanks.\n\nRick Wilmer: Yeah, John. I cannot talk to anything specifically, but it seems like it is quite active. There are a lot of interesting conversations going on.\n\nJohn Winham: Maybe just ask the question sort of a little bit differently. And without asking anything specific, in terms of where it would be, what would you see the advantages as an analyst, when we are looking at this, it is taking out OpEx as a percentage of revenue, greater network scale. If you could just talk to what you think the advantage of consolidation would be, I would really appreciate it. Thank you so much.\n\nRick Wilmer: Yeah. I think it is pretty typical after you go through a hype cycle and you end up with, you know, a lot of companies getting started during that hype cycle with what looks like a, you know, an exciting fast-growing market, then you get overcrowding in terms of the competitive landscape. And you have got people that are trying to survive and they tend to try and fight on price. And they race each other to the bottom. And they end up in a situation where they just do not have an economic model that no longer makes sense.\n\nOperator: Your next question comes from the line of Ryan Pfingst with B. Riley. Please go ahead. And we have no further questions in our queue at this time. And that does conclude today's conference call. Thank you for your participation. And you may now disconnect.",
  "medium": "Article",
  "links": [
    "https://www.fool.com/cdn-cgi/l/email-protection",
    "https://www.fool.com/quote/nyse/chpt/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new product",
      "weight": 0.06680581
    },
    {
      "name": "new products",
      "weight": 0.06680581
    },
    {
      "name": "new product development",
      "weight": 0.062696405
    },
    {
      "name": "hardware products",
      "weight": 0.06084803
    },
    {
      "name": "flex product line",
      "weight": 0.05912289
    },
    {
      "name": "other products",
      "weight": 0.058019888
    },
    {
      "name": "product innovation",
      "weight": 0.057939276
    },
    {
      "name": "Second quarter revenue",
      "weight": 0.05779879
    },
    {
      "name": "second quarter revenue",
      "weight": 0.05779879
    },
    {
      "name": "different products",
      "weight": 0.05646452
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9921875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.93017578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.88330078125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.646484375
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.64013671875
    }
  ],
  "sentiment": {
    "positive": 0.30585513,
    "negative": 0.554221,
    "neutral": 0.13992389
  },
  "summary": "ChargePoint (CHPT) reported its Q2 2026 earnings, with revenue of $99 million for fiscal Q2 2020, sequentially higher but down 9% year-over-year. The company's CEO, CEO Wilmer, highlighted potential demand risk in North America due to delays in major projects and potential increases in the Consumer 30D EV tax and 30C alternative fuel vehicle refueling credit. The firm's non-GAAP gross margin was 33%, the highest since going public, and its subscription revenue was $40 million, up 5% sequentially and 10% year over-year, reflecting an expanding installed base in fiscal Q 2 2026. The total value of the company's operating expenses was $59 million in fiscal 2026, up 3% sequential due to increased R&D, but down 12% annually. Non-GAPA adjusted EBITDA loss was $22 million in the second quarter, improving from a $23 million loss in the prior quarter and a $34 million loss the same quarter last year. Subscription gross margin reached a GAAP record high of 61%. The company also reported significant growth in Europe, with North America accounting for 84% and Europe accounting for 16% of revenue in fiscal 2022. The launch of co-branded and new DC express line products from Eaton partnership expanding channel reach and revenue opportunities.",
  "shortSummary": "ChargePoint's Q2 2026 results report highlights key points:",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ff4a7bcfe7da43299bac8e6be92cfc28",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/quote/nyse/chpt/",
      "text": "ChargePoint (NYSE: CHPT)\nChargePoint Return vs. S&P\n| 1 Year | 5 Year | 5 Year Annualized | Since IPO |\n|---|\nChargePoint Company Info\nChargePoint Holdings, Inc. operates as an electric vehicle charging network provider. It designs, develops and markets networked electric vehicle charging system infrastructure and its Cloud Services enable consumers the ability to locate, reserve, authenticate and transact electric vehicle charging sessions. The firm provides an open platform providing real-time information about charging sessions and control, support and management of the networked charging systems. This network provides multiple web-based portals for charging system owners, fleet managers, drivers and utilities. The company was founded in 2007 and is headquartered in Campbell, CA.\nNews & Analysis\nThe Number of EV Chargers in Each State\nThere are 75,751 EV charging stations with 224,716 chargers across the United States.\n3 Top Bargain Stocks Ready for a Bull Run\nChargePoint, Intuitive Machines, and BYD still look like bargains in this frothy market.\nShould You Buy ChargePoint Stock, Down 94%?\nI warned investors to avoid ChargePoint stock for several years, but my tune has changed on the electric vehicle charging company.\nWhy ChargePoint Stock Slumped This Week\nA reverse stock split obscured news that was otherwise good for the company.\nWhy ChargePoint Stock Crashed Today\nChargePoint just gave investors a huge clue as to how things are going with it.\nChargePoint Stock Analysis: Buy or Sell?\nShould You Buy ChargePoint While It's Below $2?\nIs ChargePoint Stock a Buy Now?\nValuation\nPremium Investing Services\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    }
  ],
  "argos_summary": "ChargePoint reported Q2 2026 revenue of $99 million, top of guidance but 9 % lower YoY, with non‑GAAP gross margin at 33 % (up 3 pp sequentially). EBITDA loss narrowed to $22 million and cash held at $195 million, while the company postponed its adjusted‑EBITDA breakeven beyond the current year due to project build‑out delays and the impending expiration of U.S. EV tax credits. The firm highlighted a new Eaton‑partnered DC express line and a bidirectional home‑charging product that should lift hardware margins, and it is expanding its European footprint as macro conditions improve there. Guidance for 2026 revenue remains $90‑100 million, with continued focus on margin expansion and inventory reduction.",
  "argos_id": "8AL2MYAN4"
}