{
  "url": "https://www.digitaltrends.com/phones/samsung-galaxy-s25-fe-hands-on/",
  "authorsByline": "John McCann",
  "articleId": "dc2ed74140084081af46e6a844bba8a4",
  "source": {
    "domain": "digitaltrends.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OR",
      "county": "Multnomah County",
      "city": "Portland",
      "coordinates": {
        "lat": 45.5202471,
        "lon": -122.6741949
      }
    }
  },
  "imageUrl": "https://www.digitaltrends.com/wp-content/uploads/2025/09/GalaxyS25FE-HandsOn-01.jpg?resize=1200%2C630&p=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T02:31:00-07:00",
  "addDate": "2025-09-04T09:38:51.331167+00:00",
  "refreshDate": "2025-09-04T09:38:51.331168+00:00",
  "score": 1.0,
  "title": "Samsung Galaxy S25 FE hands on: this ‘affordable’ flagship has a lot to offer",
  "description": "Upgrades include a slimmer, lighter design, larger screen-to-body ratio, and the biggest FE battery ever.",
  "content": "I’m told the Samsung Galaxy S25 FE is “the gateway to the latest and most powerful Galaxy AI experiences” during my briefing for the firm’s latest ‘affordable’ flagship phone.\n\nSamsung’s FE series has been running for over five years now, providing a more attainable entry point to the firm’s latest technology.\n\nAnd with the Galaxy S25 FE, Samsung’s made some eye-catching upgrades from last year’s variant, with a slimmer, lighter phone which boasts a larger screen-to-body ratio and the biggest battery ever for a FE device.\n\nThe Galaxy S25 FE price starts at £649 for 128GB, rising to £699 (256GB) and £799 (512GB) in the UK (US $ pricing TBC), and it’s available to order from launch, September 4 2025.\n\nThat’s comparable with to another paired-down flagship, the iPhone 16e.\n\nThe Galaxy S25 FE succeeds 2024’s Galaxy S24 FE, and Samsung has made a couple of noticeable design improvements with it’s latest handset.\n\nIt’s managed to slim down the thickness and reduced it’s weight, while somehow also increasing battery capacity.\n\nI’m not sure what voodoo has been untaken to achieve this, but it’s impressive.\n\nThe result is the Galaxy S25 FE is just 7.4mm thick (8% thinner vs S24 FE, 8mm), while it tops the scales at 190g (11% lighter vs S24 FE, 213g).\n\nPicking up the phone it does feel light in the hand, but it avoids feeling ‘cheap’.\n\nPlus, the FE gets the same Enhanced Armor Aluminum frame as Galaxy S25 and S25+, and there’s Corning Gorilla Glass Victus+ on the front and back.\n\nThe aesthetic improvements continue when you turn attention to the 6.7-inch AMOLED display.\n\nSamsung has slimmed down the bezels, while making them more uniform, providing you with an improved screen-to-body ratio.\n\nThis gives the phone a more premium appearance, keeping it closer to it’s pricier S25 sibling.\n\nWhile resolution (FHD+) and peak brightness (1900 nits) aren’t as high as the rest of the S25 series, you do still get a 120 refresh rate.\n\nYet for scrolling social, snapping pics and watching the odd video, the screen is colorful and smooth in operation.\n\nThe only letdown I noticed during my hands-on time with the phone were the color options: Navy, Icy blue, Jet black, White.\n\nSamsung has opted for these muted tones to carry over the premium look from the S25 range, but I’d like to see at least one bold, playful color option – like the Mint and Yellow options we got with the S24 FE.\n\nThe Samsung Galaxy FE comes with triple rear camera setup, featuring a 12MP ultra-wide, 50MP wide angle, and 8MP telephoto camera with 3x optical zoom.\n\nThe 12MP front snapper has been upgraded, getting a 20% boost in resolution over the S24 FE, for what Samsung claims will result in clearer, richer selfies.\n\nThe busy hands-on space I had to experience the phone wasn’t particularly photogenic, nor was it lit in an overly useful way – making it difficult to judge the camera quality.\n\nLook out for our full Galaxy S25 FE review in the coming weeks where we’ll put all four cameras to the test.\n\nThis phone benefits from photography AI features taken from the S25 series, including Instant Slow-Mo (one-touch, super-smooth slow motion – no need to enable a mode), Generative Edit (for effortless photo editing), and Audio Eraser (to remove distracting sounds from video for clear audio).\n\nCompromises are always going to be made with these ‘affordable’ flagship variants, so it’s no surprise the Galaxy S25 FE doesn’t pack top-tier power.\n\nThe Samsung-made Exynos 2800 chipset is paired with 8GB of RAM, which should be serviceable enough to run OneUI 8 – but it won’t be setting any speed records.\n\nPlus, if you shop around you can pick up more powerful Android handsets for similar money – the OnePlus 13R is one example.\n\nOn the plus side, Samsung offers a trio of storage options with 128GB, 256GB and 512GB.\n\nOne of the major new features for the S25 series was the introduction of the Now Bar & Now Brief.\n\nThe personalized and context aware AI looks to deliver you helpful, relevant information when you need it – such as what time to leave to make an appointment, taking into account current traffic conditions and travel restrictions.\n\nThe S25 FE has a personal data core, which learns your usage patterns and what you access, and when. The more you use the phone, the better Now Bar notifications and the Now Brief will become.\n\nThe Galaxy S25 FE is also the first Samsung phone to ship with OneUI 8 – the latest interface overlaid on Android 16. It’s coming to the rest of the Galaxy S25 family this month.\n\nSamsung’s pushing software longevity too, with seven years of OS upgrades and security updates guaranteed for the phone.\n\nAnd things get even better when we look at the battery, with the Galaxy S25 FE boasting the largest battery Samsung has put in a FE handset.\n\nYou get a 4,900mAh power pack, up from 4,700mAh in the S24 FE, and with 45W charging Samsung says you can replenish up to 50% in 30 minutes.\n\nThere’s also 15W Qi2 wireless charging, but there’s no MagSafe compatibility like we’ve seen with PixelSnap on the new Pixel 10 series.\n\nInstead, the S25 FE retains its power share feature, allowing you to use the phone to wireless charge other devices – such as phones and earbuds.\n\nYou’ll have to wait for our full Galaxy S25 FE review to find out how well the battery performs, and whether the chipset and RAM combo have enough grunt to deliver the AI experiences with reasonable speed.\n\nSamsung has made a number of notable upgrades over the previous generation to make the Galaxy S25 FE feel like a worthy addition to the S25 family.\n\nWhile it might not quite be the “no compromise” phone Samsung is billing it as, there’s plenty to like and there’s enough features to keep it competitive against it’s Apple and Google rivals.\n\nJust how well it can perform remains to be seen – keep an eye out for our full review – but the early signs for the Samsung Galaxy S25 FE are positive.\n\nAnd with months before it’ll be troubled by an iPhone 17e or Pixel 10a, the S25 FE has plenty of time to enjoy the spotlight.",
  "medium": "Article",
  "links": [
    "https://www.digitaltrends.com/phones/oneplus-13r-review/",
    "https://www.digitaltrends.com/phones/apple-iphone-17e/",
    "https://www.digitaltrends.com/phones/samsung-galaxy-s25-review/",
    "https://www.digitaltrends.com/phones/apple-iphone-16e-review/",
    "https://www.digitaltrends.com/phones/google-pixel-10-review/",
    "https://www.digitaltrends.com/mobile/one-ui-8-everything-you-need-to-know-about-the-latest-samsung-galaxy-update/",
    "https://www.digitaltrends.com/phones/samsung-galaxy-s26-ultra-tipped-to-be-a-performance-beast/",
    "https://www.digitaltrends.com/phones/samsung-galaxy-s24-fe-review/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Galaxy S25 FE",
      "weight": 0.113816634
    },
    {
      "name": "Galaxy S25",
      "weight": 0.096507385
    },
    {
      "name": "Galaxy FE",
      "weight": 0.095505975
    },
    {
      "name": "Galaxy S24 FE",
      "weight": 0.09520006
    },
    {
      "name": "Galaxy S25 family",
      "weight": 0.0910181
    },
    {
      "name": "FE series",
      "weight": 0.08787271
    },
    {
      "name": "S24 FE",
      "weight": 0.08751849
    },
    {
      "name": "S25",
      "weight": 0.08373015
    },
    {
      "name": "FE",
      "weight": 0.08242826
    },
    {
      "name": "S25+",
      "weight": 0.0818712
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.86474609375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8310546875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7578125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.71240234375
    }
  ],
  "sentiment": {
    "positive": 0.65474004,
    "negative": 0.045790743,
    "neutral": 0.29946926
  },
  "summary": "The Samsung Galaxy S25 FE, a 'affordable' flagship phone, has been introduced as a more attainable entry point to the firm's latest technology. The Galaxy S 25 FE, succeeding 2024's Galaxy S24 FE, offers a slimmer, lighter phone with a larger screen-to-body ratio and the largest battery ever for a FE device. The phone's price starts at £649 for 128GB, rising to £699 (256GB) and £799 (512GB) in the UK from September 4 2025. It also features a triple rear camera setup, featuring a 12MP ultra-wide, 50MP wide angle, and 8MP telephoto camera with 3x optical zoom. The 12MP front snapper has been upgraded with a 20% increase in resolution over the S24FE, which Samsung claims will result in clearer, richer selfies. The Samsung Exynos00 is paired with 8 RAM, which should be enough to run OneUI 8.",
  "shortSummary": "The Samsung Galaxy S25 FE, featuring slimmer, lighter, more advanced design and enhanced camera features, offers excellent graphics, enhanced audio, and a larger screen-to-body ratio with enhanced multimedia features.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2d89d6934c6043688351afed7b6ebb2e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.digitaltrends.com/phones/oneplus-13r-review/",
      "text": "“Need a new smartphone? Don't want to spend more than $600? The OnePlus 13R needs to be at the top of your shopping list.”\n- Polished and practical hardware\n- Fantastic, non-curved display quality\n- Two (or more) days of battery life\n- Surprisingly good cameras\n- OxygenOS 15 is excellent\n- Seriously incredible value\n- Slower charge speeds compared to 12R\n- $100 price increase\n“Why you can trust Digital Trends – We have a 20-year history of testing, reviewing, and rating products, services and apps to help you make a sound buying decision. Find out more about how we test and score products.“\nHow do you create a successor to one of the best smartphone values in years? That’s the task OnePlus faced when creating the OnePlus 13R. The OnePlus 12R was one of 2024’s best smartphones by a long shot — delivering powerful specs, a premium design, and capable software at an unbelievable $500 price. It was one of my favorite phones of last year, and I’ve been eager to see how the OnePlus 13R would succeed it.\nI’m happy to report that the OnePlus 13R is every bit as good as the 12R — and notably better in some key ways. The higher price means it’s not quite as immediately jaw-dropping, but after spending a couple of weeks with the OnePlus 13R, I’m struggling to think of another $600 phone that’s more worthy of your money.\nOnePlus 13R specs\n| Dimensions | 161.72 x 75.77 x 8.02mm |\n| Weight | 206g |\n| Screen | 6.78-inch AMOLED 2780 x 1264 resolution 1-120Hz refresh rate 1,600 nits High Brightness Mode 4,500 nits peak brightness |\n| Durability | IP65, Gorilla Glass 7i |\n| Cameras | Primary camera: 50MP, f/1.8 Telephoto camera: 50MP, f/2.0, 2x optical zoom Ultrawide camera: 8MP, f/2.2, 112° field of view Front camera: 16MP, f/2.4, fixed focus |\n| Processor | Qualcomm Snapdragon 8 Gen 3 |\n| RAM | 12GB LPDDR5X |\n| Storage | 256GB UFS 4.0 |\n| Battery | 6000mAh |\n| Charging | 55W wired charging |\n| Software | OxygenOS 15 (Android 15) 4 years of Android OS updates 6 years of security updates |\n| Connectivity | Wi-Fi 7, Bluetooth 5.4, NFC |\nAbout our OnePlus 13R review\nOur original OnePlus 13R review was published in January 2025, and written by Joe Maring. We revisited the OnePlus 13R after using the phone again in April 2025, and you can read Andy Boxall’s opinion of the phone in the section below.\nIs the OnePlus 13R still the big value phone to buy?\nI’ve used the OnePlus 13R for a week and consider the phone a superb buy. It’s a no-nonsense smartphone that follows the OnePlus-of-old playbook by delivering everything you need and little else, and not charging a fortune for it. OxygenOS 15 is the best version of OnePlus’s software in a while and its smooth, uncomplicated, and mostly free from the things that make me dislike the closely related ColorOS from Oppo.\nI came to the OnePlus 13R after the Tecno Camon 40 Premier and the Samsung Galaxy A56, and I really welcomed its uncomplicated nature. It quickly fitted into my life, and it has been totally reliable, with the big battery lasting two days with my modest use. During my time with it, I compared it to the Nothing Phone 3a Pro, another great value smartphone I’ve enjoyed using in 2025. The Nothing Phone 3a Pro kept up well, but lost out on overall performance, highlighting the OnePlus 13R’s brilliance as an all-rounder.\nIt’ll come time for me to swap to another Android phone soon, but I know that if my job didn’t require that to happen, I’d be perfectly satisfied with the OnePlus 13R. It’s not a complex phone (in a good way), there’s not much AI pushed upon you, the camera’s versatile and takes good photos, and it’s really comfortable to hold and use. I don’t even mind the flat screen, even if it does emphasize the phone’s plain design. Several months into its release, the OnePlus 13R continues to be one of 2025’s best value smartphones.\nThe OnePlus 13R has a simple but effective design\nThe OnePlus 13R is very much a function over form smartphone. It’s not the most visually striking handset out there, but it’s simple, practical, and leaves you with very little to complain about.\nA matte aluminum frame is joined by a matte glass backside, no matter which color you choose. I have Nebula Noir (aka black), though I’d recommend getting the Astral Trail color if you can; it has a lovely spiral pattern emitting from the camera that looks quite striking.\nEven in the much less boring Astral Trail color, the OnePlus 13R’s hardware is undeniably strong. The matte finish is classy and doesn’t pick up fingerprints, all of the buttons feel good to press, the alert slider is as satisfying as ever, and the ultrasonic fingerprint sensor is fast and reliable. Once again, there’s an IR blaster if you want to control your TV, air conditioner, etc., with your phone.\nOnePlus also upped its durability this year, increasing the IP64 rating from the 12R to IP65 for the OnePlus 13R. The main benefit here is that the 13R is now protected against water jets, and while not as robust as the IP68 ratings we see on more expensive flagship phones, it’s still a welcome improvement.\nThe OnePlus 13R’s hardware is undeniably impressive.\nThere’s not much more to say about the OnePlus 13R’s hardware. Sure, it’s a bit boring visually, but functionally, OnePlus nailed everything. The OnePlus 13R is comfortable to hold, well-made, and feels every bit as premium as a $1,000 smartphone. This was a strong suit of the OnePlus 12R, and the OnePlus 13R continues its legacy without a problem.\nA high-quality screen with one big change\nThe OnePlus 13R has an incredible display. It’s high-quality in every sense of the word and far nicer than you’d expect for a “value flagship” phone.\nSpecs-wise, it’s pretty much identical to that of the OnePlus 12R. You have a 6.78-inch AMOLED panel, a 2780 x 1264 resolution, a variable 1-120Hz refresh rate, and incredible brightness levels — up to 1,600 nits in High Brightness Mode and up to an eye-searing 4,500 nits for its highest peak brightness. It’s a bright, colorful, sharp, and responsive display with which I’ve had zero complaints.\nThe biggest change for the OnePlus 13R is that it has a flat screen compared to the curved edges of the OnePlus 12R display. I didn’t think the curved display was a deal-breaker on the 12R, but I vastly prefer the flat design on the 13R this year. I find it more comfortable to use, and it eliminates the possibility of accidental screen touches (a minor issue on the 12R).\nAre the OnePlus 13R cameras any good?\nYou’ll find three cameras on the back of the OnePlus 13R: a 50-megapixel primary camera, a 50MP telephoto camera with 2x optical zoom, and an 8MP ultrawide camera rounding things out. The OnePlus 12R had a 50MP primary camera, too, though the one on the 13R is a newer sensor. The 50MP telephoto camera is also a nice change, as it replaces the useless 2MP macro camera that was on the 12R.\nOverall, photos from the OnePlus 13R look good. Even without the same Hasselblad integration on the regular OnePlus 13, the 13R still churns out pleasing images with nice colors. I’ve been quite impressed with some of the pictures I’ve gotten. The crashing waves against the rocks of CocoCay in the first photo above were captured perfectly. The black fur on my cat Minnie looks great, too, as does the photo of the wine glass in a dimly lit bar aboard the Allure of the Seas.\nThe 50MP telephoto camera is solid, too. The 2x optical zoom range won’t give you similar zoom capabilities as you’d find on the Galaxy S24 Ultra or Oppo Find X8 Pro, but it is enough to get a bit closer to your subject and still get a good-looking shot. There’s a noticeable step down in resolution with the 8MP ultrawide camera, but it does a good job of capturing similar colors to the primary camera (something the OnePlus 12R struggled with).\nWhere the OnePlus 12R’s cameras felt passable, the camera system on the OnePlus 13R is genuinely solid. It’s far from the most exciting camera package available in 2025, but there’s also nothing outright bad about it. So long as you don’t need extreme zoom capabilities on your next smartphone, I think you’ll be pretty happy with what the OnePlus 13R delivers.\nThe OnePlus 13R’s performance is exceptional\nPowering the OnePlus 13R is Qualcomm’s Snapdragon 8 Gen 3 chip. It’s not the latest Snapdragon 8 Elite, but it is the same chip used in many of last year’s flagships — such as the Samsung Galaxy S24 Ultra, Asus ROG Phone 8 Pro, and OnePlus 12. The Snapdragon 8 Gen 3 is paired with 12GB of LPDDR5X RAM plus 256GB of UFS 4.0 storage.\nLooking at Geekbench 6 results compared to the OnePlus 12R, the OnePlus 13R sees a substantial 38% increase in single-core CPU performance, a 23% increase in multi-core CPU performance, and a massive 73% boost in GPU performance. It trails slightly behind the Galaxy S24 Ultra, and the OnePlus 13 with its newer Snapdragon 8 Elite chip is faster yet, but the OnePlus 13R remains an incredibly fast smartphone.\n| Geekbench 6 CPU (single) | Geekbench 6 CPU (multi) | Geekbench 6 GPU | |\n| OnePlus 13R (Snapdragon 8 Gen 3) | 2,187 | 6,333 | 14,586 |\n| OnePlus 12R (Snapdragon 8 Gen 2) | 1,585 | 5,157 | 8,424 |\n| Samsung Galaxy S24 Ultra (Snapdragon 8 Gen 3) | 2,314 | 7,104 | 15,898 |\n| OnePlus 13 (Snapdragon 8 Elite) | 3,016 | 9,218 | 17,607 |\nThe GPU enhancements are even more apparent when running 3DMark’s Wild Life Stress Test, which runs each phone through 20 minutes of heavy-load performance benchmarking. In this test, the OnePlus 13R sees about 36% better performance with improved stability, too.\n| Best loop score | Lowest loop score | Stability | |\n| OnePlus 13R | 17,799 | 11,985 | 67.3% |\n| OnePlus 12R | 13,310 | 8,636 | 64.9% |\nAlthough benchmarks only tell part of the story, real-world use affirms the 13R’s upgraded performance. The phone is blazing-fast, handling apps like Threads, YouTube, Duolingo, and Microsoft Teams with no issue. It’s also done a fantastic job of powering through my Pokémon TCGP addiction, taking on 30- and 45-minute gaming sessions with no frame drops and without any noticeable heat buildup.\nPerhaps the best compliment I can give the OnePlus 13R is that using it has felt like using a flagship. It’s handled everything I’ve thrown at it, hasn’t overheated at any point, and has just been a joy to use.\nExcellent battery life, slightly disappointing charging\nThe OnePlus 12R set records with a 5,500mAh battery, the largest battery at the time for a OnePlus phone. The OnePlus 13R breaks that record just a year later, stepping things up to a gargantuan 6,000mAh battery. As you can probably guess, the OnePlus 13R has incredible battery life.\nJust how incredible? The OnePlus 13R is very firmly a two-day smartphone. And, with lighter use, it could probably even creep into three days of usage before you need to put it on the charger.\nAs an example, I started one day at 8 a.m. with a full charge. After nearly four hours of screen-on time — including 1 hour and 40 minutes of playing Pokémon TCGP and frequent use of Telegram, TikTok, YouTube, and X — I had 61% battery remaining at 11:25 p.m. that night. The next day, I woke up to 58% remaining at 7:45 a.m. and racked up over three more hours of additional screen time. At the end of day two, totaling 7 hours and 13 minutes across both days, I still had 18% battery left at 11:20 p.m.\nI was only able to kill the 13R’s battery in a single day once, and that was during a very busy travel day with lots of Uber, Google Maps, Telegram, X, the Fly Delta app, and taking dozens of pictures. Even then, the OnePlus 13R still performed very well, starting the day at 6:05 a.m. and ending it at 9:45 p.m. with 7% battery after 6 hours and 12 minutes of screen time. This is exceptional endurance and even better than the already excellent battery performance of the OnePlus 12R.\nThe OnePlus 13R has incredible battery life.\nUnfortunately, compared to the 12R, the OnePlus 13R takes an awkward step backward with its charging. Where the OnePlus 12R supported 80W charge speeds, taking the phone from 0-100% in about half an hour, the OnePlus 13R has been downgraded to 55W.\nOn its own, 55W is a very good number — outperforming the charge speeds of the latest flagships from Samsung, Apple, and Google. A full recharge from 0-100% takes just under an hour, and you can go from 14% to 54% in 15 minutes. That’s great! But I can’t help but still have a sour taste in my mouth knowing that OnePlus can (and has) done better. There’s also no wireless charging, which, while not a deal-breaker, is less easy to overlook when the wired charging speeds have decreased and the price has increased compared to the OnePlus 12R.\nOxygenOS 15, AI, and software updates\nThe OnePlus 13R ships with OxygenOS 15, OnePlus’ custom interface for Android 15. And you know what? It’s kind of great.\nOxygenOS went through a metamorphosis in 2022, switching from the “stock” Android UI it had used for years and taking on a more stylized UI similar to what was found on phones from its sister brand, Oppo. And I hated it. OnePlus made some progress with OxygenOS 14, and OxygenOS 15 is even better.\nA core focus of OxygenOS 15 is being as fast and responsive as possible. OnePlus spent an excruciating amount of time explaining this in my briefings, but I can’t deny how big of a difference it makes. There’s a level of fluidity and snappiness to the OnePlus 13R’s software that’s really, really nice.\nOxygenOS 15 also adds the Open Canvas multitasking system introduced on the OnePlus Open. It’s a unique take on split-screen multitasking where you can easily bounce back and forth between two apps in mostly full-screen windows. It’s much more useful than Android’s default multitasking system, and I really love it. I’m also a fan of OnePlus’ customization tools, which give you ample control over your always-on display, app icons, accent colors, etc.\nThere’s also a smattering of AI features included, and it’s about what you’d expect — including unblur and resolution boost photo editing tools, notes summarization, and Google’s Circle to Search. It’s nothing you haven’t seen before, and I’ve largely ignored most of it, but it’s there if you want it.\nFinally, software updates. OnePlus promises four years of Android OS upgrades and six years of security updates. That’s trailing the seven years of OS/security updates promised by Samsung and Google, but for most people, it should be perfectly fine. I’d love to see OnePlus eventually match the seven-year promise of its competitors, but this is a perfectly acceptable level of support.\nOnePlus 13R price and availability\nThe OnePlus 13R is available in one configuration (12GB of RAM and 256GB of storage) and costs $600 — a $100 price increase compared to the OnePlus 12R. Rising prices are never fun, but in this case, I think it’s fairly well justified.\nFor context, the $500 OnePlus 12R came with 8GB of RAM and 128GB of storage, while the $600 model included 16GB of RAM and 256GB of storage. Compared to the base 12R, the OnePlus 13R has more RAM and double the storage, not to mention a faster processor, flat display, improved cameras, longer battery life, and more years of software updates.\nThe OnePlus 13R is also very well-priced when put against the competition. Its closest competitor in the U.S. is the Samsung Galaxy S24 FE. It costs $650 and has a worse design, flimsy-feeling hardware, a less impressive display, and slower charging. There isn’t any real benefit to it over the OnePlus 13R (unless you really care about Galaxy AI), and it costs $50 more.\nThe Google Pixel 8a is a better alternative. It costs $100 less than the OnePlus 13R but also brings a longer list of compromises — including flimsy-feeling hardware, one-day battery life, slow charging speeds, a less capable processor, and less RAM and storage. It’s a good $500 phone, but there’s a very easy argument to make for spending $100 extra for the OnePlus 13R. You may also want to look at the Samsung Galaxy A56 and the Nothing Phone 3a Pro as alternatives. The OnePlus 13R has been available since January 14. It’s available at OnePlus.com and Best Buy.\nShould you buy the OnePlus 13R?\nThe OnePlus 12R revitalized the value flagship scene last year, and the OnePlus 13R does an incredible job of carrying its torch forward for another year. Yes, it’s more expensive, but the new $600 price is easily justified by the (very meaningful) upgrades.\nThe flat display is excellent, the Snapdragon 8 Gen 3 is a serious performance boost, the cameras are considerably better, and the battery lasts even longer. Pair that with a good software update policy and well-made hardware, and the OnePlus 13R leaves you with very little to complain about. The slower charge speeds are annoying, as is the continued lack of wireless charging, but they’re minor inconveniences rather than serious drawbacks.\nThe OnePlus 13R leaves you with very little to complain about.\nMy conclusion for the OnePlus 13R is similar to mine for the OnePlus 12R. You can absolutely spend more money on smartphones with more bells and whistles — the $1,100 Google Pixel 9 Pro XL and $1,300 Galaxy S25 Ultra are sitting there waiting for you. But when the OnePlus 13R is this good and so much less expensive, why would you?"
    },
    {
      "url": "https://www.digitaltrends.com/phones/apple-iphone-16e-review/",
      "text": "“The iPhone 16e is built for someone who has never had an iPhone before. It offers a no-frills essentials-only iPhone experience that is ideal if you’re joining Apple’s ecosystem, but will leave you wanting if you’ve had a more capable iPhone in the past.”\n- Excellent size for one hand use\n- Single camera is surprisingly good\n- 2x telephoto is detailed and sharp\n- Vivid Super Retina display\n- Phenomenal battery life\n- Camera lacks details when zooming\n- Inconsistency in camera at different focal lengths\n- Display is only 60Hz\n- Apple Intelligence is not essential\n- Lacks MagSafe\n“Why you can trust Digital Trends – We have a 20-year history of testing, reviewing, and rating products, services and apps to help you make a sound buying decision. Find out more about how we test and score products.“\nIf you’re Apple, how do you make a more affordable iPhone to attract new users, without devaluing or cannibalizing sales of your existing lineup? For many years, this was the iPhone SE lineup — which offered a pared-back experience for half the price of the Pro — but this year sees the launch of the iPhone 16e and a change of strategy.\nIt’s easy to think of the iPhone 16e as a replacement for the iPhone SE, but to do so would be to miss the reason for its existence. It’s not the iPhone SE 2025; rather, it’s designed to offer the latest iPhone and just the essentials at a lower, more accessible price.\nIt achieves this in a surprisingly good way, although it has a lot of nuances and caveats that you should be aware of. In a few key ways, it’s also better than other iPhones, and also has an exclusive feature for good measure. Here’s why the iPhone 16e is great, but only if you’re a first-time Apple smartphone user.\nApple iPhone 16e: Specs\n| iPhone 16e | |\n| Dimensions | 146.7 x 71.5 x 7.8 mm |\n| Weight | 167 grams |\n| Display | 6.1-inch Super Retina XDR display |\n| Screen resolution | 2532-by-1170-pixel resolution at 460 ppi\n800 nits max brightness (typical) 1200 nits peak brightness (HDR) |\n| Operating system | iOS 18 |\n| Storage | 128GB, 256GB, 512GB |\n| Processor | Apple A18\n6-core CPU |\n| RAM | 8GB |\n| Camera | 2-in-1 camera system 48MP FusionTrueDepth front camera |\n| Apple Intelligence | Yes |\n| Action Button | Yes |\n| Camera Control | No |\n| Dynamic Island | No |\n| Ports | USB-C |\n| Authentication | Face ID |\n| Water resistance | IP68 |\n| Battery | Up to 26 hours between charges\nUp to 50% charge in 30 minutes with 20W adapter or higher paired with USB-C charging cable Qi wireless charging |\n| Colors | White, Black |\n| Price | From $600 |\nApple iPhone 16e: Design\nIf you’ve used any of Apple’s latest smartphones, the iPhone 16e will be instantly familiar. It follows the same design language as other iPhones, but while it features the same notch as others, it doesn’t have the Dynamic Island feature that its siblings do.\nAt 167 grams, it’s refreshingly light, even compared to the iPhone 16 which weighs 170 grams. I’m a daily user of the iPhone 16 Pro and the iPhone 16e is 0.5mm thinner and 32 grams lighter, and this makes a big difference. We’ve all experienced an iPhone dropping on our faces while lying in bed, and the iPhone 16e hurts considerably less than other iPhones.\nFlip the iPhone 16e over and you get a glass back in two color choices, both of which are fairly uninspired, as my colleague Andy Boxall wrote. At the top of the back, you’ll find the single camera; several weeks in, it still looks strange to me having been used to two or three camera iPhones for the past decade.\nTo the left is the pair of volume keys as well as the Action Button. Yes, I think it’s safe to say that the volume switch is dead, and the Action Button is here to stay. Unsurprisingly, the iPhone 16e doesn’t have the camera control slider/button found on the iPhone 16 Pro series, so mine is set to quickly launch the camera. A point of note is that using the iPhone 16e made me appreciate the camera control on my iPhone 16 Pro more than I had previously, at least as a way to quickly launch the camera.\nTo the bottom of the iPhone 16e is the USB-C port, the microphones and the loudspeaker. There’s also antenna bands at several points along the aluminum frame, and the camera bump is one of the slimmest in recent memories.\nThe iPhone 16e is a great blend of new and old. Features like the Action Button keep its design in step with Apple’s current generation of iPhones, but it lacks the flourishes like multiple cameras, the Dynamic Island or the camera control feature found on its siblings. If you’ve used any recent iPhone, the iPhone 16e will feel instantly familiar.\nApple iPhone 16e: That 60Hz Display\nThe iPhone 16e features a 6.1-inch OLED display that’s essentially the same size one as found on the regular iPhone 16.\nThe display is mostly a joy to use, and offers vibrant colors, rich contrast and deep blacks even in direct sunlight. It features 1,200 nits peak brightness, which is significantly lower than the 2000 nits featured on the rest of the iPhone 16 series.\nThe display itself is only 60Hz, and while the animations in iOS do smooth over some of the jarring, it’s noticeably less smooth than the iPhone 16 Pro. It’s not something that bothers you all the time, but it’s something that does bother you when you notice it. This is less likely to be a problem if you’re upgrading to the iPhone 16e from a smaller iPhone, but it may feel jarring at first.\nRefresh rate aside, the iPhone 16e feels like a solid iPhone display. Yes, it’s not as bright as others, but it’s still high-quality with great color reproduction like any other iPhone. It’s a joy to use, iOS makes colors pop and Ceramic Shield glass should provide a fair degree of protection.\nApple iPhone 16e: Hardware and Performance\nOne of the benefits of picking the iPhone 16e is the focus on current-generation performance. It is powered by the same Apple A18 SoC used in the iPhone 16 and 16 Plus — which is built using TSMC’s 3nm process — and delivers excellent performance even under heavy loads.\nThere’s also 8GB of RAM — the minimum needed for Apple Intelligence — and between 128GB and 512GB of storage. It’s unsurprising that the storage starts at 128GB, but I’ve already used more than half and that’s just with apps and syncing my Photos Library.\nFor the most part, the iPhone 16 is snappy and performant, although there are small glitches and bugs throughout the experience. There also seems to be some aggressive background task management, with features like FaceID noticeably slower to respond than on the iPhone 16 Pro. It’s noticeably slower if you’re coming from another iPhone, but it’s fast enough nonetheless.\nTo properly test the iPhone 16e, we put it through two benchmarks to test the CPU and GPU performance. They revealed that while it’s still an A18 processor inside the iPhone 16e, it is noticeably less performant than the “same” processor inside the regular iPhone 16.\n| GeekBench 6 Test | iPhone 16e | iPhone 16 | iPhone 16 Pro Max |\n| Configuration | A18, 8GB RAM | A18, 8GB RAM | A18 Pro, 8GB RAM |\n| CPU single-core | 2929 | 3371 | 3549 |\n| CPU multi-core | 4265 | 8073 | 8810 |\n| GPU | 22113 | 27785 | 33174 |\nThe iPhone 16e GeekBench 6 results above were the best across five different tests, and reinforce that this isn’t the fastest iPhone, but it’s designed for longevity and battery life.\n| 3DMark Test | iPhone 16e | iPhone 16 Plus | iPhone 16 Pro Max |\n| Solar Bay | 5852 | 7201 | 7923 |\n| Solar Bay Stress Test | 4456 | 7277 | 8117 |\n| Battery Drain | 9% | 10% | 9% |\nThe other test we run is 3DMark Solar Bay, a cross-platform benchmark for devices that support hardware-based ray tracing, which is one of the perks of the latest A18 chip inside the iPhone 16e. Solar Bay is designed to test the overall graphics performance of a phone, and much like the performance, the iPhone 16e delivers an experience that’s limited compared to the rest of its siblings.\nThe Apple C1 modem\nOne of the downsides to the extra power and features in the rest of the lineup is the effect on battery life, which is where this phone excels. The iPhone 16e offers the best battery life on an iPhone and this is due to a combination of a larger battery capacity, and the new Apple C1 modem.\nThe iPhone 16e is unique as it’s the first iPhone to use Apple’s C1 modem — which it developed in-house — while the rest of the iPhone 16 series uses a Qualcomm modem. The road to this point was full of roadblocks and delays, and Apple Silicon revolutionized processors for computing thanks to vastly superior performance and efficiency, and Apple is hoping the same will apply to the C1 modem in the iPhone.\nI’ve tested it extensively alongside the iPhone 16 Pro on the same network while traveling and there has been no difference in performance between the two. Signal strength does seem to be a little lower on the iPhone 16e than the iPhone 16 Pro, but in terms of actual numbers, there’s little to separate them.\nThe first generation of the iPhone 16e doesn’t support mmWave so there are times when the iPhone 16 Pro series will reach higher peak speeds, but there’s little actual difference in real-world performance. There is one key benefit that makes all the difference.\nApple iPhone 16e: Battery and Charging\nApple’s focus on the essential features — and likely a desire to not make the iPhone 16e drastically lighter or thinner than the rest of the iPhone 16 lineup — meant the iPhone 16e has a bigger battery than even the iPhone 16 Pro. Coupled with the efficiencies from the iPhone 16e modem, this means the iPhone 16e offers incredible multi-day battery life that’s truly all-day and more.\nI’ve long been a fan of Apple’s smaller non-Pro and non-Plus phones, but the smaller batteries mean that you often have to charge during the day. The iPhone 16e and Apple’s C1 modem fixes this, by offering true multi-day battery life. On more than one occasion, it lasted through the night and considerably into the following day.\nThe iPhone 16e offers incredible multi-day battery life\nAt 4,005mAh, the iPhone 16e battery is approximately 12% larger than the iPhone 16 and iPhone 16 Pro, but about 15% smaller than the iPhone 16 Plus and iPhone 16 Pro Max. It fills the gap between the two and offers the efficiency of the larger iPhones, but in a much smaller form factor.\nIn terms of raw numbers, the best battery life I experienced was 39 hours of runtime and 10 hours of screen on time. This is outstanding battery life, and on par with — if not better than — the iPhone 16 Pro Max.\nLike many of its siblings and extended family, the iPhone 16e isn’t the fastest to charge to full. Apple hasn’t confirmed the exact charging speed, but it promises fast charging with a 20W adapter or higher. In my testing, the iPhone 16e takes 30 minutes to charge to 50% but a further hour to charge the remaining 50%. Most iPhones are only designed to be charged to 80% to extend battery life, which takes just under an hour.\nBy far the biggest disappointment is MagSafe, or the lack of it. Initially, I thought it wouldn’t bother me, but I’ve found that I do miss having it, especially when trying to use some of the best iPhone accessories. Yes, the iPhone 16e supports 7.5W wireless charging, but it feels like the one part missing from this experience; MagSafe is a brand in and of itself, and the lack of it does make the iPhone 16e feel less like a current-generation flagship.\nApple iPhone 16e: iOS and Apple Intelligence\nOne of the benefits of using current generation hardware is that you get the maximum longevity and support. Apple doesn’t make claims of how many years support it will offer, but historical data suggests that you can expect the iPhone 16e to last for at least five years.\nOut of the box, the iPhone 16e runs iOS 18 and the latest build available is iOS 18.3.2 which features ChatGPT integration in Apple Intelligence. iOS 18 brings a host of improvements and new features and in many ways, the biggest change to iOS in years.\nThere’s a redesigned control center that adopts a multi-page design giving you quick access to even more shortcuts, a new connectivity panel and more context around what’s playing. There’s a new theming and home screen engine that allows you to change your home screen and app icons colors at will. You can even rearrange your home screen in a more freer way, and Apple has also made it effortless to resize widgets.\nThen there’’s a host of new security and privacy features, which is key to the iOS 18 offering. You can lock and hide apps behind FaceID, TouchID or a passcode so that only you can access them. You can also hide an app from your home screen inside a hidden app folder that’s protected. There’s also major changes to the Photos app, a new Passwords manager, and a host of other changes throughout the experience.\niOS 18 has its fair share of bugs and things that don’t work as well as expected, but it’s a great overall OS and runs fairly well on the iPhone 16e. The latest hardware also means that it’s able to run a host of new AI-powered features, which is one of the reasons you may be considering it.\nApple Intelligence and AI-powered features\nApple’s journey to AI on the iPhone hasn’t been the smoothest, and the launch of Apple Intelligence at WWDC last year was prefaced with the expectation that many features would roll out over the past year. As it turns out, some of these features have launched, but Apple has also announced that the new context-aware Siri — which can intelligently understand what’s on your screen — could take a further year to launch.\nAside from the delays, Apple Intelligence is available on the iPhone 16e in a few different ways. Visual Intelligence provides a Google-lens experience that allows Apple Intelligence to interact with the world around you through your phone’s camera, while AI features are also built into most of Apple’s apps.\nNotes has had a huge upgrade thanks to Apple Intelligence, including being able to record and transcribe live audio in a note, a host of new formatting options, and help solving complex math equations instantly with Math’s Note. You can also now record calls, get AI-powered summaries of any email in the Mail app and get summaries of articles in Siri.\nMy favorite Apple Intelligence feature is Notification Summaries, which I use daily to help triage my life. Notification Summaries has vastly improved as a feature, and while you’ll still get funny summaries that make little sense, it is far more useful as a feature now than it was six months ago.\nApple iPhone 16e: Just One Camera\nThe biggest surprise in this phone is that the iPhone 16e camera is better than I expected. That said, there are some caveats that are worth keeping in mind, and while Apple has managed to make a single camera good in some situations, it still can’t beat the benefits of multiple cameras.\nThe iPhone 16e features a single 48MP camera with f/1.6 aperture, phase detection autofocus and OIS. There’s only one camera but it captures high quality images, and combines pixels into a larger one to help capture better photos in low light conditions. It takes all the learnings from the iPhone 16 Pro’s main camera and brings it to the most affordable current-gen iPhone.\nFor some people, one camera won’t be enough, but for others, it may be worth the compromise, especially if you don’t take many photos or you’d rather have the lighter weight and better battery life.\nThere’s no ultrawide or telephoto camera, but the iPhone 16e does offer 2x telephoto zoom using in-sensor cropping. The in-sensor crop works fairly well, although there is a slight reduction in resolution and quality. Beyond 2x, there’s a noticeable reduction in quality.\n- 1. 1x\n- 2. 1x\n- 3. 1x\n- 4. 1x\n- 5. 2x\n- 6. 2x\n- 7. 2x\n- 8. 2x\nThere’s also the entire range of studio effects in portrait mode, and the ability to use both 1x and 2x focal lengths. The effect of the latter is particularly jarring as the cropping leads to a much tighter image than you might expect.\n- 1. Normal Selfie\n- 2. 1x normal photo\n- 3. 2x normal photo\n- 4. Portrait Selfie\n- 5. 1x portrait photo\n- 6. 2x portrait\nIf you’re considering the iPhone 16e from another phone — especially one that has multiple cameras that you use — then you will probably end up disappointed by the iPhone 16e camera. However, if the camera doesn’t matter to you, but you’d like a good one there just in case, the iPhone 16e is a great choice.\nApple iPhone 16e: price and availability\nThe most contentious part of the iPhone 16e is not its single camera, but its price. Starting at $599, it’s only $200 cheaper than the iPhone 16 which has a few key upgrades including a dual-lens camera array.\nFor that, you get 128GB of storage and a choice of either Black or White color ways. If you want more storage, the 256GB and 512GB models cost $100 and $200 more respectively. AppleCare+ costs $10 per month or $100 per year, and there are a host of trade-in deals available to offset the overall cost.\nShould you buy the Apple iPhone 16e?\nIf you’ve never experienced an iPhone before and are upgrading to the iPhone 16e from a simpler phone (smartphone or otherwise), you will enjoy the iPhone 16e. It’s the quintessential Apple smartphone experience at a cheaper price, and it offers everything you probably want.\nThe iPhone 16e is a true battery life champion, and if you value longevity over all else, it’s the iPhone to pick. However, there are better iPhones on the market if you take a lot of photos or need snappier performance. You could buy the iPhone 16 or last year’s iPhone 15 Pro series. These are all priced similarly, and they both have significant advantages over the iPhone 16e.\nThe iPhone 16e is the iPhone to pick if you just want the essentials like a good display, solid performance and great battery life. The e doesn’t mean it’s for everyone, but it’s definitely the right phone for someone."
    },
    {
      "url": "https://www.digitaltrends.com/mobile/one-ui-8-everything-you-need-to-know-about-the-latest-samsung-galaxy-update/",
      "text": "In 2025, Google shifted the release schedule of its mobile operating system and released Android 16 earlier than expected. Samsung, one of Android’s most prominent champions, also followed suit and kick-started the beta testing of its next-gen software weeks ahead of launching its latest foldable phones.\nWith the Galaxy Z Fold 7 and its clamshell sibling, One UI 8 finally made it to the public realm. Interestingly, where Google leaned heavily on the new Material 3 Expressive design language for Android 16, One UI 8 doesn’t make too many changes to how Samsung’s smartphone software looks.\nThere are, however, a whole bunch of new features that users will appreciate on a day-to-day basis. For now, it is limited to the Galaxy Z Fold 7, the Galaxy Z Flip 7, and the Galaxy Z Flip 7 FE. In the coming weeks, it is expected to begin wider rollout, starting with the Galaxy S25 series. For now, here’s a detailed look at what Android 16-based One UI 8 brings to the table:\nNext-gen split-screen mode\nIn One UI 8, Samsung is reimagining how you interact with multiple apps on the same page. Inspired by the Open Canvas system on OnePlus phones, the updated split-view mode on the Galaxy Z Fold 7 now supports vertical switching between apps.\nEssentially, the foreground app occupies the majority share of the screen, while the background app’s UI is only visible as a bar at the top or bottom edge of the screen. You can tap on this bar to open the app in near full-view on the screen, just like the preceding app.\nThis is done by dragging the split bar to the bottom, until you reach the point right before the window goes full screen. Once there, the two apps are split in such a way that one of them is always partially visible, and with a single tap, you can bring it back to focus.\nEasy access to camera controls\nIn the Samsung camera app, swiping on the preview area has historically switched between the front and rear cameras. This gesture can now be customized to access the camera quick controls for easier access to the composition tools and filters.\nWhen you navigate to the Settings section in the camera app, there’s now a new “Open Quick Controls” option tied to the swipe gesture. You can also choose to keep the gesture locked to the camera switching process, or just disable it entirely.\nWhen you set it to access quick controls, it will open a slide-out tray right above the shutter button, where you can make adjustments for aspect ratio, flash, timer, resolution, exposure, and photographic styles, among others.\nEnhanced Quick Share\nOne UI makes the process of sharing and receiving files much easier, thanks to a revamped quick share system. The UI now has large share and receive buttons at the bottom of the screen, and a separate option for instantly generating a QR code or link for sharing the files.\nThe refreshed Quick Share panel now appears on the first page of the Quick settings panel. You can also choose the private sharing option from the menu bar at the top, and access all the sharing settings from the same place. Everything now looks less cluttered, and you even get a carousel of recommended devices for transferring data.\nA supercharged Reminder app\nThe Reminder app has received a design makeover in One UI 8, and it looks much cleaner this time around. All the events are categorized neatly on the homepage. You will now see separate category pages for same-day events, scheduled entries, important alerts, completed tasks, and active alerts.\nUsers can add custom categories, and even color-code them with appropriate symbols in tow for easy identification. There are a whole bunch of new sample reminder templates in the app, such as pickup, workout, payments, and more.\nThe best part is that creating reminders is no longer a hassle. There’s a dedicated text field at the bottom, where you can directly type the details and then quickly add other details such as time, location, date, and even media files using a slide-based system. It’s easier and more intuitive than ever.\nAuracast support\nWith the release of One UI 8, Samsung is finally bringing Auracast to its Galaxy smartphones. Aurcast is Bluetooth-based technology that allows users to share the audio stream from their phone with other audio devices in the vicinity.\nAside from Samsung’s wearables, such as the Galaxy Buds 3, Aurcast also works with Bluetooth LE Audio-compatible hearing aids, sold by companies such as GN Hearing and Starkey. Think of it as a controlled audio broadcasting system.\nIn order to ensure that strangers don’t hop in on your audio stream, you can set a password for your audio broadcast so that only your friends can hear on their earbuds, what you are playing on your phone. Notably, this feature is now a staple for Android and will soon appear on devices by other smartphone brands, as well.\nEasier file search\nFor years, file management has been a mess on Android phones. You either get a simple design with easy functional flow, or too many features served atop a cluttered interface. In One UI 8, the chore of finding data will be a tad easier in the My Files app.\nAll the categories, such as audio, video, documents, images, and downloads, now appear at the top of the page. Below it is a new “recently added files” section, which you can expand to see all the data that has made its way to your phone’s memory, in an orderly fashion. The most notable addition is the app-based filtering system.\nIt is now possible to filter files according to the app from which the package was downloaded. The name of each app appears as a dedicated pill-shaped button in a sliding carousel at the top, and appears across the Downloaded and Recent sections in the My Files app.\nOne UI 8 eligible devices\n| Galaxy S25 series Galaxy S24 series Galaxy S23 series Galaxy S22 Galaxy S21 series | Galaxy Z Fold 7 Galaxy Z Flip 7 Z Flip 7 FE Galaxy Z Fold 6 Galaxy Z Flip 6 Galaxy Z Fold 5 Galaxy Z Flip 5 Galaxy Z Fold 4 Galaxy Z Flip 4 | Galaxy A73 Galaxy A56 Galaxy A55 Galaxy A54 Galaxy A53 Galaxy A36 Galaxy A35 Galaxy A34 Galaxy A33 Galaxy A25 Galaxy A24 Galaxy A15 Galaxy A16 Galaxy A06 | Galaxy M56 Galaxy M55s Galaxy M55 Galaxy M54 Galaxy M53 Galaxy M34 Galaxy M33 Galaxy M16 Galaxy M15 Galaxy M06 | Galaxy F55 Galaxy F54 Galaxy F34 Galaxy F16 Galaxy F15 Galaxy F06 Galaxy Tab S10 series Galaxy Tab S9 series Galaxy Tab S8 series Galaxy Tab S6 Lite Galaxy Tab A9 |"
    },
    {
      "url": "https://www.digitaltrends.com/phones/apple-iphone-17e/",
      "text": "It’s been two months since Apple released the iPhone 16e to the surprise of everyone looking to buy an iPhone for the first time, and the iPhone 17e has leaked out of nowhere. The iPhone 16e came out as a spiritual successor to the iPhone SE, ending the third generation of the SE series and making people wonder whether it’s the start of something new for iPhone. According to the leaker, Apple now seems to be working on developing the iPhone 17e, setting the trend for making affordable iPhones part of the larger, elite iPhone lineup.\niPhone 17e release date and price analysis\nSince the iPhone 16e released in February, Apple fans expected that the “e” series of iPhones will be getting yearly releases several months after the regular iPhones and the Pro models come out in the fall. The leaker said that the iPhone 17e will be out in 2026, as it is “almost in the trial development stage.” However, that release window may change to match the release of the iPhone 17, which is later this year.\nHow much the iPhone 17e will cost may depend on how much storage space an iPhone buyer may want to get. The iPhone 16e costs $599 if you get the 128GB model to start with. Meanwhile, the 256GB and 512GB versions cost $699 and $799, respectively — the last of which is in line with how much the base iPhone 16 model costs. Barring any impact from the tariffs on electronics, the iPhone 17e may be sold for the same price as its predecessor.\nLatest iPhone 17e leaks and rumors\nThere isn’t very much to say about the iPhone 17e, as it is still very much in the early stages of development. However, we are more likely to see more information about as we get closer to the release of the iPhone 17.\nThe first real leaks that are circulating online right now are for an earlier release date. Since release dates are subject to change, it’s best to take that with a grain of salt.\niPhone 17e: what we want to see\nWhile we wait for more information about the iPhone 17e in the coming months, it doesn’t hurt to lay out our expectations for how Apple should design it and price it, especially in comparison to the iPhone 16e. That being said, here’s what we want to see in the iPhone 17e.\nDynamic Island\nApple introduced the Dynamic Island in 2022, making it easier for people to answer phone calls and change the song just by tapping on the pill-shaped display while they’re scrolling through their phone. The feature was exclusive to the Pro models of the iPhone 14 before Apple expanded it to all models of the iPhone 15 and iPhone 16.\nThe iPhone 16e doesn’t have the Dynamic Island like its premium siblings do, but it’s only fair that the iPhone 17e gets that feature. Just because it’s a budget phone doesn’t make it unworthy of a feature that displays songs that are currently playing and someone’s caller ID.\n120Hz refresh rate\nThe screen on the iPhone 16e has a 60Hz refresh rate, which is considerably smooth for the some of the animations gracing its 6.1-inch OLED display, but not smooth enough to match the iPhone 16 Pro. It would be interesting for the display on the iPhone 17e to have a 120Hz refresh rate, because that would mean smoother frame rates when switching between apps, scrolling, watching videos, and playing games.\nThe 120Hz refresh rate on the iPhone 17e’s screen could work if it has anywhere between 1,200 nits and 2,000 nits of peak brightness. Although, the brightness would most likely stay in the lower tier.\nA second camera lens\nWhile the premium iPhones have two or three camera lenses, depending on which model you get, Apple gave the iPhone 16e only one 48-megapixel camera lens with 2x telephoto zoom, which kept the cost low enough to justify its affordability. If the iPhone 17e gets a second camera lens — and it should — it should be an ultrawide camera that’s 12MP or more.\nThat may not be the ideal spec for an ultrawide camera lens, but it should help balance the visual quality of all the photos and videos taken on the phone. It should also give you a considerable 120-degree field of view.\nLower price\nAt launch, the iPhone 16e cost $599 just for the 128GB model alone. That price was palatable enough for some people but not everybody, especially if they’re looking to buy an iPhone for the first time just to try it out. For that reason, the iPhone 17e should be priced at around $499, at least for the 128GB model. The 256GB and 512GB models, in turn, should be marked at $599 and $699. The first price point should be good enough to fit the budget of anyone looking to switch from an Android to an iPhone or going through a hard time financially."
    },
    {
      "url": "https://www.digitaltrends.com/phones/samsung-galaxy-s25-review/",
      "text": "“The Galaxy S25 is a nice $800 phone if you seek the comfort of Samsung, and don’t think too much about camera or battery charging innovation.”\n- Compact footprint and solid build\n- Beautiful 120Hz OLED screen\n- Plenty of silicon firepower\n- Battery can go a full day\n- One UI 7 has a few functional charms\n- It sorely needs a design makeover\n- Cameras don’t justify the price tag\n- Charging situation is just poor\n- Most of the new AI tricks fall flat\n- Upgrades? Don’t say that word\n“Why you can trust Digital Trends – We have a 20-year history of testing, reviewing, and rating products, services and apps to help you make a sound buying decision. Find out more about how we test and score products.“\nThere are two kinds of smartphone shoppers out there. One, that obsesses over specifications, upgrades, and first-person user reviews from chaotic Reddit threads. The other class either puts their trust in the sticker price of a phone from a reputed brand, hoping it will be worth the hit on the wallet, or simply get a phone for the one (or two) things that matter to them.\nThe Samsung Galaxy S25 unabashedly panders to the latter class. And if you live in the US, you will even be spared the FOMO of not getting the best value. There just isn’t any meaningful competition for Samsung here in the Android world, so you can sleep in peace after spending a minimum of $800 on this one.\nHere’s the whole deal with the latest from Samsung. It’s small. It’s fast. It’s reliable. If that checks out your laundry list of smartphone virtues, look for a decent carrier deal and get this one. If you want to pore over the nitty gritty, well, you will find hurdles on nearly every road taken with the Galaxy S25. Let’s dive in.\nSamsung Galaxy S25: Specs\n| Samsung Galaxy S25 | |\n| Size | 70.5 x 146.9 x 7.2mm |\n| Weight | 162 grams (7.7 ounces) |\n| Screen and resolution | 6.2-inch FHD+\nDynamic AMOLED 2X Display Super Smooth 120Hz refresh rate (1~120Hz) Vision booster Adaptive color tone |\n| Operating system | One UI 7 based on Android 15, supported for seven years |\n| Storage | 128GB, 256GB, (512GB in some regions but not US) |\n| Processor and RAM | Qualcomm Snapdragon 8 Gen Elite for Galaxy with 12GB of RAM |\n| Cameras | Rear cameras:\n12MP Ultra-Wide Camera (F2.2, FOV 120˚) 50MP Wide Camera (OIS F1.8, FOV 85˚) 10MP Telephoto Camera (3x Optical Zoom, F2.4, FOV 36˚) Front camera: 12MP, f/2.2 |\n| Durability | IP68 |\n| Battery and charging | 4,000mAh\n25W wired charging 15W Wireless charging (Qi2 Ready) Reverse wireless charging |\n| Colors | Navy, Silver Shadow, Icyblue and Mint |\n| Price | Starting at $800 |\nSamsung Galaxy S25: Design and build\nI recently wrote about Samsung’s crippling design problem. It’s not merely about recycling the same fundamental look for years, but commodifying it across every price bracket. The Galaxy S25 embodies that lazy approach to an aesthetic overhaul. You can mistake it for the two-generations old Galaxy S23 any given day.\nThe core problem, however, is that Samsung’s new mainline flagship looks almost identical to phones that cost a fraction of its sticker price. And there are a lot of such phones in Samsung’s portfolio.\nIf that doesn’t matter to you, this phone is as well-built as it gets. Just make sure you don’t pick one of those drab colors. The fresh navy blue and coral red shades look stunning, and so does the subtle light blue shade on my unit.\nThe most striking aspect, and one that is going to ignite the interest of any person who wants a compact phone, is the Galaxy S25’s footprint. It’s smaller, lighter, and thinner than the iPhone 16.\nBut more than numbers, what matters here is the in-hand feel, and this phone feels fantastic. After using the iPhone 16 Pro, which is nearly as big but considerably heavier, the Galaxy S25 feels like a breath of fresh air.\nThe frame is made out of what Samsung calls Armor Aluminum, while the front and rear faces are protected by Corning Gorilla Glass Victus. I used the phone for the first week without any screen protection, and it fared better at keeping scuff marks and scratches at bay in my pocket.\nThe best part about using a phone this size is that you don’t have to fiddle while trying to reach the side and volume buttons. I am not really a fan of sharp edges with flat side rails, since they dig into the palm, but the sleek looks here offer some compromising consolation.\nIt’s just funny that Samsung’s phone design has now come closer than ever to iPhones. Those rounded corners, slim bezels, flat sides, and glass-metal sandwich design. Talk about heavy-handed competitive inspiration. If you can overlook that, and just want a compact Android phone, the Galaxy S25 won’t disappoint.\nSamsung Galaxy S25: Display\nTechnically, this display isn’t an upgrade. It’s the same 6.2-inch size, FHD+ (2340 x 1080 pixels) resolution, 120Hz refresh rate, and peak brightness levels. Once again, you are expected to ignore that and focus more on the quality.\nThe Galaxy S25’s Dynamic AMOLED 2X display is beautiful, and thanks to slim symmetrical bezels, it looks even better. It produces gorgeous colors and there is little to complain about viewing angles, either.\nI’ve had some issues with Samsung’s auto-brightness algorithms in the past, but the Galaxy S25 appears to have left those demons behind. When using the phone under direct sunlight, I didn’t feel the need to manually ramp up the brightness to make sense of the on-screen content.\nMy biggest issue is the glare. It’s not a problem unique to Samsung, but the company has a solution already at its hand. The Galaxy S24 Ultra came with a non-reflective layer atop the screen, which employed a nano-scale layering process.\nThis nanoscale layer scattered strong light within the glass matrix, instead of reflecting it back. Samsung should have put the tech on the Galaxy S25, as that’s the weakest point of this otherwise gorgeous OLED panel.\nThe adaptive brightness system works just fine, and on the rare scenarios when I needed to read an email in broad daylight while on the go, the Extra Brightness feature came in handy.\nThere’s also an adaptive color tone system, which automatically adjusts color saturation and white balance based on the ambient light. It makes the colors look more vibrant, especially pastel tones. The adjustments happen slowly, and with it enabled, the screen is easier on the eyes, if the brightness levels are cranked up to the max value.\nIt somewhat overlaps with the eye comfort shield system, which goes a tad aggressive on giving the screen a red-ish tinge. However, I mostly kept the adaptive color toggle disabled out of personal preference for a colder color profile, instead of a warmer color tone.\nThankfully, there are plenty of controls, such as individual RGB sliders, vividness strength, and manual white balance adjustment to get the color chemistry that is the most pleasing each person’s eyes.\nSince it’s a 120Hz panel, all interactions feel fluid. Whether I was browsing past web pages or playing games, the Galaxy S25’s screen didn’t disappoint. I also loved the ability to schedule the always-on display mode, but I mostly kept it limited to only light up for fresh notifications to save up on battery juice.\nSamsung Galaxy S25: Performance\nSamsung has equipped the Galaxy S25 with a special “For Galaxy” version of Qualcomm’s Snapdragon 8 Elite silicon. This time around, Samsung has also upped the RAM to 12GB, which is definitely a welcome upgrade, especially in the wake of heavy AI deployment across the board.\nThat’s a potent combination, and it doesn’t disappoint. I am a fairly heavy user. My average workday is split across three loaded communication platforms, an equal number of task management apps, all-day music streaming, local video editing for short videos, and social media.\nI never felt the Galaxy S25 caving into the load. The situation with games was not too different. I mostly kept myself busy with losing in Diablo Immortal, Devil May Cry: Peak of Combat, Battlegrounds Mobile (BGMI), and Zenless Zone Zero. All these games are fairly graphics intensive, but the Galaxy S25 sailed past them with ease.\nIn BGMI, with frame rates set to Extreme+ and graphics quality at Smooth preset, I had a fuss-free experience. I did run into stutters during intense combat scenes, but those were far and few. I was impressed by the performance consistency, as the game never dipped below the 86fps mark across multiple sessions.\nThese were the results I got with the Balanced profile in the Game Booster dashboard. Shifting gears to the Performance mode, I cranked up\nanti-aliasing, and set the graphics combination to HDR + Extreme. At this state, the Galaxy delivered an even better experience in the 60fps range with minimal fluctuation.\nIn a room where the ambient temperature was at 28 degrees Celsius, a gaming session worth around half an hour took the temperature levels to 40 degrees Celsius. Those figures, once again, are good, especially for a phone this size.\nLarger phones, such as the Galaxy S25 Ultra and the Red Magic 10 Pro, do a better job at heat dissipation, but that’s because of the superior vapor chamber system fitted inside their chassis. But if I were to compare the Galaxy S25 to its predecessor, the improvements are laudable.\nThe Galaxy S25 didn’t give me any concerning troubles with localized heating, though it does get warm. As far as battery consumption goes, you can expect to burn anywhere between 20-25 percent battery for an hour-long session in demanding games.\nThe outing on benchmark platforms doesn’t disappoint either. For some reason, the 3DMark Steel Nomad test kept failing to run. Morever, owing to the lack of more RAM and better thermals, the Galaxy S25’s true potential is held back.\nIt can’t quite catch up with the OnePlus 13, which comes fitted with the same flagship Qualcomm processor. In an hour-long synthetic throttling test, the Galaxy S25 managed to race past the OnePlus 13 in the first half by retaining 62% of its peak performance, but dipped under the 50% level in the second half while its OnePlus rival delivered good stability.\nThe Galaxy S25, however, manages to surprise in weird ways.\nAfter running the 3DMark Wildlife Extreme Stress Test, it delivered a higher peak score than the OnePlus 13, but its lowest loop score fell below the OnePlus 13’s tally. Stability was the key differentiator, as the OnePlus 13 delivered nearly 63% on this metric. The Galaxy S25’s stability stood at 46.9%, while also eating up 50% more battery juice than its rival.\nOverall, the Galaxy S25 offers a notable jump in performance against its predecessor and can chew through any task (or game) you throw at it with ease. It may not be at the top of the leaderboard (neither does it strive to), but if you’re concerned about any potential performance woes, there aren’t any such red flags here.\nSamsung Galaxy S25: Cameras\nThe Galaxy S25 carries the imaging hardware from the Galaxy S24, which itself is lifted from the Galaxy S23. That’s both good and bad news. You get a 50-megapixel primary sensor, alongside a 12-megapixel sensor for ultra-wide capture, and a 10-megapixel telephoto snapper with 3x optical zoom range.\nThat’s criminally underpowered compared to other Android phones in the same price bracket. For comparison, the OnePlus 13 offers a trio of 50-megapixel cameras at the back, and they click fantastic pictures that are a cut above the Samsung Galaxy S25.\nTalking about the raw imaging performance, the main sensor clicks beautiful stills with plenty of details. If you are a fan of saturated pictures, then the Galaxy S25 won’t leave you disappointed. There is ample sharpness in the pixel-binned 12-megapixel shots.\nYou can capture full-res 50-megapixel shots, as well, and I prefer them. These full-res shots are captured at a slightly lower ISO level, so the highlights appear slightly crushed. On the positive side, color reproduction in the non-binned pictures is more realistic. Of course, there is plenty of pixel detail to peek at, so there’s that benefit.\nClose-up shots also turn out pretty nice, and there is little focus struggle at close quarters. However, the Galaxy S25 struggles with achieving white balance uniformity across its lenses. Even under daylight, it’s easy to see washed-out elements when you compare the shots.\nAnother weak spot is highlight management and occasional HDR stutters. I frequently noticed the main and ultrawide cameras blow out the backdrop of a blue sky. You need to adjust the focus and adjust the exposure slider, but once it’s done, there is a night and day between the picture quality.\nI love the new filter controls in the camera apps, especially the level of control they offer in customizing the frame. The Galaxy S25’s execution is definitely better than the Photographic Styles system on the iPhone 16 series.\nThe Galaxy S25 takes terrific portrait shots. The subject separation is on point, the bokeh isn’t unnaturally flat, and there’s plenty of detail. However, it struggles with moving subjects, even at close range.\nIn low light, the Galaxy S25 once again delivers mixed results. In very dim rooms, it did a fantastic job of exposing elements and bringing out colors. However, Samsung needs to improve how it handles noise. It’s easy to see the grainy texture and aggressive denoising in low-light shots.\nThe 3x optically-stabilized zoom camera also does its job well. But I suggest not going beyond the optional zoom range. When you exceed that, Samsung’s camera algorithms do a bad job with oversharpening and give an odd painted-over look to objects.\nThe selfie camera does an acceptable job of depicting accurate skin tones. It’s not quite up there with the Google Pixel 9 or the iPhone 16, primarily because the algorithmic processing often flattens the surface details.\nOtherwise, if your preoccupation is social media posting, the Galaxy S25’s front camera will serve just fine, especially with one of the AI filters applied. Samsung has also improved the video stabilization pipeline, particularly with the SuperSteady mode enabled.\nThere is a bit of focus hunting in 4K videos, and as a result, you might see some haphazardly strong highlights. Thankfully, the robust editing tools in the Gallery app can help finetune some of those imperfections and get pleasing clips.\nSamsung Galaxy S25: AI features & Software\nOneUI 7 is an acquired taste. At a time when even the usual suspects from China are embracing a near stock look, Samsung still serves a healthy dose of bloat. Aside from over a dozen in-house apps, you also have Google’s suite of Workspace apps, and for some reason, Microsoft services such as LinkedIn and Copilot.\nCopilot is particularly perplexing, since the Galaxy S25 already serves its own suite of artificial intelligence tools under the Galaxy AI label, aside from on-device AI chops with Google’s Gemini Nano. So, you essentially have three AI assistant apps that come pre-installed on the Galaxy S25.\nWhy, Samsung?\nA majority of Samsung’s advertisements for AI on Galaxy S25 show Gemini kicking into action by default, with a long press of the power button. So, what exactly is the in-house Bixby assistant supposed to do?\nTo Samsung’s credit, it has managed to create local AI integrations with its own apps, such as Notes and Calendar. Just like Gemini on Pixel phones, Galaxy AI can also work with Google services such as Gmail, and even third-party apps like WhatsApp and Spotify.\nIt doesn’t always work as advertised. I asked it to play “So Long, Marianne” by Leonard Cohen, and it instantly took me to the playback screen on YouTube Music.\nNext, I invoked the assistant to write an email to my sister. In the first attempt, the onboard AI simply didn’t invoke the Gmail extension. On the second attempt, it wrote the email content but pulled up the Messages shortcut, instead of Gmail.\nThe heavily touted Now Brief and Now Bar don’t really have anything worth being excited about. The Now Bar acts more like the iPhone’s Live Activities system on the lock screen, while the Now Brief system wishes you good morning, shows a calendar and catches you up about the events lined up ahead.\nI never felt compelled to check my Now Brief, because I already get pre-event alerts about my engagements via Google’s suite of apps. There are a few AI-powered generative editing tools. These are fun to play with, but also test your patience with blatant inaccuracies.\nThe most useful AI features include the writing assist bundle (Hello, writing tools on Apple), live translation for phone calls, and an interpreter mode that also works offline for real-time translations. A healthy few of these features, however, have also appeared on devices such as the OnePlus 13, so there’s no “exclusive” bragging rights here for Samsung. Also, the Pixels still serve a more seamless AI experience than what Samsung touts for Galaxy AI.\nOne UI 7, however, offers its own niceties on the Galaxy S25 such as the ever-useful side panel for quick access to system tools, the Good Lock module for deeper customization, and one of the most feature-heavy camera apps out there. Overall, One UI 7 is not terrible. It just needs to cut some bloat and functional redundancies.\nSamsung Galaxy S25: Battery\nI’ll start with the bad part(s) here. The Galaxy S25 inherits the small 4,000mAh battery of its predecessor, its slow charging virtues, lack of magnetic wireless charging, and the absence of a charging block in the box. The whole Pandora’s box, if you will.\nOn the positive side, Samsung has optimized this small battery really well. The poor experience I had with the Galaxy S23 made me extremely skeptical about yet another battery anxiety repeat episode, but I was wrong. Despite my demanding usage, I could easily go a full day without charging.\nNow, those figures are not absolute. If you are someone who likes to squeeze in a few rounds of heavy gaming, the small battery pack quickly loses juice. If your cumulative time spent in a battle royale lobby or Hoyoverse stands close to a couple of hours each day, carry a power bank.\nAnd this is where the Galaxy S25 goes on a downhill ride. One would expect the 4,000mAh battery to top up quickly, but Samsung’s laggard streak at charging tech means even this small battery pack takes well over an hour to charge fully.\nI have witnessed phones charging fully in just over 30 minutes, so the precedent set by Samsung is truly terrible. The OnePlus 13, with its supplied 100W charger, can fill an empty 6,000 mah tank in less than 40 minutes.\nThe Galaxy S25 takes nearly double that time, despite packing a much smaller battery. And it doesn’t come with a charging brick in the box either, so there’s that vexation to deal with, as well.\nThere is little consolation on the wireless charging side, either. There are no magnets, a la MagSafe on iPhones. The Galaxy S25 can technically reach a 15W wireless charging pace, matching the peak output of the Qi2 standard.\nThankfully, there is support for reverse wireless power share, which means this phone can charge accessories such as earbuds by simply placing them over the phone’s rear shell.\nOn a positive note, there are a handful of battery performance optimization features available on the Galaxy S25. Unless you are someone totally averse to the idea of charging your phone midway through the day, I highly recommend that you enable adaptive charging and limit the peak battery top-up to the 80% level to enhance its longevity.\nSamsung Galaxy S25: Verdict\nThe Galaxy S25 is a fantastic phone on its own. It serves a beautiful OLED screen, fast processor, capable cameras, neat design, and a surprisingly good battery life for its size. The One UI 7 software has its own quirks, but it adds a few meaningful AI features that you might use every once in a while.\nIf your eyes are fixated on this phone, go get it. But if you are someone who weighs their options and wants the best value for their dough, the Galaxy S25 is a competitive mess. You can safely get the Galaxy S24 for a lower asking price, and avoid any FOMO vibes.\nAway from the Samsung ecosystem, you get the OnePlus 13, which is an absolutely loaded package that handsomely beats the Galaxy S25 at nearly every parameter for a $100 extra heft to the bill. Conversely, you can play it safe and get the iPhone 16 or Google’s excellent Pixel 9 for the same ask as Samsung.\nThe only scenario where I can recommend the Samsung Galaxy S25 is one where you need a small phone, plan to use it for the next few years, and absolutely love the new shades. To put it more accurately, you must really want this one, to splurge on it."
    },
    {
      "url": "https://www.digitaltrends.com/phones/samsung-galaxy-s24-fe-review/",
      "text": "“The Galaxy S24 FE shouldn't be your first choice, but if you want a big phone with great battery life (and you find an incredible deal), it'll serve you well.”\n- Big, colorful, 120Hz display\n- Great performance\n- Two-day battery life\n- Surprisingly good charge speeds\n- Seven years of updates\n- It's very big\n- Cheap-feeling hardware\n- Mediocre cameras\n- Uncompetitive price\n“Why you can trust Digital Trends – We have a 20-year history of testing, reviewing, and rating products, services and apps to help you make a sound buying decision. Find out more about how we test and score products.“\nThe Samsung Galaxy S24 FE is a confusing phone. With a $650 starting price, it’s the most affordable entry into the S24 series and has many of the same features as the $800 Galaxy S24 and $1,000 Galaxy S24 Plus. On the surface, it seems like a fantastic deal.\nIn some ways, it is! If you want a big phone with a giant display, good performance, and long battery life, the Galaxy S24 FE delivers. But it makes some compromises to get there, and other phones at lower prices further complicate things. Should the Galaxy S24 FE be your next smartphone? Let’s find out.\nGalaxy S24 FE specs\n| Dimensions | 162.0 x 77.3 x 8.0 |\n| Weight | 231 grams |\n| Durability | Corning Gorilla Glass Victus+ (front), Gorilla Glass 5 (back), IP68 |\n| Colors | Blue, Mint, Graphite, Gray |\n| Display | 6.7-inch Dynamic AMOLED 2X, 2340 x 1080 resolution, 60-120Hz refresh rate, 1,900 nits peak brightness |\n| Processor | Samsung Exynos 2400e |\n| RAM | 8GB |\n| Storage | 128GB or 256GB |\n| Software | Android 14, One UI 6.1 |\n| Updates | Up to seven years of software updates and security patches |\n| Rear cameras | 50MP primary, f/1.8\n8MP telephoto, f/2.4, 3x optical zoom 12MP ultrawide, f/2.2, 123˚ |\n| Front camera | 10MP, f/2.4 |\n| Battery | 4,700mAh |\n| Charging | 25W wired\n15W wireless Reverse wireless |\n| Price | From $650 |\nThe Galaxy S24 FE makes a bad first impression\nFirst impressions are everything; unfortunately, the Galaxy S24 FE doesn’t make a great one. Following my hands-on with the S24 FE, I initially praised its hardware, but after using it for a while longer, I’m not so impressed.\nAfter living with the S24 FE for a few days, I’ve noticed it feels a bit cheap. The aluminum frame has a sharp edge around the display, and the backside (which is glass) feels cheap and hollow to me. It’s hard to explain, but there’s a lack of polish here that I enjoyed so much with the Galaxy S24 Plus. The S24 FE is objectively well-made, featuring aluminum and glass with no trace of plastic, but it’s clearly not constructed nearly as well as its more expensive siblings.\nThe other issue is how enormous the Galaxy S24 FE is. A 6.7-inch display isn’t outrageous for a smartphone in 2024, but the overall dimensions put it closer to phones like the Galaxy S24 Ultra and Google Pixel 9 Pro XL. I’ve used big phones before with fewer issues, but the double whammy of this with the lesser construction quality isn’t a good combination.\nPerhaps I’m more sensitive to it after coming from the small and compact iPhone 16, but I never fully adjusted to the S24 FE’s size during my review period. That’s great news if you love giant phones, but if you prefer something more manageable, this is not the phone for you.\nA good display, with some compromises\nSpeaking of the display, it’s a good one! Mostly. As mentioned above, this is a 6.7-inch screen with Samsung’s Dynamic AMOLED 2X screen tech — the same one found in the other S24 handsets. Colors are bright and vibrant, blacks are rich, and the 120Hz refresh rate is as smooth as can be. It’s all very solid stuff.\nThat said, don’t expect the same exact display quality as the S24 Plus or S24 Ultra. The 2340 x 1080 resolution is significantly lower than the 3120 x 1440 resolution on Samsung’s more expensive S24 phones. It’s not a deal-breaker, but I did notice that the S24 FE’s screen is a bit softer than I’d like.\nAdditionally, this is not an LTPO panel, meaning the lowest the refresh rate gets is 60Hz. You can still enable an always-on display on the S24 FE, but you can’t customize it like you can on Samsung’s other S24 models. There’s also no option to see a darkened version of wallpaper — you just have a black background with the time.\nFinally, there’s the brightness. The S24 FE’s 1,900 nits of peak brightness is very good, and for the most part, I’ve had no issues with it. However, it is another step below the S24 and S24 Plus, which offer 2,600 nits of peak brightness. If you live in a particularly sunny area, it’s another factor you’ll want to consider.\nSurprising performance, fantastic battery life\nGoing into my Galaxy S24 FE, I was initially concerned about its performance. Inside the phone is an Exynos 2400e chip. Performance with Samsung’s Exynos chipsets is very hit-and-miss, and we rarely see a smartphone released in the U.S. with a piece of Exynos silicon inside of it. Thankfully, those concerns were unnecessary.\nPaired with 8GB of RAM, the S24 FE’s day-to-day performance has been great. Apps open immediately, scrolling is very smooth, and not once has the phone felt slow or choppy. It also handles gaming with ease. Playing Star Wars: Hunters at 60 frames per second with Ultra graphics settings is a great experience, with the S24 FE delivering fluid gameplay with only a few occasional jitters.\n| GeekBench 6 CPU (Single) | GeekBench 6 CPU (Multi) | GeekBench 6 GPU | |\n| Galaxy S24 FE | 2122 | 6625 | 15526 |\n| Galaxy S24 Plus | 2333 | 7129 | 15903 |\n| OnePlus 12R | 1585 | 5157 | 8424 |\nIn our benchmark tests, the Galaxy S24 FE fares nicely against the Snapdragon 8 Gen 3 chip inside the Galaxy S24 Plus. It also handily outperforms the Snapdragon 8 Gen 2 chipset powering the OnePlus 12R. The Exynos 2400e has proven extremely reliable, so any worries about a Samsung phone with an Exynos chip can be laid to rest.\nThe Exynos 2400e has proven extremely reliable.\nBattery life has been equally impressive. With moderate use, the Galaxy S24 FE’s 4,700mAh battery easily lasts two days on a charge. As an example of my use of the phone, I began one day with 100% battery at 7:30 a.m. After just shy of two hours of screen time — including 50 minutes watching YouTube, 20 minutes on Reddit, and some time on TikTok and Star Wars: Hunters — I ended the day at 11 p.m. with 70% battery still remaining.\nThe next day, I had 67% battery at 8 a.m. and racked up over two hours of screen time — this day with over 30 minutes on the NFL Fantasy app, over 20 minutes on X, more than 10 minutes scrolling on TikTok, and frequent camera use. I didn’t hit 10% battery until 10:30 p.m. For reference, I did not have the always-on display enabled.\nIf you push the S24 FE and are constantly gaming, streaming, etc., you might be able to kill it in a day. But for almost everyone, this will be a two-day smartphone, and that’s excellent.\nWhat about charge speeds? The 25W wired charging speed doesn’t inspire much confidence, but interestingly enough, I found the S24 FE to charge at about the same rate as the Galaxy S24 Plus with its 45W charging. After 30 minutes on my reliable Anker 747, the S24 FE went from 2% to 61% in 30 minutes and had a full battery after about an hour and 10 minutes. That’s not the very best in the world, but it’s also not bad by any means — especially for a battery just 200mAh smaller than the one in the S24 Plus.\nWhat about the cameras?\nThe Galaxy S24 FE has a fairly standard camera setup. There’s a 50-megapixel primary camera, an 8MP telephoto camera with 3x optical zoom, and a 12MP ultrawide camera with a 123-degree field of view.\nSo, how’s the image quality? If you’re taking a well-lit photo of flowers, food, or a very still animal, the Galaxy S24 FE can return some nice-looking photographs. I’ve taken a handful of pictures that I’m pretty happy with, and as you get closer to your subject, the S24 FE’s primary camera provides a pleasing natural bokeh effect.\nThat said, the S24 FE can also capture some pretty mediocre-looking pictures. Like other Samsung phones, it struggles with moving objects — particularly animals. The photo of my cat Polo (the white and brown one) is very soft. He was moving around a little bit but was mostly still for the picture I took. Even so, the S24 FE focused on the right edge of the hammock instead. The camera also has a difficult time with black fur. My cat Minnie is a beautiful princess, but the S24 FE did a really poor job with her black coat.\nComparatively, the telephoto and ultrawide cameras are entirely unremarkable. Photos from the two secondary sensors lack any depth or detail and consistently produce bland images. The added flexibility they provide is handy, but there’s also nothing memorable here.\nSimilarly forgettable is the 10MP selfie camera. Does it work in a pinch? Sure. But you won’t want to use it for much beyond that. Shots look fine at first glance, but zoom in just a little bit, and you’ll quickly notice the grainy background, poor focus, and lacking details.\nGalaxy AI and software updates\nBeing a Samsung phone released in 2024, it should be no surprise that the Galaxy S24 includes the full suite of Galaxy AI features. That means you get features like real-time translation during phone calls, note formatting and summarizing, AI-powered photo editing tools, and more.\nSome of these features, like Samsung’s object eraser tool for photo editing, are quite good! Others, like all of the Chat Assist tools, are embarrassingly bad. I’ve used Galaxy AI a few times throughout this year on multiple Samsung phones, and once again, my conclusion is the same. Some of these features are cool and helpful, but they’re not reason enough to buy the S24 FE over a competing phone without Galaxy AI.\nWhether you care about Galaxy AI, the rest of the S24 FE’s software is no different from any other Samsung phone. It ships with Android 14 and Samsung’s One UI 6.1 interface. Although it’s not my personal preference for an Android interface, One UI 6.1 is fast, reliable, loaded with extra features, and highly customizable. From numerous multitasking options to systemwide themes, there a lot to sink your teeth into.\nLooking down the road, Samsung promises seven years of Android upgrades and security patches for the Galaxy S24 FE — ensuring it should keep receiving updates through September 2031. That’s the same level of support offered on Samsung’s more expensive S24 flagships, and it’s great to see it also offered on the FE.\nGalaxy S24 FE price and alternatives\nThe Samsung Galaxy S24 FE is available now. The 128GB model starts at $650, while the 256GB version is available for $710. It comes in Blue, Mint, Graphite, and Gray colors.\nIf you’re shopping for an Android phone on a budget, you need to check out the OnePlus 12R. It has an outstanding 6.7-inch display, two-day battery life, incredible 80W wired charging, and a much nicer design. There’s no wireless charging or telephoto camera, Buy at Amazon , it’s an unbelievably good deal.\nThere’s also the Google Pixel 8a. It has a better camera, similar AI features, and a more compact 6.1-inch 120Hz display. If you can deal with the smaller size (and shorter battery life), Buy at Amazon .\nOK — but what if you want a Samsung phone? As mentioned at the beginning of the review, the S24 FE is cheaper than the retail prices of the Galaxy S24 and Galaxy S24 Plus — $800 and $1,000, respectively. That’s significant savings at first glance, but you need to look closer than that.\nRight now, T-Mobile is offering up to $800 off the Galaxy S24 Plus when you trade in a phone as old as the Galaxy S9 or iPhone 11. Verizon is giving away the Galaxy S24 for free when you add a new line. Depending on which phone you trade in on Samsung’s website, you get the Galaxy S24 Plus for just $50 more than the S24 FE. At the time of publication, you can buy the Galaxy S24 Plus outright — no trade-in or carrier deal required — . Considering it has 256GB of storage by default, that’s just $40 more than 256GB Galaxy S24 FE.\nBecause those other (and objectively better) S24 phones have been out for a while, it’s very easy to find incredible deals for them. There are promos for the S24 FE, too, but when you can get the S24 and S24 Plus at such great prices, why bother with the S24 FE in the first place?\nShould you buy the Galaxy S24 FE?\nAs I mentioned at the start of this review, the Samsung Galaxy S24 FE is a confusing smartphone. Viewed in a bubble, there’s plenty to like. If you want a big phone with a 120Hz display, two-day battery life, and great performance, the S24 FE can seem like a bargain. However, even viewed through this hypothetical lens, you still compromise with cheap hardware, lesser display specs, and mediocre cameras.\nThe Galaxy S24 FE isn’t a bad phone, but it is an outclassed and outpriced one.\nAs I explained above, the S24 FE does not exist in a bubble. Want a big Android phone with excellent performance and battery life? The OnePlus 12R is a much better choice. It outdoes the S24 FE in some key areas and costs $150 less. If you’re dead set on getting a Samsung phone, your money is much better spent on a discounted S24 or S24 Plus — which are very easy to come by these days.\nIf you can find the Galaxy S24 FE at an incredible discount — such as $200 or $300 off — then sure, go ahead and buy it. But if you’re considering dropping $650 on the FE, do your research and get something else for that kind of money. The Galaxy S24 FE isn’t a bad phone, but it is an outclassed and outpriced one."
    },
    {
      "url": "https://www.digitaltrends.com/phones/google-pixel-10-review/",
      "text": "“The Pixel 10 doesn't disappoint as it delivers Google's reliable flagship experience, but it fails to really wow.”\n- Superb photography abilities\n- Genuinely useful AI tools\n- Camera Coach is surprisingly good\n- PixelSnap is exciting for Android\n- eSIM-only is frustrating\n- Camera bar is sizable\n- Magic Cue needs more time\nInstant insight\nThe Google Pixel 10 has it easy. Its predecessor, the Pixel 9, was a top all-rounder offering Android in its purest form, with a dash of AI, and a healthy dose of Google’s superb camera processing prowess.\nFor the Pixel 10, Google just needed to continue the trend. And the good news is, it’s done exactly that.\nScreen brightness has been given a boost, battery capacity has been increased, a third camera has been added to the rear, photography has been advanced once again, and there’s a fresh dollop of new AI features to make sure the Pixel 10 has its finger on the 2025 trend pulse.\nThe improvements aren’t enough to warrant an upgrade from the Pixel 9, but if you’re rocking a Pixel 8 (or older) the Pixel 10 offers a reasonable step up in power, performance and AI.\nPlus, Google claims this new phone is twice as durable as the 8 series handset. Not that I’ve been brave enough to put that particular claim to the test – although I did manage to scratch the screen in a seemingly innocuous way.\nThe Pixel 10 is the entry point to the latest advancements in AI and Android from Google, without the premium cost of the slightly more featured packed Pixel 10 Pro and Pixel 10 Pro XL.\nPixel 10 prices start at $799 for the 128GB model, rising to $899 for 256GB of internal storage. There’s no 512GB or 1TB options as with its siblings, but what’s offered here will be enough for many prospective buyers.\nYou get flagship build quality which feels sturdy in the hand and while I’m not thrilled about the size and protrusion of the camera bar, the Pixel 10 does kick out impressive snaps.\nAnd of course, a 2025 flagship phone isn’t complete without a suite of AI tools. The Pixel 10 delivers with its clever Camera Coach genuinely helping me to take better photos, while more time is needed to truly realize the benefits of the intriguing Magic Cue.\nGemini lies at the heart of the Pixel 10, providing you with a generative AI chatbot and its screen-sharing Live feature – but a subscription to Google AI Pro is needed to unlock a wider suite of tools.\nYou can get a one month free trial with the Pixel 10, but the new Pro handsets offer a full year free of charge. It’s a shame Google hasn’t made this deal available here as well.\nThe display is bright and bold, providing a pleasing canvas for whatever your viewing habits might be, and while the rounded edges of the screen nicely match the contours of the frame I’ve found they can eat into the edges of applications.\nOverall, the Pixel 10 offers a polished flagship experience which holds its own against the Samsung Galaxy S25 and iPhone 16.\nIt’s more of the same from Google, and while that means the Pixel 10 isn’t a particularly exciting device on the surface with no major ‘wow’ factor, there’s plenty to like.\nFor those looking to experience Android in its purest form, at a price which won’t break the bank, the Pixel 10 gives you everyone you’d want from a Google phone.\nGoogle Pixel 10 specs\n| Screen size | 6.3-inch OLED Actua display |\n| Screen resolution | 1080 x 2424 at 422 ppi |\n| Dimensions | 152.8 x 72.0 x 8.6 mm (6.0 x 2.8 x 0.3 in) |\n| Weight | 204g (7.2oz) |\n| Chipset | Google Tensor G5 |\n| RAM | 12GB |\n| Storage | 128GB / 256GB |\n| Operating system | Android 16 |\n| Rear cameras | 48MP wide / 13MP ultrawide / 10.8MP 5x telephoto |\n| Front camera | 10.5MP |\n| Battery | 4,970mAh |\n| Colors | Indigo / Frost / Lemongrass / Obsidian |\nGoogle Pixel 10: design\nQuick take: the Pixel 10 is a well built, premium device which fits in with the flagship crowd. The camera bar is sizable, while the omission of a physical SIM tray in the US will frustrate some.\nThe Google Pixel 10 design is a subtle advancement on the Pixel 9 it’s replacing. A full redesign of the range this is not.\nSay it quietly, but there’s more than a passing resemblance to Apple’s design, with the Cupertino, California-based firm having employed the flat metal frame and smooth glass front and rear look on every handset since the iPhone 12.\nThat’s not necessarily a bad point, but if you’re looking for a phone which offers up something more visually appealing you’ll want to check out the Nothing Phone 3.\nThe core visual upgrade for the Pixel 10 is found on the back, where the camera bar features a wider glass panel than its predecessor, as there’s a new, third camera squeezed into the space.\nI don’t mind the look at all, and at a glance you could easily mistake it for the pricier Pixel 10 Pro, but I’m less thrilled by how much the camera bar protrudes from the rear.\nThe flat, sharp edges accentuate its presence, and means it can gently snag on a pocket when you attempt to slide it in. A case will soften this considerably, and the official Google case I was sent with my review review also provided more grip with its soft-touch texture.\nGoogle claims the Pixel 10 improves on durability over its predecessors, telling us it can “handle everyday drops, scratches, spills and dust” and that it’s two times more durable than the Pixel 8.\nThat durable body is also Google’s most sustainable to date, as the construction of the Pixel 10 features 32% recycled materials (by weight) – although it doesn’t have the repairability aspect of the new Pixel Watch 4 and Pixel Buds 2a.\nDespite the additional camera hardware towards the top of the phone, the Pixel 10 is surprisingly well balanced, and at 204g it sits well in the hand.\nI was sent a UK model for review, and it has something the Pixel 10 in North America doesn’t. A SIM card tray.\nThat’s because for the US, Google has decided to offer the Pixel 10 with eSIM support only, meaning you can’t insert your physical SIM into the phone. A number of Pixel 10 series reviewers have already reported issues with getting their physical SIM transferred to an eSIM, so you might need to contact your carrier to ensure a smooth transition if you pick up this phone.\nWhile there are a number of advantages to eSIM, it appears carriers aren’t properly set up for an eSIM-only world just yet. If you pick up the Pixel 10, you might find yourself as a guinea pig for the virtual SIM technology, which will benefit users in the future but possibly cause you a headache initially while you attempt to get things connected.\nYou do still get a USB-C port on the base of the handset, allowing you to easily charge and transfer data, plus there’s Qi2 magnetic wireless charging which brings with it the new PixelSnap compatibility.\nIt operates in the same way as MagSafe does on iPhone, allowing you to magnetically attach accessories to the Pixel 10. PixelSnap even supports MagSafe products designed for iPhone, opening up a wealth of versatility. I’ll talk more on this in the battery section later on.\nDesign score: 8/10\nGoogle Pixel 10: display\nQuick take: the Pixel 10 display does exactly what you need it to, be it scrolling social, snapping pics, playing games or streaming shows.\nThe Google Pixel 10 display is bright, clear and responsive.\nAt 6.3 inches, it’s a reasonable size without being overbearing – great for those who want a large display they can manipulate one-handed, be it scrolling social, snapping pics, or conversing with Gemini.\nWith a peak brightness of 3,000 nits, the screen is viewable in bright light, making it a suitable poolside partner. One of the few niggles my colleague had when reviewing the Pixel 9 was its screen brightness, so it’s great to see Google address this with the Pixel 10.\nThe OLED panel produces bold colors, which means games and video look great. I’ve been able to comfortably watch Netflix and YouTube during my commute, and continue my Clash Royale addiction.\nBut if you watch a lot of video on their phone, or see yourself as a dedicated mobile gamer, then you might want to consider a larger screen.\nThe Pixel 10 Pro XL offers up a 6.8-inch display, but there’s a significant price increase to get there.\nA middle ground could be the 6.7-inch Galaxy S25+, but if you’re looking for a big screen at Pixel 10 prices, the 6.82-inch OnePlus 13 is a spec-stuffed flagship without the huge expenditure.\nA minor bugbear I have with recent Pixel phones returns on the Pixel 10, with the overly rounded corners of the display creating a small, yet frustrating problem.\nMany Android apps are developed with a square, or almost square screen in mind. However, the Pixel 10’s display corners are more rounded than some, meaning the very edges of the corners are ‘lost’.\nMost of the time this isn’t an issue, but from time to time you’ll find an app’s interface cut into. This is most prominent when trying to skip ads in mobile games.\nThese ads tend to play a tiny cross or skip button right in the corner of the screen – with the Pixel 10 that button is almost sliced in half by the rounded corner, making the button harder to see and tap.\nAs I say, it’s minor, but Google needs to work with developers and ad firms to make sure their interfaces play better in the confines of the display.\nAnd another unfortunate knock against my Pixel 10’s display – I somehow managed to put a two inch long scratch into the Gorilla Glass Victus 2, simply by putting the handset screen-down on an outdoor wooden table and sliding it to a different position.\nThere wasn’t any force, or obvious culprit for the damage – perhaps a loose piece of dirt in the wrong place at the wrong time. But a word of warning, any phone screen can be scratched.\nIn the Pixel 10 display’s favor, there is a 120Hz refresh rate for smoother scrolling and animations.\nThis was enabled by default on my review unit, but I’ve seen reports that it might not be turned on automatically for everyone (with the screen operating at 60Hz instead).\nTo check, go to Settings > Display & Touch and scroll down to the ‘Other display controls’ section at the bottom to see if Smooth Display is enabled.\nGoogle does warn you that the higher refresh rate can impact battery life, but I’ve got no complaints with the power drain I’ve experienced.\nDisplay score: 9/10\nGoogle Pixel 10: performance and AI\nQuick take: There’s enough power available here for most tasks, while the new AI features require more time to fully realize their potential.\nOne of the major advancements across the whole Pixel 10 series is the introduction of Google’s new Tensor G5 chipset, which it claims delivers better performance and unlocks more AI capabilities.\nIt’s paired with 12GB of RAM in the Pixel 10, which will be plenty for most people. If you do want more power, the Pixel 10 Pro and Pro XL boast 16GB.\nThe Pixel 10 launches with Android 16, Google’s latest version of its operating system, and with it the firm’s Material 3 Expressive interface.\nThis visual overhaul is present in the overall interface, as well as a handful of Google’s own apps (including Phone, Clock and Calculator). The new look will arrive on more of Google’s own apps in the near future via updates.\nI’m a fan of Material 3, with its bold, colorful and clear make-up falling pleasingly on the eye.\nThe Pixel 10 effortlessly allows you to move around the phone, load apps and play games – there’s enough power available.\nIf you do opt for the Pixel 10, you should be able use it for many years as Google has committed to seven years of software upgrades and security updates – taking the phone through to 2032 before it stops receiving updates.\nBut what Google is really excited about is the AI features it’s able to deliver thanks to the new Tensor G5 chip.\nAI features\nOne of the key new AI features on the Pixel 10 series is Magic Cue, which can pull information from various apps and suggest useful actions to you based on the information it’s gathered and the context of what’s happening on screen.\nFor example, if someone asks you in Gmail what time your flight lands, Magic Cue understands the request and can search previous messages and emails to find your flight details.\nIf it’s found relevant information, you’ll get a pill shaped icon appear at the bottom of the screen – tap it and you’ll be able to share the flight info without having to leave the current app.\nMagic Cue works across a number of applications, including Phone where it can pull up your reservation details on screen while you’re calling a restaurant to change or booking, and in messages where it can prompt you to create a calendar entry off the back of a friend inviting you to drinks at the weekend.\nIt is limited however, with Magic Cue currently only able to search for data across a handful of Google apps; Gmail, Calendar, Messages, Keep notes, Screenshots and Contacts.\nIf you use third party messaging apps, or have lots of information stored outside of the core applications listed above, Magic Cue won’t appear.\nAnd when it does appear, its suggestions aren’t always totally accurate, as there are times it appears to get confused and deliver partial or incorrect results.\nNo doubt Google will continue to fine tune Magic Cue, and I’d expect it to roll out to more apps in the future. Google’s already confirmed ‘Share Photos’ will arrive ‘early September’ so “when friends ask about a specific photo of a person/pet, location or activity, Magic Cue finds the right photos with one tap.”\nFor now Magic Cue is a fun little tool when it works – but its promise is yet to be fully realised.\nThere are a few more AI features in the Phone app, including an impressive looking Voice Translate feature which can translate a real-time phone call while maintaining your personal tone, and Take a Message which can provide a real-time transcript of calls you choose not to personally answer.\nI wasn’t able to test either of these features, but we will update this review in the future once we’ve been able to try them out.\nPerformance score: 8/10\nGoogle Pixel 10: cameras\nQuick take: Google continues to shine when it comes to smartphone photography, with the Pixel 10 taking great shots with minimum effort – and the Camera Coach is a genuinely useful addition.\nGoogle has upped the number of cameras on the back of its baseline Pixel, with the Pixel 10 boasting three rear snappers.\nYou get a 48MP main camera, 10.8MP telephoto with a 5x optical zoom, and a 13MP ultrawide with a 120 degree field of view.\nWhile both the Pixel 9 and Pixel 8 boasted 50MP main cameras, both of these devices had just two rear cameras (the second being an ultrawide), and no optical zoom functionality.\nThe addition of the telephoto lens on the Pixel 10 gives prospective upgraders reason to be interested, while also ensuring it has a spec line the iPhone 16 can’t match.\nAnd the 5x telephoto zoom works very nicely. I was impressed with the clarity and detail it was able to capture, and coupled with Google’s already-excellent image processing, the Pixel 10 takes great shots pretty much consistently.\nYou can get even closer to your subjects though, as the Pixel 10 also comes equipped with the 20x Super Res Zoom. This is digital zoom, relying on image processing to reduce pixelation and return you images which are still easy on the eye.\nI snapped a picture of a wedding venue at 0.5x, 1x, 2x, 5x and 20x, to see how close I could get to a board in the distance, and whether the Pixel 10 would be able to make the writing on it legible.\nAs you can see below, the results are solid, and you’re able to read the heading on the board at 20x – although the tiny text is still not legible, but that’s not a surprise.\nIt’s impressive, but the Pixel 10’s pricier siblings have an even better party trick with their 100x Pro Res Zoom. This gets you even closer to the action with impressive corrective processing – but it’s only available on the Pixel 10 Pro and 10 Pro XL.\nA party trick all three Pixel 10 handsets have though is the Camera Coach. This is built into the camera app, and with a tap you can enable the coach to guide you through the process of taking a better picture.\nEnable it for the first time, and a note pops up saying “Camera Coach is in its early stages, with ongoing improvements and new features”.\nThe note goes on to say it uses generative AI, with images sent to Google for processing off device, but once processed they are deleted from Google’s system.\nIt uses Gemini AI to analyze the scene you’re pointing the camera at, and asks you to confirm what you’re trying to get in shot by offering a selection of options.\nFrom there, Camera Coach gives you step-by-step guidance on framing your shot, from rotating the phone and changing the angle, to using the zoom and asking your subject to pose.\nI wasn’t sure how I’d find it as I enabled Camera Coach for the first time, but I was pleasantly surprised by how easy it was to use, and impressed by the guidance it provided. It genuinely helped me take better photos.\nI’m not sure how much longevity Camera Coach has over the lifetime of owning the Pixel 10, you may find you’ve learned everything it has to offer after a few months. I’ll be watching closely to see if Google continues to develop this feature.\nIn daylight, the Pixel 10 produces excellent photos in the standard photo mode, without the need to adjust settings or edit. Just point, shoot, and enjoy.\nThe addition of the 5x optical zoom was the real standout for me, as it allows you to snap an entirely different perspective and still get a high quality result.\nThe ultrawide (0.5x) camera also impressed with its ability to deal with direct light during a sunset, and the complex lighting and detailed ceiling of the Ivy Asia in London.\nCameras score: 9/10\nGoogle Pixel 10: battery\nQuick take: the Pixel 10 provides all-day battery life, while the introduction of Qi2 and PixelSnap marks a turning point for Android phones.\nThe Google Pixel 10 features a 4,970mAh battery, which is larger than the 4,700mAh offering in the Pixel 9.\nAnd Google’s done this while adding just 0.1mm to the Pixel 10’s thickness – and remember there’s also been the addition of Qi2 magnetic wireless charging too.\nWhat it translates to is all-day battery life, with the Pixel 10 easily lasting from when I took it off charge at 7am to returning it to the charger at 11pm.\nDay after day, the Pixel 10 battery gave me confidence to go out without a charger and not worry about running out of juice before getting home. Google’s claim of 30+ hours of battery is possible if you limit screen time and avoid gaming, AI tools and the camera – but in most situations you’ll be charging nightly.\nYet, even with the larger power pack and more efficient chipset, battery performance matches the Pixel 9. It’s not a bad thing, but I was hoping for a little better.\nIf you really push things, the battery does discharge quicker. I spent a couple of solid hours writing parts of this review on the Pixel 10, while streaming music from Spotify via a set of Pixel Buds Pro, and that knocked almost 20% of life from the battery.\nSo battery life is solid, even if it doesn’t move things forward – but when it comes to charging, the Pixel 10 makes things easier than any Pixel before it.\nThat’s because the star of the show here is the aforementioned PixelSnap and Qi2. The magnetic charging standard is already well known by iPhone users as MagSafe, and it’s exactly the same offering here.\nAnd I mean exactly the same, as the Pixel 10, and its Pro siblings, are compatible with existing MagSafe accessories.\nSure Google has a handful of its own brand ‘PixelSnap’ accessories arriving alongside the handset, but if you do pick up the Pixel 10 you’ll have a wealth of charging stands, power banks, wallets, pop-sockets, car mounts and more to choose from.\nThe wireless standard allows for charging at 15W, which isn’t the fastest we’ve seen, and the Pixel 10 Pro XL jumps to 25W wirelessly.\nMy colleague Nirave has tried PixelSnap on the Pixel 10 in more detail, and it’s a potential game changer for Android phones.\nIf you prefer the transitional plug-in and charge method, the 30W peak charging speed can replenish 55% of the Pixel 10’s battery in as little as 30 minutes.\nBattery score: 8/10\nShould you buy the Google Pixel 10?\nThe Google Pixel 10 is an excellent flagship smartphone for its $799 price bracket. Comparable to the offerings from Samsung and Apple, the Pixel 10 excels in photography, while its AI tools are some of the best currently available with actual practical usefulness.\nI feel Magic Cue has a huge amount of potential, and it currently just scratches the surface of this on the Pixel 10 – but it’s a feature which will likely grow as you own the phone.\nI wouldn’t recommend upgrading if you’re currently using a flagship from 2024, as while there are some solid improvements on the Pixel 10, they don’t add up to a major leap forward.\nHowever, if you’re rocking an iPhone 15, Galaxy S23 or Pixel 8 and want to experience Android and Gemini AI as Google intended, the Pixel 10 is for you.\nIt gives you the Google experience you want, without the bloat or bulk of rival Androids.\nWhy not try…?\nNot sold on the Google Pixel 10, or simply want to know what phones you could buy instead of the Pixel 10? Here are three handsets I’d recommend you checking out before making your final purchasing decision.\nSamsung Galaxy S25\nThe Samsung Galaxy S25 made a splash at the start of 2025, arriving with ‘Galaxy AI’ features and the firm’s new Now Brief and Now Bar.\nYou get a beautiful OLED screen, excellent performance, capable cameras, premium design, and surprisingly good battery life – but then that’s pretty much what the Pixel 10 offers as well.\nWhat sets the S25 apart is you get all this in a package which weighs just 162g, that’s 38g lighter than the Pixel 10. The Galaxy S25 is thinner, shorter and narrower too, making it a joy to use one-handed, and easy to slip into the pocket of the skinniest of jeans.\nIf you prefer Samsung’s way of doing things – be that the compact size or the OneUI interface – the Galaxy S25 could be the better bet. Plus, with the One UI 8 update expected to land before the end of the year, it’s also in line for a refreshing feature boost.\n- Read our in-depth Samsung Galaxy S25 review\nGoogle Pixel 10 Pro\nThe Pixel 10 and Pixel 10 Pro look pretty much identical and, bar a few extra grams, they’re the same size and weight.\nSo what’s the difference? If you’re after all of Google’s latest features, the base Pixel 10 misses out on a few which have been blessed solely to its Pro siblings.\nFor the Pixel 10 Pro, peak screen brightness is increased to 3,300 nits (vs 3,000 on the Pixel 10), RAM is boosted to 16GB, the selfie camera is a powerful 42MP, and there are a range of upgrades to the rear camera setup, including the 100x Pro Res Zoom.\nPlus, for those needing more storage there are 512GB and 1TB options (the Pixel 10 tops out at 256GB), and if you’re feeling particularly flush the even pricier Pixel 10 Pro XL offers up a bigger 6.8-inch display, faster 25W wireless Qi2.2 charging and an improved bottom speaker.\n- Read our in-depth Google Pixel 10 Pro review\nNothing Phone 3\n- Read our in-depth Nothing Phone 3 review\nHow we test\nI used the Google Pixel 10 as my daily device for more than a week. This wasn’t a ‘second’ phone situation, if someone wanted to get in touch with me the Pixel 10 was making that possible.\nTesting included a weekend away at a wedding, travel into London, trips to the gym, dinners out, using Android Auto while driving, and plenty of on-screen time from scrolling Instagram and flipping through TikTok, to hours of gaming and plenty of streaming and audio playback.\nI spent time getting to grips with the new Camera Coach, tested the Super Res Zoom, and snapped pictures in a variety of locations, at different times of day and with varying levels of light.\nI mixed up usage to get a real sense of performance and battery life during lighter and heavier days. I even managed to continue my daily Duolingo and LinkedIn Zip streaks in among the testing."
    },
    {
      "url": "https://www.digitaltrends.com/phones/samsung-galaxy-s26-ultra-tipped-to-be-a-performance-beast/",
      "text": "What’s happened? The iPhone 17 might be days away, but the latest leak has us looking forward to next year, with rumors the Galaxy S26 Ultra could be an absolute performance beast.\n- The Samsung Galaxy S26 Ultra is tipped to run Qualcomm’s next generation flagship chipset, the Snapdragon 8 Elite Gen 5 (previously rumored as the 8 Elite 2).\n- According to reliable leaker Digital Chat Station, the 8 Elite Gen5 will be available in varying frequencies.\n- They claim the first phones – from the likes of Xiaomi and OnePlus – to pack the chip will see a clock speed of 4.61GHz, but there will be a more powerful version which Samsung will debut.\n- According to the leak, the Snapdragon 8 Elite Gen5 in the Galaxy S26 Ultra with run a faster clock speed, which apparently hits a staggering score of 4 million on the Antutu benchmark test.\nWhy it matters: If the Galaxy S26 Ultra can hit a score close to 4 million on Antutu, it will signal a major leap forward in smartphone performance.\n- The current highest-scoring phone on the Antutu benchmark site is the Red Magic 10 Pro, with a score of 2.67 million.\n- Meanwhile the Galaxy S25 Ultra finds itself in 15th place, with a score of 2,156,040.\n- With Snapdragon 8 Elite Gen 5 chipset reportedly hitting over 4 million, we’re looking at almost a doubling of performance for the S26 Ultra over its predecessor.\n- An increase of this magnitude should mean smoother multitasking, faster gaming, and better AI capabilities.\nOkay, so what’s next? Expect more details to leak as we approach the Galaxy S26 series launch, potentially in early 2026.\nIf the AnTuTu rumors hold – and for now, we need to take them with a sizable pinch of salt – Samsung could dominate benchmarks, but real-world tests will tell if it translates to noticeable gains over rivals.\nQualcomm is expected to announce its next flagship Snapdragon chip towards the end of September, when we might learn more about this rumored performance uplift.\nWant to stay ahead of the curve on the latest smartphone releases? Check out these articles for in-depth leaks and rumors about upcoming flagship devices:\n- The iPhone 17 Pro Max already sounds like a powerhouse\n- The iPhone 17 Air could be as powerful as the 17 Pro, but with a catch\n- The Galaxy S26 Ultra might not see much of a battery upgrade after all\nVia SamLover"
    }
  ],
  "argos_summary": "The Samsung Galaxy S25 FE, launched on September 4, 2025, offers a slimmer, lighter design with a larger screen-to-body ratio and the biggest battery yet for the FE line. Priced from £649 to £799 in the UK, it features a 6.7‑inch AMOLED display, a 120‑Hz refresh rate, and a triple‑camera setup with 12MP ultra‑wide, 50MP wide, and 8MP telephoto lenses. The phone runs on the Exynos 2800 chipset with 8GB of RAM, supports 45W wired charging, and includes Samsung’s AI features such as Instant Slow‑Mo and Generative Edit. While the camera performance is solid, the device lacks a magnetic wireless charging feature and offers limited color options. Overall, the S25 FE presents a competitive entry‑level flagship with notable battery and design improvements over its predecessor.",
  "argos_id": "98DEP17JS"
}