{
  "url": "https://www.cnet.com/home/roborocks-new-lineup-at-ifa-2025-includes-its-first-robot-lawnmowers-new-stick-vacuums-an-ultra-thin-robot-vacuum-and-more/",
  "authorsByline": "Ajay Kumar",
  "articleId": "8397857c10e147d48d964ea58744c0cf",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/edc3d498a1c8d0d37f486fdfa12a892fdbed84ad/hub/2025/09/04/71c2d0d2-bab2-4437-9377-1e41b7ed8ea6/lawnmowers.jpg?auto=webp&fit=crop&height=614&width=1092",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T22:00:00+00:00",
  "addDate": "2025-09-04T22:06:23.163545+00:00",
  "refreshDate": "2025-09-04T22:06:23.163547+00:00",
  "score": 1.0,
  "title": "Roborock’s New Lineup at IFA 2025 Includes Its First Robot Lawnmowers, an Ultra-Thin Robot Vacuum and More",
  "description": "Roborock unveils its first lineup of robot lawnmowers at IFA 2025, joining competitors like Eufy and Husqvarna in the market, along with a number of other new products.",
  "content": "Roborock is one of the better-known companies if you’re looking to buy a robot vacuum. Options range from the capable Qrevo Curv to the innovative Saros Z70, which comes with a mechanical arm and a handsome price to match. So it shouldn’t be a surprise to hear that Roborock is entering the robot lawn mower market, a category we test that’s dominated by companies like Husqvarna, Eufy, Sunseeker, and others.\n\nThere’s also a new set of stick vacuums, an ultra-thin robot vacuum and a self-santizing wet and dry vacuum. Here’s what’s new.\n\nThe company is introducing three new robot lawn mowers: the RockMow Z1, the RockMow S1 and the RockNeo Q1. The Z1 is the most advanced of the three models, with an all-wheel drive similar to an SUV that lets it power up slopes of up to 80% and clear obstacles of up to 6 centimeters. According to Roborock, each wheel has its own independent motor, and it has a suspension system to maintain stability over uneven terrain.\n\nIt uses RTK and VSLAM for navigation, making it better able to traverse shaded areas and narrow pathways. Impressively, the blade is capable of trimming up to 3 centimeters from walls, which is something we found that many robot lawn mowers struggle with in our testing. According to Roborock, it should be able to cover 5,000 square meters in 24 hours.\n\nThe S1 is the middle variant, designed for ease of use. It has AI smart mapping that should let users set up the boundary with minimal effort. Like the Z1, it has a 3cm edge cutting capability and can navigate passes as narrow as 0.7 meters. It’s not quite as capable on slopes, but it can handle up to 45% slopes and vertical obstacles up to 4cm. The mower should be able to cover 1,000 square meters in 24 hours.\n\nLast but not least is the RockNeo Q1. It has many of the same capabilities, including AI smart mapping and environmental perception, 3cm edge cutting, 45% slopes and 4cm obstacles. But in a unique twist, Roborock says it has a wildlife-friendly feature that avoids nighttime mowing to protect nocturnal animals, which is apparently a problem that can be dangerous for hedgehogs in particular.\n\nPricing and availability for these models aren’t public yet.\n\nRoborock is also developing an extensive series of cordless vacuums, the H60 and H60 Hub series. The H60 Hub consists of a stick vacuum and auto auto-emptying docking station, similar to ones we’ve seen on the Shark Clean & Empty and other cordless vacuums we’ve tested. In the case of the Hub Series, it works when you dock the vacuum, emptying the dust into a sealed dustbag in 10 seconds and recharging automatically. The H60 Ultra and H60 Pro come with a 3-liter dust bag that should last for 100 days, while the base Hub has a 2-liter dust bag that should last for 60 days.\n\nThere are several H60 models, but all of them come with a 90-degree bendable wand accessory to reach difficult spots. The Ultra and Pro docks also feature internal storage for different cleaner heads.\n\nThe non-Hub H60 models won’t include the all-in-one dock, but they should match the others in capabilities. Depending on the model, the prices in the US range from $300 to $600.\n\nRoborock is also continuing to release new wet and dry vacuums, with the F25 Ultra also breaking cover at IFA. The F25 Ultra is designed to sanitize as well as clean messes with the VaporFlow system. It uses steam that’s heated to 302 degrees Fahrenheit to remove bacteria and messes. Roborock says it’s been tested on wood flooring and causes minimal damage or wear, though it’s not something I think I’ll risk on my oak floors with cherry inlay.\n\nIt also uses WaveFlow, which heats water to 187 degrees Fahrenheit, to remove grease. Roborock says it can remove 100% of cooking oil. In terms of specs, it has 22,000 pascals of suction, 33 newtons of downward pressure and comes with dual brushless motors for each wheel. The vacuum will self-clean and dry when docked, using both steam and hot water to clean itself. According to Roborock, the automatic detergent dispenser should last for 30 days of cleaning with a single refill. For pricing, it’s expected to launch at $799 in the US.\n\nRobot vacuums are what Roborock is most famous for, and the company hasn’t disappointed at IFA with the Qrevo Curv 2 Pro. The name’s a mouthful, but what makes it interesting is how incredibly thin the robot vacuum is. It’s just 7.98 centimeters thick, making it one of the thinnest models in the company’s lineup that still has a full lidar system. This should allow it to fit under low furniture much more easily than rivals.\n\nOther specs aren’t compromised. It comes with 25,000 pascals of suction, which is on the higher end for robot vacuums (the highest we’ve seen is 30,000Pa). It supports mopping in addition to vacuuming, with dual spinning mops that can do 12N of downward pressure. It'll also automatically detach the mopping pads from the carpet. The included dock allows for seven weeks of automatic dust emptying and cleaning.\n\nThe robot recognizes over 200 types of clutter, including cables and pets, and it supports the Matter protocol.\n\nAll this will cost Europeans around 1,299 euros, with US pricing and availability to be determined.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/home/kitchen-and-household/best-cordless-vacuum/",
    "https://www.cnet.com/home/yard-and-outdoors/best-robot-lawn-mowers/",
    "https://www.cnet.com/home/kitchen-and-household/i-used-this-robot-vacuum-with-mechical-arm-for-three-months-2600-hard-sell/",
    "https://www.cnet.com/home/kitchen-and-household/best-robot-vacuum/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Robot vacuums",
      "weight": 0.08934094
    },
    {
      "name": "robot vacuums",
      "weight": 0.08934094
    },
    {
      "name": "many robot lawn mowers",
      "weight": 0.07408795
    },
    {
      "name": "stick vacuums",
      "weight": 0.0718819
    },
    {
      "name": "cordless vacuums",
      "weight": 0.07180451
    },
    {
      "name": "several H60 models",
      "weight": 0.06565527
    },
    {
      "name": "non-Hub H60 models",
      "weight": 0.063574016
    },
    {
      "name": "Roborock",
      "weight": 0.062278032
    },
    {
      "name": "H60 Hub",
      "weight": 0.059054
    },
    {
      "name": "H60 Ultra",
      "weight": 0.05893736
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.927734375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8271484375
    }
  ],
  "sentiment": {
    "positive": 0.45365995,
    "negative": 0.07090855,
    "neutral": 0.47543153
  },
  "summary": "Roborock has introduced its first robot lawnmowers at IFA 2025, with the RockMow Z1, the RockNeo Q1, and the S1. The Z1 has an all-wheel drive capable of powering up slopes of up to 80% and clearing obstacles up to 6 centimeters. The S1 uses RTK and VSLAM for navigation, making it better able to traverse shaded areas and narrow pathways. The RockNeos Q1 also has a wildlife-friendly feature that avoids nighttime mowing to protect nocturnal animals. Roborock is also developing a series of cordless vacuums, the H60 and H60 Hub series. The H60 series includes a stick vacuum and auto auto-emptying docking station, similar to ones on Shark Clean & Empty. The F25 Ultra is designed to sanize and remove messes with its steam cleaning system, which can remove bacteria and remove grease. The company also plans to release new wet and dry vacuoms.",
  "shortSummary": "Roborock’s new line-up includes advanced robot lawnmowers, innovative stick vacuums, and even a self-santizing wet and dry vacuum.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ad6642329d604bc383baddc9a31c9b4d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/home/kitchen-and-household/best-robot-vacuum/",
      "text": "Cleaning can be a chore, and although a regular vacuum cleaner helps, a good robot vacuum is a game changer. Although it's not the most affordable option when compared with a cordless vacuum, it's quickly becoming a popular option. CNET's tariff survey found that 64% of respondents feel pressured to buy more expensive tech products, which can sometimes mean getting the latest upgrades like robotic arms that can move toys and debris, scoot up small obstacles and untangle themselves.\nOur Picks\nVACUUM DEALS OF THE WEEK\n- $930 (save $570)\n- $199 (save $151)\n- $298 (save $302)\n- $155 (save $125)\n- $800 (save $500)\nIn the current tariff environment, you have to spend more to get home appliances, so we're always looking for good budget picks and ways to save money on the more premium models. To pick the best robot vacuum machines, we performed hands-on lab testing on over 70 models, thoroughly evaluating each on its mopping and carpet performance, how well they avoided obstacles (including pet messes), docking stations, sensors, battery life, reliability and the overall value. Here are our top 10 favorites.\nWhat is the best overall robot vacuum?\nThe Ecovacs Deebot T30S Combo remains in our top spot on the best robot vacuums list, despite stiffening competition. Honorable mention also goes to the Yeedi M12 Pro Plus, one of the best robot vacuum and mop combos we've tested for hardwood floors and a great value -- on sale or not.\nWe loved the Ecovacs Deebot T30S Comboself-emptying dustbin, mop function, efficient navigation and cost-to-value ratio. You can choose between the all-in-one combo, which includes a stick vacuum that also self-empties, or just the robot vacuum. It has a new competitor in the Eufy E20 3-in-1, which offers a robot vacuum, stick vacuum and handheld vacuum in one unit. Still, it lacks mopping capability and doesn't have the same level of cleaning performance.\nBest 10 robot vacuums of 2025\nPros\n- Self-emptying robot vac and stick vac in one\n- Excellent performance on hardwood (85% sand pickup)\n- Pet hair doesn't get tangled on the brush\n- Supports mopping\nCons\n- Pricey at $1,200\n- Not the strongest carpet performance we've seen at 65% average pickup\nBest for:\nEcovacs Deebot T30S Combo may look like a gimmick, adding a cordless stick vac to the Omni Station. Our lab testing shows that this is not the case. Instead, the Deebot T30S is so good as a robot vacuum and stick vacuum that it has become our top recommendation. It's a great option for people who want a robot vacuum and stick vacuum in one unit without compromising performance. It offers strong performance on both hardwood and carpet, supports mopping and has a self-emptying base station.\nWhy we recommend it:\nDuring testing in our lab, the T30S Combo picked up more than 65% of the sand on the carpet (64.44% from low-pile and 66.67% from midpile). Hardwood was even better, with 85% of sand pickup on the hardwood. It does a fantastic job getting debris off the floor; it’s also great for pet hair with the ZeroTangle brush system, which uses a V-shaped roller and Dual Comb Teeth to physically scrape hair from the brush and direct it to the dust bin. In our testing, it did a great job of tackling pet hair.\nThe stick vac accessory has many attachments you need to help clean any mess. It’s great to have a stick vac with your robot vacuum and what helps the system stand out is that the Omni Station empties and cleans the robot vacuum and the stick vac.\nThe Deebot T30S Combo offers a dual-spinning mop brush system to help keep your hard floors clean. When the vacuum detects the carpet, the mop rises to avoid touching the fibers. When mopping, the brush can swing out to reach the edge of the wall.\nWho shouldn't get it:\nIf you're price sensitive, at $1,200 it's not the cheapest option, but it's less than newer releases from Dreame and Roborock. If you think about it, you're also getting a cordless stick vacuum and robot vacuum and mop in one device.If you can find it on sale, I wouldn't hesitate.\nBest value robot vacuum\nEufy 3-in-1 E20\nPros\n- Very easy to use\n- Flexible and customizable for your cleaning needs with multiple attachments\n- Strong vacuum performance on hardwood with 72% pickup\n- Great value at $549 full price and often on sale\nCons\n- No mopping functionality\n- Could be better on carpet, scores under 50% on low-pile and mid-pile\nBest for:\nThe Eufy E20 3-in-1 robot vacuum is one of the most distinct robovacs we've tested. It's similar to our best overall pick, the Ecovacs Deebot T30S Combo, which comes with a detachable and very capable stick vacuum in addition to its vacuuming and mopping robovac. The E20 doesn't have mopping capabilities, but it's still a very capable and easy-to-use robot vacuum and cordless vacuum. We like it for the total flexibility it offers by giving you a robovac, handheld and stick vac in one unit with a solid performance on different floor types.\nWhy we recommend it:\n\"This is my favorite robot vacuum,\" said our lab tech, Schylar Breitenstein, who spent hours testing the Eufy E20 both in the lab and at home. She praised its ease of use and how the portable vacuum fits into the robot vacuum's body for space savings. She also pointed to the numerous attachments included to customize the E20 for different cleaning needs.\nIn terms of performance, the E20 did quite well in our sand pickup test on a hardwood floor, removing 72% of sand. It struggled a bit more with carpet, falling shy of the 50% we consider a good score at 41% for low- and midpile carpet. Navigation was a mixed bag. Our light path test shows that it cleaned the test room in a methodical fashion, especially focusing on getting the corners first. However, it notably missed spots when navigating around the multi-legged table and would have benefited from a tighter turn. It handled pet hair well on hardwood floors but missed some clumps on the carpet.\nHowever, what earns the E20 a place on our list is the sheer value it offers. It's $549 at full price, but as of this writing, it's on sale for $350. For the price, you get a robot vacuum with a self-emptying dock, a stick vacuum, and a handheld vacuum all in one, where normally you'd need to buy them separately. Its closest competitor with the same features, the Deebot T30S Combo, will cost you more than double this price, giving the E20 tremendous value.\nWho shouldn't get it:\nIf you have a lot of carpeting at home, the E20 didn't do the best, scoring 41% for low- and midpile carpet. For a robot vacuum that can tackle carpet and hardwood equally well, we still like our best overall, the Ecovacs Deebot T30S Combo for its stronger scores on both hardwood and carpet, as well as the ability to serve as both a cordless vacuum and robot vacuum.\nPros\n- Excellent performance on hardwood (96.5%) and strong midpile carpet performance (64%)\n- Very reasonable price\n- Great for pet hair\n- Good navigation around obstacles\n- Includes self-emptying dock and mopping capability\nCons\n- Low-pile carpet performance could be better at 54.6%\n- Some user complaints about the app and setup\nBest for:\nThe Yeedi M12 Pro Plus offers the best bang for the buck among the robot vacuums we've tested. It's specifically great for those who want vacuuming and mopping functionality and have a lot of hardwood floors. It's also really good at tackling pet hair. It also includes a docking station to charge, self-empty and supports mopping.\nWhy we recommend it:\nYeedi may not be a brand you've heard of, but it's actually a sister company of Ecovacs, which has earned a number of picks on our list over the years. The Yeedi M12 Pro Plus is a very capable robot vacuum and mop that comes with a docking station and very impressive performance on hardwood floors. It scored an impressive 96.5% sand removal from hardwood floors, even higher than Deebot T30S Combo (85%). In fact, this is the highest score on hardwood of any robot vacuum we've tested. It also managed 54.6% from low-pile carpet and 64% from midpile carpet.\nAccording to our light path test, navigation was also particularly impressive. The robot kept a very tight path around our complicated table setup, hit the corners well, and missed very few spots. Notably, it also supports multi-level mopping, which is a nice feature you don't always get on non-flagship vacuums. Pet hair also proved not to be a problem, with the M12 Pro Plus picking up nearly all the pet hair from hardwood and carpet.\nThe base station and robot vacuum are both loaded with features. The dock self-empties and includes a water tank to refill during mopping. It also has built-in hot air drying to sanitize the mopping pad between cleanings. And speaking of the mop, like many new robot vacuums, the M12 Pro Plus will lift up its mopping pad if it encounters carpet. The mopping pad is even pressurized, giving you a bit more elbow grease when cleaning.\nThe Yeedi M12 Pro Plus costs $900 at full price, which puts it on par with the Shark PowerDetect NeverTouch Pro, but it's currently priced at $380 on Yeedi and Amazon, making it quite the steal for the performance.\nWho shouldn't get it:\nThe M12 Pro Plus doesn't have many shortfalls, but low-pile carpet performance is on the lower side compared to some top-tier competitors like the T30S Combo. If you need stronger carpet performance, we're partial to the Ecovacs Deebot X9 Pro Omni, which is still being tested in the lab, but delivered impressive carpet pickup of more than 70% on both types of carpet. Some people have also complained about the confusing app, though that tends to be a pretty common problem in robot vacuums.\nPros\n- Excellent performance on hardwood floors with 96% sand pickup\n- Good carpet cleaning performance at above 50% pickup\n- Comes with self-emptying dock\n- Can cross obstacles up to 1.5 inches\nCons\n- Somewhat pricey without sales\n- Takes 21 minutes for a single room\nBest for:\nTogether with Roomba and Dyson, Shark is one of the best-known vacuum brands. In recent years, they've faced stiff competition from Dreame, Eufy, Eureka, Roborock and others, which are incorporating innovative features like threshold crossing, self-emptying docks and detangling brush rollers. The PowerDetect NeverTouch Pro is Shark's answer to this. It gives you good vacuuming and mopping with great navigation and the ability to cross thresholds up to 1.5 inches without having to spend as much as the Dreame X50 Ultra. If you love Shark as a brand, the PowerDetect Never Touch Pro is the robot you want.\nWhy we recommend it:\nIt comes with all the key features we've come to expect from a modern robot vacuum, including vacuuming and mopping functionality, a self-emptying dock, improved navigation with 3D mapping, 360-degree lidar and dirt detection sensors. In lab testing, it did great picking up sand from hardwood floors, removing nearly 96%, which is one of our highest scores on a robot vacuum. With carpet, we consider anything above 50% to be good; the Shark managed 54.5% from low-pile and 53% from midpile. Pet hair also proved not to be a challenge, with the PowerDetect removing most of it from hardwood and carpet.\nNavigation was also quite good, with the robot moving around our test room in 21 minutes. The cleaning time is a little higher than some other models, but it was comprehensive, hitting most of the edges and navigating under a multi-legged table. It missed only a few spots in its passes. Notably, similar to the Dreame X50 Ultra, the PowerDetect is able to lift itself up over thresholds and obstacles up to 1.5 inches, although it can't go as high as the 2.36 inches of the X50 Ultra. The mopping pads also lift up so they won't drag across the carpet, and they self-clean and dry.\nWho shouldn't get it:\nAt $999 at full price, it's one of the pricier robot vacuums on our list, but it's frequently on sale, making it a much more attractive option. If you can't find it on sale, we generally like the Yeedi M12 Pro Plus for offering better bang for the buck with the same capabilities.\nPros\n- Good price at $479 MSRP and $270 on sale\n- Solid sand removal on hardwood (82%) and above 50% on carpet\n- Small robot and base station won't take up too much space\n- Can mop and vacuum\n- Mechanical paddle helps optimize dustbin space\nCons\n- No auto refill water tank\n- No mopping settings or customization options in the app\nBest for:\nThe Roomba 205 DustCompactor Combo is our favorite new midprice robot vacuum at $470 full price and a relative newcomer from iRobot. It offers strong suction on both hard flooring and carpet, supports mopping, and has a unique mechanical paddle that compresses debris in the dustbin to let you keep 60 days' worth of dirt in the robot vacuum at a time.\nWhy we recommend it:\nThe 205 DustCompactor Combo gives you everything you need in a surprisingly small form factor. Our lab technician, Schylar Breitenstein, noted that the entire unit, including the docking station, is very small, making it a good option for people in apartments or small homes. In terms of performance, it did well in all of our tests, scoring 82% sand pickup from hard flooring, which makes it nearly as good as some of our top picks like the Deebot T30S Combo. On carpet, we consider anything above 50% to be good, and the 205 didn't disappoint, scoring 55% on mid-pile carpet and 59.5% on low-pile carpet.\nIt also mops, though strangely, the mopping settings are not available in the app. Despite that, it still worked perfectly, taking about 30 minutes to clean our test area and removing all stickiness from the floor after the first cleaning cycle.\nWho shouldn't get it:\nDespite having a base station for charging, the 205 DustCompactor does not self-empty or self-refill its water tank, so you'll still need to do that manually. If this is a deal breaker, many robot vacuums on our list have this feature, like the Dreame X40 and X50 Ultra, Yeedi M12 Pro Plus, and others, but they'll cost you significantly more.\nPros\n- Can cross thresholds and obstacles up to 2.36 inches\n- Good hardwood floor cleaning (62%)\n- Good obstacle recognition and avoidance\nCons\n- Struggles for sand pickup from low-pile and midpile carpet scoring under 50% for both\n- Very expensive at $1,600\nBest for:\nOne of the biggest problems I face using a robot vacuum in my apartment is the different height thresholds between rooms, which make it impossible for most robot vacuums to handle. The Dreame X50 Ultra is a robot vacuum designed to solve this problem. It can cross thresholds and obstacles up to 2.36 inches by deploying a pair of small legs to lever itself over obstacles. It offers solid vacuum performance on hardwood and can mop your floors, too.\nWhy we recommend it:\nIn our lab testing, it successfully climbed a stack of plywood up to 2.36 inches, although it faced some issues coming down from anything more than 1.5 inches. Dreame advises that it works best when there's a transition between the two vertical obstacles, such as a 1.65-inch threshold followed by a 0.7-inch threshold. It's still more capable of climbing obstacles than any other robot vacuum we've tested, earning it a place on our list.\nIn cleaning capabilities, it's no slouch either. In lab testing, it vacuumed a room in 23.6 minutes and removed 62% of sand from a hardwood floor. For reference, we consider anything above 50% to be good. Carpets proved more of a challenge, with 35% off low-pile and 44% off midpile.\nMopping functionality is also quite good. Our lab engineer took it to his home and tested the mopping and vacuuming on his 1,200-square-foot main floor. It mapped the main level in 11 minutes and cleaned everything in a little more than 2 hours. The base station also comes with two tanks, one for clean water and one for dirty water, along with another receiver for the cleaning solution.\nIn real-world testing, it worked great with pet hair, removing most, if not all, of the pet hair from hardwood and carpet. The tangle-free roller brush never got tangled in a household with a Great Pyrenees. Navigation was also quite good, with the X50 Ultra able to identify objects like shoes, socks, tennis balls, electrical cords and other items it might get stuck on. It also recognized and worked around pets.\nWho shouldn't get it:\nThe strong navigation abilities and good suction of pet hair earn it our recommendation. However, at $1,699 at full price, it is one of the most expensive robot vacuums you can buy, so we only recommend it if you truly have numerous thresholds and challenging transition strips in your home. For a robot vacuum that offers this capability at a lower price, the Shark PowerDetect Never Touch Pro can manage thresholds up to 1.5 inches.\nPros\n- Picked up 100% of sand from hardwood during pickup test\n- Strong carpet pickup at 61.9% low-pile and 60% from mid-pile\n- Motorized mopping\n- Good at identifying carpeted versus hardwood areas\nCons\n- No water tank for mopping\n- Somewhat outdated navigation compared with lidar on newer robot vacuums\nBest for:\nThe Roomba J7 Plus is a very capable and reasonably price robot vacuum, but it lacks mopping functionality. Enter the Roomba Combo J7 Plus, which adds mopping to its skillset. Rather than just slapping a mopping pad onto the bottom, iRobot designed a motorized mopping pad with arms that lift it out from the bottom of the cleaner and relocate it to the top whenever it detects it's traveling over carpets. It offers strong hardwood scores, with an impressive 100% pickup, good carpet scores at 61.9% on low-pile and nearly 60% on midpile.\nWhy we recommend it:\nIt's a capable vacuum, and it did great at tackling all three flooring types (hardwood, low-pile carpet and midpile carpet) we tested. However, it faces stiffer competition these days with new combo robot vacuums that incorporate water tanks into their base stations and come with features like self-detangling rollers and hot air drying. Navigation also leaves something to be desired compared with lidar-based cleaners from names like Dreame, Neato and Roborock.\nOur lab tech took the Roomba Combo J7 Plus home, where they have a mix of carpets and hardwood floors. It did a great job of identifying carpeted areas during its initial mapping run. We never caught it vacuuming those carpeted areas without lifting the mop up and out of the way first. It's just a better, more high-end approach to automated mopping and one you won't need to think about quite as much.\nDespite some downsides, the Combo J7 Plus is typically priced at $589 these days and offers strong overall cleaning performance. As a result, it's our pick for the best Roomba robovac you can get.\nWho shouldn't get it:\nDespite strong performance scores, the Combo J7 Plus is showing its age in the navigation tech. It lacks lidar and more advanced sensors, so you're likely to get better, more comprehensive coverage with some of the newer models we recommend, like the Dreame X50 Ultra.\nBest budget pick\nEufy RoboVac 25C\nPros\n- Impressive hardwood performance at 78.9% sand pickup\n- Managed to score higher than 50% on both types of carpet\n- Budget-friendly at $115\nCons\n- No real navigation system\n- Very slow at cleaning, took 91 minutes for one room\nBest for:\nFor those on a very tight budget, the Eufy RoboVac 25C is one of the only robot vacuums available for around $100-150. Despite the cut-rate price, you get surprisingly good performance on hardwood floors and solid carpet pickup performance.\nWhy we recommend it:\nYou might not expect sufficient cleaning power from a budget-priced robot vacuum, but that's precisely what the Anker Eufy RoboVac 25C delivers. For instance, its ability to scour sand from hardwood floors (78.9%) wasn't too far below that of our top midrange pick. It's a decent performer on low- and midpile carpets as well, sucking up averages of 54% and 52% of sand from them, respectively.\nThe current asking price is just $150 at Walmart, although stock is dwindling at other retailers.\nWho shouldn't get it:\nHow did Anker cut down on costs here, anyway? The answer is navigation. Instead of relying on cameras or lasers to map out its environment, the machine bumps around the floor like a slow-motion ping-pong ball, changing direction when it encounters an object or obstacle. As a result, it took an excessive 91 minutes to finish its cleaning cycle in our test room, so don't expect it to cover your house in anything close to an efficient fashion. If you don't like this trade-off.\nPros\n- Good vacuuming on hardwood\n- Very low profile and fits under pretty much everything\n- Quiet operation\n- Works well with pets\n- The chassis lift prevents it from getting stuck most of the time\nCons\n- Dust and water tank are too small\n- Mopping performance isn't great\n- Obstacle avoidance needs some improvement\n- Expensive at $2,600 at full price\n- Robot arm is neat, but only useful in limited circumstances\nBest for:\nIf money is no object and you want a robot vacuum that's capable of crossing thresholds and obstacles like the Dreame X50 Ultra, with the added benefit of a robotic arm to help you sort items, the Saros Z70 is for you. It offers decent vacuum performance, mopping capabilities, and comes with a self-emptying and auto-refilling base station. It's certainly the most unique robot vacuum I've ever used and one of the few that worked well in my challenging apartment that has multiple large thresholds between rooms and lots of clutter caused by three cats.\nWhy we recommend it:\nThe Saros Z70's main selling point is the mechanical arm, which can pick up and sort small objects like crumpled papers, napkins, slippers, and shoes. It's neat seeing the arm automatically emerge from the robot vacuum's body to do some pickup. It's fairly easy to designate a sorting zone in the app and the arm will usually put things where it's told to, but to be frank, the arm is hit and miss. It's capable of recognizing the objects it's trained for, but things like pet toys it usually wasn't able to pick up, though that's something Roborock is working on and that potential makes it a robot vacuum worth watching.\n\"The arm is a neat feature to watch, but I personally don't find it very useful,\" said Jared Hannah, senior technical project manager at our Louisville testing lab who was using the Saros Z70 at the same time as me. \" I feel like if the robot is smart enough to avoid obstacles such as shoes and socks, I don't need it to try and pick them up and move them. As long as the robot doesn't get stuck on anything during its cleaning cycle, that's good enough for me.\"\nIn other capabilities, the Saros Z70 isn't too shabby. It has great sand pickup on hardwood floors, scoring 82.5% sand pickup, just short of our best overall, the T30S XCombo. On mid-pile carpet, it does better than the Dreame X50 Ultra, at 52%. On low-pile, it's at 51%, which is pretty solid and not too far off the Shark Power Detect NeverTouch Pro. It also has key functionality we expect from a robot vacuum, including a self-emptying and self-refilling docking station and advanced navigation.\nI was also personally impressed by the mapping. After an initial quick scan, the robot did a great job of generating a layout of my apartment, identifying flooring types, key pieces of furniture, pet areas and cords. Tagging things manually was also fairly straightforward, though if I have one gripe, it's that the app is a bit overwhelming in terms of settings and customization options.\nFor me, the AdaptLift chassis was the real lifesaver. Like the Dreame X50 Ultra, it can deploy a pair of legs to lever itself over obstacles. It's one of the few robot vacuums that have been able to cross the two-inch thresholds in my apartment.\nWho shouldn't get it:\nPrice is obviously the sticking point here. At $2,600, it's the single most expensive robot vacuum on this list and it's possible to get superior cleaning performance for a fraction of what you'll pay for the Z70. If the lift system is something that's important to you, you can get a similar feature from the Dreame X50 Ultra for about half the price. The dustbin and water tank are also on the small side due to all the space taken up by the arm, so that's another thing to consider.\nPros\n- Excellent hardwood pickup at 95%\n- Strong low-pile (90%) and mid-pile (86%) carpet pickup\n- Includes self-emptying docking station\n- Supports mopping\n- Good obstacle recognition\nCons\n- Still expensive at full price despite being older generation\n- Superseded by newer model, the X50 Ultra\nBest for:\nNot so long ago, the Dreame X40 Ultra was our splurge choice. Priced at $1,500, it was one of the most expensive robot vacuums we recommended for its excellent obstacle recognition and ability to clean multiple floor types. However, it's been replaced by a successor, the Dreame X50 Ultra, which is capable of overcoming vertical obstacles. That means the X40 Ultra is now often available for significantly less (currently $700 on sale), making it a much better deal, taking into account its excellent performance across flooring types.\nWhy we recommend it:\nThe X40 Ultra scored some of the highest sand pickup scores of any robot vacuum, with 95% sand pickup from hardwood and 90% from low-pile carpet and 86% from mid-pile.These are some of the highest scores of any robot vacuum we've tested on these flooring types. It even outstrips our best overall, the T30S Combo.\nDespite being a generation older than the X50 Ultra, it still has most of the key features you want in a higher-end robot vacuum, including an all-in-one base station that can self-empty and auto-refill, 3D structured light navigation, advanced obstacle recognition, a swing arm for edge cleaning, multi-level mapping and hot water mopping.\nWho shouldn't get it:\nThe X40 Ultra is a great robot vacuum, but it's an older generation model, so availability may start to dwindle over time. For now, though, it's an excellent choice as long as it remains on sale for around $700 to $800. If the price rises back to full price, then there are better options available, including the versatile T30S Combo and relatively affordable Yeedi M12 Pro Plus.\nRecent updates\n- April 2025: We added new tested robot vacuum and mop recommendations to the list: the Yeedi C12 Plus, Dreame X50 Ultra, Eufy 3-in-1 E20, Shark PowerDetect NeverTouch Pro and Yeedi M12 Pro Plus. We also updated our testing procedures with our latest guidelines. Specifically, we eliminated our test for black rice because every robot vacuum was hitting nearly 100%. Instead, we've re-weighted our scoring using just sand on three different test surfaces. Finally, we updated the list of other robot vacuums we've tested and are currently testing.\n- June 2025: We reworked the product entries of all the robot vacuums we recommend to provide additional guidance on why we recommend them and who shouldn't buy them. We also added other robot vacuums we tested and some new infographics that compare robot vacuums.\n- July 2025: We added the iRobot Roomba 205 DustCompactor Combo as our new pick under $500, the Roborock Saros Z70 as the best splurge, and the Dreame X40 as the most consistent. We also updated our other robot vacuums we tested with new products and results.\n- August 2025: Added new test results for the Deebot X9 Pro Omni and T80 Omni. Added an explanation of how we test average runtime.\nFactors to consider when choosing a robot vacuum\nBudget\nBefore you do anything else, make sure you're clear on what you want to spend on your new vacuum. Robot vacuum models can cost anywhere from $200 to nearly $2,000, so it's important to set a budget to prevent overspending. We recommend deciding on what features (self-emptying bins, built-in mopping capabilities and advanced AI image recognition for elite-level obstacle avoidance) fit your needs and researching what your budget can get you. That way you know what you're looking for and can ensure you're getting the best value.\nNavigation and obstacle detection\nSure, many robot vacuum models have sensors to navigate around your home or apartment but how effectively do the sensors perform? The ability of a robot vac to detect objects in its path can mean the difference between returning home to a clean house and a situation where the robot is trapped on cords or an area rug.\nCertain models like the Dreame L40 and Shark PowerDetect NeverTouch Pro have powerful obstacle detection capabilities and navigate your home with efficiency. Many new and upcoming robovacs also incorporate AI object recognition, allowing them to recognize objects intelligently and learn about new objects over time. This is true of the Dreame X50 Ultra and Roborock Saros Z70 and Ecovacs T50 Pro Omni, among others.\nPets\nIs there anything worse than your vacuum roller brush getting all tangled up and clogged by a heap of pet hair? Luckily, many manufacturers make robot vacuums that are suited for cleaning up after pets. Models like the Dreame X50 Ultra and the Yeedi M12 Plus Pro are adept at sucking up pet hair on carpet and hardwood flooring as well as detecting (and avoiding) pet waste. Several of the models on this list have high-efficiency filters to help eliminate allergens that may come from pet hair and dander to help with allergies. One of the best new innovations is self-detangling brush rollers that are designed to avoid getting clogged by pet hair.\nHow we test robot vacuums\nEach robot vacuum we consider for recommendation gets put through its paces in our test lab in Louisville, Kentucky. In addition to test floors where we run our controlled pickup tests, we monitor each robot vacuum in a special test room filled with mock furniture to gauge how well it navigates around common obstacles. Past that, we check each robot vacuum's ability to gobble up pet hair without getting clogged or leaving loose strands behind, we consider mopping capabilities, and we check to see how well it navigates fake dog messes too.\nLet's dive a little deeper into the main considerations, starting with our performance tests.\nRobot vacuum pickup power\nWhen it comes to vacuuming prowess, we want to know how effective each robot is against common crumbs and other debris, and also how it fares against much smaller particles like dust, dirt and sand. To find out, we use sand as an analog for finer particles.\nIn each case, we scatter a controlled amount across three test floors: low-pile carpet, midpile carpet and hardwood floors. Low-pile carpet is shorter, less plush carpet with shorter fibers, so typically robot vacuums have an easier time picking up from it (though not always). Midpile is softer, more plush carpet with taller fibers. It tends to be more challenging for robot vacuums (though again, not always). Then, we take the robot vacuum, thoroughly empty its dust bin, send it to clean the affected area and finally measure the weight of whatever it managed to pick up. That gives us a pickup percentage of the full amount. From there, we repeat each run two more times and average the results.\nIn recent months, we eliminated our test for black rice on hardwood floors since, more or less, every robot vacuum we tested was scoring near 100%. We now use the sand test as our primary benchmark in evaluating cleaning performance. We consider anything 50% and above to be a good score for sand.\nRobot vacuum navigation skills\nYour robot vacuum will only clean your home as thoroughly as it's capable of navigating it. The ideal cleaner will make easy work of finding its way from room to room and automatically avoiding obstacles along the way, all of which makes for proper, low-maintenance automated cleaning.\nWe make sure to observe each robot vacuum as it cleans to get a good sense of how well it navigates but to get the best comparison from cleaner to cleaner, we take overhead long exposure shots of each one as it cleans our darkened test room, with glow sticks attached to the top of each one directly above the vacuum intake. The images that result show us light trails that reveal the robot's path as it navigates the room and cleans around our mock furniture.\nBelow is an example from the Ecovacs Deebot T30S, our best overall. It offers superb area coverage and it carried out navigation in a very organized and efficient manner. It got a 10 out of 10 in the navigation score, only taking an average of 15 minutes to complete a full-cleaning cycle.\nIn contrast, we have a robot vacuum with bad navigation, the Noesis Florio. It missed several spots in the room, and the light path test image contains a couple of brighter spots, potentially indicating the robot vacuum spent time spinning in place. What's notable is the very disorganized navigation pattern. All this resulted in poor navigation scores.\nIn large part, it comes down to the tech at play. Over the years, we've consistently noted that robot vacuums that use laser-guided lidar navigation tend to be very good at mapping their environment and finding their way around. Meanwhile, 3D-mapping cameras with object recognition smarts can give robot vacuums the extra ability to identify and adapt to obstacles in their path.\nAverage runtime\nTo measure robot vacuum runtime, we run the vacuum in our test room three times and take the average of the times it takes to complete its cleaning cycle. To be clear, we do not run the vacuum until it's drained, since unlike cordless vacuums, a robot vacuum will stop when it believes cleaning has been completed. Generally, we consider anything below 20 minutes to be a fast runtime.\nRobot vacuum mopping testing\nWe test mopping on all the robot vacuums that have the functionality. We run the mopping test at least two or three times and evaluate its ability to remove sticky messes from different types of flooring. We're currently in the process of formalizing our testing procedures in a quantifiable manner, but as of this writing our evaluation of mopping capabilities is anecdotal.\nOther robot vacuum products we've tested\nYou've seen our top picks and our test data. Now, here's a quick rundown of the rest of the robot vacuums we've tested in recent years, some of which are still worthy of consideration for some shoppers:\n3i\n- 3i S10 Ultra: We haven't reviewed many robot vacuums from 3i, but the company has some unique offerings like the S10 Ultra, which it claims is the first water recycling robot vacuum in the world. What that means is that it's capable of purifying and distilling its own wastewater extracted from the robot, as well as utilizing water vapor and condensation from the air to refill the robot's water tank with clean water. It's a fascinating implementation that can help cut down on how much water gets wasted on mopping. In terms of performance, the S10 Ultra is a capable robot vacuum, removing 85% of sand from hard flooring, 54% from low-pile carpet and almost 50% from mid-pile carpet. It has all the key features you'd expect from a higher-end robot vacuum, including advanced lidar navigation, dirt and liquid detection, a self-cleaning spinning roller mop and AI obstacle avoidance. Our lab technician, Schylar Breitenstein, noted that the app wasn't very user-friendly, but it does work at saving maps quickly, and the robot worked to execute tasks without being prompted. In our mopping test, we had some issues with the robot continuing to clean even after the app claimed cleaning was completed, and the floor was still somewhat sticky after our cleaning session. Despite the mopping and app issues, the overall suction performance still puts it among the higher tier of robot vacuums, but that also means it'll cost you $1,900 at full price, though it's currently on sale for $1,300. The relatively high price puts it close to our most expensive picks like the Dreame X50 Ultra and Roborock Saros Z70, which keeps it narrowly off our primary list since the water recycling is a relatively niche feature compared to the X50 Ultra's ability to overcome obstacles and the Z70's unique robotic arm that can sort items. However, if you can get it on sale, it's definitely worth considering if water usage is a big concern.\n- 3i P10 Ultra: The P10 Ultra is 3i's more traditional robot vacuum and mop offering and it comes in at a lower starting price, starting at $1,100 at full price and $700 on sale as of this writing. In terms of performance, it's just shy of the S10 Ultra, picking up 75% of sand from hard flooring, around 49% from low-pile carpet and 52% from mid-pile carpet. It also has many of the key features you'd expect, including an all-in-one base station that can self-empty and automatically dry the mop, 70 days of dust storage, lidar navigation and 3D scanning, an AI camera for obstacle avoidance that can recognize 100+ objects and messes and anti-tangle brushes. Our lab tech noted some issues, though. When opening the dustbin, all the debris fell out, and there was some significant lag when using the app. Perhaps most notably, on the mid-pile pet hair carpet test, we found hair wrapped around the bristle roller that had to be manually pulled out. It's a good option if you can get it for sale, offering suction performance similar to the Eufy E20 on hard flooring and carpet, though it lacks the flexibility of Eufy's unique 3-in-1 design.\nDreame\n- Dreametech DreameBot L10S Ultra: A souped-up Dreametech model that typically costs around $500, the DreameBot L10S Ultra adds a king-size, 3L self-emptying bin and self-filling water tanks that let the thing make multiple mopping runs before needing a refill. It was only a so-so performer in our cleaning tests, getting regularly outperformed by its smaller sibling, the top-rated DreameBot D10 Plus. That model doesn't have the self-filling water tank, but at several hundred dollars less than the L10S Ultra, it's a much better buy.\n- Dreame L40 Ultra: The L40 Ultra is a capable robot vacuum that performed well at picking up sand from hardwood floor (95%) as well as low-pile (63%) and midpile (62%) carpet. Navigation was also impressive, with tight corners and no missed spots. However, at $1,499 at full price, it's one of the more expensive robot vacuums on the market, so we don't recommend it unless you can find it on sale for closer to $1,000.\n- Dreametech DreameBot D10S Plus: A newer, slightly fancier version of our top-recommended DreameBot D10 Plus, the DreameBot D10S Plus (emphasis mine) added in a slightly larger bin that won't need to be emptied quite as much, a slight bump in suction power and a sleek, black-bodied design, all for about a hundred bucks more than the regular D10 Plus. It was a bit better on thin, low-pile carpet than that top-rated cleaner, but not quite as good on hardwood floors or midpile carpet, which was somewhat surprising. Unless the bigger bin is of particular interest, we think you're better off saving some money and sticking with the D10 Plus.\n- DreameBot D10 Plus (out of stock): This is the former overall pick, but the aging device is harder to find at retailers. It performs well on both carpets and hardwood floors with lidar navigation and a self-emptying dustbin. It's largely discontinued, but its successor, the Dreame D10 Plus Gen 2 is in stock for around $400 or less with a sale. Its features rival top brands like Roomba and Roborock at a significantly lower cost, making it a good option.\nEcovacs\n- Ecovacs Deebot X2 Omni: Retailing for $1,500 (though typically available for significantly less), this is the fanciest and most expensive Deebot we've danced within our test lab. It vacuums, mops, empties its own bin, refills its own water reservoir and features all of the rest of the bells and whistles that you'd expect from such a costly cleaner. It wasn't a leader in any of our tests, which is disappointing at this price, but it never faltered too badly, either. The pickup percentages on hardwood floors were all decent, and its performance was passable on the carpet too, with more than 50% of the sand sucked up in both our low- and midpile tests.\n- Ecovacs Deebot 500: The Deebot 500 is a basic but competent robot vacuum that offers app controls and voice compatibility with Alexa and Google. It wasn't a strong performer in our carpet tests and is priced too high to count as a budget pick.\n- Ecovacs Deebot Ozmo 950 (out of stock): The Ozmo 950 adds mopping functionality to the Deebot mix. As with other Deebots, the cleaning power didn't blow us away\n- Ecovacs Deebot N30 Omni: The N30 Omni is a capable robot vacuum and mop, but it doesn't stand out in performance. It scores decently in our sand removal test from hardwood (58.8%) and did OK at low-pile (46.5%) and midpile (50.4%). At $800, there are robovacs with better performance in this price range.\n- Ecovacs Deebot T50 Max Pro Omni: The T50 Max Pro Omni is another robot vacuum and mop combo targeted toward the higher end of the market. It certainly looks like it, with a premium-felling design and beautiful rose gold accents on the robot vacuum. Setup was It's loaded with features, including a self-emptying dock that can detangle its brushes, advanced navigation and obstacle avoidance, and auto-refill for mopping. Performance is generally good, averaging 61% for sand removal from our three test surfaces. It did the best on hardwood, removing 76.5% of sand and more than 50% from both types of carpet. However, navigation left something to be desired, with numerous missed spots in our testing room, especially when navigating our multi-legged table. Robot vacuums with these features are also increasingly common, and at the $999 price, competition is stiff, which keeps it from taking a spot on our list.\nEcovacs Deebot T80 Omni: The $1,000 T80 Omni is another capable robot vacuum and mop from Ecovacs that offers solid performance. It scores 62.75% in our sand pickup test on hardwood, a respectable score, though not as high as some others we've seen. It also did quite well on carpet, scoring 65.12% on low-pile and 64.34% on mid-pile. It took about 21.36 minutes on average to clean our test room, which is relatively standard for the robots we've tested. What keeps it off our main list is that while performance is solid and the T70 Omni is loaded with premium features, including all-in-one base station, a self-cleaning and drying mop, advanced navigation and threshold crossing, it's outperformed by Ecovacs' own T30S Combo. The\n- Ecovacs Deebot X9 Pro Omni: The $1,200 X9 Pro Omni is one of the best robot vacuums we've tested on carpet. It scored an impressive 72.87% on low-pile carpet and 75.19% on mid-pile carpet. That puts it among some of the top-tier robot vacuums we've tested in terms of carpet performance. It also does well on hardwood, scoring 70.59%, though we've seen higher scores on other models, including the more affordable Yeedi M12 Pro Plus. As you'd expect from a high-end robot vacuum, it comes with premium features, including advanced navigation, an all-in-one docking station, self-emptying, and a self-washing mop. The only thing that prevents it from earning a spot in our top ten is that the older Dreame X40 Ultra model is currently still in stock and scored better on carpet pickup, but if you want the latest and greatest bells and whistles, you won't go wrong with the X9 Pro Omni.\nEufy\n- Eufy 11S Max: The Eufy 11S Max is a robot vacuum that might have earned our budget pick if the performance held up. However, while this slim robovac does well at sucking up sand from hardwood (71%), it struggled with both low-pile (21%) and mid-pile (27%) carpet. It's $249 at full price, but it may become a more palatable option on sale ($140 as of this writing).\n- Eufy Omni S1 Pro: We were mixed on the S1 Pro. On one hand, our tester loved its fast and efficient cleaning, strong mopping, capable mapping and navigation, and useful self-sterilizing base. However, in lab testing, it didn't quite live up to expectations. While it did excellently on removing sand from hardwood floors, getting 81.5%, it fell short on carpet at 37.8% for low-pile and 38.5% for mid-pile.\n- Eufy Omni E28: The Eufy Omni E28 is another one of Eufy's unique 3-in-1 robot vacuums. Unlike the E20, which incorporated a cordless and handheld vacuum into the robot, the E28 is a portable deep cleaner built into the robot vacuum's base station. The detachable dual water tank (clean and dirty water) doubles as a deep cleaner, complete with a handle and hose attachment that lets you do spot cleaning on various soft surfaces, including carpets and fabric. \"At home testing the carpet cleaner, I loved the self-cleaning feature on the extractor,\" said Breitenstein. \"It, cleans very well. It does need to be plugged in to use, but with an extension cord it's very attainable to clean everywhere.\" In terms of performance for regular usage, the robot vacuum is no slouch, with 65% sand pickup from hard flooring. On carpet, it gets 46% from low-pile carpet and 45% from mid-pile, which isn't as high as we'd have liked for something designed to clean carpets specifically, but it's still reasonably solid. In terms of other capabilities, it has all the key features you'd expect, including self-washing and drying fro the mop, brushes that can avoid getting entangled by pet hair, the ability to clean corners and self-emptying and automatic refilling for the base station. At full price, the E28 will run you $1,300, but you can often get it on sale for less, which makes it a good option if you have a lot of carpeting at home, but need to save space by not having a dedicated carpet cleaner. \"For $999, I think this price is completely justified considering it comes with a carpet cleaning function,\" said Breitenstein, also noting that the dustbin is quite large compared with competitors.\nEureka\n- Eurkea E10S: The Eureka 10S is a very capable midrange robot vacuum and mop with lidar navigation. It picked up 64.5%% of sand from hardwood, 45.2% from low-pile carpet and 40.7% from midpile. Navigation was also generally quite good, with few missed spots. At $450, there are better-performing robot vacuums from the price, like the ones from Yeedi; however, if you can get the 10S on sale for closer to $300, it's a good option in the midrange.\n- Eureka J15 Pro Ultra: This high-end robot vacuum and mop from Eureka didn't live up to expectations. It underperformed on hardwood floors, scoring just 22% on sand pickup. It did alright on carpet, at 50% on low-pile and 49% on midpile, but for a vacuum that costs $1,000 at MSRP, this is a disappointing performance.\n- Eureka J20: The J20 is another flagship robot vacuum and mop from Eureka that didn't wow us. It did alright in picking up sand from hardwood, scoring 66.7%, but it feels notably short on carpet, at 24.4% for low-pile and 31.9% for midpile. Despite some nice features like the self-emptying dock, mop washing, hot air drying and 3D obstacle avoidance, you get get a better robot vacuum and mop for the $1,000 price.\niRobot\n- iRobot Roomba 694: This budget-priced Roomba does a decent job cleaning carpets and hardwood floors. In terms of performance, it's extremely close to the Eufy RoboVac 25C, so if that model isn't available, give this Roomba a look as an alternative budget pick.\n- iRobot Roomba i3 Plus: At $350 or less, this is an entry-level option among self-emptying Roombas, so if you just want something from iRobot that empties its own bin for as little cash as possible, give it a look. It was a middle-of-the-pack performer in all of our cleaning tests, never disappointing us but never really wowing us, either.\n- iRobot Roomba i7 Plus: This is another entry-level Roomba with self-emptying smarts, and you can currently get it for roughly $600 on Amazon. In our carpet tests, it wasn't able to suck up much more than 25% of sand, which suggests some limitations to its cleaning power.\n- iRobot Roomba J7 Plus: The Roomba J7 Plus is another Roomba vacuum that earned a place on our list for strong performance and AI-powered poop detection capabilities. However, this is a feature that's becoming increasingly common on newer models that are making impressive strides in obstacle detection and avoidance. It also lacks mopping capability, another expected feature and supplies appear to be dwindling outside of a few retailers.\n- iRobot Roomba S9 Plus: The Roomba S9 Plus used to be our pick for pet owners and plush carpets. It excelled in our old testing procedures, picking up 71% of sand on midpile carpet. However, it lacks mopping functionality, an increasingly common feature on robot vacuums across price ranges, and its availability is dwindling.\n- iRobot Roomba S10 Max Combo: The S10 Max Combo is iRobot's highest-end robot vacuum. It costs $1,400 at full price, though you can sometimes find it on sale for less than $1,000. As the name suggests, it can both vacuum and mop, comes with a self-emptying dock, and washes its mopping pad after every use. It had excellent hardwood performance in our testing, picking up 96.5% of sand, and better than average performance on carpet, with 67.5% on low-pile and 58.7% on midpile. Navigation was generally quite comprehensive, but it could have done tighter turns around some table legs, resulting in some missed spots. Unless you can get it on sale, there are other robot vacuums with better performance and similar features for the price.\nNarwal\n- Narwal Freo X Ultra: The Freo X Ultra is a premium robot vacuum and mop combo with all the bells and whistles you'd expect. It has lidar navigation, auto mop drying and washing, a self-emptying base station and a brush that's resistant to tangling with pet hair. Performance is decent, but doesn't particularly stand out. It does well on hardwood, removing nearly 76% of sand, but falls short on carpet, removing 41.5% from low-pile and 36.3% from midpile. For $900, there are better options from Shark, Ecovacs and others.\n- Narwal Freo Z10: The Z10 is another premium robot vacuum from Narwal priced at $1,099, but once again, performance left something to be desired. It does well on hard flooring, scoring 68.6% sand pickup from hardwood, but fared quite poorly on carpet, with just 18.6% on taller fiber carpet and 24.03% on shorter fiber carpet. Our lab tech also noted the cheap feeling replaceable insert bin inside the dustbin made of low-density plastic. People will need to periodically replace the insert bins, purchasing additional ones from Narwal, creating an added expense. We also had issues with setup, with the robot displaying an error and trying to have us replace a brand-new dustbin. Finally, it struggled to map and navigate, with the unit unable to position itself after circling our test room multiple times.\nNeato\n- Neato D9 (out of stock): Nearly identical in appearance to the D8 and the D10, the Neato D9 is a powerful vacuum, particularly on thick carpets, where it leads the way in our cleaning tests among all of the cleaners we've tested in the past two years. You won't get a self-emptying bin or a mop, but if you just want something to keep crumbs and pet hair out of your carpets, it's well worth a look as an alternative to the Roomba S9 Plus.\n- Neato D10: One of the latest D-shaped cleaners from Neato, the D10 promises powerful suction and room-by-room navigation smarts via the Neato app. It was a relatively strong performer in our tests, but we didn't see enough of an edge over the D8 or the D9 to justify the extra expense.\nRoborock\n- Roborock S5 Max (out of stock): An older model in Roborock's lineup, the S5 Max was a robot vacuum and mop combo. It did great on hardwood floors, picking up 85% of sand, but fared poorly on carpet, managing just 28% on low-pile and 41% on midpile.\n- Roborock S7 MaxV Ultra (out of stock): It's no longer available, but when we tested it, it proved to be a fairly capable robot vacuum, scoring 76.5% on hardwood, 58.9% on low-pile carpet and 56% on midpile. The S8 MaxV Ultra is its successor and a good option if you're keen on a Roborock.\n- Roborock S8 is a top midrange robot vacuum with excellent performance and intelligent navigation. It excels at cleaning various floor types, including those with a built-in mopping pad. While lacking a self-emptying bin, its strong performance makes it an excellent choice for homes with diverse flooring.\n- Roborock S8 MaxV Ultra is a premium robot vacuum with exceptional cleaning power and intelligent features. It effectively cleans various floor types with powerful suction and an advanced mopping system. Obstacle recognition and lidar navigation ensure efficient cleaning throughout your home.\n- Roborock Qrevo Curv: The Qrevo Curve is a fairly expensive robot vacuum and mop, costing $1,600 at full price, though it is currently on sale for $1,300. It has an attractive design with an egg-shaped charging station. It doesn't particularly stand out in performance, but it does great on hardwood, picking up 86% on sand. It falls short with carpet at 47.7% and 42.2%, respectively.\n- Roborock Saros 10: The Saros 10 is a very capable robot vacuum, though its $1,599 price makes it hard to recommend compared with more affordable options that offer similar performance. It did well in our testing, scoring 86%, picking up sand off hardwood floors, putting it on par with our best overall pick, the Ecovacs T30S Combo. With more plush midpile carpet, it did reasonably well at 49%, but fared lower than average with lower fiber carpet, at 35%. The dustbin was also quite small, but we were impressed by the navigation and the fact that the Saros 10 didn't require much mapping to clean. It also comes with all the premium bells and whistles, including mopping functionality, intelligent dirt detection, self-detangling main brush, hot water mopping, and dock self-cleaning. If you can get it closer to $1,000, it's a great option.\n- Roborock Saros 10R: It's hard to keep all of Roborock's lineup straight since both the 10 and 10R have similar features and capabilities, but they have different base stations and use different types of mops and brushes. With the 10R, you get another high-end robot vacuum that offers strong performance on all the flooring we tested it on. It scored 89% removing sand from hardwood and 64% from low-pile carpet. It also did great on mid-pile with 58% removed. Naturally, it can mop and vacuum, boasts an all-in-one dock that can self-empty, has tangle-avoiding brushes, and great obstacle detection and avoidance. The sticking point ends up being the price, like the Saros 10, it'll run you $1,600 at full price, but if you can get it on sale for closer to $1,000 it offers better performance on carpet than the Saros 10 and is on par with our best overall, the T30S Combo for hard flooring.\nSamsung\n- Samsung JetBot AI Plus: You already saw it fail our poop avoidance test, and that wasn't the only place where Samsung's JetBot AI Plus came up short, with pickup percentages that ranked near the bottom in all of our cleaning tests. At $650, this tech-rich robot vacuum just isn't worth it.\nShark\n- Shark PowerDetect 2-in-1: The PowerDetect is Shark's high-end model, priced between $600 and $1,000. It does an excellent job of picking up rice, and it's better than average (higher than 50%) when it comes to picking up sand from low- and midpile carpets. However, its hefty weight and middling carpet performance usually mean there are better options on the market at a lower price, including the Roomba Combo J7 Plus.\n- Shark IQ RV1001AE: A self-emptying cleaner, the Shark IQ RV1001AE is worth a look as an affordable option that empties its own bin. It gathered a respectable 84% of sand from hardwood floors in our cleaning tests but failed to pick up more than 35% of the stuff in any of our carpet tests, which isn't as strong as some of our top recommendations.\nYeedi\n- Yeedi Cube: An offshoot of EcoVacs, the Yeedi Cube is a self-emptying floor cleaner with a built-in mopping mode. The \"cube\" in question is the docking bay, which looks like a little robot vacuum garage, up into which it empties its bin. It was a middle-of-the-pack performer on hardwood floors, and rather lackluster on both of our test carpets, which makes this pick pretty passable.\n- Yeedi C12 Plus: The Yeedi C12 Plus is a solid midrange robot vacuum and mop that offers strong, across-the-board performance for a reasonable price. It was our former pick for best midpriced robot vacuum before being supplanted by the Roomba 205 DustCompactor Combo. It picked up 78.65% of sand from a hardwood floor and managed 45% from low-pile and 57% from midpile carpet. Pet hair was removed easily from hardwood floors, but it took more than one pass to get it off the carpet. On the plus side, the brushes didn't tangle. Navigation was generally quite good in our light path test, with the C12 Plus keeping tight corners around a complicated table setup and generally not missing any spots. It's also no slouch on features with support for multi-level mapping and the ability to climb thresholds up to 0.8 inches, similar to the Dreame X50 Ultra and Shark NeverTouch. It comes with an all-in-one docking station that supports a self-emptying dustbin that can last for seven weeks. It lacks an auto-refill water tank, though, so you'll need to refill the 220ml water tank on the robot directly. At $479, it offers similar functionality to more expensive robot vacuums like the T30S Combo and SharkPowerDetect at less than half the price. Currently, it's on sale for $270, making it one of the best bangs for the buck robot vacuums. While the C12 Plus can do mopping, it doesn't have an auto-refill water tank in its base station, so you'll need to do that manually. The dust canister is also bagless, which we typically don't like since dust gets everywhere when you empty it. For these features, we like Yeedi's higher-end model, the M12 Pro Plus.\n- Yeedi S14 Plus: The S14 Plus is Yeedi's newest, top-range robot vacuum and mop combo. It has a lot going for it, with strong performance on hardwood floors (82.4%) and very good performance on carpet (58% low-pile and 59.7% midpile). It's also loaded with features, an auto-empty and self-drying dock, a 3D sensor for navigation, and self-detangling brush rollers. However, at $1,400 at full price (currently $950 on sale), you can get even better performance from the Yeedi M12 Pro Plus, which is our recommended robot vacuum for both vacuuming and mop and hardwood floors. It's also less than half the price.\nOther brands we've tested\n- Electrolux Pure i9 (out of stock): This cleaner features a unique, triangular design, and it incorporates 3D-mapping cameras into the mix for smarter navigation. It was an underachiever in our cleaning tests, so we'd recommend shopping around.\n- Greenworks GRV-5011: This $658 laser-guided floor cleaner performs well on hardwood floors. Couple that with the built-in mopping functionality, and it might be worthy of consideration for homes with hard floors. Performance on low- and midpile carpet was less than stellar, though, averaging toward the bottom of the pack in both cases.\n- IonVac Smart Clean 2000: One of dozens of cheap, no-name robot vacuums available from Amazon and other online retailers, the IonVac Smart Clean 2000 was near-competent in our cleaning tests, but always just a little below average. Nothing about it stands out enough for us to recommend it.\n- Lynkbey M20 Pro: A newcomer to our tests, Lynkbey's flagship cleaner is a self-emptying, mop-wielding powerhouse that seeks to take on Roborock. It was a top-three finisher in our hardwood floor tests, and an above-average finisher on low- and midpile carpets, although I'd note that it couldn't quite suck up 50% of the sand in either test, which is a slight red flag for performance. Still, it's a likable upgrade pick, especially if you can catch it on sale for less than the full $1,150 asking price.\n- Lubluelu SL60D (out of stock): No longer available in the US, but still available in the EU, UK and Australia, the Lubluelu SL60D is a solid midrange or budget vacuum if you can get it for the $272 price or less. It scored well in our testing, with 77.8% sand pickup from hardwood and 55.3% from low-pile carpet. It didn't fare as well with midpile at 36.8%, but it also offers premium features including lidar navigation, mopping, voice control and a self-emptying dock.\n- Ultenic MC1: This robot vacuum is from a little-known brand, but it was our previous pick for midrange robotics. It did well on our old lab tests, picking up nearly 75% of sand. It also boasts features like a self-emptying dock and mopping system, which is impressive for a robot vacuum. However, it's currently only available on Ultenic's storefront and lacks suction power compared to newer models.\n- AirRobo P20: This robot vacuum and mop combo is one of the more affordable options we've tested. At $499 MSRP and frequent discounts and sales, you'll rarely get mopping and vacuuming functionality at this price. However, as a vacuum, it doesn't excel, removing just 48% of sand from hardwood floors and struggling on low-pile (22%) and midpile (18.4%) carpet.\n- Noesis Florio F10 Pro: With a name that sounds vaguely like a dental disease, the Noesis Florio was a strange robot vacuum and mop to test. It had a very odd navigation pattern, which made it inefficient for cleaning sand and pet hair. In fact, it got the worst results of any robot vacuum we've tested, removing just 7.8% of sand from hardwood, 3.1% from low-pile carpet and 11.2% from midpile carpet. We redid the testing six times to confirm this result. The dustbin was also very small, and we were unable to properly test navigation due to the current preventing our light path test. For $1,600 at full price, this robot vacuum is not worth the money, even at a discount.\n- Monsga MS1 Max: I was really interested in testing this robot vacuum as part of our search for a new budget or midrange pick. For $360 on sale and $520 at full price, it offers a lot of premium features, including mopping, lidar navigation, a self-emptying bagged base station, and voice control. However, the performance was nothing to write home about. It removed 46.7% of sand off hardwood floors, but just 11.4% off low-pile carpet and 23.7% off midpile. The below-average carpet performance keeps it from earning a spot on our list.\nKeeping your robot vacuum clean\nWe like to think that our robot vacuums are completely self-reliant and to some extent, that's increasingly true. Many robot vacuums have self-emptying docks, auto-refill water tanks and self-detangling brush rollers. However, hair can still get tangled around the brush and sensors can get dirty. Performing regular maintenance on your robot vacuum will continue to perform well for years to come.\nSome of the routine cleaning that needs done for your robot vacuum is daily, while other stuff can be done weekly or even monthly.\n- Daily: Emptying the bin, checking wheels for stuck debris.\n- Weekly: Cleaning brush rolls and wheels.\n- Monthly: Charging contacts and cliff sensors; removing and deep cleaning the brushes.\nWe have dedicated a complete breakdown of the different parts of your robot vacuum that will need some regular maintenance. Most of this work will take only a few minutes at most but will give you much more in return with a cleaner house.\nHowever, some of the newer robovacs reaching the market, such as those from Narwal, come with multi-function base stations that can automatically handle things like dust emptying and water tank refilling, letting it last up to 120 days before maintenance, so you can look forward to spending less time on these tasks in the future.\nRobot vacuum FAQs\nHow long do robot vacuums last?\nRobot vacuums are complex machines with more moving parts, electronics and software than ordinary vacuums. Still, with regular maintenance and replacement parts such as batteries, brushes and filters, these devices can last just as long as traditional vacuums. This should translate to multiple years of use.\nKeep in mind that manufacturers typically cover their robots with one-year limited warranties that include parts and labor. IRobot, Neato and Samsung are examples.\nHow well do robot vacuums work?\nHow well a robot vacuum cleans your home depends on many factors. Floors cluttered with obstacles like wires, charging cords, toys, shoes and clothing can stop robots in their tracks. The less overall clutter the better a robot will operate. Some robot vacuum models clean tile, wood flooring and different types of carpet better than others.\nCan robot vacuums climb stairs?\nYes and no, depending on your definition of stairs. Dreame's new X50 Ultra, which was demoed at CES and subsequently earned a place on this list during testing. It can handle \"stairs\" that are 2.36 inches (4.2 centimeters+1.4cm) tall or under and sliding door tracks up to 6 centimeters wide. So if you have thresholds that are different heights in your living space, such as between the living room and kitchen or bedroom and hallway, the X50 Ultra will cross these better than a standard, legless robovac, but it won't handle a full flight of stairs.\nCan a robot vacuum pick up after you?\nSurprisingly, the answer is yes. The Roborock Saros Z70, the recipient of our Best of CES Award, comes with a mechanical task arm that allows it to pick up and move objects it finds lying around the room. In the demo, we saw it pick up socks and drop them at a designated location. For the moment, it's able to detect 108 obstacles, and though the arm can lift fewer items, it'll have more support in future software updates.\nCan robovacs also mop?\nMany robovacs now have mopping features, including many on our best list, like the Deebot T30S Combo. Many newer robovacs also incorporate this feature, like the Eureka J15 Max Ultra, which can also use AI to detect liquid spills and untangle its own brushes. There's also Narwal's Flow Series the premium Freo Z10 all-in-one robovac and Freo Pro. They're loaded with features, including mopping, multi-function base stations, hot-air drying, advanced AI object recognition and more.\nWhat's the best robovac for pet hair?\nOur current top robot vacuum for pet hair is the iRobot Roomba S9 Plus. It excelled during our pet hair pickup tests, where we scatter clumps of pet hair donated by a groomers across the floor. It also does great at tackling thick carpets. Honoroable mention goes to the Roomba J7 Plus. It has loads of smart sensors to dodge pet messes, and it works great at picking up pet hair.\nWhat's the best robovac for hardwood floors?\nThe Roomba Combo J7 Plus is the best robot vacuum for hardwood floors, beating out the competition by picking up all the sand from a hardwood floor during testing. If price is no object, we also like the Dreame X40 Ultra -- it grabbed 95% of sand during testing.\nWhat's the best robovac for carpets?\nOur best overall, the Deebot T30S is also the best robot vacuum for carpets. It has tons of suction power and was able to pick up 65% of sand from carpet.\nShark vs. Roomba: Which robot vacuum is better?\nShark and iRobot (maker of the Roomba) are two top rivals in the robot vacuum market, and choosing between their products will ultimately come down to price. Shark robovacs tend to cost a bit less, but if you don't have a strict budget in mind for your robovac purchase, go with one of CNET's choices for best overall robovac, the Roomba Combo J7 Plus. For Shark, we like the full-featured Shark PowerDetect NeverTouch Pro for its good navigation and cleaning performance, though it's on the more expensive end. For a more detailed analysis of the two brands, CNET experts have put together a comprehensive comparison."
    },
    {
      "url": "https://www.cnet.com/home/yard-and-outdoors/best-robot-lawn-mowers/",
      "text": "A robot lawn mower can save you time and money compared with mowing your own lawn or using a lawn care service. I spent the past six weeks testing six different robot lawnmowers in my 3,000 square foot yard to find out if they are indeed worth the price. From navigation tech to cutting performance on wet grass, I evaluated every aspect of these automated yard assistants. I spoke with industry experts from Husqvarna (a robot lawn mower manufacturer) and Automatic about how to evaluate which robot lawn mowers are best. I ended up with two overall favorites, two that worked well and two that never worked right. Read on to find the perfect robot mower for your specific yard and needs.\nYARD AND OUTDOORS DEALS OF THE WEEK\n- $1,099 (save $500)\n- $389 (save $161)\n- $599 (save $151)\n- $500 (save $200)\n- $173 (save $58)\nWhat’s the best robot lawnmower?\nThe Segway Navimow earns the crown for the best robot lawn mowers we’ve tested. It’s small, fast and offers spiked wheels for easy driving. It was one of the easiest robot lawnmowers to set up and use, with a straightforward app and the ability to edit the map easily, allowing it to work with most yard sizes. Despite some issues with the camera system, it handled all the bread-and-butter tasks of robot mowing with consistent mowing performance and the ability to climb hills and navigate obstacles. It’s expensive, though, running $5,000 at full price.\nIf you want a cheaper option, the Eufy E15 is one of the few robot mowers that I got working out of the box within 20 minutes. It’ll cost you $1,800 at full price, and while it has the slimmest cutting radius and a simpler navigation system, it more than makes up for it with its performance and ease of use.\nThe 4 best robot lawnmowers\nPros\n- Easy setup and user-friendly app\n- Moves fast with spiked wheels\n- Excellent terrain navigation and the ability to free itself\n- Great battery life, did my entire lawn and my neighbors on a single charge with over 50% left\nCons\n- Camera system was easily fooled by dandelions and grass with small leaves\n- Cables aren't as long as you'll want\n- Expensive at $5,000\nBest for:\nThe Segway Navimow is the best robot lawnmower for people with large yards. It’s relatively easy to set up and covers a huge area on a single charge. This model is definitely for people with larger lawns. Using a mower like this in an urban setting might be overkill. The mower was also the easiest with an RTK beacon to set up and use, which is a nice bonus. An RTK (or Real-Time Kinematic) beacon is a device that corrects a mower's coordinates so it can get accuracy down to a centimeter.\nWhy we recommend it:\nThe Segway Navimow X390 is my favorite mower, by a slim margin over the much cheaper Eufy E15. The mower is small and fast with spiked wheels for easy driving. It smartly negotiates difficult terrain, which doesn't sound like much. But not only does it climb hills well, but when it gets stuck, it uses a variety of techniques to get back underway. You can really tell that Segway put a lot of thought into how the mower can free itself.\nThe app is easy to use and set up. Adding to and editing the map is very straightforward. The one hiccup I had from a software perspective was getting the mower to mow the area I wanted it to when I accidentally assigned it to the wrong space. Convincing the mower to do something else was tricky. The initial cut the Segway makes left tufts of grass uncut, which was not the best. A second trip around the lawn largely corrected things, but I was hoping for better results on the first pass.\nAll that being said, the Segway quickly became my favorite mower of the pack. Yes, this particular model is by far the most expensive in the list at $5,000 full price, but Navimow sent its biggest mower. There are smaller mowers in the X series that should perform as well. The software is intuitive, the mower itself is attractive and I ran into the fewest issues when running it. It's an easy recommendation.\nWho shouldn’t get it:\nIf there's one large flaw with this mower it's the camera system. My part of Illinois has a type of grass that can grow seeds and small leaves at the top of it (if it gets long enough). Dandelions are also problematic. The issue I ran into was the mower refused to mow those things half the time. I imagine the camera system might have mistaken them for plant beds, which is fair, but I don't think it's asking too much for my lawn mower to recognize, you know, lawn. If you have a smaller yard, you may also be better served by the Eufy E15 or Sunseeker X3 Plus.\nBest ease of use\nEufy E15\nPros\n- No RTK beacon allows for an easy setup\n- Smart software that’s easy to use\n- Quick and effortless cutting with good efficiency\n- Affordable at under $2,000\nCons\n- Can’t set a no-go zone without a physical barrier\n- Has some trouble with obstacles\n- Doesn't work at night due to lack of visual data\nBest for:\nThis mower is good for people who don't want to mess with an RTK beacon or satellite coverage. The mower relies on vision sensors to determine its position, rather than an RTK beacon, which means it's dead simple to set up. The mower is also very efficient, though it has the slimmest cutting radius of all the mowers (tied with the Sunseeker below), so it will take longer to complete a larger yard. The biggest challenge with this mower is if you don't have any kind of barrier between your property and your neighbor's, like a sidewalk, fence, or driveway, the mower may inadvertently wander off your property, so keep that in mind. Normally priced $1,700 (currently $1,500 on sale), it's also affordable.\nWhy we recommend it:\nIt's easy to love the Eufy E15 mower because, within 20 minutes of taking it out of the box, it was already mapping out my lawn. Less than an hour later, it was mowing, and it finished its first pass almost flawlessly. When it had trouble, the app quickly let me know, and it even suggested setting up no-go zones on the fly wherever it ran into trouble. The cutting was quick and effortless, with good results. Cutting efficiency is excellent -- this mower didn't leave anything untouched.\nThe reason this mower is so simple is that it doesn't use an RTK beacon to correct its GPS coordinates. The Eufy E15 has a standard GPS receiver (with accuracy down to a few feet) and supplements that with visual data to determine its position. That means two things. First, it cannot run at night because there is no visual data. Second, if there is no physical barrier between your property and your neighbors -- a fence, sidewalk and so on -- the mower may wander out of its zone\nThe mower works more like a robot vacuum -- you do not set up a barrier or a perimeter. You just set the robot loose and let it wander around and see what's what. Once it's done, it mows. It's ridiculously simple and if you have barriers between your property and your neighbor's, this is the mower to buy. If not, it's probably possible to set up one large no-go zone to keep it from going where it shouldn't but with a neighbor as… colorful as mine, that was not a risk I was willing to take. So if you want something dead simple to set up and use, and your lawn meets the right requirements, this is the easy choice.\nWho shouldn’t get it:\nIf you have a big yard, the Eufy E15 isn’t going to be the best fit. It’s better suited for a small yard like mine (3,000 square feet). It’s also not a good option if being able to set a no-go zone to keep it out of your neighbor's property, since that’s not something it can do without a physical barrier to contain it. It also won’t work at night since it relies on visual data.\nPros\n- Small and adorable design\n- Easy to set up\n- Easy app navigation\n- Comparatively inexpensive at $1,600 full price\nCons\n- Small cutting path at 8 inches\n- Bump sensor rather than more advanced obstacle navigation\nBest for:\nThe Sunseeker X3 Plus is an adorable mower, like the Eufy E15, so it's not meant for larger lawns. The bump sensor can be a bonus for yards with a lot of obstacles, but it can be troublesome because of how low it sits to the ground. If you have thicker grass, that can get annoying quickly and leave sections uncut. If you have consistent grass coverage and no thicker patches, you'll probably be OK. This model is best for people with medium-sized lawns and especially those with no barriers at property lines.\nWhy we recommend it:\nThe Sunseeker X3 is an adorable little robot mower with an unusual configuration. While most robot mowers have drive wheels in the back and omnidirectional wheels in the front, Sunseeker goes the other way with drive wheels in the front. I find this provides a more stable platform for the mower overall, which is a nice add on. But this mower has one not insignificant flaw.\nLike most robot vacuums, this mower has a bump sensor in front. That's not a bad thing, but this bump sensor is very sensitive -- so much so that larger tufts of grass will trip it. This tends to leave portions of the lawn unmowed, which is, obviously, undesirable. The mower also has cameras in front, which makes the inclusion of a bump sensor a bit confounding.\nBeyond that, the mower performs well, and it's worth noting that robot mowers in general aren't meant for cutting long grass -- they're meant to maintain short grass. The bump sensor can still be tripped by shorter grass though. Sure, it's also tripped by things it should not try to mow, like brick borders and the like, but the bump sensor is so low to the ground it becomes maddening. This is even more of a problem during initial setup and even after a few turns around the lawn, so it doesn't quite make it as our favorite.\nWho shouldn’t get it:\nIf you have a big lawn, the Sunseeker X3 is another robot mower that won’t work for you. It works great on small lawns like mine that measure around 3,000 square feet. But for a bigger one, you’ll want the Segway Navimow X390. It also struggles with cutting longer grass due to the sensitive bump sensor.\nPros\n- Attractive looks\n- Widest cutting path at 9.4 inches\n- Versatile RTK beacon\nCons\n- Annoying boundary setup\n- No cameras\n- Poor obstacle avoidance\nBest for:\nIf there is a Rolls-Royce of mowers, it has to be the Husqvarna. I tested the Husqvarna 410 iQ mower, which is new from the brand. Husqvarna has been involved in robot mowers for a long time. It developed the first robot mower back in the mid-1990s, which is surprising on a number of different levels. The mower is the largest I tested that actually cut my grass (more on that later), but it's more for lawns with straight lines.\nWhy we recommend it:\nFrom a sheer looks perspective, the Husqvarna 410 iQ looks like a luxury vehicle in its lines and design. I love the way it looks. It dwarfs most of the other mowers I tested (with one notable exception). The control panel on the back is easy to use and intuitive, which is a good thing, because you'll be using it a lot. It seems like every time the mower runs into a hiccup, you have to press some combination of the start and stop buttons, and every time you do that, you need to reenter your PIN, which is only four numbers, but you have to enter that PIN often.\nOne notable error I often encountered was a \"Loop sensor problem,\" which only happened while the mower was on the charger but required me to re-enter my PIN every time. Husqvarna says this issue should be fixed in the next software update, so that's good news.\nThe other annoyance about this mower is how you set up zones. Most of the other mowers just require you to drive around the circumference of the area. Husqvarna requires individual waypoints to mark the boundaries. If you have a rectangular area, that's easy. If you have a curve however, you have to drive, waypoint, drive, waypoint, drive, waypoint -- you get the idea.\nAt $3,000 at full price, it's less expensive than our best overall, the Segway Navimow X390, but significantly more costly than either the Eufy E15 or Sunseeker X3 Plus.\nWho shouldn’t get it:\nThe Husqvarna mower doesn't have a camera system, relying instead on a radar module on the nose. I didn't find that radar module to be very helpful, though since the mower tried to run over my foot -- twice. I did indeed test this. Not to worry, all my little piggies are still there, but that a tense moment. The lack of a camera also caused the mower to pop a wheelie on a low brick wall I have around a garden, so it'd be fair to say it didn't handle obstacles well. If your lawn is curved or has obstacles that need to be avoided, you also want to look elsewhere.\nWhat we updated\nJune 2025: This best list is brand new with the Segway Navimow, Eufy E15, Sunseeker X3 Plus and the Husqvarna 410 iQ, tested through May and June 2025.\nRobot lawn mowers compared\n| Mower | Price | Maximum Yard Size | Cutting Width | Cutting Height Range | Navigation | Max Slope | Charge Time | Noise Level |\n|---|---|---|---|---|---|---|---|---|\n| Eufy E15 | 1,799.99 | .2 acre (800 sq m) | 8 in | 1-3 in | GPS + Camera | 18 degrees | 90-110 min | 56 db |\n| Segway Navimow X390 | 4,999 | 2.5 acre | 9.3 in | 2-4 in | EPOS (RTK) | 27 degrees | 100 min | 60 db |\n| Sunseeker X3 | 1,399.99 | .3 acre | 8 in | 1.6 - 3.2 in | RTK | 30 degree | 90 minutes | 59db |\n| Husqvarna 410 iQ | 2,999.99 | .5 acre | 9.4 in | 1-4 in | RTK | 27 degrees | n/a | n/a |\nOther robot lawn mowers we’ve tested\nThe following two mowers lived in my backyard for all six weeks of my testing time, but never managed to mow a blade of grass, for a variety of reasons. They have potential, which is why they're on this list, but they still have some things to work out.\nYarbo Lawn Mower\nThe Yarbo robot mower is an absolute clinic in overengineering. Every other mower on this list arrived at my house in a box that weighed between 40 and 60 pounds. Yarbo's mower arrived in six separate boxes, two of which weighed over 100 pounds each. There's a reason for all of this, and it comes back to Yarbo's mission. Yarbo built a modular system that has a core component and add-on modules for different functions. One is a snow blower, one is a leaf blower and the one I received is a lawnmower.\nThe \"core\" module, which is what drives the other components, has rubberized tank treads lights around the perimeter, and by itself weighs around over 100 pounds. The mower module weighs another 50 to 60 pounds. If you want to push around snow, you need a heavy-duty build -- I totally get that. But at the end of the day, according to Eric Dowd Golf and Mobile Solutions Expert (and no relation of mine, despite the last name) at Automated Outdoor Solutions, the Yarbo mower is a commercial unit. It's not really intended for residential use.\nThe reason I have it listed in this section is because I had an enormous amount of trouble getting a connection to satellites (this was something of a theme). First, I had trouble with the RTK beacon, but once that got resolved, the mower itself had trouble. I have a large tree in my backyard. I'm fairly sure I'm not the only person with a large tree in the backyard, so this is not ideal. I will continue to work with Yarbo to get things squared away.\nAirseekers Tron\nThe most oddly-named and oddly designed mower on this list, the Airseekers Tron will run you $2,099. Most of the mowers on this list have two drive wheels and two omnidirectional wheels, like what you'd find on an office chair. The Airseekers Tron on the other hand has two drive wheels and two powered wheels in the front as well. But the wheels in front are canted inward. Rollers on the wheels allow the Tron to be -- in theory -- more maneuverable. This all looks good on paper. However, there were some issues.\nFirst, the Airseekers Tron shipped with comically short cables for both the RTK beacon and the base station. By the time I assembled the beacon and ran the cable through the pipe that holds it up, there was about 4 feet of cable left. If you're attaching the cable to the base station (more on that in a moment) that means the mower and the beacon need to be in the same space. That may be OK, depending on your space, but really it's not OK.\nTo mitigate this, you can plug in the beacon separately, but that requires a separate cord and plug. Airseekers shipped me the unit with European plugs and an adapter for American plugs -- a not-waterproof adapter, besides. Airseekers assured me that when the device ships internationally, there will be appropriate plugs on all the cables for each region. Mine is an early unit.\nWhen it comes to driving the mower -- to map a space. for example -- I ran into trouble. The mower would veer off in odd directions. It seemed like the front wheels weren't functioning as designed. I've been working closely with Airseekers support, and the company has been responsive to the issues I ran into, but as of the time this article was published, the mower hasn't accomplished the one job it has.\nFactors to consider when buying a robot lawn mower\nThe main thing to remember when buying a robot lawn mower is that your lawn care days are not done. Eric Dowd from Automated Outdoor Solutions pointed out that most of the company's residential customers still had a bunch of work to do, even after the mower was done doing its thing. Grass trimming along the edges is a big one -- in Chicago we call it \"weed whacking\".\nAs with a traditional mower, there's always some grass left over that the blades can't reach because of the chassis. You'll still need to do that with a weed whacker (sometimes referred to as a weed eater or string trimmer). Plus, as mentioned, if you have any narrow paths of grass, you'll likely have to cut those manually with the same trimmer or a traditional lawn mower.\nHere are some other things to keep in mind when picking the best robot lawn mower to buy:\n- Yard size compatibility (square footage ranges): Consider whether the mower is designed for larger or smaller lawns. A small yard is typically under 5,000 square feet, which is the case for me. A medium yard is usually between 5,000 and 10,000 square feet. Finally, large yards are 10,000 square feet or more, though this will vary according to urban or suburban areas. Some robot mowers are best for urban settings or medium-sized yards, while others are suited for large areas. Your mower should be able to efficiently and effectively cover your entire lawn without running out of battery or taking an excessive amount of time.\n- Navigation technology (boundary wires, GPS, vision systems): Determine what navigation system the mower uses. Options include GPS with RTK beacons for precise location accuracy, vision sensors that use cameras to map and navigate, or boundary wires that define the mowing area. GPS coverage can also be a factor, especially in urban settings with potential signal obstructions.\n- Cutting performance on different grass types: Understand if the mower can handle different grass types and conditions. Thicker grass or variations in grass length can affect mower performance. Some mowers may struggle with dense or tall grass, while others are designed for more challenging lawns.\n- Cutting width: This refers to the width of the area the mower cuts in a single pass. A slimmer cutting radius might mean the mower needs to make more passes to cover the same area. Our best overall, the Segway Navimow X390 has a cutting width of 9 inches, while the Sunseeker has 8 inches.\n- Slope handling capabilities (maximum degree): Evaluate if the mower can climb hills and handle uneven terrain. Some mowers are better at navigating difficult terrain than others, with varying degrees of slope they can manage. Ensure the mower can handle any slopes or inclines in your yard.\n- Battery life and charging time: Consider how long the mower can run on a single charge and how long it takes to recharge. This impacts how efficiently the mower can cover your lawn and how long it will take to complete a mowing cycle. All the robot mowers we tested came with docking stations. The Yarbo mower included a wireless charging pad and didn’t require contacts. The remaining all have slots that allow you to charge them.\n- Weather resistance (rain sensing, IP rating): Determine if the mower can operate in different weather conditions, including rain. Some mowers may have features to delay mowing if it's raining, while others are designed to be fully waterproof. Check the IP rating for water resistance level.\n- Obstacle detection and avoidance: Evaluate how the mower avoids obstacles, such as trees, garden beds and other objects in the yard. Options include vision sensors that identify objects, radar modules that detect obstacles or bump sensors that trigger a change in direction upon contact.\n- Noise level (decibels): Consider the mower's noise level, especially if you have close neighbors or prefer a quiet environment. Different models produce varying levels of noise, so check the decibel rating.\n- Smart features and app control: Almost all robot lawn mowers have smart features and app control for scheduling, mapping and other functions. This can include remote control, scheduling mowing times, creating virtual boundaries and receiving notifications.\nHow robot lawn mowers work\nRobot lawn mowers of yore started off using a boundary wire to determine where it could and could not go, and they were problematic. The boundary wire had to make a complete, unbroken circle. And if anything happened to the wire, you had problems. These days, robot mowers work via GPS, but it's GPS with a little bit extra in an RTK beacon. Scott Porteous, head of robotics for Husqvarna broke it down for me.\nGPS navigation\nGPS today is accurate down to a few feet. That's fine when you're navigating in your car, or looking for Tupperware in the woods, but it's not good for things like property lines. The Real-Time Kinematic beacon also communicates with GPS satellites to provide a fixed location on Earth that the satellites know about. In essence, the RTK beacon tells the satellites, \"I'm always here.\" Meanwhile, the mower drives around, and the beacon tells the mower that the satellites think it's 5 feet to the north, so the mower should take the location that GPS is reading and adjust it accordingly. This allows robot mowers to get accuracy down to the centimeter.\nGPS coverage\nAnother thing to consider is your general GPS coverage. If you live out in the suburbs, there's a good chance you'll be able to find a spot in your yard to set up a base station and RTK beacon. If you live in the city, that might be challenging. Also, wherever you set up your mower, you'll probably need to be within Wi-Fi range for the mower to operate properly. A mower like the Yarbo actually gets an ethernet cable that runs to a router. If you decide to go with the Yarbo, that's something you'll need to do.\nCutting width\nRobot mowers have a lot of difficulty with narrow paths. The reason for this is due to those blades and its overall construction. For example, the Segway mower's chassis is 20.5 inches with a cutting width of 9 inches. The Sunseeker, one of the smaller bots, has a 14-inch width accompanied by a cutting width of 8 inches. This is not conducive to cutting narrow paths. Even if the body of the mower fits there, it can't get the right angle to cut all the grass. Mostly, they just wiggle back and forth, which doesn't do a heck of a lot.\nCamera systems\nMost mowers have camera systems that allow them to avoid obstacles and navigate. Eufy relies on that camera system, so much so that it can't operate at night at all. Other mowers have the ability to turn off nighttime mowing because obstacle detection is a lot worse for obvious reasons.\nScheduling\nAll of the mowers have scheduling abilities, so the mower only runs when you want it to. Some of the mowers even take weather into account -- if it's raining when it's time to mow, it delays the mowing. It's important to remember that consistent mowing times are crucial to the proper operation of the mowers so the grass won't get too long for it to handle.\nHuman oversight\nFinally, it's important to remember that robot mowers are exactly that -- robots. A human can look at a patch of grass and know exactly how to move through it. Robots, not so much. It can be frustrating to watch a mower make its way through a lawn and just skip past a piece of grass.\nIf you don't obsessively watch the mower (like I had to in order to review them), you might come back after it runs a cycle and see patches that it skipped, which can also be frustrating. As a human, you might have to do some tidying up after a robot mower, but it'll be significantly less work than doing the whole thing yourself.\nMy backyard is a wonderful minefield of obstacles and grades that embodies just about any condition you might have in a yard. I have a trampoline that none of the mowers seemed to be able to navigate (the supporting pipes on the ground couldn't be climbed over). My tree is large and has roots sticking out of the ground. I have dogs who were curious about their new robot friends creeping back and forth across the lawn. I also have a fair amount of landscaping and some narrow paths that none of the mowers did a good job of cutting.\nMy front yard is much more straightforward except that neither of my neighbors have a boundary between their property line and mine, so I had to rely on GPS and the RTK beacon to test. I found them to be accurate enough. I programmed one of the mowers to also cut my elderly neighbor's yard (not the colorful one, the other one), which he appreciated. This is why you don't mess with the tech reviewer.\nDuring my testing time, temperatures varied wildly from 40 degrees Fahrenheit to up over 90 degrees -- welcome to the midwest. We also had a few rainstorms, including one torrential downpour that didn't kill any of the bots, so that's a plus.\nAfter every mower did its thing, I waited several days for the grass to grow back to test the next one, however I didn't wait too long because -- again -- maintenance, not mowing. I put these mowers through their paces for the past six weeks, but I anticipate some long-term testing will be necessary. We plan to keep this list updated with more mowers as they're released, or even mowers we didn't get to this time around, so be sure to check back.\nRobot lawn mowers vs. traditional mowers\nThe most obvious difference between a robot mower and traditional mowers is in the fact that robot mowers mow by themselves. This is going to be a long-term investment in getting your time back. Plus, as I told my wife, \"Sure the robot mower takes longer than our 18-year-old son to mow the lawn, but you only have to ask it once to do it.\"\nBeyond that, a robot mower starts itself, mows by itself, parks itself and charges itself. It's a true \"set it and forget it\" tool. The cost savings in frustration alone is almost worth it.\nSpeaking of which, there's a huge cost difference between a traditional mower and a robot mower. A traditional push mower will cost a few hundred dollars. Our cheapest robot mower is $1,399. So there is a big gap there.\nThe other consideration is that a robot mower isn't designed to mow a lawn, per se; it's designed to maintain a lawn. All of the robot mowers I tested recommended that you cut your lawn first before implementing the robot. Once you do, the robot can mow two or three times per week and keep your lawn where you want it.\nFAQs\nHow hard is it to set up a robot mower?\nRobot lawnmowers aren't hard to set up, but they may require tools and some advanced planning on your part. You'll need power, a clear view of the sky and the ability to run wires to all the components. Like anything automated, setting it up is the tricky part, but the long-term payoff is worth it.\nWhat ongoing maintenance do robot lawn mowers require?\nRobot lawnmowers are largely self-sufficient devices that run when you tell them to, charge themselves and don't require supervision most of the time. Maintenance comes in the winter when you need to store them. It's a good idea to replace the blade, too. Beyond that, they're pretty easy.\nHow do robot lawn mowers handle obstacles and boundaries?\nBoundaries and obstacles are handled through a combination of GPS, visual sensors, radar and app controls. Once you set the boundaries, you can also set \"no-go zones\" which the mower will avoid. Other obstacles are detected with onboard sensors that generally keep the mower out of trouble."
    },
    {
      "url": "https://www.cnet.com/home/kitchen-and-household/i-used-this-robot-vacuum-with-mechical-arm-for-three-months-2600-hard-sell/",
      "text": "- The Saros Z70 is priced at $2,599, making it one of the most expensive robot vacuums I've seen. You can buy two robot vacuums for this price.\n- The most notable feature is the OmniGrip mechanical arm designed to pick up and sort items. It also has strong vacuuming and mopping capabilities, excellent mapping and the ability to cross thresholds.\n- The mechanical arm has several issues, including difficulties picking up objects, navigation problems and software bugs. There were also connectivity issues during setup.\nPros\n- Good vacuuming on hardwood with 82.5% sand pickup\n- Very low profile and fits under pretty much everything\n- Quiet operation\n- Works well in homes with pets\n- Chassis lift prevents it from getting stuck most of the time\nCons\n- Dust bin is too small\n- Water tank is too small\n- Mopping performance isn't great\n- Obstacle avoidance needs some improvement\n- Expensive at $2,600 at full price\nI've been using the Roborock Saros Z70 for three months now and, in many ways, it's a great robot vacuum. It's the first robot vacuum with a mechanical arm meant to pick up objects and help you clean before it vacuums and mops. As someone who has three cats who leave toys everywhere, I found this incredibly appealing. I test and write about vacuums for a living and the Saros Z70 really is the first of its kind. CNET even chose it as one of our best of CES awards, giving me high hopes for its potential.\nI tested it at my cluttered apartment for three months and my colleague and lead lab tester Jared Hannah did the same at his home. The reality is, the Saros Z70 certainly has a lot of promise. It vacuums and mops like a champ, can cross thresholds and obstacles as effectively as the Dreame X50 Ultra, and has great mapping and pet recognition in my home.\nHowever, we found its signature feature -- the robot arm -- is still not ready for showtime. Right now, the Saros Z70 is fairly limited in its ability to pick up very small objects like pet toys and children's toys. On occasion, it did recognize and attempt to pick up cat toys it found scattered around my home but it was never able to succeed. Often, it would deploy the arm then detect my cat or some other object nearby and freeze, blaring \"Error 69,\" forcing me to manually reset the arm. At one point, it even tried to pick up my standing desk mat before realizing it wasn't a compatible object and giving up.\nI tested the Saros Z70 through June and July with Roborock's latest software updates that were intended to improve performance. Here are my impressions after three months of testing and whether it's worth its $2,600 price tag.\nMy experience with the Saros Z70\nWe tested the Saros Z70 at CES 2025, at a live demo, at our New York City office space, at CNET's testing lab in Louisville, Kentucky, and most recently at my home for three months. My biggest takeaway from my real-world home test versus my other experiences with this robot vacuum is the various issues with the mechanical arm, its struggle to pick up objects, navigation problems and software bugs. It cleaned great as a regular robot vacuum and mop but I couldn't rely on the arm's sorting capabilities to reliably pick up shoes and socks, let alone cat toys.\n\"Yeah, it seems like it's basically a beta version of the arm,\" said Jared, who was testing the Z70 at the same time. \"They should do a bit more development before it's ready for the masses. I would get the error if the arm bumped something while moving an object. It sensed that there was too much resistance so I think it was doing what it was supposed to but it seems like that would end up being a common occurrence.\"\n- Vacuuming and mopping: Strong performance, good sand/litter/hair pickup; mopping with clean/dirty tanks and hot air drying is effective.\n- Special features: The OmniGrip arm is the standout special feature although currently unreliable. I found operational issues during my home testing. It struggled to pick up certain objects, especially pet toys, but I had much better luck with socks. Not only was the Saros Z70 able to identify my wife's purple socks and pick them up off the hardwood floor in the bedroom but it also began to transport them to my designated shoe-drop-off area that's set up in the foyer. The problem was that partway on this journey, it gave up somewhere between the hallway and the kitchen, dropping the sock, acting like the job was complete and continuing its regular cleaning cycle.\n- Mapping and navigation: It generated a 2D and 3D map of my space, automatically tagging the rooms (bedroom, bathroom, living room and kitchen), flooring type (hard surface and carpet) and identifying certain pieces of furniture (couch, TV stand and bed). It also marked notable thresholds in my space where extra effort would be required to cross. You can remap it or tell it to remap a specific room if you're not happy with the result but it did a great job for me the first time around.\n- Software and app: The app isn't the most straightforward tool to use, with a profusion of settings and nested menus that allow you to adjust just about everything the robot can do, from the dustbin emptying and mop washing frequency, to cleaning patterns, obstacle photos and enabling the robotic arm. Just about everything the robot can do is customizable but I wish all these features and settings were a bit more front and center rather than tucked away in the lengthy settings menu.\n- Design and aesthetics: Low-profile design, good for fitting under furniture, but can lead to scratches when it tries to wedge itself under things like my wife's office chair.\n- Ease of use: Setup had connectivity issues; once set up, basic functions are easy, but advanced settings are complex.\nThe specs\n- Price: $2,599\n- Object weight limit (OmniGrip Arm): 300 grams rated load; approximately 700 grams actual load capacity during our testing.\n- Threshold crossing height: Capable of crossing thresholds up to approximately 2 inches.\n- Cleaning time: (Ajay's apartment, 850 sq ft): 1.5 to 2 hours for a full vacuum and mop session.\n- Cleaning time: (Jared's house, 1,200 square feet): 2.5 to 3 hours for a full vacuum and mop session on the main level.\n- Mapping time (Ajay's apartment, 850 sq ft): 16 to 18 minutes for initial mapping.\n- Sand pickup performance on hardwood: 82.46%, this is excellent hardwood performance, falling just shy of our best overall, the Ecovacs Deeboth T30S Combo (85%).\n- Sand pickup performance on carpet (mid-pile): 51.77%, this surpasses the Dreame X50 Ultra (44% mid-pile)\n- Sand pickup performance on carpet (low-pile): 51.06%, which comes close to matching the Shark Power Detect NeverTouch Pro (54.5%).\n- Voice command compatibility: The app can be connected to Amazon Alexa for voice commands.\n- Customizable: The app allows for a range of customization, including dustbin emptying frequency, mop washing frequency, cleaning patterns, obstacle photos and enabling/disabling the robotic arm.\n- Mapping features: The app displays the 2D and 3D maps generated by the robot, allows for room tagging, furniture identification and setting \"no-go\" zones. It also identifies pet areas and allows for \"Pet Area Cleaning.\"\n- Wi-Fi connectivity: The robot needs to connect to Wi-Fi for setup and app control.\n- Dual spinning mopping pads: The robot uses a pair of dual spinning mopping pads that attach and detach from the docking station.\n- Clean and dirty water system: Uses clean water for mopping and collects dirty water in a separate tank, ensuring cleaner mopping.\n- Mopping pad cleaning and drying: Mopping pads are washed and hot-air dried at the base station between cleaning sessions.\n- Mopping modes: The \"Vacuum+Mop\" mode vacuums first and then mops the entire space. There are options for Deep cleaning, Pet Area and an AI-powered SmartPlan.\nCNET's buying advice\nWhile the Roborock Saros Z70 excels at vacuuming, mopping and navigation, the core feature -- the OmniGrip arm -- is not yet reliable enough for me to recommend it if you're only looking to make heavy use of the OmniGrip arm. Recent software updates in June and July have made some improvements, including improved grab point optimization, smarter sorting optimization and new pickup categories like sports shoes but the consistency still leaves a lot to be desired.\nIt's hard to ignore the $2,599 price tag. I argue that for the price, you could purchase two or three excellent standard robot vacuums and mops, like the Yeedi M12 Pro Plus, or a comparable high performing model such as the Dreame X50 Ultra which has the ability to cross thresholds -- both on CNET's best robot vacuums best list. On the even lower price end, iRobot's new Roomba 205 DustCompactor Combo is our best new robot vacuum for less than $500, with solid performance and a unique mechanical paddle that lets you store 60 days of dust in the dustbin.\nIf all you care about is strong vacuuming, mopping and obstacle avoidance: The Ecovacs Deebot T30S Combo is currently CNET's \"best overall robot vacuum\" and Roborock's own Saros 10R offers similar or better vacuum and mopping performance with more space for the dustbin and water tank because it doesn't need to fit a mechanical arm in its body.\nWithout a fully operational and reliable OmniGrip arm, I can't justify its value for the cost at this time.\n\"The arm is a neat feature to watch but I personally don't find it very useful,\" said Jared. \"I feel like if the robot is smart enough to avoid obstacles such as shoes and socks, I don't need it to try and pick them up and move them. As long as the robot doesn't get stuck on anything during its cleaning cycle, that's good enough for me.\"\nIf the OmniGrip arm is your primary reason for considering the Saros Z70, I recommend you continue to wait for future software updates or wait a few years until Roborock and other companies enter the market with newer generations of the technology."
    },
    {
      "url": "https://www.cnet.com/home/kitchen-and-household/best-cordless-vacuum/",
      "text": "The best cordless vacuums don't need to break the bank. According to CNET's most recent tariff survey, 64% of Americans feel pressure to purchase tech products now because of a fear of price volatility due to tariffs. So if you're feeling the pressure too, and you're looking for something to suck up dirt around the house, we have recommendations for every price range. At CNET, we've been testing vacuums for many years, evaluating cordless and corded models in everyday situations -- far beyond the claims made by brands. To date, we've tested 50 cordless vacuums and counting. Whether you're on a budget or need something high-performance, here are our top cordless vacuum picks for 2025, from carpet champs to all-around winners.\nOur Picks\nVACUUM DEALS OF THE WEEK\n- $930 (save $570)\n- $199 (save $151)\n- $298 (save $302)\n- $155 (save $125)\n- $800 (save $500)\nWhat is the best cordless vacuum?\nOur top pick for the best cordless vacuum is the Eureka ReactiSense 440, replacing our previous winner, the Shark Stratos. Costing just $180, Eureka's vacuum outperformed the Shark with a 96% tested sand pickup average across flooring types -- truly incredible performance for a vacuum that costs two or three times less than our top picks, including ones from Dyson. Even more impressive for the price range, it has smart sensors that can automatically adjust brushroll speed for different flooring types.\nThis also makes it our new best value pick, replacing the Levoit LVAC-200. In fact, the low price makes the Eureka ReactiSense 440 so good, it's hard to justify buying any other cordless vacuum unless you're looking for a specific feature, such as a longer battery life or self-emptying dock.\nBest 9 cordless vacuums of 2025\nPros\n- Excellent suction performance with 96% sand pickup average across floor types\n- 97% pickup on hardwood floors, 98% on low-pile carpet and 92% on midpile\n- Includes HEPA filter and LED headlights\n- Smart sensors detect flooring type to adjust brushroll speed\nCons\n- Could use more attachments\n- 33-minute battery life, shorter than several competitors\n- 0.5 liter dustbin may require more frequent emptying\nBest for:\nThe Eureka ReactiSense 440 is our new best overall cordless vacuum, beating out our previous winner, the Shark Stratos. At $180, it's affordable enough to also earn a spot on our list of the best cheap vacuums. Normally, this comes with compromises but not so with the ReactiSense 440. It scored the highest test scores on hard flooring and carpet of any cordless vacuum we've tested, with a 96% average. It also comes with premium features, including a HEPA filter, LED headlights, and sensors that can detect flooring type to adjust brush roller speed and suction accordingly.\nWhy we recommend it:\nPrice isn't just what the ReactiSense 440 has going for it. Among the more than 50 cordless vacuums we've tested, it earned the highest scores in our lab testing across flooring types. It was able to pick up 97.53% of sand on hardwood, putting it in the top tier in terms of performance. The carpet score was even more impressive, with 98.53% sand pickup from low-pile carpet and 92.16% from midpile. \"Eureka was amazing across all testing,\" said Schylar Breitenstein, associate lab engineer. \"I just wish the runtime was a little longer but the pickup was even better than the Shark Stratos, surprisingly.\"\nAs you'd expect, this also means it tackles pet hair well. There's an anti-tangle brush roll designed to prevent hair from wrapping around the brush. Like the Shark Stratos, the ReactiSense 440 has smart sensors that automatically adjust the speed of the roller brush as it detects different flooring types.\nThe vacuum comes with a HEPA filter, an LED display that shows battery life, mode and vacuum status, and LED headlights on the vacuum itself to help spot dust more easily. Accessories are somewhat limited with just a crevice tool, upholstery brush, charger and wall mount, but that tends to be standard with more affordable vacuums, lacking some of the numerous attachments you get with the Dreame Z30 and other more costly competitors.\nWho shouldn't get it:\nBattery life is average, verging on mediocre. The similarly priced Uninell UV5 lasts longer at 48.6 minutes, while our previous best overall, the Shark Stratos, clocked 80 minutes. But neither holds a candle to the 110-minute Dreame Z30, although most of these options will cost you two or three times the price of the ReactiSense 440. The dustbin is also on the smaller size at 0.5 liters, requiring more frequent emptying and you won't get a self-emptying base station unless you step up to the Shark Clean & Empty or Tineco GoStation Smart.\nRunner-up best overall\nShark Stratos\nPros\n- Powerful suction and excellent cleaning performance on hardwood and carpet (95%)\n- Five-year warranty\n- Half the price of most top competitors aside from Eureka\n- 80-minute battery life and replaceable batteries\nCons\n- No self-emptying dock\n- Odor neautralizing cartridges need replacement\nBest for:\nOur former best overall, the Shark Stratos is still one of the best cordless vacuum's around, regardless of flooring type. It offers excellent performance on hardwood and carpet, falling just shy of the Eureka ReactiSense 440. Combined with its 80-minute battery life, 5-year warranty, replaceable batteries, anti-allergen HEPA filter and $500 price ($370 as of this writing), this is the highest-scoring cordless vacuum on our list and an easy pick for Editors' Choice.\nWhy we recommend it:\nThe Stratos generated the second-highest test scores we've seen on a cordless vacuum. It picked up 97.2% of sand from hardwood, 94% from less plush, low-pile carpet and 94.4% from midpile carpet. On average, it was able to pick up 95% of sand during our testing, beating out our previous best overall, the LG CordZero A949 (89.8%), but falling just a little shy of the Eurekea ReactiSense 440 (96%). \"The Stratos is definitely the standout,\" said Schylar Breitenstein, associate lab technician. \"I use it to clean the floors in between pick-up tests because it picks up the most debris by far.\"\nThe Stratos comes with a very capable DuoClean PowerFins HairPro brushhead, a two-brushroll system that's able to dig deeper into the carpet to remove dust and pet hair. Unsurprisingly, we didn't have many problems getting pet hair out of our test carpet, and the self-cleaning brushroll never tangled. It's worth noting that for more deeply embedded hair, you may require more than one pass. Interestingly, there's also some smart chops under the hood. Shark's Clean Sense IQ is able to detect dirt and automatically boost suction power for better cleaning, although you can also manually change the cleaning modes if you prefer. It has an 80-minute tested battery life, which is better than many cordless vacuums we've tested, losing out to just the 110-minute Dreame Z30.\nThere are also some useful quality-of-life features, like LED illumination lights for highlighting dust in dim areas, an LED display that shows you the battery you have left, and a multi-flex wand attachment to help you get the vacuum under furniture and other tight spaces. It also folds up so you can put it away easily for storage, a blessing if you live in a cramped apartment like I do. The Stratos comes with a washable anti-allergen HEPA filter and odor-neutralizing cartridges, so gross things you suck up don't fester.\nWho shouldn't buy it:\nWhile the Shark Stratos used to offer the best performance for the price, it's been outperformed by the Eurekea ReactiSense 440, which costs just $180 at full price. That puts the Stratos at a distant second unless you can get it on a steep sale. If you want a self-emptying dock, the Shark Stratos doesn't come with one. It also doesn't support mopping. The odor-neutralizing feature requires cartridge replacements every 6 months, which will cost you an extra $25.\nPros\n- Strong hardwood floor performance (91.4%) and very capable on carpet (84.8% and 74.02%)\n- Variety of useful cleaning attachments\n- Capable of vacuuming and wet mopping\nCons\n- Fairly expensive at $800 full price\n- Two-year warranty could be longer\n- No self-emptying dock\nBest for:\nIf you need a capable cordless stick vacuum that can also double as a mop to wet clean your hard floors, the Dyson Detect Submarine V15S is the vacuum for you. At $1,000 it's one of the more expensive cordless vacuums you can buy but there's a good reason for it. During our testing, it showed strong performance on hardwood floors and was capable of tackling carpet too. It comes with a variety of cleaner heads to keep your space spick and span.\nWhy we recommend it:\nThe Dyson Detect Submarine did great in our test of removing sand from hardwood, tackling 91.4% of the sand. Carpet performance was also quite strong, removing 84.8% of the sand from low-pile carpet and 74% from midpile. It's also no slouch at pet hair, removing fur from hardwood and carpet with ease. The performance isn't as good as our best overall, the Eureka ReactiSense 440, but it's still better than many other cordless vacuums we've tested, and the Detect Submarine has other features to make it a strong contender.\nFor one, it comes with the Submarine Wet Roller Head, a brushed attachment that lets you wet mop hard flooring using water and floor cleaning solution. Think of it as a Swiffer with extra power. There's also your standard Digital Motorbar cleaner head for standard vacuuming and the same Fluffy Optic cleaner head that illuminates dust that comes with the Dyson V15 Detect.\nTested battery is a solid 41 minutes, a bit shorter than the 60 minutes Dyson estimates, but the battery is user-replaceable, which is now usually the case with cordless vacuums.\nWho shouldn't buy it\nIf you don't need a jack of all trades that can tackle wet messes and just need an excellent vacuum, we like the Eureka ReactiSense 440 for most people at any price point. If you're a Dyson loyalist and need to bust dust, the V15 Detect offers similar excellent performance without the mopping functionality.\nPros\n- Useful Laser Slim Fluffy cleaner head finds more dust\n- Excellent sand removal performance on hard floors and carpet\n- Banished pet hair with ease\n- Lots of useful cleaning attachments\nCons\n- On the more expensive side from a cordless vacuum\n- No self-empty dock or mopping functionality\nBest for:\nSay hello to the best Dyson cordless vacuum, the Dyson V15 Detect. Like its predecessor, the V11, the V15 ripped through our suite of vacuum cleaner tests with ruthless power and completeness. I was also impressed by the 60-minute battery life. The dust detection feature is also no gimmick. It actively highlights dust you can't easily see and helps ensure you don't miss any spots.\nWhy we recommend it:\nThe trick up this Dyson's sleeve is the impressive 230 air watts of suction power from the cleaning head. That suction translates into performance. The V15 Detect was able to remove 88% of sand from midpile carpet, as well as 95% from a low-pile carpet. We consider anything above 50% to be good but the best cordless vacuums can often do even better. The V15 is a great cordless vacuum for pet hair, too. Whether vacuuming across hardwood floors or low- or midpile carpeting, the V15 barely left a tuft in its wake. The 60-minute tested battery life is also quite good, putting it in the top tier of cordless vacuums.\nSeveral features set the V15 Detect apart, including its Laser Slim Fluffy cleaner head. Designed for hard floors, it projects a green laser onto the surface as you clean, making it easy to spot dust and small debris that would otherwise be hard to see. It isn't much help under strong indoor lighting or sunlight but it's still a unique feature that we found helpful as we cleaned. The readout on the back of the vacuum, which lists the ratio of dirt collected by particle size, was also interesting.\nBundled with the vacuum are seven cleaning attachments. Along with the Laser Slim Fluffy, you'll get a high-torque cleaner head, a hair screw tool and a crevice tool, just to name a few. It also comes with a wall-mounted charging dock.\nWho shouldn't buy it:\nThe V15 is still a fairly expensive vacuum, at $800 MSRP. It also lacks mopping functionality or a self-emptying dock. Unless you're a true Dyson loyalist, the Eureka ReactiSense 440 will give performance, minus the dust illumination head, for half the price. However, Dyson also has some newer models in its lineup, including the Dyson Detect Submarine V15s, which earned a spot on our list for its strong vacuum and mopping functionality. It also comes with the Fluffly Optic cleaner head.\nPros\n- Excellent performance on all flooring types (91.4%)\n- Includes self-emptying charging dock\n- Generous five-year warranty period\nCons\n- Much more expensive than better-performing Eureka ReactiSense\n- Tested battery life on the shorter side at 26 minutes\n- No mopping functionality\nBest for:\nIf you want the power and cleaning performance of the Shark Stratos with the benefits of a self-emptying dock, the Shark Clean & Empty is the cordless vacuum for you. It boasts powerful suction on all flooring types and the included dock will automatically charge and empty the dustbin after every use. At just $350 full price, it's affordable, while offering great performance. It also comes with Shark's generous five-year warranty.\nWhy we recommend it:\nThe Shark Clean & Empty performed exceptionally well on all our tests, putting it close to other top picks, including the Eureka ReactiSense 440 and Shark Stratos. It removed 96% of sand from a hardwood floor, 90% from low-pile carpet and 88% from midpile carpet, resulting in an average performance of 91% in suction testing. This is just a few percentage points shy of the ReactiSense 440, which hit a 96% average on sand removal across floor surfaces. The vacuum automatically adjusts the brush roll speed depending on flooring type, although it doesn't have the same intelligent dirt detection feature as the Eureka ReactiSense.\nAs you might have guessed, pet hair was also no problem. The Clean & Empty was able to remove pet hair from hardwood and carpet without much difficulty, and the self-cleaning brush roll is designed to minimize the hair that wraps around it.\nThe big selling point for picking the Clean & Empty over the Stratos is the included charging dock with the auto-empty base. The base station lets you dock the freestanding cordless vacuum and it'll automatically charge and empty the dustbin. You can go up to 30 days without needing to empty the dock's bin. The vacuum and dock have a HEPA filter that Shark claims can lock away dust, dirt and allergens.\nLike other vacuums in Shark's lineup, the Clean & Empty comes with the company's generous five-year warranty and accessories, including a dust crevice tool and pet multitool.\nWho shouldn't buy it:\nIf battery life is important to you, the Clean & Empty doesn't last as long as the Stratos or even the ReactiSense 440 (33 minutes). We tested it to 26 minutes of cleaning on medium suction, rather than the 40 minutes claimed by Shark. The Stratos, by contrast, lasted for 80 minutes of cleaning. That said, this will depend on the suction, and the charging dock does help make up for this, as it'll keep your vacuum topped up every time you dock it.\nPros\n- Excellent hardwood performance (96%) and strong suction on carpets (above 80%)\n- HEPA filter and anti-allergen seal\n- LED headlights\nCons\n- Could use more cleaning attachments\n- No self-emptying dock\nBest for:\nLevoit's LVAC-300 is the successor to the LVAC-200, which earns our pick as the best cordless vacuum under $200. The LVAC-300 will cost you more but it offers even better carpet performance while still maintaining strong scores for hard flooring. At $350 full price, it would be our best value pick if not for the existence of the even cheaper and better-performing Eureka ReactiSense 440.\nWhy we recommend it:\nThe LVAC-300 maintains its predecessor's performance in hard flooring 96.15% sand pickup (slightly lower than the 98.72% on the LVAC-200), but it significantly outstrips it in carpet performance with 89.06% pickup from low-pile and 84.38% from midpile. It is outperformed by our best overall, the ReactiSense 440, however, which scores above 90% in all categories, including midpile carpet. It also significantly improves on the older LVAC-200 for low-pile (80.21%) and midpile (73.96%). The capacious 1.6-liter dustbin should also store plenty of debris before needing to be emptied.\nSeveral design improvements from the previous generation are also included. The new anti-tangle brushroll should better avoid clogs from pet hair and fibers. A five-stage HEPA filter is also built in, and the brush head comes with LED illumination lights and an LED display that shows battery life and mode. The dustbin is fairly sizable at 0.75 liters.\nLast, but not least, it scored an impressive 75 minutes in our battery rundown test, putting it a distant second to the Dreame Z30, which lasted for 110 minutes, but matching or surpassing top picks, including the Eureka ReactiSense 440 (33 minutes), Shark Stratos (85 minutes) and Dyson V15 Detect (60 minutes).\nWho shouldn't get it:\nThe LVAC-300 is less competitive than the Eureka ReactiSense 440, which offers better performance on hard flooring and carpets and extra features like adjustable smart suction, however it's a big step up in performance and battery life over its predecessor, the LVAC-200.\nBiggest dustbin\nUninell UV5\nPros\n- Strong performance on hardwood with 93.83% pickup and close to 80% on carpet\n- Includes HEPA filter\n- 1.6 liter dustbin capacity\n- Self-standing, green headlights and has a display\nCons\n- No self-empty dock\n- Some competitors outperform it on carpet\nBest for:\nUninell may not be a well-known brand next to others on this list but we were pleasantly surprised by the performance of its UV5 cordless vacuum when we tested it. It offered equally capable performance on hardwood and both types of carpet we tested on. Its standout feature is also the massive 1.6-liter dustbin, one of the largest capacities we've seen on a cordless vacuum that doesn't come with a dock. At $200 MSRP, it's also quite affordable, costing just $20 more than our best overall.\nWhy we recommend it:\nThe UV5 is a surprisingly consistent performer. It scored 93.83% on sand pickup for hardwood floors. It also did quite good for low-pile and midpile carpet, scoring 77.45% and 79.9%, respectively, although this doesn't come close to matching the Eureka ReactiSense 440, which scored well above 90% in all categories. Pet hair wasn't much of a challenge for the UV5, fortunately. The UV5 has the V-shaped roller brush we've seen other brands adopt, which helps scrape up pet hair and direct it toward the nozzle without tangling or clogging.\nBattery life is good, with 48.6 minutes tested, although it's less than the 65 minutes Uninell estimates. The company claims that a second optional battery can give you an additional 130 minutes of battery life. The battery is user-replaceable, which is another nice selling point.\nOther small touches that we appreciate are that the vacuum is self-standing and includes a power level display so you can see the charge and suction setting at a glance. It also comes with a 7-stage HEPA filter and green LED headlights similar to the Dyson V15 Detect to help it spot dust. Warranty is about standard at two years.\nWho shouldn't get it:\nIf you need the best carpet performance possible, you'll generally get better results with our best overall, the Eureka ReactiSense 440, which shouldn't cost you any more than the UV5. It also doesn't come with a self-emptying dock, but that's tough to find at this price point. Your best bet for that would be picking up the Shark Clean & Empty or Tineco GoStation on sale.\nBest features\nTineco GoStation\nPros\n- Scores 97.53% sand pickup from hardwood floors and nearly 80% on carpet\n- Has self-emptying and self-cleaning charging dock with massive 3-liter dustbin\n- Includes 5-stage HEPA filter\n- Has smart sensor that can adjust suction strength\nCons\n- Could use more attachments\n- 0.3-liter dustbin on vacuum itself is on the smaller side\nBest for:\nTineco is a brand that's earned a number of spots on our roundups over the year for offering high-quality cordless vacuums at a reasonable price. The feature-packed Tineco GoStation Smart is no exception to that rule. It offers great suction performance on hardwood and carpet alike, comes with a self-emptying, self-cleaning charging dock and has premium features like a dust-busting green LED light similar to the Dyson V15 Detect. It costs about $500 at full price but can often be found on sale for less.\nWhy we recommend it:\nLet's start with the bread and butter. The GoStation Smart tests in the upper tier of cordless vacuums, suctioning 97.53% of sand from hardwood floors. It also does quite well on carpet, with 78.43% pickup from low-pile and 81.86% from midpile. This is more or less on par with the Shark Stratos for hardwood floor pickup (97.22%) and actually beats the Dyson Gen5 Detect in carpet performance (65.3% low-pile and 66.67% midpile). This is pretty remarkable for a vacuum that costs half of Dyson's flagship model.\nOn pet hair, the GoStation Smart benefits from the ZeroTangle Brush that's included with the brushed. As the name suggests, it avoids tangling and doesn't get clogged. We didn't have any problem getting pet hair off either hardwood or carpet.\nBattery life is solid, lasting 42.5 minutes in our testing. This is less than the 70 minutes Tineco predicts, but that'll depend on your suction strength. For reference, we run this test three times on medium suction and take the average of the three results. On the plus side, the battery is removable and replaceable and the vacuum will charge every time it's docked.\nNow, let's get to the bells and whistles. The GoStation Smart is feature-packed. It earns the smart name by incorporating a 3D sensor into its main brush head that can identify the soil level of your flooring, detect walls and corners, and optimize suction to maximize debris removal and battery life. Like the V15 Detect, the brush head has a green LED light that helps illuminate dust better.\nAs mentioned, it comes with a self-emptying charging dock that also self-cleans the entire vacuum system every time you dock it, including the brush, tubes and filters. The vacuum's dustbin is on the smaller side at 0.3 liters, but the docking station has a massive 3-liter capacity that should allow it to last for 45 days before needing to be emptied. It includes a 5-stage HEPA filter that Tineco claims can remove 99.99% of dust.\nWho shouldn't get it:\nFor a lower price, the Eureka ReactiSense 440, our best overall pick, offers superior carpet performance and has smart chops that let it adjust suction, though it won't come with the self-emptying dock (the Shark Clean & Empty can fit that need). Included tools are also limited, with just a crevice tool and 2-in-1 dusting brush.\nPros\n- 110 minute battery life is the longest we've tested\n- 98.77% sand pickup from hard flooring\n- Higher than 70% carpet performance\n- Fairly light at 4.85 pounds\n- Tons of accessories included\nCons\n- Dustbin on the smaller side at 0.6 liters\n- No self-emptying dock\nBest for:\nIf you have a big home that takes a long time to clean, the Dreame Z30 is for you. It has the single best battery life out of any cordless vacuum we've tested, clocking 110 minutes. It's no slouch in performance, offering excellent sand pickup on hard flooring and better-than-average pickup on carpet. Price is also reasonable, running you around $500 at full price, about on par with the Shark Stratos.\nWhy we recommend it:\nBattery life is the obvious part. The 110-minute battery running time is nearly double what you get with many of our top picks, including the Shark Stratos (80 minutes) and Dyson V15 Detect (60 minutes). That means long, uninterrupted cleaning sessions, which is great for those with larger homes, bigger households and many pets.\nThe hard flooring performance also puts it in the top-tier of cordless vacuums we've tested, with 98.77% sand pickup. Carpet performance is decent, though not spectacular, with 71.08% pickup from low-pile and 75.49% from midpile. There's a HEPA filter and plenty of attachments, including an illuminated multi-surface brush, illuminated soft-roller brush, motorized mini-brush, combination tool, two types of soft dusting brushes, pet deshedding tool, extension rod, flexible adapter, extension hose and a base unit to store everything.\nWho shouldn't get it:\nIf you have a lot of carpeting, several cordless vacuums on our list, including our best overall, the Eureka ReactiSense 440, offer better carpet performance for a lower price. The dustbin could also be larger, at 0.6 liters, so you'll likely need to empty it a few times during longer cleaning sessions.\nRecent updates\nApril 2025: We eliminated our testing that evaluated the ability of a cordless vacuum to pick up black rice from hardwood and carpet because almost every vacuum was scoring near 100%. We've kept our testing for sand on all three test surfaces and reweighted our scoring to take this into account. We also reweighted our scoring to increase the importance of battery life and consolidated the ease of use and comfort into UX as a measure of user experience. The Levoit LVAC-200, Dyson V15 Detect, and LG CordZero A949 still use our older scoring methodology, so you may see some discrepancies in score breakdown compared with our newer additions, but they are in the process of being updated with our new methodology. We removed the Tineco Pure One S15 Pet, Dirt Devil Grab & Go Plus and Samsung Jet 90. We added the Shark Stratos as our new best overall pick, replacing the LG CordZero A949. We added the Dyson Detect Submarine V15S, Shark Clean & Empty, Shark Pet Plus and Dirt Devil BD5700V. The Shark Stratos and Levoit LVAC-200 both received an Editors' Choice award.\nJune 2025: We tested and added the Tineco GoStation Smart to our best list for its array of premium features. We tested and added the Uninell UV5 to our best list for its large 1.6-liter dustbin. Infographics were updated with more current testing results. All the product cards were updated to include our tested battery life.\nAugust 2025: We tested the Eureka ReactiSense 440, making it our new best overall. We also tested the Bissell PowerClean FurFinder, Levoit LVAC-300 (best midprice) and Dreame Z30 (best for battery) and added them to our top picks. We removed the Shark Pet Plus, Dirt Devil BD5700V, Levoit LVAC-200 and LG CordZero A949.\nOther cordless vacuums we tested\nEureka\nEureka RapidClean Pro: The RapidClean Pro from Eureka is another affordable cordless stick vacuum that you can get for less than $200. It offers generally solid performance, removing 94% sand from hardwood, 64.8% from low-pile and 60% from midpile carpets. However, like many vacuums in this price range, it's edged out in performance by other picks that earn a spot on our best list.\nDyson\nFor a deeper dive into Dyson as a brand, take a look at our tested list of the best Dyson vacuum cleaners.\nDyson V8 Absolute: The V8 Absolute is one of the more affordable Dyson vacuums you can buy. Normally $520 at full price, you can usually get it for less these days. While the price isn't bad, the performance doesn't live up to expectations. While it did great on hardwood, removing nearly 98% of sand, it didn't do as well on carpet. The Absolute was able to remove 68.3% of sand from low-pile and 52% from midpile carpets, falling short of many competitors, including the Levoit LVAC-300 and Eureka ReactiSense 440.\nDyson V11 Torque Drive: With a motor that automatically adapts to the type of floor it's cleaning and a fancy LCD screen, the Dyson V11 Torque Drive might feel like an upgrade. It typically retails for about $600 but you can often find it on sale for less. While the Dyson V11 lived up to the hype with highly consistent cleaning power across all of CNET Lab testing, it was, however, outperformed by newer models like the Dyson V15 Detect and other competitors on our best list.\nDyson Gen5 Detect: The Gen5 Detect is one of Dyson's latest and greatest cordless vacuums. It's also one of the most expensive at $950. The performance you get is fairly good, with 95.4% of sand removal from hardwood, 65.3% from low-pile carpet and 66.7% from midpile carpet. However, this performance falls short of our current best overall, the Eureka ReactiSense 440, which offers even better scores for a fraction of the price. If you like the dust detection feature, we're also partial to the Dyson V15 Detect, which offers stronger performance on carpet and hardwood, and the Dyson Detect Submarine V15S, which has all-in-one capabilities, including mopping.\nDreame\nDreame R10 Pure: The Dreame R10 Pure is the company's more affordable entry-level cordless vacuum, priced at $200 full price. It comes in an attractive white color, is notably lightweight at 3.64 pounds, and offers decent performance. It scored 86.42% on sand pickup for hard flooring, 67.16% from low-pile carpet, and 65.69% from midpile carpet. The carpet performance isn't particularly impressive, so it'll be a better option for those with hard flooring. Battery life was solid at 41 minutes, but not as long as the 60 minutes claimed by Dreame. Generally, for the price, you can get better performance from competitors like the Levoit LVAC-200.\nDirt Devil\nDirt Devil BD5700V: For those with primarily hardwood flooring, the Dirt Devil BD5700V delivered one of the highest scores we've seen on a cordless vacuum, removing nearly 100% of sand from a hardwood floor. Most impressive of all, it only costs $150 at full price. The only thing holding it back from being our best budget pick is middling carpet performance compared with the Levoit LVAC-200. The Dirt Devil BD5700V is notable for its classic bright red accents and remarkably lightweight body. At just 7 pounds, it's easy to maneuver around the home but it doesn't compromise on suction strength. It did incredibly well on our test that measures the ability of a cordless vacuum to remove sand from a hard floor, removing 99% of sand. It did quite well removing pet hair from hardwood, leaving no traces, but struggled more with carpet, leaving traces of fur despite a few swipes. The Dirt Devil is also freestanding and has LED headlights on its primary cleaning head, a nice feature not always found on more affordable cordless vacuums. There isn't a HEPA filter, but it is washable. The big selling point here is the price. Without any sales or discounts, the DirtDevil starts at $150, making it even cheaper than the Eureka ReactiSense 440, though it won't match the performance on carpet. If you have a lot of carpeting at home, the BD5700V isn't for you. It scored 69% removal on less plush low-pile carpet and managed 70.1% on more plush midpile, but you can do better for the price. Dustbin size could also be bigger; it's only 0.48 liters, meaning more frequent emptying during cleaning sessions. The battery lasted 23.5 minutes during our testing, which is shorter than many competitors, and it's also not user-replaceable.\nLevoit\nLevoit LVAC-200: This older Levoit model first proved that you don’t have to spend much money to get a quality cordless vacuum, although it's recently been replaced by the Eureka ReactiSense 440 as our pick for best value, and has a successor with the LVAC-300, which provides better carpet performance. At the time of our testing, the LVAC-200 excelled at cleaning on hardwood floors, capturing 98.7% of sand. It also handled low-pile well, suctioning 80.2% of sand. Midpile was slightly lower at 74%. Levoit isn’t using a HEPA filter in this unit; it does use a five-stage filtration system, capturing 99.9% of particles as small as 0.3 microns. A feature typically found on more expensive cordless vacs is LED lights on the front of the vacuum head to help ensure you don’t miss a speck of dust. Levoit LVAC-200 also comes with a two-in-one crevice tool and a two-in-one pet tool to help clean up any and every mess, although it would have been nice to have some additional attachments for cleaning upholstery or digging deeper into carpet for pet hair. The one downside is battery life, which is not very impressive at just 25 minutes (although this can vary depending on your mode). On the plus side, the battery is user-replaceable, and additional units can be purchased from Levoit for $70. If you need a longer running time, the LVAC-200 isn't the cordless vacuum for you. It only lasted 25 minutes during our testing, so you'll want to take a look at the Shark Stratos and Dreame Z30 for cordless vacuums that can last an hour or more. If you're sensitive to allergies, this also doesn't have a HEPA filter. And obviously, at this price, you won't get a docking station or mopping functionality.\nSamsung\nSamsung Jet 75: Nearly identical to the Jet 90, the Samsung Jet 75 offers comparable cleaning power, a similarly attractive build, the same 60-minute battery life, the same HEPA filtration and the same 200 air watts of suction. The main difference is that the docking station needs to be drilled into the wall, while the Jet 90 uses a freestanding dock. The Jet 75 didn't perform as strongly as the Jet 90 in the CNET Testing Labs midpile sand test, but because it's at a lower price, that might be worth the deal for some consumers.\nSamsung Jet 90 (Update: Out of stock): Our former best cordless vacuum for carpets, the Samsung Jet 90 is no longer in stock. One of the toughest cordless vacuum cleaning challenge is the midpile sand test, where we see how much sand each vacuum can suck out of the thick, plushy carpet. Only three of the 15 cordless vacuums we've tested in recent years have been able to average pickup percentages better than 80% in that test: the Dyson V15 Detect, the Tineco Pure One S15 Pet and the Samsung Jet 90, which led the way overall with an outstanding midpile sand pickup percentage of 98%. The Samsung Jet 90 is one of the lighter models we tested and sports a sleek, futuristic look. It's a splurge at a retail price of about $600 but it's the best HEPA cordless vacuum option if you have a lot of thick carpets in your home.\nShark\nFor a deeper dive into Shark as a brand, take a look at our tested list of the best Shark vacuums.\nShark Rocket Pet Pro: Typically retailing for less than $350, the Shark Rocket Pet Pro remains a solid budget option provided you can find it in stock. It offers excellent cleaning performance with crumbs and other small bits of debris on hardwood floors and satisfactory pickup power on carpets and with dust. It features HEPA filtration and a self-cleaning, anti-tangle brush head (helpful for preventing pet hair clogs) and converts to a convenient handheld cleaner when needed.\nShark Pet Plus: We still recommend this one for those who want a good vacuum without spending more than $400. It delivers strong suction on all our test surfaces, has HEPA filtration and comes with Shark's generous five-year warranty. The Pet Plus excelled on hard flooring, removing 94% of sand. It was no slouch on carpet either, tackling 90% of sand from low-pile and 84.3% from midpile carpets. The scores put it right up there with some of our top performers, like our current best overall, the Eureka ReactiSense 440, and our previous best overall, the Shark Stratos. There's no dock or mopping functionality, but the vacuum is freestanding, which is a nice feature we look for because you can leave it in a corner if something calls your attention. It's also easy to maneuver, weighing a little less than 8 pounds, putting it on par with the lightweight Dirt Devil BD5700V. Battery life is middle of the pack at 42.3 minutes, which is less than the 60 minutes we got on the Stratos, but the battery is removable. The Pet Plus comes with several useful cleaning tools. You get a multi-angle dusting brush, pet multi tool and wide upholstery tool. If you're more sensitive to allergies, you'll be pleased to know that the Pet Plus does have a HEPA filter and an anti-allergen seal. Last, but not least, we get to the price. The Pet Plus falls firmly in the middle of the pack, costing $330 at full price.This makes it quite the steal and one of the few high-performing cordless vacuums you can get for less than $300. However, there are a few things that keep it off our main list. The Shark Pet Plus didn't do as well at removing pet hair. While it did fine sucking it up from hardwood, it left quite a bit of pet hair on our low-pile and midpile test carpets. The dustbin is also quite small at just 0.32 liters. It's actually one of the smallest capacities we've seen on a cordless vacuum that didn't come with a self-empty dock.\nShark Vertex IZ492H: The Shark Vertex is a capable midprice cordless vacuum ($380 at full price). It offers strong hardwood floor sand pickup at 97.53% and does fairly well on carpet with 78.43% on low-pile and 80.39% on midpile. While these are good scores, it's outperformed by the Shark Stratos and Shark Clean & Empty, making them better picks for roughly the same price, or our best overall, the Eureka ReactiSense for $180. On the plus side, it does have one of the longer battery lifespans we've tested, at 63.6 minutes.\nShark Pet Pro: The Pet Pro is one of the better Shark vacuums for under $300. It has fairly consistent performance, with 91% sand pickup on hardwood, 81% on low-pile carpet and 80% on midpile, making it good for all types of surfaces. Battery life is decent, though nothing special at 45 minutes, but the dustbin is larger than average at 0.78 liters. What keeps it off our main list is that the Shark Stratos offers superior performance and a longer battery for $100-150 more while the Eureka ReactiSense has better performance for a much lower price, making it hard to justify the Pet Pro unless it's on a steeper sale.\nShark Pet IX141H: The most basic Shark model, it offers solid performance at just $180 (this seems to be a perma-deal, though on paper its full price is $300). It scored 89% sand pickup on hardwood, 84% on low-pile carpet, and 86% on midpile carpet, making it a better choice than the Pet Pro and one of the most affordable options in Shark's lineup. The 45-minute battery life and 0.78-liter dustbin aren't anything to scoff at either. What keeps it off our main list is that there are plenty of cheap vacuums to choose from that can cost as little as $100 to $150 while offering similar or better performance.\nRoborock\nRoborock Ace F25: This expensive wet and dry vacuum will cost you $650 at full price. It exists in the same category as the Dyson Submarine, letting you vacuum your floors but also clean up spills. As far as vacuuming goes, it does well on hard flooring, with 93.06% sand pickup. Carpet is a mixed bag, with 73.33% pickup from low-pile and 60% from midpile. We're still evaluating the mopping abilities of the Ace F25, so until then, we're withholding judgment but there are a few features that may put it above the Dyson, including its 194 degrees Fahrenheit hot air flash drying and hot water self-cleaning.\nBissell\nBissell PowerClean FurFinder: We had high hopes for the Bissell PowerClean FurFinder as it's one of the brands that earns top marks in our list of the best carpet cleaners. As a cordless vacuum, the FurFinder is just ok, scoring 71.6% on sand pickup from hard flooring. Most cordless vacuums, even the cheapest ones, excel in this category, picking up 90% or higher, so this was disappointing. Carpet performance is average at 69.12% low-pile and 64.71% midpile. Most cordless vacuums we've tested can usually manage closer to 80% and above. Battery life was also subpar at 25.6 minutes. Most disappointingly, it didn't perform well at extracting pet hair from carpet either. At $230 full price, you can do better.\nBissell IconPet Turbo: Designed for tackling pet hair, the Bissel IconPet Turbo offers solid overall performance for a reasonable $199. It did reasonably well in testing, scoring 89.7% in sand removal from hardwood, 66% from low-pile and 54% from midpile carpets. However, despite the reasonable price and decent performance, it was outperformed by our value picks, the Levoit LVAC-200 and Dirt Devil BD5700V.\nTineco\nTineco A11 Hero (Update: Out of stock): The Tineco A11 Hero is no longer available but it was a solid and reasonably affordable cordless vacuum when we tested it. It scores 98.5% removing sand from hardwood, 82.5% from low-pile and 72.5% from midpile carpets. It's traded spots with the Tineco Pure One S11 and S15 Pet in terms of performance and value.\nTineco Pure One S11: The Tineco Pure One S11 is a high-performing cordless vacuum with impressive suction power on hard floors and carpets. Versatile attachments, HEPA filtration and a dirt-detection feature add to its value. The design is basic and battery life is moderate and its excellent cleaning performance makes it a great choice.\nTineco Pure One S15 Pet (Update: Currently unavailable): This is our former pick for the best cordless vacuum for pet hair. Tineco does great work with cordless vacs and the Pure One S15 Pet is fantastic. A 500-watt motor and cyclonic dust collection system creates 120AW of suction power. This adds up to a solid cleaning experience. When cleaning up the smaller sand particles, the vac did a wonderful job of getting them all off the hardwood. As expected, pulling the sand from carpets was tougher. The Pure One S15 Pet still got more than 88% from low-pile carpets and more than 81% from midpile carpets. Tineco's specially designed brush did a good job of removing hair from the brush as it cleaned, resulting in nearly zero tangles. You'll also find LEDs on the front of the brush head to help see what you're cleaning up and an iLoop Smart Sensor built in. This sensor helps the vacuum to automatically ramp up its suction power when it detects more debris on the floor. You can see its progress on the LED display on top of the handle.\nOther cordless vacuums\nMiele Triflex HX2: Priced at about $1,100, we had high hopes for the Miele Triflex HX2. The three-in-one stick vac performed poorly in the sand test with low- and midpile carpets bringing down its overall performance score.\nGreenworks 24V Cordless Vacuum: This vacuum is a true contender, able to match the performance of some $500 or more hand-held stick vacuums while coming in around $320. In addition to all the tools it includes, it touts a fast 30-minute recharge time and a solid 45-minute running time.\nMoosoo XL-618: It wasn't a strong performer in our toughest tests, but the Mooso XL-618 proved perfectly capable of basic cleaning, particularly with crumbs and on hardwood floors. It also converts to a handheld vacuum that you can use to clean your car or furniture. Frequently on sale for less than $80, the XL-618 is about as inexpensive as cordless vacuums get. If you're willing to sacrifice some cleaning power to save some cash, it's worth a look.\nBlack & Decker PowerSeries Extreme Max: The Black & Decker PowerSeries Extreme Max is a budget-friendly cordless vacuum that offers strong cleaning performance and a long running time. Its ability to convert into a handheld vacuum adds to its versatility, making it a standout option for its price.\nLubluelu 23Kpa cordless KB-H009 (Update: Out of stock): The Lubluelu KB-H009 was a solid, if unexceptional, cordless vacuum. Priced about $400, it did great in our testing on hardwood, scoring nearly 98% sand removal. It did decently on low-pile carpet, removing 68.3% of sand, but had middling performance on midpile at 52%.\nLG CordZero A949: The CordZero A949 was a do-it-all cordless vacuum for those who want vacuuming and mopping in one device. It used to be our best overall pick, but now it loses the crown to Eureka ReactiSense 440, which outperformed it in testing and comes in at a fraction of the price. During testing, the LG CordZero A949 suctioned nearly 90% of the debris from carpet and hardwood flooring. It did great in testing, scoring 95% sand removal from hardwood, 87.8% from low-pile carpet and 86.8% from midpile carpet. Pet hair was also no challenge, with the A949 pulling it out of hardwood and carpet with ease. Aside from the impressive cleaning power, the LG CordZero A949 also has a charging dock that stores the accessories, charges the vacuum and the extra battery, and the base automatically empties the vacuum. The accessories include a crevice tool, an adjustable wand, a power mini nozzle and a combination tool. It also has a power mop attachment with spinning pads to clean up wet messes. A small but much-appreciated feature of the LG CordZero A949 is that it's freestanding. This means when you need to pick something up that’s in the way of cleaning, you don’t have to lean the vacuum against something or lay it on the ground. An underrated feature is also the dustbin capacity: it can hold a full liter before you need to make use of the self-emptying dock. This is one of the most expensive cordless vacuums we recommend at $1,000 at full price, which keeps it off our main list. If you're price sensitive, this may not be the cordless vacuum for you, as there are options with similar capabilities for half the price, including our current best overall, the $180 Eureka ReactiSense 440. The battery life was also a big letdown during testing, with us getting just 10.5 minutes, although it is user-replaceable and charges while on the dock.\nHow we test cordless stick vacuum cleaners at CNET\nAll the vacuums on CNET's best lists are tested and evaluated in our state-of-the-art test labs. CNET Testing Labs go beyond product specifications to test in real-world conditions with real-life messes. Over the years, our experts have tested 50 cordless vacuums and counting.\nHere's a breakdown of how we measured cordless stick vacuum performance.\nCordless stick vacuum scoring methodology\n| Subrating category | Weight | What we looked for | |||||\n|---|---|---|---|---|---|---|---|\n| Performance | 30% | Performance score extrapolated from the average sand score on hard flooring, low-pile carpets and midpile carpets. | |||||\n| Value/price | 25% | Retail price rating considering all other features. i.e. Does this price seem fair for the value offered? | |||||\n| Running time | 20% | How long does the battery last when cleaning at medium setting? (No ECO, turbo, MAX, etc.) | |||||\n| Features | 15% | Overall comfort and handling of the product (e.g. weight, comfortable grip handle). | |||||\n| UX (Comfort. ease of use) | 10% | UX - All aspects of comfort. Did it have a good grip/handle? Was it heavy to operate/lift? How easy was the setup? Did it come with smart home functionality? Smartphone app? Voice assist? |\nInside CNET’s Testing Labs: How we test cordless vacuums and why the sand scores matter\nOur team of experts and engineers uses play sand and landscaping sand to mimic dirt and dust. Each vacuum is tested on a low-pile carpet, midpile carpet and a hard surface with sand. This test reveals exactly how much physical debris a vacuum is able to pick up off of the floor.\nDuring testing we set controls in place to make sure each vacuum faces the same test. For example, each vacuum is set to the same nozzle width and we measure and lay down the exact same amount of debris each time.\nWe conduct three cleaning runs (at minimum) on each floor type. We also conduct separate cleaning tests with pet hair on each surface type where we photograph and visually evaluate how much pet hair (if any) is left after running the vacuum over it.\nWe weigh the dustbin before and after each run. From there, we can calculate the percentage of debris pickup for every cleaning run and the average amount of soil a vacuum manages to remove.\nCordless vacuum battery life and running time\nTo test battery life, we fully charge the vacuum battery to full, then run it at the medium setting until drained (no Max or Eco mode). We do this three times and take the average of the three tests. The longer the duration, the better the score. Most of the vacuums on our list have a battery life of 25 to 40 minutes before needing another charge, although many models are starting to offer higher-capacity batteries with running times of 60 minutes per charge. In truth, it's a rare occasion that one would need more than 40 minutes for a single vacuuming session, and the prevalence of charging docks makes it easy to recharge in between cleaning runs.\nMost cordless vacuums we recommend also have replaceable batteries these days, meaning you can buy an extra if you need more running time or you're worried about battery degradation over time. Because of this, battery life was not weighted as heavily as other features.\nCordless vacuum weight, size and bin capacity\nMost of the cordless vacuums we tested weighed between 4 and 8 pounds. When a vacuum weighs 10 pounds or more, we consider it more unwieldy. Most of the vacuums on this list were also very similar in height and overall size. They also come with accessories that can be attached and detached to give you flexible cleaning options. For instance, a common tool is a crevice cleaning attachment that lets you fit the vacuum nozzle into tight spaces and corners to clean in places where a larger brush head wouldn't reach.\nFor dustbin size, we consider anything of 0.6 liters and more to be good. Generally, anything less than 0.5 liters will require you to empty it after every cleaning session. A large dustbin means you can go longer without emptying. However, if the cordless vacuum comes with a self-emptying charging dock, it can often store dust and debris for 30 days or more, minimizing the amount of dust you're faced with when vacuuming.\nCordless vacuum warranties\nCordless vacuum warranties will vary by manufacturer and model but the majority of models we've tested offer at least a year of coverage if not two. The best warranty we've seen is from Shark Ninja, which offers five-year limited warranties on its cordless vacuums. A longer warranty period is good because it means your vacuum is covered if a part breaks or something is defective.\nFilters and air quality\nMost cordless vacuums have some kind of filter that stops the exhaust from putting dust back into the room while you're vacuuming. This can be a simple washable cloth filter to an anti-allergy HEPA filter (commonly found in air purifiers) that can filter particles as small as 0.3 microns. Most of the best cordless vacuums come with replaceable HEPA filters, while cheaper models may have a more basic cloth filter. One recent innovation we're also seeing from Shark Ninja is incorporating an anti-allergy seal and anti-odor capsules that keep your vacuum and dustbin from festering.\nUser experience (Ease of use and comfort)\nWhile it's not necessarily a factor that weighs heavily, the ease and comfort of using a cordless vacuum and emptying its dustbin does play a role. We now consider this category as user experience. We like when a cordless vacuum is freestanding, meaning you can leave it upright and unattended without having to worry about it tipping over. We also like when it has a charging dock or self-empties because it means you need to do less maintenance on your end. Strong bonus points go to a vacuum docking station that empties dust into a bag rather than a bagless dust canister because it means that dust is less likely to get all over your newly vacuumed floors when you empty it into the trash.\nOther features\nAs new cordless stick vacuum models emerge, we are seeing the ability to detect dirt types and floor types and adjust suction power accordingly. \"This means that when a large amount of dirt is detected, suction increases and when less dirt is present, suction decreases,\" says CNET's Lab Engineer Gianmarco Chumbe. Chumbe, who's been testing home tech products at CNET Labs for 8 years, says the latest vacuum tech can sense floor type and boost suction power in response. \"The main benefit of this feature is increased battery efficiency, resulting in a more effective and longer-lasting cleaning experience.\"\nConsumers shopping for vacuums today, Chumbe says, should consider the cost-to-value ratio. \"Ask yourself, does the price justify the performance, features and comfort it offers?\" CNET writers and editors use price and value in our vacuum scoring just for this reason.\nWhat about handheld vacuums?\nMost, if not all, of the cordless vacuums on this list can be broken down into a handheld vacuum, making it possible to use them to clean your car or upholstery. However, we use a slightly different testing methodology when testing handheld vacuums, so we recommend looking at our recently updated list of the best handheld vacuum to see our recommendations for use cases ranging from cleaning cars to pet hair. Many handheld vacuums can weigh as little as 1.2 pounds, putting them in a different weight category from these cordless vacuums.\nKeeping your cordless vacuum clean so it can clean better\nIt’s easy to forget that the very tools that help us clean (like vacuums) also need to be cleaned from time to time. This is true even if they have a charging and self-emptying dock as the main dustbin still needs to be emptied. Issues like hair tangled around the brushes or clogged filters need occasional attention to ensure your cordless vacuum continues performing at its best.\nSome of the routine cleaning that needs to be done for your cordless vacuum is daily, while other aspects can be done weekly or even monthly.\n- Daily: Emptying the bin, checking brush for stuck debris.\n- Weekly: Cleaning brush rolls, filters and wheels.\n- Monthly: Cleaning any sensors, replacing the filters, removing and deep cleaning the brushes.\nSome of the maintenance will depend on how often you use your cordless vacuum. If you only use it once or twice a week, you may not need to replace the filters every month. Checking with your particular vacuum model's manual to determine when to replace the filter is a wise idea. Also, some filters are washable, which means you can get more life out of them before it's time to replace them.\nMost of these tasks take just a few minutes but offer great returns in keeping your home cleaner.\nCordless vacuum FAQs\nHow important is suction power in a cordless vacuum?\nSuction matters because it's a good measure of how well a cordless vacuum cleans on different surfaces. Not surprisingly, the Eureka ReactiSense 440 was a powerful performer in our tests, particularly in our sand tests, where it removed the largest cumulative amount of sand from our hardwood, low-pile carpet and midpile carpet test floors.\nAre pricey Dyson vacuums worth the money?\nCredit to Dyson for pioneering the cordless vacuum category with its capable -- but pricey -- Cyclone V series stick vacs. Years and models later, Dyson remains a key player in 2025 but it’s not as dominant in our cleaning tests as it was five or 10 years ago. Now, several competitors can go head-to-head with Dyson on our test floors including Shark Ninja, Levoit and others.\nEven so, Dyson vacuums consistently perform well and often include unique features like dust-revealing lasers and auto-adapting brush rolls, thanks to the British company’s years of in-house research and design improvements. For many households, these innovations make Dyson a worthwhile splurge.\nWhat is good suction power for a cordless vacuum?\nManufacturers will often boast about their vacuum's suction power in terms of air watts, a figure that quantifies airflow in terms of power use. Generally speaking, more air watts means a more powerful vacuum cleaner but the actual design of the vacuum head plays a significant role too. The tighter a vacuum is against the floor, the greater the suction. If it's too tight against the floor, larger bits of debris won't be able to make it underneath the cleaning head at all. The type of flooring you're trying to clean makes a big difference, too.\nThat's why CNET puts each vacuum we review through rigorous and controlled cleaning tests to get a better sense of how its cleaning capabilities compare across different surfaces and concerning different-sized bits of debris.\nWhat's the difference between upright and stick vacuums?\nUpright vacuums are the traditional options that most likely come to your mind when thinking of a vacuum -- sturdy, with a large canister and a wide cleaning head. They often come with various attachments and sometimes even have adjustable settings. Because these are more powerful, they are ideal for deep cleaning carpets.\nStick vacuums, on the other hand, are sleek, modern and lightweight. They are fantastic for quick cleanups, especially if you have a smaller living space or a mix of flooring types. Picking between upright and stick will come down to various factors, including flooring type and size of the space.\nWhat's the best cordless vacuum for pet hair?\nThe best cordless vacuum for pet hair is our best overall, the ReactiSense 440. With a brush designed to dig deep into carpet and powerful suction on all surfaces, it proved great at removing fur from hard and soft surfaces.\nWhat's the best cordless vacuum for carpets?\nThe Eureka ReactiSense 440, the Dyson V15 Detect and Shark Stratos are all among our top picks for cleaning carpets with scores for low-pile and midpile that were higher than 90%. For other options, take a look at our list of the best vacuums for carpets.\nWhat's the best cordless vacuum for hardwood floors?\nAll of the vacuums on our list do well on hard flooring, with the highest scores belonging to the Eureka ReactiSense 440, the Shark Stratos, the Dyson V15 Detect, Dreame Z30, and others. Most cordless vacuums also do well on hard flooring, so you won't go wrong with any of these picks."
    }
  ],
  "argos_summary": "Roborock unveiled a new product line at IFA 2025 that expands beyond its well‑known robot vacuums to include three robot lawnmowers—RockMow Z1, S1 and RockNeo Q1—equipped with all‑wheel drive, RTK/VSLAM navigation and up to 80% slope handling. The company also introduced a range of stick vacuums and an ultra‑thin robot vacuum (Qrevo Curv 2 Pro) featuring a 7.98‑cm thickness, 25,000 Pa suction and dual‑spinning mops, as well as a self‑sanitizing wet‑and‑dry vacuum (F25 Ultra) that uses steam and hot water for deep cleaning. These new models emphasize advanced mapping, edge‑cutting precision, and autonomous docking, positioning Roborock as a broader player in the automated home‑care market.",
  "argos_id": "BCT6BMACL"
}