{
  "url": "https://www.forbes.com/sites/hughmcintyre/2025/09/04/ringo-starr-is-back-on-the-charts/",
  "authorsByline": "Hugh McIntyre",
  "articleId": "31d7c312a46340e7ad76774f3402c8af",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://specials-images.forbesimg.com/imageserve/68b8c792d00eeb0a5d77f16d/Starr-At-Melody-Maker-Awards/960x0.jpg?cropX1=0&cropX2=2046&cropY1=153&cropY2=1305",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T13:30:00+00:00",
  "addDate": "2025-09-04T13:36:39.760529+00:00",
  "refreshDate": "2025-09-04T13:36:39.760530+00:00",
  "score": 1.0,
  "title": "Ringo Starr Is Back On The Charts",
  "description": "Ringo Starr returns to the U.K. charts as “Crooked Boy” and “Rewind Forward” reenter the Official Physical Singles tally, extending their chart runs.",
  "content": "Ringo Starr returns to the U.K. charts as “Crooked Boy” and “Rewind Forward” reenter the Official Physical Singles tally, extending their chart runs. Drummer Ringo Starr of the Beatles at the Melody Maker awards, London, 13th September 1966. Readers of the magazine have voted the Beatles best group in both the British and International Sections. (Photo by Mark and Colleen Hayward/Getty Images)\n\nRingo Starr has enjoyed a lengthy solo career outside of The Beatles. All four members carved out their own musical path, and both he and Paul McCartney are still releasing new music decades after the group’s breakup. In recent years, Starr has experimented with different styles — even stepping into country recently — and now a pair of singles from his latest EPs are back on the U.K. charts, where he remains a legend.\n\n“Crooked Boy” reappears on the Official Physical Singles chart at No. 42. The tune comes close to returning to the top 40 region, which it has visited before. The cut previously peaked as high as No. 2, just barely missing out on giving Starr a late-in-career champion.\n\n“Rewind Forward” Is Back as Well\n\nAlongside “Crooked Boy,” “Rewind Forward” also finds its way back to the same ranking. The tune returns to the list at No. 64. Earlier in its life, it rose as high as No. 4.\n\nThe two returning Starr tracks have spent months – 29 weeks for “Crooked Boy” and 39 for “Rewind Forward” – on the Official Physical Singles chart, which ranks the bestselling tunes in the U.K. on formats like CD, vinyl, and cassette. Neither has been absent for long, as it’s only been a few weeks since either title was last seen on the roster.\n\nThroughout his solo career, Starr has now placed solo five cuts onto the Official Physical Singles chart. Four of those have reached the top 10, with one even climbing all the way to No. 1. That honor belongs to “World Go Round,” which stands as his only chart-topper on the list to date.",
  "medium": "Article",
  "links": [
    "https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.forbes.com/sites/hughmcintyre/2025/07/29/ringo-starr-casually-announces-a-new-album/&ved=2ahUKEwifmdXS172PAxWXJEQIHQWCFCgQxfQBKAB6BAgIEAE&usg=AOvVaw3TbndxqZ39g6PZ9_JAFKhD",
    "https://www.youtube.com/watch?v=UiVzVSl9Hos",
    "https://www.youtube.com/watch?v=CTbrOClyA-M"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ringo Starr",
      "weight": 0.09982995
    },
    {
      "name": "Drummer Ringo Starr",
      "weight": 0.09572093
    },
    {
      "name": "Starr",
      "weight": 0.090073004
    },
    {
      "name": "the Official Physical Singles chart",
      "weight": 0.077445105
    },
    {
      "name": "Rewind Forward",
      "weight": 0.07286392
    },
    {
      "name": "best group",
      "weight": 0.07124127
    },
    {
      "name": "No",
      "weight": 0.069303885
    },
    {
      "name": "U.K.",
      "weight": 0.06764321
    },
    {
      "name": "Colleen Hayward",
      "weight": 0.06759283
    },
    {
      "name": "World Go Round",
      "weight": 0.067493826
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.85888671875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.84619140625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.56396484375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Music Reference",
      "score": 0.487548828125
    }
  ],
  "sentiment": {
    "positive": 0.37605757,
    "negative": 0.17659922,
    "neutral": 0.4473433
  },
  "summary": "Ringo Starr has returned to the U.K. charts with \"Crooked Boy\" and \"Rewind Forward\" reenter the Official Physical Singles tally, extending their chart runs. The songs have previously spent months on the chart, spending time on formats like CD, vinyl, and cassette. This marks the second time that Starr has managed to return to the top 40. Both he and Paul McCartney have released new music decades after their Beatles split.",
  "shortSummary": "Ringo Starr returns to the U.K charts with \"Crooked Boy\" and \"Rewind Forward,\" extending their chart runs, with \"World Go Round\" topping the charts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cad8acde66e44f74bfed3b9c7b8c948b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ringo Starr’s singles “Crooked Boy” and “Rewind Forward” have re-entered the UK Official Physical Singles chart, reaching No. 42 and No. 64 respectively. The tracks have spent 29 and 39 weeks on the chart, respectively, and are close to their previous peak positions. Starr’s solo career has seen five entries on the chart, including a No. 1 hit with “World Go Round.”",
  "argos_id": "BT4LMOX1P"
}