{
  "url": "https://www.forbes.com/sites/hughmcintyre/2025/09/04/stray-kids-reach-never-before-seen-heights-on-every-chart-with-new-album/",
  "authorsByline": "Hugh McIntyre",
  "articleId": "7149bdee005e4878a499a601660c2b99",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/655d1eccae7c8839c31b2d02/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T19:30:23+00:00",
  "addDate": "2025-09-04T19:40:30.205691+00:00",
  "refreshDate": "2025-09-04T19:40:30.205692+00:00",
  "score": 1.0,
  "title": "Stray Kids Reach Never-Before-Seen Heights On Every Chart With New Album",
  "description": "Stray Kids score career highs in the U.K. with Karma, debuting across six albums charts while new single “Ceremony” adds to the group's growing tally of hits.",
  "content": "Stray Kids release new music several times a year, and the audience shows up every time. In the United Kingdom this week, Karma becomes a career-defining win for the group – another one, that is – as the set delivers new all-time best showings for the band on every tally it touches this frame.\n\nThe latest from the K-pop favorites opens at No. 5 on the Official Album Downloads chart this frame, becoming the fifth-most-downloaded title in the U.K. Karma becomes Stray Kids’ fifth top 10 on the tally and the group’s new highest-rising win. Previously, the South Korean powerhouses topped out at No. 7 with both Rock-Star and Ate.\n\nStray Kids Reach a New High on the Biggest Album List\n\nOn the all-consumption Official Albums chart, Karma begins at No. 22 — a new best for the band. The just-released project improves upon 5-Star, which peaked at No. 40 back in 2023. The most recent entry before Karma, Hop, only managed to hit No. 91 in December 2024, so a top 30 arrival marks a major step up from just months ago.\n\nThe set also delivers a first for Stray Kids on the Official Albums Sales chart: a top 40 smash. Karma debuts at No. 12 on the all-format sales ranking, sailing past the group’s prior peak with Ate (No. 42).\n\nA Streaming Win as Well with Karma\n\nOn the Official Albums Streaming chart, Karma sneaks in and becomes a new highest appearance for the group as well. The new album opens at No. 33 — just ahead of the No. 35 high 5-Star managed in June 2023.\n\nKarma introduces Stray Kids to two rankings the singers hadn’t reached before in the U.K. The project appears at No. 19 on the Official Physical Albums chart and at No. 13 on the Official Vinyl Albums roster. As first entries, both immediately stand as the band’s high-water marks on those lists.\n\nThe album rollout is paired with a new singles win. “Ceremony” debuts at No. 37 on the Official Singles chart, adding to the group’s growing collection on the main songs list, which is now up to six in total. The cut also starts at No. 29 on the Official Singles Sales tally, No. 25 on the Official Singles Downloads list, and No. 68 on the Official Streaming roster.",
  "medium": "Article",
  "links": [
    "https://www.youtube.com/watch?v=P7vBoGWoReg",
    "https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.forbes.com/sites/hughmcintyre/2025/07/09/stray-kids-push-multiple-albums-back-to-the-billboard-charts/&ved=2ahUKEwiYoaep3b-PAxVql-4BHX0AELYQxfQBKAB6BAgOEAE&usg=AOvVaw0cuJnCdMoi3HTh616PM7op"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Official Albums",
      "weight": 0.10863582
    },
    {
      "name": "No",
      "weight": 0.10787263
    },
    {
      "name": ".",
      "weight": 0.10611905
    },
    {
      "name": "Stray Kids",
      "weight": 0.10126917
    },
    {
      "name": "New Album",
      "weight": 0.09794472
    },
    {
      "name": "new music",
      "weight": 0.09377238
    },
    {
      "name": "Karma",
      "weight": 0.08190984
    },
    {
      "name": "the Official Albums Sales chart",
      "weight": 0.075600676
    },
    {
      "name": "the Official Albums Streaming chart",
      "weight": 0.07495745
    },
    {
      "name": "the Official Physical Albums chart",
      "weight": 0.073701374
    }
  ],
  "topics": [
    {
      "name": "Music"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.92333984375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.8818359375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Music Reference",
      "score": 0.41064453125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.396484375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/World Music",
      "score": 0.338134765625
    }
  ],
  "sentiment": {
    "positive": 0.603619,
    "negative": 0.058524597,
    "neutral": 0.33785638
  },
  "summary": "Stray Kids' new album, Karma, has achieved new milestones in the United Kingdom, reaching a new high on all-encompassing charts. The album opens at No. 5 on the Official Album Downloads chart, becoming the fifth-most-downloaded title in the UK. It also becomes Stray Kids’ fifth top 10 and their highest-rising win. The set also debuted a top 40 smash on the official album's sales chart, reaching No. 12 on the all-format sales ranking. The single \"Ceremony\" debuted on the main song list, adding to Stray's growing collection on the overall list.",
  "shortSummary": "Stray Kids post-election success with their new album Karma, debuting at No.5 on the Official Album Downloads chart, achieving career-defining highs in various charts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "19428528bcff403b8db95d037dac6263",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Stray Kids’ new album \"Karma\" achieved record-breaking positions across six UK charts, debuting at No. 5 on the Official Album Downloads chart and No. 22 on the Official Albums chart, their highest ever. The release also entered the Official Physical and Vinyl Albums charts for the first time, at No. 19 and No. 13 respectively. Additionally, the single \"Ceremony\" entered the Official Singles chart at No. 37, adding to the group’s growing catalog of hits. Overall, the album marks a significant commercial milestone for the K‑pop group in the UK market.",
  "argos_id": "GWB3XHXMU"
}