{
  "url": "https://www.usatoday.com/story/opinion/columnist/2025/09/04/kennedy-vaccines-florida-vaccine-mandate-shots-kids/85973405007/",
  "authorsByline": "Louie Villalobos",
  "articleId": "b458a138142144fd9b78508f2fe21bfd",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/09/04/USAT/85971116007-rfk-jr-senate-hearing-01-dcb.jpg?crop=5253,2957,x0,y0&width=3200&height=1802&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T19:30:25+00:00",
  "addDate": "2025-09-04T19:36:44.527486+00:00",
  "refreshDate": "2025-09-04T19:36:44.527488+00:00",
  "score": 1.0,
  "title": "Florida looks to ban vaccine mandates. Do you agree? Are shots safe? Tell us.",
  "description": "Do you believe there should be nationwide vaccine mandates? Or is getting a shot solely a personal decision? Take our poll.",
  "content": "Florida has announced that it will end all vaccine requirements for children across the board.\n\nThis comes as Health and Human Services Secretary Robert Kennedy Jr. continues to reshape how the federal government treats vaccines, which has included removing topic experts and firing vaccine experts.\n\nIn response, the states of California, Oregon and Washington have formed an alliance to create their own vaccine guidelines, and several states in the northeast are working on their own guidance to counter the new federal approach.\n\nWho should decide who gets vaccinated? Tell us your thoughts on vaccines.\n\nWhat we're seeing is the rise of regional and state-specific rules for our lives and a seemingly growing willingness for Americans to have different American experiences, based on political beliefs.\n\nSo today, we want to ask you, our readers, if you agree with this patchwork approach to our lives. It doesn't have to be specific to vaccines, but we want to know if you think America is headed toward more of this regionalism and if you agree with that shift because we've seen the same trend with things like education and access to abortion. Fill out the poll below or send us an email to forum@usatoday.com with the subject line \"Forum Vaccines.\" We'll publish a collection of your responses featuring all sides of the conversation.\n\nHere are some questions for you to consider:\n• Have your attitudes toward vaccines changed? How so? What do you attribute that to?\n• Is getting a vaccine solely a personal decision, or do individuals have a societal responsibility to protect those who are susceptible to disease, the elderly, children and those who can't get vaccinated?\n• Do you believe there should be nationwide vaccine mandates? State-specific shot requirements or recommendations?\n• Do you agree with this patchwork approach to vaccines and other health care, like abortion? Why or why not?\n\nLouie Villalobos is the director of opinion for Gannett. You'll find him playing video games with his son and looking for ways to make sure his family has access to vaccines.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/news/health/2025/09/03/covid-vaccine-recommendations-fall-2025/85941080007/",
    "https://www.usatoday.com/story/news/politics/2025/09/04/rfk-jr-testifies-senate-committee-live-updates/85954704007/",
    "https://www.usatoday.com/story/opinion/2025/09/01/trump-kennedy-hhs-mrna-vaccine-covid/85833361007/",
    "https://www.usatoday.com/picture-gallery/news/nation/2025/03/14/measles-cases-on-the-rise-vaccines/82379362007/",
    "https://www.usatoday.com/news/politics/robert-f-kennedy-jr/",
    "https://www.nbcboston.com/news/local/northeastern-states-consider-regional-approach-to-vaccine-guidance-after-cdc-changes/3795702/",
    "https://puzzles.usatoday.com/quick-cross",
    "https://www.nbcnews.com/health/health-news/florida-surgeon-general-says-state-will-eliminate-vaccine-mandates-rcna228835",
    "https://www.axios.com/2025/09/03/cdc-vaccine-washington-california-oregon-guidelines-recommendations",
    "https://www.usatoday.com/story/news/politics/2025/09/03/ron-desantis-florida-vaccine-requirements/85956743007/",
    "https://www.cnn.com/2025/09/03/politics/trump-rfk-vaccines-covid-florida-analysis"
  ],
  "labels": [
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "vaccine mandates",
      "weight": 0.11665218
    },
    {
      "name": "vaccine experts",
      "weight": 0.11643982
    },
    {
      "name": "vaccines",
      "weight": 0.116001554
    },
    {
      "name": "nationwide vaccine mandates",
      "weight": 0.11084032
    },
    {
      "name": "several states",
      "weight": 0.07626846
    },
    {
      "name": "their own vaccine guidelines",
      "weight": 0.068990715
    },
    {
      "name": "Robert Kennedy Jr.",
      "weight": 0.06568034
    },
    {
      "name": "different American experiences",
      "weight": 0.06514752
    },
    {
      "name": "all vaccine requirements",
      "weight": 0.063416526
    },
    {
      "name": "State-specific shot requirements",
      "weight": 0.058068216
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.92333984375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.91748046875
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.7890625
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.732421875
    },
    {
      "name": "/News/Health News",
      "score": 0.6025390625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.331787109375
    }
  ],
  "sentiment": {
    "positive": 0.13755724,
    "negative": 0.45457032,
    "neutral": 0.40787235
  },
  "summary": "Florida has announced it will end all vaccine requirements for children across the board, a move that has led to an increase in regional and state-specific rules for American life. This comes as Health and Human Services Secretary Robert Kennedy Jr continues to reshape the federal government's approach to vaccines. California, Oregon, and Washington have formed an alliance to create their own vaccine guidelines, and several states in the northeast are working on their own guidance to counter the federal approach. The article asks readers to share their thoughts on whether individuals should be responsible for protecting vulnerable individuals or those who are susceptible to disease, the elderly, children, and those who can't get vaccinated.",
  "shortSummary": "Florida plans to ban vaccine mandates, amid ongoing federal reforms and state efforts to control vaccine safety, prompting debate on regional and national attitudes towards vaccines.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "48dbccc00a2547d4adf5332413be00f4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/opinion/2025/09/01/trump-kennedy-hhs-mrna-vaccine-covid/85833361007/",
      "text": "America needs warp speed on vaccines, not RFK Jr.'s warped decision making | Opinion\nIn the realm of scientific advances, mRNA is special. It is as transformational to medicine as the internet was to communication.\nThe United States recently took a dangerous step backward in its pursuit of lifesaving cures and pandemic preparedness. The Department of Health and Human Services shut down 22 federally funded mRNA vaccine programs, representing $500 million in strategic biomedical research.\nThat threatens one of the most transformative technologies in modern medicine.\nPerhaps even more alarmingly, HHS Secretary Robert F. Kennedy Jr., alongside the director of the National Institutes of Health, made numerous false assertions about mRNA technology. These statements could stifle American innovation, impairing our nation's ability to compete with economic rivals and defend ourselves from biothreats.\nmRNA vaccines are transformational\nIn the realm of scientific advances, mRNA is special. It is as transformational to medicine as the internet was to communication.\nUnlike traditional vaccines, which can take years to develop and longer to manufacture at scale, mRNA platforms enable medical researchers to design targeted interventions in days and manufacture them within weeks.\nThis speed and precision in delivering instructions that train immune systems to recognize and eliminate threats − from COVID to cancer − provides America a critical weapon against pandemics, bioweapons and other deadly diseases that could affect American families.\nChina understands these facts, which is why it is pouring billions into next-generation biotechnology to capture global leadership.\nThe technology has been studied for nearly two decades, but a real breakthrough occurred during the COVID-19 crisis, when mRNA helped deliver vaccines years ahead of forecasts and saved millions of lives. I was honored to serve on the White House Coronavirus Task Force under the leadership of President Donald Trump, who made the bold call to invest in mRNA's speed and effectiveness.\nThrough that initiative, known as Operation Warp Speed, American scientists gained the resources to innovate without bureaucratic delay. I worked alongside national and local leaders to ensure these efforts were grounded in science and safety, and that clinical trials included women and underserved minorities.\nThe result, as President Trump recently declared, \"was one of the most incredible things ever done in this country.\" Within months, vaccines were authorized and distributed nationwide.\nYet today, HHS is disparaging and dismantling the same mRNA technology that proved America could deliver cures at warp speed. And its decision doesn't merely halt work on COVID-19 and influenza vaccines. It also guts ongoing vaccine research for cancer, HIV, malaria, tuberculosis and other high-mortality diseases.\nRolling back progress on medical research\nIn oncology, mRNA is enabling personalized cancer vaccines that target a patient's unique tumor mutations, destroying cancer cells while sparing healthy tissue. In one trial, combining an mRNA vaccine with standard immunotherapy reduced melanoma recurrence or death by nearly half.\nEarly pancreatic cancer data shows patients who responded to an mRNA vaccine remained cancer free far longer than non-responders. This technology could eventually allow Americans to be treated with vaccines tailored to their individual cancer types, instead of receiving chemotherapy or bone marrow transplants.\nIn HIV research, early-stage mRNA vaccines have produced protective antibodies in 80% of trial participants – progress that could transform treatment from a daily drug regimen to a once-a-year shot. Malaria and tuberculosis candidates, developed by firms such as BioNTech, could save millions in the developing world, which would also spark global economic development and promote stability.\nSlashing funding for mRNA vaccines will stifle future breakthroughs like these, as well as research into treatments for brain cancers, cystic fibrosis and genetic disorders once thought untreatable. Moreover, it will erode our strategic readiness for the next pandemic or bioterrorist attack.\nTrump should do what he did in 2020\nDuring the recent presidential transition, before Sec. Kennedy was confirmed, I temporarily rejoined HHS as an unpaid special government employee. In that role, I assessed America's potential responses to an emergent deadly strain of avian influenza.\nMy conclusion, after speaking extensively with national leaders and reviewing recent research, was that mRNA technology would be uniquely able to respond in the time frame that would be required to prevent millions of deaths.\nThis technology is not a panacea. It will not solve all our infectious and chronic disease challenges, but it is an essential part of the multifaceted strategy we must pursue.\nWe need to continue research into mRNA – as well as research and development of traditional vaccines, vaccines based on other novel platforms, home testing to help patients rapidly diagnose their conditions, and antiviral medicines, like those for COVID, HIV and Hepatitis C, that can be curative and lifesaving.\nThe nation that wins the biomedical innovation race will set the terms for global health security for decades to come. President Trump should again do what he did in 2020: bet on American innovation and exceptionalism to harness mRNA's potential, protect our national security and lead the world into the next era of health.\nBrett P. Giroir is CEO of Altesa BioSciences. He was the assistant secretary for health and acting Food and Drug Administration commissioner during President Donald Trump's first administration."
    },
    {
      "url": "https://www.cnn.com/2025/09/03/politics/trump-rfk-vaccines-covid-florida-analysis",
      "text": "Health and Human Services Secretary Robert Kennedy Jr. promised during his confirmation hearing that he’s not anti-vaccine.\nBut in another Senate hearing Thursday he will have to answer for a series of dramatic steps that cast doubt on his word — and threaten to destroy health protections that have saved millions of lives.\nSince becoming America’s top health official, Kennedy has purged top government vaccine experts, fired the director of the Centers for Disease Control and Prevention and terminated research on some lifesaving vaccines.\nThe national pro-vaccine consensus that has improved life expectancy over generations has splintered. On Wednesday, for example, Florida moved to end constitutionally upheld vaccine requirements for school kids and three Democratic-run states banded together to offer public health guidelines, reasoning that federal bodies once seen as a global gold standard could no longer be trusted.\nAlready, the consequences for the health of Americans look enormous.\nThursday’s Senate Finance Committee hearing will be an early test of whether the nation’s sharply divided politics will bear Kennedy’s radical policy changes and of the strength of President Donald Trump’s support for the lightning rod HHS chief. Democrats will try to begin a process of making Kennedy politically radioactive to punish Trump for picking him.\nCommittee Republicans face a choice between supporting Kennedy’s actions, some of which are popular with their party’s base, and spurning decades of proven scientific research.\nThe spotlight will be especially bright on Louisiana Sen. Bill Cassidy, a physician who, wearing his other hat as chair of the Senate Health, Education, Labor and Pensions Committee, helped secure Kennedy’s confirmation and said he’d secured assurances that Kennedy’s anti-vaxxer past would not translate into policy.\nCassidy, who faces a GOP primary in his 2026 reelection bid, could be torn between a desire not to anger Trump and a medical professional’s reverence for science. The two-term Louisiana senator declined to tell CNN’s Manu Raju this week whether he regrets his vote to confirm Kennedy or whether he trusts him.\nDemocrats have demanded Kennedy’s resignation over purges of CDC leaders. Vermont independent Sen. Bernie Sanders, a Finance Committee member, warned last week that history will not look kindly on those who fail to stop RFK Jr.’s “dangerous anti-vaccine crusade.”\nKennedy has become the most urgent example of how Trump’s attempts to dismantle pillars of the establishment — in this case, the public health system — could deeply change the country, potentially in dangerous ways.\nPolitics is now dictating key decisions on vaccines\nFormer top CDC officials warn that RFK Jr. is already destroying infrastructure that has saved millions of lives with his anti-scientific ideas that suit Trump’s political ambitions.\nBut in the short term, their high-profile warnings can be a political plus for Trump. His insurgent political project relies on making bureaucrats and elite luminaries squeal and forcing Democrats to defend institutions that many Americans believe have let them down.\nAccess to vaccines, however, is a matter of life and death. Former subordinates say Kennedy is spurning the science-based expertise of government scientists as he swings at critical institutions and protocols. Their warnings show that more serious consequences are at play than Trump’s immediate political prospects.\nA group of former CDC directors or acting directors warned in a New York Times op-ed Monday that Kennedy was endangering every American’s health after he fired the recently confirmed CDC Director Dr. Susan Monarez last week over differences in vaccine policy and her refusal to dismiss staff. They warned that his actions were “unlike anything our country had ever experienced.”\nOne of their number, Dr. Tom Frieden, said on CNN’s “Inside Politics” Sunday that Kennedy and Trump were on a mission to deny, distract and destroy, on vaccines and by dismantling other health protections. “We are less safe,” Frieden said.\nA coalition of health industry groups, including the Infectious Diseases Society of America, the American Public Health Association and the American Association of Immunologists, joined many current and former HHS employees on Wednesday in demanding Kennedy’s resignation, warning that forcing CDC experts to “turn their back on decades of sound science” makes “Americans less safe in a multitude of ways.”\nBut in a Wall Street Journal op-ed, RFK Jr. claimed to be restoring public confidence in the CDC. “Bureaucratic inertia, politicized science and mission creep have corroded that purpose and squandered public trust,” he wrote.\nKennedy argued the CDC’s actions have been neither “pro-vax” nor “anti-vax” but instead apply what he calls “gold standard” science. But in comments that will set alarm bells ringing, he said Americans elected Trump — who has no medical qualifications and who promoted debunked Covid-19 remedies — to set health policy. And he hinted about alleged links between vaccines and antibiotics to chronic diseases that experts reject.\nKennedy is the man for a skeptical GOP moment\nKennedy’s ascent to running American public health was on the result of a confluence of political forces. His split from the Democrats and his independent political run for president made him a natural ally for Trump, whom he endorsed in 2024. Kennedy’s anti-vaccine past was also a good fit for the times, as he won approval from Trump’s voters over his condemnation of measures used by government public health officials to try to protect Americans during the Covid-19 pandemic.\nDuring dark months in 2020, prolonged school closures, advice on masking, the temporary shuttering of the economy and social distancing clashed with the individualist streak among many Americans and became a rallying call for conservative politicians.\nIn retrospect, some of the recommendations of senior officials who were learning about a novel coronavirus as they went along seem misguided. And some voters balked at what they viewed as the imperious tone of some officials, fueling an existing skepticism among Trump supporters about experts and people they see as liberal elites.\nThe skepticism of US public health institutions cannot be underestimated among Trump voters and is widespread on social media.\nRFK Jr. probably would never have reached HHS but for the pandemic. His decisions appear refracted through his long-held unorthodox theories, openness to medical industry dissenters, a selective reading of science, and views that commonly used vaccines are in some cases not safe or were not properly tested.\nHe’s therefore politically useful to Trump because he taps into anti-elite anger and the lasting effects of the pandemic on politics.\nKennedy’s campaign to “Make America Healthy Again” by lessening reliance on processed foods, stressing exercise and eliminating additives like food dyes enjoys more support across the medical community than his vaccine heresy. Crucially, it is also popular with a coalition of voters, from suburban moms to independents, who might otherwise not be available to the president. This bloc could be critical in close races in next year’s midterm elections if Republican turnout is depressed without Trump on the ballot.\nStill, there is growing evidence that while Kennedy is popular in Trump’s cohort of voters, radical attempts to restrict vaccines could prove broadly unpopular, as CNN’s Aaron Blake reported Wednesday.\nRFK faces fateful decision on American health care\nAside from Thursday’s hearing, Kennedy’s impact on the nation’s health will grow imminently. He has promised Trump information this month on the causes of autism, after having spent years pushing claims — discredited by multiple scientific investigations — of a link between the condition and childhood inoculations. The confirmation process of a new permanent CDC chief is likely to be a flashpoint moment that will show whether GOP senators have the chops to safeguard public heath when doing so would require a break with their grudge-bearing president.\nThe first deliberations of the CDC’s new Advisory Committee on Immunization Practices will be closely watched. The panel of independent experts has huge power to reshape American health care, since its recommendations influence what vaccinations insurance companies and programs like Medicaid will cover. Kennedy fired all 17 members of the panel in June and chose some replacements who shared his vaccine skepticism.\nCassidy said in supporting Kennedy’s confirmation vote that the future HHS secretary had pledged to “work within the current vaccine approval and safety monitoring systems” and to maintain the vaccine advisory committee “without changes.” Cassidy has called for the next meeting of the CDC advisory committee to be postponed until “significant oversight has been conducted.”\nKennedy has also taken other steps to curtail the availability of vaccines. Last week, the administration narrowed access to the latest version of the Covid-19 vaccine. Kennedy has also terminated federal funding for mRNA vaccines — a category of therapies that ended the Covid-19 emergency and would allow for the swift development of new treatments in the event of a new pandemic. This is in addition to billions of dollars in halted research and development as part of Trump’s assault on elite universities, which has hampered research on diseases like cancer and Alzheimer’s\nTrump wants credit for the Covid-19 vaccines he slanders\nTrump exemplifies the fault line between conservative politics and medical research. In recent weeks he’s publicly complained about this inability to fully benefit politically from one of the legacy achievements of his first term — the Operation Warp Speed drive toward a Covid-19 vaccine.\nOn Truth Social, Trump simultaneously lauded the vaccines and raised doubts about their credibility. He demanded drug companies justify their success, claiming the CDC was being “ripped apart” over the issue. “Many people think they are a miracle that saved Millions of lives. Others disagree!” he wrote.\nMultiple studies have shown the vaccines did indeed save millions of lives. Pfizer responded to Trump with a list of 200 news releases and statements and 27 peer-reviewed data publications proving the point — and fellow vaccine makers Moderna and Novavax shared their own thorough lists of data on safety and effectiveness.\nThe administration’s constant raising of doubt about vaccines can be hugely damaging. Several recent measles outbreaks have shown the danger of even a relatively small decline in vaccination rates. RFK Jr. showed some support for measles vaccines but also called them a “personal” choice.\nA wider political turn against vaccines could be very damaging. Florida’s attempt to end school vaccine requirements, for instance, could not only endanger kids who don’t get their injections, but also expose people who are too young or vulnerable to get the vaccinations to diseases such as polio, measles or tetanus.\nFlorida’s Surgeon General Dr. Joseph Ladapo said Wednesday that the decision, which could lead to similar moves from other conservative states, was intended to eradicate what he referred to as “mandates.” He said the setting of vaccine schedules “is wrong and drips with disdain and slavery.”\nThis justification of changes on political rather than evidential grounds is characteristic of the populist conservatism epitomized by Trump.\nOn many issues, there’s little immediate price for Trump’s disruption. It’s hard to quantify the impact of firing experts at the Department of Education, for example. And most Americans will never see the effect of eradicating the US Agency for International Development on HIV/AIDS rates in Africa.\nBut the consequences of the assault on US public health protocols led by RFK Jr., one of Trump’s most shocking Cabinet picks, may soon be painfully obvious."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/09/03/ron-desantis-florida-vaccine-requirements/85956743007/",
      "text": "Florida moves to kill vaccine mandates; state surgeon general calls them ‘slavery’\n'Who am I to tell you what your child should put in their body?' the state's top public health official said.\n- Florida officials announced the state will work to end all vaccine mandates.\n- Florida law currently requires immunizations for several communicable diseases, including polio and measles.\n- The state has recently seen a significant increase in whooping cough cases and a measles outbreak.\nFlorida is moving to end all vaccine mandates in the state.\n“Every last one of them is wrong and drips with disdain and slavery,” said Dr. Joseph Ladapo, Florida's surgeon general, at a Sept. 3 press conference in Valrico, Hillsborough County.\n“Who am I to tell you what your child should put in their body? I don’t have that right. Your body is a gift from God,” Ladapo said.\nVaccine requirements are in state law. Ladapo, the state's top public health official, said lawmakers will “have to choose a side.” To those who don’t want to get vaccinated, he said, “God bless you.”\nThe press conference was a chance for Ladapo, Gov. Ron DeSantis, Lt. Gov. Jay Collins and other state leaders, including Education Commissioner Anastasios Kamoutsas and state lawmakers to appeal to the growing anti-vaccination movement.\nLadapo said the Florida Department of Health, which he heads, will repeal the rules within his purview that require vaccines, and that the governor and the Legislature will work to repeal the rest.\nAccording to Florida law, immunizations are required for polio, diphtheria, rubeola, rubella, pertussis, mumps, tetanus, and other communicable diseases as determined by rules promulgated by the Department of Health.\nIn a statement, the head of the American Academy of Pediatrics disagreed with Florida decision.\n\"The AAP believes every family should have access to immunizations to keep their community healthy. Schools are an important part of that community,\" said AAP President Dr. Susan J. Kressly. \"For many kids, the best part of school is being with friends — sharing space, playing on the playground and trading germs. Close contact makes it easy for contagious diseases to spread quickly. That’s why most schools require routine childhood immunizations. When everyone in a school is vaccinated, it’s harder for diseases to spread, and easier for everyone to keep the fun and learning going. When children are sick and miss school, parents also miss work, which not only impacts those families, but also the local economy. We are concerned that today's announcement by Gov. DeSantis will put children in Florida public schools at higher risk for getting sick, and have ripple effects across their community.\"\nThe announcement was paired with the creation of a state version of a “Make America Healthy Again” commission, which will be led by First Lady Casey DeSantis.\nAt the federal level, MAHA is led by U.S. Health and Human Services Secretary Robert F. Kennedy Jr., tasked with investigating chronic illness and delivering an action plan to fight childhood diseases.\nKennedy, however, has promoted misinformation on vaccines in the past, and recently fired Susan Monarez as the Centers for Disease Control director after a dispute over vaccination policy.\n“I really applaud what they’re doing at the national level with the MAHA movement,” Casey DeSantis said. “A lot of these drugs, you don’t need them if you live a healthy lifestyle. If you’re eating fruits and vegetables, you can reverse a lot of these chronic conditions.”\nGov. DeSantis called out pediatricians who refuse to accept patients whose parents don’t want to vaccinate their children: “Unless there’s a really clear reason to put something in, then I wouldn’t do it.”\nDuring his comments, DeSantis restated his anti-mask and anti-COVID mandate sentiments, criticizing Anthony Fauci, the American Academy of Pediatrics and other medical experts over their stance on COVID-19 protocols. Fauci was the director of the National Institute of Allergy and Infectious Diseases at the height of the COVID-19 pandemic.\nAt the time, the governor’s office also sold “Don’t Fauci My Florida” merchandise. “When they were saying follow the science, they were really saying follow their political science,” DeSantis said.\nHe touted the state’s decision to keep schools and businesses open in the fall of 2020 and 2021 when other states and medical experts wanted to keep mask mandates and establish social distancing policies.\n“People needed a voice of reason and sanity, and the state of Florida filled that void, not just for the state but for our country,” DeSantis said.\nAt the end of the first phase of the COVID-19 pandemic in the United States, Florida ranked 26th in deaths per capita, then rose to 10th a few months into the Delta wave in 2021.\nLast year, the number of whooping cough cases in Florida soared. From Jan. 1, 2024 to Dec. 31, 2024, the Florida Department of Health reported 715 cases of pertussis – an eight-fold increase over the year before, which had 85 cases.\nCurrently in Florida, the vaccination rate for those who have completed all five doses of the TDAP vaccine, which prevents tetanus, diphtheria and pertussis, is about 88.1%. Herd immunity for pertussis requires 92% to 94%.\nAs previously reported, in 2024, a measles outbreak in Miami-Dade resulted in nine infections. DOH's response at the time was criticized after Ladapo contradicted federal and medical professional guidance to contain the spread.\nAccording to the CDC, only 88.1% of kindergarteners in Florida were vaccinated against measles in 2023-24. Herd immunity for measles requires a 95% vaccination rate.\nAna Goñi-Lessan, state watchdog reporter for the USA TODAY Network – Florida, can be reached at agonilessan@gannett.com."
    },
    {
      "url": "https://www.usatoday.com/news/politics/robert-f-kennedy-jr/",
      "text": "HHS workers push Kennedy to resign\nPolitics\nThree states ditch RFK's CDC with new vaccine alliance\nPolitics\nTrump demands 'proof' vaccines work amid CDC turmoil\nNews\nDeSantis takes aim at doctors, vows to kill vaccine mandates\nPolitics\nCan you get an updated COVID vaccine this fall? What we know right now.\nHealth\nHHS workers demand RFK Jr.'s resignation\nPolitics\nWhat to know about COVID this week, including variants, cases, more\nHealth\nFormer CDC directors say RFK Jr.'s actions 'should alarm every American'\nPolitics\nTrump demands drugmakers 'justify their success' with COVID vaccines\nPolitics\nRFK Jr. is wrong about mRNA vaccines. That makes us more vulnerable.\nOpinion\nMy patient just died of COVID. Under RFK Jr.'s vaccine policy, more will.\nVoices"
    },
    {
      "url": "https://www.nbcboston.com/news/local/northeastern-states-consider-regional-approach-to-vaccine-guidance-after-cdc-changes/3795702/",
      "text": "With the Trump administration making changes to its guidance on vaccines nationwide, the direction in New England is uncertain.\nThe region is taking steps toward independence from the federal government on vaccine policy months after several changes under U.S. Health Secretary Robert F. Kennedy Jr.\nStream NBC10 Boston news for free, 24/7, wherever you are.\nHealth officials from Massachusetts, Maine, Vermont, Connecticut, Rhode Island, New York, New Jersey and Pennsylvania met this week to consider coordinating their own vaccine recommendations, separate from the federal government.\nThe potential regional collaboration comes as health officials question whether Kennedy will make recommendations based on credible science.\n\"It's really important that Massachusetts take immunization policy into its own hands, in part because we simply can't trust the recommendations coming from the federal government anymore,\" said Boston University School of Public History Professor Matt Motta.\nKennedy, a longtime vaccine critic, announced in May that the Centers for Disease Control and Prevention would no longer recommend the COVID-19 vaccine for healthy children or pregnant women. In June, he fired members of the CDC's vaccine advisory committee, appointing new members who have also expressed skepticism about vaccines. This month, he pulled $500 million in federal funding for mRNA vaccine research projects.\nQuestions remain whether insurance providers will fully cover vaccines if not recommended by the CDC.\n\"If you are someone on Medicare or Medicaid, this could be a time of great uncertainty, because normally, we would expect those programs to make their coverage decisions based on what the federal government is doing, not the state government,\" said Motta.\n\"If federal and state government disagree about which vaccines should be covered under Medicaid and be paid for by Medicaid, that fight is more than likely to end up in court, and probably won't be resolved for one or two or more years,\" said Boston University School of Public History Professor Alan Sager."
    },
    {
      "url": "https://www.usatoday.com/story/news/health/2025/09/03/covid-vaccine-recommendations-fall-2025/85941080007/",
      "text": "RFK Jr., the CDC and confusing vaccine recommendations. What to know right now.\nMillions of dollars in cuts to vaccine technology. Canceled research. Mass resignations at the Centers for Disease Control and Prevention. Overhauled health councils and ever-changing guidelines that result in sparring between government officials and professional medical agencies.\nKeeping up with public health and, specifically, who can get a COVID-19 vaccine, has become more of a challenge since Health and Human Services Secretary Robert F. Kennedy Jr. took office earlier this year. Kennedy ruffled feathers in health communities in June when he upended the Advisory Committee on Immunization Practices (ACIP), replacing all 17 original members with new picks, some with a history of anti-vaccine advocacy. The committee provides guidance on vaccine use to the CDC.\nThe disruption to the usual process for approving the updated fall vaccine has resulted in a crunch where people looking for their seasonal shots suddenly are unsure if they can get them. And, with cases on the rise, new Food and Drug Administration guidance handed down in late August still hasn't provided the concrete answers many were looking for.\nHere's what we know so far about your ability to access a COVID-19 vaccine this season.\nWho is approved for a COVID-19 vaccine under FDA guidelines?\nOn Aug. 27, Kennedy announced that emergency-use authorizations for COVID-19 vaccines had been terminated. Here's what was approved.\n- Moderna, Pfizer and Novavax immunizations were approved only for \"those at high risk\" and people over 65.\n- Moderna vaccine was approved for children 6 months and older with an underlying condition and people over 65.\n- Pfizer was approved for those 5 and older with an underlying condition and people over 65.\n- Novavax was approved for those 12 and older with an underlying condition and people over 65.\nWhen announcing the restrictions, Kennedy did not specify which conditions are considered as putting people at \"high risk.\" However, the CDC lists a bevy of health conditions that make someone \"higher risk,\" including common health issues like asthma, cancer, kidney disease, diabetes, obesity, mood disorders and a history of smoking.\nIt is unclear if these factors will be the same ones used to determine eligibility for the updated COVID-19 vaccine. Pregnancy, for example, is listed as a \"high-risk\" condition here, but Kennedy previously announced the removal of pregnant women from the vaccine recommendation list.\nCan you still get the vaccine if you're not in the approved groups?\nIt depends on your state and what happens when the ACIP convenes next on Sept. 18 and 19.\nUsually, the process for placing vaccines on the CDC's formal immunization schedule begins with the FDA reviewing data and issuing its opinion on whether it should be distributed and to whom, Dr. Brigid Groves, Vice President of Professional Affairs for the American Pharmacists Association (APHA), told USA TODAY.\nThen the ACIP meets, brings forth its scientific advisors, analyzes the data, looks at the evidence and comes up with a recommendation. That recommendation then goes to the CDC director for review and independent approval, at which point the vaccine formally becomes part of the federal schedule.\nIn some cases, ACIP's final decision differs from the indications first given by the FDA, such as in the case of the shingles vaccine, which was originally recommended for people 50 and older. After a review, the ACIP decided to focus first on getting the vaccine to people at the absolute highest risk, people 65 and up, a recommendation ultimately accepted by the CDC.\nHowever, the formal federal schedule has yet to be reviewed or approved by the ACIP, which failed to pass a recommendation about the COVID-19 vaccine during its June 25-26 meeting and the July U.S. Preventive Services Task Force meeting, which was postponed. Usually, the committee makes its fall recommendations during this May or June meeting before respiratory illness season begins, said Groves.\nSome states need ACIP and CDC recommendations in place before distributing vaccines over the counter at pharmacies, while others just need FDA approval. Therefore, the vaccine may not be available via the standard walk-in process of previous years.\nThirty-four states allow pharmacists to administer vaccines without an ACIP reccomendation, including Alaska, Alabama, Arkansas, California, Connecticut, Delaware, Hawaii, Iowa, Idaho, Illinois, Indiana, Kansas, Maryland, Michigan, Minnesota, Missouri, Mississippi, Montana, Nebraska, North Dakota, New Hampshire, New Jersey, Ohio, Oklahoma, Oregon, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Vermont, Washington, Wisconsin and Wyoming.\nIn some cases, said Groves, a prescription may be necessary. In others, patients can self-attest to having a condition that qualifies them for the vaccine, meaning they assert either verbally or through a consent form that they have an underlying illness.\nShould children get the vaccine?\nOn May 27, Kennedy announced that the COVID-19 vaccine would no longer be included in the CDC's recommended immunization schedule for healthy children and pregnant women, a move that broke with expert guidance and bypassed the usual scientific review process.\nThis drew the ire of multiple professional medical organizations, including the American Academy of Pediatrics (AAP), which went as far as to release its own schedule on Aug. 19, saying the federal process was no longer credible. It recommends that all children 6 months to 23 months old receive the latest COVID-19 vaccine to reduce the chance of serious illness. Children and adolescents ages 2 to 18, without other high-risk factors like immunosuppression, can receive and should be offered the vaccine if they were not immunized before, according to the guidance.\nIn a response posted to social media, Kennedy hit back at the pediatrics academy's criticism, implying that the organization's views were influenced by corporate pharmaceutical funders.\nCan you get the COVID-19 vaccine at pharmacies?\nThe majority of Americans receive their seasonal vaccines, including COVID-19, in pharmacies. Since August 2024, more than 27 million Americans received the vaccine at a pharmacy, according to the CDC, as opposed to just 2.5 million administered in physicians' offices.\n\"You've seen a number of statements from HHS and others saying that nobody that wants a vaccine is going to be prevented from getting that, but we don't have guarantees for that,\" said Dr. Robert H. Hopkins, medical director of the National Foundation for Infectious Diseases (NFID).\nSupply will not be an issue, as 2025-2026 formulations of the vaccine have already been or are in the process of being shipped to pharmacies, said Groves.\nUntil ACIP issues its recommendations or designates an exception, people in 13 states and DC can get the vaccine at CVS only with an \"authorized prescriber’s prescription\": Arizona, Colorado, Florida, Georgia, Kentucky, Louisiana, Maine, North Carolina, New York, Pennsylvania, Utah, Virginia and West Virginia.\nPharmacies are unable to administer COVID-19 vaccines in Massachusetts, Nevada, and New Mexico, where state laws don't allow any pharmacists to give a vaccination not recommended by ACIP.\nWalgreens did not respond to USA TODAY's request for comment, but told CBS News that it was \"prepared to offer the vaccine in states where we are able to do so.\"\nWill insurance cover the COVID-19 vaccine?\nIt's not yet known how insurance companies will handle COVID-19 vaccine coverage amid changing guidance.\nCommercial health insurers are required to cover vaccines on the ACIP schedule at no cost-sharing or copay as per the Affordable Care Act, said Groves. Medicare and Medicaid plans are also required to cover vaccines based on ACIP recommendations.\nIf the ACIP follows the FDA's new recommendations, healthy people under the age of 65 with no underlying condition may have to pay out-of-pocket for the COVID vaccine, which Grove said averages around $140.\nAmerica's Health Insurance Plans (AHIP), a national trade association and lobby for health insurance providers, told USA TODAY in a statement that insurers also take into consideration recommendations from medical organizations when deciding what to cover.\nVaccines with recommendations for shared clinical decision-making from ACIP are also required to be covered at no cost, it said. The \"shared clinical decision-making\" language was applied to vaccines for children by the CDC in May after Kennedy announced the removal of recommendations for healthy children and pregnant women.\nRegardless of ACIP's decision in September, commercial insurers can only implement policy changes in the next benefit year. Changes to Medicare and Medicaid plan coverage would happen immediately, however. Doctors could prescribe the vaccine off-label to people not covered by ACIP recommendations, but AHIP said this is not a practice typically applied to vaccines.\n\"We’re working closely with our members to review [the] FDA announcement and will be monitoring the forthcoming meetings and recommendations from ACIP and CDC on considerations around coverage,\" said Tina Stow, AHIP spokesperson. \"Individual health plans and plan sponsors will be prepared to make coverage decisions informed by science, the latest medical evidence and data. This process will be evidence-based, evaluate multiple sources of data, including but not limited to ACIP, and will be informed by customer needs.”\nWhat should you do if you want the COVID-19 vaccine?\nAccess to the vaccine is largely dependent on location, at least until ACIP makes a final determination in September. Those hoping to get the vaccine but concerned that they may not be able to should first contact their medical provider to ask about their state's requirements, said Hopkins.\n\"I encourage my patients to reach out to me through our patient portal or to call the office. I'm going to help them navigate that situation. If they've got a pharmacy or a pharmacist that they work with, contact that pharmacist. They should be able to let them know what the situation is in their community,\" he said. \"But I would encourage anybody who wants to get the vaccine to get vaccinated.\""
    },
    {
      "url": "https://www.nbcnews.com/health/health-news/florida-surgeon-general-says-state-will-eliminate-vaccine-mandates-rcna228835",
      "text": "Florida Surgeon General Joseph Ladapo said Wednesday that the state will work to eliminate all vaccine mandates, a move that drew condemnation from public health experts.\n“All of them. All of them,” Ladapo said during a news conference as the crowd stood and erupted in applause. “Every last one of them is wrong and drips with disdain and slavery.\" He said the Florida Department of Health will work in partnership with the governor.\nHe said forcing vaccine mandates is “wrong” and “immoral.”\n\"Who am I as a government or anyone else, who am I as a man standing here now, to tell you what you should put in your body? Lapado said. \"Who am I to tell you what your child should put in [their] body? I don’t have that right.”\nFlorida requires current vaccinations for students going to public school. Those requirements are outlined on the Florida Health website.\nThe state is not banning vaccinations.\n“You want to put whatever different vaccines in your body, God bless you. I hope you make an informed decision,” Ladapo said. “You don’t want to put whatever vaccines in your body, God bless you. I hope you make an informed decision. That’s how it should be.”\nDr. Robert Malone, whom Kennedy recently appointed to the Centers for Disease Control and Prevention’s independent vaccine advisory committee, wrote on X that he had spoken with Ladapo on Tuesday, calling him “a measured scientist who is on fire to change the system for the better.” As a member of the advisory committee, Malone is instrumental in making recommendations to the CDC about who should get certain vaccines. He has been vocally critical of vaccines.\n“The idea that children would be allowed to go to school unvaccinated is absolutely frightening,” said Dr. Richard Besser, a former acting director of the Centers for Disease Control and Prevention and the CEO of the Robert Wood Johnson Foundation.\nDr. Susan Kressly, the president of the American Academy of Pediatrics, emphasized the importance of childhood vaccines in a statement.\n“We are concerned that today’s announcement by Gov. DeSantis will put children in Florida public schools at higher risk for getting sick, and have ripple effects across their community,” Kressly said.\nLadapo has railed against vaccines in Florida in the past, saying that people under 65 shouldn't get an mRNA Covid vaccine, at the time contradicting guidance from the Centers for Disease Control and Prevention. And during a 2024 measles outbreak in the state, he said that parents should watch for measles symptoms but could make their own decision about whether to send children to school. He did not encourage vaccination.\nLadapo's announcement came as Florida Gov. Ron DeSantis revealed the establishment of the Florida Make America Healthy Again commission, which will recommend state-level integration of President Donald Trump and Health Secretary Robert F. Kennedy Jr.'s Make America Healthy Again effort.\nThe commission will be chaired by first lady Casey DeSantis and Lt. Gov. Jay Collins. Ladapo, Agency for Health Care Administration Secretary Shevaun Harris and Department of Children and Families Secretary Taylor Hatch will also be members of the commission.\n\"The Florida MAHA commission will prioritize reforms that empower Floridians, reduce regulatory burdens and hold actors accountable for their conduct, while fostering incentives for healthy living and innovation,\" the governor said."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/09/04/rfk-jr-testifies-senate-committee-live-updates/85954704007/",
      "text": "Vaccine furor as angry senators hit RFK Jr. over CDC chaos: live updates\nSenators alarmed by chaos at the Centers for Disease Control and Prevention grilled Health Secretary Robert F. Kennedy Jr. over what some are calling his politicization of vaccine policy and his past promises not to interfere in scientific decisions.\nKennedy, a longtime vaccine skeptic, heard extensive criticism from Democratic lawmakers over his handling of the nation's health authorities. But several Republicans also hit the secretary's stance on the COVID-19 immunization – which scientists widely agree saved millions of Americans' lives.\nSen. Bill Cassidy, R-Louisiana, asked Kennedy about how he could believe President Donald Trump deserved a Nobel Peace Prize for facilitiating the COVID-19 vaccine during his first term if Kennedy previously said the vaccine \"killed more people\" than the disease. Kennedy interrupted the Republican lawmaker to deny making the comment.\nAnother Republican, Sen. John Barasso, R-Wyoming, told the heir to the American political dynasty, \"Secretary Kennedy, in your confirmation hearings you promised to uphold the highest standards for vaccines. Since then, I've grown deeply concerned.\"\n\"The public has seen measles outbreaks, leadership in the National Institutes of Health questioning the use of mRNA vaccines, the recently confirmed Director of Centers for Disease Control and Prevention fired,\" the senator added.\nHalf a dozen heated exchanges focused on Kennedy firing his hand-picked CDC director, Dr. Susan Monarez, with Trump's backing in a blowup that saw several top officials quit the agency. Kennedy maintained that her ouster was essential and accused her of lying about the reason she was dismissed.\n\"I told her that she had to resign because I asked her, 'Are you a trustworthy person?' And she said no,\" Kennedy said.\nThe Sept. 4 hearing before the Senate Finance Committee came as Kennedy’s Make America Healthy Again commission delivered an action plan to the White House to combat chronic diseases in U.S. children. That plan has yet to be released to the public.\nCatch up with USA TODAY's live coverage of Kennedy's testimony.\nWhite House defends Kennedy after Senate hearing\nWhite House Press Secretary Karoline Leavitt defended Kennedy after he faced tense questioning by both Democratic and Republican senators during a Sept. 4 hearing before the Senate Finance Committee.\nThe Health secretary \"is taking flak because he's over the target,\" she said on X several hours after the hearing concluded. “The Trump Administration is addressing root causes of chronic disease, embracing transparency in government, and championing gold-standard science.\"\nAlthough she blamed Democrats for attacking \"that commonsense effort,\" Republican senators such as Sen. Bill Cassidy of Louisiana and Sen. John Barrasso of Wyoming, had also expressed disapproval during the hearing with some of Kennedy's most recent actions concerning vaccines.\nDoes Trump deserve a Nobel prize for COVID vaccines?\nA recurrent theme during the committee hearing is whether President Trump deserves a Nobel prize for Operation Warp Speed, a federal initiative in 2020 that expedited the development and distribution of COVID-19 vaccines during the pandemic.\nSome lawmakers who criticized Kennedy for cancelling $500 million in mRNA funding, the vaccine technology behind the leading COVID vaccines, also praised the Trump for Operation Warp Speed in an attempt to corner the Health secretary.\nSen. Bill Cassidy, R-Louisiana, and other committee Republicans said the president deserved the honor.\n“Because of Operation Warp Speed forcing the federal government to come to a vaccine development within 10 months when others said it couldn’t be done, we saved millions of lives globally,” Cassidy said. “It surprises me that you think so highly of Operation Warp Speed when as an attorney you attempted to restrict access (to COVID vaccines)… it seems inconsistent of you.”\nKennedy said he \"absolutely\" believed Trump deserves a Nobel prize.\n-Adrianna Rodriguez\nFor Kennedy, a history of conspiracy and misinformation\nBefore President Trump nominated him as Health secretary, Kennedy was the founder of a nonprofit that experts say spread misinformation about vaccine safety. He has publicized debunked claims linking childhood vaccines to autism.\nHe has also promoted conspiracy theories that have been discredited: That Wi-Fi causes cancer, that fluoride in public water systems causes bone cancer and IQ loss, and suggesting that COVID-19 was “ethnically targeted” to attack “Caucasians and Black people” while sparing “Ashkenazi Jews and Chinese” people.\nKennedy said during his Senate testimony on Sept. 4 that he agreed with Retsef Levi, a management and health analytics expert who is now serving on the CDC's vaccine panel, that mRNA vaccines were responsible for deaths in young children.\nSenate Finance Committee’s chairman Mike Crapo, R-Idaho, and ranking member Ron Wyden, D-Oregon, had divergent takes Kennedy's role as Health secetary.\n“Under this administration, HHS has placed patients at the center of the healthcare system, empowering them with the tools and information they need to create a healthier future,” said Crapo.\nWyden said the U.S. is in a healthcare calamity, thanks to spending and staffing cuts to the HHS.\n“I traveled across Oregon last month and the message was the same from one end of the state to the other. Families are confused,” said Wyden. “They're scared about who to trust of their healthcare.”\n-Swapna Venugopal Ramaswamy\nCassidy pushes RFK Jr. over COVID vaccine access\nCassidy didn't pull his punches when questioning Kennedy, a reversal of his initial support for the Health secretary.\nCassidy, a physician, questioned the Health secretary’s approval of Operation Warp Speed, a 2020 Trump administration initiative that expedited the research and distribution of COVID-19 vaccines.\n“It surprises me that you think so highly of Operation Warp Speed when as an attorney you attempted to restrict access” to vaccines, Cassidy said. “You’ve cancelled $500 million of contracts using the mRNA platform that was critical for Operation Warp Speed.”\n“It seems inconsistent of you,” he added.\nCassidy also raised Kennedy's nomination of members to a federal vaccine panel who served as expert witnesses for plaintiffs suing vaccine companies, expressing concern that it may be a conflict of interest. Kennedy agreed that it may represent some bias.\nDoctors and patients were confused and concerned that they wouldn’t be able to access to the COVID-19 vaccine, Cassidy told Kennedy.\nThe senator was a key vote during Kennedy’s confirmation in January. Kennedy's nomination advanced to the full Senate on a 14-13 vote in the Senate Finance Committee with Cassidy's support.\n-Adrianna Rodriguez\nKennedy says former CDC boss lied about her firing\nSusan Monarez, who was dismissed as head of CDC last week by Kennedy, said she was asked by Kennedy to “pre-approve the recommendations of a vaccine advisory panel newly filled with people who have publicly expressed antivaccine rhetoric” in an opinion article published in the Wall Street Journal on Sept. 4.\n“Did you in fact do what Director Monarez said you did”,” asked Sen. Wyden, D-Oregon.\n“No, I did not,” said Kennedy.\n“So she's lying today to the American people in the Wall Street Journal?,” asked Wyden.\n“Yes, sir,” responded Kennedy.\n-Swapna Venugopal Ramaswamy\nKennedy says CDC shakeup was 'absolutely necessary'\nThe Health secretary said firing the CDC director, which led to the departure of several other officials, was “absolutely necessary.”\n“These changes were absolutely necessary adjustments to restore the agency to its role as the world’s gold standard public health agency with a central mission of protecting Americans from infectious diseases,” he told senators.\nKennedy criticized former CDC officials for the agency's policies during the COVID-19 pandemic, calling them “nonsensical” and claiming they “destroyed small businesses” and “violated civil liberties.”\n“They did not do their job,” he said.\n-Adrianna Rodriguez\nRFK Jr. addresses CDC shooting in opening statement\nKennedy began his opening statements by offering condolences to the family of Officer David Rose, a DeKalb County, Georgia, police officer who was killed during a shooting at the Centers for Disease Control Prevention in Atlanta on Aug. 8.\nThe suspected shooter, who also died, may have been disgruntled over what he believed were vaccine side effects before opening fire on the CDC, according to multiple reports.\n“Officer Rose was a veteran, a husband and a father of two children. Officer Rose’s widow, who I visited, is expecting their third child,” Kennedy told the committee. “I’d like Officer Rose’s family to know that he remains in our prayers and he will continue to be in our thoughts.”\n-Adrianna Rodriguez\nWyden: Healthcare 'calamity' approaching like an 'avalanche' under Kennedy\nSen. Ron Wyden, D-Oregon, ranking member of the Senate Finance Committee, in his opening remarks said the U.S. is in the middle of a “healthcare calamity” under Kennedy, with the largest cuts to American healthcare in the history of the country “approaching like an avalanche.”\nWyden mentioned a rural Oregon hospital that he said had closed is labor and delivery department due to federal cuts. The Congressional Budget Office has estimated that 10 million people will lose their health insurance under President Trump's signature tax and spending bill, the One Big Beautiful Bill Act.\n“Most of the senior leadership at the Centers for Disease Control and Prevention were fired, or they resigned after refusing to bow to Robert Kennedy's unceasing crusade against vaccines,” said Wyden.\n-Swapna Venugopal Ramaswamy\nDemocrats demand RFK Jr.'s ouster\nDemocratic members of the Senate Finance Committee called for Kennedy's resignation in a statement released before the hearing.\n“Robert Kennedy was unfit to serve as the Secretary of the Department of Health and Human Services before he was on the job, which is why every Democratic member of the Senate Finance Committee opposed his nomination,” they said in a statement. “The actions Robert Kennedy has taken since he was sworn in reinforce the danger he poses to the health of America.\"\nMembers joining the Sept. 4 statement included Sens. Ron Wyden, D-Oregon, Michael Bennet, D-Colorado., Mark Warner, D-Virgina., Maggie Hassan, D-New Hampshire., Catherine Cortez Masto, D-Nevada., Elizabeth Warren, D-Massachusetts , Bernie Sanders, I-Vermont, Tina Smith, D-Minnesota, Ben Ray Luján, D-New Mexico, Raphael G. Warnock, D-Georgia and Peter Welch, D-Vermont.\nOn Sept. 3, more than 1,000 former and current Health and Human Service employees asked Kennedy to step down saying he was “endangering the lives of Americans.” The letter was sent following the dismissal of Susan Monarez, head of CDC and resignation of three high level others.\n-Swapna Venugopal Ramaswamy\nMajor shakeup at the CDC\nThe firing of Centers for Disease Control and Prevention Director Susan Monarez and abrupt departures of other CDC leaders have left the nation's premier public health agency in turmoil.\nThe White House fired Monarez on Wednesday, Aug. 27 after Kennedy sought her ouster. After Monarez's termination, resignation letters followed from CDC Chief Medical Officer Debra Houry and top officials for immunization and contagious diseases.\nThe leadership shakeup represents an \"extraordinary and systematic dismantling of the very top of our nation's public health system,\" said Richard Besser, a CDC director under presidents George W. Bush and Barack Obama.\nBesser disclosed that Monarez told him she was targeted after she refused to fire senior CDC leaders and rubber stamp recommendations by Kennedy's revamped vaccine advisory panel.\n-Ken Alltucker\nSen. Bill Cassidy wants 'oversight' of CDC\nSen. Bill Cassidy, R-Louisiana responded with a social media post on Aug. 27 saying, “These high profile departures will require oversight” by the Senate Committee on Health, Education, Labor and Pensions, which he chairs.\nIn addition to calling for oversight after the CDC shakeup, Cassidy also said in a statement on Aug. 28 that the agency’s vaccine advisory panel should indefinitely postpone a Sept. 18 meeting.\n“These decisions directly impact children’s health and the meeting should not occur until significant oversight has been conducted,” Cassidy said.\nCassidy said “serious allegations” have been made about the panel’s “membership, and lack of scientific process being followed.”\n“If the meeting proceeds, any recommendations made should be rejected as lacking legitimacy given the seriousness of the allegations and the current turmoil in CDC leadership,” he added.\n-Zac Anderson\nContributing: Reuters"
    }
  ],
  "argos_summary": "Florida announced it will eliminate all vaccine mandates for children, sparking criticism from public health experts and prompting a patchwork of state and regional vaccine guidelines. The move follows a broader shift under Health and Human Services Secretary Robert F. Kennedy Jr., who has fired CDC officials and cut mRNA vaccine funding, fueling a national debate over vaccine policy and federal authority. State alliances in California, Oregon, Washington, and New England are forming independent guidelines in response to perceived federal overreach. The controversy highlights growing polarization over public health mandates and the potential impact on disease outbreaks and public trust.",
  "argos_id": "IIU3F1H64"
}