{
  "url": "https://www.cnbc.com/2025/09/04/investors-dump-bonds-gold-record-high.html",
  "authorsByline": "Lee Ying Shan",
  "articleId": "c2871ec0804340e4b6c190ac1c6ddd86",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108192230-1756439332770-gettyimages-2205170845-HL_RCOSTASECA_2703923.jpeg?v=1756439347&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T07:25:06+00:00",
  "addDate": "2025-09-04T07:30:16.834824+00:00",
  "refreshDate": "2025-09-04T07:30:16.834825+00:00",
  "score": 1.0,
  "title": "Investors are dumping bonds globally while gold is soaring. Here's why",
  "description": "A global bond rout is underway, but gold prices, which typically suffer when yields rise, have surged to new highs.",
  "content": "Surging bond yields have been making headlines for the past few days as have soaring gold prices, and while they do not have a watertight inverse relationship, higher yields usually tend to take the sheen of bullion. It appears that in the battle for safe-haven flows, gold is now emerging victorious as investors rethink their traditional safe haven playbook, with analysts pointing to growing investor concerns over the direction of fiscal and monetary policies in key economies. In the U.S., the 30-year Treasury yield went past 5% on Wednesday for the first time since July, while Japan's 30-year government bond yield hit a record high, up 100 basis points this year amid persistent inflation, negative real rates, and political instability. In the U.K., 30-year bond yields climbed to their highest point since 1998 this week, while in France, the risk premium on 30-year debt touched levels not seen since 2008 as political turmoil threatens to derail deficit-cutting plans. Even German bunds, which earlier this year had benefited from safe-haven demand, were swept up in the sell-off, with the 30-year yield hitting a 14-year high. Gold prices, meanwhile, have continued their record-breaking run, hitting a fresh high of $3,578.5 on Wednesday. \"There's concern about the fiscal excesses, potential for a debt crisis in Japan, in France and the United Kingdom,\" said Ed Yardeni, president of Yardeni Research. \"Clearly, more and more investors are choosing to add gold to their portfolios as a safe haven and protection against financial instability.\" Rising yields typically make gold less attractive as it pays no interest, raising the opportunity cost of holding bullion. But gold's role as a hedge against inflation is giving it a unique appeal, said market watchers. This is a situation where inflation is now an emergent risk … and gold is the only game in town. University of Waikato Michael Ryan One factor tipping the scales in the favor of gold is the politicization of monetary policy. \"The big development really is around Trump and his interference with the Federal Reserve independence,\" said Michael Ryan, lecturer at the School of Accounting, Finance and Economics at the University of Waikato. If the Federal Reserve's independence was compromised, it could imperil efforts to rein in inflation. Recently, U.S. President Donald Trump took the unprecedented step of removing Federal Reserve Governor Lisa Cook, citing alleged mortgage fraud, all the while pressuring Federal Reserve Chair Jerome Powell to lower interest rates. \"This is a situation where inflation is now an emergent risk … and gold is the only game in town,\" Ryan said. Meanwhile, bond vigilantes are pushing up the yields of developed nations' bonds, as they \"are not happy with fiscal and monetary policies in a lot of countries,\" Yardeni said, noting that more investors have been rotating out of government bonds and into gold. \"Investors tend to go where the momentum is, and right now, gold has it. But bonds don't.\" A safer haven? Part of gold's appeal also lies in its independence, analysts said. Unlike bonds, which promise repayment of the primary investment at a future date, warranting demands for higher yields to offset inflation concerns, gold is a physical asset that cannot be debased by fiscal mismanagement or political interference. While both are traditionally considered safe haven assets, they are fundamentally different, said Angela Lan, senior strategist at State Street Global Advisors. \"Treasury bonds are a financial liability. You own a promise to receive future cash flows and its value is backed by the government. Gold, on the other hand, is not a liability. It is a physical asset that does not tarnish, rust or erode, a naturally rare element with its inherent value, designated by many global central banks and institutions as a reserve asset.\" Gold is also being sought after as the \"ultimate store of value\" as investors fear an unprecedented debasement in the U.S. dollar-backed fiat currency system, said Vishnu Varathan, head of economics and strategy at Mizuho Bank. Investors appear worried that the U.S. dollar and other paper currencies are being weakened by too much government debt, rising global tensions, and concerns that central banks may no longer act independently. If monetary authorities are pressured to keep financing government debt by printing more money, it will deeply erode the value of those currencies. Elevated yields have raised questions on how high will they go before the investors feel the premium is good enough for them to start buying long-dated debt again. Varathan said that their return might not be too distant, especially if expectations rise that the Fed will cut faster than anticipated before, driving investors to \"lock in\" higher yields. \"But the caveat is with the structural risks around unsustainable debt, geo-economic upheaval and U.S. Dollar-fiat debasement risks, [which] mean that investors may prefer short-dated and front-end yields,\" he said. If yields are simply drifting higher, then buyers do tend to step in, said Steve Sosnick, chief strategist at Interactive Brokers. \"But if there are concerns about a crisis or an inability to fund deficits, like we're seeing in France, or to some extent, Japan, that support can be more difficult to find,\" he added.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Surging bond yields",
      "weight": 0.078144655
    },
    {
      "name": "higher yields",
      "weight": 0.07746328
    },
    {
      "name": "growing investor concerns",
      "weight": 0.07328489
    },
    {
      "name": "Rising yields",
      "weight": 0.07295156
    },
    {
      "name": "Gold",
      "weight": 0.07190514
    },
    {
      "name": "gold",
      "weight": 0.07190514
    },
    {
      "name": "more investors",
      "weight": 0.071769565
    },
    {
      "name": "safe haven assets",
      "weight": 0.070097335
    },
    {
      "name": "government bonds",
      "weight": 0.068312265
    },
    {
      "name": "yields",
      "weight": 0.06799841
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98193359375
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.78955078125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.541015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.53076171875
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.49951171875
    }
  ],
  "sentiment": {
    "positive": 0.37159517,
    "negative": 0.34283134,
    "neutral": 0.28557345
  },
  "summary": "Investors are dumping bonds globally as gold prices continue to rise, due to concerns over the direction of fiscal and monetary policies in key economies. The 30-year Treasury yield in the U.S. rose past 5% for the first time since July, while Japan's 30-yr government bond yield reached a record high amid inflation, negative real rates, and political instability. While rising yields typically make gold less attractive due to its low interest, but gold's ability to hedge against inflation gives it unique appeal. The political influence of the Federal Reserve is also seen as a key factor in its appeal, as it is perceived as a safe haven and protection against financial instability. Investors are also seeking gold as a store of value due to the physical asset that cannot be debased by fiscal mismanagement or political interference. However, there are concerns that the US dollar and other paper currencies are being weakened by too much government debt, raising questions about how high yields will go before they go on.",
  "shortSummary": "Surging bond yields and soaring gold prices are driving investor sentiment towards safer havens amid rising inflation concerns and concerns over economic policies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9785850b28bf4370a95410bc124f6c66",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bond yields have spiked worldwide, with 30‑year Treasury and European sovereign yields hitting multi‑year highs, prompting a global sell‑off in fixed income. In contrast, gold has rallied to record levels, as investors view it as a hedge against fiscal excesses, potential debt crises, and political interference in central bank policy. The shift reflects growing fears of inflation, debt sustainability, and dollar debasement, driving safe‑haven flows away from bonds toward the physical asset.",
  "argos_id": "JD6D009I9"
}