{
  "url": "https://www.androidauthority.com/no-more-dex-desktop-ui-on-tablet-3593683/",
  "authorsByline": "Zac Kew-Denniss",
  "articleId": "27301a829984441e927183f3cedb4f78",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2025/09/Samsung-Galaxy-Tab-S11-Ultra-in-mans-hand-showing-home-screen.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T09:30:30+00:00",
  "addDate": "2025-09-04T09:48:46.777252+00:00",
  "refreshDate": "2025-09-04T09:48:46.777254+00:00",
  "score": 1.0,
  "title": "Samsung's new DeX drops desktop UI on tablets, and not everyone will be happy",
  "description": "One UI 8 removes the desktop UI from Samsung DeX unless you're connected to an external display, making keyboard and mouse navigation worse.",
  "content": "Android 16 introduced Google’s take on a Desktop Mode for Android, and the new version of Samsung DeX is based on it. While some of the changes are welcome, there are some downsides to the latest version of DeX. The Galaxy Tab S11 series gives us our first look at the new DeX on a tablet, and some of these updates might not sit well with everyone.\n\nNo more desktop UI on tablet screens\n\nIn One UI 8, DeX will no longer display the desktop-style UI on the tablet itself — you’ll only get it on connected displays. Instead, DeX will work as seen in the screenshot above, where you’ll get the standard Android home screen, and apps will launch in a pop-up window when opened. You’ll also have access to the standard Android taskbar, as you do when not using DeX, but the notification and quick settings shortcuts at the bottom of the screen are gone, as are the back, home, and recent app keys.\n\nIf that sounds familiar, it’s because this version of DeX already exists in One UI 7, only it’s optional rather than mandatory. Alas, One UI 8 removes the option to switch back to classic DeX.\n\nAlso gone is the quick settings toggle that lets you enter DeX, now replaced with a shortcut to connect DeX to a TV or PC wirelessly. Thankfully, the new way to enter DeX is more convenient than before. Instead of having to turn DeX on and off to switch between it and regular Android, it can now live side-by-side, and you can switch back and forth without any of your apps closing or restarting.\n\nTo access DeX in One UI 8 on the Galaxy Tab S11, open the overview screen, swipe to the right to find a desktop, and tap it. You’ll be taken back to your homescreen, now with Android’s taskbar on display. Any app you open will launch in a pop-up window, where it can be minimised, maximised, or snapped to either half of the screen.\n\nThe new way of getting in and out of Samsung DeX is great and is more touch-friendly, but removing the more desktop-inspired taskbar is a step backward.\n\nSure, you still have a taskbar with your app drawer, but now you have to use the regular notification and quick settings shades at the top of the screen, which aren’t the easiest to navigate with a keyboard or mouse. Likewise, you’ll have to rely on keyboard shortcuts or use the mouse to click and drag where you’d usually touch the screen to go back, home, or into the recent apps screen.\n\nSamsung Galaxy Tab S11 Ultra The Samsung Galaxy Tab S11 Ultra is the biggest and best Galaxy Tab to date. The 14.6-inch display rocks 120Hz at 2,960x1,848 pixels of resolution. A huge 11,600mAh battery should keep you going all day, and quad-speakers promise a crisp entertainment experience.\n\nSo, while this new implementation of DeX certainly has its upsides, the lack of mouse-friendly controls when not connected to an external display is disappointing. How do you feel about the changes to DeX? Let us know below.",
  "medium": "Article",
  "links": [
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://clearbuy.com/redirect/7279aebcd13c03f516c70486db7aeabb7b341dc7?pId=6737&tag=androautho-20",
    "https://www.androidauthority.com/news/",
    "https://www.androidauthority.com/try-android-16-desktop-mode-on-pixel-3565393/",
    "https://www.androidauthority.com/samsung-dex-extended-mode-3593496/",
    "https://www.androidauthority.com/missing-samsung-dex-features-one-ui-8-3581161/",
    "https://www.androidauthority.com/tag/samsung-one-ui/",
    "https://clearbuy.com/redirect/83f4c8265995a8006303fbc595db95411b336617?pId=6738&tag=androautho-20",
    "https://www.androidauthority.com/tag/samsung-galaxy-tab/",
    "https://www.androidauthority.com/tag/samsung/",
    "https://www.androidauthority.com/samsung-galaxy-tab-s11-ultra-launched-3593507/",
    "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Samsung DeX",
      "weight": 0.11553987
    },
    {
      "name": "DeX",
      "weight": 0.10818376
    },
    {
      "name": "tablet screens",
      "weight": 0.094290935
    },
    {
      "name": "Galaxy Tab S11 Ultra",
      "weight": 0.09055514
    },
    {
      "name": "desktop UI",
      "weight": 0.086157724
    },
    {
      "name": "Galaxy Tab",
      "weight": 0.08438344
    },
    {
      "name": "regular Android",
      "weight": 0.081665136
    },
    {
      "name": "connected displays",
      "weight": 0.07491252
    },
    {
      "name": "Android",
      "weight": 0.07290664
    },
    {
      "name": "Samsungs new DeX",
      "weight": 0.071283415
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.91015625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.89453125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.724609375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.3642578125
    }
  ],
  "sentiment": {
    "positive": 0.18580975,
    "negative": 0.26007393,
    "neutral": 0.5541163
  },
  "summary": "Samsung's new version of DeX, based on Google's Desktop Mode for Android, has been introduced on the Galaxy Tab S11 series. However, some users may not be happy as it does not display desktop UI on tablet screens. Instead, DeX will only be available on connected displays. This removes the option to switch back to classic DeX and replaces the quick settings toggle that allows you to enter DeX. The new way of entering DeX is more touch-friendly and allows it to live side-by-side without any app closing or restarting. Despite these changes, users may find the lack of mouse-friendly controls when not connected to an external display.",
  "shortSummary": "Samsung's new One UI 8 version of DeX on the Galaxy Tab S11 Ultra offers a more user-friendly, touch-friendly interface but lacks mouse-friendly controls and taskbar functionality.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1675b9b78a3e44749edbfafda0287d54",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nWant more Android Authority? How to set us as your preferred source in Google Search\nAugust 12, 2025\nSince 2007, Android Authority has strived to bring all of our readers the very best coverage of Android and the mobile tech world. And even after 18+ years as a proudly independent media outlet, we’re as driven as we’ve ever been to bring you all the latest exclusive reports, app teardowns, leaks, hands-on reviews, experience-based features, lab testing, and other expert analysis.\nOf course, how we’ve been able to get that coverage to you has changed in countless ways during that time, be it via our website, YouTube channel, social media, or new projects like Authority Insights, which combines our elite reporting with a podcast and a newsletter, as well as our brand new YouTube channel from Android Authority‘s Pixel guy, C. Scott Brown.\nWe want to continue to bring you the very best Android and mobile tech coverage, and you can help us do that.\nWe know and deeply appreciate that so many of you repeatedly visit our website and other channels to constantly see what we’ve been working on, often every day. Every one of those clicks or interactions helps us remain independent and every bit as innovative and ambitious as we’ve been since day one.\nSo, if you want to see even more of our content, guarantee you don’t miss anything from us, or just want to continue to support our mission, we’d like to ask you a big favor and set Android Authority as a preferred source in Google Search. It only takes a few seconds, it doesn’t cost you anything, and it will help us continue to bring you the best possible content for the next decade and beyond.\nThis feature is currently only available in the US and India, but we’ll let you know when other regions are included in this new feature. For those who already have it, here’s how to do it:\nHow to set Android Authority as a preferred source\nMethod 1:\n- Head to this link and you can add us directly to your list of preferred sources.\nMethod 2:\n- Search for a topic that’s in the news and find the “Top stories” header. If you don’t see this, you might need to input a different query. “Galaxy S26 Pro” worked for us at the time of writing.\n- Click on the icon on the right of the “Top stories” header. That’s the icon with the stacked squares and a star on top.\n- Search for “Android Authority” and select it to set it as a preferred source. You can add other websites at this stage, too — support your favorite publications!\n- Refresh your search results to see more from your favorite sites.\nOnce again, a big thank you to all our readers, viewers, and followers — your passion for Android and tech is what pushes us forward. We hope you’ll add us as a preferred source (and please feel free to encourage any other tech enthusiasts you know to do the same!), but even if you don’t, we’re grateful for every one of you that supports our work in any way possible. And as ever, if you have any feedback for us, please drop an email to contact@androidauthority.com.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/try-android-16-desktop-mode-on-pixel-3565393/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nAndroid 16's Desktop Mode transforms your Pixel phone into a PC, and here's how you can try it now\nJune 10, 2025\n- Google is developing a DeX-like desktop mode for Android phones, and you can try it out now on supported Pixel devices with Android 16 QPR1 Beta 2.\n- This feature projects a desktop-like environment with a taskbar and freeform windows to an external display, while the phone screen remains usable.\n- The desktop mode experience requires a Pixel 8 or newer, the latest Android 16 QPR1 beta, and an external display.\nOne of the most exciting pieces of Android news from last month’s Google I/O developer conference was Google confirming it’s working on a desktop mode feature for Android phones. At the event, the company revealed that the desktop windowing experience it built for tablets will extend to external displays, meaning you’ll get a desktop-like environment when you connect your phone to an external monitor. Better yet, Google also announced you’ll be able to try this new desktop feature on your Pixel device in a future Android 16 quarterly release beta. The wait is now over: Android 16’s new Desktop Mode is available to try out in the latest Android beta!\nHow to enable Android 16’s Desktop Mode on your Pixel phone\nTo get started, you’ll need a Pixel phone that supports display output over USB-C — this means the Pixel 8 and later models, including A-series devices. The Pixel 7 and earlier, unfortunately, lack hardware support for DisplayPort Alternate Mode, the feature that allows some of the USB-C pins to carry a DisplayPort signal. Google enabled this feature starting with its Tensor G3 generation of Pixel devices, which means the Pixel Tablet and the first-generation Pixel Fold also lack display output support.\nThe next thing you’ll need to do is install the latest Android 16 QPR1 Beta 2 update. Android 16 QPR1 Beta 2 adds the new Desktop Mode experience feature that enables a desktop session to be started on an external display. The feature isn’t enabled by default, however. To enable the new Desktop Mode experience feature, simply navigate to Settings > System > Developer options and toggle ‘Enable desktop experience features’.\nYou’ll be asked to reboot your phone, and after doing so, you should see the same desktop mode experience we demoed last month when you connect your Pixel phone to an external display. Google confirmed at I/O that this desktop experience is built on the foundation of Samsung DeX, which explains why there are many similarities.\nWhat is Android 16’s Desktop Mode currently like?\nMuch like DeX, Android’s new desktop mode features a taskbar at the bottom of the external display. This taskbar displays the app drawer, your pinned apps, recently opened apps, and navigation buttons. The status bar appears at the top; pulling it down reveals the notification and Quick Settings panels side-by-side. More importantly, apps launch in freeform windows that you can freely move or resize. Similar to Microsoft Windows, apps can also be snapped to the side, making it easier to drag and drop content between them.\nGoogle confirmed at I/O that while desktop mode is in use, your phone or tablet’s display remains fully usable. This is because Android projects a virtual display to the external monitor, allowing your phone or tablet’s main screen to operate independently. This means you can use your phone or tablet for other tasks while different apps are running on the external display.\nBetter yet, you can use the same mouse to control both your phone or tablet and the external display, as Android 16 also improves external display management to enable seamless mouse cursor movement between them. Since tablets support desktop windowing on their main displays, Android also allows app windows and content to seamlessly move between the tablet’s display and the external display.\nSince phones and tablets have wildly different screens than most external displays, Android allows you to independently manage the display and text size for your phone or tablet versus the external display. Simply navigate to Settings > Connected devices > External display to control these settings.\nWhat else is new for desktop windowing in Android 16?\nBeyond extending desktop windowing to external displays, Android 16 also introduces several new features for desktop windowing. This includes support for multiple desktops, allowing you to create different workspaces for productivity, entertainment, and more. New keyboard shortcuts and trackpad gestures allow you to easily switch between these desktops. Android can even maintain window sizes, positions, and states across different desktops, so you can set up your preferred workspaces once and Android will restore them the next time you enter desktop mode.\nAndroid 16 also improves how legacy apps behave on external displays. The operating system allows you to freely resize apps with locked orientation. This means that, even if an app is locked to portrait mode, it can be elongated when run in a desktop windowing environment. However, if the app tells the system that it’s nonresizable, then Android will maintain the app’s aspect ratio as it scales the UI. Lastly, if an app opens a camera preview when in desktop windowing, the viewfinder’s aspect ratio is maintained while the rest of the app is freely resized.\nThe introduction of a proper desktop mode for Android phones is an exciting development. It’s admittedly a bit underwhelming in its current state, especially when compared to Samsung DeX, let alone full-fledged desktop operating systems. Keep in mind, though, that Android 16 QPR1 Beta 2 only features an early iteration of Google’s new desktop mode. In this beta, Google requires manually flipping a developer toggle to enable it — a clear indicator that it isn’t ready for prime time. I’m confident it will improve, though, as Google has a long-term vision of transforming Android into a desktop-class operating system. Rolling out this desktop mode for Android phones is key to that vision, providing developers with another strong incentive to optimize apps for large-screen compatibility.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/samsung-galaxy-tab-s11-ultra-launched-3593507/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nSamsung announces incredibly thin Galaxy Tab S11 Ultra and a smaller Tab S11\n1 hour ago\n- Samsung has unveiled the Galaxy Tab S11 and the Galaxy Tab S11 Ultra.\n- The Galaxy Tab S11 replaces the Plus model in a more compact form but with similar power to the Ultra.\n- The Ultra has a massive 14.6-inch display and is both thinner and lighter than last year’s model.\nSamsung is refreshing its flagship Android tablet lineup today with the introduction of the new Galaxy Tab S11 and Tab S11 Ultra. These tablets come with incremental changes over the previous Galaxy Tab S10 series, and we’ll walk you through all of those.\nLet’s start with the immediately apparent change: the naming. With this launch, Samsung is eliminating the Plus variant — for now, at least — and reviving the standard Galaxy Tab S11, which features a smaller 10.9-inch AMOLED screen with a 2560 x 1600 resolution. A similar lineup rejig is expected of the Galaxy S26 series, where Samsung is likely to eliminate the Galaxy S26 Plus and rename the base Galaxy S26 to S26 Pro.\nThe enormous Galaxy Tab S11 Ultra arrives alongside the smaller Galaxy Tab S11. The Ultra still features the massive 14.6-inch AMOLED, but Samsung is scaling back to a single front-facing camera, resulting in a smaller notch. This allows it to claim a few micrometers of screen real estate, along with the opportunity to label it the biggest screen on a Galaxy Tab ever. Despite the reclaimed space, the screen’s resolution remains unchanged at 2960 x 1848 pixels.\nThe displays on both screens feature 120Hz refresh rates with a peak brightness of 1,600 nits. The Ultra also receives an anti-reflective coating, as it did last year, while the base variant comes with standard reflective glass, but you can preserve it with an official anti-reflective screen protector.\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more.\nBesides those changes, the Galaxy Tab S11 Ultra maintains the same length and width, but is now slimmer, measuring 0.20 inches (~5.1mm). It is also slightly lighter, now weighing 692 grams, down from 718 grams last year. The regular Tab S11 isn’t far behind in terms of sleekness and measures only 2.2 inches (5.6mm) in thickness, which is the same as the Galaxy Tab S10 Plus. It’s also significantly lighter, weighing just 469 grams. Despite their slender bodies, both tablets also get an IP68 rating.\nMinor changes to battery and cameras\nDespite its slimmer figure, the Galaxy Tab S11 Ultra comes with a slightly larger battery, now boasting a 11,600mAh capacity. Meanwhile, the Tab S11 gets a smaller 8,400mAh battery. Both tablets can fast charge at up to 45W, which is the same speed as before.\nThe 13MP primary and an 8MP ultrawide camera on the back of the Galaxy Tab S11 Ultra remain unchanged, as Samsung switches to a single 12MP ultrawide camera on the front — rather than two last year. The Galaxy Tab S11, on the other hand, gets a single 13MP camera on the back and a 12MP ultrawide on the front.\nInternally, both the Galaxy Tab S11 and the Tab S11 Ultra are stocked with MediaTek Dimensity 9400+, a marginally overclocked version of the Dimensity 9400. The base chipset itself has been upgraded to a 3nm node, resulting in a 24% increase in CPU performance and a 27% improvement in GPU performance. The NPU performance is also claimed to have increased by 33%.\nSimilar configurations, better software\nMeanwhile, the RAM and storage options for the Tab S11 Ultra remain the same. The 256GB and 512GB storage variants are paired with 12GB of RAM, while the 1TB variant comes with 16GB of RAM.\nThe variants for the Galaxy Tab S11 have been limited to 128GB, 256GB, and 512GB, all of which feature 12GB RAM. However, both tablets support storage expansion with microSD cards of up to 2TB.\nIn terms of software, we’re seeing One UI 8, based on Android 16, natively, with familiar Galaxy AI features that assist with writing, drawing, and summarizing audio. A noticeable change is the introduction of a new floating Galaxy AI overlay, which can be used in conjunction with split-screen setups.\nMeanwhile, Samsung DeX is receiving a significant upgrade and will now support four separate workspaces, along with support for multi-screen setups. With this upgrade, you will be able to drag and drop windows from one screen onto another, just like on a desktop. However, Samsung is removing the option to enable a DeX view without connecting to an external monitor.\nNew accessories and connectivity options\nBesides these changes on the tablets, the accessories have also been revamped. The S Pen for the Galaxy Tab S11 series now features a distinct hexagonal shape, replacing the previously round one. While the S Pen retains a button, Samsung is removing Bluetooth, just like it did with the S Pen on the Galaxy S25 Ultra. That means it won’t support air gestures or wireless camera control, though you can still use it as a remote control in the Galaxy Tab’s proximity.\nSamsung is also claiming to have improved the keyboard folio with a slimmer profile that matches the Ultra. Additionally, it is working on a more capable “Pro” keyboard that will be announced in early 2026.\nNeither the Galaxy Tab S11 nor the Tab S11 Ultra offers cellular connectivity anymore. However, the Ultra features more advanced Wi-Fi 7, rather than Wi-Fi 6E, which may seem unreasonable as both share the same internals.\nIf you want a Galaxy Tab with cellular connectivity, you can opt for the Galaxy Tab S10 Plus, which hasn’t been discontinued. Similarly, Samsung will continue to sell the Galaxy Tab S10 FE and Tab S10 FE Plus until they are replaced, hopefully next year.\nPricing and availability\nIn terms of pricing, the Galaxy Tab S11 starts at $799.99 for the 128GB storage option, and the Galaxy Tab S11 Ultra will start at $1,199.99.\nBoth the Galaxy Tab S11 and the Tab S11 Ultra will be available starting today, alongside the Galaxy S25 FE, which is also being announced today.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung-galaxy-tab/",
      "text": "Pages tagged:\nSamsung Galaxy Tab\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nSamsung DeX is finally giving us room to expand.\nZac Kew-Denniss37 minutes ago\n0\nZac Kew-Denniss37 minutes ago\n0\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nSamsung announces incredibly thin Galaxy Tab S11 Ultra and a smaller Tab S11\nTushar Mehta38 minutes ago\n0\nHere's how you can watch Samsung's September 'Galaxy Event' later today\nAdamya Sharma3 hours ago\n0\nLast-minute leak spoils Samsung's Galaxy Tab S11 surprise\nAman Kumar24 hours ago\n0\nSamsung Galaxy Tab S11 and Galaxy S25 FE leaks are getting even better as Unpacked looms\nStephen SchenckAugust 29, 2025\n0\nSamsung sets the date for a Galaxy Tab announcement next week\nStephen SchenckAugust 27, 2025\n0\nThis Galaxy Tab S11 Ultra leak teases how much faster it is over last year's model\nRyan McNealAugust 27, 2025\n0\nSamsung launches Galaxy Tab S10 Lite, but a big question remains (Update: Price details)\nRyan McNealAugust 25, 2025\n0\nHere's how much the Galaxy Tab S11 and S11 Ultra may cost in the US\nRyan McNealAugust 22, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nSamsung Galaxy devices get first dibs on powerful new Circle to Search feature\nCircle To Search's new Scroll and Translate feature lets you continuously translate text as you scroll or switch apps.\nAdamya Sharma\nRoborock already keeps the indoors clean, and now it's coming for your lawn\nStephen Schenck34 minutes ago\n0\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nAdamya Sharma1 hour ago\n0\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nZac Kew-Denniss1 hour ago\n0\nThe Galaxy S25 FE is finally here, and there's good and bad news\nIt's still got effectively the same chip as last year's phone, 8GB of RAM, and the same rear cameras.\nHadlee Simons\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nZac Kew-Denniss1 hour ago\n0\nSamsung announces incredibly thin Galaxy Tab S11 Ultra and a smaller Tab S11\nTushar Mehta1 hour ago\n0\nSamsung's TriFold isn't here yet, but its main rival just got a successor\nAamir Siddiqui2 hours ago\n0\nOur latest\nThis guy made his own slider phone out of a broken Z Flip 5 and BlackBerry keyboard\nHadlee Simons3 hours ago\n0\nHere's how you can watch Samsung's September 'Galaxy Event' later today\nAdamya Sharma3 hours ago\n0\nFrom Battery Health to fingerprint unlock, Google just fixed a lot on your Pixel\nAdamya Sharma8 hours ago\n0\nMotorola Razr 2025 drops back to its all-time low price of $600\nEdgar Cervantes12 hours ago\n0\nThe Ampace Andes 1500 Power Station falls to its record-low price\nEdgar Cervantes13 hours ago\n0\nHot deal: Samsung Galaxy S25 Edge plummets to new record-low price, saving you $400!\nEdgar Cervantes14 hours ago\n0\nGboard's new AI Writing Tools are coming to more Android phones\nMishaal Rahman16 hours ago\n0\nSamsung Health levels up with virtual doctor visits, on-demand workouts, and more\nRyan McNeal16 hours ago\n0\nEarbud sharing begone: Pixel phones now have proper support for Auracast\nHadlee Simons17 hours ago\n0\nGoogle's beloved Androidify app is back with new features for making your own Android Bot\nMishaal Rahman17 hours ago\n0\nYour Pixel Watch is getting true hands-free Google Maps navigation\nMatt Horne17 hours ago\n0\nThe September Pixel Drop is here with Material 3 Expressive for all!\nAdamya Sharma17 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/samsung-dex-extended-mode-3593496/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\n55 minutes ago\n- Samsung is rolling out multi-monitor support in Samsung DeX, starting with the Galaxy Tab S11 and One UI 8.\n- Extended Mode allows dragging apps and files between your monitor and tablet display.\n- Launching with the Tab S11, this will reach older Samsung tablets with the One UI 8 update.\nSamsung DeX is one of the best desktop modes on mobile and has been a useful tool since it was introduced on the Galaxy S8. Samsung overhauled DeX in One UI 8, basing it on Android 16’s new Desktop Mode, but there are more new features to come. The Galaxy Tab S11 gives DeX users a long-requested multi-monitor feature.\nAt last, multi-monitors\nA second monitor is one of the easiest ways to boost productivity, and it’s something that’s been sorely missing from DeX until now. Starting with One UI 8 on the Galaxy Tab S11 series, you’ll be able to use the tablet screen as a secondary display when you’ve plugged it into your monitor. Until now, the DeX experience on a connected display has been in a separate sandbox from the tablet display, which shows your normal home screen or a virtual trackpad.\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more.\nOnce you’ve connected the Tab S11 to your monitor, you’ll be able to move app windows across the two displays, drag and drop files, and everything else you’d want from a desktop platform. The experience isn’t quite what we’d expect, though, as the tablet home screen will remain in place and will not mirror DeX’s UI with the taskbar at the bottom of the display. That’s unfortunate, but a minor caveat to what should be a major upgrade to using Samsung DeX.\nUsing your tablet’s screen as a second monitor is a part of the Desktop Mode Google added to Android 16, as seen in Google’s Demo video. This will be our first time seeing it in person, though, as the Pixel tablet lacks display output. So, all Android tablets that support display output and run Android 16 should be able to be used this way.\nAre you looking forward to DeX Extended Mode?\nAre you looking forward to using Samsung DeX on the Tab S11? Let us know in the comments.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung/",
      "text": "Pages tagged:\nSamsung\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nSamsung was reserving the stable One UI 8 update for its shiny new Galaxy S25 FE.\nAdamya Sharma59 minutes ago\n0\nZac Kew-Denniss60 minutes ago\n0\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nThe Galaxy S25 FE is finally here, and there's good and bad news\nHadlee Simons60 minutes ago\n0\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nZac Kew-Denniss60 minutes ago\n0\nSamsung announces incredibly thin Galaxy Tab S11 Ultra and a smaller Tab S11\nTushar Mehta1 hour ago\n0\nHere's how you can watch Samsung's September 'Galaxy Event' later today\nAdamya Sharma3 hours ago\n0\nHot deal: Samsung Galaxy S25 Edge plummets to new record-low price, saving you $400!\nEdgar Cervantes14 hours ago\n0\nSamsung Health levels up with virtual doctor visits, on-demand workouts, and more\nRyan McNeal16 hours ago\n0\nLast-minute leak spoils Samsung's Galaxy Tab S11 surprise\nAman KumarSeptember 3, 2025\n0\nThis clever trick can help you find a lost or stolen Samsung phone. Here's how it works\nJoe MaringSeptember 3, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung-one-ui/",
      "text": "Pages tagged:\nSamsung One UI\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nSamsung was reserving the stable One UI 8 update for its shiny new Galaxy S25 FE.\nAdamya Sharma45 minutes ago\n0\nZac Kew-Denniss45 minutes ago\n0\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nZac Kew-Denniss46 minutes ago\n0\nGalaxy Z Fold 5, Flip 5 owners are get their first taste of One UI 8\nHadlee SimonsSeptember 2, 2025\n0\nOne UI 8 beta arrives on Galaxy S23 and Samsung's popular A-series phones\nTushar MehtaSeptember 1, 2025\n0\nSamsung's take on Pixel Screenshots is finally available to global users\nRyan McNealAugust 29, 2025\n0\nThe latest One UI 8 beta finally brings Now Brief to Galaxy S24 series\nHadlee SimonsAugust 29, 2025\n0\nSamsung inches closer to stable One UI 8 on Galaxy S25 with sixth beta\nTushar MehtaAugust 28, 2025\n0\nJust bought a new Galaxy foldable? Watch out for this alert-hiding bug\nMatt HorneAugust 25, 2025\n0\nNot just phones and TVs: Samsung is bringing 7 years of updates to more devices\nHadlee SimonsAugust 25, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    },
    {
      "url": "https://www.androidauthority.com/missing-samsung-dex-features-one-ui-8-3581161/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\n5 Samsung DeX features I'll miss if they don't return in One UI 8\nJuly 28, 2025\nI’ll admit it: I’ve never been the biggest Samsung DeX user. Not because I don’t like it — I think it’s the gold standard for casting your phone to an external display — but because I spend far too much time with non-Samsung phones in my pocket. The funny thing is that every time I leave the Galaxy ecosystem behind, that’s precisely when I need DeX most.\nAnd now that it’s about to undergo significant changes as part of One UI 8, I’m a little worried. I don’t want to lose certain DeX features, even if it ultimately leads to a better experience in Android’s Desktop mode. Here’s what I’m not looking forward to losing:\nLock DeX and Exit DeX saved my clumsiness\nLike I said, I’m not the biggest DeX user — it just comes with the territory of switching phones dozens of times per year. Unfortunately, that often means I forget the rules of how it’s supposed to work, accidentally quitting out of DeX when I only meant to rearrange a window or two to make my life a little bit easier. Thankfully, Samsung had a solution: The ability to lock myself into DeX or only exit via a button in the app drawer.\nRight now, my most-used feature in DeX is a handy little button called Lock DeX. Honestly, it’s as simple as it sounds, making it so that I can’t exit DeX unless I use biometrics to unlock my Galaxy S25, but it’s become essential for my needs. It’s saved my bacon (or at least a few minutes’ worth of work) more times than I can count, keeping me from having to reopen windows and figure out layouts based on my own mix-up.\nIf I were Google, I’d take notice. Android 16’s Desktop mode needs a way to keep clumsy users like me in mind, and I think copying Lock DeX is the easiest way to do it. Either that, or copy Exit DeX and make sure that I physically press a button before my phone stops casting.\nMultiStar’s I❤️ Samsung DeX made Good Lock worth it\nAlthough I don’t usually like to download or use Good Lock, I’m willing to make an exception when it comes to DeX. See, my problems typically center around the fact that Good Lock is too essential for basics like fleshing out the Galaxy Z Flip’s Flex Window, but it’s far more useful when it comes to DeX. It opens up the number of apps I can run at any one time and opening a previous app quickly, and now it seems like Samsung will take that away.\nLuckily, the I❤️Samsung DeX plugin isn’t totally going away — it’ll stick around for the “High resolutions for external display” option, which lets you make the most of your Galaxy device’s crisp resolution, but not much else. I would have much rather it kept the “Run many apps at same time” feature, which makes DeX a viable way for me to work across Chrome, Slack, Spotify, Lightroom, and a few others when I need it to stand in for my laptop in a pinch, but my best guess right now is that it’ll have to come back as part of a future update.\nAt the very least, I can only hope that Android 16’s Desktop mode eventually gains Chrome OS’s Continue where you left off feature, allowing me to reopen the apps I used the last time I quit out of DeX.\nPlease don’t force me into a permanent taskbar\nWhile my first two picks have been things I don’t want Samsung to take away from me, the next thing I need out of DeX in One UI 8 is to keep my current taskbar flexibility. Right now, the taskbar is just about perfect — it appears when I need it to, but disappears when I’m watching a full-screen video or otherwise making the most of my much larger display. In the earliest version of One UI 8, though, it looks like that’s about to change.\nAs my colleague Mishaal Rahman figured out, the taskbar and app header are about to become permanent. That means even if you’re watching a full-screen YouTube video, catching up on our brand-new C Scott Brown channel (give my fellow Pixel-lover a follow), you’ll always see your taskbar full of apps along the bottom edge. It’s a little bit less noticeable if you’ve set your app icons to match your wallpaper, but still not my favorite look when I’d much rather be focused on a video telling me all about the Galaxy Z Flip 7 and Fold 7.\nI need to be able to pin apps to my desktop\nBy now, I hope you’ve realized that I’m no DeX pro. I accidentally exit out of it, I keep trying to modify it, and I sometimes have issues with how it handles full-screen content. Worse, I also find that I lose apps in DeX if I’m trying to do too many things at once. So, you can imagine my relief when I realized that Samsung lets me pin apps to the top of my stack just to ensure they aren’t lost in the shuffle.\nAnd, just like everything else on this list, that might be changing. Right now, the pin feature is missing from One UI 8, meaning every app is created equal and could easily get lost somewhere in the middle of my busy to-do list. For some people, that might be fine — especially if they only do one or two things in DeX at a time — but not me. I want to be able to bounce between several tasks, but I know that I need to have Slack visible at all times, which I can only really do with the pin feature.\nIf I right-click, I want it to do, well, something\nLast but not least, I grew up as a Windows kid. I remember using everything from Windows Vista as a little kid to Windows 8 in high school and Windows 10 in college. Through every single version, I had one feature I could always count on: The right click. It’s the fastest way to organize my desktop, access quick settings, and banish things to the recycling bin without having to drag and drop.\nSo, when I found that Samsung’s classic DeX experience supported the same gesture, I was hooked. I mean, copying a feature I’ve been using ever since I learned my way around a computer is one of the easiest ways to ensure I keep using your software, so someone at Samsung must have listened closely.\nI'm a Windows kid, I need my right-click.\nIn its current DeX implementation, right-clicking on the taskbar opens taskbar settings, while a click on the desktop lets you sort your apps, clean up the desktop, or adjust your screen zoom. I only use the first two features, mostly out of my deep need to stay organized, but I can still appreciate that control over zoom is there. I’m sure one day I’ll need that one, too, but it won’t be as easy if One UI 8 has its way.\nIt seems like most of Samsung’s right-click controls are on their way out, and I’m not sure if they’ll be replaced by something like a long-press gesture or if Android 16’s Desktop mode will just be slightly annoying about a feature that could be so simple.\nThen again, we’ve also seen that Samsung is determined to preserve a lot of its DeX features, including its S Pen integration, wallpaper settings, and wireless display options, so maybe there’s still time for it to rescue a few of my favorites before we get too far away from what made DeX great.\nThank you for being part of our community. Read our Comment Policy before posting."
    }
  ],
  "argos_summary": "Samsung’s One UI 8 removes the desktop‑style UI from its DeX experience on tablets, limiting the desktop view to external displays only. The new design shows a standard Android home screen on the tablet, with apps launching in pop‑up windows and the taskbar replaced by a minimal Android taskbar. Users lose quick‑access features such as the notification shade, back/home/recent buttons, and mouse‑friendly controls, which may hinder productivity on the tablet’s own screen. The change is intended to streamline the experience, but many users feel it reduces usability when not connected to an external monitor.",
  "argos_id": "L1CLY87VO"
}