{
  "url": "https://appleinsider.com/articles/25/09/04/modest-iphone-17-pro-price-increase-rumor-challenged-by-new-estimate",
  "authorsByline": "William Gallagher",
  "articleId": "07424133d4874a62a367a4f5ccb6f597",
  "source": {
    "domain": "appleinsider.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Cupertino",
      "coordinates": {
        "lat": 37.3228934,
        "lon": -122.0322895
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T12:02:49+00:00",
  "addDate": "2025-09-04T12:12:30.420636+00:00",
  "refreshDate": "2025-09-04T12:12:30.420640+00:00",
  "score": 1.0,
  "title": "Modest iPhone 17 Pro price increase rumor challenged by new estimate",
  "description": "Going against recent claims of only a small price hike for the iPhone 17 range, a new report says there will be significant cost increases.",
  "content": "Going against recent claims of only a small price hike for the iPhone 17 range, a new report says there will be significant cost increases.\n\nPrice rises have been expected for the iPhone 17 range since Trump began his \"reciprocal\" tariffs, but recent reports have suggested they will be minimal. Most reports expect Apple to repeat a previous price rise technique by increasing the cost of the iPhone, but masking it with an increase in storage.\n\nThat approach means offering bringing up the base storage of an iPhone to match what the same money would have bought in the previous range. However, now market research firm TrendForce claims that there will be larger increases that are more than this technique can cushion the blow.\n\nAs with all other recent reports, TrendForce believes that the base iPhone 17 model will be sold at the same $799 that the current iPhone 16 is. But it expects that the iPhone 17 Pro Max will rise by $100 — and the iPhone 17 Pro by $200.\n\nIn the case of the iPhone 17 Pro, TrendForce does agree that Apple will increase the base storage from 128GB to 256GB. But the current iPhone 16 Pro can be bought with 256GB for $1,099.\n\nTrendForce does not, though, expect Apple to increase the base storage of its iPhone 17 Pro Max to 512GB. The company believes Apple will instead keep it at 256GB.\n\nCurrently, an iPhone 16 Pro Max starts at $1,199 and has 256GB storage. So TrendForce is predicting a straight $100 price hike for this model, with no storage change.\n\nMost recently, JP Morgan predicted that the iPhone 17 Pro would increase from $999 to $1,099. But it also said that the base storage would rise to 256GB.\n\nJP Morgan based that assumption on how Apple has, at least for now, been made exempt from Trump's 100% semiconductor tariffs. The investment firm believes this means the iPhone 17 price increase therefore won't be because of tariffs, despite Apple facing $2 billion in tariff costs by the end of September.\n\nTrendForce also disagrees with reports such as JP Morgan's over the expected iPhone 17 Air. While JP Morgan thinks Apple will price it to match the outgoing iPhone 17 Plus at $899.\n\nJP Morgan also said that the iPhone 17 Air might rise to $949. But then it says there's a chance Apple will release it at $800 in order to have it eligible for government subsidies in China.\n\nTrendForce ignores that option, and also says that the iPhone 17 Air will not be price-matched to the iPhone 16 Plus. Instead, it is predicting a starting price for the iPhone 17 Air at $1,099.\n\nNote that TrendForce says only that this pricing and specification report is \"based on current market information and analyst projections.\" It does not cite any further sources.\n\nIt is the only source currently predicting such a large price increase, and one that is not or at least not entirely masked by storage changes.\n\nSuch storage increases have been effective before because of how many iPhone buyers already pay for extra storage, compared to those who stay on the base amount. Consumer Intelligence Research Partners (CIRP) even claims that about half of US iPhone buyers chose the higher, more expensive storage tiers.\n\nAll iPhone 17 pricing, at least for the US, will be announced by Apple during its \"Awe Dropping\" event on September 9, 2025.",
  "medium": "Article",
  "links": [
    "https://appleinsider.com/articles/25/09/02/iphone-17-price-hikes-may-be-minimal-despite-us-tariffs",
    "https://www.trendforce.com/presscenter/news/20250904-12700.html",
    "https://appleinsider.com/articles/25/05/27/iphone-buyers-worldwide-may-see-higher-prices-because-of-trumps-tariffs",
    "https://appleinsider.com/inside/iphone-17",
    "https://appleinsider.com/articles/25/06/24/apples-china-sales-might-get-boost-from-government-subsidy-program",
    "https://appleinsider.com/articles/25/07/31/apple-staring-down-2-billion-in-total-tariff-costs-in-total-before-end-of-september",
    "https://appleinsider.com/inside/iphone-17/tips/how-to-watch-apples-awe-dropping-iphone-17-launch-live",
    "https://appleinsider.com/articles/25/08/13/apples-iphone-17-pro-50-pricing-increase-strategy-wont-matter-to-half-of-buyers",
    "https://appleinsider.com/articles/25/08/13/iphone-17-pro-price-rise-to-be-masked-by-increased-storage",
    "https://appleinsider.com/articles/25/08/06/apple-exempt-from-100-semiconductor-tariffs-thanks-to-its-100b-us-investment",
    "https://appleinsider.com/inside/iphone-16"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US iPhone buyers",
      "weight": 0.11547992
    },
    {
      "name": "iPhone",
      "weight": 0.11467462
    },
    {
      "name": "Such storage increases",
      "weight": 0.10295211
    },
    {
      "name": "Apple",
      "weight": 0.09099549
    },
    {
      "name": "Price rises",
      "weight": 0.090008475
    },
    {
      "name": "Modest iPhone 17 Pro price increase rumor",
      "weight": 0.087866694
    },
    {
      "name": "extra storage",
      "weight": 0.08652832
    },
    {
      "name": "storage changes",
      "weight": 0.08588038
    },
    {
      "name": "storage",
      "weight": 0.084259816
    },
    {
      "name": "recent reports",
      "weight": 0.0841906
    }
  ],
  "topics": [
    {
      "name": "iPhone"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8203125
    },
    {
      "name": "/News/Technology News",
      "score": 0.8076171875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7060546875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.673828125
    }
  ],
  "sentiment": {
    "positive": 0.30240664,
    "negative": 0.17034025,
    "neutral": 0.5272531
  },
  "summary": "A new report by market research firm TrendForce has refuted claims of a small price hike for the iPhone 17 range, stating that there will be significant cost increases. The report suggests that the base iPhone 17 model will be sold at the same price as the current $799 price. However, TrendForce expects that the phone 17 Pro Max will increase by $100 and the 17 Pro by $200. TrendForce does not expect Apple to increase the base storage of its iPhone 17 ProMax to 512GB, but believes it will instead keep it at 256GB. The company also disagrees with reports such as JP Morgan's expected iPhone 17 Air price-matched to the current iPhone 16 Plus.",
  "shortSummary": "A new report suggests significant price increases for the iPhone 17 range, including increases in base storage and prices, despite previous reports of minimal increases due to tariffs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e70a3b7ccde148b29ed4647383064174",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.trendforce.com/presscenter/news/20250904-12700.html",
      "text": "Apple is set to unveil four flagship devices—the iPhone 17, the iPhone 17 Air (tentative name), iPhone 17 Pro, and iPhone 17 Pro Max. Beyond a refreshed design, the new lineup will feature enhancements in processor performance, thermal management, and imaging capabilities, all of which are expected to help stimulate demand. TrendForce projects that total shipments of the iPhone 17 series will rise by 3.5% compared with the iPhone 16 lineup in 2024, with the Pro series remaining the main sales driver. However, sluggish global economic conditions and the potential for higher prices on premium models may temper overall demand.\nThe introduction of the iPhone 17 Air signals Apple’s official entry into the thin-and-light flagship category. Yet, the Air may fall short of satisfying consumers who prioritize large batteries and high-end photography by reducing battery capacity and trimming camera specifications. TrendForce expects initial shipments of the Air to align with historical levels of the Plus series, though its actual sales performance remains to be seen.\nThe iPhone 17 and Air are expected to feature the A19 processor, while the Pro series will adopt the A19 Pro. DRAM capacity will be increased to 12 GB on the Air, Pro, and Pro Max, and NAND Flash storage will start at 256 GB for these models, scaling up to 1 TB.\nThe Air model will use a silicon anode battery and eSIM configuration to balance slimness with endurance. Notably, the entire iPhone 17 series will see major camera upgrades, with the front camera moving from 12MP to 24MP and all rear cameras raised to 48MP. The Pro models will go a step further, featuring a redesigned rectangular array and optimized software algorithms to enhance optical zoom and image resolution.\nIn terms of pricing, the base iPhone 17 model is expected to hold last year’s levels, while the Air, Pro, and Pro Max will see increases of US$50–$100 per comparable capacity to reflect their design breakthroughs and hardware enhancements. The Air’s price point is expected to compete directly with Samsung’s Galaxy S25 Edge, underscoring Apple’s strategy of strengthening brand appeal through product differentiation.\nThe launch of the Air, together with next year’s anticipated foldable model, highlights Apple’s broader strategy to diversify its product portfolio and capture a wider user base. TrendForce notes that Apple may adjust its release cycle going forward, launching a sub-flag shipment model in the first half of the year, followed by the Air, Pro, Pro Max, and foldable in the second half—creating a richer, more clearly segmented product matrix.\nFor more information on reports and market data from TrendForce’s Department of Semiconductor Research, please click here, or email the Sales Department at SR_MI@trendforce.com\nFor additional insights from TrendForce analysts on the latest tech industry news, trends, and forecasts, please visit https://www.trendforce.com/news/\nSubject\nRelated Articles\nRelated Reports"
    }
  ],
  "argos_summary": "TrendForce reports that the iPhone 17 Pro and Pro Max will see significant price hikes of $200 and $100 respectively, with the Pro’s base storage rising to 256GB and the Pro Max remaining at 256GB. The base iPhone 17 will stay at $799, while the Pro Max is expected to cost $1,299. JP Morgan’s forecast of a $100 increase for the Pro is contradicted by TrendForce’s higher estimates, and the Air model is projected to start at $1,099. Apple will announce final pricing at its September 9 event.",
  "argos_id": "M53DE4YVW"
}