{
  "url": "https://www.fastcompany.com/91398060/the-new-boardroom-priority-upleveling-business-data-for-ai",
  "authorsByline": "Amit Walia",
  "articleId": "b5cb885431cb43b591c7a88ce2161901",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T23:27:00+00:00",
  "addDate": "2025-09-04T23:49:25.573411+00:00",
  "refreshDate": "2025-09-04T23:49:25.573414+00:00",
  "score": 1.0,
  "title": "The new boardroom priority: Upleveling business data for AI",
  "description": "Every AI strategy must also be a data strategy.",
  "content": "One of the key messages we are using in the market is “Everyone’s ready for AI except your data.”The funny thing about this statement is that we didn’t come up with it. We heard versions of this sentiment from customers, and there is truth to it, so we decided to just tell it back to them.\n\nAs AI becomes a growing business imperative, management teams need to ask: Is our data quality good enough? Is our data well-governed and secure? What are the risks of inaccurate data? Many organizations still have work to do to get their data into the necessary state of readiness, but not because they’ve neglected data management. They haven’t. It’s just that AI is more demanding and less forgiving. In the past, a data error might have meant a missed business opportunity. Now, faulty data can lead to AI bias or hallucinations—a more serious misfire that harms customer relationships and brand value. This helps explain why “data and AI” has become the new catch phrase; the two are inseparable. But that means data quality must meet a higher threshold.McKinsey recently pointed to “at-scale data quality checks” as a way to build confidence in AI and ensure readiness for governance tools and development protocols as part of its AI Trust Maturity Model.\n\nI’m having frequent conversations with CEOs and other business leaders who are anxious to understand how to proceed, and it’s top of mind in the board meetings I attend at Informatica, Box, and The Tech Interactive. As board members, we have a responsibility to assess both strategic opportunities and risks, which means enterprise AI is often on the agenda. Here’s the rub: You can’t have trusted AI without top-quality data. That implies clean, accurate, and timely data, but it’s more than that. There must be comprehensive governance, cross-functional committees for effective integration and implementation, and training, education, and ethical guidelines. In other words, execution requires a top-down commitment, which is why data for AI is rising to a board-level concern. That wasn’t the case even a few months ago. To start the year, there was barely a mention of data-readiness for AI in reports on board priorities from consulting firms like PwC and EY. But the pace of change is forcing corporate management to take notice.\n\nWhat can the board and other executive leaders do to ensure their companies go above and beyond traditional data management practices to produce “AI-grade” data? A good starting point is a clear-eyed assessment of an organization’s data landscape, including which assets are most essential to operations, the platforms and infrastructure used to manage those data stores, and how much of it has been migrated to the cloud, which is a factor in AI-readiness. C-level executives should also ensure their AI strategies and business goals are well-aligned. Whether the objective is to expand into new regions, drive product development and revenues, or lower costs through supply-chain efficiencies, data-driven AI solutions can be brought to bear—but only if data is high-caliber.\n\nThe first steps in AI implementation are development, testing, and pilot projects, to be followed by wider rollouts. This is where data curation and quality management get put to the real-world test with customers and partners. That’s true whether it involves generative AI, private models based on retrieval-augmented generation (RAG), or agentic AI. Other data and AI essentials are the ability to monitor, measure, and improve. Many organizations are still in the early stages with AI, but as they scale up and out, the executives responsible for oversight will need metrics and key performance indicators (KPIs) to assess progress and evaluate the effectiveness of their investments. These AI dashboards can also be invaluable for risk management. A word of warning to business leaders who decide to get involved with AI data: Don’t be surprised if you encounter a mess. Corporate data systems are notoriously fragmented and complex. A survey by analyst firm BARC and sponsored by Informatica found that data quality and lineage were the most-cited challenges and obstacles to AI, identified by 45% of respondents.\n\nYet, given the growing role that AI has for many organizations, there’s no turning back. My advice is to follow best practices in modern data management, and you will be headed in the right direction—toward trusted data that is well-tuned for AI. Like so much of what we do as stewards for the companies we build and guide, business performance will depend largely on how we handle AI’s opportunities and challenges. That’s why every AI strategy must also be a data strategy.",
  "medium": "Article",
  "links": [
    "https://cdn.prod.website-files.com/67af3db5bb3b892e61258bd4/6841bc85bfa49cb1114cb6ab_BARC_Preparing-and-Delivering-Data-for-AI.pdf",
    "https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/tech-forward/insights-on-responsible-ai-from-the-global-ai-trust-maturity-survey",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://www.fastcompany.com/newsletters",
    "https://www.ey.com/en_gl/board-matters/americas-board-priorities-2025",
    "https://www.fastcompany.com/section/artificial-intelligence",
    "https://www.mansueto.com/privacy-policy/",
    "https://www.pwc.com/us/en/executive-leadership-hub/board-priorities.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI data",
      "weight": 0.1230348
    },
    {
      "name": "data management",
      "weight": 0.10179962
    },
    {
      "name": "business data",
      "weight": 0.10156603
    },
    {
      "name": "AI implementation",
      "weight": 0.09702364
    },
    {
      "name": "modern data management",
      "weight": 0.09639649
    },
    {
      "name": "AI",
      "weight": 0.094944425
    },
    {
      "name": "generative AI",
      "weight": 0.09304955
    },
    {
      "name": "traditional data management practices",
      "weight": 0.09300312
    },
    {
      "name": "agentic AI",
      "weight": 0.092294455
    },
    {
      "name": "data",
      "weight": 0.089528285
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.875
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.74462890625
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.708984375
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.66748046875
    },
    {
      "name": "/News/Technology News",
      "score": 0.50732421875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.5029296875
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Data Management",
      "score": 0.417236328125
    }
  ],
  "sentiment": {
    "positive": 0.09595478,
    "negative": 0.5595096,
    "neutral": 0.34453562
  },
  "summary": "The article suggests that as AI becomes a growing business imperative, management teams need to consider the quality of their data and risk of inaccurate data. The author points out that data quality must meet a higher threshold than that of top-quality data. This requires comprehensive governance, cross-functional committees, and training, education, and ethical guidelines. As board members, they have a responsibility to assess both strategic opportunities and risks for enterprise AI. McKinsey recently suggested “at-scale data quality checks” as a way to build confidence in AI and ensure readiness for governance tools and development protocols. The article also suggests that corporate data systems are notoriously fragmented and complex, with surveyARC and sponsored by Informatica highlighting challenges and challenges to AI.",
  "shortSummary": "As AI becomes a crucial business necessity, executives must prioritize data quality and governance to ensure effective implementation and sustainability.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1ecccf7b05584dfdadf8605628533c29",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.ey.com/en_gl/board-matters/americas-board-priorities-2025",
      "text": "EY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients.\nHow EY can help\n-\nEY Center for Board Matters. We support board members in their oversight role by helping them address complex boardroom issues. Find out more.\nRead more\nBoards can foster robust dialogue by questioning how management is reducing costs in a targeted way and reinvesting capital to develop capabilities to support growth. Through rigorous oversight of the portfolio review process, boards can press management on how it evaluates underperforming business units or non-strategic assets. They can support divestment actions that free up capital for more profitable ventures and oversee how metrics designed to measure investment decisions impartially are helping CEOs act with confidence.\nMany companies will continue to invest in artificial intelligence (AI) as they move from a multitude of AI use cases to a prioritized set of investments that can be applied at scale to improve value optimization and creation. Notably, two-thirds of directors responding to the survey think management should prioritize AI to capture market opportunities and greater internal efficiencies over mitigating risks. Just one-third said mitigating AI risks should be prioritized even if it reduces speed to market or slows internal process improvements. This imbalance underscores the need for robust debate and constructive deliberation to establish that the board and the management team are aligned on risk appetite with respect to AI investments.\nDirectors will embrace transaction-led transformation, survey responses show. Directors who think their company’s strategy will change over the next three years ranked the pressure to grow via transactions as a top driver of that change, along with increased competition and AI. Deal volume is expected to increase in 2025, underscoring the importance of boards’ overseeing how their companies are optimizing their portfolios to enable agility and capital strength. Further, boards will play an important role in overseeing how companies are truly transforming through capital strategy decisions that may require reimagining the enterprise."
    },
    {
      "url": "https://www.pwc.com/us/en/executive-leadership-hub/board-priorities.html",
      "text": "{{item.title}}\nEB new styles XF - New Brand\nAgainst macroeconomic uncertainty, geopolitical conflict, a tight labor market and shifts in consumer habits, companies are trying to execute strategies that can keep the business relevant well into the future. Corporate governance needs to adapt to that change.\nAs a director, your oversight responsibilities have greatly expanded amid this global uncertainty. Even experienced boards can’t always foresee emerging risks like cyber attacks, data loss, regulatory shifts and extreme weather. However, you are rising to the challenge by adding members with essential skills, deepening your understanding of corporate strategy and enhancing governance practices. What hasn’t changed: a commitment to leading the company to a position of strength.\nIn this period of historic change — marked by rapid shifts in policy and evolving market dynamics — your role in providing oversight and finding clarity and direction among the noise has never been more critical.\nYou are stepping up with fresh thinking and bold leadership. Our survey shows that executives' confidence in their boards continues to improve. While there is still room for progress, the upward trend marks a positive shift in C-suite board perceptions.\nRead the survey for insights on how boards are navigating a fast-moving economic, legal and regulatory environment — including growing pressure to strengthen AI oversight and strategic focus.\n[43%] of executives want AI expertise added to the board\nGetting the board’s composition right often involves a balancing act between preserving institutional knowledge and adding the skills executives now expect — especially in areas like AI, international strategy and sustainability. In fact, PwC's Board Effectiveness: A Survey of the C-Suite found that only 32% of executives believe their board has the right expertise.\nStay informed and act decisively to align your strategy with these changes so you can keep your company one step ahead.\nAssessing directors' performance helps identify skill gaps, improve dynamics and confirms alignment with the company’s strategy.\nFind out how boards can tackle board refreshment and succession planning in a rapidly changing business environment.\nHow can you boost effectiveness and efficiency to improve oversight? By asking key questions on board composition, performance assessments, leadership and more.\n[93%] of executives say they want someone on the board replaced\nBe aware of potential blind spots affecting your oversight abilities. While our 2024 Annual Corporate Director Survey finds that almost all respondents believe their boards are capable of guiding their companies through a crisis, previous surveys have found that many companies still do not have a formal escalation plan in place. This suggests an overconfidence that may lead boards to downplay a potential enterprise-level risk or, worse, ignore it altogether. Operational disruptions due to extreme weather, supply chain snarls, cyber attacks or political unrest can occur at any time. A holistic risk management process may not be able to stop a bad actor intent on harming your company, but boards that form a strategy for understanding crises can help their companies be resilient in the face of interconnected risks that are emerging with unprecedented velocity.\nLearn why preparation is key to a company's crisis recovery. Boards can facilitate robust, flexible crisis plans and engage in continuous improvement.\nExplore how audit committees can adapt their oversight to address emerging AI-related risks, ethics and compliance issues.\nLearn why cyber resilience is crucial with expanding attack surfaces and shifting regulations in PwC's latest survey.\n[Only 15%] of directors say their boards should spend increased time on crisis management over the next 12 months\nNot everyone across the organization understands the role of the board, which can lead to misperceptions about its effectiveness. Our Board Effectiveness: A Survey of the C-Suite shows that while confidence in boards is growing, just 35% of executives rate their board’s performance as excellent or good. Executives see progress, but greater alignment on priorities like sustainability, talent and AI — fostered through deeper board-executive engagement — is key to stronger oversight.\nCorporate directors must be prepared for shareholder activism. Explore our guide on analyzing trends, strategies and tactics in shareholder activism.\nEffective director-shareholder engagement benefits both parties. Discover key steps for directors and investors to maximize these exchanges.\n[55%] of investors are dissatisfied or very dissatisfied with how management connects sustainability to the company’s long-term growth strategy in reporting and other communications\nEmerging technologies such as AI and generative AI have the potential to help your company reinvent the way it runs and acts on strategic opportunities. The board has an important oversight role to play to help safeguard the company while delivering value from these technologies.\nTo provide effective oversight, you should understand their potential — and their limitations. Tap into internal specialists and external resources as a starting point to stay apprised of growing capabilities. Also, keep up with new use cases for specific implementations and understand how business models are changing, as well as the risks and responsible uses. Boards should also discuss management accountability matters in addition to the overall benefits and costs to the company.\nExplore PwC's AI predictions with actionable strategies, industry insights, and trends shaping AIs role in business transformation for 2025 and beyond.\nSix key areas can help a board provide effective AI oversight.\nExplore emerging tech investment priorities, how it can revolutionize business models and what makes a company a tech leader in our inaugural survey.\n[68%] of US CEOs say generative AI will significantly change the way their companies capture value over the next three years\nSource: US CEO views from PwC's 27th Annual Global CEO Survey\nIn the 2024 Annual Corporate Directors Survey, just 47% say that sustainability issues are regularly a part of their board agenda — a continued decline over the last three years that indicate boards could be missing out on a massive strategic opportunity.\nA wave of regulations globally means companies are likely on the cusp of publishing more data than ever before. While this may simply seem like a compliance exercise, boards can engage the CEO, CFO, Chief Sustainability Officer and the ESG controller to determine whether the data reveals strategic insights. Companies that collect, measure and manage this data in real-time have an opportunity to transform their decision-making process on product sustainability, decarbonization and supply chain resilience by grounding it in information that can be analyzed throughout the year.\nUnderstand the board's role in overseeing environmental, social and governance issues.\nYour resource for sustainability insights on strategy, reporting, energy demand, capital projects, tax policy, climate risk, regulatory updates and technology.\nTechnology can help you take advantage of sustainability tax incentives and credits, like the Inflation Reduction Act, to advance the value of sustainability initiatives.\nIdentify the key focus areas of your colleagues."
    }
  ],
  "argos_summary": "Boards are increasingly treating AI data readiness as a top priority, recognizing that poor data quality can lead to bias and hallucinations in AI models. The article emphasizes that achieving AI‑grade data requires rigorous quality checks, governance, cross‑functional oversight, and alignment with business objectives. Executives are urged to assess data landscapes, migrate to cloud, and implement KPIs to monitor AI performance and risk. The shift reflects a broader trend of embedding AI oversight into board agendas, with firms like EY and PwC highlighting the need for dedicated AI expertise and robust risk frameworks.",
  "argos_id": "OXCEPW8UY"
}