{
  "url": "https://www.foxnews.com/politics/rfk-jr-invokes-democrat-fathers-words-defend-trump-backed-cdc-shakeup-senate-hearing",
  "authorsByline": "Alec Schemmel",
  "articleId": "6db465c81d164ec0a3989b8f17b99a4b",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/09/rfk-jr-capitol-hill-cdc-hearing-democrat-legacy-father-dad-kennedy.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T16:18:13-04:00",
  "addDate": "2025-09-04T20:24:49.373914+00:00",
  "refreshDate": "2025-09-04T20:24:49.373916+00:00",
  "score": 1.0,
  "title": "RFK Jr. invokes Democrat father’s words to defend Trump-backed CDC shakeup at Senate hearing",
  "description": "Health Secretary RFK Jr. quotes his father while defending CDC reforms that led to the firing of a director and staff resignations amid the Trump administration's changes.",
  "content": "Health Secretary Robert F. Kennedy Jr. cited his father, Robert Kennedy, a former U.S. Attorney General and senator from New York, while testifying on Capitol Hill about backlash over the Trump administration's efforts to reform the Centers for Disease Control and Prevention (CDC).\n\nThe Health and Human Services Department (HHS) head signaled a dramatic course-correction at the CDC several days before the hearing, which came amid reports of the administration's decision to fire CDC Director Susan Monarez. Monarez's firing spurred backlash among Democrats who complained that the administration's efforts to reform the CDC, including through staff and budget cuts, were politicizing public health and undermining scientific integrity.\n\n\"The people at the CDC who oversaw [the COVID-19 mitigation] process, who put masks on our children, who closed our schools, are the people who will be leaving,\" Kennedy said during his opening remarks, shortly after the hearing was briefly interrupted by a heckler. \"That's why we need bold, competent, and creative new leadership at CDC. People who are able to and willing to chart a new course.\"\n\nRFK JR AND TOP DEM CLASH DURING HEATED SENATE HEARING: 'THIS IS ABOUT KIDS'\n\n\"As my father once said, 'progress is a nice word, but change is its motivator. And change has its enemies.'\" The health secretary, who is also the nephew of former President John F. Kennedy, continued: \"That's why we need new blood at CDC.\"\n\nThursday's brief moment when Kennedy invoked his father, who was shot and killed while serving as a U.S. senator in 1968, would not be the first time the Kennedy family has been invoked in the health secretary's approach to governing. In the lead up to President Donald Trump's 2024 election victory, Robert F. Kennedy Jr.'s sister, Kerry Kennedy, slammed him for supporting Trump and \"desecrat[ing] and trampl[ing] and set[ting] fire\" to their dad's memory.\n\nThe quote from RFK Jr.'s father comes from a speech he made to the United States Conference of Mayors in Chicago in 1963. The remarks came while he was serving as attorney general under former Democratic Party president Lyndon B. Johnson.\n\nKennedy's speech in Chicago discussed contemporary economic stresses and poverty in the early 1960s, noting they had resulted in an \"unwanted stockpile of idle youth,\" according to a copy of the speech shared by the Department of Justice (DOJ). The then-attorney general suggested the issue was exacerbated by a lack of equal access to education, vocation training and poor housing that was occurring at the time.\n\n\"The hardest task is to appoint and incorporate in our work a group of men and women with the power and willingness to look at our community difficulties, dissect them, criticize areas of shortcoming, and make meaningful suggestion,\" Kennedy said during his speech to the conference of mayors. \"Sometimes, too, it is hard to accept that sort of recommendation. For, sometimes, it carries with it announced or implied criticism of programs that have failed us in the past. Change means that someone's professional feathers will be ruffled, that a glass-topped desk might be moved to another office or abandoned, that pet programs might die.\"\n\n\"Progress is the nice word we like to use. But change is its motivator. And change has its enemies,\" Kennedy continued. \"The willingness to confront that change will determine how much we shall really do for our youth and how truly meaningful our efforts will be.\"\n\nAmid the CDC shakeup being spearheaded by RFK Jr., over 1,000 current and former federal health officials penned a letter this week calling for the HHS secretary's resignation, arguing he is \"endanger[ing] the nation's health.\" Following Monarez's ouster, several other top CDC officials resigned in protest of the Trump administration's policies on public health.\n\nMeanwhile, Kennedy penned an op-ed earlier this week in the Wall Street Journal echoing his Thursday remarks on Capitol Hill that the changes coming to the CDC are restoring confidence in an agency that lost the public's trust due to its response to the COVID-19 virus.\n\nPREVIOUS CDC DIRECTORS ACCUSE RFK JR. OF ENDANGERING ALL AMERICANS IN NY TIMES ESSAY\n\n\"Most CDC rank-and-file staff are honest public servants,\" the health secretary wrote. \"Under this renewed mission, they can do their jobs as scientists without bowing to politics.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/media/rfk-jr-details-how-he-plans-restoring-public-trust-cdc-new-wsj-op-ed",
    "https://www.foxnews.com/politics/cdc-director-susan-monarez-refuses-fired-other-officials-call-quits",
    "https://www.foxnews.com/politics/rfk-jr-top-dem-clash-during-heated-senate-hearing-this-about-kids",
    "https://rfkhumanrights.org/quote/speech-in-chicago-2/",
    "https://www.foxnews.com/media/rfk-jr-sister-completely-disavows-msnbc-interview-brother-set-fire-fathers-memory",
    "https://www.foxnews.com/health",
    "https://www.foxnews.com/politics/rfk-jr-denies-telling-former-cdc-director-approve-vaccine-recommendations",
    "https://www.foxnews.com/video/6378421795112",
    "https://www.foxnews.com/media/previous-cdc-directors-accuse-rfk-jr-endangering-all-americans-ny-times-essay"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Robert F. Kennedy Jr.",
      "weight": 0.081464216
    },
    {
      "name": "CDC",
      "weight": 0.078570575
    },
    {
      "name": "former President John F. Kennedy",
      "weight": 0.077332005
    },
    {
      "name": "Robert Kennedy",
      "weight": 0.07689612
    },
    {
      "name": "several other top CDC officials",
      "weight": 0.07592531
    },
    {
      "name": "Health Secretary Robert F. Kennedy Jr.",
      "weight": 0.07592064
    },
    {
      "name": "John F. Kennedy",
      "weight": 0.07537747
    },
    {
      "name": "CDC Director Susan Monarez",
      "weight": 0.07345116
    },
    {
      "name": "PREVIOUS CDC DIRECTORS",
      "weight": 0.073442034
    },
    {
      "name": "Kennedy",
      "weight": 0.07270053
    }
  ],
  "topics": [
    {
      "name": "DNC"
    },
    {
      "name": "CDC"
    }
  ],
  "categories": [
    {
      "name": "Health"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.93701171875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.88525390625
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.87841796875
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.70361328125
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.368408203125
    }
  ],
  "sentiment": {
    "positive": 0.041505568,
    "negative": 0.78506696,
    "neutral": 0.17342743
  },
  "summary": "Health Secretary Robert F. Kennedy Jr. used his father's words to defend the Trump administration's efforts to reform the Centers for Disease Control and Prevention (CDC) during a Senate hearing. The hearing, which was interrupted by a heckler, came amid reports of the administration's decision to fire CDC Director Susan Monarez. Monarez's dismissal sparked backlash among Democrats who claimed that the reforms were politicizing public health and undermining scientific integrity. RFK Jr. echoed these sentiments in an op-ed by the Wall Street Journal earlier this week, stating that the agency is restoring public trust in its response to the COVID-19 response. This is not the first time RFK has been invoked in his administration's approach to governing.",
  "shortSummary": "Health Secretary Robert F. Kennedy Jr. defended the Trump administration's reforms of the CDC amid criticism of politicization and scientific integrity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9c6b8285d0034d3f8b6ba18f254c8284",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/media/rfk-jr-details-how-he-plans-restoring-public-trust-cdc-new-wsj-op-ed",
      "text": "Health and Human Services Secretary Robert F. Kennedy Jr. said Tuesday that the American public has lost faith in the Centers for Disease Control and Prevention and outlined his plan to rebuild trust in an op-ed for The Wall Street Journal.\nKennedy blamed decades of bureaucracy, politicized science and \"mission creep\" for eroding the CDC’s core role of protecting Americans from infectious disease and squandering public confidence.\nKennedy pointed to the CDC’s response to COVID-19 as an example of dysfunction that \"produced irrational policy\" and further eroded trust in the agency.\n\"Cloth masks on toddlers, arbitrary 6-foot distancing, boosters for healthy children, prolonged school closings, economy-crushing lockdowns, and the suppression of low-cost therapeutics in favor of experimental and ineffective drugs,\" he wrote. \"The toll was devastating.\"\nMORE THAN 1,000 HHS WORKERS DEMAND KENNEDY RESIGNATION OVER CDC DIRECTOR FIRING AND AGENCY CHANGES\nAlthough some may see the agency's missteps during the pandemic as a one-off mistake, Kennedy asserted that this failure was \"no anomaly,\" citing declining life expectancy and declining trust from the public as evidence.\n\"Trust has collapsed: Only one-third of health care workers participated in the 2023-24 fall COVID booster program, and fewer than 10% of children under 12 received boosters in 2024-25. The American people no longer believe the CDC has their best interests at heart,\" he wrote.\nOn an operational level, the HHS secretary was critical of the CDC's budget allocation and staffing. He ripped the agency for having only half of its total budget support its infectious-disease mission, and for the fact that fewer than 1 in 10 employees are epidemiologists—which he blames for the CDC's \"disastrous\" pandemic response.\nDespite his sharp criticisms, Kennedy expressed hope that the agency could be restored to its former effectiveness. He noted that the CDC's response to a measles outbreak this year showed how the agency can \"act swiftly with precision when guided by science and freed from ideology.\"\nKennedy highlighted some of the actions already taken by the Trump administration to tackle the issues impacting the CDC, such as replacing leaders who've resisted reform and eliminating conflicts of interests and bureaucratic complacency.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\n\"First, the CDC must restore public trust—and that restoration has begun. It won’t stop until America’s public-health institutions again serve the people with transparency, honesty and integrity,\" he concluded.\nFox News Digital reached out to the CDC for further comment.\nCLICK HERE TO GET THE FOX NEWS APP\nMore than 1,000 current and former employees of the Department of Health and Human Services (HHS) signed a letter calling on Kennedy to resign on Wednesday.\nThe employees cited Kennedy's recent ousting of the Centers for Disease Control and Prevention (CDC) director Susan Monarez. They also accused Kennedy of appointing \"political ideologues\" to positions of authority.\nThat followed nine former directors and former acting CDC directors who wrote Monday in The New York Times that Kennedy's leadership was endangering all Americans, accusing him of downplaying vaccines and focusing on unproven treatments.\nHHS didn't respond to a request for comment."
    },
    {
      "url": "https://www.foxnews.com/media/previous-cdc-directors-accuse-rfk-jr-endangering-all-americans-ny-times-essay",
      "text": "Several former directors and former acting directors at the Centers for Disease Control and Prevention (CDC) condemned Health and Human Services Secretary Robert F. Kennedy Jr. in a joint New York Times guest essay on Monday.\nIn the essay, the nine officials across Democratic and Republican administrations accused the Trump appointee of weakening the nation’s public health system.\n\"What Health and Human Services Secretary Robert F. Kennedy Jr. has done to the CDC and to our nation’s public health system over the past several months—culminating in his decision to fire Dr. Susan Monarez as CDC director days ago—is unlike anything we have ever seen at the agency, and unlike anything our country has ever experienced,\" they wrote.\nCDC DIRECTOR SUSAN MONAREZ REFUSES TO BE FIRED AS OTHER OFFICIALS CALL IT QUITS\nMonarez was removed as the head of the agency last week, less than a month after her confirmation. She reportedly refused Kennedy's directives to adopt new limitations on the availability of some vaccines, including approvals for COVID-19 shots.\nFour other senior CDC officials resigned, pointing to Monarez’s removal, as well as Kennedy’s vaccine policies, as the reasons for their exit. Additionally, hundreds of workers at the agency also walked out of the CDC's headquarters in Atlanta last month in support of their former colleagues.\nThe Times guest essay's authors – William Foege, William Roper, David Satcher, Jeffrey Koplan, Richard Besser, Tom Frieden, Anne Schuchat, Rochelle P. Walensky and Mandy K. Cohen – slammed Kennedy, stating he \"has fired thousands of federal health workers and severely weakened programs designed to protect Americans from cancer, heart attacks, strokes, lead poisoning, injury, violence and more.\"\nABOUT 600 CDC WORKERS TERMINATED AFTER COURT CLEARS PART OF TRUMP ADMIN RESTRUCTURING PLAN\n\"Amid the largest measles outbreak in the United States in a generation, he’s focused on unproven ‘treatments’ while downplaying vaccines,\" they wrote. \"He canceled investments in promising medical research that will leave us ill-prepared for future health emergencies. He replaced experts on federal health advisory committees with unqualified individuals who share his dangerous and unscientific views.\"\nThey also blasted the secretary for ending U.S. support of global vaccination programs and justifying the move with \"flawed research\" and \"inaccurate statements.\" Additionally, they said he supported federal legislation that would cause \"millions of people with health insurance through Medicaid to lose their coverage.\"\nThe collection of former directors said that, because of these actions, rural Americans and people with disabilities will have less access to health care, lower-income Americans will have less access to treatment, and children could lose access to \"lifesaving vaccines.\"\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nIn his own New York Times guest essay published on Saturday, Sen. Bernie Sanders, I-Vt., called for Kennedy to resign after Monarez’s exit.\n\"Despite the overwhelming opposition of the medical community, Secretary Kennedy has continued his longstanding crusade against vaccines and his advocacy of conspiracy theories that have been rejected repeatedly by scientific experts,\" Sanders wrote.\nCLICK HERE TO GET THE FOX NEWS APP\nHHS did not immediately reply to Fox News Digital's request for comment."
    },
    {
      "url": "https://www.foxnews.com/media/rfk-jr-sister-completely-disavows-msnbc-interview-brother-set-fire-fathers-memory",
      "text": "Robert F. Kennedy Jr.'s sister, Kerry Kennedy, disavowed her brother in an interview with MSNBC's Joy Reid on Monday.\n\"Personally, I completely disavow and separate and disassociate myself from my brother, Bobby Kennedy, and his flagrant and inexplicable effort to desecrate and trample and set fire to daddy's memory,\" she said in an interview on her brother's choice to endorse former President Trump.\n\"I love Bobby and I have tremendous respect for the work that he's done in the past,\" she said. \"But on this, he's wrong. On this, it's really important for people to understand that the Kennedy family endorses Harris.\"\nSince withdrawing from the campaign, Kennedy spoke on Sunday about the \"unity government\" he is supporting alongside Trump. He said the former president agreed to pursue the key issues that were the focus of the independent candidate's campaign, such as ending the war in Ukraine, combating censorship and improving children's health in the U.S.\nTRUMP THANKS RFK JR FOR ENDORSEMENT AFTER THIRD-PARTY CAN\nKerry Kennedy said that Trump's \"cruel sneering at human rights for suffering people in America and around the world\" would have been anathema to her father.\n\"If my dad were alive today he would detest almost everything about Donald Trump,\" she said. \"His lying, his selfishness, his racism, his cynicism, hatred, fascist sympathies, deliberate misinformation about vaccines, criminal felony convictions, rape of E. Jean Carrol, his contempt for the poor and suffering, for ethics [and] for democracy,\" she said.\nRFK Jr. has responded to criticism that he has received from his wife and other members of the Kennedy family.\n\"You know, my family is at the center of the Democratic Party. I have members of my family that are working for the Biden administration. Biden has a bust of my father behind him at the Oval Office, and he's been a family friend for many years,\" he said.\n\"My family is – I understand that they're troubled by my decisions. I love my family. I feel like we were raised in a milieu where we were encouraged to debate each other and debate ferociously and passionately about things and still love each other,\" he added. \"They're free to take their positions on these issues. There are many, many members of my family working at my campaign and who are supporting me.\"\nRFK JR LOSES SECRET SERVICE PROTECTION AFTER SUSPENDING CAMPAIGN\nFox News Digital reached out to the former office for the Kennedy campaign but did not immediately receive a response.\nCLICK HERE TO GET THE FOX NEWS APP\nFox News' Anders Hagstrom contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/politics/rfk-jr-top-dem-clash-during-heated-senate-hearing-this-about-kids",
      "text": "Health and Human Services Secretary Robert F. Kennedy Jr., got into a heated debate with Sen. Ron Wyden, D-Or., during a hearing on Thursday.\nThe exchange came as Kennedy was testifying before the Senate Finance Committee. Wyden accused Kennedy of putting children into \"harm's way\" with his policies and argued Kennedy has shown no regrets about doing so.\n\"This is about kids being pushed into harm's way by reckless and repeated decisions to get scientists and doctors out of the way and allow conspiracy theories to dictate this country's health policy,\" Wyden said at the end of his questioning.\n\"I don't see any evidence that you have any regrets about anything you've done or plans to change it. And my last comment is, I hope that you will tell the American people how many preventable child deaths are an acceptable sacrifice for enacting an agenda that I think is fundamentally cruel and defies common sense. Thank you, Mr. Chairman,\" Wyden said.\nBIPARTISAN FURY AT CDC: SENATORS DEMAND PROBE, REJECT VACCINE GUIDANCE AS ILLEGITIMATE\n\"Do I get a reply?\" Kennedy said. \"Senator you've sat in that chair how long? 20-25 years while the chronic disease of our children went up to 76%. And you said nothing.\"\n\"You never asked the question why it's happening. Why is this happening? Today, for the first time in 20 years, we've learned that infant mortality has increased in our country. It's not because I came in here. It's because of what happened during the Biden administration that we're going to end,\" he continued.\nCDC DIRECTOR SUSAN MONAREZ REFUSES TO BE FIRED AS OTHER OFFICIALS CALL IT QUITS\nCommittee Chairman Mike Crapo, R-Idaho, then intervened, granting Wyden another chance to speak briefly, though his microphone remains turned off.\n\"We're going to proceed,\" Crapo says. \"I gave Senator Wyden as ranking member some leeway there, but we're gonna stick to the five minutes.\"\nKennedy's testimony came one day after over 1,000 current and former HHS employees signed a letter calling for his resignation on Wednesday. Sen. Bernie Sanders, I-Ver., also called for his resignation.\nKennedy's critics point to his firing of former Center for Disease Control and Prevention (CDC) director Susan Monarez.\nCLICK HERE TO GET THE FOX NEWS APP\n\"We believe health policy should be based in strong, evidence-based principles rather than partisan politics. But under Secretary Kennedy’s leadership, HHS policies are placing the health of all Americans at risk, regardless of their politics,\" the Wednesday letter read."
    },
    {
      "url": "https://www.foxnews.com/politics/cdc-director-susan-monarez-refuses-fired-other-officials-call-quits",
      "text": "Longtime government scientist Susan Monarez is refusing to leave her position as director of the Centers for Disease Control and Prevention (CDC) after the Department of Health and Human Services (HHS) announced she had been removed from the role less than a month after she was sworn in.\nAttorneys Mark Zaid and Abbe Lowell said they are representing Monarez and claimed she \"has neither resigned nor yet been fired.\"\nThe attorneys released a statement on social media, claiming HHS and Secretary Robert F. Kennedy Jr. are weaponizing public health for political gain and putting millions of American lives at risk.\n\"When CDC Director Susan Monarez refused to rubber-stamp unscientific, reckless directives and fire dedicated health experts, she chose protecting the public over serving a political agenda,\" the statement said. \"For that, she has been targeted. Dr. Monarez has neither resigned nor received notification from the White House that she has been fired, and as a person of integrity and devoted to science, she will not resign.\"\nABOUT 600 CDC WORKERS TERMINATED AFTER COURT CLEARS PART OF TRUMP ADMIN RESTRUCTURING PLAN\nThe Washington Post reported that sources within the CDC, who spoke on the condition of anonymity, said HHS leaders, including Kennedy, sought to get Monarez to commit to rescinding approvals for certain COVID-19 vaccines. When Monarez did not immediately commit, she was told by administration officials that she must resign or she would be fired.\nSources also claimed she then attempted to involve the chairman of the Senate's top health committee, Sen. Bill Cassidy, R-La. The move reportedly further angered Kennedy.\nWhen reached for comment, a spokesperson for the HHS directed Fox News Digital to the agency's response shared on its official X account.\n\"Susan Monarez is no longer director of the Centers for Disease Control and Prevention,\" HHS said. \"We thank her for her dedicated service to the American people. Secretary Kennedy has full confidence in his team at the CDC who will continue to be vigilant in protecting Americans against infectious diseases at home and abroad.\"\nThe White House confirmed to Fox News Digital that Monarez was being removed.\n\"As her attorney’s statement makes abundantly clear, Susan Monarez is not aligned with the President’s agenda of Making America Healthy Again,\" White House spokesman Kush Desai said in a statement. \"Since Susan Monarez refused to resign despite informing HHS leadership of her intent to do so, the White House has terminated Monarez from her position with the CDC.\"\nMonarez was tapped by the Trump administration to lead the CDC after its initial nominee, Dave Weldon, withdrew from contention in March amid fears he might not garner enough support in the Senate to be confirmed. Shortly after Weldon stepped down, Monarez was formally nominated to be the CDC's permanent director and was eventually confirmed in the final week of July.\nDuring Monarez's confirmation hearing, she expressed support for vaccines and told lawmakers she has \"not seen a causal link between vaccines and autism.\"\nMEDICAL GROUP GOES AGAINST CDC, RECOMMENDS COVID SHOTS FOR YOUNG KIDS\nPrior to Monarez's Senate confirmation, CDC directors did not typically require Senate approval, but that changed in 2022 when Congress passed a law making it necessary. Monarez was the first-ever Senate-confirmed CDC director in the agency's history.\nMonarez was also the first CDC director without a medical degree in more than seven decades. However, she does hold a Ph.D. in microbiology and immunology.\nAfter getting her doctorate, Monarez entered the federal government, where she found herself in roles at the White House's Office of Science and Technology Policy, the National Security Council, the Department of Homeland Security and the Advanced Research Projects Agency for Health (ARPA-H). Her biography on the CDC's website says she worked on \"leading efforts to enhance the nation's biomedical innovation capabilities, including combating antimicrobial resistance, expanding the use of wearables to promote patient health, ensuring personal health data privacy, and improving pandemic preparedness.\"\nHours after the news that Monarez would no longer head the CDC, sources confirmed to Fox News Digital that at least three other top CDC officials tendered their resignations, including the CDC's director of its National Center for Immunization and Respiratory Diseases, Demetre Daskalakis; the director of the National Centers for Emerging and Zoonotic Infectious Disease, Dr. Daniel Jernigan; and the CDC's chief medical officer, Debra Houry.\nCLICK HERE TO GET THE FOX NEWS APP\nDaskalakis posted his lengthy resignation letter on X, citing various reasons for his departure, including \"the views\" of Secretary Kennedy and his staff.\nDaskalakis said he could not continue to work in an administration that treats the CDC \"as a tool\" to establish policies that \"do not reflect scientific reality.\" He specifically cited recent changes Kennedy's HHS has brought to vaccine scheduling for children and adults, arguing it \"threaten[s] the lives of the youngest Americans and pregnant people.\"\nThe former CDC director also cited the administration's efforts to \"erase transgender populations, cease critical domestic and international HIV programming, and terminate key research.\"\nFox News' David Lewkowict contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/politics/rfk-jr-denies-telling-former-cdc-director-approve-vaccine-recommendations",
      "text": "Health and Human Services (HHS) Secretary Robert F. Kennedy Jr. accused his former head of the Centers for Disease Control and Prevention (CDC) of lying about vaccine recommendations.\nKennedy appeared before the Senate Finance Committee on Thursday for a hearing focused on President Donald Trump’s healthcare agenda, dubbed Make America Healthy Again (MAHA) on the campaign trail last year.\nHHS SECRETARY ROBERT F. KENNEDY JR. TO FACE SENATE PANEL AFTER CDC TURMOIL\nBut the recent turmoil at the CDC caused by the firing of former CDC Director Susan Monarez and the exodus of several senior officials, along with Kennedy’s view on vaccines, became a focal point for both Senate Republicans and Democrats on the panel.\nDuring a fiery exchange at the start of the hearing between Kennedy and Sen. Ron Wyden, the top Democrat on the Senate Finance Committee, Kennedy accused Monarez of lying in a recent Wall Street Journal opinion piece.\nMonarez was fired less than a month after being confirmed by the Senate and charged in her op-ed that during a meeting with the secretary last month, she was pressured to resign or be fired after being ordered to \"pre-approve the recommendations of a vaccine advisory panel newly filled with people who have publicly expressed anti-vaccine rhetoric.\"\nBIPARTISAN FURY AT CDC: SENATORS DEMAND PROBE, REJECT VACCINE GUIDANCE AS ILLEGITIMATE\nWyden questioned whether Kennedy did tell Monarez to \"just go along with vaccine recommendations even if she didn't think such recommendations aligned with scientific evidence?\"\n\"Yes or no? You have an opportunity to call her a liar. If you say that you didn't, do it,\" the Oregon Democrat said. \"But I'd like to see you respond to this.\"\n\"No,\" Kennedy said. \"No, I did not say that to her. And I never had a private meeting with her.\"\nPREVIOUS CDC DIRECTORS ACCUSE RFK JR. OF ENDANGERING ALL AMERICANS IN NY TIMES ESSAY\nKennedy argued earlier in the hearing that the reason he fired Monarez, along with the entirety of the CDC’s vaccine recommendation panel to restore the CDC to the \"gold standard\" of healthcare.\nCLICK HERE TO GET THE FOX NEWS APP\n\"America is home to 4.2% of the world's population. Yet we had nearly 20% COVID deaths. We literally did worse than any country in the world. And the people at the CDC who oversaw that process, who put masks on our children, who closed our schools, are the people who will be leaving,\" Kennedy said. \"And that's why we need bold, competent and creative new leadership at CDC.\"\n\"People are able and willing to chart a new course,\" he continued. \"As my father once said, ‘Progress is a nice word, [but] change [is a] motivator. And change has its enemies.’ That's why we need new blood at CDC.\""
    }
  ],
  "argos_summary": "Health Secretary Robert F. Kennedy Jr. defended the Trump‑era overhaul of the CDC, citing his father’s words to justify the firing of Director Susan Monarez and the departure of senior staff. He argues the agency has been politicized and that new leadership is needed to restore scientific integrity. The move has sparked backlash from over 1,000 former HHS employees and nine former CDC directors who accuse Kennedy of endangering public health.",
  "argos_id": "PK8J9XTTI"
}