{
  "url": "https://financialpost.com/pmn/business-pmn/swiss-inflation-exceeds-zero-for-a-third-month-in-relief-for-snb?itm_source=business-pmn",
  "authorsByline": "Bloomberg News",
  "articleId": "3c5d518e4dd74811a1fafded445b2db7",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/09/swiss-inflation-held-at-0-2-in-august.jpg",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-09-04T06:56:27+00:00",
  "addDate": "2025-09-04T07:20:17.629708+00:00",
  "refreshDate": "2025-09-04T07:20:17.629710+00:00",
  "score": 1.0,
  "title": "Swiss Inflation Exceeds Zero for a Third Month in Relief for SNB",
  "description": "Swiss inflation stayed positive for a third consecutive month, offering reassurance to policymakers as they also evaluate if the economy can weather a jump in US ta…",
  "content": "Consumer prices rose 0.2% from a year ago in August, matching the increase of the previous month, the country’s statistics office said on Thursday. Most economists in a Bloomberg survey had anticipated inflation to stay at that level or accelerate.\n\nThe report marks the final glimpse of price data before the Swiss National Bank’s quarterly decision later this month. Signs of some inflation may lessen pressure on officials to cut interest rates again at a time when the economy is threatened by President Donald Trump’s disproportionately high US tariffs of 39%.\n\nGet the latest headlines, breaking news and columns.\n• There was an error, please provide a valid email address. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Top Stories will soon be in your inbox. We encountered an issue signing you up. Please try again\n\nThe reading is strong enough to raise the prospect that price growth in the third quarter may end up exceeding the 0.1% average predicted by the SNB at its last policy decision in June.\n\n“At this stage, we do not see any risks of deflationary developments, and our forecasts show a jump in inflation in the coming quarters,” Vice President Antoine Martin said in an interview with L’Agefi published last week.\n\nAs in previous years, August proved a pivotal month for the adjustment of rents in Switzerland, helping to push up the overall index — along with clothing and footwear — to offset lower prices for holiday-related activity.\n\nOfficials will confront a finely balanced trade-off in coming weeks. They must assess if recent weakening in the franc has been enough to stoke import prices, just as Switzerland’s predicament is further compounded by US tariffs.\n\nThe SNB’s rate is already at zero, further complicating its decision on Sept. 25. Officials have consistently signaled that the bar to reintroducing negative borrowing costs for the first time in three years is higher than for a normal cut. Money-market pricing currently suggests the central bank will keep its policy rate steady well into next year.\n\nConsumer-price growth in the surrounding euro area remains stronger than in Switzerland and came in at 2.1% in August. Based on the European Union’s harmonized measure, the Swiss inflation rate was zero in the period.",
  "medium": "Article",
  "links": [
    "https://financialpost.com/subscribe",
    "https://financialpost.com/video-centre/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "price growth",
      "weight": 0.085290834
    },
    {
      "name": "price data",
      "weight": 0.081351
    },
    {
      "name": "import prices",
      "weight": 0.08123738
    },
    {
      "name": "lower prices",
      "weight": 0.081117295
    },
    {
      "name": "Consumer prices",
      "weight": 0.08046272
    },
    {
      "name": "Swiss Inflation",
      "weight": 0.07905713
    },
    {
      "name": "inflation",
      "weight": 0.0714956
    },
    {
      "name": "next year",
      "weight": 0.0691895
    },
    {
      "name": "interest rates",
      "weight": 0.06855176
    },
    {
      "name": "previous years",
      "weight": 0.06783411
    }
  ],
  "topics": [
    {
      "name": "Inflation"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.9892578125
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.8662109375
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.556640625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.486572265625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.45458984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.40576171875
    }
  ],
  "sentiment": {
    "positive": 0.2973483,
    "negative": 0.37257156,
    "neutral": 0.33008012
  },
  "summary": "Swiss consumer prices rose by 0.2% from a year ago in August, matching the previous month's increase. This relief comes ahead of the Swiss National Bank's quarterly decision on interest rates. The strong reading raises the possibility that price growth in the third quarter may exceed the 0.1% average predicted by the SNB. The SNB does not see any risks of deflationary developments and forecasts show a jump in inflation in the coming quarters. The economy is also threatened by high US tariffs. The central bank's rate is already at zero, complicating its decision on Sept.",
  "shortSummary": "Swiss inflation rose 0.2% in August, easing pressure from potential interest rate cuts, amid concerns over US tariffs and a stronger euro.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8cf32af630d6477f898e1af3d3878a2b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://financialpost.com/subscribe",
      "text": "Online Access\nFor readers who mean business.\nregular price $28, now available for $19 per month\nregular price $280, now available for $190 per year\n- Exclusive articles from Barbara Shecter, Joe O'Connor and Gabriel Friedman, plus daily newsletters and curated Financial Times content.\n- Opportunity to engage with our commenting community and learn from fellow readers in a moderated forum.\n- Unlimited online access to Financial Post.\n- Personalized news feed based on your interests and favourite journalists in the Financial Post App. Available now in the App store.\n- National Post ePaper, an electronic replica of the print edition to view on any device, share and comment on.\n- Support local journalism."
    },
    {
      "url": "https://financialpost.com/video-centre/",
      "text": "Home | Financial Post Home Page | Financial Post\nAdvertisement 1\nAdvertisement 2\nStories continue below\n- Advertisement 2Stories continue below\nAdvertisement 3\nStories continue below\n- Advertisement 3Stories continue below\nAdvertisement 4\nStories continue below\n- Advertisement 4Stories continue below\nAdvertisement 5\nStories continue below\n- Advertisement 5Stories continue below\nAdvertisement 6\nStories continue below\n- Advertisement 6Stories continue below\nAdvertisement 7\nStories continue below\n- Advertisement 7Stories continue below\nAdvertisement 8\nStories continue below\n- Advertisement 8Stories continue below\nAdvertisement 9\nStories continue below\n- Advertisement 9Stories continue below\nAdvertisement 10\nStories continue below\n- Advertisement 10Stories continue below\nAdvertisement 11\nStories continue below\n- Advertisement 11Stories continue below\nAdvertisement 12\nStories continue below\n- Advertisement 12Stories continue below\nAdvertisement 13\nStories continue below\n- Advertisement 13Stories continue below\nAdvertisement 14\nStories continue below\n- Advertisement 14Stories continue below\nAdvertisement 15\nAdvertisement"
    }
  ],
  "argos_summary": "Swiss consumer prices rose 0.2% year‑on‑year in August, the third straight month above zero, easing pressure on the SNB to cut rates. The central bank’s policy rate is already at zero and is expected to stay unchanged through next year, with a negative rate only if conditions shift sharply. Weakening of the franc and high U.S. tariffs could lift import prices, adding uncertainty to the inflation outlook. Meanwhile, euro‑area inflation remains higher at 2.1%.",
  "argos_id": "PV774846U"
}