{
  "url": "https://www.cnbc.com/2025/09/04/autos-porsche-to-drop-out-of-germanys-dax-index-as-us-tariffs-bite.html",
  "authorsByline": "Sam Meredith",
  "articleId": "c076cf6ba9614f3cae557fe258cfc303",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108194112-1756971236514-gettyimages-2185283117-AFP_36N26VB.jpeg?v=1756971334&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T08:27:24+00:00",
  "addDate": "2025-09-04T08:33:24.165993+00:00",
  "refreshDate": "2025-09-04T08:33:24.165995+00:00",
  "score": 1.0,
  "title": "Luxury carmaker Porsche to drop out of Germany’s DAX index as U.S. tariffs bite",
  "description": "Sportscar manufacturer Porsche will soon drop out of Germanys blue-chip DAX index following a dramatic share price slump.",
  "content": "The Porsche brand logo as lettering can be seen on the rear of a vehicle from the sports car manufacturer Porsche in Munich (Bavaria) on April 6, 2025.\n\nLuxury carmaker Porsche will soon drop out of Germany's blue-chip DAX index following a protracted share price slump, as U.S. tariffs take their toll on the European auto industry.\n\nIn a Wednesday statement, STOXX Ltd said that Porsche would exit the DAX on Sept. 22 as part of a regular reshuffle and be replaced by online listings company Scout24.\n\nPorsche is poised to become a member of the midcap MDAX index later this month, according to the update from a unit of stock exchange operator Deutsche Boerse.\n\nThe manufacturer of high-performance sports cars, such as the renowned 911 model and luxury sports utility vehicles, has been hit particularly hard by U.S. President Donald Trump's tariffs on European autos.\n\nPorsche, which entered the DAX three years ago after its initial public offering in Sept. 2022, has repeatedly lowered its outlook in recent months, citing the impact of U.S. tariffs, weak demand in China and a slower-than-expected transition to electric mobility.\n\nCompany shares have fallen by more than a third over the last 12 months.\n\nPorsche CEO Oliver Blume said in an interview with German newspaper FAZ on Thursday that the company aims to return to the DAX \"as soon as possible\" and cited technical factors for the firm's index relegation.\n\nA spokesperson for Porsche referred CNBC to Blume's comments to FAZ when asked to comment on the new orientation.",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/donald-trump/",
    "https://www.cnbc.com/2025/08/21/us-eu-trade-agreement-details.html",
    "https://www.cnbc.com/quotes/P911-DE/",
    "https://newsroom.porsche.com/en/2025/company/porsche-second-quarter-half-year-2025-financial-figures-40184.html",
    "https://stoxx.com/stoxx-announces-scheduled-adjustments-to-dax-blue-chip-indices-sep-3-2025/",
    "https://www.cnbc.com/quotes/.GDAXI/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Luxury carmaker Porsche",
      "weight": 0.10764588
    },
    {
      "name": "Porsche CEO Oliver Blume",
      "weight": 0.1032114
    },
    {
      "name": "Porsche",
      "weight": 0.10262554
    },
    {
      "name": "U.S. tariffs",
      "weight": 0.0990833
    },
    {
      "name": "luxury sports utility vehicles",
      "weight": 0.085502155
    },
    {
      "name": "DAX",
      "weight": 0.084562674
    },
    {
      "name": "Company shares",
      "weight": 0.07572414
    },
    {
      "name": "U.S.",
      "weight": 0.07502931
    },
    {
      "name": "online listings company Scout24",
      "weight": 0.073755726
    },
    {
      "name": "German newspaper FAZ",
      "weight": 0.073224455
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.79150390625
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.71826171875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.446044921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.3623046875
    }
  ],
  "sentiment": {
    "positive": 0.0318684,
    "negative": 0.81550086,
    "neutral": 0.15263067
  },
  "summary": "Luxury carmaker Porsche is set to exit Germany's DAX index on Sept. 22 as part of a regular reshuffle and will be replaced by online listings company Scout24. The company's shares have fallen by more than a third over the last 12 months due to U.S. President Donald Trump's tariffs on European autos. Porsche, which entered the DAX three years ago, has lowered its outlook in recent months, citing the impact of the tariffs, weak demand in China, and a slower transition to electric mobility.",
  "shortSummary": "Porsche will exit Germany's DAX index on September 22 due to severe economic impacts, including U.S. tariffs and weak demand from China.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "44e4dbe06003499eb8f0b40e49f584b2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stoxx.com/stoxx-announces-scheduled-adjustments-to-dax-blue-chip-indices-sep-3-2025/",
      "text": "- Changes in DAX, MDAX, SDAX and TecDAX\n- New index adjustments will become effective on September 22, 2025\nZUG (September 3, 2025) – STOXX Ltd., part of the ISS STOXX group of companies and leading provider of benchmark and custom index solutions to global institutional investors, today announced the new composition of the DAX blue-chip indices.\nMedia Contact\nSarah Ball\nExecutive Director, Communications\npress@iss-stoxx.com\nDAX, MDAX, SDAX and TecDAX represent the largest companies (by free float market capitalization) on the Regulated Market of Frankfurt Stock Exchange, which meet the basic criteria as defined in the rulebook. The indices are reviewed every three months. The scheduled September review includes the Regular Exit, Regular Entry, Fast Exit and Fast Entry rules.\nThe following changes will be made:\nDAX\n| Addition | Deletion |\n| GEA Group Aktiengesellschaft | Sartorius AG Vz |\n| Scout24 SE | Porsche AG Vz |\nMDAX\n| Addition | Deletion |\n| Porsche AG Vz | Scout24 SE |\n| Sartorius AG Vz | GEA Group Aktiengesellschaft |\n| Fielmann Group AG | EVOTEC SE |\nSDAX\n| Addition | Deletion |\n| EVOTEC SE | Fielmann Group AG |\n| 1&1 AG | SGL Carbon SE |\nTecDAX\n| Addition | Deletion |\n| 1&1 AG | Formycon AG |\nAll changes will become effective on September 22, 2025.\nThe date for the next scheduled review of the DAX blue-chip indices is December 3, 2025.\nDAX®, MDAX®, SDAX® and TecDAX® are registered trademarks of ISS STOXX Index GmbH.\nAbout STOXX\nSTOXX® and DAX® indices comprise a global and comprehensive family of more than 18,000 strictly rules-based and transparent indices. Best known for the leading European equity indices EURO STOXX 50®, STOXX® Europe 600 and DAX®, the portfolio of index solutions consists of total market, benchmark, blue-chip, sustainability, thematic and factor-based indices covering a complete set of world, regional and country markets. STOXX and DAX indices are licensed to more than 550 companies around the world for benchmarking purposes and as underlyings for ETFs, futures and options, structured products, and passively managed investment funds. STOXX Ltd., part of the ISS STOXX group of companies, is the administrator of the STOXX and DAX indices under the European Benchmark Regulation. stoxx.com\nAbout ISS STOXX\nISS STOXX GmbH, through its group companies, is a leading provider of comprehensive and data-centric research and technology solutions that help capital market participants identify investment opportunities, detect qualitative and quantitative portfolio company risks, and meet evolving regulatory requirements. With roots dating back to 1985, we today deliver world-class benchmark and custom indices across asset classes and geographies and serve as a premier source of independent corporate governance, sustainability, cyber risk, and fund intelligence research, data, and related offerings. Our products and services give clients the scale and leverage they need to grow their business more effectively and efficiently. ISS STOXX, which is majority owned by Deutsche Börse Group, is comprised of more than 3,500 professionals operating across 33 global locations in 19 countries. Its approximately 6,400 clients include many of the world’s leading institutional investors who turn to ISS STOXX for its objective and varied offerings, as well as companies focused on ESG, cyber, and governance risk mitigation as a shareholder value enhancing measure. Clients rely on ISS STOXX’s expertise to help them make informed decisions to benefit their stakeholders.\nLegal disclaimer:\nSTOXX Ltd., ISS STOXX GmbH, ISS STOXX Index GmbH, Deutsche Börse Group and their licensors, research partners or data providers do not make any warranties or representations, express or implied, with respect to the timeliness, sequence, accuracy, completeness, currentness, merchantability, quality or fitness for any particular purpose of its index data and exclude any liability in connection therewith. STOXX Ltd., ISS STOXX GmbH, ISS STOXX Index GmbH, Deutsche Börse Group and their licensors, research partners or data providers are not providing investment advice through the publication of indices or in connection therewith. None of their products or services recommends, endorses, approves or otherwise expresses any opinion regarding any issuer, securities, financial products or trading strategies. In particular, the inclusion of a company in an index, its weighting, or the exclusion of a company from an index, does not in any way reflect an opinion of STOXX Ltd., ISS STOXX GmbH, ISS STOXX Index GmbH, Deutsche Börse Group or their licensors, research partners or data providers on the merits of that company and may not be relied on as such. Financial instruments based on the STOXX® indices, DAX® indices or on any other indices supported by STOXX are in no way sponsored, endorsed, sold or promoted by STOXX Ltd., ISS STOXX GmbH, ISS STOXX Index GmbH, Deutsche Börse Group or their licensors, research partners or data providers."
    },
    {
      "url": "https://newsroom.porsche.com/en/2025/company/porsche-second-quarter-half-year-2025-financial-figures-40184.html",
      "text": "- Macroeconomic and geopolitical headwinds weigh substantially on half-year results. Porsche responds with comprehensive strategic realignment measures.\n- Extensive rescaling and a more flexible product portfolio are its objectives.\n- Special charges of around 1.1 billion euros, including for battery activities, US tariffs and the strategic realignment.\n- Group sales revenue in the first half of the year at 18.16 billion euros, with operating profit at 1.01 billion euros.\n- Record deliveries in North America as well as in the Overseas and Emerging Markets.\n- The proportion of electrified vehicles in Europe is around 57 per cent, exceeding the target set at the time of the IPO.\n- Success in quality ranking and in motorsport.\n- CEO Oliver Blume: “The world is changing dramatically. That's why we are fundamentally developing Porsche. Our completely revamped product range is very well received by our customers. We therefore expect that we will begin to see positive momentum again from 2026 onwards.”\n- CFO Dr Jochen Breckner: “The aim of our strategic realignment is to strengthen our profitability and resilience.”\nIn the first six months of 2025, the sports car manufacturer generated a group sales revenue of 18.16 billion euros (previous year: 19.46 billion euros). Group operating profit amounted to 1.01 billion euros (previous year: 3.06 billion euros). The group operating return on sales was 5.5 per cent (previous year: 15.7 per cent).\nBusiness performance was impacted by ongoing macroeconomic and geopolitical challenges. “We continue to face significant challenges around the world. And this is not a storm that will pass. The world is changing dramatically – and, above all, differently to what was expected just a few years ago. Some of the strategic decisions made back then appear in a different light today. That is why we are fundamentally developing Porsche further,” says Oliver Blume, Chairman of the Executive Board of Porsche AG. “Our completely revamped product range is very well received by our customers. We expect that we will begin to see positive economic momentum again from 2026 onwards.”\nAccording to Blume, three factors in particular are shaping the current situation for Porsche: “In China, demand in the premium and luxury segment has fallen sharply. In the US, import tariffs are also putting huge pressure on our business. Looking ahead, the movement of the dollar could also have an impact. In addition, the transformation to electric mobility is progressing more slowly than expected overall, with consequences for the supplier network.” In light of these conditions, Porsche’s management is resolutely pushing ahead with extensive measures to rescale and recalibrate the company. In the first half of 2025, special expenses for the company's realignment amounted to around 200 million euros, and to around 500 million euros for battery activities. The US import tariffs resulted in an additional burden of 400 million euros because Porsche offered its customers price protection.\nSecond package of measures to be negotiated with employee representatives\n“The aim of our strategic realignment is to strengthen our profitability and resilience,” says Dr Jochen Breckner, Member of the Executive Board for Finance and IT. In the second half of this year, Porsche will start negotiations with employee representatives on a second package of measures, as announced. “In order to make Porsche fit for the future, we will discuss far-reaching approaches,” says Breckner. \"These measures are expected to have a positive impact on earnings and cash flow in the coming years.”\nAutomotive net cashflow amounted to 394 million euros (previous year: 1.12 billion euros). The automotive net cashflow margin was 2.4 per cent (previous year: 6.3 per cent). In the first half of this year, Porsche delivered 146,391 vehicles to its customers worldwide. Of these, 36.1 per cent were electrified. This percentage is made up of 23.5 per cent all-electric vehicles and 12.6 per cent plug-in hybrids. In Europe, the proportion of electrified vehicles was around 57 per cent. This exceeded the target set at the time of the IPO. The best-selling model was the Macan, with 45,137 deliveries worldwide. Porsche set new delivery records in North America as well as in the Overseas and Emerging Markets.\n“We will continue to manage supply and demand in close coordination with our sales regions in accordance with our 'value over volume' strategy. This is based on our highly attractive product range and the strength of our brand,” says Breckner. “We are also seeing positive momentum from our individualisation offerings.”\nPlanned ramp-up of battery cell production at V4Smart\nA few months after the founding of V4Smart GmbH, the Porsche AG subsidiary has reached its first milestone with the second production line in Nördlingen (Bavaria) now ramped up as planned. Alongside the line in Ellwangen, it is currently the only production facility in Europe for high-performance lithium-ion round cells.\nPorsche has also performed well in terms of quality. In the recently published J.D. Power APEAL study in the US, Porsche ranked first among all manufacturers in customer perception. In motorsport, the sports car manufacturer achieved an impressive double victory last weekend. At the season finale of the Formula E in London, Porsche won the world championship title in both the team and manufacturer standings. Prior to that, Porsche celebrated its second consecutive class victory in the LMGT3 category at the 24 Hours of Le Mans with the Porsche 911 GT3 R. In the overall standings, the Porsche 963 finished second at Le Mans after a thrilling finale.\nForecast for 2025 adjusted after tariff agreement\nFollowing the EU Commission's agreement with the US government on import tariffs, Porsche has adjusted its outlook for 2025. This takes into account the expected effects of the new tariffs as well as the tariff effects that have been in place since June, which had not yet been included in the previous forecast. The updated forecast now includes expected import tariffs of 15 per cent from August 1, as well as potential countermeasures such as price adjustments. These are designed to mitigate the financial impact. Porsche continues to expect group sales revenue in the range of 37 to 38 billion euros. This is in line with the previous forecast. At the lower end of the range, Porsche expects a group return on sales of 5 per cent and an automotive net cashflow margin of 3 per cent. At the upper end of the range, a group return on sales of 7 per cent and an automotive net cashflow margin of 5 per cent are expected. The upper end remains in line with the original forecast from the end of April. The outlook includes expected special effects related to the strategic realignment, amounting to around 1.3 billion euros.\n| Porsche AG Group |\nH1 2025 |\nH1 2024 |\nAlteration |\n| Sales revenue |\n€18.16 billion |\n€19.46 billion |\n-6.7% |\n| Operating profit | €1.01 billion |\n€3.06 billion |\n-67.0% |\n|\nOperating return on sales |\n5.5% | 15.7% |\n|\n|\nDeliveries to customers |\n146,391 | 155,945 | -6.1% |\nDisclaimer\nThis press release contains forward-looking statements and information that reflect Dr. Ing. h.c. F. Porsche AG's current views about future events. These statements are subject to many risks, uncertainties, and assumptions. They are based on assumptions relating to the development of the economic, political, and legal environment in individual countries, economic regions, and markets, and in particular for the automotive industry, which we have made on the basis of the information available to us and which we consider to be realistic at the time of publication. If any of these risks and uncertainties materializes or if the assumptions underlying any of the forward-looking statements prove to be incorrect, the actual results may be materially different from those Porsche AG expresses or implies by such statements. Forward-looking statements in this presentation are based solely on the circumstances at the date of publication. We do not update forward-looking statements retrospectively. Such statements are valid on the date of publication and can be superseded. This information does not constitute an offer to exchange or sell or an offer to exchange or buy any securities."
    },
    {
      "url": "https://www.cnbc.com/quotes/P911-DE/",
      "text": "Porsche AG P911-DE:XETRA\n*Data is delayed | Exchange | EUR\nLast | 11:21 AM CEST\n44.64+0.11 (+0.25%)\nVolume\n114,614\n52 week range\n39.58 - 75.00\n- Open44.07\n- Day High44.66\n- Day Low43.89\n- Prev Close44.53\n- 52 Week High75.00\n- 52 Week High Date09/27/24\n- 52 Week Low39.58\n- 52 Week Low Date06/26/25\nLatest On Porsche AG\nKey Stats\n- Market Cap48,207.48M\n- Shares Out911M\n- 10 Day Average Volume427,139.22\n- Dividend2.31\n- Dividend Yield5.17%\n- Beta1.45\n- YTD % Change-23.59\nLatest On Porsche AG\nKEY STATS\n- Open44.07\n- Day High44.66\n- Day Low43.89\n- Prev Close44.53\n- 52 Week High75.00\n- 52 Week High Date09/27/24\n- 52 Week Low39.58\n- 52 Week Low Date06/26/25\n- Market Cap48,207.48M\n- Shares Out911M\n- 10 Day Average Volume427,139.22\n- Dividend2.31\n- Dividend Yield5.17%\n- Beta1.45\n- YTD % Change-23.59\nRATIOS/PROFITABILITY\n- EPS (TTM)2.38\n- P/E (TTM)18.77\n- Fwd P/E (NTM)-\n- EBITDA (TTM)-\n- ROE (TTM)-\n- Revenue (TTM)-\n- Gross Margin (TTM)-\n- Net Margin (TTM)-\n- Debt To Equity (MRQ)-\nEVENTS\n- Earnings Date-\n- Ex Div Date05/22/2025\n- Div Amount0.8168\n- Split Date-\n- Split Factor-\nContent From Our Affiliates\nThere is no recent news for this security."
    },
    {
      "url": "https://www.cnbc.com/2025/08/21/us-eu-trade-agreement-details.html",
      "text": "The U.S. and European Union on Thursday revealed fresh details about their trade framework, including on hotly contested and anticipated pharma and semiconductor tariffs.\nAfter weeks of heated negotiation, Brussels and Washington finally arrived at a trade agreement late last month, setting out 15% blanket tariffs on EU exports to the U.S. Under the deal, the EU also committed to purchase $750 billion worth of U.S. energy and invest at least an additional $600 billion in the U.S.\nMany political and business leaders in Europe at the time expressed concerns about the deal being unbalanced. Several questions remained unanswered including on what tariff rate would apply to some goods U.S. President Donald Trump has hit with sectoral duties.\nThursday's announcement at last shed more details at a time when many other trading partners are still waiting, and negotiating, for similar clarity on their respective trade deals with the U.S.\nSpeaking to journalists on Thursday after the announcement, EU Trade Commissioner Maros Sefcovic said that \"this is the most favorable trade deal the U.S. has extended to any partner.\"\n\"But this is not the end. This is the beginning. This framework is the first step, one that can grow over time to cover more sectors, improve market access and strengthen our economic ties even further,\" he added.\nLumber, tech and regulation\nKey points in the statement include the U.S. committing to \"apply the higher of either the U.S. Most Favored Nation (MFN) tariff rate or a tariff rate of 15 percent, comprised of the MFN tariff and a reciprocal tariff, on originating goods of the European Union.\"\nAs of Sept. 1, the U.S. will apply only MFN duties on several goods from the EU, including \"unavailable natural resources (including cork), all aircraft and aircraft parts, generic pharmaceuticals and their ingredients and chemical precursors.\"\nSeveral so-called Section 232 tariffs have been capped at the wider 15% tariff rate, including those on lumber, semiconductors and pharmaceuticals, according to a senior U.S. administration official. This is sharply below the rates Trump has sometimes threatened, as well as a 100% levy on semiconductors.\nMeanwhile, the statement noted that the EU intends to \"to eliminate tariffs on all U.S. industrial goods and to provide preferential market access for a wide range of U.S. seafood and agricultural goods.\" This was already broadly covered in the initial framework.\nThe statement also included insights into the EU's energy purchasing and investment pledges, which previously raised questions about their feasibility and about potential repercussions if the commitments do not materialize.\nThe latest announcement reiterated figures for planned spending from the EU, including on artificial intelligence chips, energy and broader investments in the U.S., but described them as intended and expected, rather than as guaranteed commitments, a senior administration official pointed out.\nThursday's statement also noted plans for the EU to \"substantially\" increase its procurement of U.S. military and defense equipment, even as Europe has committed to growing its own defense capabilities.\nNotably, the latest agreement does not introduce changes in terms of the EU's Digital Services Act, which includes regulations for big tech companies and has long been a point of contention in trade talks for Trump.\nSefcovic on Thursday noted that the digital sector had been kept out of trade talks.\nHe also addressed questions regarding the wine and spirits sector, which is not covered by the deal. The EU's trade commissioner suggested that, while it would not be easy to come to an agreement on this issue with Washington, \"these doors are not closed forever.\"\nPharma\nEurope's pharmaceutical sector — the U.S.' top source for pharma imports — will also see tariffs capped at up to 15%. Critically, the rate will not stack on top of other EU-wide tariffs.\nFrom Sept. 1, the Trump administration has also agreed to only apply its MFN drug pricing policy to generic pharmaceuticals. The directive aims to reduce U.S. drug prices by tying them to the typically lower prices paid by other developed nations.\nBack in April, the Trump administration had launched a so-called Section 232 investigation on pharmaceutical products to examine the impact of imports on national security. In recent weeks, Trump threatened levies as high as 250% on the pharma sector and sent an ultimatum to major firms demanding that they lower U.S. drug prices.\nThe White House leader has long lambasted the sector over what he has dubbed \"abusive\" pricing practices, while simultaneously urging firms to move their manufacturing operations stateside in an effort to bolster domestic production.\nThat prompted a flurry of U.S. investment commitments over recent months, including from Novartis, AstraZeneca and Roche, as well as pricing adjustments from Novo Nordisk and Eli Lilly.\nAutos\nThe U.S. and EU on Thursday said they had agreed to a conditional 15% tariff for European autos and auto parts bound for the U.S. — but only after Brussels introduces legislation to reduce their industrial duties, according to a senior administration official.\nThe official added that the mere introduction of EU legislation to reduce the rate of industrial tariffs would be enough to kick-start this trade-off.\n\"With respect to automobiles, the United States and the European Union intend to accept and provide mutual recognition to each other's standards,\" the U.S. and EU said in a joint statement published Thursday.\nUnder the terms of the trade framework struck in late July, the EU said it would eliminate the \"already low\" duties on industrial goods from the U.S.\nSpeaking late last month, Trump had hailed the initially disclosed framework agreement as the biggest trade deal ever made and one that promised to be \"great for cars.\"\nThe prospect of a 15% tariff rate on autos and auto parts represents a substantial reduction from the U.S. president's threat to impose charges of 30%. It also nearly halves the existing tariff rate on Europe's auto sector from 27.5%.\nIndustry groups had previously expressed deep concern about the costs associated with the tariff reality.\nThe German Association of the Automotive Industry, or VDA, which represents more than 620 companies involved in the German auto sector, warned a U.S. tariff of 15% on auto products would \"cost German automotive companies billions annually and place a burden on them in the midst of their transformation.\""
    },
    {
      "url": "https://www.cnbc.com/donald-trump/",
      "text": "Donald J. Trump\nDonald J. Trump is the 47th president of the United States of America.Trump previously served as the 45th president of the United States from 2017 to 2021. Before he was elected to the White House, the Republican was best known for his family real estate business in New York City, his Atlantic City casinos, and his starring role on the hit NBC reality show \"The Apprentice.\"\nIn addition to his privately held real estate and resort company, Trump is a controlling shareholder of Trump Media & Technology Group (DJT), operator of the Truth Social social media app."
    },
    {
      "url": "https://www.cnbc.com/quotes/.GDAXI/",
      "text": "DAX .GDAXI:XETRA\n*Data is delayed | Exchange | EUR\nLast | 11:21 AM CEST\n23,695.90+101.10 (+0.43%)\nVolume\n7,879,554\n52 week range\n18,208.84 - 24,639.10\n- Open23,664.79\n- Day High23,711.99\n- Day Low23,610.45\n- Prev Close23,594.80\n- 52 Week High24,639.10\n- 52 Week High Date07/10/25\n- 52 Week Low18,208.84\n- 52 Week Low Date09/11/24\nLatest On DAX\nKey Stats\n- YTD % Change19.04\n- 1 Year % Change27.48\nLatest On DAX\nKEY STATS\n- Open23,664.79\n- Day High23,711.99\n- Day Low23,610.45\n- Prev Close23,594.80\n- 52 Week High24,639.10\n- 52 Week High Date07/10/25\n- 52 Week Low18,208.84\n- 52 Week Low Date09/11/24\n- YTD % Change19.04\n- 1 Year % Change27.48\nContent From Our Affiliates\nThere is no recent news for this security."
    }
  ],
  "argos_summary": "Porsche will exit the German DAX index on September 22, 2025, after a prolonged share price decline driven by U.S. tariffs, weak Chinese demand, and slower EV adoption. The company will move into the mid‑cap MDAX and aims to re‑enter the DAX as soon as possible. The exit reflects the broader impact of U.S. trade policy on European automakers and signals a shift in the composition of Germany’s blue‑chip benchmark.",
  "argos_id": "R31D3UTN6"
}