{
  "url": "https://finance.yahoo.com/news/goldhaven-resources-provides-exploration-magno-130000552.html?.tsrc=rss&_guc_consent_skip=1756992858",
  "authorsByline": "GoldHaven Resources Corp.",
  "articleId": "540b8572617340f49b07383d6e10c695",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/globenewswire.com/28caaba03b222a9392a0afc1953c21b7",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T13:00:00+00:00",
  "addDate": "2025-09-04T13:37:21.699494+00:00",
  "refreshDate": "2025-09-04T13:37:21.699497+00:00",
  "score": 1.0,
  "title": "GoldHaven Resources Provides Exploration Update on Magno Project",
  "description": "VANCOUVER, British Columbia, Sept. 04, 2025 (GLOBE NEWSWIRE) -- GoldHaven Resources Corp. (“GoldHaven” or the “Company”) (CSE: GOH) (OTCQB: GHVNF) (FSE: 4QS) is pleased to provide an update on its exploration work program on the 100% owned Magno Project located in Northern British Columbia. Highlights The Magno Project field program is halfway complete, with systematic sampling and detailed mapping advancing understanding of larger, deeper targets linked to Cretaceous magmatism and extensive sur",
  "content": "The Magno Project hosts multiple styles of mineralization that appear to share common fluid pathways and heat sources, reflecting a series of related mineralizing events. By consolidating the Cassiar Stock and its associated mineralized showings into a single claim package, GoldHaven’s technical team now has the rare advantage of interpreting the system as a whole rather than in isolated pieces. Even after limited fieldwork, the team has been able to connect mineralized skarns with north–south parallel contacts and crosscutting northeast-trending structures, where narrow apophyses of Cretaceous age Cassiar Stock intrude the surrounding Cassiar Terrane sediments.\n\nGoldHaven’s fully funded 2025 exploration program has passed the halfway mark, with the team making strong progress through systematic sampling and detailed structural and mineralization mapping. The program is designed to advance the Company’s understanding of the potential for larger and deeper targets linked to the Cretaceous magmatism, while also evaluating the extensive surface skarn and carbonate replacement-style mineralization across the project. Initial samples are being prepared for shipment to ALS Global in Whitehorse, Yukon. The results are expected to provide important catalysts and direction for advancing the Magno Project.\n\nA portion of the team’s work has been directed toward confirmation sampling, including high-grade surface samples along with historic trench and chip sample intercepts. These efforts were further advanced through the addition of new extensions to historic chip and channel samples, concentrated in areas of known mineralization such as the Magno and Kuhn zones, where historical resource estimates have been reported by previous operators.\n\nExploration at Magno Central (encompassing the Magno and D zones) has confirmed the presence of structurally controlled skarn and CRD-style mineralization as well as some unique and poorly exposed hydrothermal mineralization within the Lower Cambrian Atan Group, specifically the Rosella Formation, which comprises limestone, marble, and clastic limestones. Historically, these zones have been well known for Ag-Pb-Zn mineralization; however, the team aims to expand on more recent discoveries indicating the presence of indium (In) and gallium (Ga). Mineralization is characterized by sulphur-rich, redox-driven skarns hosting massive galena with associated sphalerite and magnetite. Both historical sampling and recent sampling by James Turner P.Geo has verified high silver values from these structurally controlled skarns exceeding 2,000 ppm Ag from galena-dominated zones.\n\nAt both the Magno zones, mineralization is structurally controlled, occurring as bedding-parallel, conformable “manto” bodies as well as crosscutting “chimney”-style mineralization, with an overall northeast trend cutting through the Rosella Group limestones. Comparisons can be drawn to Coeur Mining Inc.’s Silvertip Project, located within the same Cassiar Terrane north of the Magno property, which provides a strong analogue for the potential development of deeper, contact-parallel, large-scale skarn systems at Magno. The D zone uniquely shares analogies with the Magno but additionally contains some impressive zones of massive sulphides which carry textural similarities to hydrothermal mineralization. More work is required to understand the D zone in greater detail, but its presence suggests a larger, longer-lasting, multiphase and potentially multi-deposit style district within Magno than previously imagined.\n\nMapping and sampling in the Kuhn Zone during the August field program focused on verifying historic trenches and conducting detailed mapping of both the prospective area and the mineralogical zonation of the skarns. Two principal skarn horizons, the Lower and Upper 3a skarns, have been delineated, traced for 640 m and 206 m respectively, with the potential to extend along strike for up to 2 km each. The Lower 3a skarn, generally well exposed, follows the Boya–Rosella Group contact, while the Upper 3a skarn lies 10–20 m stratigraphically above and is more poorly exposed.\n\nSkarn mineral zonation is dominated by diopside–garnet assemblages, with additional zones containing tremolite, pyrrhotite, and scheelite. The skarns pinch and swell along strike, with variable widths. Historical reports document scheelite mineralization in zones 1–4 m wide; however, visible scheelite has also been observed in quartzites adjacent to the contact, suggesting potential for increased widths and further exploration upside.\n\nAt Kuhn South, the same skarn horizons are present but are crosscut by a northeast-trending structure. Here, skarn mineralization is oriented NE, characterized by a silicified diopside–garnet core with pervasive sphalerite banding.\n\nSimilar mineralization is present at the Dead Goat showing, a north–south striking skarn composed of diopside, garnet, pyrrhotite, and scheelite, ranging from 1 m to several m in width, with a surface expression of up to 200 m.\n\nRob Birmingham, CEO of GoldHaven Resources, commented: “We are pleased to provide an update on the exploration program at the Magno Project, which commenced in August and has already delivered encouraging progress. The program has focused on validating historical high-grade mineralization, with the team successfully accessing a significant portion of the expansive 30,000-hectare property. Numerous rock and chip samples have been collected and will be submitted for analysis upon program completion. The Project benefits from established road access and excellent on-site accommodations—remnants of past mining activity in and around Magno—allowing the team to operate efficiently and maximize productive time in the field. Our dedicated team is on track with detailed structural mapping and sampling, paving the way to delineate the deeper-rooted systems and unlock the full polymetallic potential of this expansive property.”\n\nThe technical and scientific information contained in this news release has been reviewed and approved by Lindsay Bottomer P.Geo. who is a Qualified Person as defined under NI 43-101 and a consultant of the Company.\n\nGoldHaven Resources Corp. is a Canadian junior exploration Company focused on acquiring and exploring highly prospective land packages in North and South America. The Company’s projects include (i) the flagship Magno Project, a district-scale polymetallic property adjacent to the historic Cassiar mining district in British Columbia; (ii) the Three Guardsman Project, which exhibits significant potential for copper and gold-skarn mineralization; (iii) the Copeçal Gold Project, a drill-ready gold project located in Mato Grosso, Brazil with a 6km strike of anomalous gold in soil samples; and (iv) three critical mineral projects with extensive tenement packages totalling 123,900 hectares: Bahia South, Bahia North and Iguatu projects located in Brazil.\n\nOn Behalf of the Board of Directors\n\nFor further information, please contact:\n\nThe CSE and Information Service Provider have not reviewed and does not accept responsibility for the accuracy or adequacy of this release.\n\nThis news release contains “forward-looking information” within the meaning of applicable Canadian securities legislation. Often, but not always, forward-looking information and information can be identified by the use of words such as “plans”, “expects” or “does not expect”, “is expected”, “estimates”, “intends”, “anticipates” or “does not anticipate”, or “believes”, or variations of such words and phrases or state that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved. Actual future results may differ materially. In particular, this news release contains forward-looking information relating to the Company and the Property. The forward-looking information reflects management's current expectations based on information currently available and are subject to a number of risks and uncertainties that may cause outcomes to differ materially from those discussed in the forward-looking information. Such risk factors may include, among others, but are not limited to: general economic conditions in Canada and globally; industry conditions, including governmental regulation and environmental regulation; the availability of capital on acceptable terms; the need to obtain required approvals from regulatory authorities; stock market volatility; competition for, among other things, skilled personnel and supplies; incorrect assessments of the value of acquisitions; geological, technical, processing and transportation problems; changes in tax laws and incentive programs; failure to realize the anticipated benefits of acquisitions and dispositions; and the other factors. Although the Company believes that the assumptions and factors used in preparing the forward-looking information are reasonable, undue reliance should not be placed on such information and no assurance can be given that such events will occur in the disclosed time frames or at all. Factors that could cause actual results or events to differ materially from current expectations include: (i) adverse market conditions; and (ii) other factors beyond the control of the Company. New risk factors emerge from time to time, and it is impossible for the Company’s management to predict all risk factors, nor can the Company assess the impact of all factors on Company’s business or the extent to which any factor, or combination of factors, may cause actual results to differ from those contained in any forward-looking information. The forward-looking information included in this news release are made as of the date of this news release and the Company expressly disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. Additional information identifying risks and uncertainties that could affect financial results is contained in the Company’s filings with Canadian securities regulators, which are available on the Company’s profile at www.sedarplus.ca.\n\nPhotos accompanying this announcement are available at:",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=jEjMHLGoXs9pgkEL-DqaMbbZmg1CTjl1A9QQmvUwNZpHkiWss92In9UYJYhyxTVUYcZU6qnAksnXwbsYPWw9jJnqCyHZjnKAxNfRweToOyU=",
    "https://www.globenewswire.com/Tracker?data=plo0oyHC-_-VtO1kKMcpY9VpSi1_cUrCTQ-Lt80aUPhw2JqhNwWeFSJxyg5XZTQ_OsSYlP6xADGneJkyNcqpzUwh8M5JvJKDTdpLof1zpQ5GXNsjW5iI-dAe08msPTzN",
    "https://www.globenewswire.com/Tracker?data=jeoJBsznYTXMvNN5jXYzY52sh-1h_x0ZyCr0kWNOp8G2mUWzxmgBXt5EsspeyE8ZzGgHePvmhq71KtLfKb4eAqppBw1_E5EQQk_7qAjZiAXs1ADkggxWjlKro8Ljm2QUf3mO25vaI7eejkemTX1SEjmpz2HTxY-W4uIfzKt-aGFnCe_web26Ej8-_evMeJF1XhRkegCLhHFEWOIZGJjvrPytIU50L3rnLwrZhK04uwGjqDS57ioL07ePfZD71s-5uJLsijB4SCKvWus5jppWdw==",
    "https://www.globenewswire.com/Tracker?data=jeoJBsznYTXMvNN5jXYzY52sh-1h_x0ZyCr0kWNOp8G2mUWzxmgBXt5EsspeyE8ZQDj37w8rVkbQF5PfyQLtPEJrSpB3KXMKJpr_e3gsReEDwn8qzL3IqD-EhueYgoR9TgUxRFTpRSi_KqlR4ANgsXzOBSFG9Sxh_QmiyCSDY9JWjMqLOaqV9P9Ds8co1gPANZF777Fx8qoTI5Tk4no-dojNsJlTUwcKeRNr74B_FnXLfHsFu_3wFuaqLNft81vald1UgA91wSw7WnYoID9N-g==",
    "https://www.globenewswire.com/Tracker?data=jeoJBsznYTXMvNN5jXYzY52sh-1h_x0ZyCr0kWNOp8G2mUWzxmgBXt5EsspeyE8Z1nt-UWndnr09RSxZGqRxH4-L2jXZVe5U5dXv1Z8eD2FkjFzMut5rzfBTRJKoY2Sb-MqWyjy4bfNpBYiTCCbFBjt6IzyjYZXYpHM9XPaXH-qJArpaUTTtc0kG1BJY8yglFh9_3z0z_-n07EPXml-8G2TFpww_7vCFazUShN9l1PhTSx5OHmXDsfDEYzNeja9bHxy48JSzF8bX9lS-6fYOKQ==",
    "https://www.globenewswire.com/Tracker?data=jeoJBsznYTXMvNN5jXYzY52sh-1h_x0ZyCr0kWNOp8G2mUWzxmgBXt5EsspeyE8ZqXlR9h8hgFNKCSE1_5Q8xQ3sBvUrZ3KUWLCkC9bpaOoiOnv2ju7m2IK7uD4ZR3z8uvFQ0n3TZDzYX9aVZSzZ-QShP2COowpB4HqzvwSpY8YtkKnre-oShI0dzJpvlIQTzVQo3B9wnN4fxQ-pTZZV0cw9npiG582ZhdGewyq50iUFiH0wmDUOuX4IwbuuNnO1s8KTx-ikiGqkTFp85Qu9gA==",
    "https://www.globenewswire.com/Tracker?data=-KG7XS8kg-7wNhmrqxQKqvqKetWhWsL0JdA4XDGN3tr_QOSZpHkdM64HGxC0k4g1EwVFxb8yk2pSztyuwZQq23j_zMxjT37DeGhwIk9PI0m3RFzhre26m63_FlnuYQ_T"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "skarn mineralization",
      "weight": 0.078988604
    },
    {
      "name": "Magno Project",
      "weight": 0.06384732
    },
    {
      "name": "such information",
      "weight": 0.0635827
    },
    {
      "name": "scheelite mineralization",
      "weight": 0.06266962
    },
    {
      "name": "mineralized skarns",
      "weight": 0.060814165
    },
    {
      "name": "known mineralization",
      "weight": 0.059749678
    },
    {
      "name": "hydrothermal mineralization",
      "weight": 0.059331704
    },
    {
      "name": "Mineralization",
      "weight": 0.059168722
    },
    {
      "name": "mineralization",
      "weight": 0.059168722
    },
    {
      "name": "new information",
      "weight": 0.058510426
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.8603515625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.69775390625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.6640625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.484375
    }
  ],
  "sentiment": {
    "positive": 0.59311324,
    "negative": 0.024504628,
    "neutral": 0.38238215
  },
  "summary": "GoldHaven Resources has provided an Exploration Update on the Magno Project in Yukon, Canada. The project, which includes multiple styles of mineralization that appear to share common fluid pathways and heat sources, is being managed to map mineralized skarns with north–south parallel contacts and crosscutting northeast-trending structures. The company's fully funded 2025 exploration program is progressing through systematic sampling and detailed structural and mineralization mapping. Exploration has also revealed the presence of structurally controlled skarn and CRD-style mineralization within Magno Central, including unique hydrothermal mineralization in the Lower Cambrian Atan Group. Initial samples are being prepared for shipment to ALS Global.",
  "shortSummary": "GoldHaven Resources’s exploration program at the Magno Project in northern Canada has confirmed multiple distinct mineralization zones, with potential for larger and deeper targets underdeveloped.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ecf84ab825fe4c88ae88c4cf56911b39",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=plo0oyHC-_-VtO1kKMcpY9VpSi1_cUrCTQ-Lt80aUPhw2JqhNwWeFSJxyg5XZTQ_OsSYlP6xADGneJkyNcqpzUwh8M5JvJKDTdpLof1zpQ5GXNsjW5iI-dAe08msPTzN",
      "text": "GoldHaven Resources\nExploring Precious Metals and Critical Minerals in the Americas\nGoldHaven Resources is focused on exploring and developing large-scale deposits in Brazil and Canada. The company’s flagship mining projects include Copeçal, Magno and Three Guardsmen.\nPositioned in premier mining jurisdictions, GoldHaven targets substantial mineralization in gold, silver, copper, and other critical minerals.\nGoldHaven Resources is focused on exploring and developing large-scale deposits in Brazil and Canada. The company’s flagship mining projects include Copeçal, Magno and Three Guardsmen.\nPositioned in premier mining jurisdictions, GoldHaven targets substantial mineralization in gold, silver, copper, and other critical minerals.\nDiscover GoldHaven Resources\nGoldHaven Resources Corp. (CSE: GOH, OTCQB: GHVNF, FSE: 4QS) is a Canadian exploration Company focused on the acquisition and development of large-scale porphyry mineralization projects in Brazil and Canada, focusing on high-potential gold, copper and critical mineral targets.\nThe core project in Brazil, the Copeçal gold project, is in the Juruena Gold Province within Mato Grosso, Brazil.\nThe key projects in Canada include the Magno and Three Guardsmen properties, adjacent to the historic Cassiar mining district, in Cassiar BC.\nUnlocking Potential\nIn Brazil, Goldhaven benefits from having acquired the Copeçal gold project that was previously owned and operated by AngloGold Ashanti. The project is strategically situated within the Alta Floresta Gold Province, a historically productive region that has yielded substantial gold discoveries since the late 1970s. GoldHaven aims to unlock value for shareholders through modern exploration of high-potential copper, gold, and critical mineral targets in Northwestern British Columbia, home to some of the richest porphyry copper and gold deposits in the world.\nUnlocking Potential\nIn Brazil, Goldhaven benefits from having acquired the Copeçal gold project that was previously owned and operated by AngloGold Ashanti. The project is strategically situated within the Alta Floresta Gold Province, a historically productive region that has yielded substantial gold discoveries since the late 1970s. GoldHaven aims to unlock value for shareholders through modern exploration of high-potential copper, gold, and critical mineral targets in Northwestern British Columbia, home to some of the richest porphyry copper and gold deposits in the world.\nUnlocking Potential\nIn Brazil, Goldhaven benefits from having acquired the Copeçal gold project that was previously owned and operated by AngloGold Ashanti. The project is strategically situated within the Alta Floresta Gold Province, a historically productive region that has yielded substantial gold discoveries since the late 1970s. GoldHaven aims to unlock value for shareholders through modern exploration of high-potential copper, gold, and critical mineral targets in Northwestern British Columbia, home to some of the richest porphyry copper and gold deposits in the world.\nWhat We Do\nGoldHaven Resources is unlocking the future of mineral wealth in the Americas with six high-potential projects, three of which are a core focus for the company. These assets focus on the discovery of Gold, Copper, Silver, Tin, Zinc, Indium, Gallium and Germanium.\nWhat We Do\nGoldHaven Resources is unlocking the future of mineral wealth in the Americas with six high-potential projects, three of which are a core focus for the company. These assets focus on the discovery of Gold, Copper, Silver, Tin, Zinc, Indium, Gallium and Germanium.\nWhat We Do\nGoldHaven Resources is unlocking the future of mineral wealth in the Americas with six high-potential projects, three of which are a core focus for the company. These assets focus on the discovery of Gold, Copper, Silver, Tin, Zinc, Indium, Gallium and Germanium.\nOur Projects\nGoldHaven Resources is advancing exploration on three 100% owned projects: Copeçal Three Guardsman and Magno Projects.\nThe Copeçal project is located in the sought after Juruena Gold Province known for its gold discoveries since the 1980's. Magno and Three Guardsman properties are situated in the premier mineral districts of Northwestern British Columbia, home to some of the richest porphyry gold and copper deposits in the world.\nCopeçal Project | Brazil\nThe Copeçal Gold Project, located in the Juruena Gold Province of Mato Grosso, Brazil, is a 3,681-hectare exploration-stage property previously explored by AngloGold Ashanti. The project hosts significant gold-in-soil anomalies, structurally controlled mineralization, and favorable geology indicative of mesothermal gold systems. Supported by road-accessible infrastructure and extensive historical data, Copeçal offers high discovery potential with upcoming exploration focused on drilling and geophysical targeting to define gold-bearing structures across the property.\nMagno Project | BC, Canada\nThe Magno Project, located in northwestern British Columbia near the historic Cassiar townsite, is a high-potential gold-silver-lead-zinc and copper exploration project. Discovered in the early 1950s, the Magno deposit has undergone extensive exploration since the 1970s, including prospecting, geochemical surveys, ground geophysics, drilling, and underground development. Magno boasts historic high-grade production, robust CRD mineralization, porphyry potential, and strong infrastructure access. GoldHaven is now advancing the project aiming to unlock significant value from this underexplored but richly mineralized district.\nMagno Project | BC, Canada\nThe Magno Project, located in northwestern British Columbia near the historic Cassiar townsite, is a high-potential gold-silver-lead-zinc and copper exploration project. Discovered in the early 1950s, the Magno deposit has undergone extensive exploration since the 1970s, including prospecting, geochemical surveys, ground geophysics, drilling, and underground development. Magno boasts historic high-grade production, robust CRD mineralization, porphyry potential, and strong infrastructure access. GoldHaven is now advancing the project aiming to unlock significant value from this underexplored but richly mineralized district.\nMagno Project | BC, Canada\nThe Magno Project, located in northwestern British Columbia near the historic Cassiar townsite, is a high-potential gold-silver-lead-zinc and copper exploration project. Discovered in the early 1950s, the Magno deposit has undergone extensive exploration since the 1970s, including prospecting, geochemical surveys, ground geophysics, drilling, and underground development. Magno boasts historic high-grade production, robust CRD mineralization, porphyry potential, and strong infrastructure access. GoldHaven is now advancing the project aiming to unlock significant value from this underexplored but richly mineralized district.\nThree Guardsman Project | BC, Canada\nLocated in northwestern British Columbia near Haines Junction, the Three Guardsmen Project comprises 12 mineral tenures covering a highly prospective area for copper and gold-skarn mineralization. Historic exploration has identified the presence of copper, gold, molybdenum, silver, zinc, and magnetite across the property. With a favorable geological setting and multiple mineralized showings, Three Guardsmen presents a compelling opportunity for discovery in a well-endowed and underexplored district.\nThree Guardsman Project | BC, Canada\nLocated in northwestern British Columbia near Haines Junction, the Three Guardsmen Project comprises 12 mineral tenures covering a highly prospective area for copper and gold-skarn mineralization. Historic exploration has identified the presence of copper, gold, molybdenum, silver, zinc, and magnetite across the property. With a favorable geological setting and multiple mineralized showings, Three Guardsmen presents a compelling opportunity for discovery in a well-endowed and underexplored district.\nThree Guardsman Project | BC, Canada\nLocated in northwestern British Columbia near Haines Junction, the Three Guardsmen Project comprises 12 mineral tenures covering a highly prospective area for copper and gold-skarn mineralization. Historic exploration has identified the presence of copper, gold, molybdenum, silver, zinc, and magnetite across the property. With a favorable geological setting and multiple mineralized showings, Three Guardsmen presents a compelling opportunity for discovery in a well-endowed and underexplored district.\nSpotlight on Metals in Demand\nGold prices have surged to unprecedented levels, driven by Federal reserve policies and global market instability, while copper demand rises amid supply constraints and growing investment in clean energy and infrastructure worldwide.\nGold (Au)\nGold (Au)\nRecord-breaking Price Surge\nGold recently hit an all-time high of $2,790 per ounce, marking a year-over-year increase of over 38%\nRecord-breaking Price Surge\nGold recently hit an all-time high of $2,790 per ounce, marking a year-over-year increase of over 38%\nRecord-breaking Price Surge\nGold recently hit an all-time high of $2,790 per ounce, marking a year-over-year increase of over 38%\nFederal Reserve Policy Influence\nAnticipated Federal Reserve interest rate cuts have further bolstered gold prices amid broader market instability\nFederal Reserve Policy Influence\nAnticipated Federal Reserve interest rate cuts have further bolstered gold prices amid broader market instability\nFederal Reserve Policy Influence\nAnticipated Federal Reserve interest rate cuts have further bolstered gold prices amid broader market instability\nGlobal and Local Impacts\nThis surge in gold prices is evident worldwide, impacting both global and regional markets\nGlobal and Local Impacts\nThis surge in gold prices is evident worldwide, impacting both global and regional markets\nGlobal and Local Impacts\nThis surge in gold prices is evident worldwide, impacting both global and regional markets\nCopper (Cu)\nCopper (Cu)\nPrice Surge Due to Supply Constraints\nCopper prices are expected to reach record highs by the end of 2025, largely due to constrained supplies from major mines facing production issues.\nPrice Surge Due to Supply Constraints\nCopper prices are expected to reach record highs by the end of 2025, largely due to constrained supplies from major mines facing production issues.\nPrice Surge Due to Supply Constraints\nCopper prices are expected to reach record highs by the end of 2025, largely due to constrained supplies from major mines facing production issues.\nDemand Boost from Clean Energy & Infrastructure Investments\nThe global shift toward renewable energy and the electrification of infrastructure has driven copper demand, especially in applications like electric vehicles, wind turbines, and solar power.\nDemand Boost from Clean Energy & Infrastructure Investments\nThe global shift toward renewable energy and the electrification of infrastructure has driven copper demand, especially in applications like electric vehicles, wind turbines, and solar power.\nDemand Boost from Clean Energy & Infrastructure Investments\nThe global shift toward renewable energy and the electrification of infrastructure has driven copper demand, especially in applications like electric vehicles, wind turbines, and solar power.\nLatest News\nLatest News\nGoldHaven Resources Corp. is a Canadian junior metals exploration company focused on identifying and developing high-potential mineral assets across North and South America.\nReach Us\nCopyright © 2024 Goldhaven\nDesigned and Powered by Fairfax Partners Inc.\nGoldHaven Resources Corp. is a Canadian junior metals exploration company focused on identifying and developing high-potential mineral assets across North and South America.\nReach Us\nCopyright © 2024 Goldhaven\nDesigned and Powered by Fairfax Partners Inc.\nGoldHaven Resources Corp. is a Canadian junior metals exploration company focused on identifying and developing high-potential mineral assets across North and South America.\nReach Us\nCopyright © 2024 Goldhaven\nDesigned and Powered by Fairfax Partners Inc."
    }
  ],
  "argos_summary": "GoldHaven Resources reports progress on its Magno Project in British Columbia, highlighting systematic sampling and detailed mapping that confirm structurally controlled skarn and CRD-style mineralization, including high-grade silver and potential indium and gallium. The 2025 exploration program is halfway complete, with new extensions to historic samples and evidence of extensive skarn horizons up to 2 km long. The company anticipates that upcoming laboratory results will guide deeper target definition and unlock the property’s polymetallic potential.",
  "argos_id": "RJLD2PCQR"
}