{
  "url": "https://www.express.co.uk/sport/tennis/2104457/camila-giorgi-model-italy-tax",
  "authorsByline": "Maria Ortega, Patrick Austen-Hardy",
  "articleId": "c2ecc4f6740642fc9c0f5908a6337f6c",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/72/1200x630/6405948.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-09-04T15:40:00+01:00",
  "addDate": "2025-09-04T14:49:41.611654+00:00",
  "refreshDate": "2025-09-04T14:49:41.611655+00:00",
  "score": 1.0,
  "title": "Camila Giorgi re-emerges in Italy after 'fleeing over alleged tax evasion'",
  "description": "Following her mysterious retirement from tennis and exit from Italy, former Olympic Games quarter-finalist Camila Giorgi has now re-emerged in her home country.",
  "content": "She was there for the premiere of 'The Smashing Machine', a film featuring Dwayne 'The Rock' Johnson which chronicles the life of former MMA fighter Mark Kerr. Her appearance back in her home country came as a surprise to many fans who are aware of the accusations against her, despite her lawyers Federico Marini and Cristian Carmelo Nicotra previously insisting she would be returning. In an interview with Italian chat show Verissimo, Giorgi laughed at suggesions she owed up to six months worth of rent for a villa she lived in. When asked if she left Italy and moved to the USA to escape these accusations, she said: \"It was not an escape. I moved to America permanently with my parents.\" Addressing her retirement, she also said it was coincidental her decision to walk away from tennis was made just as an investigation into her finances by the Guardia di Finanza, an Italian law enforcement agency which deals with financial crime, was concluded. She insists the tax evasion allegations were down to a lawyer who had worked with her before. Giorgi said: “The problems with the tax authorities? My family did not know about them. They were created by outside people who managed me and did this as a job. We did not flee for tax reasons. I never fled, I never spoke.\"\n\nWhen pushed on the insinuation she had either refused to pay rent or witheld payments, she sarcastically replied: \"We did not pay the rent and we took the furniture? The house had no furniture, we bought it ourselves.” To be the first to receive the latest tennis news, join our WhatsApp community or tennis newsletter At the start of the year, Giorgi found work in tennis media, carrying out interviews with players while at the ATP 250 event in Buenos Aires, Argentina, in February. In November of last year, she also said she had been living in South American and was in a relationship with Argentine politician Ramiro Marra, saying it was \"love at first sight\" on her social media page. As a player, her most memorable displays in Grand Slams were her runs to the last 16 of the 2013 US Open as well as her journey to the quarter-finals of Wimbledon in 2018. She was also one round away from competing for a medal at the Tokyo 2020 Olympics when she got all the way to the quarters while representing Italy.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/sport/tennis/1898088/Camila-Giorgi-feels-to-USA-tennis-star",
    "https://www.express.co.uk/sport/tennis/1898933/Camila-Giorgi-lawyer-statement-tax-retirement",
    "https://chat.whatsapp.com/LXhZ3nwDOA770jUOWfNb6m",
    "https://www.express.co.uk/sport/tennis/2012853/Camila-Giorgi-returns-work-overseas-fleeing-Italy-alleged-tax-evasion",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/sport/tennis/1958274/Camila-Giorgi-Italy-tax-theft-retirement",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/sport/tennis",
    "https://www.express.co.uk/sport/tennis/1896924/Camila-Giorgi-retire-statement-Instagram-tennis",
    "https://www.express.co.uk/whatsapp-group-web/4?utm_source=article_widget&utm_medium=referral&utm_campaign=article_widget&utm_content=whatsapp-group-signup-in-article",
    "https://www.express.co.uk/newsletter-preference-centre/?mailingListId=5c406a57-84cd-456c-93d3-36201de20d6d&view=Solus&utm_source=article_link=",
    "https://www.express.co.uk/sport/tennis/1898116/Camila-Giorgi-statement-flee-Italy-missing-retire",
    "https://www.express.co.uk/latest/wimbledon",
    "https://www.express.co.uk/sport/tennis/1897323/Camila-Giorgi-WTA-Tour-ITIA-retirement"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tennis media",
      "weight": 0.072818235
    },
    {
      "name": "alleged tax evasion",
      "weight": 0.071304835
    },
    {
      "name": "tennis newsletter",
      "weight": 0.06925835
    },
    {
      "name": "tennis",
      "weight": 0.06719291
    },
    {
      "name": "Camila Giorgi",
      "weight": 0.066657595
    },
    {
      "name": "former MMA fighter Mark Kerr",
      "weight": 0.063826986
    },
    {
      "name": "Giorgi",
      "weight": 0.06326719
    },
    {
      "name": "last year",
      "weight": 0.06306836
    },
    {
      "name": "Italian chat show",
      "weight": 0.0616985
    },
    {
      "name": "Argentine politician Ramiro Marra",
      "weight": 0.061168067
    }
  ],
  "topics": [
    {
      "name": "Tax Fraud"
    },
    {
      "name": "Tennis"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Sports News",
      "score": 0.93505859375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.8759765625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.31396484375
    }
  ],
  "sentiment": {
    "positive": 0.06288167,
    "negative": 0.6584494,
    "neutral": 0.2786689
  },
  "summary": "Tennis player Camila Giorgi has returned to Italy for the premiere of 'The Smashing Machine', a film featuring Dwayne 'The Rock' Johnson, despite accusations of tax evasion. Despite her retirement from the sport following an investigation into her finances by the Guardia di Finanza, an Italian law enforcement agency dealing with financial crime, she insists the tax evasion allegations were down to a lawyer who had worked with her before. She also dismissed suggestions that she owed up to six months worth of rent for a villa she lived in and dismissed any suggestion that she had evaded tax. Giorgian's return to Italy was a surprise, despite her lawyers Federico Marini and Cristian Carmelo Nicotra previously stating she would return.",
  "shortSummary": "Camila Giorgi, after fleeing Italy to escape tax evasion allegations, appeared back in Italy, where she worked in tennis media and discussed her retirement from competitive tennis.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6128f3e8dcf44d18874eab110779e90b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/sport/tennis",
      "text": "Following her mysterious retirement from tennis and exit from Italy, former Olympic Games...\nDan Evans has been in action at the Shanghai Challenger.\nAmanda Anisimova was left in tears after her 6-0, 6-0 defeat to Iga Swiatek in the Wimbledon...\nThe US Open broadcaster and his colleagues were left in tears following an emotional tribute to...\nWe use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. Read our Privacy Policy\nDaniil Medvedev and Gilles Cervara ended their long-term partnership after his US Open exit.\nCoco Gauff suffered a straight-sets defeat to Naomi Osaka in the third round of the US Open\nOne of the US Open's biggest stars gave up her American citizenship in 2019.\nNaomi Osaka did something unusual during a press conference at the US Open.\nNovak Djokovic has reached the US Open semi-finals after defeating Taylor Fritz, and former...\nThe US Open star was unable to continue at the tournament and had to pull out.\nAryna Sabalenka was due to take on Marketa Vondrousova in the US Open quarter-finals, but the...\nExpress Sport brings you the latest news from the US Open.\nTaylor Fritz was spotted wearing his Hugo Boss headband upside down for his US Open quarterfinal...\nChris Evert was honoured with a touching tribute from ESPN during the US Open.\nJannik Sinner and Carlos Alcaraz have set themselves apart from the rest of the field.\nAmanda Anisimova will take on Iga Swiatek in the quarter-finals of the US Open, seven-and-a-half...\nAryna Sabalenka's boyfriend, Georgios Frangulis, is often seen cheering her on in the stands.\nCarlos Alcaraz has enjoyed a budding career to date with a quintet of Grand Slams to his name,...\nVenus Williams and Leylah Fernandez are through to the women's doubles quarter-finals at the US...\nCarlos Alcaraz showed the sort of style and grace he typically displays in matches during his...\nFans at the US Open are vying to get a memento from their favourite players.\nNovak Djokovic is looking forward to catching up with his two biggest rivals.\nPiotr Szczerek has issued an apology after snatching a cap from a young tennis fan.\nMarcus Willis will forever be remembered for Wimbledon 2016 but he's now enjoying himself in the...\nNovak Djokovic defeated Jan-Lennard Struff in the US Open fourth round.\nMadison Keys had a difficult experience at the US Open.\nDaniil Medvedev was fined almost £32k after going out in the first round of the US Open.\nAndrey Rublev landed himself in hot water during one of his matches at the US Open.\nDaniil Medvedev has made a big change after crashing out of the US Open.\nA young boy was left heartbroken after having a cap snatched from him by a man after Kamil...\nNaomi Osaka is through to the last 16 of the US Open.\nThe American marched on to the round of 16 in the States.\nFlavio Cobolli became the latest player to retire from the US Open.\nJohn McEnroe gave a frank assessment of a shocking incident at the US Open.\nMultiple-time US Open doubles champ Pam Shriver called for a change to the length of men's Grand...\nNovak Djokovic spent some time with American actor Ben Stiller following his third-round win...\nAryna Sabalenka was upstaged by a happy couple at the US Open.\nAdrian Mannarino reached the second week of the US Open when No. 6 seed Ben Shelton was forced...\nBen Shelton grabbed his shoulder in main mid-game and called the physio.\nAndy Murray still has a few special fans on the tennis tour.\nCarlos Alcaraz sparked fears when he received a medical timeout at the US Open.\nStefanos Tsitsipas called out his opponent at the US Open.\nJohn McEnroe gave his verdict on one of the US Open favourites.\nEmma Raducanu holds a close relationship with fellow tennis star Carlos Alcaraz, but her love of...\nExpress Sport keeps you up to date with all of the latest US Open news and updates.\nEmma Raducanu is learning some interesting things from her new coach Francis Roig while out at...\nNovak Djokovic has made an unusual complaint about the US Open.\nCameron Norrie takes on Novak Djokovic in the third round of the US Open and the Brit says he's...\nBen Shelton was left surprised during his US Open press conference.\nDaniil Medvedev's extraordinary outburst dominated headlines over the first few days of the US Open.\nEmma Raducanu shared her post-match plans after reaching the third round of the US Open.\nEmma Raducanu stormed to victory over Janice Tjen at the US Open.\nCarlos Alcaraz's haircut has drawn a mixed reaction at the US Open.\nCoco Gauff enjoyed a winning return to the US Open, but she has also been succeeding away from...\nThe Brit was in US Open action overnight.\nNaomi Osaka announced her split from rapper Cordae in January after five years together, while...\nVenus Williams' US Open campaign is not over yet\nA US Open star joked about a ‘trophy' after winning her first round match in New York.\nIga Swiatek had an enjoyable Tuesday at the US Open after winning and receiving some happy news...\nKatie Boulter went out in the first round of the US Open.\nBeatriz Haddad Maia outlasted Sonay Kartal in a gruelling match.\nA burgler who targeted some of Britain's wealthiest residents has been released from prison.\nCarlos Alcaraz has responded to Frances Tiafoe's comments on Monday.\nKarolina Muchova overcame Venus Williams in three sets in the first round of the US Open.\nJack Draper is through to the US Open second round\nThe photographer at the centre of Daniil Medvedev's furious meltdown at the US Open has broken...\nJoao Fonseca rushed to the side of the court to be sick during his first-round match in New York.\nTributes have been paid to Angela Mortimer-Barrett\nPetra Kvitova officially retired at the US Open.\nKatie Boulter has endured a tough time of late.\nTennis icon John McEnroe issued a warning to Coco Gauff following her error-strewn defeat at the...\nDaniil Medvedev totally lost his cool during his defeat to Benjamin Bonzi.\nExpress Sport provides all the latest US Open updates, including reaction from Novak Djokovic...\nEmma Raducanu recently hired one of Rafael Nadal's old coaches.\nEmma Raducanu got straight back on court after reaching the second round of the US Open.\nEmma Raducanu galloped into the second round of the US Open\nNovak Djokovic faces rising teenage star Learner Tien at the US Open.\nDaily Express uses notifications to keep you updated"
    },
    {
      "url": "https://www.express.co.uk/",
      "text": "Deputy Prime Minister Angela Rayner has admitted under-paying stamp duty by £40,000\nAsylum seeker Hadush Gerberslasie Kebatu, 38, has been found guilty at Chelmsford...\nA motoring expert has called for a radical change forcing people to relinquish their...\nEXCLUSIVE: A Labour Council leader referred to the victims of sexual exploitation...\nBBC Radio star Lee Harris didn't hold back as he laid into a sobbing Angela Rayner...\nDarts hero Jamie Harvey, who played a key role in the launch of what is now the PDC,...\nThe Deputy Prime Minister is under increasing pressure over her tax affairs. Should...\nAs long as our hapless Chancellor has faith in our hapless deputy Prime Minister,...\nThe former Labour leader, who was close allies with Ms Rayner before he left the party, has condemned her tax error.\nThe television personality has issued a blistering six-word swipe at Angela Rayner...\nA royal insider said it could be 'make or break' for the feuding Prince Harry and King...\nAccording to sources in France, fashion billionaire Giorgio Armani has died at the age...\nDaily Express\nLabour Council Leader who called rape victims 'white trash' is suspended by party...\nOther banks and building societies may follow suit, experts warn.\nHarrowing details of testimonies are impossible to forget - but first we must make the...\nCouncillors and residents remain conflicted about hanging St George's flags on the...\nThe presenter returned to the ITV studios on the first day after her summer break and fans were soon swooning over her ensemble.\nA pillow that's more than just a place to rest your head? Discover why one affordable...\nA man claims to have rejected a ten-year agreement with the Home Office to house...\nThe Deputy Prime Minister has expressed her \"regret\" over the scandal.\nPeople have just days left before the offer ends on Monday, September 8.\nThis picturesque village is 'like stepping into another era' due to its historic feel,...\nMillions are poised to miss out on the full triple lock increase this April, but do...\nQueen guitarist Brian May had the full support of his fans as he posted an emotional...\nA former Strictly Come Dancing contestant has opened up about what she disliked about the BBC show\nThe ITV star said that Ms Rayner just 'made a mistake' as fans raged over her comments\nThe Prime Minister has promised other senior Cabinet Ministers will keep their jobs...\nSeveral people have been taken to hospital after the incident in central London.\nThe unsavoury and unsanitary behaviour has left locals furious.\nWXCharts has forecast the storm will hit the UK at the end of next week, September 13.\nUK businesses are slashing jobs at the fastest rate since 2021\nTens of thousands of people are set to receive support.\nEXCLUSIVE: Experts have warned that Britons should be careful about taking a shower during thunderstorms because of the risk of being struck by lightning\nDespite Rayner's that \"everything was done proper\", more clarity is needed from the...\nThe youngest victim was aged just four.\nMotorists across the UK could be hit with hefty repair bills and damaged vehicles due...\nEXCLUSIVE - The Deputy Prime Minister has reignited last year's freebiegate...\nOne defiant local says, 'They can't stop us from flying our flag'.\nThe top Tory, igniting an arms race with Nigel Farage on immigration, branded Boris...\nThose who have booked a holiday at Centre Parcs will need to be aware of a sweeping...\nEXCLUSIVE: This isn't just a \"minor slip-up\" from Angela Rayner, experts have said.\nLavender is a popular plant that thrives in sunny, well-drained locations and produces...\nThis month, Netflix UK says goodbye to a collection of iconic titles. Explore the...\nIf you're looking for the perfect breed to bring into your family, there's one that...\nRegatta's Hurden padded jacket is the perfect layer for autumn and winter adventures...\nThe budget airline has confirmed that it has completed the rollout of this new rule,...\nThe couple died on July 30 after falling from the cliffs near Whitby Abbey in North...\nThe monarch has spoken out about some of the challenges that come with getting older.\nIf PM Keir Starmer won't axe his hapless chancellor, there's another option.\nThe destination also has lots of bars and clubs to choose from, making it the perfect...\nFownes Hotel in Worcester has been the centre of protests this summer after locals...\nFootage captured it listing to one side and gradually disappearing beneath the surface.\nA father, who lost his wife and three children in the blaze, fell unconscious while...\nA Cabinet Minister has declined to say whether Angela Rayner would still be Deputy...\nSir Keir Starmer is running out of answers to those who say a free speech crisis is...\nThe Trades Union Congress calls on the Chancellor to consider wealth taxes in the...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Former tennis player Camila Giorgi returned to Italy for a film premiere after previously fleeing the country amid alleged tax‑evasion accusations. She denied the claims, attributing the issues to a former lawyer and stating she had not fled for tax reasons. Giorgi also discussed her retirement, noting it coincided with the conclusion of a Guardia di Finanza investigation. The Italian chat show interview highlighted her move to the U.S. with her parents and her ongoing media work. Overall, the story centers on Giorgi’s public comeback and her rebuttal of the tax‑evasion allegations.",
  "argos_id": "TKMDAEBEV"
}