{
  "url": "https://finance.yahoo.com/news/billionaire-stanley-druckenmiller-sold-entire-070600962.html",
  "authorsByline": "Sean Williams, The Motley Fool",
  "articleId": "f5f68178f50e450da40b7d6d42940c47",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/AR2TECNmkXhQ8xJVVAbBYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/3cb1eb8e8c0fb1b47ad6d8ac16cb660a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T07:06:00+00:00",
  "addDate": "2025-09-04T07:35:24.115095+00:00",
  "refreshDate": "2025-09-04T07:35:24.115098+00:00",
  "score": 1.0,
  "title": "Billionaire Stanley Druckenmiller Sold His Entire Stake in Palantir and Has, Once Again, Started Loading Up on This Trillion-Dollar Artificial Intelligence (AI) Stock",
  "description": "Duquesne Family Office's billionaire investor dumped one of the hottest AI stocks on the planet in favor of another critical company in the AI arena.",
  "content": "• Form 13F filings offer investors a way to track which stocks Wall Street's savviest money managers are buying and selling.\n• Billionaire Stanley Druckenmiller exited his fund's entire stake in Palantir over a nine-month stretch -- and profit-taking might explain only part of the story.\n• Meanwhile, Druckenmiller welcomed a familiar face, which is an undisputed leader in the artificial intelligence (AI)-data center space, with open arms.\n• 10 stocks we like better than Broadcom › For many investors, earnings season is the highlight of each quarter. This is the six-week period where the lion's share of S&P 500 companies reports their operating results from the previous three-month period. However, a strong argument can be made that Form 13F filings can be just as informative. A 13F is a required filing by institutional investors with at least $100 million in assets under management no later than 45 calendar days following the end to a quarter. It provides a concise rundown of which stocks Wall Street's savviest investors were buying and selling in the latest quarter. Although Warren Buffett is traditionally the most followed of all asset managers, he's not the only billionaire investor with a penchant for outsized returns. Duquesne Family Office's billionaire boss Stanley Druckenmiller is another fund manager with a knack for spotting good deals. Over the trailing year (ended June 30, 2025), Duquesne's 13Fs show Druckenmiller completely exited his fund's stake in one of the hottest and highest-flying artificial intelligence (AI) stocks, Palantir Technologies (NASDAQ: PLTR), and looks to be, once again, building a position in a critical trillion-dollar AI stock. Palantir's heave-ho may have to do with more than just profit-taking When the midpoint of 2024 came to a close, Duquesne Family Office was holding nearly 770,000 shares of AI-data mining specialist Palantir. It's been a popular stock to own thanks to the irreplaceability of its AI- and machine learning-propelled Gotham and Foundry platforms. Gotham tends to land multiyear contracts with the U.S. and other federal governments to help with military mission planning and data collection. As for Foundry, it's used by businesses to make sense of their data and improve their operating efficiency. With no clear-cut replacement for the software-as-a-service solutions Palantir provides, it's earned quite the premium from investors. But between June 30, 2024, and March 31, 2025, Druckenmiller jettisoned his fund's entire stake.\n\nProfit-taking is the most logical of all explanations as to why Palantir stock was given the heave-ho. The 69 securities in Duquesne Family Office's investment portfolio, as of June 30, 2025, have been held for an average of less than seven months. In other words, its billionaire boss isn't shy about cashing in his chips following a sizable gain, as was the case with Palantir Technologies. The worry is that profit-taking might not be the only reason Stanley Druckenmiller showed shares of Palantir to the door. The most glaring potential problem with Palantir stock is its valuation. Although \"value\" is subjective, and Palantir is deserving of some level of premium because of its irreplaceability, the company's price-to-sales (P/S) ratio is so far above historical norms that it's left the chat. Over multiple decades, companies on the leading edge of a next-big-thing investment trend have seen their shares peak at roughly 30 to 40 times sales. Palantir entered this week with a P/S ratio of 115. Even with the company consistently surpassing Wall Street's sales and profit projections, there's nothing it can report from an operating standpoint that justifies a triple-digit P/S ratio, let alone a P/S ratio of 30 to 40, which is a level no other megacap company has been able to sustain. Additionally, insiders can't seem to get rid of their shares fast enough. Since becoming a publicly traded company in late September 2020, only one insider purchase has been made by a current/former executive or director, compared to more than $7.6 billion in net stock sold. If insiders won't purchase Palantir stock, why should billionaires or everyday investors? This trillion-dollar AI networking stock was back on Druckenmiller's menu At the other end of the spectrum, Duquesne's billionaire chief oversaw quite a bit of buying. While most of this buying activity had nothing to do with AI stocks, one pivotal, trillion-dollar company within the AI space does stand out: Broadcom (NASDAQ: AVGO). Broadcom isn't a stranger to Stanley Druckenmiller's fund. During the third quarter of 2024, he oversaw the purchase of almost 240,000 shares of this AI networking giant. But in the subsequent quarter, this position was completely exited. Based on Duquesne's second-quarter 13F, Broadcom is back. During the June-ended quarter, Druckenmiller purchased a little over 86,000 shares, worth close to $24 million, as of the midpoint of 2025. Wall Street's mini-crash in early April is probably one of the reasons Druckenmiller loaded up on shares of Broadcom, once again. Following President Donald Trump's unveiling of its tariff and trade policy on April 2, the benchmark S&P 500 endured its fifth-largest two-day percentage decline in 75 years. A nearly one-week period of fear and pessimism created a unique opportunity for investors like Druckenmiller to snag amazing businesses at a discount. Although we don't know if this is when Duquesne added to Broadcom, the early portion of April would make sense. Broadcom's hardware is integral to the success of the AI revolution. Its solutions are connecting tens of thousands of graphics processing units in enterprise data centers to maximize their compute capacity, as well as reduce tail latency. The latter is particularly important, as minimizing lag is a necessity for AI-empowered software and systems making split-second decisions. Broadcom's custom AI application-specific integrated circuits (ASICs) are also a massive opportunity. CEO Hock Tan believes custom ASICs could help drive $60 billion to $90 billion in revenue to Broadcom from three of its largest hyperscaler customers by 2027. Another key aspect to Broadcom's success is its growth potential outside of artificial intelligence. While there's no denying that AI networking solutions account for the bulk of its growth at the moment, Broadcom generates quite a bit of sales from wireless chips and solutions for smartphones, enterprise cybersecurity, and various solutions used in industrial robotics and automobiles. If an AI bubble were to form and burst, Broadcom would have other operating segments to fall back on. The final catalyst for billionaire Stanley Druckenmiller might be Broadcom's valuation. If Duquesne's boss lapped up shares in early April, he'd have nabbed Broadcom at a forward price-to-earnings ratio of less than 20, which is a solid value for a company slated to grow its sales by more than 20% annually. Should you invest $1,000 in Broadcom right now? Before you buy stock in Broadcom, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Broadcom wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $654,759!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,046,799!* Now, it’s worth noting Stock Advisor’s total average return is 1,042% — a market-crushing outperformance compared to 183% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor. Sean Williams has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Palantir Technologies. The Motley Fool recommends Broadcom. The Motley Fool has a disclosure policy. Billionaire Stanley Druckenmiller Sold His Entire Stake in Palantir and Has, Once Again, Started Loading Up on This Trillion-Dollar Artificial Intelligence (AI) Stock was originally published by The Motley Fool",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d1534525-9505-46a6-b498-56f23bf5cd39&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001088%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17500%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DBroadcom&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d1534525-9505-46a6-b498-56f23bf5cd39&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001088%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D17500&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
    "https://www.fool.com/investing/2025/08/26/billionaire-stanley-druckenmiller-sold-nvidia-pltr/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
    "https://www.fool.com/terms/f/form-13f/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
    "https://www.fool.com/investing/2025/09/04/billionaire-stanley-druckenmiller-sold-palantir/",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=8ca45f59-495d-43b2-8917-227f080ca6f5&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
    "https://www.fool.com/author/1813/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Palantir stock",
      "weight": 0.0870252
    },
    {
      "name": "AI stocks",
      "weight": 0.07980264
    },
    {
      "name": "Billionaire Stanley Druckenmiller",
      "weight": 0.07563492
    },
    {
      "name": "billionaire Stanley Druckenmiller",
      "weight": 0.07563492
    },
    {
      "name": "Stanley Druckenmiller",
      "weight": 0.07023957
    },
    {
      "name": "stock",
      "weight": 0.06696329
    },
    {
      "name": "net stock",
      "weight": 0.06571974
    },
    {
      "name": "Palantir Technologies",
      "weight": 0.065352865
    },
    {
      "name": "AI networking solutions",
      "weight": 0.06398215
    },
    {
      "name": "Broadcom",
      "weight": 0.06361898
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98095703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.98095703125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.744140625
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.353515625
    }
  ],
  "sentiment": {
    "positive": 0.30750188,
    "negative": 0.1845841,
    "neutral": 0.50791407
  },
  "summary": "Billionaire Stanley Druckenmiller has sold his entire stake in Palantir Technologies (NASDAQ: PLTR), a trillion-dollar Artificial Intelligence (AI) stock, over a nine-month period. The move may not only explain profit-taking, but also a potential issue with Palantar's valuation. The company's price-to-sales (P/S) ratio is so far above historical norms that it could not sustain a triple-digit P/S ratio. Since becoming a publicly traded company in September 2020, only one insider purchase has been made by current/former director, compared to $7.6 billion in net stock sold.",
  "shortSummary": "Billionaire Stanley Druckenmiller sold his entire Palantir stake, rejoining the company as a significant investor, raising concerns about its valuation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "215d68a2be9d446ba741cfbeeab41318",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/terms/f/form-13f/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
      "text": "The Securities and Exchange Commission (SEC) is a federal regulatory agency that enforces financial laws and aims to prevent stock market manipulation and other illegal activity. SEC filings are available to the public and provide a level of transparency that helps prevent financial abuse and allows investors to stay informed.\nIn particular, the SEC Form 13F provides valuable insights into the stocks and other equities and financial instruments owned and managed by companies and individuals.\nWhat is it?\nUnderstanding the SEC Form 13F\nInstitutional investment managers are required to submit a 13F form to the SEC if they hold or manage more than $100 million in securities that fall under the agency's 13F category. These securities include shares of stocks that trade on the Nasdaq Stock Exchange and the New York Stock Exchange (NYSE).\nThe category also includes shares of exchange-traded funds (ETFs) and closed-end investment companies. Convertible debt securities, equity options, and warrants are also reported in some cases.\nWho must use it?\nWho has to submit 13F forms?\nInvestment conglomerates, banks, insurance companies, pension funds, and individual investment advisors are all subject to 13F filing requirements if they hold more than $100 million in relevant securities. Businesses holding large investment portfolios are also considered institutional investment managers. Even companies operating outside the financial services space must submit quarterly 13F filings.\nFor example, Nvidia (NVDA -0.24%) began submitting publicly available 13F forms to the SEC in 2024. Interest in artificial intelligence (AI) helped push the value of the company's stock portfolio above $100 million, so the semiconductor specialist had to submit the disclosure filing to the agency. Because of Nvidia's highly influential position in the AI revolution, the disclosure of its investments helped create additional bullish momentum for some stocks it owned.\nInstitutional Investor\nImportance\nWhy are 13F forms important for investors?\nRetail investors can use 13F filings to track Wall Street's biggest players. Due to their size and resources, institutional investors enjoy significant advantages in the stock market. While 13F forms are submitted to the SEC only on a quarterly basis, these filings offer the average investor a window into the strategies of the world's most successful investment companies and individual asset managers.\nThe 13F disclosures can also substantially impact the valuation of individual stocks and the market at large. These filings show the stocks that Wall Street's most high-profile investment managers are buying and selling, and this information can help shape market sentiment.\nAn example\nAn example of the 13F form in action\nBerkshire Hathaway (BRK.A 0.21%)(BRK.B -0.01%) is one of the world's largest and most successful companies. Led by CEO Warren Buffett, the company owns a stock portfolio worth hundreds of billions of dollars and a long list of fully and partially owned subsidiary businesses. Buffett's investment conglomerate submits a publicly available 13F form to the SEC after each quarter, and its holdings disclosures are watched closely in the financial world.\nRelated investing topics\nMany investors pay close attention to Berkshire Hathaway's quarterly 13F filings because they reveal which stocks the investment company bought and sold in the previous quarter and how much cash and fixed income investments it owned. By tracking which stocks Buffett's company owns, investors can observe and replicate the strategies of one of the world's most successful financial conglomerates.\nMonitoring Berkshire's cash pile and whether the company has been a net buyer or seller of stocks can also provide insight into how Buffett and his team of analysts feel about the health of the overall stock market."
    },
    {
      "url": "https://www.fool.com/author/1813/",
      "text": "Sean Williams\nSean Williams is a data-driven Motley Fool contributing analyst who's been investing for 26 years and has penned north of 15,000 articles. You'll find him at the intersection of politics and investing tackling macroeconomic topics of interest (Social Security and Donald Trump's economic/tax policies), analyzing which stocks billionaire investors (e.g., Warren Buffett) are buying and selling, and digging into how the world's most-influential businesses and trends -- everything from the evolution of artificial intelligence (AI) to the next stock split -- are changing Wall Street. He holds a B.A. in Economics from the University of California, San Diego.\nRecent Articles by Sean Williams\nWall Street's Greatest Dividend Stock Makes for a Screaming Buy in September -- and It's a Company 99% of Investors Have Likely Never Heard of Before\nBillionaire Stanley Druckenmiller Sold His Entire Stake in Palantir and Has, Once Again, Started Loading Up on This Trillion-Dollar Artificial Intelligence (AI) Stock\n1 Magnificent Stock-Split Stock Up 157,000% Since Its IPO to Buy in September, and 1 to Absolutely Avoid\nA Social Security Garnishment of Up to 50% Is Affecting More Than 1,000,000 Beneficiaries -- Here's How You Can Legally Avoid It\nStatistically, President Donald Trump's \"Big, Beautiful Bill\" Makes Social Security Worse\nBillionaire Stanley Druckenmiller Sold His Fund's Stakes in Nvidia and Palantir, and Has Piled Into This Essential Artificial Intelligence (AI) Stock Instead\nBillionaire Philippe Laffont Sold 53% of Coatue's AMD Stake in Favor of an ETF Whose Underlying Asset Has Gained Nearly 165,000,000% in 15 Years\nPremium Investing Services\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    },
    {
      "url": "https://www.fool.com/investing/2025/09/04/billionaire-stanley-druckenmiller-sold-palantir/",
      "text": "For many investors, earnings season is the highlight of each quarter. This is the six-week period where the lion's share of S&P 500 companies reports their operating results from the previous three-month period.\nHowever, a strong argument can be made that Form 13F filings can be just as informative. A 13F is a required filing by institutional investors with at least $100 million in assets under management no later than 45 calendar days following the end to a quarter. It provides a concise rundown of which stocks Wall Street's savviest investors were buying and selling in the latest quarter.\nAlthough Warren Buffett is traditionally the most followed of all asset managers, he's not the only billionaire investor with a penchant for outsized returns. Duquesne Family Office's billionaire boss Stanley Druckenmiller is another fund manager with a knack for spotting good deals.\nOver the trailing year (ended June 30, 2025), Duquesne's 13Fs show Druckenmiller completely exited his fund's stake in one of the hottest and highest-flying artificial intelligence (AI) stocks, Palantir Technologies (PLTR -1.42%), and looks to be, once again, building a position in a critical trillion-dollar AI stock.\nPalantir's heave-ho may have to do with more than just profit-taking\nWhen the midpoint of 2024 came to a close, Duquesne Family Office was holding nearly 770,000 shares of AI-data mining specialist Palantir.\nIt's been a popular stock to own thanks to the irreplaceability of its AI- and machine learning-propelled Gotham and Foundry platforms. Gotham tends to land multiyear contracts with the U.S. and other federal governments to help with military mission planning and data collection. As for Foundry, it's used by businesses to make sense of their data and improve their operating efficiency. With no clear-cut replacement for the software-as-a-service solutions Palantir provides, it's earned quite the premium from investors.\nBut between June 30, 2024, and March 31, 2025, Druckenmiller jettisoned his fund's entire stake.\nProfit-taking is the most logical of all explanations as to why Palantir stock was given the heave-ho. The 69 securities in Duquesne Family Office's investment portfolio, as of June 30, 2025, have been held for an average of less than seven months. In other words, its billionaire boss isn't shy about cashing in his chips following a sizable gain, as was the case with Palantir Technologies.\nThe worry is that profit-taking might not be the only reason Stanley Druckenmiller showed shares of Palantir to the door.\nThe most glaring potential problem with Palantir stock is its valuation. Although \"value\" is subjective, and Palantir is deserving of some level of premium because of its irreplaceability, the company's price-to-sales (P/S) ratio is so far above historical norms that it's left the chat.\nOver multiple decades, companies on the leading edge of a next-big-thing investment trend have seen their shares peak at roughly 30 to 40 times sales. Palantir entered this week with a P/S ratio of 115. Even with the company consistently surpassing Wall Street's sales and profit projections, there's nothing it can report from an operating standpoint that justifies a triple-digit P/S ratio, let alone a P/S ratio of 30 to 40, which is a level no other megacap company has been able to sustain.\nAdditionally, insiders can't seem to get rid of their shares fast enough. Since becoming a publicly traded company in late September 2020, only one insider purchase has been made by a current/former executive or director, compared to more than $7.6 billion in net stock sold. If insiders won't purchase Palantir stock, why should billionaires or everyday investors?\nThis trillion-dollar AI networking stock was back on Druckenmiller's menu\nAt the other end of the spectrum, Duquesne's billionaire chief oversaw quite a bit of buying. While most of this buying activity had nothing to do with AI stocks, one pivotal, trillion-dollar company within the AI space does stand out: Broadcom (AVGO 1.30%).\nBroadcom isn't a stranger to Stanley Druckenmiller's fund. During the third quarter of 2024, he oversaw the purchase of almost 240,000 shares of this AI networking giant. But in the subsequent quarter, this position was completely exited.\nBased on Duquesne's second-quarter 13F, Broadcom is back. During the June-ended quarter, Druckenmiller purchased a little over 86,000 shares, worth close to $24 million, as of the midpoint of 2025.\nWall Street's mini-crash in early April is probably one of the reasons Druckenmiller loaded up on shares of Broadcom, once again. Following President Donald Trump's unveiling of its tariff and trade policy on April 2, the benchmark S&P 500 endured its fifth-largest two-day percentage decline in 75 years. A nearly one-week period of fear and pessimism created a unique opportunity for investors like Druckenmiller to snag amazing businesses at a discount. Although we don't know if this is when Duquesne added to Broadcom, the early portion of April would make sense.\nBroadcom's hardware is integral to the success of the AI revolution. Its solutions are connecting tens of thousands of graphics processing units in enterprise data centers to maximize their compute capacity, as well as reduce tail latency. The latter is particularly important, as minimizing lag is a necessity for AI-empowered software and systems making split-second decisions.\nBroadcom's custom AI application-specific integrated circuits (ASICs) are also a massive opportunity. CEO Hock Tan believes custom ASICs could help drive $60 billion to $90 billion in revenue to Broadcom from three of its largest hyperscaler customers by 2027.\nAnother key aspect to Broadcom's success is its growth potential outside of artificial intelligence. While there's no denying that AI networking solutions account for the bulk of its growth at the moment, Broadcom generates quite a bit of sales from wireless chips and solutions for smartphones, enterprise cybersecurity, and various solutions used in industrial robotics and automobiles. If an AI bubble were to form and burst, Broadcom would have other operating segments to fall back on.\nThe final catalyst for billionaire Stanley Druckenmiller might be Broadcom's valuation. If Duquesne's boss lapped up shares in early April, he'd have nabbed Broadcom at a forward price-to-earnings ratio of less than 20, which is a solid value for a company slated to grow its sales by more than 20% annually."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d1534525-9505-46a6-b498-56f23bf5cd39&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001088%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D17500&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,042% vs. just 183% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/investing/2025/08/26/billionaire-stanley-druckenmiller-sold-nvidia-pltr/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
      "text": "The month of August has been chock-full of important data releases. The inflation and jobs report from the federal government, Federal Reserve Chair Jerome Powell's highly anticipated speech at Jackson Hole, and earnings releases from many of Wall Street's most influential businesses have deluged investors with information. It's also made it easy for something of importance to slip through the cracks.\nFor instance, Aug. 14 marked the deadline for institutional investors with at least $100 million in assets under management (AUM) to file Form 13F with U.S. regulators. A 13F offers a concise snapshot of which stocks Wall Street's shrewdest money managers bought and sold in the latest quarter (in this case, the quarter ended June 30).\nAlthough billionaire Warren Buffett has earned quite the following on Wall Street, he's not the only billionaire fund manager with a keen eye for value. Duquesne Family Office's billionaire boss Stanley Druckenmiller is also known for his outsize returns and ability to snag amazing deals.\nWhat's particularly interesting about Druckenmiller has been his trading activity within the artificial intelligence (AI) space. Over the previous year, based on 13F filings covering trading activity from July 1, 2024 to June 30, 2025, Duquesne's investment guru sent Wall Street's two top-tier AI stocks, Nvidia (NVDA -0.24%) and Palantir Technologies (PLTR -1.42%), to the chopping block. But at the same time, he purchased shares of an essential AI titan for four consecutive quarters and made it a top-five holding.\nNvidia and Palantir were shown the door by billionaire Stanley Druckenmiller\nAs of the midpoint of 2024, Duquesne's billionaire chief was overseeing $2.9 billion in AUM spread across 64 holdings. This included 214,060 shares of Nvidia, following its 10-for-1 forward split in June 2024, as well as 769,965 shares of Palantir. By March 31, 2025, both of these holdings were completely exited.\nThe logical explanation for selling two of the hottest AI stocks on the planet is that Druckenmiller was locking in gains. The average stock for Duquesne Family Office has been held for less than seven months, which suggests its billionaire investor isn't afraid to cash in his fund's chips when the opportunity presents itself.\nShares of Nvidia have catapulted higher by roughly 1,120% since the end of 2022, as of the closing bell on Aug. 22. Its AI-graphics processing units (GPUs) have become the preferred choice by businesses to deploy in their AI-accelerated data centers. Strong ongoing demand for AI-GPUs, coupled with Nvidia's well-defined compute advantages, have allowed it to charge a premium for its hardware.\nMeanwhile, Palantir's stock has gained well over 2,300% during the same time frame. Its AI and machine learning-fueled Gotham platform, which assists federal governments with military mission planning and oversight, has done a lot of the heavy lifting. With no clear one-for-one replacement for Gotham, and no true competition to its enterprise subscription Foundry platform at scale, Palantir has commanded quite the valuation premium.\nWhat might be of concern to Nvidia and Palantir shareholders is if Druckenmiller sent these stocks packing for reasons that go beyond profit-taking.\nAs an example, Druckenmiller opined in May 2024 that \"AI might be a little overhyped now, but under-hyped long term.\" Duquesne's billionaire boss astutely recognizes that every next-big-thing trend over the last 30 years has endured an eventual bubble-bursting event early in its expansion phase. In other words, investors have a propensity to overshoot when it comes to early utility and adoption rate expectations. This eventually leads to lofty expectations that aren't met and the bursting of the bubble.\nNo company has benefited more from the AI revolution than Nvidia. If a bubble were to form and burst, there's little question its shares would feel the impact. Though Palantir's multiyear government contracts and subscription revenue would protect it from an immediate revenue drop-off, poor investor sentiment during a bubble-bursting event would still, likely, weigh on its shares.\nValuation is another catalyst that may have enticed Druckenmiller to sell. Nvidia and Palantir are trading at respective price-to-sales (P/S) ratios of 30 and 117. Historically, businesses on the front line of a game-changing innovation have peaked at P/S ratios of 30 to 40. In short, Nvidia and Palantir are priced for perfection.\nDuquesne's billionaire boss has purchased this trillion-dollar AI stock in four straight quarters\nAlthough Druckenmiller remains skeptical of some of the companies leading the evolution of AI over the short run, there is one essential artificial intelligence stock that he simply can't stop buying for his fund. Duquesne's 13Fs show buying activity spanning four consecutive quarters for trillion-dollar chip fabricator Taiwan Semiconductor Manufacturing (TSM 1.34%), which is best-known by its abbreviation, \"TSMC.\"\nHere's a breakdown of Druckenmiller's buying activity of TSMC over the previous year:\n- Q3 2024: 57,355 shares purchased\n- Q4 2024: 50,160 shares purchased\n- Q1 2025: 491,265 shares purchased\n- Q2 2025: 166,305 shares purchased (765,085 total shares held)\nIn just one year, TSMC has become a top-five holding for Duquesne's now greater-than-$4 billion investment portfolio.\nThe obvious allure of Taiwan Semiconductor is the role it's playing in AI chip manufacturing. Its chip-on-wafer-on-substrate (CoWoS) technology is essential for the packaging of high-bandwidth memory needed for AI-accelerated data centers. TSMC's monthly CoWoS capacity is expected to effectively double to between 65,000 units to 75,000 units by the end of 2025 from 35,000 per month in 2024. Further expansion is expected to 100,000 monthly units come 2026. This added capacity will help Nvidia, Advanced Micro Devices, and other chipmakers ramp up sales of their AI GPUs.\nTo build on the above, TSMC is dealing with quite the backlog for its services, with some orders stretching well into 2026. Backlogged orders provide a healthy level of operating cash flow predictability.\nWhile advanced chips accounted for 60% of TSMC's net sales during the June-ended quarter, there's still plenty of opportunity outside of the AI arena. More than a quarter of its net sales trace back to chips and solutions used in next-generation smartphones. The proliferation of 5G wireless networks has led to a steady smartphone upgrade cycle.\nAnother 10% (combined) of Taiwan Semiconductor's net sales derive from Internet of Things devices and chips used in automobiles. Vehicles and household appliances becoming more reliant on technology is excellent news for TSMC.\nDuquesne's billionaire chief might also be attracted by TSMC's valuation. Though its forward-year price-to-earnings (P/E) ratio of 21 represents a modest premium compared to recent years, TSMC's annual earnings growth rate of 20% or greater makes its forward P/E quite palatable."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d1534525-9505-46a6-b498-56f23bf5cd39&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001088%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17500%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DBroadcom&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e5d4799-5d20-4e5c-ac26-0c50bb3a4278",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,042% vs. just 183% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=8ca45f59-495d-43b2-8917-227f080ca6f5&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
      "text": "5 Years From Now, You'll Probably Wish You Grabbed These Stocks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,042% vs. just 183% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to find out how to get access to these stocks.\nReturns are updated during market hours. The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    }
  ],
  "argos_summary": "Billionaire investor Stanley Druckenmiller sold his entire Palantir stake in the past year, citing profit‑taking and valuation concerns, and has shifted focus to other AI‑related names. He has increased positions in Broadcom, a key AI networking chipmaker, and has been steadily buying Taiwan Semiconductor Manufacturing Co (TSMC) over four quarters, citing its critical role in AI chip production and attractive valuation. The moves reflect a shift from high‑valuation AI software to more diversified AI hardware exposure amid worries of an AI bubble.",
  "argos_id": "WWVQ007MU"
}