{
  "url": "https://www.bloomberg.com/news/videos/2025-09-03/bloomberg-brief-9-3-2025-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "363a6725390047a29726e6d53c9671bd",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ilZPSU7czJAo/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T11:27:04.654000+00:00",
  "addDate": "2025-09-03T11:52:18.027181+00:00",
  "refreshDate": "2025-09-03T11:52:18.027183+00:00",
  "score": 1.0,
  "title": "Global Bond Selloff; Google Avoids Chrome Sale in Antitrust Case",
  "description": "US equity futures bounce back and the selloff in global bonds slightly eases after the US 30-year yield nears 5%. Google avoids a sale of its Chrome browser after a judge ruled in its antitrust case. Max Kettner of HSBC says he doesn't necessarily see contagion in bonds. Aaron Kennon of Clear Harbor Asset Management sees five to six Fed rate cuts between now and December 2026. Petrobras CEO Magda Chambriard exclusively tells Bloomberg's Annmarie Hordern that Asia will help counter the pressure of the US trade war. “Bloomberg Brief” delivers the market news, data and analysis you need to set your agenda. (Source: Bloomberg)",
  "content": "VONNIE: IT’S 5AM IN NEW YORK CITY, GOOD MORNING, I’M VONNIE QUINN WITH YOUR BLOOMBERG BRIEF > > HERE IS WHAT YOU NEED TO KNOW. THE GLOBAL BOND ROUT DEEPENS. SO OFTEN NOTES ACROSS THE WORLD AND TREASURIES FROM GDB'S SEEING NO SIGN OF RELIEF TODAY. DODGING BULLETS, GOOGLE AVOIDS THE SALE OF ITS CHROME BUSINESS IN THE LATEST COURT RULING. DON'T MISS OUR EXCLUSIVE INTERVIEW LATER THIS HOUR. MARKETS WERE TROUBLESOME YESTERDAY PARTICULARLY YIELDS, JAPAN'S 30 YEAR YIELD UP ANOTHER SEVEN BASIS POINTS. NOT QUITE AS BAD FOR THE UNITED STATES, IS IT CONTAGION? IS IT MORE TROUBLING SIGNS FOR THE BOND MARKET AND ITS VIGILANTES? WE HAVEN'T YET BYPASSED 5% BUT WE ARE VERY CLOSE, AND THE 10 YEAR YIELD UP ANOTHER 2.5 BASIS POINTS SO THE CURVE IS EXPERIENCING THIS ANXIETY AND PERHAPS GETTING TO BE MORE THAN ANXIETY. LET'S MOVE TO FUTURES, WE ARE IN THE GREEN, TOWARDS THE END OF THE SESSION YESTERDAY WE RECOVERED TO A CERTAIN EXTENT BUT IF YOU LOOK AT GOLD THIS ON THE CORNER OF THE UNIVERSE WHERE YOU CAN SEE THAT ANXIETY. SEVEN STRAIGHT SESSIONS OF GAINS FOR GOLD. LET'S GET TO SOME STOCKS TO WATCH. VALERIE: LET'S START FROM MAY BE THE REASON WHY WE ARE SEEING THOSE NASDAQ FUTURES REBOUND WE HAVE GOOGLE SHARES RISING FIVE .5%, ANTITRUST CASE AS NOW, CLEAR THEY WILL NOT FORCE THE FORCE SELLING OF THEIR CHROME SEARCH BROWSER BUSINESS. THEY WILL HAVE TO SHARE SOME OF THEIR GOOGLE SEARCH DATA BUT IT WAS REALLY THAT SELLING OF THEIR CHROME BUSINESS THAT WORRIED INVESTORS SO NOW WE HAVE THAT CLARITY WE ARE SEEING UP 5.5%. IT IS ALSO HELPING SHARES OF APPLE, ANOTHER REASON WE ARE SEEING TECH STOCKS TODAY. THEY HAVE A VERY LUCRATIVE AGREEMENT WITH GOOGLE'S SEARCH BROWSER AND THIS NEW ANTITRUST RULING DOES REMOVE SOME OF THE NEGATIVE IMPETUS -- NEGATIVE OVERHANG FOR THIS STOCK MOVING FORWARD. LOOKING AHEAD TO THE OPEN WE HAVE SOME MORE EARNINGS, MACY'S IS ANOTHER RETAILER SUCH A REPORT, SHARES ARE UP NEAR 2% ALREADY IN PREMARKET TRADE. WE ARE EXPECTING TO SEE SOME MORE DETAIL ON HOW THE COMPANY IS DEALING WITH TARIFFS AND PERHAPS GIVE US SOME OF THE GAUGE ANOTHER CONSUMER IS DOING. > > IN JUST MOMENTS WE WILL GET A CLOSER LOOK AT THE BOND MARKET ACTION. AARON CANNON OF CLEAR HARBOR JOINS US LATER WITH THE STOCK MARKET AND MORE. BACK TO OUR TOP STORY, YIELDS OR LONG DATA BONDS ACROSS THE WORLD CONTINUE TO EDGE UP. MORE WITH VEN RAM. AS YOU PUT IT IN ONE OF YOUR BLOG POSTS THIS MORNING IT MIGHT BE A SLIGHTLY LESS BRUISING DAY FOR GLOBAL BOND MARKETS BUT NO FUNDAMENTAL RELIEF IN SIGHT PARTICULAR FOR JAPAN. VEN: ABSOLUTELY. I THINK THE QUESTIONS THE LONGER-TERM QUESTIONS FOR INVESTORS REMAINS HOW IS CHANCELLOR RACHEL REEVES GOING TO FUND -- PLUG THE FISCAL GAP. TODAY WE HAVE NEWS THAT MAY BE THE AUTUMN BUDGET WILL BE POSTPONED TO NOVEMBER, THAT IS RAISING SOME VERY SERIOUS QUESTIONS ABOUT THE U.K. GOVERNMENT BECAUSE THE AUTUMN BUDGET USUALLY COMES OUT IN OCTOBER IF THEY HAVE TO BUY MORE TIME THAT KIND OF SUGGESTS HAVING A HARD TIME FIXING THE FINANCES AND THAT IS ASKING THAT HAS LEFT TRADERS ASKING SOME VERY UNCOMFORTABLE QUESTIONS ABOUT HOW SHE IS GOING TO MANAGE. CUTTING SPENDING WHICH IS DEEPLY UNPOPULAR WITHIN THEIR OWN PARTY OR PUT UP TAXES AND THAT OF COURSE IS NOT A VERY POPULAR OPTION AS WELL GIVEN SHE ALREADY RAISED TAXES EARLIER. ALL IN ALL THE BOND MARKET ARE ASKING SOME UNCOMFORTABLE QUESTIONS. > > VONNIE: CERTAINLY A LOT OF CONTAGION AND ALSO ANXIETY. THANK YOU SO MUCH, THAT IS VEN RAM. THE RALLY AND LONG DATA BONDS MAY BE SET FOR A SECOND DAY TAKING A LOOK AT THE 30 YEAR YIELD. WHICH IS YOUR BLUE LINE. JAPAN THE YELLOW LINE IN THE UNITED STATES STILL UP THERE AND THE LEAST LOUSIEST MOVE BUT STILL PRETTY LOUSY. IS THIS CONTAGION ARE EACH COUNTRY'S BOND VIGILANTES ON THE MARCH. JOINING US IS MAX KETTNER AT HSBC. HOW DO YOU READ THIS MOVE, IS IT CONTAGION OR SOMETHING ELSE? MAX: I DON'T THINK IT IS CONTAGION I THINK SEVERAL IDIOSYNCRATIC FACTORS AT THE SAME TIME. WE LOOK AT JAPAN OBVIOUSLY THEY HAVE A BIT OF A FUNDING GAP AS WELL WHEN WE LOOK AT JAPAN WE KNOW FINANCES ARE NOT IN A PARTICULARLY GREAT STATE WITH DEBT TO GDP BUT IN JAPAN ALSO WE KNOW UNDERLYING INFLATION ARE IN FACT REALLY GOING THE WRONG DIRECTION SO THEY ARE BOTH A FRONT AND THE LONG END. STILL HAS A LOW BIT FURTHER TO GO. IN THE U.K. AS WELL IT'S VERY U.K. SPECIFIC BETWEEN DEFICIT ISSUE IN THE U.K. PLUS THE BUDGET SITUATION IN THE U.K. AND TREASURIES IN PARTICULAR THE LONG END OBVIOUSLY WHAT WE'VE SEEN AND ARE STILL SEEING IS THE SPECULATION THAT IT'S BEEN WITH US SINCE THE LATE JULY AROUND THIS QUESTION IN THE SPECULATION AROUND THE END OF INDEPENDENCE OF THE FED WHICH I DON'T REALLY NECESSARILY BUY INTO IT ALL. THE SORT OF THOSE IDIOSYNCRATIC FACTORS OF COME TOGETHER. I DON'T THINK IT'S NECESSARILY CONTAGION AND THERE'S ONLY ONE WAY UP. PEOPLE MAKING IT TO SYSTEMIC OF AN ISSUE THAT IT ACTUALLY GETS IN REALITY. VONNIE: THAT MIGHT BE A SILVER LINING TO THIS WHOLE EVENT. DOES THAT MEAN WE WILL SHOW UP INFLOWS HOWEVER THE PEOPLE START ISSUING NATION VON DUTCH BOND FOR THE RELATIVE SAFETY WHICH WOULD BE TO THE BENEFIT OF THE UNITED STATES. MAX: I DON'T THINK SO, I DON'T THINK PEOPLE ARE MASSIVELY GOING TO LOOK INTO U.S. TREASURIES NOW BECAUSE THAT WOULD EITHER BE A STAR ONLY HAPPENING IF WE DIDN'T REALLY SEE SOME SIGNIFICANT DATA, WHAT IF WE SAW SOME PROPER RESPONSE. YOU JUST SAID IN THE INTRO AS WELL WE STARTED YESTERDAY WITH SOME PRETTY HEAVY ACROSS SOME SECTORS AND BY THE END OF THE TRADING SESSION THERE'S BEEN SOME BUYING AGAIN AND THINGS LOOK A LOT ROSIER ALREADY LOOKING AT EQUITY FUTURES. I DON'T THINK THAT'S NECESSARILY SOMETHING THAT IS GOING TO BENEFIT U.S. TREASURIES FROM A FLOW PERSPECTIVE PARTICULARLY BRICK FROM THE DATA WHEN YOU LOOK AT DATA IN THE U.S. I DO THINK PEOPLE ARE REALLY NOT PAYING CLOSE ENOUGH ATTENTION TO IS ONLY LOOK AT THE HIGH FREQUENCY OF DATA IN THE U.S. THAT'S ACTUALLY BEEN PICKING UP SINCE THE END OF JUNE SO FOR ALL THE TALK OF REVERSING AND BIG SLOWDOWN IN U.S. ACTIVITY AND A DEEP GLOBAL ACTIVITY IN THE SECOND HALF THAT WE'VE SEEN FROM CONSENSUS I THINK THERE IS REALLY A CHANCE BUT PEOPLE ARE A LITTLE BIT TOO BEARISH ON THE GROWTH SIDE AND BOTH CONSUMPTION DATA ALSO SOMEHOW FREQUENCY DATA EVEN ON THE LABOR MARKET HAVE ACTUALLY STARTED TO TREND A LITTLE BIT MORE IMPROVEMENT, ALL OF THAT IS REALLY BEEN OVERLOOKED. I THINK THAT'S REALLY PLAYING AGAINST THE SORT OF FLOW ARGUMENT IN TREASURIES. IT'S MORE ARGUING FOR TREASURIES TO STILL BE MISPRICED PARTICULARLY THOSE 5.5 CUTS BY DECEMBER OF NEXT YEAR, THAT REALLY IS TOO MUCH AND SHOULD BE CLOSER TO SOMETHING LIKE 2.5 TO THREE BEFORE THAT GETS MORE ATTRACTIVE AGAIN. VONNIE: THAT'S PUTTING A LOT OF PRESSURE ON THE NONFARM PAYROLLS. WHAT IF WE GET A WEEK NUMBER OR AN UNEMPLOYMENT RATE THAT RISES? MAX: I THINK WHEN WE LOOK AT THE PAYROLLS THIS WEEK FOR EXAMPLE CONSENSUS IS AROUND 75,000 LAST TIME I CHECKED. ALREADY THE CONSENSUS NUMBER IS A VERY LOW. OF COURSE THAT'S PARTLY A FUNCTION OF BREAKEVEN PAYROLLS, THAT NUMBER BEING REALLY LOW AS WELL GIVEN THAT IMMIGRATION FLOWS HAVE GONE SO MUCH IN REVERSE SINCE THE START OF THE YEAR. IF WE GET INSTEAD OF A 75 K IF WE GET A 50, 40 OR 60 K, SO WHAT. THAT IS STILL BETTER. LOOK AT THE LAST THREE MONTHS. 35,000 ON AVERAGE PAYROLL GAINS AND THE UNEMPLOYMENT RATE WAS VIRTUALLY UNCHANGED SO THAT DOES SUGGEST PERHAPS THE BREAKING BARREL NUMBER ALREADY IS MORE THAN 50,000 SO EVEN IF YOU GET A MISS ON THE PAYROLL NUMBER I HAVE A REALLY HARD TIME TO SEE THE UNEMPLOYMENT RATES SUDDENLY GOING UP ANOTHER 10 OR 15 BASIS POINTS. FOR THAT TO HAPPEN THAT MIGHT ACTUALLY NEED A NEGATIVE PAYROLL NUMBER. GIVEN HOW LOW THE BREAKEVEN NUMBERS ARE. VONNIE: YOU ARE SO CONSTRUCTIVE ON RISK ASSETS THAT YOU REALLY LIKE CONSUMER COMPANIES HERE AND ALSO HIGH-YIELD BONDS IN THE UNITED STATES. EXPLAIN WHY THERE IS A LITTLE BIT OF TREPIDATION. MAX: ONE OF THE DEFINING FEATURES OF THE RALLY SINCE LIBERATION DAY HAS BEEN PRETTY SUBDUED SENTIMENT AND POSITIONING. IT CONTINUES LONG ONLY INVESTOR POSITIONING THAT'S ONLY NEUTRAL HIGH-YIELD CREDIT. THEY'VE BEEN MORE OVERWEIGHT UP UNTIL MARCH OR. THEY HAVE BEEN CLAWING BACK AT SOME OF THOSE OVERWEIGHT POSITIONS BUT AROUND ABOUT HALFWAY THERE SO THERE IS STILL A LONG WAY TO GO FROM POSITIONING PERSPECTIVE FROM A BROADER RISK ASSET PERSPECTIVE ON HIGH-YIELD CREDIT THE TECHNICALS ARE VERY STRONG. YOU LOOK AT THE REFINANCING NEEDS ARE VERY LOW. AVERAGE INDEX QUALITY IS MUCH BETTER COMPARED TO THE LAST 10 OR 15 YEARS SO ALL OF THAT PUTS HIGH-YIELD CREDIT AND ASSET ALLOCATION PERSPECTIVE AND REALLY COMFORTABLE SPOT AND IN PARTICULAR WHEN YOU LOOK AT THE TOTAL RETURN PERSPECTIVE IF INDEED MY VIEW IS WRONG AND HIGH FREQUENCY DATA IS SENDING THE WRONG SIGNAL, THEN THE FRONT END HAS A LONG ROOM TO RALLY. THE FRONT-END COULD PRICE A LOT OF ADDITIONAL RATE CUTS AND THAT OF COURSE SHOULD CUSHION ANY KIND OF SPREAD WIDENING. THAT WE MIGHT SEE IF INDEED THE HIGH FREQUENCY DATA TURNAROUND ONCE AGAIN. THAT LEAVES HIGH-YIELD CREDIT ALLUDING TO SOME OF THE MORE CONSUMER NET AIM NAMES IN EQUITIES. SOME NOR ECONOMICALLY SENSITIVE SECTORS -- SECTORS. THAT'S ALSO DUE TO THE FACT OFTEN OF COURSE THOSE HIGH FREQUENCY DATA PICKING UP. IF THAT STARTS SHOWING UP IN SOME OF THE TOP TIER ONE DATA THAT IS NOT REALLY PRICED IN TO THE BROADER MARKET IT ALSO REALLY ARGUES FOR THE EQUITY MARKET AS A WHOLE. > > THANK YOU SO MUCH FOR YOUR TIME TODAY, THAT IS MAX KETTNER OF HSBC. OTHER TOP STORIES TRENDING ON THE TERMINAL, CHANCELLOR OF THE EXCHEQUER RACHEL REEVES WILL RELEASE THE U.K. ANNUAL BUDGET ON NOVEMBER 26. THE BUDGET IS LIKELY SEEN AS A DEFINING LOOK -- LOCATION FOR KEIR STARMER AND RACHEL REEVES. IN THE LATEST COURT FILINGS LISA COOK'S LAWYER BLASTED PRESIDENT TRUMP'S MOVE TO OUST HER AS NOTHING MORE TRYING TO PASTE OR WITH ALLEGATIONS OF MORTGAGE FRAUDS. ASKING FOR EMERGENCY RULING TO ALLOW HER TO KEEP HER JOB THE LATEST FINDS INDICATE A RULING BEFORE THE END OF THE WEEK. APPLES LEAD FOR ROBOTICS IS LEFT TO JOIN MEHTA. THREE MORE AI RESEARCHERS ARE LEAVING APPLES IN-HOUSE TEAM. ACCORDING TO SOURCES APPLE IS DISCUSSING INTERNALLY WHETHER TO RELY MORE ON OUTSIDE TECHNOLOGY RATHER THAN HOMEGROWN MODELS. COMING UP PRESIDENT TRUMP ACCUSES CHINESE PRESIDENT XI JINPING OF CONSPIRING AGAINST THE U.S. WITH PUTIN AND KIM. MORE NEXT, THIS IS BLOOMBERG. ♪ > > WE ARE GOING TO BE GOING TO THE SPRING WHERE WE THINK TOMORROW BECAUSE WE NEED AN EARLY DECISION WILL ASK FOR EXPEDITED RULING. VONNIE: PRESIDENT TRUMP HOPEFUL AND EXPEDITED SUPREME COURT RULING TO OVERTURN AN APPEALS COURT FINDING THAT HIS TARIFFS ARE ILLEGAL. I'M JOINED BY SUZANNE LYNCH. WHAT EXACTLY ARE THE NEXT LEGAL STEPS REGARDING THESE TARIFFS. > > AS WE HEARD THEIR DONALD TRUMP IS PLANNING TO APPEAL THIS TO THE SUPREME COURT. THAT COULD HAPPEN AS EARLY AS TODAY SO WE ARE EXPECTING SOME DEVELOPMENTS ON THAT. I THINK WHAT THIS MEANS IS MORE UNCERTAINTY. OBVIOUSLY THE REST OF THE WORLD ALL THE UNITED STATES MAIN TRADING PARTNERS HAVE BEEN THROWN INTO DISARRAY OVER THE LAST SIX TO EIGHT MONTHS SINCE THE REELECTION AND REAPPOINTMENT OF DONALD TRUMP AS U.S. PRESIDENT BECAUSE OF THIS NEWLY PROTECTIONIST STANCE BY THE UNITED STATES. AND WE HAVE SEEN AT VARIOUS LEVELS OF TARIFFS SLAPPED ON ALL OF THE U.S. TRADING PARTNERS. I THINK THE CONCERN NOW IS AMONG THE MARKETS AND EXPORTERS REALLY IS ARE WE GOING TO GET CLARITY ON THIS. I THINK IT 1 -- IN ONE SENSE UNCERTAINTY HAS BEEN PRICED IN THERE'S BEEN A LOT OF FLIP-FLOPPING ON THESE POLICIES BY THE TRUMP ADMINISTRATION TRUMP THREATENING HUGE TARIFFS BRINGING THAT BACK DOWN CHANGING HIS MIND QUICKLY. I THINK THE MARKET IS QUITE USED TO THAT UNCERTAINTY. AT THE SAME TIME PEOPLE AND EXPORTERS HERE IN EUROPE WANT TO KNOW WHAT ARE THE FINAL TERMS OF THIS TRADE AGREEMENT. WE SEEN AT VARIOUS POINTS OVER THE PAST FEW MONTHS COMPANIES AND EXPORTERS HOLDING BACK TRYING TO GET THEIR EXPORTS IN BEFORE A CERTAIN DAY TO TRY AND BEAT THE CALENDAR AS IT WERE SO I THINK IT DOES INJECT ANOTHER LEVEL OF UNCERTAINTY WE SAW IN THE MARKETS LAST FRIDAY WITH THIS. VONNIE: THE WALL STREET JOURNAL HAS REPORTED AS WE KNOW THE TREASURY SECRETARY SCOTT BESSENT IS KICKING OFF FED CHAIR INTERVIEWS THIS FRIDAY. WHAT MORE CAN WE KNOW IN THE LAST COUPLE WEEKS AND MONTHS. > > THIS IS ALSO A VERY BIG MOMENT AND SOMETHING INVESTORS AND THE REST OF THE WORLD ARE LOOKING AT CLOSELY. THE ISSUE OF FED INDEPENDENCE AND ITS CENTRALITY TO THE U.S. ECONOMY. AND TO THE REST OF THE WORLD, THE GLOBAL ECONOMY. THE WALL STREET JOURNAL IS REPORTING THE TREASURY SECRETARY WILL BEGIN THOSE INTERVIEWS THIS FRIDAY. LOOKING AT AROUND 11 NAMES. PEOPLE LIKE MICHELLE BOWMAN THE CURRENT FEDERAL GOVERNOR, KEVIN HASSETT A LONG-TERM ADVISOR TO DONALD TRUMP, THE NATIONAL ECONOMIC DIRECTOR. THESE ARE THE KIND OF NAMES THAT ARE OUT THERE BUT THIS IS CRUCIALLY IMPORTANT. I THINK THERE'S BEEN A LOT OF UNCERTAINTY OVER THE LAST FEW WEEKS OBVIOUSLY IN CONNECTION WITH GOVERNOR COOK WE HEARD EARLIER THAT SHE HAS LAUNCHED MORE LEGAL DOCUMENTS BY THIS CASE. TAKING AGAIN DONALD TRUMP ARE TRYING TO REMOVE HER. SO VERY SIGNIFICANT MOMENT WHO GETS THIS POSITION AND WHO IS GOING TO BE AT THE TOP OF THE FED WENT DONALD TRUMP AND WILL IT BE TRUMP ULTIMATELY THAT WILL MAKE THAT DECISION. VONNIE: THANK YOU SO MUCH, THAT IS SUZANNE LYNCH. OVER IN BEIJING CHINA HAS MADE A SHOW OF ITS GROWING FIREPOWER IN CLOUD IN IT ONCE IN A DECADE MILITARY PARADE. TAKE A LISTEN TO PRESENT XI JINPING SPEAKING EARLIER. > > THE CHINESE NATION IS A GREAT NATION NEVER INTIMIDATED BY BULLIES. AND ALWAYS VALUES INDEPENDENCE. IN THE PAST WHEN FACED WITH CRITICAL STRUGGLES, A LIGHT AND DARKNESS, PROGRESS AND DARKNESS, PROGRESS IN REACTION THE CHINESE PEOPLE RALLIED TOGETHER TO DEFY THE ENEMY. > > PRESIDENT TRUMP WATCHING FROM WASHINGTON WENT TO TRUTH SOCIAL TO GIVE HIS WARMEST REGARDS TO VLADIMIR PUTIN AND KIM JONG-UN AS YOU CONSPIRE AGAINST THE UNITED STATES OF AMERICA. FOR MORE WE ARE JOINED IN BEIJING. TRUMP HAS ACCUSED XI JINPING OF CONSPIRACY PAID WHAT HAVE THEY SAID ABOUT THE U.S.. > > PRESIDENT XI JINPING DIDN'T MENTION THE U.S. AT ALL IN HIS SPEECH AND PRESIDENT XI JINPING SPEECH IS LIKELY DRAFTED WAY BEFORE HAND. LIKELY TO CHANGE IT TO RESPOND EARLIER THIS MORNING. TRUMP DID ASK ABOUT ON A TWEET POST WHETHER CHINA WOULD MENTION THE ROLE OF THE U.S. FOR THE AMOUNT OF BLOOD THAT'S BEEN SHED BY U.S. AND VETERANS IN SUPPORTING CHINA TO WIN OVER THE JAPANESE DURING WORLD WAR II AND PRESIDENCY IN A SPEECH THANK THE CHINESE VETERANS FOR HIS SACRIFICE -- FOR THE SACRIFICE BUT MADE A NOD TO FOREIGN COUNTRIES FOR THEIR AID. HE DID NOT NAME DROPPED THE U.S.. HE DIDN'T SAY ANYTHING ABOUT THAT CONSPIRACY BUT WHAT IS UNSAID IT DOESN'T REALLY NEED TO BE SAID BECAUSE YOU HAVE THE IMAGES PRESIDENT PUTIN KIM JONG-UN FLANKING PRESENT XI JINPING NOT TO MENTION YOU ALSO HAVE THE OTHER SANCTION COUNTRIES PRESENT AS WELL. THERE IS THE LEADER OF IRAN AND MYANMAR AS WELL, PAKISTAN, AT LEAST 20 WORLD LEADERS GATHERING IN BEIJING TO WATCH THE MILITARY PARADE AND IT'S A SHOW OF FORCE BECAUSE THEY SHOWCASE THEIR LEADERS CUTTING EDGE TECHNOLOGY AND HARDWARE. VEHICLES AS WELL AND IF YOU WATCH THE CHINESE COMMENTATOR THE COMMENTATOR WAS TALKING ABOUT HOW THAT WOULD BE CRITICAL FOR THE TAKEDOWN OF ANY COASTAL TERRITORY. PART OF CHINA'S PLAN TO REUNIFY WITH THE TERRITORY AT SOME POINT BY FORCE IF NECESSARY. > > INDEED ACCUSING THE THREE OF CONSPIRACY WAS REALLY QUITE THE POST ON TRUTH SOCIAL. HE DID NOT ELABORATE BY THE WAY. THANK YOU SO MUCH, THAT IS MINMIN LOW IN BEIJING. A SIGH OF RELIEF FOR GOOGLE. A MAJOR COURT RULING AND A LOOK AT WHAT ELSE IS MAKING HEADLINES AND FRONT-PAGE NEWS NEXT. THIS IS BLOOMBERG. ♪ VONNIE: THIS IS BLOOMBERG BRIEF. TIME FOR YOUR FRONT-PAGE NEWS. ON THE WALL STREET JOURNAL GOOGLE DODGES THE WORST CASE IN ITS ANTITRUST CASE. BARRING THEM FROM EXCLUSIVITY DEALS BUT NOT FORCING THE SALE OF CHROME. THE ORDER FOLLOWS THE RULING DID GOOGLE EAT -- GOOGLE ILLEGALLY MONOPOLIZED THE SEARCH FOR MORE THAN A DECADE. THE NEW YORK TIMES, A FEDERAL APPEALS COURT BLOCKED PRESIDENT TRUMP FROM USING AN WARTIME LAW TO THE POINT -- DEPORT A GROUP OF VENEZUELANS. THE TRUMP ADMINISTRATION SAID THEY WERE PART OF A VIOLENT GANG AND A SO-CALLED INVASION OF THE U.S.. THE COURT SAID IT FOUND NO INVASION OR PREDATORY INCURSION BY A FOREIGN POWER. IN THE WASHINGTON POST D.C. MAYOR MURIEL BOWSER ORDERED AN INDEFINITE COORDINATION BETWEEN THE CITY AND FEDERAL LAW ENFORCEMENT OFFICIALS. BOWSER HAS SET HER ORDER WOULD PROVIDE A PATHWAY FORWARD BEYOND THE PRESIDENTIAL EMERGENCY. PRESIDENT TRUMP'S FEDERALIZATION OF THE D.C. POLICE FORCE LAST 30 DAYS AND IS SET TO EXPIRE NEXT WEEK. COMING UP, MORE ON THE GLOBAL BOND RALLY WITH CLEAR HARBOR NEXT. THIS AS U.S. EQUITY INDEX FUTURES POINT HIGHER. THIS IS BLOOMBERG. VONNIE: 5:30 AM IN NEW YORK. I'M VONNIE QUINN WITH YOUR BLOOMBERG BRIEF. THE GLOBAL BOND ROW DEEPENS, SELLING LONG NOTES TREASURIES TO JGB'S SEES NO SIGNS OF RELIEF. DODGING A BULLET, GOOGLE APPOINTS A FORCED SALE OF ITS CHROME BUSINESS IN THE LATEST COURT RULING. AND DON'T MISS OUR EXCLUSIVE INTERVIEW WITH PETROBRAS CEO. LET'S LOOK AT THE MARKETS BECAUSE WE ARE SEEING PARTICULARLY IN JAPAN WITH A 30 YEAR YIELD UP ANOTHER SEVEN BASIS POINTS TODAY. WE ARE SEEING IT IN THE U.S. AS WELL. ANOTHER 200 BASIS POINTS ON THE 30 YEAR YIELD SAME FOR THE 10 YEAR YIELD. WE DID GET ALMOST A 5% EARLIER IN THE SESSION, 4.99 SEVEN. WE HAVEN'T FULLY CROSSED THAT 5% ON THE 30 YEAR YIELD. LET'S SWITCH IT UP AND SHOW WHAT WE ARE LOOKING AT IN TERMS OF FUTURES. IT'S A MUCH MORE POSITIVE SESSION TODAY THAN YESTERDAY AND DON'T FORGET TOWARDS THE END OF THE SESSION WE SAW SOME DIP BUYERS COMING IN. S & P FUTURES WITH A GAIN OF 4/10 OF A PERCENT AS WE HAD THE SECOND TRADING DAY IN SEPTEMBER AND NASDAQ FUTURES REBOUND AND QUITE SUBSTANTIALLY. GOLD UP TO ALMOST THREE 540. LET'S GET TO SOME STOCKS TO WATCH OVER IN LONDON IS VALERIE TYTEL. VALERIE: LET'S START WITH A CHECK ON ALPHABET. SHARES ARE RISING FIVE POINT 4% IN PREMARKET TRADE AFTER THAT ANTITRUST RULING SHOWED A VIDEO WILL NOT BE FIRST TO SELL OFF THEIR CHROME -- FORCED TO SELL OFF THEIR CHROME BROWSER BUSINESS. THEY WILL BE FORCED TO SHARE SOME OF ITS SEARCH DATA FROM ITS SEARCH ENGINE. SO IT'S NOT OUT OF THE WOODS. THAT IT IS ALSO HELPING SHARES OF APPLE. APPLE HAS A LUCRATIVE AGREEMENT WITH GOOGLE'S CHROME THAT SHARES A PRE-MARKETER UP NEAR 3% FOR APPLE THERE IS SOME SPECULATION BY ANALYSTS THAT THIS RULING ABOUT CHROME WILL HELP APPLE DEEPEN ITS TIES WITH GOOGLE THAT COULD HELP ITS CATCH UP TO THE AI RACE INCREASING SOME OF THE GEMINI FEATURES INTO APPLE PRODUCTS. WE HAVE SOME EARNINGS ACROSS THE TAPE FOR MACY'S A BIG RETAILER WHEN THE LAST RETAILERS TO REPORT EARNINGS SHARES OF MACY'S UP ONE POINT 9% IN THE PREMARKET. WE ARE LOOKING FOR ANY HINTS ON HOW THIS COMPANY IS DEALING WITH THE FALLOUT FROM TARIFFS AND ANY GAUGE ON HOW THE U.S. CONSUMER ACTIVITY IS HOLDING UP. > > THAT IS VALERIE TYTEL IN LONDON. 30 YEAR TREASURY YIELDS INCHING CLOSER TO 5%. THAT'S AS GLOBAL BOND SPACE FOR NEW PRESSURE WITH CONCERNS AROUND INFLATION AND THE FISCAL ENVIRONMENT IN MANY COUNTRIES INCLUDING THE UNITED STATES. JOINING US IS AARON CANNON CEO AND COFOUNDER OF CLEAR HARBOR ASSET MANAGEMENT. IF YOU SAW THE CHART WE SHOWED THERE IS THE DIFFERENCE BETWEEN THE 10 YEAR AND THIRTY-YEAR RIGHT NOW. REALLY SEEING IT IN THE LONGER DATED BONDS AND THE YIELDS, I'M CURIOUS WHAT YOU MAKE OF THAT GIVEN THERE WAS A LOT OF BOND BUYING OUT THE CURVE FOR SAFETY FOR SEVERAL MONTHS THERE. AARON: I THINK CLEARLY THE JAPAN STORY IS LEADING THE WAY AND IT SHOULD. IF YOU LOOK AT THE 30 YEAR JGB IS UP OVER 100 BASIS POINTS YEAR-TO-DATE, THAT COMPARES TO ABOUT 20 BASIS POINTS IN THE UNITED STATES AND IF YOU LOOK AT GERMANY AT SOMETHING LIKE 80 BASIS IN JAPAN IT'S ONLY THROUGH THE REFLATIONARY PERIOD THE LIKES WE HAVEN'T SEEN IN DECADES. IF YOU LOOK AT PHENOMENAL RATES THE 10 YEAR JGB IS TRADING AT 1.6% AND THE THIRTY-YEAR IS TRADING AT 3.2 AND SO STILL HASN'T PLAYED CATCH UP TO THE DEVELOPED MARKETS. I WOULD ALSO SAY FROM A SUPPLY PERSPECTIVE THE OUTSTANDING SUPPLY IN JAPAN 75% OUTSTANDING JGB SUPPLY IS COMING OUTSIDE OF THE TENURE PART OF THE CURVE SO LONGER DATED WOODS. WHERE IS THE UNITED STATES IT'S LESS THAN 25% OUTSIDE OF THAT 10 YEAR IN THE MARKET SO I THINK THERE IS THAT IMPORTANT DYNAMIC TO KEEP IN MIND IF YOU LOOK AT INTEREST RATES IN THE UNITED STATES ON THE FRONT END WE ARE DOWN ABOUT 60 BASIS POINTS YEAR-TO-DATE IN TWO YEARS AND WERE DOWN ABOUT 33 BASIS POINTS IN THE TENURE PART OF THE CURVE AND THAT'S MORE THAN JAPAN UP 30 BASIS POINTS. SOMETHING LIKE 55 BASIS POINTS IN THE TENURE PART OF THE CURVE. VONNIE: WHAT WOULD YOU SUGGEST TO INVESTORS AT THIS POINT AND IF YOU'VE BEEN IN TREASURIES AND HAVE YOUR PORTFOLIO DO YOU JUST STICK WITH WHAT YOU HAVE OR DO YOU MAKE ANY ADJUSTMENTS. > > WE MANAGE MONEY FOR INDIVIDUALS AND FAMILIES IN SMALLER INSTITUTIONS. AND WE REALLY THINK OF THE FIXED INCOME ASSET CLASS AS BALLAST TO OTHER ASSET CLASSES THAT WE ARE ALLOCATING TO. SO FOR US IN THE UNITED STATES, THAT MEANS OWNING SOVEREIGN DEBT STILL MAKES SENSE BECAUSE OF THE ECONOMY WERE TO SLOW DOWN WE STILL THINK THAT THERE IS A HISTORICAL SORT OF CORRELATION THAT IS TO SAY INTEREST RATES WILL TREND LOWER AS EQUITIES TREND LOWER PARTICULARLY INSIDE OF LET'S SAY THE THIRTY-YEAR PART OF THE CURVE WHICH HAS ITS OWN SORT OF TECHNICAL DYNAMICS WE JUST DISCUSSED. SO THAT IS IMPORTANT. WE ALSO THINK ABOUT WHERE CREDIT SPREADS RIGHT NOW. HOME AND ABROAD THEIR HISTORICALLY VERY TIGHT AND SO HIGH YIELD IS ALSO HIGHLY CORRELATED TO THE EQUITY MARKET. HIGH YIELD SPREADS ARE WIDENING A LITTLE BIT WE WOULDN'T NECESSARILY MIGHT BE EXTENDING INTO HIGH YIELD SIGNIFICANTLY THINKING ABOUT A MULTI-ASSET CLASS STRATEGY WE MAY BE RUNNING FOR A GIVEN FAMILY. WE ARE FOCUSING ON TREASURIES, MORTGAGE-BACKED SECURITIES AND INVESTMENT GRADE CREDIT. WE ARE KEEPING INVESTMENT GRADE CREDIT ON THE SHORTER END KEEPING TREASURIES CLOSER TO THE BLOOMBERG VONNIE: AGGREGATE. YESTERDAY WOULDN'T GIVE YOU THE HEEBIE-JEEBIES IF YOU SAW SOMETHING UNUSUAL ON NONFARM PAYROLLS REPORT OR THE SEPTEMBER 17 FOMC DECISION. > > FROM A CENTRAL BANK PERSPECTIVE WE THINK THE FED IS POISED TO PROBABLY MOVE IN SEPTEMBER PERHAPS ONE MORE TIME AFTER THAT THIS YEAR AND I THINK THERE ARE ABOUT FIVE TOTAL CUTS MAY BE UP TO SIX BETWEEN NOW AND DECEMBER OF 2026. THAT'S PROBABLY GOING TO STEEPEN THE CURVE. THE FRONT OF THE CURVE YOU LOOK AT TWO YEARS TRADING AT 365 THIS MORNING. THAT'S WELL BELOW THE FED FUNDS RATE OF 4.5% RIGHT NOW SO THE MARKETS ARE SIGNALING TO US BUT WE EXPECT SOME RATE CUTS IN THE NEAR FUTURE. > > I WANT TO ASK ABOUT EQUITIES BECAUSE WE SAW DIP BUYERS EMERGING EVEN YESTERDAY AFTER WE SAW 1.5% DROP FOR SOME OF THE INDICES AND LOOKING TOWARDS GAINS TODAY. WHEN SHOULD WE GET REALLY WORRIED ABOUT BUYING EQUITIES PARTICULAR THE MAG 7. > > WE ARE NOT MUCH FOR THINKING ABOUT WHAT CAN HAPPEN TODAY OR NEXT WEEK IN THE EQUITY MARKET BUT AS YOU KNOW SEPTEMBER IS SEASONABLY WEEK FOR THE EQUITY MARKET. SO THERE'S A LITTLE BIT OF CAUTION PEOPLE COMING BACK FROM THEIR SUMMER BREAKS, STARTED TO THINK ABOUT REBALANCING SO THERE IS SOME UNDERSTANDING MAYBE HISTORICALLY WHILE THAT'S THE CASE. ALSO VALUATIONS ARE NOT PARTICULARLY CHEAP AT LEAST FOR THE SEGMENTS OF THE EQUITY MARKET THAT ARE DRIVING THE RALLY ON A YEAR BASIS. IN THE U.S. TRADING AT 22 TIMES FORWARD EARNINGS. BUT THE SMALL CAP SEGMENT OF THE MARKET IS QUITE CHEAP. AND WE SEE INTEREST RATES WE SEE THAT RESHORING OF ECONOMIC ACTIVITY WHICH HASN'T REALLY OCCURRED IN THE TARIFF POLICY. BUT IF WE START TO SEE SOME OF THAT MAYBE SEE SOME BROADENING IN THE MARKET INTO 20 HERE IN THE U.S., IN EUROPE WE CONTINUE TO THINK OF ADDRESSING TAILWINDS IS THE EUROPEAN ECONOMY EMBRACES THE IDEA OF DEFICIT SPENDING, WE MILITARIZING THE CONTINENT AND WHAT IT MEANS FOR INFRASTRUCTURE AND INDUSTRIALS EVEN THE BANKING SECTOR UTILITIES, WE STILL THINK THERE IS SOME ROOM TO RUN IN EUROPE AND WE ARE STILL CONSTRUCTIVE ON JAPAN. VONNIE: WE KEEP SEEING BREATH AND HOW EVERY NOW AND THEN IT SEEMS TO WIDEN OUT AND GETS RELIEF THAT WE ARE NOT -- BUT THERE STOCKS ARE MAYBE NOT EQUALLY BUT RICHLY VALUED. > > I THINK IF YOU LOOK AT WHERE THERE TRADING AT 20 TIMES THAT SORT OF 400 93 STOCKS OUTSIDE THE MAG 7, A 20 TIMES IS EXPENSIVE BUT IF YOU EQUAL WEIGHT 400 93 NAMES OUTSIDE THE MAG 7, IT TRADES AT ABOUT 17 TIMES MULTIPLE 16.5 TIMES, THAT IS NOT PARTICULARLY EXPENSIVE SO WHAT THAT SIGNALS IS THERE ARE OPPORTUNITIES TO ALLOCATE CAPITAL WITHIN THE EQUITY MARKET AT A REASONABLE PRICE BEYOND THOSE MEGA CAP NAMES TECH DRIVEN PERFORMANCE OF THE LAST COUPLE OF YEARS. VONNIE: ANOTHER INTERESTING DAY IN MARKETS IN THE U.S.. AS OTHER TOP STORIES ON THE TERMINAL. IN THE LATEST COURT FINDINGS TUESDAY LISA COOK'S LAWYER BLASTED PRESIDENT TRUMP'S MOVE TO OUST HER AS NOTHING MORE THAN CUT-AND-PASTE ALLEGATIONS OF MORTGAGE FRAUD. ALLOWING HER TO KEEP HER JOB WITH THE LATEST FILINGS INDICATE THERE LIKELY WON'T BE A RULING BEFORE THE END. PRESIDENT TRUMP TOOK AIM AT PRESENT XI JINPING AS THE CHINESE LEADER HOSTED FOREIGN LEADERS OF THE MAJOR MILITARY PARADE. TRUMP ACCUSED HIM OF CONSPIRING AGAINST THE U.S. WITH RUSSIA'S VLADIMIR PUTIN AND NORTH KOREAN PRESIDENT KIM JONG-UN WITHOUT ELABORATING. CHINA'S FOREIGN MINISTRY DIDN'T IMMEDIATELY REPLY TO A REQUEST FOR COMMENT. FED X HAS LAUNCHED A NEW REGIONAL HUB IN RIYADH AND SECURED A SAUDI ACADEMIC LICENSE TO OPERATE AS A FOREIGN AIR CARRIER. THE MOVE MARKS THEIR DEEPENING BET ON THE KINGDOM AS A RISING LOGISTICS POWER. THE DOW SETTLES ON AMERICA'S BIGGEST ANTITRUST CASE IN DECADES. MORE ON WHAT IT MEANS FOR GOOGLE ALPHABET AND BIG TECH. THIS IS BLOOMBERG. THIS IS BLOOMBERG BRIEF, I'M VONNIE QUINN IN NEW YORK. GOOGLE HAS AVOIDED A FORCED SALE OF ITS INTERNET BROWSER CHROME BUSINESS. IN THE LATEST RULING BY A D.C. JUDGE IN THE BIGGEST ANTITRUST CASE IN DECADES. THE COMPANY WILL NEED TO SHARE ONLINE SEARCH DATA WITH ITS RIVALS. FOR MORE I'M JOINED BY TOM MACKENZIE. ALL THOSE COMING OUT TO TRY AND BUY CHROME WILL BE A LITTLE BIT DISAPPOINTED BUT WHAT DOES IT NEED TO DO INSTEAD TO SATISFY? TOM: THERE WILL THOSE DISAPPOINTED THAT IT IS NOT ON THE MARKET BUT THE UPSIDE IT'S COMING THROUGH FOR GOOGLE OF COURSE BUT ALSO APPLE AS WELL. I WILL GET TO THAT SHORTLY. THE ANALYST TO SEE IN THE PRICING PREMARKET AS WELL ARE TAKING THIS IS A WIN. FOR ALPHABET AND APPLE. CHROME THEY DO NOT HAVE TO SPEND THAT OFF. THEY HAVE TO SHARE SOME SEARCH DATA WITH SOME OF THEIR COMPETITORS SO MAYBE SOME UPSIDE THERE. OPENAI PROPENSITY BUT NOT ALL THE DATA JUST CERTAIN SEARCH DATA THEY WILL HAVE TO SHARE. THEY ARE NOT ALLOWED UNDER THIS ORDER TO STRIKE EXCLUSIVE AGREEMENTS WITH PARTNERS LIKE APPLE BUT THEY CAN STILL MAKE THOSE PAYMENTS. APPLES RECEIVED $20 BILLION PER YEAR FOR HOSTING CHROME AND OTHER GOOGLE SEARCH PRODUCTS ON THEIR IPHONES. $20 BILLION A YEAR THAT IS SIGNIFICANT. THERE IS A CLEAR WIN FOR APPLE. THOSE CONTINUE EVEN IF THE EXCLUSIVITY HAS BEEN ERODED BY THIS ORDER. THOSE ARE THE WINNERS BROADLY. AT THEY'VE BEEN SAYING IS IT'S CLEAR -- IT CLEARS A PATH FOR APPLE AND ALPHABET GOING FORWARD PARTICULAR WHEN YOU THINK ABOUT THESE TWO COMPANIES INTEGRATING MORE CLOSELY. APPLE'S STRUGGLE IN TERMS OF BUILDING ITS OWN AI PROPOSITION AND INCREASINGLY APPLE IS LOOKING AT EXTERNAL PARTNERS NOTABLY GOOGLE AND ITS GERMAN EYED MODEL TO INTEGRATE THAT SO FOR SOME IT CLEARS THAT PATH TO GROWTH AND INTEGRATION THE NEAR-TERM UPSIDE. AND THERE CAN CONTINUE TO PAY -- MAKE THESE PAYMENTS TO APPLE AND SHARE SOME DATA. THE WORST HAVE NOT COME THROUGH. > > IT MIGHT HELP BECAUSE IN OUT OF THE DEPARTMENT BLOOMBERG REPORTING ANOTHER RESEARCHER HAS SWAPPED APPLE FROM META. WHAT ARE THOSE DETAILS NOW. AARON: THIS IS A KEY RESEARCHER FROM THE ROBOTICS AT APPLE AND APPLE IS PUTTING A LOT OF FUTURE INTO ROBOTICS. SO THIS IS SIGNIFICANT FOR APPLE. IF ALL SO LOST ABOUT 10 MEMBERS OF ITS MODEL T. IT REALLY STRUGGLE TO HOLD ONTO THAT TALENT GOING TO META-ALSO OPENAI. THE KEY RESEARCHER FROM THE REPORT OF APPLE GOING TO MEDA. WE SEEN THAT, IN ONE CASE $200 MILLION FOR APPLE'S LEAD OVERSEEING THEIR FOUNDATION MODELS. THIS IS ANOTHER MEMBER OF THE APPLE TEAM MOVING TO MEDA. NOT HAVING THEIR OWN -- THEY FACE THEIR OWN CHALLENGES WHEN IT COMES TO TALENT. RECENTLY HIRING PAST FEW WEEKS ACCORDING TO REPORTING SO THE TALENT WARS CONTINUE IN THE ADJUSTMENTS AROUND WHERE THIS HEADCOUNT GOES CONTINUES. A REMINDER THAT APPLE IS REALLY THE CUTTING EDGE OF FACING THAT CHALLENGE. WHEN IT COMES TO THE CHALLENGE OF MAINTAINING THAT AND BUILDING OUT THOSE AI MODELS. WHICH IS WHY IT COMES BACK IT SO IMPORTANT THEY BE ABLE TO BUILD ON THAT RELATIONSHIP WITH GOOGLE AND GEMINI. > > THAT IS BLOOMBERG TECH EUROPE ANCHOR TOM MACKENZIE. TUNE INTO THE NEXT EPISODE OF BLOOMBERG TECH EUROPE THAT'S ON SEPTEMBER 12. TURNING TO OTHER KINDS NOW THE LAST LEG OF EARNINGS ON DECK WITH MACY'S CAMPBELLS AND DOLLAR TREE ALL SUCH A REPORT OVER THE MARKET OPEN. FOR MORE LET'S BRING IN GLOBAL BUSINESS REPORTER JENNIFER. LET'S FOCUS IN ON MACY'S. WHAT ARE INVESTORS LOOKING FOR IN RESULTS GIVEN TARIFFS HAVE BEEN AROUND FOR A LITTLE WHILE NOW? JENNIFER: I THINK THERE ARE THREE THINGS INVESTORS WILL BE LOOKING AT. THE FIRST IS WHETHER OR NOT THERE HAS BEEN IMPROVEMENT IN CONSUMPTION FROM THAT U.S. MIDDLE INCOME CONSUMER, A KEY FIGURE WE ARE LOOKING AT HIS COMPARABLE STORE SALES. ANALYST ESTIMATE 4.5% SEEING AN IMPROVEMENT FROM THE PREVIOUS QUARTER, BUT STILL SOME CHALLENGES AHEAD TO IMPROVE THAT DEMAND. SECONDLY WHETHER THERE HAS BEEN ANY CHANGE TO THE SALES GUIDANCE SO IN THE PREVIOUS SET OF RESULTS, MACY'S ESTIMATED THAT WILL STAY AT 21.4 BILLION USD SO OF COURSE YOU KNOW THEY HAVE A LOT OF NEAR-TERM VISIBILITY BECAUSE OF THOSE U.S. TARIFF CHANGES. MAKING IT HARD FOR COMPANIES TO PROJECT FORWARD. LASTLY TARIFFS OF COURSE. WHETHER THAT IS SQUEEZING MACY'S MARGINS EVEN FURTHER. MANAGEMENT SAYS IN THE PREVIOUS RESULTS THEY WILL HAVE TO INCLUDE VERY TARGETED PRICE INCREASES, SURGICAL WAS THE TERM THEY USE. VONNIE: THANK YOU SO MUCH JENNIFER WE WILL LOOK AT THOSE RESULTS BEFORE THE OPENING BELL. SHARES HIGHER IN THE PREMARKET. THANKS TO GLOBAL BUSINESS REPORTER JENNIFER QUERY. A GLOOM BIRD EXCLUSIVE. ANNMARIE HORDERN SPOKE ON THE STANDING WITH U.S. TRADE WAR BETWEEN -- TAKE A LISTEN. > > WE EXPLORE VERY LITTLE -- WE EXPORT VERY LITTLE TO THE UNITED STATES SO EVEN IF WE WERE HIT BY THE 50% OUR EXPORT WOULD NOT BE AFFECTED. ALL THE DEMANDS FOR OUR PRODUCT, IT WOULD NOT BE DIFFICULT TO RE-MANAGE. WE EXPORT TO THE UNITED STATES, WE LIKE THESE EXPORTS AND WE BUY A LOT OF THINGS FROM THE UNITED STATES AS WELL. AND WE WILL CONTINUE DOING THAT. > > THE PRESIDENT HAS ALSO PUT HIGH TARIFFS ON INDIA TRYING TO PRESSURE THEM TO STOP BUYING CRUDE FROM RUSSIA. COULD THAT BE AN OPPORTUNITY FOR MORE EXPORTS? > > INDIA FOR EXAMPLE IT INTRODUCES ITS SELF AND TO PETRO BRAS AS A PROCURER OF ANY PRODUCT WE WANT TO EXPORT AS A BUYER. SO WE USUALLY SAY NO. THE INDIAN SAY YOU ARE INCREASING YOUR OIL PRODUCTION, AND ANYTHING YOU WANT TO EXPORT MORE WE WILL BUY. WE EXPORT FOR EXAMPLE 24% OF RENEWABLES TO ASIA AND EVERY VESSEL THAT WE SEND TO ASIA SELLS A LOT. HIGH PERCENTAGES. SO WE KEEP LOOKING AT THAT AND LOOKING AT THIS INDUSTRY THAT IS GOING TO CONTINUE BEING RELEVANT FOR THE NEXT TWO TO THREE DECADES. AT THE SAME TIME WE NEED TO ENSURE ENERGY TRANSITION NEEDS TO TAKE PLACE IN BRAZIL AND WE NEED TO BE PART OF THAT. > > PRODUCTS WERE EXEMPT FROM THESE TARIFFS BUT HAVE YOU SEEN AN IMPACT ON SUPPLY CHAIN? HAVE COSTS GONE UP, HAVE PROJECTS BEEN DELAYED? MAGDA: SUPPLY CHAIN HAS BEEN AN ISSUE. FOR EXAMPLE WE HAVE GOODS THAT ARE NOT SHELF GOODS IN THESE GOODS NEED IN SEVERAL OF OUR PROJECTS AND WE HAVE SEEN SOME DELAYS IN DELIVERY, SO FOR EXAMPLE THINGS WE NEEDED -- EXPECTED TO ENSURE OUR REACHING THREE YEARS SO THIS IMPACTS SOME OF OUR PRODUCTS AS WELL. BUT I THINK PETROBRAS WITH REGARDS TO THIS DEMAND ANTICIPATED SO WE CAN BE MORE AND MORE AGILE FROM THE MARKET. VONNIE: THAT WAS THE PETROBRAS CEO SPEAKING TO ANNMARIE HORDERN IN AN EXCLUSIVE INTERVIEW FROM SAO PAULO. MORE EARNINGS ON DECK. WE WILL GET YOU SET UP FOR YOUR TRADING DAY. THIS IS BLOOMBERG. ♪ VONNIE: THIS IS BLOOMBERG BRIEF. NOW A LOOK AT WHAT'S AHEAD. EARNINGS BEFORE THE BELL FROM MACY'S PARADE DOLLAR TREE AND CAMPBELLS GIVE US A READING ON THE CONSUMER. THE FIRST OF THREE DAYS OF JOBS NUMBERS. WE ALSO GET FACTORY IN DURABLE GOODS ORDERS AT 10:00 A.M. EASTERN. THEN THE LATEST FED BEIGE BOOK AT 2:00 P.M. EASTERN TIME. TO SOME MICRO MOVERS. ALPHABET SHARES ON THE RISE. THE SEARCH GIANT AVOIDING A FORCED SALE IN ITS LATEST COURT RULING. APPLE SHARES UP ON THE SAME NEWS . TESLA BOUNCING BACK IN THE PREMARKET AFTER ELON MUSK SAID 80% OF HIS VALUE WILL COME FROM ITS OPTIMIST ROBOT. ALSO SANG IN THE PREMARKET WE ARE SEEING FUTURES MOVE HIGHER IN GENERAL. LET'S GET TO OIL BECAUSE WE ARE HEARING REPORTS THE WEEKEND MEETING MAY INCREASE SUPPLY. YOU CAN SEE BRENT CRUDE DOWN 1.6 PERCENT, AND WHY CRUDE DOWN 1.8 PERCENT. GOLD CONTINUING ITS SEVEN-DAY STREAK AS IT CONTINUES TO RISE. LET'S TAKE A QUICK LOOK AT THE BOND MARKET. SINGLES LONG AND YIELDS RISE CONSIDERABLY. WE ARE OBVIOUSLY SEEING IT IN THE UNITED STATES AS WELL BUT NOT AS MUCH AS EARLIER. THAT'S IT FOR BLOOMBERG BRIEF, SURVEILLANCE CONTINUES THE CONVERSATION RIGHT AHEAD. THIS IS BLOOMBERG. ♪",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "GLOBAL BOND MARKETS",
      "weight": 0.053868685
    },
    {
      "name": "MORE TIME",
      "weight": 0.05112008
    },
    {
      "name": "U.S. TREASURIES",
      "weight": 0.049259588
    },
    {
      "name": "U.S. PRESIDENT",
      "weight": 0.048652463
    },
    {
      "name": "U.S. EQUITY INDEX FUTURES",
      "weight": 0.047697645
    },
    {
      "name": "HIGH YIELD",
      "weight": 0.046684317
    },
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.04616622
    },
    {
      "name": "MORE EARNINGS",
      "weight": 0.04576093
    },
    {
      "name": "LONG DATA BONDS",
      "weight": 0.044741128
    },
    {
      "name": "HIGH YIELD SPREADS",
      "weight": 0.04443719
    }
  ],
  "topics": [
    {
      "name": "Antitrust"
    },
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.93017578125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.93017578125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.64794921875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.6103515625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.6015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.560546875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.51904296875
    },
    {
      "name": "/Law & Government/Legal/Business & Corporate Law",
      "score": 0.470703125
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.303955078125
    }
  ],
  "sentiment": {
    "positive": 0.45445326,
    "negative": 0.21216756,
    "neutral": 0.33337918
  },
  "summary": "Google has been denied the sale of its Chrome Business in a recent Antitrust Case, citing a 5.5% increase in its sales. This decision is seen as a significant setback for the global Bond Market. Other notable developments include YIELDS, JAPAN's 30-year YIELD UP ANOTHER SEVEN BASIS POINTS, and MACY's. Despite these setbacks, the Nasdaq FUTures have only risen by five to five%. Meanwhile, tech stocks like Apple are seeing an increase in sales due to a favorable agreement with Google's SEARCH BROWSer and the new Antitrict Ruling.",
  "shortSummary": "Google Avoids Chrome sale in Antitrust case, amid severe bond market issues and volatile stock markets, with significant gains expected in tech stocks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d1c372c97c6549a79fd478f24c251a90",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Global bond markets saw a selloff with U.S. 30‑year yields nearing 5%, while a U.S. judge ruled that Google need not sell its Chrome browser in an antitrust case, lifting pressure on the company and boosting its shares. Equity futures rebounded, and analysts noted that bond contagion is unlikely, with HSBC’s Max Kettner citing idiosyncratic factors. Clear Harbor’s Aaron Kettner projected five to six Fed rate cuts between now and December 2026. Petrobras CEO Magda Chambriard highlighted Asia’s role in offsetting U.S. trade war impacts. Overall, markets remain volatile amid policy and corporate developments.",
  "argos_id": "WYXLXM92C"
}