{
  "url": "https://www.androidauthority.com/samsung-galaxy-s25-fe-one-ui-8-3594366/",
  "authorsByline": "Adamya Sharma",
  "articleId": "c1eca0fc8fff412392939c1dfeb9e475",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2025/09/Samsung-Galaxy-S25-FE-showing-One-UI-8-installation.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T09:30:51+00:00",
  "addDate": "2025-09-04T09:47:23.583060+00:00",
  "refreshDate": "2025-09-04T09:47:23.583063+00:00",
  "score": 1.0,
  "title": "Stable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait",
  "description": "Samsung was reserving the stable One UI 8 update for its shiny new Galaxy S25 FE. Other Galaxy S25 flagships are still on the waiting list.",
  "content": "First off, apologies for that headline tease. I know Galaxy S25 series owners are counting the days until the Android 16-based One UI 8 update hits their phones, so this might sting a little. Yes, Samsung has finally kicked off the stable One UI 8 rollout for the S25 lineup, but there’s a twist. The very first device to get it isn’t the S25, S25 Plus, or even the S25 Ultra. Nope, it’s the newest family member: the Galaxy S25 FE.\n\nSamsung’s mid-range Fan Edition phone gets One UI 8 right out of the box, and we now know why everyone else with a Galaxy S25 series phone has had to wait this long for the update. Samsung probably just wanted the Galaxy S25 FE to be able to flex its shiny new software at launch. The company did things a little differently last year. The Galaxy S24 FE did not release with a new version of One UI. Instead, it launched with the same One UI 6.1.1 that Samsung used on other Galaxy S24 models at the time.\n\nThe good news is that Galaxy S25, S25 Plus, and S25 Ultra users won’t have to wait much longer to receive the One UI 8 update. Samsung has already promised a September rollout for the stable software, and the previously released S25 flagships will be first in line to get it. But before One UI 8 officially arrives on the rest of the Galaxy S25 series, Samsung is expected to bring a big monthly security update to the phones, which might come along any day now. This update could be over 1GB in size, so prepare your phones for it accordingly.\n\nMeanwhile, the Galaxy Z Fold 6, Galaxy Z Flip 6, and the Galaxy S24 series could also get the stable One UI 8 update once it starts shipping out more widely later this month.\n\nSamsung Galaxy S25 FE The Samsung Galaxy S25 FE is the mid-range experience for fans of the S25 series. Powered by an Exynos 2400 processor, this 6.7-inch phone offers better specs than ever in a FE phone, and nearly all of the greatness found in mainline S25 phones.",
  "medium": "Article",
  "links": [
    "https://clearbuy.com/redirect/3ae663194bada362a337d82f2c20eca56fda2df4?pId=6736&tag=androautho-20",
    "https://www.androidauthority.com/news/",
    "https://www.androidauthority.com/tag/samsung-galaxy-s25/",
    "https://www.androidauthority.com/tag/samsung-one-ui/",
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://www.androidauthority.com/galaxy-s25-one-ui-8-beta-6-3592286/",
    "https://www.sammobile.com/news/galaxy-s25-september-2025-update-could-be-big/",
    "https://www.androidauthority.com/tag/samsung/",
    "https://www.androidauthority.com/samsung-galaxy-s25-fe-specs-features-price-availability-3593945/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Galaxy S25 FE",
      "weight": 0.16555272
    },
    {
      "name": "Galaxy S25 series",
      "weight": 0.16399458
    },
    {
      "name": "Galaxy S25",
      "weight": 0.16297363
    },
    {
      "name": "Galaxy S25 series owners",
      "weight": 0.15490453
    },
    {
      "name": "mainline S25 phones",
      "weight": 0.14672175
    },
    {
      "name": "S25",
      "weight": 0.13199261
    },
    {
      "name": "S25 Ultra",
      "weight": 0.13195667
    },
    {
      "name": "S25 Plus",
      "weight": 0.13058339
    },
    {
      "name": "Stable One UI",
      "weight": 0.12163664
    },
    {
      "name": "One UI",
      "weight": 0.11675141
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8505859375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7314453125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.6337890625
    }
  ],
  "sentiment": {
    "positive": 0.30908215,
    "negative": 0.16135108,
    "neutral": 0.52956676
  },
  "summary": "Samsung has begun the One UI 8 rollout for the Galaxy S25 series, with the first device to receive the stable version of the software being the Galaxy F25 FE. The mid-range Fan Edition phone, which is powered by an Exynos 2400 processor, will also receive the update. However, Samsung is expected to also bring a monthly security update to the phones soon, potentially exceeding 1GB. The company has promised a September rollout for OneUI 8, with previously released S25 flagships expected to be first in line.",
  "shortSummary": "Samsung has launched the stable One UI 8 rollout for the Galaxy S25 series, with the first device receiving it in the mid-range Fan Edition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c718100909f140c2b0665bfe591ee905",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/galaxy-s25-one-ui-8-beta-6-3592286/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nSamsung inches closer to stable One UI 8 on Galaxy S25 with sixth beta\nAugust 28, 2025\n- One UI 8 beta 6 is now out for the Galaxy S25 series.\n- The update is now available in the UK, India, Germany, and Poland, with other regions expected to receive it soon.\n- Besides bug fixes, the latest One UI 8 beta brings September’s security patch.\nLess than two weeks after releasing the fifth One UI 8 beta that fixed the purple moon issue, Samsung is rolling out its sixth One UI 8 beta for the Galaxy S25. While it doesn’t add any evidently new features, the update brings a horde of bug fixes and changes aimed at improving usability.\nThe update weighs in at around 835MB and applies Google’s security patch for September 2025. Tipster Tarun Vats noted the update is rolling out in the UK and in Germany, while we are also seeing reports about the update being available in India and Poland. We can expect it to also be available in other eligible regions, such as the US and South Korea.\nAmong the most significant fixes, the latest One UI 8 beta update resolves the issue of incomplete lock screen notifications and rectifies rendering issues with fonts. It also fixes poorly loading logos for certain sports teams in Now Bar.\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more.\nApart from these fixes, the changelog also mentions a fix for the issue when the screen locks out when you’re using certain apps. The changelog, however, does not mention if the latest update brings the rumored Call Captions feature to the Galaxy S25 series.\nFinally, while the Galaxy S25 series has now received its sixth beta, other eligible devices, such as the Galaxy S24, have received just one beta update. We hope Samsung also rolls out subsequent updates for those models soon.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/samsung-galaxy-s25-fe-specs-features-price-availability-3593945/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nThe Galaxy S25 FE is finally here, and there's good and bad news\n1 hour ago\n- Samsung has launched the Galaxy S25 FE smartphone.\n- The phone has larger battery and faster charging than the S24 FE, but retains most other features.\n- The Galaxy S25 FE starts at $649 and goes on sale today.\nWe were expecting a new member of the Galaxy S25 series to be revealed today. Now, Samsung has made it official and finally pulled the curtain back on the Galaxy S25 FE.\nThose hoping for a giant leap forward in most areas might be disappointed, but the new phone still brings a few key hardware upgrades that make it stand out from the Galaxy S24 FE. Furthermore, the device also brings some software features previously seen on the Galaxy S25 series and Z7 foldables.\nGalaxy S25 FE hardware\nUnbox the new FE phone, and you’ll see a design that’s still similar to the Galaxy S24 FE. However, Samsung claims it’s using an “enhanced” Armor Aluminum frame in line with the Galaxy S25 series. It also says the phone is 7.4mm thin and weighs 190 grams, making it thinner and lighter than the previous device (8mm, 213 grams).\nAs for durability, the Galaxy S25 FE retains an IP68 rating and still uses Gorilla Glass Victus Plus on the front and back. In other words, you shouldn’t expect improved drop resistance compared to the previous phone.\nThe Galaxy S25 FE is a little slimmer and lighter than last year's phone, but that's about it from a design perspective.\nPop the hood and you’ll find an Exynos 2400 chipset. This is virtually identical to the Exynos 2400e used in the S24 FE. However, Samsung is apparently using a 13% larger vapor chamber cooling system. This should theoretically enable smoother performance during extended gaming sessions. Unfortunately, we’ve still got 8GB of RAM here. We’ve seen smartphone brands, including Samsung, offer more RAM in recent years due to on-device AI workloads. So I have to wonder whether the phone might miss out on some advanced AI features down the line.\nEven the screen seems identical to last year’s phone, namely a 6.7-inch FHD+ OLED panel with 1,900 nits of peak brightness. The panel offers a 120Hz refresh rate, but can only drop down to 60Hz. By contrast, the base S25 drops down to as low as 1Hz to save juice. We’ve still got an under-display fingerprint sensor here, but it’s unclear whether this is still an optical scanner or a more modern ultrasonic design. We’ve asked Samsung to clarify this.\nThankfully, the Galaxy S25 FE isn’t a complete recycle job. Easily the biggest hardware upgrades are the 4,900mAh battery and 45W wired charging. These both represent notable upgrades over the S24 FE’s 4,500mAh battery and 25W charging. It also means the phone has faster charging than the standard Galaxy S25. Samsung claims a 65% charge in 30 minutes, versus the S25’s 50% charge in 30 minutes.\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more.\nThe Galaxy S25 FE retains 15W wireless charging speeds, but Samsung says the phone is “Qi2 Ready” and can use magnetically attached accessories with the aid of a case. You’ll just have to pick up the Pixel 10 series (or HMD Skyline) if you want an Android phone with integrated magnets.\nSamsung still offers the same rear cameras as last year’s phone, namely a 50MP main camera (1/1.56-inch, OIS), a 12MP ultrawide lens, and an 8MP 3x telephoto camera. However, the company has switched from a 10MP selfie camera to the S25’s 12MP shooter.\nGalaxy S25 FE software: No waiting for One UI 8\nThe Galaxy S25 FE ships with Android 16 and One UI 8 out of the box, much like the Z Fold 7 and Z Flip 7 series. There are plenty of software enhancements here, with arguably the most notable additions being Now Bar and Now Brief support.\nNow Brief debuted on the S25 series and offers personalized briefings several times a day, covering the weather, news, calendar entries, and more. Meanwhile, Now Bar is a lock screen widget that displays contextual info, including music controls, sports scores, clocks, and timers. Samsung has since improved both features on One UI 8.\nGalaxy S25 FE: Hot or not?\nThe S25 FE also lets you use Circle to Search in games, much like the Galaxy Z Fold 7. Other notable software additions include Audio Eraser support, Generative Edit, Portrait Studio, Photo Assist, and Instant Slow-Mo functionality.\nFinally, Samsung is offering seven years of OS and security updates. That means you should get Android 23 and security updates until 2032. Only Google and HONOR match Samsung with their own update policies.\nSamsung Galaxy S25 FE pricing and availability\nKeen on this new FE handset? Then the Galaxy S25 FE starts at $649.99 / £649 for the 8GB/128GB model. Yep, Samsung is sticking with 128GB of base storage once again. Otherwise, Samsung is also offering an 8GB/256GB model for $709.99 / £699. The company is also offering an 8GB/512GB variant in the UK for £799, but it’s not listed for the US.\nYou don’t have to wait to get your hands on the device, either, as it goes on sale today (September 4). Expect to find the Galaxy S25 FE in Icyblue, Jetblack, Navy, and White color schemes. The phone also comes with six months of Google AI Pro, including 2TB of storage.\nIn any event, we’re glad to see Samsung offering a significant battery capacity boost and much faster wired charging. The release also comes over a month after the Galaxy A56 5G arrived in the US. So Samsung fans looking for a wallet-friendly phone have two more options to choose from.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nSamsung Galaxy devices get first dibs on powerful new Circle to Search feature\nCircle To Search's new Scroll and Translate feature lets you continuously translate text as you scroll or switch apps.\nAdamya Sharma\nRoborock already keeps the indoors clean, and now it's coming for your lawn\nStephen Schenck34 minutes ago\n0\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nAdamya Sharma1 hour ago\n0\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nZac Kew-Denniss1 hour ago\n0\nThe Galaxy S25 FE is finally here, and there's good and bad news\nIt's still got effectively the same chip as last year's phone, 8GB of RAM, and the same rear cameras.\nHadlee Simons\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nZac Kew-Denniss1 hour ago\n0\nSamsung announces incredibly thin Galaxy Tab S11 Ultra and a smaller Tab S11\nTushar Mehta1 hour ago\n0\nSamsung's TriFold isn't here yet, but its main rival just got a successor\nAamir Siddiqui2 hours ago\n0\nOur latest\nThis guy made his own slider phone out of a broken Z Flip 5 and BlackBerry keyboard\nHadlee Simons3 hours ago\n0\nHere's how you can watch Samsung's September 'Galaxy Event' later today\nAdamya Sharma3 hours ago\n0\nFrom Battery Health to fingerprint unlock, Google just fixed a lot on your Pixel\nAdamya Sharma8 hours ago\n0\nMotorola Razr 2025 drops back to its all-time low price of $600\nEdgar Cervantes12 hours ago\n0\nThe Ampace Andes 1500 Power Station falls to its record-low price\nEdgar Cervantes13 hours ago\n0\nHot deal: Samsung Galaxy S25 Edge plummets to new record-low price, saving you $400!\nEdgar Cervantes14 hours ago\n0\nGboard's new AI Writing Tools are coming to more Android phones\nMishaal Rahman16 hours ago\n0\nSamsung Health levels up with virtual doctor visits, on-demand workouts, and more\nRyan McNeal16 hours ago\n0\nEarbud sharing begone: Pixel phones now have proper support for Auracast\nHadlee Simons17 hours ago\n0\nGoogle's beloved Androidify app is back with new features for making your own Android Bot\nMishaal Rahman17 hours ago\n0\nYour Pixel Watch is getting true hands-free Google Maps navigation\nMatt Horne17 hours ago\n0\nThe September Pixel Drop is here with Material 3 Expressive for all!\nAdamya Sharma17 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung-galaxy-s25/",
      "text": "Pages tagged:\nSamsung Galaxy S25\n5 Android phones you should buy instead of the Google Pixel 10 Pro\nI love the Pixel 10 Pro, but these other phones are also worth keeping in mind.\nJoe Maring13 minutes ago\n0\nAdamya Sharma42 minutes ago\n0\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nPixel 10 benchmarks show how little ground Google's Tensor G5 has gained\nRobert TriggsSeptember 1, 2025\n0\nWhy spend more? You can get the Samsung Galaxy S25 at a record-low price!\nEdgar CervantesAugust 27, 2025\n0\n5 Android phones you should buy instead of the Google Pixel 10\nJoe MaringAugust 25, 2025\n0\nTrump Mobile's latest T1 phone teaser fails to hide an epic Photoshop blunder\nTushar MehtaAugust 22, 2025\n0\nPixel 10 Pro vs Galaxy S25 Ultra: I know which one I’d get\nAndy WalkerAugust 20, 2025\n0\nGoogle Pixel 10 vs Samsung Galaxy S25: The choice is clear for me\nCalvin WankhedeAugust 20, 2025\n0\nGoodbye purple moons: One UI 8 beta 5 hits the Galaxy S25\nRyan McNealAugust 19, 2025\n0\nSamsung's latest One UI 8 beta is causing a hilarious moon-related camera glitch\nRyan McNealAugust 12, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung/",
      "text": "Pages tagged:\nSamsung\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nSamsung was reserving the stable One UI 8 update for its shiny new Galaxy S25 FE.\nAdamya Sharma33 minutes ago\n0\nZac Kew-Denniss33 minutes ago\n0\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nThe Galaxy S25 FE is finally here, and there's good and bad news\nHadlee Simons33 minutes ago\n0\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nZac Kew-Denniss33 minutes ago\n0\nSamsung announces incredibly thin Galaxy Tab S11 Ultra and a smaller Tab S11\nTushar Mehta34 minutes ago\n0\nHere's how you can watch Samsung's September 'Galaxy Event' later today\nAdamya Sharma3 hours ago\n0\nHot deal: Samsung Galaxy S25 Edge plummets to new record-low price, saving you $400!\nEdgar Cervantes14 hours ago\n0\nSamsung Health levels up with virtual doctor visits, on-demand workouts, and more\nRyan McNeal16 hours ago\n0\nLast-minute leak spoils Samsung's Galaxy Tab S11 surprise\nAman Kumar24 hours ago\n0\nThis clever trick can help you find a lost or stolen Samsung phone. Here's how it works\nJoe MaringSeptember 3, 2025\n0"
    },
    {
      "url": "https://www.sammobile.com/news/galaxy-s25-september-2025-update-could-be-big/",
      "text": "Massive Galaxy deals! Galaxy Fold 7, Flip 7, S25 Ultra and Watch Ultra 2025\nLast updated: September 1st, 2025 at 07:37 UTC+02:00\nSamMobile has affiliate and sponsored partnerships, we may earn a commission.\nIt's not One UI 8.0, for those wondering.\nReading time: 2 minutes\nSamsung is reportedly preparing a big software update for the Galaxy S25 series. But it's not the one everyone's waiting for. We learned recently that the official One UI 8 (Android 16) rollout will begin after Samsung rolls out a regular monthly update for the Galaxy S25 series, and this monthly update may be over 1GB in size.\nSamsung doesn't usually reveal anything about monthly updates in advance, so it's pretty much impossible to ascertain what we will get with this upcoming firmware. All we can be sure of is that it will come with a new security patch.\nThis won’t be the first time the S25 series receives a 1GB+ update without a new Android/One UI version. The same happened back in June this year, when a 1.2GB update was released with a vague changelog that simply said the “usability of device operations has been improved.”\nIt’s also unclear why Samsung would have a big update planned for the Galaxy S25 series when the One UI 8 update is supposed to arrive this month. Furthermore, it remains to be seen when the rollout will actually begin. Fingers crossed it won’t take too long, because the later this monthly update comes, the longer we’ll end up waiting for One UI 8.\nAbhijeet's writing career started with guides for custom firmware for Samsung devices (including the original Galaxy S), and he moved to SamMobile in mid-2013 and worked up the ranks to Editor-in-chief. In addition to phones and mobile devices, his interests include gaming on both PC and console, PC hardware, and spending countless hours on YouTube watching videos on tech, movies, games, politics, and internet dramas.\nTrending"
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung-one-ui/",
      "text": "Pages tagged:\nSamsung One UI\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nSamsung was reserving the stable One UI 8 update for its shiny new Galaxy S25 FE.\nAdamya Sharma1 hour ago\n0\nZac Kew-Denniss1 hour ago\n0\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nZac Kew-Denniss1 hour ago\n0\nGalaxy Z Fold 5, Flip 5 owners are get their first taste of One UI 8\nHadlee SimonsSeptember 2, 2025\n0\nOne UI 8 beta arrives on Galaxy S23 and Samsung's popular A-series phones\nTushar MehtaSeptember 1, 2025\n0\nSamsung's take on Pixel Screenshots is finally available to global users\nRyan McNealAugust 29, 2025\n0\nThe latest One UI 8 beta finally brings Now Brief to Galaxy S24 series\nHadlee SimonsAugust 29, 2025\n0\nSamsung inches closer to stable One UI 8 on Galaxy S25 with sixth beta\nTushar MehtaAugust 28, 2025\n0\nJust bought a new Galaxy foldable? Watch out for this alert-hiding bug\nMatt HorneAugust 25, 2025\n0\nNot just phones and TVs: Samsung is bringing 7 years of updates to more devices\nHadlee SimonsAugust 25, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    }
  ],
  "argos_summary": "Samsung has begun the stable One UI 8 rollout for the Galaxy S25 FE, the first device in the S25 lineup to receive the update out of the box. The rest of the S25 series—S25, S25 Plus, and S25 Ultra—are slated for a September rollout, with a large monthly security update expected beforehand. Samsung also plans to extend One UI 8 to the Galaxy Z Fold 6, Z Flip 6, and the S24 series later this month. The S25 FE ships with Android 16 and includes new features such as Now Bar and Now Brief, while the broader S25 line will receive the update shortly after the security patch is released.",
  "argos_id": "XBHD05UM2"
}