{
  "url": "https://www.searchenginejournal.com/ask-a-ppc-how-do-i-avoid-cannibalization-on-similar-products/552194/",
  "authorsByline": "Navah Hopkins",
  "articleId": "7aa1e0b149574ab2a3006108290aabdd",
  "source": {
    "domain": "searchenginejournal.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Broward County",
      "city": "Deerfield Beach",
      "coordinates": {
        "lat": 26.318342,
        "lon": -80.0996306
      }
    }
  },
  "imageUrl": "https://www.searchenginejournal.com/wp-content/uploads/2024/06/ask-a-ppc-navah-197.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T12:30:21+00:00",
  "addDate": "2025-08-07T12:35:58.286744+00:00",
  "refreshDate": "2025-08-07T12:35:58.286745+00:00",
  "score": 1.0,
  "title": "Ask A PPC: How Do I Avoid Cannibalization On Similar Products?",
  "description": "Avoid bidding wars between your own products. Let's explore how to manage overlap, reduce CPCs, and improve campaign efficiency.",
  "content": "There’s nothing worse than watching your own products compete against each other.\n\nWhen your paid media strategy starts pitting your product lines against one another, you’re not just inflating costs; you’re undercutting your own chances at conversion.\n\nThat’s the question this month’s “Ask A PPC” will tackle:\n\n“I work for a company that has three brands in the same niche with a high ticket item for house renovation. All companies have high spend on search ads, but we are targeting the same keywords and we are seeing cannibalization. What can we do with our bidding strategy to try and reduce our CPC and still compete on the same products/keywords, but not cannibalize each other?”\n\nLet’s break down how to avoid keyword cannibalization, particularly when dealing with premium products, and how to structure campaigns in a way that keeps everything working together.\n\nThe Hard Truth: You Can’t Avoid All Cannibalization\n\nLet’s start here because this is what no one wants to hear: If you’re targeting the same non-branded keywords, the same geographies, and similar audiences with similar value props, some level of internal competition is inevitable.\n\nSearch campaigns don’t know your product lines are siblings. All they see are bids, relevance scores, and conversion data. Some keywords/ads will win. Some won’t.\n\nThe goal is to mitigate the internal crossfire and make strategic decisions that give every product its best shot to shine.\n\nPrioritize: Which Products Get Which Keywords?\n\nWe don’t like to play favorites with our products, but when it comes to generic, high-volume keywords, you might have to.\n\nUnless you have contractual obligations to spend equally across product lines (try to avoid this), you’ll need to assign certain non-branded queries to one product or another.\n\nHere’s how you can do it:\n• Segment by market: Allocate geographic zones to different products based on performance trends, sales reps, or product-market fit.\n• Use keyword research as a compass: Both Google’s and Microsoft’s keyword planners can show you which search terms have better affinity with which product.\n• Establish thematic lanes: If Product A is more “entry-level” and Product B is the “pro version,” let them own different stages of the funnel.\n\nOne workaround, especially with Dynamic Search Ads (DSA) and Performance Max (PMax), is to avoid pushing people directly to product pages. Instead, drive them to category or collection pages.\n• It gives consumers options without forcing them to pick one.\n• You can still control targeting and ad creative at the campaign or asset group level.\n• It creates a more balanced distribution of visibility without inflating cost-per-click (CPCs) by bidding on the same SKUs.\n\nDSAs and PMax campaigns do this particularly well. You’re not bidding on keywords in the traditional sense; you’re letting Google’s (or Microsoft’s) AI determine which queries to match based on content and intent.\n\nOn Google, AI Max lets you guide that intent more narrowly through ad group-level settings.\n\nOn Microsoft, PMax can do something similar, especially if you feed it clean, structured data and lean into visual creative.\n\nYou likely already have branded campaigns in place, and if you don’t, this is an important go do.\n\nBranded search and Shopping should ensure that anyone looking for a specific product by name sees only that product. This is where you can (and should) be strict about campaign segmentation.\n\nBranded campaigns give you clean performance data, protect your CPCs from cannibalization, and provide the clearest attribution path.\n\nThis is where platforms like Google Demand Gen and Microsoft Audience Ads really shine.\n\nVisual content lets you sidestep keywords altogether and lean into product storytelling. You can target by interest, topic, or custom segments – not search intent – which means you can:\n• Run one campaign per product and assign each a budget.\n• Or run one big campaign and let the creative guide user choice.\n\nYou can use PMax here, too, especially on Microsoft, where PMax makes it more likely to secure Copilot placements across mobile and desktop.\n\nCopilot has been shown to have 25% more relevancy than traditional search, according to Microsoft internal data.\n\nThe key is to treat these upper-funnel plays as audience builders. Then, once users engage, you can segment them with remarketing across both platforms.\n\nPro tip: On Microsoft, even just an impression is enough to build an audience. Which means your remarketing and exclusions can get very precise, very quickly.\n\nSo long as there’s at least one audience ad campaign in your impression-based remarketing sources, you can allow PMax to remarket to PMax and Search/Shopping to remarket to Search/Shopping, i.e., you can capture intent from Copilot even if they didn’t engage with you there.\n\nDoes This Really Solve Cannibalization?\n\nThe only surefire way to fully prevent cannibalization would be to run entirely separate ad accounts, one per product. But that opens up a Pandora’s box of compliance risks.\n\nGoogle and Microsoft are both very aware of efforts to double-serve, and if they perceive your accounts as trying to game the system – even if you’re just trying to stay organized – you could end up suspended.\n\nSo instead, your best move is to manage the overlap, not eliminate it. Focus on:\n• Using geographic and thematic separation when assigning generic keywords.\n\nWhen done right, the consumer makes the final decision, not your CPC strategy. That’s not cannibalization. That’s just a user choosing which of your great products fits their needs best. And either way? You win.\n• Smart segmentation of campaigns by geography, theme, and intent, helps mitigate overlap.\n• Category pages + visual ads can guide consumers to the right product without inflating CPCs.\n• Branded campaigns are your best friend; keep them clean, tight, and product-specific.\n• Audience-based targeting gives you control without competing on search terms.\n\nAt the end of the day, your campaigns should reflect how your users shop: exploring, comparing, deciding. Make that process easier for them, and less expensive for you.\n• How To Avoid Search Budget Cannibalization For A Better Share Of Spend",
  "medium": "Article",
  "links": [
    "https://www.searchenginejournal.com/demand-generation-vs-lead-generation/546992/",
    "https://www.searchenginejournal.com/paid-media-types-examples/473959/",
    "https://www.searchenginejournal.com/google-performance-max/498283/",
    "https://www.searchenginejournal.com/ppc-trends/",
    "https://www.searchenginejournal.com/find-keyword-cannibalization-using-openai-text-embeddings-examples/520274/",
    "https://www.searchenginejournal.com/mastering-ai-powered-ppc-bid-strategies-guide-to-maximizing-performance/518101/",
    "https://www.searchenginejournal.com/marketing-attribution/477573/",
    "https://www.searchenginejournal.com/how-to-avoid-search-budget-cannibalization-for-a-better-share-of-spend/494903/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Similar Products",
      "weight": 0.09375664
    },
    {
      "name": "product lines",
      "weight": 0.092665516
    },
    {
      "name": "different products",
      "weight": 0.09080633
    },
    {
      "name": "product",
      "weight": 0.09074817
    },
    {
      "name": "product pages",
      "weight": 0.09074214
    },
    {
      "name": "premium products",
      "weight": 0.08848384
    },
    {
      "name": "product storytelling",
      "weight": 0.08731003
    },
    {
      "name": "Search campaigns",
      "weight": 0.083904676
    },
    {
      "name": "keyword cannibalization",
      "weight": 0.08015873
    },
    {
      "name": "Branded campaigns",
      "weight": 0.07406929
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Advertising & Marketing/Marketing",
      "score": 0.8212890625
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Other",
      "score": 0.5498046875
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.5126953125
    }
  ],
  "sentiment": {
    "positive": 0.18164062,
    "negative": 0.31201172,
    "neutral": 0.50634766
  },
  "summary": "The article discusses how to avoid keyword cannibalization on similar products, particularly premium products, and how to structure campaigns to keep everything working together. The article suggests that if companies are targeting the same non-branded keywords, geographies, and similar audiences, internal competition is inevitable. However, the goal is to avoid this internal crossfire and give every product its best chance to shine. Segment by market, use keyword research to identify which search terms have better affinity with which product. Prioritize certain non-brand queries to one product or another and create a balanced distribution of visibility without inflating cost-per-click (CPCs) by bidding on the same SKUs. Avoid pushing people directly to product pages, giving consumers options without forcing them to pick one. Use Dynamic Search Ads (DSA) and Performance Max (PMax) to create this balance.",
  "shortSummary": "How to avoid keyword cannibalization on similar products by segmenting and strategically positioning campaigns effectively, reducing CPCs, but ultimately enhancing conversion chances through targeted advertising strategies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5fe80540f54448baa2a4a7fbc1d50cd0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.searchenginejournal.com/how-to-avoid-search-budget-cannibalization-for-a-better-share-of-spend/494903/",
      "text": "In nearly 20 years in search marketing, something I continue to see and debate about is shared budgets.\nWhen I ask the advertiser why, I always get a similar answer: “We have a set limited budget, and this is the best way for us to fund everything.”\nOr, the one that truly pains me: “The engine sent me a rep for the fiscal quarter who recommended it along with a portfolio bid strategy to let it all work together.”\nThat is a response I get from mom-and-pop operations and SMBs, all the way up to major holding company ad agencies and Fortune 100 enterprise brands (if you fall into the latter and you went with the platform recommendation without questioning it, shame on you).\nThe reality is that sometimes this approach works fine, and other times, you are inadvertently shooting yourself in the foot, as your shared spend ends up limiting your potential return.\nThe Situation\nA shared budget (often called a portfolio budget) does, in fact, help bandwidth-strapped operations (i.e., literally every marketing team on Earth) avoid overspending in a single engine. It can also complement a portfolio bid strategy in some scenarios positively.\nHowever, a shared budget rewards the high-volume or high-demand elements first.\nIt’s essentially like attempting to work in the front office of the NY Jets – those who come in fast and with deep pockets get big-name players (who often don’t pan out), and everyone else loses out (especially the fans).\nThe Impact\nPairing a shared budget is cute until you realize you have a low conversion rate-producing campaign that has a high volume in traffic, sharing a budget with a campaign that has a low demand in traffic but is producing a high conversion rate.\nOr, god forbid, you share a budget across campaigns that have different bid strategies or across different channels such as video and search (if you are mentally saying you’re doing this now, then you have messed up #ChangeMyMind).\nThus, the underproducing but high-volume campaign will take a disproportionate amount of the budget based on daily demand, potentially diminishing the opportunity or amount of time the high-producing campaign can show (as viewed in Impression Share and Impression Lost to Budget).\nThis is referred to as internal budget cannibalization.\nOr when one entity takes a disproportionate amount of the total allotted budget against the entities with which it shares the funds.\nThis, in turn, reduces the aggregate performance (which can only be looked at as aggregate because they share the budget) of the campaigns sharing the budget.\nTo put this in a different perspective: This is like claiming all New York NFL teams are the best because the Jets and Giants combined have won five championships, but the Chiefs have only won four.\nNY shares an NFL affiliation and has historical positive performance, but that can override recent positive performance of the Chiefs (assuming these two things were actually search campaigns sharing a budget and not pro football teams).\nThe Fallout\nIf you’ve read any of the above, this should be fairly straightforward, but to lay it out nicely: You treated two campaigns like they were equals and told them to share some money evenly.\nThis potentially will have left you with a missed opportunity for traffic and conversions.\nIf you share a budget between campaigns that have different themes (brand vs. non-brand), channel goals (search vs. video), or objectives (traffic vs. conversions), the problems will be immediately amplified.\nThe Fix\nI should note that every operation is different. Some may not fall into this scenario, and some will – I see it more often in smaller agencies and brands strapped for bandwidth.\nMy personal preference, and I exercise this approach whenever I can, is to have standalone, daily budget caps for the individual campaign.\nNote: I said daily. If this campaign is ongoing or evergreen, don’t use a campaign total; it’ll become a pain in the butt for you later. Only use campaign total for short campaign flights with predefined end dates.\nFrom there, I work manually to keep the budgets fluid between campaigns – meaning that I will manually shift funds between campaigns. If one is outperforming another and can take on more budget, then I will make the necessary shift.\nWe make decisions on budget migration through manual tracking (which I prefer, though there are plenty of ways to do it) of spend pacing. I like to do this daily as it keeps us fresh, but you’ll know the right interval for your team.\nThen, compare the campaigns against which campaigns are meeting or exceeding our objectives vs. those that are underproducing against the objectives.\nWhen Are Shared Budgets Appropriate?\nThis is a bit subjective, but there are times when it can become appropriate.\nOne of the more common ones is when you’ve split your campaigns by devices (i.e., Campaign 1 is mobile-only, and Campaign 2 is desktop-only).\nHere, presumably, the keywords, assets, and targeting are all the same, but it just so happens you have a justified reason to split the campaigns. So, having the campaigns share a budget is fine.\nBut you should closely monitor performance, as mobile often takes the lion’s share of traffic and may cause campaign cannibalization of desktop. (This was less of a problem back in the day when mobile cost per click (CPC) was significantly lower than desktop, but 55%-65% of the total traffic.)\nThis can also be applicable when multiple campaigns have the same assets and targeting but are splintered by match type at the campaign level – which, believe it or not, is still a common practice.\nA shared budget works fine, and in theory, it would replicate the situation if you split the match types in a single campaign but at the ad group level.\nThe only caveat is that broad match will need to be watched like a hawk, as that often tends to be a driving force of search volume.\nAnother one is when using a portfolio bid strategy. When a group of campaigns share a single goal, and there is no disproportionate demand in volume, they can be put into a shared bid strategy.\nThis is a time when using a shared budget makes sense, as all elements are working together for a common goal (sort of like a Performance Max approach with the different ad units).\nThe Takeaway\nFirst, a friendly reminder that shared budgets aren’t even applicable to all campaigns (i.e., campaigns in experiments or Performance Max don’t qualify to use them).\nNext, if you are using shared budgets: Before you go and make changes to opt out of them after reading this inspirational article, you must first do some analysis.\nIn campaigns using a shared budget, look at things like:\n- Is one campaign considerably outperforming another one in terms of return?\n- Is one campaign consuming a disproportionate amount of the budget (and not the top performer of those who share the budget)?\n- Do you have the bandwidth to manage and maintain individual campaign budgets? Always calculate the cost of manpower when doing return analysis.\n- If they have a portfolio bid strategy, is the budget also shared?\nIf you do use shared budgets, make sure you account for the following (this is going to sound like a broken record, but deal with it):\n- Brand and non-brand have different volume, different efficiency, different cost. If they are separated at the campaign level, then they shouldn’t share a budget.\n- “Church and State Separation”: Display, Search, Shopping, and Video are different channels, are measured different ways, and serve different purposes. Therefore, sharing a single budget across channel types will lead to cannibalization.\n- Make sure the campaigns you share budget for, have the same objective: traffic, conversions, etc.\nIf you’ve done this, and decided it would benefit you to try an individual budget over a shared one, then absolutely proceed and test it out.\nJust keep in mind that you may see an improvement in your target campaign but run the risk of an adverse impact on the other campaigns that shared the budget.\nHappy search marketing!\nMore resources:\n- Keyword Match Types Still Matter (Phrase & Exact Match Are Not Obsolete)\n- Agile Budgeting: What It Is, Why It’s Impactful, And How To Make It Work For You As A Marketer\n- PPC Trends 2025\nFeatured Image: Vitaly_Vision/Shutterstock"
    },
    {
      "url": "https://www.searchenginejournal.com/paid-media-types-examples/473959/",
      "text": "Paid media is often treated like a checklist item in a marketing plan: launch a few search ads, run a Meta campaign, maybe test YouTube if there’s budget left.\nBut not all paid media is created equal, and treating every channel the same is a fast way to burn through budget with little to show for it.\nWhether you’re working in-house or managing campaigns for clients, understanding the different types of paid media (and what each one is actually good for) can help you prioritize the right tactics, set realistic expectations, and answer the dreaded question: “What are we getting out of this?”\nThis article breaks down the main types of paid media with real-world examples so you can make smarter decisions about where to spend your money.\nWhat Is Paid Media?\nPaid media is any type of marketing where you pay to get in front of your audience. That includes things like search ads, social ads, display banners, video pre-roll, and even influencer sponsorships.\nWhile paid media is often used interchangeably with the term cost-per-click (CPC), it’s important to note the differentiation.\nIt’s the part of your marketing strategy that gives you scale and control. You’re not waiting for someone to discover your blog post or share your Instagram reel organically.\nYou’re putting money behind your message to drive attention right now.\nPaid media works best when it’s tied to a clear goal, like driving leads, sales, or downloads. Without a strategy, it’s just noise with a price tag.\nThe Difference Between Earned, Owned, And Paid Media\nThink of paid, owned, and earned media as different ways to get your message out. You need a mix of all three, but each serves a different purpose.\n- Paid media is when you pay for attention. Think of tactics like search ads, social ads, sponsored posts, affiliate placements, etc.\n- Owned media is what you control. Think of assets like your website, blog, email list, and social channels.\n- Earned media is what others say about you. This often comes in the form of reviews, PR coverage, social shares, and more.\nSome examples of earned media include:\n- Social sharing from customers.\n- Customer reviews.\n- External media coverage (public relations).\nOwned media examples include:\n- Your website.\n- Social media channels.\n- Blog posts.\nThe overlap matters, too. A paid campaign might drive traffic to a landing page (owned media), which then gets shared by a happy customer (earned media). When these channels work together, your efforts go further.\nTypes Of Paid Media Channels\nNow that we’ve identified the definition of paid media, let’s take a look at the different types of paid media channels and the purposes they serve.\nBefore we dive into the different paid media channels, it’s also important to note the difference between ad formats and ad channels.\nAd formats are the type of ads shown in a particular channel. An ad format example could be:\n- Search ad.\n- Shopping ad.\n- Video ad.\n- Display ad.\n- Banner ad.\nSo, while ad formats are important and will depend on the channel, below we will focus on the channels themselves.\nThere are other types of paid media channels available that are not listed here, such as more traditional methods like direct mail or billboards. These paid media channels have a more physical presence.\nHere, we will focus on digital channels.\nPaid Search\nPaid search puts your ads at the top of search results for specific keywords. It’s often the first paid channel marketers try because it targets people already looking for what you offer.\nPlatforms like Google Ads and Microsoft Ads let you bid on search terms so your ad shows when someone types in something relevant.\nGoogle is the leading search engine in market share, with its sites generating 60.4% of user searches in the United States.\nIt’s high-intent, measurable, and scalable. But, it’s also competitive, especially in industries like legal, finance, or ecommerce.\nSuccess here depends on more than just bidding. Your landing page, ad copy, keyword match types, and conversion tracking all matter. You’re not just paying for clicks – you’re paying for the opportunity to convert interest into action.\nPaid Social\nPaid social platforms let you reach people based on who they are, not just what they search.\nMany of the platforms offer detailed targeting based on demographics, interests, behaviors, and even job titles.\nSome of the most common paid social platforms include:\n- Meta (Facebook).\n- Instagram.\n- LinkedIn.\n- TikTok.\n- Pinterest.\n- Snapchat.\n- X (Twitter).\nThe most common ad format in social channels is placed within a user’s newsfeed as they scroll. These ads will either consist of one (or more) static images or a video as the main visual.\nIt’s not just about brand awareness. Many brands use social to drive signups, sales, or downloads. You can run video ads, carousels, static images, or Stories, depending on what fits your brand and goal.\nSome paid social platforms are more beneficial for B2B companies than for B2C brands.\nFor example, LinkedIn advertising consists mainly of B2B brands marketing their product or service to other professionals.\nOther platforms like TikTok and Snapchat may be better suited for B2C or ecommerce brands.\nThe tricky part? Creative fatigue is real.\nIf you’re not refreshing your assets often or testing different hooks, performance will drop fast. Social ads require constant iteration, but the upside is speed: you can test ideas and get feedback quickly.\nProgrammatic & Display\nDisplay advertising is what most people think of as “banner ads.” These are the visual ads you see on news sites, blogs, or apps, usually managed through platforms like the Google Display Network or programmatic buying platforms.\nThe upside is scale. You can reach millions of people across the web without relying on social platforms. The downside? Banner blindness is real. If your creative isn’t compelling, people will scroll right past.\nThat’s why display works best for remarketing or supporting a broader campaign. Use it to stay top of mind, promote limited-time offers, or drive awareness ahead of a product launch. Just don’t expect cold traffic to convert on the first click.\nAffiliate Marketing\nAffiliate marketing is a way to scale your reach by letting others promote your product for you. You only pay when they drive a sale or lead, which makes it one of the lowest-risk paid media options available.\nThis model works especially well in industries like fashion, tech, travel, and finance, where bloggers, influencers, or content sites already have built-in audiences.\nThe key to making affiliate work? Vet your partners. A bunch of low-quality traffic from coupon sites won’t move the needle.\nLook for affiliates who create content, have authority, or drive meaningful referral traffic.\nAnd keep an eye on attribution. Affiliate-driven sales often overlap with other paid efforts, so tracking needs to be tight.\nExamples Of Paid Media\nThis is where the ad formats are married to the paid media channels.\nBelow are examples of paid media ads from the popular channels listed above. These examples can help provide context when deciding what types of paid media to run.\nSearch Examples\nWhen searching for [top parental control apps] in Google, the first three positions are examples of search ads.\nWhile conducting the same search on Microsoft Bing, the ads look slightly different.There’s even a section above the sponsored ads showcasing different brands and a brief description about what they do.\nWhen searching for a product like [nike shoes for women], the ads below are a shopping ad format.Paid Social Examples\nEach social platform’s ad formats look different within their respective newsfeeds.\nHere is a LinkedIn newsfeed example:\nA Facebook ad newsfeed example:\nInstagram also offers ads in its “Stories” placement. An example from Fountainhead is below:\nDisplay Examples\nDisplay ads can be in all shapes and sizes, depending on the website or app.\nBelow is an example of two different display ads shown on one webpage.\nAffiliate Examples\nSometimes, affiliate ads can be difficult to spot.\nFor example, “Listicle” articles, where a publisher is paid by other brands to be included in a “Top” product article.\nHowever, if you take a closer look at this example’s “Advertising Disclosure,” you’ll notice that this publisher is paid by the brands for exclusive placement:\nSummary\nPaid media doesn’t have to be a guessing game. When you understand the role each channel plays, you’re in a much better spot to build campaigns that actually drive results, not just impressions.\nFrom keyword-targeted search ads to affiliate partnerships and social retargeting, each paid media type has its own strengths. Use them deliberately.\nThink about where your audience is, how they like to interact, and what action you want them to take.\nRemember: success isn’t just about being present on every channel. It’s about showing up with the right message, in the right place, at the right time.\nMore resources:\n- A Complete Guide To PPC Ad Targeting Options\n- PPC And Paid Media Budget Planning Tips For 2025\n- PPC Trends 2025\nFeatured Image: Lana Sham/Shutterstock"
    },
    {
      "url": "https://www.searchenginejournal.com/ppc-trends/",
      "text": "AI, automation, and privacy changes bring significant disruptions and opportunities to PPC marketing. What’s on the horizon for 2025?\nPPC Trends is back for its seventh edition, packed full of ways you can adapt to the rise of AI and automation based on what we’ve seen this year.\nWith trend analysis from seven of the top PPC experts, this year’s edition will help you build your PPC strategy, so you won’t get left behind in 2025.\nYou’ll get insights into:\n- AI in PPC platforms and how you can use it effectively.\n- The never-ending third-party cookie dance, and where it’s headed.\n- Actionable insights for streamlining your workflows.\n- The crucial balance of AI and privacy.\nIn this guide, industry experts explore the challenges and opportunities presented by the onslaught of AI tools, and provide actionable tips for thriving amid these shifts.\nOur contributors include:\n- Menachem Ani, Founder & CEO, JXT Group.\n- Andrea Atzori, Director, Ambire.\n- Navah Hopkins, Evangelist, Optmyzr.\n- Ameet Khabra, Founder, Hop Skip Media.\n- Brooke Osmundson, Director of Growth Marketing, Smith Micro Software, Inc.\n- Kirk Williams, Founder & Owner, ZATO PPC Marketing.\n- Ben Wood, Performance Director, Hallam.\nGet a head start for the year ahead. Download your copy of PPC Trends 2025 today!"
    },
    {
      "url": "https://www.searchenginejournal.com/mastering-ai-powered-ppc-bid-strategies-guide-to-maximizing-performance/518101/",
      "text": "Let’s talk about PPC bidding strategies. If you’ve ever felt like you’re throwing darts in the dark when it comes to picking the right one, you’re not alone.\nWhen I first started in Google Ads, the only bidding strategy available was “Max CPC” bidding, meaning everything was manual.\nNowadays, there are many AI-powered bidding strategies to fit your diverse campaign needs.\nThese strategies aren’t exactly a “one size fits all” deal for your campaigns.\nNot only are there more choices than ever to reach your goals, but the inputs you set at the campaign level are just as crucial for success.\nThe truth is that choosing the right bid strategy can be the difference between crushing your PPC goals or watching your budget go up in flames.\nLet’s dive into the nitty-gritty of AI-powered bid strategies, or Smart Bidding strategies, and figure out how to maximize performance for each of your campaigns.\nHow Many PPC Bid Strategies Does Google Ads Have?\nGoogle Ads offers multiple types of bidding strategies aimed at meeting the goals of all available campaign types.\nThese strategies use Google AI to optimize in every single auction, typically known as “real-time bidding.”\nIt takes many factors into consideration at the time of auction outside of your bidding strategy, including device, location, time of day, operating system, and many more.\nGoogle categorizes their Smart Bidding strategies into three main goals:\n- Conversions.\n- Clicks.\n- Viewability.\nIt’s important to match your Google Ads bid strategies with the campaign’s specific advertising objectives.\nIf you’re not sure where to start with goals, consider these points when making a bid strategy decision:\n- Are you looking for users to take direct action on your website?\n- Do you want to increase website traffic overall?\n- How important is brand awareness to you?\n- Are you looking to increase video engagement and interaction?\n- Are you focused on product or brand consideration when users are actively shopping around?\nConversion-Based Bid Strategies\nCurrently, Google Ads offers these Smart Bidding strategies aimed at increasing conversions:\n- Target Cost per Action (CPA).\n- Target Return on Ad Spend (ROAS).\n- Maximize Conversions.\n- Maximize Conversion Value.\n- Enhanced Cost per Click (eCPC).\nClick-Based Bid Strategies\nIf your main goal is gaining website traction, the only automated bid strategy currently available is Maximize Clicks.\nManual CPC bidding is still an option, but we’ll get to that later on in the article.\nVisibility-Based Bid Strategies\nNot all campaigns aim to capture the final conversion, and that’s ok!\nYou need to have some element of brand awareness coming in, otherwise the group of people who know about your product will continue to shrink.\nIf your campaign goals are focused on awareness, consider these automated PPC bidding strategies:\n- Target Impression Share.\n- CPM.\n- tCPM.\n- vCPM.\nNext, we’ll examine the main AI-powered PPC bidding strategy more granularly to get a better understanding of each one, as well as when it makes sense to choose that particular bid strategy.\nRead more: PPC Automation Layering: How To Get More From Google Ads\nTarget Cost Per Action (CPA) Bidding\nTarget CPA lets you set the amount you’re willing to pay for a conversion. Google Ads uses machine learning to get as many conversions as possible at or below your set CPA.\nGoogle then takes your Target CPA to set bids based on the likelihood of conversion from that particular user.\nWhile some conversions may cost more than your Target CPA, others may cost less than your target, but overall, the Google Ads system tries to keep your cost per conversion at the level you set.\nThere are multiple use cases for choosing Target CPA bidding:\n- Historical conversion data is available. This bid strategy requires historical conversion data, so if you have ample campaign or account conversion data, this could be a good strategy for you.\n- You need better budget control. It’s also good if you need to retain control over your CPA in order to manage the overall ROI of your PPC program.\n- Conversion tracking is accurately set up. As long as there are no underlying issues with your conversion tracking, this bid strategy could be reliable for your campaigns.\nFor example, say you run an online boutique clothing website and know that acquiring a new customer at $50 will still be profitable. For your campaign, you choose the Target CPA bid strategy and set the limit to $50.\nAs you’re running your campaigns, the data shows you’ve consistently been acquiring new customers at $40. Because of this, the Google Ads system knows it can optimize bids further to get you more customers while still staying within that $50 limit.\nNow, there are some limitations to Target CPA bidding to be aware of:\n- Limited budgets could reduce visibility. If you’ve set a competitive Target CPA, Google may limit your ad exposure or participation in the auction and reserve your budget for more expensive or competitive auctions. Essentially, you may see impressions and clicks decline as the system “conserves” budget expenditure for the most likely-to-purchase candidates.\n- Misalignment of daily budget and Target CPA can reduce results. Say you have a daily budget of $50 for your campaign, but your Target CPA is set at $25. Your impressions may be vastly reduced because, in this scenario, you’d need to have a stellar conversion rate for the number of clicks you get in order to stay within that $25 CPA.\nTarget Return On Ad Spend (ROAS) Bidding\nTarget ROAS aims to achieve a specific return on ad spend. You set the desired ROAS, and Google Ads optimizes bids to maximize conversion value while hitting your target.\nSimilar to Target CPA, Google then takes your ROAS inputs to set bids based on the likelihood of a conversion from that particular user.\nSome good use cases for using Target ROAS bidding for campaigns include:\n- Your goals are revenue-driven. Target ROAS is great for ecommerce businesses where goals are revenue-based.\n- You have high-value transactions. This PPC bidding strategy can be especially effective for high-revenue transactions or a high volume of conversions.\n- Proper conversion tracking is set up. Similar to Target CPA bidding, this strategy requires accurate conversion tracking. As long as tracking is accurate and validated, this can be a good choice for your campaigns.\nThe Target ROAS bid strategy is a great choice when you need to balance the cost of your PPC campaigns versus the revenue coming in.\nUltimately, it helps generate more revenue for every dollar spent.\nFor example, you have an online store that sells running shoes. Your average order value is $150, and you aim to have a 300% ROAS.\nThat means for every $1 you spend, you get back $3 in revenue. By setting a Target ROAS, Google optimizes campaign bids to focus on the specific conversions that will likely meet or exceed that 300% ROAS goal.\nAs your campaigns gain more historical sales data, you’ll notice that more of your dollars are going to those higher revenue-generating sales because of the goal setting.\nWith Target ROAS settings, remember that if you have an overall goal of 300% ROAS, that doesn’t mean every campaign you set should have that 300% goal.\nWhen it comes to search campaigns, brand terms and non-brand terms are not created equal. Brand terms will likely have the highest ROAS because someone is actively searching for your brand, signaling a higher likelihood of purchase.\nNon-brand terms, on the other hand, will be more competitive and costly, and likely won’t have the same ROAS as brand terms. So, be sure to set your ROAS goals at the campaign level accordingly.\nMaximize Conversions Bidding\nMaximize Conversions automatically sets bids to help you get the most conversions within your budget.\nThis strategy aims at spending your entire campaign budget without having any ROAS or CPA limitations.\nMaximize Conversions can be an ideal bid strategy if:\n- You have more budget flexibility. As mentioned above, this strategy is not constrained by CPA or ROAS targets. If you’re looking to drive as many conversions as possible and have the budget to do so, this strategy is right for you.\n- You’re looking for quick wins. If you just launched a new product and conversion expectations are high, this is an ideal strategy.\n- A broader audience is targeted. This strategy can be effective with a broader audience because there’s more of a likelihood for your ads to show as the system learns what a valuable customer looks like.\nFor example, your company just launched a new fitness app and needs to acquire users quickly.\nBy having a flexible budget, Maximize Conversions is chosen to drive as many downloads and signups as possible. Google will automatically adjust those bids to find the users most likely to convert.\nThis bid strategy is not for the faint of heart, especially for advertisers who have limited budgets or need to stay within certain performance constraints.\nMaximize Conversion Value Bidding\nSimilar to Maximize Conversions, the Maximize Conversion Value strategy sets bids to help you get the most conversion value within your budget.\nThis strategy aims to optimize for conversion value while spending your entire campaign budget without having any ROAS or CPA limitations.\nMaximize Conversions can be an ideal bid strategy if:\n- Conversion value is prioritized over volume. This bid strategy is suitable when the goal is to prioritize high-value conversions instead of the volume of conversions.\n- Campaigns are revenue-focused. Maximize Conversion Value is great when maximizing revenue is important.\n- Your products have multiple price points. This is an effective bid strategy when you have different products that vary in price. The system will learn to focus on the high-value transactions from users.\nFor example, you run an online wedding invitations company with higher price points. Your site also sells accessories that cost much less than the invitations.\nUsing the Maximize Conversion Value bidding strategy helps focus on those high-value transactions, like wedding invitations, to boost your revenue while spending your campaign budget.\nAs with each bidding strategy, there are some limitations to using the Maximize Conversions (and Value) strategies:\n- Performance is dependent on campaign budget. If the campaign budget is set too low, it will be difficult for Google Ads to effectively learn and optimize towards high-value conversions.\n- Less control over specific types of conversions. If you’re measuring multiple conversion types that have values associated, this strategy doesn’t allow you to target the specific conversion types. Its aim is to look at the overall conversion value.\n- This could lead to inefficiencies in performance metrics. While you may see an increase in revenue, you could also yield higher Cost per Acquisition, especially during more competitive markets.\nAt the end of the day, it’s up to you to decide if you have enough budget flexibility to utilize Maximize Conversions (or Value) or need to stay within certain ROAS or CPA constraints.\nRead more: How To Get The Most Out Of Max Conversion Value And tROAS Bidding\nMaximize Clicks Bidding\nThe Maximize Clicks bid strategy aims to get as many clicks as possible within your budget.\nWhat’s nice about this strategy is that you can add “ceiling” bid limits for Google to not go over within the auction process.\nMaximize Clicks is ideal for your campaigns if:\n- You’re looking to increase website traffic. If you’re less focused on conversion and looking to get as much traffic as possible, this strategy is for you.\n- You’re running Top-of-Funnel (TOF) or Middle-of-Funnel (MOF) campaigns. Similar to the above, if your campaign goal is more about awareness generation and buyer consideration, Maximize Clicks is a great place to start.\n- You’re setting up new campaigns with no history. Because many of the conversion-based bid strategies require historical data, setting campaigns to Maximize Clicks with a suitable maximum CPC limit can really help your campaigns take off quickly.\nFor example, you started a recipe blog website and just published a new guide on healthy swaps in your kitchen. Your primary goal is to drive as much traffic to that page as possible within your given budget.\nUsing the Maximize Clicks bid strategy will then aim to get you as many clicks to your site within that budget for the keywords you’re bidding on. Just remember to set a maximum CPC if you’re in a competitive industry!\nTarget Impression Share Bidding\nThis next PPC bidding strategy focuses mainly on the visibility of your campaigns, whereas the others focus on conversion or click-based outcomes.\nTarget Impression Share automatically sets bids to help ensure your ads achieve a specific impression share on the search results page.\nYou can choose your goal to show your ads:\n- At the absolute top of the page.\n- On the top of the page.\n- Anywhere on the page of the search results.\nUsing the Target Impression Share strategy can help boost your campaigns if:\n- Brand awareness is top of mind. If the campaign’s main goal is maintaining a solid presence on Google or increasing visibility for your brand, this strategy is for you.\n- You’re in a highly competitive market. In markets where competition is high and visibility to your brand is crucial.\n- You’re running top-of-funnel keywords. Similar to brand awareness, you may be targeting keywords that aren’t conversion-focused and want your brand to be top of mind when users first start their purchase journey.\nFor example, you just launched a new fashion brand and want to ensure your ads are visible in a highly competitive space.\nYour goal is to appear at the top of the Google search results page for keywords like “summer fashion trends” or “stylish summer outfits for women.” By choosing Target Impression Share, you can choose how often you’re willing to appear at the top of the page for the keywords you’re bidding on.\nKeep in mind that by using this bid strategy, you may see higher-than-average CPCs. That’s because you’re paying extra for that coveted top space on the search results page.\nAnother example is setting your brand campaign on Target Impression Share to ensure your core brand terms are always covered.\nResults have been mixed in my experience, as sometimes I’ll just see inflated CPCs on terms where I would’ve seen lower CPCs utilizing Maximize Conversions or Maximize Clicks.\nWhat About Manual Bidding?\nManual CPC bidding is still around – for now.\nGoogle has not indicated that it is removing this option, but we can never guarantee that it will always be there.\nAs the name says, Manual CPC bidding means you set the maximum CPCs you’re willing to pay. They can be set at the campaign, ad group, or keyword level.\nThe reason many have transformed their PPC bidding strategies to more AI-powered strategies from Google is that human real-time bidding simply can’t keep up with machine learning.\nThere are still use cases for brands who need to use Manual CPC and continue to use it to this day. Especially for brands that don’t have conversion data or are running small accounts, some just opt into this model for managing their Google Ads campaigns.\nRead more: Do Manual Adjustments Still Make Sense With Automated Bidding?\nChoose The Right Strategy For Your Specific Goals\nSo, there you have it – a breakdown of Google Ads’ AI-powered bid strategies and when to use them.\nRemember, the key to PPC success is not just picking any strategy but choosing the right one for your specific goals and campaign needs.\nGoogle’s machine learning outputs are usually the direct result of the inputs from the advertisers, so choose accordingly. And remember, they can be changed over time! Just make sure that your changes align with the overall business goals.\nBy understanding these strategies, you can make smarter decisions and get the most out of your PPC budget. Happy optimizing!\nMore resources:\n- PPC Experts On AI In PPC: Potential & Limitations\n- ChatGPT & PPC: 7 Ways SEMs Can Leverage AI Tools\n- PPC Trends 2024\nFeatured Image: BestForBest/Shutterstock"
    },
    {
      "url": "https://www.searchenginejournal.com/demand-generation-vs-lead-generation/546992/",
      "text": "In boardrooms and Slack threads alike, “demand generation” and “lead generation” are often used interchangeably, sometimes even by marketers themselves.\nBut for CMOs making six- and seven-figure budget decisions, lumping the two together is a costly mistake.\nOn the surface, both strategies aim to generate revenue. But the approach, intent, and impact of each are fundamentally different.\nUnderstanding these differences isn’t just marketing semantics. It’s a strategic imperative.\nWhether you’re scaling a SaaS company, leading an enterprise rebrand, or trying to make sense of declining pipeline velocity, the way you approach demand and lead gen can either fuel long-term growth or lock you into a hamster wheel of short-term wins.\nLet’s unpack what each of these approaches actually looks like, where they work best, and how to decide which path (or combination of them) is right for your team.\nWhat Demand Generation Really Means\nDemand generation isn’t just a top-of-funnel tactic. It’s a full-funnel strategy designed to create awareness, spark interest, and ultimately build desire for your solution, oftentimes before the buyer even knows they need it.\nIt prioritizes visibility, trust, and education over form-fills and gated assets.\nSo, what isn’t demand generation?\nDemand gen isn’t about chasing contact details.\nIt’s about shaping buying decisions before the buyer ever enters a sales process.\nThis strategy leans heavily on value-driven content, community building, media exposure, and delivering information that builds brand affinity over time.\nExamples of some commonly used demand generation tactics include:\n- Publishing ungated thought leadership content on LinkedIn.\n- Creating category awareness through podcasts and video series.\n- Investing in brand advertising or influencer partnerships.\n- Running product demos on YouTube or TikTok with no call-to-action (CTA).\nIn demand generation, you’re not asking for the sale. You’re creating an environment where the sale becomes inevitable.\nWhat Lead Generation Actually Delivers\nLead generation is all about conversions, and not in the philosophical sense.\nIt’s measurable, trackable, and often deeply tied to sales-qualified metrics. You offer something (a whitepaper, webinar, trial) in exchange for something (a name, email, job title).\nThe focus here is less on brand building and more on pipeline development. It’s tactical, efficient, and often short-term.\nThat doesn’t make it “bad,” but it does mean you’ll need a strong nurturing process and sales alignment to make it effective.\nCommon lead generation tactics include:\n- Gated content downloads (ebooks, whitepapers, checklists).\n- Paid search with conversion-focused landing pages.\n- Webinar registrations.\n- Cold outreach from purchased lists.\nOpposite of demand gen tactics, lead gen tactics are a bit easier to measure. They’re also easier to misuse.\nIf you’re not aligning on what constitutes a “qualified lead,” you might end up with a pile of marketing qualified leads (MQLs) that sales ignores.\nKey Differences Between Them That Actually Matter\nWhile the two approaches might feel similar in campaign execution, the intent and measurement couldn’t be more different.\n| Element | Demand Generation | Lead Generation |\n|---|---|---|\n| Primary Goal | Build interest & educate the market | Capture contact info for nurturing & sales |\n| Buyer Stage | Early to mid-funnel | Mid to late-funnel |\n| KPIs | Brand engagement, direct traffic, pipeline contribution | Form fills, cost-per-lead (CPL), MQL to SQL conversion |\n| Channel Mix | Social content, podcast, YouTube, native ads | Paid search, lead forms, email, retargeting |\n| Attribution Window | Long-Term (30+ days) | Short-term (<30 days) |\nIf you’re measuring demand gen with the same key performance indicators (KPIs) as lead gen, you’re setting yourself up for disappointment.\nThese strategies operate on different timelines and serve different roles in the buyer journey.\nThe Cost Of Getting It Wrong\nLet’s say you’re in the B2B SaaS space, and your board wants more pipeline, fast. So, you crank up spend on paid search and run gated ebook campaigns.\nYou get thousands of leads … and sales team closes almost none of them.\nWhy?\nBecause those leads weren’t ready to buy. They downloaded an asset, not because they were in-market, but because they were curious. That’s not a sales-qualified lead; it’s a reader.\nOn the flip side, if you only focus on brand and never collect contact info or move people into a nurture stream, your pipeline may dry up altogether.\nMisalignment here causes poor return on investment (ROI), frustrated sales teams, and confusion at the executive level.\nAnd CMOs? You’re the one who gets held accountable.\nSigns You Need To Shift Toward Demand Gen\nIf you’re stuck in the “more leads, less revenue” loop, demand gen might be the missing piece.\nWatch for these tell-tale signs:\n- Sales team is constantly complaining about low-quality leads.\n- Your brand has low share of voice in your category.\n- You’re over-reliant on bottom-of-funnel paid channels.\n- Organic pipeline growth is stagnating.\n- You’re optimizing cost-per-lead (CPL) while customer acquisition cost (CAC) keeps rising.\nIn these cases, shifting some of your focus (and budget) toward demand gen can help you break the cycle.\nIt doesn’t mean you stop generating leads. It means you start warming the market, so the leads that come through are higher intent and closer to revenue.\nWhen Lead Generation Still Makes Sense\nLead gen isn’t dead. It just needs context.\nFor mature markets or lower-cost products with short sales cycles, lead gen can still be incredibly efficient.\nIt’s also useful when:\n- You have strong sales enablement and fast lead response times.\n- Your brand is already well-known and trusted.\n- You have clear, relevant offers with direct value.\n- You’re testing new messaging or audiences with measurable KPIs.\nIf your team excels at lead nurturing and you’re using lead gen to support (not substitute) long-term demand creation, it can drive fast, measurable results.\nJust don’t treat it as a long-term growth strategy in isolation.\nWhy You Shouldn’t Just Pick One\nThis isn’t a zero-sum game. The smartest CMOs know how to balance both.\nThink of demand gen as fueling interest, and lead gen as capturing it. The two should work in tandem.\nStart with demand creation: educate, build trust, and generate awareness in the market. Then, as interest builds, use lead gen strategies to convert that attention into a measurable pipeline.\nIf you’re only doing one, you’re either leaving money on the table or burning through it too fast.\nRethinking KPIs And Attribution\nHere’s where many CMOs get tripped up: trying to measure demand generation with lead generation metrics.\nDemand generation is more about contribution to the pipeline, not generating immediate conversions.\nFor demand gen metrics, you’ll want to take a look at:\n- Direct traffic increases.\n- Organic branded search volume.\n- Sales velocity from known accounts.\n- CRM-sourced opportunities influenced by top-of-funnel touchpoints.\nMeanwhile, lead gen metrics like CPL and MQL-to-SQL rates are better used in a supplementary way, not as the only measure of success.\nAnd let’s be honest: Attribution will never be perfect. As CMOs, don’t expect your marketing teams to attribute each effort with 100% accuracy. You’d be setting them, and yourself, up for failure in the long run.\nBuyers today might see a LinkedIn post, hear a podcast, and Google your brand three weeks later. That journey doesn’t show up in a neat linear model.\nSo, rather than obsessing over pixel-perfect attribution, focus on momentum. Is pipeline velocity improving? Is your CAC going down over time? Are more of the right buyers coming inbound?\nThose are the real signals you should be looking for to understand if your demand gen and lead gen efforts are working.\nWhat CMOs Should Do Next\nThis isn’t about choosing sides on which strategy to focus on. It’s about choosing alignment on how the two will operate together.\nIf you’re stuck on which to prioritize, ask yourself the following questions:\n- Are we educating the market, or just capturing the existing intent?\n- Is our sales team enabled to follow up on the leads that we’re generating?\n- Do we have the patience (and buy-in) to invest in both brand and content?\n- Are we tracking the right metrics for our business, or just the easy ones?\nStart there. Then, audit your current marketing mix.\nYou might find that 80% of your spend is on lead generation efforts, but 80% of your growth comes from demand generation channels.\nChasing short-term tactics only squeezes out who’s currently in your marketing funnel.\nYou need to build a system that creates both interest and intent.\nSmart Growth Doesn’t Follow A Form Fill\nThe most effective marketing strategies don’t live behind a gate. They live in conversations, videos, buyer communities, and the minds of decision-makers before they ever hit your website.\nThat’s what demand gen does best: It plants the seed between prospective customers and your brand.\nLead gen has its role, but without demand gen, it’s like harvesting from a field you never watered.\nFor today’s CMOs, the real challenge isn’t picking one over the other. It’s learning how to weave them together into a strategy that works for your audience, your sales team, and your business goals.\nBecause real growth rarely starts with a form fill, but it can end with one.\nMore Resources:\n- 9 Tips For Successful Lead Generation (Insights From Expert Brands)\n- 3 Steps To Futureproof Demand Generation And Achieve First-Party Data Maturity\n- B2B Lead Generation\nFeatured Image: ra2 studio/Shutterstock"
    },
    {
      "url": "https://www.searchenginejournal.com/find-keyword-cannibalization-using-openai-text-embeddings-examples/520274/",
      "text": "This new series of articles focuses on working with LLMs to scale your SEO tasks. We hope to help you integrate AI into SEO so you can level up your skills.\nWe hope you enjoyed the previous article and understand what vectors, vector distance, and text embeddings are.\nFollowing this, it’s time to flex your “AI knowledge muscles” by learning how to use text embeddings to find keyword cannibalization.\nWe will start with OpenAI’s text embeddings and compare them.\n| Model | Dimensionality | Pricing | Notes |\n|---|---|---|---|\n| text-embedding-ada-002 | 1536 | $0.10 per 1M tokens | Great for most use cases. |\n| text-embedding-3-small | 1536 | $0.002 per 1M tokens | Faster and cheaper but less accurate |\n| text-embedding-3-large | 3072 | $0.13 per 1M tokens | More accurate for complex long text-related tasks, slower |\n(*tokens can be considered as words words.)\nBut before we start, you need to install Python and Jupyter on your computer.\nJupyter is a web-based tool for professionals and researchers. It allows you to perform complex data analysis and machine learning model development using any programming language.\nDon’t worry – it’s really easy and takes little time to finish the installations. And remember, ChatGPT is your friend when it comes to programming.\nIn a nutshell:\n- Download and install Python.\n- Open your Windows command line or terminal on Mac.\n- Type this commands\npip install jupyterlab\nandpip install notebook\n- Run Jupiter by this command:\njupyter lab\nWe will use Jupyter to experiment with text embeddings; you’ll see how fun it is to work with!\nBut before we start, you must sign up for OpenAI’s API and set up billing by filling your balance.\nOnce you’ve done that, set up email notifications to inform you when your spending exceeds a certain amount under Usage limits.\nThen, obtain API keys under Dashboard > API keys, which you should keep private and never share publicly.\nNow, you have all the necessary tools to start playing with embeddings.\n- Open your computer command terminal and type\njupyter lab\n. - You should see something like the below image pop up in your browser.\n- Click on Python 3 under Notebook.\nIn the opened window, you will write your code.\nAs a small task, let’s group similar URLs from a CSV. The sample CSV has two columns: URL and Title. Our script’s task will be to group URLs with similar semantic meanings based on the title so we can consolidate those pages into one and fix keyword cannibalization issues.\nHere are the steps you need to do:\nInstall required Python libraries with the following commands in your PC’s terminal (or in Jupyter notebook)\npip install pandas openai scikit-learn numpy unidecode\nThe ‘openai’ library is required to interact with the OpenAI API to get embeddings, and ‘pandas’ is used for data manipulation and handling CSV file operations.\nThe ‘scikit-learn’ library is necessary for calculating cosine similarity, and ‘numpy’ is essential for numerical operations and handling arrays. Lastly, unidecode is used to clean text.\nThen, download the sample sheet as a CSV, rename the file to pages.csv, and upload it to your Jupyter folder where your script is located.\nSet your OpenAI API key to the key you obtained in the step above, and copy-paste the code below into the notebook.\nRun the code by clicking the play triangle icon at the top of the notebook.\nimport pandas as pd\nimport openai\nfrom sklearn.metrics.pairwise import cosine_similarity\nimport numpy as np\nimport csv\nfrom unidecode import unidecode\n# Function to clean text\ndef clean_text(text: str) -> str:\n# First, replace known problematic characters with their correct equivalents\nreplacements = {\n'â€“': '–', # en dash\n'â€™': '’', # right single quotation mark\n'â€œ': '“', # left double quotation mark\n'â€': '”', # right double quotation mark\n'â€˜': '‘', # left single quotation mark\n'â€': '—' # em dash\n}\nfor old, new in replacements.items():\ntext = text.replace(old, new)\n# Then, use unidecode to transliterate any remaining problematic Unicode characters\ntext = unidecode(text)\nreturn text\n# Load the CSV file with UTF-8 encoding from root folder of Jupiter project folder\ndf = pd.read_csv('pages.csv', encoding='utf-8')\n# Clean the 'Title' column to remove unwanted symbols\ndf['Title'] = df['Title'].apply(clean_text)\n# Set your OpenAI API key\nopenai.api_key = 'your-api-key-goes-here'\n# Function to get embeddings\ndef get_embedding(text):\nresponse = openai.Embedding.create(input=[text], engine=\"text-embedding-ada-002\")\nreturn response['data'][0]['embedding']\n# Generate embeddings for all titles\ndf['embedding'] = df['Title'].apply(get_embedding)\n# Create a matrix of embeddings\nembedding_matrix = np.vstack(df['embedding'].values)\n# Compute cosine similarity matrix\nsimilarity_matrix = cosine_similarity(embedding_matrix)\n# Define similarity threshold\nsimilarity_threshold = 0.9 # since threshold is 0.1 for dissimilarity\n# Create a list to store groups\ngroups = []\n# Keep track of visited indices\nvisited = set()\n# Group similar titles based on the similarity matrix\nfor i in range(len(similarity_matrix)):\nif i not in visited:\n# Find all similar titles\nsimilar_indices = np.where(similarity_matrix[i] >= similarity_threshold)[0]\n# Log comparisons\nprint(f\"\\nChecking similarity for '{df.iloc[i]['Title']}' (Index {i}):\")\nprint(\"-\" * 50)\nfor j in range(len(similarity_matrix)):\nif i != j: # Ensure that a title is not compared with itself\nsimilarity_value = similarity_matrix[i, j]\ncomparison_result = 'greater' if similarity_value >= similarity_threshold else 'less'\nprint(f\"Compared with '{df.iloc[j]['Title']}' (Index {j}): similarity = {similarity_value:.4f} ({comparison_result} than threshold)\")\n# Add these indices to visited\nvisited.update(similar_indices)\n# Add the group to the list\ngroup = df.iloc[similar_indices][['URL', 'Title']].to_dict('records')\ngroups.append(group)\nprint(f\"\\nFormed Group {len(groups)}:\")\nfor item in group:\nprint(f\" - URL: {item['URL']}, Title: {item['Title']}\")\n# Check if groups were created\nif not groups:\nprint(\"No groups were created.\")\n# Define the output CSV file\noutput_file = 'grouped_pages.csv'\n# Write the results to the CSV file with UTF-8 encoding\nwith open(output_file, 'w', newline='', encoding='utf-8') as csvfile:\nfieldnames = ['Group', 'URL', 'Title']\nwriter = csv.DictWriter(csvfile, fieldnames=fieldnames)\nwriter.writeheader()\nfor group_index, group in enumerate(groups, start=1):\nfor page in group:\ncleaned_title = clean_text(page['Title']) # Ensure no unwanted symbols in the output\nwriter.writerow({'Group': group_index, 'URL': page['URL'], 'Title': cleaned_title})\nprint(f\"Writing Group {group_index}, URL: {page['URL']}, Title: {cleaned_title}\")\nprint(f\"Output written to {output_file}\")\nThis code reads a CSV file, ‘pages.csv,’ containing titles and URLs, which you can easily export from your CMS or get by crawling a client website using Screaming Frog.\nThen, it cleans the titles from non-UTF characters, generates embedding vectors for each title using OpenAI’s API, calculates the similarity between the titles, groups similar titles together, and writes the grouped results to a new CSV file, ‘grouped_pages.csv.’\nIn the keyword cannibalization task, we use a similarity threshold of 0.9, which means if cosine similarity is less than 0.9, we will consider articles as different. To visualize this in a simplified two-dimensional space, it will appear as two vectors with an angle of approximately 25 degrees between them.\nIn your case, you may want to use a different threshold, like 0.85 (approximately 31 degrees between them), and run it on a sample of your data to evaluate the results and the overall quality of matches. If it is unsatisfactory, you can increase the threshold to make it more strict for better precision.\nYou can install ‘matplotlib’ via terminal.\npip install matplotlib\nAnd use the Python code below in a separate Jupyter notebook to visualize cosine similarities in two-dimensional space on your own. Try it; it’s fun!\nimport matplotlib.pyplot as plt\nimport numpy as np\n# Define the angle for cosine similarity of 0.9. Change here to your desired value.\ntheta = np.arccos(0.9)\n# Define the vectors\nu = np.array([1, 0])\nv = np.array([np.cos(theta), np.sin(theta)])\n# Define the 45 degree rotation matrix\nrotation_matrix = np.array([\n[np.cos(np.pi/4), -np.sin(np.pi/4)],\n[np.sin(np.pi/4), np.cos(np.pi/4)]\n])\n# Apply the rotation to both vectors\nu_rotated = np.dot(rotation_matrix, u)\nv_rotated = np.dot(rotation_matrix, v)\n# Plotting the vectors\nplt.figure()\nplt.quiver(0, 0, u_rotated[0], u_rotated[1], angles='xy', scale_units='xy', scale=1, color='r')\nplt.quiver(0, 0, v_rotated[0], v_rotated[1], angles='xy', scale_units='xy', scale=1, color='b')\n# Setting the plot limits to only positive ranges\nplt.xlim(0, 1.5)\nplt.ylim(0, 1.5)\n# Adding labels and grid\nplt.xlabel('X-axis')\nplt.ylabel('Y-axis')\nplt.grid(True)\nplt.title('Visualization of Vectors with Cosine Similarity of 0.9')\n# Show the plot\nplt.show()\nI usually use 0.9 and higher for identifying keyword cannibalization issues, but you may need to set it to 0.5 when dealing with old article redirects, as old articles may not have nearly identical articles that are fresher but partially close.\nIt may also be better to have the meta description concatenated with the title in case of redirects, in addition to the title.\nSo, it depends on the task you are performing. We will review how to implement redirects in a separate article later in this series.\nNow, let’s review the results with the three models mentioned above and see how they were able to identify close articles from our data sample from Search Engine Journal’s articles.\nFrom the list, we already see that the 2nd and 4th articles cover the same topic on ‘meta tags.’ The articles in the 5th and 7th rows are pretty much the same – discussing the importance of H1 tags in SEO – and can be merged.\nThe article in the 3rd row doesn’t have any similarities with any of the articles in the list but has common words like “Tag” or “SEO.”\nThe article in the 6th row is again about H1, but not exactly the same as H1’s importance to SEO. Instead, it represents Google’s opinion on whether they should match.\nArticles on the 8th and 9th rows are quite close but still different; they can be combined.\ntext-embedding-ada-002\nBy using ‘text-embedding-ada-002,’ we precisely found the 2nd and 4th articles with a cosine similarity of 0.92 and the 5th and 7th articles with a similarity of 0.91.\nAnd it generated output with grouped URLs by using the same group number for similar articles. (colors are applied manually for visualization purposes).\nFor the 2nd and 3rd articles, which have common words “Tag” and “SEO” but are unrelated, the cosine similarity was 0.86. This shows why a high similarity threshold of 0.9 or greater is necessary. If we set it to 0.85, it would be full of false positives and could suggest merging unrelated articles.\ntext-embedding-3-small\nBy using ‘text-embedding-3-small,’ quite surprisingly, it didn’t find any matches per our similarity threshold of 0.9 or higher.\nFor the 2nd and 4th articles, cosine similarity was 0.76, and for the 5th and 7th articles, with similarity 0.77.\nTo better understand this model through experimentation, I’ve added a slightly modified version of the 1st row with ’15’ vs. ’14’ to the sample.\n- “14 Most Important Meta And HTML Tags You Need To Know For SEO”\n- “15 Most Important Meta And HTML Tags You Need To Know For SEO”\nOn the contrary, ‘text-embedding-ada-002’ gave 0.98 cosine similarity between those versions.\n| Title 1 | Title 2 | Cosine Similarity |\n| 14 Most Important Meta And HTML Tags You Need To Know For SEO | 15 Most Important Meta And HTML Tags You Need To Know For SEO | 0.92 |\n| 14 Most Important Meta And HTML Tags You Need To Know For SEO | Meta Tags: What You Need To Know For SEO | 0.76 |\nHere, we see that this model is not quite a good fit for comparing titles.\ntext-embedding-3-large\nThis model’s dimensionality is 3072, which is 2 times higher than that of ‘text-embedding-3-small’ and ‘text-embedding-ada-002′, with 1536 dimensionality.\nAs it has more dimensions than the other models, we could expect it to capture semantic meaning with higher precision.\nHowever, it gave the 2nd and 4th articles cosine similarity of 0.70 and the 5th and 7th articles similarity of 0.75.\nI’ve tested it again with slightly modified versions of the first article with ’15’ vs. ’14’ and without ‘Most Important’ in the title.\n- “14 Most Important Meta And HTML Tags You Need To Know For SEO”\n- “15 Most Important Meta And HTML Tags You Need To Know For SEO”\n- “14 Meta And HTML Tags You Need To Know For SEO”\n| Title 1 | Title 2 | Cosine Similarity |\n| 14 Most Important Meta And HTML Tags You Need To Know For SEO | 15 Most Important Meta And HTML Tags You Need To Know For SEO | 0.95 |\n| 14 Most Important Meta And HTML Tags You Need To Know For SEO | 14 |\n0.93 |\n| 14 Most Important Meta And HTML Tags You Need To Know For SEO | Meta Tags: What You Need To Know For SEO | 0.70 |\n| 15 Most Important Meta And HTML Tags You Need To Know For SEO | 14 |\n0.86 |\nSo we can see that ‘text-embedding-3-large’ is underperforming compared to ‘text-embedding-ada-002’ when we calculate cosine similarities between titles.\nI want to note that the accuracy of ‘text-embedding-3-large’ increases with the length of the text, but ‘text-embedding-ada-002’ still performs better overall.\nAnother approach could be to strip away stop words from the text. Removing these can sometimes help focus the embeddings on more meaningful words, potentially improving the accuracy of tasks like similarity calculations.\nThe best way to determine whether removing stop words improves accuracy for your specific task and dataset is to empirically test both approaches and compare the results.\nConclusion\nWith these examples, you have learned how to work with OpenAI’s embedding models and can already perform a wide range of tasks.\nFor similarity thresholds, you need to experiment with your own datasets and see which thresholds make sense for your specific task by running it on smaller samples of data and performing a human review of the output.\nPlease note that the code we have in this article is not optimal for large datasets since you need to create text embeddings of articles every time there is a change in your dataset to evaluate against other rows.\nTo make it efficient, we must use vector databases and store embedding information there once generated. We will cover how to use vector databases very soon and change the code sample here to use a vector database.\nMore resources:\n- Avoiding Keyword Cannibalization Between Your Paid and Organic Search Campaigns\n- How Do I Stop Keyword Cannibalization When My Products Are All Similar?\n- Leveraging Generative AI Tools For SEO\nFeatured Image: BestForBest/Shutterstock"
    },
    {
      "url": "https://www.searchenginejournal.com/google-performance-max/498283/",
      "text": "When Performance Max launched in 2021, many advertisers weren’t sure what to expect.\nIt promised access to all of Google’s inventory in a single paid search campaign, but gave us very few levers to actually influence performance. For brands used to having more control, that was frustrating.\nSince then, a lot has changed. Google has spent the past year rolling out meaningful updates, many based on advertiser feedback.\nFrom campaign-level exclusions to channel reporting and more asset-level insights, Performance Max (PMax) is becoming more transparent and easier to work with.\nThat doesn’t mean it’s a set-it-and-forget-it campaign type. But, it does mean advertisers now have more tools to guide performance, troubleshoot issues, and use PMax in a more strategic way than we could before.\nHow Does Performance Max Work?\nPerformance Max is a campaign type that allows advertisers to access all of Google’s ad inventory from one campaign. This inventory includes placements in:\n- Search (and Search Partners).\n- Display.\n- YouTube.\n- Shopping.\n- Discover.\n- Maps (via local assets when applicable).\n- Gmail.\nIt utilizes Google’s machine learning capabilities and AI to help drive more conversions, as a complement to existing Search campaigns.\nInstead of building separate campaigns for each channel, you upload your creative assets and set a conversion goal. Then, Google’s AI dynamically assembles and delivers ads to the users it believes are most likely to convert.\nIt combines signals like intent, behavior, demographics, and your audience lists to determine where and when to show your ads. You don’t control keyword targeting directly. Google does that for you using automation.\nIt’s a shift in mindset: Instead of managing placements and match types, your job is to feed the system high-quality creative, structured data, and clear goals.\nBudget & Bidding\nPerformance Max supports the same Smart Bidding strategies available in other Google Ads campaigns:\n- Maximize conversions.\n- Maximize conversion value.\nAdditionally, you can set an optional target return on ad spend if using “Maximize Conversion Value” or an optional target cost-per-acquisition if using “Maximize Conversions” bid strategy.\nNext, you have the option to bid differently for new customer acquisition.\nBy default, the option is set to bid higher for new customers. This means the campaign will still reach all potential customers, but prioritize net new customers with a higher bid.\nIn order to use new customer acquisition, the following inputs are required:\n- The bidding strategy type needs to be “Maximize Conversion Value.”\n- An audience segment with at least 1,000 active members to help identify existing customers.\nGoogle has recently introduced Smart Bidding Exploration, which expands your targeting beyond historically high-performing queries to help you discover new opportunities. It’s not exclusive to PMax, but it aligns with its automation-first approach.\nBudget-wise, PMax campaigns are flexible, but because they serve across all channels, you may find that spend gets pulled into cheaper (but not always more effective) placements unless closely monitored.\nLocation, Language, And Ad Scheduling\nUp next with a new PMax campaign setup is your location, language, and ad scheduling.\nIf you need to add a large volume of individual locations, Google Ads Editor fully supports this function. You can also bulk upload them in the online interface by clicking on “advanced search”:\nAfter that, you’ll choose targeted languages, ad schedule (if applicable), and campaign run dates.\nWhat Type of Campaign-Level Controls Does Performance Max Have?\nEarly versions of Performance Max left advertisers with almost no ability to steer campaigns. But, that’s changed over time.\nAs of 2025, you now have more tools to shape your campaign at a high level, including:\n- Campaign-level negative keywords: Block irrelevant queries without relying on account-wide lists.\n- Brand exclusions: Prevent your ads from showing for branded searches you don’t want (useful for retailers or resellers).\n- Age exclusions: Exclude certain age groups from seeing your ads.\n- Device targeting: Exclude mobile, desktop, or tablet if your conversion performance varies by device (this is a binary on/off exclusion, not a bid adjustment lever).\n- URL contains rules: Control which product pages feed into your campaign using a landing page structure.\nWhile still not as precise as traditional Search, these controls let you course-correct when something clearly isn’t working.\nAutomatic Asset Generation\nGoogle now automatically generates headlines, descriptions, and image assets if your campaign is missing any inputs. These AI-generated assets are based on your website, feed data, and past performance.\nYou can opt in or out of this feature. If you leave it on, make sure to regularly review what’s being generated. Sometimes it works, but sometimes it leads to mismatched messaging or brand tone inconsistencies.\nNew in 2025, Google introduced brand-consistent AI creative tools that let you upload your logo, fonts, and visual preferences.\nFrom there, Google can generate image variations that better match your brand, as long as you’ve clearly defined those brand guardrails upfront.\nAsset Groups (A.k.a. “Ads”)\nThink of asset groups as the PMax version of ad groups. This is where most of your setup will happen.\nEach asset group should be tied to a theme, product, or audience segment. For example, you might have one group targeting branded products, another for generic categories, and a third for seasonal promos.\nEach group contains:\n- Brand Guidelines: You can control how your brand appears by inputting a business name, logo(s), custom colors, and font.\n- Headlines: Up to 15 headlines can be added. Each headline has a 30-character limit.\n- Long Headlines: Up to five long headlines can be added. Each has a 90-character limit.\n- Descriptions: Up to five descriptions with a 90-character limit.\n- Images: Up to 20 images can be added. A combination of landscape, square, and portrait orientations is recommended.\n- Video: While not required, these are highly encouraged. If you don’t have a video, Google will automatically create one in most cases, depending on the completeness of your assets. Up to five videos can be added.\n- Sitelinks: At least two are required in order for sitelinks to show in ads. The recommended number is at least four.\n- Call to Action: This can be automated, where Google tests different CTAs, or you can choose from different options.\n- Audience Signals: Be sure to add relevant audience signals, such as customer lists or in-market segments, to help Google find new customers faster.\n- Search Themes: Add up to 50 words or phrases people use when searching for your product or service.\n- Final URL or feed link: This is where the user will be directed after clicking on an ad.\nGoogle does have the option to use automatic asset optimization, including these three categories:\n- Text: Customization and final URL expansion.\n- Image: Enhancement and landing page images.\n- Video: Enhancement.\nYou can opt in or opt out by checking the boxes for each of them.\nIt’s important to note that with audience signals, think of them more like audience “suggestions.”\nBy adding audience signals, your campaigns can be targeted to those signals, but not exclusively.\nGoogle will use the audience signal inputs to identify similar customers who are more likely to purchase your product or service.\nFrom experience, start by adding your first-party audience lists to capture as many relevant new customers as possible.\nLastly, additional (and optional) asset types can be set at this level, including:\n- Promotions.\n- Prices.\n- Calls.\n- Structured snippets.\n- Lead forms.\n- Callouts.\n- Display path.\nWhat Kind Of Reporting Does Performance Max Have?\nOne of the biggest critiques of Performance Max early on was the lack of visibility.\nAdvertisers couldn’t see what channels their ads were showing on, what search terms were triggering clicks, or which creative combinations were actually working. It felt like running a campaign blindfolded.\nThankfully, that’s no longer the case.\nWhile PMax still isn’t as transparent as traditional campaign types, Google has rolled out several major reporting updates over the past year, especially in response to advertiser feedback. Here’s what you can look at to evaluate performance today.\nChannel-Level Reporting\nThis has been one of the most important updates in recent memory. With channel breakdowns, you can now see how your campaign is delivering across:\n- Search.\n- YouTube.\n- Display.\n- Gmail.\n- Discover.\n- Maps.\nThis is critical for understanding where your budget is going. If you notice the majority of conversions are coming from Search and Display, but YouTube is eating up 40% of the spend without results, that’s a red flag.\nWhile you can’t directly adjust bids per channel, this insight helps you make more informed decisions about creative, exclusions, or asset group adjustments.\nSearch Term Insights\nUp until Google Marketing Live 2025, Google provided search category themes within the Insights tab to help you understand the types of queries driving your ads.\nThese aren’t exact match queries like in Search campaigns, but rather high-level themes grouped by relevance.\nJust announced this year, more granular search term reporting is rolling out, giving advertisers a closer look at actual search behavior driving performance. It’s not fully comprehensive yet, but it’s a step toward more actionable optimization.\nAsset Group And Asset-Level Performance\nEach asset group now includes performance metrics like:\n- Impressions.\n- Clicks.\n- Conversions.\n- Conversion Value.\n- Click-Through Rate (CTR).\nYou can also view asset-level ratings (Low, Good, Best) to gauge which combinations are resonating. These qualitative signals may feel vague, but they can help you identify which headlines or images deserve a refresh.\nIf one asset group is consistently outperforming others, use it as a blueprint. Review the messaging, creative tone, and audience signal tied to it. Then, test those learnings across other asset groups.\nAudience Signal Contribution\nWhile audience signals in PMax don’t act as strict targeting filters, you can now get visibility into how well they’re assisting the system.\nThis shows up in the Insights tab and helps you understand which segments (e.g., website visitors, in-market audiences, custom segments) are contributing to conversions.\nIf a particular audience signal shows low engagement, it may be time to swap it out or build new custom segments based on updated behaviors.\nWhat Is The Difference Between Performance Max, Search Ads, And Demand Gen Ads?\nPerformance Max is certainly a different breed of campaign type.\nAccording to Google, PMax is meant to complement keyword-based Search campaigns to help drive more customers. They are not meant to be a replacement.\nThere are three key differences between the different campaign types:\n- Placements.\n- Intention.\n- Targeting options.\nBelow is a quick comparison chart of how these three campaign types differ.\n| Feature | Performance Max | Search | Demand Gen |\n| Channels | All Google inventory | Search and Search Partners | YouTube, Discover, Gmail |\n| Targeting | Automated (audience signals and search themes are optional) | Keyword-based | Lookalikes, custom segments, remarketing |\n| Creative | Asset-based | Text-based ads | Image and video-based ads |\n| Reporting Transparency | Improving, but still automated | High | Moderate |\n| Ideal for | Ecommerce, omnichannel | Intent-based targeting | Visual storytelling and top-of-funnel demand |\nPMax is often best when paired with Search, not instead of it. And if you’re already running video or Display campaigns, Demand Gen might be better suited for upper-funnel goals.\n→ Read more: Performance Max Vs. Search: A Non-Scientific Look On If It Competes And What It Means\nWhat Are The Benefits Of Performance Max?\nPerformance Max is designed to simplify campaign management while scaling your reach across Google’s entire network. But, the real value comes when you go beyond surface-level automation and treat PMax as a tool for strategic growth.\nHere’s what it can offer when used correctly:\n- Streamlined Access To Every Google Channel: Rather than building and managing separate campaigns for Search, Display, YouTube, and Discovery, PMax consolidates that effort. You can reach customers wherever they’re browsing, searching, or watching.\n- Efficiency In Creative Delivery: Your uploaded assets (text, images, and videos) are automatically mixed and matched to create combinations tailored to each user and placement. This saves time on creative testing and makes it easier to launch full-funnel campaigns without manually managing dozens of ad variants.\n- Smarter Optimization Through AI: PMax uses real-time signals like search intent, browsing behavior, device, location, and time of day to determine when and where to serve ads. This goes far beyond manual rules or bid adjustments. For advertisers with solid conversion tracking in place, Smart Bidding can dramatically improve efficiency over time.\n- Discovery Of New Conversion Opportunities: Because you’re not limited to a keyword list or narrow targeting parameters, Performance Max can help uncover new audiences and surfaces you might not have reached otherwise, especially relevant for products with broad appeal or when expanding to new markets.\n- Unified Campaign Management: PMax reduces operational complexity. Instead of optimizing multiple campaigns, channels, and strategies separately, you can manage budgets, creative, and conversion tracking in one place. This makes it easier to align internal teams around performance goals.\nThat said, these benefits only show up when the campaign is set up thoughtfully. Automation isn’t a magic bullet, but it can be a force multiplier if you feed it the right inputs.\nWho Should Use Performance Max?\nPerformance Max works best for advertisers who are open to testing, have strong conversion signals, and are looking to scale beyond the limitations of a single channel.\nBut, it’s not a universal solution for everyone.\nHere’s a breakdown of who should consider using it, and who might want to use caution when testing it out.\nIf any of these sound like you, strongly consider adding Performance Max to your campaign strategy.\n- You’re an ecommerce brand. PMax has deep integration with Merchant Center, making it an excellent fit for retailers looking to scale Shopping campaigns while layering in additional surfaces like YouTube and Discover.\n- You have meaningful conversion goals and accurate tracking. Without well-defined and trackable conversion actions, PMax won’t know what to optimize toward. Whether it’s lead forms, purchases, or phone calls, clean data is critical.\n- You want to expand reach without managing every placement. For small teams or those stretched across multiple responsibilities, PMax can help simplify campaign ops while still pushing performance.\n- You have high-quality creative assets across multiple formats. The more you give the system to work with (images, videos, ad copy), the better your chances of engaging users across all placements. Google’s AI does the heavy lifting, but your input defines the ceiling.\n- You’re exploring new audiences, products, or geographies. When launching in a new market, PMax can quickly gather learnings by casting a wider net than Search alone. Just be sure to monitor the early signals closely.\nOn the other hand, these scenarios may not be ideal for you to venture out into PMax right away, or at least without crafting a strategy around it.\n- You have highly niche or B2B targeting needs that require precision.\n- Your conversions are low-volume, offline, or hard to track.\n- You want full control over placements, bids, and messaging at all times.\nIn short, PMax is best suited for performance-driven advertisers with clear goals and enough data to fuel automation. If that’s you, it’s worth testing.\n5 Best Practices For Performance Max\nTo get the most out of Performance Max, you need more than just a campaign setup. You need to structure it for learning, control what you can, and stay vigilant on performance signals.\nHere are five ways to approach it:\n1. Start With Strong Audience Signals.\nWhile Google doesn’t only use the audiences you provide, giving it the right starting point can reduce learning time and steer your campaign in the right direction.\nThese can include custom segments, website visitors, and even customer relationship management-based lists. Group them thoughtfully by intent or lifecycle stage, not just demographic categories.\n2. Invest In Quality Creative Across Formats\nOne of the biggest performance gaps in PMax comes from weak or missing creative.\nGoogle prefers asset diversity: square and landscape images, vertical videos, multiple headlines, and descriptions. If you leave key formats blank (like video), Google will auto-generate them, and the results may not reflect your brand well.\nAim for at least three to five strong creatives per format in every asset group.\n3. Lean On Reporting – Even If It’s Not Perfect\nWhile reporting in PMax isn’t as robust as traditional Search, it’s improved significantly. Review channel-level performance, asset group insights, and search themes regularly.\nIf one asset group is outperforming, look at what messaging and visuals are being used, and apply that learning to other groups.\n4. Proactively Use Exclusions And Conversion Rules\nDon’t wait until performance tanks to apply controls. Set negative keywords, brand exclusions, and URL rules early. Define what counts as a valuable conversion in your account.\nThis helps Smart Bidding optimize toward meaningful outcomes rather than vanity metrics or low-quality leads.\n5. Select The Appropriate Goal And Targets For Bidding Strategy\nIt’s important to have some sort of idea of what a customer is worth to you.\nIf you have historical key performance indicators (KPIs) of target CPA or target ROAS, use those as a starting point when setting your bid strategy.\nSetting the goals too high or too low can produce significant volatility in campaign performance.\nFor example, a typical branded search campaign likely has a much higher ROAS than a non-branded campaign.\nDon’t set your conversion targets in accordance with what you see for brand terms. By doing so, targeting and reach may become limited, which means fewer conversions and poor performance.\nSet Your Next Performance Max Campaign Up For Success\nPerformance Max has come a long way from where it started. It’s more flexible, more transparent, and better suited for advertisers who want to scale without giving up all control.\nThe recent improvements (especially the reporting upgrades and creative tools) show that Google is listening, at least in part, to advertiser feedback.\nBut success with PMax still comes down to strategy. It works best when paired with clean data, strong assets, and someone who’s willing to dig into the details.\nIf you’re willing to guide the machine, there’s real potential here.\nMore Resources:\n- 11 Tips To Get The Best Out Of Performance Max Campaigns\n- Google PMax: Inside The Negative Keyword Limit Increase & What’s Next\n- PPC Trends 2025\nFeatured Image: N Universe/Shutterstock"
    },
    {
      "url": "https://www.searchenginejournal.com/marketing-attribution/477573/",
      "text": "Now more than ever, marketing and sales leaders are taking a critical look at where to allocate their resources and how to staff their teams.\nAttribution modeling is one of the best tools for providing clear guidance on what’s working, and what isn’t.\nWhat Is Marketing Attribution?\nMarketing attribution is the approach to understanding how various marketing and sales touchpoints influence the prospects’ move from visitor, to lead, to customer.\nBy implementing attribution in your organization, you’ll have a better idea of:\n- Which channels are most influential during different phases of the sales cycle.\n- Which content formats are more or less impactful in your marketing or sales enablement efforts.\n- Which campaigns drove the most revenue and return on investment (ROI).\n- The most common sequence of online or offline events that prospects interact with before becoming a customer.\nWhy Is Attribution Important In Marketing?\nAnalyzing attribution data provides you with an understanding of which marketing, sales, and customer success efforts are contributing most effectively and efficiently toward revenue generation.\nAttribution modeling helps you identify opportunities for growth and improvement, while also informing budget allocation decisions.\nWith accurate attribution models, marketers are able to make more informed decisions about their campaigns, which has allowed them to increase ROI and reduce wasted budgets on ineffective strategies.\nWhat Are The Challenges Of Marketing Attribution?\nDeveloping a perfect attribution model that guides all of your decisions is a pipedream for most marketers.\nHere are five challenges that result in inconclusive data models or total project abandonment:\nCross-Channel Management\nThis is a common challenge for enterprise marketers who have web assets across multiple websites, channels, and teams.\nWithout proper analytics tagging and system settings configuration, your web activities may not be tracked accurately as a visitor goes from one campaign micro-site to the main domain.\nOr, the prospect may not be tracked as they go from your website to get directions to then go to your physical storefront to transact.\nMaking Decisions Based On Small Sample Sizes\nFor smaller trafficked websites, marketers using attribution data may not have statistically significant data sets to draw accurate correlations for future campaigns.\nThis results in faulty assumptions and the inability to repeat prior success.\nLack Of Tracking Compliance\nIf your attribution models rely on offline activities, then you may require manual imports of data or proper logging of sales activities.\nFrom my experience in overseeing hundreds of CRM implementations, there is always some level of non-compliance in logging activities (like calls, meetings, or emails). This leads to skewed attribution models.\nMo‘ models, mo’ problems: Each analytics platform has a set of five or more attribution models you can use to optimize your campaigns around.\nWithout a clear understanding of the pros and cons of each model, the person building the attribution reporting may not be structuring or configuring them to align with your organizational goals.\nData Privacy\nSince GDPR, CCPA, and other privacy laws were enacted, analytics data continues to get murkier each year.\nFor organizations that rely on web visitors to opt-in to tracking, attribution modeling suffers due to the inability to pull in tracking for every touchpoint.\nHow Do You Measure Marketing Attribution?\nMeasuring attribution is all about giving credit where it is due. There are dozens of attribution tools out there to assign credit to the digital or offline touchpoint.\nAttribution measurement starts with choosing the data model that aligns with your business goals.\nCertain attribution models favor interactions earlier on in the customer journey whereas others give the most credit towards interactions closer to a transaction.\nHere is a scenario of how to measure marketing attribution in a first-touch attribution model (we’ll get to the different models next):\nA prospect comes to the website through a paid search ad and reads the blog.\nTwo days later, she comes back to the site and views a couple of product pages.\nThree days later, she comes back through an organic listing from Google and then converts on the site by signing up for a discount coupon.\nWith a first-touch attribution model, the paid search ad will get 100% of the credit for that conversion.\nAs you can see, choosing the “right” model can be a contentious issue, as each model gives a percentage of credit to a specific interaction or placement along the path toward becoming a customer.\nIf your business relies on paid search, SEO, offline, and other channels, then likely one of the individuals working on one of those channels is going to look like the superhero, whereas the other marketers will look like they aren’t pulling their weight.\nIdeally, when you are choosing an attribution tool, you’ll be able to build reports that allow you to compare various attribution models, so you have a better understanding of which channels and interactions are most influential during certain time periods leading up to conversion or purchase.\nWhat Are Different Marketing Attribution Models?\nMarketers can use various marketing attribution models to examine the effectiveness of their campaigns.\nEach attribution tool has will have a handful of models you can optimize campaigns and build reports around. Here is a description of each model:\nFirst-Click Attribution\nThis model gives credit to the first channel that the customer interacted with.\nThis model is popular to use when optimizing for brand awareness and top-of-funnel conversions/engagement.\nLast-Click Attribution\nThis model gives all of the credit to the last channel that the customer interacts with.\nThis model is useful when looking to understand which channels/interactions were most influential immediately before converting/purchasing.\nLast-click attribution is the default attribution model for Google Analytics.\nMulti-Touch/Channel Attribution\nThis model gives credit to all of the channels or touchpoints that the customer interacted with throughout their journey.\nThis model is used when you are looking to give weight evenly or to specific interactions.\nThere are variations of the multi-touch model including time-decay, linear, U-shaped, W-shaped, and J-shaped.\nCustomized\nThis model allows you to manually set the weight for individual channels or placements within the customer journey.\nThis model is best for organizations that have experience in using attribution modeling, and have clear goals for what touchpoints are most impactful in the buyers’ journey.\nMarketing Attribution Tools\nThere are several different tools available to help marketers measure and analyze marketing attribution. Some attribution tools are features within marketing automation platforms or CRM systems like Active Campaign or HubSpot.\nOthers are stand-alone attribution tools that rely on API or integrations to pull in and analyze data, like Triple Whale or Dreamdata.\nAs you are evaluating tools, consider how much offline or sales data needs to be included within your attribution models.\nFor systems like HubSpot, you can include sales activities (like phone calls and 1:1 sales emails) and offline list import data (from tradeshows).\nOther tools, like Google Analytics, are not natively built to pull in that kind of data and would require advanced development work to include these activities as part of your model.\n(Full disclosure: I work with HubSpot’s highest-rated partner agency, SmartBug Media.)\nAdditionally, if you need to be able to see the very specific touchpoints (like a specific email sent or an ad clicked), then you need a full-funnel attribution system that shows this level of granularity.\nAttribution modeling is a powerful tool that marketers can use to measure the success of their campaigns, optimize online/offline channels, and improve customer interactions.\nIt is important, though, to understand attribution’s limitations, the pros and cons of each model, and the challenges with extracting conclusive data before investing large budgets towards attribution technology.\nMore resources:\n- A Complete Guide To B2B Multitouch Attribution Models\n- A Practical Guide To Multi-Touch Attribution\n- Multi-Channel B2B Lead Generation: 8 Steps to Success\nFeatured Image: Yuriy K/Shutterstock"
    }
  ],
  "argos_summary": "The article discusses the challenges of keyword cannibalization in paid media strategies, particularly for companies with multiple brands targeting the same keywords. It emphasizes the inevitability of some internal competition and suggests strategies to mitigate costs and improve conversions, such as prioritizing keywords for specific products, using Dynamic Search Ads, and maintaining clean branded campaigns. Additionally, it highlights the importance of audience-based targeting and effective budget management to enhance overall campaign performance.",
  "argos_id": "07L4VYXZ2"
}