{
  "url": "https://www.nytimes.com/2025/08/07/us/politics/trump-medicare-bandages-donors.html",
  "authorsByline": "Katie Thomas, Sarah Kliff, Kenneth P. Vogel",
  "articleId": "1ec70e3874a34acc80ce29ac14c413d0",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/06/multimedia/dc-skin-access2-zwqf/dc-skin-access2-zwqf-facebookJumbo.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T14:00:18.383000+00:00",
  "addDate": "2025-08-07T14:08:02.544272+00:00",
  "refreshDate": "2025-08-07T14:08:02.544274+00:00",
  "score": 1.0,
  "title": "After Donations, Trump Sided With Health Firms on Medicare Funds for Pricey Wound Care",
  "description": "The president posted talking points provided by one firm that donated millions, and his administration delayed a change that could have hurt the company and others like it.",
  "content": "Oliver Burckhardt came prepared for the dinner that President Trump hosted for a small group of major donors at his private Mar-a-Lago resort in South Florida on March 1.\n\nA week earlier, one of Mr. Burkhardt’s biotech companies had donated $5 million to MAGA Inc., a pro-Trump political committee, that paved the way for him to attend the event.\n\nAt the dinner, Mr. Burckhardt got a chance to speak briefly to the president and other guests about himself and the work of his company, Extremity Care, which makes pricey medical products including paper-thin bandages made of dried bits of placenta, according to three people who spoke on the condition of anonymity to describe the private event. He also brought copies of a flier urging the Trump administration to reverse a plan to restrict Medicare reimbursement for the bandages and criticizing former President Joseph R. Biden Jr. for having “rammed through a policy that would create more suffering and death for diabetic patients on Medicare.”\n\nThe next morning, Mr. Trump posted the flier on his social media site.\n\nIt was not just symbolic.\n\nAbout one month later, the Trump administration announced it would delay until next year the Biden administration plan to limit Medicare’s coverage of the bandages, known as skin substitutes, saying that it was reviewing its policies.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2025/04/11/health/skin-substitutes-medicare-policy-delay.html",
    "https://truthsocial.com/@realDonaldTrump/posts/114093529028938304"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Trump",
      "weight": 0.101632506
    },
    {
      "name": "President Trump",
      "weight": 0.099508874
    },
    {
      "name": "Trump",
      "weight": 0.086684994
    },
    {
      "name": "former President Joseph R. Biden Jr.",
      "weight": 0.08579046
    },
    {
      "name": "Joseph R. Biden Jr.",
      "weight": 0.077851005
    },
    {
      "name": "Mr. Burckhardt",
      "weight": 0.07753688
    },
    {
      "name": "pricey medical products",
      "weight": 0.07596081
    },
    {
      "name": "Medicare reimbursement",
      "weight": 0.07443033
    },
    {
      "name": "Pricey Wound Care",
      "weight": 0.07019639
    },
    {
      "name": "Medicare",
      "weight": 0.0659908
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.8818359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.875
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.5986328125
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.474853515625
    },
    {
      "name": "/Finance/Insurance/Health Insurance",
      "score": 0.38916015625
    }
  ],
  "sentiment": {
    "positive": 0.06427002,
    "negative": 0.71240234,
    "neutral": 0.2232666
  },
  "summary": "Oliver Burckhardt, a billionaire businessman whose biotech company, Extremity Care, donated $5 million to a pro-Trump political committee a week earlier to pave the way for him to attend a dinner at President Trump's Mar-a-Lago resort in South Florida. At the dinner, Burckhard shared his company's products and a flier urging the Trump administration to reverse a plan to limit Medicare reimbursement for the bandages, which are used for high-priced medical products. The flier also criticized former President Joseph R. Biden Jr. for having implemented a policy that would create more suffering and death for diabetic patients on Medicare. The next day, the administration announced it would delay until next year the Biden administration plan to reduce Medicare’s coverage of these bandages.",
  "shortSummary": "President Trump sided with health firms in opposing Medicare reimbursement restrictions, after Oliver Burckhardt donated $5 million to MAGA Inc., urging action.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2de246a34b5047e599ee048e951811eb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Oliver Burckhardt attended a dinner hosted by President Trump at Mar-a-Lago after his biotech company donated $5 million to a pro-Trump political committee. At the event, he discussed his company Extremity Care's products and presented a flier urging the Trump administration to reverse a Medicare reimbursement restriction for his bandages, criticizing President Biden's policies. Following the dinner, Trump shared the flier on social media, and about a month later, the Trump administration announced a delay in implementing the Biden administration's plan to limit Medicare coverage for these products.",
  "argos_id": "0CP83VO65"
}