{
  "url": "https://finance.yahoo.com/news/uk-debt-gdp-countries-chart-imf-133514944.html?_guc_consent_skip=1754574027",
  "authorsByline": "Tola Onanuga",
  "articleId": "c759757e1ed4477da6741adeb11ef320",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/sR0eqekUHtT1lQxXSWcHnw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://s.yimg.com/os/creatr-uploaded-images/2025-07/614f78b0-6443-11f0-bdef-dbd1304f9958",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:35:52+00:00",
  "addDate": "2025-08-07T13:42:04.153748+00:00",
  "refreshDate": "2025-08-07T13:42:04.153750+00:00",
  "score": 1.0,
  "title": "How the UK's huge debt pile compares with other nations",
  "description": "Our chart, compiled using IMF data on government debt, reveals stark differences between many leading economies.",
  "content": "On Wednesday, UK think tank National Institute of Economic and Social Research (NIESR) released a report forecasting that Reeves was on course to miss her borrowing targets by £41.2bn.\n\nThe think tank also posed a solution: Reeves should raise taxes immediately. It recommended \"a moderate but sustained increase\", including reform of the council tax system to make up the shortfall.\n\nGetting debt on a downward path has been flagged as a priority for the government. In July, Darren Jones, chief secretary to the Treasury, said: “We are committed to tough fiscal rules, so we do not borrow for day-to-day spending and get debt down as a share of our economy.\"\n\nThe recent sharp selloff in government bonds – known as gilts in the UK – has pushed yields higher, further adding to the debt pile.\n\nThe UK is far from alone in its concerns about growing debt, though, particularly in the wake of US president Donald Trump's tariff threats. Data compiled by the International Monetary Fund (IMF) showed the debt-to-GDP ratio – a signifier that the country will face difficulties servicing its debt – of the UK and other leading economies. The UK's ratio stands at 104%, according to the data.\n\nJapan tops the IMF's list by a long margin, with a debt-to-GDP ratio of 235% – more than double that of the UK. Japan has traditionally relied on longer-dated bond yields to navigate its huge debt. However, buyers have recently begun to turn their backs on the Japanese bond market, sparking concern for the country's long-term financial outlook.\n\nRead more: Europe's most expensive city revealed, as living costs near £3,500 per month\n\nMeanwhile, the US has the second-highest debt-to-GDP ratio of the listed countries, with a total of 123%. Worries about the country's mounting debt have been growing throughout 2025. Trump's tax-cut bill, which was signed into law in July, has heightened these concerns.\n\nThis chart uses the IMF's data to compare the debt-to-GDP ratio of selected leading economies, revealing stark differences and approaches to public finances.\n\nDownload the Yahoo Finance app, available for Apple and Android.",
  "medium": "Article",
  "links": [
    "https://secure.money.com/pr/gcc371fcbd39?s1=POM&s2=Vertical",
    "https://urldefense.com/v3/__https:/itunes.apple.com/ca/app/yahoo-finance/id328412701?mt=8__;!!Op6eflyXZCqGR5I!HSYygYiOZE4cE_v7LmxQxQPGC_FaM5DhawSrS4MKVEgNCPGaT0CgAfqWVnBG7lGnlb0YBsz3XdQ6kFDVP28XucbltVJuW5al7w$",
    "https://www.imf.org/external/datamapper/GGXWDG_NGDP@WEO/OEMDC/ADVEC/WEOWORLD",
    "https://uk.finance.yahoo.com/video/bonds-why-matter-113634072.html",
    "https://uk.finance.yahoo.com/news/europe-most-expensive-city-london-050026467.html",
    "https://uk.finance.yahoo.com/news/uk-government-borrowing-debt-june-064230546.html",
    "https://uk.finance.yahoo.com/news/rachel-reeves-tax-rises-autumn-budget-111905917.html",
    "https://uk.finance.yahoo.com/news/buyers-flee-japanese-bonds-political-071155686.html",
    "https://finance.yahoo.com/news/trump-tax-law-add-3-185551565.html",
    "https://uk.finance.yahoo.com/news/uk-borrowing-higher-forecast-june-070130699.html",
    "https://secure.money.com/pr/o6b65fc0921a?s1=POM&s2=Vertical",
    "https://urldefense.com/v3/__https:/play.google.com/store/apps/details?id=com.yahoo.mobile.client.android.finance&hl=en__;!!Op6eflyXZCqGR5I!HSYygYiOZE4cE_v7LmxQxQPGC_FaM5DhawSrS4MKVEgNCPGaT0CgAfqWVnBG7lGnlb0YBsz3XdQ6kFDVP28XucbltVLAtVGXhQ$",
    "https://uk.finance.yahoo.com/news/uk-taxpayers-sp500-london-stock-exchange-pension-funds-103806112.html",
    "https://secure.money.com/pr/s9a5a78207a8?s1=POM&s2=Vertical"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "growing debt",
      "weight": 0.10303243
    },
    {
      "name": "debt",
      "weight": 0.10143104
    },
    {
      "name": "UK think tank",
      "weight": 0.08262223
    },
    {
      "name": "government bonds",
      "weight": 0.07378691
    },
    {
      "name": "UK",
      "weight": 0.06873343
    },
    {
      "name": "other leading economies",
      "weight": 0.06755399
    },
    {
      "name": "GDP",
      "weight": 0.06488254
    },
    {
      "name": "selected leading economies",
      "weight": 0.0644577
    },
    {
      "name": "tough fiscal rules",
      "weight": 0.058773354
    },
    {
      "name": "Donald Trump",
      "weight": 0.057148628
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.9873046875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.94921875
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.87890625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.77685546875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.466796875
    }
  ],
  "sentiment": {
    "positive": 0.0859375,
    "negative": 0.75683594,
    "neutral": 0.15722656
  },
  "summary": "UK think tank NIESR has warned that the UK's borrowing target will be £41.2bn, and suggested that Treasury Secretary Robert Reeves should raise taxes immediately. The think tank recommended a moderate increase, including reform of the council tax system to cover the shortfall. The debt-to-GDP ratio, a signifier that the country will face difficulties servicing its debt, stands at 104%, according to data compiled by the International Monetary Fund (IMF). Japan tops the IMF's list by a long margin, with a debt to GDP ratio of 235%, more than double that of the UK. Meanwhile, the US has the second-highest debt-To-GIP ratio of 123%. Worries about the country's debt have been growing throughout 2025.",
  "shortSummary": "The UK faces growing debt and a potential debt crisis due to rising government debt, prompting calls for tax increases and reforms to address it.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "025f3c3d5b374f32b4859b87206f244c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://uk.finance.yahoo.com/news/uk-borrowing-higher-forecast-june-070130699.html",
      "text": "Chancellor Rachel Reeves is facing further pressure over the UK’s public finances after official figures showed higher-than-expected government borrowing last month due to soaring debt interest payments.\nThe Office for National Statistics (ONS) said June borrowing rose to £20.7 billion last month – £6.6 billion higher than a year earlier and the second highest June borrowing since records began, only behind that seen in 2020 at the height of the pandemic.\nThe ONS said interest payable on debt jumped to £16.4 billion due to a large rise in Retail Prices Index (RPI) inflation impacting index-linked government bonds.\nJune borrowing was higher than the £17.6 billion expected by most economists and the £17.1 billion forecast by Britain’s independent economic forecaster, the Office for Budget Responsibility (OBR).\nThe figures have stoked fears that the Government will be forced to hike taxes in the autumn budget, with experts warning over “sin taxes” among measures to help the Chancellor balance the books.\nBank of England governor Andrew Bailey told MPs on Tuesday he was “not unconcerned” by increased Government borrowing.\nBut Mr Bailey stressed in the Treasury Select Committee session that it was part of a global trend.\n“The cost of borrowing has increased… but the important thing to say is that it is a global phenomenon,” he said.\nBorrowing for the first three months of the financial year to date stood at £57.8 billion, £7.5 billion more than the same three-month period in 2024, according to the ONS.\nThe ONS said so-called compulsory social contributions, largely made up of national insurance contributions (NICs), jumped by £3.1 billion to £17.5 billion last month – the highest ever recorded for June.\nIn the first three months of the financial year to date, these compulsory social contributions rose to £48 billion, up £7.5 billion year on year and marking another record.\nIt followed the move by Rachel Reeves in April to increase NICs for employers, which has seen wage costs soar for firms across the UK as they also faced a rise in the minimum wage in the same month.\nPublic sector net debt, excluding public sector banks, stood at £2.87 trillion at the end of June and was estimated at 96.3% of gross domestic product (GDP), which was 0.5 percentage points higher than a year earlier and remains at levels last seen in the early 1960s.\nDarren Jones, Chief Secretary to the Treasury, said: “We are committed to tough fiscal rules, so we do not borrow for day-to-day spending and get debt down as a share of our economy.”\nEconomist Rob Wood, at Pantheon Macroeconomics, said the Chancellor has a “major problem” to overcome, “created by U-turns on previously planned spending cuts and possible downgrades to OBR growth forecasts this autumn”."
    },
    {
      "url": "https://finance.yahoo.com/news/trump-tax-law-add-3-185551565.html",
      "text": "(Bloomberg) — President Donald Trump’s recently enacted tax and spending law will add $3.4 trillion to US deficits over a decade and leave millions without health care coverage, according to a new estimate from the nonpartisan Congressional Budget Office.\nMost Read from Bloomberg\n-\nWhy the Federal Reserve’s Building Renovation Costs $2.5 Billion\n-\nSalt Lake City Turns Winter Olympic Bid Into Statewide Bond Boom\nThe CBO score for the law, released Monday, reflects a $4.5 trillion decrease in revenues and a $1.1 trillion decline in spending through 2034, relative to a current-law baseline. The new analysis doesn’t incorporate so-called dynamic effects, such as the impact on growth or interest rates over time that the legislation’s measures might have.\nTrump signed the “One Big Beautiful Bill” into law on July 4 after months of negotiations with congressional Republicans. Encompassing much of Trump’s economic agenda, it permanently extends his 2017 income-tax cuts and some breaks for businesses, lifts the cap on federal deductions for state and local taxes and eliminates taxes on tips and overtime on a temporary basis, among other provisions.\nPassage of the law triggered warnings from some economists and investors about a widening of America’s budget shortfall — already large by historical standards — that could push borrowing costs and inflation up. The Trump administration points to record collections from the tariffs he’s imposed on most US imports this year, saying that revenue will help fill the gap.\nA number of spending cuts were included in the tax law in an effort to reduce deficits and offset the cost, including to Medicaid, which provides health insurance for low-income people.\nNew work requirements for recipients of Medicaid under the age of 65, are set to begin by the end of 2026. The law also limits states’ ability to tax health care providers to help fund the program. Provisions in the law will result in 10 million Americans losing health insurance by 2034, according to the CBO analysis.\nThe potential loss of health insurance coverage comes as rising prices due to tariffs already threaten to create increased economic hardship for low-income families. June inflation data showed some signs of the levies’ impact on costs and economists expect prices to continue to rise over the summer. This would disproportionately impact low-income Americans as they tend to spend a larger share of their income on necessities, such as food."
    },
    {
      "url": "https://uk.finance.yahoo.com/news/buyers-flee-japanese-bonds-political-071155686.html",
      "text": "TOKYO (Reuters) -Japanese government bonds tumbled on Wednesday, sending benchmark yields to near 17-year highs, as traders priced in increased political risks and a hazy outlook for the central bank's policy normalisation path.\nIn a sign of how nervous markets are, the Ministry of Finance's first sale of super-long government debt since a bruising electoral defeat for Prime Minister Shigeru Ishiba logged the weakest demand in almost 14 years.\nIn a whirlwind day of news, the United States and Japan announced a trade deal, speculation swirled that Ishiba planned to resign, and a Bank of Japan (BOJ) official warned of an economic slowdown.\nThe 10-year JGB yield jumped as much as 10 basis points (bps) to 1.6%, marking its biggest move in months and the highest level since October 2008.\nSuper-long term JGB yields hit record highs in May and are back near those levels as concerns mount over Japan's precarious finances.\n\"We're seeing a possible buyers' strike playing through,\" said Chris Weston, head of research at broker Pepperstone.\n\"Inflation is running far too hot for where interest rates are. The question is why would you buy at these levels?\" he said, adding he expected the selloff could extend to UK gilts too.\nSunday's defeat for Ishiba's Liberal Democratic Party and coalition partner Komeito follows their loss of a majority in the more powerful lower house last year. Opposition parties have advocated for tax cuts and increased government spending to help households deal with inflation.\nIshiba plans to resign, a source close to the prime minister said. Local media reported the move could happen by the end of next month. However, the prime minister later said there was no truth to the media reports about his intentions.\n\"Attention will soon turn to the next prime minister's policy agenda and any signals of recalibration from the BOJ as JGB yields climb,\" said Charu Chanana, chief investment strategist at Saxo.\nAfter the election defeat, investors expect whoever replaces the fiscally conservative Ishiba will support calls for more government spending, widening an already bloated fiscal deficit at nearly 2-1/2 times the size of Japan's economy.\nThe election result also puts the Bank of Japan in a double bind as prospects of increased spending could keep inflation elevated while potentially prolonged political paralysis and the impact of the trade war provide compelling reasons to go slow on rate hikes.\n\"The market's first instinct was to mark up political risk premia,\" said Shoki Omori, chief desk strategist at Mizuho Securities, referring to reports of Ishiba's resignation."
    },
    {
      "url": "https://uk.finance.yahoo.com/news/uk-taxpayers-sp500-london-stock-exchange-pension-funds-103806112.html",
      "text": "“We’re not advocating for a mandate,\" David Schwimmer, CEO of the London Stock Exchange Group (LSEG.L), said in an interview with Yahoo Finance UK's Market Sunrise show.\nHe explained that UK pension funds have historically decreased their allocations to UK-listed assets \"dramatically\", from over 40% to just 4% over the past 25 years. Schwimmer argued that pension funds should allocate a minimum percentage of their investments back into UK markets, particularly given the tax benefits they receive.\n\"The issue is that the pension funds get £49bn a year in tax benefits from the government, from UK taxpayers,\" Schwimmer said. \"If they are getting those tax benefits and then they're investing in US equities, you basically have the UK taxpayer subsidising the cost of capital in, I'll say, the S&P 500 (^GSPC), which doesn't make a ton of sense from a policy perspective.\"\nWhile Schwimmer did not advocate for a mandate, he suggested that \"it's reasonable to have those tax benefits that the pension funds are currently getting be conditional on some kind of minimal threshold investment in the domestic background. I'll throw out 10% but I'll let the policy experts figure out what the right number is.\"\nEarlier this year, Reeves had suggested the introduction of a “backstop” power that would compel pension funds to invest in British assets if necessary. Her proposals gained some traction, with 17 pension funds agreeing under the Mansion House Accord to allocate at least 5% of their assets to the UK by 2030. This commitment includes giving the government the power to enforce domestic investment in the event that voluntary contributions fall short.\nThe reforms will form part of the Pension Schemes Bill, which is about to go before parliament.\nThe new approach would mean over £50bn of additional investment in UK infrastructure, new homes and businesses, the Treasury said.\nLondon's IPO struggles amid New York allure\nThe UK’s declining IPO activity has been a persistent issue, with the number of listings at the London Stock Exchange falling to a 30-year low. But Schwimmer acknowledged that the broader global trend has seen a dip in listings, especially with the rise of private capital.\n\"The number of listings on a global basis has declined. In New York, for example, the number of listings is down by 40% over the last 10 years or so,\" he added.\nThe UK has been working to reform its listings regime to make the market more attractive. \"If you go back a few years, there were some rules that were probably overly conservative and hadn't really moved along with how markets were operating around the world,\" Schwimmer said, referring to changes like the acceptance of dual-class share structures and the loosening of free float requirements for new listings.\n\"All these different aspects have been viewed as very attractive and helpful, so we are now actually seeing a growing pipeline and an increasing number of companies looking to list here,\" he added.\nDespite these efforts, Schwimmer admitted that the UK market still faces intense competition from other exchanges, particularly New York, which has seen a resurgence in listings in 2025.\nSchwimmer was quick to point out, however, that not all companies are suited for the US market. “There are many companies where it does not make sense to list or go to New York,\" he said. \"In the past 10 years, 20 companies or so have gone from the UK and listed in New York and raised over $100m. Of that 20, three of them have their stock trading up. Of the rest, I think eight of them have delisted, and the remainder are trading down like 70% or so.\"\nHe also pointed out that many companies, particularly smaller ones, benefit from the personalised attention they receive in London in contrast to the more crowded US market.\n\"They don’t get the right attention from investors, from research analysts.\" For these companies, Schwimmer argued, \"it makes much more sense to be listed and trading in the UK.\"\nDespite the challenges facing the UK market, Schwimmer remains confident in London’s long-term position as a global financial hub. While the number of listings may be down, the capital’s strength lies in its international appeal.\n\"London is by far the leading stock exchange in Europe, and it is also the most international financial centre, attracting capital from the UK, US, EU, the Middle East and Asia,\" Schwimmer said.\nHe acknowledged that New York’s appeal cannot be dismissed but argued that for many companies, London is \"absolutely\" is better.\n24-hour trading under discussion\nWhen asked about the potential for 24-hour trading at the London Stock Exchange, Schwimmer said that while nothing has been decided yet, LSEG is actively exploring the idea.\n\"We are looking at whether we should be changing our hours. We haven't made any decisions, and anything that we would do would happen in consultation with the market, our users, and of course, we would work closely with the regulators,\" he said. \"Nothing has been decided at this point, but it's something we are certainly thinking about.\"\nThis would require navigating some challenges, including technological upgrades, regulatory considerations, and potential impacts on liquidity and dual-listed companies.\nWhile cryptocurrencies such as bitcoin (BTC-USD) already trade 24/7 and more investors are turning to platforms such as Robinhood (HOOD) to trade shares after hours, stocks listed on the London Stock Exchange remain confined to traditional UK trading hours, running from 8am to 4:30pm.\nGlobally, other exchanges are also eyeing extended hours. In late 2023, the New York Stock Exchange proposed a shift, requesting US regulators to expand its trading window from the current 9:30am–4pm schedule to a new span of 1:30am–11:30pm.\nHowever, such changes come with concerns. Critics, including some brokers, warn that extended hours could complicate the clearing process and require significant operational shifts. Additionally, open-ended fund managers, who calculate daily values at market close, could face challenges with pricing and liquidity in a round-the-clock trading environment.\nAI and the future of finance\nThe London Stock Exchange Group has diversified over the years, with its data and analytics business now comprising the bulk of its revenues. The company’s strategic pivot into financial data services, which involves providing access to market information for a wide range of clients, including banks, brokers, and asset managers, has positioned it as a key player in the financial data sector. This transformation was bolstered following LSEG’s $27bn acquisition of Refinitiv, the financial data provider, in 2019.\nSchwimmer also discussed the growing role of AI at LSEG, highlighting that AI is already a major part of the company’s operations.\n\"AI is already playing a significant role in our business, both internally and externally,\" he said, adding that internally, AI is being used to increase efficiency, streamline operations, and improve data ingestion.\nThe CEO highlighted a partnership with Microsoft (MSFT), which took a stake in LSEG a few years ago. \"We’ve been collaborating with Microsoft to make our products interoperable with the Microsoft productivity suite, including tools like Excel and PowerPoint. This allows bankers and other financial users to use basically modelling, which, if you're in that space, is incredibly helpful and useful,\" Schwimmer explained.\nRevenues at LSEG rose 7.8% to £4.49bn in the first six months of the year, exceeding analysts’ expectations. The company made just £205m from its equities division over the same period, or 4.6% of its overall revenues. LSEG also announced a £1bn share buyback."
    },
    {
      "url": "https://uk.finance.yahoo.com/news/europe-most-expensive-city-london-050026467.html",
      "text": "London has overtaken other European capitals to become the most expensive city in Europe, with monthly living costs for a single person averaging £3,255, according to new data from uk-lifeinsurance.com.\nThe report breaks down monthly costs as approximately £1,063 for basic living expenses such as food, transport and utilities, with city-centre rents averaging £2,191. This means an individual would need to earn at least £50,000 annually post-tax, roughly equivalent to a pre-tax salary of over £70,000, to comfortably meet basic outgoings.\nLondon ranks 19th out of 20 major global cities for quality of life, with just Milan scoring lower. Analysts cited high housing costs and steep daily living expenses as major factors dragging down London’s liveability.\nRead more: This bank has the cheapest mortgage rate for first-time buyers this week\nBy contrast, cities such as Barcelona and Madrid offer significantly lower monthly costs, making them increasingly attractive to younger professionals and budget-conscious city dwellers seeking a comparable urban lifestyle. Even traditionally expensive European capitals such as Amsterdam and Paris fall below London in the latest cost rankings.\nOutside Europe, only New York and San Francisco are more expensive than London, though they often rank higher in quality-of-life indices due to factors like healthcare, infrastructure, and public services.\nOne area where London remains competitive, however, is insurance costs. The average monthly insurance spend in the capital – spanning home, car and life cover – stands at just £126, significantly lower than New York’s £375. Only Berlin and Tokyo report lower average insurance costs.\n“London continues to be an expensive place to live as the cost of living has risen in recent years, as well as rising house prices,” said Lasee Kurkaa of uk-lifeinsurance.com. “However, other costs, such as insurance, are significantly cheaper than in other cities in the US and Europe.”\nRead more: Should you invest in gold?\n“Our recent survey across 2,000 Brits found that despite its relative affordability compared to other products, only half of Brits believe they can afford life insurance,” Kurkaa added. “More needs to be done to demonstrate the value of insurance and benefit for people’s finances in the long term, especially as costs continue to rise.”\n“It’s important people continue to budget for expenses that can benefit them in the long term,” she said, “such as life insurance, which can be a huge relief for families if the worst were to happen.”\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
      "url": "https://urldefense.com/v3/__https:/play.google.com/store/apps/details?id=com.yahoo.mobile.client.android.finance&hl=en__;!!Op6eflyXZCqGR5I!HSYygYiOZE4cE_v7LmxQxQPGC_FaM5DhawSrS4MKVEgNCPGaT0CgAfqWVnBG7lGnlb0YBsz3XdQ6kFDVP28XucbltVLAtVGXhQ$",
      "text": "Yahoo Finance app is the premier app used by millions to track the markets and the economy. With Yahoo Finance you can keep close tabs on the daily movers so that you are informed around the clock about Finance news so you are well equipped to make the best possible trade.\nWhether you trade stocks, crypto, or bonds, you can execute with confidence that Yahoo Finance will keep you updated with personalized news and alerts. Access real-time stock, crypto, or bond market information and investment updates to stay on top of the market.\nYahoo Finance features:\n“Home”\n• Track the performance of your personal portfolio\n• Link your portfolio to Yahoo Finance and keep tabs of your holdings on the go. See your holding’s daily performance at a glance in the “Home” tab\n• Follow stocks to get real-time quotes and personalized news. Get push notifications from markets like NASDAQ, Dow Jones, BTC, CMC Crypto 200, Oil prices, Bond market, Gold and more. Never miss a beat in the economy\n• Discover detailed financial information such as historical financials, ESG ratings, and top holders, invest with confidence with Yahoo Finance at your fingertips\n• Go beyond stocks and track currencies, bonds, commodities, equities, world indices, and futures\n• Compare and evaluate stocks with interactive full screen charts\n“News”\n• Read detailed breaking finance news about individual stock, equity, or general economy in relation to what is happening throughout the day by our premier editorial team who will break down individual stories so you get the best detail of the subject\n• Make articles font sizes larger or smaller depending on your device’s screen size or preference\n• Share out interesting articles you came across with your network easily with the “share” button or “copy to clipboard” UI icons\n“Discover”\n• See the winners and losers, trending equities, or which equities has the most activities throughout the trading day\n• Keep tabs on investment strategies, signals and upcoming financial events.\n• Dig through the equity, crypto, ETF, mutual fund, or options tabs to see what is trending in each category of your choosing. Invest with the latest information available by Yahoo Finance\n“Market”\n• Keep tabs on the US, Europe, and Asia market with Yahoo Finance. You will quickly find top gainers and losers for each region\n“Account”\n• Sign in to view and edit your web portfolio on the go\n• Customize your alerts for news, and stock pricing so you can keep tabs on your stocks\nHelpful tips:\n• Follow all the stocks you care about by searching for the ticker and tapping the star icon\n• Create multiple watchlists to organize the stocks you follow\n• Enable notifications for price alerts, breaking news, earnings reports, and more\n• Sync your portfolios across devices\nNever invest without the Yahoo Finance App again. We will equip you with the best financial information and analysis available so that you can confidently invest knowing that you are up to date with everything that is going on in the market in relation to news, stocks, crypto, bonds, ETF, mutual funds, or options.\nPrivacy Policy: https://legal.yahoo.com/us/en/yahoo/privacy/index.html\nTerms of Service: https://legal.yahoo.com/us/en/yahoo/terms/otos/index.html"
    },
    {
      "url": "https://uk.finance.yahoo.com/news/rachel-reeves-tax-rises-autumn-budget-111905917.html",
      "text": "In this article:\nChancellor Rachel Reeves must raise taxes immediately in order to plug a fresh £50bn hole in public finances, a UK thinktank said on Wednesday.\nAccording to the National Institute of Economic and Social Research (NIESR), UK government finances have been hit by slowing economic growth, a weak jobs market and the cost of Labour’s U-turns on welfare spending.\nNIESR recommended \"a moderate but sustained increase in taxes\" including reform of the council tax system to make up the shortfall. It also suggests that the government could raise revenue through changes to the scope of VAT, pensions allowances and prolonging the freeze in income tax thresholds, which is set to end in 2028.\nReeves is now on course to miss her borrowing targets by £41.2bn, NIESR predicted in its report, facing an \"impossible trilemma\" of big tax hikes, spending cuts or a change to fiscal rules that she has said are non-negotiable.\nNIESR added that if she also wants to restore the £9.9bn of headroom maintained since last year’s budget, she must raise taxes or cut spending by £51.1bn in the autumn budget statement.\nIn its manifesto, Labour promised not to raise taxes such as income tax, VAT or national insurance on \"working people\".\nRead more: UK taxpayers ‘subsidising’ S&P 500, says LSEG boss\nNIESR nudged up its forecast for British economic growth for this year to 1.3% from its forecast of 1.2% in May. However, it cut its projections for all the following years up to 2030, largely due to the impact of US president Donald Trump's trade tariffs on the global economy.\nThe forecasts are significantly weaker than those of the Office for Budget Responsibility (OBR), whose projections underpin the government's tax and spending plans. NIESR expects 1% growth in 2028 compared with the OBR's 1.7%.\nStephen Millard, NIESR's deputy director for macroeconomics, said the difference between those forecasts and NIESR's £41bn estimate of the shortfall probably lay largely in the think tank's lower forecasts for economic growth.\nIt comes just a year after Rachel Reeves attacked the Conservative government for leaving an alleged £22bn black hole in the public finances. But shadow chancellor Mel Stride claimed the black hole was a result of Labour’s “economic mismanagement”.\nStride said: “Labour will always reach for the tax-rise lever because they don’t understand the economy. Businesses are closing, unemployment is up, inflation has doubled and the economy is shrinking. And Labour are refusing to rule out more damaging tax rises on investment.”"
    },
    {
      "url": "https://uk.finance.yahoo.com/news/uk-government-borrowing-debt-june-064230546.html",
      "text": "In this article:\nThe UK government borrowed more than expected in June as debt interest payments jumped, piling further pressure on chancellor Rachel Reeves.\nFigures from the Office for National Statistics (ONS) showed that public sector net borrowing reached £20.7bn in June — £3.5bn higher than the £17.1bn forecast by the Office for Budget Responsibility (OBR), and £6.6bn above the same month in 2024.\nThis was the second highest borrowing figure since monthly records began in 1993, after that of June 2020 during the COVID-19 pandemic.\nThe ONS said that the public sector had spent more than it received in taxes and other income so far in this financial year. Provisional estimates showed it borrowed £57.8bn over this three month period, which was £7.5bn more than the same period last year, but was in line with the latest OBR forecast. The UK statistics authority said the current budget deficit was £44.5bn in this period, which was £6.5bn more than the same three months in 2024 and was the highest since 2021.\nRichard Heys, acting chief economist for the ONS, said: \"The rising cost of providing public services and a large rise this month in interest payable on index-linked gilts pushed up the overall spending more than the increases in income from taxes and national insurance (NI) contributions, causing borrowing to rise in June.\"\nCentral government receipts rose by £5.7bn year-on-year to £86.8bn in June, boosted by a £1bn increase in income tax, £700m more in value added tax (VAT) and £500m in corporation tax receipts. An increase in employer NI contributions contributed to a £3.1bn rise in compulsory social contributions, bringing that total to £17.4bn.\nHowever, provisionally estimates showed that government spending rose to £97.1bn in June, up by £12.4bn compared to the same month last year. An £8.4bn increase in government debt interest payable to £16.4bn was among the key drivers, along with rises in departmental spending and net social benefits.\nAlex Kerr, UK economist at Capital Economics, said \"total government expenditure came in £2.2bn above the OBR’s forecast. That was due to hotter-than-expected retail prices index (RPI) inflation in Q2 pushing up debt interest payments to £16.4bn, £2.4bn above the OBR’s forecast and to the second highest June total since monthly records [on government interest payments] began in 1997.\""
    }
  ],
  "argos_summary": "The National Institute of Economic and Social Research (NIESR) has forecasted that UK Chancellor Rachel Reeves will miss her borrowing targets by £41.2 billion, urging immediate tax increases to address a £50 billion shortfall in public finances. The report highlights rising government borrowing due to increased debt interest payments and suggests reforms to the council tax system and VAT to raise revenue. With public sector net debt reaching £2.87 trillion, concerns are mounting over the sustainability of the UK's fiscal policies amid slowing economic growth.",
  "argos_id": "13ICIIKWW"
}