{
  "url": "https://www.engadget.com/audio/sonos-is-raising-prices-this-year-to-make-up-for-tariff-expenses-123031336.html",
  "authorsByline": "Mariella Moon",
  "articleId": "1167451469b04cd2b125cb613c59e77a",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-08%2Fdb895d80-7361-11f0-bebe-8d5f1753ea00&resize=1400%2C933&client=19f2b5e49a271b2bde77&signature=d8a9ea4b7fcc48e5af2daafa70ea338bc29e9c97",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-07T12:30:31+00:00",
  "addDate": "2025-08-07T12:40:30.614091+00:00",
  "refreshDate": "2025-08-07T12:40:30.614092+00:00",
  "score": 1.0,
  "title": "Sonos is raising prices this year to make up for tariff expenses",
  "description": "Sonos plans to raise prices across its products later this year in order to minimize the impact of tariffs on its earnings.",
  "content": "Sonos plans to raise prices across its products later this year in order to minimize the impact of tariffs on its earnings, the company has revealed alongside its financial results [PDF] for the third quarter of 2025. It hasn't listed the products and their new prices yet, but it said that it's evaluating any changes it might need to its promotional strategies and that it has flexibility to move production between Vietnam and Malaysia as needed. To note, the Trump administration had imposed a 20 percent tariff on imports from Vietnam and a 19 percent tariff on imports from Malaysia. Sonos also said that it will invest on diversifying its geographic footprint and expanding its presence in markets that represent only a small share of its revenue today to drive growth.\n\nThe company took steps to diversify its supply chain last year, which led to its manufacturing facilities in the two aforementioned countries. It now only relies on Chinese plans for products bound to the US for a limited number of accessories, such as speaker stands. Still, for the third quarter of 2025, tariffs reduced Sonos' gross margin for the third quarter by $2.1 million and its cash flow by $3.5 million. In the fourth quarter of the year, which covers the holiday shopping season, Sonos expects tariffs to reduce its gross margin by $5 million and to remove between $8 to $10 billion from its cash flow.\n\nOverall, Sonos posted a revenue of $344.8 million in the third quarter, which is almost $100 million larger than its revenue for the fourth quarter of 2024. It's not a secret that 2024 was a tough year for the company. It rolled out a major update that broke its app, which led to the delay of product releases as it worked to fix the issue. Former Sonos CEO Patrick Spence even stepped down in the beginning of 2025 and was replaced by ex-Snap executive Tom Conrad.",
  "medium": "Article",
  "links": [
    "https://s22.q4cdn.com/672173472/files/doc_financials/2025/q3/FINAL-3Q25-Earnings-Slides-POST-CALL-pptx.pdf",
    "https://www.engadget.com/big-tech/sonos-gets-to-keeps-its-ceo-as-a-treat-164559137.html",
    "https://www.engadget.com/audio/speakers/why-is-the-sonos-app-so-broken-140028060.html",
    "https://www.macrumors.com/2025/08/06/sonos-price-increase/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last year",
      "weight": 0.08988953
    },
    {
      "name": "product releases",
      "weight": 0.08804129
    },
    {
      "name": "Former Sonos CEO Patrick Spence",
      "weight": 0.08791098
    },
    {
      "name": "tariff expenses",
      "weight": 0.08348177
    },
    {
      "name": "tariffs",
      "weight": 0.08241547
    },
    {
      "name": "Sonos",
      "weight": 0.08232837
    },
    {
      "name": "products",
      "weight": 0.080665216
    },
    {
      "name": "ex-Snap executive Tom Conrad",
      "weight": 0.078143395
    },
    {
      "name": "prices",
      "weight": 0.06612364
    },
    {
      "name": "Patrick Spence",
      "weight": 0.061097976
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9921875
    },
    {
      "name": "/Business & Industrial/Manufacturing/Other",
      "score": 0.71142578125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.6787109375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.358642578125
    }
  ],
  "sentiment": {
    "positive": 0.043670654,
    "negative": 0.7416992,
    "neutral": 0.21447754
  },
  "summary": "Sonos is planning to raise prices across its products later this year to reduce the impact of tariffs on its earnings. The company has revealed that it plans to do so to mitigate this, as tariffs were imposed by the Trump administration, including a 20 percent tariff on imports from Vietnam and a 19 percent tariff from Malaysia. Sonos also plans to invest in diversifying its geographic footprint and expanding its presence in markets that represent only a small portion of its revenue. Despite this, tariffs reduced Sonos' gross margin for the third quarter of 2025 by $2.1 million and its cash flow by $3.5 million, and it expects tariffs to reduce its gross margin by $5 million and remove between $8 to $10 billion from its cash cash flow in the fourth quarter of the year.",
  "shortSummary": "Sonos plans to raise prices to reduce costs and diversify its geographic footprint, despite facing significant losses due to tariffs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fe3cc07656e14e2a89de3db2f50fde5f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.engadget.com/big-tech/sonos-gets-to-keeps-its-ceo-as-a-treat-164559137.html",
      "text": "Sonos gets to keep its CEO, as a treat\nThe company would like to think its terrible 2024 is in the rear view mirror.\nSonos’ Very Bad 2024 is well documented. Its redesigned app endured a disastrous launch, to the extent that it was initially fundamentally broken. The company was then forced to delay two product launches in order to fix the botched software that its devices are so reliant on. And in the wake of the mess, the company’s then CEO Patrick Spence stepped down at the beginning of 2025. He was replaced by Tom Conrad on an interim basis, but after seemingly steadying what looked like a sinking ship, the former Snap executive has been handed the job permanently.\nConrad had been on the board of directors at Sonos since 2017 and conceded after taking the top job back in January that the company had \"let far too many people down.\" Shortly after that he announced that around 200 jobs would be cut as part of a \"reorganizing' of the company’s product division, before it reportedly canceled its long-rumoured video streaming device far into its development. This was followed by Sonos ending its partnership with IKEA in May.\nFormer CEO Patrick Spence said in an earnings call last year that the total cost of fixing the many issues with the Sonos app was between $20 and $30 million. In a significant recent update to its flagship Sonos Ace headphones, the company finally introduced the TrueCinema feature that was promised when the headphones launched in 2024. This uses a supported Sonos soundbar to measure the acoustics of your room and then channels the data into the delivery of spatial audio in the headphones, making it sound more convincing.\nIn a statement, Sonos’ now-permanent CEO said he was \"excited to move from rebuilding to imagining the next generation of experiences.\""
    },
    {
      "url": "https://www.macrumors.com/2025/08/06/sonos-price-increase/",
      "text": "Sonos to Increase Prices Due to Tariffs\nSonos plans to raise prices for some of its products later this year because of tariff costs, the company said in its third fiscal quarter earnings presentation [PDF].\nSonos manufactures its devices in Vietnam and Malaysia, and the countries are facing tariffs of 20 percent and 19 percent, respectively. In the third fiscal quarter, tariffs cost Sonos $2.1 million, and the company estimated that costs would increase to $5 million in the fourth fiscal quarter of 2025. Sonos said that the estimate for 4Q 2025 reflects the prior 10 percent tariff rate on in-transit inventory that will arrive during the quarter, and future quarters \"may differ.\"\nTo minimize the impact of tariffs, Sonos says that it will raise prices across its portfolio of products. Sonos also plans to invest in diversifying its geographic footprint to drive growth in the future.\nSonos did not outline which products will see price hikes, but said that the increases will come later in 2025.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nPopular Stories\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to...\niOS 26 introduces an Adaptive Power Mode on the iPhone, alongside the existing Low Power Mode.\nApple says that Adaptive Power Mode can make \"small performance adjustments\" when necessary to extend an iPhone's battery life, including slightly lowering the display brightness or allowing some activities to \"take a little longer.\"\nThe full description of Adaptive Power Mode, from the iOS 26...\nThe latest iOS 26 beta includes imagery that confirms Apple's work on a new version of the Apple Watch Ultra, which is set to come out this fall. MacRumors contributor Aaron Perris found an Apple Watch image with a resolution that does not correspond to any current Apple Watch models.\nThe image suggests that the upcoming Apple Watch Ultra 3 could have a slightly larger display size, with a...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nApple is still on track to release a new Apple TV model later this year, according to a reliable source speaking to MacRumors.\nAccording to a source familiar with the company's plans, Apple is highly likely to replace the current Apple TV 4K with a new model later this year. The current model will be discontinued.\nToday's Apple TV 4K came out in 2022, featuring the A15 Bionic chip,...\nGoogle today used Apple's Siri failure to lure customers to the upcoming Pixel 10 series, sharing an ad that calls out the delayed Apple Intelligence Siri functionality.\nWith the spot, Google is shaming Apple for the misstep, suggesting Apple users should purchase a Pixel 10 smartphone instead.If you buy a new phone because of a feature that's coming soon...\nBut it's been coming soon for...\nApple seeded the fifth developer beta of iOS 26 today, and while the number of significant changes has dropped, there are quite a few smaller tweaks. Apple is continuing to refine button placement, animations, and design in preparation for launching iOS 26 in September.\nCamera\nApple added a toggle in the Camera app to allow users to toggle on Classic Mode, a setting that reverses the scroll ...\nApple today released a firmware update for the 25W MagSafe Charger that is compatible with the iPhone 12 and later and the latest AirPods. The new firmware is version 2A168, up from the 2A146 firmware that came out last year. In the Settings app, the new firmware is version 148, up from 136.\nApple introduced the 2024 MagSafe charger alongside the iPhone 16 models back in September, and it is ..."
    },
    {
      "url": "https://www.engadget.com/audio/speakers/why-is-the-sonos-app-so-broken-140028060.html",
      "text": "Why is the Sonos app so broken?\nA spring redesign has caused long-term headaches for the company and consumers.\nFollowing a major update back in the spring, the Sonos app was very broken and missing key functionality. The company admitted it made a huge mistake in pushing the redesign too soon and explained that it has since uncovered more “issues” that have prohibited it from adding those missing features. Users were quickly frustrated, and now the company is so mired in fixing its app problem that it delayed two products that are ready to launch ahead of the holiday season. Let’s discuss how we got here, what happened with the app, the consequences Sonos is facing and what likely happens next.\nThe backstory\nSonos released a completely rebuilt version of its app for Android, iOS and desktop in May. The total redesign was focused on making it easier to play different kinds of content while also creating a hub that’s better suited for finding what you need. Of course, it also has to work with the company’s various speakers and soundbars, and the overhaul took place ahead of the release of the first Sonos headphones. Those cans, the Ace, brought new functionality that had to be supported in the app, so the company thought it was time to wipe the slate clean.\n“We viewed re-architecting the app as essential to the growth of Sonos as we expand into new categories and move ambitiously outside of the home,” CEO Patrick Spence said on the company’s Q3 earnings call. “In addition to its more modern user interface, the new app has a modular developer platform based on modern programming languages that will allow us to drive more innovation faster, and thus let Sonos deliver all kinds of new features over time that the old app simply could not accommodate.” He also noted that “performance and reliability issues had crept in” over the company’s history, so the user experience had already suffered as a result of the aging platform.\nSome customers will always be resistant to change. The new customizable interface took some getting used to, but that wasn’t the problem. The app was missing basic features like sleep timers and alarms. Users also reported the inability to rearrange speakers in different rooms, speakers working intermittently and trouble completing other basic tasks. Some say they can’t reliably load the app on the first try.\n“We developed the new app to create a better experience, with the ability to drive more innovation in the future, and with the knowledge that it would get better over time. However, since launch we have found a number of issues,” Spence explained in July. “Fixing these issues has delayed our prior plan to quickly incorporate missing features and functionality.\"\nSpence laid out a roadmap for fixing the problems in the same blog post, which initially included restoring the ability to add new products to your home setup. Even I had trouble adding the Ace headphones to the app at first, but after a few tries I eventually got it. Spence also said that the company had released updates to the app every two weeks since the redesign launched on May 7, and that it would continue that schedule alongside detailed release notes. The most recent version, which included TV Audio Swap with the Ace headphones and older Sonos soundbars, delivered a handful of very basic things — like the ability to clear the queue on the iOS version.\n“Since I took over as CEO, one of my particular points of emphasis has been the imperative for Sonos to move faster,” Spence said on the earnings call. “That is what led to my promise to deliver at least two new products every year — a promise we have successfully delivered on. With the app, however, my push for speed backfired.”\nThe fallout\nCustomers have been understandably upset since early May, which is well-documented in the r/sonos subreddit. But, user satisfaction isn’t the only issue that the company is facing. With the new version of the app so busted it had to be fixed before missing items could be added, Sonos has delayed the launch of two new products that were ready to go on sale in Q4. Spence said that the company enlisted “the original software architect of the Sonos experience,” Nick Millington, to do “whatever it takes” to remedy the issues.\nAnd it’s not just a headache for customers. Sonos dealers and installers, which make up a significant part of the company’s business, are allegedly so frustrated with what they encounter trying to do their jobs that some of them have paused sales. “As an installer when you try and talk this up to somebody to buy, it is extremely embarrassing at this point when you have to just say ‘well, the parent company is having issues,’ it makes you look like the jackass,” one Reddit post explained.\nSpence explained on the company’s Q3 earnings call that the app debacle would cost between $20 and $30 million. CFO Saori Casey said that sum is due to the loss of sales stemming from the software problem and having to delay two new products that would’ve generated more revenue. As such, Sonos had to revise its Q4 financial guidance to lower expectations until this “chapter,” as Spence describes the current fiasco, is resolved.\nWhile the company hasn’t revealed any details on what either of those two now-delayed products might be, there have been rumors that offer some clues. Bloomberg reported in November that the company was working on a soundbar that would surpass the capabilities of its current flagship, the Arc, in addition to a set-top TV streaming box. Both of those products would be hot-ticket items for the holidays, especially for the Sonos faithful.\nBloomberg explained that the new soundbar would likely be $1,200, or $300 more than the Arc. Additionally, the new model would include “new technology” following the company’s acquisition of Mayht Holding BV. In Sonos’ announcement of that move, it said that Mayht “invented a new, revolutionary approach to audio transducers.” More specifically, the company’s engineering methods allow it to build transducers, a basic component of speakers, that are smaller and lighter without sacrificing quality.\nAccording to that same Bloomberg report, the Sonos TV streaming box will be powered by an Android-based OS with various apps for different services. The device is also said to act as a hub for Sonos gear in the home. Dolby Atmos and Dolby Vision should be on the spec sheet, and voice control will reportedly play a significant role in the gadget’s operation.\nBloomberg further explained that Sonos was working on a new high-end amplifier that could cost at least $3,000 and new eight-inch ceiling speakers. Frustrated dealers and installers would likely be hesitant to sell such expensive items with the app in the current state, if Sonos could even add the functionality to make them work. Any of these could be the two products the company was forced to delay, and any of them would’ve likely padded the bottom line before the end of the year. And that would be on top of the early sales of the Ace, a device that should be popular this holiday season.\nWhat happens next?\nSonos has a clear plan for how it intends to fix its buggy app, but there’s no timeline for exactly how long that will take. The company has yet to deliver a TrueCinema feature for its Ace headphones that will map a room (with the aid of a soundbar) to virtually recreate the acoustics for a more realistic experience. And as we learned recently, new products have been delayed for the time being.\n“Building a new software foundation was the right investment for the future of Sonos, but our rollout in May has fallen dramatically short of the mark,” Spence said on the earnings call. “We will not rest until we’ve addressed the issues with our app, and have delivered new versions that materially improve our customers’ experiences.”\nThe company is at a standstill until its app is fixed, with a full product pipeline plugged up for the foreseeable future – if the reports are to be believed. From the looks of it, Sonos planned to release an app that wasn’t completely done, but one that it thought was stable enough to use, with the goal of adding features over time to improve the overall experience. However, the complete rebuild was essential to the new technology and devices Sonos has in the works, since the company has been clear the old app wouldn’t have supported them. And since one of those items was the Ace, Sonos had to decide if it could wait longer to release its first headphones, a highly-anticipated product, or just go ahead with what it had.\nIf you buy something through a link in this article, we may earn commission."
    }
  ],
  "argos_summary": "Sonos plans to increase prices on its products later this year to offset the financial impact of tariffs imposed on imports from Vietnam and Malaysia, which have already cost the company millions in gross margin and cash flow. The company is also focusing on diversifying its supply chain and expanding into new markets to drive future growth. Additionally, Sonos is recovering from a challenging 2024 marked by a problematic app redesign that led to product delays and management changes.",
  "argos_id": "14AK2BU9S"
}