{
  "url": "https://www.nytimes.com/athletic/6537093/2025/08/07/rodrigo-de-paul-inter-miami-argentina-mls-messi/",
  "authorsByline": "Felipe Cardenas",
  "articleId": "8d7e3d846db64a2f9ee3697652691260",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/06004055/USATSI_26744720-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T12:51:12+00:00",
  "addDate": "2025-08-07T13:05:26.736203+00:00",
  "refreshDate": "2025-08-07T13:05:26.736209+00:00",
  "score": 1.0,
  "title": "Rodrigo De Paul interview: Joining Miami, teaming with Messi, idolizing Beckham",
  "description": "De Paul brings his unique attributes to Miami, which hopes he's the missing piece in the quest to lift MLS Cup",
  "content": "Rodrigo de Paul has been called many things. In Argentina he’s known as El Motorcito (the little engine) due to his tireless play and high-tempo personality on the pitch. In other parts of the world, and especially for English-language audiences, the 31-year-old central midfielder is recognized as Lionel Messi’s on-field bodyguard.\n\nIf the equivalent of a football skirmish breaks out when Argentina and Messi are protagonists, De Paul is there to provide a snark remark or an ominous stare at an opponent. If you kick Messi, it’s almost a given that De Paul will remember your shirt number and get his retaliation at some point. So is he a modern version of the football hard man or an old-school enforcer?\n\nThe truth lies somewhere between the type of player De Paul was when he broke out at Udinese, then a 22-year-old No. 10, and who he has become in 2025. The bodyguard moniker can lead to misinformed opinions about a player with a contemporary player profile.\n\nHe isn’t the Argentine version of Casemiro, nor is he much like former Argentina pit bull, Javier Mascherano, who is now his coach in Miami. Perhaps De Paul is misunderstood.\n\n“If you ask me, I try to be a box-to-box midfielder,” De Paul told The Athletic. “I’m an interior midfielder who can play with two midfielders, with three, but who can cover the whole pitch box-to-box. I try to be the most complete player I can be.”\n\nIn his second game for Inter Miami on August 2, a penalty shootout win over Mexican side Necaxa in the Leagues Cup, De Paul contributed two assists. The first was a glancing header in transition that landed at the feet of teammate Telasco Segovia, who promptly scored with a curling shot to the far post.\n\nDe Paul’s second assist came when his deft free kick found Jordi Alba, who flicked the ball with his head and wrong-footed Necaxa’s goalkeeper to tie the match. De Paul then coolly slotted home his penalty to help Miami claim the victory. His first goal for Miami came on Wednesday night against Pumas. It was a well-taken chance from close range that exemplified De Paul’s attacking origins.\n\nFor all of his gamesmanship, and at times needless bickering with opponents and referees, De Paul is a player who is constantly around the ball. His two goal contributions against Necaxa and the goal versus Pumas came with Lionel Messi watching from the stands, after he suffered a hamstring injury last week.\n\nDe Paul won’t recreate what Messi can do as an elite playmaker. But his past as an enganche, the prototypical attacking No. 10 that South America still reveres, makes him an intriguing signing for MLS.\n\n“It’s true that I started out playing a bit higher up the pitch, and then I became the player I am today,” De Paul said. “But I don’t feel like I make any superhuman effort in either facet — not when it comes to having the ball and attacking, or when it’s time to defend and suffer a bit, because every club and every team goes through moments in a match where you have to suffer and defend. And I believe that.”\n\nFor Argentina, De Paul has been a do-everything midfielder for the reigning World Cup and Copa América champions. Selfless and passionate, De Paul pocketed the traditionally hard to please Argentine fanbase with his willingness to give everything for his country, no matter the opponent. But behind the rugged style of play is an appetite for celebrity.\n\nDe Paul is unafraid to stand out for a global paparazzi that brings the football and fashion worlds together. His partner is Argentine actor and singer Martina Stoessel, known as Tini. He’s an Adidas brand ambassador, and like Messi in 2024, De Paul launched his own energy drink which is peculiarly named “Shhhh! Energy.”\n\n“This is a brand that represents me,” De Paul wrote on social media when the product launched. “It’s here to silence the excuses, the false promises and the hate. It’s made from good energy.”\n\nCuriously, De Paul admitted that he talks a lot. He’s also quite proud that his energetic play style has become synonymous with his on-field demeanor. But when he was asked to name something that many may not know about him, De Paul laughed, and said,“I don’t know. I think people read a lot of things about me. My life is a bit more boring or more low-key than people think.”\n\nHis 13.6 million Instagram followers know that the trendsetting De Paul has a growing interest in fashion, too. If there’s a popular hairstyle that footballers and Hollywood types consider in vogue, you can bet that De Paul will partake or even set the standard. It’s similar to how Miami co-owner David Beckham established looks and embraced popular culture in the late 1990s and continues to today.\n\nDe Paul is Argentina’s No. 7 and dons the same number in Miami. It’s a number that remains linked to Beckham, someone after whom De Paul models himself – and who just happens to be the husband of a former international pop star.\n\n“Obviously the fact that David is here also had an influence on my decision,” De Paul said. “I really liked how he played, his way of being, how he lived. And in a conversation with him he conveyed to me his desire for me to be part of this project that he is very committed to and that he built from the ground up.”\n\nComing to the U.S. could result in commercial opportunities for De Paul that may have passed him by had he stayed with Atlético Madrid. He’s one of the more marketable players on an Argentina national team that has never been more popular globally and has already booked its place for the 2026 World Cup.\n\nHaving recently broken ground on their U.S. headquarters in Miami, the Argentina Football Federation (AFA) is bullish on its plan to market the AFA brand and the national team’s top players in North America. Brand partnerships weren’t on his mind when he decided to sign with Miami, though, De Paul said.\n\nInstead, it was the chance to be Messi’s teammate on a day-to-day basis that convinced De Paul to leave Europe at 31 and come to MLS. Beckham signed with the LA Galaxy from Real Madrid at the same age.\n\n“Honestly, fashion and all that fascinates me. But I’m a football player,” De Paul said. “What I love most is playing football. In terms of how I perform and who I am, if there’s also a brand that can grow alongside that, then that’s great. But the focus is always on what happens on the field, and that’s what I work on every day.”\n\nDe Paul said that he didn’t get burned out by the high demands of Champions League-level football. He didn’t side-step the stigma that MLS carries, the dreaded retirement league label that MLS continues to try and shake.\n\n“This was a very personal decision, based on the fact that I wanted to get to know this league, to be part of its growth,” De Paul said. “I don’t think you make decisions just for the sake of it — you evaluate them, you think them through.”\n\nThere’s always criticism from fans and pundits when an internationally known player leaves top level South American and European football to sign with an MLS club. De Paul acknowledges that he has heard and read such opinions about his move. He’s in Miami to take it easy, they’ve claimed.\n\n“I’m not settling at all,” he said. “My mindset is the complete opposite of what some people have said — that coming here is a bit of a complacent move because I’ll be guaranteed to play. I don’t feel that way. I actually feel much more pressure — because of what it will take, because of who I am, because people will demand and expect me to step up every weekend. And I want that.”\n\nWhen a reporter suggested that Argentina fans were concerned that playing in MLS will jeopardize his spot in Argentina’s midfield, De Paul smiled cynically. He had said a moment earlier that Argentina head coach Lionel Scaloni had all but blessed the decision.\n\n“Who did you talk to? Who said that?” De Paul retorted. “There are over 50 million Argentines, not sure how many you talked to.”\n\n“I don’t feel like they’re worried,” he added. “I think they’ve known me for many years. They know how I perform on the field. They know what I’m capable of giving (to the Argentina shirt). I’m aware of the challenge, especially with the World Cup just a year away and because of my age. Maybe the easiest thing would’ve been to stay in Europe. I had plenty of offers. But I’ve always liked these kinds of things — challenges, testing whether I can push a little further beyond my limits.”\n\nDe Paul hopes that the South Florida heat and humidity, the cross-country travel and the transitional nature of MLS will add new footballing concepts to his game.\n\n“Every league plays differently — some focus more on playing style, others are more physical, others more tactical,” De Paul said. “I’ll be adapting, learning everything I need to about a new league — while not losing sight of everything that I’ve brought with me: lots of experience, maturity, and of course football. Especially with how I play, all of those things are very valuable.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6495579/2025/07/26/lionel-messi-bodyguard-rodrigo-de-paul-miami/",
    "https://www.nytimes.com/athletic/6525209/2025/07/30/leagues-cup-mls-liga-mx-value-club-world-cup/",
    "https://t.co/dA9jdXCUjS",
    "https://www.nytimes.com/athletic/6532701/2025/08/02/lionel-messi-injury-leg-necaxa-inter-miami/",
    "https://twitter.com/InterMiamiCF/status/1953251694977916984?ref_src=twsrc%5Etfw",
    "https://twitter.com/LuisSuarez9?ref_src=twsrc%5Etfw"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "De Paul",
      "weight": 0.12354255
    },
    {
      "name": "Rodrigo De Paul",
      "weight": 0.11484358
    },
    {
      "name": "Rodrigo De Paul interview",
      "weight": 0.10730205
    },
    {
      "name": "Rodrigo de Paul",
      "weight": 0.0845804
    },
    {
      "name": "De Paul’s second assist",
      "weight": 0.06896442
    },
    {
      "name": "De Paul’s attacking origins",
      "weight": 0.068523
    },
    {
      "name": "the trendsetting De Paul",
      "weight": 0.06780644
    },
    {
      "name": "De Paul’s",
      "weight": 0.06551833
    },
    {
      "name": "Argentina fans",
      "weight": 0.056747448
    },
    {
      "name": "Argentina head coach Lionel Scaloni",
      "weight": 0.055050183
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.98193359375
    },
    {
      "name": "/News/Sports News",
      "score": 0.97412109375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.8291015625
    }
  ],
  "sentiment": {
    "positive": 0.11352539,
    "negative": 0.48535156,
    "neutral": 0.4013672
  },
  "summary": "Argentinian footballer Rodrigo de Paul, known as El Motorcito (the little engine) due to his tireless play and high-tempo personality, has been recognized as Lionel Messi's on-field bodyguard. However, this label can be misinformed due to De Paul's contemporary player profile. He insists he is an interior midfielder who can play with two midfielders but also cover the whole pitch box-to-box. His first goal for Miami came against Pumas. De Paul also revealed that he has launched his own energy drink named “Shhhh! Energy Drink” and is an Adidas ambassador.",
  "shortSummary": "Rodrigo de Paul, known for his relentless play and celebrity, joins MLS as Lionel Messi’s on-field bodyguard, blending traditional Argentine play with modern-day celebrity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9c090b6fa91f40f18f59a4275821502a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6532701/2025/08/02/lionel-messi-injury-leg-necaxa-inter-miami/",
      "text": "Two years ago, the Leagues Cup benefited from hosting Lionel Messi’s bombastic stateside arrival. On Saturday, it provided the setting for a rarity in his twenty-plus-year career: visible anguish amidst injury.\nJust over ten minutes into Inter Miami’s group stage clash with Necaxa, Messi was dribbling towards the Liga MX side’s box. As opponents converged to slow his progress, the Argentine legend fell to the ground after making contact with midfielders José Rodríguez and Raúl Sánchez.\nAdvertisement\nA global audience watching Apple TV+ saw a truly defeated-looking Messi lie on his back, both hands smacking the ground in frustration.\nTrainers tended to the underside of Messi’s right leg before he exited the field, suggesting an injury to his right hamstring. Famously left-footed, an injury to his plant leg makes nearly every soccer action impossible.\n🚨Lionel Messi is down and will be subbed off early in the game.\nA huge blow for Inter Miami — the entire stadium stunned 😞\nRedondo comes on in his place.— Inter Miami News Hub (@Intermiamicfhub) August 2, 2025\nInter Miami rallied to win in a penalty shootout thanks to a game-tying header by Jordi Alba to knot the score 2-2. Luis Suárez scored the game-winning kick.\nThe exit comes just over a week after Messi was suspended for missing the MLS All-Star Game. While the punishment was in line with the league’s established standard, Miami took umbrage with the penalty as Messi (and similarly honored teammate, Jordi Alba) skipped the exhibition to prioritize recovering for the Leagues Cup and MLS regular season.\nBetween the MLS season and Miami’s four-game run at the Club World Cup, Messi logged nine “full 90” shifts in just 35 days. That would be a strain on any player, especially one who’s nearing his 38th birthday and has played over two decades of high-level soccer.\nSince joining Miami in July 2023, Messi has seldom exited games with signs of injury. The play leading to his removal wasn’t foul play so much as common contact during transition sequences. Soccer’s ever-congested schedule likely played a direct role in Messi’s potential injury.\n(Photo of Lionel Messi on the ground: Sam Navarro / Imagn Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6495579/2025/07/26/lionel-messi-bodyguard-rodrigo-de-paul-miami/",
      "text": "Yassine Cheuko became a household name when his role as Lionel Messi’s personal bodyguard hit mainstream news following his move to Inter Miami.\nCheuko has been acting as Messi’s shadow off the pitch for several years and, after he moved to America in 2023, on it too, fending off pitch invaders trying to get a hug or photo. That was until Major League Soccer banned him from the touchline for matches this year. So, who can protect him now?\nAdvertisement\nStep forward, Rodrigo De Paul.\nThe midfielder is Messi’s Argentina team-mate, and has gained a reputation on social media for being Messi’s protector on the pitch when the pair play together for their country. And now, the 31-year-old midfielder has completed a move to Inter Miami from Atletico Madrid of La Liga.\nWhat could we expect to see in MLS?\nWhen De Paul and Messi are on international duty, they are regularly pictured standing near each other during training sessions. During matches, the midfielder always has one eye on his team-mate, and you don’t have to look far to find a couple of recent examples.\nIn the opening minutes of Argentina’s most recent fixture — a 1-1 draw against Colombia in World Cup qualifying a month ago — Daniel Munoz fouled Messi while De Paul was standing on the edge of the box.\nAs soon as he spotted the foul, De Paul was on the move and quickly made his way to the referee, gesturing to show he thought a yellow card would be an appropriate punishment for the foul (a tug of the shirt and shoulder) committed on his team-mate.\nIt was a similar story against Peru towards the end of last year. As Messi was sandwiched between two opponents, he was fouled. De Paul’s reaction was more reserved initially…\n… but he still found himself face-to-face with the referee.\nNicknamed ‘El Motorcito’ (The Little Engine), De Paul’s presence in the Argentina side has increased in importance and responsibility. An all-action midfielder with a relentless work ethic, his competitive attitude has helped him stand out.\nHis role is to facilitate Messi’s brilliance, both physically and tactically. Rather than constantly threading eye-of-the-needle passes, De Paul’s value comes from winning the ball back and positioning himself to take defenders away and create space for Messi.\nAdvertisement\n“Having such a good relationship with him led to us looking for each other a lot on the field and understanding each other so much,” De Paul said in an interview with TyC Sports in 2022. “What happened on the field happened outside. That relationship was always nurturing, to the point where now we understand each other just by looking at each other.\n“In training, I’m a bit annoying, and he sometimes needs something too. So we look at each other and we know when to do it and when not to. That gives me a lot of peace of mind, because knowing that he’s up front and that in every situation I get into, he understands what I want to do or say, frees me up a lot when it comes to playing.”\nOne of the earliest examples of De Paul’s extra role for Argentina was the quarter-final in the 2019 Copa America against Chile. After Messi had shoved Gary Medel as he shielded the ball out of play by his own byline, Medel reacted by bumping his chest into Messi’s repeatedly, before pushing his head towards him too.\nThe referee was quick to respond to the confrontation, as was De Paul, who sprinted from near the halfway line.\nDe Paul has previously admitted he picks a ‘rival’ during a game with the aim to win that individual battle as well as earn the collective victory. It keeps him alert at all times during the match.\nHe is not generally the old-school enforcer who targets those who have fouled Messi by purposefully fouling them, but he has shown he can cross the line to match the stereotype.\nAgainst Chile in 2023, Gabriel Suazo swept Messi’s legs with a late challenge in the first half.\nDe Paul appeared to make a mental note. Later, when Suazo attempted to clear a loose ball on the edge of his box, De Paul lined up a shot and on his follow-through, his studs landed on Suazo’s ankle.\nLater in the half, De Paul cheekily tripped Suazo as he went to take a throw-in…\n… but the Chile international returned the favour with a late challenge on De Paul in the second half, earning him a booking.\nWhen Honduras’ Deiby Flores served up some rough treatment on Messi in September 2022…\nDe Paul sprinted over to the midfielder to confront him.\nSimilarly, when Messi was on the receiving end of two tackles at the same time against Panama in March 2023, De Paul sped over…\n… and got in the face of the culprits.\nOff the field, the pair share a strong relationship. They spend plenty of time together when away with the national side, share a love of mate (the South American herbal tea), and Messi enjoys De Paul’s outspoken, class clown personality.\n“Messi is the one who takes care of me — he’d come down and tell me ‘come here’, ‘get like this’, it’s the opposite,” De Paul said in the interview with Argentinian media outlet Ole. “I’m around because I love him. We talk a lot. He shows me affection all the time.\n“I love spending time with him, we have a lot of fun, with all the kids, but well, we have like a beautiful group. We are kind of idiots with the things that go viral, we boss each other around, we laugh.”\nAdvertisement\nDe Paul will arrive hoping to push Inter Miami up the Eastern Conference. They sit fifth in the table, although they have three or four games in hand on the teams above them due to their participation in the Club World Cup.\nMessi has been in electric form in the league scoring 18 goals and providing seven assists in his 18 appearances this season. With the schedule ramping up, having somebody arrive ready to do plenty of his running could make him even more dangerous and allow him to rest on the pitch rather than from the bench.\nMLS defenders, be warned.\n(Carmen Mandato/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6525209/2025/07/30/leagues-cup-mls-liga-mx-value-club-world-cup/",
      "text": "We all agree that there’s too much football, right?\nAfter the FIFA Club World Cup ushered in yet another major tournament into the game’s crowded ecosystem, and less than one year away from an expanded 48-team men’s World Cup, it appears that there’s no turning back. The saturation of soccer is here to stay.\nAdvertisement\nSo in an ever-cluttered space, where does this leave Leagues Cup? The annual MLS and Liga MX inter-league tournament, which began Tuesday night and will run through Aug. 31, has been tweaked for its third edition since going to a more inclusive format. The tournament field has been reduced to 36 teams and now features 18 MLS clubs and all 18 Liga MX sides. Every match in the opening phase pits MLS sides against Liga MX opponents, and tied games go straight to penalties to add urgency to a tournament that is desperate for its results to matter. The competitive stakes remain, with the top three finishers receiving berths in the 2026 Concacaf Champions Cup – which presents a pathway to the next Club World Cup.\nBut everyone’s bandwidth – fans and players – has a maximum capacity. And just like the realities of the consumerization of football, fans in the U.S. have been inundated with the perceived virtues of the MLS vs. Liga MX rivalry. The two leagues have grown closer together over the past five years – they just staged their fourth All-Star Game in five years last week – leading plenty to envision a world where they eventually merge. Regardless, it all reflects the zeitgeist of North America’s new-age football mentality.\n“When I did my own homework and I dug into it, when you look at it, this rivalry is going nowhere,” Leagues Cup executive director Tom Mayo told The Athletic.” You know that this is going to be a rivalry around in 100, 200 years.”\nHow much of that rivalry is cutting through to the mainstream, though? Arguably the most meaningful and impactful MLS vs. Liga MX showdown occurred in May almost by accident, when LAFC and Club América battled for Club León’s vacated Club World Cup place and the $9.55 million prize that came along with it. FIFA stumbled onto a great showcase of both clubs and leagues. Whether Leagues Cup can replicate that aura without becoming redundant in the consumers’ eye is its next challenge.\nAs the 2025 edition kicked off, three of Tuesday night’s six opening round games were decided from the penalty spot, though that’s not necessarily a reflection of the tension that exists between clubs in the U.S. and Mexico. Penalties do make for more drama, and surely the players prefer that route over 30 extra minutes of football. But if you dig deeper into the new format, you’ll realize that at some stage during this revised Leagues Cup, the competition will become a friendly tournament for most teams.\nAdvertisement\nLosing in regulation or drawing and falling in penalties in the first match can make advancement impossible or highly unlikely before a team has played two group stage matches. A smaller field means goals scored and wins are more valuable than before. At the very least, the leagues are not taking a full hiatus while this competition plays out.\n“I like this format better than the previous one, because in the previous format, if you were eliminated in the early stages, there was a long period of inactivity, which made you lose your rhythm in your (domestic) tournament,” Atlas head coach Gonzalo Pineda said on Tuesday. “That’s not the case with this one.”\nPortland Timbers coach Phil Neville agreed. Less down time appears to be a universally welcomed change by participating coaches. And with less margin for error, the perceived exigency of the tournament gives players and staff a taste of international knockout football.\n“This is not just a game that you’ve got to win,” Neville said on the eve of Portland’s debut versus Atlético San Luis. “You’ve got to perform well. Score goals, keep clean sheets, and you cannot rest in these games because the odd goal or the yellow card here and there when it comes to the tie breaks could go a long way.”\nReal Salt Lake head coach Pablo Mastroeni didn’t bite when asked where Leagues Cup’s place is within the international football hierarchy – “I think that question is for someone that’s in a higher position than myself,” he said – but he appreciates the value it can provide for both his players and himself. RSL will face Mexican giant América at home on Wednesday in a major test.\n“I think as a player, you always like to measure yourself with the big names in the region, whether you’re in Concacaf or Europe,” Mastroeni said. “It’s a real barometer as to where you stand in the international game.”\nAdvertisement\nLeagues Cup also allows both MLS and Liga MX teams to go head-to-head against some of the top tacticians in North America. Similarly, the Club World Cup allowed MLS sides Seattle, Inter Miami and LAFC to test themselves tactically against Europe and South America’s top managers. So, even if schedule congestion is a reality, the innate competitive drive that professionals have could make Leagues Cup a value-add in the long run.\n“I’m always a learner,” Mastroeni said. “I’m forever learning and having the opportunity to play against different opponents like this provides you with maybe a catalyst of different rotations, as far as the tactics are concerned. And from a player’s perspective, it’s the belief system that allows you to say, ‘Man, we played against the best in the region and I held my own.’ ”\nThere’s a clear distinction, however, between what coaches take away from Leagues Cup and what MLS sporting directors believe regarding the tournament.\n“I was a fan in the beginning, but we have too many interruptions during our season and our playoffs,” one MLS sporting director said during The Athletic’s anonymous executive survey in March. “We have to fix that. Our season has to be continuous.”\nAnother added: “I prefer Leagues Cup to the U.S. Open Cup, but I don’t think (Leagues Cup) is a great tournament. I just think it was lightning in a bottle because (Lionel) Messi got signed.”\nThe 2023 tournament was indeed a smash success, with an inspired Messi debuting with a stoppage-time, free-kick winner vs. Cruz Azul and taking off from there to the tune of 10 goals and four assists in seven matches. Miami won the title and will once again be the marquee team this summer, opening Wednesday night against Atlas in Fort Lauderdale. Last season, Messi was injured and missed the competition, which saw its resonance dwindle surely as a direct result.\nThis year, MLS Cup is what Miami truly desires at this point. How head coach Javier Mascherano manages the minutes for Messi, Luis Suárez, Jordi Alba and Sergio Busquets during an already loaded summer that included the Club World Cup – and how important the club views Leagues Cup as a pathway to a Champions Cup berth – will determine Miami’s fate and level of buy-in. The addition of Argentine World Cup winner Rodrigo De Paul, who is eligible to make his Miami debut vs. Atlas, can also contribute to the intrigue of this edition of Leagues Cup and how it’s perceived.\nAdvertisement\nOr perhaps the needle won’t move much at all. In the ever-saturated ecosystem, where players’ unions continue to deride the congestion of the calendar, Leagues Cup could fade into the background as all of the ancillary competitions become a blur.\nFor Mayo, though, a former managing director of the globally renowned America’s Cup sailing competition and co-founder of SOS Hydration, Leagues Cup is an untapped venture with great potential. History, he claimed, is on the tournament’s side.\n“You’ve got a Leagues Cup in its third year, you’ve got a Club World Cup, you’ve got a World Cup, and you’ve got growing leagues independently themselves,” he said. “But in three or four years time, there won’t be a Club World Cup and there won’t be a World Cup (in the U.S.). They might come back in 10 to 15 years time, but at some point you want to start laying down the foundations for a future tournament.”\n(Top photo: Adam Cairns/Columbus Dispatch/USA Today Network/Imagn Images)"
    }
  ],
  "argos_summary": "Rodrigo de Paul, known as 'El Motorcito' in Argentina, has transitioned from a central midfielder to a vital player for Inter Miami, where he plays alongside Lionel Messi. While often labeled as Messi's protector on the pitch, De Paul describes himself as a box-to-box midfielder who contributes both defensively and offensively. His recent performances in the Leagues Cup, including assists and a goal, highlight his attacking capabilities, while his move to MLS is seen as a personal challenge rather than a step down in competition.",
  "argos_id": "1BU6XREXX"
}