{
  "url": "https://www.inc.com/marcel-schwantes/what-drives-fast-growth-new-research-has-answers-culture-amp/91220524",
  "authorsByline": "Marcel Schwantes",
  "articleId": "64d9b8cab7ef455d952ef6f19c2d8bbe",
  "source": {
    "domain": "inc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/08/GettyImages-2180007353.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T14:05:00+00:00",
  "addDate": "2025-08-07T14:19:57.713628+00:00",
  "refreshDate": "2025-08-07T14:19:57.713629+00:00",
  "score": 1.0,
  "title": "What Drives Fast Growth Year After Year? New Research Has Some Answers",
  "description": "Here are the bold strategies that keep companies on the Inc. 5000 list.",
  "content": "Here are the bold strategies that keep companies on the Inc. 5000 list.\n\nNew research from Culture Amp, an employee experience and people performance platform, analyzed 174 of its customers that were named to the 2024 Inc. 5000 list, part of 442 Culture Amp customers recognized by Inc. 5000 in the last five years. The findings point to one often underappreciated differentiator: accountability. Compared to a matched control group of 174 Culture Amp customers that didn’t make the list, employees at the 174 Inc. 5000 companies are significantly more likely to say that underperformance is addressed (58 percent vs. 54 percent), the right people are recognized (67 percent vs. 62 percent), and leadership is trustworthy (77 percent vs. 73 percent). Culture Amp looked at data from their customers and found 12 factors in the employee experience that can predict revenue growth over three years. The three biggest ones? A sense of belonging, trust in leadership, and open, honest two-way communication.\n\nAccountability kept showing up as a major factor in all three analyses—whether comparing Inc. 5000 companies to control groups, looking at repeat honorees versus one-timers, or linking employee experience to revenue growth. “What’s interesting is these companies aren’t necessarily better at recognizing people, we see no difference in responses to ‘I receive appropriate recognition for good work’, it’s that the right people are recognized, which further shows the focus on accountability, even when you’re the one being held to account,” says Fresia Jackson, Director of People Science Research at Culture Amp. “Accountability isn’t one of those corporate buzzwords because in the moment, practicing accountability can be uncomfortable. But our data shows that it’s a type of discomfort that produces results,” added Dr. Heather Walker, Senior Data Journalist at Culture Amp.\n\nCulture Amp also analyzed what correlates most strongly with employee motivation, and here’s where the differences become stark. For employees at Inc. 5000 companies, accountability, fairness, and recognition show stronger correlations with motivation than they do for employees at other companies. At control group companies, job stability, enablement, and compensation correlate more strongly with motivation, suggesting a more transactional culture. In environments where people are motivated by high standards and a sense of fairness, expectations become energizing rather than burdensome. What separates the returners from the one-hit wonders Not all Inc. 5000 companies stay on the list. When Culture Amp compared recurring honorees with companies that dropped off, three factors stood out: two-way communication, follow-through on underperformance, and a consistent focus on quality.\n\nThese companies communicate expectations clearly and act on them consistently, using goal setting as the mechanism to translate accountability into action. Accountability must be owned by leadership, not outsourced Dean Carpenter, VP of Global Talent Practices from MRI Software, a company that has been recognized on the Inc. 5000 list four times, summed it up well, “We empower leaders first and foremost. We don’t believe accountability should be outsourced to HR — it’s a leadership behavior. If a leader isn’t holding their team accountable, that’s a performance issue in itself. And that’s something the leader needs to be held accountable for, too.” This shows that for something to truly be felt as part of a company’s culture, it needs to go beyond a single part of the company “owning it” to actually being experienced in day-to-day interactions by everyone. To do that, you need to hold leaders accountable so they model clarity, consistency, and follow-through, habits that teams then reflect.\n\nBuilding a culture of accountability isn’t a one-and-done project—it takes intentional effort at three levels: individual, leadership, and organizational. Individual: Set clear expectations and give regular feedback. Research shows the quality of feedback someone gets predicts their next performance rating better than their last rating does. Leadership: Model accountability by following through, addressing issues fast, and recognizing the right people.\n\nOrganization: Support accountability with clear goals and strong systems. Inc. 5000 firms show this through flatter hierarchies, lower turnover (32 percent vs. 35 percent), and more women in leadership (33 percent vs. 28 percent). “What this research shows is that high performance requires both cultural and structural elements that reinforce each other,” says Fresia Jackson. “The organizations that get accountability right create the conditions for it to thrive at every level. In closing, Inc. 5000 companies build cultures where everyone knows what’s expected, leaders play fair, and accountability is the norm. That kind of environment transforms what could be seen as a reluctant obligation into a powerful competitive edge.\n\nThe opinions expressed here by Inc.com columnists are their own, not those of Inc.com.",
  "medium": "Article",
  "links": [
    "https://www.cultureamp.com/blog/high-revenue-growth-inc-companies-2025-research",
    "https://www.inc.com/inc5000/2024",
    "https://www.inc.com/inc-5000",
    "https://incpowerpartners.secure-platform.com/a"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "control group companies",
      "weight": 0.08329214
    },
    {
      "name": "other companies",
      "weight": 0.08198259
    },
    {
      "name": "Accountability",
      "weight": 0.081063956
    },
    {
      "name": "accountability",
      "weight": 0.081063956
    },
    {
      "name": "companies",
      "weight": 0.08000081
    },
    {
      "name": "Culture Amp",
      "weight": 0.07671668
    },
    {
      "name": "employee motivation",
      "weight": 0.06915175
    },
    {
      "name": "employee experience",
      "weight": 0.06816847
    },
    {
      "name": "employees",
      "weight": 0.05946899
    },
    {
      "name": "clear expectations",
      "weight": 0.05808851
    }
  ],
  "topics": [
    {
      "name": "Data"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.873046875
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.80419921875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.548828125
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Marketing",
      "score": 0.369140625
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.313232421875
    }
  ],
  "sentiment": {
    "positive": 0.2980957,
    "negative": 0.2836914,
    "neutral": 0.4182129
  },
  "summary": "New research by Culture Amp, an employee experience and people performance platform, has identified the key to fast growth year after year. The study compared 174 of its customers, part of 442 customers recognized by Inc. 5000 in the last five years, to a matched control group of 174 Culture Amp customers that didn't make the list. It found that employees at these companies are significantly more likely to say that underperformance is addressed, the right people are recognized, and leadership is trustworthy. The research also found that accountability, fairness, and recognition are stronger correlations with motivation than they do for employees at other companies. However, not all companies make the top five, with repeated honorees or one-timers dropping off. The findings suggest that accountability must be owned by leadership, not outsourced.",
  "shortSummary": "New research from Culture Amp reveals that accountability, trust in leadership, and motivation are crucial to sustain growth in companies like Apple, Google, and LinkedIn.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1ec702f625d246a596d4fdbc537d85b2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cultureamp.com/blog/high-revenue-growth-inc-companies-2025-research",
      "text": "Article\nShow me the blueprint: What high-revenue growth companies reveal about performance\nWritten by\nDirector of People Science Research, Culture Amp\nSenior Data Journalist, Culture Amp\nIn this blog\nIn shaky macroeconomic environments, every leader asks: How do we accelerate performance and sustain growth? The instinct is often to look for what’s next – a new market, a cutting-edge product, or a leaner cost structure. Each of these can support a company’s growth, but can also overshadow the powerful impact of company culture and employee experience on performance.\nCompanies come to Culture Amp seeking a blueprint for success, especially in times of uncertainty. They want to know how to perform better at the individual and organizational levels, boost efficiency, and keep winning.\nOnce companies start using Culture Amp, they discover the deep connections between sustainable high performance and employee sentiment, growth, and recognition. Companies that crack the code on performance tend to be more successful overall. But those organizations rarely spell out how they did it.\nPeeking behind the curtain\nAt Culture Amp, we used our global employee experience data to uncover that proverbial “secret sauce” and define a blueprint for success. Data analysis helps us answer questions like: What are successful high-growth companies doing differently? What do their blueprints have in common that other companies may be missing?\nThe Inc. 5000 list highlights North America’s fastest-growing private companies, so we took a closer look at the Culture Amp customers on that list. Over the last five years, Inc. has recognized Culture Amp customers 599 times. To qualify for the Inc. 5000 list, these companies had to grow dramatically over three years. And to stay on the list? They had to sustain that growth over time.\nFor this study, we looked specifically at the 174 companies that made the list in 2024. We compared them to a group of similarly sized and similarly placed companies – a control group. Companies in the control group are also growing and investing in company culture, so this study set out to understand what moves the needle from good to great.\nWhat we found points to a foundational element of company culture that’s often overlooked and sometimes even avoided: accountability.\nAccountability is the foundation of sustainable high performance\nBeing held accountable can make people uncomfortable, and seeing others disciplined for falling short isn’t exactly fun either. But accountability is essential at work, in relationships, and beyond. That said, we didn’t anticipate just how foundational it would prove to be to business outcomes.\nOur data showed that accountability is precisely where the best companies excel. Compared to employees at companies in the control group, employees at Inc. 5000 companies have a significantly higher perception of accountability, recognition, and leaders.\nAt a company where accountability is deeply woven into the culture, employees are likely to feel a sense of ownership in their work. When expectations are clear, outcomes are measured, and there’s little room to let things slide, employees naturally hold themselves and others to a higher standard.\nA higher standard intuitively leads to more recognition. An atmosphere with high accountability, where leaders and peers regularly recognize the small wins hidden in their day-to-day work, builds trust and reinforces that everyone’s contributions matter.\nIn a workplace culture that values recognition, employees will feel seen for what they accomplish, supported to reach higher when they fall short, and motivated to keep up with peers. The combination of high accountability and recognition fuels performance and a shared sense of purpose.\nCompanies that sustain high revenue growth are better at communication\nAs part of our study, we compared companies that have stayed on the list with those that were on it but dropped off. We found that employees at companies that remain on the list had a significantly higher perception of two-way communication, accountability, and focus on quality.\nTwo-way communication signals that leaders actively listen, respond, and incorporate employee feedback into their work, just as employees are expected to improve their performance following feedback from leaders. This feedback loop makes teams feel they’re moving in sync and pulling toward the same destination.\nPrioritizing quality does something similar. It takes accountability and turns it into a shared pursuit of excellence. It shapes habits and drives continuous improvement, so one win sets the stage for the next.\nOur analysis revealed a direct correlation between elevated accountability and sustained revenue growth. Communication and quality make accountability stick, turning one-off victories into sustained high performance.\nAccountability impacts the bottom line\nBecause Inc.’s rigorous evaluation process considers revenue growth over three years, we performed a simple regression, plotting a company’s favorability in 2022 (year two) on each question to their three-year revenue growth reported by Inc.\nAcross our database of questions, 12 were significant. And one of those twelve was about, you guessed it, accountability.\nWhen teams are clear on what they’re responsible for and feel supported in meeting those expectations, they tend to execute better. Over time, that kind of clarity and follow-through shows up in the numbers. For leaders, it’s a reminder that how you set expectations and hold to them can shape your team and company’s growth trajectory.\nAnatomy of accountability\nAs many of us have experienced, accountability can go sideways if it feels punitive. When it’s not done well, accountability can resemble a reprimand rather than a supportive strategy to help teams effectively manage workloads and achieve excellence. How accountability is practiced bears an impact on the way employees perceive it.\nTo understand the anatomy of accountability, we conducted three qualitative interviews with companies that use Culture Amp and were also on the Inc. 5000 list in 2024. In those conversations, we learned three things about accountability that seemed unique.\n1. Accountability starts before underperformance occurs – at goal setting.\nThe first step in accountability is establishing clear organizational goals that ladder down to individual employees and setting expectations to meet those goals.\nHeather Senkunda, Senior Director, HR Business Partner at Boomi, says:\n“We cascade goals using very specific processes. Ultimately, it allows people to feel like they are connected to Boomi's objectives and success at the end of the year. It allows them to have direction and prioritization of their own work, and as things come along, to know how this is driving the business forward. Is this meeting the objectives that are tied to my manager and their manager and their manager all the way up the line? It allows us to focus with intention on what we're doing.”\n2. Employees need more than one touchpoint to know how they’re doing.\nBuild accountability into the structure and mechanisms of feedback around them.\nNoelle Banks, Director of People Experience, Talent, and Organizational Development at ID.me, says:\n“We wanted our mid-year performance check-in to be a lightweight and seamless process between formal performance reviews. We wanted to improve communication and build management capabilities. I had to fight for this, and we got it. We wanted to give our employees an anchor for regular conversations that could fit within our busy culture and still address the need for clearer management practices within the organization.”\nIn our research on individual performance, we found that high-performing employees are more satisfied with the feedback they get from their managers and that they’re uniquely motivated by constructive feedback. High-quality feedback is business-critical, especially for organizations focused on building sustainable high-performance cultures.\n3. Accountability comes from the top.\nHolding people accountable is everyone’s responsibility, especially leaders.\nDean Carpenter, VP Global Talent Practices at MRI Software, says:\n“We empower leaders first and foremost. We don’t believe accountability should be outsourced to HR - it’s a leadership behavior. If a leader isn’t holding their team accountable, that’s a performance issue in itself. And that’s something the leader needs to be held accountable for, too.”\nWe know from previous research that how leaders perform influences the way their direct reports perform, and that employees mimic the behaviors they see in their managers. Leaders are uniquely positioned to set the bar when it comes to accountability in performance.\nMoving from concept to operation\nBeyond performance processes, what does operationalizing accountability actually look like?\nFor answers, we conducted a latent profile analysis, a statistical method used to identify subgroups within a population based on their responses to a set of observed variables (factors across engagement surveys).\nWe included factors we know impact the employee experience, namely: leadership, alignment, feedback, development, enablement, and engagement. For the data nerds out there, we used Z-score to effectively standardize the factors.\nOur analysis characterized companies within the Inc. 5000 and control groups, revealing distinct cultural profiles.\nOne such cultural profile, which we termed \"Cultural Powerhouse,\" is made up of companies performing meaningfully above average (approximately one standard deviation above average) across every factor we tested.\nBeing on the Inc. 5000 list is a sign that a company could be a cultural powerhouse\nOur analysis showed that Inc. 5000 companies are more likely to fall into this \"Cultural Powerhouse\" category than companies in the control group.\nFurther analysis of each distinct cultural profile showed that development and feedback were the areas where top companies excelled most and where below-average profiles struggled the least.\nFeedback and development are critical elements of accountability\nFeedback is a cornerstone of accountability. It's how information about performance is shared and delivered, giving employees the opportunity to adjust and improve. Similarly, development is an employee's plan to grow and improve within the company. When opportunities for advancement are clear, employees are more likely to go beyond the basic obligations of their role and push to exceed them as they stretch for that growth.\nThe hardest part of accountability to achieve\nOur analysis also identified a profile of companies that seem to be “Running on Empty,\" companies that fall about two standard deviations below average across all factors we looked at. Of note, not a single Inc. 5000 company in our sample fell into that category.\nWe found that the companies in the “Running on Empty” profile struggled most with alignment. Alignment is arguably the hardest part of accountability to achieve because it happens at the organizational level. It must be proactive and meticulously planned, requiring a clear vision and robust scaffolding, much like the structured goal cascading we observed at Boomi.\nOrganizational structure matters, too\nInc. 5000 companies, when compared to the control group, had a few other unique attributes that signal they’re designed for speed and high performance: They had flatter hierarchies, a higher proportion of salespeople, more women in leadership, and lower turnover.\nThese operational design choices reflect structures built to move fast, to adapt without breaking, and to leverage diversity of thought in leadership. Add accountability as the foundation, and you have a proven blueprint for success.\nWhat it comes down to\nThe data paints a picture of high-growth companies creating ecosystems where individuals are empowered and held responsible for their part in collective success. The courage to foster genuine accountability, not as a punitive measure, but as a framework for growth, recognition, and trust, is perhaps the most potent and often overlooked lever for organizational success.\nBy embracing this foundational element, leaders can move beyond simply seeking in-the-moment growth, and begin to architect a culture that survives economic shifts, and thrives within them, consistently delivering excellence and defining what it truly means to perform at the highest level.\nDrive sustainable performance at scale\nCulture Amp focuses on your most important asset – your people, turning employee insights into real business impact."
    },
    {
      "url": "https://incpowerpartners.secure-platform.com/a",
      "text": "Worldwide Recognition\nBusiness owners across the U.S. and the world will know that your company is a true B2B partner and worthy of building a meaningful relationship with.\ndouble-click to edit, do not edit in source\ndouble-click to edit, do not edit in source\nExtended Deadline: August 8 (Fee: $1,295)\nBe Recognized as the Force Behind Business Success\nAre you the engine that helps businesses grow, scale, and thrive? Whether you deliver game-changing software, essential logistics, cutting-edge marketing, or top-tier customer service, your company could be recognized as an Inc. Power Partner—the ultimate honor for B2B excellence.\nInc.’s Power Partner Awards celebrate and promote the companies that entrepreneurs and small businesses trust the most—the partners that truly move the needle. This prestigious list highlights the very best B2B providers in the United States and around the globe.\nIf your company has a proven track record of helping others win and happy clients who can back you up, apply today to become an Inc. Power Partner—and let the world know you're a B2B powerhouse.\nLet Inc. show the world that your company is devoted to providing entrepreneurs with the tools and resources they need to start, run, and grow their businesses. Here’s what to expect if your company makes this year’s list:\nBusiness owners across the U.S. and the world will know that your company is a true B2B partner and worthy of building a meaningful relationship with.\nAll honorees will be featured on Inc.com and receive a custom profile page touting your firm's recognition as a top B2B partner.\nYou’ll receive the Inc. seal of approval that your firm has an impressive track record of helping entrepreneurs and owners of small to medium-size businesses.\nInc.’s validation will help you land new clients to continue growing your business.\nBe proud of the business you’ve created. Take a few minutes to apply and let Inc. magazine declare your company one of the best to partner with.\nEvery application will be reviewed directly by Inc. editors. You may apply to as many of the below categories as fit your company, creating multiple opportunities for recognition in Inc. magazine and on Inc.com. Multiple honorees will be named in each category.\nOpen to all companies, in any industry, that help business owners start, run, or grow their businesses.\nCompanies based in the United States that have exceptionally empowered their partners to start, run, and grow their businesses at all levels\nCompanies that help organizations grow through strategic campaigns, lead generation, market research, and more.\nCompanies based outside the U.S. that are power partners to local businesses, or have helped companies source, distribute, sell, market, and build internationally.\nBusinesses that provide products and services exclusively to other businesses.\nFirms that help businesses build and develop brand identities and create compelling assets, from website design to corporate branding.\nCompanies that provide the physical infrastructure and services that keep businesses running, including maintenance, cleaning, office management, workspace solutions, and more.\nFirms that provide essential financial services to organizations—from accounting to investment—or legal expertise for compliance, litigation, and more.\nCompanies that support hiring, training, benefits management, compliance, and employee engagement.\nCompanies that keep businesses operating smoothly and efficiently through supply chain management, logistics solutions, fulfillment services, and more.\nFirms that create and maintain a positive public image for the individuals, groups, or organizations they represent.\nCompanies that deliver services through the internet, including data storage, servers, databases, networking, and software.\nCompanies that provide tech expertise, from software development to IT infrastructure to digital transformation.\nSmall businesses that thrive at powering other businesses, often without the resources of their larger peers or competitors. These are the companies that have done the most with the least.\nEstablished businesses that have significantly grown in size while never losing their focus on serving the best products and services to other businesses.\nMidsize companies that have started growing in size but haven’t let that growth distract from their top priority of addressing the unique needs of other businesses.\nApplications are open to small-to-midsize companies, in all industries and locations, including government-funded agencies. Public, private, non-profit, subsidiary, U.S.-based, and international companies are all encouraged to apply.\n1. Complete Your Short Application: Complete the short application here by filling in basic information about your company and selecting the categories you’d like to apply for.\nExtended Deadline: August 8 (Fee: $1,295)\n2. Provide Customer References: In the application, you'll provide Inc. with at least three, and up to 10, companies that have used your products or services over the past year. Inc. will send a survey containing four straightforward questions asking how likely your customer is to recommend your product or service. Inc. will score these results and combine them with our own research to produce a list of hundreds of winners. See our full methodology here.\nImportant Note: Past honorees may renew their Inc. Power Partner seal of approval each year without providing additional customer references. Simply complete the application and Inc. will vet your company to ensure it is still in good standing.\n3. Watch for Our Announcement of the 2025 Inc. Power Partners: The list goes live on Inc.com in late-October 2025. Whether or not you make the list, you will be notified via email in September, before it is released to the general public.\nExtended Deadline: August 8 (Fee: $1,295)\nFor full application details see our FAQs here.\nQuestions? Email Inc. at PowerPartners@inc.com."
    }
  ],
  "argos_summary": "Research from Culture Amp highlights that accountability is a key differentiator for companies on the Inc. 5000 list, with employees at these firms reporting higher levels of trust in leadership and recognition for performance. The study identifies three main factors contributing to sustained revenue growth: a sense of belonging, trust in leadership, and open communication. Companies that maintain high performance prioritize accountability at all levels, ensuring clear expectations and consistent follow-through, which fosters a culture of motivation and excellence.",
  "argos_id": "1KKXXSMPD"
}