{
  "url": "https://www.usatoday.com/story/money/2025/08/07/gen-z-money-wins-problems-budgeting-saving/85548483007/",
  "authorsByline": "Rachel Barber",
  "articleId": "e436e0c6a5394a33b506bb5d7a04a252",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/06/USAT/85549610007-getty-images-2161536318.jpg?crop=8659,4872,x0,y450&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:52:53+00:00",
  "addDate": "2025-08-07T13:58:39.948070+00:00",
  "refreshDate": "2025-08-07T13:58:39.948072+00:00",
  "score": 1.0,
  "title": "Gen Z is getting serious about their finances. What's in the way?",
  "description": "Gen Z is slowly stepping off their parents' payroll, but a majority are dissatisfied with their income and the cost of living.",
  "content": "Members of Generation Z are becoming more financially independent, a likely welcome reprieve for the bank of mom and dad.\n\nOver the last 12 months, 72% of Gen Z took steps to improve their financial health, and fewer Zers are relying on monetary support from family, according to a new Bank of America survey of 1,069 adults. Between rent and groceries, young Americans aren’t happy with the high cost of living but they’re reacting to it responsibly, according to Holly O’Neill, Bank of America’s president of retail, consumer and preferred banking.\n\nWhile they may be known for challenging traditional workplace norms and the Gen Z stare, Zoomers are also leading the way in prioritizing income diversification, entrepreneurship, and values-based spending.\n\n“Gen Z is learning adulting is expensive, but the good news is they’re taking it in stride” O’Neill said. “They’re saving more and investing. I think they’re feeling pretty good, given where they are.”\n\nWhile not all 18- to 28-year-olds have left their parents’ payroll, the percentage of Gen Zers who rely on family financial support is now 39%, down from 46% last year.\n\nTaylor Price, a Gen Z personal finance expert and founder of Priceless Tay, a platform and coaching program teaching young people how to thrive financially, said that decrease doesn’t only reflect Gen Z growing up.\n\n“It’s about us waking up financially, \"Price told USA TODAY. “Today, getting rich is a decision, not a dream. The tools and education are publicly available with no minimum net worth required.”\n\nGen Zers who are still financially dependent on family are also receiving less. The survey found 22% receive $1,000 or more per month, down from 32% a year ago, and 54% receive less than $500 monthly compared to 44% last year.\n\nA separate savings.com report found groceries, cell phone bills, and rent or mortgage payments top the list of costs parents help their adult children cover.\n\nFinancial wellness may be a team sport for Gen Z.\n\nOf those surveyed, 66% said they don’t feel pressure from friends to spend beyond their means. The group values transparency, and 42% don’t mind declining an invite and telling friends they can’t afford an activity.\n\nA majority focused on reducing expenses in the last year, including 41% who cut back on dining out. More than half put money toward savings and 24% paid down debt.\n\n“They’re overall inspired to put themselves on a path to financial independence,” O’Neill said. “As you can imagine, when you’re starting out, things are a little more expensive than you thought.”\n\nAlthough they’re building good habits, a third are still stressed — 52% of whom cite economic instability as a reason why. But that anxiety leads 90% to take action, the survey found. A majority are checking their bank account balance and budgeting. Nearly half are getting ahead on paying bills.\n\nFor some, money stress isn’t motivating. In fact, about a third of Gen Zers surveyed said they’re likely to avoid thinking about money and treat themselves to a purchase when they’re worried about finances.\n\nMore than half buy themselves a small “treat” at least once a week to celebrate an accomplishment or find a silver lining on a bad day. For 59%, those treat-yourself moments lead to overspending.\n\n“It’s less about the treat itself and more about the lack of boundaries around it,” Price said. “A $7 matcha isn’t going to ruin your financial future, but daily impulse spending without a plan will.”\n\nGen Z lists the high cost of living as a barrier to financial success. Total monthly spending is higher than 35% of Gen Z thought it would be. Specifically, 63% were surprised by the cost of groceries, 47% were caught off guard by rent and utility bills, and 42% were not expecting the high price of dining out.\n\nGen Z also isn’t making as much money as they would like. Over half said they don’t earn enough to live the life they want and 55% don’t have adequate savings to cover three months of expenses.\n\nWhile 42% of Gen Z view saving for retirement and 35% see investing as important steps to financial independence, only a quarter contributed to a retirement account in the last year. One in five invested in the stock market, up slightly from recent years.\n\nThat said, a 2024 Transamerica Institute study found that Gen Z started saving for retirement at the median age of 20. That’s a 15-year head start compared to baby boomers, for whom the median age to begin was 35.\n\nA detailed financial plan can go a long way in relieving money stress.\n\n“Financial stress can either paralyze you or push you. The key is finding a balance,” Price told USA TODAY. “For Gen Z, it’s about building systems that run in the background.”\n\nThat’s where Price’s “Rich Routine” comes in. She recommends automating savings, contributing to investments, and splitting paychecks across fixed bills, flexible spending, and future goals.\n\nO’Neill recommends the 50/30/20 budgeting method, stacking up emergency cash, and limiting impulse purchases.\n\n“When your money has a plan, you don’t have to think about it 24/7,” Price added.\n\nWhen expenses feel unmanageable, Price says, income is how people can take back control. She recommends pursuing a side hustle to create some financial breathing room and preparing for a raise, not waiting for one.\n\n“Track your wins at work, quantify your impact, and practice negotiating,” she said. “Explore roles or industries with growth potential. Sometimes the real unlock is making a strategic pivot.”\n\nReach Rachel Barber atrbarber@usatoday.com and follow her on X@rachelbarber_",
  "medium": "Article",
  "links": [
    "https://puzzles.usatoday.com/",
    "https://www.transamericainstitute.org/docs/research/generations-age/multigenerational-workforce-life-work-retirement-survey-report-2024.pdf",
    "https://www.usatoday.com/story/money/personalfinance/2025/08/04/americans-thinking-about-money/85462709007/",
    "https://x.com/rachelbarber_",
    "https://pricelesstay.com/",
    "https://www.usatoday.com/story/money/2025/05/12/adults-still-get-money-from-parents-2025/83539381007/",
    "https://www.usatoday.com/picture-gallery/news/nation/2024/10/31/shoppers-flock-to-farmers-markets-for-reasonably-priced-mid-week-essentials/75846100007/",
    "https://www.usatoday.com/story/money/2025/05/29/student-loan-delinquency-credit-score-impact/83903527007/",
    "https://newsroom.bankofamerica.com//content/newsroom/press-releases/2025/07/confronted-with-higher-living-costs--72--of-young-adults-take-ac.html",
    "https://www.usatoday.com/story/money/2025/07/15/gen-z-tiktok-side-hustle-culture/84460065007/",
    "https://www.usatoday.com/story/money/2025/04/21/what-2025-graduates-want/83144529007/",
    "https://www.usatoday.com/story/life/health-wellness/2025/07/16/gen-z-stare-is-going-viral-on-tiktok-what-is-it/85242062007/#:~:text=The%20Gen%20Z%20stare%20is,USA%20TODAY%20Daily%20Crossword%20Puzzle.",
    "https://www.usatoday.com/story/money/2025/06/26/gen-z-shoppers-social-conscious-responsible-price/84292163007/#:~:text=In%20the%20past%20six%20months,pre%2Downed%20and%20vintage%20shopping.",
    "https://www.usatoday.com/story/money/2025/07/31/gen-z-entrepreneurship-job-market/85443347007/",
    "https://www.usatoday.com/story/money/2025/08/04/student-loan-interest-resumes-save-plan/85508307007/",
    "https://www.usatoday.com/story/money/2025/04/22/how-to-make-a-budget/83144634007/#:~:text=The%2050%2F30%2F20%20strategy,contribution%20to%20your%20savings%20account."
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gen Z",
      "weight": 0.09587461
    },
    {
      "name": "Gen Zers",
      "weight": 0.07923331
    },
    {
      "name": "family financial support",
      "weight": 0.07115463
    },
    {
      "name": "Financial stress",
      "weight": 0.07070473
    },
    {
      "name": "financial independence",
      "weight": 0.06991077
    },
    {
      "name": "Generation Z",
      "weight": 0.06770076
    },
    {
      "name": "Financial wellness",
      "weight": 0.0676222
    },
    {
      "name": "financial success",
      "weight": 0.066003695
    },
    {
      "name": "last year",
      "weight": 0.059510723
    },
    {
      "name": "a Gen Z personal finance expert",
      "weight": 0.056691434
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Banking/Other",
      "score": 0.5751953125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.5107421875
    },
    {
      "name": "/Finance/Financial Planning & Management/Other",
      "score": 0.5078125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.39697265625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.356689453125
    },
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.34033203125
    }
  ],
  "sentiment": {
    "positive": 0.046142578,
    "negative": 0.81640625,
    "neutral": 0.13684082
  },
  "summary": "A survey conducted by Bank of America has found that Generation Z (Gen Z) are becoming more financially independent. Over the last year, 72% of Gen Z took steps to improve their financial health, and fewer Zers are relying on financial support from family. The survey also found that while not all Gen Zers have left their parents' payroll, 39% rely on family financial support, down from 46%. Despite this, a third of the respondents are still stressed, with 52% citing economic instability as a reason for their action. Despite prioritizing income diversification, entrepreneurship, and values-based spending, a majority focused on reducing expenses last year. The study also revealed that 22% receive $1,000 or more per month less than a year ago, and 54% receive less than $500 monthly.",
  "shortSummary": "Gen Z, driven by financial independence, is focusing on responsible financial management and self-confidence, despite high costs and family support, emphasizing income diversification, entrepreneurship, and value-based spending.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1a6bf6c4425d40e785891511a64201cc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/money/2025/06/26/gen-z-shoppers-social-conscious-responsible-price/84292163007/#:~:text=In%20the%20past%20six%20months,pre%2Downed%20and%20vintage%20shopping.",
      "text": "Gen Z shoppers aren't looking for the cheapest price. What is important to them?\nWhen Noor Hasan was a teen shopper, she was highly influenced by trends and bought a lot of cheap clothes from fast-fashion brands.\nBut Hasan's shopping habits have shifted as she has gotten older, and the 23-year old now is deliberate about where she shops and whether that brand or retailer aligns with her ethical and political beliefs.\nMore shoppers – and Gen Z shoppers in particular – say they are also doing more mindful, purpose-driven shopping, or what Lightspeed Commerce calls \"valuespending.\"\nWhat is valuespending?\nIn a survey of 2,000 consumers ages 18 and up in the United States and Canada, 92% of all respondents consider themselves somewhat intentional with their purchases, and 40% say they're very intentional.\n“Consumers today are balancing cost with conscience,” Dax Dasilva, CEO and founder of Lightspeed, a point-of-sale commerce platform that serves a variety of retail and hospitality clients, said in a statement. “It’s not always about the lowest price − it’s about choosing brands that reflect their values. And when those values align, loyalty can follow more easily. This new era of intentional spending − valuespending − is reshaping retail and pushing businesses to be more transparent and authentic.”\nSurvey respondents said price (78%) and quality (67%) remain key priorities, but more shoppers (62%) said it was important that their purchases align with their personal values or identity.\nAdditionally:\n- 27% have made purchases based on national pride.\n- 18% supported brands for charitable or social causes.\n- 18% chose products for their sustainability.\n- 15% factored in a CEO’s political alignment.\nGen Z shoppers leading trend of socially conscious shopping\nAs Gen Z shoppers have come of age and with it their buying power, there has been a shift in how and from whom they are buying, Dasilva said.\n\"They're the trendsetters. ... They've come into target as the consumer that everybody wants to sell to,\" he told USA TODAY.\nHasan, who lives in Los Angeles and will be entering law school in the fall, said she shifted her spending habits as she became more financially independent.\nNow, instead of looking for the cheapest fashion finds, for instance, Hasan said she is willing to spend more on clothing from brands that she knows pays fairer wages to their workers.\nShe is not spending more overall but is adjusting her shopping budget to buy less, because she acknowledges she often has to pay more for brands she believes in.\n\"I'm paying more and getting less of it, which I think is an ethical exchange I'm willing to make as a consumer,\" she said.\nHasan, a Palestinian American, also said she will support companies that align with her political beliefs and boycott those that don't. She has joined boycotts against companies that have not shown support for Palestinians.\nGen Z shoppers fear being judged or canceled\nIn the Lightspeed Commerce study, nearly 1 in 3 Gen Z respondents (32%) said they feared being judged for buying from the \"wrong\" brands.\nIn the past six months, Gen Z shoppers said they had made buying decisions either to support or avoid brands based on sustainability/environmental impact (37%), localism or national pride (29%) and religious or cultural alignment (26%).\n\"There's that element of peer pressure that we make statements with the things we purchase or the things we wear,\" Dasilva said.\nDasilva said environmentally conscious Gen Z shoppers and others also have helped the rise of pre-owned and vintage shopping.\nThis story has been updated to fix a typo\nBetty Lin-Fisher is a consumer reporter for USA TODAY. Reach her at blinfisher@USATODAY.com or follow her on X, Facebook or Instagram @blinfisher and @blinfisher.bsky.social on Bluesky. Sign up for our free The Daily Money newsletter, which will include consumer news on Fridays, here."
    },
    {
      "url": "https://www.usatoday.com/story/money/personalfinance/2025/08/04/americans-thinking-about-money/85462709007/",
      "text": "'A part-time job': Americans spend nearly 4 hours a day thinking about money\n- Americans spend nearly four hours a day thinking about their finances, with many experiencing increased financial stress compared to last year.\n- Top financial concerns include bills, inflation, housing costs, and debt, varying by generation.\n- Younger generations, particularly Gen Z and Millennials, spend more time worrying about money and experience more sleep disruption due to financial concerns.\nBetween bills to pay, tariff news and inflation worries, money is living rent-free in Americans’ minds.\nThey’re spending nearly four hours a day on average thinking about it, according to new research from Empower, a financial services company.\n“That’s a part-time job,” said Rebecca Rickert, head of communications and consumer insights at Empower.\nAt 54%, a little more than half of the 2,206 adults surveyed said they’re thinking about it more than they did last year. In fact, the June survey found 53% of Americans said they’re feeling financial stress \"more acutely than ever,\" including 62% of Gen Xers and 41% of baby boomers.\nWith banking and investment apps a tap away on their phones, 17% of Americans are checking their financial accounts multiple times a day, and 24% check their bank account daily.\nThe high level of surveillance is more common among younger generations: 24% of Gen Zers and 21% of millennials are looking at their accounts several times a day, compared with 10% of baby boomers.\n“People are checking their accounts like they check the weather,” Rickert said.\nWhat exactly are Americans thinking about?\nTop of mind for most Americans is, of course, upcoming and due payments – 57% of Americans report they’re thinking about bills.\nInflation and rising prices also are taking up headspace for 51% of Americans. Of those surveyed, 34% are thinking about housing costs, 30% are thinking about debt, 28% are thinking about tariffs, and 24% are thinking about retirement savings.\n“People are carrying more financial pressure as they face external factors that are beyond their control, like market uncertainty, while managing multiple priorities like debt, everyday expenses, and savings – even if their income hasn’t changed,” Lisa Frison, head of financial inclusion at Citi, told USA TODAY.\nChief worries for younger generations are housing costs, job security and debt, Rickert said. Meanwhile, older generations are thinking about retirement savings and reserves, like their emergency cash.\nYounger Americans spend more time worrying\nTime spent thinking about money varies by generation, and it appears to decline as Americans grow older.\nGen Z spends the most time thinking about money, averaging 4.82 hours a day. Millennials follow close behind, averaging 4.73 hours a day. Money still weighs heavily on Gen Xers’ and baby boomers’ minds, but they aren’t thinking as much about it: They average 3.74 hours and 2.4 hours a day, respectively.\nJack Howard, head of financial wellness at Ally Financial, said Gen Zers are unique because they grew up having more information at their fingertips thanks to the internet and are “comparing themselves against the world” thanks to social media.\n\"Which is good because we want you to get the information and use it. But I wonder if it’s also creating an overload of anxiety,” Howard said. “Social media creates some level of competition.”\nWhen are Americans thinking about money?\nThe topic is so stressful that 36% of Americans report losing sleep over their financial worries. Millennials may be getting the least rest: 44% report that money worries are keeping them up. Baby boomers are faring better at night; only 24% report it affects their sleep.\nMoney concerns don’t stop during the day. The survey found that 38% of respondents said financial worries interfered with their ability to focus and put a strain on their relationships.\nGen Zers are most likely to think about money between 2 p.m. and 5 p.m., while millennials and Gen Xers are often worrying about their finances before bed, between 8 p.m. and 11 p.m.\nIs money stress motivating?\nClose to half of Americans report that thinking about money helps them take action to reach their long-term goals, and 47% said they feel confident they’ll reach them.\nAnother 30% reported feeling neutral, or on the fence, about whether they’ll reach their long-term goals. In the meantime, many Americans are seeking financial advice and information.\nMore than half reported following financial news to stay informed, commonly researching topics including inflation, budgeting and saving. A third said talking with a financial adviser helps clarify their financial goals.\nStill, Frison cautions people against ruminating over their finances and thinking too much about past mistakes or missed opportunities, which can lead to frustration but not solutions.\n“It's unhelpful when thinking about money becomes an infinite loop, so the key is to shift from stress to structure, even with one small move,” Frison told USA TODAY.\nWhat helps ease financial pressure\nAsked what would ease their money worries, nearly half of the survey respondents said a higher income, and 45% said lower living expenses.\nBut 29% also wished for “broader economic improvements,” and 28% pointed to debt elimination. Nearly a quarter said a larger emergency fund would help, and 18% said a detailed financial plan would have a positive impact.\nSuppose money is taking up more mental headspace than you'd like. In that case, Frison recommends doing a personal financial audit, building small habits over time, and asking friends, family or a professional for help.\n“When people are in a silo on these things, it makes it difficult to take action,” Howard said. “That’s where the shame comes in.”\nShe and Rickert emphasized the importance of people shifting from passive worrying to taking action – whether that’s starting to pay down debt or contributing to a 401(k) – to better their financial situation and relieve stress.\nReach Rachel Barber at rbarber@usatoday.com and follow her on X @rachelbarber_"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/07/15/gen-z-tiktok-side-hustle-culture/84460065007/",
      "text": "She’s working two jobs and filming it for TikTok: Gen Z’s economic reality is going viral\nMonday through Friday, Cindy Dionicio hits snooze on at least one of her 3:30 a.m. alarms before getting up. She packs a Victoria’s Secret tote bag with a straightener, makeup and the office shoes and scrubs she’ll need for her dental receptionist job later that day. It’s a 15 minute drive to the Dunkin' Donuts where she works the opening shift.\nThen, she hits “record.”\n“Good morning guys, happy Monday,” she says to her 113,000 followers, car keys clinking in the background as she walks up to the location. “Come to work with me as a 25-year-old working two jobs plus owning a small cleaning company.”\nGen Z employees are increasingly choosing to take on multiple jobs or side gigs, often driven by economic necessity. Creators like Dionicio are going a step further, posting about their side hustles on TikTok to make additional cash − and connect with other young people in the process.\nThese creators use the social media platform \"to validate their lived experience and find solidarity in what can feel like a relentless economic system,” says financial therapist Lindsay Bryan-Podvin, who authored the workbook “The Financial Anxiety Solution.” ”I see them as a version of saying, ‘This is my reality. I’m tired, I’m doing my best, and I still care about my skincare routine.’”\nGen Z, the cohort born between 1997 and 2012, is increasingly anxious about their financial situation. Many are saddled with student loans and entering a slowing U.S. labor market amid skyrocketing costs of living. They say they feel less confident about reaching financial milestones like owning a home.\n“We don't want to live at work and that shouldn't be the norm to buy a house or get by,” says 22-year-old Kahvon Frank-Morrell, who works at Walmart and as a custodian. “I don't think that everyone should have to be required to do two jobs to get ahead or to live a basic life.”\n'A constant fatigue'\nFrank-Morrell is aiming to save enough to buy a house by 24. He leaves the house at 9 a.m. each morning and at times doesn't get back home until 5 a.m. the next day − sometimes only sleeping between the hours of 6 a.m. and 8 a.m. following his two shifts of work.\n“It feels like a constant fatigue,” Frank-Morrell says. “But overall, when you see that paycheck, it tends to be worth it.”\nToronto-based 26-year-old Jane Tsang works two full time jobs as a marketing specialist and call center employee. After her second full-time internship in college, she realized she didn’t enjoy working in a corporate environment and started prioritizing ways to retire early.\n“It just hit me, I cannot do this for the next 45 years,” Tsang says. “A lot of young people are looking for more flexibility and freedom and independence.”\nShe’s worked more than one job for five years and says there are days she goes without moving or seeing the sun. She started experiencing intense headaches in 2022, resulting in multiple doctors appointments and an MRI. It wasn’t until her headache immediately went away on a cruise in winter of 2022 that she realized it was stress-related.\n“When I did do exercise and did see the sun, I would have to sacrifice my sleep for it,” Tsang says. “My health was severely impacted.”\nMonetizing a side hustle on TikTok\nIn June of 2023, Frank-Morrell made a TikTok account to post videos like “Working 2 jobs in an attempt to save $60,000” and “Day in the life working 2 jobs,” some of which have reached more than 10 million views and can be monetized through TikTok’s Creator Rewards Program.\n“Get ready with me” and “Day in the life” formats have become popular styles in the influencer economy, which the consulting firm McKinsey values at more than $21 billion.\nWhen the comment sections on users’ confession videos are filled with support, it can build a sense of solidarity and peer connection. But the influx in videos can also contribute to unhealthy comparison about one’s economic situation, or glamorize an unrealistic work schedule, according to financial therapist Nate Astle.\n“Hustle culture has always been a thing, but I think it's been romanticized more because of things like social media,” Astle says.\nTsang uses her platform to advocate for Financial Independence, Retire Early (FIRE), a movement that prioritizes intense saving and budgeting to retire before the age of 65. She started posting about her lifestyle to fill what she saw as a void of content from young people her age who were anti-work.\n“I just needed a platform, an outlet to vent to, and I felt like some people related,” Tsang says.\nGen Z increasingly anxious about their financial situation\nTsang says people her age feel “jaded” and “resentful” at the combination of modern work culture and increasing economic instability, leading to nihilism or an anti-career mentality.\n“People feel like they're trading in 40 hours a week, but it's no longer able to feed a family, it's no longer able to afford a house,” Tsang says.\nBryan-Podvin says the videos highlight how some young people are intentionally opting out of higher education and the associated student loan debt by working jobs with manual labor. She pointed out that much of Gen Z came of age watching their families navigate the 2008 recession, and then graduated or went through developmental years during a pandemic.\n“Gen Z is starting their financial lives with more debt, fewer social safety nets and higher costs across the board. Where millennials were told a version of, ‘just get a degree and you’ll be fine,’ Gen Z wasn’t given that same message,” Bryan-Podvin says.\nCost of living is frequently cited as a top financial concern among young people. Nearly a third of Gen Z and millennials worry their finances could lead them to experience homelessness, and they are almost three times more likely than older respondents to feel that way, according to a 2024 survey conducted by Acorns and Opinium Research.\nLife events like watching a parent lose a job in childhood, experiencing economic instability during a recession, or having a failed business can also contribute to anxiety about finances, according to Astle.\n\"Gen Z is seeing massive wealth inequality. And wealth inequality has always been a thing, but it truly is at a level not seen before in the last 100 years,” Astle says. “A lot of Gen Z are experiencing the anxiety of… 'I don't actually know if my needs are going to be met.'\"\nIf there ever is a time to have a side hustle, “it’s when you’re young,” says President of the Kahler Financial Group and financial therapist Rick Kahler. A second job can insulate you from losing a job, help fund a retirement plan, or potentially serve as a creative outlet, according to Kahler and Bryan-Podvin. Building good financial habits and investing early compounds interest over decades, setting one up for retirement.\n“If you've come out of college and you're used to the ramen noodle diet, keep that going and, and save that money,” Kahler says.\nDionicio, who has more than 113,000 followers, says it’s been inspiring to see how many people relate to having two jobs.\n“At first I was a little shy with the camera, but then I would see other people post about their daily lives, and I'm like, ‘You know what? Let me do mine,” Dionicio said.\nThe positive reception she receives in her comment section encourages her to keep going. “How do you have the energy for two jobs plus your own business plus content creation AND you’re a mom!! Superwoman,” one person commented. “You go girl!” said another.\nRachel Hale’s role covering Youth Mental Health at USA TODAY is supported by a partnership with Pivotal Ventures and Journalism Funding Partners. Funders do not provide editorial input.\nReach her at rhale@usatoday.com and @rachelleighhale on X.\n(This story has been updated because an earlier version included an inaccuracy. )"
    },
    {
      "url": "https://newsroom.bankofamerica.com//content/newsroom/press-releases/2025/07/confronted-with-higher-living-costs--72--of-young-adults-take-ac.html",
      "text": "Confronted with Higher Living Costs, 72% of Young Adults Take Action to Improve their Financial Health, finds BofA Better Money Habits Study\nJuly 30, 2025 at 10:00 AM Eastern\nCHARLOTTE, NC – Gen Z (ages 18-28) is finding adulthood more expensive than expected. Facing this, nearly three quarters of them are taking action to improve their financial health, according to Bank of America’s 2025 Better Money Habits® financial education study (PDF), published today.\n“Gen Z is challenging the stereotype when it comes to young people and their finances,” said Holly O’Neill, president of Consumer, Retail and Preferred Banking at Bank of America. “Even though they’re facing economic barriers and high everyday costs, they are working hard to become financially independent and take control of their money.”\nKey findings from the study include:\nAccording to the study, about half (51%) of Gen Z surveyed say the high cost of living is a barrier to financial success. Total monthly spending is higher than they thought it would be for 35%, especially for everyday expenses including groceries (63%), rent and utilities (47%) and dining out (42%).\nThe study found that Gen Z feel a lack of income is a problem as well, with over half (53%) not feeling they make enough money to live the life they want, and many are struggling to save consistently. In fact, 55% don’t have enough emergency savings to cover three months of expenses.\nWhile Gen Z knows that saving for the future is important, they struggle to do so, with close to half (43%) saying they are not on track to actively save for retirement in the next five years, though they’d like to be. Many see saving for retirement and investing as symbols of financial independence (42% and 35% respectively). However, only a quarter (25%) contributed to a retirement account in the last year and one-in-five (21%) invested in the stock market, up slightly from recent years.\nDespite a lack of income, Gen Z finds ways to enjoy the little things, whether celebrating a win or trying to help turn around a bad day: 57% buy themselves a small “treat” at least once a week. Unfortunately for over half (59%), this leads to overspending, making little treats a slippery slope.\nAnd, according to data from Bank of America Institute (PDF), while there are signs of some pressures on younger generations, the median deposit level of Gen Z and Millennials remains elevated compared to 2019 levels – showing that these generations do not appear to be running down their savings in the face of higher costs.\nA third (33%) of Gen Z are stressed about their finances, and of those, 52% say economic instability is a root cause. When stressed about their finances, many (90%) are likely to take action, including checking their bank account balance (69%), making a budget (64%), getting ahead on paying bills (46%) or other smart money moves. But for some, stress leads to avoidance or splurges: 33% of Gen Z are likely to avoid thinking about or taking positive actions on their finances when they’re feeling stressed financially; 30% are likely to treat themselves to a purchase when worried about money.\nGen Z understands the importance of financial health, and they value being transparent with friends about money. Consistent with findings in prior years, two-thirds (66%) of Gen Z don’t feel pressured by their friends to spend beyond their means, and 42% feel comfortable declining social activities and letting their friends know it’s because they can’t afford them.\nFinancial health also matters in romantic relationships for Gen Z – with nearly four out of five (78%) saying that financial responsibility is an important attribute when choosing a significant other.\nThis survey was conducted online from April 4 – 25, 2025, by Ipsos. This study is based on national samples of 1,069 general population adults (age 18 or older), 915 general population Gen Z adults (age 18-28). The survey was conducted both in English and Spanish and utilized samples from both opt-in sources and the Ipsos KnowledgePanel®, the largest and most well-established online probability-based panel that is representative of the adult US population. The margin of sampling error for the general population sample is +/- 3.1 percentage points and for the general population Gen Z sample is +/- 3.5 percentage points at the 95 percent confidence level.\nAt Bank of America, we’re committed to helping people lead better financial lives by equipping them with the skills, knowledge and confidence to succeed. That’s why we created Better Money Habits, a financial education platform of tools and information that helps people make sense of their money and take action to improve. As a cornerstone of Better Money Habits, we offer free financial education content and tools, like our Gen Z Financial Guide that breaks down financial topics like budgeting, building credit, borrowing and investing in a way that’s approachable and easy to understand. We continually look for ways to expand the reach of Better Money Habits and also offer Spanish language resources on the site.\nBank of America Institute is dedicated to uncovering powerful insights that move business and society forward. Established in 2022, the Institute is a think tank that draws on data and analyses from across the bank and the world to provide timely and original perspectives on the economy, sustainability, and global transformation. The Institute leverages the depth and breadth of the bank’s proprietary data, from 69 million consumer and small business clients, 58 million verified digital users, $4.3T in total payments in 2024 and $1.2T in consumer and wealth management deposits. From this robust data set, the Institute provides a unique perspective on the health of the economy. It also elevates thought leadership from throughout the bank that addresses long-term trends and shares these findings with the general public.\nBank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 69 million consumer and small business clients with approximately 3,700 retail financial centers, approximately 15,000 ATMs (automated teller machines) and award-winning digital banking with approximately 59 million verified digital users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 4 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and more than 35 countries. Bank of America Corporation stock is listed on the New York Stock Exchange (NYSE: BAC).\nSusan Atran, Bank of America\nPhone: 1.646.743.0791\nsusan.atran@bofa.com\nBar graph titled \"Gen Z's Monthly Spending is High.\" Over a third (35%) of Gen Z reported that their total monthly spending is higher than they expected it to be once they started financially supporting themselves. This is especially true for older Gen Z (23 through 28), who said that 43% was higher. 25% of younger Gen Z (18 through 22) reported higher monthly spending.\nClustered bar graph titled \"Gen Z & Millennial Emergency Funds.\" Building an emergency fund remains difficult for Gen Z; over half (55%) do not have enough emergency savings to cover three months of expenses. Millennials struggle with building emergency savings too. 2022: Gen Z 55%, Millennials 46%. 2023: Gen Z 56%, Millennials 48%. 2024: Gen Z 57%, Millennials 49%. 2025: Gen Z 55%, Millennials 49%.\nBar graph titled \"Gen Z Investing in the Stock Market.\" 21% of Gen Z invested in the stock market over the past year. Encouragingly, this is up year-over-year. 19% in 2022; 15% in 2023; 15% in 2024; and 21% in 2025.\nClustered bar graph titled \"Gen Z Receiving Less Financial Support.\" Close to half (47%) of Gen Z receive financial support (versus 54% in 2024). In 2024, 32% received $1,000 or more and 44% received $500 or less. In 2025, 22% receive $1,000 or more and 54% receive $500 or less.\nJuly 30, 2025 at 10:00 AM Eastern\nConfronted with Higher Living Costs, 72% of Young Adults Take Action to Improve their Financial Health, finds BofA Better Money Habits Study\nCHARLOTTE, NC – Gen Z (ages 18-28) is finding adulthood more expensive than expected. Facing this, nearly three quarters of them are taking action to improve their financial health, according to Bank of America’s 2025 Better Money Habits® financial education study (PDF), published today.\n“Gen Z is challenging the stereotype when it comes to young people and their finances,” said Holly O’Neill, president of Consumer, Retail and Preferred Banking at Bank of America. “Even though they’re facing economic barriers and high everyday costs, they are working hard to become financially independent and take control of their money.”\nKey findings from the study include:\nAccording to the study, about half (51%) of Gen Z surveyed say the high cost of living is a barrier to financial success. Total monthly spending is higher than they thought it would be for 35%, especially for everyday expenses including groceries (63%), rent and utilities (47%) and dining out (42%).\nThe study found that Gen Z feel a lack of income is a problem as well, with over half (53%) not feeling they make enough money to live the life they want, and many are struggling to save consistently. In fact, 55% don’t have enough emergency savings to cover three months of expenses.\nWhile Gen Z knows that saving for the future is important, they struggle to do so, with close to half (43%) saying they are not on track to actively save for retirement in the next five years, though they’d like to be. Many see saving for retirement and investing as symbols of financial independence (42% and 35% respectively). However, only a quarter (25%) contributed to a retirement account in the last year and one-in-five (21%) invested in the stock market, up slightly from recent years.\nDespite a lack of income, Gen Z finds ways to enjoy the little things, whether celebrating a win or trying to help turn around a bad day: 57% buy themselves a small “treat” at least once a week. Unfortunately for over half (59%), this leads to overspending, making little treats a slippery slope.\nAnd, according to data from Bank of America Institute (PDF), while there are signs of some pressures on younger generations, the median deposit level of Gen Z and Millennials remains elevated compared to 2019 levels – showing that these generations do not appear to be running down their savings in the face of higher costs.\nA third (33%) of Gen Z are stressed about their finances, and of those, 52% say economic instability is a root cause. When stressed about their finances, many (90%) are likely to take action, including checking their bank account balance (69%), making a budget (64%), getting ahead on paying bills (46%) or other smart money moves. But for some, stress leads to avoidance or splurges: 33% of Gen Z are likely to avoid thinking about or taking positive actions on their finances when they’re feeling stressed financially; 30% are likely to treat themselves to a purchase when worried about money.\nGen Z understands the importance of financial health, and they value being transparent with friends about money. Consistent with findings in prior years, two-thirds (66%) of Gen Z don’t feel pressured by their friends to spend beyond their means, and 42% feel comfortable declining social activities and letting their friends know it’s because they can’t afford them.\nFinancial health also matters in romantic relationships for Gen Z – with nearly four out of five (78%) saying that financial responsibility is an important attribute when choosing a significant other.\nThis survey was conducted online from April 4 – 25, 2025, by Ipsos. This study is based on national samples of 1,069 general population adults (age 18 or older), 915 general population Gen Z adults (age 18-28). The survey was conducted both in English and Spanish and utilized samples from both opt-in sources and the Ipsos KnowledgePanel®, the largest and most well-established online probability-based panel that is representative of the adult US population. The margin of sampling error for the general population sample is +/- 3.1 percentage points and for the general population Gen Z sample is +/- 3.5 percentage points at the 95 percent confidence level.\nAt Bank of America, we’re committed to helping people lead better financial lives by equipping them with the skills, knowledge and confidence to succeed. That’s why we created Better Money Habits, a financial education platform of tools and information that helps people make sense of their money and take action to improve. As a cornerstone of Better Money Habits, we offer free financial education content and tools, like our Gen Z Financial Guide that breaks down financial topics like budgeting, building credit, borrowing and investing in a way that’s approachable and easy to understand. We continually look for ways to expand the reach of Better Money Habits and also offer Spanish language resources on the site.\nBank of America Institute is dedicated to uncovering powerful insights that move business and society forward. Established in 2022, the Institute is a think tank that draws on data and analyses from across the bank and the world to provide timely and original perspectives on the economy, sustainability, and global transformation. The Institute leverages the depth and breadth of the bank’s proprietary data, from 69 million consumer and small business clients, 58 million verified digital users, $4.3T in total payments in 2024 and $1.2T in consumer and wealth management deposits. From this robust data set, the Institute provides a unique perspective on the health of the economy. It also elevates thought leadership from throughout the bank that addresses long-term trends and shares these findings with the general public.\nBank of America is one of the world’s leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 69 million consumer and small business clients with approximately 3,700 retail financial centers, approximately 15,000 ATMs (automated teller machines) and award-winning digital banking with approximately 59 million verified digital users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 4 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and more than 35 countries. Bank of America Corporation stock is listed on the New York Stock Exchange (NYSE: BAC).\nSusan Atran, Bank of America\nPhone: 1.646.743.0791\nsusan.atran@bofa.com\nBar graph titled \"Gen Z's Monthly Spending is High.\" Over a third (35%) of Gen Z reported that their total monthly spending is higher than they expected it to be once they started financially supporting themselves. This is especially true for older Gen Z (23 through 28), who said that 43% was higher. 25% of younger Gen Z (18 through 22) reported higher monthly spending.\nClustered bar graph titled \"Gen Z & Millennial Emergency Funds.\" Building an emergency fund remains difficult for Gen Z; over half (55%) do not have enough emergency savings to cover three months of expenses. Millennials struggle with building emergency savings too. 2022: Gen Z 55%, Millennials 46%. 2023: Gen Z 56%, Millennials 48%. 2024: Gen Z 57%, Millennials 49%. 2025: Gen Z 55%, Millennials 49%.\nBar graph titled \"Gen Z Investing in the Stock Market.\" 21% of Gen Z invested in the stock market over the past year. Encouragingly, this is up year-over-year. 19% in 2022; 15% in 2023; 15% in 2024; and 21% in 2025.\nClustered bar graph titled \"Gen Z Receiving Less Financial Support.\" Close to half (47%) of Gen Z receive financial support (versus 54% in 2024). In 2024, 32% received $1,000 or more and 44% received $500 or less. In 2025, 22% receive $1,000 or more and 54% receive $500 or less."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/04/student-loan-interest-resumes-save-plan/85508307007/",
      "text": "Is your student loan payment increasing? What to know about SAVE plan updates\nMillions of student loan borrowers who were enrolled in a Biden-era repayment plan will soon see their monthly payments increase after the current administration restarted interest accrual Aug. 1.\nNearly 8 million borrowers on the Saving on a Valuable Education (SAVE) plan are now collecting interest on their loans for the first time since former President Joe Biden placed the group in forbearance in July 2024, pausing both monthly payments and interest accrual.\n\"Borrowers in the SAVE Plan will see their loan balances grow when interest starts accruing on August 1,\" the Department of Education said in its July 9 announcement of the changes. \"When the SAVE Plan forbearance ends, borrowers will be responsible for making monthly payments that include any accrued interest as well as their principal amounts.\"\nSAVE plan borrowers will begin seeing interest accrue on their loans after more than a year of relief, but they remain in general forbearance for their minimum monthly payments. However, payments on interest alone could cost the typical borrower hundreds of dollars per month, according to a recent analysis from the Student Borrower Protection Center, a debt-focused advocacy group.\nThe Department said the move is part of an effort to comply with an injunction issued in April to implement a court order striking down SAVE, however, the rulings they cited do not specifically call the interest-free forbearance illegal.\nHere's what to know:\nWhat is the SAVE plan?\nThat program, launched in 2023 by the Biden administration, was designed to provide more generous terms than prior income-based repayment plans, with monthly payments dropping to as low as $0 for some borrowers.\nIt also provided debt forgiveness for some smaller loans in as few as 10 years, compared to the 20- or 25-year timeline under earlier rules. But the program was quickly challenged in court, caught up in a string of rulings over the administration’s student debt relief plan. In 2024, two courts issued injunctions against the SAVE plan, effectively blocking it, leading the Biden administration to place SAVE plan borrowers into an interest-free forbearance as its legal fights continued.\nLike several other student loan programs, the SAVE plan has come under fire from President Donald Trump's Department of Education as it began to aggressively overhaul the federal student loan system and institute aggressive collection policies.\nThe Department said it began direct outreach to the millions of SAVE plan borrowers in early July about the resumption of interest charges, including instructions on how to move to what it calls a \"legal repayment plan.\"\nHow much will payments increase?\nFor the typical borrower on the plan, the resumption of interest charges could cost them about $300 per month, according to a July analysis from the debt-focused advocacy group Student Borrower Protection Center. That amounts to more than $3,500 in interest costs annually.\nThe center said it estimates more than 40% of borrowers in the SAVE plan make less than 225% of the federal poverty line, which it calculated to be $35,213 per year for single borrowers and up to $72,338 for borrowers heading a household of four.\nBorrowers can check how the resumption of interest on their loans will impact their payments by going to the loan simulator on the Federal Student Aid website.\nWhat is the Repayment Assistance Plan?\nEducation Secretary Linda McMahon urged SAVE borrowers to transition quickly to alternate repayment plans.\n\"For years, the Biden administration used so-called ‘loan forgiveness’ promises to win votes, but federal courts repeatedly ruled that those actions were unlawful,\" she said in a statement on July 9. \"Congress designed these programs to ensure that borrowers repay their loans, yet the Biden administration tried to illegally force taxpayers to foot the bill instead.\"\nMcMahon said the department urges all borrowers in the SAVE plan to transition to what she calls \"legally compliant\" repayment plans, pointing to the administration's proposed Repayment Assistance Plan, RAP, slated to replace the existing Income-Based Repayment Plan in 2026.\nSAVE based monthly payments, which could be as low as $0, on discretionary income. In comparison, RAP bases payments on gross income and requires all borrowers, even those who report no income, to make minimum monthly payments of at least $10.\nThe new plan was part of a series of student loan changes included in Trump's massive tax and spending bill, signed into law on July 4. Most of the overhauls take effect July 1, 2026, and include new limits on the amount that students and their families can borrow and new eligibility criteria for Pell Grants, which help low-income undergraduate students.\nThis story was updated to clarify a reference to SAVE plan borrowers' forbearance status.\nContributing: Reuters; Zachary Schermele, USA TODAY.\nKathryn Palmer is a national trending news reporter for USA TODAY. You can reach her at kapalmer@usatoday.com and on X @KathrynPlmr."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/07/31/gen-z-entrepreneurship-job-market/85443347007/",
      "text": "Tough job market? Gen Z responds with gig work and entrepreneurship\nThe class of 2025 entered a tough job market this summer, but some members of Generation Z are adapting.\nFor some young Americans, a majority of whom are entrepreneurial-minded and believe traditional 9-to-5 schedules are “outdated,” unconventional work is a solution to getting ghosted by employers. Some pick up multiple jobs and record their day-to-day for TikTok, hoping to monetize their routines further. Others turn to platforms that help them get gig work like Thumbtack, Fiverr or Taskrabbit.\n“I literally applied to like 85 actual 9-to-5s in all different types of industries,” said Nola Rodgers, 22. “None of them came through. Taskrabbit had the only people who actually responded to me.”\nThe platform saw a 25% increase in sign-ups in July, said Christopher Ager, Taskrabbit’s chief commercial officer. Though some users view these platforms as a way to earn some extra cash on the weekend, Rodgers and others are using them as a launch pad into entrepreneurship and a way to escape the 9-to-5 rat race.\n“Young adults are rewriting the rules of work and embracing side hustles as a sustainable, empowering alternative,” Ager told USA TODAY.\nHow bad is the job market?\nAt the start of this year, 1 in 5 working professionals who were looking for a job in 2024 were still searching, and 28% of people said the market was so bad they weren’t planning to look for one in 2025, according to LinkedIn research.\nNot everyone has the luxury of staying put, particularly if they never had full-time work to begin with. Nearly two-thirds of Gen Z said they were likely to search for a new job in 2025, according to a Bankrate job seeker survey.\nThe Labor Department’s April jobs report showed 1.7 million Americans have been out of work six months or longer, the most in more than two years. Hiring unexpectedly picked up in June as employers added 147,000 jobs, but only 74,000 of those were added in the private sector. State and local government hiring accounted for much of the rest.\nGen Z's entrepreneur mindset\nRodgers isn't too concerned with who is hiring.\nShe joined Taskrabbit in 2021 and has made $180,000 since she started assembling furniture, mounting TVs and organizing people’s homes. In 2022, she launched her own website offering similar services.\nThis year, she said that each month before taxes she’s bringing home $3,000 to $3,500 through Taskrabbit and about $2,000 through her small business.\nWithout a college degree, student loans or a boss, Rodgers has no regrets about taking an unconventional path compared with that of her peers.\n“I've been in the workforce 4½ years more than them. They’re just now trying to find jobs because they went to college, and I already have an established business,” Rodgers said. “So, I would say it worked out.”\nWithin the next five years, Rodgers wants to start making custom furniture to expand her business. And she’s not alone. A 2020 WP Engine survey found 62% of Gen Zers planned to start or possibly start their own business.\n'I don't want anyone to tell me how to do my job'\nKevin Johnson, 24, is among them. Like Rodgers, he started on Taskrabbit in 2019, mainly helping people move. Today, he said, he makes $2,500 to $4,000 a month before taxes.\nIt was enough for him to purchase a pickup in cash. He has two goals in mind after he wraps up his associate degree: saving for a down payment for a home and opening his own auto shop.\n“I don’t think you need a 9-to-5 to be stable,” Johnson said.\nThe Class of 2025 agrees. Monster’s State of the Graduate Report released earlier this year found 67% think a 9-to-5 schedule is outdated and 64% think the five-day workweek is antiquated. More than half said working full time in an office and the concept of having to relocate for a job are also outdated, the report found.\nJohnson prefers working for himself, anyway: “I don’t want anyone to tell me how to do my job.”\nReach Rachel Barber at rbarber@usatoday.com and follow her on X @rachelbarber_"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/05/12/adults-still-get-money-from-parents-2025/83539381007/",
      "text": "Groceries, phone bills, rent? Where parents still help adult kids financially\nWhen Kaylynn St. Peters turned 27, she got a job doing entertainment booking, but her excitement took a slight hit when her dad saw it as a sign it was time for her to start paying her own phone bill.\n“I was kind of riding that high until they kicked me off,” St. Peters said.\nWhile some may believe your late 20's is a tardy start to taking on such a task, on average, people start paying for their own cell line at age 27, a responsibility 76% of Americans consider one of the ultimate signs of adulthood, according to a new AT&T survey. Still, 32% of people don’t start paying their own cell phone bill until they are 30 or older and 18% don’t take it on until after they’ve turned 40.\nWhen St. Peters went to get her own plan, she was quoted around $70 a month from T-Mobile and Verizon. To her, that was “kind of crazy” so she joined her brother-in-law's plan instead and now sends him about $40 a month through Venmo.\nSome 46% of people do something similar, according to the survey. Erin Scarborough, AT&T's President of Broadband and Connectivity Initiatives said that's a reason why the company introduced SplitPay, which allows multiple people to pay their portion of a wireless bill without needing to use a third-party payment method.\nScarborough said the amount of people delaying paying their own bill is “absolutely growing” and is just one part of young people’s rising financial reliance on their parents well into their adult years.\n“I think that has definitely been going up year over year over year,” Scarborough said. “That has become prevalent in multiple other places, not just cell phone bills ... That was not the case 20 years ago.”\nMany of those polled by AT&T think she's right. Some 70% of survey respondents said they believe most Americans have access to at least one subscription service account they don’t pay for – something Netflix appears to be addressing with its crackdown on password sharing.\nBetween inflation fears and rising costs, times are tough. For many Americans, turning to the bank of mom and dad is a solution.\nHow many adults are receiving money from their parents?\nHalf of parents with adult children regularly send them money or help them financially, a savings.com survey found earlier this year.\nThe average amount these parents give reached a three-year high of $1,474 per month, up 6% from last year, according to the survey.\nAdult members of Gen Z, or those between the ages of 18 and 28, receive more from their parents than Millennials, or those between 29 and 44.\nOf those who get money from their parents, the average amount Gen Z receives in 2025 is $1,813 per month while the average amount for Millennials is $863.\nMuch of that money comes with strings attached. The survey found 77% of parents put conditions on their financial support.\nWhat things do adult children need help affording?\nGroceries, cell phone bills, and rent or mortgage payments top the list of costs parents help their adult children cover in 2025.\nEach month, 83% of supportive parents give their kids an average of $220 to help afford groceries, 65% pay an average of $63 for their child’s cell phone, and 63% cover an average of $653 of their kids’ rent or mortgage, according to the savings.com survey.\nAt 54%, most parents offering support also help their adult children pay for health insurance and healthcare.\nThe most costly monthly expense for 45% of parents supporting adult children is tuition or other school-related expenses, with parents spending an average of $1,198 per month.\nA minority of supportive parents also help their adult children invest, cover car payments, vacations, and student loan or credit card payments.\nFinancial dependence in adulthood can create tension\nThat support can cost parents more than some of their paychecks. Close to half of survey respondents said they had sacrificed their financial security to help their grown kids and working parents who support their adult children reported they give them more than double the amount they contribute to their retirement accounts.\nThis can create tension. Jack Howard, head of money wellness at Ally Financial, said it’s something parents bring up in the financial wellness and education workshops she leads.\nHoward gave the example of one mom who joined the workshop with her son and said she had a problem with the fact that she was still paying his phone bill. Howard said the son didn’t know his mom had an issue with it and immediately offered to start covering it himself.\nTo avoid an uncomfortable parent-child relationship, Howard suggests having financial conversations early and often, though she acknowledged that can be difficult for parents who grew up in families that avoided the subject.\n“I’m hearing that in a lot of our classes. ‘We didn’t talk about money. It was taboo. It was seen as disrespectful.’ But now with social media, when you think of Gen Z, there’s so much access to information and transparency that they expect that from (their parents),” Howard said.\nReach Rachel Barber at rbarber@usatoday.com and follow her on X @rachelbarber_"
    },
    {
      "url": "https://www.usatoday.com/story/life/health-wellness/2025/07/16/gen-z-stare-is-going-viral-on-tiktok-what-is-it/85242062007/#:~:text=The%20Gen%20Z%20stare%20is,USA%20TODAY%20Daily%20Crossword%20Puzzle.",
      "text": "Gen Z’s blank stare is the internet’s latest obsession\nEver received an awkward response to a “Hi how are you?” from a younger neighbor or a deer in the headlights look from a teenage customer service worker?\nTikTokers say there’s a name for that — the “Gen Z stare.”\nUsers on the platform say it refers to the vacant stare young people might give in response to small talk, simple customer service questions or workplace inquiries. Hypothetical skits on the platform mocking Gen Z responses are going viral.\nIt’s sparking a broader conversation about the impact of the COVID-19 pandemic, chronic technology use, and if Gen Z (the cohort born between 1997 and 2012) lacks communication skills in the workplace and social settings.\nWhat is the Gen Z stare?\nThe Gen Z stare is a term used to refer to the blank, expressionless look some say is characteristic of young people’s interactions. It might manifest as an awkward encounter with a barista or a lack of verbal response from a coworker.\nMost of the viral skits portray the stare in customer service interactions, where a Gen Z cashier or customer responds with a blank, wordless stare where small talk would usually fill the void, sometimes as a result of a senseless questions.\n\"It’s literally just exhausted teenagers working part time trying to put up with school while paying bills,” one person commented under a skit with 2.3 million views from TikToker Mark Gaetano, known on the platform as Snarky Marky. “The Gen Z stare is usually just us being in complete disbelief of what we’re witnessing,” says another.\nBut commenters from other generations argued back that the stare goes beyond the typical customer service blank face.\n“We're talking about the stare when anyone tries to have just a normal human interaction with you, like in the flesh, and you guys freeze,” one TikToker posted, \"I can't even count to you how many times I've tried to say hi to neighbors walking by that are like in their teens and they just look at you like they just saw a ghost.\"\nSocial skills shaped by 24/7 technology and the pandemic\nThe videos have sparked intergenerational discourse. Some Gen Zers defended the stare as a response to illogical questions from customers, while others acknowledged it as a reflection of anxiety in social interactions.\nAnd it's possible the stare is the result of Gen Z’s social development being hindered during the pandemic. Online school and social distancing during lockdowns influenced how people of all ages navigated in-person interactions and awkward social situations.\nPlus, nearly half of teens say they’re online constantly, according to 2024 data from the Pew Research Center.\nGen Z, nicknamed “the anxious generation” by social psychologist Jonathan Haidt, is more anxious and isolated than older generations. Former U.S. Surgeon General Dr. Vivek H. Murthy sounded the alarm on loneliness during his term, explaining in a report that young adults are almost twice as likely to report feeling lonely than those older than 65.\nThere are jokes about every generation’s communication skills, from jabs about the millennial pause to boomers’ struggles to understand emojis. Whether it’s rooted in pandemic-induced social anxiety or changing workplace norms, it’s a sign of how young people are engaging with the world around them.\nRachel Hale’s role covering Youth Mental Health at USA TODAY is supported by a partnership with Pivotal Ventures and Journalism Funding Partners. Funders do not provide editorial input. Reach her at rhale@usatoday.com and@rachelleighhale on X."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/05/29/student-loan-delinquency-credit-score-impact/83903527007/",
      "text": "As millions miss student loan payments, here's how it could hurt the economy\nAfter a roughly five-year hiatus, student loan borrowers are once again seeing their credit scores plunge if they fall behind on payments. Economists say it could be bad news for borrowers and the economy at large.\nA report from the Federal Reserve Bank of New York found the delinquency rate for student loans surged from less than 1% in the fourth quarter of 2024 to nearly 8% in the first quarter of this year as a pause on reporting delinquent loans ended. That has sent some credit scores into a free fall, which makes it more difficult for borrowers to secure affordable loans or pull off major purchases.\nThe Federal Reserve Bank of New York said more than 2.2 million newly delinquent student loan borrowers’ credit scores plunged more than 100 points. More than 1 million had scores drop at least 150 points.\n\"We could see millions of borrowers potentially locked out of the conventional mortgage market. They could see the cost of a car loan double, they could find it harder to find rental housing,\" said Aissa Canchola Bañez, policy director at the Student Borrower Protection Center, an advocacy group focused on alleviating student loan debt. \"The immediate harm, but also the long-term harm, is just massive.\"\nWhy are student loan delinquencies on the rise?\nThe federal government’s pandemic-era student loan payment pause lifted in September 2023, but it wasn’t until fall 2024 that payments at least 90 days past due could be reported to credit bureaus. Those delinquencies started appearing on credit reports in 2025.\nAs of the first quarter, nearly 1 in 4 student loan borrowers required to make payments were behind on their loans, according to the Federal Reserve Bank of New York.\nMuch of that surge could be driven by confusion around loan payments restarting, according to Beth Akers, a senior fellow who focuses on the economics of higher education at the American Enterprise Institute, a conservative think tank.\nThe pause – which began under President Donald Trump's first administration – was extended multiple times under President Joe Biden. Meanwhile, online rumors claimed all student loans had been permanently canceled under Biden. Biden did attempt to forgive $400 billion in student debt, but the plan was ultimately struck down by the Supreme Court.\n“For a long time, I think borrowers thought their loans were canceled. Or that they'd never have to repay them. And I don’t blame anyone for believing that,” Akers said. “We really confused the heck out of borrowers.”\nOther borrowers may not be financially prepared to pay back their loans, especially after falling out of habit with their monthly payments.\n\"The economy is very different than it was pre-COVID,\" said Betsy Mayotte, president of The Institute of Student Loan Advisors, a nonprofit based in Plymouth, Massachusetts. \"Things like housing and eggs and lettuce cost a lot more than they did prior to COVID. So a payment that might have been affordable in 2020 might not be affordable now.\"\nA paper co-written by Michael Dinerstein, an associate professor of economics at Duke University in North Carolina, found the student loan pause allowed borrowers to take on other forms of debt, such as mortgages, credit card loans and auto loans. Now those borrowers are also on the hook for student loan payments that can cost hundreds, if not thousands, each month.\nAnother possible factor? This year's surge may be tied to an influx of late payments that would have been spread out across multiple years without the pause, according to Kristin Blagg, principal research associate in the Work, Education, and Labor Division at the Urban Institute, a Washington, D.C.-based think tank.\n\"In an average year, about a million people enter default,\" Blagg said. \"And what we’ve had is almost five years of students not getting to that default period. So you can think of this being almost a buildup of folks who would have defaulted during that time who are just now reaching that point.\"\nAbout 5.6 million borrowers were considered newly delinquent in the first quarter of 2025. The Federal Reserve Bank of New York estimated in March that more than 9 million student loan borrowers will face significant credit score decreases by the end of June.\nWhat does this mean for borrowers?\nReese Wallace, 34 of Oakland, California, watched his credit score plunge from above 700 to 488 this year after he stopped paying his student loans.\nA 2023 graduate from the California College of the Arts, Wallace left school with roughly $50,000 in student debt. Payments were nearly $500 a month, which Wallace said was untenable on a studio artist wage in the Bay Area.\nWallace said he quit paying his loans last year to put the money toward graduate school applications, under the impression that his loans would be automatically deferred as he applied. He realized that wasn't true when his application for student housing at the University of Nevada, Las Vegas, was rejected because of his low credit score.\nThe credit score has thrown a wrench in Wallace’s plans to move for graduate school. He had to get a co-signer for housing, and he worries he'll have trouble affording a car after years of traveling with public transportation in California.\n\"What kind of vehicle can I get with a 488 credit score?” he asked. “It’s honestly going to be really, really difficult.”\nAkers believes resuming student loan payments is fair to taxpayers but said there can be “serious trickle-down implications” when credit scores take a hit, especially since the baseline interest rate is already high.\n“People are quick to think about the ability to finance the purchase of a new home at an affordable interest rate,” she said. “But also employers look at credit scores sometimes. When you’re renting a home, they look at your credit score.”\nBorrowers could find themselves in more hot water if they continue to miss payments. After 270 days, the government can seize wages, tax returns or Social Security benefits. The Office of Federal Student Aid is expected to send notices on wage garnishments this summer.\nWhat does this mean for the economy?\nEconomists warn restarted payments and sinking credit scores could deliver another hit to an economy that has already shown signs of slowing this year.\n“It's another potential drag,” Blagg said. “We don’t have a good sense of how big it is compared to all the other things that are going on in the moment, but anytime there's a dollar spent servicing loans, it’s a dollar that’s not being put into the economy or saved for a big purchase.\"\nMorgan Stanley economists estimate increased loan payments could lower real GDP growth by up to 0.15 percentage points this year as payments increase by $1 billion to $3 billion a month. Their May 5 report says the GDP impact is \"relatively small\" but describes it as \"another headwind\" for consumers.\nTips for borrowers\nCanchola Bañez from the Student Borrower Protection Center shared advice for borrowers who are delinquent on their loans:\n- Borrowers should explore repayment options at Studentaid.gov. Canchola Bañez said income-driven repayment plans are likely their best option. This shift could take time; there's a backlog of roughly 2 million federal student loan borrowers requesting income-driven repayment plans, according to figures from the Education Department. Borrowers can be in forbearance while their application is processing, which means they won't have to make their loan payments while they're waiting for approval on a more affordable payment plan.\nIf a borrower is more than 270 days behind on their loan, the Education Department lays out three options to get out of default:\n- Repay the loan in full (not practical for most borrowers).\n- Look into loan rehabilitation. Borrowers can contact the loan holder and agree in writing to make nine affordable monthly payments within 20 days of a set due date, all within 10 consecutive months.\n- Explore loan consolidation. Borrowers agree to repay a new \"Direct Consolidation Loan\" under an income-driven repayment plan or make three full consecutive voluntary on-time monthly payments on the defaulted loan before it is consolidated. Though this option is faster, accrued interest is added to the principal balance, which could have borrowers paying more overall."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/04/21/what-2025-graduates-want/83144529007/",
      "text": "New grads want remote, high-paying jobs that align with their values. Is that possible?\nLike many 2025 college graduates, Jayda Hurtado is hoping to land a dream job soon but is quickly learning the challenges involved with entering today’s job market.\n“I’m actually terrified. I probably have a good cry session about it maybe every two weeks,” Hurtado said.\nShe’s applied to jobs but hasn’t landed an interview yet. She plans to keep searching over the next month and hopes to have something in place before graduation.\n“If not, then it’s a matter of having something to get me by before I get a big girl job,” Hurtado said. “I also know the economy is in a weird place.”\nOverall, 2025 graduates are confident they will find a job. Monster’s 2025 State of the Graduate Report found 83% think it’ll happen shortly after graduation, with 37% predicting it’ll happen within four to six months. Only 5% said they think it’ll take them a year or longer to secure a job.\nMost graduates feel confident their skills match those required for entry-level roles, and 20% reported feeling overqualified for an entry-level position.\nHurtado majored in advertising and earned a certificate in music business during her time at the University of Georgia. She currently works as a server and bartender but dreams of doing marketing for a record label or something similar. But she said she’s realistic and that’s why she’s also applying for standard advertising jobs as well.\nShe’s not alone. Some 48% of 2025 graduates think they will not be able to find a job at an organization they prefer, according to the report.\n“It’s a hard world out there for a lot of people who are not just highly educated, but have built these careers and have a trusted resume of previous experience. It’s hard for them to get a job,” said Emily Levine, executive vice president at recruitment firm Career Group Companies. “If you want to get a job somewhat quickly and start contributing and earning money, it most likely won’t be your dream job. And that’s okay.”\nWhat 2025 graduates want\nThis year’s college graduates have long wish lists for their future employers.\nThe report found less than two in five graduates said they would be willing to accept working in office, down 7% from 2024. At 42%, a sizable portion said they would never accept a job at a company that doesn’t offer flexible or hybrid work schedules.\n“Remote work or hybrid work is no longer a nice-to-have,” said Vicki Salemi, a career expert at Monster. “For these grads, it’s a must-have.”\nMost new graduates are also unwilling to work for free, with only 12% saying they’d accept an unpaid internship and 62% reporting the most important aspect of a job is a good salary.\nAside from money, 2025 graduates want a supportive work environment and a team that aligns with their values. Some 91% said it's important they feel comfortable discussing mental wellness at work and 71% said they wouldn’t work for a company that openly supports a political issue or candidate they don’t, up 4% from last year.\nBiggest deal breakers for 2025 graduates\nThis year’s graduates appear to disagree with the conventional wisdom that the first few years of a career should involve paying dues and working overtime to get ahead. At 56%, more than half said they would never accept a job that doesn’t offer work-life balance.\nAnother deal breaker for new graduates is a stagnant workplace. Some 54% said they would never accept a job with an employer that doesn’t offer growth opportunities.\nAt the end of the day, it does come back to money for some survey respondents. Among them, 49% said they would never accept a job that doesn’t come with a competitive salary and benefits, up 5% from last year.\nLevine said getting a job right after graduation can be tricky, as employers sometimes rely on interns during the summer and by the time the internships end, companies enter the fourth quarter when they may have already spent their hiring budget for the year.\n“Then you find yourself in 2026 but you’re a 2025 grad and you still haven’t found a job. That’s usually when these recent college grads become a little bit more flexible or open minded or humble to this process,” Levine said. “They think about the things that originally they scoffed at.”\nNew grads think traditional work practices are outdated\nNew graduates tend to think a traditional work week is a thing of the past. Some 67% said a ‘9 to 5’ schedule is outdated, up 12% from last year. At 64%, most also think the 5-day work week is antiquated, up 10% from 2024.\nIn general, 59% think working full time in an office and the concept of having to relocate for a job are outdated.\nYounger generations of graduates are also throwing off stigmas around job hopping and pay transparency, Salemi said. She credited young people with pushing employers to include things like salary and remote flexibility in job descriptions even if the law in their states does not require them to.\n“They’re looking at work and saying, ‘Wait a minute. Previous generations got it wrong and here’s how we can correct it.’ That’s commendable,” Salemi said. “And some (older) employees are saying, ‘Wait a minute. They have a point.’”\nReach Rachel Barber at rbarber@usatoday.com and follow her on X @rachelbarber_"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/04/22/how-to-make-a-budget/83144634007/#:~:text=The%2050%2F30%2F20%20strategy,contribution%20to%20your%20savings%20account.",
      "text": "What to prioritize when making a budget? Tips on creating and sticking to one\nBudgets. You know you should have one, but if checking your bank account stresses you out, the idea of tracking your spending can seem like the worst way to spend an afternoon.\nBut, one of the biggest financial mistakes you can make is not monitoring your money, according to Annamaria Lusardi, who heads Stanford's Initiative for Financial Decision-Making.\n“This is not an unbiased world that we face. Firms spend millions of dollars to make people spend,” Lusardi said. “I tell my students, by the time you leave this classroom, and you go back to your dorm, you’ll have five opportunities to spend. There is nothing, no sign, no advertisement, that says ‘Please stay within your budget.’”\nYou may think you have a budget. You might have an idea of how much you think you make, spend, and where you should cut back. But financial experts told USA TODAY people generally overestimate their earnings and underestimate their spending.\nTaking the time to determine your exact financial situation and set goals can be an enlightening experience. Yet while “how do I budget” seems like a simple question, knowing exactly where to start can be complicated. Here is a guide to help:\nFigure out where you are now\nFirst, you need to know how much money you make. Look for your take home pay after taxes and deductions for things like a 401(k). If you don’t have a stable income, freelance, or do gig work, take the average of your last several few months of income, and make a reasonable prediction about what you will make knowing what jobs you have lined up.\nIf you’re self-employed, this might also be a good time to think about the amount you’re setting aside for taxes.\n“Nobody is withholding money for you, and suddenly it comes to the end of the year and you’re going to owe taxes,” said Tim Rupert, a professor of accounting at Northeastern University. “That can be a real surprise for people. Oftentimes people think, ‘Oh, I don’t earn that much money,’ so they overestimate what they’re going to get to keep.”\nSecond, you need to know how much money you have to spend. Identify your fixed expenses. These are going to be costs like utility bills or payments for rent, a mortgage, a car, and insurance.\nThird, you should look at where else your money is going and identify your variable expenses. Although groceries are a necessity, for instance, there are ways you can lower those bills. Variable spending also includes things like eating out, shopping, and travel.\nSubtract your fixed and variable expenses from your income. Are you spending less or more than you earn?\nOnce you have a firm grasp on where you are, you can figure out where you want to go.\nSet goals and priorities\nYour goals will depend on your current financial situation. Experts agree that covering bills and making the minimum payment on debts on time are most people’s first priorities. If you’re not doing that, although you may be tired of hearing it, experts suggest looking at ways to increase your income like getting a second job or decreasing your expenses by canceling subscriptions or not getting takeout.\nOnce you’ve got your bills and minimum payments taken care of, you’ll want to tackle high-interest debt, like credit cards, and build a starter emergency fund of a few hundred dollars.\nRay Charles \"Chuck\" Howard, an associate professor of business administration at the University of Virginia, said people should focus on the goal that they are personally most motivated to reach.\n“The rational response is almost certainly to pay down the debt,” Howard said. “But you can imagine a circumstance in which you encounter some emergency expense that throws you into even more debt and makes you even more demotivated to improve your financial well-being, so it depends on the person.”\nIf your employer offers a 401(k) match, this is also the time to start thinking about getting some free money. Consider contributing enough to an employer-sponsored retirement account to fully capture the match so you’re not leaving money on the table.\nOnce you’ve paid down toxic debt and have your employer’s 401(k) match, you should continue to build up that starter emergency fund. Conventional wisdom suggests saving three to six months of expenses to prepare for a rainy day and avoid more bad debt.\nNext, budget for goals like a home, vacation or car\nNext, it’s time to pay off debt with lower interest rates like student loans or a mortgage and contribute more to retirement accounts. Then, feel free to invest in yourself. Set savings goals for a new home, car, or a vacation.\nExperts agreed that although this timeline of goals can work for a lot of people, everyone’s circumstances are different.\n“It has a lot to do with priorities,” Lusardi said. “If you live in an area where you know you need a car to go to work, or you’re building a family and need the car to bring your child to school... you have to make it a priority.”\nChoose tools to track your progress\nWhile making a budget, you may choose to use a time-tested budgeting strategy that works for you. Popular methods include 50/30/20, paying yourself first, and envelope budgets.\nThe 50/30/20 strategy involves putting 50% of your money toward needs, 20% toward savings, and 30% toward wants. The pay yourself method means that the first \"bill\" you pay when you get your paycheck is a contribution to your savings account. With an envelope budget, you put set amounts of money into different categories like entertainment or shopping, and once it runs out, you can no longer spend in that category.\nRupert said the biggest mistake people make with budgets is not sticking to it once they’ve made one.\n“People oftentimes have really good intentions to start,” he said. “For most of us, it’s not fun sticking to a budget.”\nBut to be successful, you must track your progress, and there are a lot of tools out there to help.\nYou can automate your savings by setting up a split deposit, which is when a portion of your direct deposit goes directly to a savings account before the rest ends up in checking. Another option is to set up automatic transfers from your checking to savings account.\nThe Federal Trade Commission also offers a free monthly budget worksheet online and Google Sheets has free monthly and annual budget templates anyone with a Google account can use. Additionally, there are several apps people can download and use on their phones that help track spending including Quicken Simplifi, PocketGuard, or Goodbudget.\nHoward said he uses a “good, old-fashioned\" Excel spreadsheet.\n“The ease of using an app is a benefit for a lot of people so I don’t want to undersell that,” he said. “But for me personally, if I invest some time and effort into a spreadsheet, I don’t want that to go to waste. So, I end up using it.”\nCelebrate wins, no matter how small\nIn terms of savings goals, Howard determined through his research, that it is sometimes helpful to set optimistic budgets rather than realistic ones.\nHe imagined a scenario in which someone currently spends $1,000 a month at restaurants and sets a goal to spend only $200 the next month. Because that is a “really aggressive” behavior change, he said, most people won’t only spend $200, but they may spend $500 because they set an optimistic goal.\n“A lot of personal finance folks will look at that outcome and say well this is no good, this person overspent their budget,” Howard said. “That’s absolutely a wrong frame of mind to be in. I think that person is a success story because they’re spending $500 less than they used to.”\nIt’s important to celebrate wins while budgeting, and those will look different for each person.\nHoward imagines another scenario where someone has $10,000 in credit card debt with a 25% interest rate and a $1,000 loan from the bank with a 9% interest rate.\nHe said although rationally, that person should be paying down the credit card debt, a lot of people would feel more motivated if they first took the $1,000 loan off the books.\n“Financially, it’s not necessarily the optimal thing to do, but if it makes you happy and then subsequently more motivated to tackle the $10,000 debt with 25% interest. More power to you.”\nReach Rachel Barber at rbarber@usatoday.com and follow her on X @rachelbarber_"
    }
  ],
  "argos_summary": "Generation Z is increasingly becoming financially independent, with 72% taking steps to improve their financial health over the past year, according to a Bank of America survey. The reliance on parental financial support has decreased from 46% to 39%, and many are prioritizing savings and investments despite facing high living costs. However, financial stress remains prevalent, with 33% feeling stressed about their finances, leading to both proactive budgeting and impulsive spending behaviors.",
  "argos_id": "1RWMSGRSU"
}