{
  "url": "https://www.express.co.uk/news/politics/2092448/keir-starmer-nigel-farage-best-prime-minister",
  "authorsByline": "Katie Harris",
  "articleId": "ae14a469eadf4a56a3669a8406395260",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/139/1200x630/6346375.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-07T14:25:00+01:00",
  "addDate": "2025-08-07T13:43:33.305421+00:00",
  "refreshDate": "2025-08-07T13:43:33.305423+00:00",
  "score": 1.0,
  "title": "Keir Starmer in poll nightmare as lead over Nigel Farage cut in half",
  "description": "Keir Starmer's lead over Nigel Farage as 'best prime minister' halves in three months",
  "content": "Sir Keir Starmer's lead over Nigel Farage as \"best prime minister\" has halved in three months, new polling shows. The YouGov survey found that 35% of Britons say Sir Keir would be a better premier than the Reform UK leader. Meanwhile, 28% picked the Clacton MP over the current PM. It marks an eight-point drop in Sir Keir's lead since the question was last asked in May when it was 44% to 29%.\n\nMr Farage was backed by respondents over Tory leader Kemi Badenoch by 23% to 21% in their head-to-head. Meanwhile, Sir Keir was 10 points ahead of Mrs Badenoch 30% to 20% respectively. When given a choice between the Reform UK leader and Jeremy Corbyn, who is set to launch a new political party, Mr Farage had a narrow lead with 30% to 29%. Meanwhile, Sir Keir beat the veteran left-winger by 27% to 22%.\n\nMr Farage scored highest when respondents were asked who would make a good PM. The Brexiteer was backed by 24% of respondents, compared to 8% for Mrs Badenoch, 19% for Mr Corbyn and 11% for Deputy PM Angela Rayner. Just 9% said Sir Keir has been a good prime minister so far, with 55% saying he has been poor or terrible.\n\nWe use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. Read our Privacy Policy",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/latest/angela-rayner",
    "https://www.express.co.uk/latest/keir-starmer",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/latest/nigel-farage",
    "https://www.express.co.uk/news/politics/2092158/nigel-farage-asylum-hotel-crimes",
    "https://www.express.co.uk/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Sir Keir",
      "weight": 0.11893315
    },
    {
      "name": "Mr Farage",
      "weight": 0.101495996
    },
    {
      "name": "Keir Starmer",
      "weight": 0.10140351
    },
    {
      "name": "best prime minister",
      "weight": 0.09463801
    },
    {
      "name": "Keir",
      "weight": 0.09424667
    },
    {
      "name": "Nigel Farage",
      "weight": 0.09291993
    },
    {
      "name": "Tory leader Kemi Badenoch",
      "weight": 0.08917458
    },
    {
      "name": "Mr Corbyn",
      "weight": 0.0887704
    },
    {
      "name": "Farage",
      "weight": 0.08014033
    },
    {
      "name": "Sir Keir Starmers lead",
      "weight": 0.07999424
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.984375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.89599609375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.89111328125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.361572265625
    }
  ],
  "sentiment": {
    "positive": 0.12927246,
    "negative": 0.4494629,
    "neutral": 0.42138672
  },
  "summary": "Sir Keir Starmer's lead over Nigel Farage as \"best prime minister\" has halved in three months, according to a YouGov survey. The survey found that 35% of Britons believe Sir Keir would be a better premier than the Reform UK leader, while 28% chose the Clacton MP over the current Prime Minister. This is an eight-point drop from the previous poll in May, when it was 44% to 29%. Mr Farage was supported by respondents over Tory leader Kemi Badenoch by 23% to 21%. When asked about the future of Jeremy Corbyn, Mr Farage had a narrow lead with 30% and 27%. However, only 9% of respondents said that Sir Keer has been a good prime minister so far, with 55% saying he has been poor or terrible.",
  "shortSummary": "Sir Keir Starmer's lead over Nigel Farage as best prime minister halved to 35%, with 28% selecting him over current leader Jeremy Corbyn.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "86f28e827e174699b1764729138efa9a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "Keir Starmer's lead over Nigel Farage as 'best prime minister' halves in three months\nRoyal fans are preparing to hear the latest from the monarch.\nWeather maps show parts of the UK roasting in 33C in just a few days' time.\nThe author has responded to claims that Prince Harry has called in lawyers.\nGB News host Andrew Pierce was forced to calm a furious clash between Carole Malone...\nChancellor Rachel Reeves' department has replied after a surge of support for the plan\nSome shoppers say the product is so good that they have been using it for years.\nGardeners are being told to sprinkle chilli powder on their lawns this summer.\nBrianna Lafferty, 33, from the US, was left battling a crippling fear of death as she battled a rare and severe neurological disorder - but she says she now knows that death is an illusion\nVirgin Media is offering free TVs to those signing up for certain bundles but this...\nTwo cheap supermarket ingredients can work wonders in removing the deposit from your...\nThe comedy show ran on the BBC for 18 years but was axed by the broadcaster a decade ago\nDaily Express\nThe site was once inhabited by the Lakandon-Ch'ol, Maya rebels who fought against...\nThe Ballon d'Or nominees have been named.\nNicknamed \"Dark Eagle\", the Long-Range Hypersonic Weapon (LRHW) system has been sent...\nAfter years of serving up award-winning dishes, a popular independent restaurant chain...\nA new trailer for the highly anticipated Netflix film based on Richard Osman's bestselling novel has just been released.\nThe delays come after a lorry broke down.\nYou could earn more than £300 extra a year compared to the average rate with an ISA if...\nState pensioners will begin to lose benefits due to a hospital rule which kicks in...\nRetirees are being urged to check they aren't missing out on additional pension payments.\nEXCLUSIVE: Once a symbol of middle-class luxury, they are disappearing at an alarming...\nHome Secretary would not give details about how many migrants had been detained as...\nThe provider has already cut the Premium Bonds prize rate three times this year\nAt some venues, children can enjoy a free three-course meal and a drink when any adult orders a meal.\nWXCharts has forecast wet weather to hit the UK bringing with it heavy rain and low...\nEXCLUSIVE: Emma Jones, Managing Director of When The Bank Says No, reacts to news...\nThe bridge's supporting towers will stand taller than The Shard in London.\nThe Euro 2025 heroes are in contention to be honoured at football's most prestigious...\nEngineers will be working on the line for 14 days in September, meaning passengers...\nThe island has been a hotbed of anti-tourism protests over recent years.\nHollywood star Vinnie Jones has come out defending the British countryside, warning...\nAmanda Holden's lookalike daughter Lexi has shared a number of racy photos from a new modelling snaps.\nThe pro-war blogger claimed the medical system in the Russian army was completely broken.\nThere's a better way to cook sunny-side-up eggs than in a standard frying pan with oil.\nThe hot conditions will come days after parts of the UK experienced thunderstorms and...\nKatie Price has issued a furious statement as she addressed her rumoured rift with...\nEXCLUSIVE: The town is a must-visit for anyone who loves history.\nOasis fans in Edinburgh have a chance to buy tickets now if they know where to look...\nMoney expert Martin Lewis has announced a break from work this week.\nThe move has been deemed as violating constitutional values and putting coexistence at risk.\nTwo players missed out on a huge cash prize but said that they still had a 'fantastic...\nThe crime series first premiered in Australia three years ago\nThe case, now headed to an appeals court hearing in September, risks reigniting...\nThe UK's 'wonkiest pub' was destroyed in a suspected arson attack in August 2023 -...\nThere's a new deal from Sky Mobile that's offering the MacBook at 'lowest ever' price.\nJoanna Lumley is an British TV and film icon who will be joining the cast of Wednesday...\nThe first small boat arrivals have been detained after the new returns agreement with...\nEd Balls held a Labour Minister to account on Good Morning Britain as he left her stuttering with questions about child poverty\nFans of Good Morning Britain admitted that they were switching to a rival channel as...\nEXCLUSIVE: On the first day of Labour's new deal with France, the Express headed to...\nWhatsApp users need to be aware of the risks they could open themselves up to if they...\nThe beleaguered PM is facing a second debate on whether the nation should go back to...\nExpress Sport keeps you up to date with the latest F1 news.\nThe Ukrainian city has come under repeated attack by the Kremlin's army, since it was...\nThose not wanting an aerial or Sky dish stuck to their chimneys might want to check...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Recent polling by YouGov indicates that Sir Keir Starmer's lead over Nigel Farage as the preferred prime minister has decreased from 44% to 35% in three months. Farage is now favored by 28% of respondents, while Starmer maintains a lead over Kemi Badenoch. Additionally, when compared to Jeremy Corbyn, Farage holds a slight edge, but Starmer outperforms Corbyn in their matchup.",
  "argos_id": "37YXQMKVP"
}