{
  "url": "https://www.fastcompany.com/91380399/epa-plans-block-limits-vehicle-emissions-will-stop-shift-evs",
  "authorsByline": "The Conversation",
  "articleId": "5a01fc59b57844a4964ed185fa39486c",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/08/p-1-91380399-Impact-Conversation-EPA-removal-of-vehicle-emissions-limits-wont-stop-the-shift-to-electric-vehicles-but-will-make-it-harder-slower-and-more-expensive.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:44:00+00:00",
  "addDate": "2025-08-07T13:51:36.769035+00:00",
  "refreshDate": "2025-08-07T13:51:36.769039+00:00",
  "score": 1.0,
  "title": "The EPA plans to block limits on vehicle emissions. Will that stop the shift to EVs?",
  "description": "Enough momentum has been building so that the EPA’s move will not stop the transition to electric vehicles, but it will make that shift harder.",
  "content": "Over the past decade and a half, automakers have been building up their capability to produce electric vehicles to meet these fleet requirements, and a combination of regulations such as California’s zero-emission-vehicle requirements have worked together to ensure customers can get their hands on EVs. The zero-emission-vehicle rules require automakers to produce EVs for the California market, which in turn make it easier for the companies to meet their efficiency and emissions targets from the federal government. These collectively pressure automakers to provide a steady supply of electric vehicles to consumers. The new EPA move would undo the 2024 EPA vehicle-emissions rule and other federal regulations that also limit emissions from vehicles, such as the heavy-duty vehicle emissions rule. The possibility of a regulatory reversal puts automakers into a state of uncertainty. Legal challenges to the EPA’s shift are all but guaranteed, and the court process could take years.\n\nFor companies making decade-long investment decisions, regulatory stability matters more than short-term politics. Disrupting that stability undermines business planning, erodes investor confidence and sends conflicting signals to consumers and suppliers alike. Car manufacturers in the U.S. have invested large sums of money to produce electric vehicles. [Photo: Elijah Nouvelage/Getty Images] The Trump administration has taken other steps to make electric vehicles less attractive to carmakers and consumers. The White House has already suspended key provisions of the Inflation Reduction Act that provided tax credits for purchasing EVs and halted a US$5 billion investment in a nationwide network of charging stations. And Congress has retracted the federal waiver that allowed California to set its own, stricter emissions limits. In combination, these policies make it hard to buy and drive electric vehicles: Fewer, or no, financial incentives for consumers make the purchases more expensive, and fewer charging stations make travel planning more challenging.\n\nOverturning the EPA’s 2009 endangerment finding would remove the legal basis for regulating climate pollution from vehicles altogether. But U.S. consumer interest in electric vehicles has been growing, and automakers have already made massive investments to produce electric vehicles and their associated components in the U.S. – such as Hyundai’s EV factory in Georgia and Volkswagen’s Battery Engineering Lab in Tennessee. Global markets, especially in Europe and China, are also moving decisively toward electrifying large proportions of the vehicles on the road. This move is helped in no small part due to aggressive regulation by their respective governments. The results speak for themselves: Sales of EVs in both the European Union and China have been growing rapidly.\n\nBut the pace of change matters. A slower rollout of clean vehicles means more cumulative emissions, more climate damage and more harm to public health. The EPA’s proposal seeks to slow the shift to electric vehicles, removing incentives and raising costs – even though the market has shown that cleaner vehicles are viable, the public has shown interest, and the science has never been clearer. But even such a major policy change can’t stop the momentum of those trends. Alan Jenn is an associate professor of civil and environmental engineering, at the University of California, Davis.",
  "medium": "Article",
  "links": [
    "https://www.hmgma.com/",
    "https://scholar.google.com/citations?user=h-2TvzUAAAAJ&hl=en&oi=ao",
    "https://www.theregreview.org/2019/09/19/dequarto-automakers-prefer-self-regulation-regulatory-uncertainty/",
    "https://climate.ec.europa.eu/eu-action/european-climate-law_en",
    "https://www.fastcompany.com/newsletters",
    "https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars",
    "http://doi.org/10.1088/2752-5295/ac6e7d",
    "https://theconversation.com/revoking-epas-endangerment-finding-the-keystone-of-us-climate-policies-isnt-simple-and-could-have-unintended-consequences-252271",
    "https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-american-energy/",
    "https://doi.org/10.1073/pnas.2219396120",
    "https://theconversation.com/epa-removal-of-vehicle-emissions-limits-wont-stop-the-shift-to-electric-vehicles-but-will-make-it-harder-slower-and-more-expensive-262384",
    "https://highways.dot.gov/newsroom/trumps-transportation-secretary-sean-p-duffy-calls-out-states-trying-block-lawful-review",
    "https://www.mdpi.com/2071-1050/15/10/7932",
    "https://www.iea.org/reports/global-ev-outlook-2025/trends-in-electric-car-markets-2",
    "https://www.jstor.org/stable/20053815",
    "https://www.fastcompany.com/90610475/study-eco-friendly-car-owners-are-undermining-environmental-gains-by-buying-second-vehicles",
    "https://theconversation.com",
    "https://theconversation.com/profiles/alan-jenn-1329525",
    "https://www.sierraclub.org/sierra/epa-endangerment-finding-trump-zeldin-tries-to-torpedo-greenhouse-gases",
    "https://library.edf.org/AssetLink/07l26xtk0xv2bw713c64na3g5g1kmbb7.pdf",
    "https://www.fastcompany.com/91376596/epa-endangerment-finding-climate-change-regulation-trump",
    "https://www.npr.org/2025/05/22/nx-s1-5387729/senate-california-ev-air-pollution-waiver-revoked",
    "https://ww2.arb.ca.gov/our-work/programs/advanced-clean-cars-program/advanced-clean-cars-ii",
    "https://www.ucs.org/resources/brief-history-us-fuel-efficiency",
    "https://www.epa.gov/ghgemissions/sources-greenhouse-gas-emissions",
    "https://www.mansueto.com/privacy-policy/",
    "https://www.epa.gov/newsreleases/epa-releases-proposal-rescind-obama-era-endangerment-finding-regulations-paved-way",
    "https://doi.org/10.1016/j.trd.2020.102553",
    "https://media.vw.com/releases/1687",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://www.govinfo.gov/content/pkg/FR-2024-04-22/pdf/2024-06809.pdf",
    "https://www.govinfo.gov/content/pkg/FR-2024-04-18/pdf/2024-06214.pdf",
    "https://theconversation.com/institutions/university-of-california-davis-1312",
    "https://www.fastcompany.com/91353110/trump-is-trying-to-kill-californias-ev-standards-it-will-affect-cars-across-the-country",
    "https://www.taylorfrancis.com/chapters/edit/10.4324/9781315197296-6/cafe-worked-david-greene",
    "https://chineseclimatepolicy.oxfordenergy.org/book-content/domestic-policies/vehicles/electric-vehicles/",
    "https://doi.org/10.1126/science.268.5213.991",
    "https://doi.org/10.1080/01441647.2016.1230794",
    "https://www.fastcompany.com/section/evs",
    "https://www.washingtonpost.com/climate-environment/2025/07/29/epa-endangerment-finding-clean-air-act/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "electric vehicles",
      "weight": 0.118428186
    },
    {
      "name": "vehicle emissions",
      "weight": 0.115032256
    },
    {
      "name": "clean vehicles",
      "weight": 0.10299173
    },
    {
      "name": "cleaner vehicles",
      "weight": 0.10299173
    },
    {
      "name": "vehicles",
      "weight": 0.10159212
    },
    {
      "name": "more cumulative emissions",
      "weight": 0.073490456
    },
    {
      "name": "emissions",
      "weight": 0.067568585
    },
    {
      "name": "other federal regulations",
      "weight": 0.066707104
    },
    {
      "name": "U.S. consumer interest",
      "weight": 0.066560306
    },
    {
      "name": "automakers",
      "weight": 0.060886513
    }
  ],
  "topics": [
    {
      "name": "ESG"
    },
    {
      "name": "Climate Change"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.8076171875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.73779296875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.62841796875
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.3759765625
    }
  ],
  "sentiment": {
    "positive": 0.041137695,
    "negative": 0.74658203,
    "neutral": 0.21252441
  },
  "summary": "The US Environmental Protection Agency (EPA) plans to block limits on vehicle emissions, potentially causing uncertainty over the production of electric vehicles (EVs) for consumers and manufacturers. The move would undo the 2024 EPA vehicle-emissions rule and other federal regulations that limit emissions from vehicles. This could result in legal challenges and a lengthy court process that could take years. The Trump administration has already taken steps to make electric vehicles less attractive to carmakers and consumers, including suspending key provisions of the Inflation Reduction Act and withdrawing a $5 billion investment in a nationwide network of charging stations. Despite this uncertainty, consumer interest in electric vehicles has been growing, and automakers have made significant investments to produce electric vehicles and components in the US. However, the proposal aims to slow the shift to electric vehicles, removing incentives and raising costs, despite the market showing that cleaner vehicles are viable and public interest in them.",
  "shortSummary": "The EPA plans to block vehicle emissions, potentially slowing the shift to electric vehicles, amid regulatory uncertainty and market growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "020fc31ae6d440a3b96543ae53d6481f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://theconversation.com/institutions/university-of-california-davis-1312",
      "text": "UC Davis is one of the world’s leading cross-disciplinary research and teaching institutions, located in Davis, California. The most academically comprehensive university on the West Coast, it is renowned for its programs in food and agriculture, the environmental sciences and sustainability, and veterinary medicine. Among its many accomplishments, it has helped develop the wine industry, pioneered new medical treatments and altered the art world. Part of the University of California system, UC Davis has 100+ majors, 10 colleges and professional schools, a health system, and research stations throughout California and beyond.\nThe American public agrees that vehicle emissions are harmful and should be regulated, and has indicated strong preferences for cars that pollute less.\nAfter his predecessors failed to diminish the US population of undocumented immigrants, President Trump is attempting to drastically reduce that population via unprecedented tactics.\nNeither President Donald Trump nor Florida Gov. Ron DeSantis can legally create a new system of immigration judges outside of the one established by Congress.\nThe Trump administration claims that judges’ orders in the cases of immigrants deported to a prison in El Salvador intrude on the president’s right to conduct foreign policy.\nOs animais podem aprender uns com os outros, mantendo suas culturas por longos períodos de tempo. O que diferencia as pessoas pode ser a maneira singularmente aberta com que inventamos novas ideias e as compartilhamos e desenvolvemos.\nAnimals can learn from each other, maintaining their cultures for long periods of time. What sets people apart may be the uniquely open-ended ways we invent new ideas and share and build on them.\nPresident Trump’s national energy emergency declaration does not qualify as an emergency that would exempt energy projects from environmental laws and regulations.\nLawful permanent residents hold many of the same rights that US citizens have, but the government can deport them on certain, often vague, security grounds.\nRitual bathing at the confluence of large rivers has long held special significance in Hindu rituals. Sangam, where the Ganga and Yamuna are believed to meet the fabled Saraswati, is the most revered.\nBreaching is one of the most spectacular behaviors among marine animals. A recent review shows that many shark and ray species breach, and identifies the most commonly hypothesized reasons.\nMientras que la temporada de incendios de este 2024 ha sido benévola en España, al otro lado del Atlántico el humo ha cubierto una extensa superficie en América del sur en agosto y principios de septiembre.\nListening in on neural activity is a promising way of restoring the ability to communicate for people whose bodies no longer can. Artificial neural networks are the key middleman in the process.\nKamala, a Sanskrit word for lotus, symbolizes wisdom. Its rooted in the fact that even though the flower blooms in a swamp, it remains untouched by the dirt around it."
    },
    {
      "url": "https://www.epa.gov/ghgemissions/sources-greenhouse-gas-emissions",
      "text": "Sources of Greenhouse Gas Emissions\nOn this page:\nSources of Greenhouse Gas Emissions: Overview\nGreenhouse gases trap heat and make the planet warmer. Human activities are responsible for almost all of the increase in greenhouse gases in the atmosphere over the last 150 years.1 The largest source of greenhouse gas emissions from human activities in the United States is from burning fossil fuels for electricity, heat, and transportation.\nEPA tracks total U.S. emissions by publishing the Inventory of U.S. Greenhouse Gas Emissions and Sinks. This annual report estimates the total national greenhouse gas emissions and removals associated with human activities across the United States by source, gas, and economic sector.\nTotal emissions in 2022 are 6,343.2 Million Metric Tons of CO₂ equivalent. Percentages may not add up to 100% due to independent rounding. Greenhouse gas emissions from the commercial, residential, and industrial sectors increase substantially when indirect emissions from electricity end-use are included, due to the relatively large share of electricity use by buildings (e.g., heating, ventilation, and air conditioning; lighting; appliances and plug load) and use of electricity for powering industrial machinery. More information is also in the electricity end-use emissions section of the Electric Power sector page.\nLand Use, Land-Use Change, and Forestry in the United States is a net sink and offsets 13% of these greenhouse gas emissions. This net sink is not shown in the above diagrams. All emission estimates are sourced from the Inventory of U.S. Greenhouse Gas Emissions and Sinks: 1990–2022.\nWhat are the primary sources of U.S. greenhouse gas emissions and sinks in each economic sector?\n- Transportation – Greenhouse gas emissions from transportation primarily come from burning fossil fuel for cars, trucks, ships, trains, and planes. Over 94% of the fuel used for transportation is petroleum based, which includes primarily gasoline and diesel and results in direct emissions.2 The transportation sector is the largest source of direct greenhouse gas emissions and second largest source when indirect emissions from electricity end-use are allocated across sectors. The transportation sector is an end-use sector for electricity but currently represents a relatively low percentage of total electricity use. Indirect emissions from electricity are less than 1 percent of direct emissions.\n- Electricity production – Electric power includes emissions from electricity production used by other end use sectors (e.g., industry). In 2022, 60% of our electricity comes from burning fossil fuels, mostly coal and natural gas.3\n- Industry – Greenhouse gas emissions from industry primarily come from burning fossil fuels for energy, as well as greenhouse gas emissions from certain chemical reactions necessary to produce goods from raw materials. Industrial emissions are the third largest source of direct emissions. If indirect emissions from electricity use are allocated to the industrial end-use sector (e.g. to power industrial buildings and equipment), industrial activities account for a much larger share of U.S. greenhouse gas emissions as shown above.\n- Commercial and Residential – Greenhouse gas emissions from the commercial and residential sector come from fossil fuels burned for heat and the use of gases for refrigeration and cooling in buildings, and non-building specific emissions such as the handling of waste. The commercial and residential sector emissions increase substantially when indirect emissions from electricity end-use are included, largely because buildings use 75% of the electricity generated in the US (e.g., for heating, ventilation and air conditioning; lighting; appliances, and plug loads).4 When emissions from electricity use are distributed to the commercial and residential end-use sector, commercial and residential activities account for a much larger share of U.S. greenhouse gas emissions as shown above.\n- Agriculture – Greenhouse gas emissions from agriculture come from livestock such as cows, agricultural soils, and rice production. Indirect emissions from electricity use in agricultural activities (e.g., powering buildings and equipment) are about 5 percent of direct emissions.\n- Land Use and Forestry – While not shown in the figure, land areas can act as a sink (absorbing CO2 from the atmosphere) or a source of greenhouse gas emissions. In the United States, since 1990, managed forests and other lands are a net sink, i.e., they have absorbed more CO2 from the atmosphere than they emit, offsetting 13% of total gross greenhouse gas emissions.\nSee Emissions Information and Reduction Strategies by Source\nElectric Power Transportation Industry Commercial/Residential\nGreenhouse Gas Emissions Trends: All Sources\n- Since 1990, gross U.S. greenhouse gas emissions have decreased by just over 3%. From year to year, emissions can rise and fall due to changes in the economy, the price of fuel, and other factors.\n- In 2022, U.S. greenhouse gas emissions increased 0.2% compared to 2021 levels. In 2020, there was a sharp decline in emissions largely due to the impacts of the coronavirus (COVID-19) pandemic on travel and other economic activity. In 2021 and 2022, the increase in total greenhouse gas emissions was driven largely by an increase in CO2 emissions from fossil fuel combustion due to the continued rebound in economic activity after the height of the COVID-19 pandemic.\n- In 2022, CO2 emissions from fossil fuel combustion increased by 8% relative to 2020 and 1% relative to 2021. CO2 emissions from natural gas consumption increased by 5% relative to 2021. CO2 emissions from coal consumption decreased by 6% from 2021. The increase in natural gas consumption and emissions in 2022 is observed across all sectors except for U.S. Territories, while the coal decrease in primarily in the electric power sector. Emissions from petroleum use increased by less than 1% in 2022.\nReferences\n- IPCC (2013) Climate Change 2013: The Physical Science Basis. Contribution of Working Group I to the Fifth Assessment Report of the Intergovernmental Panel on Climate Change. [Stocker, T.F., D. Qin, G.K. Plattner, M. Tignor, S.K. Allen, J. Boschung, A. Nauels, Y. Xia, V. Bex and P.M. Midgley (eds.)]. Cambridge University Press, Cambridge, United Kingdom and New York, NY, USA, 1535 pp. .\n- IPCC (2022): Climate Change 2022: Mitigation of Climate Change. Contribution of Working Group III to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change [P.R. Shukla, J. Skea, R. Slade, A. Al Khourdajie, R. van Diemen, D. McCollum, M. Pathak, S. Some, P. Vyas, R. Fradera, M. Belkacemi, A. Hasija, G. Lisboa, S. Luz, J. Malley, (eds.)]. Cambridge University Press, Cambridge, UK and New York, NY, USA. doi: 10.1017/9781009157926\n- U.S. Energy Information Administration (2023). Electricity Explained – Basics\n- National Renewable Energy Laboratory (2023). NREL Researchers Reveal How Buildings Across United States Do—and Could—Use Energy. Shoemaker, Susannah."
    },
    {
      "url": "https://scholar.google.com/citations?user=h-2TvzUAAAAJ&hl=en&oi=ao",
      "text": "| A subpopulation of macrophages infiltrates hypertrophic adipose tissue and is activated by free fatty acids via Toll-like receptors 2 and 4 and JNK-dependent pathways MTA Nguyen, S Favelyukis, AK Nguyen, D Reichart, PA Scott, A Jenn, ... Journal of biological chemistry 282 (48), 35279-35292, 2007 | 1297 | 2007 |\n| A review of consumer preferences of and interactions with electric vehicle charging infrastructure S Hardman, A Jenn, G Tal, J Axsen, G Beard, N Daina, E Figenbaum, ... Transportation Research Part D: Transport and Environment 62, 508-523, 2018 | 888 | 2018 |\n| Effectiveness of electric vehicle incentives in the United States A Jenn, K Springel, AR Gopal Energy policy 119, 349-356, 2018 | 447 | 2018 |\n| The rise of electric vehicles—2020 status and future expectations M Muratori, M Alexander, D Arent, M Bazilian, P Cazzola, EM Dede, ... Progress in Energy 3 (2), 022002, 2021 | 422 | 2021 |\n| The impact of federal incentives on the adoption of hybrid electric vehicles in the United States A Jenn, IL Azevedo, P Ferreira Energy Economics 40, 936-942, 2013 | 222 | 2013 |\n| An in-depth examination of electric vehicle incentives: Consumer heterogeneity and changing response over time A Jenn, JH Lee, S Hardman, G Tal Transportation Research Part A: Policy and Practice 132, 97-109, 2020 | 153 | 2020 |\n| Emissions benefits of electric vehicles in Uber and Lyft ride-hailing services A Jenn Nature Energy 5 (7), 520-525, 2020 | 141 | 2020 |\n| Heterogeneity in the response to gasoline prices: Evidence from Pennsylvania and implications for the rebound effect K Gillingham, A Jenn, IML Azevedo Energy Economics 52, S41-S52, 2015 | 109 | 2015 |\n| Alternative fuel vehicle adoption increases fleet gasoline consumption and greenhouse gas emissions under United States corporate average fuel economy policy and greenhouse gas … A Jenn, IML Azevedo, JJ Michalek Environmental science & technology 50 (5), 2165-2174, 2016 | 88 | 2016 |\n| Distribution grid impacts of electric vehicles: A California case study A Jenn, J Highleyman IScience 25 (1), 2022 | 87 | 2022 |\n| Hourly accounting of carbon emissions from electricity consumption GJ Miller, K Novan, A Jenn Environmental Research Letters 17 (4), 044073, 2022 | 78 | 2022 |\n| Alternative-fuel-vehicle policy interactions increase US greenhouse gas emissions A Jenn, IL Azevedo, JJ Michalek Transportation Research Part A: Policy and Practice 124, 396-407, 2019 | 69 | 2019 |\n| How will we fund our roads? A case of decreasing revenue from electric vehicles A Jenn, IL Azevedo, P Fischbeck Transportation research part A: policy and practice 74, 136-147, 2015 | 61 | 2015 |\n| Health and climate impacts from long-haul truck electrification F Tong, A Jenn, D Wolfson, CD Scown, M Auffhammer Environmental science & technology 55 (13), 8514-8523, 2021 | 53 | 2021 |\n| An integrated optimization platform for spatial-temporal modeling of electric vehicle charging infrastructure X Li, A Jenn Transportation Research Part D: Transport and Environment 104, 103177, 2022 | 52 | 2022 |\n| New mobility service users' perceptions on electric vehicle adoption A Jenn, K Laberteaux, R Clewlow International Journal of Sustainable Transportation 12 (7), 526-540, 2018 | 52 | 2018 |\n| Energy consumption and charging load profiles from long-haul truck electrification in the United States F Tong, D Wolfson, A Jenn, CD Scown, M Auffhammer Environmental Research: Infrastructure and Sustainability 1 (2), 025007, 2021 | 48 | 2021 |\n| Evaluating the emission benefits of shared autonomous electric vehicle fleets: A case study in California Y Li, X Li, A Jenn Applied Energy 323, 119638, 2022 | 44 | 2022 |\n| Impact of electric vehicle charging demand on power distribution grid congestion Y Li, A Jenn Proceedings of the National Academy of Sciences 121 (18), e2317599121, 2024 | 43 | 2024 |\n| Private versus shared, automated electric vehicles for US personal mobility: Energy use, greenhouse gas emissions, grid integration, and cost impacts CJR Sheppard, AT Jenn, JB Greenblatt, GS Bauer, BF Gerke Environmental science & technology 55 (5), 3229-3239, 2021 | 43 | 2021 |"
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/01/unleashing-american-energy/",
      "text": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\nSection 1. Background. America is blessed with an abundance of energy and natural resources that have historically powered our Nation’s economic prosperity. In recent years, burdensome and ideologically motivated regulations have impeded the development of these resources, limited the generation of reliable and affordable electricity, reduced job creation, and inflicted high energy costs upon our citizens. These high energy costs devastate American consumers by driving up the cost of transportation, heating, utilities, farming, and manufacturing, while weakening our national security.\nIt is thus in the national interest to unleash America’s affordable and reliable energy and natural resources. This will restore American prosperity —- including for those men and women who have been forgotten by our economy in recent years. It will also rebuild our Nation’s economic and military security, which will deliver peace through strength.\nSec. 2. Policy. It is the policy of the United States:\n(a) to encourage energy exploration and production on Federal lands and waters, including on the Outer Continental Shelf, in order to meet the needs of our citizens and solidify the United States as a global energy leader long into the future;\n(b) to establish our position as the leading producer and processor of non-fuel minerals, including rare earth minerals, which will create jobs and prosperity at home, strengthen supply chains for the United States and its allies, and reduce the global influence of malign and adversarial states;\n(c) to protect the United States’s economic and national security and military preparedness by ensuring that an abundant supply of reliable energy is readily accessible in every State and territory of the Nation;\n(d) to ensure that all regulatory requirements related to energy are grounded in clearly applicable law;\n(e) to eliminate the “electric vehicle (EV) mandate” and promote true consumer choice, which is essential for economic growth and innovation, by removing regulatory barriers to motor vehicle access; by ensuring a level regulatory playing field for consumer choice in vehicles; by terminating, where appropriate, state emissions waivers that function to limit sales of gasoline-powered automobiles; and by considering the elimination of unfair subsidies and other ill-conceived government-imposed market distortions that favor EVs over other technologies and effectively mandate their purchase by individuals, private businesses, and government entities alike by rendering other types of vehicles unaffordable;\n(f) to safeguard the American people’s freedom to choose from a variety of goods and appliances, including but not limited to lightbulbs, dishwashers, washing machines, gas stoves, water heaters, toilets, and shower heads, and to promote market competition and innovation within the manufacturing and appliance industries;\n(g) to ensure that the global effects of a rule, regulation, or action shall, whenever evaluated, be reported separately from its domestic costs and benefits, in order to promote sound regulatory decision making and prioritize the interests of the American people;\n(h) to guarantee that all executive departments and agencies (agencies) provide opportunity for public comment and rigorous, peer-reviewed scientific analysis; and\n(i) to ensure that no Federal funding be employed in a manner contrary to the principles outlined in this section, unless required by law.\nSec. 3. Immediate Review of All Agency Actions that Potentially Burden the Development of Domestic Energy Resources. (a) The heads of all agencies shall review all existing regulations, orders, guidance documents, policies, settlements, consent orders, and any other agency actions (collectively, agency actions) to identify those agency actions that impose an undue burden on the identification, development, or use of domestic energy resources — with particular attention to oil, natural gas, coal, hydropower, biofuels, critical mineral, and nuclear energy resources — or that are otherwise inconsistent with the policy set forth in section 2 of this order, including restrictions on consumer choice of vehicles and appliances.\n(b) Within 30 days of the date of this order, the head of each agency shall, in consultation with the director of the Office of Management and Budget (OMB) and the National Economic Council (NEC), develop and begin implementing action plans to suspend, revise, or rescind all agency actions identified as unduly burdensome under subsection (a) of this section, as expeditiously as possible and consistent with applicable law. The head of any agency who determines that such agency does not have agency actions described in subsection (a) of this section shall submit to the Director of OMB a written statement to that effect and, absent a determination by the Director of OMB that such agency does have agency actions described in this subsection, shall have no further responsibilities under this section.\n(c) Agencies shall promptly notify the Attorney General of any steps taken pursuant to subsection (a) of this section so that the Attorney General may, as appropriate:\n(i) provide notice of this Executive Order and any such actions to any court with jurisdiction over pending litigation in which such actions may be relevant; and\n(ii) request that such court stay or otherwise delay further litigation, or seek other appropriate relief consistent with this order, pending the completion of the administrative actions described in this order.\n(d) Pursuant to the policy outlined in section 2 of this order, the Attorney General shall consider whether pending litigation against illegal, dangerous, or harmful policies should be resolved through stays or other relief.\nSec. 4. Revocation of and Revisions to Certain Presidential and Regulatory Actions. (a) The following are revoked and any offices established therein are abolished:\n(i) Executive Order 13990 of January 20, 2021 (Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis);\n(ii) Executive Order 13992 of January 20, 2021 (Revocation of Certain Executive Orders Concerning Federal Regulation);\n(iii) Executive Order 14008 of January 27, 2021 (Tackling the Climate Crisis at Home and Abroad);\n(iv) Executive Order 14007 of January 27, 2021 (President’s Council of Advisors on Science and Technology);\n(v) Executive Order 14013 of February 4, 2021 (Rebuilding and Enhancing Programs to Resettle Refugees and Planning for the Impact of Climate Change on Migration);\n(vi) Executive Order 14027 of May 7, 2021 (Establishment of the Climate Change Support Office);\n(vii) Executive Order 14030 of May 20, 2021 (Climate-Related Financial Risk);\n(viii) Executive Order 14037 of August 5, 2021 (Strengthening American Leadership in Clean Cars and Trucks);\n(ix) Executive Order 14057 of December 8, 2021 (Catalyzing Clean Energy Industries and Jobs Through Federal Sustainability);\n(x) Executive Order 14072 of April 22, 2022 (Strengthening the Nation’s Forests, Communities, and Local Economies);\n(xi) Executive Order 14082 of September 12, 2022 (Implementation of the Energy and Infrastructure Provisions of the Inflation Reduction Act of 2022); and\n(xii) Executive Order 14096 of April 21, 2023 (Revitalizing Our Nation’s Commitment to Environmental Justice for All).\n(b) All activities, programs, and operations associated with the American Climate Corps, including actions taken by any agency shall be terminated immediately. Within one day of the date of this order, the Secretary of the Interior shall submit a letter to all parties to the “American Climate Corps Memorandum of Understanding” dated December 2023 to terminate the memorandum, and the head of each party to the memorandum shall agree to the termination in writing.\n(c) Any assets, funds, or resources allocated to an entity or program abolished by subsection (a) of this section shall be redirected or disposed of in accordance with applicable law.\n(d) The head of any agency that has taken action respecting offices and programs in subsection (a) shall take all necessary steps to ensure that all such actions are terminated or, if necessary, appropriate, or required by law, that such activities are transitioned to other agencies or entities.\n(e) Any contract or agreement between the United States and any third party on behalf of the entities or programs abolished in subsection (a) of this section, or in furtherance of them, shall be terminated for convenience, or otherwise, as quickly as permissible under the law.\nSec. 5. Unleashing Energy Dominance through Efficient Permitting. (a) Executive Order 11991 of May 24, 1977 (Relating to protection and enhancement of environmental quality) is hereby revoked.\n(b) To expedite and simplify the permitting process, within 30 days of the date of this order, the Chairman of the Council on Environmental Quality (CEQ) shall provide guidance on implementing the National Environmental Policy Act (NEPA), 42 U.S.C. 4321 et seq., and propose rescinding CEQ’s NEPA regulations found at 40 CFR 1500 et seq.\n(c) Following the provision of the guidance, the Chairman of CEQ shall convene a working group to coordinate the revision of agency-level implementing regulations for consistency. The guidance in subsection (b) and any resulting implementing regulations must expedite permitting approvals and meet deadlines established in the Fiscal Responsibility Act of 2023 (Public Law 118-5). Consistent with applicable law, all agencies must prioritize efficiency and certainty over any other objectives, including those of activist groups, that do not align with the policy goals set forth in section 2 of this order or that could otherwise add delays and ambiguity to the permitting process.\n(d) The Secretaries of Defense, Interior, Agriculture, Commerce, Housing and Urban Development, Transportation, Energy, Homeland Security, the Administrator of the Environmental Protection Agency (EPA), the Chairman of CEQ, and the heads of any other relevant agencies shall undertake all available efforts to eliminate all delays within their respective permitting processes, including through, but not limited to, the use of general permitting and permit by rule. For any project an agency head deems essential for the Nation’s economy or national security, agencies shall use all possible authorities, including emergency authorities, to expedite the adjudication of Federal permits. Agencies shall work closely with project sponsors to realize the ultimate construction or development of permitted projects.\n(e) The Director of the NEC and the Director of the Office of Legislative Affairs shall jointly prepare recommendations to Congress, which shall:\n(i) facilitate the permitting and construction of interstate energy transportation and other critical energy infrastructure, including, but not limited to, pipelines, particularly in regions of the Nation that have lacked such development in recent years; and\n(ii) provide greater certainty in the Federal permitting process, including, but not limited to, streamlining the judicial review of the application of NEPA.\nSec. 6. Prioritizing Accuracy in Environmental Analyses. (a) In all Federal permitting adjudications or regulatory processes, all agencies shall adhere to only the relevant legislated requirements for environmental considerations and any considerations beyond these requirements are eliminated. In fulfilling all such requirements, agencies shall strictly use the most robust methodologies of assessment at their disposal and shall not use methodologies that are arbitrary or ideologically motivated.\n(b) The Interagency Working Group on the Social Cost of Greenhouse Gases (IWG), which was established pursuant to Executive Order 13990, is hereby disbanded, and any guidance, instruction, recommendation, or document issued by the IWG is withdrawn as no longer representative of governmental policy including:\n(i) the Presidential Memorandum of January 27, 2021 (Restoring Trust in Government Through Scientific Integrity and Evidence-Based Policymaking);\n(ii) the Report of the Greenhouse Gas Monitoring and Measurement Interagency Working Group of November 2023 (National Strategy to Advance an Integrated U.S. Greenhouse Gas Measurement, Monitoring, and Information System);\n(iii) the Technical Support Document of February 2021 (Social Cost of Carbon, Methane, and Nitrous Oxide Interim Estimates under Executive Order 13990); and\n(iv) estimates of the social cost of greenhouse gases, including the estimates for the social cost of carbon, the social cost of methane, or the social cost of nitrous oxide based, in whole or in part, on the IWG’s work or guidance.\n(c) The calculation of the “social cost of carbon” is marked by logical deficiencies, a poor basis in empirical science, politicization, and the absence of a foundation in legislation. Its abuse arbitrarily slows regulatory decisions and, by rendering the United States economy internationally uncompetitive, encourages a greater human impact on the environment by affording less efficient foreign energy producers a greater share of the global energy and natural resource market. Consequently, within 60 days of the date of this order, the Administrator of the EPA shall issue guidance to address these harmful and detrimental inadequacies, including consideration of eliminating the “social cost of carbon” calculation from any Federal permitting or regulatory decision.\n(d) Prior to the guidance issued pursuant to subsection (c) of this section, agencies shall ensure estimates to assess the value of changes in greenhouse gas emissions resulting from agency actions, including with respect to the consideration of domestic versus international effects and evaluating appropriate discount rates, are, to the extent permitted by law, consistent with the guidance contained in OMB Circular A-4 of September 17, 2003 (Regulatory Analysis).\n(e) Furthermore, the head of each agency shall, as appropriate and consistent with applicable law, initiate a process to make such changes to any rule, regulation, policy or action as may be necessary to ensure consistency with the Regulatory Analysis.\n(f) Within 30 days of the date of this order, the Administrator of the EPA, in collaboration with the heads of any other relevant agencies, shall submit joint recommendations to the Director of OMB on the legality and continuing applicability of the Administrator’s findings, “Endangerment and Cause or Contribute Findings for Greenhouse Gases Under Section 202(a) of the Clean Air Act,” Final Rule, 74 FR 66496 (December 15, 2009).\nSec. 7. Terminating the Green New Deal. (a) All agencies shall immediately pause the disbursement of funds appropriated through the Inflation Reduction Act of 2022 (Public Law 117-169) or the Infrastructure Investment and Jobs Act (Public Law 117-58), including but not limited to funds for electric vehicle charging stations made available through the National Electric Vehicle Infrastructure Formula Program and the Charging and Fueling Infrastructure Discretionary Grant Program, and shall review their processes, policies, and programs for issuing grants, loans, contracts, or any other financial disbursements of such appropriated funds for consistency with the law and the policy outlined in section 2 of this order. Within 90 days of the date of this order, all agency heads shall submit a report to the Director of the NEC and Director of OMB that details the findings of this review, including recommendations to enhance their alignment with the policy set forth in section 2. No funds identified in this subsection (a) shall be disbursed by a given agency until the Director of OMB and Assistant to the President for Economic Policy have determined that such disbursements are consistent with any review recommendations they have chosen to adopt.\n(b) When procuring goods and services, making decisions about leases, and making other arrangements that result in disbursements of Federal funds, agencies shall prioritize cost-effectiveness, American workers and businesses, and the sensible use of taxpayer money, to the greatest extent. The Director of OMB shall finalize and circulate guidelines to further implement this subsection.\n(c) All agencies shall assess whether enforcement discretion of authorities and regulations can be utilized to advance the policy outlined in section 2 of this order. Within 30 days of the date of this order, each agency shall submit a report to the Director of OMB identifying any such instances.\nSec. 8. Protecting America’s National Security.(a) The Secretary of Energy is directed restart reviews of applications for approvals of liquified natural gas export projects as expeditiously as possible, consistent with applicable law. In assessing the “Public Interest” to be advanced by any particular application, the Secretary of Energy shall consider the economic and employment impacts to the United States and the impact to the security of allies and partners that would result from granting the application.\n(b) With respect to any proposed deepwater port for the export of liquefied natural gas (project) for which a favorable record of decision (ROD) has previously been issued pursuant to the Deepwater Port Act of 1974 (DWPA), 33 U.S.C. 1501 et seq., the Administrator of the Maritime Administration (MARAD) shall, within 30 days of the date of this order and consistent with applicable law, determine whether any refinements to the project proposed subsequent to the ROD are likely to result in adverse environmental consequences that substantially differ from those associated with the originally-evaluated project so as to present a seriously different picture of the foreseeable adverse environmental consequences (seriously different consequences). In making this determination, MARAD shall qualitatively assess any difference in adverse environmental consequences between the project with and without the proposed refinements, including any potential consequences not addressed in the final Environmental Impact Statement (EIS), which shall be considered adequate under NEPA notwithstanding any revisions to NEPA that may have been enacted following the final EIS. MARAD shall submit this determination, together with a detailed justification, to the Secretary of Transportation and to the President.\n(c) Pursuant to subsection (b) of this section, if MARAD determines that such refinements are not likely to result in seriously different consequences, it shall include in that determination a description of the refinements to supplement and update the ROD, if necessary and then no later than 30 additional days, he shall issue a DWPA license.\n(d) If MARAD determines, with concurrence from the Secretary of Transportation, that such proposed refinements are likely to result in seriously different consequences, it shall, within 60 days after submitting such determination, issue an Environmental Assessment (EA) examining such consequences and, with respect to all other environmental consequences not changed due to project refinements, shall reaffirm the conclusions of the final EIS. Within 30 days after issuing the EA, MARAD shall issue an addendum to the ROD, if necessary, and shall, within 30 additional days, issue a DWPA license consistent with the ROD.\nSec. 9. Restoring America’s Mineral Dominance. (a) The Secretary of the Interior, Secretary of Agriculture, Administrator of the EPA, Chairman of CEQ, and the heads of any other relevant agencies, as appropriate, shall identify all agency actions that impose undue burdens on the domestic mining and processing of non-fuel minerals and undertake steps to revise or rescind such actions.\n(b) The Secretaries of the Interior and Agriculture shall reassess any public lands withdrawals for potential revision.\n(c) The Secretary of the Interior shall instruct the Director of the U.S. Geological Survey to consider updating the Survey’s list of critical minerals, including for the potential of including uranium.\n(d) The Secretary of the Interior shall prioritize efforts to accelerate the ongoing, detailed geologic mapping of the United States, with a focus on locating previously unknown deposits of critical minerals.\n(e) The Secretary of Energy shall ensure that critical mineral projects, including the processing of critical minerals, receive consideration for Federal support, contingent on the availability of appropriated funds.\n(f) The United States Trade Representative shall assess whether exploitative practices and state-assisted mineral projects abroad are unlawful or unduly burden or restrict United States commerce.\n(g) The Secretary of Commerce shall assess the national security implications of the Nation’s mineral reliance and the potential for trade action.\n(h) The Secretary of Homeland Security shall assess the quantity and inflow of minerals that are likely the product of forced labor into the United States and whether such inflows pose a threat to national security and, within 90 days of the date of this order, shall provide this assessment to the Director of the NEC.\n(i) The Secretary of Defense shall consider the needs of the United States in supplying and maintaining the National Defense Stockpile, review the legal authorities and obligations in managing the National Defense Stockpile, and take all appropriate steps to ensure that the National Defense Stockpile will provide a robust supply of critical minerals in event of future shortfall.\n(j) Within 60 days of the date of this order, the Secretary of State, Secretary of Commerce, Secretary of Labor, the United States Trade Representative, and the heads of any other relevant agencies, shall submit a report to the Assistant to the President for Economic Policy that includes policy recommendations to enhance the competitiveness of American mining and refining companies in other mineral-wealthy nations.\n(k) The Secretary of State shall consider opportunities to advance the mining and processing of minerals within the United States through the Quadrilateral Security Dialogue.\nSec. 10. General Provisions. (a) Nothing in this order shall be construed to impair or otherwise affect:\n(i) the authority granted by law to an executive department or agency, or the head thereof; or\n(ii) the functions of the Director of OMB relating to budgetary, administrative, or legislative proposals.\n(b) This order shall be implemented in a manner consistent with applicable law and subject to the availability of appropriations.\n(c) This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\nTHE WHITE HOUSE,\nJanuary 20, 2025."
    },
    {
      "url": "https://www.npr.org/2025/05/22/nx-s1-5387729/senate-california-ev-air-pollution-waiver-revoked",
      "text": "Upending norms, the Senate votes to undo California's EV rules\nUpending norms, the Senate votes to undo California’s EV rules\nThe Senate has overruled the guidance of the parliamentarian, a nonpartisan staffer who interprets the Senate's rules, and voted 51 to 44 to overturn a waiver allowing California to set its own air pollution standards for cars that are stricter than national regulations. The Senate has only overruled its parliamentarian a handful of times in the 90-year history of the role.\nThe Senate also voted to revoke two waivers related to heavy-duty trucks. One allowed California to mandate zero-emission trucks, and the other permitted stricter emissions standards for new diesel trucks.\nCongress is using a law called the Congressional Review Act, or CRA, as a mechanism to revoke the federal waivers that allowed California to set these rules. The House previously approved three resolutions to revoke the waivers.\nBut there are significant questions about whether this use of the CRA is legal; the Government Accountability Office and the Senate parliamentarian, who serve as referees within the federal government, both determined that it is not.\nThe GAO's opinion is merely advisory. The parliamentarian's guidance is also non-binding, but the Senate has traditionally followed it. While disregarding this advice is not unprecedented, it's extremely rare. Historically, leaders of both parties have feared that if they act unilaterally to change the Senate's norms, the other party will do the same when they're in power. That's exactly what happened in 2013 and 2017, when first Democrats and then Republicans deployed the \"nuclear option\" to eliminate the filibuster for judicial nominees.\n\"Today it's all about California emission waivers. But tomorrow, the CRA could now be used to erase any policy from an agency that the Trump administration doesn't like at a simple majority threshold,\" Senate Minority Leader Chuck Schumer, D-N.Y., said Wednesday evening as he tried unsuccessfully to derail the vote. He argued that the CRA could subsequently be used to repeal any policies the White House — including future administrations — doesn't support, including waivers related to Medicaid or reproductive health care. \"Republicans should tread carefully today,\" he said. \"What goes around comes around.\"\nRepublicans have embraced a legal argument that the CRA can be used in this case. Speaking Wednesday afternoon, Senate Majority Leader John Thune, R-S.D., said that Republicans were not changing the Senate's broader rules or norms, and suggested other reasons for Democratic opposition. \"I think a lot of Democrats support an electric vehicle mandate,\" he said. \"In fact I think they're somewhat frantic at the prospect of losing this 'Green New Deal' policy.\"\nCalifornia Attorney General Rob Bonta says this use of the CRA is unlawful, and that California will challenge it in court. \"The weaponization of the Congressional Review Act to attack California's waivers is just another part of the continuous, partisan campaign against California's efforts to protect the public and the planet from harmful pollution,\" Bonta wrote in a statement.\nMeanwhile, California Gov. Gavin Newsom framed the vote as a national economic issue, arguing that rolling back the standards risks ceding the global EV market to China, where EVs make up a much higher share of production than in the U.S. \"The United States Senate has a choice: cede American car-industry dominance to China and clog the lungs of our children, or follow decades of precedent and uphold the clean air policies that Ronald Reagan and Richard Nixon fought so hard for. Will you side with China or America?\" he wrote in a statement.\nA unique ability\nBecause of its long history of regulating vehicle emissions, California has the unique ability to establish rules that are more ambitious than the federal ones. Each rule requires a waiver from the U.S. Environmental Protection Agency, and other states can choose to follow California's stricter standards if they want.\nCalifornia has used this ability to push the auto industry toward zero-emission vehicles for many years, both to protect human health and to reduce the transportation industry's contributions to climate change.\nIn the first Trump administration, the EPA withdrew a waiver that allowed California to set vehicle standards. A legal battle ensued. Some carmakers sided with the White House and others with Sacramento in the fight over whether that was legal. But the battle became moot after the Biden administration reinstated the waiver.\nSince then, California's mandates have become more aggressive, requiring a rapid acceleration in electric vehicle production, starting with 35% of new sales within the state in model year 2026 and reaching 100% of new sales by 2035.\nCritics have called that goal unrealistic, given that currently EVs make up about a quarter of new car sales in California, and about 10% of sales nationally. Supporters say that the rules are flexible enough to make them more achievable than they seem.\nSupporters also say that the state's standards are more important, the weaker federal rules get — especially with the Trump administration now poised to roll back federal environmental regulations, including on emissions standards.\nIn April, more than 100 public health and environmental groups sent a letter to Congress saying that blocking the California standards would mean \"more children suffering asthma attacks and missing school, more grandparents dying prematurely, and more death and destruction from extreme weather.\"\nThe use of the CRA to revoke the waiver is new; last time, Congress wasn't involved and the executive branch withdrew the waiver on its own. But just like during the first Trump administration, expect this decision to trigger a legal battle. Bonta, the California attorney general, has vowed to sue.\nIndustry allied against the regulations\nPresident Trump campaigned against \"EV mandates\" and \"gas car bans\" that would require gas cars to be replaced with electric ones. And while federal EV rules are not technically mandates, California's more aggressive rules do directly require companies to stop selling new gas vehicles (unless they can also run on electricity, like plug-in hybrids do).\nThe Trump administration has powerful allies in its fight against these rules. The oil industry has repeatedly sued to challenge California's stricter rules. The agriculture lobby, which favors biofuels over batteries, also opposes the California waiver. A group of more than 100 energy, agriculture and transportation trade groups issued a letter in mid-March urging Congress to disapprove the California waivers, arguing the three California rules would \"harm American economic and national security\" by increasing reliance on battery supply chains that are dominated by China.\nThe American Petroleum Institute has argued that electric vehicle mandates reduce consumer choice and raise the up-front costs of vehicles. In legal filings and public comments, the group also emphasizes it would cost the oil industry enormously.\n\"[An EV] mandate would produce widespread effects on the national economy, such as the reduced need for oil and gas production and gas processing, and changes to petroleum refining and distribution,\" the group wrote in one set of comments in 2024, describing the changes required to meet California's rules as \"extraordinary.\"\nAutomakers have also opposed the rule, although the issue is more complicated for the auto industry than for the oil industry. Carmakers would like some regulatory stability, since they need to plan vehicle production years in advance. In the name of stability, some automakers previously volunteered to keep following some California regulations during the first Trump administration, when they were disputed.\nOn the other hand, many traditional automakers think that California's current rules are unrealistic, particularly for the dozen or so states that have opted in to follow those standards. The Alliance for Automotive Innovation, the major automaker trade group, says it would take a \"miracle\" to meet the rules, because demand for EVs is not as strong as California had hoped.\nThe auto industry has been lobbying California, and each of the states following its rules, to slow down, pause or soften their strict EV requirements, with some success. But carmakers have simultaneously been lobbying for the use of the CRA to eliminate the California rule altogether, and knock out all those state requirements at once — precisely what's happening now.\nGreen groups object, trade groups rejoice\nOn Thursday, environmental and EV groups assailed the votes, and in particular the move to revoke the waiver relating to passenger cars. \"This illegitimate move poses threats to public health, the economy and states' rights,\" the Union of Concerned Scientists wrote in a statement. The Zero Emission Transportation Association, which represents electric automakers, called the waiver repeal \"an extraordinary action that sets a dangerous precedent.\"\nIndustry groups are celebrating. The American Petroleum Institute and the American Fuel and Petrochemical Manufacturers dubbed the repeal of that waiver \"a massive win for consumers and working families all across the country.\"\n\"The fact is these EV sales mandates were never achievable,\" the automaker trade group the Alliance for Automotive Innovation said in a statement, saying Congress deserves \"enormous credit\" for repealing California's rules."
    },
    {
      "url": "https://chineseclimatepolicy.oxfordenergy.org/book-content/domestic-policies/vehicles/electric-vehicles/",
      "text": "Background\nChina leads the world in deployment of electric vehicles. At the end of 2021, almost half the electric cars and 95% of electric buses and trucks in the world were in China. China also dominates global markets for electric two- and three-wheelers.22\nFigure 16-1: World Electric Car Stock\nIn 2021, 3.5 million electric vehicles were sold in China, of which 3.3 million were passenger cars. Electric car sales were 16% of total car sales. As of the end of 2021, roughly 7.8 million electric vehicles were on the roads in China, accounting for roughly 2.6% of total vehicles. 24\nThe growth in electric vehicle sales continued during the first half of 2022. From January through June 2022, 2.6 million electric vehicles were sold – a 120% year-over-year increase. Electric car sales reached 24% of total car sales.25\nFigure 16-2: Electric Car Sales in China (2010-2021)\nThe foregoing figures do not include either electric bicycles or low-speed electric vehicles.\n- Electric bicycles are omnipresent in China today. More than 325 million electric two-wheel scooters and motorcycles are on the roads, with roughly 47 million new units sold each year.27 Most use lead-acid batteries, but lithium-ion batteries have steadily gained market share.\n- As of year-end 2021, roughly 10 million low-speed electric vehicles (LSEVs) were in use in China. (These have approximately the size and performance of electric golf carts.) In recent years, sales have averaged roughly 2 million per year: Hebei, Shandong and Henan have seen the most sales of LSEVs.28 These LSEVs generally have top speeds of no more than 70 kilometers (40 miles) per hour, short ranges and lead-acid batteries, and are not counted in tallies of NEV sales. Due to the wider variety of low-cost mini-EVs in smaller cities, LSEV sales may peak and decline in the coming years.\nThe number of EV charging stations in China is growing rapidly. In January 2022, the Chinese Electric Vehicle Charging Infrastructure Promotion Agency (EVCIPA) reported 2.6 million EV charging posts in China (a 47% increase in one year). Of these, roughly 1.1 million were public chargers, of which 470,000 were DC fast chargers. Charging station numbers are much larger in the wealthy coastal provinces where EV mandates and incentives have been strongest: Of the more than 74,000 total public charging stations, over half were located in the five provinces or municipalities of Guangdong, Jiangsu, Zhejiang, Shanghai and Beijing. The top three charging station operators accounting for over half of public charging stations were TELD, State Grid and Star Charge.29\nBattery swapping stations are also rising rapidly, led by NIO which now uses battery swapping in a number of its vehicles. At the end of 2021, there were 1,298 battery swap stations in China. Nearly a quarter of these stations were in Beijing, with many in Guangdong Province as well. Almost all battery swap stations are owned by NIO (with 789 stations), Aulton (with 402) and Hangzhou First Technology.\nPrices for public charging or battery swapping are regulated, typically using the industrial electricity price plus a maximum service fee with time-of-use price differentials. Each province sets its own public charging price. Prices range from RMB 0.4/kWh to RMB 2/kWh, with RMB 1.5/kWh ($0.23/kWh) as a typical mid-price. Home charging in China generally employs the residential electricity price.30\nThere are dozens of EV manufacturers in China and, according to some reports, the quality of Chinese EVs was initially uneven and Chinese EVs often had low driving range.31 The Chinese industry has grown and evolved rapidly in the past four years, and today there are a number of long-range luxury Chinese EVs on the market. This includes battery-swap pioneer NIO, Xpeng, Polestar (a subsidiary of Geely-owned Volvo) and MG (a British brand now owned by SAIC) that manufacture mid- to high-end EVs at volume for both the domestic and export markets. China’s EV market has been described as having a barbell pattern, with large numbers of vehicles at the high- and low-ends, and fewer vehicles competing for ordinary, middle-priced vehicles.\nForeign automakers have also participated in China’s EV market. Tesla opened its Shanghai factory in 2018 and now manufactures almost as many vehicles in China as in the US (The Tesla Model 3 is China’s #2 top-selling EV, after the Hongguang mini-EV.) At the time of Tesla’s Shanghai launch, China removed its joint-venture requirements for foreign automakers. China’s top-selling EV, the Hongguang mini-EV, is a product of the joint venture between GM, SAIC and Wuling.\nFuel cell electric vehicles\nIn 2021, 1586 fuel cell electric vehicles were sold in China, bringing the country’s total fuel cell electric vehicle fleet sales since production started in 2015 to 8938.32\nMost FCVs are buses or trucks. China dominates the market for fuel cell buses worldwide, accounting for a total of 3,300 fuel cell buses as of 2021, or two-thirds of the cumulative worldwide sales. China has also scaled up its deployment of hydrogen vehicle charging infrastructure, adding 100 new stations in 2021 for a total of 218 hydrogen fueling stations.33\nSeveral cities have established pilot programs for fuel cell vehicles and hydrogen fueling infrastructure—and most policies aimed at hydrogen specifically focus on fuel cell vehicles. Beijing and Zhangjiakou included fuel cell buses and fueling infrastructure in the 2022 Winter Olympics plan, and Beijing plans to have over 10,000 fuel cell buses and 74 hydrogen fueling stations by 2025.34 Many other cities have adopted hydrogen development programs that focus on fuel cell vehicles. Stand-outs include Chengdu, which plans to have at least 3,000 fuel cell vehicles and 30 hydrogen fueling stations by 2025,35 and Datong, which has a target of 6,300 fuel cell vehicles and 50 hydrogen fueling stations by 2025 followed by 57,000 fuel cell vehicles by 2030.36\nPolicies\n“Developing new energy vehicles is essential for China’s transformation from a big automobile country to a powerful automobile country. We should increase research and development, seriously analyze the market, adjust existing policy and develop new products to meet the needs of different customers. This can make a strong contribution to economic growth.”—President Xi Jinping (May 2014, visiting an electric vehicle factory in Shanghai)37.\nThe Chinese government strongly supports electric vehicles. Central government policies include:\n- a target of 5 million electric vehicles on China’s roads by 2020 (a target missed, albeit barely, with 4.92 million NEVs registered by year-end 2020);38\n- a target of 20% NEV sales share by 2025;39\n- EV quotas for vehicle manufacturers and importers;\n- manufacturing subsidies;\n- tax exemptions;\n- government procurement;\n- support for the construction of electric vehicle charging stations.\nMany provincial governments also support electric vehicles, with preferential access to license plates and other incentives.\nThe goals of these policies include: cleaning the air in China’s cities, reducing China’s oil imports, positioning China for global leadership in a strategic industry and helping to meet President Xi’s carbon neutrality goal.40\nThe Chinese central government’s principal policies to promote electric vehicles include the following.\n1. New emissions vehicle mandate. Starting in 2019, each Chinese passenger vehicle manufacturer and importer was required to make or import at least 3.8% electric vehicles to meet the 10% NEV credit requirement, assuming a corporate average electric range of 200 km. The credit required increased to 12% in 2020 and, with a more stringent conversion rate, increased to 14% in 2021, 16% in 2022 and 18% in 2023, though vehicles with long ranges can qualify for extra credit. These regulations apply to any company that manufactures or imports more than 30,000 passenger vehicles in China. Companies that fail to achieve the required percentages may purchase credits from companies that over-comply. The target for 2025 is for 20% NEV sales. (This target was achieved in the first half of 2022.)41\n2. Subsidies. The Chinese government provides subsidies to manufacturers of electric vehicles.\n-\n- All-electric plug-in cars with a range over 400 km are eligible for subsidies of RMB 12,600 (approximately $2000).\n- All-electric plug-in cars with a range of 300–400 km are eligible for subsidies of RMB 9100 (approximately $1400).\n- Plug-in hybrid cars are now eligible for subsidies of RMB 4800 (approximately $750).42\nAll-electric plug-in cars with a range of less than 250 km are no longer eligible for subsidies.\nAll subsidies for the manufacture of plug-in electric cars were scheduled to be eliminated in 2021, though this was extended to the end of 2022.43 Subsidies for plug-in electric buses are being reduced as well.44\n3. Tax exemptions. The Chinese government exempts electric vehicles from consumption and sales taxes, which can save purchasers tens of thousands of RMB (equivalent to thousands of dollars).45\n4. Procurement. The Chinese government also uses its procurement power to promote electric vehicles. A May 2016 order requires that half of new vehicles purchased by China’s central government be new energy vehicles within five years.46\n5. New auto factory requirements. Chinese regulations strongly discourage the construction of factories for manufacturing internal combustion engine vehicles only. Subject to exceptions that are difficult to satisfy, any new vehicle factory is required to include capacity for the construction of electric vehicles.47\n6. Support for charging infrastructure. The Chinese central government promotes the development of EV charging infrastructure as a matter of national policy. It sets targets (120,000 EV charging stations and 4.8 million EV charging posts by 2020), provides funding and mandates standards. In 2022, the government also required all new communities and workplaces to have EV charging installed.48 In addition, many provincial and municipal governments promote EV charging infrastructure with financial incentives and requirements that building owners provide EV charging. China State Grid and China Southern Grid, China’s two state-owned electric utilities, both have programs to promote the development of electric vehicle charging infrastructure.49\n7. Support for fuel cell electric vehicles. In 2018, the Chinese government began offering a subsidy of up to RMB 200,000 (roughly $29,000) for fuel cell electric cars and RMB 500,000 (roughly $72,500) for fuel cell electric trucks and buses.50 These subsidies have now ended and been replaced by demonstration programs in pilot cities to be selected by the central government.51 As noted, several cities have their own fuel cell vehicle programs.\nFigure 16-3: Number of Public Charging Stations in China (2015-2021)\nMany Chinese provincial and local governments are very active in promoting electric vehicles as well.\n- Many municipalities provide license plates for electric vehicles much faster and cheaper than for conventional vehicles. (In Beijing, for example, plates for electric vehicles can be obtained in months, while plates for conventional vehicles can take years. In Shanghai, plates for electric vehicles are free, while plates for conventional vehicles cost more than $12,000.)\n- Free and preferential parking spaces for electric vehicles are common.\n- Many large Chinese cities restrict passenger cars from driving on certain days based on their license plate number but exempt electric cars from such restrictions.\n- Some municipalities pay local manufacturers subsidies for electric vehicles.\n- Shenzhen’s entire taxi fleet is all-electric.\n- In March 2019, Hainan provincial officials announced that the sale of fossil fuel cars would be banned in the province starting in 2030.53\nThe provincial and municipal government policies play an important role in the development of China’s electric vehicle market.\nChinese government policies with respect to electric vehicles are set forth in a number of documents, including the New Energy Vehicle Industry Development Plan 2021–2035 (October 2020).54\nImpact on CO2 Emissions\nWhat impact do electric vehicles have on China’s CO2 emissions? Though the majority of China’s electricity comes from coal, carbon emissions from EVs are generally lower on a life-cycle basis than internal combustion vehicles due to the greater efficiency of electric vehicles.\n- The IEA estimated that electric vehicles in China avoided 30 MT of CO2 emissions in 2018.\n- The ICCT in 2021 estimated that in 2020 EVs would have life-cycle emissions 37–45% lower than internal combustion vehicles in China, whereas for 2030 EVs would offer life-cycle emissions 48–64% lower than ICE vehicles.55\n- In 2021, the China Automotive Technology & Research Center (CATARC) estimated per km life-cycle emissions of 2020 hybrid passenger vehicles as 18% lower, plug-in hybrids as 12% lower and pure EVs as 39% lower than ICE vehicles.56 The CATARC study notes that the emissions reduction and water-saving benefits of EVs will rise steadily towards 2060.\nThe CO2 impacts of electric vehicles likely vary within China depending on where and when the vehicles are charged. China’s electric generation is more carbon intensive in the north than in the south, for example, and renewable output varies by time. A 2022 study of EV smart charging in China showed that timing charging could enable a 20% reduction in well-to-wheel heat-trapping gas emissions while also reducing the need for new charging infrastructure.57\nElectric vehicles have the potential to significantly reduce CO2 emissions from the Chinese vehicle fleet as the carbon intensity of China’s power sector declines in the decades ahead. In the medium- to long-term, vehicle electrification will be important to meeting the Chinese government’s goals for a low-carbon economy."
    },
    {
      "url": "https://theconversation.com/revoking-epas-endangerment-finding-the-keystone-of-us-climate-policies-isnt-simple-and-could-have-unintended-consequences-252271",
      "text": "Most of the United States’ major climate regulations are underpinned by one important document: It’s called the endangerment finding, and it concludes that greenhouse gas emissions are a threat to human health and welfare.\nThe Trump administration is trying to eliminate it.\nEnvironmental Protection Agency Administrator Lee Zeldin announced on July 29, 2025, that the EPA would soon publish a proposed rule to rescind the endangerment finding and allow 45 days for public comment.\nA draft released by the EPA of the proposal argues that the agency didn’t have the authority to issue the endangerment finding in 2009 or regulations based on it. The draft also argues that U.S. vehicle emissions are not significant in terms of global emissions of greenhouse gases and that the costs to consumers outweigh the benefits.\nThese are dubious factual and legal propositions that will require deeper analysis once the proposal is officially published in the Federal Register.\nRevoking the endangerment finding isn’t a simple task. If the rule is finalized, it will also trigger an onslaught of lawsuits. And revoking the finding could have unintended consequences for the very industries President Donald Trump is trying to help.\nAs a law professor, I have tracked federal climate regulations and the lawsuits and court rulings that have followed them over the past 25 years. To understand the challenges, let’s look at the endangerment finding’s origins and Zeldin’s options.\nOrigin and limits of the endangerment finding\nIn 2007, the U.S. Supreme Court ruled in Massachusetts v. EPA that six greenhouse gases are pollutants under the Clean Air Act and that the EPA has a duty under the same law to determine whether they pose a danger to public health or welfare.\nThe court also ruled that once the EPA made an endangerment finding, the agency would have a mandatory duty under the Clean Air Act to regulate all sources that contribute to the danger.\nThe court emphasized that the endangerment finding was a scientific determination and rejected a laundry list of policy arguments made by the George W. Bush administration for why the government preferred to use nonregulatory approaches to reduce emissions. The court said the only question was whether sufficient scientific evidence exists to determine whether greenhouse gases are harmful.\nThe endangerment finding was the EPA’s response.\nThe finding was challenged and upheld in 2012 by the U.S. Court of Appeals for the D.C. Circuit. In that case, Coalition for Responsible Regulation v. EPA, the court found that the “body of scientific evidence marshaled by the EPA in support of the endangerment finding is substantial.” The Supreme Court declined to review the decision. The endangerment finding was updated and confirmed by the EPA in 2015 and 2016.\nChallenging the endangerment finding\nThe scientific basis for the endangerment finding is stronger today than it was in 2009.\nThe Intergovernmental Panel on Climate Change’s latest assessment report, involving hundreds of scientists and thousands of studies from around the world, concluded that the scientific evidence for warming of the climate system is “unequivocal” and that greenhouse gases from human activities are causing it.\nAccording to the National Climate Assessment released in 2023, the effects of human-caused climate change are already “far-reaching and worsening across every region of the United States.”\nDuring Trump’s first term, then-EPA Administrator Scott Pruitt considered repealing the endangerment finding but ultimately decided against it. In fact, he relied on it in proposing the Affordable Clean Energy Rule to replace President Barack Obama’s Clean Power Plan for regulating emissions for coal-fired power plants.\nZeldin’s cost argument\nZeldin had previewed some of his arguments for rescinding the endangerment finding in a news release on March 12.\nHis first argument then was that the 2009 endangerment finding did not consider costs. However, that argument was rejected by the District of Columbia Circuit Court in Coalition for Responsible Regulation v. EPA in 2012. Cost becomes relevant once the EPA considers new regulations – after the endangerment finding.\nMoreover, in a unanimous 2001 decision, the Supreme Court in Whitman v. American Trucking Associations held that the EPA cannot consider cost in setting air quality standards.\nWhat happens if the EPA revokes the endangerment finding?\nEven if Zeldin is able to revoke the endangerment finding, that does not automatically repeal all the rules that rely on it. Each of those rules must go through separate rulemaking processes that will also take months. The agency will also face lawsuits.\nZeldin could simply refuse to enforce the rules on the books.\nHowever, a blanket policy abdicating any enforcement responsibility could be challenged in lawsuits as arbitrary and capricious. Further, the regulated industries would be taking a chance if they delay complying with regulations, only to find the endangerment finding and climate laws still in place.\nA repeal could backfire\nRepealing the endangerment finding could also backfire on the fossil fuel industry.\nStates and cities have filed dozens of lawsuits against the major oil companies. The industry’s strongest argument has been that these cases are preempted by federal law. In AEP v. Connecticut in 2011, the Supreme Court ruled that the Clean Air Act “displaced” federal common law, barring state claims for remedies related to damages from climate change.\nHowever, if the endangerment finding is repealed, then there is arguably no basis for federal preemption, and these state lawsuits would have legal grounds. Prominent industry lawyers have warned the EPA about this and urged it to focus instead on changing individual regulations. The industry is concerned enough that it may try to get Congress to grant it immunity from climate lawsuits.\nTo the extent that Zeldin is counting on the conservative Supreme Court to back him up, he may be disappointed.\nIn 2024, the court overturned the Chevron doctrine, which required courts to defer to agencies’ reasonable interpretations when laws were ambiguous. That means Zeldin’s reinterpretation of the statute is not entitled to deference. Nor can he count on the court overturning its Massachusetts v. EPA ruling to free him to disregard science for policy reasons.\nThis article, originally published March 19, 2025, has been updated with the EPA’s announcement to rescind the endangerment finding."
    },
    {
      "url": "https://www.theregreview.org/2019/09/19/dequarto-automakers-prefer-self-regulation-regulatory-uncertainty/",
      "text": "Faced with uncertainty over fuel economy standards, four automakers choose to support stronger government regulation.\nFour of the world’s largest automakers recently agreed to sign a joint framework, negotiated with California, to increase the fuel efficiency of their vehicles voluntarily. The agreement comes roughly one year after the Trump Administration proposed a rule that aimed in part to rollback stringent fuel efficiency standards finalized under the Obama Administration.\nThat proposed Safer Affordable Fuel-Efficient (SAFE) Vehicles Rule, if finalized, would lower the average fuel economy standard from the 54.5 miles per gallon target adopted by the Obama Administration in 2012 to about 37 miles per gallon beginning in 2020. The agreement between California and the automakers, however, requires a 3.7 percent yearly increase in the annual fuel economy of their car fleets beginning in 2022 and ultimately peaks at 51 miles per gallon in 2026.\nWhy would a group of automakers voluntarily agree to impose emissions standards upon themselves that are stricter than the emissions standards proposed by the federal government? The answer might not be immediately obvious to anyone who would assume that companies always prefer less regulation.\nFor the automakers, the answer is simple: The framework—in effect, a form of self-regulation—provides a degree of regulatory certainty. Distinct from a federal regulation that would bind all U.S. automakers, however, the agreement with California only applies to the four signatory automakers. In a joint statement, Ford Motor Company, Volkswagen of America, Honda, and BMW reportedly explained that the agreement with California allows them to avoid “a patchwork of regulations while continuing to ensure meaningful greenhouse gas emissions reductions.”\nThis concern about a “patchwork” of regulations stems from the complicated nature of vehicle emissions regulation in the United States.\nAlthough the Energy and Policy Conservation Act directs the National Highway Traffic and Safety Administration (NHTSA) to set national average fuel economy standards, the Clean Air Act also grants the U.S. Environmental Protection Agency (EPA) the authority to regulate greenhouse gas emissions, which are the inevitable byproduct of burning gasoline. Because of their somewhat overlapping authority, NHTSA and EPA jointly issued fuel economy standards under the Obama Administration and jointly proposed the recent SAFE Vehicles Rule under the Trump Administration.\nYet there is still a third player in the mix: California. At the time the Clean Air Act was passed in 1970, California had already implemented many of its own air pollution and emissions laws, which any new federal regulations would have preempted. Recognizing this fact, the Clean Air Act permits California to apply to the EPA for a waiver from federal preemption if its state vehicle emissions standards are at least as stringent as the existing federal standards.\nAlthough California is only one of 50 states, it reportedly generates about 12 percent of all U.S. vehicle sales. Furthermore, once EPA grants California a waiver to enact stricter vehicle emissions standards, other states can then adopt California’s standard—an option that 13 states have chosen to pursue. As a result, California has a large degree of influence over automakers who prefer to have a single fleet of cars that meets both California’s and the federal government’s fuel economy and emissions standards.\nThe proposed SAFE Vehicles Rule, however, seeks to revoke California’s Clean Air Act waiver.\nSupporters of this revocation, such as Myron Ebell from the Competitive Enterprise Institute, claim that eliminating the waiver “puts California back on an equal footing with the other 49 states and means that California cannot dictate what kinds of cars people can drive across the entire country.”\nBut California does not intend to relinquish without a fight its right to seek a waiver and set more stringent emissions standards. In fact, California Attorney General Xavier Beccera has vowed that California would “use every legal tool at its disposal to defend today’s national standards and reaffirm the facts and science behind them.”\nWith the fate of California’s waiver uncertain and the likelihood that any final rule issued by NHTSA and EPA would be challenged in court, the four automakers likely saw a compromise with California as their best option. Although the agreement with California imposes far more stringent fuel economy standards upon the automakers than those proposed by the Trump Administration, it also allows them to get started on planning for their future automobile fleets.\n“Uncertainty from protracted litigation is a major concern for an industry with long production cycles, so much capital investment, and 10 million Americans dependent on auto paychecks,” said the Alliance of Automobile Manufacturers in a press release.\nEmpirical evidence also supports the Alliance of Automobile Manufacturer’s sentiment that regulatory uncertainty is costly. Several scholars have found that uncertainty surrounding emissions regulations can create significant economic and environmental costs.\nEPA, however, disagrees that the agreement between California and the automakers provides the industry with any certainty. An EPA spokesman has reportedly claimed that the agreement “does nothing to further the one national standard that will provide certainty and relief for American customers.”\nIronically, the automakers may now face an even more uncertain future following an announcement that the U.S. Department of Justice will initiate an antitrust investigation into whether the automakers “violated federal competition law.”"
    },
    {
      "url": "https://www.sierraclub.org/sierra/epa-endangerment-finding-trump-zeldin-tries-to-torpedo-greenhouse-gases",
      "text": "Under Trump, the EPA Takes First Step to Torpedo “Endangerment Finding” on Greenhouse Gases\nAdministrator Lee Zeldin derides “climate change religion” as reason to abandon clean air and water regulations\nThe Trump administration has announced its first step toward trying to revoke one of the most consequential legal standards in the United States for acting on planet-heating fossil fuel emissions. Sixteen years ago, the Environmental Protection Agency issued its landmark “endangerment finding” that greenhouse gases heating up the planet threaten public health and welfare. Two years earlier, the Supreme Court paved the way for that finding with a determination that the EPA has the authority to limit the emissions of those gases through federal regulation.\nNow the EPA, under Donald Trump, is trying to undo its own authority to take that action.\nEPA administrator Lee Zeldin announced Wednesday that the agency will undertake a “formal reconsideration” of its 2009 endangerment finding, which underpins the agency’s legal obligation to regulate carbon dioxide and other climate pollutants under the Clean Air Act. The EPA also announced that it intends to undo all of its prior rules that flow from that finding, including limits on emissions from automobiles and power plants alongside scores of other rules pertaining to air and water pollution.\n“Today is the greatest day of deregulation our nation has seen. We are driving a dagger straight into the heart of the climate change religion,” Zeldin said.\n“Instead of protecting communities reeling from the havoc caused by climate disasters, Trump and Zeldin seek to shatter the foundation that undergirds our climate safeguards.”\nClimate advocates reacted with outrage. “Instead of protecting communities reeling from the havoc caused by climate disasters, Trump and Zeldin seek to shatter the foundation that undergirds our climate safeguards,” Joanne Spalding, legal director at the Sierra Club, told Sierra. “Sierra Club has been expecting and preparing for this unlawful action, and we will use every legal means available to challenge it.”\nLegal experts say they expect the administration will face an uphill legal battle, with one environmental attorney pointing to unambiguous language in the Clean Air Act that may put to rest any claims that the law does not authorize climate regulations.\nThe endangerment finding stems from the landmark 2007 Supreme Court decision in Massachusetts v. EPA, a case in which a dozen states, along with several cities and environmental groups including the Sierra Club, challenged the George W. Bush administration EPA’s refusal to regulate carbon emissions from automobiles. The Supreme Court ruled 5-4 in favor of the states, determining that greenhouse gases are pollutants under the Clean Air Act, which requires regulation of air pollutants that are found to endanger public health and welfare. The EPA then made such a finding of endangerment, based on voluminous scientific evidence, during the first year of the Obama administration.\n“The finding has since been the predicate for all of EPA’s actions on climate change under the Clean Air Act, including its regulations of greenhouse gas emissions from vehicles, power plants, landfills, and more,” Robert Sussman, an environmental lawyer and former EPA official, explained during a climate law briefing on Tuesday hosted by the Environmental Law Institute. He noted that the finding has faced political attacks and legal challenges, but has so far withstood those pressures. The EPA declined petitions to reconsider the finding during Trump’s first term.\n“Undertaken in secrecy”\nThe planning around Zeldin’s move to reverse the endangerment finding happened behind closed doors. On February 26, The Washington Post first reported that Zeldin recommended to the White House that the agency strike down the finding. Other news outlets citing anonymous sources confirmed that reporting, though Zeldin’s proposal was not released publicly.\nThe recommendation follows a directive from President Donald Trump in a January 20 executive order that the EPA, in consultation with other agency heads, submit recommendations within 30 days to the Office of Management and Budget “on the legality and continuing applicability” of the endangerment finding. An EPA spokesperson declined to confirm what news reports had revealed about the recommendation, saying only that the EPA was in compliance with the executive order.\nEnvironmental advocates and congressional Democrats have condemned Zeldin’s recommendation to revoke the endangerment finding and have also slammed the administration’s lack of transparency around its plans for doing so.\n“EPA administrator Zeldin’s recommendation to strike down the endangerment finding was undertaken in secrecy, is deeply cynical, and will hurt Americans already experiencing severe harms due to climate change,” said Environmental Defense Fund’s Peter Zalzal. “The public has a right to know why Administrator Zeldin—the head of the agency charged with protecting the public from the harms of climate change—has instead chosen to trample the science and do the exact opposite.”\nEDF filed a lawsuit last week against the EPA, arguing the agency failed to respond to the group’s Freedom of Information Act request under statutory deadlines. The group’s request sought records and communications around Zeldin’s recommendation pertaining to the endangerment finding.\nDemocrats on the Senate Environment and Public Works Committee recently wrote to Zeldin with a similar request for more information and answers about the reported move to rescind the finding. The senators demanded Zeldin disclose details around his recommendation, such as who was involved or consulted. The recommendation and planning, the senators say, has happened “behind the scenes and away from public scrutiny.”\nDavid Bookbinder, an environmental lawyer and director of law and policy at Environmental Integrity Project, said it is not surprising that there has been so little transparency around the administration’s plans to reverse the finding. “They don’t want publicity on this,” he told Sierra.\nGutting climate regulations\nUndoing the endangerment finding, legal experts say, would essentially strip away the EPA’s obligation to regulate greenhouse gas emissions, allowing the agency to axe rules meant to curb emissions in one blow without needing to replace them with weaker versions. “It’s a much simpler way to just gut climate regulations,” Ann Carlson, an environmental law professor and faculty director of the Emmett Institute for Climate Change and the Environment at UCLA Law School, told Sierra.\n“Removing it from the climate toolbox would definitely be a blow to future climate mitigation efforts,” Sussman said.\nIn its announcement Wednesday, the EPA indicated it would undertake a formal administrative process to overhaul the endangerment finding, including taking public comment. The agency said it plans to “leverage the expertise of the White House Budget Office, including the Office of Information and Regulatory Affairs, White House Office of Science and Technology Policy, National Oceanic and Atmospheric Administration, and other relevant agencies.” The EPA further pledged to “follow the Administrative Procedure Act and Clean Air Act, as applicable, in a transparent way for the betterment of the American people and the fulfillment of the rule of law.”\nRevisiting Mass. v. EPA?\nOne key question, Sussman said, is on what basis the EPA may try to revoke the endangerment finding. The agency could attempt to contest the underlying science. E&E News reported earlier this week that the Trump administration might next be assembling a federal report that rejects the overwhelming scientific evidence on the detrimental effects of climate change.\nAlternatively, the EPA could aim to go after the legal underpinning of Massachusetts v. EPA. The Supreme Court is more conservative now than it was in 2007—three of the four justices that dissented in that ruling are still on the bench.\nStill, another recent Supreme Court decision may work against the EPA’s favor should Massachusetts come up for review. Last year, the court upended 40 years of administrative law precedent when it ruled in the Loper Bright case that courts may not defer to an agency’s reasonable interpretations of ambiguous statutory language—a practice that had come to be known as Chevron deference—but must instead make their own judgments as to the best meaning of the law in those instances.\n“The decision overturning Chevron deference makes it even easier to show that the Clean Air Act was meant to regulate pollutants that affect the climate, because it says so in the [Clean Air Act] text,” Bookbinder, who previously led work on the Massachusetts case as the Sierra Club’s chief climate counsel, explained. He pointed to the statute’s definitions section, which does explicitly say that “effects on welfare”—which is part of the statute’s endangerment language—includes effects on things like weather and climate.\nThe underlying climate science has also become even more robust over the years. “It’s almost laughable to take a position that greenhouse gas emissions don’t endanger public health and welfare,” Carlson said.\n“By repealing this, trashing this [endangerment] finding, the Trump administration is lying to you,” Representative Suzanne Bonamici of Oregon said during a February 28 press conference. “The science is irrefutable.”"
    },
    {
      "url": "https://climate.ec.europa.eu/eu-action/european-climate-law_en",
      "text": "The European Climate Law writes into law the goal set out in the European Green Deal for Europe’s economy and society to become climate-neutral by 2050. The law also sets the intermediate target of reducing net greenhouse gas (GHG) emissions by at least 55% by 2030, compared to 1990 levels.\nClimate neutrality by 2050 means achieving net zero GHG emissions for EU Member States as a whole, mainly by cutting emissions, investing in clean technologies, and protecting the environment.\nThe law aims to ensure that all EU policies contribute to this goal and that all sectors of the economy and society play their part.\nObjectives\n- Set the long-term direction of travel for meeting the 2050 climate neutrality objective through all policies, in a socially fair and cost-efficient manner\n- Set an ambitious EU 2030 target, placing Europe on a responsible path to climate neutrality\n- Create a system for monitoring progress and take further action if needed\n- Provide predictability for investors and other economic actors\n- Ensure that the transition to climate neutrality is irreversible\nKey elements\nThe European Climate Law sets a legally binding target of net zero greenhouse gas (GHG) emissions by 2050. The EU institutions and the Member States are bound to take the necessary measures at EU and national level to meet the target, considering the importance of promoting fairness and solidarity among Member States.\nIntermediate targets\nThe Climate Law also addresses the necessary intermediate steps to meet the 2050 climate neutrality target:\n2030 climate target\n- Based on a comprehensive impact assessment, the EU has set 2030 climate target of reducing net GHG emissions by at least 55% compared to levels in 1990. The 2030 climate target is now included in the Climate Law.\n- In 2023, the EU adopted a series of proposals, known as the ‘Fit for 55’ package, which revised all relevant policy instruments necessary to achieve the 2030 climate target.\n2040 climate target\n- The Climate Law also includes a process for setting a 2040 climate target.\n- In February 2024, the Commission presented a Communication and detailed impact assessment launching the process of setting a 2040 climate target for the EU.\n- In July 2025, the Commission proposed an amendment to the Climate Law which would establish an EU climate target for 2040. The proposed target is a 90% reduction in net GHG emissions, compared to 1990 levels. The proposal has been submitted to the European Parliament and the Council for discussion and adoption under the ordinary legislative procedure.\nTracking progress\nThe Climate Law includes measures to keep track of progress and adjust our actions accordingly, based on existing systems such as:\n- The governance process for Member States’ National Energy and Climate Plans (NECPs)\n- Regular reports by the European Environment Agency (EEA)\n- Latest scientific evidence on climate change and its impacts\nProgress will be reviewed every five years, in line with the global stocktake exercise under the Paris Agreement.\nOther key features\nThe Climate Law also includes:\n- a commitment to negative emissions after 2050\n- a commitment to engage with sectors to prepare sector-specific roadmaps charting the path to climate neutrality in different areas of the economy\n- stronger provisions on adaptation to climate change\n- strong coherence across Union policies with the climate neutrality objective\n- the establishment of the European Scientific Advisory Board on Climate Change to provide independent scientific advice\n- the recognition of the need to enhance the EU's carbon sink through a more ambitious LULUCF regulation – the Commission made a related proposal in July 2021, which then entered into force in May 2023\nMilestones\nPreparation\nThe Commission conducted extensive analysis and stakeholder consultation in preparation of its strategic vision for a climate-neutral EU published in November 2018. This was followed by an EU-wide debate on the vision.\nA high-level public conference on 28 January 2020 provided a further opportunity for open, public stakeholder debate on the European Climate Law before its finalisation and adoption.\nThe public also had the possibility to provide feedback on the roadmap for the legislative proposal, with nearly 1000 contributions.\nFormal adoption\nThe European Climate Law was published in the Official Journal on 9 July 2021 and entered into force on 29 July 2021.\nImplementation\nIn 2023, for the first time, the Commission assessed progress towards the climate neutrality and adaptation objectives, as required under the Climate Law. The findings were published as part of the 2023 Climate Action Progress Report and in a separate Staff Working Document on national progress with implementing adaptation.\nAlthough greenhouse gas emissions continue to fall and there are encouraging signs of action on the ground, the Commission’s assessment is that current progress towards the EU’s climate neutrality objective appears to be insufficient. Action is most needed in areas which still require significant reductions in emissions (e.g. buildings, transport), where progress is too slow (e.g. agriculture), or where, in recent years, there has been a deteriorating trend, as is the case for the carbon sink (e.g. land use, land-use change, and forestry).\nThe European Union has made broad progress on adaptation to climate change, in particular through the ongoing implementation of the EU Adaptation Strategy. However, progress has been uneven across areas.\nThe assessment of progress on adaptation at the national level shows that Member States need to take significantly more action to adapt to climate change – for instance, on governance, funding, risk assessments, nature-based solutions, as well as monitoring, reporting and evaluation in order to reduce their social and economic vulnerabilities to the intensifying climate-related risks.\nBased on the assessment, the Commission issued recommendations to Member States under the European Climate Law in December 2023. Member States that submitted draft updated National Energy and Climate Plans (NECPs) in time for the Commission’s EU-wide assessment of the draft NECPs receive recommendations on:\n- the draft updated NECPs\n- the consistency of their measures with the EU’s climate neutrality objective\n- the consistency of their measures with ensuring progress on adaptation under the European Climate Law.\nMember States which did not submit a draft updated NECP or submitted one several months after the deadline only receive recommendations under the European Climate Law.\nCommission recommendations: progress on climate neutrality and adaptation\nThese are recommendations under the European Climate Law for Member States which did not submit a draft updated NECP in time for the Commission recommendations in December 2023. You can find all recommendations on NECPs on the National Energy and Climate Plans (NECPs) page.\n- 18 DECEMBER 2023\n- 18 DECEMBER 2023\n- 18 DECEMBER 2023\n- 18 DECEMBER 2023\n- 18 DECEMBER 2023\n- 18 DECEMBER 2023\nEuropean Climate Law\n- Regulation (EU) 2021/1119: European Climate Law\n- Commission proposal for a Regulation: European Climate Law\n- Commission amended proposal for a Regulation: European Climate Law\n- Climate Law Factsheet\n- 18 December 2023: Commission Communication: EU wide assessment of the draft updated National Energy and Climate Plans\n- 18 December 2023: Commission Staff Working Document: Assessment of progress on climate adaptation in the individual Member States according to the European Climate Law\n2040 climate target"
    },
    {
      "url": "https://www.iea.org/reports/global-ev-outlook-2024/trends-in-electric-cars",
      "text": "Cite report\nIEA (2024), Global EV Outlook 2024, IEA, Paris https://www.iea.org/reports/global-ev-outlook-2024, Licence: CC BY 4.0\nReport options\nTrends in electric cars\nElectric car sales\nNearly one in five cars sold in 2023 was electric\nElectric car sales neared 14 million in 2023, 95% of which were in China, Europe and the United States\nAlmost 14 million new electric cars1 were registered globally in 2023, bringing their total number on the roads to 40 million, closely tracking the sales forecast from the 2023 edition of the Global EV Outlook (GEVO-2023). Electric car sales in 2023 were 3.5 million higher than in 2022, a 35% year-on-year increase. This is more than six times higher than in 2018, just 5 years earlier. In 2023, there were over 250 000 new registrations per week, which is more than the annual total in 2013, ten years earlier. Electric cars accounted for around 18% of all cars sold in 2023, up from 14% in 2022 and only 2% 5 years earlier, in 2018. These trends indicate that growth remains robust as electric car markets mature. Battery electric cars accounted for 70% of the electric car stock in 2023.\nGlobal electric car stock, 2013-2023\nOpenWhile sales of electric cars are increasing globally, they remain significantly concentrated in just a few major markets. In 2023, just under 60% of new electric car registrations were in the People’s Republic of China (hereafter ‘China’), just under 25% in Europe,2 and 10% in the United States – corresponding to nearly 95% of global electric car sales combined. In these countries, electric cars account for a large share of local car markets: more than one in three new car registrations in China was electric in 2023, over one in five in Europe, and one in ten in the United States. However, sales remain limited elsewhere, even in countries with developed car markets such as Japan and India. As a result of sales concentration, the global electric car stock is also increasingly concentrated. Nevertheless, China, Europe and the United States also represent around two-thirds of total car sales and stocks, meaning that the EV transition in these markets has major repercussions in terms of global trends.\nIn China, the number of new electric car registrations reached 8.1 million in 2023, increasing by 35% relative to 2022. Increasing electric car sales were the main reason for growth in the overall car market, which contracted by 8% for conventional (internal combustion engine) cars but grew by 5% in total, indicating that electric car sales are continuing to perform as the market matures. The year 2023 was the first in which China’s New Energy Vehicle (NEV)3 industry ran without support from national subsidies for EV purchases, which have facilitated expansion of the market for more than a decade. Tax exemption for EV purchases and non-financial support remain in place, after an extension, as the automotive industry is seen as one of the key drivers of economic growth. Some province-led support and investment also remains in place and plays an important role in China’s EV landscape. As the market matures, the industry is entering a phase marked by increased price competition and consolidation. In addition, China exported over 4 million cars in 2023, making it the largest auto exporter in the world, among which 1.2 million were EVs. This is markedly more than the previous year – car exports were almost 65% higher than in 2022, and electric car exports were 80% higher. The main export markets for these vehicles were Europe and countries in the Asia Pacific region, such as Thailand and Australia.\nIn the United States, new electric car registrations totalled 1.4 million in 2023, increasing by more than 40% compared to 2022. While relative annual growth in 2023 was slower than in the preceding two years, demand for electric cars and absolute growth remained strong. The revised qualifications for the Clean Vehicle Tax Credit, alongside electric car price cuts, meant that some popular EV models became eligible for credit in 2023. Sales of the Tesla Model Y, for example, increased 50% compared to 2022 after it became eligible for the full USD 7 500 tax credit. Overall, the new criteria established by the Inflation Reduction Act (IRA) appear to have supported sales in 2023, despite earlier concerns that tighter domestic content requirements for EV and battery manufacturing could create immediate bottlenecks or delays, such as for the Ford F-150 Lightning. As of 2024, new guidance for the tax credits means the number of eligible models has fallen to less than 30 from about 45,4 including several trim levels of the Tesla Model 3 becoming ineligible. However, in 2023 and 2024, leasing business models enable electric cars to qualify for the tax credits even if they do not fully meet the requirements, as leased cars can qualify for a less strict commercial vehicle tax credit and these tax credit savings can be passed to lease-holders. Such strategies have also contributed to sustained electric car roll-out.\nIn Europe, new electric car registrations reached nearly 3.2 million in 2023, increasing by almost 20% relative to 2022. In the European Union, sales amounted to 2.4 million, with similar growth rates. As in China, the high rates of electric car sales seen in Europe suggest that growth remains robust as markets mature, and several European countries reached important milestones in 2023. Germany, for example, became the third country after China and the United States to record half a million new battery electric car registrations in a single year, with 18% of car sales being battery electric (and another 6% plug-in hybrid).\nHowever, the phase-out of several purchase subsidies in Germany slowed overall EV sales growth. At the start of 2023, PHEV subsidies were phased out, resulting in lower PHEV sales compared to 2022, and in December 2023, all EV subsidies ended after a ruling on the Climate and Transformation Fund. In Germany, the sales share for electric cars fell from 30% in 2022 to 25% in 2023. This had an impact on the overall electric car sales share in the region. In the rest of Europe, however, electric car sales and their sales share increased. Around 25% of all cars sold in France and the United Kingdom were electric, 30% in the Netherlands, and 60% in Sweden. In Norway, sales shares increased slightly despite the overall market contracting, and its sales share remains the highest in Europe, at almost 95%.\nElectric car registrations and sales share in China, United States and Europe, 2018-2023\nOpenSales in emerging markets are increasing, albeit from a low base, led by Southeast Asia and Brazil\nElectric car sales continued to increase in emerging market and developing economies (EMDEs) outside China in 2023, but they remained low overall. In many cases, personal cars are not the most common means of passenger transport, especially compared with shared vans and minibuses, or two- and three-wheelers (2/3Ws), which are more prevalent and more often electrified, given their relative accessibility and affordability. The electrification of 2/3Ws and public or shared mobility will be key to achieve emissions reductions in such cases (see later sections in this report). While switching from internal combustion engine (ICE) to electric cars is important, the effect on overall emissions differs depending on the mode of transport that is displaced. Replacing 2/3Ws, public and shared mobility or more active forms of transport with personal cars may not be desirable in all cases.\nIn India, electric car registrations were up 70% year-on-year to 80 000, compared to a growth rate of under 10% for total car sales. Around 2% of all cars sold were electric. Purchase incentives under the Faster Adoption and Manufacturing of Electric Vehicles (FAME II) scheme, supply-side incentives under the Production Linked Incentive (PLI) scheme, tax benefits and the Go Electric campaign have all contributed to fostering demand in recent years. A number of new models also became popular in 2023, such as Mahindra’s XUV400, MG’s Comet, Citroën’s e-C3, BYD’s Yuan Plus, and Hyundai’s Ioniq 5, driving up growth compared to 2022. However, if the forthcoming FAME III scheme includes a subsidy reduction, as has been speculated in line with lower subsidy levels in the 2024 budget, future growth could be affected. Local carmakers have thus far maintained a strong foothold in the market, supported by advantageous import tariffs, and account for 80% of electric car sales in cumulative terms since 2010, led by Tata (70%) and Mahindra (10%).\nIn Thailand, electric car registrations more than quadrupled year-on-year to nearly 90 000, reaching a notable 10% sales share – comparable to the share in the United States. This is all the more impressive given that overall car sales in the country decreased from 2022 to 2023. New subsidies, including for domestic battery manufacturing, and lower import and excise taxes, combined with the growing presence of Chinese carmakers, have contributed to rapidly increasing sales. Chinese companies account for over half the sales to date, and they could become even more prominent given that BYD plans to start operating EV production facilities in Thailand in 2024, with an annual production capacity of 150 000 vehicles for an investment of just under USD 500 million. Thailand aims to become a major EV manufacturing hub for domestic and export markets, and is aiming to attract USD 28 billion in foreign investment within 4 years, backed by specific incentives to foster investment.\nIn Viet Nam, after an exceptional 2022 for the overall car market, car sales contracted by 25% in 2023, but electric car sales still recorded unprecedented growth: from under 100 in 2021, to 7 000 in 2022, and over 30 000 in 2023, reaching a 15% sales share. Domestic front-runner VinFast, established in 2017, accounted for nearly all domestic sales. VinFast also started selling electric sports utility vehicles (SUVs) in North America in 2023, as well as developing manufacturing facilities in order to unlock domestic content-linked subsidies under the US IRA. VinFast is investing around USD 2 billion and targets an annual production of 150 000 vehicles in the United States by 2025. The company went public in 2023, far exceeding expectations with a debut market valuation of around USD 85 billion, well beyond General Motors (GM) (USD 46 billion), Ford (USD 48 billion) or BMW (USD 68 billion), before it settled back down around USD 20 billion by the end of the year. VinFast also looks to enter regional markets, such as India and the Philippines.\nIn Malaysia, electric car registrations more than tripled to 10 000, supported by tax breaks and import duty exemptions, as well as an acceleration in charging infrastructure roll-out. In 2023, Mercedes-Benz marketed the first domestically assembled EV, and both BYD and Tesla also entered the market.\nIn Latin America, electric car sales reached almost 90 000 in 2023, with markets in Brazil, Colombia, Costa Rica and Mexico leading the region. In Brazil, electric car registrations nearly tripled year-on-year to more than 50 000, a market share of 3%. Growth in Brazil was underpinned by the entry of Chinese carmakers, such as BYD with its Song and Dolphin models, Great Wall with its H6, and Chery with its Tiggo 8, which immediately ranked among the best-selling models in 2023. Road transport electrification in Brazil could bring significant climate benefits given the largely low-emissions power mix, as well as reducing local air pollution. However, EV adoption has been slow thus far, given the national prioritisation of ethanol-based fuels since the late 1970s as a strategy to maintain energy security in the face of oil shocks. Today, biofuels are important alternative fuels available at competitive cost and aligned with the existing refuelling infrastructure. Brazil remains the world’s largest producer of sugar cane, and its agribusiness represents about one-fourth of GDP. At the end of 2023, Brazil launched the Green Mobility and Innovation Programme, which provides tax incentives for companies to develop and manufacture low-emissions road transport technology, aggregating to more than BRA 19 billion (Brazilian reals) (USD 3.8 billion) over the 2024-2028 period. Several major carmakers already in Brazil are developing hybrid ethanol-electric models as a result. China’s BYD and Great Wall are also planning to start domestic manufacturing, counting on local battery metal deposits, and plan to sell both fully electric and hybrid ethanol-electric models. BYD is investing over USD 600 million in its electric car plant in Brazil – its first outside Asia – for an annual capacity of 150 000 vehicles. BYD also partnered with Raízen to develop charging infrastructure in eight Brazilian cities starting in 2024. GM, on the other hand, plans to stop producing ICE (including ethanol) models and go fully electric, notably to produce for export markets. In 2024, Hyundai announced investments of USD 1.1 billion to 2032 to start local manufacturing of electric, hybrid and hydrogen cars.\nIn Mexico, electric car registrations were up 80% year-on-year to 15 000, a market share just above 1%. Given its proximity to the United States, Mexico’s automotive market is already well integrated with North American partners, and benefits from advantageous trade agreements, large existing manufacturing capacity, and eligibility for subsidies under the IRA. As a result, local EV supply chains are developing quickly, with expectations that this will spill over into domestic markets. Tesla, Ford, Stellantis, BMW, GM, Volkswagen (VW) and Audi have all either started manufacturing or announced plans to manufacture EVs in Mexico. Chinese carmakers such as BYD, Chery and SAIC are also considering expanding to Mexico. Elsewhere in the region, Colombia and Costa Rica are seeing increasing electric car sales, with around 6 000 and 5 000 in 2023, respectively, but sales remain limited in other Central and South American countries.\nThroughout Africa, Eurasia and the Middle East, electric cars are still rare, accounting for less than 1% of total car sales. However, as Chinese carmakers look for opportunities abroad, new models – including those produced domestically – could boost EV sales. For example, in Uzbekistan, BYD set up a joint venture with UzAuto Motors in 2023 to produce 50 000 electric cars annually, and Chery International established a partnership with ADM Jizzakh. This partnership has already led to a steep increase in electric car sales in Uzbekistan, reaching around 10 000 in 2023. In the Middle East, Jordan boasts the highest electric car sales share, at more than 45%, supported by much lower import duties relative to ICE cars, followed by the United Arab Emirates, with 13%.\nStrong electric car sales in the first quarter of 2024 surpass the annual total from just four years ago\nElectric car sales remained strong in the first quarter of 2024, surpassing those of the same period in 2023 by around 25% to reach more than 3 million. This growth rate was similar to the increase observed for the same period in 2023 compared to 2022. The majority of the additional sales came from China, which sold about half a million more electric cars than over the same period in 2023. In relative terms, the most substantial growth was observed outside of the major EV markets, where sales increased by over 50%, suggesting that the transition to electromobility is picking up in an increasing number of countries worldwide.\nQuarterly electric car sales by region, 2021-2024\nOpenFrom January to March of this year, nearly 1.9 million electric cars were sold in China, marking an almost 35% increase compared to sales in the first quarter of 2023. In March, NEV sales in China surpassed a share of 40% in overall car sales for the first time, according to retail sales reported by the China Passenger Car Association. As witnessed in 2023, sales of plug-in hybrid electric cars are growing faster than sales of pure battery electric cars. Plug-in hybrid electric car sales in the first quarter increased by around 75% year-on-year in China, compared to just 15% for battery electric car sales, though the former started from a lower base.\nIn Europe, the first quarter of 2024 saw year-on-year growth of over 5%, slightly above the growth in overall car sales and thereby stabilising the EV sales share at a similar level as last year. Electric car sales growth was particularly high in Belgium, where around 60 000 electric cars were sold, almost 35% more than the year before. However, Belgium represents less than 5% of total European car sales. In the major European markets – France, Germany, Italy and the United Kingdom (together representing about 60% of European car sales) – growth in electric car sales was lower. In France, overall EV sales in the first quarter grew by about 15%, with BEV sales growth being higher than for PHEVs. While this is less than half the rate as over the same period last year, total sales were nonetheless higher and led to a slight increase in the share of EVs in total car sales. The United Kingdom saw similar year-on-year growth (over 15%) in EV sales as France, about the same rate as over the same period last year. In Germany, where battery electric car subsidies ended in 2023, sales of electric cars fell by almost 5% in the first quarter of 2024, mainly as a result of a 20% year-on-year decrease in March. The share of EVs in total car sales was therefore slightly lower than last year. As in China, PHEV sales in both Germany and the United Kingdom were stronger than BEV sales. In Italy, sales of electric cars in the first three months of 2024 were more than 20% lower than over the same period in 2023, with the majority of the decrease taking place in the PHEV segment. However, this trend could be reversed based on the introduction of a new incentive scheme, and if Chinese automaker Chery succeeds in appealing to Italian consumers when it enters the market later this year.\nIn the United States, first-quarter sales reached around 350 000, almost 15% higher than over the same period the year before. As in other major markets, the sales growth of PHEVs was even higher, at 50%. While the BEV sales share in the United States appears to have fallen somewhat over the past few months, the sales share of PHEVs has grown.\nIn smaller EV markets, sales growth in the first months of 2024 was much higher, albeit from a low base. In January and February, electric car sales almost quadrupled in Brazil and increased more than sevenfold in Viet Nam. In India, sales increased more than 50% in the first quarter of 2024. These figures suggest that EVs are gaining momentum across diverse markets worldwide.\nSince 2021, first-quarter electric car sales have typically accounted for 15-20% of the total global annual sales. Based on this observed trend, coupled with policy momentum and the seasonality that EV sales typically experience, we estimate that electric car sales could reach around 17 million in 2024. This indicates robust growth for a maturing market, with 2024 sales to surpass those of 2023 by more than 20% and EVs to reach a share in total car sales of more than one-fifth.\nElectric car sales, 2012-2024\nOpenThe majority of the additional 3 million electric car sales projected for 2024 relative to 2023 are from China. Despite the phase-out of NEV purchase subsidies last year, sales in China have remained robust, indicating that the market is maturing. With strong competition and relatively low-cost electric cars, sales are to grow by almost 25% in 2024 compared to last year, reaching around 10 million. If confirmed, this figure will come close to the total global electric car sales in 2022. As a result, electric car sales could represent around 45% of total car sales in China over 2024.\nIn 2024, electric car sales in the United States are projected to rise by 20% compared to the previous year, translating to almost half a million more sales, relative to 2023. Despite reporting of a rocky end to 2023 for electric cars in the United States, sales shares are projected to remain robust in 2024. Over the entire year, around one in nine cars sold are expected to be electric.\nBased on recent trends, and considering that tightening CO2 targets are due to come in only in 2025, the growth in electric car sales in Europe is expected to be the lowest of the three largest markets. Sales are projected to reach around 3.5 million units in 2024, reflecting modest growth of less than 10% compared to the previous year. In the context of a generally weak outlook for passenger car sales, electric cars would still represent about one in four cars sold in Europe.\nOutside of the major EV markets, electric car sales are anticipated to reach the milestone of over 1 million units in 2024, marking a significant increase of over 40% compared to 2023. Recent trends showing the success of both homegrown and Chinese electric carmakers in Southeast Asia underscore that the region is set to make a strong contribution to the sales of emerging EV markets (see the section on Trends in the electric vehicle industry). Despite some uncertainty surrounding whether India’s forthcoming FAME III scheme will include subsidies for electric cars, we expect sales in India to remain robust, and to experience around 50% growth compared to 2023. Across all regions outside the three major EV markets, electric car sales are expected to represent around 5% of total car sales in 2024, which – considering the high growth rates seen in recent years – could indicate that a tipping point towards global mass adoption is getting closer.\nThere are of course downside risks to the 2024 outlook for electric car sales. Factors such as high interest rates and economic uncertainty could potentially reduce the growth of global electric car sales in 2024. Other challenges may come from the IRA restrictions on US electric car tax incentives, and the tightening of technical requirements for EVs to qualify for the purchase tax exemption in China. However, there are also upside potentials to consider. New markets may open up more rapidly than anticipated, as automakers expand their EV operations and new entrants compete for market share. This could lead to accelerated growth in electric car sales globally, surpassing the initial estimations.\nElectric car availability and affordability\nMore electric models are becoming available, but the trend is towards larger ones\nThe number of available electric car models nears 600, two-thirds of which are large vehicles and SUVs\nIn 2023, the number of available models for electric cars increased 15% year-on-year to nearly 590, as carmakers scaled up electrification plans, seeking to appeal to a growing consumer base. Meanwhile, the number of fully ICE models (i.e. excluding hybrids) declined for the fourth consecutive year, at an average of 2%. Based on recent original equipment manufacturer (OEM) announcements, the number of new electric car models could reach 1 000 by 2028. If all announced new electric models actually reach the market, and if the number of available ICE car models continues to decline by 2% annually, there could be as many electric as ICE car models before 2030.\nAs reported in GEVO-2023, the share of small and medium electric car models is decreasing among available electric models: in 2023, two-thirds of the battery-electric models on the market were SUVs,5 pick-up trucks or large cars. Just 25% of battery electric car sales in the United States were for small and medium models, compared to 40% in Europe and 50% in China. Electric cars are following the same trend as conventional cars, and getting bigger on average. In 2023, SUVs, pick-up trucks and large models accounted for 65% of total ICE car sales worldwide, and more than 80% in the United States, 60% in China and 50% in Europe.\nSeveral factors underpin the increase in the share of large models. Since the 2010s, conventional SUVs in the United States have benefited from less stringent tailpipe emissions rules than smaller models, creating an incentive for carmakers to market more vehicles in that segment. Similarly, in the European Union, CO2 targets for passenger cars have included a compromise on weight, allowing CO2 leeway for heavier vehicles in some cases. Larger vehicles also mean larger margins for carmakers. Given that incumbent carmakers are not yet making a profit on their EV offer in many cases, focusing on larger models enables them to increase their margins. Under the US IRA, electric SUVs can qualify for tax credits as long as they are priced under USD 80 000, whereas the limit stands at USD 55 000 for a sedan, creating an incentive to market SUVs if a greater margin can be gathered. On the demand side, there is now strong willingness to pay for SUVs or large models. Consumers are typically interested in longer-range and larger cars for their primary vehicles, even though small models are more suited to urban use. Higher marketing spend on SUVs compared to smaller models can also have an impact on consumer choices.\nThe progressive shift towards ICE SUVs has been dramatically limiting fuel savings. Over the 2010-2022 period, without the shift to SUVs, energy use per kilometre could have fallen at an average annual rate 30% higher than the actual rate. Switching to electric in the SUV and larger car segments can therefore achieve immediate and significant CO2 emissions reductions, and electrification also brings considerable benefits in terms of reducing air pollution and non-tailpipe emissions, especially in urban settings. In 2023, if all ICE and HEV sales of SUVs had instead been BEV, around 770 Mt CO2 could have been avoided globally over the cars’ lifetimes (see section 10 on lifecycle analysis). This is equivalent to the total road emissions of China in 2023.\nBreakdown of battery electric car sales in selected countries and regions by segment, 2018-2023\nOpenNevertheless, from a policy perspective, it is critical to mitigate the negative spillovers associated with an increase in larger electric cars in the fleet.\nLarger electric car models have a significant impact on battery supply chains and critical mineral demand. In 2023, the sales-weighted average battery electric SUV in Europe had a battery almost twice as large as the one in the average small electric car, with a proportionate impact on critical mineral needs. Of course, the range of small cars is typically shorter than SUVs and large cars (see later section on ranges). However, when comparing electric SUVs and medium-sized electric cars, which in 2023 offered a similar range, the SUV battery was still 25% larger. This means that if all electric SUVs sold in 2023 had instead been medium-sized cars, around 60 GWh of battery equivalent could have been avoided globally, with limited impact on range. Accounting for the different chemistries used in China, Europe, and the United States, this would be equivalent to almost 6 000 tonnes of lithium, 30 000 tonnes of nickel, almost 7 000 tonnes of cobalt, and over 8 000 tonnes of manganese.\nLarger batteries also require more power, or longer charging times. This can put pressure on electricity grids and charging infrastructure by increasing occupancy, which could create issues during peak utilisation, such as at highway charging points at high traffic times.\nIn addition, larger vehicles also require greater quantities of materials such as iron and steel, aluminium and plastics, with a higher environmental and carbon footprint for materials production, processing and assembly. Because they are heavier, larger models also have higher electricity consumption. The additional energy consumption resulting from the increased mass is mitigated by regenerative braking to some extent, but in 2022, the sales-weighted average electricity consumption of electric SUVs was 20% higher than that of other electric cars.6\nMajor carmakers have announced launches of smaller and more affordable electric car models over the past few years. However, when all launch announcements are considered, far fewer smaller models are expected than SUVs, large models and pick-up trucks. Only 25% of the 400+ launches expected over the 2024-2028 period are small and medium models, which represents a smaller share of available models than in 2023. Even in China, where small and medium models have been popular, new launches are typically for larger cars.\nNumber of available car models in 2023 and expected new ones by powertrain, country or region and segment, 2024-2028\nOpenSeveral governments have responded by introducing policies to create incentives for smaller and lighter passenger cars. In Norway, for example, all cars are subject to a purchase tax based on weight, CO2 and nitrogen oxides (NOx) emissions, though electric cars were exempt from the weight-based tax prior to 2023. Any imported cars weighing more than 500 kg must also pay an entry fee for each additional kg. In France, a progressive weight-based tax applies to ICE and PHEV cars weighing above 1 600 kg, with a significant impact on price: weight tax for a Land Rover Defender 130 (2 550 kg) adds up to more than EUR 21 500, versus zero for a Renault Clio (1 100 kg). Battery electric cars have been exempted to date. In February 2024, a referendum held in Paris resulted in a tripling of city parking fees for visiting SUVs, applicable to ICE, hybrid and plug-in hybrid cars above 1 600 kg and battery electric ones above 2 000 kg, in an effort to limit the use of large and/or polluting vehicles. Other examples exist in Estonia, Finland, Switzerland and the Netherlands. A number of policy options may be used, such as caps and fleet averages for vehicle footprint, weight, and/or battery size; access to finance for smaller vehicles; and sustained support for public charging, enabling wider use of shorter-range cars.\nAverage range is increasing, but only moderately\nConcerns about range compared to ICE vehicles, and about the availability of charging infrastructure for long-distance journeys, also contribute to increasing appetite for larger models with longer range.\nWith increasing battery size and improvements in battery technology and vehicle design, the sales-weighted average range of battery electric cars grew by nearly 75% between 2015 and 2023, although trends vary by segment. The average range of small cars in 2023 – around 150 km – is not much higher than it was in 2015, indicating that this range is already well suited for urban use (with the exception of taxis, which have much higher daily usage). Large, higher-end models already offered higher ranges than average in 2015, and their range has stagnated through 2023, averaging around 360-380 km. Meanwhile, significant improvements have been made for medium-sized cars and SUVs, the range of which now stands around 380 km, whereas it averaged around 150 km for medium cars and 270 km for SUVs in 2015. This is encouraging for consumers looking to purchase an electric car for longer journeys rather than urban use.\nSince 2020, growth in the average range of vehicles has been slower than over the 2015-2020 period. This could result from a number of factors, including fluctuating battery prices, carmakers’ attempts to limit additional costs as competition intensifies, and technical constraints (e.g. energy density, battery size). It could also reflect that beyond a certain range at which most driving needs are met, consumers’ willingness to pay for a marginal increase in battery size and range is limited. Looking forward, however, the average range could start increasing again as novel battery technologies mature and prices fall.\nMore affordable electric cars are needed to reach a mass-market tipping point\nAn equitable and inclusive transition to electric mobility, both within countries and at the global level, hinges on the successful launch of affordable EVs (including but not limited to electric cars). In this section, we use historic sales and price data for electric and ICE models around the world to examine the total cost of owning an electric car, price trends over time, and the remaining electric premium, by country and vehicle size.7 Specific models are used for illustration.\nTotal cost of ownership\nCar purchase decisions typically involve consideration of retail price and available subsidies as well as lifetime operating costs, such as fuel costs, insurance, maintenance and depreciation, which together make up the total cost of ownership (TCO). Reaching TCO parity between electric and ICE cars creates important financial incentives to make the switch. This section examines the different components of the TCO, by region and car size.\nIn 2023, upfront retail prices for electric cars were generally higher than for their ICE equivalents, which increased their TCO in relative terms. On the upside, higher fuel efficiency and lower maintenance costs enable fuel cost savings for electric cars, lowering their TCO. This is especially true in periods when fuel prices are high, in places where electricity prices are not too closely correlated to fossil fuel prices. Depreciation is also a major factor in determining TCO: As a car ages, it loses value, and depreciation for electric cars tends to be faster than for ICE equivalents, further increasing their TCO. Accelerated depreciation could, however, prove beneficial for the development of second-hand markets.\nHowever, the trend towards faster depreciation for electric vehicles might be reversed for multiple reasons. Firstly, consumers are gaining more confidence in electric battery lifetimes, thereby increasing the resale value of EVs. Secondly, strong demand and the positive brand image of some BEV models can mean they hold their value longer, as shown by Tesla models depreciating more slowly than the average petrol car in the United States. Finally, increasing fuel prices in some regions, the roll-out of low-emissions zones that restrict access for the most polluting vehicles, and taxes and parking fees specifically targeted at ICE vehicles could mean they experience faster depreciation rates than EVs in the future. In light of these two possible opposing depreciation trends, the same fixed annual depreciation rate for both BEVs and ICE vehicles has been applied in the following cost of ownership analysis.\nSubsidies help lower the TCO of electric cars relative to ICE equivalents in multiple ways. A purchase subsidy lowers the original retail price, thereby lowering capital depreciation over time, and a lower retail price implies lower financing costs through cumulative interest. Subsidies can significantly reduce the number of years required to reach TCO parity between electric and ICE equivalents. As of 2022, we estimate that TCO parity could be reached in most cases in under 7 years in the three major EV markets, with significant variations across different car sizes. In comparison, for models purchased at 2018 prices, TCO parity was much harder to achieve.\nIn Germany, for example, we estimate that the sales-weighted average price of a medium-sized battery electric car in 2022 was 10-20% more expensive than its ICE equivalent, but 10-20% cheaper in cumulative costs of ownership after 5 years, thanks to fuel and maintenance costs savings. In the case of an electric SUV, we estimate that the average annual operating cost savings would amount to USD 1 800 when compared to the equivalent conventional SUV over a period of 10 years. In the United States, despite lower fuel prices with respect to electricity, the higher average annual mileage results in savings that are close to Germany at USD 1 600 per year. In China, lower annual distance driven reduces fuel cost savings potential, but the very low price of electricity enables savings of about USD 1 000 per year.\nIn EMDEs, some electric cars can also be cheaper than ICE equivalents over their lifetime. This is true in India, for example, although it depends on the financing instrument. Access to finance is typically much more challenging in EMDEs due to higher interest rates and the more limited availability of cheap capital. Passenger cars have also a significantly lower market penetration in the first place, and many car purchases are made in second-hand markets. Later sections of this report look at markets for used electric cars, as well as the TCO for electric and conventional 2/3Ws in EMDEs, where they are far more widespread than cars as a means of road transport.\nUpfront retail price parity\nAchieving price parity between electric and ICE cars will be an important tipping point. Even when the TCO for electric cars is advantageous, the upfront retail price plays a decisive role, and mass-market consumers are typically more sensitive to price premiums than wealthier buyers. This holds true not only in emerging and developing economies, which have comparatively high costs of capital and comparatively low household and business incomes, but also in advanced economies. In the United States, for example, surveys suggest affordability was the top concern for consumers considering EV adoption in 2023. Other estimates show that even among SUV and pick-up truck consumers, only 50% would be willing to purchase one above USD 50 000.\nIn this section, we examine historic price trends for electric and ICE cars over the 2018-2022 period, by country and car size, and for best-selling models in 2023.\nElectric cars are generally getting cheaper as battery prices drop, competition intensifies, and carmakers achieve economies of scale. In most cases, however, they remain on average more expensive than ICE equivalents. In some cases, after adjusting for inflation, their price stagnated or even moderately increased between 2018 and 2022.\nLarger batteries for longer ranges increase car prices, and so too do the additional options, equipment, digital technology and luxury features that are often marketed on top of the base model. A disproportionate focus on larger, premium models is pushing up the average price, which – added to the lack of available models in second-hand markets (see below) – limits potential to reach mass-market consumers. Importantly, geopolitical tension, trade and supply chain disruptions, increasing battery prices in 2022 relative to 2021, and rising inflation, have also significantly affected the potential for further cost declines.\nCompetition can also play an important role in bringing down electric car prices. Intensifying competition leads carmakers to cut prices to the minimum profit margin they can sustain, and – if needed – to do so more quickly than battery and production costs decline. For example, between mid-2022 and early-2024, Tesla cut the price of its Model Y from between USD 65 000 and USD 70 000 to between USD 45 000 and USD 55 000 in the United States. Battery prices for such a model dropped by only USD 3 000 over the same period in the United States, suggesting that a profit margin may still be made at a lower price. Similarly, in China, the price of the Base Model Y dropped from CNY 320 000 (Yuan renminbi) (USD 47 000) to CNY 250 000 (USD 38 000), while the corresponding battery price fell by only USD 1 000. Conversely, in cases where electric models remain niche or aimed at wealthier, less price-sensitive early adopters, their price may not fall as quickly as battery prices, if carmakers can sustain greater margins.\nPrice gap between the sales-weighted average price of conventional and electric cars in selected countries, before subsidy, by size, in 2018 and 2022\nOpenChina\nIn China, where the sales share of electric cars has been high for several years, the sales-weighted average price of electric cars (before purchase subsidy) is already lower than that of ICE cars. This is true not only when looking at total sales, but also at the small cars segment, and is close for SUVs. After accounting for the EV exemption from the 10% vehicle purchase tax, electric SUVs were already on par with conventional ones in 2022, on average.\nElectric car prices have dropped significantly since 2018. We estimate that around 55% of the electric cars sold in China in 2022 were cheaper than their average ICE equivalent, up from under 10% in 2018. Given the further price declines between 2022 and 2023, we estimate that this share increased to around 65% in 2023. These encouraging trends suggest that price parity between electric and ICE cars could also be reached in other countries in certain segments by 2030, if the sales share of electric cars continues to grow, and if supporting infrastructure – such as for charging – is sustained.\nAs reported in detail in GEVO-2023, China remains a global exception in terms of available inexpensive electric models. Local carmakers already market nearly 50 small, affordable electric car models, many of which are priced under CNY 100 000 (USD 15 000). This is in the same range as best-selling small ICE cars in 2023, which cost from CNY 70 000 to CNY 100 000. In 2022, the best-selling electric car was SAIC’s small Wuling Hongguang Mini EV, which accounted for 10% of all BEV sales. It was priced around CNY 40 000, weighing under 700 kg for a 170-km range. In 2023, however, it was overtaken by Tesla models, among other larger models, as new consumers seek longer ranges and higher-end options and digital equipment.\nUnited States\nIn the United States, the sales-weighted average price of electric cars decreased over the 2018-2022 period, primarily driven by a considerable drop in the price of Tesla cars, which account for a significant share of sales. The sales-weighted average retail price of electric SUVs fell slightly more quickly than the average SUV battery costs over the same period. The average price of small and medium models also decreased, albeit to a smaller extent.\nAcross all segments, electric models remained more expensive than conventional equivalents in 2022. However, the gap has since begun to close, as market size increases and competition leads carmakers to cut prices. For example, in 2023-2024, Tesla’s Model 3 could be found in the USD 39 000 to USD 42 000 range, which is comparable to the average price for new ICE cars, and a new Model Y priced under USD 50 000 was launched. Rivian is expecting to launch its R2 SUV in 2026 at USD 45 000, which is much less than previous vehicles. Average price parity between electric and conventional SUVs could be reached by 2030, but it may only be reached later for small and medium cars, given their lower availability and popularity.\nSmaller, cheaper electric models have further to go to reach price parity in the United States. We estimate that in 2022, only about 5% of the electric cars sold in the United States were cheaper than their average ICE equivalent. In 2023, the cheapest electric cars were priced around USD 30 000 (e.g. Chevrolet Bolt, Nissan Leaf, Mini Cooper SE). To compare, best-selling small ICE options cost under USD 20 000 (e.g. Kia Rio, Mitsubishi Mirage), and many best-selling medium ICE options between USD 20 000 and USD 25 000 (e.g. Honda Civic, Toyota Corolla, Kia Forte, Hyundai Avante, Nissan Sentra).\nAround 25 new all-electric car models are expected in 2024, but only 5 of them are expected below USD 50 000, and none under the USD 30 000 mark. Considering all the electric models expected to be available in 2024, about 75% are priced above USD 50 000, and fewer than 10 under USD 40 000, even after taking into account the USD 7 500 tax credit under the IRA for eligible cars as of February 2024. This means that despite the tax credit, few electric car models directly compete with small mass-market ICE models.\nIn December 2023, GM stopped production of its best-selling electric car, the Bolt, announcing it would introduce a new version in 2025. The Nissan Leaf (40 kWh) therefore remains the cheapest available electric car in 2024, at just under USD 30 000, but is not yet eligible for IRA tax credits. Ford announced in 2024 that it would move away from large and expensive electric cars as a way to convince more consumers to switch to electric, at the same time as increasing output of ICE models to help finance a transition to electric mobility. In 2024, Tesla announced it would start producing a next-generation, compact and affordable electric car in June 2025, but the company had already announced in 2020 that it would deliver a USD 25 000 model within 3 years. Some micro urban electric cars are already available between USD 5 000 and USD 20 000 (e.g. Arcimoto FUV, Nimbus One), but they are rare. In theory, such models could cover many use cases, since 80% of car journeys in the United States are under 10 miles.\nEurope\nPricing trends differ across European countries, and typically vary by segment.\nIn Norway, after taking into account the EV sales tax exemption, electric cars are already cheaper than ICE equivalents across all segments. In 2022, we estimate that the electric premium stood around -15%, and even -30% for medium-sized cars. Five years earlier, in 2018, the overall electric premium was less advantageous, at around -5%. The progressive reintroduction of sales taxes on electric cars may change these estimates for 2023 onwards.\nGermany’s electric premium ranks among the lowest in the European Union. Although the sales-weighted average electric premium increased slightly between 2018 and 2022, it stood at 15% in 2022. It is particularly low for medium-sized cars (10-15%) and SUVs (20%), but remains higher than 50% for small models. In the case of medium cars, the sales-weighted average electric premium was as low as EUR 5 000 in 2022. We estimate that in 2022, over 40% of the medium electric cars sold in Germany were cheaper than their average ICE equivalent. Looking at total sales, over 25% of the electric cars sold in 2022 were cheaper than their average ICE equivalent. In 2023, the cheapest models among the best-selling medium electric cars were priced between EUR 22 000 and EUR 35 000 (e.g. MG MG4, Dacia Spring, Renault Megane), far cheaper than the three front-runners priced above EUR 45 000 (VW ID.3, Cupra Born, and Tesla Model 3). To compare, best-selling ICE cars in the medium segment were also priced between EUR 30 000 and EUR 45 000 (e.g. VW Golf, VW Passat Santana, Skoda Octavia Laura, Audi A3, Audi A4). At the end of 2023, Germany phased out its subsidy for electric car purchases, but competition and falling model prices could compensate for this.\nIn France, the sales-weighted average electric premium stagnated between 2018 and 2022. The average price of ICE cars also increased over the same period, though more moderately than that of electric models. Despite a drop in the price of electric SUVs, which stood at a 30% premium over ICE equivalents in 2022, the former do not account for a high enough share of total electric car sales to drive down the overall average. The electric premium for small and medium cars remains around 40-50%.\nThese trends mirror those of some of the best-selling models. For example, when adjusting prices for inflation, the small Renault Zoe was sold at the same price on average in 2022-2023 as in 2018-2019, or EUR 30 000 (USD 32 000). It could be found for sale at as low as EUR 25 000 in 2015-2016. The earlier models, in 2015, had a battery size of around 20 kWh, which increased to around 40 kWh in 2018‑2019 and 50 kWh in newer models in 2022-2023. Yet European battery prices fell more quickly than the battery size increased over the same period, indicating that battery size alone does not explain car price dynamics.\nIn 2023, the cheapest electric cars in France were priced between EUR 22 000 and EUR 30 000 (e.g. Dacia Spring, Renault Twingo E-Tech, Smart EQ Fortwo), while best-selling small ICE models were available between EUR 10 000 and EUR 20 000 (e.g. Renault Clio, Peugeot 208, Citroën C3, Dacia Sandero, Opel Corsa, Skoda Fabia). Since mid-2024, subsidies of up to EUR 4 000 can be granted for electric cars priced under EUR 47 000, with an additional subsidy of up to EUR 3 000 for lower-income households.\nIn the United Kingdom, the sales-weighted average electric premium shrank between 2018 and 2022, thanks to a drop in prices for electric SUVs, as in the United States. Nonetheless, electric SUVs still stood at a 45% premium over ICE equivalents in 2022, which is similar to the premium for small models but far higher than for medium cars (20%).\nIn 2023, the cheapest electric cars in the United Kingdom were priced from GBP 27 000 to GBP 30 000 (USD 33 000 to 37 000) (e.g. MG MG4, Fiat 500, Nissan Leaf, Renault Zoe), with the exception of the Smart EQ Fortwo, priced at GBP 21 000. To compare, best-selling small ICE options could be found from GBP 10 000 to 17 000 (e.g. Peugeot 208, Fiat 500, Dacia Sandero) and medium options below GBP 25 000 (e.g. Ford Puma). Since July 2022, there has been no subsidy for the purchase of electric passenger cars.\nElsewhere in Europe, electric cars remain typically much more expensive than ICE equivalents. In Poland, for example, just a few electric car models could be found at prices competitive with ICE cars in 2023, under the PLN 150 000 (Polish zloty) (EUR 35 000) mark. Over 70% of electric car sales in 2023 were for SUVs, or large or more luxurious models, compared to less than 60% for ICE cars.\nIn 2023, there were several announcements by European OEMs for smaller models priced under EUR 25 000 in the near-term (e.g. Renault R5, Citroën e-C3, Fiat e-Panda, VW ID.2all). There is also some appetite for urban microcars (i.e. L6-L7 category), learning from the success of China’s Wuling. Miniature models bring important benefits if they displace conventional models, helping reduce battery and critical mineral demand. Their prices are often below USD 5 000 (e.g. Microlino, Fiat Topolino, Citroën Ami, Silence S04, Birò B2211).\nIn Europe and the United States, electric car prices are expected to come down as a result of falling battery prices, more efficient manufacturing, and competition. Independent analyses suggest that price parity between some electric and ICE car models in certain segments could be reached over the 2025-2028 period, for example for small electric cars in Europe in 2025 or soon after. However, many market variables could delay price parity, such as volatile commodity prices, supply chain bottlenecks, and the ability of carmakers to yield sufficient margins from cheaper electric models. The typical rule in which economies of scale bring down costs is being complicated by numerous other market forces. These include a dynamic regulatory context, geopolitical competition, domestic content incentives, and a continually evolving technology landscape, with competing battery chemistries that each have their own economies of scale and regional specificities.\nJapan\nJapan is a rare example of an advanced economy where small models – both for electric and ICE vehicles – appeal to a large consumer base, motivated by densely populated cities with limited parking space, and policy support. In 2023, about 60% of total ICE sales were for small models, and over half of total electric sales. Two electric cars from the smallest “Kei” category, the Nissan Sakura and Mitsubishi eK-X, accounted for nearly 50% of national electric car sales alone, and both are priced between JPY 2.3 million (Japanese yen) and JPY 3 million (USD 18 000 to USD 23 000). However, this is still more expensive than best-selling small ICE cars (e.g. Honda N Box, Daihatsu Hijet, Daihatsu Tanto, Suzuki Spacia, Daihatsu Move), priced between USD 13 000 and USD 18 000. In 2024, Nissan announced that it would aim to reach cost parity (of production, not retail price) between electric and ICE cars by 2030.\nEmerging market and developing economies\nIn EMDEs, the absence of small and cheaper electric car models is a significant hindrance to wider market uptake. Many of the available car models are SUVs or large models, targeting consumers of high-end goods, and far too expensive for mass-market consumers, who often do not own a personal car in the first place (see later sections on second-hand car markets and 2/3Ws).\nIn India, while Tata’s small Tiago/Tigor models, which are priced between USD 10 000 and USD 15 000, accounted for about 20% of total electric car sales in 2023, the average best-selling small ICE car is priced around USD 7 000. Large models and SUVs accounted for over 65% of total electric car sales. While BYD announced in 2023 the goal of accounting for 40% of India’s EV market by 2030, all of its models available in India cost more than INR 3 million (Indian rupees) (USD 37 000), including the Seal, launched in 2024 for INR 4.1 million (USD 50 000).\nSimilarly, SUVs and large models accounted for the majority share of electric car sales in Thailand (60%), Indonesia (55%), Malaysia (over 85%) and Viet Nam (over 95%). In Indonesia, for example, Hyundai’s Ionic 5 was the most popular electric car in 2023, priced at around USD 50 000. Looking at launch announcements, most new models expected over the 2024-2028 period in EMDEs are SUVs or large models. However, more than 50 small and medium models could also be introduced, and the recent or forthcoming entry of Chinese carmakers suggests that cheaper models could hit the market in the coming years.\nIn 2022-2023, Chinese carmakers accounted for 40-75% of the electric car sales in Indonesia, Thailand and Brazil, with sales jumping as cheaper Chinese models were introduced. In Thailand, for example, Hozon launched its Neta V model in 2022 priced at THB 550 000 (Thai baht) (USD 15 600), which became a best-seller in 2023 given its relative affordability compared with the cheapest ICE equivalents at around USD 9 000. Similarly, in Indonesia, the market entry of Wuling’s Air EV in 2022-2023 was met with great success. In Colombia, the best-selling electric car in 2023 was the Chinese mini-car, Zhidou 2DS, which could be found at around USD 15 000, a competitive option relative to the country’s cheapest ICE car, the Kia Picanto, at USD 13 000.\nElectric car sales in selected countries, by origin of carmaker, 2021-2023\nOpenSecond-hand markets for electric cars are on the rise\nAs electric vehicle markets mature, the second-hand market will become more important\nIn the same way as for other technology products, second-hand markets for used electric cars are now emerging as newer generations of vehicles progressively become available and earlier adopters switch or upgrade. Second-hand markets are critical to foster mass-market adoption, especially if new electric cars remain expensive, and used ones become cheaper. Just as for ICE vehicles – for which buying second-hand is often the primary method of acquiring a car in both emerging and advanced economies – a similar pattern will emerge with electric vehicles. It is estimated that eight out of ten EU citizens buy their car second-hand, and this share is even higher – around 90% – among low- and middle-income groups. Similarly, in the United States, about seven out of ten vehicles sold are second-hand, and only 17% of lower-income households buy a new car.\nAs major electric car markets reach maturity, more and more used electric cars are becoming available for resale. Our estimates suggest that in 2023, the market size for used electric cars amounted to nearly 800 000 in China, 400 000 in the United States and more than 450 000 for France, Germany, Italy, Spain, the Netherlands and the United Kingdom combined. Second-hand sales have not been included in the numbers presented in the previous section of this report, which focused on sales of new electric cars, but they are already significant. On aggregate, global second-hand electric car sales were roughly equal to new electric car sales in the United States in 2023. In the United States, used electric car sales are set to increase by 40% in 2024 relative to 2023. Of course, these volumes are dwarfed by second-hand ICE markets: 30 million in the European countries listed above combined, nearly 20 million in China, and 36 million in the United States. However, these markets have had decades to mature, indicating greater longer-term potential for used electric car markets.\nUsed car markets already provide more affordable electric options in China, Europe and the United States\nSecond-hand car markets are increasingly becoming a source of more affordable electric cars that can compete with used ICE equivalents. In the United States, for example, more than half of second-hand electric cars are already priced below USD 30 000. Moreover, the average price is expected to quickly fall towards USD 25 000, the price at which used electric cars become eligible for the federal used car rebate of USD 4 000, making them directly competitive with best-selling new and used ICE options. The price of a second-hand Tesla in the United States dropped from over USD 50 000 in early 2023 to just above USD 33 000 in early 2024, making it competitive with a second-hand SUV and many new models as well (either electric or conventional). In Europe, second-hand battery electric cars can be found between EUR 15 000 and EUR 25 000 (USD 16 000‑27 000), and second-hand plug-in hybrids around EUR 30 000 (USD 32 000). Some European countries also offer subsidies for second-hand electric cars, such as the Netherlands (EUR 2 000), where the subsidy for new cars has been steadily declining since 2020, while that for used cars remains constant, and France (EUR 1 000). In China, used electric cars were priced around CNY 75 000 on average in 2023 (USD 11 000).\nIn recent years, the resale value8 of electric cars has been increasing. In Europe, the resale value of battery electric cars sold after 12 months has steadily increased over the 2017-2022 period, surpassing that of all other powertrains and standing at more than 70% in mid-2022. The resale value of battery electric cars sold after 36 months stood below 40% in 2017, but has since been closing the gap with other powertrains, reaching around 55% in mid-2022. This is the result of many factors, including higher prices of new electric cars, improving technology allowing vehicles and batteries to retain greater value over time, and increasing demand for second-hand electric cars. Similar trends have been observed in China.\nHigh or low resale values have important implications for the development of second-hand electric car markets and their contributions to the transition to road transport electrification. High resale values primarily benefit consumers of new cars (who retain more of the value of their initial purchase), and carmakers, because many consumers are attracted by the possibility of reselling their car after a few years, thereby fostering demand for newer models. High resale values also benefit leasing companies, which seek to minimise depreciation and resell after a few years.\nLeasing companies have a significant impact on second-hand markets because they own large volumes of vehicles for a shorter period (under three years, compared to 3 to 5 years for a private household). Their impact on markets for new cars can also be considerable: leasing companies accounted for over 20% of new cars sold in Europe in 2022.\nOverall, a resale value for electric cars on par with or higher than that of ICE equivalents contributes to supporting demand for new electric cars. In the near term, however, a combination of high prices for new electric cars and high resale values could hinder widespread adoption of used EVs among mass-market consumers seeking affordable cars. In such cases, policy support can help bridge the gap with second-hand ICE prices.\nInternational trade for used electric cars to emerging markets is expected to increase\nAs the EV stock ages in advanced markets, it is likely that more and more used EVs will be traded internationally, assuming that global standards enable technology compatibility (e.g. for charging infrastructure). Imported used vehicles present an opportunity for consumers in EMDEs, who may not have access to new models because they are either too expensive or not marketed in their countries.\nData on used car trade flows are scattered and often contradictory, but the history of ICE cars can be a useful guide to what may happen for electric cars. Many EMDEs have been importing used ICE vehicles for decades. UNEP estimates that Africa imports 40% of all used vehicles exported worldwide, with African countries typically becoming the ultimate destination for used imports. Typical trade flows include Western European Union member states to Eastern European Union member states and to African countries that drive on the right-hand side; Japan to Asia and to African countries that drive on the left-hand side; and the United States to the Middle East and Central America.\nUsed electric car exports from large EV markets have been growing in recent years. For China, this can be explained by the recent roll-back of a policy forbidding exports of used vehicles of any kind. Since 2019, as part of a pilot project, the government has granted 27 cities and provinces the right to export second-hand cars. In 2022, China exported almost 70 000 used vehicles, a significant increase on 2021, when fewer than 20 000 vehicles were exported. About 70% of these were NEVs, of which over 45% were exported to the Middle East. In 2023, the Ministry of Commerce released a draft policy on second-hand vehicle export that, once approved, will allow the export of second-hand vehicles from all regions of China. Used car exports from China are expected to increase significantly as a result.\nIn the European Union, the number of used electric cars traded internationally is also increasing. In both 2021 and 2022, the market size grew by 70% year-on-year, reaching almost 120 000 electric cars in 2022. More than half of all trade takes place between EU member states, followed by trade with neighbouring countries such as Norway, the United Kingdom and Türkiye (accounting for 20% combined). The remainder of used EVs are exported to countries such as Mexico, Tunisia and the United States. As of 2023, the largest exporters are Belgium, Germany, the Netherlands, and Spain.\nLast year, just over 1% of all used cars leaving Japan were electric. However these exports are growing and increased by 30% in 2023 relative to 2022, reaching 20 000 cars. The major second-hand electric car markets for Japanese vehicles are traditionally Russia and New Zealand (over 60% combined). After Russia’s invasion of Ukraine in 2022, second-hand trade of conventional cars from Japan to Russia jumped sharply following a halt in operations of local OEMs in Russia, but this trade was quickly restricted by the Japanese government, thereby bringing down the price of second-hand cars in Japan. New Zealand has very few local vehicle assembly or manufacturing facilities, and for this reason many cars entering New Zealand are used imports. In 2023, nearly 20% of all electric cars that entered New Zealand were used imports, compared to 50% for the overall car market.\nIn emerging economies, local policies play an important role in promoting or limiting trade flows for used cars. In the case of ICE vehicles, for example, some countries (e.g. Bolivia, Côte d’Ivoire, Peru) limit the maximum age of used car imports to prevent the dumping of highly polluting cars. Other countries (e.g. Brazil, Colombia, Egypt, India, South Africa) have banned used car imports entirely to protect their domestic manufacturing industries.\nJust as for ICE vehicles, policy measures can either help or hinder the import of used electric cars, such as by setting emission standards for imported used cars. Importing countries will also need to simultaneously support roll-out of charging infrastructure to avoid problems with access like those reported in Sri Lanka after an incentive scheme significantly increased imports of used EVs in 2018.\nThe median age of vehicle imports tends to increase as the GDP per capita of a country decreases. In some African countries, the median age of imports is over 15 years. Beyond this timeframe, electric cars may require specific servicing to extend their lifetime. To support the availability of second-hand markets for electric cars, it will be important to develop strategies, technical capacity, and business models to swap very old batteries from used vehicles. Today, many countries that import ICE vehicles, including EMDEs, already have servicing capacity in place to extend the lifetimes of used ICE vehicles, but not used EVs. On the other hand, there are typically fewer parts in electric powertrains than in ICE ones, and these parts can even be more durable. Battery recycling capacity will also be needed, given that the importing country is likely to be where the imported EV eventually reaches end-of-life. Including end-of-life considerations in policy making today can help mitigate the risk of longer-term environmental harm that could result from the accumulation of obsolete EVs and associated waste in EMDEs.\nPolicy choices in more mature markets also have an impact on possible trade flows. For example, the current policy framework in the European Union for the circularity of EV batteries may prevent EVs and EV batteries from leaving the European Union, which brings energy security advantages but might limit reuse. In this regard, advanced economies and EMDEs should strengthen co-operation to facilitate second-hand trade while ensuring adequate end-of-life strategies. For example, there could be incentives or allowances associated with extended vehicle lifetimes via use in second-hand markets internationally before recycling, as long as recycling in the destination market is guaranteed, or the EV battery is returned at end of life.\nReferences\nThroughout this report, unless otherwise specified, “electric cars” refers to both battery electric and plug-in hybrid cars, and “electric vehicles” (EVs) refers to battery electric (BEV) and plug-in hybrid (PHEV) vehicles, excluding fuel cell electric vehicles (FCEV). Unless otherwise specified, EVs include all modes of road transport.\nThroughout this report, unless otherwise specified, regional groupings refer to those described in the Annex.\nIn the Chinese context, the term New Energy Vehicles (NEVs) includes BEVs, PHEVs and FCEVs.\nBased on model trim eligibility from the US government website as of 31 March 2024.\nSUVs may be defined differently across regions, but broadly refer to vehicles that incorporate features commonly found in off-road vehicles (e.g. four-wheel drive, higher ground clearance, larger cargo area). In this report, small and large SUVs both count as SUVs. Crossovers are counted as SUVs if they feature an SUV body type; otherwise they are categorised as medium-sized vehicles.\nMeasured under the Worldwide Harmonised Light Vehicles Test Procedure using vehicle model sales data from IHS Markit.\nPrice data points collected from various data providers and ad-hoc sources cover 65-95% of both electric and ICE car sales globally. By “price”, we refer to the advertised price that the customer pays for the acquisition of the vehicle only, including legally required acquisition taxes (e.g. including Value-Added Tax and registration taxes but excluding consumer tax credits). Prices reflect not only the materials, components and manufacturing costs, but also the costs related to sales and marketing, administration, R&D and the profit margin. In the case of a small electric car in Europe, for example, these mark-up costs can account for around 40% of the final pre-tax price. They account for an even greater share of the final pre-tax price when consumers purchase additional options, or opt for larger models, for which margins can be higher. The price for the same model may differ across countries or regions (e.g. in 2023, a VW ID.3 could be purchased in China at half its price in Europe). Throughout the whole section, prices are adjusted for inflation and expressed in constant 2022 USD.\nThis metric of depreciation used in second-hand technology markets represents the value of the vehicle when being resold in relation to the value when originally purchased. A resale value of 70% means that a product purchased new will lose 30% of its original value, on average, and sell at such a discount relative to the original price.\nReference 1\nThroughout this report, unless otherwise specified, “electric cars” refers to both battery electric and plug-in hybrid cars, and “electric vehicles” (EVs) refers to battery electric (BEV) and plug-in hybrid (PHEV) vehicles, excluding fuel cell electric vehicles (FCEV). Unless otherwise specified, EVs include all modes of road transport.\nReference 2\nThroughout this report, unless otherwise specified, regional groupings refer to those described in the Annex.\nReference 3\nIn the Chinese context, the term New Energy Vehicles (NEVs) includes BEVs, PHEVs and FCEVs.\nReference 4\nBased on model trim eligibility from the US government website as of 31 March 2024.\nReference 5\nSUVs may be defined differently across regions, but broadly refer to vehicles that incorporate features commonly found in off-road vehicles (e.g. four-wheel drive, higher ground clearance, larger cargo area). In this report, small and large SUVs both count as SUVs. Crossovers are counted as SUVs if they feature an SUV body type; otherwise they are categorised as medium-sized vehicles.\nReference 6\nMeasured under the Worldwide Harmonised Light Vehicles Test Procedure using vehicle model sales data from IHS Markit.\nReference 7\nPrice data points collected from various data providers and ad-hoc sources cover 65-95% of both electric and ICE car sales globally. By “price”, we refer to the advertised price that the customer pays for the acquisition of the vehicle only, including legally required acquisition taxes (e.g. including Value-Added Tax and registration taxes but excluding consumer tax credits). Prices reflect not only the materials, components and manufacturing costs, but also the costs related to sales and marketing, administration, R&D and the profit margin. In the case of a small electric car in Europe, for example, these mark-up costs can account for around 40% of the final pre-tax price. They account for an even greater share of the final pre-tax price when consumers purchase additional options, or opt for larger models, for which margins can be higher. The price for the same model may differ across countries or regions (e.g. in 2023, a VW ID.3 could be purchased in China at half its price in Europe). Throughout the whole section, prices are adjusted for inflation and expressed in constant 2022 USD.\nReference 8\nThis metric of depreciation used in second-hand technology markets represents the value of the vehicle when being resold in relation to the value when originally purchased. A resale value of 70% means that a product purchased new will lose 30% of its original value, on average, and sell at such a discount relative to the original price."
    },
    {
      "url": "https://theconversation.com/profiles/alan-jenn-1329525",
      "text": "Alan Jenn is an associate professor in the Civil and Environmental Engineering department at the University of California Davis. He is also an active researcher with the Institute of Transportation Studies as part of both the Electric Vehicle Research Center and the Energy Futures Center. He graduated from Carnegie Mellon University with a PhD in the department of Engineering and Public Policy (EPP) and has undergraduate degrees in Molecular and Cell Biology, Music, and Energy and Resources from the University of California, Berkeley.\nDr. Alan Jenn's research at the University of California, Davis, primarily focuses on the intersection of energy and transportation, with a special emphasis on electric vehicles (EVs) and their integration with the energy grid. His work critically evaluates the lifecycle emissions of EVs, considering factors like electricity generation and vehicle usage patterns. A significant portion of his research is dedicated to the strategic deployment of EV charging infrastructure, addressing challenges in urban planning and grid capacity. Additionally, Dr. Jenn explores the potential of hydrogen as an energy carrier for future transportation systems, examining the economics and logistics of hydrogen supply chains. His contributions also extend to innovations in transportation finance and the role of EVs in new mobility services. Dr. Jenn's interdisciplinary approach, combining engineering, policy, and economics, has been instrumental in shaping sustainable transportation strategies and informing policy discussions."
    },
    {
      "url": "https://ww2.arb.ca.gov/our-work/programs/advanced-clean-cars-program/advanced-clean-cars-ii",
      "text": "Advanced Clean Cars II\nContact\nLatest Update - Amendments to Advanced Clean Cars II\nIn October 2023, staff launched a new effort to consider potential amendments to the Advanced Clean Cars II regulations, including updates to the tailpipe greenhouse gas emission standard and limited revisions to the Low-emission Vehicle and Zero-emission Vehicle regulations. Visit Meetings and Workshops to learn about the latest workshops and meetings.\nCalifornia is Taking Your Ride to Zero Emissions\nBy 2035 all new passenger cars, trucks and SUVs sold in California will be zero emissions. The Advanced Clean Cars II regulations take the state’s already growing zero-emission vehicle market and robust motor vehicle emission control rules and augments them to meet more aggressive tailpipe emissions standards and ramp up to 100% zero-emission vehicles. View the Official Rulemaking Documents. Read our Frequently Asked Questions to learn more about Advanced Clean Cars II and zero-emission vehicles.\nRegulations\nThe Advanced Clean Cars II regulations will rapidly scale down light-duty passenger car, pickup truck and SUV emissions starting with the 2026 model year through 2035.\nThe regulations are two-pronged. First, it amends the Zero-emission Vehicle Regulation to require an increasing number of zero-emission vehicles, and relies on currently available advanced vehicle technologies, including battery-electric, hydrogen fuel cell electric and plug-in hybrid electric-vehicles, to meet air quality and climate change emissions standards. These amendments support Governor Newsom’s 2020 Executive Order N-79-20 that requires all new passenger vehicles sold in California to be zero emissions by 2035. Second, the Low-emission Vehicle Regulations were amended to include increasingly stringent standards for gasoline cars and heavier passenger trucks to continue to reduce smog-forming emissions.\nCalifornia enjoys the largest zero-emission vehicle market in the nation. To see the latest electric vehicle market share in CA, see the market share graphic as part of the Veloz Electric Vehicle Market Report.\nThe regulations will substantially reduce air pollutants that threaten public health and cause climate change. While further developing the zero-emission vehicle market, the regulations also take additional steps to clean up internal combustion engines and will provide public health benefits of at least $12 billion over the life of the regulations by reducing premature deaths, hospitalizations and lost workdays associated with exposure to air pollution.\nEnvironmental Justice and Equity\nThe impacts of climate change and air pollution affect all Californians, but residents in frontline communities are especially vulnerable and often face the most severe impacts. In developing the Advanced Clean Cars II regulations, staff met with national, state, and local advocacy organizations to learn more about the recommendations these groups had regarding staff’s proposals and how zero-emission transportation could be made more equitable. Staff’s approach to environmental justice and equity in Advanced Clean Cars II was multi-faceted and drew on stakeholder recommendations and staff’s own analysis.\nFirst and foremost, by increasing the number of zero-emission vehicles on the road and continuing to clean up conventional internal combustion vehicles, the regulations will reduce exposure to vehicle pollution in communities throughout California, including in frontline communities that are disproportionately exposed to vehicular pollution.\nIn addition, the zero-emission vehicle assurance measures, such as minimum warranty and durability requirements, increased serviceability, and facilitate charging and battery labeling, will help ensure all consumers can successfully replace their higher polluting vehicles with new or used vehicles that meet their needs for transportation and protect the emission benefits of the program. These measures are particularly important for consumers in lower-income and underserved communities where used vehicle sales are significant. Giving consumers additional assurance that their used zero-emission vehicle purchase meets minimum requirements is key for broader market uptake.\nFinally, the regulations offer automakers additional compliance opportunities for actions to improve access to zero-emission vehicles in overburdened and lower-income communities, such as providing reduced price zero-emission vehicles for community mobility programs, producing affordable zero-emission vehicles, and retaining used vehicles in California to support the state’s complimentary policies and incentives.\nIncentive Programs and Savings for Consumers\nA suite of incentive programs is available for consumers who want to make the switch to zero-emission vehicles or use other modes of clean transportation. Incentives are developed by the California Air Resources Board and include rebates for new and used clean cars, and funding for charging options, and alternatives to owning a car, such as car sharing and ride hailing. The regulations are backed by Governor Newsom’s $2.4 billion dollar investment in vehicle incentives, charging infrastructure and public outreach. Incentives can also be available through your local electric utility, local government agencies or other entities. Learn more about these cars and the available incentives at:\nZero-emission vehicle buyers are likely to realize as much as $7,500 in maintenance and operational savings over the first 10 years of ownership. It is estimated that automakers will offer roughly 180 zero-emission and plug-in hybrid-electric vehicle models by 2025, making it easier than ever for consumers to find a clean vehicle that fits their daily needs and lifestyle.\nMany Other States Follow California’s Automotive Emissions Regulations\nTo date, 17 states have adopted all or part of California’s low-emission and zero-emission vehicle regulations, as allowed under Section 177 of the Clean Air Act. This additional support for the clean vehicle market means that more than 35% of national new light-duty vehicle sales meet California automotive emissions standards.\nBackground\nSince the 1960s the California Air Resources Board has been ratcheting down motor vehicle emissions to cut smog and protect public health and the environment. Today California faces a crisis driven by climate change — catastrophic weather, extreme and prolonged drought, sea level rise and wildfires — that require immediate and bold action. Protection of the most vulnerable in our society, particularly those who are overburdened by air pollution and the impacts of climate change, is a top priority.\nThe transportation sector, including all passenger cars and light trucks, heavy-duty trucks, off-road vehicles, and the fuels needed to power them, is responsible for half of California’s greenhouse gas emissions. It is also responsible for 80% of smog-causing pollutants and is a significant source of toxic air contaminants that directly impact community health, the environment and the economy.\nResources\n- Formal rulemaking documents\n- Advanced Clean Cars II and Zero-Emission Vehicles Frequently Asked Questions\n- Event materials from the rulemaking including slides presentations and recordings\nIf you wish to receive information regarding Advanced Clean Cars, please subscribe to the Advanced Clean Cars listserv."
    },
    {
      "url": "https://www.ucs.org/resources/brief-history-us-fuel-efficiency",
      "text": "Table of Contents\nInvesting in technologies that increase the fuel economy of America's vehicle fleet will create domestic jobs, save consumers money at the pump, cut global warming pollution, and put us on a path to cut projected US oil consumption in half over the next 20 years. Increasing fuel economy—a measure of how far one travels on a gallon of fuel (mpg)—is not a silver bullet. Yet, sound fuel economy policy and good engineering can deliver the cleaner and more fuel-efficient cars, trucks, and SUVs we need to help tackle our oil consumption and climate change problems.\nHistory of US fuel economy standards\nCongress first established Corporate Average Fuel Economy (CAFE) standards in 1975, largely in response to the 1973 oil embargo. CAFE standards set the average new vehicle fuel economy, as weighted by sales, that a manufacturer's fleet must achieve.\nThrough the Energy Policy and Conservation Act of 1975, Congress established fuel economy standards for new passenger cars starting with model year (MY) 1978. These standards were intended to roughly double the average fuel economy of the new car fleet to 27.5 mpg by model year (MY) 1985.\nAdditionally, the Department of Transportation set the first round of CAFE standards for light trucks (i.e., pickups, minivans, and SUVs) beginning with MY 1978. CAFE standards for light trucks were increased to 22.2 mpg for MY 2007 and scheduled to increase further. No similar increases were made for passenger cars until 2007, when historic energy legislation was passed by Congress and signed by the President. This new energy legislation, the Energy Independence and Security Act of 2007, raised the fuel economy standards of America's cars, light trucks, and SUVs to a combined average of at least 35 miles per gallon by 2020—a 10 mpg increase over 2007 levels—and required standards to be met at maximum feasible levels through 2030.\nFederal law directing increases in fuel economy became necessary because oil consumption had been steadily escalating, in large part due to the relative stagnation in CAFE standards, the doubling of annual vehicle miles traveled in the previous 25 years, and a sizable increase in the market share of less efficient SUVs and light trucks.\nIn 2009, a historic agreement between the Federal Government, state regulators, and the auto industry established a national program to implement these first meaningful fuel efficiency improvements in over 30 years and the first-ever global warming pollution standards for light-duty vehicles.\nThe agreement grew out of the new fuel efficiency standards passed by Congress in 2007, the Supreme Court’s decision in Massachusetts v. EPA, which precipitated global warming pollution standards for vehicles under the Clean Air Act, and global warming pollution standards enacted in California and subsequently adopted by 13 other states and the District of Columbia. The agreement provided a mechanism for automakers to build a single national fleet of new vehicles that are in compliance with federal and state requirements under both the Clean Air Act and the Corporate Average Fuel Economy (CAFE) program.\nWhile each regulatory agency with legal authority promulgates and finalizes separate standards, the National Program harmonizes the three requirements. This is achieved by coordinating the rulemaking process and promulgating final standards that ensure that automakers can build a single fleet which complies with all three standards.\nThe National Program is comprised of three legal authorities:\n- Department of Transportation (NHTSA): The first CAFE standards were administered by the National Highway Traffic Safety Administration (NHTSA), a part of the US Department of Transportation. As a result of the 2007 energy legislation, NHTSA is required by statute to set fleetwide average fuel efficiency standards for each new model year at the maximum feasible level.\n- Environmental Protection Agency (EPA): The EPA is required to set pollution standards for new light-duty vehicles under section 202 of the Clean Air Act. Specifically, EPA is required to set standards at a level that protects public health and welfare. EPA successfully implemented automobile pollution standards covering smog-forming, toxic, and other emissions for decades. Following the Supreme Court’s decision in Massachusetts v. EPA that greenhouse gases are pollutants under the Clean Air Act and the subsequent finding that those gases endanger public health, the agency was required to set global warming pollution standards for vehicles under the Clean Air Act.\n- California Air Resources Board (CARB): When the Clean Air Act was originally enacted, Congress provided the State of California unique authority to set vehicle standard that are more stringent than the federal standards. California enacted legislation in 2002 directing CARB to develop global warming pollution standards for light-duty vehicles, which were finalized in 2004. Other states are able to adopt the California standards in lieu of the federal standards under section 177 of the Clean Air Act. Currently, 13 other states and the District of Columbia follow the state standards, representing nearly 40% of new vehicles sold in the United States. These states are required to adopt identical standards to those established by CARB, ensuring that there are just two alternatives — a baseline federal requirement and a stronger state requirement — instead of multiple standards.\nPhase I of the National Program: Model Year 2012–2016\nThe first phase of the National Program was finalized in April 2010 after a 12-month regulatory process. The 2012–2016 standards were supported by automakers, state regulators, the United Auto Workers (UAW), environmental organizations and other stakeholders. Overall, phase I of the National Program represents a 23 percent improvement in new vehicle pollution standards, an average annual improvement of nearly 5 percent.\nThe EPA established global warming pollution standards of 250 grams per mile, on average, for model year (MY) 2016 vehicles. NHTSA set fuel efficiency standards which target a new vehicle average of 34.1 miles per gallon in MY2016. These two standards reflect a harmonized level of stringency. CARB agreed to accept compliance with the National Program as compliance with its standards even though the federal standards are weaker until 2016.\nPhase II of the National Program: Model Year 2017–2025\nBuilding on the success of the first phase of the National Program, the second phase of fuel economy and global warming pollution standards for light duty vehicles covers model years 2017–2025. These standards were finalized by the US Environmental Protection Agency and US Department of Transportation in August 2012.\nThese new standards will reduce average global warming emissions of new passenger cars and light trucks to 163 grams per mile (g/mi) in model year 2025. This is equivalent to 54.5 miles per gallon (mpg), if the standards were met exclusively with fuel efficiency improvements 1.\nBenefits of Fuel Economy Standards\nThese standards will reduce America’s consumption of oil, save consumers money at the gas pump, and protect public health and the environment by curbing global warming pollution. They will also help spur investments in new automotive technology, creating jobs and helping sustain the recovery of the US auto industry.\n- Oil Consumption: Nearly doubling the average fuel efficiency of new cars and light trucks is the single biggest step our nation can take to reduce oil use. When taken together, the two phases of fuel economy standards will result in oil savings in 2030 of more than 3 million barrels per day. This is roughly equivalent to the US imports from both the Persian Gulf and Venezuela combined.\n- Jobs: A June 2012 study by the Blue Green Alliance finds that the second round of standards alone will create an estimated 570,000 jobs (full-time equivalent) throughout the US economy by 2030, including 50,000 in light-duty vehicle manufacturing (parts and vehicle assembly).\n- Environment: The two rounds of standards will reduce global warming pollution by as much as 570 million metric tons (MMT) in 2030. This is equivalent to shutting down 140 typical coal-fired power plants for an entire year.\n- Consumer Savings: The standards will save consumers $140 billion in 2030. When compared to a typical vehicle on the road today, a new car buyer will save more than $8,000 over the lifetime of a new 2025 vehicle, even after paying for the more fuel-efficient technology.\nNotes:\n- The actual Corporate Average Fuel Economy (CAFE) standard is expected to be about 49.6 mpg in 2025, with the remaining 5 miles per gallon equivalent reached through improvements to in-car air conditioners (better efficiency, reduced leaks, and use of refrigerants with a lower impact on the climate). Because CAFE compliance tests are out of date and overinflate fuel economy, the average on-road fuel economy of new cars and light trucks is expected to be 36-37 mpg by 2025. By comparison, the average of today’s on-road fleet is 21 mpg. See the UCS fact sheet Translating New Auto Standards into On-Road Fuel Efficiency for more information."
    },
    {
      "url": "https://theconversation.com/epa-removal-of-vehicle-emissions-limits-wont-stop-the-shift-to-electric-vehicles-but-will-make-it-harder-slower-and-more-expensive-262384",
      "text": "The U.S. government is in full retreat from its efforts to make vehicles more fuel-efficient, which it has been waging, along with state governments, since the 1970s.\nThe latest move came on July 29, 2025, when the Environmental Protection Agency said it planned to rescind its landmark 2009 decision, known as the “endangerment finding,” that greenhouse gases pose a threat to public health and welfare. If that stands up in court and is not overruled by Congress, it would undo a key part of the long-standing effort to limit greenhouse gas emissions from vehicles.\nAs a scholar of how vehicle emissions contribute to climate change, I know that the science behind the endangerment finding hasn’t changed. If anything, the evidence has grown that greenhouse gas emissions are warming the planet and threatening people’s health and safety. Heat waves, flooding, sea-level rise and wildfires have only worsened in the decade and a half since the EPA’s ruling.\nRegulations over the years have cut emissions from power generation, leaving transportation as the largest source of greenhouse gas emissions in the U.S.\nThe scientific community agrees that vehicle emissions are harmful and should be regulated. The public also agrees, and has indicated strong preferences for cars that pollute less, including both more efficient gas-burning vehicles and electric-powered ones. Consumers have also been drawn to electric vehicles thanks to other benefits such as performance, operation cost and innovative technologies.\nThat is why I believe the EPA’s move will not stop the public and commercial transition to electric vehicles, but it will make that shift harder, slower and more expensive for everyone.\nPutting carmakers in a bind\nThe most recent EPA rule about vehicle emissions was finalized in 2024. It set emissions limits that can realistically only be met by a large-scale shift to electric vehicles.\nOver the past decade and a half, automakers have been building up their capability to produce electric vehicles to meet these fleet requirements, and a combination of regulations such as California’s zero-emission-vehicle requirements have worked together to ensure customers can get their hands on EVs. The zero-emission-vehicle rules require automakers to produce EVs for the California market, which in turn make it easier for the companies to meet their efficiency and emissions targets from the federal government. These collectively pressure automakers to provide a steady supply of electric vehicles to consumers.\nThe new EPA move would undo the 2024 EPA vehicle-emissions rule and other federal regulations that also limit emissions from vehicles, such as the heavy-duty vehicle emissions rule.\nThe possibility of a regulatory reversal puts automakers into a state of uncertainty. Legal challenges to the EPA’s shift are all but guaranteed, and the court process could take years.\nFor companies making decade-long investment decisions, regulatory stability matters more than short-term politics. Disrupting that stability undermines business planning, erodes investor confidence and sends conflicting signals to consumers and suppliers alike.\nA slower roll\nThe Trump administration has taken other steps to make electric vehicles less attractive to carmakers and consumers.\nThe White House has already suspended key provisions of the Inflation Reduction Act that provided tax credits for purchasing EVs and halted a US$5 billion investment in a nationwide network of charging stations. And Congress has retracted the federal waiver that allowed California to set its own, stricter emissions limits. In combination, these policies make it hard to buy and drive electric vehicles: Fewer, or no, financial incentives for consumers make the purchases more expensive, and fewer charging stations make travel planning more challenging.\nOverturning the EPA’s 2009 endangerment finding would remove the legal basis for regulating climate pollution from vehicles altogether.\nBut U.S. consumer interest in electric vehicles has been growing, and automakers have already made massive investments to produce electric vehicles and their associated components in the U.S. – such as Hyundai’s EV factory in Georgia and Volkswagen’s Battery Engineering Lab in Tennessee.\nGlobal markets, especially in Europe and China, are also moving decisively toward electrifying large proportions of the vehicles on the road. This move is helped in no small part due to aggressive regulation by their respective governments. The results speak for themselves: Sales of EVs in both the European Union and China have been growing rapidly.\nBut the pace of change matters. A slower rollout of clean vehicles means more cumulative emissions, more climate damage and more harm to public health.\nThe EPA’s proposal seeks to slow the shift to electric vehicles, removing incentives and raising costs – even though the market has shown that cleaner vehicles are viable, the public has shown interest, and the science has never been clearer. But even such a major policy change can’t stop the momentum of those trends."
    },
    {
      "url": "https://www.iea.org/reports/global-ev-outlook-2025/trends-in-electric-car-markets-2",
      "text": "Cite report\nIEA (2025), Global EV Outlook 2025, IEA, Paris https://www.iea.org/reports/global-ev-outlook-2025, Licence: CC BY 4.0\nReport options\nTrends in electric car markets\nElectric car sales\nGlobal electric car sales exceeded 17 million in 2024\nMore than 20% of new cars sold worldwide were electric\nElectric car sales topped 17 million worldwide in 2024, rising by more than 25%.1 Just the additional 3.5 million cars sold in 2024 compared to 2023 outnumber total electric car sales in the whole of 2020. China maintained its lead among major markets, with electric car sales exceeding 11 million – more than were sold worldwide just 2 years earlier. Global sales were slightly tempered by stagnating growth in Europe, as subsidies were phased out or reduced in several major markets, and as the EU CO2 targets for cars remained the same between 2023 and 2024. Electric car sales continued to increase in the United States although growth was about one-quarter that of the previous year. Significantly, outside of these three major markets, there was a record increase in sales of nearly 40% to reach 1.3 million, closing in on the United States’ sales of 1.6 million electric cars.\nGlobal electric car sales, 2014-2024\nOpenThe rapid growth in electric car sales over the past 5 years has had a significant impact on the global car fleet: At the end of 2024, the electric car fleet had reached almost 58 million, about 4% of the total passenger car fleet and more than triple the total electric car fleet in 2021. Notably, the global stock of electric cars displaced over 1 million barrels per day of oil consumption in 2024. Of course, the stock of electric cars is not spread evenly across the world – in China, for example, around one in ten cars on the road is now electric, whereas in Europe the ratio is closer to one in twenty.\nAlmost half of China’s car sales were electric in 2024, representing almost two-thirds of electric cars sold globally\nElectric car sales in China increased by almost 40% year-on-year in 2024, further driving up China’s share of global electric car sales. In 2021, China accounted for half of global electric car sales; this share grew to almost two-thirds in 2024. On a monthly basis, sales of electric cars have overtaken conventional car sales in the country since July 2024, bringing the share of electric car sales close to 50% for the full year. In China, 2024 marks the fourth consecutive year in which the electric car sales share grew by approximately 10 percentage points year-on-year.\nThe growth in China reflects in no small part the growing price competitiveness of battery electric cars with conventional cars in the country. In addition, China’s electric car market benefitted from the introduction of a trade-in scheme in April 2024. The scheme, which is part of a wider economic stimulus package, applies to the purchase of conventional and electric cars alike, but with different levels of financial support. It offers CNY 20 000 (Yuan renminbi) (USD 2 750) for consumers that replace an older vehicle (conventional or electric) with a new electric car, and CNY 15 000 (USD 2 050) for replacement with a new conventional vehicle. In 2024, about 6.6 million consumers applied for the incentive, 60% of whom bought an electric car. As such, more than one-third of the over 11 million new electric car sales in the country benefitted from this incentive.\nIn recent years, sales of plug-in hybrid electric cars have been growing faster than sales of battery electric cars in China. The share of plug-in hybrid electric vehicle (PHEV) sales, excluding extended-range EVs (EREVs)2, in China’s total electric car sales has risen from about 15% in 2020 to nearly 30% in 2024. Meanwhile, the share of EREVs has more than quadrupled since 2020, surpassing 10% in 2024. The acceleration of PHEV sales in China led the share of electric car sales that are battery electric to fall from 80% in 2020 to below 60% in 2024, though in absolute terms battery electric car sales increased sevenfold over the same period, demonstrating their continued appeal to new customers.\nIn Europe, electric car sales stagnated in 2024 as policy support waned in major car markets\nAbout one in five new cars sold on the European market was electric in 2024, maintaining the sales share of the previous year. The electric sales share increased in 2024 in 14 out of 27 EU member states, while it either stalled or decreased in the rest, including in several larger markets, such as Germany and France, largely as a result of subsidies being phased out or reduced. In Germany, subsidies ceased at the end of 2023, while France has progressively reduced its subsidy over the years. At the start of 2024, France limited the amount of environmental bonus available to higher-income car buyers and reduced the number of vehicles eligible for the subsidy.\nBesides subsidies, the policy design of the European Union CO2 standards may also have held back further growth of the electric car market in 2024. As new targets come into effect every 5 years, car makers had no incentive to push sales of electric cars further in 2024 (in anticipation of strengthened targets in 2025). This is in contrast to markets such as the United Kingdom, where annually increasing targets move original equipment manufacturers (OEMs) towards electrification each year. In March 2025, the European Commission published its Industrial Action Plan for the European automotive sector, in which it proposed to amend the CO2 emission performance standards for cars and vans, granting them additional flexibilities by averaging their performance over a 3-year period.\nIn the United Kingdom – the second-largest car market in Europe – electric car sales reached a share of nearly 30%, up from 24% in 2023. The year 2024 was the first under the Vehicle Emissions Trading Scheme, which required 22% of all new registrations to be BEV or fuel cell electric vehicle (FCEV). When accounting for the scheme’s flexibilities, which allows OEMs to borrow credits from future years, they were able to comply with a battery electric car sales share of close to 20%. Norway reached near-total electrification of sales, with 88% of car sales being battery electric and just under 3% plug-in hybrid. As a result of the growing stock of electric cars, Norway’s oil consumption for road in 2024 decreased by 12% compared to 2021. From April 2025, a tax increase on conventional internal combustion engine (ICE) cars and PHEVs is expected to further increase the battery electric share towards meeting the Norwegian government’s 2025 goal of 100% zero-emissions car sales. In Denmark, the electric sales share increased by 10 percentage points to reach 56%, with nearly 100 000 electric cars sold.\nThe market share of electric cars continued to expand in the United States\nIn the United States, electric car sales increased to 1.6 million in 2024, with the sales share growing to more than 10%. However, growth in electric car sales slowed down significantly in 2024, increasing by just 10% compared to 40% in 2023. In spite of this, electric car sales did boost the overall car market, as sales of conventional cars stagnated.\nA total of 24 new electric car models were launched in 2024, increasing model availability by 15% compared to 2023, providing consumers with more choices and further increasing competition. While the Tesla Model Y and Model 3 have been the two best-selling models in the United States since 2020, the 110 new models that have entered the market since then have driven the market share of Tesla down from 60% in 2020 to 38% in 2024. Furthermore, 2024 was the first year in which Tesla saw a drop in sales in the United States, while other OEMs saw sales increase by 20% on aggregate.\nA modification to the US Clean Vehicle Tax Credit at the start of 2024 enabled buyers to receive an instant discount (up to USD 7 500 for a new electric car and USD 4 000 for a used electric car) at the point of sale, which may have served to entice interested buyers. However, not all electric cars were eligible for the credit: in 2024 about 20 electric models (not accounting for different trim levels) out of a total 110 were eligible, which translated to over half of US electric car sales. The real share that benefitted from the tax credit may be even higher. In 2023, provisions were introduced on leased electric cars to reclassify them as commercial vehicles, thereby making them eligible for the tax credit without having to meet requirements on local manufacturing. As a result, by 2024, nearly half of all EVs sold were leased, more than double the share seen 3 years earlier. In addition to the federal tax credit, in 2024, 27 states offered additional incentives, rebates and exemptions promoting electric car adoption.\nElectric car registrations and sales share in China, United States and Europe, 2018-2023\nOpenEmerging markets saw a strong uptick in electric car sales\nElectric car sales shares doubled in a number of emerging markets\nIn emerging and developing economies in Asia, Latin America and Africa, electric car sales increased by over 60% year-on-year in 2024, and the sales share almost doubled from 2.5% to 4%. This rapid growth has been strengthened by policy incentives and the growing presence of relatively affordable electric cars from Chinese OEMs.\nEmerging and developing economies in Asia (excluding China) saw a large increase in electric car sales, reaching almost 400 000 in 2024, up over 40% from 2023. However, in India, total electric car sales and their share of sales increased only slightly, approaching 100 000 (or 2%) in 2024. Thailand remained the largest EV market in Southeast Asia, despite a 10% drop in electric car sales. This decline was outweighed by an even steeper 26% drop in conventional car sales, largely due to stricter lending criteria, meaning the electric sales share rose to 13% in 2024, up from 11% the previous year. Within the region, Indonesia and Viet Nam also stood out, respectively tripling and nearly doubling their sales numbers and reaching sales shares comparable to countries such as Spain or Canada. In many Southeast Asian countries, BEVs are the most popular electric car type, with over 90% of all electric car sales being fully electric.\nIn Latin America, sales volumes and penetration rates doubled in many countries, with electric cars reaching a market share of 4% in 2024. Brazil towered over other countries in the region with nearly 125 000 electric car sales, more than twice the number of 2023 sales, and the electric sales share doubled to 6.5%. Costa Rica, Uruguay and Colombia also achieved impressive sales shares of around 15%, 13% and 7.5%, respectively. These increases are in large part the result of government incentives such as tax exemptions, reduced registration fees, a relaxation of traffic restrictions for EVs, and relatively high fossil fuel prices.\nIn Africa, electric car sales more than doubled to reach nearly 11 000 in 2024. Sales shares remained low, at under 1%, though there was growth in several countries, such as Morocco and Egypt, where new electric car sales increased to more than 2 000.\nElectric car registrations and sales share in selected countries, 2020-2024\nOpenEmerging electric car brands are seeing local and even international success\nRecent years have seen the birth of several new electric car brands in emerging markets, such as VinFast in Viet Nam, Togg in Türkiye, and Tito in Argentina, helping to drive up sales. In Viet Nam, local brands underpinned the near doubling of the electric sales share in 2024 to reach 17%. VinFast has also started to export to 11 different countries, with the largest share of exports going to Southeast Asian countries such as Indonesia (44%) and Malaysia (22%), but also to the United States (22%). The company has announced plans to double domestic production in Viet Nam, as well as expanding manufacturing into India and Indonesia.\nTürkiye continues to deploy the domestically produced Togg electric cars, increasing its total production by 50% year-on-year. The increase in domestic production and in imports resulted in the country reaching an electric sales share of 10% in 2024. In July 2024, the Turkish government announced a USD 5 billion package to boost its annual production to 1 million electric cars per year.\nIndia’s electric car market is predominantly supplied by Indian OEM Tata. In addition, at the end of 2023, Indian steelmaker JSW signed a joint venture with SAIC Motor, a Chinese OEM, to work together on car production under the name MG Motor. In 2024, the joint venture produced about half of its electric cars sold in India domestically, while the other half were imported from China. At the end of 2024, JSW also announced the launch of its own EV brand, and is in talks with partners such as BYD and Geely regarding collaboration on technology transfer.\nOrigin of electric cars sold in selected markets, 2024, and share of total imports from China, 2023 and 2024\nOpenOverseas expansion plans of Chinese producers, prompted by changes to import tariffs, drove sales in emerging markets\nAnother notable trend from 2024 was the numerous manufacturing announcements from Chinese OEMs in countries such as Brazil, Thailand, Indonesia and Malaysia, where temporary exemptions from import tariffs for electric cars are coming to an end. In 2024, electric car sales in Brazil more than doubled, with over 85% of new electric cars coming from China. A key factor behind this impressive growth was electric cars being exempt from import duties of 35%, though this exemption started to be gradually removed in 2024 and is set to end by the middle of 2026. By then, automakers BYD and GWM will have begun producing models in Brazil, with a range tailored to the Brazilian market, such as BYD’s Song Pro, which will be flex-fuel compatible.\nIn Thailand, Chinese imports play a key role in electrification, accounting for 85% of electric car sales. However, as in Brazil, this share is expected to decline due to changes introduced in the EV 3.5 program, under which import taxes on electric cars will be reintroduced at the end of 2025 and existing subsidies of up to THB 100 000 (Thai baht) (USD 2 800) per imported car will be gradually phased out. To continue to qualify for the exemption and subsidy, OEMs must commit to producing at least two battery electric vehicles (BEVs) domestically by the end of 2026 for every imported BEV sold in 2024 and 2025.\nIn Indonesia, electric car sales tripled in 2024 while the conventional market contracted by 20%, leading to an electric sales share of over 7%. The government has supported adoption by reducing the VAT rate on electric cars from 11% to 1% since 2023. However, what has potentially had an even greater impact on reducing the cost of electric cars for Indonesian buyers – and thus stimulating EV sales – has been the government waiving import taxes for EVs from car makers that invest in local electric car manufacturing from the start of 2024. Chinese car manufactures such as BYD and GAC Aion profited from this reduction, as did European OEM Stellantis. As a result, Chinese electric car imports increased 18-fold to 34 000 by the end of 2024.\nIn Malaysia, electric car sales more than doubled in 2024 and the sales share increased from less than 2% in 2023 to nearly 4% in 2024. Much of this success is due to imported electric cars being exempt from import taxes and excise duties until the end of 2025. Ahead of the tax exemption ending, Chinese car producer Geely, together with Proton (a Malaysian automotive company), will start domestically producing the e.MAS 7 by the end of 2025, backed by an investment from Geely. Malaysian OEM Perodua will also start producing its first electric car at the end of 2025, with a price of RM 80 000 (Malaysia ringgit) (USD 18 000).\nMore affordable electric cars and local policies have reshaped the EV landscape in more emerging markets\nPolicy measures such as tax incentives for electric cars contributed to the doubling of electric car sales seen in Colombia and Costa Rica in 2024. Colombia also proposed to increase import tariffs on all hybrid vehicles at the end of 2024, in a push to shift more sales towards BEVs. More than 70% of all electric cars sold in these two countries were imported from China, with Chinese imports to Colombia more than tripling in 2024, while imports from other countries grew by just 30%. In Uzbekistan, electric car sales shares doubled and the average price of an imported electric car fell almost threefold between 2023 and 2024.\nIn Africa, local policies and changing trade regimes are reshaping the electric car market. Developments such as the ban on imports of petrol and diesel cars introduced in Ethiopia at the start of 2024 have resulted in a reported deployment of 100 000 electric vehicles.3 While model availability appears to be reasonable in the country, there are reports that garages struggle to source components for repairs, and that deployment of chargers outside of the capital has not kept pace with electric car sales. In Morocco and Egypt, efforts by car manufacturers to expand their production lines for batteries and/or electric cars in order to facilitate exports to the European Union have also pushed up domestic deployment, with the sales share reaching just under 2%. Nigeria is now looking into strengthening its EV manufacturing capacity with support from Morocco, and in 2024, signed the Zero Emission Vehicles Declaration to work towards all new sales of cars and vans being zero emission by 2040.\nFirst quarter sales hint at strong sales for 2025, despite many uncertainties\nElectric car sales increased 35% in the first quarter of 2025 compared to the same period in 2024\nMore than 4 million electric cars were sold in the first quarter of 2025 as sales grew by 35% compared to the first quarter of 2024, which was higher than the growth rate observed in the first quarters of the previous 2 years. Over 1 million more electric cars were sold in the first three months of 2025 compared to the same period in 2024 and about 60% of these were sold in China.\nQuarterly electric car sales, 2022-2025 Q1\nOpenBetween January and March 2025, China averaged monthly sales of around 875 000 electric cars, with total sales of more than 2.5 million. While the electric sales share was less than 45% in January, it reached more than 50% in both February and March. Across the full first quarter, the share of electric car sales was similar to that of 2024.\nIn Europe, electric car sales reached more than 900 000 in the first quarter of 2025, 625 000 of which were sold in the European Union. The electric sales share has also been increasing, averaging one in four cars sold in Europe in the first three months of 2025. In the United Kingdom, electric cars represented 30% of cars sold in the first quarter, while in the European Union the share was less than 25%.\nMore than 360 000 electric cars were sold in the United States in the first three months of 2025, around 10% more than during the same period the previous year. Total car sales grew at a similar rate, meaning the electric car sales share in the United States remained around 10%, the average across 2024.\nSeveral emerging electric car markets continued to see strong growth in the first quarter of 2025. In Brazil, for example, electric car sales exceeded 30 000 across the first three months of 2025, 40% more than during the same period in 2024. Sales in India grew 45% year-on-year, nearing 35 000 electric car sales for the first quarter of 2025. Electric car sales in Viet Nam also approached 35 000 for the first quarter – nearly four times as many as were sold during the first quarter of 2024 – leading sales across Southeast Asia to double to over 100 000 between January and March 2025.\nElectric car sales are expected to exceed 20 million in 2025, representing one-quarter of total car sales\nFor the full year 2025, electric car sales are expected to increase by 25% globally, which is similar to the growth rate from the 2024. As a result, electric car sales top 20 million worldwide. While sales volumes may be impacted by economic and policy uncertainties, more than one in four cars sold in 2025 is expected to be electric.\nBuilding on strong sales in the first quarter of 2025, China is expected to sell over 14 million electric cars across the full year – more than were sold globally in 2023. Sales of both electric and conventional cars are supported by the extension of the trade-in scheme for older vehicles. The sales share of electric cars in China is expected to reach around 60% in 2025.\nThe European Commission announced in March 2025 that OEMs would be given flexibilities in meeting the 2025 CO2 targets for cars and vans. On this basis, OEMs now only need to achieve the 15% emissions reduction target (compared to the 2021 baseline) on average over 2025-2027. This announcement was made in response to auto industry claims that the 2025 target would be unachievable, and would thus incur significant financial penalties that would damage the already struggling European auto industry. As yet, it is unclear how different OEMs will approach meeting the 3-year average target, in terms of the degree of under-performance that could be accepted in 2025 but would then need to be compensated for in the following 2 years.\nThe new phase of the CO2 targets in the European Union is expected to drive up electric car sales, although the new flexibilities mean OEMs have less of an incentive to bring lower-priced electric cars to market this year. Given that a purchase premium for electric cars persists in Europe, the phase-out of EV purchase subsidies in some European countries could place downward pressure on sales, but there are signs to the contrary. At the end of 2024, the electric car purchase subsidy in the Netherlands came to an end, but electric car sales in the country in the first quarter of 2025 were about 10% higher than during the same period of 2024. In Italy, direct purchase subsidies for electric cars are no longer being renewed after 2024, though the government does aim to support the domestic production of EVs. In the first three months of 2025, electric car sales in Italy were up almost 50%.\nOver the course of the year, electric car sales are expected to reach around 4 million across Europe. In line with this, the share of electric cars sales would increase several percentage points compared to 2024, to around 25%. The increase in electric car sales across Europe is boosted by the UK Vehicle Emissions Trading Scheme, which sets the target of 28% battery electric car sales in 2025.\nIn the United States, Executive Order 14154 directed the government to reconsider market interventions that favour EVs. Legislation has since been proposed that would end the Clean Vehicle Tax Credit for both cars and light commercial vehicles. In 2025, this proposal may result in consumers that have been considering buying an electric car rushing to do so before the tax credit is removed. A dampening effect on EV sales in the United States is expected only once the tax credit is repealed, and the timeline for that is uncertain. In addition, tariffs for conventional and electric cars have also been announced, which may result in lower car sales. For the full year, electric car sales in the United States are expected grow almost 10% in 2025, with a slight increase in the electric car sales share.\nAcross the rest of the world, electric car sales are expected to grow by over 30% to around 1.8 million. This would mean electric cars account for 6% of all car sales outside of the three major EV markets in 2025, up from 5% in 2024. The strong growth seen in Southeast Asia and Brazil is expected to continue, reaching sales of more than 0.5 million combined in 2025.\nGovernment spending on electric cars\nSubsidy phase-outs are leading to ever lower shares of government spending in the EV market\nAs electric car sales have grown over the past decade, government spending per vehicle, in the form of purchase subsidies and tax incentives, has steadily declined – a trend that accelerated in 2022 as subsidies were phased out.\nIn 2024, government spending accounted for less than 7% of total spending on electric cars globally, compared to 20% in 2017. In absolute terms, annual government spending on electric cars has hovered around the USD 38 billion mark since 2022. At the same time, total consumer spending on electric cars globally has grown continuously to reach USD 560 billion in 2024.\nGlobal consumer and government spending on electric cars, 2017-2024\nOpenChina has had the largest absolute public spending since 2020, despite its subsidy scheme coming to an end in December 2022 after 12 years. Other incentives have remained in place – notably, electric cars being exempt from the 10% purchase tax that applies to other vehicles. In 2024, China introduced a trade-in subsidy with a higher premium for the purchase of EVs. The additional expenditure to support EV purchases is estimated to be around USD 2.7 billion for 2024.4 Nevertheless, Chinese government expenditure per vehicle dropped 25% between 2022 and 2024. China has the highest share of subsidies going to PHEVs, at nearly 45%, as a result of the 10% purchase tax exemption being applied to PHEVs, which are on average more expensive than BEVs. In contrast, government incentives for PHEVs have almost disappeared from other key markets.\nIn Europe, subsidy schemes were significantly reshaped in 2023 and 2024. The most abrupt change was in Germany, where the EUR 4 500 per-vehicle subsidy was reduced to zero as of December 2023 – which was followed by a drop in EV market share of 4 percentage points in 2024. As a result, the German government has introduced new tax benefits for companies buying EVs, effective from July 2024 through to 2028. Company cars account for about two-thirds of registrations in the country.\nIn the United Kingdom, all subsidies were removed at the end of 2022 but electric car sales have continued to increase, thanks in part to the Vehicle Emissions Trading Schemes, which set targets for zero-emission car sales starting from 2024. In addition, the growth in EV sales was underpinned by a set of tax rebates for company cars, which represented about 60% of total car registrations in 2024. When factoring in all government tax incentives, an ICE car would incur more than 10 times the company car tax of an equivalent BEV, compared to Germany where this ratio is around 4.\nSimilarly, Sweden ended its subsidy programme offering up to SEK 60 000 (Swedish kronor) (USD 5 800) per electric car in November 2022. Absolute volumes of electric car sales in the country decreased 10% in 2024, though the country’s EV sales share fell only very slightly due to a drop in overall car sales. In several other European countries, subsidies were either reduced in absolute terms, or their conditions have become more stringent, with a faster roll-back of subsidies for PHEVs. As a result, the average subsidy per vehicle in Europe has fallen rapidly, from more than USD 4 500 per vehicle in 2022 to around USD 1 000 in 2024. The phase-down or interruption of subsidy schemes in Europe has had differing consequences on EV market shares at the national level, but the rapid decrease in subsidies has not been followed by an equivalent decrease in EV market share, providing an encouraging sign of market resilience.\nIn the United States, the introduction of the Inflation Reduction Act expanded the number of vehicles eligible for tax credits in 2023. However, the list of vehicles eligible for the USD 7 500 tax credit has since changed repeatedly as Internal Revenue Service guidelines have been implemented. The average tax credit in 2024 was approximately USD 4 000 per vehicle, since not all electric cars were eligible and some were eligible for only USD 3 750. In both 2023 and 2024, the United States had the highest per-vehicle subsidy of the three major EV markets.\nReferences\nIn this report “sales” represents an estimate of the number of new vehicles hitting the roads. Where possible, data on new vehicle registrations is used. In some cases, only data on retail sales (such as sales from a dealership) are available. New car sales or registrations exclude used cars. Unless otherwise specified, the term electric vehicle is used to refer to both battery electric and plug-in hybrid electric vehicles but does not include fuel cell electric vehicles.\nIf not otherwise specified, PHEVs includes EREVs. Extended-range EVs are a subset of plug-in hybrid electric vehicles that have both an internal combustion engine (ICE) and a plug-in rechargeable battery. Throughout this report, EREVs refer to plug-in series hybrid powertrain configurations where the ICE only operates without direct mechanical connection to the wheels to recharge the battery through an electric generator. Other plug-in hybrid configurations (such as parallel and series-parallel configurations) fall under the “standard” PHEV category. EREVs generally feature larger battery and longer electric range than standard PHEVs.\nData on electric car deployment in Ethiopia is difficult to obtain, and sources are not well aligned. The Ministry of Transport of Ethiopia reports a stock of 100 000 electric vehicles but does not define how many of these are cars. In contrast, EV Volumes reports about 1 300 electric car sales in the past 5 years.\nThe original funding allocation for the car trade-in subsidies in 2024 was close to CNY 11.2 billion (USD 1.5 billion), however, for the full year, 6.6 million cars were traded in. The additional expenditure for electric car purchases is estimated by applying the CNY 5 000 subsidy differential to the 60% of trade-ins that were for the purchase of an electric car.\nReference 1\nIn this report “sales” represents an estimate of the number of new vehicles hitting the roads. Where possible, data on new vehicle registrations is used. In some cases, only data on retail sales (such as sales from a dealership) are available. New car sales or registrations exclude used cars. Unless otherwise specified, the term electric vehicle is used to refer to both battery electric and plug-in hybrid electric vehicles but does not include fuel cell electric vehicles.\nReference 2\nIf not otherwise specified, PHEVs includes EREVs. Extended-range EVs are a subset of plug-in hybrid electric vehicles that have both an internal combustion engine (ICE) and a plug-in rechargeable battery. Throughout this report, EREVs refer to plug-in series hybrid powertrain configurations where the ICE only operates without direct mechanical connection to the wheels to recharge the battery through an electric generator. Other plug-in hybrid configurations (such as parallel and series-parallel configurations) fall under the “standard” PHEV category. EREVs generally feature larger battery and longer electric range than standard PHEVs.\nReference 3\nData on electric car deployment in Ethiopia is difficult to obtain, and sources are not well aligned. The Ministry of Transport of Ethiopia reports a stock of 100 000 electric vehicles but does not define how many of these are cars. In contrast, EV Volumes reports about 1 300 electric car sales in the past 5 years.\nReference 4\nThe original funding allocation for the car trade-in subsidies in 2024 was close to CNY 11.2 billion (USD 1.5 billion), however, for the full year, 6.6 million cars were traded in. The additional expenditure for electric car purchases is estimated by applying the CNY 5 000 subsidy differential to the 60% of trade-ins that were for the purchase of an electric car."
    }
  ],
  "argos_summary": "The recent regulatory changes by the Trump administration, particularly the proposed rescission of the EPA's 2009 endangerment finding, threaten to undermine decades of progress in reducing vehicle emissions and promoting electric vehicle (EV) adoption in the U.S. This shift could create uncertainty for automakers who have invested heavily in EV production, while also removing incentives for consumers to purchase cleaner vehicles. Despite these challenges, consumer interest in EVs remains strong, and global markets, especially in Europe and China, continue to push towards electrification, highlighting a growing demand for cleaner transportation options.",
  "argos_id": "3EUWBO5JW"
}