{
  "url": "https://finance.yahoo.com/video/why-trump-calling-intel-ceos-132330877.html",
  "authorsByline": "Yahoo Finance",
  "articleId": "4b09af1f1b9f4f7bad55380987af59a2",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/LazSnFGRy23CXcQrkpobKw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/3c5cc410-7391-11f0-bff6-8af25f571bdf",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:23:30+00:00",
  "addDate": "2025-08-07T13:36:16.818288+00:00",
  "refreshDate": "2025-08-07T13:36:16.818295+00:00",
  "score": 1.0,
  "title": "Why Trump is calling for Intel CEO's resignation",
  "description": "President Trump has called for Intel (INTC) CEO Lip-Bu Tan to \"resign immediately.\" Yahoo Finance Technology Editor Dan Howley joins Morning Brief with Julie Hyman to break down the details. To watch more expert insights and analysis on the latest market action, check out more Morning Brief.",
  "content": "That's interesting. Obviously, Tan is just still green as far as being Intel's CEO. And so, this kind of shake-up would, I mean, I can't imagine what it would do to the company at this point. They're they're right now trying to figure out what they would, uh, what to do post, uh, Pat Gelsinger. They were trying to figure out what to do with the foundry business. Uh, obviously, Intel sticking behind Tan for now. Uh, but yeah, the Tom Cotton letter, basically asking about Tan's prior investments in Chinese chip companies, as well as the Cadence settlement that they had completed when he was the CEO over there. And so, you know, there's there's concerns seemingly from the politicians, I guess Republicans, being Tom Cotton and the president, um, but I don't know if this means that we'll actually see Tan step down. I think it also though brings into question the kind of government subsidies that the company has gotten, right? Like will they continue to be able to receive those? Uh, will they not? Will Trump pull back on those? Will there be any issues beyond that? So, I think those are big concerns right now and it's still unknown.\n\nYeah, most definitely. And as you mentioned, the backdrop for this company is company is already really troubled, right? You know, Lip Bu Tan hasn't been the CEO for very long. Pat Gelsinger was the CEO. And there have been a lot of questions about his strategy to make Intel more of a foundry, more of a manufacturer of chips for other companies. That was a strategy that didn't seem to catch on. Um, Tan coming in here trying to sort of put his imprint on the company, Dan. And so, this feels like just yet another hit to a company that's already struggling.\n\nYeah, I mean, look, there's there's no doubt, and look, Tan has said it himself that they're wildly behind in AI. They have to catch up. They're they're trying to figure out what to do with that foundry business. It's still, I mean, the main customer is still Intel, right? And they say that it'll take a while for them to start getting third-party partners. There's been questions about whether or not the chip technology that they're using, Athena, will actually be used for third-party customers. They kind of put those questions to bed during the most recent earnings call. You know, there's then questions about whether or not there's delays. There's been different reports about that with 18A. And you know, what what that means then for 14A, the coming technology. So, they're really under the gun obviously. They're they're nowhere near the likes of Nvidia or AMD when it comes to AI. They they won't be for quite some time until they can come up with an AI chip that's capable of competing. But yeah, I mean, it's just not looking very good for Intel this morning at least.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chinese chip companies",
      "weight": 0.11605729
    },
    {
      "name": "other companies",
      "weight": 0.10069661
    },
    {
      "name": "company",
      "weight": 0.100270875
    },
    {
      "name": "Lip Bu Tan",
      "weight": 0.0872182
    },
    {
      "name": "Tan",
      "weight": 0.08594913
    },
    {
      "name": "Intel",
      "weight": 0.083483465
    },
    {
      "name": "chips",
      "weight": 0.07758661
    },
    {
      "name": "question",
      "weight": 0.07605505
    },
    {
      "name": "questions",
      "weight": 0.07605505
    },
    {
      "name": "Tom Cotton",
      "weight": 0.07058089
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9091796875
    },
    {
      "name": "/News/Technology News",
      "score": 0.90380859375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.90283203125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.794921875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.513671875
    }
  ],
  "sentiment": {
    "positive": 0.051940918,
    "negative": 0.6923828,
    "neutral": 0.25585938
  },
  "summary": "President Donald Trump has called for the resignation of Intel CEO, Lip Bu Tan, amid concerns about Tan's investments in Chinese chip companies and investments in the Cadence settlement. The company is already struggling in AI and is trying to figure out what to do with its foundry business. Concerns about government subsidies, government support, and whether these issues will persist, or not, will they be reconsidered. The firm's main customer is still Intel, and there are also questions about whether the chip technology they're using, Athena, will actually be used for third-party customers. There are also concerns about whether or not there are delays in the development of the coming technology for AI chips. However, Dan Cevallos suggests that this could be a significant setback for Intel, as they are already struggling to compete in the field of AI.",
  "shortSummary": "Intel CEO Tan faces questions about his future and the company's struggling foundry business, which are raising concerns about government subsidies and AI competitiveness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "dffaaba732b441f98acce84ec61d55e9",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Intel is facing significant challenges under CEO Lip Bu Tan, who is still new to the role and grappling with the company's strategy and performance, particularly in the foundry business and AI technology. Concerns have been raised regarding Tan's previous investments in Chinese chip companies and the implications for government subsidies. The company is struggling to catch up with competitors like Nvidia and AMD in AI, and there are ongoing uncertainties about their chip technology and partnerships.",
  "argos_id": "3LNYJE8Y0"
}