{
  "url": "https://finance.yahoo.com/news/heres-why-nvidia-partners-stock-130507685.html",
  "authorsByline": "Lee Samaha, The Motley Fool",
  "articleId": "38800c889f8a49519c05b3a68ec4b0b7",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/motleyfool.com/614cb374df1f5a82c70671b41d7fd398",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:05:07+00:00",
  "addDate": "2025-08-07T13:42:49.403876+00:00",
  "refreshDate": "2025-08-07T13:42:49.403878+00:00",
  "score": 1.0,
  "title": "Here's Why This Nvidia Partner's Stock Soared in July",
  "description": "There's no sign of any slowdown in the AI/data center market in 2025.",
  "content": "• Strong revenue growth has more than offset margin pressures coming from headwinds on costs from tariffs.\n• Vertiv's management continues to invest in growing the business.\n• These 10 stocks could mint the next wave of millionaires ›\n\nShares in data center equipment company and Nvidia partner Vertiv Holdings (NYSE: VRT) rose by 13.4% in July, according to data provided by S&P Global Market Intelligence. The move comes in a month when the company released an excellent set of second-quarter earnings, raised full-year guidance across the board, and confirmed that the artificial intelligence (AI)/data center capital spending market has a long pathway of growth ahead.\n\nEarlier in the year, the market had, understandably, been concerned that the data center infrastructure stocks had gotten ahead of events. A combination of trade tariff uncertainty, power generation concerns, the regulatory environment in Europe, and the usual concerns over a hot market overheating led to the sell-off in the stock.\n\nDespite the rise since then, the concerns still linger, not least as companies like Nvidia face controls on what technology they can sell to China. Fast-forward to the latest results from Vertiv, and it's clear that there's no sign of any slowdown in the market. Vertiv's trailing-12-month orders rose 11% compared to the same period a year ago. Moreover, its European orders pipeline (the company's weak spot in the fourth quarter of 2024) is growing sequentially, \"providing optimism for 2026 and beyond,\" according to CEO Giordano Albertazzi on the earnings call.\n\nTurning to the guidance hike, tariffs are hurting margins, but that's more than made up for by stronger-than-expected revenue growth. For example, management increased the midpoint of its full-year net sales guidance to $10 billion compared to $9.45 billion previously. However, management lowered the midpoint of its full-year adjusted operating profit guidance to 20% from 20.5% previously. The end result is that adjusted operating profit guidance was increased to $1.99 billion from $1.935 billion previously.\n\nThe good news is the company continues to invest in its future. That's pretty much what you might expect with David Cote (a 15-year CEO of Honeywell, responsible for its growth transformation) as chairman. Not only is Vertiv increasing its investment in research and development, but it's also acquiring Great Lakes Data Racks & Cabinets, a data center rack enclosure business, for $200 million, further enhancing its strength in power and cooling systems.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=9a0cc421-7cc6-4c03-a315-2636e645ea62&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D10969%26source%3Disaedikp0000055%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17672",
    "http://marketintelligence.spglobal.com/",
    "https://www.fool.com/terms/n/net-margin/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=6b8329cd-acd8-4aa9-947b-89caa9702d42"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "data center equipment company",
      "weight": 0.09791639
    },
    {
      "name": "adjusted operating profit guidance",
      "weight": 0.08159692
    },
    {
      "name": "companies",
      "weight": 0.07670859
    },
    {
      "name": "power generation concerns",
      "weight": 0.07351501
    },
    {
      "name": "Strong revenue growth",
      "weight": 0.072789066
    },
    {
      "name": "Vertiv Holdings",
      "weight": 0.06968465
    },
    {
      "name": "Nvidia partner",
      "weight": 0.068156675
    },
    {
      "name": "trade tariff uncertainty",
      "weight": 0.06543399
    },
    {
      "name": "Vertiv",
      "weight": 0.06456357
    },
    {
      "name": "Great Lakes Data Racks",
      "weight": 0.060706727
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.986328125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96533203125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.931640625
    },
    {
      "name": "/News/Technology News",
      "score": 0.65966796875
    }
  ],
  "sentiment": {
    "positive": 0.78564453,
    "negative": 0.117248535,
    "neutral": 0.09667969
  },
  "summary": "Shares in data center equipment company Vertiv Holdings (NYSE: VRT) rose by 13.4% in July, largely due to strong revenue growth offsetting headwinds from tariffs. The company also raised full-year guidance and confirmed that the artificial intelligence/data center capital spending market is likely to continue to grow. Despite concerns about potential tax controls on technology sold to China, Vertiv's stock has since rebounded, with its trailing-12-month orders rising 11% compared to the same period a year ago. Despite this, the company continues to invest in its future, including increasing its investment in research and development, and acquiring data center rack enclosure business for $200 million.",
  "shortSummary": "Vertiv Holdings' stock surged 13.4% in July despite challenges from tariffs and increased revenue growth, despite ongoing investment concerns and market concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "59da3eba93614e9b8cf2acc907c5fab2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/terms/n/net-margin/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=6b8329cd-acd8-4aa9-947b-89caa9702d42",
      "text": "There are many ways to measure a company's profitability. One key metric is net profit margin, which quantifies how much revenue a company keeps after paying all its expenses.\nWe'll take a closer look at this profitability measure by exploring:\n- What is net profit margin?\n- How to calculate net profit margin.\n- How to evaluate a company using net profit margin.\n- What are the limitations to net profit margin?\nWhat is net profit margin?\nWhat is net profit margin?\nNet profit margin, also known as net income margin or net margin, is the ratio of profit a company or business unit earns to the total amount of revenue (net sales) the company or business unit generates. Net profit margin is expressed as a percentage. Net profit is what remains after accounting for all expenses, including operating costs, interest, and taxes. In a nutshell, net margin is the percentage of a company's revenue that it keeps as profit.\nCalculating a company's net profit margin helps investors evaluate the relative amount of profit the company produces from its revenue. A key indicator of overall financial health, net margin is also an excellent metric to use to compare a company with its competitors. This metric can signal whether a business is doing a comparatively better or worse job of controlling its expenses.\nRevenue\nHow to calculate net profit margin\nHow to calculate net profit margin\nThe calculation of a company's net profit margin for any given reporting period is relatively straightforward. Net profit margin equals a company's net income -- either listed as such in its financial statement or can be calculated as revenue minus the cost of goods sold, operating and other expenses, interest, and taxes -- divided by revenue. That result is multiplied by 100 to convert the net margin ratio into a percentage.\nHere's the formula for net profit margin:\nLet's say a company generates $1 billion of revenue and $225 million of net income during a reporting period. The company's net margin equals its net income ($225 million) divided by its revenue ($1 billion). Multiplying that result by 100 yields the value of 22.5% for the company's net profit margin.\nIt's worth noting that net margin can be positive or negative. A negative net profit margin means the company or business unit was unprofitable during the reporting period.\nHow to evaluate a company using net profit margin\nHow to evaluate a company using net profit margin\nNet margin can help investors compare a company's performance across reporting periods and among its competitors. If a company undertakes a strategic initiative to increase its profitability, then investors can calculate net profit margin to evaluate whether that initiative is delivering results. If the company's net margin is in decline, then investors can use that information to recognize deteriorating financial health.\nA company with a higher net profit margin than those of its peers is more efficiently converting revenue into profit. If a company's net margin is lower than those of its industry peers, then that could be a sign it is financially weaker or less efficient than its rivals.\nWhat are the limitations to net profit margin?\nWhat are the limitations to net profit margin?\nWhile net profit margin is a useful metric, it has some limitations. For example, it is not a good gauge for comparing companies in different sectors. That's because in some industries, low-single-digit net profit margins are considered quite good, while in other sectors, double-digit net profit margins are the norm.\nAnother limitation of the net margin metric is that it can vary greatly across reporting periods due to the potentially outsized effects of one-time events. Asset sales can temporarily boost income, inflating the net margin. Likewise, one-time expenses can weigh heavily on a company's profitability for a reporting period. Because of this, it's important to understand the factors that influence net profit during any given period to determine whether calculating net margin is appropriate to evaluate the company.\nNet profit margin is just one of many metrics that investors can use to analyze a company, and it is certainly not the sole metric that determines the worthiness of a stock investment.\nThe bottom line\nInvestors can calculate net profit margin to understand how well a company converts revenue into net income. Further, despite its limitations, net profit margin is a good comparative metric to measure whether a strategic initiative is improving profitability or if a company is better at generating net income than its peers."
    }
  ],
  "argos_summary": "Vertiv Holdings experienced a 13.4% rise in shares in July following strong second-quarter earnings and an increase in full-year guidance, despite margin pressures from tariffs. The company's trailing-12-month orders grew by 11%, and its European orders pipeline is improving, indicating optimism for future growth. Vertiv is also investing in its future by increasing R&D spending and acquiring Great Lakes Data Racks & Cabinets for $200 million.",
  "argos_id": "3X4ILL8SN"
}