{
  "url": "https://www.macrumors.com/2025/08/07/apple-to-switch-to-us-made-iphone-sensors/",
  "authorsByline": "Hartley Charlton",
  "articleId": "f9864c5342fd42baa6cd167a2bdc917f",
  "source": {
    "domain": "macrumors.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://images.macrumors.com/t/CoiOu-u-fGFIO4zr-fZ6m_-XzD0=/2000x/article-new/2020/10/iphone_12_pro_sensor_shift.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T05:30:15-07:00",
  "addDate": "2025-08-07T12:38:28.202111+00:00",
  "refreshDate": "2025-08-07T12:38:28.202112+00:00",
  "score": 1.0,
  "title": "Report: Apple to Switch to Advanced US-Made iPhone Camera Sensors",
  "description": "Apple will partner with Samsung to produce next-generation image sensor chips for upcoming iPhone models at a facility in Texas, marking a major...",
  "content": "Apple will partner with Samsung to produce next-generation image sensor chips for upcoming iPhone models at a facility in Texas, marking a major departure from its exclusive reliance on Sony, according to the Financial Times.\n\n\n\nAs part of its announcements surrounding its $600 billion investment in U.S. manufacturing yesterday, Apple said:\n\nApple is also working with Samsung at its fab in Austin, Texas, to launch an innovative new technology for making chips, which has never been used before anywhere in the world. By bringing this technology to the U.S. first, this facility will supply chips that optimize power and performance of Apple products, including iPhone devices shipped all over the world.\n\nAccording to the Financial Times, the chips in question are three-layer stacked image sensors, which enable higher pixel density and improved low-light performance by vertically stacking multiple sensor layers. Stacked sensor architecture also allows for faster readout speeds, reduced power consumption, and higher dynamic range.\n\nThis manufacturing process has not previously been deployed at a commercial scale. Sources familiar with the matter said that the sensors are to be supplied by Samsung's System LSI division and mass-produced by its foundry division.\n\nThe image sensors to be produced in Texas are expected to appear in next year's iPhone 18 lineup. Apple typically begins final component validation and volume manufacturing well in advance of launch, suggesting that the Austin facility is already ramping up preparations for initial production tests.\n\nThis will be the first time Apple will move away from Sony for ‌iPhone‌ image sensors and make the component in the United States. Today, Sony is the sole supplier of ‌iPhone‌ image sensors; they are produced in Japan and delivered via TSMC.",
  "medium": "Article",
  "links": [
    "https://www.macrumors.com/guide/iphone/",
    "https://www.ft.com/content/aff9b9ce-956d-4716-99da-8fc25f4b878b",
    "https://www.macrumors.com/roundup/iphone-18/",
    "https://www.macrumors.com/2025/08/06/apple-american-manufacturing-program/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "‌iPhone‌ image sensors",
      "weight": 0.11593473
    },
    {
      "name": "Stacked sensor architecture",
      "weight": 0.10661096
    },
    {
      "name": "multiple sensor layers",
      "weight": 0.10025227
    },
    {
      "name": "Apple products",
      "weight": 0.09286714
    },
    {
      "name": "Apple",
      "weight": 0.089237675
    },
    {
      "name": "U.S. manufacturing",
      "weight": 0.08263918
    },
    {
      "name": "next-generation image sensor chips",
      "weight": 0.08209272
    },
    {
      "name": "upcoming iPhone models",
      "weight": 0.079579815
    },
    {
      "name": "Advanced US-Made iPhone Camera Sensors",
      "weight": 0.07754177
    },
    {
      "name": "iPhone devices",
      "weight": 0.07737848
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.97802734375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8017578125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.74462890625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.5966796875
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.32958984375
    }
  ],
  "sentiment": {
    "positive": 0.5541992,
    "negative": 0.040802002,
    "neutral": 0.40527344
  },
  "summary": "Apple is partnering with Samsung to produce next-generation image sensor chips for upcoming iPhone models at a facility in Texas, marking a significant departure from its exclusive reliance on Sony. The chips are three-layer stacked image sensors, which enable higher pixel density and improved low-light performance by vertically stacking multiple sensor layers. This new manufacturing process has not previously been deployed at a commercial scale. The sensors are expected to be supplied by Samsung's System LSI division and mass-produced by its foundry division. This will be the first time Apple will move away from Sony for ‌iPhone‌ image sensors and make the component in the United States.",
  "shortSummary": "Apple will partner with Samsung to produce advanced 3-layer image sensors for upcoming iPhone models at a Texas facility, breaking Sony's exclusive reliance on Sony.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4265c31a97a04bc381c380f6cd57257c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.macrumors.com/roundup/iphone-18/",
      "text": "iPhone 18 - 2026\nWith the iPhone 18 lineup that's planned for 2026, Apple is making major changes. There will be tweaks to the launch timelines of various iPhone models, plus rumors suggest that Apple is planning to debut its first-ever foldable iPhone.\nThe full iPhone 18 lineup is expected to include the iPhone 18, the low-cost iPhone 18e, iPhone 18 Air, the iPhone 18 Pro, the iPhone 18 Pro Max, and the all-new iPhone 18 Fold, though naming for the new foldable hasn't been established. That's a lot of iPhones, so the four more expensive models will launch in fall 2026 and the less expensive models will follow in early 2027.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nA Split Launch Strategy\nWith the iPhone 18 lineup, Apple is going to change the timing for new iPhone releases. The more expensive iPhone 18 Pro and iPhone 18 Pro Max iPhones will launch in the fall of 2026 as usual, alongside the new foldable iPhone and the iPhone 18 Air, but the more affordable iPhone 18 and iPhone 18e models won't come out until spring 2027.\nThe First Foldable iPhone\nMultiple rumors suggest that Apple's first foldable iPhone will launch in the fall of 2026, with the device coming alongside the iPhone 18 Pro and iPhone 18 Pro Max models. It's not clear what Apple plans to name the device at this time.\nDesign and Display\nThe first foldable iPhone will open up book style, which means it will have a smaller outer display and then a larger, wider open display. Design wise, it will be similar to the Pixel Fold or the Galaxy Fold.\nWhen folded, the iPhone will have a display that's around 5.5 inches, and when open, it will have a much larger 7.8-inch display. It could be as thin as 4.5mm when unfolded, and around 9mm when it is closed, though rumors have differed on thickness. Apple analyst Ming-Chi Kuo thinks it will be 4.5mm, while Weibo leaker Instant Digital says it's going to measure in at 4.8mm thick when open.\nThe outer display will be usable when the device is closed, but opening it up will provide access to the larger inner display. Apple is expected to use a titanium casing, and the design is meant to minimize the creasing.\nApple will use ultra-thin glass for the foldable iPhone, with Samsung set to create the displays.\nThe outer display is expected to have a hole-punch rear camera, while the inner display will use under-display camera technology.\nNo Crease\nRumors suggest the first foldable iPhone will have no visible crease or a nearly invisible crease, unlike most of the foldable devices on the market. Apple pursued eliminating the crease regardless of cost, and ensuring no crease is why it took Apple so long to design a foldable iPhone.\nApple is using a combination of titanium and stainless steel for the hinge, along with liquid metal. The design minimizes creasing and improves durability.\nNo Face ID\nThe foldable iPhone might use some version of Touch ID in a side button instead of using Face ID.\nRear Camera\nThe foldable iPhone camera will have a Main lens and an Ultra Wide lens with no Telephoto lens. Rumors suggest that both lenses will be 48 megapixels, which isn't too surprising because current iPhone models have 48-megapixel lenses.\nPricing\nThe foldable iPhone could cost nearly twice as much as the iPhone 16 Pro Max, and Apple could price it somewhere between $1,800 and $2,500, which is double what the iPhone 16 Pro costs.\nThe iPhone 18 Pro and iPhone 18 Pro Max\nApple's first foldable will see the addition of a new high-end flagship model to the iPhone lineup, but Apple is still planning to launch standard iPhone 18 Pro and iPhone 18 Pro Max devices.\nSizing\nApple isn't expected to change the sizes of the iPhone 18 Pro models, and they will feature the same 6.3-inch and 6.9-inch display sizes as the current models.\nUnder Display Face ID and Design\nThe two iPhone 18 Pro models are expected to feature under-display Face ID, with the TrueDepth camera hardware located under the display. The front-facing camera won't be under the glass, though.\nThe Information's Wayne Ma has suggested that the iPhone 18 Pro models will have no Dynamic Island with just a pinhole cutout located at the upper left of the display, but other rumors suggest there's still going to be a Dynamic Island.\nAccording to display analyst Ross Young, the iPhone 18 Pro models could have under-display Face ID, but that doesn't mean there won't be no Dynamic Island at all. Instead, the Dynamic Island will be smaller. Bloomberg's Mark Gurman has also said that iPhone 18 Pro models will have a slimmed down Dynamic Island, which contradicts rumors of no Dynamic Island.\nRenders\nDeveloper Filip Vabroušek created renders of what the iPhone 18 Pro's display might look like if Apple opts for a design without a Dynamic Island.\nAs a reminder, it is not clear if the iPhone 18 Pro will have a full under-display Face ID setup with just a hole punch camera as rumors have disagreed on this point. It could still have a Dynamic Island, just a smaller version of it. Vabroušek also designed a render with a smaller Dynamic Island, showing what that version of the iPhone 18 could look like.\nVariable Aperture Lens and New Sensor\nThe Main camera in the iPhone 18 Pro could have a variable aperture, which would provide users with more control over how their photos look. iPhone users would be able to manually adjust how much light gets to the sensor, cutting down on overexposure and providing new customization options for lighting and depth of field.\nThe 2026 iPhone models could also use a three-layer stacked image sensor that Samsung is developing. It would improve camera responsiveness, cut down on noise, and boost dynamic range.\nC2 Modem\nApple's next-generation C2 modem chip is expected in 2026, and it is expected to be more capable than the current C1. The C2 will feature mmWave 5G connectivity, and it will be closer in performance to the Qualcomm modem chips that it will replace.\nA20 Chip\nThe iPhone 18 Pro models and the foldable iPhone will use Apple's A20 chip. The A20 will use TSMC's 2nm process for power and efficiency improvements.\nThe transition to 2nm will allow for more transistors in each chip, which will boost performance. The A20 chips could be up to 15 percent faster and 30 percent more efficient than A19 chips. Apple is also expected to use TSMC's Wafer-Level Multi-Chip Module (WMCM) chip packaging technology. WMCM will see RAM directly integrated on the chip's water with the CPU, GPU, and Neural Engine.\nIncorporating RAM this way could bring faster performance for overall tasks and Apple Intelligence, better thermal management, and improved Apple Intelligence.\niPhone 18 Air\nApple is planning to continue to offer the iPhone \"Air\" series in 2026, and the iPhone 18 Air could be released in September 2026 alongside the iPhone 18 Pro models and the new foldable iPhone.\niPhone 18 and iPhone 18e\nThe lower cost iPhone models won't be Apple's focus in the fall of 2026, and we know little about them other than they are in development at the current time. Apple won't release them until spring 2027.\nLaunch Date\nThe foldable iPhone, the iPhone 18 Pro, and the iPhone 18 Pro Max could come out in September 2026, while the iPhone 18 and iPhone 18e could follow in spring 2027."
    },
    {
      "url": "https://www.macrumors.com/guide/iphone/",
      "text": "In 2007, Apple launched the original iPhone, kickstarting the modern smartphone era which is now dominated by iPhone and Android devices. We've had 18 generations of iPhones so far, with the latest models, the iPhone 16, iPhone 16 Plus, iPhone 16 Pro and iPhone 16 Pro Max, introduced in September 2024, and the iPhone 16e released in February 2025. Apple follows an annual update cycle, introducing new flagship models while discounting prior-year models and selling them at more affordable price points.\niPhone vs Android\nOver the years, Android and iPhone smartphones have evolved to the point where feature-wise, they're similar in function and capability. Android smartphones are made by multiple manufacturers, but the core operating system is provided by Google, which leads to a wider variety of phones and price points to choose from, but weaker integration between software and hardware.\nApple's control of both the iPhone and the operating system (iOS) provides a more consistent experience along with ongoing support. With iOS 18, Apple supports all iPhones that were introduced in the last four years, so the majority of active iPhone owners can and do upgrade to the newest version of iOS that Apple rolls out each year.\nAndroid updates are often more inconsistent and often don't make it to all Android-based smartphones because each manufacturer has to implement support on an individual basis. So while Google also does yearly Android updates, the reality is that a lot of older Android smartphones don't get the new software.\nWith Apple's control and curation of the iPhone experience, the iPhone is largely considered to be the more secure platform, and Apple has made it a point to focus heavily on privacy. Apple's iOS is less customizable than Android, though, so for individuals who prefer flexibility and customization options, the Android operating system may be worth looking at.\nHow Do iPhone Updates Work?\nHere are the basics you should know about how Apple updates the iPhone and the iOS operating system.\nEach fall, typically in September, Apple releases a new series of flagship smartphones. These often come at high prices and feature the latest technologies, with Apple offering high-end models and still high-end but more affordable models. Prior-year iPhones often stick around with lower price points as cheaper alternatives to the latest and greatest technology, and occasionally, Apple launches a lower-cost iPhone outside of the normal fall timeline.\nAt the current time, Apple's iPhone lineup includes the iPhone 15 (2023), iPhone 15 Plus (2023), iPhone 16 (2024), iPhone 16 Plus (2024), iPhone 16 Pro (2024), iPhone 16 Pro Max (2024), and iPhone 16e (2025).\nApple also debuts an updated version of iOS at the same time that new iPhones launch, but new versions of iOS are pre-introduced every year at Apple's annual Worldwide Developers Conference to give developers time to incorporate new features and technologies into their apps ahead of when the software becomes available to the public. The current iPhones run iOS 18.\nIn this guide, we go over all of the iPhones that are in the current Apple lineup, offer up some buying suggestions, and provide tips and resources for both new and existing iPhone owners.\niPhone 16 Pro and iPhone 16 Pro Max ($999+)\nThe iPhone 16 Pro and iPhone 16 Pro Max are Apple's current high-end flagship devices with all of the top-of-the-line features and the most bells and whistles. The Pro models are for those who want to get the most out of their iPhones with the latest feature set.\nPricing on the iPhone 16 Pro starts at $999, while pricing on the iPhone 16 Pro Max starts at $1,199. The two iPhones are nearly identical when it comes to feature set, and it's only display size and battery capacity that set the two devices apart.\nApple introduced larger screen sizes and slimmed down bezels for the Pro lineup in 2024, so the iPhone 16 Pro Max has a larger 6.9-inch display (up from 6.7 inches), and the iPhone 16 Pro has a 6.3 inch display (up from 6.1 inches). Both models feature the same design with a glass front and back, a lightweight but durable titanium frame, and squircle edges. Colors this year include natural titanium, white titanium, black titanium, and desert titanium, which is a shade of gold.\nThe iPhone 16 Pro and Pro Max feature edge-to-edge OLED displays with the slimmest bezels we've seen in an iPhone to date. There's a second-generation \"Ceramic Shield\" that offers superior scratch resistance, and a pill-shaped Dynamic Island continues to house the front-facing camera and hardware used for Face ID authentication.\nThe customizable Action button is still available, and it now does more thanks to Control Center integration. This year, Apple also added a Camera Control button that can be used to activate the camera with a press. Camera Control makes it quicker to capture photos and videos, and it is also pressure and touch sensitive so you can change controls and adjust settings without touching the screen.\nThe Dynamic Island has been incorporated into the iPhone's interface and it is able to show various notifications and app information for phone calls, timers, Face ID, Bluetooth connections, and more.\nApple added a new A18 Pro chip to the iPhone 16 Pro and Pro Max, with a 6-core CPU, a 6-core GPU, and a 16-core Neural Engine. It is up to 20 percent faster than the A17 Pro from the iPhone 15 Pro models, and it is the fastest iPhone for Apple Intelligence.\nThere continues to be a three-lens camera setup with a 48-megapixel Main camera that offers improved low-light performance, a 12-megapixel 5x Telephoto lens, and a new 48-megapixel Ultra Wide camera. The 5x Telephoto is available for both Pro models, which is new this year, and the 48-megapixel Ultra Wide camera takes improved wide-angle and macro shots when lighting is poor.\nCrash Detection is able to determine if you've been in a serious car accident, alerting emergency services, and there's also an Emergency SOS via satellite feature for getting help if you're out of range of Wi-Fi and cellular. With iOS 18, the satellite connectivity can be used to send messages too.\nBoth iPhone 16 Pro models offer improvements to battery life, and they have a USB-C port and support for up to 25W MagSafe charging.\nOther features include IP68 water resistance, 8GB RAM, ProMotion 120Hz refresh rate for the display, faster 5G, a second-generation Ultra Wideband chip, faster USB-C charging, and Wi-Fi 7.\nKey Features:\n- Highest end, highest price\n- Triple-lens camera: Main (Wide), Ultra Wide, and Telephoto (5x for the Max)\n- 48-megapixel Main lens with ProRAW support\n- 48-megapixel Ultra Wide lens with macro capability\n- Camera Control button\n- A18 Pro chip\n- Action button\n- Always-On Display\n- Titanium frame\nBottom Line: The iPhone 16 Pro and iPhone 16 Pro Max are the iPhones to choose if you want the absolute best camera capabilities that you can get in an iPhone, with the Pro Max being the top-of-the-line model due to its increased display size, and longer battery life. In terms of performance, there isn't much of a difference between the iPhone 16 Pro models and the standard iPhone 16 models, with screen size, display quality, and chassis material differentiating the two iPhone lines.\niPhone 16 and iPhone 16 Plus ($799+)\nSold alongside the iPhone 16 Pro and iPhone 16 Pro Max, the iPhone 16 and iPhone 16 Plus are Apple's more affordable flagship devices. The iPhone 16 and 16 Plus feature many of the same capabilities as the Pro models, but they are missing some of the higher-end features to keep the price lower. The 6.1-inch iPhone 16 is priced starting at $799, while the 6.7-inch iPhone 16 Plus is priced starting at $899.\nDespite the difference in screen size, the iPhone 16 and 16 Plus are essentially identical, featuring a flat-edged design with a glass body and an aluminum frame. They do not offer ProMotion display technology and thus do not support an always-on display, but they do have the same Dynamic Island, front-facing camera, and Face ID authentication functionality.\nApple brought the Action button to the iPhone 16 lineup this year, so that is no longer a Pro-only feature. The Action button replaces the Ring/Silent switch, and it is customizable, so you can set it to bring up whatever is most convenient for you. It can mute/unmute your iPhone, activate the flashlight, open a favorite app, activate a Control Center control, turn on a Focus mode, and more.\nLike the iPhone 16 Pro models, the iPhone 16 and iPhone 16 Plus have a new Camera Control button below the power button. Pressing the button activates the camera, and a double press snaps a photo, so it makes it much quicker to get the shot that you want. The button is capacitive and pressure sensitive, so it can be used for changing various camera settings and swapping between tools. It works much like a DSLR shutter for autofocus with a half press, and you can adjust exposure, style, zoom, aperture, and more without ever touching the iPhone's display.\nWhile the iPhone 16 Pro models have an A18 Pro chip, the iPhone 16 models have an almost-as-capable A18 chip that also works with Apple Intelligence. The A18 has the same 6-core CPU and 16-core Neural Engine, but it has a 5-core GPU instead of a 6-core GPU. The chip is built using the same 3-nanometer technology, and it enables support for ray tracing and console-quality games, a feature that was previously limited to the Pro models. Battery life has improved compared to the prior iPhone 15 models thanks to the new chip technology.\nThere is a dual camera system that features 12-megapixel Ultra Wide and 48-megapixel Fusion (Wide) lenses with no Telephoto lens. The primary camera can be cropped in to a 2x zoom, so 0.5, 1x, and 2x options are supported. Some of the same photography and videography capabilities that are in the Pro models are also in the standard iPhone 16 models, including the new Photographic Styles for customizing your images and Audio Mix for adjusting the sound in your videos, plus support for shooting spatial videos and images.\nCapturing video in 4K at 120 frames per second is a Pro-only feature, as is support for shooting in ProRAW and ProRes, so if those are capabilities you need, you'll want to look at the Pro models.\nThe iPhone 16 models have support for mmWave (U.S. only) and Sub-6GHz 5G, and they also have a USB-C port and offer MagSafe charging at up to 25W, a new, faster speed this year. Crash Detection, Emergency SOS via satellite, and Messages via satellite are available as well. Compared to the Pro models, the standard models lack the titanium chassis, the Telephoto camera lens, and the A18 Pro chip.\nKey Features:\n- Dual-lens camera: Fusion (Wide), Ultra Wide\n- Crash Detection\n- USB-C port\n- Action button\n- Camera Control\n- A18 chip\nBottom Line: The iPhone 16 and 16 Plus offer many of the same features as the iPhone 16 Pro and 16 Pro Max at a more affordable price, and these are the iPhones that we recommend for most people. The differences are limited primarily to the camera and the display, and may not be of interest for those who are not heavily invested in iPhone photography, making the $200+ savings worth it for most. Older iPhones are another option to save money, but be aware that only the four iPhone 16 models and the prior-generation iPhone 15 Pro and Pro Max support Apple Intelligence.\niPhone 16e ($599+)\nPriced starting at $599, the iPhone 16e is similar in design to the iPhone 16, but it is actually modeled after the iPhone 14. It has an all-display design with Face ID, but it has an older-style notch rather than a Dynamic Island.\nThe iPhone 16e has a 6.1-inch OLED display like the iPhone 16, and it has the same 8GB RAM and A18 chip that supports Apple Intelligence, though there is one less GPU core. It is the first iPhone with Apple's new C1 modem, which is more efficient than Qualcomm's comparable X71 modem in the iPhone 16. While there is no mmWave 5G support, there seems to be no compromise to the more widespread sub-6GHz Wi-Fi speeds.\nThere is a single-lens rear camera in the iPhone 16e, and it is the same as the 48-megapixel Wide camera in the iPhone 16. It can take 1x and 2x photos, but there is no 0.5x option and no 5x zoom as there is in the iPhone 16 Pro models.\nThe iPhone 16e has the longest battery life of any 6.1-inch iPhone, and the battery lasts for up to 26 hours when watching video. It charges via USB-C, but it does not support MagSafe and wireless charging is limited to 7.5W. Not being able to use MagSafe is one of the main downsides to the iPhone 16e.\nIt is also worth noting that there is no Ultra Wideband chip for Precision Finding in the Find My app, and it is limited to Wi-Fi 6, so it will not connect to the 6GHz networks available with Wi-Fi 6E and Wi-Fi 7 routers.\nOther features include Crash Detection, Emergency SOS via Satellite, and Messages via Satellite, but these are also features available with other iPhone 16 models.\nKey Features:\n- Face ID\n- A18 chip\n- Lower price\nBottom Line: The iPhone 16e is now Apple's lowest-price iPhone, and it is worthwhile if you can live without a dual-lens camera system, faster Wi-Fi connectivity, and MagSafe. It has many of the same features as the iPhone 16 at a $200 lower price point.\niPhone 15 and iPhone 15 Plus ($699+)\nThe iPhone 15 and iPhone 15 Plus are Apple's prior-generation flagship devices that are now being sold at a discount. They have older technology and are lacking some of the new features that Apple introduced with the iPhone 16 models, including the Camera Control button, the faster A-series chip, the Action button, and, most importantly, support for Apple Intelligence. The iPhone 15 and iPhone 15 Plus cannot run the new Apple Intelligence features in iOS 18, so only consider Apple's prior-generation iPhones if that is not important to you.\nThe iPhone 15 models don't look notably different from the iPhone 16 models, except for the color options. Apple did not make major design changes, but the iPhone 15 models do not have a Camera Control button and they have a Ring/Silent switch instead of an Action button. There's also a diagonal rear camera setup that does not offer some of the newer camera capabilities like Photographic Styles for customizing the look of your images or Audio Mix for tweaking the sound in your videos.\nWhile the iPhone 15 and 15 Plus don't support some of the newer software-based camera features, the hardware is largely the same. There's a Main (Wide) lens that supports 1x and 2x zoom, and an Ultra Wide lens. There is no dedicated Telephoto lens.\nThe iPhone 15 measures in at 6.1 inches, while the iPhone 15 Plus is 6.7 inches. The two devices are essentially identical, with a Dynamic Island for Face ID, aluminum frames, and OLED screen technology. The iPhone 15 and iPhone 15 Plus have an older A16 chip that is two generations behind the newer chips in the current flagship models.\nThe iPhone 15 models have support for mmWave (U.S. only) and Sub-6GHz 5G and use the X70 Qualcomm chip, one generation behind the Qualcomm chip in the new iPhones. Battery life is a little shorter, but the iPhone 15 models do support MagSafe and USB-C. There is no support for the faster 25W MagSafe charging, though, with the iPhone 15 models limited to 15W MagSafe charging.\nBetween the iPhone 15 and 15 Plus, the features are identical with the exception of screen size and battery, as the iPhone 15 Plus can accommodate a larger battery size.\nKey Features:\n- Diagonal dual-lens camera: Main (Wide), Ultra Wide\n- Crash Detection\n- USB-C port\n- Dynamic Island\n- 5G support\n- A16 chip\nBottom Line: The iPhone 15 and 15 Plus are solid devices that will perform well at an affordable price, but keep in mind that the iPhone 16 is such a notable upgrade that it may be worth paying $100 more for the iPhone 16 this year. The iPhone 15 models do not have an Action button or a Camera Control button, and they cannot run the Apple Intelligence features in iOS 18, so you'd be missing out on the more capable Siri, customizable emoji, Writing Tools, and other Apple Intelligence functions. A prior-generation iPhone is usually a good way to save money, but this year, we don't recommend it.\nFrequently Asked Questions\nThere's no one single iPhone that's best for everyone, and picking the right smartphone needs to take into account factors like budget, desired battery life, preferred feature set, and more.\nIf you want the absolute best photographic capabilities for example, you're going to want the iPhone 16 Pro or iPhone 16 Pro Max, and if you want something that has a solid feature set at a great price, the iPhone 16e is what you'll want to look at.\nBelow, we've outlined some of the best iPhone choices based on different scenarios or features that you might be looking for.\nWhich iPhone Has the Best Battery Life?\nWith the efficient A18 Pro chip, the iPhone 16 Pro Max has the longest battery life for any iPhone to date at up to 33 hours when watching videos. The iPhone 16 Pro and iPhone 16 Plus are second and will last up to 27 hours when watching videos. The iPhone 16e lasts for up to 26 hours when watching videos, and it is the smallest of the bunch at 6.1 inches.\nWhich iPhone Has the Best Camera?\nWith their updated triple-lens camera systems, 48-megapixel Fusion lens, 5x Telephoto lens, 48-megapixel Ultra Wide lens, and LiDAR Scanners, the iPhone 16 Pro and iPhone 16 Pro Max have the best iPhone cameras that you can get. Both of the new iPhones include a three-lens camera system with the same feature set. This year, the Ultra Wide lens has been upgraded to 48 megapixels, allowing for more detailed wide-angle and macro shots.\nThe Fusion lens supports 24-megapixel and 48-megapixel high-resolution photos through the Photonic Engine, and the Ultra Wide lens supports 12-megapixel images that have the detail from the combined pixels of the 48-megapixel resolution. Using computational photography, the Fusion camera can be set to 24mm, 28mm, and 35mm focal lengths to better mirror what's possible with DSLRs.\nAll four iPhone 16 models have a new Camera Control button that makes it easier to capture a photo or a video with just a couple of button presses, and the Camera Control button is also capacitive and pressure sensitive so it can be used for changing photography modes and adjusting settings, which makes your iPhone feel more like a camera.\nWhich iPhone Has Touch ID?\nUnfortunately, none of Apple's iPhones have Touch ID. It has been phased out, and Face ID is the only option.\nWhich iPhone is Best For One-Handed Use?\nThe iPhone 16 and the iPhone 16e both measure in at 6.1 inches, and they are the smallest iPhones that Apple makes. They won't work for one-handed use for everyone, but they are a better option than the 16 Plus and 16 Pro Max.\nWhich iPhone is the Best Value?\nWith Apple Intelligence support, a 48-megapixel camera, OLED display, and 5G connectivity for $599, the iPhone 16e is the best deal that Apple offers. If you need faster mmWave 5G speeds, Wi-Fi 7 connectivity, MagSafe, and an Ultra Wide camera, the $799 iPhone 16 is the upgrade option.\nIf you don't need the latest bells and whistles like Apple Intelligence and don't mind losing out on a bit of performance and battery life, the iPhone 15 and 15 Plus, which are $100 cheaper than than their iPhone 16 counterparts, could be worth considering.\nFor many people, the iPhone 16 and iPhone 16e are the iPhones to get this year with their lower price point and modern feature set.\nWhich iPhone Has the Most Features?\nIf you want the iPhone with the most bells and whistles, that's the iPhone 16 Pro and iPhone 16 Pro Max. These iPhones offer OLED displays, triple-lens cameras, glass bodies with titanium steel frames, larger maximum storage capacities, and longer battery life.\nCompared to the iPhone 16 models, the iPhone 16 Pro and Pro Max have better camera capabilities. The absolute best would be the iPhone 16 Pro Max because of its larger display and bigger battery.\nIn More Detail\nStill not sure? We have deeper dives comparing the iPhone 16 models to each other and to the prior-generation iPhone models, and the standard iPhone 16 to the Pro.\n- iPhone 16 vs. iPhone 16 Pro Buyer's Guide: All Differences Compared\n- iPhone 15 vs. iPhone 16 Buyer's Guide: 30+ Upgrades Compared\n- iPhone 15 Pro vs. iPhone 16 Pro Buyer's Guide: 45+ Upgrades Compared\n- iPhone 15 vs. iPhone 16e Buyer's Guide: 25+ Differences Compared\n- iPhone 16e vs. iPhone 16 Buyer's Guide: 25+ Differences Compared\nFor full details on each phone, explore our roundups:\nUpcoming iPhone Rumors\nApple is working on new iPhone 17 models that will come out in the fall of 2025. This lineup will do away with the \"Plus\" iPhone, with Apple instead planning to release an \"Air\" or \"Slim\" model that is thinner and more expensive. It will be sold alongside the standard iPhone 17, the iPhone 17 Pro, and the iPhone 17 Pro Max. For more information, check out our roundups:\nGuide Feedback\nHave questions about choosing an iPhone, notice something we left out, or want to offer feedback on this guide? Send us an email here."
    },
    {
      "url": "https://www.macrumors.com/2025/08/06/apple-american-manufacturing-program/",
      "text": "Apple Announces American Manufacturing Program, Promises to Spend $600 Billion\nApple today said that it would increase its investment in U.S. manufacturing to $600 billion, pledging an additional $100 billion on top of the $500 billion it promised to spend in the U.S. across four years earlier this year.\n\"Today, we're proud to increase our investments across the United States to $600 billion over four years and launch our new American Manufacturing Program,\" said Tim Cook, Apple's CEO. \"This includes new and expanded work with 10 companies across America. They produce components that are used in Apple products sold all over the world, and we're grateful to the President for his support.\"\nApple is establishing the American Manufacturing Program (AMP), which the company says is dedicated to bringing advanced manufacturing to the United States. AMP partners include Corning, Coherent, GlobalWafers America, Applied Materials, Amkor, Texas Instruments, Samsung, GlobalFoundries, and Broadcom.\nApple plans to use $2.5 billion of the AMP funding to expand its partnership with Corning. Corning and Apple are working together to create the \"world's largest and most advanced smartphone class production line\"\nin Corning's Kentucky factory. Apple says that 100 percent of the cover glass on\niPhone and Apple Watch models sold worldwide will be made in the U.S. \"soon.\" Apple and Corning are also going to open an \"Apple-Corning Innovation Center\" that will develop advanced materials and next-generation manufacturing platforms.\nApple is also working with several other companies to expand U.S. manufacturing, with a full list available on Apple's website.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nPopular Stories\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to...\niOS 26 introduces an Adaptive Power Mode on the iPhone, alongside the existing Low Power Mode.\nApple says that Adaptive Power Mode can make \"small performance adjustments\" when necessary to extend an iPhone's battery life, including slightly lowering the display brightness or allowing some activities to \"take a little longer.\"\nThe full description of Adaptive Power Mode, from the iOS 26...\nThe latest iOS 26 beta includes imagery that confirms Apple's work on a new version of the Apple Watch Ultra, which is set to come out this fall. MacRumors contributor Aaron Perris found an Apple Watch image with a resolution that does not correspond to any current Apple Watch models.\nThe image suggests that the upcoming Apple Watch Ultra 3 could have a slightly larger display size, with a...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nApple is still on track to release a new Apple TV model later this year, according to a reliable source speaking to MacRumors.\nAccording to a source familiar with the company's plans, Apple is highly likely to replace the current Apple TV 4K with a new model later this year. The current model will be discontinued.\nToday's Apple TV 4K came out in 2022, featuring the A15 Bionic chip,...\nGoogle today used Apple's Siri failure to lure customers to the upcoming Pixel 10 series, sharing an ad that calls out the delayed Apple Intelligence Siri functionality.\nWith the spot, Google is shaming Apple for the misstep, suggesting Apple users should purchase a Pixel 10 smartphone instead.If you buy a new phone because of a feature that's coming soon...\nBut it's been coming soon for...\nApple seeded the fifth developer beta of iOS 26 today, and while the number of significant changes has dropped, there are quite a few smaller tweaks. Apple is continuing to refine button placement, animations, and design in preparation for launching iOS 26 in September.\nCamera\nApple added a toggle in the Camera app to allow users to toggle on Classic Mode, a setting that reverses the scroll ...\nApple today released a firmware update for the 25W MagSafe Charger that is compatible with the iPhone 12 and later and the latest AirPods. The new firmware is version 2A168, up from the 2A146 firmware that came out last year. In the Settings app, the new firmware is version 148, up from 136.\nApple introduced the 2024 MagSafe charger alongside the iPhone 16 models back in September, and it is ..."
    }
  ],
  "argos_summary": "Apple is collaborating with Samsung to manufacture next-generation image sensor chips for future iPhone models at a Texas facility, moving away from its previous reliance on Sony. The new chips, featuring a three-layer stacked architecture, promise enhanced pixel density and low-light performance, and are expected to debut in the iPhone 18 lineup in 2026. Additionally, Apple plans to introduce a foldable iPhone alongside the iPhone 18 Pro models, with a launch strategy that staggers the release of higher-end and more affordable models.",
  "argos_id": "4PL5JNH4X"
}