{
  "url": "https://www.newsmax.com/finance/streettalk/jobs-labor-productivity/2025/08/07/id/1221618/",
  "authorsByline": "Dan Burns",
  "articleId": "daa60cb8592b400bb903f709a33ff471",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=fcfacf51-db75-4334-b7a3-2e79ce61e1d2&SiteName=Newsmax",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T08:45:30-04:00",
  "addDate": "2025-08-07T12:54:07.957884+00:00",
  "refreshDate": "2025-08-07T12:54:07.957886+00:00",
  "score": 1.0,
  "title": "Unemployment Claims Tick up, Productivity Improves",
  "description": "The number of Americans filing new applications for unemployment benefits ticked higher last week, suggesting the labor market was largely stable even though job creation is weakening and it is taking laid-off workers longer to find new jobs.",
  "content": "The number of Americans filing new applications for unemployment benefits ticked higher last week, suggesting the labor market was largely stable even though job creation is weakening and it is taking laid-off workers longer to find new jobs.\n\nInitial claims for state unemployment benefits rose 7,000 to a seasonally adjusted 226,000 for the week ended August 2, the Labor Department said on Thursday. Economists polled by Reuters had forecast 221,000 claims for the latest week.\n\nThe labor market has slowed, with government data last week showing far fewer jobs were created in July than economists had expected as uncertainty over President Donald Trump's tariffs left businesses wary of adding workers.\n\nMoreover, employment gains in the previous two months were revised lower by nearly 260,000, a stunning reversal that prompted Trump to fire the head of the Bureau of Labor Statistics — a move that rattled investors and economists already anxious about the eroding quality of official U.S. economic data.\n\nThe latest data on new claims indicates employers are not yet turning to large-scale layoffs as the economy loses steam but are managing through attrition. That has helped keep the unemployment rate, at 4.2% in July, relatively low even while job growth has slowed.\n\nDeclining labor supply amid the White House's immigration crackdown is also helping to stave off a jump in the jobless rate. Employers' hesitancy to increase hiring means there are fewer jobs for those being laid off. The number of people receiving benefits after an initial week of aid, a proxy for hiring, rose to a seasonally adjusted 1.974 million during the week ending July 26, the claims report showed.\n\nMeanwhile, the Labor Department also said worker productivity rebounded in the second quarter, easing a surge in labor costs at the start of the year.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new jobs",
      "weight": 0.093655564
    },
    {
      "name": "Unemployment Claims",
      "weight": 0.09223598
    },
    {
      "name": "last week",
      "weight": 0.09148832
    },
    {
      "name": "new claims",
      "weight": 0.09052799
    },
    {
      "name": "fewer jobs",
      "weight": 0.08710474
    },
    {
      "name": "unemployment benefits",
      "weight": 0.08590388
    },
    {
      "name": "state unemployment benefits",
      "weight": 0.08558279
    },
    {
      "name": "Initial claims",
      "weight": 0.08454253
    },
    {
      "name": "job creation",
      "weight": 0.08162413
    },
    {
      "name": "job growth",
      "weight": 0.07910731
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Unemployment"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.93603515625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.467041015625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.433837890625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.42236328125
    }
  ],
  "sentiment": {
    "positive": 0.027191162,
    "negative": 0.9199219,
    "neutral": 0.05303955
  },
  "summary": "The number of Americans applying for state unemployment benefits increased by 7,000 to a seasonally adjusted 226,000 for the week ending August 2, according to the Labor Department. This increase comes despite job creation slowing and taking laid-off workers longer to find new jobs. The Labor Department also noted that worker productivity rebounded in Q2, easing labor costs at the start of the year. The jobless rate remained at 4.2% in July, largely due to the uncertainty surrounding President Donald Trump's tariffs and the revised employment gains in the previous two months being revised lower by nearly 260,000, leading to the firing of the head of the Bureau of Labor Statistics.",
  "shortSummary": "US unemployment benefits rose to 226,000 last week, indicating the labor market remains stable despite slowing job creation and increased worker productivity amid economic uncertainties.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d83da1a7dfa34872a575eb1b3b30f041",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The number of Americans filing for unemployment benefits increased by 7,000 to 226,000, indicating a stable labor market despite weakening job creation and longer job search times for laid-off workers. The labor market has slowed, with fewer jobs created in July than expected, and previous employment gains revised down significantly. However, the unemployment rate remains low at 4.2%, partly due to a declining labor supply from immigration policies and employers managing attrition rather than large-scale layoffs.",
  "argos_id": "4X75DQ7M8"
}