{
  "url": "https://www.benzinga.com/analyst-stock-ratings/analyst-color/25/08/46963503/eli-lillys-rare-weight-loss-data-miss-could-benefit-competitors",
  "authorsByline": "Vandana Singh",
  "articleId": "772cf1c809e24effaa78a7fb3b0a1e8c",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/07/Diet-And-Dieting--Beauty-Slim-Female-Bod.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T09:55:56-04:00",
  "addDate": "2025-08-07T13:59:08.062884+00:00",
  "refreshDate": "2025-08-07T13:59:08.062888+00:00",
  "score": 1.0,
  "title": "Why Are Weight-Loss Stocks Gaining Thursday? - Viking Therapeutics (NASDAQ:VKTX), Novo Nordisk (NYSE:NVO), Structure Therapeutics (NASDAQ:GPCR), Terns Pharma (NASDAQ:TERN)",
  "description": "Eli Lilly's obesity drug data misses targets, boosting shares of Novo Nordisk, Viking, Structure, and Terns amid promising trial updates.",
  "content": "On Thursday, Eli Lilly and Co.’s LLY weight loss rival Novo Nordisk A/S NVO, along with smaller firms, Terns Pharmaceuticals, Inc. TERN, Viking Therapeutics Inc. VKTX, and Structure Therapeutics Inc. GPCR are trading higher.\n\nLilly released topline data from the Phase 3 ATTAIN-1 trial evaluating orforglipron that showed an average weight loss of 12.4% (27.3 lbs) compared to 0.9% (2.2 lbs) with placebo, below the 15% expectations. Orforglipron could be the first small-molecule weight-loss pill if it launches in 2026.\n\nWilliam Blair analysts described this as a “once-in-a-blue-moon” miss for Lilly’s otherwise dominant obesity franchise. They highlighted that orforglipron’s 9.1% placebo-adjusted weight loss at the 36 mg dose underperformed compared to weekly subcutaneous Wegovy, which delivers 12–13% weight loss.\n\nAlso Read: Trump Administration Plan Signals Shift Toward Weight-Loss Drug Coverage For Medicare Patients\n\nAdditionally, gastrointestinal side effects were comparable to Wegovy, but orforglipron had a higher treatment discontinuation rate (5.1–10.3% vs. 7.0% for Wegovy, 2.6% for placebo).\n\nThey also noted early plateauing of weight loss and persistent side effects as potential liabilities for orforglipron, as previously flagged during the ACHIEVE-1 presentation at the American Diabetes Association.\n\nThis rare underperformance opens the door for smaller biopharma competitors, analyst Andy Hsieh of William Blair noted.\n\n“From a stock perspective, we believe that Eli Lilly’s rare miss from its otherwise impenetrable obesity franchise could create an opening for smaller competitors,” he added.\n\nNovo Nordisk’s oral semaglutide 25 mg achieved a 16.6% weight loss vs. a 2.7% reduction with placebo after 68 weeks. CagriSema achieved a weight loss of 22.7% after 68 weeks in one study and 15.7% in another.\n\nViking is expected to report Phase 2 VENTURE-Oral results of the oral tablet formulation of VK2735 in obesity in the second half of 2025. Analyst Andy Hsieh expects the data readout could be as early as later this month.\n\nResults from a 28-day Phase 1 multiple ascending dose trial of VK2735 in healthy volunteers with a BMI ≥30 demonstrated dose-dependent reductions in mean body weight from baseline, ranging up to 8.2%.\n\nPersistent weight loss effects were observed at follow-up visits through Day 57, ranging up to 8.3% from baseline, four weeks after the last dose of VK2735 was administered.\n\nStructure Therapeutics, which is advancing the oral small molecule aleniglipron that resembles orforglipron but with a shorter half-life, is expected to report results from two Phase 2 studies, ACCESS and ACCESS II, in the fourth quarter.\n\nStructure Therapeutics is also conducting three new aleniglipron clinical studies as planned, which will generate additional data to competitively position aleniglipron and further support the design of the Phase 3 program.\n\nIn June 2024, Structure Therapeutics unveiled 12-week topline obesity data from its Phase 2a study of GSBR-1290.\n\nIn the Phase 2a obesity study, GSBR-1290 demonstrated a clinically meaningful and statistically significant placebo-adjusted mean decrease in weight of 6.2% at 12 weeks.\n\nTern is developing TERN-601, an oral glucagon-like peptide-1 receptor agonist (GLP1-RA) for obesity. The Phase 2 FALCON trial enrollment completed in the second quarter of 2025 and topline 12-week data is expected in the early fourth quarter of 2025.\n\nPhase 1 trial data in healthy subjects showed TERN-601 was well tolerated and demonstrated dose-dependent, statistically significant placebo-adjusted mean weight loss across all three doses evaluated in the 28-day MAD study, with maximum placebo-adjusted mean weight loss of 4.9% at the highest dose of 740 mg QD.\n\nPrice Action: VKTX stock is up 11.2% at $35.46, TERN stock is up 3.70% at $5.88, NVO stock is up 7.47% at $48.79, and GPCR stock is up 7.36% at $17.58 at last check Thursday.\n• Cathie Wood Shouts Out Shopify’s Smart AI Moves In Retail, Says It’s ‘Seizing The Agentic AI Moment:’ SHOP Stock Gained Over 44% In 2025",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/general/biotech/25/04/44791986/whats-going-on-with-viking-therapeutics-structure-therapeutics-stock-on-monday",
    "https://www.benzinga.com/markets/earnings/25/08/46960692/eli-lillys-closely-watched-obesity-pill-orforglipron-shows-around-12-weight-loss-but-trails-novo-nordisk",
    "https://www.benzinga.com/pressreleases/24/06/g39133591/structure-therapeutics-reports-positive-topline-data-from-its-phase-2a-obesity-study-and-capsule-t",
    "https://www.benzinga.com/markets/equities/25/08/46960538/cathie-wood-shouts-out-shopifys-smart-ai-moves-in-retail-says-its-seizing-the-agentic-ai-moment-shop-stock-gained-over-44-in-2025",
    "https://www.benzinga.com/pressreleases/25/08/g46871051/terns-pharmaceuticals-reports-second-quarter-2025-financial-results-and-provides-corporate-updates",
    "https://www.benzinga.com/pressreleases/25/08/g46923833/structure-therapeutics-reports-second-quarter-2025-financial-results-and-recent-highlights",
    "https://www.benzinga.com/news/health-care/25/08/46798430/trump-administration-plan-signals-shift-toward-weight-loss-drug-coverage-for-medicare-patients",
    "https://www.benzinga.com/25/05/45252150/novo-nordisk-expects-fda-decision-for-oral-wegovy-by-end-of-2025-reports-mixed-q1-earnings",
    "https://www.benzinga.com/analyst-ratings/analyst-color/24/06/39144875/structure-therapeutics-obesity-candidate-is-very-competitive-to-eli-lillys-orforgli",
    "https://www.benzinga.com/news/health-care/25/06/46050655/novo-nordisks-weight-loss-injection-cagrisema-data-sparks-investors-concern",
    "https://www.benzinga.com/pressreleases/25/03/n44490486/viking-therapeutics-announces-completion-of-enrollment-in-phase-2-venture-oral-dosing-trial-of-vk2",
    "https://www.benzinga.com/topic/weight-loss",
    "https://www.benzinga.com/markets/equities/24/09/40773628/terns-pharmaceuticals-oral-glp-1-reaches-phase-1-finish-line-with-encouraging-weight-loss-data-a"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "weight loss",
      "weight": 0.109032206
    },
    {
      "name": "Persistent weight loss effects",
      "weight": 0.10276996
    },
    {
      "name": "mean body weight",
      "weight": 0.085855946
    },
    {
      "name": "weight",
      "weight": 0.0839829
    },
    {
      "name": "maximum placebo-adjusted mean weight loss",
      "weight": 0.07246528
    },
    {
      "name": "12–13% weight loss",
      "weight": 0.07246022
    },
    {
      "name": "Structure Therapeutics Inc. GPCR",
      "weight": 0.070648536
    },
    {
      "name": "Structure Therapeutics Inc.",
      "weight": 0.06921415
    },
    {
      "name": "Structure Therapeutics",
      "weight": 0.06757354
    },
    {
      "name": "Viking Therapeutics Inc. VKTX",
      "weight": 0.06739812
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Nutrition"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9482421875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9462890625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93408203125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.8798828125
    }
  ],
  "sentiment": {
    "positive": 0.31347656,
    "negative": 0.35986328,
    "neutral": 0.32666016
  },
  "summary": "On Thursday, shares of several weight-loss companies, including Viking Therapeutics (NASDAQ:VKTX), Novo Nordisk (NYSE:NVO), Structure Therapeutic (NASdaq:GPCR), Terns Pharmaceuticals, Inc. TERN, Viking Theraputics Inc. VKTX, and Structure Theraputic Inc. GPCR are trading higher following Lilly's release of data from the Phase 3 ATTAIN-1 trial evaluating orforglipron, which showed an average weight loss of 12.4% (27.3 lbs) compared to 0.9% (2.2 lbs) with placebo, below the 15% expectations. William Blair analysts described this as a “once-in-a-blue-moon” miss for Lilly’s otherwise dominant obesity franchise. They highlighted that the 9.1% placebo-adjusted weight loss at the 36 mg dose underperformed compared to weekly subcutaneous Wegovy, which delivers 12-13% weight loss. They also noted early plateauing of weight loss and persistent side effects as potential liabilities for the drug. The underperformance could open the door for smaller biopharma competitors.",
  "shortSummary": "Despite disappointing weight loss data, Viking Therapeutics, Novo Nordisk, and Terns Pharmaceuticals are higher, with potential future drug launches expected as a result.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "80fd08ccf9584bfa8ed70ac68afec95e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/topic/weight-loss",
      "text": "España\nItalia\n대한민국\n日本\nFrançais\nMy Account\nBenzinga Edge\nBenzinga Research\nBenzinga Pro\nLogin\nGet Benzinga Pro\nData & APIs\nEvents\nPremarket\nAdvertise\nContribute\nEspaña\nItalia\n대한민국\n日本\nFrançais\nLogin\nRegister\nOur Services\nNews\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nLegal\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nForex\nCommodities\nBinary Options\nBonds\nFutures\nCME Group\nGlobal Economics\nMining\nPreviews\nSmall-Cap\nReal Estate\nPenny Stocks\nDigital Securities\nVolatility\nOptions\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nIdeas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nFrom The Press\nJim Cramer\nRumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nCrypto\nNews\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nLegal\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nForex\nCommodities\nBinary Options\nBonds\nFutures\nCME Group\nGlobal Economics\nMining\nPreviews\nSmall-Cap\nReal Estate\nPenny Stocks\nDigital Securities\nVolatility\nOptions\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nIdeas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nFrom The Press\nJim Cramer\nRumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nCrypto\nResearch\nMy Stocks\nTools\nFree Benzinga Pro Trial\nCalendars\nAnalyst Ratings Calendar\nConference Call Calendar\nDividend Calendar\nEarnings Calendar\nEconomic Calendar\nFDA Calendar\nGuidance Calendar\nIPO Calendar\nM&A Calendar\nSPAC Calendar\nStock Split Calendar\nTrade Ideas\nFree Stock Reports\nInsider Trades\nTrade Idea Feed\nAnalyst Ratings\nUnusual Options Activity\nHeatmaps\nFree Newsletter\nGovernment Trades\nPerfect Stock Portfolio\nEasy Income Portfolio\nShort Interest\nMost Shorted\nLargest Increase\nLargest Decrease\nCalculators\nMargin Calculator\nForex Profit Calculator\n100x Options Profit Calculator\nScreeners\nStock Screener\nTop Momentum Stocks\nTop Quality Stocks\nTop Value Stocks\nTop Growth Stocks\nRecent\nMarkets\nWeight Loss\nEXCLUSIVE: Vivani Prioritizes Semaglutide-Based Implant After Promising Preclinical Data\nCongress Sounds Alarm Over Illegal Weight-Loss Drug Imports From China\nJudge Rules Mylan Did Not Infringe Novo Nordisk Patent In Wegovy Generic Case\nCongress Sounds Alarm Over Illegal Weight-Loss Drug Imports From China\nJudge Rules Mylan Did Not Infringe Novo Nordisk Patent In Wegovy Generic Case\nAmylyx Drug Slashes Sugar Spikes Post-Weight Loss Surgery\nZepbound Powers Eli Lilly's Upbeat Q2 Outlook\nAmylyx Drug Slashes Sugar Spikes Post-Weight Loss Surgery\nZepbound Powers Eli Lilly's Upbeat Q2 Outlook\nDoes Higher Dose Of Wegovy Result In More Weight Loss? Novo Nordisk Seeks European Approval\nWeightWatchers Sheds $1.15 Billion In Debt To Fuel Transformation\nRead More...\nWeight Loss Recent News\nNovo Nordisk Ignored Internal Warnings On Wegovy Launch Preparedness: Report\nNovo Nordisk executives overlooked warnings ahead of Wegovy's launch, leading to supply issues, high costs, and challenges competing with Eli Lilly's Zepbound.\nSpain Accuses Novo Nordisk Of Covert Advertising For Prescription Weight-Loss Drugs\nMHRA launches genetic study into GLP-1 drug risks as Spain investigates Novo Nordisk for potential advertising violations.\nUS Adults Struggle With Long-Term Use Of Obesity Drugs Like Wegovy, Data Shows\nGLP-1 obesity drug use is rising, but long-term adherence remains low. While one-year persistence has improved in 2024, only 8.1% stayed on therapy for three years.\nWhat's Going On With Viking Therapeutics Stock On Wednesday?\nViking Therapeutics begins Phase 3 trials for VK2735, testing weekly injections in over 5,000 adults with obesity or type 2 diabetes over 78 weeks.\nAnalyst Views Mixed As Amgen's Weight Loss/Diabetes Drug MariTide Shows Promise But Has Dose Issues\nAmgen's MariTide showed strong weight loss and metabolic gains in Phase 2, with no new safety signals as Phase 3 trials begin in obesity and T2D.\nNovo's India Move Could Reshape The Weight-Loss Drug War With Eli Lilly\nNovo Nordisk launches Wegovy in India, pricing it close to Eli Lilly's Mounjaro, while advancing global regulatory efforts for its GLP-1 portfolio.\nHims CEO Slams Novo Nordisk For 'Anticompetitive Demands' After Ozempic Maker Abruptly Ends Partnership: 'We Refuse To Be Strong-Armed'\nHims & Hers Health CEO Andrew Dudum has accused Novo Nordisk of exerting anticompetitive pressure to prioritize its weight-loss drug Wegovy.\nAmgen (AMGN) Stock Falls After Mixed MariTide Trial Update\nAmgen shares are trading lower Monday afternoon. The company released full results from part one of its phase two study of MariTide.\nNovo Nordisk's Weight Loss Injection CagriSema Data Sparks Investor Concern\nNovo Nordisk's CagriSema achieved significant weight loss in phase 3 trials, though safety concerns may limit its edge over existing and pipeline rivals.\nEli Lilly's Investigational Oral Pill Shows Weight Loss Benefits With Lingering Side Effect Concerns\nEli Lilly's orforglipron reduced A1C and weight in type 2 diabetes, while weekly insulin efsitora matched daily insulin with fewer side effects.\nObesity Drugs Help With Weight Loss But Are Adding Fat Elsewhere\nThe U.S. trade deficit with Ireland has surged as $36 billion in hormone shipments for weight-loss and diabetes drugs were flown in to meet demand and avoid tariffs.\nScholar Rock's Atrophy Drug When Combined With Eli Lilly's Zepbound Shows Around 55% Better Muscle Preservation In Weight Loss Study\nScholar Rock's apitegromab helped preserve muscle mass during tirzepatide-induced weight loss, improving overall body composition in Phase 2 trial.\nEli Lilly Launches Flat Pricing For Zepbound, Capping Monthly Cost At $499\nEli Lilly expands Zepbound access with flat-rate pricing and new vial options, supporting wider obesity treatment access without insurance barriers.\nZepbound Put Eli Lilly On Top — Now Its Next Big Move Could Supercharge The Stock\nEli Lilly continues to dominate the obesity market with Zepbound and Orforglipron, leading JPMorgan to see it as a top pick with strong growth potential.\nNovo Nordisk Moves Amycretin Into Phase 3 Trials For Weight Management, Becomes Europe's Largest Company\nNovo Nordisk will begin phase 3 trials for amycretin in early 2026 following promising weight loss data and regulatory discussions.\nMcDonald's Just Got Hammered By Weight-Loss Drugs — Twice\nMcDonald's faces a potential decline in sales due to the weight loss medications. Other fast-food chains like Domino's and KFC are also at risk, while Taco Bell and Chipotle are better positioned.\nEli Lilly Inks Pact With Juvena Therapeutics To Develop Muscle-Boosting Drugs\nEli Lilly signed a licensing deal with Juvena for muscle health using its AI-enabled stem-cell protein screening platform.\nNovo Nordisk, Deep Apple Launch Drug Discovery Alliance For Weight Loss Oral Therapies\nNovo Nordisk and Deep Apple ink a deal to develop oral therapies targeting a novel GPCR for cardiometabolic diseases, including obesity.\nMetsera Stock Rises As Company Advances Obesity Pipeline With Encouraging Weight Loss Data\nMetsera's MET-233i shows sustained weight loss, long duration of action, and mild side effects in a Phase 1 trial, advancing its obesity treatment plans.\nEli Lilly's Obesity Drug Success Spurs Japanese Biotech's Anti-Muscle-Wasting Combo Therapy\nChugai plans to pair its muscle-preserving drug with Eli Lilly's orforglipron, addressing muscle loss in obesity care as the market expands rapidly.\nNovo Nordisk's Wegovy Tied To Increased Risk Of Rare Vision-Loss Disorder, European Regulators Say\nSemaglutide drugs now include rare vision risk warning as studies link long-term use to optic neuropathy, macular degeneration, and kidney cancer.\nHims & Hers ZAVA Acquisition Deal Expands Its Market Opportunity By $52 Billion: Analyst\nHims & Hers is acquiring digital health provider ZAVA to expand into Europe, aiming to boost revenue and international market reach by 2026.\nMounjaro Maker Eli Lilly Taps Swedish Firm Camurus To Target Long-Acting Obesity Market In $870-Million Deal\nCamurus licensed its FluidCrystal drug delivery tech to Eli Lilly for global development of long-acting incretin therapies targeting metabolic diseases."
    },
    {
      "url": "https://www.benzinga.com/markets/equities/25/08/46960538/cathie-wood-shouts-out-shopifys-smart-ai-moves-in-retail-says-its-seizing-the-agentic-ai-moment-shop-stock-gained-over-44-in-2025",
      "text": "Cathie Wood‘s ARK Invest is betting on Shopify Inc.‘s SHOP strategic focus on “agentic AI” because the firm believes it is paving the way for a new era of e-commerce.\nCheck out SHOP’s stock price here.\nWhat Happened: In a recent X post, Wood stated, “Based on its earnings report last night, $SHOP seems to be seizing the agentic AI moment in retail.”\nThis sentiment is backed by a detailed note from ARK Invest analysts Nicholas Grous and Varshika Prasanna, who argue that artificial intelligence is set to fundamentally reshape online commerce.\nThe ARK note, titled “Are Marketplaces Defensible In The Age Of AI Purchasing Agents?”, posits that AI purchasing agents will soon handle product discovery, comparison, and transactions on behalf of consumers.\nTo compete, retailers will need to adapt to a new paradigm of Agent-Oriented Optimization (AOO), similar to how Search Engine Optimization (SEO) was crucial for the early internet. According to the research, a new protocol called the Model Context Protocol (MCP) will be foundational for these AI agents.\nThis is where Shopify shines, as the ARK note explicitly highlights that Shopify natively supports MCP endpoints, a critical move that allows its merchants’ product data to be easily accessed by AI agents.\nThe analysts state, “Just as the rise of Google's Search Engine Optimization (SEO) transformed digital publishing, AI agents should give rise to Agent-Oriented Optimization (AOO).”\nWhy It Matters: Shopify’s partnerships with AI leaders like OpenAI and Microsoft Corp. MSFT further solidify this view.\nFor instance, the note mentions that Shopify is providing the foundation for OpenAI’s in-app checkout functionality, directly linking its platform to the agents that will drive future commerce.\nAs a result, Wood and her team see Shopify not just as an e-commerce platform, but as a key piece of infrastructure in the coming AI-driven retail landscape.\nShopify delivered a mixed second quarter with a revenue growth of 31% year-over-year to $2.68 billion, beating the analyst consensus estimate of $2.55 billion. Whereas, the e-commerce platform reported adjusted EPS of 35 cents, up 34.6% year-on-year, but missed the analyst consensus estimate of 29 cents.\nPrice Action: SHOP stock was up 0.14% in premarket on Thursday, but it was up 44.05% year-to-date and 142.45% over the past year.\nBenzinga's Edge Stock Rankings indicate that SHOP maintains a strong price trend in the long, short, and medium terms. However, the stock scores poorly on value rankings. Additional performance details are available here.\nThe SPDR S&P 500 ETF Trust SPY and Invesco QQQ Trust ETF QQQ, which track the S&P 500 index and Nasdaq 100 index, respectively, rose in premarket on Thursday. The SPY was up 0.59% at $636.49, while the QQQ advanced 0.76% to $571.61, according to Benzinga Pro data.\nRead Next:\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nPhoto: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/pressreleases/25/08/g46923833/structure-therapeutics-reports-second-quarter-2025-financial-results-and-recent-highlights",
      "text": "Topline data from oral small molecule GLP-1 receptor agonist aleniglipron ACCESS and ACCESS II\nstudies on track for year-end 2025 readouts\nAleniglipron clinical development program expanded to optimize competitive positioning and\nPhase 3 program\nOral small molecule amylin receptor agonist (ACCG-2671) Phase 1 initiation\nanticipated by year-end 2025\nStrong financial position with cash, cash equivalents and short-term investments of $786.5\nmillion as of June 30, 2025 expected to fund projected operations and key clinical milestones\nthrough at least 2027\nSAN FRANCISCO, Aug. 06, 2025 (GLOBE NEWSWIRE) -- Structure Therapeutics Inc. GPCR, a clinical-stage global biopharmaceutical company developing novel oral small molecule therapeutics for metabolic diseases, with a focus on obesity, today reported financial results for the second quarter ended June 30, 2025, and provided a business update.\n\"The ACCESS and ACCESS II studies for aleniglipron, our once-daily oral small molecule GLP-1 program, remain on track for topline data readouts by the end of the year,\" said Raymond Stevens, Ph.D., CEO of Structure Therapeutics. \"With our continued confidence in aleniglipron's profile, we have initiated additional supplementary studies to ensure we are well positioned for Phase 3 and to maximize the therapeutic and competitive potential of this program. By the end of 2025, we also plan to initiate the Phase 1 study of ACCG-2671, which we believe represents the most advanced oral small molecule amylin agonist in development. As the obesity field shifts towards combinability of multiple targets and long-term weight loss maintenance, we are excited to lead the way with a highly scalable pipeline of oral small molecule medicines designed to address the substantial unmet needs in obesity management and related metabolic diseases.\"\nRecent and Upcoming Milestones\nAleniglipron (GSBR-1290) - Oral Small Molecule Selective Glucagon-Like Peptide 1 (GLP-1) Receptor Agonist for the Treatment of Obesity and Overweight\nOngoing Phase 2b ACCESS and Phase 2 ACCESS II Studies\nThe fully enrolled ACCESS and ACCESS II studies are on track for topline 36-week data readouts by year-end 2025.\n- ACCESS enrolled approximately 220 adults living with obesity, or overweight with at least one weight-related comorbidity, and is designed to evaluate doses up to 120 mg of aleniglipron with a slower four-week titration schedule.\n- ACCESS II enrolled approximately 80 adults living with obesity, or overweight with at least one weight-related comorbidity, and is designed to evaluate higher doses of aleniglipron (180 mg and 240 mg) with a slower four-week titration schedule.\nExpanded Data Collection from ACCESS and ACCESS II Studies\nStructure Therapeutics has implemented extensions to the ongoing ACCESS and ACCESS II studies:\n- ACCESS Open Label Extension (OLE) – All patients in the Phase 2b ACCESS study are provided an option to roll over into the OLE and receive aleniglipron after completing the double-blinded randomized portion of the study. This will allow collection of data on longer-term weight loss effects, expand the overall safety database and provide aleniglipron access to patients enrolled in the blinded portion of the study who opt in to the extension.\n- ACCESS II Extension – Following the initial 36-week efficacy evaluation, patients will now continue on their assigned dose to 44 weeks, which allows for collection of an additional eight weeks of double-blinded safety, tolerability, and efficacy data in the study. Overall, this extension will provide additional longer-term data in the two potentially higher dose arms of 180 mg and 240 mg. Per protocol and as previously planned, a formal unblinded efficacy assessment at 36 weeks is expected by year-end 2025.\nThree Additional Aleniglipron Studies\nStructure Therapeutics is also conducting three new aleniglipron clinical studies as planned that will generate additional data to competitively position aleniglipron and further support the design of the Phase 3 program.\n- Phase 2 study to assess a maintenance switching strategy from an approved injectable GLP-1 receptor agonist to aleniglipron – Specifically, this maintenance switching study will evaluate the transition from an approved injectable GLP-1 receptor agonist to once-daily oral aleniglipron for weight loss maintenance. This study will assess the starting dose and the weight loss maintenance over 12 weeks. Enrollment is expected to start in the third quarter of 2025.\n- Phase 2 body composition study – This study will assess the effect of aleniglipron on body fat loss over a 40-week evaluation period. These data will be used to incorporate body composition endpoints into the Phase 3 program. Enrollment is expected to start in the third quarter of 2025.\n- Phase 2 study in patients with type 2 diabetes mellitus (T2DM) – This placebo-controlled study in patients with obesity or overweight and T2DM is anticipated to start in the fourth quarter of 2025. Data from the 38-week study may be used to support the inclusion of a cohort of T2DM in the Phase 3 obesity program.\nOral Small Molecule Amylin Receptor Agonists for the Treatment of Obesity or Overweight with Comorbidities\n- ACCG-2671 – Investigational new drug (IND) enabling activities for ACCG-2671 are ongoing; Structure Therapeutics plans to initiate a first-in-human Phase 1 clinical study by year-end 2025.\n- New preclinical data for ACCG-2671 was presented in a late-breaking poster session at the American Diabetes Association 85th Scientific Sessions in June 2025. ACCG-2671 demonstrated high binding affinity and balanced potency in human calcitonin receptor and amylin receptor functional assays. In diet-induced obese rats, oral administration of ACCG-2671 resulted in significant, dose-dependent body weight reductions. Combination therapy with semaglutide (both as add-on and concurrent treatment) resulted in superior weight loss compared to monotherapy of either compound.\nOral Small Molecule Metabolic Pipeline and Potential Combinations:\n- Oral Small Molecule glucose-dependent insulinotropic polypeptide receptor (GIPR) Program: Structure Therapeutics is developing a GIPR selective agonist and antagonist and GLP-1R/GIPR combinations to treat obesity and related diseases.\n- Oral Small Molecule glucagon receptor (GCGR) Program: Structure Therapeutics is developing a GCGR selective agonist and GLP-1R/GCGR combinations for the treatment of obesity and related diseases.\n- Oral Small Molecule apelin (APJR) Program: Structure Therapeutics is evaluating ANPA-0073, a Phase 2 ready biased APJR agonist for potential selective or muscle-sparing weight loss. The Company has finished a Phase 1 single-ascending and multiple-ascending dose study, in which ANPA-0073 was generally well-tolerated with no serious adverse events (SAEs) reported. Long-term chronic GLP-toxicology studies are currently underway and expected to be completed by the end of 2025.\nOral Small Molecule Lysophosphatidic Acid 1 Receptor (LPA1R) Program for Idiopathic Pulmonary Fibrosis (IPF)\nStructure Therapeutics has successfully finished a Phase 1 single and multiple ascending dose clinical study of LTSE-2578, an oral small molecule antagonist that targets the LPA1R for the treatment of IPF. In the study there was no evidence of any dose-dependent LTSE-2578-related adverse events, including clinical, laboratory and electrocardiogram recordings. No SAEs were observed in the study.\nSecond Quarter 2025 Financial Highlights\nCash Position: Cash, cash equivalents and short-term investments totaled $786.5 million on June 30, 2025. The Company expects its current cash, cash equivalents and short-term investments to fund projected operations and key clinical milestones through at least 2027. For aleniglipron, this includes the ongoing ACCESS and ACCESS II studies, extension studies, and the three new clinical studies announced, but excludes Phase 3 registrational studies.\nResearch and Development (R&D) Expenses: R&D expenses for the second quarter of 2025 were $54.7 million, as compared to $22.1 million for the same period in 2024. The increase in R&D expenses was primarily due to increases related to pre-clinical research and development expenses, clinical trial costs and personnel-related expenses due to an increase in headcount to support the advancement of our GLP-1R franchise including aleniglipron.\nGeneral and Administrative (G&A) Expenses: G&A expenses for the second quarter of 2025 were $15.7 million, as compared to $11.3 million for the same period in 2024. The increase in G&A expenses was primarily due to increases in employee expenses as we expanded our infrastructure to drive and support the growth in our operations as a publicly-traded company.\nNet Loss: Net loss for the second quarter of 2025 totaled $61.7 million, with non-cash share-based compensation expense of $7.5 million, compared to $26.0 million for the second quarter of 2024 with non-cash share-based compensation expense of $4.2 million.\nAbout Structure Therapeutics\nStructure Therapeutics is a science-driven clinical-stage biopharmaceutical company focused on discovering and developing innovative oral small molecule treatments for chronic metabolic and cardiopulmonary conditions with significant unmet medical needs. Utilizing its next generation structure-based drug discovery platform, the Company has established a robust GPCR-targeted pipeline, featuring multiple wholly-owned proprietary clinical-stage oral small molecule compounds designed to surpass the scalability limitations of traditional biologic and peptide therapies and be accessible to more patients around the world. For additional information, please visit www.structuretx.com.\nForward Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact are statements that could be deemed forward-looking statements, including, without limitation, statements concerning: the Company's future plans and prospects; the expected timing of topline data from the ACCESS and ACCESS II studies; the planned initiation of the ACCG-2671 Phase 1 study and the timing thereof; the Company's anticipated cash runway and uses of cash; the belief that ACCG-2671 represents one of the most advanced oral small molecule amylin agonists in development; the belief that the Company is well positioned to lead with a highly scalable pipeline of oral small molecule medicines designed to address the substantial unmet needs in obesity management and related metabolic diseases; the potential benefits of expanding data collection from the ACCESS and ACCESS II studies; the Company's plans to conduct three new aleniglipron studies, including the study design and timing thereof; the expected timing for declaring a second amylin receptor agonist oral small molecule development candidate; and the expected timing for long term chronic GLP-toxicology studies of ANPA-0073;; and any expectations regarding the safety, efficacy or tolerability of aleniglipron, ACCG-2671, ANPA-0073, LTSE-2578 and other candidates under development. In addition, when or if used in this press release, the words and phrases \"anticipated,\" \"believe,\" \"expect,\" \"may,\" \"on track,\" \"plan,\" \"potential,\" \"suggests,\" \"to be,\" \"to begin,\" \"will,\" and similar expressions and their variants, as they relate to the Company may identify forward-looking statements. Forward-looking statements are neither historical facts nor assurances of future performance. Although the Company believes the expectations reflected in such forward-looking statements are reasonable, the Company can give no assurance that such expectations will prove to be correct. Readers are cautioned that actual results, levels of activity, safety, performance or events and circumstances could differ materially from those expressed or implied in the Company's forward-looking statements due to a variety of risks and uncertainties, which include, without limitation: risks and uncertainties related to the results from earlier clinical studies not necessarily being predictive of future results; potential delays in the commencement, enrollment and completion of the Company's planned clinical studies, the Company's ability to advance aleniglipron, ACCG-2671, ANPA-0073, LTSE-2578, and its other therapeutic candidates, obtain regulatory approval of, and ultimately commercialize the Company's therapeutic candidates; competitive products or approaches limiting the commercial value of the Company's product candidates; the timing and results of preclinical and clinical studies; the Company's ability to fund development activities and achieve development goals; the Company's reliance on third parties, including clinical research organizations, manufacturers, suppliers and collaborators, over which it may not always have full control; the impact of any global pandemics, inflation, tariffs, changes in monetary and fiscal policy, supply chain issues, rising interest rates, future bank failures and other macroeconomic factors on the Company's business, its ability to protect its intellectual property and other risks and uncertainties described in the Company's filings with the Securities and Exchange Commission (SEC), including the Company's latest Quarterly Report on Form 10-Q and future reports the Company may file with the SEC from time to time. All forward-looking statements contained in this press release speak only as of the date on which they were made and are based on management's assumptions and estimates as of such date. The Company undertakes no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they were made, except as required by law.\n| STRUCTURE THERAPEUTICS INC. Condensed Consolidated Statements of Operations (unaudited) (In thousands) | |||||||||||||||\n| THREE MONTHS ENDED | SIX MONTHS ENDED | ||||||||||||||\n| JUNE 30, | JUNE 30, | ||||||||||||||\n| 2025 | 2024 | 2025 | 2024 | ||||||||||||\n| Operating expenses: | |||||||||||||||\n| Research and development | $ | 54,710 | $ | 22,050 | $ | 97,577 | $ | 42,729 | |||||||\n| General and administrative | 15,741 | 11,266 | 29,185 | 22,602 | |||||||||||\n| Total operating expenses | 70,451 | 33,316 | 126,762 | 65,331 | |||||||||||\n| Loss from operations | (70,451 | ) | (33,316 | ) | (126,762 | ) | (65,331 | ) | |||||||\n| Interest and other income, net | 8,929 | 7,335 | 18,505 | 13,343 | |||||||||||\n| Loss before provision for income taxes | (61,522 | ) | (25,981 | ) | (108,257 | ) | (51,988 | ) | |||||||\n| Provision for income taxes | 139 | 53 | 237 | 82 | |||||||||||\n| Net loss | $ | (61,661 | ) | $ | (26,034 | ) | $ | (108,494 | ) | $ | (52,070 | ) | |||\n| STRUCTURE THERAPEUTICS INC. Condensed Consolidated Balance Sheet Data (unaudited) (In thousands) | |||||||\n| JUNE 30, | DECEMBER 31, | ||||||\n| 2025 | 2024 | ||||||\n| Assets | |||||||\n| Current assets: | |||||||\n| Cash, cash equivalents and short-term investments | $ | 786,496 | $ | 883,518 | |||\n| Prepaid expenses and other current assets | 12,802 | 7,693 | |||||\n| Total current assets | 799,298 | 891,211 | |||||\n| Property and equipment, net | 3,459 | 3,478 | |||||\n| Operating right-of-use assets | 7,484 | 3,535 | |||||\n| Other non-current assets | 6,202 | 5,106 | |||||\n| Total assets | $ | 816,443 | $ | 903,330 | |||\n| Liabilities and shareholders' equity | |||||||\n| Current liabilities: | |||||||\n| Accounts payable | $ | 8,990 | $ | 8,024 | |||\n| Accrued expenses and other current liabilities | 27,379 | 26,299 | |||||\n| Operating lease liabilities, current portion | 2,664 | 1,698 | |||||\n| Total current liabilities | 39,033 | 36,021 | |||||\n| Operating lease liabilities, net of current portion | 5,012 | 2,164 | |||||\n| Other non-current liabilities | 317 | 302 | |||||\n| Total liabilities | 44,362 | 38,487 | |||||\n| Total shareholders' equity | 772,081 | 864,843 | |||||\n| Total liabilities and shareholders' equity | $ | 816,443 | $ | 903,330 | |||\nInvestors:\nDanielle Keatley\nStructure Therapeutics Inc.\nir@structuretx.com\nMedia:\nDan Budwick\n1AB\nDan@1abmedia.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/25/05/45252150/novo-nordisk-expects-fda-decision-for-oral-wegovy-by-end-of-2025-reports-mixed-q1-earnings",
      "text": "- Q1 Wegovy sales rose 85% to DKK 17.36 billion; Ozempic up 18% to DKK 32.72 billion.\n- Novo Nordisk's Q1 sales hit $10.89 billion, missing the $11.64 billion consensus estimate.\n- The market’s back, and these 3 income stocks are thriving. See them here→\nNovo Nordisk A/S NVO on Wednesday reported first-quarter 2025 sales of roughly $10.89 billion (78.09 billion Danish kroner), missing the consensus of $11.64 billion.\nSales increased by 19% in Danish kroner and 18% at CER. In U.S. Operations, sales increased by 20% in Danish kroner and 17% at CER.\nSales in International Operations increased by 18% measured in Danish kroner and by 19% at CER. Sales growth has resulted in periodic supply constraints and related drug shortage notifications for certain products and geographies.\nThe weight loss drug maker reported Q1 adjusted EPS of 92 cents, beating the consensus of 90 cents.\nThe company reported an adjusted net profit of 30.3 billion in the quarter, which was up 15% year over year.\nOzempic sales increased 18% to 32.72 billion Danish kroner, and Wegovy sales jumped 85% to 17.36 billion Danish kroner.\nThe company added that the volume of compounded GLP-1s in the U.S. is estimated to have impacted the uptake of Wegovy prescriptions and the growth of the branded obesity market during the first quarter of 2025.\nAlso Read: CVS Caremark To Place Novo Nordisk’s Wegovy On Preferred Coverage For GLP-1 Weight Loss Treatment\nInsulin sales increased 4% to 14.9 billion Danish kroner, and Rare disease sales increased 5% to 4.62 billion Danish kroner.\nSales in Diabetes care increased by 10% and 8% at CER to 55.04 billion. Novo Nordisk’s global diabetes value market share decreased by 0.6% over the last 12 months to 33.3%, driven by market share losses in the U.S. and International Operations.\nIn IO countries, Eli Lilly And Co’s LLY tirzepatide is categorised under GLP-1 diabetes only in IQVIA data, despite having indications for Diabetes and Obesity in most launched countries.\nIn its earnings release, Novo Nordisk said it submitted a Supplemental New Drug Application (sNDA) to the U.S. FDA in February for the PDS290 device variant for Wegovy. The company expects the regulatory review to be completed around mid-year 2025.\nIn February 2025, Novo Nordisk submitted oral semaglutide 25 mg to the FDA, with the potential to be the first oral GLP-1 treatment for obesity.\nThe submission is based on OASIS 4, a 64-week efficacy and safety trial comparing once-daily oral semaglutide 25 mg to placebo in 307 adults with obesity or overweight with one or more comorbidities.\nIn adults with obesity or overweight, oral semaglutide 25 mg achieved a 16.6% weight loss from a baseline bodyweight of 105.9 kg compared to a 2.7% reduction with placebo.\nNovo Nordisk expects the regulatory review to be completed around the turn of the year.\nGuidance For 2025\nNovo Nordisk lowered its 2025 sales growth from 16%-24% to 13%-21% at CER and operating profit growth of 16%-24%, down from 19%-27% at CER.\nSales and operating profit growth reported in Danish kroner is expected to be 3 and 5 percentage points higher than at CER, respectively.\nThe updated sales outlook reflects lower-than-planned penetration of branded GLP-1 treatments in the U.S., impacted by compounded GLP-1s.\nPrice Action: At the last check on Wednesday, NVO stock was up 5.49% at $69.93 during the premarket session.\nRead Next:\nPhoto by Tobias Arhelger via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/pressreleases/25/08/g46871051/terns-pharmaceuticals-reports-second-quarter-2025-financial-results-and-provides-corporate-updates",
      "text": "Phase 1 trial of TERN-701 in chronic myeloid leukemia (CML) enrolling well; efficacy and safety data including 6-month major molecular response (MMR) rates expected in 4Q25\nPhase 2 trial of TERN-601 for obesity completed enrollment; 12-week efficacy, safety and tolerability data expected in early 4Q25\nCash runway into 2028 focused on advancing CML program internally and partnering metabolic assets\nTerns to host a TERN-701-focused educational webinar in September 2025\nFOSTER CITY, Calif., Aug. 05, 2025 (GLOBE NEWSWIRE) -- Terns Pharmaceuticals, Inc. (Terns or the Company) TERN, a clinical-stage biopharmaceutical company developing a portfolio of small-molecule product candidates to address serious diseases, including oncology and obesity, today reported financial results for the second quarter ended June 30, 2025, and provided corporate updates.\n\"The Terns team continues to advance our clinical programs with strong momentum, a clear focus on execution and a strong balance sheet,\" said Amy Burroughs, chief executive officer of Terns. \"We are on track for two key clinical readouts in CML and obesity by year-end. The fourth quarter data readout from the Phase 1 CARDINAL trial in 2L+ CML will enable comparison of the efficacy and safety results of TERN-701 with data from other Phase 1 CML trials, including asciminib's.\"\n\"We are focusing the company in oncology and on rapidly advancing TERN-701 towards a pivotal trial, with the goal of ultimately bringing a potential best-in-class therapy to people living with CML. The company seeks to partner our portfolio of potentially best-in-class metabolic assets and does not plan to invest in clinical development in metabolic disease beyond year end 2025.\"\n\"We are encouraged by the rapid enrollment in the CARDINAL trial of TERN-701 in CML and initiation of dose expansion at the high end of the dose range based on the safety and efficacy data to date. The recently presented preclinical data at the European Hematology Association Congress (EHA) further supports TERN-701's enhanced potency compared to asciminib across multiple clinically relevant BCR-ABL variants, including those with resistance mutations. These findings build upon previously reported data from the early dose escalation portion of the CARDINAL trial, which showed compelling molecular responses observed in heavily pre-treated patients, including those with treatment failure to asciminib. We look forward to sharing a CARDINAL data set in the fourth quarter that will provide a read through to the primary endpoint in a registrational trial – the achievement of a major molecular response at six months,\" concluded Ms. Burroughs.\nRecent Pipeline Developments and Anticipated Milestones\nTERN-701: Oral, small-molecule next-generation allosteric BCR-ABL inhibitor for CML\n- Terns plans to report efficacy and safety data from the Phase 1 CARDINAL trial in the fourth quarter of 2025, including 6-month MMR achievement rate, and to inform the potential for a best-in-class product profile and path to a pivotal trial\n- In April 2025, Terns enrolled the first patient in the dose expansion portion of the CARDINAL trial in which patients are randomized to one of two dose cohorts (320 mg or 500 mg QD) with up to 40 patients per arm\n- Doses were selected based on the totality of safety, efficacy, and pharmacokinetic/pharmacodynamic data from the dose escalation portion of the trial\n- Terns to host an educational webinar in September 2025 detailing the unmet need in CML, how TERN-701 is building a potential best-in-class profile and relevant benchmarks for Phase 1 data. Webcast details will be available prior to the event\n- Early interim data released in December 2024 from the TERN-701 dose escalation portion of the CARDINAL trial showed:\n- Compelling molecular responses in heavily pre-treated CML patients with high baseline BCR-ABL transcript levels, starting at the lowest doses\n- Encouraging safety profile with no dose limiting toxicities, adverse event-related treatment discontinuations or dose reductions at any dose\n- In addition, supportive preclinical data presented at EHA 2025 highlighted greater potency of TERN-701 compared to asciminib against several resistance mutations in the active-site and allosteric domains\nTERN-601: Oral, small-molecule glucagon-like peptide-1 receptor agonist (GLP1-RA) for obesity\n- Key objectives of the Phase 2 FALCON trial in patients with obesity or overweight are to demonstrate competitive weight loss at 12-weeks, a class-leading safety/tolerability profile, and the simplest dose titration among GLP1-RA therapies\n- The Phase 2 FALCON trial enrollment completed in the second quarter of 2025 and top-line 12-week data is expected in the early fourth quarter of 2025\n- U.S.-based, multicenter, randomized, double-blind, placebo-controlled trial to evaluate the efficacy and safety of TERN-601 as a treatment for obesity\n- Once-daily dosing with or without food in adults with obesity or overweight, without diabetes (BMI ranges from ≥30 to <50 kg/m2 or ≥27 to <30 kg/m2 with at least one weight-related comorbidity)\n- Patients randomized to one of four active cohorts (n=30 per cohort): 250 mg, 500 mg, 500 mg slow titration, 750 mg or placebo\n- Primary endpoint is percent change from baseline in body weight compared to placebo over 12 weeks\n- Secondary endpoints include safety, tolerability and proportion of patients achieving 5% weight loss or greater\n- Doses and titration schema for Phase 2 were selected based on positive results from the Phase 1 trial, announced in September 2024, which demonstrated weight loss over 28-days up to 5.5% and favorable safety and tolerability despite rapid dose titration every three days\n- In June 2025, Terns presented additional data from the completed 28-day Phase 1 trial of TERN-601 for obesity at the 85th Annual American Diabetes Association Scientific Sessions, which further demonstrated its differentiated profile among oral GLP1-RAs\nPipeline and Partnering Programs\nTERN-800 Series: Oral, small-molecule glucose-dependent insulinotropic polypeptide receptor (GIPR) modulators\n- Terns is prioritizing its discovery efforts on nominating a GIPR antagonist development candidate based on in-house discoveries and growing scientific rationale supporting the potential of GLP-1 agonist/GIPR antagonist combinations for obesity. Terns is seeking a strategic partner to advance this program\nTERN-501: Oral, thyroid hormone receptor-beta (THR-β) agonist\n- Based on non-clinical studies, THR-β is a complementary mechanism to GLP-1, potentially providing broader metabolic and liver benefits in addition to increased weight loss. Terns is seeking a strategic partner to advance this program\nCorporate Updates\nMembers of the Terns' senior leadership team will participate in the Morgan Stanley 23rd Annual Global Healthcare Conference, taking place in New York City, New York, September 8-10th, 2025.\nWebcasts can be accessed at Terns' IR website: http://ir.ternspharma.com\nSecond Quarter 2025 Financial Results\nCash Position: As of June 30, 2025, cash, cash equivalents and marketable securities were $315.4 million, as compared with $358.2 million as of December 31, 2024. Based on its current operating plan, Terns expects these funds will be sufficient to support its planned operating expenses into 2028\nResearch and Development (R&D) Expenses: R&D expenses were $20.4 million for the quarter ended June 30, 2025, as compared with $18.4 million for the quarter ended June 30, 2024\nGeneral and Administrative (G&A) Expenses: G&A expenses were $7.0 million for the quarter ended June 30, 2025, as compared with $7.2 million for the quarter ended June 30, 2024\nNet Loss: Net loss was $24.1 million for the quarter ended June 30, 2025, as compared with $22.7 million for the quarter ended June 30, 2024\nFinancial Tables\n| Terns Pharmaceuticals, Inc. | ||||||||||||||||\n| Condensed Consolidated Statements of Operations | ||||||||||||||||\n| (Unaudited; in thousands except share and per share amounts) | ||||||||||||||||\n| Three Months Ended June 30, | Six Months Ended June 30, | |||||||||||||||\n| 2025 | 2024 | 2025 | 2024 | |||||||||||||\n| Operating expenses: | ||||||||||||||||\n| Research and development | $ | 20,353 | $ | 18,352 | $ | 39,073 | $ | 36,939 | ||||||||\n| General and administrative | 7,030 | 7,185 | 15,737 | 14,044 | ||||||||||||\n| Total operating expenses | 27,383 | 25,537 | 54,810 | 50,983 | ||||||||||||\n| Loss from operations | (27,383 | ) | (25,537 | ) | (54,810 | ) | (50,983 | ) | ||||||||\n| Interest income | 3,350 | 2,876 | 6,993 | 6,058 | ||||||||||||\n| Other income (expense), net | 4 | (14 | ) | (32 | ) | (26 | ) | |||||||||\n| Loss before income taxes | (24,029 | ) | (22,675 | ) | (47,849 | ) | (44,951 | ) | ||||||||\n| Income tax expense | (64 | ) | (61 | ) | (152 | ) | (158 | ) | ||||||||\n| Net loss | $ | (24,093 | ) | $ | (22,736 | ) | $ | (48,001 | ) | $ | (45,109 | ) | ||||\n| Net loss per share, basic and diluted | $ | (0.26 | ) | $ | (0.31 | ) | $ | (0.52 | ) | $ | (0.61 | ) | ||||\n| Weighted average common stock outstanding, basic and diluted | 91,575,039 | 74,459,774 | 91,524,772 | 74,429,576 | ||||||||||||\n| Terns Pharmaceuticals, Inc. | ||||||\n| Selected Balance Sheet Data | ||||||\n| (Unaudited; in thousands) | ||||||\n| June 30, 2025 | December 31, 2024 | |||||\n| Cash, cash equivalents and marketable securities | $ | 315,445 | $ | 358,164 | ||\n| Total assets | 320,415 | 363,929 | ||||\n| Total liabilities | 15,186 | 18,059 | ||||\n| Total stockholders' equity | 305,229 | 345,870 |\nAbout Terns Pharmaceuticals\nTerns Pharmaceuticals, Inc. is a clinical-stage biopharmaceutical company developing a portfolio of small-molecule product candidates to address serious diseases, including oncology and obesity. Terns' pipeline contains three clinical stage development programs including an allosteric BCR-ABL inhibitor, a small-molecule GLP-1 receptor agonist, a THR-β agonist, and a preclinical GIPR modulator discovery effort, prioritizing a GIPR antagonist nomination candidate. For more information, please visit: www.ternspharma.com.\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements about the Company within the meaning of the federal securities laws. Forward-looking statements include statements related to or in connection with expectations, timing and potential results of the clinical trials and other development activities of the Company and its partners, including with respect to the CARDINAL and FALCON trials, as well as enabling and non-clinical studies of the TERN-800 Series and TERN-501; the potential indications to be targeted by the Company with its small-molecule product candidates; the therapeutic potential of the Company's small-molecule product candidates; the potential for the mechanisms of action of the Company's product candidates to be therapeutic targets for their targeted indications; the potential utility and progress of the Company's product candidates in their targeted indications, including the clinical utility of the data from and the endpoints used in the Company's clinical trials; the Company's clinical development plans and activities, including the results of any interactions with regulatory authorities on its programs; the Company's expectations regarding the profile of its product candidates, including efficacy, tolerability, safety, metabolic stability and pharmacokinetic profile and potential differentiation as compared to other products or product candidates; the Company's plans for and ability to continue to execute on its current development strategy, including potential combinations involving multiple product candidates; the process, timing or potential to establish a strategic partnership or similar arrangement for future development and/or potential commercialization of any of its product candidates; the potential commercialization of the Company's product candidates; and the Company's expectations with regard to its cash runway and sufficiency of its cash resources. All statements other than statements of historical facts contained in this press release, including statements regarding the Company's strategy, future financial condition, future operations, future trial results, projected costs, prospects, plans, objectives of management and expected market growth, are forward-looking statements. In some cases, you can identify forward-looking statements by terminology such as \"aim,\" \"anticipate,\" \"assume,\" \"believe,\" \"contemplate,\" \"continue,\" \"could,\" \"design,\" \"develop,\" \"due,\" \"estimate,\" \"expect,\" \"goal,\" \"intend,\" \"may,\" \"objective,\" \"plan,\" \"positioned,\" \"potential,\" \"predict,\" \"seek,\" \"should,\" \"target,\" \"will,\" \"would\" and other similar expressions that are predictions of or indicate future events and future trends, or the negative of these terms or other comparable terminology. The Company has based these forward-looking statements largely on its current expectations, estimates, forecasts and projections about future events and financial trends that it believes may affect its financial condition, results of operations, business strategy and financial needs. In light of the significant uncertainties in these forward-looking statements, you should not rely upon forward-looking statements as predictions of future events. These statements are subject to risks and uncertainties that could cause the actual results and the implementation of the Company's plans to vary materially, including the risks associated with the initiation, cost, timing, progress, results and utility of the Company's current and future research and development activities and preclinical studies and clinical trials. These risks are not exhaustive. For a detailed discussion of the risk factors that could affect the Company's actual results, please refer to the risk factors identified in the Company's SEC reports, including but not limited to its Annual Report on Form 10-K for the year ended December 31, 2024 and subsequent Quarterly Reports on Form 10-Q. Except as required by law, the Company undertakes no obligation to update publicly any forward-looking statements for any reason.\nContacts for Terns\nInvestors\nKaytee Bock\ninvestors@ternspharma.com\nMedia\nJenna Urban\nCG Life\nmedia@ternspharma.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/pressreleases/24/06/g39133591/structure-therapeutics-reports-positive-topline-data-from-its-phase-2a-obesity-study-and-capsule-t",
      "text": "GSBR-1290 achieved a clinically meaningful and statistically significant placebo-adjusted mean weight loss of 6.2% (p<0.0001) in the Phase 2a obesity study and up to 6.9% (p<0.0001) in the capsule to tablet PK study, in both cases at 12 weeks\nGSBR-1290 demonstrated generally favorable safety and tolerability results\nwith low AE-related study discontinuations\nPharmacokinetic data support dose proportional exposure and once-daily oral dosing of GSBR-1290\n36-week Phase 2b study in obesity on track to begin in the fourth quarter of 2024\nCompany to host conference call today at 8:30 a.m. ET\nSAN FRANCISCO, June 03, 2024 (GLOBE NEWSWIRE) -- Structure Therapeutics Inc. GPCR, a clinical-stage global biopharmaceutical company developing novel oral small molecule therapeutics for metabolic and cardiopulmonary diseases, today announced positive 12-week topline obesity data from its Phase 2a study of GSBR-1290, along with positive topline results from its capsule to tablet PK study. Both studies achieved their primary and secondary objectives.\nTopline Results Summary\n- In the Phase 2a obesity study, GSBR-1290 demonstrated a clinically meaningful and statistically significant placebo-adjusted mean decrease in weight of 6.2%1 (p<0.0001) at 12 weeks. At Week 12, 67% of GSBR-1290 treated participants achieved ≥6% weight loss and 33% achieved ≥ 10% weight loss, compared to 0% for placebo.\n- A capsule to tablet PK study designed to explore a new tablet formulation of GSBR-1290 demonstrated a placebo-adjusted mean weight loss of up to 6.9%1 (p<0.0001) with the tablet formulation at 12 weeks. In addition, the tablet formulation demonstrated comparable exposure to the prior capsule formulation and pharmacokinetic data support dose proportional exposure and a once-daily dose profile of GSBR-1290.\n- GSBR-1290 demonstrated generally favorable safety and tolerability results following repeated, daily dosing up to 120mg. As expected for the GLP1-RA drug class, leading adverse events (AEs) were gastrointestinal (GI)-related and the two most common AEs were nausea and vomiting. GI-related adverse events were generally observed early in treatment and attenuated after titration was completed. AE-related study discontinuations ranged from 5% in the Phase 2a obesity study to 11% in the capsule to tablet PK study. There were zero cases of drug-induced liver injury or persistent liver enzyme elevations reported across the two studies.\n\"These topline results demonstrate the substantial weight loss effect of GSBR-1290 and its potential to become a best-in-class oral small molecule GLP-1RA as well as an ideal backbone for future combination therapeutics for the treatment of obesity and related diseases,\" said Raymond Stevens, Ph.D., Founder and CEO of Structure. \"We designed GSBR-1290 to be dosed once-a-day, and are pleased to see the competitive treatment effect at 12 weeks, dose proportional exposure and target engagement over 24 hours.\"\nDr. Stevens continued: \"We are pleased that our new tablet performed well and that a start low and go-slow titration strategy proved beneficial and we will carry these observations into our planned Phase 2b study. As previously reported, we believe our large safety window will allow us the option to explore higher doses in future studies. As a non-peptide small molecule, our large-scale manufacturing process is expected to be more than capable of meeting the anticipated global demand of a product with the profile of GSBR-1290. We are excited to move into a Phase 2b study in overweight and obese individuals. \"\n\"By 2030, the global prevalence of obesity is expected to reach 1 billion. There is a need for oral treatments, including small molecules, which are easier to make at scale, more stable thus easier to transport and store, and more cost-effective,\" said Ania Jastreboff, M.D., Ph.D., Associate Professor of Medicine and Pediatrics at Yale School of Medicine; Director, Yale Obesity Research Center (Y-Weight), and co-Director of the Yale Center for Weight Management. \"All these factors may enable greater treatment reach for this worldwide disease. The phase 2 data with GSBR-1290 demonstrate safety to date and clinically meaningful weight reduction with 12 weeks of treatment and are encouraging for its development as a potential future therapeutic for obesity.\"\nGSBR-1290 Phase 2b Obesity Study Expected to Begin in Fourth Quarter 2024\nStructure plans to submit an IND to the FDA in the third quarter of 2024 to support initiation of trials in chronic weight management and thereafter initiate a Phase 2b obesity study of GSBR-1290 in the fourth quarter of 2024. The 36-week global study is expected to use the tablet formulation of GSBR-1290 and include approximately 300 participants to be treated with multiple doses and dose titration regimens.\nAbout the Phase 2a Study of GSBR-1290 in Obesity\nThe double-blind, 12-week placebo-controlled Phase 2a clinical trial enrolled 64 healthy overweight or obese participants that were randomized to GSBR-1290 120mg (n=37) or placebo (n=27), dosed once daily with weekly dose titrations.\nAbout the GSBR-1290 capsule to tablet PK study\nThe 12-week placebo-controlled capsule to tablet PK study (n=54) was designed to evaluate the tolerability, safety and pharmacokinetics of a new tablet formulation of GSBR-1290 and assess three different dosing and titration regimens, while exploring changes in weight during the 12-week duration. Based on the results with the new tablet formulation, Structure anticipates using the tablet formulation for future studies starting with the planned 36-week Phase 2b obesity study.\nConference Call and Webcast Information\nStructure will host a conference call and webcast today, June 3, 2024 at 8:30 a.m. Eastern Time. A live webcast of the call will be available on the Investor Relations page of Structure's website at https://ir.structuretx.com/events-presentations/events. To access the call by phone, participants should visit this link (registration link) to receive dial-in details. The webcast will be made available for replay on the company's website beginning approximately two hours after the live event. The replay of the webcast will be available for 90 days.\nAbout GSBR-1290 and Structure's Oral Metabolic Franchise\nGSBR-1290 is an orally-available, small molecule agonist of the glucagon-like-peptide-1 (GLP-1) receptor, a validated drug target for the treatment of type 2 diabetes mellitus (T2DM) and obesity. Through the Company's structure-based drug discovery platform, GSBR-1290 was designed to be a biased GPCR agonist, which selectively activates the G-protein signaling pathway. Structure has completed a Phase 2a study of GSBR-1290 in participants with obesity or who are overweight and T2DM with high body mass index (BMI) ≥27. A Phase 2b study in obesity is expected to start in the fourth quarter of 2024, and the Phase 2 development plan in T2DM is expected to be determined in the second half of 2024. Beyond GSBR-1290, Structure is developing next generation combination GLP-1R candidates together with GIP, amylin, glucagon and apelin oral small molecules.\nAbout Structure Therapeutics\nStructure Therapeutics is a science-driven clinical-stage biopharmaceutical company focused on discovering and developing innovative oral small molecule treatments for chronic metabolic and cardiopulmonary conditions with significant unmet medical needs. Utilizing its next generation structure-based drug discovery platform, the Company has established a robust GPCR-targeted pipeline, featuring multiple wholly-owned proprietary clinical-stage small molecule compounds designed to surpass the manufacturing scalability limitations of traditional biologic and peptide therapies and be accessible to more patients around the world. For additional information, please visit www.structuretx.com.\nForward Looking Statements\nThis press release contains \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact are statements that could be deemed forward-looking statements, including, without limitation, statements concerning the Company's future plans and prospects, the potential to become a best-in-class oral small molecule GLP-1RA as well as an ideal backbone for future combination therapeutics for the treatment of obesity and related diseases, any expectations regarding the safety, efficacy, tolerability or once-daily dosing of GSBR-1290, including based on the clinical update from the Company's Phase 2a obesity study and capsule to tablet PK study, and other candidates under development, the ability of GSBR-1290 to treat T2DM, obesity or related indications, the planned IND submission and initiation and number of expected patients of the Company's Phase 2b obesity study and Phase 2 development plan in T2DM and the timing thereof, respectively and the planned timing of the continued development of GSBR-1290. In addition, when or if used in this press release, the words \"may,\" \"could,\" \"should,\" \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"plan,\" \"predict\" and similar expressions and their variants, as they relate to the Company may identify forward-looking statements. Forward-looking statements are neither historical facts nor assurances of future performance. Although the Company believes the expectations reflected in such forward-looking statements are reasonable, the Company can give no assurance that such expectations will prove to be correct. Readers are cautioned that actual results, levels of activity, safety, efficacy, performance or events and circumstances could differ materially from those expressed or implied in the Company's forward-looking statements due to a variety of risks and uncertainties, which include, without limitation, risks and uncertainties related to topline results that the Company reports is based on a preliminary analysis of key efficacy and safety data, and such data may change following a more comprehensive review of the data related to the clinical trial and such topline data may not accurately reflect the complete results of a clinical trial, the preliminary nature of the results due to length of the study and sample size and results from earlier clinical trials not necessarily being predictive of future results, including the results using the least square means and mixed model for repeated measures which uses all available data, including data from patients who did not follow-up at 12 weeks, and estimates how patients with missing data would have responded based on patients who continued the study and had similar baseline characteristics (implicit imputation), potential delays in the IND submission or commencement, enrollment and completion of the Company's planned Phase 2 trials, including the Company will need to receive allowance from the FDA to proceed before initiating the planned Phase 2b trial, the Company's ability to advance GSBR-1290, LTSE-2578, ANPA-0073 and its other therapeutic candidates, obtain regulatory approval of and ultimately commercialize the Company's therapeutic candidates, competitive products or approaches limiting the commercial value of the Company's product candidates, the timing and results of preclinical and clinical trials, the Company's ability to fund development activities and achieve development goals, the impact of any global pandemics, inflation, supply chain issues, rising interest rates and future bank failures on the Company's business, its ability to protect its intellectual property and other risks and uncertainties described in the Company's filings with the Securities and Exchange Commission (SEC), including the Company's Quarterly Report on Form 10-Q for the quarter ended March 31, 2024, as filed with the SEC on May 9, 2024, and future reports the Company may file with the SEC from time to time. All forward-looking statements contained in this press release speak only as of the date on which they were made and are based on management's assumptions and estimates as of such date. The Company undertakes no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they were made, except as required by law.\nCONTACTS\nInvestors:\nDanielle Keatley\nStructure Therapeutics Inc.\nir@structuretx.com\nMedia:\nDan Budwick\n1AB\nDan@1abmedia.com\n__________________________________\n1 Least-squares means and analyzed based on primary efficacy estimand using a Mixed Model for Repeated Measures\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/health-care/25/08/46798430/trump-administration-plan-signals-shift-toward-weight-loss-drug-coverage-for-medicare-patients",
      "text": "- Medicare coverage for GLP-1s for obesity could cost $35 billion from 2026 to 2034.\n- Annual treatment with GLP-1 drugs costs between $5,000 and $7,000 per person.\n- The market’s back, and these 3 income stocks are thriving. See them here→\nThe Trump administration is preparing a pilot program that could allow some Americans on Medicare and Medicaid to access popular and costly weight-loss medications.\nThe plan, still in development, would permit state Medicaid programs and Medicare Part D plans to voluntarily cover GLP-1 drugs such as Novo Nordisk A/S’ NVO Ozempic and Wegovy, and Eli Lilly And Co’s LLY Mounjaro and Zepbound for weight management, according to internal documents reviewed by The Washington Post.\nThe pilot would also include Eli Lilly’s GLP-1 drug Orforglipron, pending its expected approval in 2026.\nThe initiative, set to launch in April 2026 for Medicaid and January 2027 for Medicare, would run through the Center for Medicare and Medicaid Innovation (CMMI).\nThis testing lab explores new payment models to improve care and reduce health care spending.\nWhile Medicare covers these drugs mainly for Type 2 diabetes, some private insurers already approve them for weight loss.\nThe proposal comes after the Trump administration rejected a Biden-era plan to provide coverage of GLP-1 drugs for weight loss under Medicare and Medicaid.\nThough not yet finalized, the Washington Post report on Friday added that the new pilot could move forward without requiring a formal public comment process.\nAlso Read: Congress Sounds Alarm Over Illegal Weight-Loss Drug Imports From China\nCovering these drugs is not without significant cost concerns. The Congressional Budget Office estimates Medicare could spend around $35 billion on GLP-1 coverage for obesity between 2026 and 2034. These medications typically cost $5,000 to $7,000 annually per patient.\nStill, experts like David Rind, chief medical officer at the Institute for Clinical and Economic Review, argue the price is reasonable given the potential for substantial health improvements.\nSome states are already moving ahead. Thirteen state Medicaid programs currently cover GLP-1s for obesity, despite looming worries about reduced federal Medicaid funding due to a recent tax law overhaul.\nOn Thursday, Trump issued a 60-day ultimatum to 17 major pharmaceutical companies, demanding that they lower drug prices in the U.S. or face severe consequences.\nTrump urged drugmakers to offer all existing drugs to Medicaid patients at the lowest prices in other developed countries, adopt most-favored-nation pricing for all new drugs across Medicare, Medicaid and commercial payers, and push back against “foreign freeloading nations” in pricing negotiations.\nAlso, Ozempic may enter the realm of price negotiations between drug manufacturers and Medicare.\nOzempic is poised to become eligible for negotiations when the next batch of drugs is chosen in 2025, leading to price adjustments in 2027.\nRead Next:\nPhoto by KK Stock via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/equities/24/09/40773628/terns-pharmaceuticals-oral-glp-1-reaches-phase-1-finish-line-with-encouraging-weight-loss-data-a",
      "text": "- Terns looks forward to advance the product candidate into Phase 2 clinical development in 2025.\n- 67% of participants lost 5% or more of their baseline body weight at the top dose.\n- The market’s back, and these 3 income stocks are thriving. See them here→\nMonday, Terns Pharmaceuticals Inc. TERN revealed topline data from its Phase 1 single and multiple-ascending dose (SAD and MAD) trial to assess the safety, tolerability, pharmacokinetics (PK) and pharmacodynamics (PD) of TERN-601 dosed once-daily (QD) in healthy adults with obesity or overweight.\nThe clinical trial results showed TERN-601 was well tolerated and demonstrated dose-dependent, statistically significant placebo-adjusted mean weight loss across all three doses evaluated in the 28-day MAD study, with maximum placebo-adjusted mean weight loss of 4.9% at the highest dose of 740 mg QD.\nAdditionally, 67% of participants lost 5% or more of their baseline body weight at the top dose.\n“These data validate the potential of TERN-601 for the treatment of obesity as monotherapy or in combination with agents such as TERN-501, our internally discovered, clinical stage THR-β agonist, or a GIPR modulator from our TERN-800 series. With operational preparations well underway, we look forward to swiftly advancing this promising product candidate into Phase 2 clinical development in 2025,” said Amy Burroughs, chief executive officer of Terns.\n“We are delighted to demonstrate potent GLP-1R agonism with TERN-601 as its distinct drug properties allowed for sustained target coverage with once-daily dosing and the evaluation of doses up to 740 mg, while being tolerable,” noted Emil Kuriakose, chief medical officer of Terns.\n“Importantly, we believe we have successfully identified an optimal range of clinically active, well-tolerated doses to take forward in Phase 2 clinical trials, with no new dose range exploration anticipated.”\nThe company says TERN-601’s low solubility and high gut permeability may result in prolonged absorption, allowing for sustained target coverage and a flat PK curve, while high drug levels in the gut wall may lead to robust GLP-1R activation in the gut, triggering satiety centers in the brain.\nAdditionally, TERN-601 has a low free fraction in circulation which, combined with the flat PK curve, may be allowing TERN-601 to be well tolerated when administered at high doses.\nPrice Action: TERN stock is up 14.6% at $8.95 during the premarket session at last check Monday.\nPhoto: Illustration of Phrama lab worker created with MidJourney\nRead Next:\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/06/39144875/structure-therapeutics-obesity-candidate-is-very-competitive-to-eli-lillys-orforgli",
      "text": "- Cantor Fitzgerald maintains its bullish views on Structure Therapeutics.\n- Cantor analyst says stock significantly undervaluing GPCR's attractive pipeline of obesity candidates.\n- Get ahead of next week’s CPI & PPI with Chris Capre’s live trading strategy session this Sunday. Register Now →\nOn Monday, Structure Therapeutics Inc. GPCR revealed 12-week topline obesity data from its Phase 2a study of GSBR-1290.\nIn the Phase 2a obesity study, GSBR-1290 demonstrated a clinically meaningful and statistically significant placebo-adjusted mean decrease in weight of 6.2% at 12 weeks.\nCantor Fitzgerald maintains its bullish views on Structure Therapeutics and keeps the Overweight rating with a price target of $65.\nThe analyst says, “now have more conviction that ‘1290 is very competitive with Eli Lilly And Co’s LLY orforglipron on efficacy and data from PK formulation trial results support our view that tolerability (nausea/vomiting) rate will come down significantly in P2B without impacting weight loss.”\nAlso Read: Citi Monitors Competitive Threats To Eli Lilly, Says It Is Positioned To Maintain Leadership And Expand.\nAnswering questions regarding high gastrointestinal (GI) events, Cantor analyst said that the study had a more rapid titration schedule than other obesity trials, with forced rapid titration as ‘1290 had only 12 weeks of toxicity coverage when the trial was initiated.\nCantor highlighted that when Eli Lilly’s orforglipron was tested in P1 (type 2 diabetes) with a rapid titration, higher doses (45 mg) also had very high rates of nausea (80%), vomiting (55%) that got better in P2B and ‘1290 tolerability with the rapid titration is more in line with orforglipron.\nCantor added that Most of these events were already reported in the December 2023 interim update, and today’s update confirms the consistency of GI events.\nSlowing the titration schedule should reduce these GI rates without compromising long-term efficacy. Additionally, the PK formulation trial offers strong supporting evidence.\nCantor analyst says, “Stock significantly undervaluing GPCR’s attractive pipeline of obesity candidates, in our view.\nPrice Action: GPCR shares were trading higher by 78.4% to $61 at the last check on Monday.\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\ndate | ticker | name | Price Target | Upside/Downside | Recommendation | Firm |\n|---|"
    },
    {
      "url": "https://www.benzinga.com/pressreleases/25/03/n44490486/viking-therapeutics-announces-completion-of-enrollment-in-phase-2-venture-oral-dosing-trial-of-vk2",
      "text": "13-Week Study Evaluating the Safety and Efficacy of Oral VK2735 Dosed Once Daily\nResults Expected in 2H25\nSAN DIEGO, March 26, 2025 /PRNewswire/ -- Viking Therapeutics, Inc. (\"Viking\") VKTX, a clinical-stage biopharmaceutical company focused on the development of novel therapies for metabolic and endocrine disorders, today announced the completion of subject enrollment in its Phase 2 clinical trial of the oral tablet formulation of VK2735, the company's dual agonist of the glucagon-like peptide 1 (GLP-1) and glucose-dependent insulinotropic polypeptide (GIP) receptors. VK2375 is being developed in both oral and subcutaneous formulations for the potential treatment of various metabolic disorders such as obesity. Viking expects to report data from the study in the second half of 2025.\nThe Phase 2 VENTURE-Oral Dosing Trial is a randomized, double-blind, placebo-controlled multicenter study designed to evaluate the safety, tolerability, pharmacokinetics and weight loss efficacy of VK2735 dosed as an oral tablet once daily for 13 weeks. The trial enrolled approximately 280 adults who are obese (BMI ≥30 kg/m2), or adults who are overweight (BMI ≥27 kg/m2) with at least one weight-related co-morbid condition. Enrolled patients have been evenly randomized to one of six dosing arms or placebo. The primary endpoint of the study is the percent change in body weight from baseline after 13 weeks of treatment. Secondary and exploratory endpoints will evaluate a range of additional safety and efficacy measures.\n\"As with our previous Phase 2 study of subcutaneous VK2735, interest in participating in the Phase 2 VENTURE-Oral study was high and drove an efficient rate of enrollment,\" said Brian Lian, Ph.D., chief executive officer of Viking Therapeutics. \"Despite its larger size, VENTURE-Oral was rapidly enrolled, highlighting the continued enthusiasm for new obesity therapeutics such as VK2735. We look forward to reporting data from this trial in the second half of 2025.\"\nViking previously reported positive results from a 28-day Phase 1 multiple ascending dose (MAD) clinical trial of the tablet formulation of VK2735 in healthy volunteers with a BMI ≥30. Cohorts receiving VK2735 demonstrated dose-dependent reductions in mean body weight from baseline, ranging up to 8.2%. Persistent weight loss effects were observed at follow-up visits through Day 57, ranging up to 8.3% from baseline, four weeks after the last dose of VK2735 was administered. An exploratory assessment of the proportion of subjects achieving at least 5% weight loss after 28 days demonstrated that up to 100% of VK2735-treated subjects achieved ≥5% weight loss, compared with 0% for placebo. Based on a preliminary evaluation of weight loss trajectories at multiple dose levels, the company believes that continued treatment beyond 28 days may provide further reductions in body weight.\nIn the MAD trial, oral VK2735 also demonstrated encouraging safety and tolerability through 28 days of once-daily dosing at doses up to and including 100 mg. The majority (99%) of observed treatment emergent adverse events were mild or moderate, with the majority (90%) reported as mild. Similarly, all observed gastrointestinal adverse events were reported as mild or moderate, with the majority (84%) reported as mild.\nConcurrent with the development of oral VK2735, Viking is also advancing a subcutaneous formulation of VK2735 through clinical development. The company previously announced positive data from the Phase 2 VENTURE study of subcutaneous VK2735, with the trial successfully achieving its primary and all secondary endpoints. Patients receiving VK2735 demonstrated statistically significant reductions in mean body weight from baseline, ranging up to 14.7%. Statistically significant differences compared to placebo were observed for all doses starting at Week 1 and were maintained throughout the course of the study. Weight loss in all treated cohorts appeared to be progressive through 13 weeks and did not show evidence of plateauing. VK2735 also demonstrated encouraging safety and tolerability in the VENTURE study, with the majority of observed adverse events being reported as mild or moderate. The company plans to initiate Phase 3 development with the subcutaneous formulation of VK2735 in the first half of 2025.\nAbout GLP-1 and Dual GLP-1/GIP Agonists\nActivation of the glucagon-like peptide 1 (GLP-1) receptor has been shown to decrease glucose, reduce appetite, lower body weight, and improve insulin sensitivity in patients with type 2 diabetes, obesity, or both. Semaglutide is a GLP-1 receptor agonist that has been approved by the U.S. Food and Drug Administration and is currently marketed in various dosage strengths and forms as Ozempic®, Rybelsus®, and Wegovy®. More recently, research efforts have explored the potential co-activation of the glucose-dependent insulinotropic peptide (GIP) receptor as a means of enhancing the therapeutic benefits of GLP-1 receptor activation. Tirzepatide is a dual GLP-1/GIP receptor agonist that has been approved by the U.S. Food and Drug Administration and is currently marketed in various dosage strengths and forms as Mounjaro® and Zepbound®.\nAbout Viking Therapeutics, Inc.\nViking Therapeutics, Inc. is a clinical-stage biopharmaceutical company focused on the development of novel first-in-class or best-in-class therapies for the treatment of metabolic and endocrine disorders, with three compounds currently in clinical trials. Viking's research and development activities leverage its expertise in metabolism to develop innovative therapeutics designed to improve patients' lives. Viking's clinical programs include VK2735, a novel dual agonist of the glucagon-like peptide 1 (GLP-1) and glucose-dependent insulinotropic polypeptide (GIP) receptors for the potential treatment of various metabolic disorders. Data from a Phase 1 and a Phase 2 trial evaluating VK2735 (dosed subcutaneously) for metabolic disorders demonstrated an encouraging safety and tolerability profile as well as positive signs of clinical benefit. Concurrently, the company is evaluating an oral formulation of VK2735 in a Phase 2 trial. Viking is also developing VK2809, a novel, orally available, small molecule selective thyroid hormone receptor beta agonist for the treatment of lipid and metabolic disorders. The compound successfully achieved both the primary and secondary endpoints in a recently completed Phase 2b study for the treatment of biopsy-confirmed non-alcoholic steatohepatitis (NASH) and fibrosis. In a Phase 2a trial for the treatment of non-alcoholic fatty liver disease (NAFLD) and elevated LDL-C, patients who received VK2809 demonstrated statistically significant reductions in LDL-C and liver fat content compared with patients who received placebo. The company's newest program is evaluating a series of internally developed dual amylin and calcitonin receptor agonists (or DACRAs) for the treatment of obesity and other metabolic disorders. In the rare disease space, Viking is developing VK0214, a novel, orally available, small molecule selective thyroid hormone receptor beta agonist for the potential treatment of X-linked adrenoleukodystrophy (X-ALD). In a Phase 1b clinical trial in patients with the adrenomyeloneuropathy (AMN) form of X-ALD, VK0214 was shown to be safe and well-tolerated, while driving significant reductions in plasma levels of very long-chain fatty acids (VLCFAs) and other lipids, as compared to placebo.\nFor more information about Viking Therapeutics, please visit www.vikingtherapeutics.com.\nForward-Looking Statements\nThis press release contains forward-looking statements regarding Viking Therapeutics, Inc., under the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995, including statements about Viking's expectations regarding its clinical and preclinical development programs, anticipated timing for reporting clinical data and cash resources. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially and adversely and reported results should not be considered as an indication of future performance. These risks and uncertainties include, but are not limited to: risks associated with the success, cost and timing of Viking's product candidate development activities and clinical trials, including those for VK2735, VK0214, VK2809, and the company's other incretin receptor agonists; risks that prior clinical and preclinical results may not be replicated; risks regarding regulatory requirements; and other risks that are described in Viking's most recent periodic reports filed with the Securities and Exchange Commission, including Viking's Annual Report on Form 10-K for the year ended December 31, 2023, and subsequent Quarterly Reports on Form 10-Q, including the risk factors set forth in those filings. These forward-looking statements speak only as of the date hereof. Viking disclaims any obligation to update these forward-looking statements except as required by law.\nSOURCE Viking Therapeutics, Inc.\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/general/biotech/25/04/44791986/whats-going-on-with-viking-therapeutics-structure-therapeutics-stock-on-monday",
      "text": "- Roche’s CT-996 showed 6.1% mean weight loss in just 4 weeks in obese patients without type 2 diabetes.\n- Structure Therapeutics’ GSBR-1290 cut weight by 6.2% over 12 weeks in its Phase 2a obesity trial.\n- Get special access to three exclusive \"Top 10 Stocks\" power lists today, updated daily.\nViking Therapeutics, Inc. VKTX, Eli Lilly And Co LLY and Novo Nordisk A/S NVO stocks are trading higher on Monday.\nPfizer Inc. PFE announced on Monday that it will discontinue the development of danuglipron (PF-06882961), an oral glucagon-like peptide-1 (GLP-1) receptor agonist being investigated for chronic weight management.\nA single asymptomatic participant in one of the dose-optimization studies experienced potential drug-induced liver injury, which resolved after discontinuation of danuglipron.\nPfizer is one of several drugmakers working to develop an alternative to injectable weight loss drugs. Still, it’s far behind rivals like Eli Lilly and Novo Nordisk, who already lead the market with weekly injections.\nEli Lilly is developing orforglipron, which could be the first small-molecule weight-loss pill when it launches in 2026. This would give Eli Lilly a two-year lead before rivals catch up.\nIn March, Viking Therapeutics completed subject enrollment in its Phase 2 clinical trial of the oral tablet formulation of VK2735, the company’s dual agonist of the GLP-1 and glucose-dependent insulinotropic polypeptide (GIP) receptors.\nVK2375 is being developed in oral and subcutaneous formulations for various metabolic disorders, such as obesity. Viking expects to report data from the study in the second half of 2025.\nViking plans to initiate Phase 3 development with the subcutaneous formulation of VK2735 in the first half of 2025.\nIn June 2024, Structure Therapeutics Inc. GPCR unveiled 12-week topline obesity data from its Phase 2a study of GSBR-1290.\nIn the Phase 2a obesity study, GSBR-1290 demonstrated a clinically meaningful and statistically significant placebo-adjusted mean decrease in weight of 6.2% at 12 weeks.\nIn July 2024, Roche Holdings AG RHHBY announced topline results from two arms of an ongoing multi-part Phase 1 clinical trial for CT-996 for type 2 diabetes and obesity.\nThe data showed that treatment with CT-996 in participants with obesity and without type 2 diabetes resulted in a clinically meaningful placebo-adjusted mean weight loss of -6.1% within four weeks.\nThis data is better compared to existing competitors.\nIn June 2023, Pfizer discontinued the clinical development of another GLP-1-RA candidate, lotiglipron (PF-07081532), due to pharmacokinetic data from Phase 1 studies and laboratory measurements of elevated transaminases (liver enzymes).\nIn March, Altimmune Inc ALT unveiled the first disclosure of Alcohol Use Disorder (AUD) and Alcohol Liver Disease (ALD) as potential developments for its obesity drug, pemvidutide.\nPhase 2 trials for pemvidutide in AUD and ALD are expected to start in the second and third quarters of 2025, respectively.\nPrice Action: LLY stock is up 1.14% at $739.26, NVO stock is up 1.68% at $65.82, ALT stock is up 3.40% at $4.56, VKTX stock is up 13.5% at $25.21\nGPCR stock is up 8.36% at $17.23 at the last check on Monday.\nRead Next:\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/health-care/25/06/46050655/novo-nordisks-weight-loss-injection-cagrisema-data-sparks-investors-concern",
      "text": "- CagriSema led to a 20.4% weight loss at 68 weeks vs. 3.0% with placebo in adults without diabetes.\n- 50.7% of CagriSema users with obesity reached a BMI under 30, compared to 10.2% in the placebo group.\n- Get special access to three exclusive \"Top 10 Stocks\" power lists today, updated daily.\nOn Sunday, The New England Journal of Medicine (NEJM) published results from Novo Nordisk A/S‘ NVO phase 3 REDEFINE 1 trial of CagriSema plus lifestyle interventions for weight loss in adults with obesity or overweight who have a weight-related medical complication and without diabetes.\nCagriSema is being investigated by Novo Nordisk as a once-weekly subcutaneous injectable treatment for adults with overweight or obesity (REDEFINE programme) and as a treatment for adults with type 2 diabetes (REIMAGINE programme).\nCagriSema is an investigational product that combines the GLP-1 RA, semaglutide, with an amylin analog, cagrilintide.\nREDEFINE 1 Trial\nIf all patients adhered to treatment, CagriSema resulted in a greater weight loss of 22.7% at 68 weeks versus 2.3% in the placebo group.\nWhen evaluating the treatment effect regardless of adherence, those treated with CagriSema achieved a statistically significant weight loss of 20.4% at 68 weeks versus 3.0% for the placebo group.\nIn addition, a supportive secondary analysis showed that half (50.7%) of trial participants with obesity treated with CagriSema reached the threshold for non-obesity (BMI < 30 kg/m2) at the end of treatment, from a mean BMI of 38 kg/m2 at the start of treatment.\nIn the placebo group,10.2% reached that threshold at 68 weeks.\nSelect confirmatory secondary endpoints showed that if all participants adhered to treatment, 40.4% of those receiving CagriSema achieved a weight reduction of ≥25%.\nAdditionally, 23.1% lost ≥30% of their body weight.\nWhen applying the treatment policy estimand, 34.7% of participants treated with CagriSema achieved ≥25% body-weight reduction, and 19.3% achieved ≥30%.\nIn a prespecified analysis of 252 participants, the relative reduction in fat and lean soft-tissue mass from baseline to week 68 was -35.7% (fat mass) and -14.4% (lean soft-tissue mass) for those treated with CagriSema versus –5.7% and –4.3% for the placebo group, respectively.\nThese data, along with the related phase 3 REDEFINE 2 study conducted in adults with overweight or obesity and type 2 diabetes, were presented at the American Diabetes Association.\nREDEFINE 2 Study\nIf all participants adhered to treatment, the estimated mean change in body weight from baseline to week 68 was –15.7% with CagriSema versus –3.1% with placebo.\nWhen applying the treatment policy estimand, the estimated mean change in body weight from baseline to week 68 was –13.7% with CagriSema versus –3.4% with placebo.\nA greater proportion of participants receiving CagriSema, compared with placebo, reduced their body weight by >5% (83.6% vs. 30.8% of participants), ≥10% (65.6% vs. 10.3%), ≥15% (43.9% vs. 2.4%), and ≥20% (22.9% vs. 0.5%;)\nThe safety results from CagriSema in REDEFINE 2 were similar to those reported in the REDEFINE 1 trial.\nNovo Nordisk initiated the REDEFINE 11 trial with the first patient visit in early June 2025. REDEFINE 11 will explore further weight loss potential and safety of CagriSema 2.4 mg / 2.4 mg through a longer trial duration and other protocol changes compared to REDEFINE 1 and 2.\nMarket Reaction\nNVO experienced a decline of over 7% in premarket trading on Monday; the market’s reaction suggests that Novo Nordisk’s CagriSema has been perceived to have a less favorable side effect profile when compared to Eli Lilly And Co’s LLY orforglipron.\nIn Eli Lilly’s ACHIEVE-1 trial, the most common adverse events for participants treated with orforglipron (3 mg, 12 mg and 36 mg, respectively) were diarrhea (19%, 21% and 26%) vs. 9% with placebo, nausea (13%, 18% and 16%) vs. 2% with placebo, dyspepsia (11%, 20% and 15%) vs. 7% with placebo, constipation (8%, 17% and 14%) vs. 4% with placebo, and vomiting (5%, 7% and 14%) vs. 1% with placebo.\nIn REDEFINE 1, adverse events were mainly gastrointestinal (79.6% in the CagriSema group vs. 39.9% with placebo), including nausea (55% vs. 12.6 %), constipation (30.7% vs. 11.6%), vomiting (26.1% vs. 4.1%) and mainly were transient and mild-to-moderate in severity.\nAdding to the investor concerns, William Blair analysts expressed disappointment, stating, “We had hoped that the amylin component could provide a higher magnitude of weight loss among patients living with type 2 diabetes. Unfortunately, the hypothesis did not come to fruition, and in our view, there is no evidence to suggest CagriSema should be prescribed over Zepbound in any subpopulation, based on the available data released to date.”\nAnalyst Andy Hsieh further elaborated that the “high frequency of adverse events could fuel uncertainty over the asset’s differentiation against approved (Zepbound) or late-stage investigational (retatrutide and MariTide) compounds.”\nPrice Action: At the last check on Monday, NVO stock was down 7.10% to $68.53 during the premarket session.\nRead Next:\n- Eli Lilly’s Investigational Oral Pill Shows Weight Loss Benefits With Lingering Side Effect Concerns\nImage via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\ndate | ticker | name | Price Target | Upside/Downside | Recommendation | Firm |\n|---|"
    },
    {
      "url": "https://www.benzinga.com/markets/earnings/25/08/46960692/eli-lillys-closely-watched-obesity-pill-orforglipron-shows-around-12-weight-loss-but-trails-novo-nordisk",
      "text": "- Orforglipron led to 12.4% average weight loss vs. 0.9% for placebo, below Wall Street’s 15% forecast.\n- Eli Lilly Q2 sales rose 38% to $15.56 billion, topping estimates; Mounjaro sales surged 67% to $3.84 billion.\n- Get special access to three exclusive \"Top 10 Stocks\" power lists today, updated daily.\nEli Lilly and Co. LLY stock plunged on Thursday after the company released topline data from the Phase 3 ATTAIN-1 trial evaluating orforglipron, an investigational oral glucagon-like peptide-1 (GLP-1) receptor agonist.\nThe trial included over 3,000 obese patients with a weight-related medical problem and without diabetes.\nAt 72 weeks, all three doses of orforglipron met the primary endpoint and all key secondary endpoints compared to placebo.\nAlso Read: Trump Administration Plan Signals Shift Toward Weight-Loss Drug Coverage For Medicare Patients\nFor the primary endpoint, orforglipron 36 mg lowered weight by an average of 12.4% (27.3 lbs) compared to 0.9% (2.2 lbs) with placebo using the efficacy estimand. CNBC writes that Wall Street’s expectations were around 15%.\n59.6% of participants taking the highest dose of orforglipron lost at least 10% of their body weight, while 39.6% lost at least 15%.\nFor comparison, Novo Nordisk A/S’ NVO oral semaglutide 25 mg achieved a 16.6% weight loss vs. a 2.7% reduction with placebo after 68 weeks.\nCagriSema achieved a weight loss of 22.7% after 68 weeks in one study and 15.7% in another.\nThe company said orforglipron was also associated with reductions in known cardiovascular risk markers, including non-HDL cholesterol, triglycerides, and systolic blood pressure in pooled analyses across all doses.\nIn a pre-specified exploratory analysis, the highest dose of orforglipron reduced high-sensitivity C-reactive protein (hsCRP) levels by 47.7%.\nThe most commonly reported adverse events were gastrointestinal-related and generally mild to moderate in severity, the company said in a statement on Thursday.\nAbout 10.3% of patients in the 36 mg group discontinued treatment due to side effects, compared with around 2.6% on placebo. The overall treatment discontinuation rates were 21.9% (6 mg), 22.5% (12 mg), and 24.4% (36 mg) for orforglipron vs. 29.9% with placebo.\nLilly says it is on track to submit orforglipron to global regulatory agencies by year-end and is making substantial investments to meet anticipated demand at launch.\nQ2 Earnings\nEli Lilly also released better-than-expected second-quarter earnings on Thursday and raised 2025 guidance.\nThe U.S. pharma giant reported second-quarter revenue of $15.56 billion, up 38% year over year, beating the consensus of $14.39 billion, driven by a 42% increase in volume, partially offset by a 6% decrease due to lower realized prices.\nKey products revenue grew to $10.40 billion in the quarter, led by Zepbound and Mounjaro.\nThe company reported an adjusted EPS of $6.31, up from $3.92 a year ago, beating the consensus of $5.53.\nFor the second quarter, worldwide Mounjaro revenue increased 68% to $5.20 billion. U.S. revenue was $3.30 billion, an increase of 37%, reflecting strong demand, partially offset by lower realized prices.\nRevenue outside the U.S. increased to $1.90 billion compared with $677.2 million in the same quarter a year ago, primarily driven by volume growth, including entry into new markets.\nU.S. Zepbound revenue increased 172% to $3.38 billion, primarily driven by increased demand, partially offset by lower realized prices.\nVerzenio (a breast cancer drug) revenue increased 12% to $1.49 billion, driven by volume growth.\nGuidance\nEli Lilly raised fiscal year 2025 sales guidance from $58 billion-$61 billion to $60 billion-$62 billion versus the consensus of $59.45 billion.\nThe obesity drug maker raised 2025 adjusted earnings guidance from $20.78-$22.28 per share to $21.75-$23.00 versus the consensus of $21.59.\nPrice Action: LLY stock is trading lower by 7.04% to $693.85 premarket at last check Thursday.\nRead Next:\nImage via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "Eli Lilly's orforglipron, an investigational oral GLP-1 receptor agonist, showed a 12.4% average weight loss in a Phase 3 trial, falling short of the expected 15%. This underperformance has opened opportunities for competitors like Novo Nordisk, Terns Pharmaceuticals, Viking Therapeutics, and Structure Therapeutics, which are advancing their own weight-loss therapies. Analysts suggest that Lilly's setback could allow smaller biopharma firms to gain market traction, particularly as they prepare for upcoming data releases and trials.",
  "argos_id": "5HLZNKNBS"
}