{
  "url": "https://nypost.com/2025/08/07/lifestyle/maxims-unsexiest-women-list-surfaces-with-surprising-first-place-winner/",
  "authorsByline": "Ben Cost",
  "articleId": "0e03d49bc2d14b13b2eeeccc179365bb",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/tailoring-black-style-metropolitan-museum-109314740.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:57:29+00:00",
  "addDate": "2025-08-07T14:00:20.799979+00:00",
  "refreshDate": "2025-08-07T14:00:20.799982+00:00",
  "score": 1.0,
  "title": "Maxim condemned after ‘unsexiest women’ list surfaces with surprising first-place winner: ‘Ridiculously cruel’",
  "description": "“It’s so brutal in a way, so filled with rage and anger,” said Maxim’s top-ranked unsexiest woman at the time.",
  "content": "More like “unsexy and the city.”\n\nOnline viewers are ripping on a controversial 18-year-old Maxim article that listed the most “unattractive” women in showbiz — with “Sex And The City” star Sarah Jessica Parker topping the Mount Rushmore of alleged off-putting celebs. The unflattering ranking came to light via a Reddit post raising eyebrows online.\n\n“In 2007, Maxim thought it was clever to publish a list of ‘Unsexiest Women Alive’,” the original poster wrote. “Here are the 5 women they selected.”\n\nSJP was named the “unsexiest woman alive” with the men’s mag describing her as the “least sexy woman in a group of very unsexy women,” per an article in Today. “How the hell did this [horse] Barbaro-faced broad manage to be the least sexy woman in a group of very unsexy women and still star on a show with ‘sex’ in the title?” it read, per news.com.au.\n\nComing in second in this not-hot 100 was Amy Winehouse. The “Rehab” singer, who died four years later of alcohol poisoning, was lambasted for her supposed “openly hemorrhaging translucent skin, rat’s nest mane and lashes that look more like surgically attached bats.”\n\n“Grey’s Anatomy” star Sandra Oh placed third on this famous person “face mash,” which the Maxim scribes attributed to her “cold bedside manner and boyish figure.”\n\n“Self-righteous bellyaching and rapid postnuptial deterioration” landed pop sensation Madonna in fourth place, per the article, which compared her to “Nosferatu” actor Willem Defoe.\n\nBritney Spears, who was in the throes of her highly publicized meltdown at the time, rounded out the so-called cosmetically catastrophic quintet due to her weight gain and turbulent personal life.\n\nMaxim derided the pop princess as “filling chicken-grease-stained sweatpants on the cover of every trashy tabloid and gossip blog on the Internet” and having “gained two kids, two useless ex-husbands, and about 23 pounds of Funyun pudge,” per Pajiba.com.\n\nThe body-shaming hit list came out as a veritable aesthetic Razzie Awards to their Hot 100 list, which was released earlier that year. Coming in first place on the “sexiest woman’ rankings was Lindsay Lohan, followed by Jessica Alba, Scarlett Johansson and Christina Aguilera.\n\nThankfully, even the oft-merciless Reddit legions were horrified by the derogatory piece. “Excuse the f–k out of me?” spluttered one Redditor, while another wrote, “Never understood the criticism for SJP’s looks.”\n\n“All these women are hot? Wtf,” exclaimed a third.\n\nSome chalked up the list to the ridiculous beauty standards of the aughts.\n\n“We don’t talk enough about how ridiculously cruel the 2000s were to women’s bodies,” said another. “Jessica Simpson could not dare to add half a pound without some low life tabloid turning it to the headline.”\n\n“So, two Jewish women with prominent noses, an Asian woman, a 49-year-old woman, and a woman who had recently aged out of her sexy-baby marketing,” rued one critic. “Let’s call it like it is, none of these women fit into the Eurocentric-blonde-hair-button-nose-big-boob-flat-tummy-‘good-genes’-barely-legal category, so sadly I’m not surprised.”\n\nOthers thought the article was especially hypocritical given how most of the writers behind said countdowns generally weren’t easy on the eyes themselves.\n\n“It should be mandatory for anyone who publishes articles like this to post a picture of themselves beside their work,” declared one appalled reader.\n\nPajiba writer Kayleigh Donaldson pointed out that the article was even reviled at the time, writing that many media outlets deemed it in “shockingly poor taste and stunningly sexist” despite celeb body-shaming being in vogue.\n\n“Everyone engaged in this circle of human bear-baiting, with this handful of women held up as the acceptable targets,” she wrote. “The word ‘trainwreck’ had never been more utilized in the media vernacular.”\n\nSarah Jessica Parker spoke out about how much the article upset her.\n\n“Am I really the unsexiest woman in the world?” the actress said in an interview with Grazia magazine, the Daily Mail reported. “Wow! It’s kind of shocking.”\n\nShe added, “It’s so brutal in a way, so filled with rage and anger.”",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/femail/article-14976453/maxim-unsexiest-women-list-2007.html",
    "https://nypost.com/2025/08/06/lifestyle/the-financial-cheating-sign-most-partners-overlook/",
    "https://www.today.com/popculture/maxim-names-sara-jessica-parker-unsexiest-wbna21494412",
    "https://nypost.com/2012/10/20/britney-spears-shaved-her-hair-off-in-2007-to-cover-up-drug-use-ex-aide/",
    "https://nypost.com/2011/10/26/amy-winehouse-died-from-too-much-alcohol/#:~:text=LONDON%20—%20Amy%20Winehouse%20died%20as,a%20British%20coroner%20ruled%20Wednesday.",
    "https://nypost.com/2025/08/06/lifestyle/nyc-adjacent-small-town-named-a-top-charming-us-place-to-visit/",
    "https://nypost.com/2025/07/15/entertainment/nicolas-cage-explains-why-his-relationship-with-sarah-jessica-parker-was-doomed/",
    "https://nypost.com/2025/08/07/lifestyle/dear-abby-my-husband-wont-stop-competing-against-me/",
    "https://www.reddit.com/r/Fauxmoi/comments/1mis00i/in_2007_maxim_thought_it_was_clever_to_publish_a/",
    "https://www.news.com.au/entertainment/maxim-selects-the-worlds-unsexiest-women/news-story/88605352a6ee8ac78aa16efce20486cb",
    "https://www.pajiba.com/celebrities_are_better_than_you/lets-look-back-on-this-horrific-unsexiest-woman-alive-list-from-2007-and-learn-a-few-lessons.php"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "women",
      "weight": 0.088808395
    },
    {
      "name": "articles",
      "weight": 0.062932126
    },
    {
      "name": "Sarah Jessica Parker",
      "weight": 0.058683977
    },
    {
      "name": "unsexiest women’ list",
      "weight": 0.056059714
    },
    {
      "name": "Jessica Alba",
      "weight": 0.052178755
    },
    {
      "name": "first place",
      "weight": 0.050991315
    },
    {
      "name": "Jessica Simpson",
      "weight": 0.04993066
    },
    {
      "name": "Maxim",
      "weight": 0.049073253
    },
    {
      "name": "women’s bodies",
      "weight": 0.04856043
    },
    {
      "name": "very unsexy women",
      "weight": 0.048042063
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97998046875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.86572265625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.8154296875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.57177734375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.52001953125
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.351806640625
    }
  ],
  "sentiment": {
    "positive": 0.13757324,
    "negative": 0.5488281,
    "neutral": 0.31347656
  },
  "summary": "A controversial 18-year-old Maxim article has sparked outrage online after it was revealed that Sarah Jessica Parker was named the \"unsexiest woman alive\" in a list of alleged off-putting celebs. The magazine's decision to list the most \"unattractive\" women in showbiz was met with criticism, with SJP being described as the \"least sexy woman in a group of very unsexy women\" and \"the least sexy on a show with'sex' in the title. Other notable names included Amy Winehouse, Sandra Oh, Britney Spears, Lindsay Lohan, Jessica Alba, Scarlett Johansson, and Christina Aguilera. The article was condemned as being \"ridiculously cruel\" by online viewers.",
  "shortSummary": "Maxim’s 2007 “Unsexiest Women Alive” list, which included Sarah Jessica Parker, Lindsay Lohan, and Sandra Oh, was widely condemned as sexist and offensive.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "72c5a0929add478286502d7e37da593a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.today.com/popculture/maxim-names-sara-jessica-parker-unsexiest-wbna21494412",
      "text": "Charlize Theron and Jessica Alba regularly find themselves among the stars dubbed sexiest in the world.\nBut which stars unfortunately find themselves at the other end of the beauty spectrum?\nThe folks at Maxim magazine have revealed their list of the world’s unsexiest women, which includes ladies of the big screen, small screen and the concert stage.\nThe list, featured in the latest edition of Maxim, dubs “Sex and the City” star Sarah Jessica Parker as the No. 1 Unsexiest Woman Alive, claiming Parker was the “least sexy woman in a group of very unsexy women.”\nEmbattled songstress Amy Winehouse found herself in the second spot on the list, with the magazine citing her “translucent skin” and “rat’s nest mane.”\nA “cold bedside manner and boyish figure” landed “Grey’s Anatomy” star Sandra Oh in the third spot on the list.\nMeanwhile, the Material Girl finds herself fourth on the list, as Maxim dubs Madonna “unsexy” for her “self-righteous bellyaching and rapid postnuptial deterioration.”\nThe magazine even went as far as to call Madonna “Willem Dafoe with hot flashes.”\nAnd last but not least, coming in at the No. 5 spot on the dubious list is someone who is no stranger to her fair share of recent criticism — Miss Britney Spears.\nContributing to Brit’s “unsexiness,” the magazine cites her two kids, two ex-husbands, a slight weight gain and “losing the ability to perform.”"
    },
    {
      "url": "https://nypost.com/2012/10/20/britney-spears-shaved-her-hair-off-in-2007-to-cover-up-drug-use-ex-aide/",
      "text": "Britney Spears didn’t shave her head in a fit of rage — she did it so there would be no way to trace her drug use, a lawyer for her former manager claimed in court.\nJoseph Schleimer opened Sam Lutfi’s libel case against Spears’ parents and conservators by showing dramatic photos of the pop superstar with a shaved head and striking an SUV with an umbrella.\nSchleimer suggested to the LA jury that Spears was afraid a judge would order a test of her hair.\nIf drugs were found, the judge could take away her two sons and give custody to ex-husband Kevin Federline.\nSchleimer claimed Lutfi tried to save the meth-addled Spears from a mental breakdown but lost control — and was blamed for her being hospitalized and placed under a court-ordered conservator.\n“My client was made a scapegoat for drug abuse and erratic behavior of Britney Spears,” Schleimer said in his opening remarks Thursday.\nDuring a break when the jury was not present, Superior Court Judge Suzanne Bruguera warned Schleimer that his bold claims had to be supported by evidence.\n“You can’t waste time on statements just thrown in the air,” the judge said at another point.\nSchleimer said he would prove them through either “testimony or documentary evidence.”\nHe told the jury that one of the first things he did when he was hired as Spears’ manager was to have drug-sniffing dogs scour her hilltop home — and they found crystal meth in a trap door.\nSchleimer also claimed Spears took “all or most” of 30 prescription amphetamine pills during a 36-hour period in January 2008 and then locked herself in her bathroom. The freakout ended with her being hospitalized.\n“She liked to use amphetamines, speed or uppers . . . and most of the things that went wrong were related to that drug,” he said.\nSpears almost certainly won’t testify because she remains under a conservatorship overseen by a judge who has ordered her not to appear for trial or a deposition.\nBut Spears’ parents, Jamie and Lynne, both sat in the audience.\nYesterday, a lawyer for Jamie told jurors his client went to heroic lengths to save Britney from drug addiction and mental illness.\nLutfi agreed to work for Spears in July 2007 for 15 percent of her earnings — but only if she stayed away from drugs, his lawyer said.\nThe court case is the culmination of a long-running battle between Lutfi and Spears’ parents.\nHe is seeking millions of dollars from Spears and her family, claiming her mother’s 2008 book, “Through the Storm: A Real Story of Fame and Family in a Tabloid World,” lied about him drugging and isolating the pop star.\nHe is also seeking a portion of the singer’s profits, claiming he was a key player in her 2007 album “Blackout.”\nWith AP"
    },
    {
      "url": "https://nypost.com/2025/08/07/lifestyle/dear-abby-my-husband-wont-stop-competing-against-me/",
      "text": "Dear Abby: My husband won’t stop competing against me\nDEAR ABBY: Whenever my partner and I share errands or tasks, he never fails to comment on how much time and effort each of us puts into the project. He says things like, “You said it would only be an hour, but you took an hour and a half,” or, “You said you’d take a five-minute break and you took a half-hour.” When I respond, he replies, “I’m not complaining about it. I’m just telling you.” When I get upset, he accuses me of “getting defensive” or says he “doesn’t like how I’m treating him because he doesn’t treat me that way.”\nWhy do you think he feels it’s OK to make seemingly negative comments about my efforts and then tell me “it is no big deal” or he is “just making an observation”? How should I respond to his evaluations of me? — DOING MY BEST IN ILLINOIS\nDEAR DOING: My goodness. It almost seems like your partner never leaves the house without his stopwatch. The next time he does it, your response should be, “That’s it. Now I’M making an observation. What you’re doing IS a big deal. It is passive-aggressive. We need couples counseling NOW because it could ruin our relationship.” Then schedule an appointment and, if your partner refuses to go with you, go alone, because when you do, you will gain insight.\nDEAR ABBY: I was married for 20 years to a man who slowly isolated me from friends and family until I had no one but him to rely on. Now 49 and divorced, I am without close friends. For the last two years, I’ve been actively trying to build connections. I go to church and volunteer, rent a plot at the community garden to meet other gardeners, attend events at the local library, chat with vendors at the farmers market and know all my neighbors by name. People are friendly, and I’m well liked, but I am still alone every Friday night.\nIt seems like everyone I meet is either too busy or too wrapped up in their own lives to make room for a new friend. If this were just happening to me, I’d chalk it up to my age or stage in life. But my sons, who are 18 and 20, are struggling to find meaningful friendships too. Is this just how the world is now? Where have all the friendships gone? — FRIENDLESS IN SOUTH CAROLINA\nDEAR FRIENDLESS: Bear in mind that friendships are usually built over time and common interest. Have you tried inviting any of these church or gardening acquaintances over on a weekend night? Have you discussed this with your religious adviser? If you haven’t, that’s what I would recommend.\nAs to your sons and their socialization problem, assuming they are continuing their education, suggest they become active in sports or special interest clubs on campus. If that fails, they should talk to a counselor and ask how they can better integrate themselves into the student body.\nDear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at http://www.DearAbby.com or P.O. Box 69440, Los Angeles, CA 90069."
    },
    {
      "url": "https://nypost.com/2025/08/06/lifestyle/nyc-adjacent-small-town-named-a-top-charming-us-place-to-visit/",
      "text": "Small town just an hour from NYC named a top ‘charming’ gem to visit — and you don’t even need a car to get there\nBig ‘charm’ comes in small packages — and sometimes, on small budgets.\nA quaint small town just a short train ride from NYC has been called one of the most ‘charming’ places in the United States to visit without breaking the bank — a secret Hudson Valley residents already know.\nMarketBeat surveyed 3,011 travel professionals to rank the best so-called “bougie-on-a-budget” destinations — and the historic hideaway on the banks of the mighty Hudson made the number three spot on the list.\n“Travel doesn’t have to derail your financial goals,” Matt Paulson, founder of the financial media company, said in a statement.\n“These destinations show that it’s possible to enjoy a high-end vacation feel without the high-end price tag. For budget-conscious travelers, it’s a smart way to make memories and keep your savings on track.”\nTwo other spots in New York made the nifty list of fifty — Saranac Lake in The Adirondacks and Hammondsport in the Finger Lakes region.\nPicturesque Cold Spring has enjoyed a decades-long run as a top day trip from the Big Apple — with or without a car.\nA little over an hour away by train, the creatively-inclined village of less than 2,000 inhabitants is known as a perfect escape from the city’s hustle without the hassle of driving.\nThe beautiful burg is served by Metro-North’s Hudson Line from Grand Central Terminal.\nCold Spring’s quaint streets are lined with antique shops, cozy cafes, and inviting boutiques that invite leisurely strolls and discovery.\nThe town’s historic architecture and stunning river views create an atmosphere that feels both timeless and refreshingly peaceful.\nOutdoor enthusiasts will love hiking in nearby Hudson Highlands State Park, where trails offer breathtaking vistas of the river and valley.\nThe next Empire State spot on the list is Saranac Lake, up in the Adirondack Mountains at number six.\nWhile a bit farther from New York City — about a five-hour drive — this scenic town is still accessible without a car thanks to convenient bus and train options, making it an easy escape for nature lovers and culture seekers alike.\nThe last New York destination on the list is Hammondsport at No. 43.\nThe delightful small town — nicknamed “Little Lake Como” — is tucked along the southern tip of Keuka Lake in the Finger Lakes region.\nKnown for its quaint streets and stunning waterfront views, Hammondsport offers a perfect blend of history, nature, and local charm.\nIt’s also a five-hour drive from New York City.\nThe town is famous for its wine culture, with several award-winning wineries and tasting rooms nearby where you can sample some of the Finger Lakes’ best vintages. Outdoor lovers will enjoy kayaking on Keuka Lake, hiking scenic trails, or renting bikes to explore the rolling countryside.\nHistory buffs can dive into the town’s unique past at the Glenn H. Curtiss Museum, dedicated to the aviation pioneer who called Hammondsport home.\nAmerica’s top charming spots to visit, according to experts\n1. Twin Lakes, Colorado\n2. Kaunakakai, Hawaii\n3. Cold Spring, New York\n4. Mount Dora, Florida\n5. Cape May Point, New Jersey\n6. Saranac Lake, New York\n7. Grand Rivers, Kentucky\n8. Paris (and Kentucky Lake), Tennessee\n9. Dauphin Island, Alabama\n10. Los Alamos, California"
    },
    {
      "url": "https://www.dailymail.co.uk/femail/article-14976453/maxim-unsexiest-women-list-2007.html",
      "text": "Men's magazine Maxim under fire after list of 'unsexiest' women resurfaces with shocking first place\n- A list published by the men's magazine in 2007 has resurfaced\n- They named Sarah Jessica Parker as the least sexy woman at the time\n- READ MORE: Travis Kelce's X-rated dating dealbreakers resurface\nThe early 2000s were a different time - and a Maxim article from 2007 listing the 'unsexiest' women has ruffled some feathers after it resurfaced and went viral.\nThe men's magazine, which is known for featuring scantily clad celebrities, released the list nearly two decades ago.\nEntitled 'Unsexiest Women Alive', the list contained five female stars and a brief description for each one explaining the reasoning behind their placement on the list.\nThe unfortunate list was recently shared in a Reddit post, leaving many users horrified over who was chosen.\nFirst on the list was Sarah Jessica Parker, with the magazine claiming she was the 'least sexy woman in a group of very unsexy women' who ironically starred in a show with the word \"sex\" in the title, as per a Today article published at the time.\n'How the hell did this [horse] Barbaro-faced broad manage to be the least sexy woman in a group of very unsexy women and still star on a show with \"sex\" in the title?' read Sarah Jessica's description, per news.com.au.\nSecond on the list was Amy Winehouse, who died four years later, in 2011.\nThe site mentioned 'hemorrhaging translucent skin, a rat's nest mane, and lashes that look more like surgically attached bats', as to what landed her on the least sexy list.\nMen's magazine Maxim shared a list of 'unsexy' celebrities in 2007, and it recently resurfaced. Sarah Jessica Parker (pictured in 2007) topped the list\nAmy Winehouse was second, with Maxim mentioning her 'hemorrhaging translucent skin, rat's nest mane, and lashes that look more like surgically attached bats'. Amy pictured in 2007\nMaxim's article from an edition from 2007 resurfaced in a post on Reddit recently\nThird was Grey's Anatomy actress Sandra Oh, with the outlet citing her 'cold bedside manner and boyish figure'.\nFourth on the list was legendary pop star Madonna, with her 'self-righteous bellyaching and rapid postnuptial deterioration' listed as reasons.\n'Combine a Paris Hilton-like pet accessorizing fetish only for dirt-poor foreign babies with a mug that looks Euro-sealed to her skull, and you've got Willem Dafoe with hot flashes,' Maxim Magazine said, as per Stuff.\nNumber five was Britney Spears, with Maxim listing her messy private life, weight gain, and her 'losing the ability to perform' as what landed her there.\nThe magazine slammed her for 'filling chicken-grease-stained sweatpants on the cover of every trashy tabloid and gossip blog on the Internet’ and having ‘gained two kids, two useless ex-husbands, and about 23 pounds of Funyun pudge', according to Pajiba.\nThe article was slammed at the time for it's cruel list, with many outlets reporting on it.\nThe list appeared to be made as a joke in conjunction their Hot 100 list, which is dedicated to the 'sexiest' women of that year.\nIn 2007, the top spots on their Hot 100 list went to Lindsay Lohan, Jessica Alba, Scarlett Johansson and Christina Aguilera.\nThird was Grey's Anatomy actress Sandra Oh, with the publication citing her 'cold bedside manner and boyish figure'. Pictured in 2007\nThe 'unsexiest' list has now come under fire again after it resurfaced on a Reddit thread, with stunned users rushing to the comment section to share their thoughts.\n'Sarah Jessica Parker has always had an amazing bod, a gorgeous smile, amazing hair, and those hypnotizing eyes,' declared one user.\n'She was the freaking Lead in that show, and the whole franchise has her at the core. She is a bombshell hottie.'\n'It seems that with SJP, Madonna, and Britney, they're punishing women who used their sex appeal to build their own profiles in ways that centered their own experience,' another observed.\n'Then had the audacity to age, not cater to the male gaze, or gain like five pounds. Amy Winehouse also was not super traditionally feminine.\n'Other than that, this list is just random gorgeous women. It's early days of men lashing out about not being centered.'\n'This is a \"let's pick five famously beautiful women to take down a peg\" list. It's a pathetic ego trip,' slammed another.\nFourth was legendary pop star Madonna, with her 'self-righteous bellyaching and rapid postnuptial deterioration' listed as reasons why she made the list. She's seen here in 2007\nNumber five was Britney Spears (seen in 2007), with the outlet slamming her messy private life, weight gain and her 'losing the ability to perform' in regards to what landed her there\n'[Sandra Oh] on the list because of \"her cold bedside manner\" - I don't know how to break it to this writer but [her Grey's Anatomy character] Cristina Yang is not a real person,' mocked someone else.\n'I hate to be all “kids today” but they truly don’t understand the level of misogyny that women and girls were exposed to in the 2000s,' another shared.\nSarah Jessica had spoken about how much the article upset her at the time, calling it 'brutal'.\n'Am I really the unsexiest woman in the world?' she said in an interview with Grazia magazine. 'Wow! It's kind of shocking.'\n'It's so brutal in a way, so filled with rage and anger,' she added.\nMaxim has removed the article from its website, and went on to name the Sex And The City star as its 'unexpected crush' in 2008."
    },
    {
      "url": "https://www.pajiba.com/celebrities_are_better_than_you/lets-look-back-on-this-horrific-unsexiest-woman-alive-list-from-2007-and-learn-a-few-lessons.php",
      "text": "By Kayleigh Donaldson | Celebrity | May 25, 2021\nThe past year or so has been a fascinating one for the world of celebrities. COVID-19 lockdown led to a massive rewriting of the rules and expectations of fame, and that strange period of quiet forced many of us to re-examine our gossipy pasts. Really, 2021 in particular feels like the first time in quite a while that the general narrative surrounding celebrity is one of weary sympathy, a keen understanding that being famous is more likely to lead to misery than joy. From #FreeBritney to the exposing of Ellen DeGeneres’s nastiness to the Sussex exit from royal life, we’ve been surrounded by examples of how the previously accepted cruelties of celebrity life are being roundly called out or even rejected. Even the media outlets that proudly profited from this nastiness are eating crow and admitting their mistakes. Well, sort of. The point is that now, more than ever, we have the time and understanding to look back on our collective mistakes, call them out, and hopefully improve things for the next generation.\nI write a newsletter dedicated to examining vintage celebrity gossip and reporting (subscribe now!), which means I spend way too much time reading immensely creepy profiles of famous women written by leering dudes. My most recent issue focused on an Esquire cover piece of Jessica Biel that often read like it was written by a serial killer. I could be here all day dissecting the ways that male-oriented publications have objectified women and the slow evolution of that trend. Instead, I want to dig into something that is, bizarrely, far nastier than even those screeds.\nIn 2007, Maxim, a men’s magazine, shared the illustrious winners of their annual Hot 100 list, dedicated to ‘celebrating’ the sexiest women of that year. This time, first place was occupied by Lindsay Lohan, followed by Jessica Alba, Scarlett Johansson, and Christina Aguilera. That same year, they introduced another list, this one on the ‘Unsexiest Women Alive.’ Five women were named. Britney Spears was slated for ‘filling chicken-grease-stained sweatpants on the cover of every trashy tabloid and gossip blog on the Internet’ and having ‘gained two kids, two useless ex-husbands, and about 23 pounds of Funyun pudge.’ Madonna was mocked for her ‘rapid postnuptial deterioration’ and compared to Willem Dafoe. Sandra Oh, star of a series described as ‘a show about doctors is a show about sappy chick doctors we´re forced to watch or else our girlfriends won´t have sex with us’, was nicknamed ‘Dr. McSkinny’ with a ‘cold bedside manner and boyish figure.’ Amy Winehouse was picked apart for ‘her openly hemorrhaging translucent skin, rat´s nest mane and lashes that look more like surgically attached bats.’ The top spot went to Sarah Jessica Parker, who was called a ‘Barbaro-faced broad’ and compared to Secretariat.\nShockingly enough, none of this is available on Maxim’s website anymore, but the entire list has been copied to multiple sites over the past 14 years.\nEven at the time, this list was considered shockingly poor taste and stunningly sexist. The same outlets who repeatedly tore into Spears and Winehouse, two troubled women evidently struggling with mental and addiction issues, drew the line with Maxim. Parker talked openly about how much the Maxim piece hurt her. Maxim then tried to make up for it — I guess that’s what I’m calling this — by naming Parker their ‘unexpected crush’ in 2008. No news on whether or not Parker told them to shove it in response.\nI wanted to talk about this whole mess because it got me thinking about the ways that the continued misogyny of the press has evolved over the past two decades or so. We could be here for weeks talking about the entire history of celebrity coverage, but in terms of how the internet has shaped our understanding of it, there’s so much to mine. 2007 was a period of transition for gossip and celebrity-related reporting. MySpace was king and Twitter was the new baby of Jack Dorsey and pals that nobody outside of Silicon Valley had heard of. The blogs were highly caustic, with Perez Hilton the undisputed king of the crop thanks to his gleefully cruel posts. The dominant figures, however, were still magazines and TV, from People and Us Weekly to Entertainment Tonight and Inside Edition. This was a point in pop culture where celebrity coverage was wall-to-wall, consumed by the masses, and extremely profitable.\nThis was also the time of the new age of reality TV stars and the ‘all grown up’ child actors who partied hard. For a brief period, it was impossible to avoid paparazzi shots of Paris, Britney, and Lindsay hopping from bar to bar. The women were hugely sexualized and positioned as worthy of our scorn. Their weight was mocked or held up as a disgrace to all women, even though that level of skinniness remained aspirational content for practically every fashion house. Everyone engaged in this circle of human bear-baiting, with this handful of women held up as the acceptable targets. The word ‘trainwreck’ had never been more utilized in the media vernacular. It’s no surprise that Maxim felt like they were on safe ground by making that list. Why would they think they’d be singled out for doing what everyone else was?\nMaxim’s harshness here is at least honest with its sadistic intentions. They want to be mean. This is typical of the fratty tone of many men’s magazines from this era, near-identical to the sleazier rhetoric of ‘lads’ mags’ but with glossier photography. I have a painfully strong memory of one of the more popular British women’s weeklies doing a front cover on the ‘muffin tops’ of celebrities, which it then defended as a display of body positivity. Tell that to your cover artists who used graphics that pointed to women’s stomachs as if they were crime scenes. There seemed to be an entire ecosystem of D-List British celebrities whose endless cycle of weight loss victory and gaining ‘shame’ offered regular content for such publications. Even now, as the glossies embrace the most diluted and capitalism-friendly version of body positivity (white, cis, hourglass-shaped, seldom over a size 16), it’s not as though they’ve dropped the diet talk or scrutiny over others’ forms. Maxim derided Amy Winehouse and Britney Spears’s bodies but so did all of the women’s mags. Insults towards the latter were often accompanied with denigrating comments about her parenting abilities or near-cackling reminders of how far she’d ‘fallen.’ They would pretend these issues were about encouraging a ‘balanced debate’ by selectively publishing readers’ letters that acted as though a changing body was worthy of ‘both sides’ equivalences.\nMaxim positioned itself as just highbrow enough to separate itself from the plethora of lads’ mags that polluted the shelves in the late ’90s and early 2000s. Imagine a stopgap between GQ — expensive, conservative, metropolitan — and Nuts — crude, brash, more obsessed with nipples. As the label suggests, such magazines were for ‘lads’, which generally means working-class, 20-something, obsessed with football and boobs and an aspirational sort of masculinity. Raunch was front and center, as it was in tabloid newspapers thanks to Page 3. The tone was that of the ultimate guys’ night out, one of hedonistic freedom and zero consequences. And boobs. Seriously, I cannot overstate just how breast-obsessed this entire era was. I remember the ‘war’ of cosmetic enhancements between Katie Price and Jodie Marsh, and how giddily covered it was by magazines for both men and women.\nOne magazine, Loaded, even bragged that its entire aim was ‘the pursuit of sex, drink, football and less serious matters.’ Its founder, James Brown, said he set up the magazine for ‘my mates who liked music, clubbing, women, comedy and football.’ There was certainly a gap in the market for a brand of male-oriented media that didn’t focus entirely on the monied, but often these magazines felt like mean parodies of working-class masculinity. Women were treated as sex objects on those pages, but it’s not as though men were seen as three-dimensional beings either. I don’t say that to excuse their misogyny but merely to point out how the stark gender binary offered by money-driven media is reinforced. They all made money from denigrating women, even the ones made for us.\nThe era of the so-called lads’ mag is basically over, but its influence is evident. Especially in Britain, the sheer force of their particular strain of sexist banter has simply found pride of place online. Mostly, changes in publishing and marketing forced those blokey sites to take a new direction. LADbible started out with sexist content such as Cleavage Thursday but quickly changed to run-of-the-mill viral content and Buzzfeed-esque Facebook feed filler once it realized how to game the system. According to a 2015 piece by the Financial Times, magazines like Nuts and Maxim saw losses of over 80% to their readership. You can get boobs for free online and a Reddit thread full of all the misogyny you desire.\n14 years on from the Unsexiest Women Alive piece, I wonder how much has truly changed. The British edition of Vogue thoroughly entered the 21st-century thanks to editor Edward Enninful’s diversification of its staff and content. Even the most watered-down version of body positivity and money-friendly intersectionality offers the briefest glimmers of evolution to media. As with all things in this field, change is slow and maddeningly incremental. I doubt we’ll ever see a list like this again in print but check the clickbait ads on any site and you’ll find a barrage of shock-horror over actresses who have dared to age publicly or former cover girls who no longer have six-packs. There is still a lot of cash to be made here. Misogyny is endlessly profitable. Nowadays, it’s just glossier than ever."
    },
    {
      "url": "https://nypost.com/2025/07/15/entertainment/nicolas-cage-explains-why-his-relationship-with-sarah-jessica-parker-was-doomed/",
      "text": "Nicolas Cage reveals why his relationship with Sarah Jessica Parker was doomed\nNicolas Cage has divulged on his short-lived romance with Sarah Jessica Parker, admitting he could pinpoint to the exact moment he knew their relationship didn’t stand a chance.\nThe Oscar winner, 61, recalled making a faux pas when meeting the “Sex and the City” alum’s mother in the early 1990s.\n“I cared about Sarah, but I don’t think I passed the mom test,” the actor told E! News.\n“I recall sitting down with her and her mother for dinner at the Russian Tea Room, and I don’t know if it was my blue Vanson leather motorcycle jacket (which I still have) or my sinusitis, but I didn’t hear from her again.”\nCage’s admission comes just days after the “And Just Like That” star revealed that she had dated the “National Treasure” actor around the time of their 1992 rom-com “Honeymoon in Vegas.”\nDuring an appearance on “Watch What Happens Live” Sunday, host Andy Cohen quizzed the actress, 60, on her former fling.\n“Did you date Nic Cage?” the Bravo honcho, 57, asked his longtime friend.\n“Um, yes, I did,” she answered. “Yes, I did.”\n“Oh wow,” said Cohen, joking that they had “some talking to do.”\nParker and Cage first sparked dating rumors in 1991 while filming their romantic comedy.\nHowever, the pair’s romance didn’t stand the test of time as Parker soon found love with Matthew Broderick the following year.\nThe actress, who played Carrie Bradshaw in “SATC,” went on to tie the knot with the “Ferris Bueller’s Day Off” star in May 1997.\nThe pair are now parents to three kids: son James, 22, and twin daughters Tabitha and Marion, 16.\nElsewhere during her appearance on “WWHL,” Parker was asked “how and when” she knew that Broderick was “the one.”\nThe actress admitted that she knew she loved him “pretty early” on after “just spending a little bit of time with him.”\n“I remember I had to leave to go on location to shoot a movie. We were on East 10th Street [in New York City], and I was getting in a car to go away for a while. I remember thinking, ‘I love him,’” she said.\nParker revealed that she said those three magic words to Broderick first, adding she had “nothing to lose.”\nLuckily enough, Broderick immediately said the words back.\nCage, for his part, had said “I do” a total of five times.\nThe “Wicker Man” star was married to actress Patricia Arquette from 1995 to 2001, followed by Lisa Marie Presley from 2002 to 2004.\nHe then tied the knot with Alice Kim later that year, before their divorce in 2016. The exes share son Kal-El, 19.\nCage went on to wed Erika Koike in 2019. However, their romance crumbled that year.\nCage is currently married to Riko Shibata, and the couple welcomed daughter August, now 2, in September 2022.\nThe actor is also a father to son Weston, 34, whom he shares with ex-girlfriend Christina Fulton."
    },
    {
      "url": "https://nypost.com/2025/08/06/lifestyle/the-financial-cheating-sign-most-partners-overlook/",
      "text": "Experts reveal the obvious sign someone is cheating — that most people don’t catch: ‘That’s a bread crumb worth following’\nTurns out, the way to catch a cheater might not be hidden in their texts, tucked in their DMs, or whispered on a late-night phone call. It could be sitting right there on their bank statement.\nForget lipstick on the collar — suspicious ATM withdrawals might be the real smoking gun.\n“We’re basically a cashless society these days, so if your partner has always been about tap-and-go, using a credit card for reward points and suddenly starts doing ATM withdrawals – that’s a bread crumb worth following,” private investigator Cassie Crofts explained on TikTok.\nWhy? “Cash doesn’t leave a trail,” Crofts said. “If they go to a restaurant and spend $200, you can be pretty sure they weren’t dining solo. But $200 cash withdrawal? You’ve got no idea what happened.”\nBrothel manager Catherine De Noire says the location — and the timing — of those withdrawals can be even more damning.\n“The first thing is that a lot of guys don’t carry enough cash. So then they go and withdraw money from an ATM, which is usually somewhere near the brothel or inside the brothel,” she said on Instagram, as reported by The Tab.\n“This is very suspicious, especially when you see that your partner withdraws a lot of money at 4 am in the morning in this area, and the account is a shared one.”\nBottom line: If your joint account suddenly starts hemorrhaging twenties in the wee hours, it might be time for a serious talk.\nAnd while money might be the most obvious tell, it’s not the only household item that can turn snitch.\nAs The Post previously reported, one woman discovered her husband’s alleged infidelity thanks to a very unlikely source — their digital scale.\nIn a now-viral Reddit post, a wife using the handle u/throw-Doubt303 claimed she uncovered late-night weigh-ins on their shared scale — while she was out of town and her husband was supposedly home alone.\n“I checked the digital scale’s memory out of curiosity and it showed two ‘unassigned’ weigh-ins at exactly 120 lbs, logged at 12:25 a.m. and 12:26 a.m. back-to-back,” she wrote. “For context, I do not weigh 120 lbs, and I was not there on that date, just my husband.”\n“The goal was to work on ourselves to help build a better foundation and we agreed not to see other people,” she added in the comments.\nRedditors didn’t mince words. “Pro tip — don’t tell him you know there was a female there. Get in touch with attorneys to make a game plan,” one advised.\n“This is two back-to-back weights. This is pretty simple. He has moved on and is already hooking up with other women. No need to overthink this,” another said.\nOne commenter praised the find: “This is expert-level sleuthing. Men underestimate our level of intuition. When you confront him, he’ll probably try to paint you as crazy or paranoid. You’re not.”\nIn other words: if you’re looking for clues, don’t just follow the money — follow the ounces."
    },
    {
      "url": "https://nypost.com/2011/10/26/amy-winehouse-died-from-too-much-alcohol/#:~:text=LONDON%20—%20Amy%20Winehouse%20died%20as,a%20British%20coroner%20ruled%20Wednesday.",
      "text": "LONDON — Amy Winehouse died as the unintended consequence of drinking too much alcohol, a British coroner ruled Wednesday.\nCoroner Suzanne Greenaway gave a verdict of “death by misadventure,” saying the singer died of accidental alcohol poisoning. “The unintended consequence of such potentially fatal levels (of alcohol) was her sudden and unexpected death,” Greenaway said.\nThe singer, who had fought drug and alcohol problems for years, was found dead in bed at her London home on July 23 at age 27. An initial autopsy proved inconclusive, although it found no traces of illegal drugs in her system.\nPathologist Suhail Baithun told the inquest into the singer’s death that Winehouse had consumed a “very large quantity of alcohol” — the level in her blood put her more than five times over the legal drunk-driving limit.\nPolice Detective Inspector Les Newman, who was called after a security guard found Winehouse, said empty vodka bottles were scattered around her bedroom.\nWinehouse’s doctor, Dr. Christina Romete, said the singer had resumed drinking in the days before her death after a period of abstinence.\nRomete, who saw Winehouse the night before she died, said the singer was “tipsy but calm.” She said Winehouse had not spoken of suicide, and talked about her upcoming birthday.\nRomete said Winehouse had been prescribed drugs including the sedative Librium to help her cope with the symptoms of alcohol withdrawal, but the coroner said these had played no role in her death.\nWinehouse family spokesman Chris Goodman said it was a relief to the family “to finally find out what happened to Amy.”\n“The court heard that Amy was battling hard to conquer her problems with alcohol and it is a source of great pain to us that she could not win in time,” he said."
    }
  ],
  "argos_summary": "A resurfaced 2007 Maxim article listing the 'Unsexiest Women Alive' has sparked outrage online, particularly for naming Sarah Jessica Parker as the least attractive. The list also included Amy Winehouse, Sandra Oh, Madonna, and Britney Spears, with harsh and derogatory descriptions for each. Many social media users criticized the article for its misogynistic tone and the unrealistic beauty standards of the time, reflecting on how cruel the media was to women in the 2000s.",
  "argos_id": "5IYTZK6J0"
}