{
  "url": "https://www.benzinga.com/insights/earnings/25/08/46964051/what-to-expect-from-sotera-healths-earnings",
  "authorsByline": "Benzinga Insights",
  "articleId": "1c073439c51742b6af992e3c2ac0fa80",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T10:04:08-04:00",
  "addDate": "2025-08-07T14:13:23.267680+00:00",
  "refreshDate": "2025-08-07T14:13:23.267684+00:00",
  "score": 1.0,
  "title": "What to Expect from Sotera Health's Earnings - Sotera Health (NASDAQ:SHC)",
  "description": "",
  "content": "Sotera Health SHC will release its quarterly earnings report on Friday, 2025-08-08. Here's a brief overview for investors ahead of the announcement.\n\nAnalysts anticipate Sotera Health to report an earnings per share (EPS) of $0.16.\n\nInvestors in Sotera Health are eagerly awaiting the company's announcement, hoping for news of surpassing estimates and positive guidance for the next quarter.\n\nIt's worth noting for new investors that stock prices can be heavily influenced by future projections rather than just past performance.\n\nIn the previous earnings release, the company beat EPS by $0.02, leading to a 2.31% increase in the share price the following trading session.\n\nHere's a look at Sotera Health's past performance and the resulting price change:\n\nShares of Sotera Health were trading at $11.06 as of August 06. Over the last 52-week period, shares are down 21.96%. Given that these returns are generally negative, long-term shareholders are likely bearish going into this earnings release.\n\nFor investors, grasping market sentiments and expectations in the industry is vital. This analysis explores the latest insights regarding Sotera Health.\n\nA total of 1 analyst ratings have been received for Sotera Health, with the consensus rating being Outperform. The average one-year price target stands at $13.0, suggesting a potential 17.54% upside.\n\nIn this comparison, we explore the analyst ratings and average 1-year price targets of Adaptive Biotechnologies, Bruker and 10x Genomics, three prominent industry players, offering insights into their relative performance expectations and market positioning.\n• Analysts currently favor an Buy trajectory for Adaptive Biotechnologies, with an average 1-year price target of $14.75, suggesting a potential 33.36% upside.\n• Analysts currently favor an Neutral trajectory for Bruker, with an average 1-year price target of $45.86, suggesting a potential 314.65% upside.\n• Analysts currently favor an Neutral trajectory for 10x Genomics, with an average 1-year price target of $12.56, suggesting a potential 13.56% upside.\n\nWithin the peer analysis summary, vital metrics for Adaptive Biotechnologies, Bruker and 10x Genomics are presented, shedding light on their respective standings within the industry and offering valuable insights into their market positions and comparative performance.\n\nSotera Health ranks at the bottom for Revenue Growth and Gross Profit among its peers. It is also at the bottom for Return on Equity. Overall, Sotera Health's performance is weaker compared to its peers in these key financial metrics.\n\nSotera Health Co provides sterilization, analytical lab testing, and advisory services to help ensure that medical, pharmaceutical and food products are safe for healthcare practitioners, patients, and consumers. The company operates in three segments: Sterigenics, Nordion, and Nelson Labs. Sterigenics provides outsourced terminal sterilization and irradiation services for medical device, pharmaceutical, food safety, and applications; Nordion provides Co-60 and gamma irradiators, which are the key components to the gamma sterilization process; and Nelson Labs provides outsourced microbiological and analytical chemistry testing for the medical device and pharmaceutical industries. Its geographical segments are the United States, Canada, Europe and other regions.\n\nMarket Capitalization Perspectives: The company's market capitalization falls below industry averages, signaling a relatively smaller size compared to peers. This positioning may be influenced by factors such as perceived growth potential or operational scale.\n\nRevenue Growth: Sotera Health displayed positive results in 3 months. As of 31 March, 2025, the company achieved a solid revenue growth rate of approximately 2.56%. This indicates a notable increase in the company's top-line earnings. When compared to others in the Health Care sector, the company faces challenges, achieving a growth rate lower than the average among peers.\n\nNet Margin: Sotera Health's net margin is impressive, surpassing industry averages. With a net margin of -5.21%, the company demonstrates strong profitability and effective cost management.\n\nReturn on Equity (ROE): Sotera Health's ROE falls below industry averages, indicating challenges in efficiently using equity capital. With an ROE of -3.24%, the company may face hurdles in generating optimal returns for shareholders.\n\nReturn on Assets (ROA): Sotera Health's ROA lags behind industry averages, suggesting challenges in maximizing returns from its assets. With an ROA of -0.43%, the company may face hurdles in achieving optimal financial performance.\n\nDebt Management: The company faces challenges in debt management with a debt-to-equity ratio higher than the industry average. With a ratio of 5.67, caution is advised due to increased financial risk.\n\nTo track all earnings releases for Sotera Health visit their earnings calendar on our site.\n\nThis article was generated by Benzinga's automated content engine and reviewed by an editor.",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/quote/SHC/earnings"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Sotera Health",
      "weight": 0.09869459
    },
    {
      "name": "Sotera Health SHC",
      "weight": 0.0945241
    },
    {
      "name": "Sotera Health Co",
      "weight": 0.09315071
    },
    {
      "name": "industry averages",
      "weight": 0.07931739
    },
    {
      "name": "Health Care",
      "weight": 0.0779443
    },
    {
      "name": "stock prices",
      "weight": 0.06344842
    },
    {
      "name": "optimal financial performance",
      "weight": 0.061943542
    },
    {
      "name": "Sotera Healths past performance",
      "weight": 0.061773024
    },
    {
      "name": "Sotera Healths Earnings",
      "weight": 0.06143175
    },
    {
      "name": "Revenue Growth",
      "weight": 0.059715047
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97607421875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96435546875
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.80126953125
    }
  ],
  "sentiment": {
    "positive": 0.11242676,
    "negative": 0.5395508,
    "neutral": 0.34814453
  },
  "summary": "Sotera Health (NASDAQ:SHC) is set to release its quarterly earnings report on Friday, 2025-08-08. Analysts predict that the company will report an earnings per share (EPS) of $0.16. However, stock prices can be influenced by future projections rather than past performance. This analysis compares the analyst ratings and average 1-year price targets of three prominent industry players, Adaptive Biotechnologies, Bruker, and 10x Genomics, to their relative performance expectations and market positioning. Sotera Healthcare provides sterilization, analytical lab testing, and advisory services to ensure medical, pharmaceutical, food safety, and applications are safe for healthcare practitioners, patients, and consumers. Despite these challenges, the company's growth rate was lower than the average among peers and its net margin was high. The company's financial performance is below industry averages and its financial debt-to-equity ratio lags behind industry averages.",
  "shortSummary": "Sotera Health, a sterilization and testing services provider, is expected to report earnings of $0.16, with potential upside due to market positioning and financial challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ad71df897bf049a4af5e597bb3404294",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/quote/SHC/earnings",
      "text": "Sotera Health reports earnings on a quarterly basis. These quarterly earnings reports give investors a glimpse into financial results from a company for a 3 month period. Earnings reports almost always include EPS and Revenue results.\nAnalyze the earnings history of Sotera Health using advanced sorting and filters.\nGet Alert | |||||||||||\n|---|---|---|---|---|---|---|---|---|---|---|---|\nSHC | Sotera Health | $0.17 | $0.20 | — | — | $285.47M | $297.73M | — | — | 11/04/2025 | |\nSHC | Sotera Health | $0.19 | $0.17 | — | — | $276.59M | $275.81M | — | — | 08/08/2025 | |\nSHC | Sotera Health | $0.13 | $0.12 | $0.14 | 16.67% | $248.18M | $245.79M | $254.52M | 3.55% | 05/01/2025 | |\nSHC | Sotera Health | $0.23 | $0.20 | $0.21 | 5.00% | $310.24M | $290.88M | $290.20M | -0.40% | 02/27/2025 | |\nSHC | Sotera Health | $0.21 | $0.18 | $0.17 | -5.56% | $263.18M | $278.59M | $285.47M | 2.47% | 11/05/2024 | |\nSHC | Sotera Health | $0.21 | $0.16 | $0.19 | 18.75% | $255.28M | $266.44M | $276.59M | 3.80% | 08/05/2024 | |\nSHC | Sotera Health | $0.13 | $0.12 | $0.13 | 8.33% | $220.59M | $244.35M | $248.18M | 1.57% | 05/02/2024 | |\nSHC | Sotera Health | $0.25 | $0.26 | $0.26 | 0.00% | $251.59M | $302.15M | $310.24M | 2.68% | 02/27/2024 | |\nSHC | Sotera Health | $0.23 | $0.20 | $0.21 | 5.00% | $248.70M | $264.55M | $263.18M | -0.52% | 11/01/2023 | |\nSHC | Sotera Health | $0.27 | $0.18 | $0.21 | 16.67% | $266.64M | $261.05M | $255.28M | -2.21% | 08/03/2023 | |\nSHC | Sotera Health | $0.22 | $0.14 | $0.13 | -7.14% | $236.75M | $221.03M | $220.59M | -0.20% | 05/03/2023 | |\nSHC | Sotera Health | $0.23 | $0.22 | $0.25 | 13.64% | $241.25M | $247.55M | $251.59M | 1.63% | 02/28/2023 | |\nSHC | Sotera Health | $0.21 | $0.22 | $0.23 | 4.55% | $226.16M | $248.20M | $248.70M | 0.20% | 11/02/2022 | |\nSHC | Sotera Health | $0.26 | $0.24 | $0.27 | 12.50% | $251.92M | $256.38M | $266.64M | 4.00% | 08/04/2022 | |\nSHC | Sotera Health | $0.18 | $0.19 | $0.22 | 15.79% | $212.15M | $230.07M | $236.75M | 2.91% | 05/05/2022 | |\nSHC | Sotera Health | $0.09 | $0.22 | $0.23 | 4.55% | $216.84M | $236.37M | $241.25M | 2.06% | 03/01/2022 | |\nSHC | Sotera Health | — | $0.20 | $0.21 | 5.00% | — | $221.61M | $226.16M | 2.05% | 11/10/2021 | |\nSHC | Sotera Health | — | $0.21 | $0.26 | 23.81% | — | $227.21M | $251.92M | 10.87% | 08/12/2021 | |\nSHC | Sotera Health | — | $0.16 | $0.18 | 12.50% | — | $207.38M | $212.15M | 2.30% | 05/13/2021 | |\nSHC | Sotera Health | — | $0.07 | $0.09 | 28.57% | — | $209.56M | $216.84M | 3.48% | 03/09/2021 |\n| Fiscal Quarter | Date Reported | Actual EPS | Estimated EPS | Surprise % |\n|---|---|---|---|---|\n| Q1 | 2025-05-01 | $0.14 | $0.12 | 16.7 % |\n| Q4 | 2025-02-27 | $0.21 | $0.20 | 5.00 % |\n| Q3 | 2024-11-05 | $0.17 | $0.18 | -5.56 % |\n| Q2 | 2024-08-05 | $0.19 | $0.16 | 18.8 % |\n| Fiscal Quarter | Date Reported | Actual Revenue | Estimated Revenue | Surprise % |\n|---|---|---|---|---|\n| Q1 | 2025-05-01 | $254.52M | $245.79M | 3.55 % |\n| Q4 | 2025-02-27 | $290.20M | $290.88M | -0.40 % |\n| Q3 | 2024-11-05 | $285.47M | $278.59M | 2.47 % |\n| Q2 | 2024-08-05 | $276.59M | $266.44M | 3.80 % |\nSotera Health (SHC) is scheduled to report earnings on November 4, 2025. The last reported earnings were for reported on May 1, 2025 for Q1.\nThe Actual EPS was $0.14, which beat the estimate of $0.12.\nThe Actual Revenue was $254.5M, which beat the estimate of $245.8M.\nBrowse earnings estimates, EPS, and revenue on all stocks."
    }
  ],
  "argos_summary": "Sotera Health SHC is set to release its quarterly earnings report on August 8, 2025, with analysts predicting an earnings per share (EPS) of $0.16. The company has shown a mixed performance in the past, recently beating EPS estimates by $0.02, which resulted in a slight increase in share price. However, Sotera Health's overall performance metrics, including revenue growth and return on equity, lag behind its peers, leading to bearish sentiments among long-term shareholders.",
  "argos_id": "6T8P91JMQ"
}