{
  "url": "https://www.yahoo.com/entertainment/articles/warner-bros-targeting-12-14-125250946.html",
  "authorsByline": "Jill Goldsmith",
  "articleId": "8494b5ca57bf4281af6ec2157e4d4844",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/c445918e595aa6b8d8f074be8ec42b08eea955f397e57fa396666258a2dc29b6/ynews/resizefill_w1200/https://media.zenfs.com/en/deadline.com/5832c0d3a90872cb09dfe41e5d4079d8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T12:52:50+00:00",
  "addDate": "2025-08-07T13:18:26.481576+00:00",
  "refreshDate": "2025-08-07T13:18:26.481578+00:00",
  "score": 1.0,
  "title": "Warner Bros. Targeting 12-14 Theatrical Releases Annually Across Key Labels",
  "description": "Warner Bros. Discovery said it’s targeting 12-14 theatrical releases annually across its four key labels – Warner Bros. Pictures, DC Studios, New Line Cinema and Warner Bros. Animation — going forward as the company takes a victory lap following a super second quarter at the box office. In a letter to shareholders accompanying its latest …",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nWarner Bros. Discovery said it’s targeting 12-14 theatrical releases annually across its four key labels – Warner Bros. Pictures, DC Studios, New Line Cinema and Warner Bros. Animation — going forward as the company takes a victory lap following a super second quarter at the box office.\n\nIn a letter to shareholders accompanying its latest financial results, the company led by CEO David Zaslav said the releases will include 1-2 Warner Bros. Pictures tentpoles based on well-known Warner Bros. IP; 1-2 DC Studios films; 3-4 New Line Cinema releases (including horror and comedy); 1-2 WB Animation titles; and a select number of moderately budgeted original films.\n\nFilms released by WBD’s Motion Picture Group led by Pam Abdy and Michael DeLuca have generated over $3 billion in global box office year-to-date including over $2 billion from four films out in the second quarter, A Minecraft Movie, Sinners, Final Destination: Bloodlines, and F1 for Apple, which have together generated over $2 billion in global box office to date.\n\nWarner Bros. Studios has distributed five films in a row that opened to over $45 million domestically, underpinning “our increased bullishness regarding its future creative and financial prospects,” the letter noted.\n\n“We were in last place,” said CEO David Zaslav on a call with analysts after the numbers, almost marveling himself at a shift to almost first (after Disney).\n\nThe company expects $2.4 billion in total Studios profit for 2025 on the way to a $3 billion goal.\n\nThe company spent a lot of the letter on the recent momentum, saying it stems from “a deliberate rebuilding and transformation strategy executed over the last three years” since Discovery acquired Warner Media. That includes a more bottoms-up, analytically rigorous green lighting process with more granular input from distribution and global marketing teams; more systematic marketing and distribution checkpoints ahead of releases with an emphasis on the final eight weeks prior to release; and using real-time data to make better windowing decisions.\n\nThe film studio reorganized its marketing and distribution teams into a globally integrated model that has enabled us to seamlessly coordinate film releases across territories. That resulted in some recent layoffs.\n\n“With each of these measures, our goal has been to better position Warner Bros. Motion Picture Group to maximize the potential upside for creatively successful films, while reducing the inherent downside risk,” the letter said.\n\nSuperman from DC Studios opened to $220 million globally, the strongest DC Studios global opening since 2022. Jame Gunn is prepping the next one.\n\n“In its long history, the DC universe has never been managed in a more cohesive, collaborative, and strategic way. James Gunn and Peter Safran bring a unified creative vision to this beloved collection of storylines, and initial progress has heightened our long-term optimism.”\n\nGunn is busy on the next installments of the DC family, including The Batman II (2027) preparing to begin shooting next spring and the next Superman, as well as Supergirl: Woman of Tomorrow (2026), Clayface (2026), and the next Wonder Woman.\n• None ‘Wednesday’ Season 2 Soundtrack: All The Songs In Part 1\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "medium": "Article",
  "links": [
    "https://deadline.com/2025/08/streamers-forego-spotlight-sessions-edinburgh-tv-festival-1236480947/",
    "https://www.yahoo.com/entertainment/articles/wednesday-season-2-soundtrack-songs-204613630.html",
    "https://www.yahoo.com/entertainment/articles/buccaneers-season-2-soundtrack-griff-235242501.html",
    "https://www.yahoo.com/entertainment/articles/2021-22-awards-season-calendar-190021861.html",
    "http://bit.ly/31XsHSx",
    "http://bit.ly/2TkcoeG",
    "https://cloud.email.deadline.com/signup/",
    "https://deadline.com/2025/08/warner-bros-discovery-earnings-film-slate-second-quarter-1236480904/",
    "https://deadline.com/2025/08/sony-pictures-profit-jumps-television-series-deliveries-1236480816/",
    "https://www.yahoo.com/entertainment/articles/warner-bros-cuts-10-motion-170754253.html",
    "http://bit.ly/2TntOHq"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Warner Bros. Studios",
      "weight": 0.09392855
    },
    {
      "name": "Warner Bros.",
      "weight": 0.087459505
    },
    {
      "name": "Warner Bros. Animation",
      "weight": 0.087358154
    },
    {
      "name": "film releases",
      "weight": 0.087322176
    },
    {
      "name": "Warner Bros. Pictures",
      "weight": 0.08653616
    },
    {
      "name": "Warner Bros. Discovery",
      "weight": 0.08604084
    },
    {
      "name": "Warner Bros. Targeting",
      "weight": 0.08584252
    },
    {
      "name": "Warner Bros. Motion Picture Group",
      "weight": 0.0854891
    },
    {
      "name": "Warner Bros. IP",
      "weight": 0.08387797
    },
    {
      "name": "DC Studios",
      "weight": 0.076015145
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.93408203125
    },
    {
      "name": "/Arts & Entertainment/Entertainment Industry/Film & TV Industry",
      "score": 0.849609375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.51708984375
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.482177734375
    }
  ],
  "sentiment": {
    "positive": 0.5253906,
    "negative": 0.1184082,
    "neutral": 0.35620117
  },
  "summary": "Warner Bros. is using AI to generate takeaways from this article, which may not always match what's in the article but helps improve the user experience. The company is now targeting 12-14 theatrical releases annually across its four key labels, Warner Bros. Pictures, DC Studios, New Line Cinema, and Warner Bros Bros. Animation, as a result of a strong second quarter at the box office. The releases will include 1-2 Warner Bros Pictures tentpoles based on Warner Bros., 1-3 DC Studios films, 3-4 New Line cinema releases, and a select number of moderately budgeted original films. Warner Bros.' Motion Picture Group films have generated over $3 billion in global box office year-to-date, including four films out in Q2 that have together grossed over $2 billion. The film studio expects $2.4 billion in total Studios profit for 2025.",
  "shortSummary": "Warner Bros. aims for 12-14 annual releases, driven by strong box office performance and enhanced global marketing, despite recent job losses and market restructuring.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e953a53b57de4b4fa4a513f8dba975c3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://deadline.com/2025/08/sony-pictures-profit-jumps-television-series-deliveries-1236480816/",
      "text": "Sony Pictures saw a 76% jump in operating profit for the June quarter to $129 million on revenue that grew 4% to $2.3 billion as the studio said more series deliveries in the Television Productions division offset a softer theatrical release slate year-on-year for the Japanese giant’s fiscal first quarter.\nTelevision Productions saw revenue rise to $841 million from $607 million the year before when series deliveries were slowed by the impact of Hollywood strikes.\nTheatrical revenue, however, fell to $132 million from $322 million as 28 Years Later and Karate Kids: Legends went up against Bad Boys: Ride or Die the year before. Parent Sony noted higher contributions from catalog product in Motion Pictures, and said the contribution fell from catalog product in Television Productions.\nSony saw total revenue rise 2% to $17.6 billion and operating income pop 36% to $2.3 billion.\nWatch on Deadline\nSony shares are up 5% on the numbers and a more upbeat forecast. The company, also a leading player in music, games and electronics, raised its full-year operating profit forecast by 4% to $9 billion, saying it anticipates a smaller impact from tariffs amid President Donald Trump’s trade war, according to Reuters. Sony sees a tariff hit of 70 billion yen based on rates as of August 1, but said the situation remains fluid.\nHiroki Totoki, president and CEO, has said Sony is interested in expanding and accelerating its entertainment focus as described in a corporate “Creative Entertainment Vision” discussed at a strategy meeting in May.\nSony’s entertainment assets make up 60% of total revenue and, he pointed out then, are growing and highly resilient, even during economic downturn. He sees Sony Pictures as a central hub for cross-company collaborations. He was especially enthusiastic about anime-focused streaming service Crunchyroll, which had 17 million paid members as of March 31."
    },
    {
      "url": "https://deadline.com/2025/08/streamers-forego-spotlight-sessions-edinburgh-tv-festival-1236480947/",
      "text": "EXCLUSIVE: Streaming executives will not face their traditional grilling at the Edinburgh TV Festival Spotlight sessions this year.\nThe full line-up for this year’s annual gathering of the great-and-the-good of the UK TV industry is now public but Netflix, Disney+, Prime Video and Warner Bros. Discovery (WBD) Spotlight sessions do not feature.\nSpotlight sessions, which used to be called Controller Sessions, see UK commissioners take to the stage for an hour or so to talk upcoming content, strategy and – sometimes – take tricky questions from the audience of press and producers. They tend to also use the opportunity to unveil splashy new shows. The Spotlights have been a feature of the Edinburgh TV Fest for 50 years with British broadcasters taking part annually. As they burrowed deeper into the UK industry, streamers had begun hosting Spotlights in recent years.\nDeadline is told that the streamer spotlights are on temporary hiatus and will be back next year. The streamers pointed out that they remain Edinburgh partners and are still involved with a number of sessions. Netflix, Amazon and Disney are hosting masterclasses for hit shows Adolescence, Last One Laughing UK and Rivals respectively featuring senior commissioners and talent. Netflix UK chief Anne Mensah, meanwhile, will host a Q&A for young people in the industry that will be closed to press, we understand. Last year, she used her Spotlight session to address the Baby Reindeer controversy.\nWatch on Deadline\nThis year’s Edinburgh is the festival’s 50th anniversary and has attracted some serious star power. The final day features talks from Tina Fey, Graham Norton, Charlie Brooker and Stephen Lambert. Meanwhile, Bridgerton creator Shonda Rhimes is being given the inaugural Edinburgh Fellowship Award."
    },
    {
      "url": "https://deadline.com/2025/08/warner-bros-discovery-earnings-film-slate-second-quarter-1236480904/",
      "text": "A nice run at the box office bolstered Warner Bros. Discovery in the second quarter from A Minecraft Movie to Sinners with theatrical revenue up 38% as the company prepares to separate into two.\nTotal revenue was flat at $9.8 billion, in line with forecasts. The company swung to a net income of $1.58 billion for the three months ended in June from a massive loss pushing $10 billion the year before.\nA year ago, in the 2024 second quarter, the stock fell below $7 to an all-time low with an $11 billion write-down largely at its networks division after losing the NBA ahead of renewals with major video providers. The share price has doubled since then to near $13 and WBD has inked deals with the top six largest distributors as the standalone linear networks company called Discovery Global will split from a slimmed down Warner Bros. by the middle of 2026.\nThe Motion Picture Group led by co-chairs Pamela Abdy and Michael De Luca released Final Destinations: Bloodlines and The Accountant 2 and was Apple’s distribution partner for F1 The Movie. The Studios division posted a 60% jump in revenue to $3.8 billion. Profit surged to $863 million from $210 million.\nWatch on Deadline\nCEO David Zaslav sees studio momentum continuing, projecting Studios profit of at least $2.4 billion for the full year towards a goal of $3 billion. Superman from DC Studios was released in early in the current third quarter.\nStreaming led by HBO Max added 3.4 million subscribers to reach 125.7 million. The second quarter saw the conclusion of the first season of The Pitt, one of the most successful debut shows of 2025, the third season of The White Lotus, which delivered over 26 million average viewers per episode, up almost 40% from Season 2, and the returns of The Last of Us, And Just Like That…, Hacks, The Gilded Age and The Righteous Gemstones.\nHBO Max added Australia as it continues an international rollout. Zaslav has said he wants it to reach 150 million subs by the end of next year when it moves into the UK, Germany, Italy and other markets.\nDTC saw revenue rise 8% to $2.8 million and swung to a $293 million profit from a $107 million loss the year before\nWarner Bros., the streaming and studios, company will be home to Warner Bros. Television, Warner Bros. Motion Picture Group, DC Studios, HBO, HBO Max and Warner Bros. Gaming Studios, and the film and television libraries and run by Zaslav.\nDiscovery Global includes CNN, TNT Sports in the U.S., Discovery, and free-to-air channels across Europe, the Discovery+ streaming service and Bleacher Report (B/R).\nGlobal networks revenue fell 9% to $4.8 billion with a 25% decline in profit to $1.5 billion. Advertising revenue decreased 13% ex-FX, primarily driven by domestic audience declines of 23%.\nLinear woes pushed WBD to follow Comcast in separating out networks from the growing streaming and studio business. The company unveiled its post-split leadership in late July.\nIn conjunction with the separation, WBD successfully completed a tender offer and consent solicitation, as well as repaid the $1.5 billion term loan due 2026, financed by a $17 billion bridge facility, resulting in a $2.2 billion reduction in gross debt. It also repaid $500 million of debt due in the quarter, resulting in a $2.7 billion total reduction in gross debt during Q2.\n“We made substantive progress against each element of our strategic attack plan: returning our studios to industry leadership, scaling HBO Max globally, and optimizing our Global Linear Networks. Together, this array of success will help establish both Warner Bros. and Discovery Global as two strong and sustainable independent entities as we proceed towards our planned separation,” said Zaslav in a letter to shareholders released with the numbers.\nHe’ll be leading a call with analysts at 8 ET."
    }
  ],
  "argos_summary": "Warner Bros. Discovery plans to release 12-14 films annually across its key labels, following a successful second quarter that saw over $3 billion in global box office revenue. CEO David Zaslav highlighted a strategic transformation since acquiring Warner Media, focusing on a more analytical approach to film production and marketing. The company also reported a significant profit increase and subscriber growth for HBO Max, while preparing for a split into two independent entities by 2026.",
  "argos_id": "6X858DMSH"
}