{
  "url": "https://www.latimes.com/sports/dodgers/newsletter/2025-08-07/10-best-third-basemen",
  "authorsByline": "By Houston MitchellAssistant Sports Editor  Follow",
  "articleId": "940ac52a3c644a78a49020224ca05ed5",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/72889f3/2147483647/strip/true/crop/3001x1576+0+205/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff8%2F35%2Fcd4154ea4534852acb4ae85292f8%2Fap7710040176.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:55:00+00:00",
  "addDate": "2025-08-07T14:00:07.194878+00:00",
  "refreshDate": "2025-08-07T14:00:07.194880+00:00",
  "score": 1.0,
  "title": "Dodgers Dugout: The 10 best third basemen in Dodger history",
  "description": "The best third baseman in Dodgers history comes down to three names: Ron Cey, Pedro Guerrero and Justin Turner. Who did the fans choose.",
  "content": "Welcome to our Dodgers newsletter, which can be delivered to your inbox twice a week (for free!) if you sign up by clicking here\n\nHi, and welcome to another edition of Dodgers Dugout. My name is Houston Mitchell. On Friday, we’ll look at the struggling offense. Until then, here’s a bonus edition of the newsletter.\n\nHere are my picks for the top 10 third basemen in Dodgers history, followed by how all of you voted. Numbers listed are with the Dodgers only. Click on the player’s name to be taken to the baseball-reference.com page with all their stats.\n\nCey is one of the most underrated players in the history of baseball, let alone the Dodgers. He was unfortunate in that he was a direct contemporary of possibly the two greatest third basemen in history (especially up to that time) in Mike Schmidt and George Brett, so Cey often went overlooked.\n\nIf you ask fans who was the best player on the Dodgers from 1977-81, most would name Steve Garvey or Reggie Smith. But let’s take a look at the numbers:\n\nCey, of course, was nicknamed “The Penguin,” because his knees were about six inches off the ground, giving him a stiff-legged run. He never seemed slow though, just awkward looking.\n\nHe was co-MVP of the 1981 World Series, the Series during which he was famously hit in the head by a Goose Gossage fastball, still the only game (Game 5) I have watched where I was convinced someone had just been killed. Cey was taken to the hospital and had a concussion. You can watch it here. He played in Game 6.\n\n‘’I heard it hit the helmet,’’ Gossage said after the game. ‘’If he doesn’t have a helmet on, he might be dead.’’\n\nThe Dodgers traded Cey to the Chicago Cubs after the 1982 season for Dan Cataline and Vance Lovelace. They traded him too soon, for players that didn’t pan out. Cey went on the have four productive seasons with the Cubs, leading them to the NL East title in 1984. He was released by the Oakland A’s during the 1987 season and never played in the majors again.\n\nCey took part in our “Ask....” series five years ago. You can read it here.\n\nLet’s get the negative out of the way first: Guerrero was born to be a DH. He was a bad third baseman, a bad first baseman and a bad outfielder. But he may be the best hitter in Dodger history. He is second in OPS+ in Dodger history (minimum 3,000 plate appearances), trailing only Mike Piazza. and he had around 1,000 more plate appearances than Piazza. He hit .320 in 1985, then blew out his knee on an ill-advised slide in spring training of 1986. He came back in 1987 to hit .338. He had power, hitting 30+ homers three times (back when that really meant something) and had a good eye at the plate. He was not a good fielder at third, and hated playing there, but you have to give him credit for going out there whenever he was asked. On April 3, 2017, Guerrero had a stroke while in New York. According to his wife Roxanna Jimenez, doctors said Guerrero was in a coma, declared him brain dead and asked her to consider taking him off life support. She refused. Two days later, Guerrero woke up and has made a miraculous recovery. He still has memory problems and moves slower than he used to, but he makes appearances at autograph shows.\n\nTurner remains a fan favorite, as every offseason I get emails from readers hoping the Dodgers will bring him back.\n\nTurner had a middling career with the Orioles and Mets (.260 career average in 318 games) before signing with the Dodgers before the 2014 season in a transaction that few paid attention to. The Dodgers and Turner unlocked something in his swing though, because he was a revelation in 2014, hitting .340/.404/.493 in 109 games. He became the heart of the offense, and his hard-nosed style of play endeared him to fans. If there was a clutch situation, Turner was the one you wanted up at the plate. Remember this clutch moment against the Cubs in the 2017 NLCS? And even though he is on the downside of his career with the Cubs this season, he still has his clutch moments. He’s one of those guys you hope retires as a Dodgers.\n\nMuncy has never captured the hearts of Dodgers fans the way other players the last few years have. He hits for a low average, but draws a lot of walks and has a lot of power. The offense this season went into the tank about the same time he was injured. And while he will never win a Gold Glove, he usually battles the position to a draw. The streakiest of streak hitters, he set a record for most consecutive times reaching base in the NLCS last season, then followed it up by going 0 for 16 in the World Series. A big part of the Dodgers’ success since he joined the team.\n\nHow is a Hall of Famer fifth? He wasn’t a Hall of Famer when he was with the Dodgers. In fact, he was considered a bit of a disappointment until an amazing 2004 season, when he hit .334 with 48 homers and 121 RBIs. He finished second in MVP voting that year. Sadly, that would be his last year as a Dodger, as management at the time (owner Frank McCourt and general manager Paul DePodesta) didn’t make a big effort to sign him. “I think it was more the GM than anything,” Beltré said later in his career. Beltré blamed himself for telegraphing that he didn’t want to leave. “It was a mistake on my part to show it too much, that I wanted to stay back then. They wanted to use that against me in the negotiation.” (Read more about Beltre and his time with the Dodgers here.) Beltré was the best fielding third baseman in team history, and the Dodgers spent many years seeking an adequate replacement for him, something they were never able to do until Justin Turner came along.\n\nLavagetto had an incredible batting eye, walking 370 times while striking out only 155 times from 1937-41. His career was derailed by World War II, as he served four years in the Navy during what would have been his prime. When Lavagetto was young, Oakland Oaks owner Cookie DeVincenzi took an interest in him and signed him to a contract, so Lavagetto’s new teammates started calling him “Cookie’s Boy,” which eventually was shortened to just “Cookie.” His real first name was Harry. When he returned from the Navy, his skills had eroded enough to where he played only two seasons. But he had one great moment in him still. In Game 4 of the 1947 World Series, Bill Bevens of the Yankees had a no-hitter against the Dodgers in the ninth inning. Bevens had walked eight Dodgers, and the Yankees led 2-1. With one out, Bevens walked Carl Furillo, then got Spider Jorgensen to foul out. Al Gionfriddo ran for Furillo and stole second. Bevens intentionally walked Pete Reiser, and Eddie Miksis ran for Reiser. Manager Burt Shotton then sent up Lavagetto to pinch-hit for Eddie Stanky. Lavagetto hit Bevens’ second pitch off the right-field fence, scoring Gionfriddo and Miksis with the winning runs and ending Bevens’ no-hitter. Lavagetto died in 1990 at the age of 77.\n\nVaughan is in the Hall of Fame, as a shortstop wearing a Pittsburgh Pirates cap. That’s where he spent the first 10 seasons of his career.\n\nYou might see that gap in his career and think “military service interrupted his career,” but no. Vaughan hit .277 and .305 in his first two seasons with the Dodgers.\n\nOn July 10, 1943, Dodgers manager Leo Durocher suspended pitcher Bobo Newsom for insubordination. The next day, Vaughan read a newspaper story in which Durocher belittled Newsom. He confronted Durocher when he arrived at the ballpark. Durocher stood behind what he said. According to teammate Billy Herman, “Arky didn’t say another word. He went back to his locker and took off his uniform — pants, jersey, socks, cap — made a big bundle out of it, and went back to Leo’s office, telling Leo, ‘Take this uniform and shove it right up your... If you would lie about Bobo, you would lie about me and everybody else. I’m not playing for you.’\n\nAnd Vaughan left. Some of his teammates left with him. Durocher and general manager Branch Rickey convinced all of the players to return for that day’s game except Vaughan. He returned the next day and played the rest of the season, but quit baseball at the end of the season.\n\nRickey talked to him every year, trying to get him to return, but Vaughan refused. Until Rickey said he needed a veteran leader like Vaughan on the bench in 1947 because of the debut of Jackie Robinson. Vaughan returned. Vaughan hit .325 off the bench for the Dodgers and helped them reach the World Series, his first. He played in 1948, hit .244, and retired for good.\n\nOn August 30, 1952, he and a friend, Bill Wimer, went sailing on Lost Lake in northern California. The boat sank. Wimer couldn’t swim, so Vaughan tried to carry him along as he swam to shore. Witnesses at the time said they made it to 25 yards from shore when they both sank and drowned (why these witnesses didn’t help is lost to the annals of time). Their bodies were recovered the next day. Vaughan was 40.\n\nAt Vaughan’s funeral, Robinson said, “He was one of the fellows who went out of his way to be nice to me when I came in here as a rookie. Believe me, I needed it. He was a fine fellow.”\n\nCox was a member of the “Boys of Summer” Dodgers but had the misfortune of being traded to Baltimore just before the 1955 season, when Brooklyn finally won the World Series. Cox was a great fielder but below-average hitter. He served for four years in the military during World War II as a member of the 814th Signal Corps. The Signal Corps laid wire and set up communication centers for the advancing troops, which meant he was often in the middle of combat zones. One time, while playing for the Pirates, the sound of a fireworks display that was set off while he was on the field reminded him of his time in the military and he ran to the dugout for cover. And how good was Cox on defense? Perhaps teammate Carl Erskine put it best: “He had such quick hands that it seemed as though he had four gloves instead of one.” Cox started smoking when he was overseas during the war, and it eventually took its toll. He died of esophageal cancer in 1978. He was only 58 years old. The baseball field in his hometown of Newport, Pa., is named for him.\n\nStripp had a solid bat and was a Gold Glove-level defender, though they didn’t give that award out when he played. After Stripp retired, he opened up a baseball school in Orlando, Fla., which was considered one of the best baseball schools in the country in the 1940s and ’50s. Stripp died in Orlando in 1989 at the age of 86.\n\nThere isn’t a lot known about Stripp, who is one of those guys who just sort of faded away after he retired. He was born 122 years ago and played in the majors for 11 seasons. It’s nice to remember him here.\n\nSharperson was more of a utility player than a third baseman, appearing at every infield position and in right field with the Dodgers. His best season was 1992, when he hit .300 and made his only All-Star team. He was a guy you could put in for a player who needed a day off and know you were going to get a solid performance. Those types of players are very valuable to a team over the course of 162 games. On May 26, 1996, Sharperson was killed in a one-car crash at the junction of the 15 and 215 freeways. He was driving from Las Vegas, where he was playing for the triple-A Las Vegas Stars, to San Diego, which had just recalled him from the minors. Witnesses said it appeared he was about to miss the turn onto the 215 connector and tried to get over at the last second. His car hit a dirt median and Sharperson was ejected through the sun roof. Sharperson was only 34.\n\nOnce you get down to around ninth or 10th place, there are a lot of guys who are interchangeable there. You could make a case for Billy Grabarkewitz or Casey Blake or Ken McMullen or George Pinkney or Tim Wallach or a host of others. The Dodgers have not had a lot of great third basemen.\n\n1,286 ballots were sent in. First place received 12 points, second place nine, all the way down to one point for 10th place. For those of you who were wondering, I make my choices before I tally your results. Here are your choices:\n\nThe next five: Juan Uribe, Mickey Hatcher, Todd Zeile, George Pinkney, Joe Stripp.\n\nWho are your top 10 Dodgers left fielders of all time (including Brooklyn)? Email your list to top10leftfielders@gmail.com and let me know.\n\nMany of you have asked for a list of players to consider for each position. Here are the strongest left fielder candidates, in alphabetical order.\n\nA reminder that players are listed at the position in which they played the most games for the Dodgers, which is why Joc Pederson (center field) and Ron Fairly and Teoscar Hernández (right field), for example, will be listed at those positions.\n\nPedro Guerrero goes three for five with five RBIs in 1981 World Series Game 6. Watch and listen here.\n\nHave a comment or something you’d like to see in a future Dodgers newsletter? Email me at , and follow me on Twitter at . To get this newsletter in your inbox, .",
  "medium": "Article",
  "links": [
    "https://www.youtube.com/watch?v=K7HYqkt0ck4",
    "https://www.latimes.com/sports/dodgers/la-sp-adrian-beltre-dodgers-20180612-htmlstory.html",
    "https://www.twitter.com/latimeshouston",
    "https://www.baseball-reference.com/players/v/vaughar01.shtml",
    "https://www.baseball-reference.com/players/b/beltrad01.shtml",
    "https://www.baseball-reference.com/players/m/muncyma01.shtml",
    "https://www.baseball-reference.com/players/l/lavagco01.shtml",
    "https://www.baseball-reference.com/players/c/coxbi02.shtml",
    "https://www.youtube.com/watch?v=SlFkDAHuix0",
    "https://www.latimes.com/sports/newsletter/2020-06-04/jackie-robinson-ron-cey-dodgers-dugout",
    "https://www.baseball-reference.com/players/g/guerrpe01.shtml",
    "https://www.youtube.com/watch?v=CNyFt74UsWo",
    "https://www.baseball-reference.com/players/c/ceyro01.shtml",
    "https://www.baseball-reference.com/players/s/sharpmi01.shtml",
    "https://www.baseball-reference.com/players/t/turneju01.shtml",
    "https://www.baseball-reference.com/players/s/stripjo01.shtml",
    "https://www.latimes.com/newsletters/sports/la-newsletter-sports-report-signup-page-htmlstory.html",
    "https://www.youtube.com/watch?v=IzI9RwlCVpA"
  ],
  "labels": [
    {
      "name": "Roundup"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Dodgers history",
      "weight": 0.07319353
    },
    {
      "name": "Dodgers fans",
      "weight": 0.06984145
    },
    {
      "name": "Dodgers manager Leo Durocher",
      "weight": 0.06865626
    },
    {
      "name": "Dodgers",
      "weight": 0.0682709
    },
    {
      "name": "Dodgers Dugout",
      "weight": 0.066565886
    },
    {
      "name": "last season",
      "weight": 0.05705764
    },
    {
      "name": "most consecutive times",
      "weight": 0.0518562
    },
    {
      "name": "great third basemen",
      "weight": 0.050289024
    },
    {
      "name": "time",
      "weight": 0.050102856
    },
    {
      "name": "World Series",
      "weight": 0.049287535
    }
  ],
  "topics": [
    {
      "name": "MLB"
    },
    {
      "name": "Baseball"
    },
    {
      "name": "Los Angeles Dodgers"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9892578125
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9560546875
    }
  ],
  "sentiment": {
    "positive": 0.08514404,
    "negative": 0.58496094,
    "neutral": 0.33007812
  },
  "summary": "The 10 best third basemen in Dodgers history are selected by Houston Mitchell for their ranking, followed by their votes from fans. Cey, nicknamed “The Penguin’s Penguin, was co-MVP of the 1981 World Series and often overlooked due to his contemporary contemporaries Mike Schmidt and George Brett. Guerrero was traded to the Chicago Cubs after the 1982 season for players that didn't perform well, leading them to the NL East title in 1984. He had four productive seasons with the Cubs, but was released by the Oakland A's during the 1987 season and never played in the majors again. Guerrero is considered the best hitter in Dodger history, second in OPS+ in Dodgers' history (minimum 3,000 plate appearances), trailing only Mike Piazza. Despite a disappointing career with the Orioles and Mets, Turner remains a fan favorite.",
  "shortSummary": "The Dodgers Dugout features top 10 third basemen in history, with notable contributions from Cey, Turner, and Guerrero, despite some controversial moments and tradeoffs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "162210462a2c408181777d14bf3bad51",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/sports/dodgers/la-sp-adrian-beltre-dodgers-20180612-htmlstory.html",
      "text": "To Dodgers, Adrian Beltre is the Hall of Famer who got away\n- Share via\nInside a ballpark 1,400 miles east of Dodger Stadium, Adrian Beltre let a memory wash over him. He has played 21 seasons in the major leagues, but few move him like 2004. As he hearkened back to that summer in Los Angeles, when he threatened to homer with every swing and fans greeted him by chanting “M-V-P,” his voice softened.\n“I will never forget that,” Beltre said as he sat by his locker at the Texas Rangers’ Globe Life Park in Arlington. “I will never forget that because when you come to the plate and hear those chants, that is so nice. They were great fans. They were great to me.”\nBeltre, the 39-year-old third baseman, thought he might spend the rest of his career in Los Angeles’ embrace. He was wrong. Spurned by the Dodgers as a free agent after the 2004 season, Beltre moved to the American League. His fans in Los Angeles watched from afar as Beltre built a résumé that will deliver him to the Hall of Fame: more than 3,000 hits, four All-Star teams, five Gold Glove awards and a parade of teammates vouching for his joyous spirit and selfless resolve.\nBeltre displayed those qualities, in sporadic stints, as a Dodger. The organization plucked him out of the Dominican Republic when he was 15. He made the city his home. When he flared like a supernova in 2004, he laid the foundation for his Cooperstown qualifications.\nAt 25, Beltre generated the most productive season by a position player in Dodgers history, according to FanGraph’s version of wins above replacement. He hit 48 home runs and drove in 121 runs as he led the team to its first National League West title since 1995. At third base, Beltre was “the best I ever saw,” former manager Jim Tracy said. Beltre finished the year with a 9.7 WAR, ahead of Jackie Robinson in 1949 (9.6) and Mike Piazza in 1997 (9.1).\nIt was the culmination of a decade of development, and it was also the end. Beltre never played another game as a Dodger. His departure left Tracy “devastated, devastated, absolutely devastated,” he said. The Dodgers cratered in 2005. After a frustrating five years in Seattle, Beltre flourished into stardom in his 30s. He fulfilled all the promise he augured in Los Angeles — except he did it in Boston and Texas.\n“It’s one of those things where you wish he could have been a Dodger for his entire career,” former teammate and current Dodgers manager Dave Roberts said. “The way the economics worked out, he wasn’t. But he’s always considered L.A. home.”\nWhen Beltre visits Los Angeles on Tuesday with the Rangers, it will mark his first game at Dodger Stadium since 2009. His return will resurrect a question that has puzzled fans for 14 years: Why did the Dodgers, under the leadership of owner Frank McCourt and general manager Paul DePodesta, let Beltre leave?\n“I just don’t think Frank and their ownership appreciated who Adrian was going to grow into,” said Scott Boras, Beltre’s agent.\nBeltre had a slightly different take. “I think it was more the GM than anything,” he said. Beltre blamed himself for telegraphing that he didn’t want to leave. “It was a mistake on my part to show it too much, that I wanted to stay back then,” he said. “They wanted to use that against me in the negotiation.”\nThe Dodgers discovered Beltre in 1994, when he was working out at their Campo Las Palmas complex in the Dominican Republic. His talent was impossible to ignore. During his first two full seasons in the minors — when he was 17 and 18 years old — he hit 52 home runs. He started 1998 in double-A San Antonio.\nA freakish occurrence accelerated Beltre’s arrival in the majors. Tommy Lasorda had recently taken over the Dodgers player-personnel decisions. In June 1998, when doctors removed a benign polyp from outfielder Bobby Bonilla’s large intestine, Lasorda advocated for promoting Beltre.\nIn his first at-bat as a Dodger, on June 24 against the Angels at Dodger Stadium, Beltre clubbed a run-scoring double off Chuck Finley. “This kid’s got talent, and he’s got everything he needs to be here,” Lasorda said that day.\nBeltre hit only .215 as a rookie but he never went back to the minor leagues. He was 19. Two decades later, he credited Lasorda for stumping for his promotion and protecting him when he struggled.\nBeltre endured the fate of the precocious, developing at the game’s highest level. He established himself as the starting third baseman in 1999 and hit 20 homers in 2000. He could not make progress in a straight line; from 2001 to 2003, Beltre was a below-average hitter. He flung errant throws in the field and hacked with abandon at the plate.\n“His first few years, he learned an awful lot about being a man and being a leader,” Tracy said. “Believe me.”\nThe failure ate at Beltre. After one tough outing, Boras sat with Beltre in the Dodger Stadium parking lot until 4 a.m. trying to boost his client’s confidence. In the winter after 2003, as Beltre approached his free-agent season, Boras said he heard a series of criticisms from Dodgers management about Beltre. Boras filtered them back to his client: Beltre was a “5 o’clock hitter,” incapable of translating batting-practice power into games. He allowed emotion to overwhelm him. “They also thought I was going to get fat,” Beltre said, chuckling at his locker.\n“Those comments made me realize, OK, I need to prove these people wrong,” Beltre said. “Even though I don’t need any more motivation to play baseball, if that’s what they’re thinking of me, then I’m going to show them that they’re wrong.”\nAs the 2004 season approached, the Dodgers underwent a franchise-wide upheaval. McCourt purchased the team from News Corp. in January. A couple weeks later, he installed DePodesta as the general manager. DePodesta came from the Oakland Athletics, where he played a supporting role alongside Billy Beane in baseball’s sabermetric revolution.\nHired too late to reshape the Dodgers during the winter, DePodesta made a splash in the spring. Just before the season began, he acquired outfielder Milton Bradley. The trade meant Beltre would no longer hit in the middle of the lineup. On opening day, Tracy called Beltre into his office and held up a lineup card. Beltre would bat seventh, Tracy explained, but there would be 161 games after that.\n“You want to hit third or fourth on this ballclub?” Tracy told Beltre. “You make me do it.”\nAll you have to do is touch it. Put a good swing on it and touch it, and the ball is going to go somewhere.\n— Adrian Beltre\nBeltre soon absorbed something more debilitating. After a prodigious April in which he homered seven times and moved up in the batting order, Beltre started hobbling with bone spurs in his left ankle. He pushed off surgery until after the season. The trainers numbed the joint with cortisone.\nThe ankle hurt when Beltre made abrupt stops on the bases and it was agony when he whiffed on a pitch. Years later, his former teammates credited the injury for transforming Beltre as a player. He had always been a free swinger, but now his focus winnowed.\n“I knew if I swung and missed, it was going to hurt,” Beltre said. “Somehow, I was more concentrated on getting a good pitch to hit and not missing it.”\nAs he studied how pitchers attacked him, Beltre noticed a pattern. He saw a slew of elevated fastballs mixed with sliders down and away. He chased the breaking balls, even though he knew he could not punish those pitches. When he decided to concentrate on pummeling fastballs, his strikeout rate shrank and his slugging percentage rose.\n“All you have to do is touch it,” he said. “Put a good swing on it and touch it, and the ball is going to go somewhere.”\nThe baseball soared for Beltre all season. He hit 19 homers in the first three months of the season. He bashed 10 in July and 13 more in August. He slowed, somewhat, in September, going deep six times but still producing a .937 on-base plus slugging percentage for the month.\nBeltre fell into an easy rhythm. During batting practice, he engaged in home-run derbies with veteran teammate Shawn Green. They rewarded points for distance and location, trying to crush baseballs to the opposite field. Afterward they retired to the clubhouse, where Beltre teamed with Jose Lima against Green and Paul Lo Duca in games of cards. The sides talked trash against each other — when Beltre and Lima weren’t arguing in Spanish over strategy.\nBoth Green and Roberts recalled Beltre as a crucial part of the clubhouse’s connective tissue. He hung with American players and Latino players alike. His energy was contagious.\n“I can't think of a teammate I enjoyed playing with more than him,” Green said. “He was like the perfect teammate.”\nAs the trade deadline approached that summer, the Dodgers held a small lead in the division. DePodesta made a series of moves. Roberts was shipped to Boston. Lo Duca and Guillermo Mota went to Florida in a deal which brought Hee-Sop Choi and Brad Penny. Steve Finley arrived from Arizona, but the shakeup rocked the clubhouse.\n“We had a worse team after the trade deadline,” Green said. “I would say a significantly worse team.”\nI can't think of a teammate I enjoyed playing with more than him. He was like the perfect teammate.\n— Shawn Green on Adrian Beltre\nYet the Dodgers captured the division. Beltre led the way. He was quiet during a first-round loss to St. Louis, but he finished second in the National League MVP voting that October to Barry Bonds. His manager did not view his season as a fluke. “You’ve got more than a cornerstone,” Tracy said. “You’ve developed the side of a building.”\nWhen the offseason began, Beltre had modest goals. He figured he compared well with Oakland Athletics third baseman Eric Chavez, who had signed an extension which paid him $8.5 million in 2005. Beltre hoped for a contract that lasted three or four seasons worth $8 million a year. He wanted to sign early and remain a Dodger. Early in the winter, Beltre recalled, he and Boras met with DePodesta and McCourt.\n“The conversation went well,” Beltre said. “The owner said, ‘Make sure you sign him.’ That was early November, I think, and after that I didn’t hear from them until late December. I think the GM tried to use the knowledge that he had against me.”\nReached via email, DePodesta cited a contractual provision which prevents him from “speaking publicly about anything during my time with the Dodgers” and declined comment.\nBeltre felt the Dodgers placed him on the back burner. As negotiations with Seattle intensified, Boras recalled trying to contact DePodesta and McCourt. Neither man picked up when Boras called, because they were dining with free-agent pitcher Matt Clement.\nThe Mariners offered Beltre a five-year, $64-million contract. The Dodgers eventually countered with a six-year, $60-million deal, The Times reported. Boras pegged the package at closer to $50 million in value. Beltre recalled an even lower figure: “The offer was half the years and very much half the money,” he said. “As much as I liked L.A., as much as I wanted to stay there, I couldn’t do that.”\nBoras declined to place responsibility on DePodesta. They maintained a productive relationship. Later that offseason, the Dodgers signed outfielder J.D. Drew to a five-year, $55-million contract and pitcher Derek Lowe to a four-year, $60-million contract. Both were Boras clients.\n“We had great success with Paul,” Boras said. “It wasn’t really about him. I just think ownership wanted to spend their money elsewhere.”\nBeltre never hid his disappointment. He carried it with him to the Pacific Northwest. Back in Los Angeles, Tracy grieved over losing one of his favorite players. “What the hell are we doing?” he wondered.\nIn January, Green waived his no-trade clause to let the team send him to Arizona. “Had they kept Adrian,” Green said, “I think I would have rejected a trade.”\nNo one benefited from the dissolution. The Dodgers brought in veteran infielder Jose Valentin to replace Beltre; Valentin hit .170 and played in 56 games as the organization engaged in a yearly exercise in trying to find a regular third baseman. The team skidded to a 71-91 record, its worst since 1992. Tracy was fired after the season. DePodesta joined him on the unemployment line a few weeks later; he now works for the Cleveland Browns. When his finances unraveled, McCourt fell into bankruptcy and sold the Dodgers to Guggenheim Partners in 2012.\nI just don’t think Frank [McCourt] and their ownership appreciated who Adrian was going to grow into\n— Scott Boras, Beltre's agent\nBy then, Beltre had bounced from Seattle to Boston to Texas. In his first year as a Mariner, he felt engulfed by the pressure of his contract. He hit only 19 home runs because “I was trying to do too much,” he said. He remained a valuable hitter, even as the unforgiving environment at Safeco Field suppressed his power.\nHis renaissance began when he hit 28 homers and 49 doubles on a one-year deal with Boston in 2009. The performance convinced Texas to sign him to a six-year, $96-million contract. As the Rangers became an annual playoff contender, Beltre soaked up the spotlight. He played third base without a protective cup, he hated it when teammates tried to touch his head and he competed with shortstop Elvis Andrus to psych each other out on pop-ups. He was beloved for his persona and his performance.\n“He had no weakness as a player,” Green said. “And even now, at 40 years old, he’s still an incredible player.”\nBeltre became the face of the Rangers’ franchise. In 2013, the organization named him team captain. One day last weekend, the Make-A-Wish Foundation brought a young Rangers fan to Globe Life Park. Beltre took the boy on a tour of the clubhouse, then brought him into the team’s first group for batting practice.\nAs Beltre sat with a reporter later in the afternoon, the boy came over to say goodbye. Beltre hopped out of his chair to shake hands. “Max, you leaving?” Beltre said. “Hey, it was nice having you, brother. You come back anytime, OK?”\nIt was the sort of role Beltre could have played for the Dodgers. It was the role he wanted to play for the Dodgers.\nNo longer does Beltre wonder about alternative history, how his career might have gone had the Dodgers tried harder to keep him. He has already lost too much time pondering the question, he admitted. He still lives outside Los Angeles. He sounded eager to take in Dodger Stadium this week. The pain of his departure has faded.\n“I wanted to stay there forever,” Beltre said. “But it didn’t happen. But I don’t regret any move that I’ve made my career. Everything happened for a reason.”\nTwitter: @McCulloughTimes"
    }
  ],
  "argos_summary": "The Dodgers newsletter highlights the top 10 third basemen in Dodgers history, featuring players like Ron Cey, who was overshadowed by contemporaries, and Adrian Beltre, whose departure from the team after a stellar 2004 season remains a point of contention among fans. Beltre, who went on to have a Hall of Fame career, reflects on his time with the Dodgers and the circumstances that led to his exit, including management decisions and contract negotiations. The newsletter also touches on other notable players and their contributions to the team, emphasizing the Dodgers' ongoing search for great third basemen.",
  "argos_id": "7KV3QDSEO"
}