{
  "url": "https://www.dailymail.co.uk/galleries/article-14979777/How-Warren-Buffetts-retirement-affected-Berkshire-Hathaway.html",
  "authorsByline": "Alice Wright",
  "articleId": "26014116871d49879297b1c2f56b7ba9",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/06/21/100979575-0-image-a-11_1754512726307.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-07T14:05:16+01:00",
  "addDate": "2025-08-07T13:22:11.435183+00:00",
  "refreshDate": "2025-08-07T13:22:11.435186+00:00",
  "score": 1.0,
  "title": "How Warren Buffett's retirement has affected Berkshire Hathaway",
  "description": "Warren Buffett's retirement may have finally shaken investor confidence.",
  "content": "Shares of Warren Buffett's Berkshire Hathaway have taken a hit since the investment oracle announced his retirement in May. Under the direction of Buffett since 1965, Berkshire has outperformed the S&P 500 by more than 5 million percentage points. However, Berkshire's class A shares — its original stock — have slumped 14 percent since Buffett, 94, revealed he would be handing over the reins to longtime deputy Greg Abel.\n\nOver the same time, the S&P 500 has soared 11 percent — marking the widest gap between Berkshire and the broader market since 1990, according to the Financial Times. Despite the drop in Berkshire's value, his personal wealth of $141 billion makes him the tenth richer person on Bloomberg's billionaires index.\n\nBuffett, known as the 'Oracle of Omaha,' has led Berkshire since 1965, transforming it from a struggling textile firm into a global investment giant with holdings from Apple to Dairy Queen. Investors' unease appears tied to Buffett’s looming exit when Abel takes over on January 1 next year.\n\nIn May, just before the announcement, Berkshire Class A shares hit a record high of $812,855 apiece. Since then, selling pressure has mounted, reflecting fears that the company’s future may not live up to its storied past. Berkshire's original shares were mostly bought early in Buffett's career and have been handed down through families as a legacy investment. It is not yet known who has been selling off the stock but a picture may emerge when the quarterly reports of large investors and hedge funds are disclosed later this month.\n\nThe downturn in Berkshire's stock comes despite strong results across its businesses including the BNSF railroad. The company's utilities, manufacturing, service and retail divisions reported profit growth in the second quarter. Shareholders told the FT that a three-month period was too short to fairly assess the company's performance especially considering Buffett's notoriously long investment horizons.\n\nOthers added that investors turned to Berkshire as a safe haven back in April as markets reacted to Trump's tariff announcements. 'As the worries about tariffs started to build...there were people rotating into the safety of Berkshire,' Bill Stone, the chief investment officer of Berkshire investor Glenview Trust told the FT. However, Stone argued that now technology stocks are taking off in the AI boom and concerns over a possible recession recede investors are willing to move away from Berkshire and into those areas again.\n\n'What is really moving in this market is technology, and we know that's not really his thing,' he explained. Buffett himself - who repurchases stock when he 'believes that the repurchase price is below Berkshire's intrinsic value' according to the company - stopped buying Berkshire shares in May last year. He has also been selling other stocks including a large portion of the company's Apple investment.\n\nThe company has been a net seller of stocks for 11 quarters in a row, bringing its cash pile up to $344 billion. Among these major sell-offs were $3.2 billion in shares tied to the banking industry , including a $1 billion exit from Citigroup and a $2 billion reduction in Bank of America. 'Berkshire has clearly been reducing its exposure to U.S. bank stocks,' Larry Cunningham, director of the John L. Weinberg Center for Corporate Governance at the University of Delaware told The Telegraph.\n\n'That activity signals a cautious or even bearish outlook on banking.' Buffett's investment choices have long had the ability to move the markets. When Buffett increased his stake in five Japanese trading houses earlier this year it sent their stocks rocketing. The same result emerged last year when Berkshire and Buffett scooped up $563 million of stock in Occidental Petroleum, Sirius XM and VeriSign.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Berkshire shares",
      "weight": 0.11048029
    },
    {
      "name": "Berkshire",
      "weight": 0.09989465
    },
    {
      "name": "Berkshire Class A shares",
      "weight": 0.09977341
    },
    {
      "name": "Berkshire Hathaway",
      "weight": 0.099550806
    },
    {
      "name": "Berkshire investor Glenview Trust",
      "weight": 0.09757073
    },
    {
      "name": "technology stocks",
      "weight": 0.08582734
    },
    {
      "name": "stock",
      "weight": 0.0829795
    },
    {
      "name": "stocks",
      "weight": 0.0829795
    },
    {
      "name": "other stocks",
      "weight": 0.0817247
    },
    {
      "name": "U.S. bank stocks",
      "weight": 0.08111823
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95166015625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.94482421875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.916015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8271484375
    }
  ],
  "sentiment": {
    "positive": 0.046783447,
    "negative": 0.8520508,
    "neutral": 0.101135254
  },
  "summary": "Shares of Warren Buffett's Berkshire Hathaway have dropped 14% since his retirement announcement in May, marking the widest gap between Berkshire and the broader market since 1990. Despite the drop in Berkshire's value, his personal wealth of $141 billion makes him the tenth richest person on Bloomberg's billionaires index. The company's Class A shares, which have been mostly bought early in Buffett's career, have been sold off as a legacy investment. Despite strong results across its businesses including the BNSF railroad and utilities, the company's utilities, manufacturing, service and retail divisions reported profit growth in the second quarter. Investors have also turned to Berkshire as a safe haven during periods of uncertainty due to tariffs and concerns over a potential recession.",
  "shortSummary": "Warren Buffett's retirement has led Berkshire Hathaway's shares to a 14% drop, despite strong results and a significant sell-off related to banking concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "dbdfe10e49c74c7a9ee635ecf7c173dd",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Berkshire Hathaway's shares have dropped 14% since Warren Buffett announced his retirement, contrasting with an 11% rise in the S&P 500, marking the largest gap between the two since 1990. Investors are concerned about the company's future under new leadership as Buffett prepares to hand over control to Greg Abel in January. Despite strong business performance, Berkshire has been a net seller of stocks for 11 quarters, raising its cash reserves to $344 billion, and reducing its exposure to U.S. bank stocks, indicating a cautious outlook.",
  "argos_id": "88URR2RWG"
}