{
  "url": "https://finance.yahoo.com/news/socure-baselayer-partner-deliver-next-134000042.html",
  "authorsByline": "PR Newswire",
  "articleId": "e8f3052ac53d4f5ea42c2d4f6290b1d0",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/0655764d04e12106983a44fbc91f4c64",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:40:00+00:00",
  "addDate": "2025-08-07T14:01:00.784100+00:00",
  "refreshDate": "2025-08-07T14:01:00.784102+00:00",
  "score": 1.0,
  "title": "Socure and Baselayer Partner to Deliver Next-Gen Business Identity Verification via RiskOS™",
  "description": "Socure, the leading provider of AI-powered digital identity verification, compliance, and fraud prevention solutions, today announced a strategic partnership and integration with Baselayer, the market-leading Business Identity, Credit, and Fraud provider. By embedding Baselayer's high-fidelity business verification and fraud signals into the RiskOS™ platform, the partnership enables Socure customers to onboard 100% of good business applications.",
  "content": "INCLINE VILLAGE, Nev., Aug. 7, 2025 /PRNewswire/ -- Socure, the leading provider of AI-powered digital identity verification, compliance, and fraud prevention solutions, today announced a strategic partnership and integration with Baselayer, the market-leading Business Identity, Credit, and Fraud provider. By embedding Baselayer's high-fidelity business verification and fraud signals into the RiskOS™ platform, the partnership enables Socure customers to onboard 100% of good business applications.\n\nThe collaboration showcases Socure's commitment to growing its partner ecosystem and allowing any 3rd party data service to be integrated into the RiskOS platform. Currently, RiskOS offers over 85 pre-integrated services. Designed from the ground up, RiskOS is an extensible risk decisioning platform that integrates any best-in-class data source, empowering customers to configure real-time workflows and make confident decisions with unparalleled speed and precision.\n\n\"RiskOS was purpose-built to be the most open, intelligent, and powerful decisioning platform in the industry,\" said Johnny Ayers, Founder and CEO of Socure. \"Our vision is to empower organizations to make the most precise risk decisions, seamlessly and at scale, by integrating effortlessly with any system or service they choose to rely on. The addition of Baselayer's consortium data further strengthens RiskOS' KYB capabilities, accelerating the onboarding of legitimate businesses while proactively stopping fraud before it starts. This is how our customers grow with confidence and scale fast.\"\n\nBy integrating Baselayer's business identity network, which aggregates fraud and risk signals from over 2,200 financial institutions, into RiskOS, Socure customers gain access to one of the most comprehensive business verification datasets in the industry. Combined with Socure's network of 3,000 customers, the partnership now touches approximately 40 percent of the U.S. financial services market. This expanded intelligence enables earlier fraud detection, reduces false positives, and increases automation in complex KYB workflows. The outcome is faster revenue capture, improved compliance, and a streamlined onboarding experience for both traditional businesses and sole proprietors.\n\n\"Our mission is to unify and de-risk the fragmented business identity landscape,\" said Jonathan Awad, Co-Founder & CEO of Baselayer. \"Partnering with Socure brings our insights to an industry-leading decisioning layer, delivering smarter verification and risk decisions at scale.\"",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/2203821/Primary_Logo_CMYK_TM_large_Logo.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Socure customers",
      "weight": 0.09440599
    },
    {
      "name": "legitimate businesses",
      "weight": 0.08947787
    },
    {
      "name": "good business applications",
      "weight": 0.088658094
    },
    {
      "name": "RiskOS",
      "weight": 0.0786744
    },
    {
      "name": "earlier fraud detection",
      "weight": 0.075105034
    },
    {
      "name": "Socure",
      "weight": 0.07438131
    },
    {
      "name": "fraud",
      "weight": 0.069571316
    },
    {
      "name": "Baselayer",
      "weight": 0.06929392
    },
    {
      "name": "Baselayers business identity network",
      "weight": 0.06926261
    },
    {
      "name": "Next-Gen Business Identity Verification",
      "weight": 0.06849749
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.90478515625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.8056640625
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.62890625
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.46923828125
    },
    {
      "name": "/News/Technology News",
      "score": 0.338134765625
    }
  ],
  "sentiment": {
    "positive": 0.80126953,
    "negative": 0.030517578,
    "neutral": 0.16796875
  },
  "summary": "Socure, the leading provider of AI-powered digital identity verification, compliance, and fraud prevention solutions, has partnered with Baselayer, the market-leading Business Identity, Credit, and Fraud provider, to deliver next-gen Business Identity Verification via RiskOS™. The partnership allows Socure customers to onboard 100% of good business applications. The collaboration shows Socure's commitment to growing its partner ecosystem and allowing any 3rd party data service to be integrated into the RiskOS platform. RiskOS, currently offers over 85 pre-integrated services, is designed to integrate any best-in-class data source and make confident decisions with speed and precision. The addition of Baselayers' consortium data further strengthens RiskOS' KYB capabilities, enabling earlier fraud detection, reduces false positives, and increases automation in complex KYB workflows.",
  "shortSummary": "Socure and Baselayer's high-fidelity business verification and fraud data integration enhances Socure's RiskOS platform, enabling 100% business identity verification and compliance onboarding for clients.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "da7fcced04b4461fb91a12c76aba5982",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Socure has announced a strategic partnership with Baselayer to enhance its RiskOS platform by integrating Baselayer's business verification and fraud signals. This collaboration aims to enable Socure customers to onboard all legitimate business applications while improving fraud detection and reducing false positives. With access to a comprehensive dataset from over 2,200 financial institutions, the partnership is expected to streamline onboarding processes and enhance compliance across the U.S. financial services market.",
  "argos_id": "90DZKRFHH"
}