{
  "url": "https://www.benzinga.com/pressreleases/25/08/n46962631/socure-and-baselayer-partner-to-deliver-next-gen-business-identity-verification-via-riskos",
  "authorsByline": "PRNewswire",
  "articleId": "403b1467ec274748806713a43e622ea6",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T09:40:00-04:00",
  "addDate": "2025-08-07T13:47:13.921099+00:00",
  "refreshDate": "2025-08-07T13:47:13.921102+00:00",
  "score": 1.0,
  "title": "Socure and Baselayer Partner to Deliver Next-Gen Business Identity Verification via RiskOS™",
  "description": "INCLINE VILLAGE, Nev., Aug. 7, 2025 /PRNewswire/ -- Socure, the leading provider of AI-powered digital identity verification, compliance, and fraud prevention solutions, today announced a strategic partnership and",
  "content": "INCLINE VILLAGE, Nev., Aug. 7, 2025 /PRNewswire/ -- Socure, the leading provider of AI-powered digital identity verification, compliance, and fraud prevention solutions, today announced a strategic partnership and integration with Baselayer, the market-leading Business Identity, Credit, and Fraud provider. By embedding Baselayer's high-fidelity business verification and fraud signals into the RiskOS™ platform, the partnership enables Socure customers to onboard 100% of good business applications.\n\nThe collaboration showcases Socure's commitment to growing its partner ecosystem and allowing any 3rd party data service to be integrated into the RiskOS platform. Currently, RiskOS offers over 85 pre-integrated services. Designed from the ground up, RiskOS is an extensible risk decisioning platform that integrates any best-in-class data source, empowering customers to configure real-time workflows and make confident decisions with unparalleled speed and precision.\n\n\"RiskOS was purpose-built to be the most open, intelligent, and powerful decisioning platform in the industry,\" said Johnny Ayers, Founder and CEO of Socure. \"Our vision is to empower organizations to make the most precise risk decisions, seamlessly and at scale, by integrating effortlessly with any system or service they choose to rely on. The addition of Baselayer's consortium data further strengthens RiskOS' KYB capabilities, accelerating the onboarding of legitimate businesses while proactively stopping fraud before it starts. This is how our customers grow with confidence and scale fast.\"\n\nBy integrating Baselayer's business identity network, which aggregates fraud and risk signals from over 2,200 financial institutions, into RiskOS, Socure customers gain access to one of the most comprehensive business verification datasets in the industry. Combined with Socure's network of 3,000 customers, the partnership now touches approximately 40 percent of the U.S. financial services market. This expanded intelligence enables earlier fraud detection, reduces false positives, and increases automation in complex KYB workflows. The outcome is faster revenue capture, improved compliance, and a streamlined onboarding experience for both traditional businesses and sole proprietors.\n\n\"Our mission is to unify and de-risk the fragmented business identity landscape,\" said Jonathan Awad, Co-Founder & CEO of Baselayer. \"Partnering with Socure brings our insights to an industry-leading decisioning layer, delivering smarter verification and risk decisions at scale.\"\n\nAs highlighted in Liminal's 2025 Business and Entity Verification Report, Socure and Baselayer were both named among the top 20 leaders shaping the future of KYB. The report recognized Socure's RiskOS platform for its automation, integration flexibility, and end-to-end capabilities in identity, fraud, and business verification. Read the full report .\n\nThe Socure-Baselayer integration marks the latest expansion of the RiskOS partner ecosystem, which now includes over 85 pre-integrated data providers. This collaboration delivers immediate impact across industries where business verification is critical. In banking and lending, institutions can accelerate KYB and underwriting with higher auto-approval rates and fewer false positives. Fintechs and B2B SaaS platforms can fight promotional abuse and duplicate account creation using Baselayer's fraud signals layered into RiskOS workflows. Marketplaces gain a more efficient path to verifying sellers and service providers at scale. And government agencies can streamline grant disbursements and contract vetting with unified business and UBO verification - all through a single, flexible API.\n\nAbout Socure\n\nSocure is the leading platform for digital identity verification, compliance and fraud prevention solutions, trusted by the largest enterprises and government agencies to build trust and mitigate risk. Leveraging AI and machine learning, Socure's industry-leading platform achieves the highest accuracy, automation, and capture rates in the industry. With last year's acquisition of Effectiv, Socure launched its RiskOS™ platform to offer end-to-end decisioning and orchestration for identity fraud and payment risk management, integrating advanced transaction monitoring, credit underwriting and know-your-business (KYB) solutions into its platform.\n\nServing more than 3,000 customers and 190+ countries across financial services, government, gaming, healthcare, telecom, and e-commerce, Socure's customer base includes 18 of the top 20 banks, the largest HR payroll providers, the largest sportsbook operators, 58 organizations across the public sector, and more than 600 fintechs. Leading organizations including Capital One, Uber, Angi, Citi, Chime, SoFi, Green Dot, Robinhood, Dave, Gusto, Poshmark, DraftKings, PrizePicks, the State of California and many more trust Socure to deliver certainty in identity across onboarding, authentication, payments, account changes, and regulatory compliance. Learn more at .\n\nAbout Baselayer\n\nBaselayer is the leading business identity network and fraud consortium, offering KYB, risk, and legal signals through real-time APIs. Serving over 2,200 financial institutions, Baselayer's solutions deliver trusted verification, proactive fraud detection, and compliance-ready insights. Learn more at .",
  "medium": "Article",
  "links": [
    "https://c212.net/c/link/?t=0&l=en&o=4483885-1&h=3786652744&u=https%3A%2F%2Foffers.socure.com%2Frs%2F570-ENG-578%2Fimages%2FLiminal-Business-and-Entity-Verification.pdf&a=here",
    "https://c212.net/c/link/?t=0&l=en&o=4483885-1&h=1336538859&u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4473579-1%26h%3D1035681133%26u%3Dhttps%253A%252F%252Fwww.socure.com%26a%3Dwww.socure.com&a=www.socure.com",
    "https://c212.net/c/link/?t=0&l=en&o=4483885-1&h=3644314507&u=https%3A%2F%2Fwww.baselayer.com&a=www.baselayer.com",
    "https://mma.prnewswire.com/media/2203821/Primary_Logo_CMYK_TM_large_Logo.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "business verification",
      "weight": 0.08834063
    },
    {
      "name": "Socure customers",
      "weight": 0.08818906
    },
    {
      "name": "identity fraud",
      "weight": 0.08261723
    },
    {
      "name": "Socure",
      "weight": 0.07630453
    },
    {
      "name": "legitimate businesses",
      "weight": 0.071721524
    },
    {
      "name": "good business applications",
      "weight": 0.07013338
    },
    {
      "name": "RiskOS workflows",
      "weight": 0.069684535
    },
    {
      "name": "RiskOS",
      "weight": 0.06639774
    },
    {
      "name": "earlier fraud detection",
      "weight": 0.06579666
    },
    {
      "name": "proactive fraud detection",
      "weight": 0.06520311
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.90478515625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.8056640625
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.62890625
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.46923828125
    },
    {
      "name": "/News/Technology News",
      "score": 0.338134765625
    }
  ],
  "sentiment": {
    "positive": 0.80126953,
    "negative": 0.030517578,
    "neutral": 0.16796875
  },
  "summary": "Socure, the leading provider of AI-powered digital identity verification, compliance, and fraud prevention solutions, has partnered with Baselayer, the market-leading Business Identity, Credit, and Fraud provider, to deliver next-gen business identity Verification via RiskOS™. The partnership allows Socure customers to onboard 100% of good business applications. The collaboration aligns with Basleayer's high-fidelity business verification and fraud signals into the RiskOS platform, enabling earlier fraud detection, reduces false positives, and increases automation in complex KYB workflows. The integration marks the latest expansion of Socure's RiskOS partner ecosystem, which now includes over 85 pre-integrated data providers. This collaboration will be particularly impactful across industries where business verification is crucial.",
  "shortSummary": "Socure and Baselayer's high-fidelity business verification and fraud signals integrate into the RiskOS™ platform, enhancing business identity verification and compliance in various industries by integrating multiple data providers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "da7fcced04b4461fb91a12c76aba5982",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4483885-1&h=3644314507&u=https%3A%2F%2Fwww.baselayer.com&a=www.baselayer.com",
      "text": "Delivering the most comprehensive identity insights, Baselayer’s platform equips businesses with fully automated solutions for KYB, Risk, and Fraud management, setting new standards in business verification.\nGet In TouchKYB, fraud, and risk checks consumes significant time and resources. Manual reviews are not only slow, but also increase the potential for errors, delaying the entire verification process.\nOverlooked fraud indicators and unchecked risks compromise secure lending, increasing the likelihood of financial losses.\nCollecting data from various sources is tedious and it’s easy to miss details. When key info is missing, verification becomes less reliable, leading to delays and potential compliance issues.\nStreamline KYB, risk assessment, and fraud evaluation with a single platform that brings unmatched efficiency and clarity to your business operations.\nEnhance your business verifications with state secretary validation, IRS/EIN matching, sanctions screening (OFAC, PEP), and business officer and registered agent detection.\nSharpen your risk assessment by evaluating a borrower’s industry, legal history, and web presence alongside revenue and transaction projections. Detect banned borrowers from other financial institutions, uncover credit stackers months in advance, and expose synthetic identity creators with our advanced fraud solutions.\nHarness Baselayer’s all-in-one Platform to pinpoint which businesses need your attention — and get your manual reviews down to as close to zero as possible.\nStay proactive by monitoring updates from the Secretary of State and banking or credit applications. Optimize your portfolio using real-time indicators for fraud, churn risk, and credit stacking.\nSupercharge your growth with our proprietary data and advanced machine learning models. The Baselayer Product Suite is continuously trained with millions of business applications keeping you ahead of evolving fraudsters.\nDive into our comprehensive suite or customize your toolkit with individual solutions that amplify your existing Fraud, KYB, Risk and Portfolio Monitoring systems.\nLeverage Baselayer’s team of ML experts to seamlessly turbocharge your operations with every new business onboarded; you’re the expert, we’re the engine.\nBaselayer’s SOC 2 Certified Systems ensure rigorous adherence to industry best practices, safeguarding your data through every layer of our infrastructure. With us, compliance is not just a checklist; it’s woven into the fabric of our operations.\nJumpstart your journey with the Baselayer Dashboard in mere seconds, or integrate our developer centric API into your own environment. Whichever you choose, our dedicated implementation team is ready to assist, ensuring a smooth integration."
    }
  ],
  "argos_summary": "Socure has announced a strategic partnership with Baselayer to enhance its RiskOS™ platform by integrating Baselayer's business verification and fraud signals. This collaboration aims to improve the onboarding process for legitimate businesses while reducing fraud, thereby allowing Socure customers to access a comprehensive dataset from over 2,200 financial institutions. The integration is expected to streamline workflows across various industries, including banking, fintech, and government, ultimately facilitating faster revenue capture and improved compliance.",
  "argos_id": "9GYFKP9VW"
}