{
  "url": "https://www.yahoo.com/entertainment/articles/kelly-clarkson-reveals-heartbreaking-reason-141248753.html?_guc_consent_skip=1754577660",
  "authorsByline": "Kristyn Burtt",
  "articleId": "750346e2766e4606af38b2f93e95e0b2",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/43768314896331ff7c3eb03d321faf3d3c80152700695f1fff2201b8b886b8c8/ynews/resizefill_w1200/https://media.zenfs.com/en/sheknows_79/6b832034e86e62487ff6559e8e72f258",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T14:12:48+00:00",
  "addDate": "2025-08-07T14:42:05.964749+00:00",
  "refreshDate": "2025-08-07T14:42:05.964751+00:00",
  "score": 1.0,
  "title": "Kelly Clarkson Reveals the Heartbreaking Reason She Was Absent From Her Talk Show Last Spring",
  "description": "Kelly Clarkson is proving that family comes first, no matter what has happened in the past. The 43-year-old singer revealed on an Aug. 6 Instagram post that she needed to postpone her Las Vegas residency for a very serious reason. “Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las …",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nKelly Clarkson is proving that family comes first, no matter what has happened in the past.\n\nThe 43-year-old singer revealed on an Aug. 6 Instagram post that she needed to postpone her Las Vegas residency for a very serious reason.\n\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she wrote. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows, and I so appreciate your grace, kindness, and understanding.”\n\nThe pop star confirmed the rumors about Blackstock’s health that first surfaced in April in a report by NewsNation. She had been sporadically absent from The Kelly Clarkson Show, and the media outlet shared unconfirmed news (at the time) about her ex-husband’s health.\n\n“Her ex-husband is sick, and she took the kids to see him,” NewsNation said on April 18.\n\nClarkson and Blackstock share two children: a daughter, River, 11, and a son, Remington, 9.\n\nBlackstock’s situation is likely behind the rumors that Clarkson is looking to exit her daytime television contract after the 2025-26 season. She’s thinking that she might need a shift next year when her contract is up,” a source told People on July 10. “She still has time to figure out what’s best for her career and family. She was never one to rush into things.”\n\nThere also seems to be a desire to return to music full-time, but her commitment to The Kelly Clarkson Show doesn’t allow for that. While performing at a May 9 concert in Atlantic City, New Jersey, Clarkson hinted at the conflict.\n\n“We haven’t done a show in a while, y’all, ’because I have a talk show,” she told the New Jersey audience, via Page Six. “It’s like a whole other job. We are bummed because we love doing shows, and it’s hard to fit it in, so it’s cool when it does work out with the schedule, and it’s cool to get to see your faces and feed off y’all.”\n\nClarkson and Blackstock’s divorce was contentious after they split in 2020, battling over spousal support and her Montana ranch. Still, there was a desire for the TV personality to make the co-parenting relationship work for their kids.\n\n“I know with me and Brandon, it’s just a difficult thing because we’re in different places, and it’s like, we both agree on the main things, but it’s a hard thing when you’re not together all the time, for me personally,” she told KOST 103.5 in November 2024. “As long as you make sure it’s about the children and their best interests, then we’re both on board.”\n\nAnd that’s exactly what Clarkson is doing with her ex-husband’s health battle, putting their kids’ needs first.\n\nBefore you go, click here to see 19 facts about Kelly Clarkson you didn’t already know.\n• None A Look Back at Martha Stewart's Incredible Life, From Her Early Modeling Career to Her Media Empire at 84\n• None Join These 10 Celebrity Book Clubs & Read Along with Your Favorite Stars\n\nSign up for SheKnows' Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "medium": "Article",
  "links": [
    "https://www.yahoo.com/entertainment/articles/justin-timberlake-addresses-tour-backlash-180256930.html",
    "https://cloud.email.sheknows.com/signup/",
    "https://www.yahoo.com/entertainment/articles/kelly-clarkson-next-act-why-201507589.html",
    "https://www.yahoo.com/entertainment/articles/kelly-clarksons-recent-daytime-absence-171443618.html",
    "https://www.yahoo.com/entertainment/best-celebrity-book-clubs-following-181108576.html",
    "https://www.yahoo.com/entertainment/longest-celebrity-divorces-ever-163346784.html",
    "https://www.newsnationnow.com/entertainment-news/heartbreaking-reason-kelly-clarkson-missed-show-tapings/",
    "https://pagesix.com/2025/05/10/entertainment/kelly-clarkson-vents-about-talk-show-as-she-considers-quitting/",
    "https://www.youtube.com/watch?v=D2KBr-SNRhw",
    "https://www.yahoo.com/entertainment/articles/katy-perry-dating-history-exes-171946100.html",
    "https://www.yahoo.com/entertainment/look-back-martha-stewarts-incredible-140012499.html",
    "http://bit.ly/2TkcoeG",
    "https://people.com/kelly-clarkson-considering-future-talk-show-source-exclusive-11770113",
    "http://bit.ly/2TntOHq",
    "https://www.instagram.com/p/DNCSxWEpKEY/?utm_source=ig_web_copy_link",
    "https://www.yahoo.com/entertainment/articles/things-never-knew-kelly-clarkson-145411464.html",
    "https://www.sheknows.com/entertainment/slideshow/2495280/kelly-clarkson-brandon-blackstock-relationship-timeline-photos/",
    "http://bit.ly/31XsHSx"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kelly Clarkson",
      "weight": 0.08968283
    },
    {
      "name": "Clarkson",
      "weight": 0.07732728
    },
    {
      "name": "shows",
      "weight": 0.06139424
    },
    {
      "name": "New Jersey",
      "weight": 0.059134446
    },
    {
      "name": "time",
      "weight": 0.05675265
    },
    {
      "name": "next year",
      "weight": 0.056399424
    },
    {
      "name": "Las Vegas",
      "weight": 0.056248095
    },
    {
      "name": "The Kelly Clarkson Show",
      "weight": 0.052549385
    },
    {
      "name": "things",
      "weight": 0.05003059
    },
    {
      "name": "unconfirmed news",
      "weight": 0.04931243
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.998046875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.88720703125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.7607421875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.66064453125
    }
  ],
  "sentiment": {
    "positive": 0.09777832,
    "negative": 0.609375,
    "neutral": 0.2927246
  },
  "summary": "Kelly Clarkson has revealed that she was temporarily absent from her Talk Show in Spring due to illness. She had to postpone her Las Vegas residency due to the illness of her ex-husband, Brandon Blackstock. The news of this conflict led to rumors that Clarkson is planning to exit her daytime television contract after 2025-26 season. Despite this, Clarkson's commitment to The Kelly Clarkson Show prevents her from returning to music full-time. Her divorce with Blackstock was contentious after 2020, but they have both expressed a desire for a successful co-parenting relationship.",
  "shortSummary": "Kelly Clarkson postponed her Las Vegas residency due to ex-husband's health, while maintaining a focus on family and career.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "108ae42b73b7484d841fed2fd08ec970",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.sheknows.com/entertainment/slideshow/2495280/kelly-clarkson-brandon-blackstock-relationship-timeline-photos/",
      "text": "When Kelly Clarkson fell in love with Brandon Blackstock, it was easy to be happy for her because she was a bundle of sunshine and rainbows in every interview she gave. You just wanted to bottle her sappy lovestruck moment and hope that she stayed in a bubble of joy forever.\n“We are totally going to get married,” she gushed on The Ellen DeGeneres Show in 2012. “We love each other. We are totally going to get married one day. No, he has two children and I’m new… You know you want to like… I mean he’s got to put it a ring at some point.” Blackstock certainly did put a ring on it just weeks later and the two forged ahead with their relationship at lightning speed — marriage, baby, another baby, huge careers.\nIt’s hard to say where the marriage took a wrong turn exactly, but the talk show host gave us a little insight into why the marriage went south. “My mom has been telling me since I was a kid: You are who you surround yourself with,” she said on The Kelly Clarkson Show in late 2020. “You want to make sure you’re surrounded by people that also want to be the best versions of themselves and also want a good common goal for everyone, not just themselves, right?”\nOf course, that was all before things got really difficult with the legal aspects of their divorce with Blackstock challenging their ironclad prenuptial agreement. But if there’s one thing we know, the pop star is “stronger” for falling in love and creating a beautiful family — and there’s very little that’s going to stop her even when she’s down. Learn more about her relationship timeline with her ex — and the exciting things ahead for her in the future (like that stunning new estate).\n-\nThe Single Life (Pre-2012)\nBefore Kelly Clarkson met Brandon Blackstock, she kept her dating life casual. It was a series of short-lived romances that mostly stayed out of the press — from her American Idol co-star, Justin Guarini, to singers Ryan Key and Graham Colton. She did address her situation with Guarini years later on Watch What Happens Live, and it just feels like it was nothing more than a cute fling in her young adult life.\n“We didn’t date during Idol which, everybody thought, but we did date during… I feel like we weren’t dating during [From Justin to Kelly] but I feel like maybe we did,” she coyly revealed. “We did date a little bit. I think any two people who are thrown together that much would [date]. Guy, girl, just saying — “Timeless,” put that song on From Justin to Kelly — you can’t fight it!”\n-\nDating (2011 or 2012)\nKelly Clarkson didn’t begin dating Brandon Blackstock for years after their first meeting in 2006 because he was married. But they stayed in each other’s orbit because the American Idol star’s career was managed by his father, Narvel Blackstock. Now, depending on who you talk to, they either began dating in late 2011 or early 2012 — the timeline seems to have changed over the years to coincide with Brandon’s official divorce date from first wife Melissa Ashworth in 2012. The on-the-record story has them becoming reacquainted at the 2012 Super Bowl, where she sang the National Anthem, and both of them were single.\nIt was love at first sight for the duo and they became inseparable right away. Clarkson could help gushing to the world that she was in love, but the angsty songwriting went completely out the window.\n“It is killing me. I’m trying to write a tough song and it is coming out like butterflies and rainbows,” she told People. “It is ruining my creativity. I’m writing all this happy [stuff]. People are going to be, like, ‘What the hell happened to you?’ It has been really difficult. I love it. It’s an awesome problem to have.”\n-\nEngagement (December 2012)\nTheir relationship was on fast forward in 2012 and Brandon Blackstock wasted no time in asking the “Stronger” singer to be his wife. Kelly Clarkson tweeted out the cutest announcement to share the news with all of her followers.\n“I’M ENGAGED!!!!! I wanted y’all to know!! Happiest night of my life last night! I am so lucky and am with the greatest man ever :),” she wrote. She also shared a photo of her gorgeous engagement ring on WhoSay (remember that app?), “It’s a yellow canary diamond with diamonds around.”\n-\nWedding (2013)\nThe Clarkson-Blackstock wedding started out as a huge event with country music pal Blake Shelton officiating the wedding, but the couple put the brakes on the over-the-top affair. “We just got overwhelmed by it — all the decisions,” she explained. “We sent out a save-the-date to everyone, and then it got crazy and all the details were leaking.”\nTheir Plan B wedding went off without a hitch as it was just the two of them, an officiant and Blackstock’s two kids from his first marriage, daughter Savannah, and son Seth. “I’m officially Mrs. Blackstock,” she announced via Twitter. “We got married yesterday at Blackberry Farms in TN, the most beautiful place ever!” She shared a video (see it here) of their beautiful fall ceremony and they looked so happy and in love.\n-\nFirst Pregnancy (November 2013)\nJust one month after their wedding, Kelly Clarkson shared the exciting news that she was expecting her first child with her new hubby. “I’m pregnant!!! Brandon and I are so excited! Best early Christmas present ever,” she tweeted, via Celebitchy. The news came as no surprise to anyone because she had been shouting from the rooftops her wish to get pregnant before the holiday season — and having great stepkids had a lot to do with those baby urges.\n“I want a little baby with little feet and I just want to bite them,” she told Jay Leno on The Tonight Show, via Celebitchy. “They’re so great. I never wanted kids before, but now I want, like, five.”\n-\nCheating Claims (December 2013)\nBy early December, just two months after they married, the couple was plagued with cheating rumors after a tabloid website posted claims about Blackstock stepping out on his new wife. “‘We haven’t slept together, but we’ve been intimate in other ways,” an anonymous source told The Dirty, via the Daily Mail.\nClarkson even defended her new husband on Twitter, writing, “Keep hearing random rumors of me & Brandon splitting or that’s he’s cheating on me. Stop with all the lying please #aintnobodygottimeforthat.” Nothing concrete ever came from those rumors, so the couple continued on in their marital bliss.\n-\nGrowing Family (2014, 2016)\nClarkson’s first child, daughter River Rose, was born in 2014, and son Remington Alexander followed in 2016. “I sound like such a tool, but becoming a mother has made me next-level confident,” The Voice star told Good Housekeeping. “I’ve never felt more empowered. I feel like my 20s were spent walking on eggshells making sure everyone felt loved and not really expressing my opinion.”\nEven though motherhood was a dream for her, she was ready to be done with having children, so she asked (OK, demanded) Blackstock to get a vasectomy. “I was literally pregnant with Remi, and I was like, ‘You are getting fixed. This will never happen to me again,’” Clarkson revealed on The Jenny McCarthy Show, via People. “If something happens, it’s a miracle of God. I literally told my OBGYN on the table while open, ‘If I get pregnant again, I will find you!’”\n-\nSuperstardom (2018)\nKelly Clarkson has been famous since she won the inaugural season of American Idol, but her fame still hovered on the B-list in Hollywood. The game-changer for her was joining The Voice as a coach in 2018. She sat alongside Adam Levine and Alicia Keys, but it was her witty banter with Blake Shelton that had everyone in stitches. American fell in love with her all over again.\nOne year later, she launched her own daytime talk show, The Kelly Clarkson Show, which put her sparkling personality on full display (and got her a Daytime Emmy) — and suddenly she was everywhere as she shot to A-list TV stardom. But it was her time at home with her husband and kids that mattered the most to her despite her next-level fame. “We both love what we do, but we’re really good about checking out whenever we make it home from work,” she explained to Parade. They spend time together every night after putting their kids to bed. “Sometimes we’ll go out or we’ll just listen to music.”\n-\nDivorce (June 2020)\nAfter quarantining together in Clarkson’s Montana ranch (yes, she holds the deed to the property), the couple shockingly announced their divorce in June 2020 citing “irreconcilable differences.” But where do we begin in this messy split? Blackstock challenged their prenuptial agreement, which was held up by a judge in court, so the “Miss Independent” singer gets to keep the Montana ranch he had been fighting to keep. There’s still the thorny legal issue involving her father-in-law, who used to manage her along with her ex, regarding entertainment commissions — and she countersued for alleged violations of California labor codes. Phew!\nYet there are still tender hearts to deal with, which Clarkson revealed on her daytime show in her interview with First Lady Dr. Jill Biden, who gave her wise advice. “My mother always said to me, ‘Things are going to look better tomorrow,’” the first lady told the daytime talk show host. “‘And if you can take one day at a time, and things will get better.’”\nClarkson isn’t dating just yet, but we can’t wait to see who might open her mind (and heart) to a relationship again.\n-\nThe Future (2021)\nAside from the final financial details to be worked out by the court, Clarkson has already been declared legally single. And she’s already moving ahead with her new single, complete with shady lyrics, “Christmas Isn’t Canceled (Just You).” She also sold their marital home in Encino and is getting a fresh start in her new Toluca Lake, California estate with their two kids. And the best part is she is leading the way with an optimistic outlook, according to a Hollywood Life source, “She has so much going on in her life that she doesn’t have time to stop and dwell on things; she’s always focused on the positive.”\n-\nLearning to “Un-Love” (2022)\nIn a candid conversation with guest Khloé Kardashian on The Kelly Clarkson Show, Clarkson said she was curious how the reality star learned to “un-love” Tristan Thompson after his multiple betrayals. Clarkson laughed, “How’d you do that? Asking for a friend.”\nClarkson then shared how she’s felt in her post-split life. “It’s hard. I think it’s the most ridiculous thing sometimes when something doesn’t work out and you’re in a relationship and you’re so deeply in love — and people are like ‘Oh yeah, why can’t you [move on],'” Clarkson said. “I’m like, I think I might always love that person, I don’t know if it goes away.”\n-\nTackling Co-Parenting (2023)\nClarkson got candid about the impact that the divorce has had on their two children. “I literally ask my kids every night when we’re snuggling, ‘Are you happy? And if you’re not, what could make you happier?'” the talk show host recounted during an episode of The Angie Martinez IRL podcast, per E! Online. “Sometimes they’ll say, especially the past two years, and it kills me and I want them to be honest, so I don’t ever say, ‘Oh god, don’t tell me that,’ but a lot of times it would be like, ‘You know, I’m just really sad. I wish mommy and daddy were in the same house.'”\nClarkson went on to explain exactly how she handles that difficult conversation. “I just sit there and I’m like, ‘I get it. I’m from a divorced family as well. I get it. That sucks. But we’re going to work it out. And you are so loved by both of us,'” Clarkson explained. “I think communicating with them and not treating them—not treating them like an adult, because they’re not—but not treating them like a child. They’re not small feelings. Those are huge feelings, and those are huge emotions.”\n-\nA Telling Verse Change (2023)\nDuring her rendition of the song “ABCDEFU” by GAYLE during her show’s iconic Kellyoke segment on March 30, Clarkson gave a telling spin on the original lyrics that clearly pointed to Blackstock. “F you and your dad and the fact that you got half / and my broken heart / turn that s*** into art,” she sang, referencing her contentious divorce settlement.\n-\nReleasing Her Album’s First Singles (2023)\nOn April 14, Clarkson released the first two singles, “mine” and “me,” from her upcoming emotional album Chemistry.\nIn “mine,” the lyrics suggest Clarkson sings about being heartbroken and not realizing the problems in the relationship before it was too late. “You know I question every motive, everything you say / Thought with you maybe my heart wasn’t meant to break / Can’t believe I let you in, I can’t believe I stayed / As long as I stayed,” Clarkson sings.\nIn the chorus, Clarkson wishes for some karmic retribution so that her ex one day feels the same way she does. She sings, “I hope one day someone will take your heart and hold it tight / Make you feel like you’re invincible deep inside / And right when you think that you’ll try again, they cross a line / And steal your shine like you did mine.”\nIn her second single, “me,” Clarkson is feeling strong and powerful while she looks back at the relationship that once was. “I don’t need somebody to hold me / Don’t need somebody to love me / Don’t need somebody to pick these pieces up / I put together my broken / Let go of the pain I’vе been holdin’ / Don’t need to need somebody / When I got me.” Talk about telling lyrics"
    },
    {
      "url": "https://pagesix.com/2025/05/10/entertainment/kelly-clarkson-vents-about-talk-show-as-she-considers-quitting/",
      "text": "‘Bummed’ Kelly Clarkson vents about demanding talk show schedule as she considers quitting gig\nATLANTIC CITY, NJ — Kelly Clarkson vented to fans about her eponymous talk show during her first concert in nearly six months.\nThe Grammy winner told her audience in Atlantic City, NJ, on Friday night that she cannot realistically go on tour due to the demanding schedule of her daytime TV gig.\n“We haven’t done a show in a while, y’all, ’cause I have a talk show. It’s like a whole other job,” Clarkson said onstage, referencing her band, before noting that being a single mother also keeps her busy.\nThe “American Idol” alum, 43, went on to say that she was “so happy” to have been able to book a two-night run at Hard Rock Live at Etess Arena.\n“We are bummed ’cause we love doing shows, and it’s hard to fit it in, so it’s cool when it does work out with the schedule,” she added, “and it’s cool to get to see your faces and feed off y’all. Thank you so much for having so much energy.”\nClarkson — who last performed a full-length concert in November 2024 but has not toured since early 2019 — treated ticket-holders to 90 minutes of music Friday, running through hits including “My Life Would Suck Without You,” “Because of You,” “Breakaway,” “Miss Independent,” “Stronger (What Doesn’t Kill You)” and “Since U Been Gone.”\nThe singer’s candid comments come just one month after Page Six exclusively reported that she wants to quit “The Kelly Clarkson Show” once her contract expires next year.\n“Kelly’s number one priority is her children, and they always will be,” an industry source told us in April.\n“The show is grueling. It’s a whole lot of work, and I hear that Kelly would like to spend more time down South.”\nThe speculation about Clarkson’s future as a television host ramped up earlier this week when an NBC insider told The Post that network executives have already begun looking for a replacement.\n“There’s a long list of names, and Hoda [Kotb] is part of that list,” the source shared of the former “Today” show co-anchor, who left her job in January after nearly two decades.\nThe Emmy-winning “Kelly Clarkson Show” — from which the pop star was mysteriously absent for weeks earlier this year — premiered in September 2019 and celebrated its 1,000th episode in March.\nThis story was featured on a recent episode of Page Six Radio, a daily morning show serving up the hottest celebrity headlines, exclusives, and behind-the-scenes buzz. Catch Danny, Evan and Ian chat with celebrity guests every weekday on SiriusXM from 8 a.m. to 10 a.m. ET on Stars Ch. 109.\nSiriusXM service required. See Offer Details."
    },
    {
      "url": "https://people.com/kelly-clarkson-considering-future-talk-show-source-exclusive-11770113",
      "text": "Kelly Clarkson Considering Future of Her 'Demanding' Talk Show, 'Might Need a Shift': Source (Exclusive) Clarkson is over 1,000 episodes into her hit NBC talk show, which launched in September 2019 By Jack Irvin Jack Irvin Jack Irvin has over five years of experience working in digital journalism, and he’s worked at PEOPLE since 2022. Jack started in the industry with internships at Rolling Stone and Entertainment Tonight, and he worked as a writer for publications including Bustle, MTV News, Shondaland, L’Officiel USA, Ladygunn, Flood and PopCrush before joining PEOPLE. In his current role, Jack covers daily music news and has interviewed both up-and-coming and established artists including Dolly Parton, Michelle Branch, Ashanti, Cyndi Lauper, Normani, Carly Rae Jepsen and Coco Jones. People Editorial Guidelines Published on July 10, 2025 04:53PM EDT 2 Comments Kelly Clarkson. Credit : Weiss Eubanks/NBCUniversal via Getty NEED TO KNOW A source tells PEOPLE that Kelly Clarkson is considering making changes to her \"demanding\" work schedule, including her hit NBC talk show\"She's thinking that she might need a shift next year when her contract is up,\" says the sourceThe Kelly Clarkson Show launched in September 2019, and more than 1,000 episodes have aired since then What does the future hold for The Kelly Clarkson Show? Kelly Clarkson's hit NBC talk show launched in September 2019, and more than 1,000 episodes have aired since then. Now, a source tells PEOPLE the \"Miss Independent\" singer, 43, may need to make some changes to her \"demanding\" work schedule. \"Kelly is incredibly talented,\" says the source. \"Her talk show gives her stability and time with her kids.\" Kelly Clarkson. Weiss Eubanks/NBCUniversal via Getty \"After her divorce, she wanted to focus on balance and not burnout,\" explains the source of Clarkson, who shares son Remington \"Remy\" Alexander, 9, and daughter River Rose, 10, with ex-husband Brandon Blackstock. The pair was married for nearly seven years before splitting in June 2020, and their divorce was finalized two years later. \"She very much loves music though and would love to create new music,\" says the source. Clarkson's latest single, \"Where Have You Been,\" was released in May through her independent label High Road Records. \"Daytime TV is still demanding,\" adds the source. \"She's thinking that she might need a shift next year when her contract is up.\" Kelly Clarkson 'Didn't Want to Cancel' Her First Las Vegas Residency Shows: Why She Had To (Exclusive Source) Kelly Clarkson Cracks Up After Allison Williams Calls Her Out for Looking at Her Forehead Botox The source continues, \"She still has time to figure out what's best for her career and family. She was never one to rush into things.\" Clarkson's rep didn't immediately respond to PEOPLE's request for comment. The Kelly Clarkson Show has won 22 Emmys throughout its run, including three Outstanding Entertainment Talk Show Host wins for the host herself. The show is currently on hiatus for the summer. Kelly Clarkson. Weiss Eubanks/NBCUniversal Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Last month, Clarkson teased the series' upcoming seventh season on Instagram. The \"Walk Away\" singer is gearing up to launch her Studio Sessions residency at The Colosseum at Caesars Palace in Las Vegas on July 11 after canceling the first two shows due to laryngitis. Kelly Clarkson in February 2024. Frazer Harrison/Getty Clarkson wrote in an Instagram post that “prep and rehearsals have taken a toll” on her voice, and she would take the weekend and the week after to “rest up so that we can deliver what you all deserve.” “I want the shows to be perfect for y’all,” she wrote. “The show is truly incredible. The musicians and singers are outstanding, and I want us all to start out strong. I can’t wait to be back next weekend and show y’all what we’ve been working on.” Close Leave a Comment Read more: Entertainment Music Pop Music"
    }
  ],
  "argos_summary": "Kelly Clarkson has postponed her Las Vegas residency to focus on her children's needs as their father, Brandon Blackstock, faces health issues. Despite a demanding schedule with her talk show, Clarkson is considering changes to prioritize her family and music career. She has expressed a desire to return to music full-time, hinting at potential shifts in her professional commitments as her contract with 'The Kelly Clarkson Show' approaches its end.",
  "argos_id": "9VN3B9RM7"
}