{
  "url": "https://www.gamesradar.com/games/battlefield/battlefield-6-multiplayer-is-faster-than-ever-and-while-im-having-fun-being-a-speedy-soldier-its-playing-against-the-shooters-most-iconic-feature/",
  "authorsByline": "Joel Franey",
  "articleId": "dc89aeb274664dc9a0d65839f583c834",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/G4rpgrLnjjpZd2WSW4cD5o.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:39:59+00:00",
  "addDate": "2025-08-07T13:48:58.656569+00:00",
  "refreshDate": "2025-08-07T13:48:58.656571+00:00",
  "score": 1.0,
  "title": "Battlefield 6 multiplayer is faster than ever, and while I'm having fun being a speedy soldier, it's playing against the shooter's most iconic feature",
  "description": "Enhanced speed is a fun thing, but is it worth sacrificing the strategic element of BF6?",
  "content": "Playing Battlefield 6 last week, I found it a pretty frenetic affair. Running, rolling, diving, pivoting, ducking, sliding, and that's even before you get into the driver's seat of some rumbling ten-ton piece of billion-dollar military hardware. Battlefield as a series was never slow, but it was definitely chunkier and weightier than many other shooters out there – and I don't mean that as a negative.\n\nI love zooming around in games like Doom or Marvel Rivals, but being slower and more sluggish can emphasize more strategic, tactical thought. If you can't easily take an action back, you're forced to think about it more before committing to it – and I don't know how I feel about the new game getting closer to what turned me off the Call of Duty franchise.\n\nLet's be clear: Battlefield 6 isn't having you race around like Sonic, but it's certainly less sluggish than its forebears. And in a vacuum, I have no problem with this! I love having freedom of movement in action games and shooters, especially if it's fun and seamless. Dropping down off scaffolding into war-torn streets and landing in a roll before coming up with a spray of bullets, vaulting a barricade when things get hairy and grabbing hold of a passing tank to be carried away – this is all good stuff, no doubt about it. It's a bit of a departure from standard Battlefield practice, but it's not some complete reinvention. Just running at one-point-two speed, y'know?\n\nAnd yet to quote a great man: \"But when I do it, it's cute!\" Ever since I started approaching 30, my reflexes have begun to notably power down, and my reaction time is now measured with a calendar. So while I'm perfectly happy to be given the gift of swiftness in any game I play, a player base capable of using that gift so much more effectively is becoming a challenge with no solution. It's what drove me away from Call of Duty – the demand for quick reflexes and the incredibly high TTK felt like I was watching a time-lapse effect of a game I had once understood, and I was often killed before I realized I was in danger, let alone given time to respond.\n\nBattlefield 6 isn't quite at that point yet – I'd say characters are still just more nimble than actually fast, if you see the distinction – but to broaden the scope beyond my own selfish needs, I do think that strategy and speed are two elements that play against each other in most games. It's incredibly hard to plan around a situation that is constantly, rapidly changing. Likewise, those who can quickly react to situations don't usually need to think ahead.\n\nThis may be part of why the promised \"tactical destruction\" felt less substantive than I had hoped. Aside from the difficulty of working out what walls can and can't be blasted through, planning a breach-and-clear assault takes precious time. But once you have even a few basic pieces in position, there's no guarantee that enemies will be where you think they are anymore – or that they won't have popped up somewhere else and blown your head off.\n\nI had a lot of fun with Battlefield 6, and part of that definitely came from the characters' inherent agility. But I wonder how it'll change the experience once the wider world is brought in and millions can experiment and push that agility to its limits. Whatever the case, I'm definitely happy for this to remain the peak of the series' speed for the time being.\n\nI spent 4 hours playing Battlefield 6 multiplayer and speaking with the creators, and here are my 10 biggest takeaways.",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/best-fps-games/",
    "https://www.gamesradar.com/battlefield-6/",
    "https://www.gamesradar.com/games/fps/i-spent-4-hours-playing-battlefield-6-multiplayer-and-speaking-with-the-creators-and-here-are-my-10-biggest-takeaways/",
    "https://www.gamesradar.com/games/battlefield/we-dont-want-cod-movement-we-want-battlefield-battlefield-6-hopefuls-are-already-asking-dice-to-reign-in-its-slide-as-preview-streamers-fly-around-the-map-on-ice-skates/",
    "https://www.gamesradar.com/games/fps/ive-played-battlefield-6-for-an-afternoon-and-while-its-a-clear-successor-to-battlefield-3-and-4-i-wish-there-was-more-destruction/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "standard Battlefield practice",
      "weight": 0.07682712
    },
    {
      "name": "action games",
      "weight": 0.076563165
    },
    {
      "name": "Battlefield",
      "weight": 0.07541106
    },
    {
      "name": "most games",
      "weight": 0.07087141
    },
    {
      "name": "games",
      "weight": 0.069991976
    },
    {
      "name": "many other shooters",
      "weight": 0.0642491
    },
    {
      "name": "precious time",
      "weight": 0.062118743
    },
    {
      "name": "time",
      "weight": 0.059307855
    },
    {
      "name": "quick reflexes",
      "weight": 0.052804984
    },
    {
      "name": "shooters",
      "weight": 0.050470363
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.9580078125
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.73681640625
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.4794921875
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.443603515625
    },
    {
      "name": "/Games/Computer & Video Games/Massively Multiplayer Games",
      "score": 0.339599609375
    },
    {
      "name": "/Games/Computer & Video Games/Shooter Games",
      "score": 0.339111328125
    }
  ],
  "sentiment": {
    "positive": 0.11846924,
    "negative": 0.57666016,
    "neutral": 0.30444336
  },
  "summary": "The article discusses the speed of Battlefield 6 multiplayer, which is faster than ever, but it also reflects the shift from the series' slow pace to emphasizing strategic tactical thinking. The article notes that while the series was never slow, it was more weightier and heavier than other shooters. While I love the freedom of movement in action games and shooters, this shift towards slower and more sluggish gameplay can lead to more strategic thinking. This shift from \"tactical destruction\" to \"more immersive\" gameplay may have led to the game's promise of more meaningful battles. However, the author acknowledges that while characters are still more nimble than actually fast, this is still considered a challenge.",
  "shortSummary": "Battlefield 6's multiplayer is faster and more intense, but its absence of strategic gameplay and quick reactions may push players to prioritize tactical gameplay, despite its inherent agility.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0319a843d7fb4857907e3de1c87f4e79",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/games/fps/i-spent-4-hours-playing-battlefield-6-multiplayer-and-speaking-with-the-creators-and-here-are-my-10-biggest-takeaways/",
      "text": "I spent 4 hours playing Battlefield 6 multiplayer and speaking with the creators, and here are my 10 biggest takeaways\nHands-on | Battlefield 6 is taking things back to the fundamentals: classes, combat, and lots of explosions\nThe Battlefield 6 multiplayer preview event in Los Angeles greets me with a huge sign that reads \"In Squad We Trust,\" and things only get more bombastic from there. I was fortunate enough to be given several hours fighting through the trenches and ruined cityscapes of the war-torn near-future of 2027 in Battlefield 6, as well as a chance to speak with two of the game's developers, executive producer Christian Grass and creative director Thomas \"Tompen\" Andersson.\nWhile there's way too much info and new details than could ever be covered in a single article, I've compiled the ten biggest takeaways from my Battlefield 6 experience and what players can expect when the game launches later this year. Leaving the event several hours later, ears still ringing from the endless explosions and gunfire, it was pretty clear that Battlefield is back – and with a bang.\n10. Battlefield 6 is a clear successor to Battlefield 3 and 4 (with a little bit of Bad Company thrown in)\nWhat felt pretty implied at first is made clear in both the presentation and my talks with the creators: this is a game that's looking to Battlefield 3 and Battlefield 4 for inspiration more than any other game in the series. The modern setting, the movement, and gunplay are built from the ground up, but the template and tone is very much from those two beloved classics. In my interview, Andersson calls Battlefield 6 the \"spiritual successor\" to BF3 and 4, though also admits that the game's interest in destruction and blowing things up definitely had them looking back to the Bad Company games.\n9. Destruction is \"deterministic\" rather than random – and there's a reason for it\nDeveloper: DICE\nPublisher: EA\nPlatform(s): PC, PS5, Xbox Series X/S\nRelease date: October 10, 2025\nRather than buildings falling apart in unpredictable ways depending on how you shoot them, the destruction in Battlefield 6 is somewhat set in stone. Have a tank fire at a specific wall and it will blow up the same way in every game (albeit with variations in smoke and particle effects).\nAndersson explains the logic for this as wanting to provide \"tactical destruction\" that has to be mastered over time through experience in the game, having players learn the patterns of the map. \"You can rely on the cause and effect,\" he reveals during a Q&A. \"Randomness would be chaotic, it's not something I want,\" though he makes sure to clarify that players \"(shouldn't) expect everything to be destroyed the same way\" and that the playspace will still differ game to game, depending on who's blowing up what.\n8. Classes are back with open weapons that won't be what defines them\nThe previous game, Battlefield 2042, did away with the traditional class system that the series has historically used – but now it's back, with all the old favorites. Assault, Engineer, Support, and Recon. However, weapons are \"open\" rather than closed, meaning that you can have any class use any gun. The purpose now is to have the Battlefield 6 classes defined more by their gadgets and secondary abilities, which are more powerful and integral to playstyles than ever. It frees you up to customize your character accordingly, and also, the devs admit, stops certain classes from being the overwhelming favorite, so it's not just everybody picking Assault.\n7. There's more mobility than ever before, including the ability to cling to vehicles\nA four-seater tank? Says who? Now with the new \"hitch a ride\" system, players in Battlefield 6 can cling onto the backs and sides of certain vehicles if all the seats are full, though they shouldn't expect much protection if that's the case. I didn't get the chance to see if it works with fighter jets… but we can only hope, right? This is part of a push to generally increase mobility and movement within Battlefield 6, including combat rolling to help deal with long falls, the ability to peek and lean around corners, and mounting weapons on cover to reduce recoil.\nWeekly digests, tales from the communities you love, and more\n6. Dragging your friends to safety feels pretty damn heroic\nOf all the new mobility elements, my favorite is the new \"Drag and Revive,\" which is exactly what it sounds like. When reviving a fallen ally (assuming you're not just instantly zapping them back up with the Support class's defibrillator), you can drag them back in a direction of your choosing during the animation as a way to get you both to safety and cover. It means there's more reason than ever to make sure that you're reviving your squad, and I rarely felt more proud than when I was dragging a wounded ally out of the danger zone, promising that they were going to make it back home no matter what… which admittedly is usually when a burning helicopter would fall on us both.\n5. The new Battlefield Portal experience builder is so detailed you can build minigames into the UI alone\nIn a presentation full of strong moments and pitches, it was the brief glimpse of the new Battlefield Portal experience builder (wherein players can make custom games and maps) that elicited genuine gasps from the audience. Grass explains to me that they've focused on making it more powerful and nuanced than ever, while trying to ensure that it's still accessible.\nThe biggest two new features are a \"spatial editing tool,\" which will allow players to move elements of the map around, and a way to make custom UIs for those playing – something that's apparently so detailed and complex that Grass laughs that one of the dev team actually managed to make the game Pong on the UI itself. I can't wait for the inevitable moment that somebody puts Doom in Battlefield 6.\n4. There'll be 9 maps at launch, including an old favorite\nThe other big moment that got cheers during the presentation was the reveal of the beloved Operation Firestorm map from Battlefield 3, which will be making a return to the game as one of nine maps, with more planned for post-launch. Certain maps will also pop up during different game modes, as \"Combat Zones\" have been built into the larger maps. For example, the Brooklyn map is designed for large-scale combat with vehicles, meaning game modes like Conquest and Rush, but there's small buildings and locations within it suited for smaller combat encounters that will pop up as small-scale maps in smaller Squad Deathmatch games. Maps within maps!\n3. The shotgun is an absolute beast and you should fear it\nI'm not great at online shooters – my reaction speed goes down by half for every new grey hair that appears in my beard – so while my performance in Battlefield 6 wasn't great to start with, that all changed when I unlocked the game's pump-action shotgun and immediately proceeded to get a 12-person killstreak. Do yourself a favor when the game comes out: try the shotgun in close quarters, and you'll lead your squad to almost certain victory.\n2. There's a brand new game mode coming – \"Escalation\"\nThough it sadly wasn't available to play during my preview, the devs had great excitement over the upcoming new game mode debuting in Battlefield 6: Escalation, which by their description sounds like a game of Domination in which capture points disappear over time, forcing players to group in increasingly huge numbers around the few capture points that are remaining.\nWhile I'm excited to try Escalation, it's also been confirmed that there'll be seven other game modes available at launch, including all the old favorites: Conquest, Breakthrough, Rush, Team Deathmatch, Squad Deathmatch, Domination, and King of the Hill, with the promise of more to come post-launch. When is that, by the way?\n1. Battlefield 6 launches this October, but you can play it before that!\nYes, we can confirm that Battlefield 6 has an official release date, and will launch on October 10, 2025. But you can play it earlier than that, as there'll be two open betas in August, running on the 9th and 10th as well as the 14th through the 17th! The game is confirmed for PS5, Xbox Series X/S and PC, though we don't yet have the minimum hardware requirements for PC players. Still, those open betas are the perfect time to get used to the destruction and gunplay that awaits your squad this fall.\nRemember folks: In Squad We Trust.\nJoel Franey is a writer, journalist, podcaster and raconteur with a Masters from Sussex University, none of which has actually equipped him for anything in real life. As a result he chooses to spend most of his time playing video games, reading old books and ingesting chemically-risky levels of caffeine. He is a firm believer that the vast majority of games would be improved by adding a grappling hook, and if they already have one, they should probably add another just to be safe. You can find old work of his at USgamer, Gfinity, Eurogamer and more besides.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/fps/ive-played-battlefield-6-for-an-afternoon-and-while-its-a-clear-successor-to-battlefield-3-and-4-i-wish-there-was-more-destruction/",
      "text": "I've played Battlefield 6 for an afternoon, and while it's a clear successor to Battlefield 3 and 4, I wish there was more destruction\nPreview | It's a safe return to Battlefield's most beloved era, but can it bring down the house?\nAfter several hours in the trenches of Battlefield 6 it has become clear to me that it's a conventionally safe, but highly refined return to the era of Battlefield 3 and 4 – and that's very much by design. For better or worse, the changes made to the modern military formula pioneered by those games are more about enhancing that experience rather than making any substantial tweaks.\nThose expecting a bold new step in the game's history might be let down, but those who want a return to the fundamentals after the more experimental Battlefield 2042 can expect something that will definitely meet them halfway. Even so, the game's biggest selling point – the emphasis on destruction and blowing up whatever unfortunate obstacle is in your way – didn't quite live up to my expectations.\nMethod in the madness\nFind out everything you need to know about the 4 Battlefield 6 classes in time for the beta here!\nPlaying Battlefield 6 is an experience of two very distinct halves. On the one hand, it feels a lot more tactical in smaller maps and modes like Squad Deathmatch – the four of you creeping around, using complementary abilities and gadgets to clear rooms of other teams. The Support class slams down deployable cover and heals downed allies in a flash of defibrillator sparks, while the Recon runs around marking enemies and laying C4 in strategic spots before racking up careful headshots with a sniper rifle. Then it's up to the Assault and Engineer to be the tip of the spear, using firepower and explosives respectively to leave piles of bodies in their wake. Even with limited communication during the Battlefield 6 event in LA, that considered, intelligent aspect shone through loud and clear.\nIn the smaller maps. In the larger maps, it was almost completely absent. Maybe it was the confusion that comes with hundreds of players being given the game for the first time, but in the larger game modes of 32 on each side, all strategy went out of the window and chaos reigned supreme. Tanks rolling through crowds of panicking grunts, constellations of sniper scopes glinting on distant hilltops, overworked medics called in a thousand different directions every second, and yes, the occasional burning helicopter falling out of the sky like a meteorite. It's hard to be strategic about being hit in the back by a burning Chinook.\nWhich isn't to say it's not still fun. Being part of a whole platoon emerging from the trenches and running through enemy fire has an undeniable thrill, made all the more potent by some thunderous sound engineering on the developer's behalf. When a jet screamed overhead or a tank rumbled through combat, I felt it in my feet as much as in my ears. Likewise, enhancements to movement and mobility mean that playing feels a lot more spry on the ground than in older installments, and vehicles remain a good time – though I still can't fly a chopper to save my life.\nFire in the hole\nNo element of Battlefield 6 was sold to us more in the initial presentation than the game's destruction physics and the power of a well-placed explosive. The phrase \"tactical destruction\" was used more than once, highlighting methods like breach-and-clear, or planting charges under enemies from the floor below to take them by surprise.\nBut in practice, this element feels a bit vestigial. Not every wall or surface is destructible (something you can only test through trial and error), and it's not always clear if you're trying to bust through something unbreakable or if you need a bigger payload. The Assault Class comes with a grenade launcher that seems perfect for busting through brick like the Kool-Aid Man, but I and everybody I spoke to had the same experience: you'd fire it at a wall, only for the smoke to clear and leave a small burnt smudge where it had impacted while alerting everybody on the other side of said wall to your presence. Oops.\nWeekly digests, tales from the communities you love, and more\nDon't get me wrong; when it works, it's a good feature! Stalking through the stairwell in a Brooklyn office block, I suddenly yelped as the wall beside me was blown apart and an unexpected merc began peppering me with bullets through the haze. But that happened infrequently, and it was easy to forget that destruction is a core feature at all. The choice to make it situational is admittedly an intentional one, explained in a Q&A before we got the chance to play. Players can \"rely on the cause and effect,\" and that \"randomness would be chaotic.\" The logic is sound, though some way to clearly denote what will break and what won't wouldn't have gone amiss.\nThe debrief\nAfter the less-than-warm response to Battlefield 2042, Battlefield 6 is EA's safe bet: a return to the design ethos of BF3 and BF4, more focused on getting the fundamentals right than introducing anything particularly groundbreaking – which may be why the literal groundbreaking and destruction mechanics are being careful not to overstep.\nBut I can't deny it's a solid shooter on its own terms. Even at its most explosive moments, it's weightier and more strategic than Call of Duty, and the enhanced movement and recoil-heavy gunplay make everything feel punchy and cathartic. I'm definitely looking forward to the full release on October 10, 2025, even if those in the chopper with me won't be.\nJoel Franey is a writer, journalist, podcaster and raconteur with a Masters from Sussex University, none of which has actually equipped him for anything in real life. As a result he chooses to spend most of his time playing video games, reading old books and ingesting chemically-risky levels of caffeine. He is a firm believer that the vast majority of games would be improved by adding a grappling hook, and if they already have one, they should probably add another just to be safe. You can find old work of his at USgamer, Gfinity, Eurogamer and more besides.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/battlefield/we-dont-want-cod-movement-we-want-battlefield-battlefield-6-hopefuls-are-already-asking-dice-to-reign-in-its-slide-as-preview-streamers-fly-around-the-map-on-ice-skates/",
      "text": "\"We don't want CoD movement, we want Battlefield\": Battlefield 6 hopefuls are already asking DICE to rein in its slide as preview streamers fly around the map on ice skates\nBattlefield 6 looks a little too much like Warzone at the moment, and players aren't happy\nWe've been getting a steady stream of details about Battlefield 6, since the new FPS was officially announced by EA in late July. Amid all the preview footage, the sliding has stood out to fans because of how absurd it is in motion, leading to calls for some tweaking ahead of the full launch on October 10.\nManeuverability is key to a game like Battlefield 6. You want to be able to dodge and move around as smoothly and effectively as possible. Well, the team behind the latest installment have slightly overdone the sliding, to the point getting around the map is like wearing ice skates and the entire ground is frozen.\nClips posted on Reddit but since deleted, demonstrated the issues, and they're cartoonishly funny. Streamers were able to zip around almost like they're gliding, reminiscent of the heightened mobility in Warzone and Call of Duty in general.\nThe comparison is a theme among the feedback. \"I did think while watching the reveal, damn this looks a bit like Call of Duty movement, which for me is not a good thing because it's just garbage,\" a popular comment on the Battlefield subreddit reads. \"Battlefield is meant to tow the line where the movement feels good but isn't taken from looney toons.\"\nGenerally, players feel it dilutes what Battlefield is and dampens their excitement. \"There's tons of jump slide canceling or jumping into a slide then jumping out of it, this needs to goooo this movement system is cancer to the formula of Battlefield,\" another comment reads.\nThe saving grace here is everything we've seen comes from preview builds. Updates are possible, and this may be addressed by the time the release date arrives.\nTo learn more about EA's new FPS, check out our 10 biggest takeaways from our hands-on with Battlefield 6.\nWeekly digests, tales from the communities you love, and more\nAnthony is an Irish entertainment and games journalist, now based in Glasgow. He previously served as Senior Anime Writer at Dexerto and News Editor at The Digital Fix, on top of providing work for Variety, IGN, Den of Geek, PC Gamer, and many more. Besides Studio Ghibli, horror movies, and The Muppets, he enjoys action-RPGs, heavy metal, and pro-wrestling. He interviewed Animal once, not that he won’t stop going on about it or anything.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/battlefield-6/",
      "text": "Battlefield 6\nRelease Date: October 10, 2025\nPlatform(s): PC, PS5, Xbox Series X\nDeveloper: Battlefield Studios\nPublisher: EA\nGenre: FPS\nFranchise: Battlefield\nBattlefield 6 is an explosive new first-person shooter from Battlefield Studios, who is promising to deliver the ultimate all-out warfare experience. Unlike its predecessor, Battlefield 6 will come equipped with a single-player campaign and a returning focus on squad-centric chaos.\n\"The Battlefield franchise has endured a challenging few years, following the rejection of Battlefield 2042 by the wider FPS community. In a sense, Battlefield 6 is going back to basics in response. This new game for 2025 is returning to a more conventional modern warfare setting, with Battlefield Studios (which includes DICE, Motive, Criterion, and Ripple Effect) pushing for key refinements to its squad-based action, destruction, and the scale of this all-out warfare.\"\nLatest Battlefield 6 videos\nNew Battlefield 6 screenshots\nBattlefield 6 in detail\nBattlefield 6 beta\nThe Battlefield 6 beta is now live, meaning that you can get an early hands-on with the upcoming FPS. We have a dedicated guide on how to access the Battlefield 6 beta, as well as articles on the Battlefield 6 beta times and Battlefield 6 beta rewards – all of which will carry across to the release build.\nBattlefield 6 classes\nAfter experimenting with specialist operators in Battlefield 2042, DICE has decided to go back to the beloved class-based system that the series has always been known for. There are some changes to the Assault, Engineer, Support, and Recon setups though, so check our guide on the Battlefield 6 classes.\nBattlefield 6 preview\nGamesRadar+ got early access to Battlefield 6 before the beta kicked into gear. We played the shooter for a few hours and spoke with members of the development team to learn more about the Battlefield 6 gameplay experience. So be sure to check our Battlefield 6 preview to learn more.\nLatest about Battlefield 6\nBattlefield 6 multiplayer is faster than ever, and while I'm having fun being a speedy soldier, it's playing against the shooter's most iconic feature\nBy Joel Franey published\nOpinion Opinion | Enhanced speed is a fun thing, but is it worth sacrificing the strategic element of BF6?\nAs Battlefield 6 beta queues surge past 200,000 players, Dice promises a \"substantial increase\" in server capacity to reduce wait times\nBy Scott McCrae published\nNews \"We’re putting in the work to ensure that players have the best possible experience and servers remain stable\"\nHow to access the Battlefield 6 beta\nBy Iain Wilson last updated\nGuide Redeem a code for the Battlefield 6 open beta to get two days early access\nBattlefield 6 beta game server issues and errors explained\nBy Joel Franey published\nGuide You can't access the BF6 open beta while queues are full, and will have to wait in the queue\nBattlefield 6 open beta hopefuls are reporting 48,000-player queues before the beta's even started, but Secure Boot errors and shader compilations mean PC players probably should be getting an early start\nBy Dustin Bailey published\nNews \"Requiring Secure Boot provides us with features that we can leverage against cheats that attempt to infiltrate during the Windows boot process\"\nBattlefield 6 recoil emerges as the FPS' first big hullabaloo thanks to a \"zero recoil\" gun that, according to pew pew nerds, is actually just super realistic\nBy Jordan Gerblick published\nNews The KTS100 LMG is apparently based on the real-life Ultimax-100\nBattlefield 6 really wants Assault players to stop lone-wolfing, so they've taken the Spawn Beacon from snipers to place \"greater emphasis on team play\"\nBy Scott McCrae published\nNews It was \"often being used by solo snipers to redeploy in hard-to-reach places\" so Recon players did this to themselves\nHow to repair vehicles in Battlefield 6\nBy Joel Franey published\nGuide Fixing vehicles, including tanks, planes and helicopters in BF6, is done with the Repair Tool\nWeekly digests, tales from the communities you love, and more"
    },
    {
      "url": "https://www.gamesradar.com/best-fps-games/",
      "text": "The 25 best FPS games to play in 2025\nShoot sharp in the best FPS games of all time, from Half-Life to Halo 2\nCounting down through the best FPS games is no easy task. It's one of most expansive genres out there, being a label that can be attached to any game where you pick up a gun and shoot it from a first person perspective. But hunting for quality over quantity is made all the tougher for the sheer plethora of options on the table - which is where this list will come in handy.\nFrom the best Call of Duty games to PvE adventures and a zombie horde shooter, we've gathered the 25 best FPS games out there to hone your aiming skills with before Borderlands 4 lands later in 2025. Being such a sweeping genre, our selection does come with a few caveats. We've focused on spotlighting titles that put gunplay front and center, which means you won't find games like Deathloop and Fallout 4 below – which, while both being excellent experiences in their own right, have the unfair advantage of incorporating action, adventure, and RPG systems to support their core mechanics. For more of those, you'll want to find our ranking of the best shooter games on the market.\nFor now, though, eyes down for the best FPS games the genre has to offer, no matter your platform of choice!\nThe top 25 best FPS games to play in 2025 are...\n25. Splitgate\nDeveloper: 1047 Games\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X\nA snappy and ultra-slick shooter, Splitgate answers the question: “What would happen if Halo and Portal had a baby?” Well, not only would the tyke have a seriously twitchy trigger finger, but it would also behave far better than you would ever think.\nWith an impactful arsenal that matches the Master Chief's armory at its best, Splitgate's frenzied free-to-player multiplayer mayhem always feels satisfying. Yet it's the additions of those portals that add a layer of strategy and bristling chaos to what's already becoming an iconic FPS. With the first Splitgate proving a breakout success in 2019 and Splitgate 2 planning to launch in 2025, there's no better time to polish your portal-sniping skills.\n24. Valorant\nDeveloper: Riot Games\nPlatform(s): PC, PS5, Xbox Series X/S\nWeekly digests, tales from the communities you love, and more\nValorant is Riot Games' attempt to take CS:GO's competitive FPS crown. It's like a mix of Valve's tactical shooter and Overwatch's over-the-top heroes. It is, at its heart, still a tactical FPS in which positioning is king and every character is dangerously squishy, but each Agent has flashy skills and abilities that can turn the course of a round. If you've not taken some time away, you may be surprised by just how powerful some of these skills have become in the years since launch.\nValorant is more colorful than CS:GO, but the clean visuals prove that the emphasis is on substance over style. The fact it's made the leap to platforms such as PS5 and Xbox are testaments to how much polish Riot put into its design and how balanced its maps and heroes are - and if you're looking for a shooter that demands as much brain as brawn, you'll find few as engaging as Valorant.\n23. Back 4 Blood\nDeveloper: Turtle Rock Studios\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X\nA modern take on Valve's classic Left 4 Dead, Back 4 Blood remains popular with players who want more customization between levels. While solo play only offers bog-standard zombie-slaying thrills, the action is oh-so elevated by a fantastic co-op mode (which we shout out in our Back 4 Blood review) that delivers equal measures of camaraderie and chaos.\nBack 4 Blood's B-Movie charm and smart card system deliver dollops of slapstick and strategy to a game that makes you cherish every last gasp dive to that safe room… whether you make it there with your spleen intact or not. Although updates on this gory gem have ceased as of 2023, servers remain up, which means this is a particularly good game to dive into with friends who have perhaps rinsed Left 4 Dead a bit too much.\n22. Battlefield 1\nDeveloper: DICE\nPlatform(s): PC, PS4, Xbox One\nBattlefield 1 is a WW1 shooter that showcases a terrifying amount of carnage. It's got all the familiar BF modes that we've grown to love, including Conquest, Rush, and Domination. But this game adds the formidable Operations mode that takes the push and pull of war to new heights. In fact, the game works so well as a multiplayer shooter because of how finely it's balanced - there's no class, weapon, or tactic that gives an unfair advantage over others. Trust us, there's a reason why we gave it such a high score in our Battlefield 1 review!\nThough the Battlefield series has marched on since this entry, post-launch updates turned Battlefield 1 into something of a late bloomer after launch, to the point where it's arguably now better than it's ever been. If you want to mix things up from Battlefield 2042 or simply didn't gel with EA's modern shooter, this is the perfect recommendation for anyone who wants a historical shooter with a little more texture than your usual Call of Duty match.\n21. Dusk\nDeveloper: New Blood Interactive\nPlatform(s): PC, Nintendo Switch, PS4\nPlenty of modern FPS games capture the feeling of playing Quake or Doom for the first time, but Dusk is the smoothest, the fastest, the goriest. It's like the best of the '90s but with a few modern-day twists that make it stand out, like detailed reload animations and inventive level design. Maps are varied and keep you guessing: one minute, you're in a spooky old farm, clearing out barns with a shotgun, the next you're in a science lab that twists back on itself, the walls becoming the floor when you turn your head.\nLike the best old-school shooters, it's simply bloody good fun. Beefy weapons turn enemies into a fine red mist, and you zoom through levels as if on roller skates, only pausing to line up the perfect shot. It's topped off by a metal soundtrack that refuses to let you quit.\n20. Half-Life 2\nDeveloper: Valve\nPlatform(s): PC, PS4, Xbox One\nIt may be old enough to drive and gamble a young Gordon's student loan fees under a bus, yet despite its age, Half-Life 2 still has a touch of G.O.A.T. status. This is an all-time shooter masterpiece. Whether you played it on a cutting-edge rig on a debuting Steam in 2004 or first sampled its City 17 delights courtesy of Valve's brilliant Orange Box bundle, the core of Half-Life 2's greatness remains unblemished.\nIt's a true test of time game that earned a near-perfect score in our Half-Life 2 review. Few other shooters before or since show such a level of masterly pacing. If you haven't played before, we'd recommend checking Half-Life 2 out to see why it was all the rage in its heyday. Plus, the level set in zombie-infested Ravenholme remains one of the best levels to ever take place in an FPS - if you haven't bisected an enemy with flying sawblades, have you ever really lived?\n19. Far Cry 6\nDeveloper: Ubisoft\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X\nIt may not be one of the best Far Cry games in the series, but Far Cry 6 is still a superior shooter. Does it still lean heavily on a lot of well-worn Ubisoft tropes? Of course. Yet look past the dinky dachshund sidekicks named after a Spanish sausage and the typically assured, if samey, stealth, and you'll find an FPS that feels like a much-needed turning point for Far Cry.\nNew additions like the Supremo Backpacks open up creative new avenues for both sneaky and explosive chaos, further enlivening Far Cry's already intoxicating power fantasy. Better yet? With the introduction of freedom fighter Dani – who you can actually see, listen to, and emote alongside in third-person cutscenes – Far Cry has finally given us a protagonist who's actually worth rooting for. And all it took was half a dozen entries. When it comes to sandbox shooters, few do madcap spectacle better than this FPS. Check out our Far Cry 6 review for more information!\n18. Bulletstorm: Full Clip Edition\nDeveloper: People Can Fly\nPlatform(s): PC, PS4, Xbox One, Nintendo Switch\nNever has a game so intelligent tried so hard to look like an idiot, or been so screamingly funny with it. On Bulletstorm's surface, you'll find a brash, knowing, don't-give-a-fuck attitude, sitting on a layer of the most gloriously creative cursing you've ever heard in a video game. Beneath, you'll find one of the densest, most detailed, widest-branching FPS systems ever devised.\nThe genius of Bulletstorm lies in its Skillshots. Imagine if a new Tony Hawk's game served up tricks but replaced every Ollie and kickflip with increasingly gruesome ways of mangling mutants, and you're pretty much there. Boot a dude in the balls, then kick his head off. Launch some men into orbit with an alt-fire rocket, then pick them out of the sky like they were clay pigeons. Sadly, we'll probably never see such a brash, bright, or commendably crude FPS like this again. Read our five-star Bulletstorm review if you're after more details!\n17. Call of Duty: Black Ops 6\nDeveloper: Treyarch\nPlatform(s): PC, PS5, Xbox Series X|S\nWhen it comes to the best Call of Duty games, this is both the latest and (one of the) greatest. As stated in our Call of Duty: Black Ops 6 review, 2024's entry to the series boasted a return to form on all fronts. Whether you're craving a surprisingly creative campaign, multiplayer bolstered by the addition of Omnimovement, or the best Zombies mode since 2010's Black Ops, Black Ops 6 is the game to go with.\nThat's the funny thing about Black Ops 6: regardless on what you're in the mood for, it has something for every FPS fan. '90s babies will appreciate the sprinkling of capital-C Culture here - there are needle drops for Faith No More and Nine Inch Nails sprinkled throughout the multiplayer and campaign - but really, it's the movement system and Treyarch's extra-punchy guns that make this one a winner. If you've taken a longer-than-usual break from Call of Duty, Black Ops 6 is the best possible time to pick things back up where you left 'em: two kills off a chopper gunner.\n16. Borderlands 3\nDeveloper: Gearbox\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X, Nintendo Switch\nHow to describe Borderlands 3… you could say it's the underlying principles of the first and second Borderlands wrapped up in a more pristine shell. Or you could call it World of Warcraft: The First-Person Shooter. With its heavy emphasis on loot, loot, and more loot, Borderlands 3 drowns players in a sea of guns with varying abilities and stats, conveniently color-coded by rarity. The colorful characters break away from the traditional \"fighter, wizard, rogue\" archetypes, and each hero is memorable in their own right.\nThat said, the one snag about the game that we mentioned in our Borderlands 3 review is that it doesn't quite have the character of Borderlands 2. We miss Krieg. Oh, Krieg, you crazy barbarian poet. And none of Borderlands 3's villains fill us with anger the way Handsome Jack did. But in terms of shooting and looting, preferably in co-op, it still stands as the zenith of the Borderlands formula.\n15. PUBG: Battlegrounds\nDeveloper: PUBG Corp\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X\nPUBG is the game that spawned the battle royale craze. Technically, it wasn't the first battle royale game, but it popularized the staples of the genre we all recognize: randomized gear spread out on a big map; a starting plane from which players parachute; and an ever-shrinking play zone. A lot has changed since it first came out, and now it's more polished, with a variety of maps that cater to all play styles, and it's free-to-play at a baseline.\nOn the biggest maps, you might go long stretches without seeing another player, and it's that pacing and the lethality of the realistic bullet physics that set PUBG apart from the crowd. You can play with a squad of friends and experience why this is one of the best multiplayer games around, but it's always those nail-biting, stealthy solo moments that stick with me. And yes, you can technically play PUBG in third-person - but good luck getting that chicken dinner if you're not shooting in first-person.\n14. Counter-Strike 2\nDeveloper: Valve\nPlatform(s): PC, PS3, Xbox One\nDespite changing its name from Counter-Strike: Global Offensive, Valve's king of shooters remains in top form on Steam. This tactical FPS is as crunchy as ever, with the added benefit of a modern-day visual overhaul, meaning it's a wonderful entry (or re-entry) for taking your shooting skills into a more competitive environment. Although custom servers allow for more casual experiences, the real draw of CS2 is its Terrorists vs. Counter-Terrorists game modes without respawns.\nHere, Counter-Strike's emphasis on paying attention to sounds and communicating with your allies shines. There's nothing like the tension that sits at the beginning of each round, as both teams secretly select their tactics and wait for them to collide with their opponents' own gambit. Each map is meticulously crafted to allow for myriad tactics, and the lovingly modeled guns in your expansive arsenal all have minutiae in their firing rates and recoil. This game sticks with you, and it's hard to see this shooter going anywhere for a long time. Read our Counter-Strike: Global Offensive review for more details!\n13. Wolfenstein 2: New Colossus\nDeveloper: MachineGames\nPlatform(s): PC, PS4, Xbox One, Nintendo Switch\nThis Nazi murder sim is smarter than it sounds. The guns are big, loud, and turn members of the Third Reich into bloody pulps, and the more bullets you pump out, the better. The ability to dual-wield any two weapons also makes New Colossus feel different from other old-school shooters. Most impressive of all is the narrative.\nYou get to know more about the series' broken hero, BJ Blazkowicz, than ever before through an origin story that's not afraid to get dark, and a talented cast somehow manages to pull off a tale that pirouettes between the serious and the absurd. This title is a must-play when it comes to our list of the best FPS games, and we stand by giving it a close-to-perfect score in our Wolfenstein 2: New Colossus review.\n12. I Am Your Beast\nDeveloper: Strange Scaffold\nPlatform(s): PC\nLet's be honest: whether your FPS is meant to be a slow tactical crawl or daft arcade-y, fun, killing every enemy in seconds is a massive flex. I Am Your Beast, an indie shooter from Strange Scaffold, gets this.\nA revenge thriller with the tightly-choreographed action sequences of a feature film, I Am Your Beast is all about making you feel like the strongest, slickest star in any single fight. You'll often be outnumbered, frequently outgunned, but never outmatched: after all, any character capable of clubbing a guard and catching their gun in the same second - yes, you can really do that - deserves their main character status. This may have flown under your radar at launch, but don't let it sneak any further away.\n11. Metro Exodus\nDeveloper: 4A Games\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X\nWe called it the best shooters of 2019 for a reason in our Metro Exodus review. The Metro series is known for blending stealth and shooting in oppressive environments filled with ravenous mutants that want to rip your throat out. Exodus is built from the same DNA, but finds a new level of polish and ambition. From Moscow, you take a train through the Russian wilderness, stopping off in desert towns, snowy tundras, and military bases, each filled with secrets to find and enemies to blow to bits.\nYou conduct missions alone, and venturing from the safety of your party is nerve-wracking. Thankfully, you have an armory of inventive, upgradable weapons to keep you safe, from crossbows to revolvers. Back on the train, you'll get to know the endearing cast, who will make you genuinely care about protagonist Artyom's fate. If you're looking for pure action, Exodus's careful pace might turn you off, but the cross-country travel gives you a constant sense of progress.\n10. Superhot\nDeveloper: SUPERHOT Team\nPlatform(s): PC, PS4, Xbox One, Nintendo Switch\nTime only moves when you move. That's the elevator pitch for Superhot, a cerebral FPS from an independent studio out of Poland, and it's a perfect distillation of what makes Superhot so intoxicating. And all that slow-mo obviously helps, too. Cooler than Keanu in the original Matrix taking the ice bucket challenge, this effortlessly slick FPS is as much a puzzler as it is a shooter.\nWhile the act of pointing and pulling the trigger is simple enough – it's hard to miss when you're moving slower than a tortoise in treacle – the order you take enemies out is an entirely trickier issue. Many levels must be completed with Swiss watch-levels of precision, and killing a dude at the wrong time can make the whole slow-motion house of bullet-strewn cards tumble. That's the central appeal of Superhot: it's an FPS that's as clever as it is cool. Check out our Superhot review for more information on this gem.\n9. Apex Legends\nDeveloper: Respawn Entertainment\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X/S, Andriod, IOS, Nintendo Switch\nThe battle royale for those who want to go faster. Your movement is as important as your aim in Apex Legends: you can parkour across roofs, shimmy up ledges, and slide down hills, scrabbling for positional advantage. The character classes and their abilities make Respawn's shooter feel unique in the genre. One hero can see trails of enemy footsteps, another creates portals, and another can clone themselves to bamboozle their opponents.\nIn a squad of three, which is how it was designed to be played, you can combine these abilities inventively to outfox enemy teams. The two maps are bright and varied, with plenty of ways to help you take the high ground, and Respawn is constantly tweaking the formula with new weapons and heroes. If you haven't played it since the early wave of enthusiasm, it's time to return. In our Apex Legends review, we gave the game a massive five-star rating, so yeah, it's top-tier.\n8. Black Mesa\nDeveloper: Crowbar Collective\nPlatform(s): PC\nIt's what you get when you take one of the most beloved shooters of all time, Half-Life, revamp the entire disastrous ending and add prettier visuals. Black Mesa is fan-made (and Valve-approved), but you wouldn't know it: every room is crafted with the kind of care you don't see from many AAA teams. This is more than just a remake of a classic – it's a complete overhaul that brings one of the greatest shooters ever and one of the greatest protagonists, Gordon Freeman, into the modern era.\nEverything you love about Half-Life remains. You'll shoot headcrab zombies, alien monsters, and human soldiers with an array of weapons, from a beefy shotgun to the prototype energy Gluon Gun, which melts enemies in seconds. But it's the new additions that stand out. In the original Half-Life, the Xen locale was lifeless. Here, it's bursting with color, and every craggy rock and bizarre clump of plants is rebuilt from scratch. It's far bigger and feels like a completely different game. Half-Life is finally whole.\n7. Titanfall 2\nDeveloper: Respawn Entertainment\nPlatform(s): PC, PS4, Xbox One\nTitanfall 2 is an undisputed high-ranker when it comes to the best FPS games. The weightlessness that comes with perfectly mastered wall-running makes you feel like you're doing some sort of deadly ballet, letting you sail past your foes at impossible speeds, catching them unawares. The unforgettable BT-7274 and unbridled creativity dominate Titanfall 2's campaign, whether it involves you switching between decades in the blink of an eye, walking through a moment frozen in time, or simply ripping other Titans apart when you step into titanic bot boots of BT-7274.\nRewarding you for using the environment to your advantage, you can feel the moment when you start thinking differently, realizing the possibilities a map offers. The physics-twisting Quake-like mechanics of its multiplayer mode strengthen an already sensational shooter package. But it's that remarkable campaign that makes Titanfall 2 such an enduring shooter. Let's cross BT's colossal droid digits so that we eventually see a Titanfall 3. In the meantime, you can read our Titanfall 2 review for a deeper look at this classic.\n6. Tom Clancy's Rainbow Six Siege\nDeveloper: Ubisoft\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X/S\nRainbow Six Siege has quietly become one of the best Tom Clancy games around, combining the intensity and replayability of Counter-Strike with the unique abilities and personality of Overwatch. But the real star of Siege is the impressive destructibility of your environment: walls and ceilings can all be destroyed, so you need to smartly choose which flanks to cover and which walls to reinforce, lest someone blast through them with sizzling thermite.\nYou and your squadmates choose from a variety of highly skilled Operators, each with their own specialties that can complement each other for a rock-solid team comp, though your propensity for sneaking and aiming a gun are what matter most. As mentioned in our Rainbow Six: Siege review, every round becomes a tactical, incredibly tense game of cat-and-mouse, as one team protects an objective while their opponents try to scout out danger and survive a breach.\n5. Halo: The Master Chief Collection\nDeveloper: 343 Industries\nPlatform(s): PC, Xbox One, Xbox Series X\nThis is the ultimate serialized tale of John 117 and the go-to choice for players looking to find all the best Halo games in one place. Halo: The Master Chief Collection is all but unrecognizable from the Spartan car crash that launched in 2014. After years of server fixes, technical tweaks, and graphical upgrades, this is now the definite way to experience golden era Halo.\nWhether experiencing the best second level in all of the shooters in the original Combat Evolved or blasting buddies in PvP on Halo 3's all-time classic Guardian map at a blistering 120 frames per second on an Xbox Series X, Halo has rarely felt more essential. We're tickled (Needler) pink Chief got the redemption act he deserves. Is cramming a bunch of games into one entry cheating? Sure, but if you read our Halo: The Master Chief Collection review, you'll understand why we had to bend the rules in this case.\n4. Half-Life: Alyx\nDeveloper: Valve\nPlatform(s): PC\nIf VR headsets were issued at birth, there's a chance Half-Life: Alyx would be our favorite FPS of all time. Sadly, the barrier for entry to enjoy this virtual reality wonder at its very best is loftier than the off switch on a Strider. Even if you merely 'settle' for experiencing this perfectly paced, incredibly atmospheric shooter on a Meta Quest rather than Valve's painfully expensive Index, you're still looking at dropping a huge chunk of change for a ten-hour game.\nAnd yet, the absolute highest praise we can heap on Alyx? We'd seriously consider paying the price of a PS5 or Xbox Series X to play this one sensational shooter. Not only is it one of the best VR games on the market, but the shooting controls make you feel like you are the star of your own action movie. Check out our Half-Life Alyx review for more detailed information on this modern staple.\n3. Doom Eternal\nDeveloper: id Software\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X, Nintendo Switch\nThough we didn't exactly shower Doom Eternal with praise fresh out the gate, in retrospect, this really is at the pinnacle of the FPS genre. This is everything that the genre is about, distilled into one glorious roar. It's also a remarkably elegant experience in motion, especially for a game that makes you garrote a demon every 17 seconds. Like Mario 64 or Mirror's Edge, Eternal feels flawless when you tap into its joyous rhythm.\nEvery gun feels perfectly tuned, each level impeccably paced, while every monster dragged screaming from the depths of Hell has clearly been designed to coax just the right measure of aggression out of the Doom Slayer. Amazingly, it's brilliant on pretty much every modern platform, too. Whether you're playing on an OG Xbox One, ripping Cacodemon eyes out at 120 frames per second on a cutting-edge PC, or yanking spines on the impressively assured Switch port, Doom Eternal kicks ass whatever your choice of format. Read our Doom Eternal review next- though we have changed our mind about it since!\n2. Call of Duty: Warzone 2\nDeveloper: Infinite Ward, Raven Software\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X\nArguably, the best of the best battle royale games. For years, three games had a stranglehold on the genre: Fortnite, PUBG: Battlegrounds, and Apex Legends. But Call of Duty: Warzone has blown it wide open by twisting every element of the genre into something that feels exciting but accessible. The new stuff: when you die, you get one shot to respawn by taking on another dead foe in a 1v1 fight. You get cash from completing contracts spread across the map, hunting down enemies, searching for chests, or defending an area.\nThen there are the old, comforting bits: the ever-shrinking play zone, a flawless “ping” system to flag items for your teammates, and vehicles to transport you to distant circles. It's like the greatest hits of the genre so far, all backed by Call of Duty's tried and tested low-recoil gunplay. You can play it solo, but jumping in with friends in Duos, Trios, or even the chaotic four-soldier squad mode is where the real Warzone fun is found. For a deeper dive into this iconic shooter, read our Warzone 2 review.\n1. Destiny 2\nDeveloper: Bungie\nPlatform(s): PC, PS4, PS5, Xbox One, Xbox Series X/S\nNo one expected Destiny 2 to be as good as it is. And we really, really love this game, if you couldn't tell already by our five-star Destiny 2 review. Instantly making the first game look like a set of prototypes, this title improves in every area. Actually, scratch that. It evolves, taking the seed of the first game's MMOFPS idea and building a whole new, entirely richer, deeper, and broader experience around it. But that is only the start.\nWith a simplified, streamlined leveling system running through every one of Destiny 2's vastly expanded activities - from story-driven side-quests to multi-part Exotic Questlines, to treasure hunting and tactically reworked Crucible PvP – every single thing you want to do, however, you want to play, will push you forward. And then there's the far more freeform approach to load-outs, further energized by more creative and expressive weapon design. Even better, with the dawn of Destiny 2 New Light, you can access a lot of the action for free, while regular die-hards can pay for The Witch Queen: the best Destiny expansion ever.\nAfter more hits? Check out our lists of the best RTS games, the best survival games, and all the new games heading our way.\n- Andrew BrownFeatures Editor\n- Josh WestEditor-in-Chief, GamesRadar+\n- Emma-Jane BettsManaging Editor, Evergreens\n- Heather WaldSenior staff writer\n- Jasmine Gould-WilsonStaff Writer, GamesRadar+\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Battlefield 6 is a fast-paced first-person shooter that emphasizes agility and movement, marking a shift from the series' traditionally slower, more strategic gameplay. While it draws inspiration from beloved titles like Battlefield 3 and 4, the game introduces new mechanics such as a class system with open weapon access and enhanced mobility features, including the ability to cling to vehicles and drag fallen allies to safety. Despite the excitement around its tactical destruction mechanics, some players feel that the destruction lacks depth and clarity, and there are concerns about the game's movement system resembling that of Call of Duty. Overall, Battlefield 6 aims to refine the franchise's core elements while preparing for its release on October 10, 2025.",
  "argos_id": "A7ALQG0HJ"
}