{
  "url": "https://www.zdnet.com/article/my-top-5-favorite-ios-26-features-so-far-and-how-to-try-them-all-now/",
  "authorsByline": "Lance Whitney",
  "articleId": "87270777f2c34b8ab017766b106c0638",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/4dcc17ddc8766eda7d1c5c2fd33d6c1600eba24d/2025/07/29/7a4c6de4-dd6c-4950-8b0c-808d8f78b841/dsc06661.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T16:51:15+00:00",
  "addDate": "2025-08-07T16:57:28.022735+00:00",
  "refreshDate": "2025-08-07T16:57:28.022736+00:00",
  "score": 1.0,
  "title": "My top 5 favorite iOS 26 features so far - and how to try them all now",
  "description": "Available as both a developer beta and a public beta, iOS 26 offers a host of cool new features and enhancements. These are my favorites.",
  "content": "Apple has been busy prepping iOS 26 for its likely debut in September. Until then, the iPhone's upcoming new OS has been accessible for anyone to try via a developer beta (now up to version 5) and the initial public beta. Though iOS 26 still has at least a month of tweaks before it's finalized, the beta flavors already provide a peek at what to expect.\n\nYou can download iOS 26 beta on your iPhone now. Here's how to install it -- and which models support it.\n\nAlso: The best MagSafe accessories of 2025 for your iPhone\n\nI've been running the public beta since its release on July 24. Among the new and improved features in iOS 26, these are my five favorites so far.\n\nAdding a new translucent design to the interface, Liquid Glass gives the impression that you're looking at your screen elements through glass. With this new aesthetic enabled, icons appear more three-dimensional and layered, while menus are semi-transparent. I've read some negative comments about Liquid Glass, but I like the new design. I feel the interface draws me in and engages with me in an artistic but practical way. Comparing my test iPhone with iOS 26 and my current phone with iOS 18, I can clearly see and appreciate the differences with Liquid Glass.\n\nAlso: What is Liquid Glass? Here's everything we know about Apple's major UI overhaul\n\nFor iOS 26, Apple tweaked the camera app to help you more quickly and easily access certain controls and settings. By default, the app shows you the two most common modes -- photo and video. To segue to other modes such as portrait, pano, slow-mo, and time-lapse, swipe your finger left or right or press down on the control to move from one mode to another.\n\nEven better, the key settings are now more easily accessible and configurable. To display settings such as flash, exposure, filter, and timer, you can still swipe up from the bottom as always, or simply tap the button with the name of the mode. Up pops a Liquid Glass menu with icons for all the settings. Tap a specific icon to adjust it. Depending on your current mode, controls also appear at the top for you to view and adjust.\n\nWith iOS 18, Apple altered the layout in the Photos app to display both your library and collections on the same screen. Though that may sound convenient, it upset many iPhone users who now have to swipe up and down to switch between the two views. With iOS 26, Apple has rectified that error.\n\nAlso: Apple finally added my most-requested iPhone feature (and you'll love it, too)\n\nOpen the Photos app in the new OS and you'll see two icons at the bottom -- one for your Library and another for your Collections. By default, the app opens in Library view so you can easily scroll through all your photos or view them by year or month. Tap the Collections icon and you'll then see your photos organized by memories, albums, people, and other criteria. You can also reorder the different collections to place your favorite ones at the top of the screen.\n\nTo help you better combat scam and spam calls, iOS 26 adds a helpful new option to the Phone app. You can now screen a call from an unknown number by asking the caller for certain information. Before you choose whether to pick up the call, the person on the other end is asked why they're calling. That information then flashes on the screen to help you decide how to handle the call.\n\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.\n\nTo enable this, head to Settings, select Apps, and then tap the Phone app. Swipe to the section for Screen Unknown Callers and tap the option for \"Ask Reason for Calling.\" The next time you receive a call from a stranger, the person will be prompted to explain why they're calling. You can then answer or ignore the call.\n\nApple hasn't made it easy to change your default apps. In the past, you had to drill down to each app that you wanted to change or set. Now with iOS 26, you can choose all your default apps in one place. For this, go to Settings, select Apps, and then tap Default Apps. From here, you're able to modify the defaults for email, messaging, calling, call filtering, browser, translator, passwords, contactless payments, and keyboard.",
  "medium": "Article",
  "links": [
    "https://www.zdnet.com/article/what-is-liquid-glass-heres-everything-we-know-about-apples-major-ui-overhaul-at-wwdc/",
    "https://www.zdnet.com/article/iphone-envy-five-ios-17-features-that-android-users-already-have/",
    "https://www.zdnet.com/article/ios-17-your-iphones-wallet-app-is-getting-two-big-updates-here-they-are/",
    "https://www.zdnet.com/article/apples-ios-26-and-ipados-26-public-betas-are-here-how-to-access-and-why-youll-want-to/",
    "https://www.zdnet.com/article/best-magsafe-accessory/",
    "https://www.zdnet.com/article/apple-finally-added-my-most-requested-iphone-feature-with-ios-26-and-youll-love-it-too/",
    "https://www.zdnet.com/article/iphone-overheating-do-this-first-to-prevent-damaging-the-battery/",
    "https://www.zdnet.com/newsletters/",
    "https://www.zdnet.com/article/you-can-download-ios-26-beta-on-your-iphone-now-how-to-install-and-which-models-support-it/",
    "https://www.zdnet.com/article/5-useful-ios-17-features-apple-quietly-released-at-wwdc-2023/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "iOS",
      "weight": 0.0789554
    },
    {
      "name": "Apps",
      "weight": 0.078947976
    },
    {
      "name": "call filtering",
      "weight": 0.071210265
    },
    {
      "name": "Liquid Glass",
      "weight": 0.069560304
    },
    {
      "name": "other modes",
      "weight": 0.06689248
    },
    {
      "name": "many iPhone users",
      "weight": 0.06533183
    },
    {
      "name": "iPhone",
      "weight": 0.060677517
    },
    {
      "name": "Apple",
      "weight": 0.05664498
    },
    {
      "name": "icons",
      "weight": 0.053707696
    },
    {
      "name": "certain controls",
      "weight": 0.053607076
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8330078125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.58935546875
    },
    {
      "name": "/News/Technology News",
      "score": 0.58642578125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.50732421875
    }
  ],
  "sentiment": {
    "positive": 0.34375,
    "negative": 0.12817383,
    "neutral": 0.5283203
  },
  "summary": "Apple's upcoming iOS 26, set for its likely debut in September, has been accessible for anyone to try via a developer beta (now up to version 5) and the initial public beta. The new OS features include a new translucent design to the interface, giving users the impression of looking at their screen through glass. Key settings are now more easily accessible and configurable. The Phone app can now screen a call from an unknown number by asking the caller for certain information, which then flashes on the screen to help you decide how to handle the call. The user can now change default apps in the default section of the phone to help combat scam and spam calls.",
  "shortSummary": "Apple's iOS 26 features include a new translucent interface, improved phone settings, and a new feature to combat scam and spam calls.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "35d34983203c4c03b172c61df88c8e37",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.zdnet.com/article/iphone-envy-five-ios-17-features-that-android-users-already-have/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\niPhone envy? Five iOS 17 features that Android users already have\nApple this week rolled out the official version of its latest iPhone software, iOS 17, with a bounty of new features that bring improved customizability and functionality to its latest smartphones.\nAlso: The most impactful new iOS 17 features are also the ones you'll notice the least\nIf you followed Apple's most recent iPhone 15 keynote or started to see TikToks on what's new for iPhone, then iOS envy can be real, very real. But if you're an avid Android user, should the latest iPhone features warrant a change of heart?\nIf the below features are new to you, then probably not. Because what's hot and fresh for the iPhone might already be available in the palm of your hand.\n1. Live Voicemails\nNot everyone has the bandwidth (or wants) to take phone calls. Spam numbers are running rampant, sitting through elevator music for the next available representative is never fun, and more often than not, a text message gets the job done.\nThat's why Live Voicemail, an iOS 17 feature that transcribes what a caller on the other end is saying without you needing to pick up the phone, drew \"oohs\" and \"ahs\" at WWDC in June.\nAlso: 5 useful iOS 17 features Apple quietly released at WWDC\nBut if you're on a Google Pixel or Samsung Galaxy, there exists Call Screen and Bixby Text Call, respectively. Both Android features allow you to screen incoming calls, transcribe messages in real time, respond via text-to-speech, and switch back to a voice call when you're ready to pick up the phone.\nTo enable Call Screen, open the Phone app > tap on the More icon (three dots) > Settings > Call Screen > and toggle the feature on. To enable Bixby Text Call, open the Phone app > tap on the More icon > Settings > Bixby Text Call > and toggle it on. The next time you receive a phone call, your phone should give you the option to use the call-screening feature.\nThere are some other unique aspects to the two like the ability to automatically block spam calls in Call Screen and being able to replicate your voice via AI in Bixby Text Call.\n2. Offline maps\nOne of the new features coming with iOS 17 is an improved Apple Maps experience, which includes the ability to download maps for offline use. This is particularly helpful when you're traveling in areas with little to no cellular service and still need navigation assistance.\nAlso: Apple Maps vs. Google Maps: iPhone users are switching back, but which is better?\nWhile Apple Maps may be irrelevant to you as an Android user, the concept of offline maps may sound appealing. Fortunately, not only do you have arguably the better map service in Google Maps, but the service also supports offline navigation.\nTo download a section of the map for offline viewing, tap on your profile icon > Offline maps > and then Select Your Own Map. You can shrink or expand the area that you'd like to download by pinching the proximity box in or out.\n3. Auto-deleting used verification codes\nOne of the many quietly-released features on iOS 17 was \"Clean Up Automatically,\" which auto-deletes multi-factor authentification (2FA) codes shortly after you've pasted them into a text field. It's a nifty trick that can clear up your phone's storage, little by little.\nAlso: iOS 17 makes iMessage group chats with Android users more bearable - sort of\nAnd guess what? Android's got it too. Within the Messages app, tap your profile picture > Messages settings > Message organization > and then toggle on Auto-delete OTPs after 24 hrs.\nOTPs, or one-time passwords, can clog up storage, especially when you consider how many apps and services now require you to copy and paste codes to log into accounts. Turning this feature on deletes those codes 24 hours after you've used them.\n4. StandBy Mode\nOne of the features that caught my eye at WWDC was StandBy Mode. When the iPhone is locked and docked on a MagSafe charger -- or just being charged and tilted in landscape orientation -- it displays useful, glanceable information like the time, weather, smart home status, and even Live Activities. The iPhone effectively doubles as a smart display.\nAlso: How to use StandBy Mode iOS 17 (and which iPhones support it)\nA similar feature exists on Android, though it's not as detailed. Setting a Google Pixel on a Pixel Stand (2nd Gen), for example, prompts a Google Photos carousal, smart home controls, and more.\nOn a Samsung Galaxy, you can set the always-on display to appear in landscape orientation and change the clock style to present your upcoming meetings and a calendar.\nAlso: How to turn your old Fire tablet into an Echo Show\nWhile Apple is playing catch-up here to Android's existing ambient display modes, you have to appreciate how much thought was put into StandBy, including how the phone will recognize which MagSafe puck you snap it to and adaptively populate the previously used overlay.\n5. Setting multiple timers\nFor the first time in forever, iPhone users can set multiple timers at once. This is especially useful, say, when you're cooking and managing multiple dishes.\nOn Android, the default Clock app also supports multiple timers. From the app, start a timer like normal and then tap on the plus icon underneath the active countdown. As a bonus tip, tap on the menu button on the upper right and turn on Screen saver to keep the timer on your lock screen."
    },
    {
      "url": "https://www.zdnet.com/article/best-magsafe-accessory/",
      "text": "The best MagSafe accessories you can buy for your iPhone\nWhy you can trust ZDNET\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nMagSafe technology may feel like magic, but it's really just the easiest way to add extra function to your mobile device. With gear like MagSafe batteries and MagSafe wallets that refine the mobile experience, it's easy to upgrade your phone's functionality without breaking the bank.\nThe market is flooded with smartphone accessories, and it's hard to know what is worth your cash. We simplified the process by testing numerous options ranging in product type, style, and price, so you can find the most useful MagSafe accessories. Some of the best MagSafe accessories right now are wallets, chargers, and grips.\nWhat are the best MagSafe accessories right now?\nWe rounded up some of the best, and our favorite, MagSafe accessories right now. Some of our picks are Anker's 3-1 MagGo Wireless Qi2 Charger and Casely's Grippy Mount. Read on for more top MagSafe accessories including battery packs, phone stands, car mounts, wallets, and SSDs.\nAlso: Every iPhone owner should use MagSafe -- I can't live without these 7 favorite accessories\nThe best MagSafe accessories of 2025\nIf you're a content creator or you just like to take photos and videos during solo outings, this MagSafe mount is a handy gadget to have in your MagSafe accessory repertoire. You can easily stick your phone to any clean, flat, and glossy surface and instantly create a mount for your iPhone. When I tested the Casely Grippy Mount, I was surprised by how strong the magnetic hold was, even when I stuck it to a cheap, over-the-door mirror. It's a nifty option for mounting your phone for streaming or for taking it out on solo endeavors to help shoot content hands-free.\nCustomers on Casely's website said that they liked the Grippy Mount's strong magnetic grip and hold, plus the ability to use their phone hands-free for photo, video, or entertainment purposes.\nCasely Grippy Mount features: Available in several colors | Compatible with iPhone 12 and newer, but requires MagSafe case | Fastens phone to any clean, flat, glossy surface like mirrors and windows | Allows for easy hands-free photo and video shooting, plus browsing\nAnker's MagGo 3-1 Wireless Charging Station for iPhone is still a wireless charging dream almost seven months after my initial purchase. It's also ZDNET's pick for best wireless charger. This device features 15W charging, offers a stand component for my iPhone, charges all of my Apple devices at once, and folds up for easy transport and storage. It also comes with a wall adapter, which isn't always a guarantee.\nAlso: I found a Qi2 charging station that can do it all (and Apple users will love it)\nI first purchased this Anker charger after ZDNET's Sabrina Ortiz tested it last year. I was looking for a safe and functional 3-in-1 charger that would cut down the number of cords I needed to pack while traveling. This is it. Unveiled at CES 2023, this 3-in-1 is truly worth your money if you own an Apple Watch and a pair of AirPods too and want a great charger for at home and on the go. Ortiz said that the charging speed on this charger is comparable to individual cords with respective wall adapters, even when charging simultaneously. \"Whether I was charging one device or three, I noticed that the devices were charging at a comparable speed to when I normally had them plugged into their respective wall chargers,\" she wrote in her review.\nI can concur based on my personal use. This stand charges up all of my devices quickly, and I love how easy it is to pack up to take on a trip. Even though this Anker charger is on the pricier side, costing $110, it's worth it thanks to its function and duality. It also frequently goes on sale. Compared to other options on the market, I think this 3-in-1 pick offers immense value because it can be used at home or on the go with ease, especially if you can grab it on sale.\nVerified Amazon customers give this Anker charger a 4.6 out of 5 stars and said they liked the compactness and convenience of this design as well as the easy-to-use setup, foldability, and magnetic strength. However, some customers said the simultaneous charging wasn't consistent.\nAuthor's Note: The Anker MagGo 3-1 charger in white is on sale for $82 (save $28) at Amazon upon the latest publication.\nAnker MagGo 3-1 Wireless Charging Station features: Compatibility: iPhone (any with MagSafe), Wireless Earbuds, Apple Watch | Color: White or Black | Foldable | Easy for travel | Comes with wall adapter\nThis Torras MiniMag Battery Pack is the thinnest wireless charger I've tested. It doesn't have any kickstand or added features, but its 5,000mAh capacity is pretty comparable to other packs. If you're buying a battery pack for the first time, I recommend this one. Thanks to its slim profile, you'll be able to use it realistically in more situations than not. If you're going to spend around $50 on a battery anyway, it might as well be one that is multifunctional.\nThe MiniMag pack is available typically under $50, and is only 0.3 inches thick, which makes it ultra slim and easily portable. It's a lot less bulky than other options, like the Belkin BoostCharge QI2, but it provides a similar charging experience. It provides 18W USB-C charging or 7.5W wireless charging as well.\nAlso: This ultra-thin battery pack I tested is a must-have travel gadget (and it works with MagSafe)\nDespite some possible improvement areas, like the pack being a bit slippery to hold and lacks grip, it's still a good buy. This probably isn't the best battery if you're looking for added features like kickstands or grips or larger capacity options. However, Torras does make a 10,000mAh version that's only 0.5 inches thick. The MiniMag is still a super practical option to ensure you always have a battery pack on hand. I was thoroughly happy with its performance along with the thin design. Despite its smaller stature, it does not compromise on charging or speed.\nTorras users on Amazon said that they liked the quick charging speed and lightweight profile. and slim design of the Torras MiniMag battery pack. However, some said the battery gets too hot.\nTorras MiniMag Wireless charger features: Slim profile and design | Two color options | Competitive charging | 5,000mAh battery capacity | Lightweight\nIf you shoot video from your point of view (POV) frequently, consider a MagSafe accessory that will amp up your functionality. This MagSafe neck mount from Telesin does just that. ZDNET's senior reviews editor Kerry Wan tried one out while covering the iPhone 16 launch and immediately purchased one.\n\"I recently got this POV MagSafe mount, and it's perfect for hands-free video shooting. Saw dozens of content creators at Apple Park using it a few weeks ago,\" he said.\nVerified Amazon customers said that they liked the easy and simple setup of the Telesin neck mount and said that they enjoyed using it to shoot video from their POV, or to just keep using their phone hands-free. One customer said she even enjoys using this neck mount to use her phone while walking her dogs.\nTelesin MagSafe Neck Mount features: Portrait and Landscape compatible | multi-functional shooting modes like landscape, portrait, overhead, and low angle, which allows you to play with a wide range of POV scenarios | Extended pole for viewing while shooting | Enhanced Dual-Ear and Strap for added stability | Dual-sided phone grip\nAfter getting my hands on the ESR Aura MagSafe wallet and stand, I was immediately obsessed. This wallet quickly shot to the top of my rotation and rightfully earned its spot as my favorite MagSafe wallet to date.\nWhile this wallet is very similar to others, the value it offers is amazing. You get a quality vegan leather wallet, strong magnetic hold, five card slots including a dedicated ID pocket, notches for easy card access, and five universal colors to pick from -- all for under $30 right now.\nAlso: I've tested dozens of MagSafe accessories, but this new wallet stand is my ideal iPhone companion\nWhen I tested this wallet, I was most impressed with how functional the dedicated ID slot is and how purposeful every element is. Each feature, like the notches that allow for easy card access, was thoughtfully designed and implemented and truly upgraded the accessory experience. Plus, ESR offers some of the most fun colors I have seen in a long time including pastel pink, purple and some universal neutrals.\nESR customers said they liked that the Aura wallet came in vibrant colors, as well as the strong magnet, dedicated ID slot, and ample storage it provides. Some customers said that it offers great value for the price, and it has a 5-star rating on ESR's website.\nESR Aura MagSafe wallet features: Multi-functional | Dimensions: 4.1 x 2.6 x 0.5 inches | Card capacity: Five cards (includes ID window)\nIf you don't need a larger capacity to store your favorite cards, cash, or other incidentals, a card holder is probably a better bet. While Moft markets their Snap-on Phone Stand and Wallet as a wallet, it's definitely more of a card holder. Based upon my own testing, I've only ever been able to fit two cards. Most of the time prefer to just use it for one important card, like my NJ Transit SmartLink card.\nThe $30 holder's design is sleek, minimalist, and it's available in a wide range of color options. While there's cheaper wallet options out there, this is fairly priced considering the dual function. You get the stand and card holder combo, plus the quality material and construction. Most other wallet options are often upwards of $35, so Moft has competitively priced a great MagSafe accessory.\nI have used this card holder countless times, and it is my favorite option when I am traveling with only one card. I find it easy to remove and insert cards from this wallet, but sometimes it can be tricky to quickly pull out two cards. This isn't a big deal unless you're rushing to make the train in the morning like me. Regardless, I have gifted this three times and think it's a great option to add to your MagSafe collection.\nMoft Snap on Phone Stand and Wallet features: Thin profile and design | Works in Floating, Portait, and Landscape modes | Compatible with other Moft accessories, like the MagSafe battery pack | Compatible with iPhone 12+ and MagSafe compatible phone cases\nThis product makes the biggest impact if you want to upgrade your at-home desk from drab to fab. The Journey Alti Ultra was my first time using a wireless charging desk mat. My world has seriously changed since testing this over the last several months. This mat is nearly the perfect size for my smaller standing desk with just a bit of overhang. It also upgrades the plain, plastic-like surface to a luxurious and cushioned space.\nThis mat provides the perfect base for my wireless mouse and keyboard. It doesn't slide or move around, which is key while using a walking pad and standing desk. It also features certified 15W MagSafe charging for my iPhone and AirPods Pro (second-generation). The charging pad is detachable from the desk mat as well, so I can use it separately. The double-layered, reversible mat with vegan leather creates a nifty spot to slip sticky notes, papers, or other incidentals. This mat upgraded my cheap standing desk into a functional workspace, keeping all my essentials easily handy, organized, and charged in one place.\nJourney customers gave the Alti wireless desk mat five stars on the Journey website. Customers said they liked the size, detachability, and sleek, luxurious look and feel of the Alti wireless mat. Several customers also said that this mat transformed their desk space, and one customer even called the Alti mat one of \"genius convenience.\"\nJourney Alti Ultra Desk Mat features: Built-in MagSafe charger | Built-in charging pad | Luxury feel | Charging station detaches from mat portion | Double layered design for safekeeping notes or papers\nWhat is the best MagSafe accessory?\nOur favorite MagSafe accessories off style, function, and added features like kickstands. Maybe you're looking for a battery pack to boost your phone or a handy place to store your metro card. We've got you covered with top-tested accessory picks from brands like Casely, Belkin, and Moft.\n| MagSafe accessory | Price* | Type |\n| Casely MagSafe Grippy Mount | $15 | Grippy mount for photo and video opportunities. |\n| Anker MagGo 3-1 Wireless Charging Station | $110 | 3-in-1 MagSafe Wireless charging dock. |\n| Torras Slim MiniMag Battery Pack | $43 | Slim and portable MagSafe battery pack. |\n| Telesin MagSafe Neck Mount | $38 | MagSafe neck mount designed for video shooting. |\n| ESR Aura MagSafe Wallet and Stand | $24 | MagSafe wallet for card and cash storage. |\n| Moft Snap on Phone Stand and Wallet | $30 | MagSafe card holder and stand combo. |\n| Journey Alti Ultra Desk Mat | $170 | Desk mat with MagSafe charging. |\n*MSRP at the time of publication\nWhich MagSafe accessory is right for you?\nAny of the MagSafe accessories on this list are great picks -- it just depends on what you are looking for, the price you are willing to spend, and what devices you currently have.\n| Choose this MagSafe accessory... | If you want... |\n| Casely MagSafe Grippy Mount | A MagSafe content creation tool. |\n| Anker MagGo 3-1 Wireless Charging Station | A seamless way to charge your devices, without all the wires. |\n| Torras Slim MiniMag Battery Pack | An easy way to boost your phone on-the-go. |\n| Telesin MagSafe Neck Mount | A hands-free option to easily record video. |\n| ESR Aura MagSafe Wallet and Stand | Affordable MagSafe storage for cards and cash. |\n| Moft Snap on Phone Stand and Wallet | A minimalistic, MagSafe card holder option. |\n| Journey Alti Ultra Desk Mat | A practical desk mat with charging capabilities. |\nFactors to consider when choosing a MagSafe accessory:\nAs someone who regularly tests MagSafe accessories and gear, these are the three most critical things to keep in mind while you shop, both to ensure you nab the best products and avoid spending your cash on useless junk.\n- Compatibility: This is the most important factor to keep in mind. Make sure that your iPhone is compatible with the accessory you are looking to purchase and that you keep an eye out for other requirements, often hidden in the fine print, like needing a MagSafe phone case. If you're not an iPhone user, be sure to find options to make your device MagSafe compatible, and again, watch for compatibility when checking out. Always read full product descriptions before you add to your cart, trust me.\n- Price: Probably the most obvious thing to keep in mind is the cost. MagSafe accessories can be really handy and helpful, but only if they're within your budget or worth the long-term investment. Otherwise, they may be an unnecessary expense or something that winds up sitting in a drawer for several years before being tossed out. Try to keep a reasonable budget for yourself when shopping, and remember that the best products aren't always the most expensive items on the market, and it's always a good idea to check out sale events.\n- Use case: This ties into the bullet above, but keeping your use case in mind while shopping for MagSafe gear is critical to avoid buying junk that you throw out or give away down the line. For something to be worth the money you spend on it, it has to bring added value and fix a current problem you're experiencing with your phone. If you only need a card holder to store your transit card, you don't necessarily need to splash out on a pricier wallet option that holds more cards and cash. Try to stay reasonable with yourself to avoid spending unnecessary cash and contributing to more tech waste.\nHow did we choose these MagSafe accessories?\nZDNET only recommends products we ourselves have used or researched extensively so we can speak to each product's value, function, and overall user experience. While rounding up this list of MagSafe accessories, of which, we've tested every product included, here's a few things we kept in mind to guide our selections accordingly.\n- Functionality: From laptop stands to car mounts, there's a diversity of MagSafe use cases on this list. We considered user experience and overall functionality in each product we spotlighted. Keep in mind that we've gone hands-on with many other MagSafe accessories like wallets, chargers, and battery packs, and you can check out our full, in-depth best of lists if you're looking for a few more options.\n- Price: Accessorizing your mobile device is a lot like customizing a purse or a bedroom. You have essential items like cases and chargers, as well as nonessential add-ons like grips, stands, mounts, and more. The beauty of accessorizing is you can take it as little or as far as you'd like and spend as little or as much as you're comfortable with. While most accessories remain under the $100 mark, there are several items like MagSafe charging stations that can easily push over that limit. We made sure to consider numerous types of accessories across varying price points and their overall value compared to what you'll pay. We think every item on this list is worth the money if it's the type of product you're looking for, but ultimately, the total cost spent on accessorizing with MagSafe is up to you.\n- Best List picks: The accessory options included in this list are certainly not the only options available on the market and are definitely not the only MagSafe accessories that we've tried. Since ZDNET has already extensively tested many MagSafe accessories across several categories, including MagSafe wallets, battery packs, wireless chargers, and more, we considered the top-ranking picks selected for those lists to ensure congruency on our site and to maintain the authority in our picks.\nFAQs on MagSafe accessories\nWhat is MagSafe?\nMagSafe was originally developed as a safety feature for MacBook charging cords, but it's now built into iPhone 12, 13, 14, 15, and 16 models for use with a range of accessories.\nThe system uses a series of magnets around the iPhone's internal charging coil that sense other compatible devices and hold them securely. The magnets are specifically designed for the MagSafe system to protect your iPhone from damage.\nWhich iPhone models have MagSafe?\nThe majority of recent iPhone models on the market including the iPhone 14, iPhone 15, and iPhone 16 feature MagSafe charging. Some charging cases for Apple's AirPods, such as the latest AirPods Pro, also have MagSafe built in. The newest iPhone 16e is not MagSafe compatible.\nAlso: Every iPhone 16 model compared: Which new iPhone should you buy?\nIs MagSafe the same as Qi?\nThe two systems work on the same wireless charging principles, but the key difference is that Qi chargers don't use magnets for alignment. Qi chargers need a near-perfect alignment for optimal speeds. The MagSafe system eliminates the hassle of positioning and repositioning your devices on the charger by using magnets to properly align the charging puck and iPhone's internal charging coils, giving you consistent, fast charging every time.\nIs MagSafe charging better than cable charging?\nIt's a personal preference. Both cable charging and wireless charging boost your phone effectively. But with a cable, you must ensure you're near an outlet or alternative power source when recharging your phone.\nWith MagSafe, you can experience wire-free charging at home and even purchase a battery pack for power on the go. So, if you're a mobile a lot, we recommend a MagSafe battery pack to keep your iPhone charged while you travel. For certain situations or environments, a cable may be preferred.\nWhy should I bother with MagSafe accessories?\nMagSafe capabilities can enhance your user experience and your iPhone's functionality. Besides creating simpler, more efficient wireless charging, MagSafe technology opens the door for various accessories such as wallets, car vent clips and mounts, fitness mounts, power banks, grips and key ring accessories, and more to widen the iPhone experience and make your life as efficient as possible.\nAre there alternative MagSafe accessories to consider?\nThe market is flooded with MagSafe accessory options. Check out a few other picks we'd recommend below.\nBest MagSafe expandable wallet accessory\nOhsnap Snap Grip Wallet\nThe Ohsnap Snap Grip Wallet is a MagSafe expandable wallet. It's super sleek, comes in several colors, and includes a built-in grip and stand. I love it for its premium look and lightweight feel, but keep in mind you will have to remove this off the back of your device in order to access your cards.\nAlso: I've tested dozens of MagSafe wallets, but this is the most premium one yet\nBest travel 3-in-1 MagSafe charger\nAnker MagGo 3-in-1 Wireless Foldable Charger\nIf you're looking for the ultimate travel charger, I love this 3-in-1 option from Anker. It's great for travel and at-home use, lightweight, and folds up easily. Plus, it comes in four colors.\nAlso: My new favorite travel accessory is a 3-in-1 MagSafe charger that's smaller than a cookie\nBest MagSafe car mount and charger\nESR Qi2 15W MagSafe Wireless Car Charger and Mount\nIf you're looking for a home for your phone in the car, ESR's MagSafe mount keeps your cell in one spot, makes a great road trip companion, and offers Qi2 15W charging, so you'll never be without a battery.\nAlso: Finally, an iPhone car mount with Qi2 charging and won't break the bank"
    },
    {
      "url": "https://www.zdnet.com/article/iphone-overheating-do-this-first-to-prevent-damaging-the-battery/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\niPhone overheating? Here are 8 potential causes and their solutions\nI've heard from several readers who are concerned that the latest iOS release -- iOS 16.5 -- has turned their iPhones into portable pocket warmers.\nAnd it's not just a little bit warm.\nAlso: Here's every iPhone model that will get Apple's iOS 17\nThese iPhones become physically hot to the touch and the battery depletes in a few hours with little to no usage.\nAnd it seems pretty widespread, with a lot of chatter about it on social media and on Apple's own support forum.\nAn overheating iPhone -- or for that matter any device, especially if that device contains a rechargeable battery -- is no joke. Prolonged high temperatures can cause glitches and crashes, damage internal components, drain the battery and permanently shorten the battery lifespan.\nThis is something you need to get on top of.\nAlso: 5 useful iOS 17 features Apple quietly released at WWDC 2023\nSeveral things can cause your iPhone to overheat. Here they are, along with things that you can do to mitigate these issues:\n1. Excessive usage\nIf you are using your iPhone for heavy processing tasks like playing high-end games, streaming, using graphics-intensive applications, or recording videos for an extended period, this can cause your phone to overheat.\nSolution: Slow down on your iPhone usage.\n2. Software updates\nA lot goes on during and after installing an update, and tasks such as reindexing photos can consume a lot of processing power, which in turn can temporarily cause the device to heat up. Things should return to normal within a few days of installing an update.\nAlso: How to update every Apple device (iPhone, iPad, Apple Watch, more)\nSolution: Wait for the iPhone to finish its background tasks. If problems persist then it's likely a bug in the update and the solution is going to have to come from Apple in the form of another update.\n3. Malfunctioning apps\nIt is not unusual for apps to have bugs or issues that cause them to use more power than necessary. This could result in the phone overheating, even when not directly using the app.\nSolution: I've outlined how to look for and disable a malfunctioning app here.\n4. Poor signal or heavy data use\nIf you're in a location with poor signal, your iPhone has to work harder to maintain a connection, which can cause it to overheat. Similarly, continuous data use, like streaming videos, downloading large files, or creating/restoring from backups can also cause overheating.\nSolution: Move to a spot with a better signal. Choose lower resolution streaming options -- for example, 1080HD as opposed to 4K -- where possible.\n5. Charging issues\nUsing your iPhone while it's charging, or charging it with a non-Apple charger that doesn't comply with Apple's safety standards, can cause it to overheat. Wireless charging causes more heat to be produced than using a cable.\nAlso: Best lightning cables to charge your iPhone\nSolution: Use a quality charger and cable. Switch to a lower-power charger. Remove the phone case if you use one. Use a wireless charger with built-in cooling or avoid wireless charging.\n6. Physical environment\nExtreme environmental temperatures, both hot and cold, can cause an iPhone to overheat. Apple advises avoiding the use of the device when temperatures are outside of the range of 0 to 35 degrees Celsius (32 to 95 degrees Fahrenheit).\nLeaving your iPhone in a car is particularly problematic because the car's interior can easily exceed this range when left in the hot sun.\nSolution: Do your best to keep the iPhone within its operating temperatures of 0 to 35 degrees Celsius (32 to 95 degrees Fahrenheit).\n7. Phone cases\niPhones dissipate the heat into their surroundings through the back shell, and putting a case over the iPhone can interfere with this heat dissipation.\nSolution: Remove the iPhone from the case.\n8. Damaged battery\nOver time, batteries can degrade or even become damaged. If your battery is swollen or damaged, it can cause overheating.\nSolution: Get the battery serviced by Apple or a qualified third-party repairer.\nBottom line\nOne of the most rapid ways to cool down an iPhone is to turn it off completely and let it come down to normal temperature naturally. Don't try to \"speed up\" the process by putting the iPhone into a refrigerator or ice box as this could also damage the battery."
    },
    {
      "url": "https://www.zdnet.com/article/what-is-liquid-glass-heres-everything-we-know-about-apples-major-ui-overhaul-at-wwdc/",
      "text": "What is Liquid Glass? Here's everything we know about Apple's major UI overhaul at WWDC\nWWDC 2025 is underway, and Apple has unveiled a new year-based naming convention for its iPhone operating system: what would have been iOS 19 is now officially iOS 26, since 2026 will be the year most people are running the software. Alongside this change, Apple introduced a sweeping visual overhaul dubbed Liquid Glass (previously rumored under the internal codename \"Solarium\").\nAlso: Apple's secret sauce is exactly what AI is missing\nLiquid Glass brings a glass-inspired aesthetic not only to iOS 26 but to all of Apple's platforms. While on stage at WWDC, the company pitched it as a unified design language coming to the iPhone, iPad, Apple Watch, Mac, Vision Pro, and Apple TV.\nWhat is Liquid Glass?\nLiquid Glass is Apple's biggest design update since iOS 7 -- which famously ditched skeuomorphic features in favor of a flat look. Apple said Liquid Glass layers semitransparent \"glass\" materials throughout iOS 26, iPadOS 26, MacOS 15, WatchOS 10, TVOS 16, and VisionOS 4. This translucent look can refract and reflect whatever's behind it and adapt its tint for both light and dark modes.\nAlso: How to install iOS 26 on your iPhone (and which models support it)\nWhat's new in Liquid Glass?\nRumors had hinted that Apple's next UI overhaul would introduce glass-like translucency. At WWDC 2025, those whispers became reality with the unveiling of Liquid Glass, a unified, cross-platform design language. Apple demonstrated how Liquid Glass adds consistent depth, translucency, and motion-responsive effects across its entire device lineup.\nAlso: Your entire iPhone screen is now searchable with new Visual Intelligence features\nFor instance, on the iPhone's Lock Screen, the time numerals can now \"nestle\" into your wallpaper and pick up its colors. Meanwhile, in MacOS 15, the Dock and menu bar can go fully transparent or take on tinted or clear looks that let your wallpaper, widgets, and icons shine. And across apps like Safari, Apple Music, News, and Podcasts, tab bars float in a frosted-glass layer -- shrinking when you scroll down to put content front and center and re-expanding when you scroll back up.\n- Glass reflections: A new translucent material refracts its surroundings, adapts its tint for light or dark modes, and reacts with specular highlights.\n- App icons: New squircle glyphs sit beneath transparent surfaces that bend wallpaper colors and animate subtly with a tap.\n- Widgets: Glass panels let your background peek through, cast gentle shadows, and animate ever so slightly.\n- Navigation bars: In iOS 26, tab bars shrink on scroll-down and re-expand on scroll-up; on iPadOS and MacOS, sidebars refract whatever's behind them to keep context.\n- Panels and menus: Control Center, Notification Center, and sidebars sport a frosted look, with sliders, buttons, and sheets floating above content.\n- Toolbars: In Safari and similar apps, toolbars turn semi-transparent and resize fluidly as you scroll.\n- Developer APIs: A new set of Liquid Glass materials and components is available to third-party developers, enabling apps easily to adopt the same translucency and motion-responsive effects.\nAlso: Apple will bring any photo on the iPhone to life with 3D spatial effects\nWhich platforms get Liquid Glass?\nApple confirmed that Liquid Glass spans its entire software lineup:\n- iOS 26, iPadOS 26, and MacOS 15: All system panels (Control Center, notifications, etc.), toolbars, sidebars, windows, app icons, and widgets now use Liquid Glass materials -- complete with translucent frosted layers, rounded corners that mirror device bezels, and floating controls that morph and recede to keep content front and center.\n- WatchOS 10: Every UI element -- from notifications to watch-face complications -- now uses Liquid Glass, improving legibility and visual harmony with rounded corners and translucent menus.\n- TVOS 16: The Apple TV Home Screen and app pages feature frosted backdrops behind app tiles, while the top-bar navigation and action overlays adopt the same translucent Liquid Glass styling for a cohesive look with Apple's other platforms.\n- VisionOS 4: Builds on its spatial-computing roots by refining its floating windows and 3D iconography to match the new Liquid Glass style, unifying headset and handheld experiences.\nRelease schedule\nAs with previous years, developer and public betas of iOS 26, iPadOS 26, and the rest will roll out over the summer, with final public releases and new hardware arriving around September 2025.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/you-can-download-ios-26-beta-on-your-iphone-now-how-to-install-and-which-models-support-it/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nYou can download iOS 26 beta on your iPhone now. How to install (and which models support it)\nApple announced some significant changes to its iPhone operating system with iOS 26 during WWDC 2025 in June. Instead of launching iOS 19 consecutively to the current iOS 18, Apple rebranded its OS versions to match the year when users will use them the most. In this case, iOS 26 will launch for general availability in the fall, though most feature updates will roll out through 2026.\nBut even if the general release of iOS 26 is still at least a month away, you can officially download the public beta version right now. Apple released the developer beta of iOS 26 in June, so the company's already refined and tweaked some of the biggest bugs in the new operating system. This makes iOS 26 ready to launch into its public beta phase.\nAlso: We tested iOS 26 on the iPhone 16 Pro - these 5 features make the update worthwhile\nBefore installing any beta software versions, be sure to back up your device, avoid using your primary iPhone, and remember that pre-release software can contain bugs and glitches.\nHow to install the iOS 26 public beta version\nWhat you need: A compatible iPhone running iOS 16.5 or later. Since not all iPhones support iOS 26, you'll also need a model newer than iPhone 11.\n1. Access General in your iPhone Settings\nGo to your iPhone's Settings and select General.\nAlso: Five 'new' iOS 26 features that feel familiar (I've been using them on Android for years)\n2. Go to Software Update in Settings\nWithin General, tap on Software Update. Your iPhone's Software Updates feature must be updated to automatically receive beta updates and beta versions of iOS.\n3. Enable Beta Updates\nGo to Beta Updates to enable it and select the iOS version you'd like to access. This setting is turned off by default on iPhones.\n4. Select iOS 26 Public Beta\nSelect iOS 26 Public Beta to begin receiving automatic software updates to the latest beta version of iOS 26.\nOnce you do this, return to the previous page. If an update is available now, your iPhone will prompt you to download and install it.\nFAQs\nWhen will iOS 26 be released?\nThe iOS 26 public beta is available now. The developer beta was released during WWDC in June 2025. If Apple follows its usual cadence, the final, general release of iOS 26 should arrive in September 2025.\nHow to download the iOS 26 developer beta?\nTo download the iOS 26 developer beta version, navigate to your settings to install the iOS 26 developer beta if your device runs iOS 16.5 and is used with an Apple ID enrolled in the Apple Developer Program:\n- Go to your iPhone Settings\n- Tap on General\n- Select Software Update\n- Go to Beta Updates\n- Choose the iOS 26 Developer Beta\nIf you can't see this option, go to your Settings, select Privacy & Security, and enable Developer Mode.\nIf you aren't already a member of the Apple Developer Program, you can sign up to become one in the app. An annual membership costs $99, but you don't need one to try the developer beta.\nWhich iPhones are compatible with iOS 26?\nApple removed the iPhone XR and XS from its list of supported devices with iOS 26, so any iPhone 11 or newer is compatible with the new operating system, including the iPhone SE.\nAlso: Every iPhone model that can be updated to iOS 26 (and which ones don't support it)\nWhat to do before installing the iOS 26 public beta?\nYou can always join the Apple Beta program to get the latest beta versions of iOS. Before you download a beta version of an operating system, keep these housekeeping items in mind:\n- Back up your device and personal information.\n- Don't download beta software, which will likely have bugs and glitches, on your everyday iPhone.\n- Beta versions are released so you can test new features and share feedback to improve iOS.\nHow to submit beta feedback to Apple\nThe iOS 26 public beta comes with its own built-in Feedback Assistant app, which you can open from the Home screen. If you encounter something that doesn't work, or you have feedback on any part of the new OS, you can communicate directly with Apple via that app.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/apples-ios-26-and-ipados-26-public-betas-are-here-how-to-access-and-why-youll-want-to/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nApple's iOS 26 and iPadOS 26 public betas are here: How to access and why you'll want to\nApple held its Worldwide Developers Conference a month ago, during which it previewed the latest operating system upgrades across all of its devices, including iOS, iPadOS, MacOS, TVOS, WatchOS, and more. These updates give Apple users, regardless of whether they have the latest hardware, the opportunity to have a device refresh -- and this year, perhaps more than ever.\nDuring the event, Apple launched Liquid Glass, a new look for all of its devices that embodies a glass-inspired aesthetic and is the biggest redesign in 13 years. It also introduced a handful of exciting features, from the viral AutoMix feature for Apple Music to the Apple Shortcuts AI makeover.\nAlso: How to clear your iPhone cache (and why it greatly improves the performance)\nAlthough the official launch of Apple's latest operating systems won't happen until the fall with the introduction of the latest iPhone lineup, here's what you need to know about the public betas, which were just released and give you a preview of all of the latest features.\nWhen will iOS 26 public beta release?\nThe iOS 26 public beta was released on Thursday, July 24. You can download the public betas across the Apple ecosystem now.\nHow can I try Apple's public betas?\nTo enroll, all you have to do is visit the Apple Beta Software Program site and click the blue sign-up button. The Apple Beta Software Program is free and open to anyone with an Apple Account who accepts the Apple Beta Software Program Agreement.\nAlso: How to download the iOS 26 beta on your iPhone right now (and which models support it)\nOnce you enroll and the public beta is available, you'll go to Settings > General > Software Update > Beta Updates and click on iOS 26 Public Beta. It is worth highlighting that the betas are called betas for a reason -- they are not the final product and can come with bugs that can hurt your device's performance by slowing it down and draining battery. Apple recommends downloading the beta on a device that is not your primary device and backing up all your information before you install it.\nWhich devices are getting a public beta?\nThe public betas are available across the entire Apple ecosystem of devices, including iOS 26, iPadOS 26, MacOS Tahoe 26, TVOS 26, HomePod software 26, WatchOS 26, HomePod Software 26, and AirPods Firmware.\nAlso: Every iPhone model getting iOS 26 (and which ones don't support it)\nThe devices eligible for the beta include:\n- iOS 26: iPhone 16e, iPhone 16, iPhone 16 Plus, iPhone 16 Pro, iPhone 16 Pro Max, iPhone 15, iPhone 15 Plus, iPhone 15 Pro, iPhone 15 Pro Max, iPhone 14, iPhone 14 Plus, iPhone 14 Pro, iPhone 14 Pro Max, iPhone 13, iPhone 13 mini, iPhone 13 Pro, iPhone 13 Pro Max, iPhone 12, iPhone 12 mini, iPhone 12 Pro, iPhone 12 Pro Max, iPhone 11, iPhone 11 Pro, iPhone 11 Pro Max, iPhone SE (2nd generation and later)\n- iPadOS 26: iPad Pro (M4), iPad Pro 12.9‑inch (3rd generation and later), iPad Pro 11‑inch (1st generation and later), iPad Air (M3), iPad Air (M2), iPad Air (3rd generation and later), iPad (A16), iPad (8th generation and later), iPad mini (A17 Pro), iPad mini (5th generation and later)\n- MacOS Tahoe 26: MacBook Air with Apple silicon (2020 and later), MacBook Pro with Apple silicon (2020 and later), MacBook Pro (16‑inch, 2019), MacBook Pro (13‑inch, 2020, Four Thunderbolt 3 ports), iMac (2020 and later), Mac mini (2020 and later), Mac Studio (2022 and later), Mac Pro (2019 and later)\n- WatchOS 26: Apple Watch SE (2nd generation), Apple Watch Series 6, Apple Watch Series 7, Apple Watch Series 8, Apple Watch Series 9, Apple Watch Series 10, Apple Watch Ultra, Apple Watch Ultra 2\n- AirPods Firmware: AirPods Pro 2, AirPods 4 (with and without ANC)\nWhat new features can you expect?\nApple announced a slew of new features across every single device in its ecosystem, and you can read more about all of the announcements in ZDNET's event roundup.\nHowever, here's an overview of the biggest announcements:\niOS 26\nThe new Liquid Glass design is one of the biggest upgrades coming to all devices with the iOS 26 refresh. It is a really exciting upgrade to be on the lookout for because it will make your phone feel and look brand new. It is a whole new aesthetic, making everything from your home screen to apps to settings look different. It also mimics real-life physics, reacting to how you tap, swipe, and even hold your phone.\nAlso: 7 AI features coming to iOS 26 that I can't wait to use (and how you can try them)\nThe new AutoMix feature is also available. This is an on-command, AI-powered DJ that transitions songs almost as well as a professional, matching the key and tempo of the music. A less fun, but extremely necessary upgrade is a cleaner camera app redesign, which removes the clutter and confusion of the current one with the addition of Library and Collections tabs.\nPhone calls and text messaging are also getting upgrades, including a new screen-calling feature, which can detect spam for you; Hold Assist, which can let you know when you are off hold and an agent is actually ready to help you; and FaceTime and text-message AI-powered live translation, to name a few.\niPad OS 26\niPadOS will also have the aforementioned Liquid Glass, Live translations in Messages, FaceTime, and Calls, AutoMix, and Call Screening. The biggest win for iPad users is the new windowing system, which lets users resize web pages and apps similar to how you would on a laptop. This is huge for power users as you can now work with multiple windows and tabs at once, making it much easier to multitask.\nAlso: iPadOS 26 is turning my iPad Air into the ultraportable laptop it was meant to be\nMacOS Tahoe 26\nIn addition to the features above that are coming to both iOS 26 and iPad OS 26, MacOS is also getting Live Activities from iPhone on Mac. This will allow users to sync activities directly with their iPhones, providing access to recent calls and contacts, making the handoff between devices more seamless.\nAlso: Your MacBook is getting a big upgrade for free. 5 features I can't wait to try on MacOS 26\nWatchOS 26\nThe new Workout Buddy feature was one of the standouts of WatchOS. It is an AI-powered feature that uses your actual fitness data history, which it has collected over time, to provide real-time insights while you work out. For example, as you are running, it can give you words of encouragement or insights on how you are performing compared to previous times.\nAlso: Big upgrades are coming to your Apple Watch - 8 features I can't wait to use on WatchOS 26\nAirPods firmware\niOS 26 brings two features to AirPods with Apple's advanced H2 audio chip. With the update, your AirPods Pro 2 or AirPods 4 can control your device's camera shutter via the Camera app for a compatible third-party camera app. Additionally, iOS 26 will improve the audio quality of the AirPods Pro 2 and AirPods 4, introducing studio-quality audio for voice recordings.\nAlso: Your AirPods are getting 2 major upgrades for free thanks to iOS 26 - here's what they are\nAirPods updates are folded into iOS updates on your iPhone. Once you update your phone, any new AirPods features within it should become available, provided your iPhone is compatible with the latest iOS version and your AirPods are compatible with those features.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.\nYou can keep up with my latest stories and tech adventures on social media. Follow me on Twitter/X at @sabrinaa_ortiz and on Instagram at @sabrinaa.ortiz."
    },
    {
      "url": "https://www.zdnet.com/article/5-useful-ios-17-features-apple-quietly-released-at-wwdc-2023/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\n5 useful iOS 17 features Apple quietly released at WWDC 2023\nHas it really been weeks already? Apple, during its early-June developer conference, spent a little over two hours debuting its first-ever augmented reality headset, the Vision Pro, reinforcing its silicon kingdom with new Macs, and, as is tradition with WWDC, unveiling a slew of software features coming to an iPhone, iPad, Apple Watch, and Mac near you.\nAlso: Apple no longer requires a $99 account to access developer betas. Here's the breakdown\nBut when you're cramming a near decade's worth of research and development into an afternoon keynote, there's bound to be some information that doesn't make the live cut, pieces of technological goodness that only enthusiasts, developers, and possibly journalists who want to write an \"X features Apple quietly released\" blog post can discover. And so I did.\nBelow are five new features present in the first developer beta of iOS 17 that you'll want to keep an eye out for come the official release in fall.\nAnd, trust me, you'll wish these features existed already.\n1. Interactive widgets\nEver seen a widget on your home screen and wish you could just tap, swipe, and interact with it without it expanding into the full-screen version?\nAt WWDC, Apple introduced interactive widgets for the iPad, but it turns out the feature will also be available on the iPhone, giving users more finite access to functions like playing and pausing music, checking off boxes in the Reminders tile, and turning on or off smart home appliances directly from the home screen.\nAlso: Every product Apple announced at WWDC: Vision Pro headset, Mac Pro, more\nInteractive widgets seem like a natural evolution from resizable widgets, first introduced with iOS 14 in 2020. For now, app support for the feature includes first-party services like Reminders, Apple Music, and Home, and some third-party ones like Quizlet. Expect greater compatibility by the time iOS 17 progresses through its beta phase.\n2. Autofill verification codes in Mail\nWith the growing adoption of multi-factor authentication (2FA), the need to streamline how the iPhone receives and inputs verification codes is apparent. Apple's already integrated autofill with incoming text messages, and the most logical next step is to expand the feature to emails, too.\nAlso: How to enable 2FA to step up your security\nIn iOS 17, verification codes sent via the Mail app will also be auto-filled in 2FA prompts, making it more efficient for users to quickly confirm sign-in attempts. Previously, you'd have to open up the mail separately, copy the code, and paste it into the verification text field.\n3. Auto deleting used verification codes\nNot to be mistaken with the last feature, \"Clean Up Automatically\" tells the iPhone to automatically delete verification codes in Messages or Mail that were used in AutoFill. The new feature is tucked within the Password Options of iOS 17 and may as well be another one that you wish existed sooner.\nAlso: Apple makes contact sharing easier in iOS 17 with NameDrop\n4. Video Effects in third-party apps\nIt's arguable that iPhones have superior camera experiences on third-party apps (Instagram, Snapchat, TikTok, etc.) compared to Android, but the new Video Effects feature helps widens the gap for iOS.\nAlso: Standby on iOS 17 turns your iPhone into a smart display - and I have questions\nWith a third-party camera app open, a swipe down into the Control Center now presents you with a Video Effects toggle. Within, you're able to set a studio lighting effect, portrait blur, and even AR reactions on top of what's being recorded by the background app.\nBy applying a filter built natively on the iPhone, the effects appear more natural than those computed by third-party services.\n5. Private browsing with Face ID\nPrivate Browsing (Safari's incognito mode) lets users surf the web without the worry of trackers, logging a browser history, and leaking sensitive information to a public device. In iOS 17, a new security feature comes in the form of locking your Private Browsing sessions via Face ID.\nTraditionally, if your phone is unlocked, anyone who has access to it can look at your browsing activities, even if it's in Private Browsing. In the latest iOS version, you'll now be able to secure your Safari activities with a Face ID scan or a passcode."
    },
    {
      "url": "https://www.zdnet.com/article/ios-17-your-iphones-wallet-app-is-getting-two-big-updates-here-they-are/",
      "text": "Your iPhone's Wallet app is getting two big iOS 17 updates. Here they are\nApple on Wednesday highlighted more of the software features coming to the iPhone, iPad, and Apple Watch later this year. Apple didn't spend as much time detailing features and software updates for its major hardware platforms as it has done in the past, because it spent a lot of the keynote talking about Vision Pro, its new mixed-reality headset.\nAlso: 5 useful iOS 17 features Apple quietly released at WWDC 2023\nThere's a lot of information in the latest press release, including more details about updates to Workouts on the Apple Watch and its Fitness+ service, along with the option to download geographical areas in Apple Maps for offline use.\nApple also highlighted two changes coming to the Wallet app for iPhone users. The first new feature is the ability to schedule Apple Cash payments to other Apple Cash users. When I read about this, I immediately thought about the ability to automate paying my kids their allowance for chores -- something I frequently forget to do.\nBut the second feature Apple announced for the Wallet app has me very intrigued. With the release of iOS 17, iPhone users who have their ID or Driver's License added to the Wallet app will be able to use it to verify their personal information, including age, at businesses.\nThink of it as tap-to-pay, but to verify who you are. Apple says it can be used in situations when you need to verify your age, like when buying alcohol, or during checkout at places, like a car rental business, to verify your identity.\nAlso: Every hardware product Apple announced at WWDC\nI still get carded (yes, that's a humble brag) when buying beer, and showing my physical ID isn't a huge hassle. But it's one more step in the checkout process. Streamlining the interaction to tapping my phone twice on the payment terminal, once to verify my age, and the second for payment, would make the entire interaction seamless.\nWhen the feature is used, you'll need to hold your iPhone near the business's iPhone (hopefully this expands to all POS systems). You'll see a prompt letting you know what information the business is requesting, which you can then authorize to be shared using Touch ID or Face ID.\nThe biggest hurdle I can currently see the new ID feature having to overcome is the fact that currently there are only four states in the U.S. that support adding an ID or driver's license to the Wallet app. Those states are Arizona, Colorado, Georgia, and Maryland.\nAlso: Here's every iPhone that will get Apple's iOS 17\nThe feature will technically work with any mobile ID that meets the ISO 18013–5 mDL standard. However, I spent a few minutes searching to see if there were any additional IDs that qualified, and I couldn't find any."
    },
    {
      "url": "https://www.zdnet.com/article/apple-finally-added-my-most-requested-iphone-feature-with-ios-26-and-youll-love-it-too/",
      "text": "Apple finally added my most-requested iPhone feature with iOS 26 (and you'll love it, too)\nLast year, Apple announced a redesigned Photos app, touting it as \"the biggest-ever redesign.\" Over the past year, we've seen users complaining about the redesign and wanting to go back to iOS 17's Photos app. Apple seems to have listened to all the feedback and fixed its Photos app with the new iOS 26 update.\nAlso: Everything announced at Apple's WWDC 2025 keynote: Liquid Glass, MacOS Tahoe, and more\n\"Many of you missed using tabs in the Photos app,\" said Craig Federighi, Apple's Senior Vice President of Software Engineering, in his keynote at WWDC 2025. \"Photos now features separate tabs for Library and for Collections,\" he added. With the new Photos app on iOS 26, Apple is keeping the best of both iOS 17 and iOS 18.\nThe Photos app redesign I've waited for is finally here\niOS 26's Photos app aims to fix all the major issues by bifurcating the UI into Library and Collections. When you open the Photos app, you enter the Library section, which gives you the whole screen to view your media instead of a 60:40 divide of media and Collections.\nThe Library tab makes it easier to scroll through recent photos without tapping on a collection by mistake. It also looks neater. Moving to the other tab will lead you to the collection of Memories, People, Pinned, etc.\nI look forward to using the cleaner design, which should help my muscle memory. The segregation of Library and Collections is all I've wanted from the iOS 18 Photos app, and it is finally here.\nLong-time Apple users will welcome the new Photos app design in iOS 26. This time, however, they will have to train their muscle memory for another photo-related app redesign: the Camera app. Apple's Camera app now has a viewfinder that displays two options: Videos and Photos.\nAlso, iOS 26 will bring any photo on your iPhone to life with 3D spatial effects\nYou can swipe left or right to access other modes, such as Portrait, Panorama, Cinematic, and more. Swiping up from the bottom of the screen will reveal other settings, such as flash and timer.\nFrom the keynote demos, it looked pretty straightforward and less taxing than iOS 18's Photos app. I expect this Camera redesign to help me reach my settings faster and feel more natural than before. That said, I'm more excited about using the basic-looking Photos app on my iPhone."
    }
  ],
  "argos_summary": "Apple is preparing for the release of iOS 26, expected in September, with a public beta already available for users. Key features include a new Liquid Glass design for a more translucent interface, an improved camera app for easier access to settings, and a revamped Photos app that separates Library and Collections for better navigation. Additionally, the Phone app will now allow users to screen unknown calls by asking the caller for their reason, and users can manage default apps more easily.",
  "argos_id": "ADUQ112K9"
}