{
  "url": "https://seekingalpha.com/article/4810301-dht-holdings-inc-dht-q2-2025-earnings-call-transcript",
  "authorsByline": "SA Transcripts",
  "articleId": "9ec026fedc5e49178061738704ad3293",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T14:04:09+00:00",
  "addDate": "2025-08-07T14:07:10.427477+00:00",
  "refreshDate": "2025-08-07T14:07:10.427480+00:00",
  "score": 1.0,
  "title": "DHT Holdings, Inc. (DHT) Q2 2025 Earnings Call Transcript",
  "description": "DHT Holdings, Inc. (NYSE:DHT) Q2 2025 Earnings Call August 7, 2025 8:00 AM ETCompany ParticipantsLaila Cecilie Halvorsen - Chief Financial OfficerSvein...",
  "content": "DHT Holdings, Inc. (NYSE:DHT) Q2 2025 Earnings Call August 7, 2025 8:00 AM ET\n\nGood day, and thank you for standing by. Welcome to the Q2 2025 DHT Holdings, Inc. Earnings Conference Call. [Operator Instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speakers today, DHT President and CEO, Svein Moxnes Harfjeld; and Laila Halvorsen, CFO. Please go ahead, your line is open.\n\nThank you. Good morning and good afternoon, everyone. Welcome, and thank you for joining DHT Holdings Second Quarter 2025 Earnings Call. I'm joined by DHT's President and CEO, Svein Moxnus Harfjeld. As usual, we will go through financials and some highlights before we open up for your questions. The link to the slide deck can be found on our website, dhtankers.com. Before we get started with today's call, I would like to make the following remarks. A replay of this conference call will be available on our website, dhtankers.com, until August 14. In addition, our earnings press release will be available on our website and on the SEC EDGAR system as an exhibit to our Form 6-K.\n\nAs a reminder, on this conference call, we will discuss matters that are forward-looking in nature. These forward-looking statements are based on our current expectations about future events as detailed in our financial report. Actual results may differ materially from the expectations reflected in these forward-looking statements. We urge",
  "medium": "Article",
  "links": [
    "https://seekingalpha.com/symbol/DHT"
  ],
  "labels": [
    {
      "name": "Roundup"
    },
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Earnings Call",
      "weight": 0.11732375
    },
    {
      "name": "DHT Holdings",
      "weight": 0.11403771
    },
    {
      "name": "DHT President",
      "weight": 0.107628375
    },
    {
      "name": "DHT",
      "weight": 0.09503843
    },
    {
      "name": "Svein Moxnes Harfjeld",
      "weight": 0.087609254
    },
    {
      "name": "Svein Moxnus Harfjeld",
      "weight": 0.084054306
    },
    {
      "name": "good afternoon",
      "weight": 0.076316066
    },
    {
      "name": "DHT Holdings Second Quarter 2025 Earnings Call",
      "weight": 0.07602912
    },
    {
      "name": "Good day",
      "weight": 0.07497668
    },
    {
      "name": "future events",
      "weight": 0.074215226
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Earnings Calls"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97412109375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.966796875
    }
  ],
  "sentiment": {
    "positive": 0.22277832,
    "negative": 0.092041016,
    "neutral": 0.6855469
  },
  "summary": "DHT Holdings, Inc. (DHT) is set to hold its Q2 2025 Earnings Conference Call on August 7, 2025. The company's President and CEO, Svein Moxnes Harfjeld, and CFO, Laila Halvorsen, will discuss financial highlights and answer questions. The conference call will be broadcast on our website, dhtankers.com, until August 14. A replay of this conference call is also available. As a reminder, these statements are forward-looking in nature and may differ from the actual results reflected in these statements.",
  "shortSummary": "DHT Holdings, Inc. Q2 2025, discusses financials, potentials, and forward-looking statements, with a replay available on our website and SEC EDGAR.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bd47216e142d4a0b8d53ff9eed24df9c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "DHT Holdings, Inc. held its Q2 2025 Earnings Conference Call on August 7, 2025, featuring President and CEO Svein Moxnes Harfjeld and CFO Laila Halvorsen. The call included discussions on financial performance and highlights, with a reminder that a replay and the earnings press release would be available on their website. Participants were cautioned that forward-looking statements made during the call are based on current expectations and may differ from actual results.",
  "argos_id": "AHSF2IZI2"
}