{
  "url": "https://finance.yahoo.com/news/idexx-laboratories-inc-just-beat-132045470.html",
  "authorsByline": "Simply Wall St",
  "articleId": "8328122bf7384692b3c3b318ff22d006",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/simply_wall_st__316/983f2bdfe32b19227b1d118c45bf4f09",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:20:45+00:00",
  "addDate": "2025-08-07T13:51:57.969661+00:00",
  "refreshDate": "2025-08-07T13:51:57.969664+00:00",
  "score": 1.0,
  "title": "IDEXX Laboratories, Inc. Just Beat Earnings Expectations: Here's What Analysts Think Will Happen Next",
  "description": "NasdaqGS:IDXX 1 Year Share Price vs Fair Value Explore IDEXX Laboratories's Fair Values from the Community and select...",
  "content": "Explore IDEXX Laboratories's Fair Values from the Community and select yours\n\n\n\nIDEXX Laboratories, Inc. (NASDAQ:IDXX) investors will be delighted, with the company turning in some strong numbers with its latest results. It was overall a positive result, with revenues beating expectations by 4.0% to hit US$1.1b. IDEXX Laboratories reported statutory earnings per share (EPS) US$3.63, which was a notable 10% above what the analysts had forecast. The analysts typically update their forecasts at each earnings report, and we can judge from their estimates whether their view of the company has changed or if there are any new concerns to be aware of. So we gathered the latest post-earnings forecasts to see what estimates suggest is in store for next year.\n\nTrump has pledged to \"unleash\" American oil and gas and these 15 US stocks have developments that are poised to benefit.\n\nAfter the latest results, the twelve analysts covering IDEXX Laboratories are now predicting revenues of US$4.23b in 2025. If met, this would reflect a satisfactory 4.7% improvement in revenue compared to the last 12 months. Per-share earnings are expected to rise 2.2% to US$12.59. In the lead-up to this report, the analysts had been modelling revenues of US$4.15b and earnings per share (EPS) of US$12.21 in 2025. The analysts seems to have become more bullish on the business, judging by their new earnings per share estimates.\n\nSee our latest analysis for IDEXX Laboratories\n\nThe consensus price target rose 24% to US$674, suggesting that higher earnings estimates flow through to the stock's valuation as well. That's not the only conclusion we can draw from this data however, as some investors also like to consider the spread in estimates when evaluating analyst price targets. Currently, the most bullish analyst values IDEXX Laboratories at US$785 per share, while the most bearish prices it at US$420. As you can see, analysts are not all in agreement on the stock's future, but the range of estimates is still reasonably narrow, which could suggest that the outcome is not totally unpredictable.\n\nThese estimates are interesting, but it can be useful to paint some more broad strokes when seeing how forecasts compare, both to the IDEXX Laboratories' past performance and to peers in the same industry. The period to the end of 2025 brings more of the same, according to the analysts, with revenue forecast to display 9.5% growth on an annualised basis. That is in line with its 8.4% annual growth over the past five years. Compare this with the broader industry, which analyst estimates (in aggregate) suggest will see revenues grow 8.2% annually. So although IDEXX Laboratories is expected to maintain its revenue growth rate, it's only growing at about the rate of the wider industry.",
  "medium": "Article",
  "links": [
    "https://simplywall.st/markets/us/healthcare/medical-equipment?blueprint=3969618&utm_medium=finance_user&utm_campaign=industry&utm_source=yahoo",
    "https://simplywall.st/stock/nasdaqgs/idxx?blueprint=3969618&utm_medium=finance_user&utm_campaign=narratives-news-header&utm_source=yahoo&utm_content=narrative-header-stocks-page",
    "https://simplywall.st/company/id/B8E68387-D0A3-4AA1-8A07-2D78866BC1C3?blueprint=3969618&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
    "https://simplywall.st/company/id/B8E68387-D0A3-4AA1-8A07-2D78866BC1C3/future?blueprint=3969618&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/434423/us-midstream-oil-and-gas-pipeline-operators/global?blueprint=3969618&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=us-oil-gas-pipeline-operators",
    "https://au.finance.yahoo.com/quote/IDXX"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "analyst estimates",
      "weight": 0.12077455
    },
    {
      "name": "IDEXX Laboratories",
      "weight": 0.11890803
    },
    {
      "name": "higher earnings estimates",
      "weight": 0.10460615
    },
    {
      "name": "analyst price targets",
      "weight": 0.09843794
    },
    {
      "name": "Analysts",
      "weight": 0.095477864
    },
    {
      "name": "analysts",
      "weight": 0.095477864
    },
    {
      "name": "Earnings Expectations",
      "weight": 0.08564471
    },
    {
      "name": "estimates",
      "weight": 0.08540364
    },
    {
      "name": "revenue",
      "weight": 0.0802372
    },
    {
      "name": "revenues",
      "weight": 0.0802372
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98095703125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97900390625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9541015625
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.5576171875
    }
  ],
  "sentiment": {
    "positive": 0.6064453,
    "negative": 0.059326172,
    "neutral": 0.33422852
  },
  "summary": "IDEXX Laboratories, Inc. (NASDAQ:IDXX) recently reported a 4.0% increase in revenues to US$1.1b, beating expectations by 4.5% and 10% higher than the expected US earnings of US$3.63. The company's statutory earnings per share (EPS) was 10% above what the analysts had predicted. Following the results, twelve analysts covering IDEXX Labs are now predicting revenues of €4.23b in 2025, reflecting a 47% improvement in revenue compared to the last 12 months. Per-share earnings are expected to rise 2.2% to US $12.59. The most bullish analyst values IDEXEXX Laboratory at US$785 per share, while the most bearish prices it at $420.",
  "shortSummary": "IDEXX Laboratories' latest earnings report beat expectations by 4.0%, with future growth forecasted at 9.5% annually, boosting investor confidence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "632c40676b7a43ffa2394142f525c124",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://simplywall.st/stock/nasdaqgs/idxx?blueprint=3969618&utm_medium=finance_user&utm_campaign=narratives-news-header&utm_source=yahoo&utm_content=narrative-header-stocks-page",
      "text": "IDEXX Laboratories, Inc. develops, manufactures, and distributes products for the companion animal veterinary, livestock and poultry, dairy, and water testing industries in the United States and internationally. The company operates through three segments: Companion Animal Group; Water Quality Products; and Livestock, Poultry and Dairy. It offers in-clinic chemistry, blood and urine chemistry, hematology, immunoassay, urinalysis, cytology, and coagulation analyzers; and SNAP rapid assays test kits. The company also provides commercial reference laboratory diagnostic and consulting services to veterinarians; veterinary consultation, telemedicine, and advisory services, including radiology, dental radiography, cardiology, internal medicine, and ultrasound consulting; Colilert, Colilert-18, and Colisure tests, which detect the presence of total coliforms and E. coli in water; Enterolert, Pseudalert, Filta-Max and Filta-Max xpress, Legiolert, Quanti-Tray products, and Tecta system instruments; and veterinary software and services for independent veterinary clinics and corporate groups. In addition, it offers diagnostic tests, services, and related instrumentation for manage the health status of livestock and poultry; human medical diagnostic products and services; and VetConnect PLUS, a cloud-based technology that enables veterinarians to access and analyze patients, as well as operates VetLab Station. The company markets its products through marketing, customer service, sales, and technical service groups, as well as through independent distributors and other resellers. IDEXX Laboratories, Inc. was incorporated in 1983 and is headquartered in Westbrook, Maine.\nU.S. Market Performance\n7D7 Days: -0.2%\n3M3 Months: 12.2%\n1Y1 Year: 22.4%\nYTDYear to Date: 7.7%\nIn the last week, the market has stayed flat, however the Communication Services sector stood out, gaining 3.4%. As for the longer term, the market has risen 22% in the past 12 months. Looking forward, earnings are forecast to grow by 15% annually. Market details ›\nThis week, we’re diving deeper into the world of agentic AI. We’re zeroing in on the core technologies that make these intelligent agents actually reliably work. We explore what all this could mean for software, start-ups, and most importantly, the opportunities and risks each industry faces by adopting Agentic AI."
    },
    {
      "url": "https://simplywall.st/company/id/B8E68387-D0A3-4AA1-8A07-2D78866BC1C3?blueprint=3969618&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
      "text": "IDEXX Laboratories (IDXX) Stock Overview\nDevelops, manufactures, and distributes products for the companion animal veterinary, livestock and poultry, dairy, and water testing industries in the United States and internationally. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 0/6 |\n| Future Growth | 2/6 |\n| Past Performance | 5/6 |\n| Financial Health | 5/6 |\n| Dividends | 0/6 |\nIDXX Community Fair Values\nSee what 44 others think this stock is worth. Follow their fair value or set your own to get alerts.\nIDEXX Laboratories, Inc. Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | US$624.19 |\n| 52 Week High | US$688.12 |\n| 52 Week Low | US$356.14 |\n| Beta | 1.5 |\n| 1 Month Change | 14.41% |\n| 3 Month Change | 27.39% |\n| 1 Year Change | 33.64% |\n| 3 Year Change | 55.93% |\n| 5 Year Change | 62.20% |\n| Change since IPO | 65,930.05% |\nRecent News & Updates\nIDEXX Laboratories, Inc. Just Beat Analyst Forecasts, And Analysts Have Been Updating Their Predictions\nAug 07At US$532, Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth Looking At Closely?\nJul 23Recent updates\nIDEXX Laboratories, Inc. Just Beat Analyst Forecasts, And Analysts Have Been Updating Their Predictions\nAug 07At US$532, Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth Looking At Closely?\nJul 23IDEXX Laboratories, Inc. (NASDAQ:IDXX) Stocks Shoot Up 26% But Its P/E Still Looks Reasonable\nMay 11IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) CEO Compensation Looks Acceptable To Us And Here's Why\nMay 01Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth US$427 Based On Its Intrinsic Value?\nApr 24IDEXX Laboratories: I Love The Business, Not The Stock Price\nApr 14We Think IDEXX Laboratories (NASDAQ:IDXX) Can Manage Its Debt With Ease\nMar 30IDEXX Laboratories: A Top Dog In The Pet Care Market\nMar 12IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) Business Is Yet to Catch Up With Its Share Price\nFeb 27IDEXX Laboratories And Its Real Value\nFeb 10Calculating The Fair Value Of IDEXX Laboratories, Inc. (NASDAQ:IDXX)\nJan 13IDEXX Laboratories (NASDAQ:IDXX) Seems To Use Debt Rather Sparingly\nDec 26At US$420, Is It Time To Put IDEXX Laboratories, Inc. (NASDAQ:IDXX) On Your Watch List?\nNov 19IDEXX Laboratories Q3: Weak End-Market Demand Continues\nNov 11Investors Appear Satisfied With IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) Prospects\nOct 28Here's Why We Think IDEXX Laboratories (NASDAQ:IDXX) Is Well Worth Watching\nOct 15We Think IDEXX Laboratories (NASDAQ:IDXX) Can Manage Its Debt With Ease\nSep 18A Look At The Intrinsic Value Of IDEXX Laboratories, Inc. (NASDAQ:IDXX)\nSep 05What Is IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) Share Price Doing?\nAug 20Global Expansion And Innovative Products Propel Revenue And Margin Growth Amidst Challenges\nIDEXX's international and innovative product growth, like the inVue Dx Cellular Analyzer, fuels potential revenue and market share increases globally.IDEXX Laboratories Q2: Headwinds From Low U.S. Clinical Visits\nAug 12Looking For Fast Growth In Healthcare? IDEXX Has You Covered\nJun 28IDEXX: Strong Recurring Revenues From Consumables, Software But Overvalued (Rating Downgrade)\nApr 08IDEXX Laboratories: Valuation Rerating Doesn't Seem Justified\nJan 16Shareholder Returns\n| IDXX | US Medical Equipment | US Market | |\n|---|---|---|---|\n| 7D | 9.1% | -2.7% | -0.2% |\n| 1Y | 33.6% | 7.7% | 22.4% |\nReturn vs Industry: IDXX exceeded the US Medical Equipment industry which returned 8.4% over the past year.\nReturn vs Market: IDXX exceeded the US Market which returned 21.3% over the past year.\nPrice Volatility\n| IDXX volatility | |\n|---|---|\n| IDXX Average Weekly Movement | 8.6% |\n| Medical Equipment Industry Average Movement | 8.4% |\n| Market Average Movement | 6.5% |\n| 10% most volatile stocks in US Market | 17.6% |\n| 10% least volatile stocks in US Market | 3.1% |\nStable Share Price: IDXX has not had significant price volatility in the past 3 months compared to the US market.\nVolatility Over Time: IDXX's weekly volatility (9%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 1983 | 11,000 | Jay Mazelsky | www.idexx.com |\nIDEXX Laboratories, Inc. develops, manufactures, and distributes products for the companion animal veterinary, livestock and poultry, dairy, and water testing industries in the United States and internationally. The company operates through three segments: Companion Animal Group; Water Quality Products; and Livestock, Poultry and Dairy. It offers in-clinic chemistry, blood and urine chemistry, hematology, immunoassay, urinalysis, cytology, and coagulation analyzers; and SNAP rapid assays test kits.\nIDEXX Laboratories, Inc. Fundamentals Summary\n| IDXX fundamental statistics | |\n|---|---|\n| Market cap | US$51.36b |\n| Earnings (TTM) | US$985.66m |\n| Revenue (TTM) | US$4.04b |\nIs IDXX overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| IDXX income statement (TTM) | |\n|---|---|\n| Revenue | US$4.04b |\n| Cost of Revenue | US$1.55b |\n| Gross Profit | US$2.48b |\n| Other Expenses | US$1.50b |\n| Earnings | US$985.66m |\nLast Reported Earnings\nJun 30, 2025\nNext Earnings Date\nNov 03, 2025\n| Earnings per share (EPS) | 12.32 |\n| Gross Margin | 61.54% |\n| Net Profit Margin | 24.41% |\n| Debt/Equity Ratio | 75.7% |\nHow did IDXX perform over the long term?\nSee historical performance and comparisonCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/06 12:59 |\n| End of Day Share Price | 2025/08/06 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nIDEXX Laboratories, Inc. is covered by 30 analysts. 12 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Daniel Owczarski | Avondale Partners |\n| Ishan Majumdar | Baptista Research |\n| Navann Ty Dietschi | BNP Paribas Exane |"
    },
    {
      "url": "https://simplywall.st/markets/us/healthcare/medical-equipment?blueprint=3969618&utm_medium=finance_user&utm_campaign=industry&utm_source=yahoo",
      "text": "Over the last 7 days, the Medical Equipment industry has dropped 2.7%, driven by pullbacks in Stryker and Intuitive Surgical of 6.4% and 5.3%, respectively. Over the past 12 months, the industry was up 7.7%. Earnings are forecast to grow by 12% annually.\nHas the U.S. Medical Equipment Industry valuation changed over the past few years?\n| Date | Market Cap | Revenue | Earnings | PE | Absolute PE | PS |\n|---|---|---|---|---|---|---|\n| Thu, 07 Aug 2025 | US$1.3t | US$290.7b | US$31.4b | 29.3x | 42x | 4.5x |\n| Sat, 05 Jul 2025 | US$1.4t | US$286.7b | US$29.6b | 30.8x | 46x | 4.7x |\n| Mon, 02 Jun 2025 | US$1.3t | US$286.7b | US$29.6b | 31.9x | 45.3x | 4.7x |\n| Wed, 30 Apr 2025 | US$1.3t | US$284.4b | US$28.3b | 31.6x | 46.1x | 4.6x |\n| Fri, 28 Mar 2025 | US$1.3t | US$283.3b | US$27.4b | 28.7x | 48.3x | 4.7x |\n| Sun, 23 Feb 2025 | US$1.4t | US$282.5b | US$30.1b | 31.7x | 46.7x | 5x |\n| Tue, 21 Jan 2025 | US$1.4t | US$284.0b | US$23.1b | 36.4x | 59.2x | 4.8x |\n| Thu, 19 Dec 2024 | US$1.3t | US$284.0b | US$23.6b | 34.4x | 55.9x | 4.6x |\n| Sat, 16 Nov 2024 | US$1.3t | US$283.1b | US$22.9b | 36.9x | 57.6x | 4.7x |\n| Mon, 14 Oct 2024 | US$1.3t | US$279.4b | US$22.1b | 37x | 59.2x | 4.7x |\n| Wed, 11 Sep 2024 | US$1.3t | US$279.6b | US$22.2b | 38x | 58.9x | 4.7x |\n| Fri, 09 Aug 2024 | US$1.2t | US$279.4b | US$21.9b | 35.9x | 55.4x | 4.3x |\n| Sun, 07 Jul 2024 | US$1.2t | US$276.4b | US$22.7b | 36.9x | 54.4x | 4.5x |\n| Tue, 04 Jun 2024 | US$1.2t | US$276.3b | US$22.7b | 37.4x | 54.5x | 4.5x |\n| Thu, 02 May 2024 | US$1.2t | US$276.1b | US$24.6b | 35.9x | 50.2x | 4.5x |\n| Sat, 30 Mar 2024 | US$1.3t | US$265.9b | US$22.6b | 40.9x | 58.1x | 4.9x |\n| Mon, 26 Feb 2024 | US$1.3t | US$265.9b | US$22.7b | 35.8x | 56.7x | 4.8x |\n| Wed, 24 Jan 2024 | US$1.2t | US$267.4b | US$20.2b | 38.5x | 61.9x | 4.7x |\n| Fri, 22 Dec 2023 | US$1.2t | US$267.4b | US$20.2b | 37.4x | 58.6x | 4.4x |\n| Sun, 19 Nov 2023 | US$1.1t | US$267.0b | US$19.7b | 35.2x | 56.2x | 4.1x |\n| Tue, 17 Oct 2023 | US$1.1t | US$263.9b | US$15.1b | 33.2x | 69.8x | 4x |\n| Thu, 14 Sep 2023 | US$1.2t | US$263.8b | US$15.0b | 34.1x | 77.9x | 4.4x |\n| Sat, 12 Aug 2023 | US$1.2t | US$263.4b | US$15.1b | 35.4x | 80.1x | 4.6x |\n| Mon, 10 Jul 2023 | US$1.3t | US$260.7b | US$16.2b | 36.8x | 77.7x | 4.8x |\n| Wed, 07 Jun 2023 | US$1.2t | US$261.2b | US$16.2b | 36.5x | 75.4x | 4.7x |\n| Fri, 05 May 2023 | US$1.3t | US$260.3b | US$16.7b | 37.7x | 75x | 4.8x |\n| Sun, 02 Apr 2023 | US$1.2t | US$260.2b | US$18.5b | 35.9x | 64.4x | 4.6x |\n| Tue, 28 Feb 2023 | US$1.1t | US$259.7b | US$18.7b | 38.5x | 61.5x | 4.4x |\n| Thu, 26 Jan 2023 | US$1.2t | US$262.5b | US$20.8b | 34.6x | 56.5x | 4.5x |\n| Sat, 24 Dec 2022 | US$1.1t | US$244.4b | US$19.0b | 31.9x | 58.5x | 4.5x |\n| Mon, 21 Nov 2022 | US$1.1t | US$244.5b | US$20.0b | 32.3x | 54.3x | 4.4x |\n| Wed, 19 Oct 2022 | US$1.0t | US$244.4b | US$26.5b | 32.2x | 39.5x | 4.3x |\n| Fri, 16 Sep 2022 | US$1.1t | US$244.6b | US$26.3b | 33.6x | 42.5x | 4.6x |\n| Sun, 14 Aug 2022 | US$1.2t | US$245.5b | US$26.7b | 34.4x | 44.1x | 4.8x |\n44.1x\nWhich industries have driven the changes within the U.S. Healthcare industry?\n| US Market | -0.16% | |\n| Healthcare | -2.74% | |\n| Medical Equipment | -2.72% | |\n| Medical Equipment | -2.69% | |\n| Medical Supplies | -3.25% |\nWhich companies have driven the market over the last 7 days?\n| Company | Last Price | 7D | 1Y | Valuation | |\n|---|---|---|---|---|---|\n| ABT Abbott Laboratories | US$130.93 | 1.9% +US$4.1b | 19.1% | PE16.4x | |\n| IDXX IDEXX Laboratories | US$624.19 | 9.1% +US$3.9b | 33.6% | PE50.7x | |\n| TMDX TransMedics Group | US$125.74 | 19.9% +US$739.7m | -19.4% | PE59.8x | |\n| ATEC Alphatec Holdings | US$15.20 | 41.7% +US$680.9m | 149.2% | PS3.3x | |\n| ALGN Align Technology | US$136.90 | 6.1% +US$571.9m | -36.1% | PE22.7x |"
    },
    {
      "url": "https://simplywall.st/discover/investing-ideas/434423/us-midstream-oil-and-gas-pipeline-operators/global?blueprint=3969618&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=us-oil-gas-pipeline-operators",
      "text": "Results\n22\nMidstream oil and gas companies, specifically pipeline operators, are well-positioned to benefit from Trump’s executive orders on fossil fuels enacted in early 2025. – – These policies aim to accelerate infrastructure development by streamlining environmental reviews and permitting processes, such as those under the National Environmental Policy Act (NEPA). The declaration of a \"national energy emergency\" further empowers these companies by prioritizing pipeline and storage projects to support increased production from newly accessible federal lands and waters. – – The push to \"unleash American energy\" also amplifies demand for midstream services as upstream production ramps up, particularly in regions like Alaska and offshore areas reopened for drilling. Pipelines and storage facilities will be critical to moving larger volumes of oil and gas efficiently, especially with the renewed emphasis on LNG exports to meet global demand.\n22 companies\nChevron\nMarket Cap: US$313.3b\nThrough its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally.\nCVX\nUS$152.78\n7D\n-0.5%\n1Y\n7.3%\nWilliams Companies\nMarket Cap: US$72.0b\nOperates as an energy infrastructure company primarily in the United States.\nWMB\nUS$58.64\n7D\n-1.0%\n1Y\n36.4%\nKinder Morgan\nMarket Cap: US$62.3b\nOperates as an energy infrastructure company primarily in North America.\nKMI\nUS$26.75\n7D\n-4.5%\n1Y\n28.6%\nCheniere Energy\nMarket Cap: US$53.1b\nAn energy infrastructure company, primarily engages in the liquefied natural gas (LNG) related businesses in the United States.\nLNG\nUS$235.91\n7D\n1.1%\n1Y\n32.8%\nMarathon Petroleum\nMarket Cap: US$51.4b\nOperates as an integrated downstream energy company in the United States.\nMPC\nUS$162.44\n7D\n-4.9%\n1Y\n-4.1%\nONEOK\nMarket Cap: US$47.7b\nOperates as a midstream service provider of gathering, processing, fractionation, transportation, storage, and marine export services in the United States.\nOKE\nUS$75.23\n7D\n-8.5%\n1Y\n-9.4%\nDT Midstream\nMarket Cap: US$10.5b\nProvides integrated natural gas services in the United States.\nDTM\nUS$104.33\n7D\n2.9%\n1Y\n44.7%\nAntero Midstream\nMarket Cap: US$8.9b\nOwns, operates, and develops midstream energy assets in the Appalachian Basin.\nAM\nUS$18.68\n7D\n9.0%\n1Y\n35.3%\nHess Midstream\nMarket Cap: US$8.8b\nOwns, operates, develops, and acquires midstream assets and provide fee-based services to Hess and third-party customers in the United States.\nHESM\nUS$41.79\n7D\n-2.1%\n1Y\n17.2%\nKinetik Holdings\nMarket Cap: US$6.7b\nThrough its subsidiaries, operates as a midstream company in the Texas Delaware Basin.\nKNTK\nUS$41.54\n7D\n-2.7%\n1Y\n3.2%\nPBF Energy\nMarket Cap: US$2.8b\nThrough its subsidiaries, engages in refining and supplying petroleum products.\nPBF\nUS$22.73\n7D\n-7.7%\n1Y\n-37.6%\nRattler Midstream\nMarket Cap: US$2.2b\nRattler Midstream LP owns, operates, develops, and acquires midstream and energy-related infrastructure assets in the Midland and Delaware Basins of the Permian Basin.\nRTLR\nUS$15.22\n7D\n3.5%\n1Y\n45.0%\nPar Pacific Holdings\nMarket Cap: US$1.6b\nOperates as an energy company in the United States.\nPARR\nUS$27.09\n7D\n-15.3%\n1Y\n12.4%\nDelek US Holdings\nMarket Cap: US$1.3b\nEngages in the integrated downstream energy business in the United States.\nDK\nUS$20.04\n7D\n-12.5%\n1Y\n-0.4%\nClean Energy Fuels\nMarket Cap: US$457.4m\nOffers natural gas as alternative fuels for vehicle fleets and related fueling solutions in the United States and Canada.\nCLNE\nUS$2.03\n7D\n-0.5%\n1Y\n-16.1%\nOPAL Fuels\nMarket Cap: US$405.7m\nEngages in the production and distribution of renewable natural gas (RNG) for use as a vehicle fuel for heavy and medium-duty trucking fleets throughout the United States.\nOPAL\nUS$2.36\n7D\n0%\n1Y\n-35.5%\nSummit Midstream\nMarket Cap: US$306.3m\nFocuses on owning, developing, and operating midstream energy infrastructure assets primarily shale formations in the continental United States.\nSMC\nUS$24.91\n7D\n-2.5%\n1Y\n-30.9%\nGranite Falls Energy\nMarket Cap: US$91.1m\nEngages in the production and sale of ethanol and its co-products in the continental United States.\nGFGY\nUS$2,975.00\n7D\n0%\n1Y\nn/a\nStabilis Solutions\nMarket Cap: US$89.8m\nAn energy transition company, provides turnkey clean energy production, storage, transportation, and fueling solutions primarily using liquefied natural gas (LNG) to various end markets in North America.\nSLNG\nUS$4.80\n7D\n0%\n1Y\n23.4%\nVivakor\nMarket Cap: US$48.2m\nOperates, acquires, and develops technologies and assets in the oil and gas industry in the United States and Kuwait.\nVIVK\nUS$0.99\n7D\n-4.4%\n1Y\n-49.5%\nMirage Energy\nMarket Cap: US$526.1k\nThrough its subsidiaries, focuses on developing an integrated pipeline and natural gas storage facility in Mexico and the United States.\nMRGE\nUS$0.0013\n7D\n18.2%\n1Y\n-81.9%\nEnergtek\nMarket Cap: US$51.4k\nProvides natural gas delivery solutions based on mobile pipe-less technologies and products.\nEGTK\nUS$0.0001\n7D\n0%\n1Y\nn/a"
    },
    {
      "url": "https://simplywall.st/company/id/B8E68387-D0A3-4AA1-8A07-2D78866BC1C3/future?blueprint=3969618&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
      "text": "IDEXX Laboratories Future Growth\nFuture criteria checks 2/6\nIDEXX Laboratories is forecast to grow earnings and revenue by 9.1% and 8.1% per annum respectively. EPS is expected to grow by 10.8% per annum. Return on equity is forecast to be 41% in 3 years.\nKey information\n9.1%\nEarnings growth rate\n10.81%\nEPS growth rate\n| Medical Equipment earnings growth | 12.3% |\n| Revenue growth rate | 8.1% |\n| Future return on equity | 40.96% |\n| Analyst coverage | Good |\n| Last updated | 06 Aug 2025 |\nRecent future growth updates\nRecent updates\nAt US$532, Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth Looking At Closely?\nJul 23IDEXX Laboratories, Inc. (NASDAQ:IDXX) Stocks Shoot Up 26% But Its P/E Still Looks Reasonable\nMay 11IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) CEO Compensation Looks Acceptable To Us And Here's Why\nMay 01Is IDEXX Laboratories, Inc. (NASDAQ:IDXX) Worth US$427 Based On Its Intrinsic Value?\nApr 24IDEXX Laboratories: I Love The Business, Not The Stock Price\nApr 14We Think IDEXX Laboratories (NASDAQ:IDXX) Can Manage Its Debt With Ease\nMar 30IDEXX Laboratories: A Top Dog In The Pet Care Market\nMar 12IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) Business Is Yet to Catch Up With Its Share Price\nFeb 27IDEXX Laboratories And Its Real Value\nFeb 10Calculating The Fair Value Of IDEXX Laboratories, Inc. (NASDAQ:IDXX)\nJan 13IDEXX Laboratories (NASDAQ:IDXX) Seems To Use Debt Rather Sparingly\nDec 26At US$420, Is It Time To Put IDEXX Laboratories, Inc. (NASDAQ:IDXX) On Your Watch List?\nNov 19IDEXX Laboratories Q3: Weak End-Market Demand Continues\nNov 11Investors Appear Satisfied With IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) Prospects\nOct 28Here's Why We Think IDEXX Laboratories (NASDAQ:IDXX) Is Well Worth Watching\nOct 15We Think IDEXX Laboratories (NASDAQ:IDXX) Can Manage Its Debt With Ease\nSep 18A Look At The Intrinsic Value Of IDEXX Laboratories, Inc. (NASDAQ:IDXX)\nSep 05What Is IDEXX Laboratories, Inc.'s (NASDAQ:IDXX) Share Price Doing?\nAug 20Global Expansion And Innovative Products Propel Revenue And Margin Growth Amidst Challenges\nIDEXX's international and innovative product growth, like the inVue Dx Cellular Analyzer, fuels potential revenue and market share increases globally.IDEXX Laboratories Q2: Headwinds From Low U.S. Clinical Visits\nAug 12Looking For Fast Growth In Healthcare? IDEXX Has You Covered\nJun 28IDEXX: Strong Recurring Revenues From Consumables, Software But Overvalued (Rating Downgrade)\nApr 08IDEXX Laboratories: Valuation Rerating Doesn't Seem Justified\nJan 16Earnings and Revenue Growth Forecasts\n| Date | Revenue | Earnings | Free Cash Flow | Cash from Op | Avg. No. Analysts |\n|---|---|---|---|---|---|\n| 12/31/2027 | 4,957 | 1,254 | 1,226 | 1,368 | 10 |\n| 12/31/2026 | 4,558 | 1,125 | 1,140 | 1,234 | 12 |\n| 12/31/2025 | 4,226 | 1,016 | 950 | 1,241 | 11 |\n| 6/30/2025 | 4,038 | 986 | 774 | 906 | N/A |\n| 3/31/2025 | 3,932 | 895 | 838 | 968 | N/A |\n| 12/31/2024 | 3,898 | 888 | 798 | 929 | N/A |\n| 9/30/2024 | 3,845 | 866 | 793 | 917 | N/A |\n| 6/30/2024 | 3,785 | 846 | 839 | 969 | N/A |\n| 3/31/2024 | 3,725 | 867 | 797 | 921 | N/A |\n| 12/31/2023 | 3,661 | 845 | 773 | 907 | N/A |\n| 9/30/2023 | 3,588 | 823 | 680 | 830 | N/A |\n| 6/30/2023 | 3,514 | 791 | 593 | 747 | N/A |\n| 3/31/2023 | 3,431 | 699 | 456 | 612 | N/A |\n| 12/31/2022 | 3,367 | 679 | 384 | 543 | N/A |\n| 9/30/2022 | 3,340 | 670 | 438 | 580 | N/A |\n| 6/30/2022 | 3,309 | 664 | 429 | 578 | N/A |\n| 3/31/2022 | 3,274 | 735 | 605 | 746 | N/A |\n| 12/31/2021 | 3,215 | 745 | 636 | 756 | N/A |\n| 9/30/2021 | 3,135 | 757 | 663 | 765 | N/A |\n| 6/30/2021 | 3,047 | 728 | 694 | 770 | N/A |\n| 3/31/2021 | 2,858 | 674 | 666 | 745 | N/A |\n| 12/31/2020 | 2,707 | 582 | 540 | 648 | N/A |\n| 9/30/2020 | 2,591 | 497 | 445 | 585 | N/A |\n| 6/30/2020 | 2,475 | 460 | 366 | 524 | N/A |\n| 3/31/2020 | 2,457 | 437 | 286 | 453 | N/A |\n| 12/31/2019 | 2,407 | 428 | 304 | 459 | N/A |\n| 9/30/2019 | 2,351 | 423 | 290 | 439 | N/A |\n| 6/30/2019 | 2,291 | 407 | 274 | 418 | N/A |\n| 3/31/2019 | 2,252 | 390 | N/A | 400 | N/A |\n| 12/31/2018 | 2,213 | 377 | N/A | 400 | N/A |\n| 9/30/2018 | 2,170 | 330 | N/A | 386 | N/A |\n| 6/30/2018 | 2,117 | 307 | N/A | 386 | N/A |\n| 3/31/2018 | 2,045 | 284 | N/A | 377 | N/A |\n| 12/31/2017 | 1,969 | 263 | N/A | 373 | N/A |\n| 9/30/2017 | 1,906 | 277 | N/A | 353 | N/A |\n| 6/30/2017 | 1,862 | 263 | N/A | 343 | N/A |\n| 3/31/2017 | 1,820 | 245 | N/A | 343 | N/A |\n| 12/31/2016 | 1,775 | 222 | N/A | 339 | N/A |\n| 9/30/2016 | 1,732 | 214 | N/A | 312 | N/A |\n| 6/30/2016 | 1,690 | 202 | N/A | 289 | N/A |\n| 3/31/2016 | 1,637 | 192 | N/A | 258 | N/A |\n| 12/31/2015 | 1,602 | 192 | N/A | 222 | N/A |\n| 9/30/2015 | 1,554 | 174 | N/A | 170 | N/A |\n| 6/30/2015 | 1,531 | 182 | N/A | 186 | N/A |\n| 3/31/2015 | 1,508 | 182 | N/A | 188 | N/A |\n| 12/31/2014 | 1,486 | 182 | N/A | 236 | N/A |\n| 9/30/2014 | 1,488 | 199 | N/A | 274 | N/A |\nAnalyst Future Growth Forecasts\nEarnings vs Savings Rate: IDXX's forecast earnings growth (9.1% per year) is above the savings rate (3.1%).\nEarnings vs Market: IDXX's earnings (9.1% per year) are forecast to grow slower than the US market (14.7% per year).\nHigh Growth Earnings: IDXX's earnings are forecast to grow, but not significantly.\nRevenue vs Market: IDXX's revenue (8.1% per year) is forecast to grow slower than the US market (9.3% per year).\nHigh Growth Revenue: IDXX's revenue (8.1% per year) is forecast to grow slower than 20% per year.\nEarnings per Share Growth Forecasts\nFuture Return on Equity\nFuture ROE: IDXX's Return on Equity is forecast to be very high in 3 years time (41%).\nDiscover growth companies\nCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/06 05:21 |\n| End of Day Share Price | 2025/08/06 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nIDEXX Laboratories, Inc. is covered by 30 analysts. 12 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Daniel Owczarski | Avondale Partners |\n| Ishan Majumdar | Baptista Research |\n| Navann Ty Dietschi | BNP Paribas Exane |"
    }
  ],
  "argos_summary": "IDEXX Laboratories, Inc. reported strong financial results, with revenues of $1.1 billion, exceeding expectations by 4%, and earnings per share (EPS) of $3.63, surpassing forecasts by 10%. Analysts have raised their revenue and EPS estimates for 2025, projecting revenues of $4.23 billion and EPS of $12.59, reflecting a more optimistic outlook for the company. The consensus price target for IDEXX's stock has increased by 24% to $674, indicating a positive sentiment among analysts despite some variability in individual price targets.",
  "argos_id": "AJ04NSTX0"
}