{
  "url": "https://www.politico.com/news/2025/08/07/trump-new-census-00497025",
  "authorsByline": "Nicole Markus",
  "articleId": "f7c9910150434b3c945132a4ad299713",
  "source": {
    "domain": "politico.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Arlington County",
      "city": "Arlington",
      "coordinates": {
        "lat": 38.8903961,
        "lon": -77.0841585
      }
    }
  },
  "imageUrl": "https://www.politico.com/dims4/default/resize/1200/quality/90/format/jpg?url=https%3A%2F%2Fstatic.politico.com%2F09%2F24%2Fd06e060f4633b75047d1f8ee9d02%2Ftrump-92563.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T09:29:00-04:00",
  "addDate": "2025-08-07T13:38:48.833544+00:00",
  "refreshDate": "2025-08-07T13:38:48.833546+00:00",
  "score": 1.0,
  "title": "Trump says he’s ordering new census",
  "description": "The attempt would likely face a flurry of legal and logistical challenges should the administration move ahead with it.",
  "content": "Censuses are immensely important in American governance; each count determines how many House seats every state gets through a process called apportionment, and the results of the census help direct billions of dollars in federal, state and local funding.\n\nTrump has been trying to include a citizenship question on the census since his first term, though the Supreme Court struck the effort down on procedural grounds in 2019. Apportionment numbers have also historically included people residing in the United States regardless of their immigration status.\n\nA 2020 Pew Research Center report indicated removing noncitizens could cost multiple states House seats, including California and Texas.\n\nAny attempt to do a mid-decade census would likely result in a flurry of legal and logistical challenges. Preparing for the decennial count takes multiple years, and planning for the 2030 census is already well underway.\n\nIt is unclear how the Trump administration plans to exclude undocumented people from the count, or if the president intended to just remove them from apportionment totals, which would also face legal hurdles.\n\nThe president’s announcement comes as several states have entered a redistricting battle. Trump has pushed for red states like Texas to gerrymander House maps to maintain control of the chamber, saying Republicans are “entitled” to the seats. Democrats have promised to respond in kind.\n\nSome Republican allies of the president — including Florida Gov. Ron DeSantis — have urged the president to try to launch a new count, arguing the previous count was “flawed.”\n\nThe 2020 census, which was conducted almost entirely under Trump’s first term, was roiled by the pandemic. The release of the results for the census was ultimately delayed until early 2021, under then-President Joe Biden, which scuttled Trump’s attempt to exclude noncitizens from apportionment totals.\n\nThe Census Bureau acknowledged in a 2022 report that Black people, Hispanics and Native Americans were likely undercounted, while white and Asian people were overcounted. While some degree of under- or overcount happens every census, the pandemic likely exacerbated the challenge.\n\nIn January, then-Census Bureau Director Robert Santos resigned midway through his term, citing a desire to spend more time with his family. He had been appointed by Biden after his predecessor resigned following allegations from government watchdogs that he was pressuring bureau employees to rush a report on the number of immigrants in the country.\n\nSantos’ resignation has paved the way for Trump to appoint an ally to lead the agency, although he has yet to nominate a candidate.\n\nPlanning for the census typically takes the length of a decade, so it could be difficult to conduct one soon. Even if they do wait for 2030, federal law requires that census questions be submitted to Congress two years before a count is conducted, so Trump — whose term ends in 2029 — could still influence the questions.",
  "medium": "Article",
  "links": [
    "https://www.politico.com/news/2025/01/31/census-bureau-director-trump-resign-009970",
    "https://www.politico.com/news/2022/03/10/2020-census-undercount-black-people-hispanics-native-americans-00016138",
    "https://www.politico.com/news/2025/07/30/desantis-census-redo-florida-00485304",
    "https://www.pewresearch.org/short-reads/2020/07/24/how-removing-unauthorized-immigrants-from-census-statistics-could-affect-house-reapportionment/",
    "https://www.politico.com/news/2025/08/07/republicans-are-full-steam-ahead-on-redistricting-and-not-just-in-texas-00496450",
    "https://www.politico.com/news/2025/08/05/trump-texas-redistricting-00493624",
    "https://www.politico.com/news/2021/01/18/census-bureau-director-stepping-down-460218",
    "https://www.politico.com/story/2019/06/27/supreme-court-ruling-census-citizenship-question-1385304"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "census questions",
      "weight": 0.09915138
    },
    {
      "name": "new census",
      "weight": 0.096983925
    },
    {
      "name": "Censuses",
      "weight": 0.09420175
    },
    {
      "name": "Trump",
      "weight": 0.079135
    },
    {
      "name": "multiple states",
      "weight": 0.0760683
    },
    {
      "name": "several states",
      "weight": 0.0717172
    },
    {
      "name": "red states",
      "weight": 0.07005301
    },
    {
      "name": "House seats",
      "weight": 0.067800075
    },
    {
      "name": "Black people",
      "weight": 0.06746031
    },
    {
      "name": "undocumented people",
      "weight": 0.0665608
    }
  ],
  "topics": [
    {
      "name": "Census"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9892578125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.892578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.849609375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.7763671875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.74072265625
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.55615234375
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.4091796875
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.357177734375
    }
  ],
  "sentiment": {
    "positive": 0.03967285,
    "negative": 0.7368164,
    "neutral": 0.22375488
  },
  "summary": "The president has announced that he will order a new census, ordering it to take place in 2030. The census, which determines how many House seats every state gets through a process called apportionment, could potentially cost multiple states, including California and Texas. This move comes as several states are in a redistricting battle, with President Trump pushing for red states to manipulate House maps to maintain control. It is unclear how the Trump administration plans to exclude undocumented people from the count, or remove them from apportionional totals. The 2020 census was largely affected by the pandemic of the Black, Hispanic, and Native Americans, leading to an undercounting of Black, Asian, and Latino people. However, federal law requires census questions to be submitted to Congress two years before a count is conducted, so Trump could still influence the questions.",
  "shortSummary": "President Donald Trump is ordering a new census, potentially impacting state budget allocation, while facing legal and redistricting challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cdddd9dc51db4a1585182cfecc1fcad2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pewresearch.org/short-reads/2020/07/24/how-removing-unauthorized-immigrants-from-census-statistics-could-affect-house-reapportionment/",
      "text": "Since the first census of the United States in 1790, counts that include both citizens and noncitizens have been used to apportion seats in the House of Representatives, with states gaining or losing based on population change over the previous decade. If unauthorized immigrants in the U.S. were removed from the 2020 census apportionment count – which the White House seeks to do – three states could each lose a seat they otherwise would have had and three others each could gain one, according to a Pew Research Center analysis based on government records.\nIf unauthorized immigrants were excluded from the apportionment count, California, Florida and Texas would each end up with one less congressional seat than they would have been awarded based on population change alone. California would lose two seats instead of one, Florida would gain one instead of two, and Texas would gain two instead of three, according to analysis based on projections of Census Bureau 2019 population estimates and the Center’s estimates of the unauthorized immigrant population.\nThis blog post explores the role of the nation’s unauthorized immigrant population in apportionment of congressional seats. Every decade, the U.S. Census Bureau conducts a count of all people living in the country, which is then used to distribute seats in the House of Representatives to the states. The analysis in this blog post is based on projections using Census Bureau population estimates, Pew Research Center estimates of the size of the unauthorized immigrant population and established formulas for assigning congressional seats.\nThe Method of Equal Proportions assigns congressional seats to states based on their populations after each state is given their first seat. The method requires 50 state population figures and assigns seats sequentially; it stops after the 435th seat is assigned. Our population figures for 2020 are based on the Census Bureau’s official population estimates for 2018 and 2019 projected to April 1, 2020. We use these for our baseline apportionment.\nThe Pew Research Center has published estimates of the unauthorized immigrant population for states through 2017. The estimates for 2016 and 2017 show very little change, and external indications suggest few changes since then. Accordingly, we use our 2017 estimates for 2020 and subtract them from the total to provide the populations for an apportionment which excludes unauthorized immigrants.\nAlabama, Minnesota and Ohio would each hold onto a seat that they would have lost if apportionment were based only on total population change. Alabama filed a lawsuit in 2018 seeking to block the Census Bureau from including unauthorized immigrants in its population count.\nIn addition to these states, 11 more would gain or lose seats based on population change alone, whether unauthorized immigrants are included or excluded. Five states would gain one seat each: Arizona, Colorado, Montana, North Carolina and Oregon. Six states would lose one seat each: Illinois, Michigan, New York, Pennsylvania, Rhode Island and West Virginia.\nThe apportionment of seats in Congress is required by the U.S. Constitution, which says that the census will be used to divide the House of Representatives “among the several States according to their respective numbers, counting the whole number of persons in each State,” except for enslaved people, who, until the late 1800s, were counted as three-fifths of a person, and certain American Indians. The 14th Amendment eliminated the partial count of enslaved people, and the total American Indian population was added later to congressional reapportionment calculations. The number of seats in the House was fixed at 435 following the 1910 census. Each state gets one seat, and the remainder are assigned according to a complex formula based on relative population size.\nThe census count includes everyone living in the United States, except for foreign tourists and business travelers in the country temporarily, according to Census Bureau rules. For apportionment purposes since 1990, military and civilian federal employees stationed abroad and their dependents are counted as living in a state if they provided a state address in their employment records. The District of Columbia, Puerto Rico and U.S. Island area populations are excluded from the apportionment total because they have no voting representation in Congress.\nFederal law requires the population totals from the decennial census be delivered to the president nine months after Census Day, meaning Dec. 31, 2020. The Census Bureau has requested Congress extend the deadline to April 30, 2021, due to the coronavirus pandemic, although the White House reportedly may push for a “timely census” fueled by $1 billion in additional funding. States would redraw congressional district boundaries to fit the new totals. The results would take effect for the Congress that meets in 2023.\nIn his memorandum announcing a new policy “to the extent practicable” in how congressional seats are divided up, President Donald Trump asserted that the president has discretion to decide who is considered an inhabitant of the U.S. for apportionment purposes. Some of the same groups that successfully challenged the White House attempt to add a citizenship question to the census last year said they also would sue to block any change in apportionment policy. Democrats announced they would hold an emergency congressional hearing to respond.\nThe Census Bureau does not regularly publish counts or estimates of unauthorized immigrants, although the Department of Homeland Security has done so. Last year, after the U.S. Supreme Court ruled against including a question about citizenship on the 2020 census, the president ordered the Census Bureau to assemble a separate database, using other government records, on the citizenship status of every U.S. resident. This has also been challenged in court.\nThe Center’s analysis relies on assumptions about populations to be counted in the 2020 census and estimates of unauthorized immigrants. The actual figures used for apportionment will be different from these, and so the actual apportionment could differ regardless of whether unauthorized immigrants are excluded from the apportionment totals."
    }
  ],
  "argos_summary": "The article discusses the implications of including or excluding unauthorized immigrants in the U.S. Census for congressional apportionment, highlighting how such changes could affect House seat allocations in states like California and Texas. It notes that former President Trump has sought to exclude noncitizens from the census count, a move that faced legal challenges and was previously blocked by the Supreme Court. The article also emphasizes the logistical difficulties of conducting a mid-decade census and the ongoing redistricting battles among states.",
  "argos_id": "C728XI9D8"
}