{
  "url": "https://theblast.com/709936/emily-elizabeth-assures-fans-shes-100-natural/",
  "authorsByline": "Kristin Myers",
  "articleId": "97c4d14f9ed143f8b73b766ee71ffe55",
  "source": {
    "domain": "theblast.com",
    "location": null
  },
  "imageUrl": "https://theblast.prod.media.wordpress.mattersmedia.io/brand-img/123/1350x624/2025/05/13060220/Snapinsta.app_459593020_437640589299204_997901178899771930_n_1080.jpg?",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:00:55+00:00",
  "addDate": "2025-08-07T13:24:04.592174+00:00",
  "refreshDate": "2025-08-07T13:24:04.592177+00:00",
  "score": 1.0,
  "title": "Emily Elizabeth In Plunging Swimsuit Assures Her Fans She's '100% Natural'",
  "description": "Social media model Emily Elizabeth assured her fans that her chest was real while posing in a plunging cut-out swimsuit.",
  "content": "One time, a bold fan asked her about her chest size. The social media sensation responded to the question with a photo of her posing in a cut-out swimsuit and assured her followers that she never went under the knife.\n\nIn November 2023, the popular influencer opened up a chat session with her followers. \"Let's chat! Ask me anything,\" she wrote next to a picture of a smiley face. One bold user asked, \"Did you have a boob job?\" Instead of ignoring it, Emily took the question in stride, responding, \"My body is 100% natural!!!\"\n\nShe shared her response along with a photo that featured her posing in a cut-out black swimsuit. The plunging neckline fit perfectly around her massive chest, while the holes in the side of the swimsuit emphasized her hourglass figure. She held her long blonde hair up with one hand, creating a makeshift ponytail.\n\nEmily Opens Up About Her Rare Condition\n\nIn another chat session simply titled, \"Ask Away,\" one fan asked her to name \"Something weird you do others probably don't.\" Emily opened up about herself in this post, admitting, \"I have Marcus Gunn Syndrome (very rare genetic disorder) so my eye moves when I eat LOL.\"\n\nAccording to the National Library of Medicine, Marcus Gunn Syndrome is also known as Marcus Gunn jaw-winking syndrome. It's named after the ophthalmologist who first described it, Robert Marcus Gunn and causes a drooping upper eyelid to briefly lift or \"wink\" when the jaw moves.\n\nAlthough most people have nerves that control the jaw and nerves that control the eyelid, in Marcus Gunn Syndrome, these two nerves are connected. This means that when you move your jaw, like when you're chewing, talking, or even smiling, it can trigger the eyelid to quickly lift. It's sometimes called \"jaw-winking.\"\n\nIt usually happens from birth and only affects one eye. It doesn't usually impact a person's vision, so treatment isn't always necessary. Doctors might just monitor it if there are no vision problems, as the condition becomes less noticeable with age.\n\nSurgery Can Help In Serious Cases\n\nAlthough it's not really needed if there are no vision problems, doctors can recommend surgery for severe cases. Eye patches and special glasses can also be worn to help strengthen the eye. Interestingly enough, Marcus Gunn Syndrome is different from another condition with a similar name, Marcus Gunn pupil, which has to do with how the pupil responds to light. The more you know!\n\nIt remains to be seen if Emily will ever get surgery for her eyelid, but at least she has assured fans that she has not gone under the knife when it comes to cosmetic surgery!",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/p/CjauSO-L2Mw/?utm_source=ig_embed&utm_campaign=loading",
    "https://www.ncbi.nlm.nih.gov/books/NBK559058/?hl=en-US",
    "http://www.facebook.com/theblastnews",
    "http://theblast.com/tag/emily-elizabeth",
    "https://www.instagram.com/p/DBMkldBzvki/?utm_source=ig_embed&utm_campaign=loading"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Marcus Gunn Syndrome",
      "weight": 0.101541586
    },
    {
      "name": "Marcus Gunn pupil",
      "weight": 0.09695795
    },
    {
      "name": "Robert Marcus Gunn",
      "weight": 0.09556588
    },
    {
      "name": "Plunging Swimsuit",
      "weight": 0.074319355
    },
    {
      "name": "Marcus Gunn jaw-winking syndrome",
      "weight": 0.06623011
    },
    {
      "name": "Eye patches",
      "weight": 0.06582597
    },
    {
      "name": "Emily Elizabeth",
      "weight": 0.06542439
    },
    {
      "name": "fans",
      "weight": 0.06405695
    },
    {
      "name": "cosmetic surgery",
      "weight": 0.063819215
    },
    {
      "name": "Emily",
      "weight": 0.061965145
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98291015625
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.87451171875
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.8388671875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.71142578125
    },
    {
      "name": "/People & Society/Other",
      "score": 0.4453125
    }
  ],
  "sentiment": {
    "positive": 0.1315918,
    "negative": 0.3876953,
    "neutral": 0.4802246
  },
  "summary": "Social media star Emily Elizabeth, known for her large chest size, responded to a fan's question about her size with a photo showing her posing in a cut-out swimsuit and telling her followers that her body is '100% natural' and that she never had a boob job. She also opened up about her rare condition, Marcus Gunn Syndrome (a rare genetic disorder), which causes a drooping upper eyelid to lift or \"wink\" when the jaw moves, sometimes referred to as \"jaw-winking.\" The condition is also known as Marcus Gunn jaw winking syndrome and usually affects one eye, but it does not usually impact vision. Despite this, doctors can recommend surgery for severe cases and eye patches and special glasses can also be worn to strengthen the eye.",
  "shortSummary": "Emily Elizabeth, known for her ample chest in a plunging swimsuit, emphasizes her natural beauty and discusses her rare Marcus Gunn Syndrome condition, which causes the upper eyelid to lift or \"wink.\"",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b13d5c6ce808411392036894741b2d0b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.ncbi.nlm.nih.gov/books/NBK559058/?hl=en-US",
      "text": "This book is distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0) ( http://creativecommons.org/licenses/by-nc-nd/4.0/ ), which permits others to distribute the work, provided that the article is not altered or used commercially. You are not required to obtain permission to distribute this article, provided that you credit the author and journal.\nNCBI Bookshelf. A service of the National Library of Medicine, National Institutes of Health.\nStatPearls [Internet]. Treasure Island (FL): StatPearls Publishing; 2025 Jan-.\nStatPearls [Internet].\nShow detailsContinuing Education Activity\nMarcus Gunn Jaw winking syndrome (MGJWS) is one of the congenital cranial dysinnervation disorders (CCDD) and these individuals have variable degrees of blepharoptosis in the resting, primary position. It is associated with synkinetic movements of the upper eyelid during masticating movements of the jaw. This article reviews the etiology, clinical features of MGJWS, and highlights the role of the interprofessional team in managing the patients with MGJWS.\nObjectives:\n- Describe the etiology of Marcus-Gunn jaw winking syndrome.\n- Outline appropriate evaluation of Marcus Gunn jaw winking syndrome.\n- Review the management options available for Marcus Gunn jaw winking syndrome.\n- Explain interprofessional team strategies for improving care coordination and communication to advance Marcus Gunn Jaw Winking syndrome and improve outcomes.\nIntroduction\nMarcus Gunn jaw-winking syndrome (MGJWS) is noted in congenital blepharoptosis. MGJWS was first described by a Scottish ophthalmologist Dr.Robert Marcus Gunn in the year 1883. This syndrome was initially reported in a 15-year-old girl as unilateral ptosis associated with the upper eyelid contraction on the same side.[1] Other names of MGJWS include Marcus-Gunn jaw winking phenomenon (MGP), Marcus Gunn ptosis, Marcus Gunn jaw winking trigemino-oculomotor synkinesis, Maxillopalpebral synkinesis, and Pterygoid-levator synkinesis. It is one of the congenital cranial dysinnervation disorders (CCDD), and these individuals have variable degrees of blepharoptosis in the resting, primary position.[2] It is associated with synkinetic movements of the upper eyelid during masticating movements of the jaw. It is usually unilateral but may present bilaterally also.[3][4]\nEtiology\nThe occurrence of a coordinated sequence of movements of the muscles innervated by different branches of the same nerve or different nerve is known as synkinesis. In Marcus Gunn jaw-winking syndrome (MGJWS), there occurs a coordinated synkinetic movement of the upper eyelid and the jaw as a result of an abnormal connection between the motor branches of the trigeminal nerve and superior division of oculomotor nerve.[5] This is a congenital condition, and the abnormal neurological connection is postulated as fibers of the fifth cranial nerve are responsible for either directly or indirectly innervating the levator muscle. Familial cases with autosomal dominant inheritance have been described in the literature, but are exceedingly rare.[6] There have been few published reports on acquired MGJWS presumed to develop after complicated ocular surgery and trauma.[5]\nEpidemiology\nApproximately 50% of the blepharoptosis cases are congenital. The incidence of Marcus Gunn jaw-winking syndrome (MGJWS) among individuals with congenital ptosis is approximately 2% to 13%.[7] Although present at birth, MGJWS can occur at a wide range of ages. Bilateral cases have been reported, but mostly MGJWS are unilateral and occurs more frequently on the left.[4] There is no gender predisposition, and males and females are affected equally.[8]\nPathophysiology\nElectromyographic studies have reported that the impulses for this synkinetic movement in Marcus Gunn jaw-winking syndrome originate from the proprioceptive receptors of the external pterygoid muscle.[9] The movement can be triggered by chewing, suction, lateral mandibular movement, smiling, Valsalva maneuver, sternocleidomastoid muscle contraction, tongue protrusion, and even breathing. In a few patients, the synkinetic movement has been documented between the internal pterygoid and levator palpebrae superioris (LPS) muscles. In such individuals, the eyelid elevates on closing the mouth and clenching the teeth.[10]\nThere exists a lack of explanation in the literature regarding the rationale of the jaw-winking phenomenon. Various theories have been presumed to explain this synkinetic jaw winking movement. The most acceptable theory of MGP is the concept of aberrant connection.[11] This location of aberrant connection may differ as follows:\n- Cortical or the subcortical connections\n- Internuclear connections or faulty distribution in the posterior longitudinal bundle\n- Infranuclear misconnection between the trigeminal nerve (CN V3) and the oculomotor nerve (CN III).[11]\n- Peripherally - some trigeminal nerve fibers may reach the LPS muscle through the auriculotemporal nerve.[11]\nHistopathology\nMarcus Gunn jaw-winking syndrome (MGJWS) is believed to be due to the abnormal innervation of the LPS from the motor branch of the trigeminal nerve, so most of the histopathologic studies have revealed normal striated muscle.[12] Few studies have found some degrees of fibrosis within the affected LPS muscle.[13]\nHistory and Physical\nThe jaw-wink reflex consists of a momentary retraction/elevation of the upper eyelid (which was ptotic) upon stimulation of the ipsilateral pterygoid muscle, which is followed by a rapid return to a lower position. The magnitude of the wink is worse in downgaze. This synkinetic phenomenon may be elicited not only by opening the mouth, but also by thrusting the jaw to the contralateral side, jaw protrusion, chewing, smiling, or sucking. The ocular associations of Marcus Gunn jaw-winking syndrome (MGJWS) include strabismus in 50% to 60% individuals, superior rectus palsy in 25% individuals, and double elevator palsy in 25% individuals.[1]\nAlmost 5-25 % of these patients are reported to have anisometropia, and 30% to 60% are reported to have amblyopia.[1] The cause for underlying amblyopia could be secondary to strabismus, anisometropia, or occlusion by the ptotic lid. Rare ocular associations include Morning Glory anomaly, Duane retraction syndrome.[14] The systemic associations with MGJWS include cleft lip/ cleft palate, olfactory nerve disturbance, CHARGE syndrome (coloboma, heart defects, choanal atresia, retardation of growth and development, genital abnormalities, and ear abnormalities), and renal calculi.[4][15]\nUsually, this synkinetic movement of the eyelid will be observed first by the mother when the child is breastfeeding or bottle feeding. History of ocular trauma or strabismus surgery may also be present. The diagnosis is made based on the signs as described below:[16]\n- Unilateral blepharoptosis\n- Upper eyelid movement is seen on opening the mouth, movement of the jaw to the contralateral side, chewing, sucking, swallowing, clenching teeth, and protrusion of the jaw.\n- Hypotropia on the affected side may be present with the cover test due to associated superior rectus palsy.\nDetailed clinical examination includes the following:[17]\n- Visual acuity (It is important to rule out amblyopia in infants and children)\n- Pupillary examination\n- Cycloplegic refraction mainly to rule out anisometropia\n- Fundus evaluation, extraocular motility test, cover test to rule out superior rectus or double elevator palsy)\n- Adequacy of Bell phenomenon as it can be decreased with superior rectus or double elevator palsy\n- Head position: As a result of ptosis, the child may have chin lifting for better vision. If a child is not attempting to lift the chin in the presence of moderate-to-severe ptosis, then it is imperative to exclude amblyopia.\n- Ptosis evaluation: The degree of ptosis should be assessed with the jaw immobilized in a central position and after disrupting the fusion with brief ocular occlusion.[18] Ptosis can be graded as mild ptosis (maximum 2mm), moderate ptosis (3 mm), and severe ptosis (at least 4 mm).\n- Vertical palpebral fissure which is the widest distance between the upper and lower lid\n- Marginal reflex distance (MRD), which is measured with eyes in primary gaze position. MRD1 is the measurement of the corneal reflex to the central upper lid margin. MRD2 is the measurement of the corneal reflex to the central lower lid margin. MRD3 is the distance of the corneal reflex to the central upper-lid margin when the patient looks in extreme upgaze and is used to determine the measurement of LPS resection in ptosis surgery.\n- Levator function, which is the distance the upper lid travels from downgaze to upgaze while the frontalis muscle is held firmly at the brow region. Levator function can be graded as normal (at least 15 mm), good (12-14 mm), fair (5-11 mm), or poor (less than or equal to 4 mm).\n- Measurement of eyelid position in downgaze and presence of any lid lag\nEvaluation\nIt is crucial to exclude the association of dry eyes in these patients before proceeding with ptosis surgery. Complete blood investigations and Chest x-ray may be needed for preoperative fitness/ pre-anesthetic checkup before surgery. ECG should be done in patients with Marcus Gunn jaw-winking syndrome (MGJWS) as they are predisposed to cardiac arrhythmias. It is important to ensure the anesthetist is well informed of clinical diagnosis and its potential significance before proceeding with ptosis surgery.[19]\nTreatment / Management\nThe treatment options for Marcus Gunn jaw-winking syndrome (MGJWS) include the following:\nMedical Care\nThe patient needs aggressive treatment with occlusion therapy and/or correction of anisometropia before any consideration of ptosis surgery if amblyopia is encountered. Close follow up is usually advised while the patient is undergoing therapy for amblyopia.[20] Clinical photographs can help in monitoring patients.\nSurgical Care\nThoughts on surgery for MGJWS are currently controversial. Some surgeons believe that the child should not have surgery until the age of one to two years old as general anesthesia is safer at 1-2 years than infancy. Any surgical correction to repair only the ptosis without correcting the synkinetic jaw winking may result in an aggravation of the aberrant eyelid movement, which may be cosmetically disfiguring to the patient. Indications for surgery include the presence of amblyopia and vertical strabismus, severe ptosis with levator muscle dysfunction, and severe ptosis with normal levator function.\nThe jaw-winking phenomenon is considered cosmetically significant only if it is 2 mm or more. If the jaw-winking is cosmetically insignificant or if the ptosis is mild, it is advisable not to proceed with surgery. If a correction is desired in mild ptosis, then procedures of choice include Muller muscle and conjunctival resection, a Fasanella– Servat procedure, or a standard external levator resection.\nIf the ptosis is moderate to severe, then resection of LPS with bilateral frontalis suspension may be indicated.[21] This procedure is a commonly followed surgical technique with better results in both synkinesis elimination and bilateral symmetry.[22][23] Satisfactory and predictable results were obtained after only unilateral levator excision on the affected side, combined with bilateral frontalis suspension. This leaves the normal functioning levator muscle to elevate the normal eyelid in the primary position but produces a downgaze lag for improved symmetry.[21] Some surgeons advocated performing more resection than normal to avoid under correction. In severe ptosis, a super-maximum (>30 mm) levator resection with frontalis suspension is necessary.[24][25]\nRelative contraindications for surgical intervention of MGJWS are poor Bell phenomena, reduced corneal sensations. and dry eye. All these clinical conditions can ultimately result in vision-threatening exposure keratitis.\nDifferential Diagnosis\nThe differential diagnosis of Marcus Gunn jaw-winking syndrome (MGJWS) is the other synkinetic abnormalities, like inverted Marcus Gunn Phenomenon and Marin-Amat syndrome. In the inverse Marcus Gunn phenomenon, the ptosis in the primary gaze is worsened with mouth opening as apposed to MGJWS where the ptosis improves with mouth opening. The underlying mechanism in the inverse M-G phenomenon is the abnormal connection between the superior division of the third nerve and the motor division of the fifth nerve supplying the internal pterygoid muscle. A case report on the rare association of classical Marcus Gunn on one side and inverse Marcus Gunn on the other side has been described in the literature. The patient exhibited a \"see-saw\" pattern of lid movement on opening as well as closing the mouth and on moving the jaw from side to side.[26][26]\nIn Marin Amat syndrome, there is an abnormal connection between the motor branch of the fifth nerve and frontal, zygomatic branches of the seventh cranial nerve. Here, both eyes close momentarily like blepharospasm with mouth opening secondary to the action of orbicularis oculi muscle.[27][28] Other differential diagnoses of the disease include chronic progressive external ophthalmoplegia, congenital fibrosis syndrome, and myasthenia gravis.\nStaging\nThe amount of jaw winking is the excursion of the upper lid in mm with the opening of the mouth.[5] It is graded into\n- Mild (maximum 2 mm)\n- Moderate (2 mm-5 mm)\n- Severe (higher than 5 mm)\nPrognosis\nPrognosis is usually good in the majority of cases. With careful monitoring of these patients and treatment, amblyopia can be treated successfully.\nComplications\nThe complications following ptosis surgery include under-correction, overcorrection, lagophthalmos, suture granuloma, slippage of the sling, extrusion of the sling, asymmetric lid crease, and exposure keratitis.[29] The reported prevalence of amblyopia among MGJWS is 30% to 60%.\nDeterrence and Patient Education\nMarcus Gunn jaw-winking syndrome (MGJWS) will not cause any other symptoms except for jaw-winking in the majority of the individuals. Treatment is only indicated if the disease nature is moderate to severe causing visual disturbances or for cosmetic purposes. Besides, the parents need to be sensitized regarding the ocular and systemic associations of MGJWS as well as the outcomes following ptosis surgery.[29] Also, the significance of periodical follow-up with an ophthalmic health care provider requires emphasis.\nPearls and Other Issues\nAffected children with MGJWS should have their periodical vision testing to diagnose amblyopia at an earlier stage and treat accordingly. It is imperative to exclude all the reported ocular and systemic associations with Marcus Gunn jaw-winking syndrome (MGJWS) although they are exceedingly rare. It is crucial to treat amblyopia and strabismus in these patients before proceeding with ptosis surgery. It has been noted in the literature that some children may learn to alter the position of their jaw, which reduces the degree of ptosis in primary gaze; thus, surgery may not be necessary for all children.\nEnhancing Healthcare Team Outcomes\nIt is well reported in the literature that an atypical oculocardiac reflex is easily initiated in these patients so that precautions must be taken for its prevention and early detection during ptosis surgery.[30] The operating surgeons as well as anaesthetists need to be well prepared to tackle these cardiac arrhythmias. Also, a detailed history of any previous anesthetic exposure needs to be elucidated as this syndrome has a high probability of association with malignant hyperthermia.[19]\nReview Questions\nReferences\n- 1.\n- Pratt SG, Beyer CK, Johnson CC. The Marcus Gunn phenomenon. A review of 71 cases. Ophthalmology. 1984 Jan;91(1):27-30. [PubMed: 6709318]\n- 2.\n- Traboulsi EI. Congenital cranial dysinnervation disorders and more. J AAPOS. 2007 Jun;11(3):215-7. [PubMed: 17572338]\n- 3.\n- Shah AD, Kumar AB, Kothari K. Bilateral Marcus Gunn jaw winking synkinesis with monocular elevation deficiency: a case report and literature review. Int Ophthalmol. 2012 Apr;32(2):199-201. [PubMed: 22350119]\n- 4.\n- Weaver RG, Seaton AD, Jewett T. Bilateral Marcus Gunn (jaw-winking) phenomenon occurring with CHARGE association. J Pediatr Ophthalmol Strabismus. 1997 Sep-Oct;34(5):308-9. [PubMed: 9310920]\n- 5.\n- Demirci H, Frueh BR, Nelson CC. Marcus Gunn jaw-winking synkinesis: clinical features and management. Ophthalmology. 2010 Jul;117(7):1447-52. [PubMed: 20188419]\n- 6.\n- Kannaditharayil D, Geyer H, Hasson H, Herskovitz S. Bilateral Marcus Gunn jaw-winking syndrome. Neurology. 2015 Mar 10;84(10):1061. [PubMed: 25754805]\n- 7.\n- Ziga N, Biscevic A, Pjano MA, Pidro A. Marcus Gunn Jaw-Winking Syndrome: a Case Report. Med Arch. 2019 Aug;73(4):282-284. [PMC free article: PMC6853731] [PubMed: 31762566]\n- 8.\n- Khwarg SI, Tarbet KJ, Dortzbach RK, Lucarelli MJ. Management of moderate-to-severe Marcus-Gunn jaw-winking ptosis. Ophthalmology. 1999 Jun;106(6):1191-6. [PubMed: 10366092]\n- 9.\n- Lehman AM, Dong CC, Harries AM, Patel A, Honey CR, Patel MS. Evidence of ancillary trigeminal innervation of levator palpebrae in the general population. J Clin Neurosci. 2014 Feb;21(2):301-4. [PubMed: 24120706]\n- 10.\n- Su YH, Ong CT. Marcus Gunn jaw-winking syndrome. Acta Neurol Taiwan. 2010 Mar;19(1):76-7. [PubMed: 21046852]\n- 11.\n- Freedman HL, Kushner BJ. Congenital ocular aberrant innervation--new concepts. J Pediatr Ophthalmol Strabismus. 1997 Jan-Feb;34(1):10-6. [PubMed: 9027674]\n- 12.\n- D'Esposito M, Sanna G, Turra MV, CCaccia-Perugini G. [Electromyographic study of the Marcus Gunn phenomenon]. Bull Mem Soc Fr Ophtalmol. 1970;83:177-87. [PubMed: 5512168]\n- 13.\n- Rao MV, Syeda A. Jaw-winking movement (Marcus-Gunn phenomenon). Indian J Med Sci. 1973 Dec;27(12):925-7. [PubMed: 4790418]\n- 14.\n- Alshamrani AA, Alghulaydhawi FA, Al Shamrani M. Marcus Gunn Jaw-Winking Syndrome Associated with Morning Glory Disc Anomaly. Middle East Afr J Ophthalmol. 2019 Jan-Mar;26(1):37-39. [PMC free article: PMC6507382] [PubMed: 31114123]\n- 15.\n- Dżaman K, Zborowska-Piskadło K, Pietniczka-Załęska M, Kantor I. Marcus Gunn (jaw-winking) phenomenon in pediatric otorhinolaryngology practice. Int J Pediatr Otorhinolaryngol. 2019 Feb;117:153-156. [PubMed: 30579071]\n- 16.\n- Awan KJ. Marcus gunn (jaw-winking) syndrome. Am J Ophthalmol. 1976 Sep;82(3):503-4. [PubMed: 961806]\n- 17.\n- Park DH, Choi WS, Yoon SH. Treatment of the jaw-winking syndrome. Ann Plast Surg. 2008 Apr;60(4):404-9. [PubMed: 18362569]\n- 18.\n- Wong JF, Thériault JF, Bouzouaya C, Codère F. Marcus Gunn jaw-winking phenomenon: a new supplemental test in the preoperative evaluation. Ophthalmic Plast Reconstr Surg. 2001 Nov;17(6):412-8. [PubMed: 11766020]\n- 19.\n- Pandey M, Baduni N, Jain A, Sanwal MK, Vajifdar H. Abnormal oculocardiac reflex in two patients with Marcus Gunn syndrome. J Anaesthesiol Clin Pharmacol. 2011 Jul;27(3):398-9. [PMC free article: PMC3161473] [PubMed: 21897519]\n- 20.\n- Tian N, Zheng YX, Zhou SY, Liu JL, Huang DP, Zhao HY. [Clinical characteristics of moderate and severe Marcus-Gunn jaw-winking synkinesis and its surgical treatment]. Zhonghua Yan Ke Za Zhi. 2007 Dec;43(12):1069-72. [PubMed: 18331673]\n- 21.\n- Morax S, Mimoun G. [Surgical treatment of the Marcus-Gunn syndrome. Indications and results. Apropos of 15 cases]. Ophtalmologie. 1989 Apr-May;3(2):160-3. [PubMed: 2641099]\n- 22.\n- Putterman AM. Jaw-winking blepharoptosis treated by the Fasanella-Servat procedure. Am J Ophthalmol. 1973 Jun;75(6):1016-22. [PubMed: 4708631]\n- 23.\n- Ning Q, Cao J, Xie J, Gao Q, Wang C, Ye J. Unilateral Levator Aponeurosis Excision for Marcus Gunn Syndrome and Risk Factors of Residual Jaw Winking. J Ophthalmol. 2019;2019:2058047. [PMC free article: PMC6875030] [PubMed: 31781375]\n- 24.\n- Betharia SM, Kumar S. Levator sling for Marcus Gunn ptosis. Br J Ophthalmol. 1987 Sep;71(9):685-9. [PMC free article: PMC1041275] [PubMed: 3663562]\n- 25.\n- Sthapit PR, Saiju R. Surgical Outcomes in Cases of Marcus-Gunn Jaw-Winking Phenomenon. Kathmandu Univ Med J (KUMJ). 2015 Jan-Mar;13(49):34-7. [PubMed: 26620746]\n- 26.\n- Kumar V, Goel N, Raina UK, Ghosh B. \"See-saw\" Marcus Gunn syndrome. Ophthalmic Plast Reconstr Surg. 2011 Nov-Dec;27(6):e144-5. [PubMed: 21346672]\n- 27.\n- García Ron A, Jensen J, Garriga Braun C, Gómez E, Sierra J. [Marin-Amat and inverted Marcus-Gunn syndrome. Two case reports]. An Pediatr (Barc). 2011 May;74(5):324-6. [PubMed: 21377433]\n- 28.\n- Jethani J. Marin-Amat syndrome: a rare facial synkinesis. Indian J Ophthalmol. 2007 Sep-Oct;55(5):402-3. [PMC free article: PMC2636018] [PubMed: 17699965]\n- 29.\n- Doucet TW, Crawford JS. The quantification, natural course, and surgical results in 57 eyes with Marcus Gunn (jaw-winking) syndrome. Am J Ophthalmol. 1981 Nov;92(5):702-7. [PubMed: 7304698]\n- 30.\n- Kwik RS. Marcus Gunn Syndrome associated with an unusual oculo-cardiac reflex. Anaesthesia. 1980 Jan;35(1):46-9. [PubMed: 7396112]\nDisclosure: Vijayalakshmi Senthilkumar declares no relevant financial relationships with ineligible companies.\nDisclosure: Koushik Tripathy declares no relevant financial relationships with ineligible companies.\n- Continuing Education Activity\n- Introduction\n- Etiology\n- Epidemiology\n- Pathophysiology\n- Histopathology\n- History and Physical\n- Evaluation\n- Treatment / Management\n- Differential Diagnosis\n- Staging\n- Prognosis\n- Complications\n- Deterrence and Patient Education\n- Pearls and Other Issues\n- Enhancing Healthcare Team Outcomes\n- Review Questions\n- References\n- Marcus Gunn Jaw-Winking Synkinesis With Ipsilateral Eyelid Myokymia.[Ophthalmic Plast Reconstr Surg...]Marcus Gunn Jaw-Winking Synkinesis With Ipsilateral Eyelid Myokymia.Althaqib RN, Khan AO, Alsuhaibani AH. Ophthalmic Plast Reconstr Surg. 2020 Nov/Dec; 36(6):566-568.\n- Review Surgical Interventions for Management of Marcus Gunn Jaw-Winking Phenomenon: A Systematic Review.[Cureus. 2025]Review Surgical Interventions for Management of Marcus Gunn Jaw-Winking Phenomenon: A Systematic Review.Musa AM, AlKayyat A, Alrawi S, Atallah OW, Atoui A, Qamhieh I, Ghawanmeh EM. Cureus. 2025 Apr; 17(4):e82438. Epub 2025 Apr 17.\n- Unilateral Levator Aponeurosis Excision for Marcus Gunn Syndrome and Risk Factors of Residual Jaw Winking.[J Ophthalmol. 2019]Unilateral Levator Aponeurosis Excision for Marcus Gunn Syndrome and Risk Factors of Residual Jaw Winking.Ning Q, Cao J, Xie J, Gao Q, Wang C, Ye J. J Ophthalmol. 2019; 2019:2058047. Epub 2019 Nov 4.\n- Unilateral Frontalis Suspension With Silicone Sling Without Levator Extirpation in Congenital Ptosis With Marcus Gunn Jaw Winking Synkinesis.[Ophthalmic Plast Reconstr Surg...]Unilateral Frontalis Suspension With Silicone Sling Without Levator Extirpation in Congenital Ptosis With Marcus Gunn Jaw Winking Synkinesis.Shah G, Khurana D, Das S, Tiple S, Honavar SG. Ophthalmic Plast Reconstr Surg. 2020 Jul/Aug; 36(4):390-394.\n- Review Progress in MGJWS: A 74-Year Review of Marcus Gunn Jaw-Winking Syndrome.[J Child Neurol. 2025]Review Progress in MGJWS: A 74-Year Review of Marcus Gunn Jaw-Winking Syndrome.Zhuang S, Qi Q, Lin M, Li J. J Child Neurol. 2025 Feb; 40(2):132-147. Epub 2024 Dec 8.\n- Marcus Gunn Jaw-Winking Syndrome - StatPearlsMarcus Gunn Jaw-Winking Syndrome - StatPearls\nYour browsing activity is empty.\nActivity recording is turned off.\nSee more..."
    },
    {
      "url": "http://theblast.com/tag/emily-elizabeth",
      "text": "Emily Elizabeth\nEmily Elizabeth In Tiny Black Bikini Teases Major Spillage\nEmily Elizabeth Turns Up The Heat With Sizzling Bikini Selfie\nEmily Elizabeth In Red Lingerie And Glasses Looks 'So Innocent'\nEmily Elizabeth In Teeny Tiny Bikini Teases Major Spillage\nEmily Elizabeth In Yellow Bikini Gets Named As 'Summer's Hottest Babe'\nEmily Elizabeth In Black Lace Lingerie Teases Jaw-Dropping Selfie\nEmily Elizabeth Baring Abs In Bikini Dubbed As 'Hottest Female Alive'\nEmily Elizabeth In Tight Pink Bikini Shows Off Her 'Massive Melons'\nEmily Elizabeth In Minuscule Mint Bikini Is Making 'Summer Even Hotter'\nEmily Elizabeth In Tight Printed Bikini Gives A 'Gorgeous Sight'\nEmily Elizabeth In A Teeny Tiny Red Bikini Brings 'Heaven On Earth'\nEmily Elizabeth In Tiny Bikini Shows Off Her 'Cherries'\nEmily Elizabeth In A Blue String Bikini Is Deemed The 'Ultimate Fantasy'\nEmily Elizabeth Filming A Video In Mismatched Bikini Shows 'Bouncy View'\nEmily Elizabeth In Black Bikini Shows 'Breakfast With A Busty View'\nEmily Elizabeth In Tight Yellow Bikini 'Makes Summer Even Hotter'\nEmily Elizabeth Teases Wet Bikini Backside View In Outdoor Shower\nEmily Elizabeth Pops Her Bikini Buns Out For A Beach Bicycle Ride\nEmily Elizabeth In Cheeky Printed Bikini Looks 'Better Than The Beach'"
    }
  ],
  "argos_summary": "Influencer Emily Elizabeth addressed a fan's inquiry about her breast size during a recent Q&A session, asserting that her body is entirely natural and sharing a photo in a revealing swimsuit. She also disclosed having Marcus Gunn Syndrome, a rare genetic condition that causes her eyelid to move when she eats, due to an abnormal connection between the nerves controlling her jaw and eyelid. While surgery is an option for severe cases, it is generally not necessary unless vision is affected.",
  "argos_id": "C928ZNVL2"
}