{
  "url": "https://www.newsweek.com/justice-department-issues-birthright-citizenship-update-2110176",
  "authorsByline": "Robert Alexander",
  "articleId": "80341b6fb6dc416ca01ff174c84f0b3d",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2673134/birthright-citizenship-injunctions.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T08:57:23-04:00",
  "addDate": "2025-08-07T13:04:35.871068+00:00",
  "refreshDate": "2025-08-07T13:04:35.871071+00:00",
  "score": 1.0,
  "title": "Justice Department Issues Birthright Citizenship Update",
  "description": "Fight over Trump's order to deny birthright citizenship heads toward Supreme Court, with 14th Amendment protections at stake",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nThe U.S. Department of Justice has released an update confirming that it plans to ask the Supreme Court to rule on the constitutionality of President Donald Trump's executive order seeking to end birthright citizenship.\n\nThe announcement was disclosed in a joint status report filed Wednesday, August 6, 2025, in the U.S. District Court for the Western District of Washington.\n\nThe Justice Department's plan to seek a Supreme Court ruling on the constitutionality of President Donald Trump's executive order to end birthright citizenship—entitled \"Protecting the Meaning and Value of American Citizenship\"—marks a critical juncture in the national debate over immigration and constitutional rights.\n\nSigned on January 20, 2025, it directs the federal government to deny citizenship documents to children born in the U.S. to undocumented or temporary immigrant parents.\n\nAt stake is the interpretation of the 14th Amendment, which has long been understood to guarantee citizenship to nearly all individuals born on U.S. soil. A ruling in favor of the order could reshape federal authority over citizenship, impact millions of U.S.-born children, and redefine the limits of executive power—making this one of the most consequential legal battles in recent memory.\n\nWhat To Know\n\nOn February 6, 2025, the district court in Seattle issued a nationwide preliminary injunction blocking enforcement of President Trump's executive order.\n\nThe case under review, State of Washington v. Trump, was just one of several ongoing legal challenges in which lower courts have largely rejected the administration's legal theory. District courts in Maryland (February 5), New Hampshire (February 10), and Massachusetts (February 13), have each upheld that the order conflicted with constitutional protections and halted its enforcement in their respective jurisdictions.\n\nOne of those judges, U.S. District Judge Leo Sorokin, an appointee of former President Barack Obama who sits on the federal bench in Boston, granted a nationwide preliminary injunction, affirming that the constitutional guarantee of citizenship applies broadly, and finding the policy to be, \"unconstitutional and contrary to a federal statute.\"\n\nThe government appealed the ruling and sought partial stays from the district court, the Ninth Circuit, and the Supreme Court. After the Supreme Court denied a partial stay, the Ninth Circuit requested further briefing and, on July 23, upheld the injunction.\n\nThe new update came in a joint status report filed August 6, 2025, in which the DOJ stated that Solicitor General D. John Sauer intends to file a petition \"expeditiously\" for certiorari—a legal term that refers to the process by which a higher court (most commonly the U.S. Supreme Court), agrees to review a lower court's decision—in order to place the case before the Court during its next term, which begins in October.\n\nThis means the Justice Department has now formally indicated it will seek a U.S. Supreme Court ruling on the constitutionality of President Trump's executive order; though it has not yet chosen which specific case—or combination of ongoing cases—it will use as the basis for its appeal.\n\nThe parties plan to update the court further once those appellate steps are finalized.\n\nSince the adoption of the 14th Amendment to the United States Constitution on July 9, 1868, the citizenship of persons born in the United States has been controlled by its Citizenship Clause, which states: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" Courts have consistently upheld this principle for more than a century, most notably in the 1898 Supreme Court case United States v. Wong Kim Ark.\n\nHowever, the Trump administration argues that the amendment should not apply to children of parents who lack permanent legal status, a position that has been repeatedly rejected by lower courts.\n\nWhat People Are Saying\n\nPresident Trump, during an interview with NBC's Meet the Press, December 8, 2024, said: \"Do you know if somebody sets a foot—just a foot, one foot, you don't need two—on our land, 'Congratulations you are now a citizen of the United States of America,' … Yes, we're going to end that, because it's ridiculous.\" Adding: \"...we're going to have to get it changed. We'll maybe have to go back to the people, but we have to end it. … We're the only country that has it, you know.\"\n\nAttorney General Pam Bondi told reporters in June 2025: \"Birthright citizenship will be decided in October, in the next session by the Supreme Court.\"\n\nDOJ attorneys wrote in the filing: \"In light of the Ninth Circuit's decision, Defendants represent that the Solicitor General plans to seek certiorari expeditiously to enable the Supreme Court to settle the lawfulness of the Citizenship Order next Term.\"\n\nJessica Levinson, constitutional law professor at Loyola Law School, said: \"You can't 'executive order' your way out of the Constitution. If you want to end birthright citizenship, you need to amend the Constitution, not issue an executive order.\"\n\nWhat Happens Next\n\nThe Justice Department must decide which case or combination of cases it will use to challenge lower court rulings and bring the birthright citizenship issue before the Supreme Court. Once it makes that decision, the DOJ will file a petition for certiorari.\n\nThe Court is not required to accept every petition, but because this involves a major constitutional question, it is likely to grant review. If that happens, the Court could hear arguments in 2026 and issue a ruling by June of that year.\n\nFor now, the Justice Department and attorneys representing plaintiff states—including Washington, Arizona, Illinois, and Oregon—have agreed to submit another update once the appellate process is clarified or if further proceedings in the district court are required. Until then, the order remains unenforceable, lower court rulings blocking Trump's executive order remain in effect, and current birthright citizenship protections continue to apply.",
  "medium": "Article",
  "links": [
    "https://www.newsweek.com/topic/department-justice",
    "https://www.newsweek.com/topic/supreme-court",
    "https://www.newsweek.com/topic/barack-obama",
    "https://www.newsweek.com/topic/donald-trump"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. Supreme Court",
      "weight": 0.0901037
    },
    {
      "name": "Supreme Court",
      "weight": 0.08506814
    },
    {
      "name": "Birthright Citizenship Update",
      "weight": 0.08483914
    },
    {
      "name": "Birthright citizenship",
      "weight": 0.08442232
    },
    {
      "name": "birthright citizenship",
      "weight": 0.08442232
    },
    {
      "name": "lower court rulings",
      "weight": 0.081650026
    },
    {
      "name": "current birthright citizenship protections",
      "weight": 0.07810376
    },
    {
      "name": "lower courts",
      "weight": 0.07500926
    },
    {
      "name": "President Trump",
      "weight": 0.07253101
    },
    {
      "name": "District courts",
      "weight": 0.07190091
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.958984375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.79443359375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.73193359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.71337890625
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.70263671875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.471435546875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.45068359375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.4306640625
    }
  ],
  "sentiment": {
    "positive": 0.07745361,
    "negative": 0.6040039,
    "neutral": 0.31860352
  },
  "summary": "The U.S. Department of Justice has issued an update confirming plans to ask the Supreme Court to rule on the constitutionality of President Donald Trump's executive order to end birthright citizenship. The executive order, which was signed on January 20, 2025, instructs the federal government to deny citizenship documents to children born in the US to undocumented or temporary immigrant parents. The issue is crucial in the national debate over immigration and constitutional rights. A ruling in favor of the order could reshape federal authority over citizenship, impact millions of U.K.-born children, and redefine the limits of executive power. The government has not yet specified which case it will use as the basis for its appeal.",
  "shortSummary": "The US Justice Department is seeking a Supreme Court ruling on President Donald Trump's executive order to end birthright citizenship, amid ongoing legal challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d1044d2a2f344662a40cf29d46036ad8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/topic/barack-obama",
      "text": "Justice Department Issues Birthright Citizenship Update\nFight over Trump's order to deny birthright citizenship heads toward Supreme Court, with 14th Amendment protections at stake\nObama grand jury convening in Florida would be major boost for Trump\nWhile the grand jury venue has not yet been announced, placing it outside D.C. would serve as a tactical win for the president.\nMichelle Obama speaks out about husband Barack's \"sexy\" trait\nThe former first lady said she judged her husband's name and looks before meeting him.\nTrump's DOJ moves to revive grand jury inquiry into Russia probe origins\nIt's uncertain the specific misconduct Trump officials believe could justify criminal charges, which would require grand jury approval.\nTrump issues new threat to Obama, Clinton over Russia probe: \"pay a price\"\nTrump said claims Russia interfered to help him win the 2016 presidential election \"could be the biggest scandal in the history of our country.\"\nNobel Prize winners react to idea of Trump winning economics award\nWhite House trade adviser Peter Navarro believes President Trump's trade policies have earned him a nomination for the award.\nBarack Obama defeats Trump by double-digit margin in new hypothetical poll\nObama holds favor over Trump, though the current president is viewed in a better light than ex-President Joe Biden and Hillary Clinton.\nAlina Habba's authority challenged in drugs lawsuit\nAlina Habba's role as acting U.S. Attorney faces a test after an attorney in a drug and weapons case filed a motion challenging her authority to prosecute it.\nDonald Trump says his Supreme Court win helps Obama—\"He owes me big\"\nThe U.S. Supreme Court's ruling last year on presidential immunity has broadened the limits of legal protection for presidents.\nBarack Obama sees death threat surge after Trump's treason claims\nA new report has documented the rise in death threats that the former president has received since Donald Trump accused him of treason.\nMichelle Obama on opening up about life with Barack—\"It can feel dangerous\"\nThe former first lady recently addressed divorce rumors with the former president.\nBarack Obama responds to Donald Trump's Russia \"treason\" threats\nBesides Obama, President Trump on Tuesday rattled off a list of people he accused of acting criminally \"at the highest level.\"\nDonald Trump says Barack Obama committed \"treason\" amid Epstein fallout\nAmid GOP conflict over how to handle the release of information related to Jeffrey Epstein, Trump is working to shift the spotlight.\nBarack Obama could be subpoenaed over declassified docs: What to know\nHouse Speaker Mike Johnson said: \"There's a lot of allegations on the table—our job is go and follow each of those trails and to find out the truth.\"\nDonald Trump's Obama AI arrest video is mere \"distraction\": Legal analysts\nLegal analysts weighed in on an AI-generated video Trump reposted showing federal law enforcement arresting former President Obama.\nDonald Trump posts AI video of Obama's arrest: \"No one is above law\"\nTulsi Gabbard has alleged that Obama's administration manufactured intelligence about Russian interference in the 2016 election.\nIntersectional Communist Zohran Mamdani Shows Democrats Can't Quit Obamaism\nMamdani singlehandedly encapsulates the unholy \"red-green\" alliance.\nBarack Obama, Michelle address divorce rumors\nThe former president and first lady's relationship has been a hot topic since the start of this year.\nRoseanne Barr addresses ABC firing after racist tweet\n\"They got rid of me for a lot of reasons,\" the comedian said on a recent podcast.\nBarack and Michelle Obama team with Larry David for new HBO series\nThis new series about American history brings David back to a sketch comedy format—only now with presidential producers in the wings.\nMichelle Obama reveals Barack parenting hack\nThe former first lady and her husband share two daughters together, Malia and Sasha.\nWhat Happened to Democrats' Patriotism? | Opinion\nAs Americans marked the 249th anniversary of the Declaration of Independence last weekend, polling data on patriotism highlighted an alarming trend.\nQueen Elizabeth II's President Trump comment goes viral\nA comment by Queen Elizabeth II comparing U.S. President Donald Trump to a helicopter has resurfaced on TikTok.\nDonald Trump second-most popular president of 21st century, poll finds\nThe latest Quantus Insights survey shows that Barack Obama remains the most favorably viewed U.S. president of the 21st century.\nGeorge W. Bush joins Obama in rebuke of Trump\nThe videoconference marked the end of USAID's 63-year run as an independent agency before its absorption into the State Department.\nMichelle Obama speaks out on Barack split rumors\nPodcast host Meghan McCain previously said she heard the couple was getting a divorce \"by reputable people.\"\nIran's Supreme Leader challenges Trump\nAn intense online war of words between Iran's Supreme Leader and U.S. President over recent nuclear strikes is escalating tensions.\nSupreme Court doesn't have 5 votes to uphold birthright citizenship: ex-AG\nFormer U.S. Attorney General Alberto Gonzales spoke at a forum hosted in Aspen, Colorado, on Sunday alongside fellow former deputy AG Sally Yates.\nTrump Jr says Obama getting Nobel Prize over father is \"affirmative action\"\nBarack Obama won the Nobel Peace Prize in 2009 for his \"extraordinary efforts to strengthen international diplomacy and cooperation between peoples.\"\nPresidential Pardons Are a Dirty Business | Opinion\nPresidential pardons reflect the sleazy reality of modern-day politics, one befitting a mob boss, not U.S presidents."
    },
    {
      "url": "https://www.newsweek.com/topic/supreme-court",
      "text": "Justice Department Issues Birthright Citizenship Update\nFight over Trump's order to deny birthright citizenship heads toward Supreme Court, with 14th Amendment protections at stake\nWhat Supreme Court justices said about gerrymandering\nThe Texas showdown has revived gerrymandering fears as the Supreme Court's 2019 Rucho ruling left redistricting power unchecked.\nSupreme Court \"likely\" to deal blow to key Trump policy: Ex-GOP speaker\nFormer House Speaker Paul Ryan said he believes the Supreme Court will rule against Trump's tariff policy if the case reaches it.\nTrump Hails Major Court Win in Texas: 'Should Be Nationwide'\nFederal court backs Texas mail-in voter ID rule, praised by Trump but criticized by others as suppressing minority and elderly voters.\nLaura Loomer files new Supreme Court petition—\"Accountability is coming\"\n\"Everyone involved in what happened to me will pay a price,\" the conservative said on X.\nCan Greg Abbott kick out fleeing Democrats? Experts weigh in\nThe Texas governor's threat to oust state Democrats faces legal hurdles.\nDonald Trump's effort to overturn birthright citizenship struggles in court\nPresident Donald Trump's executive order has faced repeated roadblocks, but the administration continues appealing up to the Supreme Court.\nGhislaine Maxwell subpoena update as House waits on Supreme Court\nMaxwell's legal team warned she would invoke her Fifth Amendment right against self-incrimination unless certain conditions were met.\nTrump Ally Faces Disbarment for 'Dishonesty': Panel\nD.C. Bar panel moves to disbar Trump ally Jeffrey Clark over false 2020 fraud claims.\nBrett Kavanaugh warns of \"danger\" in some Supreme Court opinions\nKavanaugh's comments to judges and lawyers in Kansas City come as the Supreme Court faces criticism over using emergency orders.\nSupreme Court's ideologically split rulings occur less often than you think\nThe Supreme Court decided under 10 percent of its cases with an ideologically split vote during the 2024 term.\nTrump Rightly Identified Homelessness as a Problem | Opinion\nIs President Donald Trump seeking to use the law to create an Alligator Alcatraz for America's homeless?\nGhislaine Maxwell makes next Supreme Court move\nServing 20 years, Maxwell's filing comes 3 days after meeting a top DOJ official assigned to re-examine the Epstein case.\nHow Ghislaine Maxwell might reduce her prison term\nGhislaine Maxwell is serving 20 years, but may seek early release through DOJ cooperation or presidential clemency.\nDonald Trump says his Supreme Court win helps Obama—\"He owes me big\"\nThe U.S. Supreme Court's ruling last year on presidential immunity has broadened the limits of legal protection for presidents.\nSupreme Court's peacemaker speaks out—\"Scary stuff\"\nJustice Elena Kagan addressed the rise in threats against judges, and urged them to \"not be inhibited\" as they go about their work.\nGrading the Second Trump Presidency, Six Months In\nAwareness of life's ticking clock is important for any elected official, but it is particularly important for Trump.\nGavin Newsom blasts Judges Over Gun Ruling: 'Slap In The Face'\nIn a 2-1 decision, a federal appeals court struck down a voter-backed California law that required background checks for people who buy bullets.\nClarence Thomas and Samuel Alito signal support to weaken Voting Rights Act\nJustice Brett Kavanaugh granted a stay, but fellow conservatives Thomas, Alito, and Gorsuch would have denied the application.\nKilmar Abrego Garcia scores major legal win\nFederal judges ordered Kilmar Abrego Garcia's release and return to Maryland after his unlawful deportation\nElena Kagan warns Supreme Court just \"all but overturned\" 90-year precedent\nThe High Court's three liberal judges dissented as the majority allowed Trump to remove members of the Consumer Product Safety Commission.\nSupreme Court hands Donald Trump 16th win in a row\nJustices granted emergency request from the DOJ, which argued the president has authority to remove commissioners without cause.\nHow Supreme Court may play a role in Jeffrey Epstein saga\nGhislaine Maxwell has appealed her conviction to the nation's highest court.\nSupreme Court urged by NBA to clarify 37-year-old law\nThe NBA is urging the Supreme Court to give a definitive interpretation of a law enacted to protect video rental and viewing records.\nStudent loan update: How new Supreme Court ruling may impact borrowers\nThe high court lifted a federal injunction that had blocked the termination of approximately 1,400 employees.\nWhat Epstein grand jury testimony could include\nAttorney General Pam Bondi said she would seek the release of the Epstein grand jury transcripts today, at Donald Trump's request. What will they show?\nSupreme Court may soon consider overturning 45-year precedent\n\"The 6-3 majority on the Supreme Court will decide what they want and then try to rationalize it,\" one First Amendment advocate told Newsweek.\nFull list as Supreme Court rules for Donald Trump 15 times in a row\nThe U.S. Supreme Court quietly backed Trump's agenda, enabling rapid federal government restructuring without explanation.\nBrazil Supreme Court's legal war with Truth Social, Rumble escalates\nA Brazilian judge's order involving a U.S. citizen has intensified global free speech tensions over alleged online censorship.\nSupreme Court may weaken 1965 Voting Rights Act further\n\"This Court has been extraordinarily unfriendly to the Voting Rights Act over the last couple of decades,\" a voting rights expert told Newsweek."
    },
    {
      "url": "https://www.newsweek.com/topic/donald-trump",
      "text": "Putin reveals where Trump meeting could take place\nVladimir Putin has said the United Arab Emirates would be \"one of the more suitable locations\" for talks with President Donald Trump regarding the Ukraine war.\nDonald Trump issues ultimatum to Intel CEO: \"Resign, immediately\"\nPresident Donald Trump has called Intel CEO Lip-Bu Tan \"highly conflicted.\"\nJustice Department Issues Birthright Citizenship Update\nFight over Trump's order to deny birthright citizenship heads toward Supreme Court, with 14th Amendment protections at stake\nMap shows where US will start deep sea mining in the Pacific\nThe U.S. has struck a deal with the Cook Islands to help capitalize on the island nation's critical mineral potential.\nTrump orders new census excluding undocumented immigrants\nTrump says he's ordered a new census excluding undocumented immigrants, using data from the 2024 election as a foundation.\nSyria's Islamist Regime Is Testing the West—and Winning | Opinion\nTurning a blind eye to what is happening in Syria again would be a stain not just on American foreign policy, but on the conscience of the free world.\nDonald Trump's support among Latinos cracking on key issue\nMost Latino voters disapprove of the president's handling of the economy, a poll has shown.\nGhislaine Maxwell banned from service dog training\nMaxwell, who was convicted of helping Jeffrey Epstein sexually abuse underage girls, was recently transferred to a minimum-security prison.\nMap tracker reveals Trump's new tariffs on every country\nMost of the new duties kicked in Thursday, hitting countries with elevated rates that mark a departure from long-standing trade norms.\n\"South Park\" unleashes on JD Vance in new episode\nThe satirical series, which previously ridiculed President Donald Trump, did not hold back in episode two of its 27th season.\nTariffs Threaten to Destroy America's AI Dominance | Opinion\nPresident Donald Trump has positioned the United States to lead in the global AI race.\nWhat Supreme Court justices said about gerrymandering\nThe Texas showdown has revived gerrymandering fears as the Supreme Court's 2019 Rucho ruling left redistricting power unchecked.\nTrump's relationship with Modi sours over Putin\nThe rapport between the leaders of the U.S. and India has dived over New Delhi's purchase of Russian oil.\nIndia's Modi sends message to Trump over tariffs\nThe Indian prime minister has said his country \"is ready\" to react to President Donald Trump's additional 25 percent levy on goods entering the U.S.\nJB Pritzker reacts to possibility of FBI arresting Texas Democrats\n\"They're grandstanding,\" Pritzker said, brushing off President Trump's threats. \"There literally is no federal law applicable to this situation.\"\nZohran Mamdani reacts to report Trump could get involved in NYC race\nThe outcome of New York's mayoral election may serve as a litmus test for the future direction of Democratic politics.\nSydney Sweeney's \"Great Jeans\" Illuminate Resurgence of Eugenics | Opinion\nConsumers should stand up for the diversity we want by boycotting companies like American Eagle that reject these values.\nTrump brushes off major success from first term: \"Long time ago\"\nThe president briefly acknowledged the success of Operation Warp Speed before quickly brushing it off.\nSupreme Court \"likely\" to deal blow to key Trump policy: Ex-GOP speaker\nFormer House Speaker Paul Ryan said he believes the Supreme Court will rule against Trump's tariff policy if the case reaches it.\nTrump scores two big wins in one as NATO buys US arms for Ukraine\nNATO members have started moving weapons to Kyiv under a new Trump-led initiative that leaves US taxpayers off the hook.\nLinda McMahon interrupted by circus music at conservative conference\nCircus music started blaring as Linda McMahon discussed Donald Trump's working style and said he knows \"how to make things run.\"\nDad in US for 29 years who previously had temporary green card deported\nA man who had lived in the United States for nearly 30 years and once held conditional permanent residency was deported to Mexico.\nTrump gives update on Russia talks after calling Kremlin a \"threat\"\nTrump touted a meeting between special envoy Steve Witkoff and Russian President Vladimir Putin in a Truth Social post.\n'South Park' scrubbed from HBO Max this week: here's why\nThe departure from HBO Max has nothing to do with its recent depiction of Trump, as it was originally scheduled as part of South Park's new deal.\nDonald Trump threatens 250% tariff on pharmaceuticals\nThe threat comes as Trump's administration pressures pharmaceutical companies to lower drug prices for Americans.\nTrump administration says teenagers can now be ICE agents\nICE is offering incentives including signing bonuses of up to $50,000, student loan forgiveness and extensive overtime opportunities.\nEvery celebrity in photos from inside Jeffrey Epstein's townhouse\nThe New York Times published photos showing framed pictures of many powerful figures on display inside Epstein's seven-story Manhattan townhouse.\nTrump and Putin are flexing their way toward a nuclear stand-off\n\"Rhetoric sometimes turns into action in unpredictable ways,\" a former senior U.S. arms control official told Newsweek.\nJD Vance denies 'strategy mission' meeting over Epstein files\nVice President JD Vance has denied reports that he was planning to host a \"strategy mission\" meeting to discuss the Jeffrey Epstein files at his home on Wednesday. Newsweek's live blog is closed.\nDonald Trump imposes 25 percent additional tariff on India: What to know\nThe president accused the major U.S. trading partner of \"directly or indirectly\" importing Russian oil."
    },
    {
      "url": "https://www.newsweek.com/topic/department-justice",
      "text": "Justice Department Issues Birthright Citizenship Update\nFight over Trump's order to deny birthright citizenship heads toward Supreme Court, with 14th Amendment protections at stake\nObama grand jury convening in Florida would be major boost for Trump\nWhile the grand jury venue has not yet been announced, placing it outside D.C. would serve as a tactical win for the president.\nTrump officials to discuss handling of Jeffrey Epstein case: Report\nThe pending decision comes as Congress, sex abuse victims and political leaders across the aisle intensify calls for transparency.\nDonald Trump's DOJ may release Ghislaine Maxwell interview: Reports\nThe push to make the transcript public comes amid pressure from Trump allies and the House GOP to unseal grand jury materials.\nTrump Hails Major Court Win in Texas: 'Should Be Nationwide'\nFederal court backs Texas mail-in voter ID rule, praised by Trump but criticized by others as suppressing minority and elderly voters.\nTrump's DOJ moves to revive grand jury inquiry into Russia probe origins\nIt's uncertain the specific misconduct Trump officials believe could justify criminal charges, which would require grand jury approval.\nEpstein victim says Trump's reported move \"monumentally mind-blowing\"\nTwo unidentified Epstein victims urged a Manhattan court to review files for privacy concerns before any public release.\nTrump's deportation quota comes under scrutiny\nLawyers for the DOJ said \"neither ICE leadership nor its field offices\" were directed to meet any numerical quota for arrests.\nGhislaine Maxwell subpoena update as House waits on Supreme Court\nMaxwell's legal team warned she would invoke her Fifth Amendment right against self-incrimination unless certain conditions were met.\nDonald Trump's name in Jeffrey Epstein files redacted by FBI: report\nThe Justice Department says the review turned up no \"client list\" or evidence linking President Trump to criminal activity,\nTrump Ally Faces Disbarment for 'Dishonesty': Panel\nD.C. Bar panel moves to disbar Trump ally Jeffrey Clark over false 2020 fraud claims.\nVirginia Giuffre's brother on Epstein files: Expose \"these Monsters\"\nBondi has faced the brunt of the backlash from MAGA and Democrats alike as lawmakers plead for transparency in the Epstein investigation.\nChance of Ghislaine Maxwell naming names may rise dramatically\nA major impediment to Ghislaine Maxwell spilling Jeffrey Epstein secrets will be removed but not yet, an attorney told Newsweek.\nSeven new Epstein jail video issues under scrutiny\nThe Department of Justice released surveillance footage that was meant to prove that Epstein died by suicide behind bars.\nExplained: The misconduct complaint against Judge James Boasberg\nThe Department of Justice has accused a top D.C. judge of bias over remarks about the Trump administration in an immigration case.\nAlina Habba's authority challenged in drugs lawsuit\nAlina Habba's role as acting U.S. Attorney faces a test after an attorney in a drug and weapons case filed a motion challenging her authority to prosecute it.\nJeffrey Epstein had \"dirt\" on Donald Trump, Hillary Clinton, brother says\nThe late said 'if I said what I knew about the candidates they'd have to cancel the election,' according to his brother.\nJudge hit with complaint over making \"improper\" comments about Trump\nJudge Boasberg has been at the center of MAGA fury as he has presided over the case involving the Trump administration's speedy deportation of migrants.\nGhislaine Maxwell makes next Supreme Court move\nServing 20 years, Maxwell's filing comes 3 days after meeting a top DOJ official assigned to re-examine the Epstein case.\nHow Ghislaine Maxwell might reduce her prison term\nGhislaine Maxwell is serving 20 years, but may seek early release through DOJ cooperation or presidential clemency.\nGhislaine Maxwell offered conditional immunity in DOJ interviews: Reports\nGhislaine Maxwell was offered a limited form of immunity before agreeing to field questions from the Department of Justice, ABC News reports.\nGhislaine Maxwell's lawyer reacts to Trump's pardon comments\nGhislaine Maxwell's lawyer addressed Trump's remarks after Maxwell met with a top DOJ official for a second day.\nGhislaine Maxwell can 'finally say what really happened', says lawyer\nGhislaine Maxwell's lawyer has spoken out as she heads into a second day of interview with Deputy Attorney General Todd Blanche.\nHow Epstein fallout hit Donald Trump, Pam Bondi's DOJ—new poll\nNew polling reveals that the fallout from the Jeffrey Epstein scandal continues to cast a shadow over Donald Trump and his administration.\nPam Bondi Is handed another headache\nAttorney General Bondi's firing of three Department of Justice officials is being challenged in court.\nGhislaine Maxwell faces new meeting today: what we know\nMaxwell is meeting with the Department of Justice today.\nDOJ Sues Eric Adams Over Sanctuary Policies: What To Know\n\"If New York City won't stand up for the safety of its citizens, we will,\" Attorney General Pam Bondi said.\nAlina Habba declares she's acting US attorney again\nHabba's announcement came after a public standoff between the Trump administration and the judiciary.\nTrump's Deputy AG speaks out after meeting with Ghislaine Maxwell\nMaxwell's Florida meeting with Deputy Attorney General Todd Blanche comes amid mounting pressure from President Trump's supporters.\nKilmar Abrego Garcia scores major legal win\nFederal judges ordered Kilmar Abrego Garcia's release and return to Maryland after his unlawful deportation"
    }
  ],
  "argos_summary": "The U.S. Department of Justice plans to seek a Supreme Court ruling on the constitutionality of President Trump's executive order aimed at ending birthright citizenship, which has faced legal challenges and injunctions from lower courts. The order, signed in January 2025, seeks to deny citizenship to children born in the U.S. to undocumented or temporary immigrant parents, raising significant constitutional questions regarding the 14th Amendment. The DOJ intends to file a petition for certiorari to expedite the case's review, with potential arguments to be heard in 2026.",
  "argos_id": "D0YRZX8U1"
}