{
  "url": "https://finance.yahoo.com/news/polymarket-slammed-disrespectful-dildo-throwing-135201432.html",
  "authorsByline": "Tim Craig",
  "articleId": "0a19ecedca3b473cbddee580d0b96840",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/oq7_YcQTPRoGcqwhW6Ua.Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03ODU7Y2Y9d2VicA--/https://media.zenfs.com/en/dlnews_702/2af8b0ae37420441d8de958d0db0435c",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:52:01+00:00",
  "addDate": "2025-08-07T14:07:20.118606+00:00",
  "refreshDate": "2025-08-07T14:07:20.118607+00:00",
  "score": 1.0,
  "title": "Polymarket slammed for ‘disrespectful’ dildo throwing bets after second man is arrested at WNBA game",
  "description": "Polymarket leans into dildo throwing trend at WNBA games. Critics say it's disrespectful. The betting platform's promotion could encourage even more copycat incidents.",
  "content": "Critics are calling out Polymarket after it promoted bets on whether or not Women’s pro basketball games will be interrupted by someone in the crowd throwing a dildo onto the court.\n\n“Announcing: Dildo dailies,” the Polymarket Sports X account posted on Wednesday. “You can now bet on which day(s) dildos will hit the WNBA court.”\n\nSo far, bettors have traded almost $500,000 worth of bets on which games will be interrupted by sex toys being hurdled at the female athletes, even going as far as to bet on the colour of the martial aids.\n\nYet many were not enthused by the new opportunity.\n\n“This is so disrespectful to the women professionals who play in the WNBA,” one person said in response to the post. “Imagine this was your daughter or sister and they played in the WNBA and this was being done at their games.”\n\n“This type of stuff literally incentivises people to throw dildos onto the court,” said another.\n\nIt comes after a man was arrested at a Phoenix Mercury game on August 5 after throwing a dildo towards the court, allegedly hitting a man and his nine-year-old niece.\n\nIt’s the second arrest since July 29, when a sex toy was first thrown onto the court during a Women’s National Basketball Association game between the Golden State Valkyries and the Atlanta Dream.\n\nThe promotion of betting surrounding the sexist trend could encourage even more copycat incidents, critics say.\n\nBoth arrested alleged dildo throwers said they pulled the stunts in an attempt to go viral on social media.\n\nTo be sure, Polymarket isn’t the only platform letting users bet on WNBA games being disrupted by sex toys.\n\nBetOnline, an online gambling firm that was among the first to let gamblers bet with Bitcoin in its online poker rooms, also offers a range of similar dildo-based bets.\n\nPolymarket jumping on the dildo throwing trend also feeds into claims that crypto has a misogyny problem.\n\nA 2024 report from Association for Women in Cryptocurrency found that 82% of approximately 400 women surveyed believed the industry is not free from harassment.\n\nMultiple women have spoken out about alleged sexual misconduct and said the crypto industry suffers from a culture of sexism.\n\nIt’s also another setback for Polymarket, which has been hit by several controversies in recent months.\n\nIn June, bettors came to blows over the disputed outcome of a betting market that asked if Ukrainian President Volodomyr Zelensky had worn a suit.\n\nIn January, the betting platform faced backlash after it let users gamble on the level of destruction wrought by the California wildfires.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/sport/wnba/article-14965593/Gambling-company-offers-vulgar-bets-WNBA-games-sex-toys.html",
    "https://x.com/JohnKandy9/status/1953189198992740377",
    "https://x.com/PolymarketSport/status/1953106021842599950",
    "https://www.fox10phoenix.com/news/man-arrested-throwing-sex-toy-phoenix-mercury-crowd-court-docs-say",
    "https://x.com/notolymp1a/status/1953184524218560759",
    "https://assets-global.website-files.com/6031cc2571d7e87d40edd267/6604480a750574b4af68c0fc_AWIC%20State%20of%20Inclusion%20Report.pdf",
    "https://protos.com/polymarket-faces-backlash-over-sick-california-wildfire-markets/",
    "https://www.dlnews.com/articles/markets/polymarket-bettors-clash-over-zelenskyy-suit-dispute/",
    "https://www.cosmopolitan.com/entertainment/celebs/a65614990/why-throwing-dildos-wnba-games/",
    "https://www.dlnews.com/articles/people-culture/woman-drugged-by-dwf-labs-exec-urges-crypto-to-fight-sexism/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "WNBA game",
      "weight": 0.09723559
    },
    {
      "name": "WNBA games",
      "weight": 0.09723559
    },
    {
      "name": "Dildo dailies",
      "weight": 0.0838814
    },
    {
      "name": "dildos",
      "weight": 0.081856705
    },
    {
      "name": "Polymarket Sports X",
      "weight": 0.07508184
    },
    {
      "name": "Polymarket",
      "weight": 0.06886794
    },
    {
      "name": "sex toys",
      "weight": 0.06679856
    },
    {
      "name": "WNBA",
      "weight": 0.06596158
    },
    {
      "name": "second man",
      "weight": 0.063117824
    },
    {
      "name": "Ukrainian President Volodomyr Zelensky",
      "weight": 0.06308495
    }
  ],
  "topics": [
    {
      "name": "WNBA"
    },
    {
      "name": "Basketball"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97705078125
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.95068359375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.55810546875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.40185546875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.368896484375
    }
  ],
  "sentiment": {
    "positive": 0.042022705,
    "negative": 0.7597656,
    "neutral": 0.19824219
  },
  "summary": "Critics are criticizing Polymarket for promoting bets on whether or not pro basketball games will be interrupted by someone throwing a dildo onto the court during games. The company's Sports X account posted a message on its website stating that it would allow users to bet on which day(s) dildos will hit the WNBA court. So far, nearly $500,000 has been traded in bets on which games will occur when sex toys are thrown at female athletes. Critics have criticised the promotion, claiming it could encourage more copycat incidents of such incidents. This comes after a second man was arrested at a Phoenix Mercury game on August 5 after allegedly throwing a sex toy towards the court, which allegedly hit a man and his nine-year-old niece. The move comes as another setback for Polymarket, which has been hit by several controversies in recent months.",
  "shortSummary": "Polymarket faces backlash for promoting \"dildo dailies” on WNBA disruptions, which critics deem disrespectful to women's basketball players, amid ongoing misogynistic controversies in the crypto industry.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c1773fa17bdf4dfab012702de92c95bf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dlnews.com/articles/markets/polymarket-bettors-clash-over-zelenskyy-suit-dispute/",
      "text": "- A Polymarket bet has seen users clash against each other.\n- The $14 million bet concerns whether Zelenskyy wore a suit at a NATO summit.\n- It’s not the first contested bet on the prediction market.\nWhat was Volodymyr Zelenskyy wearing at the recent NATO Summit on June 24?\nThat depends on who you ask.\nBettors on Polymarket, the crypto-based betting platform, are split on the outcome of a prediction market for whether the Ukrainian President would wear a suit in June.\nZelenskyy appeared at the NATO summit in The Hague on June 24 wearing a black blazer, collared shirt, and suit pants.\nMost media outlets that reported on the event said that Zelenskyy wore a suit.\nYet for those who traded more than $14 million worth of bets on the Ukrainian President’s wardrobe choices, the outcome wasn’t so clear.\nWith such a large amount of cash riding on the market, bettors on both sides are extremely motivated to convince others of their point of view.\nThe dispute throws into question the fairness and impartiality of prediction market outcomes, especially when they deal with situations that are open to interpretation.\nThe timing of the setback also mars Polymarket’s recent winning streak.\nNot only did it ink a partnership with X in June, but it is also reportedly on the cusp of announcing the completion of a $200 million funding round, said to push its valuation to $1 billion.\nThat would put it at half the size of rival Kalshi, whose CEO announced a $185 million funding deal, valuing the company at $2 billion, on June 25.\nPolymarket did not respond to a request for comment.\nSimilar outfit\nOn one side, bettors argue that the dispute should be resolved in favour of ‘yes’ because the media widely reported that the Ukrainian President wore a suit, and that, by most definitions, a suit jacket, collared shirt, and suit pants constitute wearing a suit.\n“The Polymarket criteria do not ask you whether or not you believe it is a suit; they ask if the media believes it is a suit — and there is overwhelming evidence that that is the case,” Calvin Hamilton, a UMA community member, said on Discord.\nUMA is a partner DeFi protocol that acts as a final arbiter of controversial markets on Polymarket.\nThe other side argues that Zelenskyy didn’t wear a suit, citing that the blazer he wore was more stylised than a typical suit jacket, and that he didn’t wear a tie.\nThey also point out that Zelenskyy previously wore a similar outfit in May. At that time, UMA decided it wasn’t a suit.\n“It’s the same type of ‘jacket/coat’ as in the market that was ruled in June,” one UMA community member posting under the name bluelaminate said on Discord. “That market has resolved to No. Clearly nothing has changed and this is not a ‘suit’ per definition.”\nBetting on whether or not Zelenskyy will wear a suit has become popular in recent months.\nThe Ukrainian President has consistently made a point of wearing military fatigues as an act of solidarity with Ukrainian soldiers, even at formal events.\nBut in February, Zelenskyy was chided for not wearing a suit by Brian Glenn, chief White House correspondent for conservative cable network Real America’s Voice, during a meeting with President Donald Trump.\nSince then, speculation that Zelenskyy might don a suit has abounded.\nSolving disputes\nWhen prediction market outcomes on Polymarket are disputed, the platform delegates decision-making to UMA.\nUMA tokenholders vote to settle questions of fact. The idea is that collective wisdom is the best way to get at the truth.\nVotes are cast in secret and only revealed after polling ends. And if the majority of tokenholders vote that A is true, those who said B is true face a financial penalty — a way to discourage voting for obvious untruths.\nUMA has resolved thousands of disputes without incident.\nHowever, some — especially those open to multiple interpretations — have sharply criticised the protocol.\nCritics suggest the system is open to abuse.\nThere’s little stopping large UMA tokenholders colluding with Polymarket bettors behind the scenes to rig the outcomes of ambiguous prediction markets in their favour, as long as they know they have enough collective voting power to get their way.\nUMA CEO Hart Lambur told DL News he hasn’t seen any evidence of collusion.\n“UMA token holders want the UMA token to go up in value, and if it’s a broken or manipulated system, the UMA token becomes worthless,” he said. “UMA voters have a strong incentive to follow Polymarket’s rules and do the best job they can for the long run health of the system.”\nGrowing issue\nIt’s not the first time bettors have come to blows over market outcomes.\nIn fact, it’s becoming a regular occurrence.\nIn March, bettors disagreed on the outcome of a $7 million bet over a potential Ukraine-US mineral deal. The prediction market resolved to yes despite no official agreement between the two nations.\nIn January, many Polymarket bettors again cried foul after losing a $120 million bet that social media platform TikTok wouldn’t be banned before May.\nUpdate, June 30: Added a comment from UMA CEO Hart Lambur.\nUpdate, July 2: This article previously incorrectly stated Volodymyr Zelenskyy wore a similar suit outfit in February. It has been changed to the correct month, which was May.\nTim Craig is DL News’ Edinburgh-based DeFi correspondent. Reach out to him with tips at tim@dlnews.com."
    },
    {
      "url": "https://www.dailymail.co.uk/sport/wnba/article-14965593/Gambling-company-offers-vulgar-bets-WNBA-games-sex-toys.html",
      "text": "One online gambling website has offered six vulgar bets after two WNBA games have been interrupted by flying sex toys about the next possible instance of the unique disruption.\nBetOnline.ag has six futures bets about a possible next act for sex toys at a WNBA game, which could all be combined into a parlay.\nOne bet asks for the color of the sex toy, with six different options, should the device not be green, like the previous two disruptions. A separate bet asks whether it will be green at all.\nAnother bet asks how the sex toy will be handled first by whoever takes it off the court, with hands or feet being the options.\nA third wager asks which half of the court will be the landing spot for the dildo - the home team's or the away side.\nA sport crossover bet asks if the next sex toy thrown onto the court at a WNBA game will be the same color as the Gatorade poured on Philadelphia Eagles head coach Nick Sirianni after he led his team to victory in February's Super Bowl.\nOne website has offered vulgar bets after two WNBA games have been interrupted by sex toys\nA WNBA game was halted after a sex toy was thrown on court for the second time in a week\nSky star Kamilla Cardoso saw the funny side as she joked about the incident with teammates\nIn shocking scenes during the Chicago Sky's game against the Golden State Valkyries on Friday, the sex object was hurled from the stands during the third quarter.\nOfficials swiftly stopped the game and swept the bright green object aside, as players and coaches stood bemused at the bizarre incident.\nThe commentators were equally as puzzled as they said: 'We have a whistle away from the basketball. An object has been thrown onto the court'.\nSky star Kamilla Cardoso, however, evidently saw the funny side to the incident after being seen giggling with teammates while they game was brought to a stop.\nOfficials eventually swept the fluorescent green object to the side before one team member picked it up - using a towel - and disposed of it.\nIt's fair to say that officials handled the situation with far more efficiency compared to the incident that occurred just four days before.\nDuring the Atlanta Dream's clash against Valkyries on Tuesday night, a similar looking object was thrown from the stands however officials let the possession continue.\nEventually, once the possession came to an end, officials brought an abrupt halt to the game as they addressed the bizarre situation.\nA WNBA game was halted after a sex toy was thrown on court for the second time in a week\nOfficials swiftly stopped the game before kicking the object to the side at the Wintrust Arena\nTuesday's game between the Dream and Valkyries also had an on-court disruption incident\nPlayers, coaches and fans were left bemused by the incident and evidently so were the broadcast team, who briefly cut to a close up of the sex toy.\nEventually, after a minute of deliberation, the sex toy was collected by a police officer who had been courtside and was taken away.\nFootage appeared to show the officer being handed a piece of cloth by a fan, in order to pick up the lewd object.\nThe betting website appears to have removed the WNBA futures bets about the sex toy on Saturday afternoon."
    },
    {
      "url": "https://www.dlnews.com/articles/people-culture/woman-drugged-by-dwf-labs-exec-urges-crypto-to-fight-sexism/",
      "text": "- Hana told DL News how a work meeting turned into a nightmare.\n- CCTV footage showed a senior crypto exec spiking her cocktail.\n- The episode casts a harsh light on crypto's gender equality problem.\nIn late October, Hana arrived at a brightly-lit bar in Hong Kong.\nThe 27-year-old, who was in town from Tokyo to try to land a job in the crypto industry, sat down with a partner at DWF Labs, one of the industry’s higher-powered investment and market-making firms.\nAfter she and the partner ordered drinks, Hana briefly went to the bathroom. Hana told DL News the man was Eugene Ng.\nThe partner took something out of his pocket and tipped it into her cocktail glass, according to security camera footage posted online. When Hana came back from the bathroom she drank from the cocktail.\nOn Tuesday, Hana, who declined to provide her real name to protect her privacy, posted a still from the footage on X.\n“I never thought I’d personally experience something like this,” she wrote. “On the evening of October 24th, I was drugged by a partner at @DWFLabs.”\nPredatory behaviour\nHana’s post went viral and received more than 6 million views. Women in crypto — and some men — flooded Hana with messages of their own experiences of harassment.\n“Some of those crypto bros embody the most predatory aspects of both tech and finance cultures, treating women they see as ‘huntable’ with unpredictable crimes,” one prominent crypto investor posted on X.\nHana managed to escape her would-be attacker and reported the incident to the Hong Kong police.\n‘I’ve had people tell me, ‘Oh, this is just crypto, you shouldn’t be so conservative.’\n— Hana\nWhile DWF Labs did not publicly identify the partner, the firm acted quickly.\n“While the matter is under investigation, DWF Labs has decided to dismiss the said partner from management and operational roles effective immediately,” the crypto firm posted on Tuesday. Eugene Ng’s profile was removed from DWF Labs’ website.\nNg’s X account went private, and his LinkedIn profile appeared to have been deleted. Ng did not respond to a request for comment from DL News.\nOn Friday, Andrei Grachev, managing director for DWF Labs, conceded on X that the partner was Ng and said he and his team were considering “further legal actions against Eugene.”\nGrachev didn’t respond to a message on X asking for further comment.\nFor Hana, it’s vital that what happened to her is not dismissed as just another isolated incident.\nShe wants to raise awareness about the culture of harassment that plagues women in finance, tech, and crypto.\n“Ever since I started to look into a job opportunity in this industry, or just getting to know people in this space, I’ve met people, creepy people, a lot of them,” Hana said.\nCultures of sexism\nLike Wall Street and Silicon Valley, the crypto industry has a gender equality problem.\nThe 17 richest crypto billionaires are all men, according to a recent tally from Forbes.\nMen outnumbered women speakers almost nine to one at the Bitcoin 2024 conference, according to data previously compiled by DL News.\nAnd a recent report from Association for Women in Cryptocurrency found that 82% of approximately 400 women surveyed believe the industry is not free from harassment.\nNumbers vary on the proportion of women who experience sexual harassment in the workplace, but it’s clear the problem is pervasive. Hana is no exception.\nNetworking\nEarlier this year, Hana decided to find a job in the industry. So, she attended conferences.\nDuring her attempts to network, some men unexpectedly brought up sex. When she expressed her discomfort, they laughed off her concerns, she said.\n“I’ve had people tell me, ‘Oh, this is just crypto, you shouldn’t be so conservative,’” she said.\nSome have even told her that sex is “another way to know each other better,” she added.\n‘My ultimate goal for everything I’ve done, it’s to just raise awareness.’\n— Hana\nIt was at one of these conferences in Hong Kong where she met Ng. They kept in touch, so when she returned to the city on October 24, it was natural to meet up for drinks.\nAfter Ng allegedly spiked her cocktail, a server rushed over to warn Hana that other drinkers had seen him do it.\nThat was only after she had sipped from her cocktail. Head spinning, she exited the bar and tried to get an Uber, to no avail. Ng stayed close to her, propping her up as she struggled to find her balance, she said.\nHana finally managed to escape from Ng in a taxi.\nFear of retaliation\nEven as Hana decided to go public with her harrowing ordeal, she feared some form of retaliation from Ng, she said. Steeling herself, she drafted her post.\nHana said she’s overwhelmed and grateful for the support she’s found online.\n“My ultimate goal for everything I’ve done, it’s to just raise awareness,” she said.\nIn a way, she said, she’s been given an opportunity.\nNow she’s left turning over the “what if” scenarios in her mind.\nWhat if the cocktail server had not warned her about the spiked drink?\nWhat if Ng had gotten her into a cab?\nWhat if she’d woken up in a strange hotel room?\nHana told DL News that she may have been too afraid of the consequences to report an assault.\n“Probably, I would just shut up and then nothing would happen to these disgusting people,” she said.\n“I believe I have to do this because I’m lucky. I’m the lucky one.”\nJoanna Wright is DL News’ regulatory correspondent. Contact her at joanna@dlnews.com. Ben Weiss is DL News’ Dubai-based correspondent. Reach out to him at bweiss@dlnews.com.\nUpdate, November 4: Added that Grachev said the DWF Labs partner who was dismissed was Eugene Ng and that Grachev did not respond to a request for comment on X."
    },
    {
      "url": "https://protos.com/polymarket-faces-backlash-over-sick-california-wildfire-markets/",
      "text": "Polymarket faces backlash over ‘sick’ California wildfire markets\nPolymarket is facing backlash over its “disgusting” prediction markets that are currently betting on the outcomes of the ongoing California wildfires.\nThe fires started in the Hollywood hills on Wednesday and spread across Los Angeles. A total of five deadly fires have caused the evacuation of over 137,000 people and the deaths of five.\nMultiple Polymarket users have used the opportunity to create various prediction markets on the spread of the fire, when it will be contained, and potential political resignations. The volume has reached almost $100,000 in some of the markets.\nRead more: LA wildfires threaten crypto companies in southern California\nHowever, many online aren’t impressed with the markets and Polymarket’s promotion of them. “Betting on a wildfire is sick,” claimed one X user, while another said that betting on such a tragedy “is unarguably uncouth beyond fucking measure.”\nSome users raised concerns that a wildfire prediction market may incentivize bettors to start more fires in the hope that it might make their bet succeed. One noted that the market odds are based entirely on bettor sentiment, and in response to a post by Polymarket, said “No, there is no “48% chance it will spread”, there are 48% of people betting on that to happen.”\nThis type of backlash isn’t new for Polymarket. It faced a similar outcry last year when the Titan submersible market saw punters bet on whether or not the craft would implode and kill its five passengers.\nRead more: Polymarket faces US probe as Kalshi exec allegedly fuels wash-trading concerns\nTo somehow mitigate its role in at least 10 different wildfire markets, Polymarket has placed a short disclaimer claiming it uses the “wisdom of the crowd” to create “accurate, unbiased forecasts” on events.\nIt said, “The devasting Pacific Palisades fire is one such event, for which Polymarket can yield invaluable real-time answers to those directly impacted in ways traditional media cannot.”\nIt’s worth noting that if you’re ever affected by a wildfire, it’s probably not wise to turn to a crypto prediction site for information over a news organization actively covering the events.\nProtos reached out to Polymarket for comment and will update if we hear back.\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
      "url": "https://www.cosmopolitan.com/entertainment/celebs/a65614990/why-throwing-dildos-wnba-games/",
      "text": "A third dildo found its way onto a WNBA court on Tuesday, August 5, interrupting the Indiana Fever and Los Angeles Sparks game. This marks the third incident in the last 10 days, so the question begs: What is going on with all the dildos at WNBA games? The answer: Nothing good.\nThis dildo throwing trend began July 29, during a game between the Golden State Valkyries and the Atlanta Dream, when a neon green dildo flew onto the court and bounced to the sideline. A nearly identical incident occurred just a few days later on August 1, when the Valkyries were playing the Chicago Sky. Now it’s happened again. And it’s getting worse.\nIt appears that this action is becoming more than just a one-time attempt at a joke, but a targeted attack on certain female players. On Friday, following the second incident, Fever player Sophie Cunningham tweeted, “Stop throwing dildos on the court... you’re going to hurt one of us.” She was nearly hit by the flying phallus four days later.\nThe very same night, someone reportedly attempted to throw a green dildo on the court at a New York City Liberty game, but failed to make it onto the court. (The dildo did, however, nearly hit a child, according to the user who shared video of the aftermath on social media.)\nNo suspects in the last two incidents have been identified, but Delbert Carver, a 23-year-old, was arrested in relation to the first dildo incident in Atlanta. According to ESPN, he could potentially face charges of disorderly conduct, public indecent/indecent exposure, and criminal trespass. In an affidavit, the man allegedly said that it was “supposed to be a joke” and “go viral.”\nBut throwing dildos in the middle of a WNBA game isn’t just a sad excuse for a prank—it’s a trend now, and it’s targeting the WNBA as a whole.\nLet’s think this through: There are people paying good money to attend a professional basketball game just to throw a dildo at the players’ feet. Why? To send a message; to tell women that they don’t belong on the court and that their athleticism isn’t as valuable as their sexuality. This is misogyny, plain and simple.\nA few WNBA players have spoken out against the incidents, but as any woman can attest, it can be hard to call out sexism on an international scale. After the original incident, some—like Fever Point Guard Sydney Colton—responded with humor.\nNow that it’s become a trend, most players aren’t feeling so generous. Following the dildo throw at Friday’s game, Chicago Sky center Elizabeth Williams called it “disrespectful” during a postgame press conference, adding that “whoever is doing it needs to grow up.”\nNew York Liberty Power Forward Isabelle Harrison also weighed in Friday, tweeting in part, “It’s not funny. Never was funny. Throwing ANYTHING on the court is so dangerous.”\nAnd on Tuesday, Sparks coach Lynne Roberts told reporters it was “ridiculous.” She continued, “It's also dangerous.”\nBut here’s the thing: We know that these idiots throwing dildos onto the court don’t care about the players or coaches. They don’t care about what women deserve or how disgusting and violating their actions are. It’s time for NBA players to stand in solidarity with their female counterparts and call this behavior what it is: unacceptable, sexist, and detrimental to the entire sport."
    },
    {
      "url": "https://www.fox10phoenix.com/news/man-arrested-throwing-sex-toy-phoenix-mercury-crowd-court-docs-say",
      "text": "Man arrested for throwing sex toy at Phoenix Mercury crowd, court docs say\nPHOENIX - 18-year-old Kaden Lopez was arrested while at a Phoenix Mercury game after police say he threw a sex toy toward the seats in front of him, hitting a man and his niece.\nWhat we know:\nThe Aug. 5 incident was captured on video, police say, showing a \"green dildo\" hitting a man and his 9-year-old niece.\n\"Video footage shows Lopez, sitting in his seat, he retrieves the green dildo from his sweater front pocket then throws the dildo forward. He then stands up and leaves the area,\" a court document read.\nA witness who volunteers in the arena said they followed Lopez, tackled him as he tried to leave and waited for police to arrive.\n\"The adult male victim was interviewed. He stated he was watching the WNBA game with his 9-year-old niece, when something hit his back then fell to the\nground next to them. He realized the object that hit him was a dildo. He desires prosecution,\" the court document read.\nLopez reportedly was sorry and said that it was a \"stupid prank that was trending on social media.\" Documents state that he bought the sex toy the day before just to take it to the game.\nKaden Lopez\nWhat's next:\nLopez was booked into jail on suspicion of disorderly conduct, assault and public display of explicit sexual material.\nThe WNBA and PHX Arena both want Lopez to be prosecuted for disorderly conduct."
    }
  ],
  "argos_summary": "Polymarket is facing criticism for promoting bets on whether dildos will be thrown onto WNBA courts, following multiple incidents where sex toys disrupted games. Critics argue that this trend is disrespectful to female athletes and could encourage more such behavior, highlighting a broader issue of misogyny in sports and the crypto industry. The backlash comes amid a series of arrests related to these incidents, raising concerns about the safety and respect for women in professional sports.",
  "argos_id": "DZHV7EN24"
}