{
  "url": "https://finance.yahoo.com/news/apreo-health-raises-130m-fund-165612852.html",
  "authorsByline": "Ross Law",
  "articleId": "89d1e02be8f347a5a3a9605e824078bb",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/HqCu3pehoC3f7oXhGUKVjg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTA7Y2Y9d2VicA--/https://media.zenfs.com/en/medical_device_network_744/eb741f1a3d33e3f007a39113b9c6afc8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T16:56:12+00:00",
  "addDate": "2025-08-07T17:16:42.627681+00:00",
  "refreshDate": "2025-08-07T17:16:42.627684+00:00",
  "score": 1.0,
  "title": "Apreo Health raises $130m to fund emphysema implant pivotal trial",
  "description": "Beyond supporting a pivotal trial for Apreo’s BREATHE airway scaffold, the funds will support activities to demonstrate the implant’s market potential.",
  "content": "California-based startup Apreo Health has raised $130m to further the development of its implant for treating severe emphysema.\n\nThe Series B round was co-led by new investors Bain Capital Life Sciences and Norwest and brings Apreo’s total funds to around $153m. Returning investors Lightstone Ventures and Santé Ventures also participated.\n\nApreo said the funds will primarily support the initiation of the BREATHE-3 pivotal trial to evaluate its BREATHE Airway Scaffold implant. The company also plans to use the financing towards regulatory activities associated with the pivotal trial and early commercialisation efforts to demonstrate BREATHE’s market potential.\n\nBREATHE is delivered bronchoscopically into affected lung tissue and is designed to relieve lung hyperinflation by releasing trapped air in patients with severe emphysema. The implant gained a breakthrough device designation from the US Food and Drug Administration (FDA) in May 2024 and is currently being evaluated in Apreo’s Phase II BREATHE-2 trial (NCT05949645).\n\nEmphysema is not reversible. However, relieving lung hyperinflation can reduce shortness of breath (dyspnoea) in patients with the condition, thereby mitigating comorbidities that research indicates are likely exacerbated by reduced physical activity in emphysema patients due to dyspnoea.\n\nWhile over three million Americans are affected by severe emphysema, less than one percent receive current interventional treatments such as lung volume reduction surgery (LVRS) due to the procedure’s high morbidity rate.\n\nApreo CEO, Karun Naga said the data served as a “stark reflection” on the limitations of currently available severe emphysema treatments.\n\n“This financing marks a significant milestone that enables us to complete a pivotal trial and continue advancing toward expanded access for this severely underserved population,” Naga said.\n\nDr Zack Scott, general partner at Norwest, called Apreo’s BREATHE device a potential “step-change” in the approach to emphysema care, noting that it is built for “broad, scalable delivery”.\n\nEmphysema is a form of chronic obstructive pulmonary disease (COPD). According to the World Health Organization (WHO), the disease is the fourth leading cause of death and the eighth leading cause of poor health worldwide. Almost 16 million Americans have been diagnosed with some form of COPD, as per the US Centers for Disease Control and Prevention (CDC).\n\n\"Apreo Health raises $130m to fund emphysema implant pivotal trial\" was originally created and published by Medical Device Network, a GlobalData owned brand.",
  "medium": "Article",
  "links": [
    "https://www.medicaldevice-network.com/news/apreo-health-raises-130m-to-fund-emphysema-implant-pivotal-trial/",
    "https://journal.copdfoundation.org/jcopdf/id/1218/Patient-Preferences-for-Endobronchial-Valve-Treatment-of-Severe-Emphysema",
    "https://pmc.ncbi.nlm.nih.gov/articles/PMC6442765/#:~:text=Such%20inactivity%20can%20have%20a,to%20inactivity%20and%20physical%20deconditioning.&text=It%20seems%20logical%20that%20the,all%20stages%20of%20the%20disease.",
    "https://www.lung.org/lung-health-diseases/lung-disease-lookup/emphysema"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "emphysema implant pivotal trial",
      "weight": 0.11340928
    },
    {
      "name": "severe emphysema",
      "weight": 0.096284196
    },
    {
      "name": "emphysema patients",
      "weight": 0.0921078
    },
    {
      "name": "Apreo Health",
      "weight": 0.08929709
    },
    {
      "name": "emphysema care",
      "weight": 0.0867809
    },
    {
      "name": "Emphysema",
      "weight": 0.08533731
    },
    {
      "name": "Apreo CEO",
      "weight": 0.07684543
    },
    {
      "name": "Apreo",
      "weight": 0.076194465
    },
    {
      "name": "lung hyperinflation",
      "weight": 0.06823966
    },
    {
      "name": "lung volume reduction surgery",
      "weight": 0.06818598
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97509765625
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.88134765625
    },
    {
      "name": "/News/Health News",
      "score": 0.744140625
    },
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.6591796875
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.414306640625
    },
    {
      "name": "/Health/Health Conditions/Cancer",
      "score": 0.358642578125
    }
  ],
  "sentiment": {
    "positive": 0.73095703,
    "negative": 0.021820068,
    "neutral": 0.2475586
  },
  "summary": "California-based startup, Apreo Health, has raised $130m to further the development of its implant for treating severe emphysema. The Series B round was co-led by new investors Bain Capital Life Sciences and Norwest, and brings APreo's total funds to around $153m. The funds will primarily support the initiation of the BREATHE-3 pivotal trial to evaluate the BREOTHERE Airway Scaffold implant, which is currently being evaluated in a Phase II trial. The company plans to use the financing towards regulatory activities associated with the pivotal trial and early commercialisation efforts to demonstrate the potential of the device.",
  "shortSummary": "Apreo Health raised $130m to fund its BREATHE implant pivotal trial, aiming to address severe emphysema patients' inadequate treatment options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c6075191e92d4db9998ba7e1cb499c96",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://journal.copdfoundation.org/jcopdf/id/1218/Patient-Preferences-for-Endobronchial-Valve-Treatment-of-Severe-Emphysema",
      "text": "Running Head: Patient Preferences for Emphysema Treatment\nFunding Support: The research reported in this manuscript was funded by Pulmonx Corporation.\nDate of acceptance: August 23, 2018\nAbbreviations: lung volume reduction surgery, LVRS; bronchoscopic lung volume reduction, BLVR; endobronchial valve, EBV; Food and Drug Administration, FDA; discrete-choice experiment, DCE; COPD Patient-Powered Research Network, COPD PPRN; chronic obstructive pulmonary disease, COPD; modified Medical Research Council Dyspnea Scale, mMRC; forced expiratory volume in 1 second, FEV1; St George’s Respiratory Questionnaire, SGRQ; random-parameter logit, RPL; maximum, max; minimum, min; standard deviation, SD; confidence interval, CI\nCitation: Mansfield C, Sutphin J, Shriner K, Criner GJ, Celli BR. Patient preferences for endobronchial valve treatment of severe emphysema. Chronic Obstr Pulm Dis. 2019; 6(1): 51-63. doi: http://doi.org/10.15326/jcopdf.6.1.2018.0147\nOnline Supplemental Material: Read Online Supplemental Material (229KB)\nIntroduction\nEmphysema is usually a progressive and debilitating disease characterized by irreversible destruction of alveolar tissue and reduced elastic recoil that causes progressive hyperinflation, gas trapping, and impaired gas exchange. Patients with emphysema experience chronic dyspnea, reduced exercise tolerance, and very poor quality of life. Medical treatment can palliate symptoms associated with severe emphysema, but the impact is limited.1,2 Despite optimal medical management, pulmonary rehabilitation, and long-term oxygen therapy, many patients with severe emphysema remain symptomatic.\nWhile lung volume reduction surgery (LVRS) has demonstrated clinical benefits in appropriately selected patients with emphysema, LVRS remains underutilized primarily because of high morbidity.3,4 Techniques for bronchoscopic lung volume reduction (BLVR) have been developed and are available as treatment options outside the United States.5 The most widely studied BLVR technique, implemented outside of the United States since 2005, uses Zephyr® endobronchial valves (EBV®), which are the first to be approved for clinical use in the United States.6-9 Bronchoscopic lung volume reduction with EBV placement has been shown to provide similar benefits to LVRS but with lower risk.9-12 Currently, less than 1% of the severe emphysema population in the United States receive LVRS, however it is estimated that as much as 15% of the population could qualify for surgery.3 Many of these patients could also qualify for EBV, and it is likely even more patients would be eligible for treatment with EBV, given the less invasive nature of the procedure and its applicability in heterogeneous and homogeneous, predominantly upper and lower lobe disease.\nTo our knowledge, no study has evaluated patient preferences for BLVR treatment for emphysema in comparison to medical therapy, even though such studies have gained popularity and regulatory bodies such as the U.S. Food and Drug Administration (FDA) have recently issued guidance for the use of patient preference data in regulatory decisions.13 By using quantitative preference elicitation methods, the relative importance of treatment attributes such as the level of benefit and risks of the treatment and patients’ willingness to trade off treatment risks against benefits can be better understood.\nWe hypothesized that patients with emphysema would demonstrate clear and measurable preferences when presented with the potential benefits and risks of hypothetical interventional treatments versus continued medical management. To test this hypothesis, this study used a discrete-choice experiment (DCE) survey to explore the preferences of patients with severe emphysema for hypothetical treatments with attributes associated with LVRS, BLVR with EBVs, and current medical management options. Discrete-choice experiments are an established method previously employed by the FDA to study preferences for surgical weight loss devices and in their decision to approve a device.14,15 Both LVRS and EBVs provide similar clinical benefits; however, each treatment is associated with specific adverse events.9-12,16-25\nMethods\nStudy Population\nThe study utilized the COPD Foundation’s COPD Patient-Powered Research Network (COPD PPRN), an online registry, to recruit study participants in the United States. All messages sent to COPD PPRN participants were approved by an institutional review board and sent through the COPD PPRN platform. The COPD PPRN is a voluntary registry of individuals who either have chronic obstructive pulmonary disease (COPD) or are at risk of developing COPD. The COPD Foundation sent email invitations with a link to the survey to PPRN members who had self-reported a physician diagnosis of emphysema and had registered approval to be contacted for research opportunities. The PPRN members received up to 2 additional reminders to complete the survey. All respondents provided informed consent. Respondents completing the survey were compensated with a $25 electronic gift card. The key inclusion criteria were age ≥18 years, self-reported physician diagnosis of emphysema, no prior lung reduction procedure of any kind, and self-reported score > 2 on the modified Medical Research Council (mMRC) Dyspnea Scale.26\nSurvey Design\nPatient preferences for emphysema treatments were measured using a web-based DCE survey. DCE surveys are based on the principle that people consider a range of attributes when they choose a product or procedure, such as a medical treatment. DCEs present choices between alternatives defined by a set of attributes; the levels of attributes are varied to create different hypothetical treatment profiles.27,28 Respondents’ choices over these hypothetical treatments provide quantitative measures of the relative importance of the attributes of multi-attribute products such as medical devices. There is an existing and growing literature of DCE surveys conducted to measure patient preferences for medical treatment features.29-31 In addition to the DCE questions, the survey included screening questions to confirm eligibility and informed consent and descriptive questions to collect respondents’ demographic characteristics, disease experience, and treatment history.\nDiscrete-Choice Experiment Questions\nThe DCE questions were a series of choices among pairs of hypothetical interventional emphysema treatments and the option of staying with the respondent’s current treatment (continued medical management). Table 1 presents the attributes and levels used to create the series of hypothetical treatments presented in the DCE questions and the levels assigned to the fixed current treatment alternative. Figure 1 presents an example of the DCE questions presented in the survey.\nThe attributes believed to be important to patients were identified from safety and efficacy outcomes associated with the EBV procedure, LVRS, and medical management using previously published literature and consultation with external clinicians who were experienced in treating patients with emphysema. The levels of the attributes were selected to span the range of outcomes observed in prior studies.10,18,32-34\nPrior to the DCE questions, the survey presented a description of each attribute written in patient-friendly language. The risk-based attributes—chance of pneumothorax and death—were presented both numerically and graphically.35 Respondents were asked a comprehension question about the risk grid and presented with the correct answer to reinforce the information. The attribute descriptions and levels were evaluated in 8 face-to-face pretest interviews with patients* who had a physician-confirmed diagnosis of emphysema. (* Pretest participants met the following inclusion criteria: physician-confirmed diagnosis of emphysema, postbronchodilator forced expiratory volume in 1 second [FEV1] ≥ 15 and ≤ 45% of predicted value, residual volume > 175% predicted, 6-minute walk test ≥ 100 m and ≤ 450 m.)\nDefinitions of Clinical Benefit\nTo define the primary benefit attribute “improvement in the ability to breathe and do day-to-day activities in the next year,” respondents were asked the 2 questions from the St George’s Respiratory Questionnaire (SGRQ)36 that comprise the activity domain (question 11 and question 15). Answers to these 2 questions were used to establish a respondent’s baseline and customize the benefit each respondent would get from the hypothetical interventional treatments in the survey. The benefit attribute had 3 levels, which corresponded to better scores on the 2 SGRQ activity domain questions. With each level of improvement in the benefit attribute, respondents were told which additional activities in the SGRQ activity domain questions they would be able to do with less breathlessness, such as washing or getting dressed, walking around the home, or walking around outside on level ground, depending on their baseline responses.\nFigure 1 presents an example of the wording of the benefit. The online supplement contains more details on how the wording for the benefit description was created for each respondent.\nExperimental Design for Discrete-Choice Experiment Questions\nThe experimental design for the 2 hypothetical treatments in each DCE question was created in Sawtooth using a D‑efficient algorithm to construct a fractional factorial experimental design.37,38 The design was evaluated for level balance and correlation. The full fractional design contained 36 DCE questions, which were used to create 4 blocks of 9 DCE questions each. Respondents were randomly assigned to 1 of these blocks, and the order of the DCE questions was varied across respondents to mitigate bias from question order effects.\nData Analysis\nThe DCE data were analyzed using a random-parameters logit (RPL) model that relates the choices respondents make to the differences in attribute levels among alternatives in each choice question.39 The model estimates how changing the benefits and risks of the hypothetical treatments affects the probability that respondents select an alternative, producing an estimate of the relative importance of the different benefits and risks to respondents’ decisions.\nThe results from the RPL model were applied to treatment profiles with specific sets of attributes to predict the proportion of the sample that would select one option over another (see online supplement for details). First, we calculated the proportion of respondents who would select a treatment with attribute levels similar to EBVs and a treatment with attribute levels similar to current treatment using the assumptions in Table 2. Additional preference shares were calculated for the choice among 3 options—EBVs, LVRS, and current treatment (continued medical management)—based on profiles where EBVs and LVRS both start with the highest benefits (highest improvement in ability to breathe and hospitalizations every 3 years for exacerbations), LVRS has a 90% risk of tear in the lung and a 5% risk of death, and EBVs have a 30% risk of tear in the lung and a 3% risk of death. From this baseline, we explored the impact of a change in each attribute for EBVs on choice probability, where the level of each attribute was adjusted individually to the next best level for the EBV profile.\nThe RPL results were also used to calculate the maximum level of each treatment-related risk that respondents would accept in exchange for specific improvements in the efficacy attributes. (See the online supplement for details.)\nResults\nSample\nA total of 1137 individuals in the PPRN were asked to participate in the online survey and 515 accessed the link to the survey. Of the 324 participants who met the eligibility criteria and consented to participate, 294 completed the survey (Figure 2).\nDemographic characteristics of respondents are summarized in Table 3. The average age was 66 years. The self-reported average FEV1 was 34% predicted among respondents who knew their most recent FEV1 score. The average time since diagnosis was 10 years.\nTable 3 contains the responses to the SGRQ questions 11 and 15, which were used to create the benefit attribute. Respondents reported breathlessness while doing routine tasks such as washing or getting dressed (83%), walking around the home (76%), and walking around outside on level ground (96%). They also reported walking slower than people their own age (99%) and that household chores take a long time (97%) because of their breathing difficulties.\nDiscrete-Choice Experiment Results\nOn average, respondents preferred the hypothetical interventional treatments over current treatment, and they preferred an interventional treatment with “removable valves” (EBVs) over “surgery” (LVRS) based on the RPL results. Avoiding a 1 percentage point increase in treatment-related risk of either death or pneumothorax was also valued highly; respondents valued avoiding a 1 percentage point increase in the risk of death approximately 4 times more than avoiding a 1 percentage point increase in the risk of pneumothorax. Respondents confirmed that all attributes mattered to them, and all levels within each attribute were statistically different from each other at the 5% level (P < 0.05). Respondents placed high relative value on greater improvements in activities they could do without breathing problems. Reducing the frequency of hospitalizations for COPD exacerbations from once every 6 months to every 3 years was the least important benefit. Additional details on the RPL results can be found in the online supplement.\nPreference Shares\nFigure 3 presents the results for the preference share calculations based on the RPL results when the profile with attribute levels like the EBV procedure is compared with current treatment. The model predicted that 76% of the sample would select a treatment with a profile like the EBV procedure and 24% would continue with current treatment.\nFigure 4 presents the results for the preference shares under different assumptions for the attributes of the EBV procedure and includes 3 treatment choices instead of two. The top row is the baseline prediction (see Figure 4 for baseline profiles of LVRS, EBV, and current treatment). The model predicted that 71% of respondents would select the EBV procedure with the baseline treatment profiles. The other rows in Figure 4 show the change in the preference share predictions when the attribute levels for the EBV procedure are lowered to the next level for each attribute. Reducing the benefit from a 3-activity improvement to a 2-activity improvement produced the biggest change in the proportion of the sample selecting the EBV procedure option, reducing the percentage from 71.4% to 64.6% and increasing the proportion of the sample selecting LVRS from 5.9% to 11.2%. Increasing the risk of death to 5% for the EBV procedure or the risk of pneumothorax to 40% did not meaningfully change the preference shares (71.4% at baseline to 69.0% and 69.7%, respectively).\nMaximum Acceptable Risk\nTable 4 presents the maximum acceptable treatment-related risk of death for improvements in breathlessness and for reductions in the frequency of hospitalizations for COPD exacerbations (results for risk of pneumothorax are presented in the online supplement). The maximum acceptable risk of death for a change from a 1-activity improvement in breathlessness to a 3-activity improvement was 9.8%. The maximum acceptable risk of death for a reduction in frequency of a hospitalization for COPD exacerbation of once every 6 months to once every 3 years was 4.4%. On average, respondents were willing to tolerate a risk of death well beyond the upper range of 9% tested in the survey for a treatment that delivered at least a 1-activity improvement in breathlessness compared to current management with no improvement in breathlessness.\nDiscussion\nThis preference study found that patients with severe emphysema value access to an interventional treatment that offers benefits above and beyond their current medical management, despite the risks associated with these treatments. However, about 20% of the sample always selected current treatment in the DCE questions, suggesting that a subgroup of respondents was not willing to accept the additional risk of a new treatment to obtain further benefit. Preferences for attribute levels were ordered as expected, with better levels being preferred to worse levels. Further, all respondents completed the survey online, without any supervision, thereby reducing the chance of interviewer bias.\nThe model predicted that 76% of the sample would select a treatment like the EBV procedure when choosing between a treatment profile with attributes like the EBV procedure compared with the profile for current treatment. The willingness of respondents to accept mortality risk for 1 of the hypothetical interventional treatments, if it provided at least 1 level of improvement in breathlessness over current treatment with no improvement in breathlessness, was estimated to be significantly greater than 9%, the upper end of the range used in the survey. On average, respondents were willing to accept additional mortality risk of approximately 4% to 10% to achieve additional improvements in breathlessness above the lowest level of the attribute in the survey (a 1-activity improvement). Respondent’s responses to the SGRQ questions at baseline suggest that the sample experienced significant difficulties in their daily lives because of breathing problems. These breathing difficulties most likely account for their willingness to accept the risks associated with new treatment options in exchange for improvements in breathlessness.\nThe results of the DCE survey should be interpreted in the context of limitations related to the survey instrument and sample. Creating a DCE survey instrument requires balancing a thorough description of the treatment against any comprehension limits of the respondent and the burden of the survey. Not all of the features associated with EBVs or LVRS could be included as attributes. In the descriptions of the attributes and types of treatments, every effort was made to present neutral descriptions that provided an accurate, concise description of the benefits and risks. The final presentation of attributes was reviewed by clinical experts and pretested in patients with severe emphysema. The primary benefit attribute for the survey was based on the 2 questions from the SGRQ that comprise the activity domain. The SGRQ is a subjective scale, and the 2 questions measure overlapping concepts (breathlessness while doing activities and how activities are affected by breathing problems). Respondents may have interpreted the benefit described in the survey differently than if they had been experiencing the benefits during the clinical trial. The time frame for the risk of pneumothorax in the survey was within 1 month of treatment. The survey text describes the pneumothorax as occurring right after treatment and resulting in an increased hospital stay. Depending on how respondents interpreted the attribute, the survey does not measure the value of reducing the risk of a pneumothorax that occurs when the patient is at home and requires a new hospitalization. Finally, the survey presents hypothetical scenarios to respondents. A survey instrument does not replicate the experience of talking with a doctor about treatment options. Decisions made in the survey may not fully predict decisions made in a clinical setting, where other considerations may come into play. For example, it is unclear how the acceptance of mortality risk in an online survey compares to decisions made with a physician.\nThe sample was recruited by the COPD Foundation from their patient registry and was limited to those members with an e‑mail address. Members of the COPD Foundation’s PPRN may not be representative of the views of all patients. In addition, the respondents provided a self-reported diagnosis of emphysema and responses to a short list of the inclusion criteria that primarily measured levels of dyspnea. Eligibility for the COPD Foundation registry is based on self-reported information, and the screening questions in the survey instrument reverified the inclusion criteria.\nDespite the limitations of the recruitment method, the baseline characteristics of age, FEV1 (if known), and mMRC of the respondents matched well to the baseline characteristics of patients studied in the TRANSFORM, IMPACT and LIBERATE trials of the EBV procedure.9,10,25\nConclusion\nEmphysema progressively erodes quality of life, and in patients with severe emphysema, the disease can cause patients to struggle to complete routine daily activities such as bathing and dressing. Patient preference studies can provide evidence on how individuals view treatments that are not currently available on the market. The results of this preference study show that the majority of respondents would select a procedure with risks and benefits similar to those of the Zephyr® EBV procedure over both current medical management and LVRS.\nAcknowledgments\nThe authors wish to thank the COPD Foundation for use of its COPD PPRN, an online registry of COPD patients and those at risk. The registry was used for recruitment for this study.\nAuthor contributions: Drs. Shriner, Criner and Celli assisted with the design of this study, interpretation of the data and revising the manuscript. J Stupin also assisted with the design of the study, interpretation of the data and revising the manuscript while also assisting with acquisition of the data. Dr. Mansfield assisted with the design of the study, acquisition of the data, interpretation of the data and creating the original draft of the manuscript and revising it.\nDeclaration of Interest\nCarol Mansfield and Jessie Stupin were employees of RTI Health Solutions at the time of the study, and RTI Health Solutions was contracted by Pulmonx Corporation to conduct the study. Kelly Shriner was an employee of Pulmonx Corporation at the time of the study. Gerard Criner received a grant from Pulmonx Corporation. Bartholome Celli was an advisor to the Pulmonx Corporation."
    }
  ],
  "argos_summary": "Apreo Health, a California-based startup, has secured $130 million in funding to advance its BREATHE Airway Scaffold implant aimed at treating severe emphysema. The Series B funding, co-led by Bain Capital Life Sciences and Norwest, will support the initiation of the BREATHE-3 pivotal trial and regulatory activities. The BREATHE implant, which received breakthrough device designation from the FDA, is designed to alleviate lung hyperinflation in emphysema patients, a condition affecting over three million Americans.",
  "argos_id": "EZPWX0SGF"
}