{
  "url": "https://fortune.com/2025/08/07/toyota-slashes-outlook-tariffs-profits-plunge/",
  "authorsByline": "Yuri Kageyama, The Associated Press",
  "articleId": "201ee454d1044da9ad5002cbe642a71a",
  "source": {
    "domain": "fortune.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-1769302382-e1754583973624.jpg?resize=1200,600",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T16:27:49+00:00",
  "addDate": "2025-08-07T16:38:25.661765+00:00",
  "refreshDate": "2025-08-07T16:38:25.661767+00:00",
  "score": 1.0,
  "title": "Toyota slashes outlook on tariff concerns as profit plunges 37%",
  "description": "Toyota Motor Corp.’s April-June profit totaled 841 billion yen ($5.7 billion), down from 1.33 trillion yen in the same period of 2024.",
  "content": "Toyota’s profit plunged 37% in the April-June quarter, the company said Thursday, cutting its full year earnings forecasts largely because of President Donald Trump’s tariffs.\n\nThe Japanese automaker said it based its report on the assumption that Trump’s tariffs on exports from Japan, including autos, would be 12.5% starting this month. As of now they stand at 15%.\n\nThe world’s top automaker also makes vehicles in Mexico and Canada. Toyota’s profit in the last quarter totaled 841 billion yen, or $5.7 billion, down from 1.33 trillion yen in the same period the year before. Its quarterly sales rose 3%.\n\nThe status of those exports is unclear since Mexico and Canada are beneficiaries of the U.S. Mexico Canada Agreement, renegotiated from a 1990s pact during Trump’s first term in office, that eliminated most tariffs and trade barriers between the three countries.\n\nToyota Motor Corp.’s April-June profit totaled 841 billion yen ($5.7 billion), down from 1.33 trillion yen in the same period of 2024. Quarterly sales rose 3% to 12 trillion yen ($82 billion).\n\nToyota said the tariffs cost its quarterly operating profit 450 billion yen ($3 billion). Cost reduction efforts and the negative impact of an unfavorable exchange rate also hurt its bottom line.\n\nThe company, which makes the Camry sedan and Lexus luxury models, forecast a 2.66 trillion yen ($18 billion) profit for the full fiscal year ending in March 2026, down from an earlier forecast for a 3.1 trillion yen ($21 billion) profit. Toyota earned nearly 4.8 trillion yen in the previous fiscal year.\n\n“Despite a challenging external environment, we have continued to make comprehensive investments, as well as improvements such as increased unit sales, cost reductions and expanded value chain profits,” Toyota said in a statement that outlined its efforts to minimize the impact of the tariffs.\n\nAt the retail level, Toyota sold 2.4 million vehicles globally, with sales growing in Japan, North America and Europe from the previous year, when global retail totaled 2.2 million vehicles.\n\nAnalysts say Toyota is likely among the worst hit by the tariffs among global companies, even compared with other Japanese automakers.\n\nAlso Thursday, Toyota announced it was building a new car assembly plant in Japan that it expects to have up and running in the early 2030s. It is acquiring a site in Toyota city, Aichi Prefecture, central Japan, where the automaker is headquartered.\n\nThe models to be produced there are still undecided, but the plant will be part of the company’s plan to maintain a production capacity of 3 million vehicles in Japan, according to Toyota. Billed as “a plant of the future,” it will also feature new technology tailored for what Toyota said will be a diverse work force.",
  "medium": "Article",
  "links": [
    "https://fortune.com/company/toyota-tsusho/",
    "https://fortune.com/company/lgi-homes/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Toyota city",
      "weight": 0.09474694
    },
    {
      "name": "Toyota",
      "weight": 0.09313249
    },
    {
      "name": "most tariffs",
      "weight": 0.08176687
    },
    {
      "name": "tariff concerns",
      "weight": 0.08109277
    },
    {
      "name": "central Japan",
      "weight": 0.07666642
    },
    {
      "name": "expanded value chain profits",
      "weight": 0.07537868
    },
    {
      "name": "global companies",
      "weight": 0.073161274
    },
    {
      "name": "full year",
      "weight": 0.07303235
    },
    {
      "name": "Japan",
      "weight": 0.072373144
    },
    {
      "name": "profit",
      "weight": 0.072203495
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97998046875
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.78466796875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.69482421875
    }
  ],
  "sentiment": {
    "positive": 0.03062439,
    "negative": 0.9013672,
    "neutral": 0.06762695
  },
  "summary": "Toyota's profit for the Q4 of 2018 fell 37% due to President Donald Trump's tariffs, which are expected to rise to 12.5% on exports from Japan, including autos, starting at 15%. The Japanese automaker also makes vehicles in Mexico and Canada, but the status of these exports is unclear as Mexico and Mexico are beneficiaries of the U.S. Mexico Canada Agreement, which eliminated most tariffs and trade barriers between the three countries. The company's profit in Q4 totaled 841 billion yen ($5.7 billion), down from 1.33 trillion yen in the same period the previous year. The tariffs cost Toyota's quarterly operating profit 450 billion ($3 billion), and an unfavorable exchange rate also negatively impacted its bottom line. Toyota plans to build a new car assembly plant in Japan in the early 2030s, with models still undecided.",
  "shortSummary": "Toyota's profit plunged 37% due to President Donald Trump's tariffs on Japan's exports, despite rising sales and cost reduction efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4b5740dd04c042d987197201f9e96586",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Toyota reported a 37% drop in profit for the April-June quarter, attributing the decline to President Trump's tariffs on Japanese exports, particularly autos. The company's profit fell to 841 billion yen ($5.7 billion) from 1.33 trillion yen a year earlier, despite a 3% increase in quarterly sales. Toyota has revised its full-year profit forecast down to 2.66 trillion yen ($18 billion) due to the tariffs and unfavorable exchange rates, while also announcing plans for a new assembly plant in Japan aimed at maintaining production capacity.",
  "argos_id": "G8BE5TUDC"
}