{
  "url": "https://www.morningstar.com/news/accesswire/1057775msn/patriottv-viewership-and-stock-performance-surge-amid-industry-shift-and-legacy-media-decline-investors-take-notice-under-jd-ruckers-leadership",
  "authorsByline": "",
  "articleId": "dcef98ad5b5a4d64a005dac490ffe08e",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T08:20:00-05:00",
  "addDate": "2025-08-07T14:17:09.082161+00:00",
  "refreshDate": "2025-08-07T14:17:09.082166+00:00",
  "score": 1.0,
  "title": "Patriot.TV Viewership and Stock Performance Surge Amid Industry Shift and Legacy Media Decline - Investors Take Notice under JD Ruckers Leadership",
  "description": "Patriot.TV Viewership and Stock Performance Surge Amid Industry Shift and Legacy Media Decline - Investors Take Notice under JD Ruckers Leadership",
  "content": "CBMJ shares have increased by 131.58% over the past month, including a 37.5% gain in the last week alone, and a 2.33% rise in the most recent trading session. As traditional media companies face declining revenues and brand erosion\n\nATLANTA, GEORGIA / ACCESS Newswire / August 7, 2025 / Patriot.TV, a division of Conservative Broadcast Media & Journalism Inc. (OTCID:CBMJ), today reported record-setting viewership alongside a significant increase in shareholder value. In July, Patriot.TV reached a new high with 1.6 million live viewers via its Rumble channel, its strongest monthly performance to date, underscoring the platform's continued growth and resonance with audiences seeking traditional American values, faith-based programming, and fact-driven journalism.\n\nThis surge in engagement aligns with broader trends favoring conservative-oriented networks. Patriot.TV, alongside Fox Corporation's Fox News (FOX), Newsmax (NMAX), and Sinclair Broadcast Group (SBGI), have seen rising viewer loyalty. In contrast, major networks under Warner Bros. Discovery (WBD), Paramount Global (PARA), and The Walt Disney Company (DIS) have experienced marked declines in ratings and advertising revenues.\n\nPatriot.TV's expansion reflects shifting consumer behavior toward platforms perceived as more transparent and mission aligned.\n\n\"This exceptional growth highlights the relevance of our content and the continued trust of our audience,\" said Mark Schaftlein, CEO of CBMJ. \"We remain committed to delivering programming that reflects traditional American values while meeting the evolving needs of our viewers.\"\n\nStrategic leadership under President and COO JD Rucker, appointed in June 2025, has contributed significantly to this upward trajectory. Under Rucker's guidance, Patriot.TV added prominent conservative hosts Wayne Dupree and Drew Berquist, both with strong followings and national recognition. The addition of their respective programs, \"The Wayne Dupree Show\" and \"This Is My Show with Drew Berquist\", has accelerated audience growth and diversified the platform's programming slate.\n\nFurthermore, the company secured a key advertising partnership with Evergreen Media Partners, granting advertisers direct access to Patriot.TV's highly engaged audience. This relationship enables new monetization opportunities and supports Patriot.TV's continued expansion.\n\nThis growth also mirrors strong investor sentiment. CBMJ shares have increased by 131.58% over the past month, including a 37.5% gain in the last week alone, and a 2.33% rise in the most recent trading session.\n\nAs traditional media companies face declining revenues and brand erosion, CBMJ's digital-first model and expanding audience base have positioned it as a compelling growth story within the media sector.\n\nRecent Nielsen data highlights this contrast. CNN's primetime audience is down approximately 50%, and MSNBC has seen similar declines. For instance, MSNBC averaged just 1.02 million primetime viewers in Q1 2025, an 18% year-over-year drop. CNN's recent inauguration coverage drew only 1.7 million viewers, compared to Fox News' 10 million, and led to layoffs of over 200 employees. Meanwhile, Fox News Channel has overtaken both ABC and NBC in primetime viewership for Q2 2025, averaging 3.0 million viewers (up 25% from 2024). CBS's weekday morning programming is down 10% year-over-year, and Paramount's TV advertising revenue has declined by double digits.\n\nPatriot.TV's wide distribution, including platforms such as Rumble (RUM), Roku, X (formerly Twitter), and others continues to drive accessibility and user engagement. The platform has also aligned with several cause-based organizations, further strengthening its brand loyalty and viewer retention.\n\nAs viewership habits continue to evolve and audiences demand greater transparency and values-based content, Patriot.TV's growth underscores a broader paradigm shift in media consumption. For investors evaluating long-term opportunities in digital media, the performance of CBMJ and Patriot.TV points to a scalable and sustainable business model well positioned for ongoing success.\n\nAbout Patriot.TV: Patriot.TV is a digital-first streaming platform delivering patriotic news, commentary, and original programming. Operating as a subsidiary of Conservative Broadcast Media & Journalism (OTCID:CBMJ), Patriot.TV is committed to American values, free speech, and truthful, unfiltered content for underserved audiences. With a cutting-edge multi-platform distribution strategy, Patriot.TV reaches viewers across its website, social media, and streaming apps, and drives revenue through sponsorships, advertising, affiliate partnerships, and memberships. Since its launch, Patriot.TV has become a burgeoning home for conservative voices, featuring an array of shows hosted by military veterans, media insiders, and grassroots influencers devoted to informing and empowering the American public. Visit www.Patriot.TV for more information.\n\nAbout Conservative Broadcast Media & Journalism Inc. (OTCID:CBMJ): CBMJ is a publicly traded media and digital broadcasting company focused on delivering conservative and faith-based content. Its wholly owned subsidiary, Patriot.TV, serves as a premier destination for news, commentary, and original programming that reflects traditional American values. For more information, visit www.Patriot.TV.",
  "medium": "Article",
  "links": [
    "https://pr.report/d1td",
    "https://pr.report/d1tc",
    "https://www.accessnewswire.com/newsroom/en/publishing-and-media/patriot.tv-viewership-and-stock-performance-surge-amid-industry-shift-and-lega-1057775",
    "https://www.accessnewswire.com/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Patriot.TV",
      "weight": 0.09970974
    },
    {
      "name": "Patriot.",
      "weight": 0.08117755
    },
    {
      "name": "TV",
      "weight": 0.076436415
    },
    {
      "name": "Patriot",
      "weight": 0.07077064
    },
    {
      "name": "audience growth",
      "weight": 0.07006163
    },
    {
      "name": "traditional American values",
      "weight": 0.06653104
    },
    {
      "name": "traditional media companies",
      "weight": 0.066243485
    },
    {
      "name": "digital media",
      "weight": 0.061608855
    },
    {
      "name": "American values",
      "weight": 0.0613685
    },
    {
      "name": "Patriot.TVs",
      "weight": 0.05884559
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.95263671875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8203125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.7744140625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Networks & Stations",
      "score": 0.6591796875
    },
    {
      "name": "/News/Other",
      "score": 0.53662109375
    }
  ],
  "sentiment": {
    "positive": 0.90527344,
    "negative": 0.025985718,
    "neutral": 0.06817627
  },
  "summary": "Patriot.TV, a division of Conservative Broadcast Media & Journalism Inc. (OTCID:CBMJ), has reported record-setting viewership and a significant increase in shareholder value. The company's shares have risen by 131.58% over the past month, including a 37.5% gain in the last week and a 2.33% rise in the most recent trading session. This growth aligns with broader trends favoring conservative-oriented networks like Fox Corporation's Fox News (FOX), Newsmax (NMAX), and Sinclair Broadcast Group (SBGI), while major networks under Warner Bros. Discovery, Paramount Global (PARA), and The Walt Disney Company (DIS) have experienced significant declines in ratings and advertising revenues. As traditional media companies struggle with declining revenues and brand erosion, Patriot.TV's digital-first model and expanding audience base have positioned it as a compelling growth story within the media sector.",
  "shortSummary": "CBMJ shares surged 131.58% under strategic leadership, driven by strong investor sentiment and a shift towards digital media amid declining revenues and brand erosion in traditional media.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a3ec2c56e3c54c65a5542bba1ee3d864",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://pr.report/d1td",
      "text": "Sponsored How to Take Full Advantage of the “Trump Economy” With Your Retirement Savings by Sponsored Post August 6, 2025\nNYC Opens City-Funded Shelter Only for Trans, Gender Non-conforming ‘Individuals Experiencing Homelessness’\nFree Speech Wins: Judge Sides With Elon Musk and X, Strikes Down California Law Restricting Election Parody Videos\nAssistant AG Harmeet Dhillon Launches Legal Blitz to Clean up Voter Rolls and Dismantle Democrat’s ‘Illegal Race-Based Gerrymandering’\nThe ‘Islamic Bomb’ Comes to Texas: Pakistani Officials and Their Diaspora Celebrate Nuclear Supremacy on American Soil\nJames Carville Calls on Dems to ‘Save Democracy’ by Taking Radical Measures to Game System by Jason Cohen, Daily Caller News Foundation August 7, 2025 4\nThe Greatest Scam in History Is the Creation of the Federal Reserve by The Liberty Daily August 6, 2025 0\nAdam Schiff Under Federal Criminal Investigation for Mortgage Fraud by Mariane Angela, DCNF August 6, 2025 8\nThe Dark Side of Big Solar Exposed as the Fight to Save Farmland Heats Up by Tyler Durden, Zero Hedge August 7, 2025 0\nAmerican Auto Giants Thrilled to Sell Gas Guzzlers Again After Collapse of Biden’s EV Mandate by Daily Caller August 7, 2025 0\nWhat’s in the Senate’s Government Funding Minibus? by Thérèse Boudreaux, The Center Square August 6, 2025 0\nNever-Before-Seen Photos Inside Jeffrey Epstein’s Creepy Mansion by Tyler Durden, Zero Hedge August 6, 2025 0\nThe Digital Jihadist: Silicon Valley Exec Paul Biggar Is Powering Hamas’s Online War Against the West\nAggregated Economist Devlyn Steele Talks Finance, Breaks Down the Ins and Outs of the Gold IRA Industry by Patriot TV August 3, 2025\nThe Digital Jihadist: Silicon Valley Exec Paul Biggar Is Powering Hamas’s Online War Against the West by RAIR Foundation August 5, 2025 0\nSharyl Attkisson: “I Never Thought I Would See Some of These Types of Changes in My Lifetime” by The Liberty Daily August 5, 2025 0\nTrump Administration to Fast-Track Lunar Nuclear Reactor by Tyler Durden, Zero Hedge August 6, 2025 0\nThe New Gulag: Mental Health Detentions and the Criminalization of Dissent by JD Rucker August 5, 2025 0\n“Working Like an Ugly Stripper”: TSA Derailed Bill to Regulate Airport Surveillance by Ireland Owens, DCNF August 5, 2025 0\nSponsored Financial Fear Fades Away: Take Control of Your Retirement With a Self-Directed IRA by Sponsored Post August 1, 2025\nCIA Director Ratcliffe: Hillary Clinton’s Russia Hoax the ‘Greatest Political Scandal’ We’ll See in Our Lifetime\nShocking Chart Exposes America’s “Civilizational Crisis”: A Nation in Freefall Without Immediate Course Correction\nPakistan Invades Texas: Meet Corrupt Democrat Rep. Salman Bhojani — The Lone Star State’s Own Zohran Mamdani\nInternational Outlets Largely Ignore Emaciated Israeli Hostages After Featuring False Starving Gaza Children Pictures\nGov. JB Pritzker Brokers Deal to Host Roughly 30 Texas Democrats in Chicago for Week-Long Plot Against GOP Redistricting Plan\nAggregated NYC Opens City-Funded Shelter Only for Trans, Gender Non-conforming ‘Individuals Experiencing Homelessness’ August 7, 2025\nCurated James Carville Calls on Dems to ‘Save Democracy’ by Taking Radical Measures to Game System August 7, 2025\nAggregated Free Speech Wins: Judge Sides With Elon Musk and X, Strikes Down California Law Restricting Election Parody Videos August 7, 2025\nAggregated Assistant AG Harmeet Dhillon Launches Legal Blitz to Clean up Voter Rolls and Dismantle Democrat’s ‘Illegal Race-Based Gerrymandering’ August 7, 2025\nAggregated Why the Pesticide Liability Protection Act Threatens Our Food Supply and the Health of a Nation August 7, 2025\nAggregated Marjorie Taylor Greene Warns: Those Who Are Not ‘Radically America First’ Are ‘The Enemy’ August 7, 2025\nCurated American Auto Giants Thrilled to Sell Gas Guzzlers Again After Collapse of Biden’s EV Mandate August 7, 2025\nAggregated The ‘Islamic Bomb’ Comes to Texas: Pakistani Officials and Their Diaspora Celebrate Nuclear Supremacy on American Soil August 7, 2025\nSponsored How to Take Full Advantage of the “Trump Economy” With Your Retirement Savings August 6, 2025\nAggregated ‘China Is Happy:’ New Memos Expose Homeland Security’s Concerns About Tim Walz CCP Connections August 6, 2025\nAggregated Charlie Sheen Puts His Money Where His Mouth Is for White Mother Beaten by a Black Mob August 6, 2025\nAggregated Biblical Illiteracy: There Are Few Verses in Scripture as Mishandled as ‘Judge Not’ August 5, 2025\nAggregated The Digital Jihadist: Silicon Valley Exec Paul Biggar Is Powering Hamas’s Online War Against the West August 5, 2025\nAggregated Sharyl Attkisson: “I Never Thought I Would See Some of These Types of Changes in My Lifetime” August 5, 2025\nAggregated Anti-Israel Activism Is ‘Highly Coordinated,’ Indiana University Study Concludes August 5, 2025\nAggregated Confirmed Liar Jeremy Ben-Ami of Soros-Backed J Street Joins Team ‘Genocide’ August 5, 2025\nAggregated Trump’s Taking Us Back to the Moon, and This Time We Are Doing a Lot More Than Just Setting Foot August 5, 2025\nAggregated From Vaudeville to YouTube: Late-Night Is Dying Because That’s How the Entertainment Industry Works August 5, 2025\nCurated “Working Like an Ugly Stripper”: TSA Derailed Bill to Regulate Airport Surveillance August 5, 2025\nAggregated FDA Approves Jeff Bezos’ Lab-Grown Fake ‘Fish’ for U.S Food Supply Without Safety Data August 5, 2025\nAggregated GOP Senator to Introduce ‘LETITIA Act’ Targeting ‘Crooked Politicians’—Schiff, James Hardest Hit? August 5, 2025\nCurated “Quacks Like a Duck”: AOC in Hot Water for Classifying Her Live-In as “Spouse” and “Not a Spouse” August 5, 2025\nAggregated To Kill an Operation Mockingbird: Tulsi Goes to War With the CIA’s Propaganda Yobbos August 4, 2025\nCurated Trump Admin Threatens Disaster Funds for States That Boycott Israeli Companies August 4, 2025\nCurated Let’s Check In on What Life Is Like in America’s Crime-Ridden Major Cities in 2025 August 4, 2025\nAggregated ‘Relatively Simple’ AI Trading Bots Naturally Collude to Rig Markets: Wharton August 4, 2025\nAggregated “You’re Fired!” Trump Was Right: BLS Commissioner Inflated Job Numbers to Benefit Biden and Harris August 4, 2025\nAggregated CIA Director Ratcliffe: Hillary Clinton’s Russia Hoax the ‘Greatest Political Scandal’ We’ll See in Our Lifetime August 4, 2025"
    },
    {
      "url": "https://pr.report/d1tc",
      "text": "Sponsored How to Take Full Advantage of the “Trump Economy” With Your Retirement Savings by Sponsored Post August 6, 2025\nNYC Opens City-Funded Shelter Only for Trans, Gender Non-conforming ‘Individuals Experiencing Homelessness’\nFree Speech Wins: Judge Sides With Elon Musk and X, Strikes Down California Law Restricting Election Parody Videos\nAssistant AG Harmeet Dhillon Launches Legal Blitz to Clean up Voter Rolls and Dismantle Democrat’s ‘Illegal Race-Based Gerrymandering’\nThe ‘Islamic Bomb’ Comes to Texas: Pakistani Officials and Their Diaspora Celebrate Nuclear Supremacy on American Soil\nJames Carville Calls on Dems to ‘Save Democracy’ by Taking Radical Measures to Game System by Jason Cohen, Daily Caller News Foundation August 7, 2025 4\nThe Greatest Scam in History Is the Creation of the Federal Reserve by The Liberty Daily August 6, 2025 0\nAdam Schiff Under Federal Criminal Investigation for Mortgage Fraud by Mariane Angela, DCNF August 6, 2025 8\nThe Dark Side of Big Solar Exposed as the Fight to Save Farmland Heats Up by Tyler Durden, Zero Hedge August 7, 2025 0\nAmerican Auto Giants Thrilled to Sell Gas Guzzlers Again After Collapse of Biden’s EV Mandate by Daily Caller August 7, 2025 0\nWhat’s in the Senate’s Government Funding Minibus? by Thérèse Boudreaux, The Center Square August 6, 2025 0\nNever-Before-Seen Photos Inside Jeffrey Epstein’s Creepy Mansion by Tyler Durden, Zero Hedge August 6, 2025 0\nThe Digital Jihadist: Silicon Valley Exec Paul Biggar Is Powering Hamas’s Online War Against the West\nAggregated Economist Devlyn Steele Talks Finance, Breaks Down the Ins and Outs of the Gold IRA Industry by Patriot TV August 3, 2025\nThe Digital Jihadist: Silicon Valley Exec Paul Biggar Is Powering Hamas’s Online War Against the West by RAIR Foundation August 5, 2025 0\nSharyl Attkisson: “I Never Thought I Would See Some of These Types of Changes in My Lifetime” by The Liberty Daily August 5, 2025 0\nTrump Administration to Fast-Track Lunar Nuclear Reactor by Tyler Durden, Zero Hedge August 6, 2025 0\nThe New Gulag: Mental Health Detentions and the Criminalization of Dissent by JD Rucker August 5, 2025 0\n“Working Like an Ugly Stripper”: TSA Derailed Bill to Regulate Airport Surveillance by Ireland Owens, DCNF August 5, 2025 0\nSponsored Financial Fear Fades Away: Take Control of Your Retirement With a Self-Directed IRA by Sponsored Post August 1, 2025\nCIA Director Ratcliffe: Hillary Clinton’s Russia Hoax the ‘Greatest Political Scandal’ We’ll See in Our Lifetime\nShocking Chart Exposes America’s “Civilizational Crisis”: A Nation in Freefall Without Immediate Course Correction\nPakistan Invades Texas: Meet Corrupt Democrat Rep. Salman Bhojani — The Lone Star State’s Own Zohran Mamdani\nInternational Outlets Largely Ignore Emaciated Israeli Hostages After Featuring False Starving Gaza Children Pictures\nGov. JB Pritzker Brokers Deal to Host Roughly 30 Texas Democrats in Chicago for Week-Long Plot Against GOP Redistricting Plan\nAggregated NYC Opens City-Funded Shelter Only for Trans, Gender Non-conforming ‘Individuals Experiencing Homelessness’ August 7, 2025\nCurated James Carville Calls on Dems to ‘Save Democracy’ by Taking Radical Measures to Game System August 7, 2025\nAggregated Free Speech Wins: Judge Sides With Elon Musk and X, Strikes Down California Law Restricting Election Parody Videos August 7, 2025\nAggregated Assistant AG Harmeet Dhillon Launches Legal Blitz to Clean up Voter Rolls and Dismantle Democrat’s ‘Illegal Race-Based Gerrymandering’ August 7, 2025\nAggregated Why the Pesticide Liability Protection Act Threatens Our Food Supply and the Health of a Nation August 7, 2025\nAggregated Marjorie Taylor Greene Warns: Those Who Are Not ‘Radically America First’ Are ‘The Enemy’ August 7, 2025\nCurated American Auto Giants Thrilled to Sell Gas Guzzlers Again After Collapse of Biden’s EV Mandate August 7, 2025\nAggregated The ‘Islamic Bomb’ Comes to Texas: Pakistani Officials and Their Diaspora Celebrate Nuclear Supremacy on American Soil August 7, 2025\nSponsored How to Take Full Advantage of the “Trump Economy” With Your Retirement Savings August 6, 2025\nAggregated ‘China Is Happy:’ New Memos Expose Homeland Security’s Concerns About Tim Walz CCP Connections August 6, 2025\nAggregated Charlie Sheen Puts His Money Where His Mouth Is for White Mother Beaten by a Black Mob August 6, 2025\nAggregated Biblical Illiteracy: There Are Few Verses in Scripture as Mishandled as ‘Judge Not’ August 5, 2025\nAggregated The Digital Jihadist: Silicon Valley Exec Paul Biggar Is Powering Hamas’s Online War Against the West August 5, 2025\nAggregated Sharyl Attkisson: “I Never Thought I Would See Some of These Types of Changes in My Lifetime” August 5, 2025\nAggregated Anti-Israel Activism Is ‘Highly Coordinated,’ Indiana University Study Concludes August 5, 2025\nAggregated Confirmed Liar Jeremy Ben-Ami of Soros-Backed J Street Joins Team ‘Genocide’ August 5, 2025\nAggregated Trump’s Taking Us Back to the Moon, and This Time We Are Doing a Lot More Than Just Setting Foot August 5, 2025\nAggregated From Vaudeville to YouTube: Late-Night Is Dying Because That’s How the Entertainment Industry Works August 5, 2025\nCurated “Working Like an Ugly Stripper”: TSA Derailed Bill to Regulate Airport Surveillance August 5, 2025\nAggregated FDA Approves Jeff Bezos’ Lab-Grown Fake ‘Fish’ for U.S Food Supply Without Safety Data August 5, 2025\nAggregated GOP Senator to Introduce ‘LETITIA Act’ Targeting ‘Crooked Politicians’—Schiff, James Hardest Hit? August 5, 2025\nCurated “Quacks Like a Duck”: AOC in Hot Water for Classifying Her Live-In as “Spouse” and “Not a Spouse” August 5, 2025\nAggregated To Kill an Operation Mockingbird: Tulsi Goes to War With the CIA’s Propaganda Yobbos August 4, 2025\nCurated Trump Admin Threatens Disaster Funds for States That Boycott Israeli Companies August 4, 2025\nCurated Let’s Check In on What Life Is Like in America’s Crime-Ridden Major Cities in 2025 August 4, 2025\nAggregated ‘Relatively Simple’ AI Trading Bots Naturally Collude to Rig Markets: Wharton August 4, 2025\nAggregated “You’re Fired!” Trump Was Right: BLS Commissioner Inflated Job Numbers to Benefit Biden and Harris August 4, 2025\nAggregated CIA Director Ratcliffe: Hillary Clinton’s Russia Hoax the ‘Greatest Political Scandal’ We’ll See in Our Lifetime August 4, 2025"
    }
  ],
  "argos_summary": "Patriot.TV, a subsidiary of Conservative Broadcast Media & Journalism Inc. (OTCID:CBMJ), has reported record viewership with 1.6 million live viewers in July, contributing to a 131.58% increase in CBMJ shares over the past month. This growth reflects a shift towards conservative media platforms as traditional networks face declining ratings and revenues. The company's strategic leadership and new programming, including shows hosted by recognized conservative figures, have further enhanced audience engagement and investor interest.",
  "argos_id": "HQKEGFU7O"
}