{
  "url": "https://www.thesun.co.uk/sport/36194573/newcastle-united-transfers-tottenham-rejections/",
  "authorsByline": "Dave Kidd",
  "articleId": "e8dc7f3a4e244e4dbc4d4545c0e9b782",
  "source": {
    "domain": "thesun.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "county": "West Yorkshire",
      "city": "Leeds",
      "coordinates": {
        "lat": 53.7440745,
        "lon": -1.5988598
      }
    }
  },
  "imageUrl": "https://www.thesun.co.uk/wp-content/uploads/2025/08/RB-07-08-NEWCASTLE_OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-07T15:13:01+01:00",
  "addDate": "2025-08-07T14:17:23.723279+00:00",
  "refreshDate": "2025-08-07T14:17:23.723283+00:00",
  "score": 1.0,
  "title": "Why Newcastle have become new Spurs despite having richest owners in football",
  "description": "SO how did the club with the richest owners in world football turn into the Tottenham of the North? Why are so many of the most-wanted players in Europe swiping left on the chance to join Newcastle…",
  "content": "The Toon have been snubbed by several key targets\n\nTOON-ING OUT Why Newcastle have become the new Tottenham after getting rejected by stars despite having richest owners in football\n\nSO how did the club with the richest owners in world football turn into the Tottenham of the North?\n\nWhy are so many of the most-wanted players in Europe swiping left on the chance to join Newcastle United?\n\nA club which won its first domestic silverware in 70 years, qualified for the Champions League and boasts a vast, fanatical support, should have been enjoying a transformative summer.\n\nThe euphoria of clinching the Carabao Cup, then heading back into the European elite, was supposed to serve as a launchpad for the Geordie Arabia revolution.\n\nInstead, tumbleweed is blowing across Tyneside as Newcastle risk losing the transfer window due to a combination of neglect, misfortune and the ongoing restrictions of PSR regulations.\n\nAlexander Isak is trying to engineer a move to Liverpool, while Benjamin Sesko prefers lowly, Europe-free Manchester United over St James’ Park.\n\nThe Slovenian striker is expected to join Hugo Ekitike, Joao Pedro, Bryan Mbeumo, Liam Delap, Dean Huijsen and James Trafford among a long list of players to have snubbed the Toon this summer.\n\nIt’s normally only Spurs who suffer such an embarrassing sequence of ‘thanks, but no thanks’ messages during a transfer window.\n\nIsak’s desire to join the Premier League champions stems back to Newcastle’s unwillingness to grant him a significant rise on his £120,000-per-week wages.\n\nThe Swede is the jewel in Newcastle’s crown - the closest thing to Thierry Henry in the current era, with his 23 Premier League goals bettered only by Mo Salah last season.\n\nBEST ONLINE CASINOS - TOP SITES IN THE UK\n\nIf Isak leaves, it would seriously damage Newcastle's reputation as a club hell-bent on disrupting the status quo and establishing itself as one of Europe’s biggest clubs.\n\nBut PSR has made it impossible for the Saudis to follow the lead of those previous filthy-rich ‘disruptors’ Roman Abramovich at Chelsea and Sheikh Mansour at Manchester City.\n\nNewcastle are unable to blow rivals out of the water on transfer fees and wages. Any assault on world domination must be a waiting game.\n\nAnd time is not on Isak’s side, as a 25-year-old reaching the peak of his powers.\n\nWhile an excellent coach who has overperformed throughout most of his career, Eddie Howe is not a dynamic hardman well-suited to dealing with a situation like Isak’s stand-off.\n\nAnd with Sesko preferring a move to Old Trafford, Newcastle’s frustrations in trying to sign a striker - as a potential replacement for Isak, or to boost their existing squad - are being continually frustrated.\n\nAs Alan Shearer says, ‘it is not a good look’ and the summer has been a ‘nightmare’.\n\nSo far, winger Anthony Elanga has been Newcastle’s only major signing, in a £55million move from Nottingham Forest.\n\nAnd as Howe looks to juggle the demands of the Premier League and Champions League, Newcastle’s squad looks worryingly thin.\n\nTRANSFER NEWS LIVE - KEEP UP WITH ALL THE LATEST FROM A BUSY SUMMER WINDOW\n\nWhile PSR continues to stifle ambitions, the club does have financial wriggle room to spend this summer - hence their bids for Sesko and several other forwards.\n\nYet there is a major power vacuum at the club, with sporting director Paul Mitchell having left in August after a brief and vexatious spell, while chief executive Darren Eales handed in his notice last year due to a serious health condition.\n\nTo leave both positions vacant during such a pivotal summer looks like carelessness.\n\nThis comes after the departures of Amanda Staveley and her husband Mehrdad Ghodoussi last summer, which wiped away the public face of Newcastle’s Saudi ownership and added to the impression of a rudderless ship.\n\nThere are fears among the club’s support that their Saudi paymasters are indifferent to the club.\n\nThe sporting interests of the Saudi Public Investment Fund are wide and varied - including ventures into golf, boxing and tennis as well as its stakes in four Saudi Pro-League clubs.\n\nWith Saudi Arabia set to host the World Cup in 2034, there are many other sporting priorities on which to focus - without PSR hindrances.\n\nThe Premier League attempted to block Newcastle’s Saudi takeover in the first place and its clubs are determined to hold them back.\n\nIt would be ever so cute to imagine that those rivals are motivated by a distaste for the severe human-rights abuses of the Saudi regime. In truth, it is all about self-interest.\n\nNewcastle’s training facilities remain well short of elite level and plans to expand St James’ Park or build a new stadium remain under wraps.\n\nThere is no sense of urgency or focus about the club and this is acknowledged by many shakers and movers in the transfer market.\n\nYet for Isak, and for any world-class target, there will always be an urgency to win trophies and earn sackloads of money in a short career.",
  "medium": "Article",
  "links": [
    "https://www.thesun.co.uk/sport/36143344/birmingham-vs-ipswich-preview-free-betting-tips-odds-predictions/",
    "https://www.thesun.co.uk/who/amanda-staveley/",
    "https://www.thesun.co.uk/who/dean-huijsen/",
    "https://www.thesun.co.uk/sport/football/team/1196669/newcastle-united/",
    "https://www.thesun.co.uk/who/james-trafford/",
    "https://www.thesun.co.uk/who/joao-pedro/",
    "https://www.thesun.co.uk/who/benjamin-sesko/",
    "https://www.thesun.co.uk/who/anthony-elanga/",
    "https://www.thesun.co.uk/sport/36190793/james-maddison-tottenham-acl-injury/",
    "https://www.thesun.co.uk/sport/36189648/levi-colwill-injury-emergency-transfer-chelsea/",
    "https://www.thesun.co.uk/sport/football/team/1225889/nottingham-forest/",
    "https://www.thesun.co.uk/who/alan-shearer/",
    "https://www.thesun.co.uk/who/mohamed-salah/",
    "https://www.thesun.co.uk/who/thierry-henry/",
    "https://www.thesun.co.uk/who/eddie-howe/",
    "https://www.thesun.co.uk/who/alexander-isak/",
    "https://www.thesun.co.uk/sport/football/team/1196659/liverpool/",
    "https://www.thesun.co.uk/sport/football/team/1196652/tottenham-hotspur/",
    "https://www.thesun.co.uk/betting/32855412/best-online-casinos-uk/",
    "https://www.thesun.co.uk/who/roman-abramovich/",
    "https://www.thesun.co.uk/who/bryan-mbeumo/",
    "https://www.thesun.co.uk/sport/football/team/1196660/chelsea/",
    "https://www.thesun.co.uk/topic/golf/",
    "https://www.thesun.co.uk/who/liam-delap/",
    "https://dreamteam.app.link/NwwUacoK1Ub",
    "https://www.thesun.co.uk/topic/carabao-cup/",
    "https://www.thesun.co.uk/who/hugo-ekitike/",
    "https://www.thesun.co.uk/sport/36187675/newcastle-scouts-vangelis-pavlidis-transfer-sesko/",
    "https://www.thesun.co.uk/sport/35382625/arsenal-transfer-news-live-jacquet-rodrygo-eze-trossard-latest-updates/",
    "https://www.thesun.co.uk/sport/35896527/transfer-news-live-isak-ekitike-liverpool-rogers-chelsea-updates/",
    "https://www.thesun.co.uk/sport/football/team/1196656/manchester-united/",
    "https://www.thesun.co.uk/topic/champions-league/",
    "https://www.thesun.co.uk/topic/boxing/",
    "https://www.thesun.co.uk/sport/36191401/west-ham-michail-antonio-release-crash/",
    "https://www.thesun.co.uk/sport/football/team/1196654/manchester-city/",
    "https://www.thesun.co.uk/topic/tennis/",
    "https://www.thesun.co.uk/who/sheikh-mansour/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Newcastle United",
      "weight": 0.07743903
    },
    {
      "name": "Newcastle",
      "weight": 0.076970905
    },
    {
      "name": "Premier League",
      "weight": 0.06752112
    },
    {
      "name": "Saudi Pro-League",
      "weight": 0.0656266
    },
    {
      "name": "last summer",
      "weight": 0.06469245
    },
    {
      "name": "Champions League",
      "weight": 0.059684873
    },
    {
      "name": "summer",
      "weight": 0.055458892
    },
    {
      "name": "last year",
      "weight": 0.054959357
    },
    {
      "name": "Isak",
      "weight": 0.053939316
    },
    {
      "name": "Alexander Isak",
      "weight": 0.053897087
    }
  ],
  "topics": [
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9853515625
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.98388671875
    }
  ],
  "sentiment": {
    "positive": 0.05328369,
    "negative": 0.71435547,
    "neutral": 0.23205566
  },
  "summary": "Newcastle United, the club with the richest owners in world football, has been repeatedly rejected by key players, including Alexander Isak, Benjamin Sesko, Hugo Ekitike, Joao Pedro, Bryan Mbeumo, Liam Delap, Dean Huijsen and James Trafford. The club is also being hampered by the restrictions of Saudi Public Investment Reser (PSR), which has made it impossible for Saudi footballers to follow the lead of previous 'disruptors' like Roman Abramovich at Chelsea and Sheikh Mansour at Manchester City. Despite this, Newcastle's only major signing is winger Anthony Elanga from Nottingham Forest. There are fears among the club that their Saudi owners are indifferent to the club's sporting interests and that Saudi Arabia is set to host the World Cup in 2034.",
  "shortSummary": "Newcastle United, despite having the richest owners in football, are struggling to attract top players due to neglect, issues with finances, and player preferences.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8c63b6b9a4ff4c4f9a8b2e82ce48be3f",
  "places": [
    {
      "osmId": "23381655",
      "road": "Barrack Road",
      "suburb": "Grainger Town",
      "city": "Newcastle upon Tyne",
      "stateDistrict": "North of Tyne",
      "state": "England",
      "postcode": "NE1 4ST",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 54.9754693,
        "lon": -1.621873666214279
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Newcastle United, despite having the richest owners in football, is struggling to attract top talent during the transfer window, drawing comparisons to Tottenham Hotspur. Key targets like Alexander Isak are opting for other clubs, citing issues such as wage negotiations and the club's lack of urgency and direction. The club's ambitions are further hampered by the restrictions of the Premier League's Profit and Sustainability Regulations, leaving them with a thin squad and a power vacuum in leadership roles.",
  "argos_id": "HY7O2XPIE"
}