{
  "url": "https://www.nbcnews.com/politics/congress/sen-john-cornyn-says-fbi-granted-request-help-find-texas-democrats-rcna223599",
  "authorsByline": "Megan Lebowitz, Michael Kosnar",
  "articleId": "c49de1c27d3743ff9fb4879fadc8331d",
  "source": {
    "domain": "nbcnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-08/250807-Texas-Democrats-rs-4517dd.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T14:29:09.140000+00:00",
  "addDate": "2025-08-07T14:31:55.060860+00:00",
  "refreshDate": "2025-08-07T14:31:55.060879+00:00",
  "score": 1.0,
  "title": "Sen. John Cornyn says the FBI granted his request to help find absent Texas Democrats",
  "description": "Earlier this week, an administration official told NBC News that there were no plans to use federal agents to arrest Texas lawmakers who left the state.",
  "content": "Sen. John Cornyn, R-Texas, said Thursday that the FBI has approved his request for federal law enforcement to help locate Texas state Democratic lawmakers who left the state in an effort to block GOP redistricting efforts.\n\n\"I am proud to announce that Director Kash Patel has approved my request for the FBI to assist state and local law enforcement in locating runaway Texas House Democrats,\" Cornyn said in a statement.\n\nCornyn thanked President Donald Trump and FBI Director Kash Patel for \"supporting and swiftly acting on my call for the federal government to hold these supposed lawmakers accountable for fleeing Texas.\"\n\n\"We cannot allow these rogue legislators to avoid their constitutional responsibilities,\" he added.\n\nThe announcement comes after Cornyn sent a letter to Patel on Tuesday urging that \"the FBI has tools to aid state law enforcement when parties cross state lines, including to avoid testifying or fleeing a scene of a crime.\"\n\nOne day earlier, an administration official told NBC News that there were no plans to use federal agents to arrest Texas lawmakers who left the state. That official said Gov. Greg Abbott, a Republican, \"can handle his own state.\"\n\nReached for comment, a spokesperson for Cornyn’s office deferred to the FBI for further details about the request. A spokesperson for the FBI declined to comment.\n\nNBC News has reached out to the Texas House Democratic Caucus for comment.\n\nDemocratic legislators left Texas last weekend in an effort to deny Republican lawmakers a quorum as they tried to push forward a redistricting plan that could allow the GOP to pick up five seats in Congress next year.",
  "medium": "Article",
  "links": [
    "https://www.nbcnews.com/politics/elections/texas-democrats-head-illinois-deny-republicans-quorum-redistricting-rcna222743"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Texas state Democratic lawmakers",
      "weight": 0.12060554
    },
    {
      "name": "Texas lawmakers",
      "weight": 0.11076151
    },
    {
      "name": "FBI Director Kash Patel",
      "weight": 0.10872992
    },
    {
      "name": "state law enforcement",
      "weight": 0.106046654
    },
    {
      "name": "runaway Texas House Democrats",
      "weight": 0.10084483
    },
    {
      "name": "absent Texas Democrats",
      "weight": 0.097479135
    },
    {
      "name": "federal law enforcement",
      "weight": 0.09643303
    },
    {
      "name": "Texas",
      "weight": 0.09445699
    },
    {
      "name": "John Cornyn",
      "weight": 0.09035713
    },
    {
      "name": "FBI",
      "weight": 0.09023581
    }
  ],
  "topics": [
    {
      "name": "Congress"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9873046875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.984375
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.900390625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.76708984375
    },
    {
      "name": "/News/Local News",
      "score": 0.320556640625
    }
  ],
  "sentiment": {
    "positive": 0.17700195,
    "negative": 0.47631836,
    "neutral": 0.3466797
  },
  "summary": "Sen. John Cornyn, a Republican from Texas, has requested the FBI to assist in locating Texas state Democratic lawmakers who left the state in an effort to block GOP redistricting efforts. This comes after Cornyn sent a letter to FBI Director Kash Patel asking for assistance in assisting state and local law enforcement in locating the absent Democrats. The move comes as an attempt to deny Republican lawmakers a quorum as they try to implement a redistricting plan that could allow the GOP to gain five seats in Congress. An administration official said there were no plans to use federal agents to arrest Texas lawmakers who had left the country.",
  "shortSummary": "The FBI has granted Sen. John Cornyn's request to locate Texas Democratic lawmakers who have fled the state to block GOP redistricting efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8c3ecbd079e24ac6bc5603a97bd744f1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nbcnews.com/politics/elections/texas-democrats-head-illinois-deny-republicans-quorum-redistricting-rcna222743",
      "text": "CAROL STREAM, Ill. — A showdown over redistricting in Texas played out here on Sunday as dozens of state Democrats took refuge roughly 1,000 miles away from home, saying they had fled Texas to deny a quorum to Republican efforts to add as many as five congressional seats to their map.\nIt culminated with Texas' governor, a Republican, threatening to expel the Democrats from the Texas state House and potentially extradite them, saying they may be \"felons.\"\nThe Texas state House Democrats filed off of buses and Ubers into a crammed county party headquarters at a strip mall Sunday night, standing alongside Illinois Gov. JB Pritzker to rail against what they charged was a racist, unfair and undemocratic attempt to overhaul the Lone Star State’s political map.\nTexas House Democratic Caucus Chair Gene Wu said that he believed about 57 Democrats have left the state, with the bulk staying in Illinois for at least the immediate future. Other House Democrats were in Boston and Albany, New York.\n\"Gov. Abbott is doing this in submission to Donald Trump so that Donald Trump can steal these communities’ power and voice,\" Wu said. \"We will not be complicit in the destruction of our own communities. We're not here to play political games. We're here to demand an end to this corrupt process.\"\nAfter the news conference, Wu said there was real fear that some of their members could be arrested for defying a special session call.\n“We have discussed this. This is a topic of serious concern. We know the governor has no authority to send state troopers over here but we don’t know what Donald Trump’s going to do,” Wu said.\nHe argued there was no legal basis for arrests but then pointed to questionable actions taken by immigration officials in their nationwide sweeps.\n“That’s not far-fetched from arresting state legislators because they feel like it, and consequences be damned,” he added.\nOn Sunday evening, Texas Gov. Greg Abbott made another threat, saying in a statement that if Democrats didn't return by the time the Legislature is set to convene at 3 p.m. CT Monday, he would invoke an opinion by the Texas attorney general that he said would allow the removal of those Democrats from the Texas House.\nHe also said that those legislators \"may have also committed felonies\" if they are \"soliciting funds to evade the fines they will incur under House rules.\"\nThe Texas Democrats face the risk of a $500-a-day fine. The Republican-controlled Legislature approved the punishment in 2023, two years after state Democrats left the state for three weeks to block an elections bill from progressing.\n\"I will use my full extradition authority to demand the return to Texas of any potential out-of-state felons,\" Abbott said in the statement.\nIn response to Abbott's threats of expulsion and arrest, the Texas state House Democratic Caucus issued a statement: \"Come and take it.\"\nThe Democrats' plans were uncertain, with Wu saying he was taking it day by day in a plan to stay in Illinois brokered with Pritzker, who had met with the Texas caucus late last month and has directed staff to provide logistical support for their stay. Pritzker said he was not funding the Texas lawmakers and had not planned to help them pay their potential fines.\n“They are attempting to cheat,” Pritzker said Sunday evening of Texas Republicans Asked about his own state’s congressional map — which has long been criticized for having been gerrymandered by Democrats, who now have a 14-3 congressional advantage in the state — Pritzker contended there was a difference.\n“You’re talking about the outcome,\" he said. \"The fact that we are very good in Illinois about delivering for the people of Illinois and then people react to that and vote for our candidate winning is very different than cheating mid-decade by rewriting the rule because their cult leader told them to do it.\"\nWhen asked if potential efforts by California Gov. Gavin Newsom and New York Gov. Kathy Hochul, also Democrats, would also be cheating if they take similar action to match Texas as they have suggested, Pritzker said: “Remember, all bets are off. All bets are when the cult leader and would-be dictator tells Texas to midstream change the game when they know they’re going to lose in 2026. All bets are off. Everything’s got to be on the table.”\nLast week, Texas Republicans released a proposed new congressional map that would give their party a path to pick up five seats in next year’s midterm elections. It followed President Donald Trump’s public pressure for a new map in the state as he works to retain a majority in Congress in what historically is a difficult year for the party holding the White House.\nThe proposed map would shift district lines in ways that would target current Democratic members of Congress in and around Austin, Dallas and Houston, as well as two already endangered Democrats representing south Texas districts that Trump carried last year.\nA House committee approved the gerrymandered congressional maps in a party-line vote Saturday morning. After the vote, the committee chairman, Republican state Rep. Cody Vasut, told NBC News the maps were drawn to help Republicans win more seats.\n“This map was politically based, and that’s totally legal, totally allowed and totally fair,” Vasut said. “You got states like California and New York and Illinois that have these really large margins between the percentage of seats they have and the percentage of votes that they’re getting, and Texas is underperforming in that. And so it’s totally prudent, totally right, for Texas to be able to respond and improve the political performance of its map.”\nPolitically, the move puts Pritzker at the center of a high-profile national fight. The governor, who is running for his third term in office, is also widely viewed as a 2028 presidential contender. He has implored Democrats to resist Trump’s agenda.\nThe origins of Pritzker’s involvement began when the governor gave a keynote address to Oklahoma Democrats in June. Pritzker met privately in a “robust” meeting with the party chair to talk about the Texas redistricting, according to a person close to the governor. When Pritzker later met with Texas Democrats, he assured them they could come to his state and find support, including finding hotels, meeting spaces and other logistical assistance.\n“Democrats have got to stand up at this point and tell every individual in this nation, ‘This is not normal. This is not democracy,’” Texas state Rep. Ann Johnson told NBC News on Saturday.\n“You’ve got these Texas Republicans that are just rolling over and giving Trump what he wants because he’s asked for it,” Johnson said. “It’s an affront to every citizen, not only in Texas but the nation.”\nNatasha Korecki reported from Chicago, and Ryan Chandler from Austin, Texas."
    }
  ],
  "argos_summary": "Sen. John Cornyn announced that the FBI has approved his request for federal assistance in locating Texas state Democratic lawmakers who fled the state to block GOP redistricting efforts. The Democrats, numbering around 57, are currently in Illinois, aiming to deny a quorum for the Republican-led redistricting plan that could secure additional congressional seats for the GOP. Texas Governor Greg Abbott has threatened to expel the lawmakers and potentially extradite them, claiming they may have committed felonies by avoiding legislative duties.",
  "argos_id": "K5601MAYS"
}