{
  "url": "https://www.usnews.com/news/world/articles/2025-08-07/the-latest-netanyahu-facing-opposition-to-reported-plan-for-reoccupation-of-gaza",
  "authorsByline": "Associated Press",
  "articleId": "71f6594ed30b46da904a8e9b77803caa",
  "source": {
    "domain": "usnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.usnews.com/dims4/USNEWS/42b6044/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F10%2F63fd6302a6479dd1442d7229956752%2F1754a7fba4b54ceeb5bfc9e6e5cfd632APTOPIX_Israel_Palestinians_Gaza_05820.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T10:29:00-04:00",
  "addDate": "2025-08-07T15:07:00.436399+00:00",
  "refreshDate": "2025-08-07T15:07:00.436400+00:00",
  "score": 1.0,
  "title": "The Latest: Netanyahu Facing Opposition to Reported Plan for Reoccupation of Gaza",
  "description": "Prime Minister Benjamin Netanyahu is meeting with top advisers to discuss Israel's strategy in Gaza after ceasefire talks broke down last month",
  "content": "The meeting could result in an order for the full reoccupation of Gaza for the first time since Israel withdrew soldiers and settlers two decades ago. Such a move would be aimed at boosting Israel's security, but is fraught with humanitarian and diplomatic risks.\n\nHamas-led militants killed around 1,200 people, mostly civilians, and abducted 251 in an Oct. 7, 2023, attack that ignited the war. They still hold 50 hostages, around 20 of them believed to be alive. Israel’s retaliatory military offensive has killed more than 61,000 Palestinians, according to Gaza’s Health Ministry.\n\nIndonesia's president first announced in April a plan to temporarily house and treat wounded Palestinians, particularly women and children. The country's top clerics have criticized the plan due to a lack of guarantees that evacuated Gazans would be able to return home, something they worry could partly enable the depopulation of Gaza.\n\nWounded Palestinians would be taken to a medical facility where COVID-19 patients and Vietnamese refugees have been treated in the past. Thursday’s announcement marks the first time the location was named, but no other details were given.\n\nThe families denounced Netanyahu’s reported plan to expand military operations. Yehuda Cohen, the father of Nimrod Cohen, an Israeli soldier held hostage in Gaza, said from the boat that Netanyahu is prolonging the war to satisfy extremists in his government and to prevent it from collapsing.\n\nNasser Hospital in the southern city of Khan Younis said 12 of the fatalities were from people attempting to access aid near a distribution site run by a U.S. and Israeli-backed private contractor. At least 50 people were wounded, many from gunshots, the hospital said.\n\nIsraeli authorities returned the body of a Palestinian activist allegedly killed by an Israeli settler last week, after female Bedouin relatives launched a hunger strike to protest the authority’s decision to hold his body in custody. The hunger strike was a rare public call from Bedouin women who traditionally mourn in private.\n\nWitnesses said Awdah Al Hathaleen was shot and killed by a radical Israeli settler during a confrontation caught on video last month. Israeli authorities said they would only return the body if the family agrees to certain conditions that would “prevent public disorder.” Despite dropping some of their demands, family members said Israel set up checkpoints and prevented many mourners from outside the village from attending.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/israel-palestinians-west-bank-settlers-hunger-strike-8d39b7a7816f488e497334d1287bc51f",
    "https://apnews.com/article/indonesia-palestinians-gaza-shelter-war-34095ff70dd333ad1c328e515d9a0426",
    "https://apnews.com/article/france-israel-palestinians-gaza-hamas-emmanuel-macron-bb40a9ec020280a67c3427a17f95f0fb",
    "https://apnews.com/article/israel-palestinians-settler-violence-sanctions-awdah-f492bad84a66f72d9277dffe518e734d",
    "https://apnews.com/article/israel-palestinians-hamas-gaza-08-05-2025-a43fc7d54feea4093ad94f7eff610721",
    "https://apnews.com/article/france-israel-graffiti-el-al-antisemitism-paris-0a49c74f2953f0a62bfb627e2f2b5dfa",
    "http://www.ap.org",
    "https://apnews.com/article/israel-palestinians-hamas-war-netanyahu-gaza-occupation-baec5d80f0394fdfb12db78e24b8109f",
    "https://apnews.com/hub/benjamin-netanyahu",
    "https://apnews.com/article/palestinians-death-toll-war-health-ministry-816d592952814db869924f9626ca8876"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Reported Plan",
      "weight": 0.078198954
    },
    {
      "name": "Israeli authorities",
      "weight": 0.076759115
    },
    {
      "name": "Wounded Palestinians",
      "weight": 0.06589081
    },
    {
      "name": "wounded Palestinians",
      "weight": 0.06589081
    },
    {
      "name": "Gaza",
      "weight": 0.06574986
    },
    {
      "name": "Israeli",
      "weight": 0.06483095
    },
    {
      "name": "Israel",
      "weight": 0.064501464
    },
    {
      "name": "family members",
      "weight": 0.05819121
    },
    {
      "name": "many mourners",
      "weight": 0.057967894
    },
    {
      "name": "people",
      "weight": 0.057347197
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9951171875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.98193359375
    },
    {
      "name": "/News/World News",
      "score": 0.8935546875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.876953125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.73974609375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.309814453125
    }
  ],
  "sentiment": {
    "positive": 0.05517578,
    "negative": 0.75146484,
    "neutral": 0.19348145
  },
  "summary": "Israeli Prime Minister Benjamin Netanyahu is facing opposition to a proposed plan for the full reoccupation of Gaza for the first time since Israel withdrew soldiers and settlers two decades ago. The move is aimed at boosting Israel's security but comes with significant humanitarian and diplomatic risks. Hamas-led militants killed around 1,200 people, mostly civilians, and abducted 251 in an Oct. 7, 2023, attack. They still hold 50 hostages, around 20 of whom are believed to be alive. Indonesia's president has proposed a plan to temporarily house and treat wounded Palestinians, but critics have expressed concerns about the lack of guarantees that evacuated Gazans would be able to return home, which they fear could lead to the depopulation of Gaza. Israeli authorities have returned the body of a Palestinian activist allegedly killed by an Israeli settler last week after a hunger strike.",
  "shortSummary": "Israeli Prime Minister Benjamin Netanyahu faces opposition over a potential full Gaza reoccupation, amid concerns over human rights and the depopulation of Gaza.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a6a6c69237b7458abc0005b633b2900d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/israel-palestinians-west-bank-settlers-hunger-strike-8d39b7a7816f488e497334d1287bc51f",
      "text": "Hunger-striking women demand Israel return the body of Palestinian activist killed in settler clash\nHunger-striking women demand Israel return the body of Palestinian activist killed in settler clash\nUMM AL-KHAIR, West Bank (AP) — Nearly two dozen Bedouin women, enrobed in black, sat on the floor of a modest hut that baked under the desert sun of the Israeli-occupied West Bank. The room was quiet, the women still.\nThe women are on a hunger strike to call for Israeli authorities to release the body of a beloved community leader killed during a clash with a Jewish settler last week. They say they will continue until the man’s remains are returned for burial in his hometown of Umm al-Khair.\nWitnesses said Awdah Al Hathaleen was shot and killed by a radical Israeli settler during a confrontation caught on video. Israeli authorities said they would only return the body if the family agrees to certain conditions that would “prevent public disorder.” The villagers say those include limiting attendance for a funeral that would normally draw hundreds and burying him at night in a nearby city.\n“We want him to be buried here in Umm al-Khair and have a respectable funeral without any conditions. What did we do to deserve this treatment? We did nothing,” said his mother, Khadra Hathaleen, 65, who is among the dozens of women, aged 15-70, from the village who are on strike.\nThe hunger strike, in its sixth day Tuesday, marks a rare public protest by a group of Bedouin women accustomed to mourning in private. Their move reflects their anger over Awdah’s death as well as what they perceive as Israel’s attempt to dictate unreasonable conditions that violate their customs, beliefs, and right to the land beneath them.\nBut beyond that, they say they have been forced to speak up after repeated settler attacks and Israeli raids have targeted their husbands, sons and fathers. Adding to their outrage, the settler suspected in the shooting, Yinon Levi, was quickly released by an Israeli court from his house arrest.\nTheir story won an Oscar, but their suffering continues\nThe plight of Palestinians in this area of the West Bank, known as Masafer Yatta, was featured in “No Other Land,” an Oscar-winning documentary about settler violence and life under Israeli military rule.\nAl Hathaleen, a political activist and an English teacher, was a contributor to the film and close friend of its Palestinian co-directors.\nIt documents life in a region where Jewish residents are building new settlements and expanding old ones on hilltops ringing Palestinian villages — all while Israeli military bulldozers arrive frequently to demolish Palestinian homes they say amount to illegal construction. Palestinians say its nearly impossible to secure Israeli permits to build on their lands.\nFour Palestinians have been killed by settlers this year, according to UN data.\nWitnesses said that the confrontation that led to Al Hathaleen’s death began after settler excavators began digging on village land. Some Palestinians threw stones after one excavator injured a young man from the village, witnesses said. The Israeli military said that during the confrontation Palestinians hurled rocks at an Israeli civilian, who opened fire toward the “terrorists.”\nLevi, a well known settler who is under international sanctions for violence toward Palestinians, was briefly arrested last week. He was quickly freed from house arrest, with a judge ruling there was no proof that Levi fired the fatal bullets.\nVideo shot by a Palestinian witness showed Levi firing a gun twice and tussling with a group of unarmed Palestinians. In the footage, Levi accused the group of throwing rocks at him. It did not show where his shots landed.\nBut residents said that he fired the bullet that hit Al Hathaleen in the chest, and that no one else in the encounter was armed.\nIsraeli military and police did not respond to requests for comment on who else could have fired the fatal shot. Levi could not be reached for comment; multiple calls to his phone went unanswered.\nSince the killing, Israeli forces returned to the village and arrested 18 men. Villagers said at least one remains in jail — the hunger strikers are also demanding his release.\nA feeling of complete vulnerability\nOn Monday, a week after Al Hathaleen was killed, Levi was back within eyesight of the village, the sound of his excavators pummeling the ground audible from the hut where the hunger-striking women sat.\nTo Sara Hathaleen, it was a reminder of the village’s vulnerability.\n“They come at 2 o’clock or 3 o’clock in the morning,” said the 39-year-old, who is Al Hathaleen’s sister-in-law. “It’s like a horror, because we hear their cars and we know that they are coming for us. We don’t know who will be next, or who they will take next.”\nMost of Umm al-Khair’s residents are related — some closely, some distantly — and nearly all share the surname Hathaleen. Al Hathaleen and his wife use an alternate spelling.\nSara Hathaleen said her own husband, Aziz, was detained by Israel after the killing and released Tuesday.\n“We want to have a voice and to take part,” she said. “The men are hurt by settlers or taken by the army, put in prison, and are not available.”\nThree of the women on strike — Al Hathaleen’s mother, sister and widow — have needed medical attention, according to Sara Hathaleen.\nIsraeli military and police did not respond to requests for comment on the strike.\nDemanding to be heard\nMyassar Hathaleen, 32, sat in the fasting hut with the other women. Since she stopped eating, her breast milk has dried up and she wakes at night to her infant crying to be breastfed.\nHer brother, Hamid, was arrested the day Al Hathaleen was killed and he has not yet been released.\n“We’re striking because the world needs to wake up,” said Myassar. “We don’t want to make any problems. We just want to live in justice, and in silence.”\nHanady Al Hathaleen, 24, said that she will settle for nothing less than a proper burial for her husband in his hometown.\n“Awdah was killed here because he was resistant, in his own way,” she said. “He was killed here and he must be buried here. The land of Umm al-Khair drinks from his blood.”"
    },
    {
      "url": "https://apnews.com/article/indonesia-palestinians-gaza-shelter-war-34095ff70dd333ad1c328e515d9a0426",
      "text": "Indonesia offers to temporarily shelter wounded and orphaned Palestinians from Gaza\nIndonesia offers to temporarily shelter wounded and orphaned Palestinians from Gaza\nJAKARTA, Indonesia (AP) — Indonesian President Prabowo Subianto said Wednesday that his country will offer temporary shelter to Palestinian medical evacuees and children orphaned by the Israel-Hamas war in Gaza.\n“We are ready to evacuate those who are injured or traumatized, and orphans, if they want to be evacuated to Indonesia, and we are ready to send planes to transport them,” Subianto said, adding that he has instructed his foreign affairs minister to discuss evacuation plans with the Palestinian authorities at once.\nHe said Indonesia is ready to evacuate a first batch of around 1,000 victims, who will stay in the country until they have fully recovered from their injuries and Gaza is safe enough to return to. Subianto said the move was not for permanent resettlement.\nSubianto spoke before getting on a flight to Abu Dhabi, the first stop in a weeklong tour of the Middle East that also includes stops in Turkey, Egypt, Qatar and Jordan. He said he would consult on the planned evacuations with those countries, some of which have also accepted Palestinians for humanitarian reasons.\nHe added that other countries have called on Indonesia to increase its role in seeking a resolution to the conflict in Gaza. The world’s most populous Muslim-majority nation has long been a strong supporter of the Palestinians.\n“This is something complicated; it’s not easy, but I think it encourages the Indonesian government to play a more active role,” Subianto said."
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-08-05-2025-a43fc7d54feea4093ad94f7eff610721",
      "text": "Netanyahu hints at expanded war in Gaza but former Israeli military and spy chiefs object\nIsrael’s blockade and military offensive have made it nearly impossible to safely deliver aid, contributing to the territory’s slide toward famine nearly 22 months into the war with Hamas. (AP video by Mariam Dagga; Produced by Wafaa Shurafa)\nJERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu hinted at wider military action in devastated Gaza on Tuesday, even as former Israeli army and intelligence chiefs called for an end to the nearly 22-month war.\nThe new pressure on Netanyahu came as Gaza’s Health Ministry said the Palestinian death toll had surpassed 61,000. Health officials reported new deaths of hungry Palestinians seeking food at distribution points. As desperation mounts, the Israeli defense body coordinating aid announced a deal with local merchants to improve aid deliveries.\nAmong those speaking out were former leaders of Israel’s Shin Bet internal security service, Mossad spy agency and the military — and also ex-Prime Minister Ehud Barak. In a video posted to social media this week, they said far-right members of the government are holding Israel “hostage” in prolonging the conflict.\nNetanyahu’s objectives in Gaza are “a fantasy,” Yoram Cohen, former head of Shin Bet, said in the video.\n“If anyone imagines that we can reach every terrorist and every pit and every weapon, and in parallel bring our hostages home — I think it is impossible,” he said.\nPossible tougher military action\nNetanyahu convened his Security Cabinet to direct the military on the war’s next stage, hinting that even tougher action was possible. However, the meeting wrapped up hours later without any announcements about Israel’s plans.\nU.S. President Donald Trump, asked by a reporter whether he supported the reoccupation of Gaza, said he wasn’t aware of the “suggestion” but that “it’s going to be pretty much up to Israel.”\nNetanyahu said his objectives include defeating Hamas, releasing all 50 remaining hostages and ensuring Gaza never again threatens Israel after the Hamas-led 2023 attack sparked the war.\nIsraeli media reported disagreements between Netanyahu and the army chief, Lt. Gen. Eyal Zamir, on how to proceed. The reports, citing anonymous officials in Netanyahu’s office, said the prime minister was pushing the army, which controls about three quarters of Gaza, to conquer the entire territory — a step that could endanger hostages, deepen the humanitarian crisis and further isolate Israel internationally.\nZamir reportedly opposes this step and could step down or be pushed out if it is approved. Israeli officials did not respond to requests for comment on the reports.\nMore aid-seekers killed\nHealth officials in Gaza said Israeli forces opened fire on Tuesday morning toward Palestinians seeking aid and in targeted attacks in central and southern Gaza, killing at least 45 people.\nThere was no immediate comment from the Israeli military, which has said after previous shootings around aid distribution that it only fired warning shots at people who approached its forces.\nThe dead include at least 26 people killed in the Morag Corridor, an Israeli military zone where looters and desperate crowds unloaded U.N. aid convoys.\nSix people were killed in Teina, near a road leading to a site run by the Israeli-backed Gaza Humanitarian Foundation, an American contractor. Morgue records at the nearby Nasser Hospital, which received the bodies, detailed the deaths and locations.\nThe hospital is part of the Health Ministry, which doesn’t distinguish between militants and civilians but says roughly half the dead from the war have been women and children. The ministry operates under the Hamas government. The United Nations and other international organizations see it as the most reliable source of casualty data.\nSami Arafat, a father of seven, described the chaos in the Morag Corridor early Tuesday, saying crowds rushed toward a convoy of U.N. aid trucks and Israeli forces fired toward them.\n“There are no buildings to shelter us from the shooting,” he said. “The area is all rubble.”\nHe said looters brandishing knives climbed aboard the trucks first and tore into the aid boxes, taking sugar that could be resold at the market while leaving less expensive rice behind.\nElsewhere in central Gaza, Al-Awda hospital said it received the bodies of six Palestinians who were killed when Israeli troops targeted crowds near another GHF aid distribution site.\nThe GHF said there were no incidents at its sites Tuesday and that most of the recent violence has been linked to U.N. aid deliveries.\nSeveral hundred Palestinians have been killed by Israeli fire since May while heading toward food distribution sites, airdropped parcels and aid convoys, according to witnesses, local health officials and the U.N. human rights office. Israel’s military says it only has fired warning shots and disputes the toll.\nThe Israeli defense body in charge of coordinating aid, COGAT, said on social media there will be a “gradual and controlled renewal of the entry of goods through the private sector in Gaza.”\nIt said a limited number of local merchants were approved for the plan.\n‘Stained with humiliation and blood’\nMohammed Qassas from Khan Younis said his young children are so hungry that he is forced to storm aid trucks, which rarely reach warehouses these days because they are stopped by hungry crowds.\n“How am I supposed to feed them? No one has mercy,” he said Monday. “If we fight, we get the food. If we don’t fight, we don’t get anything.”\nIt has become routine to see men returning from aid-seeking carrying bodies as well as sacks of flour.\nIsrael’s blockade and military offensive have made it nearly impossible to safely deliver aid, contributing to the territory’s slide toward famine. Aid groups say Israel’s week-old measures to allow more aid in are far from sufficient.\nFamilies of hostages in Gaza fear starvation affects them too, and blame Hamas.\nAs international alarm has mounted, several countries have airdropped aid over Gaza. The U.N. and aid groups call such drops costly and dangerous for residents, and say they deliver far less aid than trucks.\n‘The entire world is watching’\nPalestinians gather daily for funeral prayers.\n“We are unarmed people who cannot endure this,” shouted Maryam Abu Hatab in the yard of Nasser hospital.\nEkram Nasr said her son was shot dead while seeking aid near the Morag corridor.\n“I had to go alone to carry my son,” she said, tears in her eyes. “I collected the remains of my son like the meat of dogs from the streets.”\n“The entire world is watching,” she added. “They are watching our patience, our strength and our faith in God. But we no longer have the power to endure.”\n___\nShurafa reported from Deir Al-Balah, Gaza Strip. Associated Press writer Josef Federman in Jerusalem contributed to this report."
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-netanyahu-gaza-occupation-baec5d80f0394fdfb12db78e24b8109f",
      "text": "What to know as Israel considers reoccupying Gaza in what would be a major escalation of the war\nIsraeli Prime Minister Benjamin Netanyahu hinted at wider military action in devastated Gaza on Tuesday, even as former Israeli army and intelligence chiefs called for an end to the nearly 22-month war.\nIsraeli Prime Minister Benjamin Netanyahu is considering ordering the full reoccupation of the Gaza Strip, according to Israeli media, a move that would draw fierce opposition internationally and within Israel.\nIt would mark a stunning escalation of the nearly 22-month war in the territory that has already been largely destroyed and where experts say famine is unfolding. It would put the lives of countless Palestinians and about 20 living hostages at risk, and deepen Israel’s already stark international isolation.\nIt would also face fierce opposition within Israel: Families of the hostages would consider it a virtual death sentence, and much of the security establishment is also reportedly opposed to an open-ended occupation that would bog down and further strain the army after nearly two years of regional wars.\nThe threat to reoccupy Gaza could be a negotiating tactic aimed at pressuring Hamas after talks mediated by the United States, Egypt and Qatar appeared to have broken down last month. Or it could be aimed at shoring up support from Netanyahu’s far-right coalition partners.\nHis governing allies have long called for escalating the war, taking over Gaza, relocating much of its population through what they refer to as voluntary emigration and reestablishing Jewish settlements that were dismantled when Israel withdrew in 2005.\nWhether they prevail will likely depend on the one person with leverage over Israel — U.S. President Donald Trump. Asked Tuesday whether he thought Israel should reoccupy Gaza, he said he wasn’t aware of the “suggestion” but that “it’s going to be pretty much up to Israel.”\nGround operations in the most densely populated areas\nTo take full control of Gaza, Israel would need to launch ground operations in the last areas of the territory that haven’t been flattened and where most of Gaza’s 2 million Palestinians have sought refuge.\nThat would mean going into the central city of Deir al-Balah and Muwasi, a so-called humanitarian zone where hundreds of thousands of people live in squalid tent camps along the coast. Such operations would force another wave of mass displacement and further disrupt aid deliveries as the U.N. agencies and humanitarian organizations are already struggling to avert famine.\nIsrael already controls around 75% of the territory, which has been declared a buffer zone or placed under evacuation orders. With Israel also largely sealing Gaza’s borders, it’s unclear where civilians would go.\nIt would also pose a major risk for the remaining 20 or so living hostages, likely held in tunnels or other secret locations. Hamas is believed to have ordered its guards to kill captives if Israeli forces approach.\nHamas-led militants abducted 251 hostages in the Oct. 7, 2023, attack that ignited the war and killed around 1,200 people that day, mostly civilians. They are still holding 50 hostages, less than half of them believed to be alive, and recent videos have shown emaciated captives pleading for their lives.\nIsrael’s retaliatory offensive has killed over 61,000 Palestinians, according to Gaza’s Health Ministry, which does not say how many were civilians or combatants. The ministry, which is part of the Hamas-run government and run by medical professionals, is seen by the United Nations and other experts as the most reliable source on casualties. Israel disputes its toll but has not provided its own.\nInternational outrage and further isolation\nIsrael’s wartime conduct has shocked much of the international community, and prompted even close Western allies to call for an end to the war and to take steps to recognize Palestinian statehood.\nThe International Court of Justice is considering allegations of genocide, and the International Criminal Court has issued arrest warrants for Netanyahu and his former defense minister, alleging war crimes and crimes against humanity, including the use of starvation as a method of war.\nIsrael has rejected the allegations and accused those making them of antisemitic “blood libel.” It says it has taken every effort to avoid harming civilians and blames Hamas for their deaths because the militants are deeply entrenched in heavily populated areas.\nIsrael has said it will keep fighting until all the hostages are returned, Hamas is defeated or disarmed, and Gaza’s population is given the option of “voluntary emigration,” which the Palestinians and much of the international community view as forcible expulsion.\nHamas has said it will only release the remaining hostages in return for a lasting ceasefire and an Israeli withdrawal. It says it is willing to give up power but will not lay down its arms as long as Israel occupies territories the Palestinians want for a future state.\nAnother open-ended occupation\nIsrael captured Gaza, the West Bank and east Jerusalem in the 1967 Middle East war. The United Nations, the Palestinians and others continued to view Gaza as occupied territory after the 2005 withdrawal of Israeli troops and settlers, as Israel maintained control of its airspace, coastline, most of its land border and its population registry.\nThe full reoccupation of Gaza would pose long-term challenges that Israel is well aware of given its long history of occupying Arab lands, including the likelihood of a prolonged insurgency. Israeli support for the war already appears to have declined since Netanyahu ended a ceasefire in March, as soldiers have been killed in hit-and-run attacks.\nAs an occupying power, Israel would be expected to maintain order and ensure the basic needs of the population are met. In the West Bank, it has largely outsourced that to the Palestinian Authority, which exercises limited autonomy in population centers.\nBut in Gaza, Netanyahu has ruled out any future role for the PA, accusing it of not being fully committed to peace, and has not produced any plan for Gaza’s postwar governance and reconstruction.\nLong-term repercussions\nEven if Israel succeeds in suppressing Hamas, the reoccupation of Gaza could pose an even more profound threat to the country.\nIt would leave Israel in full control of the territory between the Mediterranean Sea and the Jordan River, which is home to around 7 million Jews and 7 million Palestinians — most of the latter denied basic rights, including the vote. Even before the war, major human rights groups said the situation amounted to apartheid, something Israel vehemently denies.\nUnless large numbers of Palestinians are expelled — no longer merely a fantasy of Israel’s far-right — Israel would face an all-too-familiar existential dilemma: Create a Palestinian state in the 1967 territories and preserve Israel as a Jewish and democratic state, or rule over millions of Palestinians indefinitely and hope they never rally behind the idea of equal rights in a binational state.\nIsrael would no longer be able to point to Hamas’ rule in Gaza, or factional divisions among Palestinians, as reasons to avoid such a reckoning. And when Trump leaves office, it may find it has few friends to back it up.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/palestinians-death-toll-war-health-ministry-816d592952814db869924f9626ca8876",
      "text": "Palestinian death toll in Israel-Hamas war passes 60,000, Gaza Health Ministry says\nPalestinian death toll in Israel-Hamas war passes 60,000, Gaza Health Ministry says\nDEIR AL-BALAH, Gaza Strip (AP) — More than 60,000 Palestinians have been killed during the Israel-Hamas war, Gaza’s Health Ministry said Tuesday. Israeli strikes overnight killed more than two dozen people, mostly women and children, according to health officials.\nThe Israeli offensive, launched in response to Hamas’ attack on southern Israel on Oct. 7, 2023, has destroyed vast areas of Gaza, displaced around 90% of the population and fueled a catastrophic humanitarian crisis.\nExperts warned Tuesday that the territory of about 2 million Palestinians is on the brink of famine after Israeli restrictions and a breakdown of security have made it nearly impossible to safely deliver aid.\nThe Health Ministry, part of the Hamas-run government, said that the death toll has climbed to 60,034, with 145,870 others wounded since the war started. The victims include 18,592 children and 9,782 women. Together, they make up nearly half the dead.\nThe ministry, which doesn’t distinguish between civilians and combatants in its count, is staffed by medical professionals. The United Nations and other independent experts view its figures as the most reliable count of casualties. Israel has disputed its figures, but hasn’t provided its own account of casualties.\nDozens killed, most while seeking aid\nAirstrikes on tents housing displaced people in the built-up Nuseirat refugee camp late Monday killed 30 people, including 12 children and 14 women, according to Al-Awda Hspital.\nThere was no immediate comment from the Israeli military.\nIsrael says it only targets militants and blames civilian deaths on Hamas, saying the militants operate in populated areas. The military said that it targeted Hamas military infrastructure over the past day, including rocket launchers, weapons storage facilities and tunnels.\nHospital officials, meanwhile, said that they received the bodies of an additional 33 people who were killed by gunfire around an aid convoy in southern Gaza on Monday, bringing the toll to 58. Witnesses said that Israeli forces fired toward the crowd.\nAnother 14 Palestinians were killed on Tuesday near a site in central Gaza run by the Gaza Humanitarian Foundation, or GHF, an Israeli-backed American contractor, according to local hospitals. GHF said that there were no violent incidents near its sites on Tuesday.\nThe Israeli military said it was “not aware of casualties” as a result of Israeli gunfire near the GHF site. There was no comment from the military on the shooting near the aid convoy on Monday.\nMore than 1,000 Palestinians have been killed by Israeli fire while seeking aid since May, according to witnesses, health officials and the U.N. human rights office. Israel, which controls large areas of Gaza where aid is distributed, says that it has only fired warning shots at those who approach its forces.\nHunger crisis ‘dramatically’ worsens\nThe Integrated Food Security Phase Classification, or IPC, the foremost international authority on food crises, said that Gaza has teetered on the brink of famine for two years. But it said that recent developments, including Israeli restrictions, have “dramatically worsened” the situation.\n“The facts are in — and they are undeniable,” U.N. Secretary-General António Guterres said. “Palestinians in Gaza are enduring a humanitarian catastrophe of epic proportions … The trickle of aid must become an ocean.”\nIsraeli Foreign Minister Gideon Saar denied that Israel was deliberately starving Gaza, and said that the focus on hunger was part of a “distorted campaign of international pressure.”\n“This pressure is directly sabotaging the chances for a ceasefire and hostage deal. It is only pushing towards military escalation by hardening Hamas’s stance,” he said Tuesday.\nThe U.S. and Israel have both recalled their negotiating teams over the past week as long-running negotiations over a ceasefire and hostage release seem to have stalled.\nPalestinians swim for airdropped aid\nUnder mounting international pressure, Israel announced a series of measures over the weekend to increase the flow of aid, including expanded humanitarian corridors and international aid drops. U.N. officials say there has been little change on the ground so far, and much more is needed.\nGaza has been at risk of famine for months, experts say\n- Images of emaciated children. Reports of dozens of hunger-related deaths. Safety concerns for journalists. The international pressure led Israel to announce measures, including daily humanitarian pauses in fighting in parts of Gaza and airdrops.\n- The Integrated Food Security Phase Classification, or IPC, has only declared famine a few times. But the food crisis expert said recent developments in Gaza have “dramatically worsened” the situation, including “increasingly stringent blockades” by Israel.\n- Delivering food safely has been nearly impossible. Much of the limited aid entering is being hoarded by gangs and merchants and sold at exorbitant prices. Israel’s recent measures have yet to be felt on the ground.\nAir force cargo planes from Jordan and the United Arab Emirates have dropped aid over Gaza in recent days, and France and Germany have announced plans to join that effort.\nBut Associated Press reporters in Gaza said that much of the aid has fallen in so-called red zones that Israel has ordered people to evacuate from.\nDozens of Palestinians raced into the Mediterranean Sea on Tuesday to try and retrieve food from airdropped parcels that went off course. Some could be seen returning with soaked bags of tea and flour. One man held a can of beans.\nMomen Abu Etayya said that his son had told him to “catch the plane” when they saw it flying in the distance.\n“I came to try to get aid from the sea. I almost drowned,” he said, adding that he had only managed to get three packets of biscuits.\nU.N. agencies and aid groups have long expressed skepticism about airdrops over Gaza, saying they are far costlier and deliver much less aid than land shipments. Parcels can land on desperate crowds, causing injuries or deaths, and can also spark deadly stampedes as thousands try to reach them.\nHunger-related deaths\nThe World Health Organization says more than 60 people have died this month from malnutrition-related causes, including 24 children under age 5.\nOverall, 88 children died of causes related to malnutrition since the start of the war, while 58 adults died this month from malnutrition-related causes, according to the Gaza Health Ministry.\nDuring hunger crises, people can die from malnutrition or from common illnesses or injuries that the body isn’t strong enough to fight. The ministry doesn’t include hunger-related deaths in its overall toll.\nHamas-led militants killed about 1,200 people, mostly civilians, in the attack that sparked the war, and abducted another 251. They are still holding 50 captives, around 20 believed to be alive, after most of the rest were released in ceasefires or other deals.\nThe war took a major turn in early March when Israel imposed a complete 2½-month blockade, barring the entry of all food, medicine, fuel and other goods. Weeks later, Israel ended a ceasefire with a surprise bombardment and began seizing large areas of Gaza, measures it said were aimed at pressuring Hamas to release more hostages.\nAt least 8,867 Palestinians have been killed since then.\nIsrael eased the blockade in May, but U.N. agencies say it hasn’t allowed nearly enough aid to enter and that they have struggled to deliver it because of Israeli restrictions and the breakdown of law and order. An alternative Israeli-backed system run by GHF has been marred by violence and controversy.\n___\nSamy Magdy reported from Cairo. Associated Press writer Melanie Lidman in Tel Aviv, Israel contributed.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-settler-violence-sanctions-awdah-f492bad84a66f72d9277dffe518e734d",
      "text": "A settler accused of killing a Palestinian activist is to be freed. Israel still holds the body\nTEL AVIV, Israel (AP) — An Israeli settler accused of killing a prominent Palestinian activist during a confrontation captured on video in the occupied West Bank will be released from house arrest, an Israeli court ruled Friday.\nThe video shot by a Palestinian witness shows Yinon Levi brandishing a pistol and tussling with a group of unarmed Palestinians. He can be seen firing two shots, but the video does not show where the bullets hit.\nWitnesses said one of the shots killed Awdah Hathaleen, an English teacher and father of three, who was uninvolved and was standing nearby.\nThe Israeli military is still holding Hathaleen’s body and says it will only be returned if the family agrees to bury him in a nearby city. It said the measure was being taken to “prevent public disorder.”\nThe confrontation occurred on Monday in the village of Umm al-Khair, in an area of the West Bank featured in “No Other Land,” an Oscar-winning documentary about settler violence and life under Israeli military rule.\nIn a court decision obtained by The Associated Press, Judge Havi Toker wrote that there was “no dispute” that Levi shot his gun in the village that day, but she said he may have been acting in self-defense and that the court could not establish that the shots killed Hathaleen.\nIsrael’s military and police did not respond to a request for comment on whether anyone else may have fired shots that day. Multiple calls placed to Levi and his lawyer have not been answered.\nThe judge said Levi did not pose such a danger as to justify his continued house arrest but barred him from contact with the villagers for a month.\nLevi has been sanctioned by the United States and other Western countries over allegations of past violence toward Palestinians. President Donald Trump lifted the U.S. sanctions on Levi and other radical settlers shortly after returning to office.\nA total of 18 Palestinians from the village were arrested after the incident. Six remain in detention.\nEitay Mack, an Israeli lawyer who has lobbied for sanctions against radical settlers, including Levi, said the court ruling did not come as a surprise.\n“Automatically, Palestinian victims are considered suspects, while Jewish suspects are considered victims,” he said.\nLevi helped establish an settler outpost near Umm al-Khair that anti-settlement activists say is a bastion for violent settlers who have displaced hundreds since the start of the Israel-Hamas war. Palestinians and rights groups have long accused Israeli authorities of turning a blind eye to settler violence, which has surged since the outbreak of the Israel-Hamas war, along with attacks by Palestinians.\nIn a 2024 interview, Levi said he was protecting his own land and denied using violence.\nSome 70 women in Umm al-Khair said they were beginning a hunger strike on Friday to call for Hathaleen’s body to be returned and for the right of his family to bury him in the village.\nIsrael’s military said in a statement to the AP that it would return the body if the family agrees to bury him in the “nearest authorized cemetery.”\nHathaleen, 31, had written and spoke out against settler violence, and had helped produce the Oscar-winning film. Supporters have erected murals in his honor in Rome, held vigils in New York and have held signs bearing his name at anti-war protests in Tel Aviv."
    },
    {
      "url": "https://apnews.com/article/france-israel-graffiti-el-al-antisemitism-paris-0a49c74f2953f0a62bfb627e2f2b5dfa",
      "text": "The Paris office of Israeli airline El Al is vandalized with graffiti\nThe Paris office of Israeli airline El Al is vandalized with graffiti\nPARIS (AP) — Israeli airline El Al said Thursday that its Paris office was vandalized with anti-Israel graffiti, calling the act a “deeply disturbing” incident as tensions between France and Israel run high.\nThe graffiti was discovered Thursday morning. El Al said the offices were unoccupied at the time of the incident and no one was harmed. Photos shared on social media showed red spray paint across the glass doors and walls, including the phrase “El Al genocide airline.”\nThe airline said it was handling the matter with the “utmost gravity” and working “in close coordination” with authorities in France and Israel.” El Al added it “unequivocally condemns all forms of violence, particularly those driven by hatred,” and said its planes “proudly” display the Israeli flag.\nIsraeli Transportation Minister Miri Regev condemned the act and blamed the policies of French President Emmanuel Macron. “Today it’s El Al, tomorrow it’s Air France,” she wrote on social media. “When President Macron makes announcements that give gifts to Hamas, this is the result.”\nThe incident comes amid diplomatic friction following Macron’s pledge last month to recognize a Palestinian state — a move welcomed by some European allies but strongly opposed by Israel.\nIsrael’s Foreign Ministry also condemned what it called an antisemitic attack and urged the French government to ensure the safety of El Al staff and offices and to bring the perpetrators to justice.\nIn May, several Jewish sites across Paris were defaced with green paint, including the Shoah Memorial, three synagogues and a Jewish restaurant.\nFrance is home to Western Europe’s largest Jewish population, with an estimated 500,000 Jews — approximately 1% of the national population.\nIn recent years, antisemitic incidents have surged, with a sharp increase reported in 2023 after the Oct.7 Hamas attacks in Israel. These include physical assaults, threats, vandalism, and harassment, prompting alarm among Jewish communities and leaders."
    },
    {
      "url": "https://apnews.com/article/france-israel-palestinians-gaza-hamas-emmanuel-macron-bb40a9ec020280a67c3427a17f95f0fb",
      "text": "How France’s recognition of the state of Palestine could shift Middle East dynamics\nPARIS (AP) — France’s bold decision to recognize the state of Palestine could help to shift conversations about the future of the Middle East, even if it’s unlikely to have an immediate impact for people in Gaza or on Israel’s war with Hamas.\nIn a world where nations are again using military force to impose their will on others — notably Russia in Ukraine, and the U.S. and Israel with their recent strikes on Iran and its nuclear facilities — French President Emmanuel Macron is attempting to strike a blow for diplomacy and the idea that war rarely brings peace.\nWith less than two years left of his second and last term as president, Macron also has his legacy to think about. Not acting decisively as a humanitarian disaster unfolds in Gaza could be a stain when history books are written.\nMacron has levers to influence world affairs as leader of a nuclear-armed, economically and diplomatically powerful country that also sits at the big table at the United Nations, as one of the five permanent members of its security council.\nBeing the first member of the G7 group of industrialized nations to take this leap carries domestic risks. Presiding over a country with both Europe’s largest Jewish population and largest Muslim population, Macron is on a public opinion tightrope. His words will please some voters but infuriate others — a fact reflected by deeply divided political reactions in France to his decision announced on X on Thursday evening.\nBut after staunchly backing Israel’s right to defend itself against Hamas and its Oct. 7, 2023, attack that triggered the war, Macron is signaling that France’s support can only go so far.\nIsraeli Prime Minister Benjamin Netanyahu denounced the shift by one of his country’s closer allies in Europe. “Such a move rewards terror and risks creating another Iranian proxy, just as Gaza became,” he said in a statement. “A Palestinian state in these conditions would be a launch pad to annihilate Israel — not to live in peace beside it.’’\nA step but not a magic wand\nThe idea that Palestinians and Israelis could live side by side in peace in their own states has perhaps never looked more unrealistic — with Gaza in ruins and the occupied West Bank facing increasing settlement by Israelis. Macron’s words alone won’t change that. Still, the French leader’s message is that the hope of a “two-state solution” achieved through diplomacy must not be allowed to die — however unattainable it may seem.\n“This solution is the only path that can address the legitimate aspirations of both the Israelis and the Palestinians. It must now be brought about as quickly as possible,” Macron said in a letter to Palestinian President Mahmoud Abbas which confirmed his decision to recognize Palestine as a state.\n“The prospect of a negotiated solution to the conflict in the Middle East seems increasingly distant. I cannot resign myself to that,” he said.\nThe first impacts are likeliest not in Gaza but in world capitals where leaders may face pressure or feel emboldened to follow France’s lead. Attention is focusing on other G7 nations, because of their economic and diplomatic sway.\n“Macron’s declaration could create a precedent because it would be the first Western country in the G7 to do so, which could have the effect of leading others,” said David Rigoulet-Roze, a researcher at the French Institute of Strategic Analysis.\nAlthough more than 140 countries recognize Palestine as a state, France will be the biggest, most populous and most powerful among those in Europe that have taken this step.\n“It creates some small momentum,” said Yossi Mekelberg, a senior consulting fellow at the Chatham House think tank in London who also added, however, that “this is not enough.”\n“France should be congratulated, and Macron should be congratulated for doing that and showing the courage,” he said.\nA shift in the balance of big powers\nUntil now, China and Russia were the only permanent members of the U.N. Security Council that recognized Palestinian statehood. France will join them when Macron makes good on his promise in September at the U.N. General Assembly. The new trio will leave the U.S. and the U.K. in a security council minority as its only permanent members that don’t recognize Palestine as a state.\nThe so-called P5 nations are divided on many other issues — including Ukraine, trade and climate change — so France’s shift isn’t, in itself, likely to spur radical and rapid change for Palestinians. Still, if only mathematically, the U.S. — Israel’s most important ally — and the U.K could find themselves more isolated among the big powers in any discussions on solutions for the Middle East.\nU.S. President Donald Trump dismissed Macron’s decision on Friday, saying “What he says doesn’t matter. It’s not going to change anything.”\nFrance may have better traction with the U.K. Putting Brexit behind them, the U.K. and France are now drawing closer, most notably in support for Ukraine. If British Prime Minister Keir Starmer follows Macron’s example, Trump could become the odd man out on Palestinian statehood among the security council’s big five powers.\nStarmer has signaled growing disquiet over the humanitarian crisis in Gaza, saying in a statement Thursday that suffering and starvation there “is unspeakable and indefensible.” But he doesn’t seem ready to take a leap like Macron, suggesting that fighting must stop first.\n“Statehood is the inalienable right of the Palestinian people,” Starmer said. “A ceasefire will put us on a path to the recognition of a Palestinian state and a two-state solution.”\n—-\nAP writers Jill Lawless in London, and Michelle Price in Washington, contributed."
    }
  ],
  "argos_summary": "Israeli Prime Minister Benjamin Netanyahu is considering a full reoccupation of Gaza, a move that would escalate the ongoing conflict and pose significant humanitarian risks, as the Palestinian death toll has surpassed 61,000 since the war began. Amidst this, Indonesia has offered to temporarily shelter wounded Palestinians and orphans, while families of hostages express concerns that such military actions could endanger their loved ones. Additionally, a hunger strike by Bedouin women in the West Bank highlights the ongoing tensions and demands for justice following the killing of a Palestinian activist by an Israeli settler.",
  "argos_id": "L6IXO9Q3J"
}