{
  "url": "https://finance.yahoo.com/news/us-startup-lyten-buy-troubled-140352718.html",
  "authorsByline": "Marie Mannes",
  "articleId": "ff77a4aa2229491aac8a86c9e5f44a87",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/reuters-finance.com/c08ab542de7f7061f69caced13a4f23f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T14:03:52+00:00",
  "addDate": "2025-08-07T14:13:28.428298+00:00",
  "refreshDate": "2025-08-07T14:13:28.428301+00:00",
  "score": 1.0,
  "title": "US startup Lyten to buy troubled European battery maker Northvolt",
  "description": "STOCKHOLM (Reuters) -U.S. battery startup Lyten has agreed to buy most of bankrupt Swedish battery maker Northvolt, it said on Thursday, potentially offering a way back for the European company that was once seen as the region's answer to rivals in Asia.  Lyten, a Silicon Valley battery startup developing lithium-sulphur cells as a cleaner alternative to lithium-ion, is backed by Jeep-owner Stellantis and U.S. delivery services provider FedEx.  The deal revives hopes for European battery independence after Northvolt - the continent's potential rival to major Chinese electric vehicle battery makers - filed for bankruptcy in March, making it one of Sweden's largest corporate failures, with a frantic push to find a buyer.",
  "content": "STOCKHOLM (Reuters) -U.S. battery startup Lyten has agreed to buy most of bankrupt Swedish battery maker Northvolt, it said on Thursday, potentially offering a way back for the European company that was once seen as the region's answer to rivals in Asia.\n\nLyten, a Silicon Valley battery startup developing lithium-sulphur cells as a cleaner alternative to lithium-ion, is backed by Jeep-owner Stellantis and U.S. delivery services provider FedEx.\n\nThe deal revives hopes for European battery independence after Northvolt - the continent's potential rival to major Chinese electric vehicle battery makers - filed for bankruptcy in March, making it one of Sweden's largest corporate failures, with a frantic push to find a buyer.\n\n\"Our plans are... in large part to pick up where the Northvolt team left off,\" Lyten CEO Dan Cook told Reuters, declining to disclose the purchase price beyond saying it was at a \"substantial discount\" to the original asset value.\n\nNorthvolt has received much criticism that the company overpromised while failing to deliver battery cells deemed good enough quality for clients, even with help from its biggest customer, truckmaker Scania.\n\nLyten hopes to restart the flagship Skelleftea plant in northern Sweden and resume deliveries of lithium-ion battery cells in 2026. It acquired Northvolt's energy storage business in Poland in July, Europe's largest, and is targeting automotive, defence and energy storage markets.\n\nCook said several of Northvolt's former management would be joining Lyten, though not founder and ex-CEO Peter Carlsson.\n\n\"We are focused on developing to be the leaders in locally sourced, locally manufactured batteries for both the North American and European markets right now,\" he said.\n\nLyten said in July that it had secured over $200 million in additional equity investment to support its acquisitions and expansion plans.\n\nCook said Lyten would prove its worth to Northvolt's former customers by focusing first on providing high yields to a single customer. Northvolt's order book once totaled over $50 billion from automakers such as BMW, Volkswagen and Audi.\n\n\"We actually think they'll come back, perhaps quicker than people believe,\" said Cook, Leyton's co-founder.\n\nThe deal includes Northvolt's projects in Sweden and Germany, as well as its intellectual property. Work was also underway to acquire its Canadian unit.\n\nBefore its collapse, Northvolt expanded across the Atlantic but later refocused on Sweden as its financial crisis deepened, selling assets for nominal sums.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "troubled European battery maker Northvolt",
      "weight": 0.11283937
    },
    {
      "name": "bankrupt Swedish battery maker Northvolt",
      "weight": 0.106983945
    },
    {
      "name": "-U.S. battery startup Lyten",
      "weight": 0.09992499
    },
    {
      "name": "Northvolt",
      "weight": 0.09376507
    },
    {
      "name": "European battery independence",
      "weight": 0.09338446
    },
    {
      "name": "battery cells",
      "weight": 0.09105695
    },
    {
      "name": "major Chinese electric vehicle battery makers",
      "weight": 0.08357127
    },
    {
      "name": "Lyten CEO Dan Cook",
      "weight": 0.0820251
    },
    {
      "name": "US startup Lyten",
      "weight": 0.07988288
    },
    {
      "name": "Lyten",
      "weight": 0.07364014
    }
  ],
  "topics": [
    {
      "name": "Startups"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.986328125
    },
    {
      "name": "/News/Technology News",
      "score": 0.876953125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.72998046875
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.6025390625
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.5869140625
    },
    {
      "name": "/Computers & Electronics/Electronics & Electrical/Power Supplies",
      "score": 0.546875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.529296875
    },
    {
      "name": "/Autos & Vehicles/Vehicle Parts & Services/Vehicle Parts & Accessories",
      "score": 0.340087890625
    }
  ],
  "sentiment": {
    "positive": 0.30688477,
    "negative": 0.22375488,
    "neutral": 0.46875
  },
  "summary": "U.S. battery startup Lyten has agreed to buy most of bankrupt Swedish battery maker Northvolt, potentially offering a way back for the company. Lyten, which is developing lithium-sulphur cells as a cleaner alternative to lithium-ion, is backed by Jeep-owner Stellantis and FedEx. The deal revives hopes for European battery independence after Northvolt filed for bankruptcy in March. Lyton CEO Dan Cook stated that the purchase price was at a substantial discount to the original asset value. The company plans to restart its flagship Skelleftea plant in northern Sweden and resume lithium-ionic battery deliveries in 2026.",
  "shortSummary": "US battery startup Lyten has acquired most of bankrupt Swedish battery maker Northvolt, aiming to revive the company's fortunes and compete in emerging markets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1fe0ccb8d48a4524ad68e8a7abb45cda",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "U.S. battery startup Lyten has agreed to acquire most of the bankrupt Swedish battery maker Northvolt, aiming to revive the company's operations and contribute to European battery independence. Lyten, which specializes in lithium-sulphur cells, plans to restart Northvolt's Skelleftea plant and resume lithium-ion battery cell deliveries by 2026. The acquisition includes Northvolt's projects in Sweden and Germany, as well as its intellectual property, with several former Northvolt management members joining Lyten.",
  "argos_id": "M0N21CBSY"
}