{
  "url": "https://www.zerohedge.com/crypto/trump-allow-crypto-401k-retirement-plans-us-workers-white-house",
  "authorsByline": "Tyler Durden",
  "articleId": "dcb344c014f24b6c94a1cfd19aa0f8d1",
  "source": {
    "domain": "zerohedge.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-08/0197a559-b05b-7a6a-a1a5-78a164ec%20%281%29.jpg?itok=7NKVRuVj",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T09:05:00-04:00",
  "addDate": "2025-08-07T13:20:10.314325+00:00",
  "refreshDate": "2025-08-07T13:20:10.314327+00:00",
  "score": 1.0,
  "title": "Trump To Allow Crypto In 401k Retirement Plans For US Workers; White House",
  "description": "Trump To Allow Crypto In 401k Retirement Plans For US Workers; White House",
  "content": "US President Donald Trump will sign an executive order that could open the door for cryptocurrencies to be included in 401(k) retirement plans, potentially reshaping how Americans invest their savings.\n\nThe White House Press Office confirmed to Cointelegraph on Thursday that the order directs the US Labor Department to reevaluate restrictions around alternative assets in defined-contribution plans, including digital assets, private equity and real estate.\n\nA senior White House official said the order instructs the Secretary of Labor to clarify the department’s stance on alternative assets and provide guidance on fiduciary processes for offering these types of investments in retirement portfolios.\n\nTrump will allow crypto exposure for $12.5 trillion 401(k) market\n\nOnce implemented, Cointelegraph's Ezra Reguerra reports that the order could grant Americans access to digital assets through their 401(k) plans — part of a $12.5 trillion retirement market and a sought-after opportunity for crypto firms aiming to reach more retail investors.\n\nThe move would be a significant step forward for the crypto industry, which has long sought broader retail exposure and financial system legitimacy.\n\nDespite institutional investors increasing crypto allocations, everyday savers have been restricted due to fiduciary risk, regulatory uncertainty and volatility concerns.\n\nThe White House official said that Trump’s directive would call for inter-agency coordination with the US Treasury and the Securities and Exchange Commission (SEC) to explore rule changes that may support the adoption of alternative investments like crypto in retirement products.\n\nBitcoin is rallying this morning on the report...\n\nAnd yesterday saw a reversal of the recent outflows from ETFs...\n\nTrump has final say on the executive order\n\nOn July 18, the Financial Times cited anonymous sources saying that the president is eyeing alternative investments like crypto assets for American 401(k) retirement plans.\n\nIn a previous statement to Cointelegraph, White House spokesman Kush Desai said that nothing should be deemed official unless it comes from Trump himself.\n\nDesai said Trump is committed to restoring prosperity to everyday Americans and safeguarding their economic future. “No decisions should be deemed official, however, unless they come from President Trump himself,” Desai said.\n\nDuring a Bloomberg interview, US SEC Chair Paul Atkins said education on the risks associated with crypto as an investment is crucial.\n\nAtkins said disclosure is key and that people should be made aware of what they are getting into. He added that he’s looking forward to what the president will do.\n\nEarlier this year, the Labor Department rescinded an earlier guidance for crypto in 401(k) plans. On May 28, the Labor Department revoked a 2022 guidance that urged fiduciaries to be “extremely cautious” when eyeing crypto for 401(k) retirement plans.",
  "medium": "Article",
  "links": [
    "https://cointelegraph.com/news/labor-department-rescinds-biden-guidance-crypto-401k-plans",
    "https://cointelegraph.com/news/donald-trump-executive-order-401k-crypto-investments",
    "https://www.zerohedge.com/s3/files/inline-images/bfmF634_1.jpg?itok=TrSvp9ES",
    "https://www.ft.com/content/07906211-5ab8-4917-bcad-5397c0bc3170",
    "https://cointelegraph.com/news/trump-crypto-401k-executive-order",
    "https://cointelegraph.com/news/sec-chairman-education-401k-crypto-adoption",
    "https://www.zerohedge.com/s3/files/inline-images/0197a559-b05b-7a6a-a1a5-78a164ec%20%281%29.jpg?itok=QvVVHG_v",
    "https://www.zerohedge.com/s3/files/inline-images/bfmAD91.jpg?itok=eaKFI9HV"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "crypto exposure",
      "weight": 0.08875566
    },
    {
      "name": "US President Donald Trump",
      "weight": 0.08448705
    },
    {
      "name": "crypto allocations",
      "weight": 0.08410183
    },
    {
      "name": "crypto firms",
      "weight": 0.084045514
    },
    {
      "name": "Crypto",
      "weight": 0.08263787
    },
    {
      "name": "crypto",
      "weight": 0.08263787
    },
    {
      "name": "alternative assets",
      "weight": 0.08246146
    },
    {
      "name": "401k Retirement Plans",
      "weight": 0.0813206
    },
    {
      "name": "White House",
      "weight": 0.08129895
    },
    {
      "name": "White House spokesman Kush Desai",
      "weight": 0.07919221
    }
  ],
  "topics": [
    {
      "name": "Cryptocurrency"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.85888671875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.7578125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.60009765625
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.3935546875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.36474609375
    }
  ],
  "sentiment": {
    "positive": 0.14807129,
    "negative": 0.33251953,
    "neutral": 0.51953125
  },
  "summary": "US President Donald Trump is set to sign an executive order allowing cryptocurrencies to be included in 401(k) retirement plans, potentially reshaping how Americans invest their savings. The order instructs the US Labor Department to review restrictions around alternative assets in defined-contribution plans, including digital assets, private equity, and real estate. Once implemented, this could grant Americans access to digital assets through their 401 (k) plans, a significant step forward for the crypto industry. The White House will coordinate with the US Treasury and the Securities and Exchange Commission (SEC) to explore rule changes that may support the adoption of alternative investments like crypto in retirement products.",
  "shortSummary": "President Donald Trump will sign an executive order allowing cryptocurrencies to be included in 401(k retirement plans, potentially transforming how Americans invest.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "074021d4503448c1a0ae10ddc2c108e1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://cointelegraph.com/news/trump-crypto-401k-executive-order",
      "text": "US President Donald Trump will sign an executive order opening the door for cryptocurrencies to be included in 401(k) retirement plans, potentially reshaping how Americans invest their savings.\nThe White House Press Office confirmed to Cointelegraph on Thursday that the order directs the US Labor Department to reevaluate restrictions around alternative assets in defined-contribution plans, including digital assets, private equity and real estate.\nA senior White House official said the order instructs the labor secretary to clarify the department’s stance on alternative assets and provide guidance on fiduciary processes for offering these types of investments in retirement portfolios.\nTrump will allow crypto exposure for $12.5 trillion 401(k) market\nOnce implemented, the order will grant Americans access to digital assets through their 401(k) plans, part of a $12.5 trillion retirement market and a sought-after opportunity for crypto firms aiming to reach more retail investors.\nThe move would be a significant step forward for the crypto industry, which has long sought broader retail exposure and financial system legitimacy.\nDespite institutional investors increasing crypto allocations, everyday savers have been restricted due to fiduciary risk, regulatory uncertainty and volatility concerns.\nThe White House official said that Trump’s directive would call for inter-agency coordination with the Treasury and the Securities and Exchange Commission (SEC) to explore rule changes that may support the adoption of alternative investments like crypto in retirement products.\nRelated: ARK Invest adds $20M in BitMine, trims Coinbase, Block, Robinhood holdings\nTrump seeking retirement plan reform\nOn July 18, the Financial Times cited anonymous sources saying that the president was eyeing alternative investments like crypto assets for 401(k) retirement plans.\nIn a previous statement to Cointelegraph, White House spokesman Kush Desai said that nothing should be deemed official unless it comes from Trump.\nDesai said Trump is committed to restoring prosperity to everyday Americans and safeguarding their economic future. “No decisions should be deemed official, however, unless they come from President Trump himself,” Desai said.\nDuring a Bloomberg interview, SEC Chair Paul Atkins said education on the risks associated with crypto as an investment was crucial.\nAtkins said disclosure was key and that people should be made aware of what they are getting into. He added that he’s looking forward to what the president will do.\nEarlier this year, the Labor Department rescinded an earlier guidance for crypto in 401(k) plans. On May 28, the Labor Department revoked a 2022 guidance that urged fiduciaries to be “extremely cautious” when considering crypto for 401(k) retirement plans.\nMagazine: China mocks US crypto policies, Telegram’s new dark markets: Asia Express"
    },
    {
      "url": "https://cointelegraph.com/news/sec-chairman-education-401k-crypto-adoption",
      "text": "US Securities and Exchange Commission (SEC) Chair Paul Atkins showed openness to allowing cryptocurrencies in 401 (k) retirement plans for Americans, but highlighted the need for responsible disclosure.\nDuring a Bloomberg interview published Friday, Atkins did not rule out allowing cryptocurrencies into 401 (k) plans. Still, he emphasized that education on the risks associated with such an investment is crucial.\n“Disclosure is key and that people need to know what they are getting into,” Atkins said when asked about the potential inclusion of crypto into 401 (k) plans. Still, he added that he looks “forward to whatever may come out from the president.”\nUS President Donald Trump is reportedly set to sign an executive order that could allow 401(k) retirement plans to invest in assets other than stocks and bonds, such as cryptocurrencies. In April, Alabama Senator Tommy Tuberville said he would reintroduce a bill he sponsored in May 2022 that would scale back regulations on the types of investments used in 401(k) retirement plan fiduciaries.\nA 401(k) is a US employer-sponsored retirement plan that allows workers to defer part of their salary into tax-advantaged investment accounts, often with employer matching contributions.\nRelated: Bitcoin ETFs for retirement planning: A beginner’s guide\nExpectations of crypto in 401 (k) plans\nAlso in April, Fidelity, a financial services company with $5.9 trillion in assets under management, introduced retirement accounts that will allow Americans to invest in crypto nearly fee-free. The three new accounts are a tax-deferred traditional IRA and two Roth IRAs (one of which is a rollover) that will enable the inclusion of Bitcoin (BTC), Ether (ETH), and Litecoin (LTC).\nRelated: Is Bitcoin a good investment for retirement?\nAt the end of May, the US Labor Department rescinded guidance issued during the administration of former President Joe Biden administration that limited the inclusion of cryptocurrency in 401(k) retirement plans.\n“We’re rolling back this overreach and making it clear that investment decisions should be made by fiduciaries, not D.C. bureaucrats,” US Secretary of Labor Lori Chavez-DeRemer said at the time.\nMagazine: Older investors are risking everything for a crypto-funded retirement"
    },
    {
      "url": "https://cointelegraph.com/news/donald-trump-executive-order-401k-crypto-investments",
      "text": "US President Donald Trump is reportedly set to sign an executive order that could allow American 401(k) retirement plans to invest in alternative assets outside of stocks and bonds, such as cryptocurrencies.\nThe executive order could be signed sometime this week, the Financial Times reported on Thursday, citing three people who have been briefed on the plans.\nThe new 401(k) investment options could run across a broad spectrum of assets, including digital assets, metals and funds focused on infrastructure deals, corporate takeovers and private loans.\nThe executive order would instruct Washington regulatory agencies to investigate the best path forward for 401(k) plans to start investing in crypto, and investigate any remaining obstacles to making it a reality, according to the Financial Times.\nTrump has the final say on whether it’s official\nHowever, in a statement to Cointelegraph, White House spokesman Kush Desai said nothing should be deemed as official unless it comes from Trump himself.\n“President Trump is committed to restoring prosperity for everyday Americans and safeguarding their economic future,” he said.\n“No decisions should be deemed official, however, unless they come from President Trump himself.”\nIn May, the US Labor Department rescinded guidance issued during the Biden administration that limited the inclusion of cryptocurrency in 401(k) retirement plans.\nMeanwhile, in April, Cointelegraph reported that financial services company Fidelity, which has $5.9 trillion in assets under management, introduced a new retirement account allowing Americans to invest in crypto.\nStandard 401(k) focuses on stocks and bonds\nA 401(k) is a retirement savings plan offered by many US employers that allows employees to save and invest a portion of their paycheck in the funds before taxes are taken out.\nTypically, investments focus on mutual funds, exchange-traded funds, stocks and bonds, depending on the plan. The 401(k) market held $8.9 trillion in assets as of Sept. 30, 2024, in more than 715,000 plans.\nRelated: 20% of Gen Z, Alpha sees crypto as retirement alternative: Report\nAt a state level, in March, North Carolina lawmakers already introduced bills in the House and Senate that could see the state’s treasurer allocate up to 5% of various state retirement funds into crypto like Bitcoin (BTC).\nOther countries are looking at crypto in retirement plans\nIn November last year, the United Kingdom-based pension specialist Cartwright reported that an “unnamed scheme” had made a 3% allocation of Bitcoin into its pension fund.\nMeanwhile, Japan’s Government Pension Investment Fund was also considering Bitcoin as a potential diversification tool in March last year.\nMagazine: Older investors are risking everything for a crypto-funded retirement"
    },
    {
      "url": "https://cointelegraph.com/news/labor-department-rescinds-biden-guidance-crypto-401k-plans",
      "text": "The US Labor Department has officially rescinded guidance issued during the Biden administration that limited the inclusion of cryptocurrency in 401(k) retirement plans.\nOn May 28, the Labor Department revoked a 2022 guidance that had urged fiduciaries to be “extremely cautious” when considering cryptocurrency for 401(k) retirement plans. The move could give asset managers more flexibility to include digital assets in retirement investment options.\nThe government agency removed the guidance asserting that it represented a departure from the department’s “historically neutral, principled-based approach to fiduciary investment decisions.”\n“We’re rolling back this overreach and making it clear that investment decisions should be made by fiduciaries, not D.C. bureaucrats,” said US Secretary of Labor Lori Chavez-DeRemer.\nThe Labor Department under Biden criticized the practice of marketing cryptocurrencies to 401(k) participants. At the time, the agency claimed cryptocurrencies posed “significant risks and challenges” to participants’ retirement accounts due to their “speculative and volatile” nature and “valuation concerns,” among other reasons.\nThe American Banking Association (ABA) criticized the 2022 compliance release, claiming that it did not make the guidance available for public comment and review prior to issuance.\nRelated: Fidelity introduces retirement accounts with minimal-fee crypto investing\nTrump administration shifts crypto landscape\nPresident Trump has pledged to make the United States “the world capital of crypto” during his 2024 campaign.\nUnder his administration, the Securities and Exchange Commission has scaled back several enforcement actions and investigations involving Web3 companies such as Uniswap, Coinbase, and Kraken, while also engaging in policy discussions on topics like real-world asset tokenization and the regulatory status of certain tokens.\nAt the same time, some lawmakers have expressed concerns about Trump’s involvement in the crypto space, including calls for greater scrutiny of his associated ventures.\nMagazine: Trump’s crypto ventures raise conflict of interest, insider trading questions"
    }
  ],
  "argos_summary": "US President Donald Trump is set to sign an executive order that may allow cryptocurrencies to be included in 401(k) retirement plans, potentially transforming how Americans invest their savings. The order directs the US Labor Department to reassess restrictions on alternative assets, including digital assets, and aims to provide guidance on fiduciary processes for these investments. This move could open up a $12.5 trillion market to cryptocurrencies, addressing the long-standing demand for broader retail exposure in the crypto industry.",
  "argos_id": "M3UL3V960"
}