{
  "url": "https://www.benzinga.com/pressreleases/25/08/g46958904/one-stop-systems-reports-q2-2025-results",
  "authorsByline": "Globe Newswire",
  "articleId": "2dd5233b6ed140ad80b17271a937fc11",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T08:00:50-04:00",
  "addDate": "2025-08-07T12:13:53.306132+00:00",
  "refreshDate": "2025-08-07T12:13:53.306134+00:00",
  "score": 1.0,
  "title": "One Stop Systems Reports Q2 2025 Results - One Stop Systems (NASDAQ:OSS)",
  "description": "Second quarter of 2025 consolidated gross margin increased over 600 basis points year-over-year to 31.3%, on consolidated revenue of $14.1 million OSS segment gross margin of 41.3%, on OSS segment revenue of $5.8",
  "content": "Second quarter of 2025 consolidated gross margin increased over 600 basis points year-over-year to 31.3%, on consolidated revenue of $14.1 million\n\nOSS segment gross margin of 41.3%, on OSS segment revenue of $5.8 million\n\nYear-to-date OSS segment bookings of $25.4 million, supports outlook for accelerating revenue growth and improving profitability for the second half of 2025\n\nESCONDIDO, Calif., Aug. 07, 2025 (GLOBE NEWSWIRE) -- One Stop Systems, Inc. (\"OSS\" or the \"Company\") OSS, a leader in rugged Enterprise Class compute for artificial intelligence (AI), machine learning (ML), autonomy and sensor processing at the edge, reported results for the second quarter ended June 30, 2025. Second-quarter and six-month comparisons are to the same year-ago periods unless otherwise noted.\n\n\"The performance of our OSS segment in the first half of the year demonstrates the meaningful progress we have made repositioning the Company for sustained growth,\" stated OSS President and CEO, Mike Knowles. \"We are successfully converting our large, multi-year pipeline into orders, while making strategic investments in R&D. Year-to-date, our OSS segment has generated one of the highest levels of bookings in our history, totaling $25.4 million and representing a book-to-bill ratio of 2.3x. This strong start to 2025 underscores the solid foundation we have built as we capitalize on increasing demand from both defense and commercial customers for our rugged, enterprise-class compute solutions.\"\n\n\"Recent sales and gross margin trends give us growing confidence that our strategy is working and that positive momentum is building. We believe the second half of the year will mark a meaningful inflection point for OSS, with accelerating revenue growth and improving profitability as our business scales to meet rising market demand,\" concluded Mr. Knowles.\n\nConsolidated revenue increased 6.9% to $14.1 million, from $13.2 million in the second quarter of 2024.\n\nOSS segment revenue increased 4.3%, as compared to the same period in 2024. The increase was primarily due to higher revenues related to the development and production of custom server products for a defense customer, higher shipments of data storage products to a U.S. government customer, and the initiation of shipments of server products to a medical device customer.\n\nBressner segment revenue increased 8.7%, as compared to the same period in 2024.\n\nThe following table sets forth net revenue by segment for the three months ended June 30, 2025, and June 30, 2024 (Dollars may not calculate due to rounding):\n\nConsolidated gross margin was 31.3% for the three months ended June 30, 2025, compared to 25.2% in the prior year quarter. On a segment basis, the OSS segment had a gross margin of 41.3%, an increase of 16.4 percentage points as compared to the prior year of 24.9%. The increase in OSS segment gross margin was due to a more profitable mix of products shipped in the quarter, as well as the non-recurrence of an inventory charge recognized in the prior year quarter. The Company's Bressner segment had a gross margin percentage of 24.3%, compared to 25.5% in the same period last year, primarily due to the impact of foreign exchange rates.\n\nTotal operating expenses increased 11.6% to $6.2 million. This increase was predominantly attributable to higher marketing and selling costs due to an increase in personnel costs from the additions in headcount made during 2024 as well as an increase in research and development costs driven by higher engineering labor to support new product development.\n\nThe Company reported a net loss of $2.0 million, or $(0.09) per share for the three months ended June 30, 2025, as compared to a net loss of $2.3 million, or $(0.11) per share, in the prior year period. The Company reported a non-GAAP net loss of $1.5 million, or $(0.07) per share, compared to non-GAAP net loss of $1.8 million, or $(0.09) per share.\n\nAdjusted EBITDA, a non-GAAP metric, was a loss of $1.0 million for the three months ended June 30, 2025, compared to adjusted EBITDA loss of $1.4 million in the prior year period.\n\nAs of June 30, 2025, the Company reported cash and short-term investments of $9.5 million and total working capital of $23.1 million, compared to cash and short-term investments of $10.0 million and total working capital of $24.0 million at December 31, 2024.\n\nConsolidated revenue was $26.4 million, compared to $25.9 million for the same period last year. The Company's OSS segment saw a decrease in revenue of $88,000, or 0.8%. This decrease was primarily driven by lower volume of revenue to a commercial aerospace customer, partially offset by higher volume of revenue to a defense customer and a medical device customer. Bressner experienced an increase in revenue of $603,000, or 4.1%, as compared to the same period in 2024, due to higher book-and-ship revenue in the period, as well as the impact of foreign exchange rates.\n\n\n\nThe following table sets forth net revenue by product category for the six months ended June 30, 2025, and June 30, 2024, by segment:\n\nConsolidated gross margin was 31.9%, as compared to 27.3% in the same year-ago quarter. OSS segment gross margin was 43.3%, an increase of 13.7 percentage points from the same period a year ago. Bressner segment gross margin was 23.8%, as compared to 25.6% in the same period in 2024.\n\nTotal operating expenses increased 15.2% to $12.2 million. This increase was predominantly attributable to higher personnel costs, impact of foreign exchange rates, and higher research and development expenses due to higher engineering costs to support targeted investments in new product development.\n\nOSS reported a net loss of $4.0 million, or $(0.19) per share, as compared to a net loss of $3.7 million, or $(0.18) per share, in the prior year. The Company reported a non-GAAP net loss of $2.9 million, or $(0.14) per share, compared to non-GAAP net loss of $2.7 million, or $(0.13) per share.\n\nAdjusted EBITDA, a non-GAAP metric, was a loss of $2.2 million, a decrease from an adjusted EBITDA loss of $1.9 million in the prior year.\n\nThe Company is executing a strategic plan targeting both commercial and defense markets within its OSS segment, aiming to provide integrated solutions and establish OSS as a platform incumbent on large, multi-year programs. This approach is expected to drive long-term value by increasing predictable, recurring revenue and building a strong, multi-year backlog.\n\nDuring the first half of 2025, bookings in the Company's OSS segment were $25.4 million, which included orders from new and existing customers. These orders are expected to contribute to OSS segment revenue in the second half of 2025 and into 2026.\n\nThe Company continues to anticipate consolidated revenue of $59 million to $61 million for the full year of 2025. This includes expected OSS segment revenue of approximately $30 million, representing over 20% year-over-year growth. In addition, the Company expects to be EBITDA break-even for the full year of 2025.\n\nOSS will hold a conference call to discuss its results for the second quarter of 2025, followed by a question-and-answer period.\n\nDate: Thursday, August 7, 2025\n\nTime: 10:00 a.m. ET (7:00 a.m. PT)\n\nToll-free dial-in: 1-800-579-2543\n\nInternational dial-in: 1-785-424-1789\n\nConference ID: ONESTOP (required for entry)\n\nWebcast: https://viavid.webcasts.com/starthere.jsp?ei=1720675&tp_key=5676c84cc3\n\nA replay of the call will be available after 1:00 p.m. ET on August 7, 2025, through August 21, 2025.\n\nOne Stop Systems, Inc. OSS is a leader in AI enabled solutions for the demanding ‘edge.' OSS designs and manufactures Enterprise Class compute and storage products that enable rugged AI, sensor fusion and autonomous capabilities without compromise. These hardware and software platforms bring the latest data center performance to harsh and challenging applications, whether they are on land, sea or in the air.\n\nOSS products include ruggedized servers, compute accelerators, flash storage arrays, and storage acceleration software. These specialized compact products are used across multiple industries and applications, including autonomous trucking and farming, as well as aircraft, drones, ships and vehicles within the defense industry.\n\nOSS solutions address the entire AI workflow, from high-speed data acquisition to deep learning, training and large-scale inference, and have delivered many industry firsts for industrial OEM and government customers.\n\nAs the fastest growing segment of the multi-billion-dollar edge computing market, AI enabled solutions require—and OSS delivers—the highest level of performance in the most challenging environments without compromise.\n\nOSS products are available directly or through global distributors. For more information, go to . You can also follow OSS on X, , and .\n\n\n\nNon-GAAP Financial Measures\n\nWe believe that the use of adjusted earnings before interest, taxes, depreciation and amortization, or adjusted EBITDA, is helpful for an investor to assess the performance of the Company. The Company defines adjusted EBITDA as income (loss) before interest, taxes, depreciation, amortization, acquisition expense, impairment of long-lived assets, financing costs, government funded programs, fair value adjustments from purchase accounting, stock-based compensation expense, and expenses related to discontinued operations.\n\nAdjusted EBITDA is not a measurement of financial performance under generally accepted accounting principles in the United States, or GAAP. Because of varying available valuation methodologies, subjective assumptions and the variety of equity instruments that can impact a company's non-cash operating expenses, we believe that providing a non-GAAP financial measure that excludes non-cash and non-recurring expenses allows for meaningful comparisons between our core business operating results and those of other companies, as well as providing us with an important tool for financial and operational decision making and for evaluating our own core business operating results over different periods of time.\n\nOur adjusted EBITDA measure may not provide information that is directly comparable to that provided by other companies in our industry, as other companies in our industry may calculate non-GAAP financial results differently, particularly related to non-recurring and unusual items. Our adjusted EBITDA is not a measurement of financial performance under GAAP and should not be considered as an alternative to operating income or as an indication of operating performance or any other measure of performance derived in accordance with GAAP. We do not consider adjusted EBITDA to be a substitute for, or superior to, the information provided by GAAP financial results.\n\nAdjusted EPS excludes the impact of certain items and, therefore, has not been calculated in accordance with GAAP. We believe that exclusion of certain selected items assists in providing a more complete understanding of our underlying results and trends and allows for comparability with our peer company index and industry. We use this measure along with the corresponding GAAP financial measures to manage our business and to evaluate our performance compared to prior periods and the marketplace. The Company defines non-GAAP income (loss) as income or (loss) before amortization, government funded programs, impairment of long lived assets, stock-based compensation, expenses related to discontinued operations, and acquisition costs. Adjusted EPS expresses adjusted income (loss) on a per share basis using weighted average diluted shares outstanding.\n\nAdjusted EPS is a non-GAAP financial measure and should not be considered in isolation or as a substitute for financial information provided in accordance with GAAP. These non-GAAP financial measures may not be computed in the same manner as similarly titled measures used by other companies. We expect to continue to incur expenses similar to the adjusted income from continuing operations and adjusted EPS financial adjustments described above, and investors should not infer from our presentation of these non-GAAP financial measures that these costs are unusual, infrequent or non-recurring.\n\nThe following table reconciles non-GAAP net income and basic and diluted earnings per share:\n\nOne Stop Systems cautions you that statements in this press release that are not a description of historical facts are forward-looking statements. Words such as, but not limited to, \"anticipate,\" \"aim,\" \"believe,\" \"contemplate,\" \"continue,\" \"could,\" \"design,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"might,\" \"plan,\" \"possible,\" \"potential,\" \"predict,\" \"project,\" \"seek,\" \"should,\" \"suggest,\" \"strategy,\" \"target,\" \"will,\" \"would,\" and similar expressions or phrases, or the negative of those expressions or phrases, are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. These statements are based on the Company's current beliefs and expectations. The inclusion of forward-looking statements should not be regarded as a representation by One Stop Systems or its partners that any of its plans or expectations will be achieved, including but not limited to expected increases in sales, revenues and profitability, non-GAAP financial measures, our multi-year strategy, expected market growth, continued or new demand for our products, increase in margins, and operating expenses. These statements are based on the company's current beliefs and expectations. Actual results may differ from those set forth in this press release due to the risk and uncertainties inherent in our business, including risks described in our prior press releases and in our filings with the Securities and Exchange Commission (SEC), including under the heading \"Risk Factors\" in our latest Annual Report on Form 10-K and any subsequent filings with the SEC. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof, and the company undertakes no obligation to revise or update this press release to reflect events or circumstances after the date hereof. All forward-looking statements are qualified in their entirety by this cautionary statement, which is made under the safe harbor provisions of the Private Securities Litigation Reform Act of 1995.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/79e2cfd1-4552-49a9-85a0-a44777661e4f",
    "https://www.globenewswire.com/Tracker?data=F1w-tPeaYLBoT9X0kokLzae_SNVWKxQ51hxSjeRPjScmjjgaGpq_3oVoOshsvQUBUugTJIqPO7YOdRAyC8uYVuahlk0qQ13whfdAGZvN-yQ=",
    "https://www.globenewswire.com/Tracker?data=uAJ4o89fF9GF3dz_IEYrsMoaejQ2ovygRXdmeN1Fr1omaJ4cUWsIuDHNACS44LLKLpNyIxbNPDx_8R_Tfvl-9mgczca9vKjvx9LdyrDH9oQ=",
    "https://www.globenewswire.com/Tracker?data=xvlE5sfEoYuuFX9s7jv1mK1lBSCI_a-Jy7OC_NlmeG7VyvloPa2bgjU6fkhKMc9HOxVlQqsOT55xHv3_8ciPoiOAduJKq78Q6EUCdvQegvwRJSMEEPnyG5YJLCQOAH4d",
    "https://www.globenewswire.com/Tracker?data=hRs4hc5ztDqkf3re6RN26nocFLRfe5kQ5sH3nrsFVAeRt_E6lW5He3TSmCL11quvrQ0kyUVl_OMUYb7GG_kNCMjeF2BREeNTEG9ES02cuAXXQAzPNp31hnR4NoKV_L-GuPa9BrazBGXMzGpJpml3WdpTN9TCqviUA7iuQP0wGSGw7IUXRb3GHEtsnz_aDMt62BONqMsOyOENkVt2trspYwh31yYH7GJRAq-pfDX-sfk=",
    "https://www.globenewswire.com/Tracker?data=kNXhuwCLxXzlaaovpO9_NUSN2IiUmAvrwPxpulYwX0_IjLa5NmNjyonjgApn1Q0Cg9GpdqUnEuPBc0K-dcK9yT5eNsHkAMBPmmiyXS8YIPk=",
    "https://www.globenewswire.com/Tracker?data=PTRd7ugtr492UvsQRXag8UybwdOBefKN2lkNwy_c-yeeQXYAiFAZBksyni960WWBKfPykNPUPZoUckAWFlAuOw==",
    "https://www.globenewswire.com/Tracker?data=F1w-tPeaYLBoT9X0kokLzap5gAV-zOfdGcc0UQN-LvkzQLgCqq0c1gIZR8MciBrKEY-8llmoZXgd1FqgT1hXflZ0yyavv-eV4wDp97kWDq4="
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "OSS segment revenue",
      "weight": 0.080762334
    },
    {
      "name": "expected OSS segment revenue",
      "weight": 0.07941606
    },
    {
      "name": "non-GAAP financial results",
      "weight": 0.078459755
    },
    {
      "name": "non-GAAP financial",
      "weight": 0.07776321
    },
    {
      "name": "Non-GAAP Financial Measures",
      "weight": 0.077257335
    },
    {
      "name": "non-GAAP financial measures",
      "weight": 0.077257335
    },
    {
      "name": "non-GAAP net loss",
      "weight": 0.076507844
    },
    {
      "name": "non-GAAP net",
      "weight": 0.07591855
    },
    {
      "name": "non-GAAP income",
      "weight": 0.07497908
    },
    {
      "name": "non-GAAP net income",
      "weight": 0.074618675
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97509765625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93408203125
    },
    {
      "name": "/News/Technology News",
      "score": 0.412353515625
    }
  ],
  "sentiment": {
    "positive": 0.9140625,
    "negative": 0.02772522,
    "neutral": 0.0579834
  },
  "summary": "One Stop Systems (NASDAQ:OSS) has reported its second quarter of 2025 results, showing a significant increase in consolidated gross margin year-over-year to 31.3%, on consolidated revenue of $14.1 million and a 41.3% gross margin for the OSS segment. Year-to-date, OSS segments bookings of $25.4 million support an outlook for accelerating revenue growth and improving profitability for the second half of 2025. Total operating expenses increased by 11.6% to $6.2 million, largely due to higher marketing and selling costs from the increase in personnel costs and increased R&D costs. The Company reported a net loss of $2.0 million for the three months ended June 30, 2025.",
  "shortSummary": "One Stop Systems reported a 46% increase in consolidated gross margin to 41.3%, driven by increased revenue and increased market demand.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "05618c62635d40658c9fa0e8c39831d3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=xvlE5sfEoYuuFX9s7jv1mK1lBSCI_a-Jy7OC_NlmeG7VyvloPa2bgjU6fkhKMc9HOxVlQqsOT55xHv3_8ciPoiOAduJKq78Q6EUCdvQegvwRJSMEEPnyG5YJLCQOAH4d",
      "text": "That’s a wrap on Wright-Patt Expo 2025! Thank you to everyone who stopped by the OSS tabletop to learn more about our 360° Situational Awareness applications and how we’re brining the datacenter to the tactical edge. It was a great opportunity to connect with so many professionals focused on advancing defense technology. A special thanks to Tom Fries, One Stop Systems Director of Government Sales, and Stephen M. Ferrell, Technology and IT Security Leader of Meta Technical Sales Inc, for representing OSS and sharing how our high-performance edge computing solutions are supporting mission-critical operations. We’re proud to be part of the innovation driving the future of defense. #DefenseTech #EdgeComputing #SituationalAwareness #WrightPatt2025 #OneStopSystems #AI #DoD #MilitaryTech\nAbout us\nOSS is a leader and innovator in rugged HPC solutions for the demanding 'edge.' We design and manufacture the highest performance compute and storage products that enable rugged AI/ML, sensor processing, sensor fusion and autonomous capabilities without compromise. These hardware and software platforms bring the latest data center performance to harsh and challenging applications, whether they are on land, sea or in the air. • Our solutions accelerate AI to deliver where it matters most • Our solutions address the entire AI workflow, from high-speed data acquisition to deep learning, training and large-scale inference • Our solutions have delivered industry firsts for Commercial and Defense customers • Our solutions meet the demands of the fastest growing segment of the multi-billion-dollar edge computing market\n- Website\n-\nhttps://onestopsystems.com/\nExternal link for One Stop Systems\n- Industry\n- Computer Hardware Manufacturing\n- Company size\n- 51-200 employees\n- Headquarters\n- Escondido, CA\n- Type\n- Public Company\n- Specialties\n- Avionics computing solutions, edge server, hyperconverged server, military data storage, ruggedized computer systems, ruggedized data storage, unmanned autonomous vehicle computing, AI servers, edge based computing, gpu high performance computing, gpu rackmount server, high capacity storage server, battlefield data processing and analytics, command and control systems, cybersecurity solutions for military, electronic warfare systems, mission-critical computing, radar and sonar processing solutions, rugged server for autonomous trucks, and ruggedized computing solutions\nLocations\n-\nPrimary\nGet directions\n2235 Enterprise St\nSuite #110\nEscondido, CA 92029, US\nEmployees at One Stop Systems\nUpdates\n-\nAccelerating Rugged Edge Innovation At One Stop Systems, we’re always pushing the limits of edge AI compute—and our latest blog, written by Braden Cooper, Director of Products, dives into how modular architecture is transforming rugged edge system design. From faster time-to-deployment to increased design flexibility, OSS is enabling new possibilities in edge systems for defense, autonomous platforms, and AI-driven applications operating in the harshest environments. Read how OSS is building the future of high-performance compute at the edge: https://lnkd.in/erPrhSKi #EdgeAI #RuggedComputing #AIAtTheEdge #OneStopSystems #AutonomousSystems #EmbeddedSystems\n-\nPonto continues to push the limits of commercial datacenter performance. The latest addition to OSS’s portfolio, Ponto is the world’s first PCIe Gen 5 GPU expansion system purpose-built for enterprise AI and ML workloads that demand ultra-dense, high-throughput compute. With support for up to 16 high-wattage GPUs in just 6U of rack space, Ponto delivers: • 16kW of total power • Enterprise-grade reliability • Advanced thermal management with custom ducting and high-voltage fans • OSS’s proprietary Unified BMC for real-time telemetry, fan control, and GPU power tuning Optimized for composable infrastructure, accelerated AI training, and large-scale inference, Ponto is helping commercial datacenters boost performance per watt, performance per rack, and lower TCO — all with OSS’s signature PCIe expertise and system-level innovation. As CEO Mike Knowles puts it: \"We believe Ponto is a leap forward in datacenter efficiency — empowering customers to execute AI workloads at unprecedented scale.\" OSS is proud to continue delivering high-performance infrastructure solutions for the evolving demands of enterprise AI. 🔗 Learn more: https://lnkd.in/e6r-_j_u #OSS #Ponto #PCIeGen5 #AIInfrastructure #DatacenterPerformance #EnterpriseAI #GPUs #ComposableInfrastructure #EdgeCompute #MachineLearning #InnovationWithoutCompromise\n-\nA lot can happen in two years—and at One Stop Systems (OSS), the transformation has been nothing short of game-changing. Since bringing on CEO Mike Knowles, OSS has expanded from a primarily commercial focus to become a trusted partner in defense—with multi-year military contracts, record-breaking orders, and a share price that’s nearly tripled. The San Diego Business Journal recently sat down with Mike to talk about OSS’s evolution, our growing role in national defense, and the cutting-edge tech that’s setting us apart. 📰 Dive into the full story here: https://lnkd.in/e9Vfw8_a #OSS #AITransportable #EdgeComputing #DefenseTech #Leadership #SanDiegoTech #GrowthStrategy #GPUComputing #OneStopSystems #InnovationAtTheEdge\n-\nOne Stop Systems reposted this\nOne Stop Systems secures $25M edge AI deal for medical imaging compute systems...Read more: https://lnkd.in/eqcVA9bJ #AIinference #AI #ML #edgeAI #edge #edgecomputing #Nvidia #GPU #ruggedizedservers #OneStopSystems #OSS Mike Knowles\n-\n🇺🇸 Happy Independence Day from OSS! 🎆 From all of us at OSS, we wish you a safe and joyful holiday with family and friends. Please note: Our offices will be closed on Friday, July 4th in observance of the holiday and will resume normal business hours on Monday, July 7th. #IndependenceDay #FourthOfJuly #TeamOSS\n-\nJust Announced: OSS Secures $5M Contract to Support U.S. Navy’s P-8A Poseidon Aircraft We’re proud to share that OSS has been awarded a $5 million contract by the U.S. Navy to deliver 61 rugged, military-spec data storage units for the P-8A Poseidon Reconnaissance Aircraft. These high-capacity NVMe storage systems are designed for rapid, secure data offload in demanding airborne environments—strengthening C5ISR operations where it matters most. With this latest award, OSS has now secured over $45 million in total contracted revenue supporting the P-8A platform, reinforcing our role as a trusted partner in advanced defense applications. “Our continued success on the P-8A program reflects the strength of our strategy and the vital role OSS plays in enabling mission-critical AI and sensor processing at the edge.” – Mike Knowles, President & CEO 🔗 Read more: https://lnkd.in/ezgbqni9 #DefenseTech #EdgeComputing #MilitaryAI #C5ISR #P8Poseidon #USNavy #NVMe #OSS #RuggedComputing #MadeInUSA\n-\nFueled by pizza and soda, the OSS crew showed up over the weekend to power through quarter close! 🍕 🥤 Dedication like this is what sets our team apart. When it comes to delivering for our customers, we go the extra mile - because the customer is OUR mission. #TeamOSS #QuarterClose #CustomerFirst #HPC #EdgecComputing\n-\nOSS Secures Third Order to Power Autonomous Maritime Defense We’re excited to announce a new $340K order from a leading Asian defense contractor—supporting the production of unmanned surface vehicles (USVs) for harbor patrol and security. This marks the shift from development to production, with projected cumulative sales of $4M through 2029. Our rugged 3U Gen 5 SDS servers and networking tech enable real-time AI processing from 30+ cameras—built to perform in harsh marine environments over 40°C. This multi-year program highlights OSS’s role as a key platform partner for next-gen autonomous systems. 🛡️ Proud to support the future of maritime and national security. 📄 Read the full release: https://lnkd.in/gGY2iMsp #EdgeComputing #AutonomousSystems #DefenseTech #AIatTheEdge #RuggedComputing #OSS #USV #MaritimeSecurity\n-\nToday One Stop Systems honors Juneteenth — a day that commemorates the end of slavery in the United States and celebrates freedom, resilience, community and achievement. As we reflect on the significance of this day, we remain committed to a culture that builds a strong employee community and focuses on doing right by our customers. #Juneteenth #OneStopSystems #Community #Respect"
    },
    {
      "url": "https://www.globenewswire.com/Tracker?data=kNXhuwCLxXzlaaovpO9_NUSN2IiUmAvrwPxpulYwX0_IjLa5NmNjyonjgApn1Q0Cg9GpdqUnEuPBc0K-dcK9yT5eNsHkAMBPmmiyXS8YIPk=",
      "text": "No Compromise\n|\nOne Stop Systems, Inc. (OSS) designs and manufactures innovative edge computing modules and systems for AI Transportable applications including ruggedized servers, compute accelerators, expansion systems, flash storage arrays and Ion Accelerator™ SAN, NAS and data recording software. These products are used for AI data set capture, training, and large-scale inference in the defense, oil and gas, mining, autonomous vehicles and rugged entertainment applications. |\nNo Compromise\nIntegration of the highest end data center class CPUs, GPUs, FPGAs, NVMe SSDs, and networking in rugged edge platforms for demanding AI workloads.\nSignal Integrity\nExpert PCIe & NVLink designs delivering next generation designs up to 32GTs including scale-out PCIe Gen 4 designs of 200+ endpoint devices at the system or rack level.\nShock and Vibration\nDesigns for stringent vehicle specifications to operate in harsh environments leveraging expertise in structural analysis & simulation for low SWaP.\nLiquid and Air\nExpertise in extreme temperature ranges for systems with challenging heat generating components using advanced thermal design for air & liquid solutions.\nAir, Sea, Land Compatible\nFlexible power subsystem designs accommodating a wide range of transportable edge system inputs from 48VDC to 3Ø (Phase), 400Hz AC inputs for 6000W GPU systems.\nSystem Management & RDMA Data Flows\nFlexible system management, scale-out BIOS and SAN/NAS storage software using NVMeoF and GPU Direct capability through intuitive user interfaces.\nThe rugged edge computing landscape is becoming increasingly complex with new generations of technologies, such as the latest AI focused GPUs, releasing annually rather than every 2-3 years. Whether the end application is commercial or defense, rugged edge servers must not only deliver cutting-edge compute performance but also withstand extreme environmental conditions.\nWhen the PCI-SIG formally added support for 675W add-in card devices in the PCI Express Card Electromechanical (CEM) specification in August 2023, NVIDIA’s most powerful CEM GPU, the NVIDIA H100 80GB had a maximum power consumption of 350W. While some devices were starting to push the limits of datacenter thermodynamics – high density systems of many 675W devices seemed like a distant reality. However, with power constraints uncapped and the need for higher performing GPUs skyrocketing, the industry quickly came out with devices taking full advantage of the new specification capability. NVIDIA quickly replaced the H100 80GB with the H100 NVL, increasing power density to 400W. While this small jump was manageable for existing installations, NVIDIA then dove all-in with the H200 NVL released in late 2024 at 600W. The rapid transition from 350W to 600W has put power and cooling technologies in the spotlight in a race to solve this next generation challenge.\nThe advent of technology has always brought about significant changes to various industries, and the transportation sector is no exception. Among the most transformative innovations in recent years is the development of autonomous vehicles, particularly trucks. The potential for autonomous trucks to revolutionize freight transport is immense, raising the fundamental question: will these technological advancements make human drivers obsolete? To explore this question, we must consider the current state of autonomous driving technology, the economic implications, and the societal impact of removing human drivers from the equation.\nOne Stop Systems\n2235 Enterprise Street #110, Escondido, CA 92029\nToll Free: +1 (877) 438-2724\nLocal: +1 (760) 745-9883\nContact Form Map\nBressner Technology\nA Subsidiary of One Stop Systems\nIndustriestraße 51, D - 82194 Gröbenzell, Germany\nTel: +49 (0)8142 29113-98 • Fax: +49 (0)8142 47284-77\nContact Form Map"
    },
    {
      "url": "https://www.globenewswire.com/Tracker?data=uAJ4o89fF9GF3dz_IEYrsMoaejQ2ovygRXdmeN1Fr1omaJ4cUWsIuDHNACS44LLKLpNyIxbNPDx_8R_Tfvl-9mgczca9vKjvx9LdyrDH9oQ=",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    }
  ],
  "argos_summary": "One Stop Systems, Inc. (OSS) reported a significant increase in consolidated gross margin to 31.3% for Q2 2025, up from 25.2% a year earlier, alongside a revenue rise to $14.1 million. The OSS segment achieved a gross margin of 41.3% and recorded year-to-date bookings of $25.4 million, indicating strong demand and an optimistic outlook for the second half of 2025. Despite a net loss of $2.0 million, the company anticipates revenue growth driven by strategic investments and a robust order pipeline, particularly in defense and commercial sectors.",
  "argos_id": "MA4VHIOD9"
}