{
  "url": "https://www.yahoo.com/news/articles/higher-ed-program-changes-public-135328596.html",
  "authorsByline": "Native News Online Staff",
  "articleId": "8efb5fd2479c4893a9522d9ffd515e8a",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/e1872b2a348ecf408e074f29f4936519de2c7f8eff54cc90c503eaaa3579316c/ynews/resizefill_w1200/https://media.zenfs.com/en/native_news_online_articles_488/8571d7122f71101dc263207b69a44d80",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:53:28+00:00",
  "addDate": "2025-08-07T14:05:51.756587+00:00",
  "refreshDate": "2025-08-07T14:05:51.756590+00:00",
  "score": 1.0,
  "title": "Comment on Higher Ed Program Changes: Public Hearing Today",
  "description": "The U.S. Department of Education will hold a virtual public hearing this Thursday, August 7, from 9:00 AM to 4:00 PM ET, to begin negotiated rulemaking on Title IV programs under the Higher Education Act.  The U.S. Department of Education plans to initiate negotiated rulemaking for programs authorized under Title IV of the Higher Education Act of 1965.  The Department is seeking public input on potential changes to the Federal Student Loan programs, the Federal Pell Grant Program, and other Title IV programs not related to student loans.",
  "content": "The U.S. Department of Education will hold a virtual public hearing this Thursday, August 7, from 9:00 AM to 4:00 PM ET, to begin negotiated rulemaking on Title IV programs under the Higher Education Act.\n\nThe U.S. Department of Education plans to initiate negotiated rulemaking for programs authorized under Title IV of the Higher Education Act of 1965. The Department is seeking public input on potential changes to the Federal Student Loan programs, the Federal Pell Grant Program, and other Title IV programs not related to student loans.\n\nNever miss Indian Country’s biggest stories and breaking news. Click here to sign up to get our reporting sent straight to your inbox every weekday morning.\n\nMany Native American students depend on Pell Grants to access and complete higher education.\n\nThis is public hearing provides tribal nations, Native students, and educators to add critical testimony on why the Pell Grant Program must remain intact.\n\nWritten testimony can be submitted by Autust 28, 2026.\n\nTo participate in the hearing, CLICK HERE.\n\nAbout the Author: \"Native News Online is one of the most-read publications covering Indian Country and the news that matters to American Indians, Alaska Natives and other Indigenous people. Reach out to us at editor@nativenewsonline.net. \"",
  "medium": "Article",
  "links": [
    "https://nativenewsonline.net/subscribe-to-native-news-today",
    "https://www.regulations.gov/search?filter=ed-2025-ope-0151",
    "https://events.zoomgov.com/ev/AillJ-imXIMy0FIA0Al5tSEiAvFHZbhsbstN88QqgVetZsclxpUK~Av-Oks7_Nr0HnNXBJyqxFl41l6WK08fcUf8JT1QS5RvXuTzHMdNPSb99NQ",
    "https://ncai.us6.list-manage.com/track/click?u=9a05d466a08334b9dbb97078e&id=205b6e6b5c&e=60b07a7454"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other Title IV programs",
      "weight": 0.114895955
    },
    {
      "name": "Title IV programs",
      "weight": 0.11173725
    },
    {
      "name": "Higher Ed Program Changes",
      "weight": 0.10788095
    },
    {
      "name": "Many Native American students",
      "weight": 0.09668835
    },
    {
      "name": "Native students",
      "weight": 0.093677506
    },
    {
      "name": "programs",
      "weight": 0.08975542
    },
    {
      "name": "Pell Grants",
      "weight": 0.08832209
    },
    {
      "name": "Title IV",
      "weight": 0.08738632
    },
    {
      "name": "Indian Country",
      "weight": 0.08677462
    },
    {
      "name": "Public Hearing",
      "weight": 0.082070045
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.97314453125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.74853515625
    }
  ],
  "sentiment": {
    "positive": 0.23059082,
    "negative": 0.17297363,
    "neutral": 0.5961914
  },
  "summary": "The U.S. Department of Education is set to hold a virtual public hearing on August 7 to begin negotiated rulemaking on Title IV programs under the Higher Education Act. The Department is seeking public input on potential changes to the Federal Student Loan programs, the Federal Pell Grant Program, and other non-Title IV programs not related to student loans. The hearing will allow tribal nations, Native students, and educators to add critical testimony supporting the Pell Grant program. Written testimony can be submitted by Autust 28, 2026.",
  "shortSummary": "The US Department of Education will hold a virtual public hearing on potential changes to Title IV programs, including Pell Grant protections.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "57c3f9d6c43645fa8c50c2dbe9e51265",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The U.S. Department of Education will conduct a virtual public hearing on August 7 to initiate negotiated rulemaking for Title IV programs under the Higher Education Act, focusing on potential changes to Federal Student Loan programs and the Pell Grant Program. This hearing aims to gather input from tribal nations, Native students, and educators regarding the importance of maintaining the Pell Grant Program, which is crucial for many Native American students pursuing higher education. Written testimony can be submitted until August 28, 2026.",
  "argos_id": "MW4QOPL9L"
}