{
  "url": "https://www.yahoo.com/news/articles/law-roundup-party-12-runs-130500291.html",
  "authorsByline": "Daily Inter Lake, Kalispell, Mont.",
  "articleId": "476c0a1bcf3a4978aef97cf764ff1f99",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:05:00+00:00",
  "addDate": "2025-08-07T13:20:55.711930+00:00",
  "refreshDate": "2025-08-07T13:20:55.711931+00:00",
  "score": 1.0,
  "title": "Law roundup: Party of 12 runs amok in parking lot",
  "description": "Aug. 7—Twelve males were allegedly running around, screaming and peeing in a parking lot while one person handed out beer. Someone thought a topless man hiding in the bushes might have had an outstanding warrant. They also suspected he was trespassing after having been previously kicked off the property. Three teens wearing ballcaps reportedly followed someone, throwing rocks at them, in the ...",
  "content": "Aug. 7—Twelve males were allegedly running around, screaming and peeing in a parking lot while one person handed out beer.\n\nSomeone thought a topless man hiding in the bushes might have had an outstanding warrant. They also suspected he was trespassing after having been previously kicked off the property.\n\nThree teens wearing ballcaps reportedly followed someone, throwing rocks at them, in the area of East Center Street. One boy wearing a white T-shirt allegedly tried to steal his bike.\n\nAn employee contacted the police, suspicious that a man who had banged on the door of the business, which was closed, was still outside because their car alarm went off. The employee wanted to make sure he wasn't hiding in the stairways or elsewhere. The man was gone when officers arrived.\n\nA woman called the police, alleging human trafficking was occurring at a location where she requested extra patrols, saying she'd seen women dropped off weekly who would stay a couple of weeks before disappearing. She said it had been going on for two years and had security camera footage. She was given advice and planned to bring her evidence to the police.\n\nSomeone reportedly left a backpack in a resource room and computer area. An employee told an officer they didn't want to search it, concerned about what it might contain, and said they would be moving staff out of the building. Although they said there had been no previous issues with the client, they wanted the police to search the backpack as per policy. The suspicious backpack contained pens and a gift card.\n\nA father reported his 23-year-old son missing after an hour had passed since the pair got separated while floating on the river. He was eventually found.\n\nStaff reportedly tried to get a ride for a patient who had been drinking, but he drove off.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "parking lot",
      "weight": 0.07351785
    },
    {
      "name": "East Center Street",
      "weight": 0.061238788
    },
    {
      "name": "human trafficking",
      "weight": 0.05928111
    },
    {
      "name": "extra patrols",
      "weight": 0.059055507
    },
    {
      "name": "security camera footage",
      "weight": 0.05841784
    },
    {
      "name": "women",
      "weight": 0.05371862
    },
    {
      "name": "Staff",
      "weight": 0.04925701
    },
    {
      "name": "staff",
      "weight": 0.04925701
    },
    {
      "name": "officers",
      "weight": 0.049244434
    },
    {
      "name": "rocks",
      "weight": 0.048057806
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.98095703125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.9453125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.869140625
    }
  ],
  "sentiment": {
    "positive": 0.045654297,
    "negative": 0.75146484,
    "neutral": 0.20300293
  },
  "summary": "A group of 12 males allegedly ran amok in a parking lot while one person handed out beer. Someone reported a topless man hiding in the bushes, possibly with an outstanding warrant, and suspected he was trespassing after previously being kicked off the property. An employee alerted the police after an employee became suspicious about a man outside the business. The police were called to investigate a suspected human trafficking incident at a location where a woman alleges that women are being dropped off weekly, often disappearing, and that it has been going on for two years. A suspicious backpack reportedly left in a resource room and computer area and was searched by the police for potential reasons. A father reported his 23-year-old son missing after an hour had passed, but he was found.",
  "shortSummary": "A party of 12 ran riot in a parking lot, sparked by a police search, and a report of human trafficking in a nearby park.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2802a92806b64bb6aa5d33ad54dd1418",
  "places": [
    {
      "osmId": "20058366",
      "road": "East Center Street",
      "city": "City of Elmira",
      "county": "Chemung County",
      "state": "New York",
      "postcode": "14901",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 42.1086652,
        "lon": -76.8090661
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Multiple incidents were reported, including a group of twelve males causing a disturbance in a parking lot, a topless man suspected of trespassing, and three teens throwing rocks at someone. A woman alleged ongoing human trafficking at a location, claiming to have evidence, while a suspicious backpack left in a resource room was found to contain harmless items. Additionally, a father reported his son missing after they separated while floating on a river, but the son was later located.",
  "argos_id": "O7WNAFVZN"
}