{
  "url": "https://www.foxnews.com/politics/business-owner-behind-mysterious-remember-hiroshima-protest-doll-disneylands-small-world-ride-revealed",
  "authorsByline": "Emma Colton",
  "articleId": "75f7d37b8a874919b0a60f60cf990e1c",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/hiroshima-doll.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T09:30:15-04:00",
  "addDate": "2025-08-07T13:38:15.539210+00:00",
  "refreshDate": "2025-08-07T13:38:15.539212+00:00",
  "score": 1.0,
  "title": "Business owner behind mysterious 'Remember Hiroshima' protest doll at Disneyland’s Small World ride revealed",
  "description": "A mysterious protest doll with a 'Remember Hiroshima' sign appeared at Disneyland over the weekend, later revealed to be part of Ben Cohen's 'Up in Arms' campaign.",
  "content": "Baffled Disneyland visitors at the \"It's a Small World\" attraction were greeted by a protest doll holding a sign reading \"Remember Hiroshima\" over the weekend, sparking questions and speculation online as videos of the doll spread.\n\nVideos began circulating on TikTok and Reddit Monday showing a woman carrying a female doll holding a sign reading \"Remember Hiroshima\" while walking around Disneyland. Another photo online showed the doll within the \"It's a Small World\" exhibit, strategically positioned next to one of the tunnels that the boat ride traffics.\n\nSpeculation mounted as the videos spread and earned hundreds of thousands of views and social media users questioned the meaning of the political stunt, while others questioned how the doll made it through the park's tight security.\n\nBen & Jerry's co-founder Ben Cohen revealed he was behind the stunt Thursday, telling Fox News Digital in a phone interview that he's in the midst of a campaign against the U.S. government's stockpile of powerful weapons as part of his \"Up in Arms\" campaign against the Pentagon's spending budget. Cohen said that while the campaign targets current policies under the Trump administration, the matter of Pentagon spending is \"disgustingly bipartisan\" and stretches long past the current administration.\n\nCALIFORNIA BEACH ‘RESIST!’ PROTEST PUSHES ‘KINDNESS’ WHILE CALLING TO ‘86 47’ IN ANTI-TRUMP MESSAGE\n\n\"The whole idea of the Small World exhibit is that it's a small world after all,\" Cohen told Fox News Digital in a phone interview. \"You got all the children from the different countries around the world being together, loving each other. And we put a doll in there that says, ‘Remember Hiroshima.’I mean, that's what was supposed to happen after the bomb in Hiroshima. We were supposed to remember what we did there and say, ‘Never again.’ And we've, we've ignored that.\"\n\nThe political protest was launched just ahead of the 80th anniversary of the 1945 Hiroshima bombings Thursday, when an atomic bomb killed more than 100,000 people in the Japanese city during World War II. Cohen specifically took issue with the ongoing war in Gaza, which he called the \"moral issue of our time,\" when speaking with Fox Digital, as well as the Pentagon's nearly $900 billion budget.\n\n\"They've turned us all into murderers, and they're taking our money, buying bombs with it, and giving it to Israel to slaughter people in Gaza,\" he said of the war that has raged since the Biden administration. \"And a whole lot of them are kids, just like that little girl that we placed in Disneyland.\"\n\nCohen said his criticisms of the U.S.' military budget and push to build stockpiles of weapons is \"disgustingly bipartisan,\" stretching back long before the Trump administration.\n\n\"Trump is the current president. He's responsible, but I can tell you that all the presidents before him were responsible as well,\" he said, referring to the U.S.' nuclear weapons program across the decades.\n\nDEVELOPMENT OF NUCLEAR BOMB 24 TIMES MORE POWERFUL THAN HIROSHIMA'S IS 'SIGNIFICANTLY AHEAD OF SCHEDULE'\n\nTrump repeatedly has championed his \"peace through strength\" vision for the U.S. military, citing that a powerful U.S. military will keep other nations from sparking wars.\n\n\"For at least two decades, political leaders from both parties have dragged our military into missions it was never meant to be,\" Trump, for example, said during his speech to the graduating class at West Point Military Academy in May. \"They sent our warriors on nation-building crusades to nations that wanted nothing to do with us, led by leaders that didn’t have a clue in distant lands, while abusing our soldiers with absurd ideological experiments here and at home.\"\n\nHe added that those days are over via his peace through strength mission for the military, adding at the time, \"My preference will always be to make peace and to seek partnership, even with countries where our differences may be profound.\"\n\nA Disneyland spokesperson told Fox Digital, when asked about the protest doll, that a cast member swiftly removed the doll from the ride attraction when it was first spotted, and reminded the guest of park rules. The activist who placed the doll within the attraction left without incident, according to Disney.\n\nBen & Jerry's, which Cohen and co-founder Jerry Greenfield sold in 2000, has a long history of left-wing politics and social justice activism, including rolling out ice cream flavors such as \"Pecan Resist\" in 2018 to protest the first Trump administration, and \"Change the Whirled\" in 2021 that was crafted with former NFL player Colin Kaepernick, who was the first sports player to popularize kneeling during the national anthem back in 2016.\n\nCohen, specifically, also has not shied away from participating in public protests, including in May when he was detained after interrupting a Senate hearing focused on aid to Gaza.\n\nDISNEY'S 'IT'S A SMALL WORLD' RIDE TO GET NEW SONG LYRICS\n\nCohen said he is just beginning a four-year campaign protesting the U.S.' military budget in an effort to get the funds \"toward the things that people really want.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Americans are compassionate,\" he said. \"We don't want to kill families just like ours in other countries, we just want a good life for ourselves and our kids. People want a decent place to live that doesn't cost an arm and a leg, good schools, affordable childcare, but they say there's not enough money, and what they don't say is that they're spending it all on preparing to kill literally millions of people around the world.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/politics/defense/wars",
    "https://www.foxnews.com/category/travel/general/theme-parks",
    "https://www.foxnews.com/travel/disneys-its-small-world-ride-get-new-set-song-lyrics",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/politics/california-beach-resist-protest-pushes-kindness-while-calling-86-47-anti-trump-message",
    "https://www.foxnews.com/category/tech/topics/pentagon",
    "https://www.foxnews.com/category/topic/world-war-two",
    "https://www.foxnews.com/video/6376650840112",
    "https://www.foxnews.com/us/development-nuclear-bomb-24-times-more-powerful-than-hiroshimas-significantly-ahead-schedule"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fox News Digital",
      "weight": 0.058219746
    },
    {
      "name": "public protests",
      "weight": 0.057825457
    },
    {
      "name": "Fox Digital",
      "weight": 0.05630487
    },
    {
      "name": "Ben Cohen",
      "weight": 0.0540379
    },
    {
      "name": "other countries",
      "weight": 0.051063582
    },
    {
      "name": "Cohen",
      "weight": 0.050802667
    },
    {
      "name": "U.S.",
      "weight": 0.05051368
    },
    {
      "name": "powerful weapons",
      "weight": 0.04939175
    },
    {
      "name": "other nations",
      "weight": 0.04897062
    },
    {
      "name": "Hiroshima",
      "weight": 0.048947975
    }
  ],
  "topics": [
    {
      "name": "Nuclear Weapons"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Travel"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9091796875
    },
    {
      "name": "/News/Local News",
      "score": 0.63623046875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.400634765625
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.3740234375
    }
  ],
  "sentiment": {
    "positive": 0.06976318,
    "negative": 0.6894531,
    "neutral": 0.2409668
  },
  "summary": "Ben & Jerry's co-founder, Ben Cohen, revealed that he was behind the controversial stunt at Disneyland's Small World attraction, where a protest doll with a sign reading \"Remember Hiroshima\" was placed in the \"It's a Small World\" exhibit. The demonstration sparked questions and speculation online, with videos circulating on TikTok and Reddit showing a woman carrying a female doll holding a sign. The doll was removed from the attraction without incident. Cohen's campaign against the U.S. government's stockpile of weapons is part of his \"Up in Arms\" campaign, which also criticizes the Pentagon's spending budget. He specifically mentioned the ongoing war in Gaza as a moral issue.",
  "shortSummary": "Ben Cohen, co-founder of Ben & Jerry's, displayed a protest doll at Disneyland's \"It's a Small World,\" criticizing the U.S' military budget and nuclear weapons programs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "89449837185a41efb39b1280d091f95a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/travel/disneys-its-small-world-ride-get-new-set-song-lyrics",
      "text": "It might be a small world, but big changes are in store for guests of Disneyland’s Main Street U.S.A. and its \"It’s A Small World\" attraction.\nThe resort is celebrating its 70th anniversary, according to the Disney Parks blog, and new lyrics will be added to the song that's synonymous with the boat ride.\nAs riders step inside the Main Street Cinema, a new short film, \"The Last Verse,\" will highlight the Sherman Brothers, a musical twosome who collaborated with Walt Disney on the song, \"It’s A Small World.\"\nDISNEY REVEALS FATE OF CLOSED STAR WARS HOTEL\nIn the film, a new verse, written by Richard M. Sherman, will be officially added to the lyrics of the popular song, a spokesperson for Disneyland confirmed to Fox News Digital.\nRichard Sherman died in May 2024 at the age of 95, but not before writing a third and final verse intended to debut in honor of the 60th anniversary of the song.\nDISNEY CRUISE LINE INCREASES RECOMMENDED GRATUITIES\nUnveiled in November, the new verse says, \"Mother Earth unites us in heart and mind / And the love we give makes us humankind / Through our vast wondrous land / When we stand hand-in-hand / It’s a small world after all.\"\nDISNEYLAND, UNIVERSAL STUDIOS HOLLYWOOD, OFFERING FREE TICKETS TO FIREFIGHTERS\nThe song \"It’s a Small World\" debuted in 1964 at the New York World’s Fair. The ride, which featured the use of animatronics, became a visitor favorite and was moved to Disneyland in 1966.\nOther popular songs written by Richard Sherman and his brother Dick Sherman include \"Supercalifragilisticexpialidocious\" and \"A Spoonful of Sugar\" from the movie \"Mary Poppins.\"\nFor more Lifestyle articles, visit www.foxnews.com/lifestyle\nThe brothers also wrote \"I Wan’na Be Like You (The Monkey Song)\" from \"The Jungle Book.\"\nThe Sherman Brothers won an Oscar for the song \"Chim Chim Cher-ee\" in \"Mary Poppins\" and were nominated for eight others during the 1960s and 1970s.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nThe short film and new verse for \"It's a Small World\" will debut at Disneyland July 17.\nDisney will offer several other gallery experiences to celebrate its 70th anniversary, according to the Disney Parks blog, including some never-before seen art and artifacts, like Walt Disney’s rocking chair, lamp and table from his private apartment.\nCLICK HERE TO GET THE FOX NEWS APP\nThese items will be available for viewing at the Opera House on Main Street, U.S.A."
    },
    {
      "url": "https://www.foxnews.com/category/tech/topics/pentagon",
      "text": "MILITARY July 30 Army secretary rescinds West Point leadership offer to former Biden administration CISA director Former Biden administration cybersecurity chief Jen Easterly lost a distinguished West Point chair position after the Army secretary ordered a review of academy hiring practices.\nUS Army July 25 Decision to remove West Point crest from chapel Bibles reversed by secretary of the Army \"The decision to remove the Academy’s historic crest from the Bibles in the Cadet Chapel is yet another example of the previous administration pushing far-left politics into our military institutions,\" Secretary of the Army Dan Driscoll said.\nPete Hegseth July 25 Pentagon freezes out DC think tanks in new move, citing 'America last' concerns The Defense Department will now thoroughly vet conference invitations to ensure events advance Trump's agenda, following the withdrawal of officials from the Aspen Security Forum.\nIsrael July 24 US and Israel urgently need to replenish weapons stockpiles after 12-day war, defense analysts warn Iran's missile campaign against Israel and U.S. bases cost Tehran up to $6.6 billion while depleting half its arsenal. Experts call for investment in cheaper interception technologies.\nU.S. Defense & Military Politics July 24 West Point Bible crest controversy spurs Pentagon lawsuit from conservative watchdog Conservative watchdog group sues for documents on the alleged removal of the West Point crest from chapel Bibles, following scrutiny over changes to the academy's mission statement.\nOpinion July 23 SEN ROGER WICKER: The Pentagon needs major reform. Now is our chance New legislation proposes changes to Pentagon's bureaucracy, including portfolio acquisition executives and streamlined qualification for weapons systems.\nLos Angeles July 21 Pentagon orders 700 Marines to withdraw from Los Angeles as stability returns following ICE protests U.S. Marines exit LA following month-long deployment that Mayor Karen Bass called an 'unnecessary, unprecedented, and unconstitutional assault' amid anti-ICE demonstrations.\nMicrosoft July 21 Microsoft ends use of China-based computer engineers for certain Defense Dept projects amid espionage fears After a ProPublica investigation raised security concerns, Microsoft will cease using China-based engineers for work on sensitive Pentagon cloud computing systems.\nSecretary of Defense July 19 SCOOP: Top Hegseth aide resigns from Pentagon after 6 months of service: 'Incredibly inspiring' Justin Fulcher confirmed to Fox News Digital that he voluntarily resigned after six months as a senior advisor to Defense Secretary Pete Hegseth, calling his service “inspiring.\"\nPentagon July 18 Pentagon announces Marine general tapped to lead Naval Academy in historic first Marine Lt. Gen. Michael Borgschulte has been nominated to lead the U.S. Naval Academy, marking the first time in its 180-year history a Marine was tapped for the role.\nPentagon July 18 Pentagon to probe Microsoft's use of Chinese engineers on sensitive defense systems, Hegseth says Defense Secretary Pete Hegseth says the DOD is \"looking into\" a Microsoft cloud program that used Chinese engineers after an investigative report raised concerns about CCP access.\nMicrosoft July 15 National security experts raise concerns after Microsoft program exposed as possible avenue for Chinese spying National security experts expressed alarm over Microsoft's practices allowing China-based engineers access to Pentagon cloud systems after a ProPublica investigation.\nPentagon July 15 Dems press Waltz on Hegseth sharing 'demonstrably sensitive information' in Signal chat Former National Security Advisor Mike Waltz faced scrutiny over a Signal chat incident during his U.N. ambassador hearing before the Senate Foreign Relations Committee.\nPentagon July 15 Hegseth abruptly pulls Pentagon officials from 'globalist' Aspen conference Secretary Hegseth cancels senior Defense participation at Aspen Security Forum, slamming it as promoting globalism, anti‑American views and hatred of the president.\nUS Navy July 14 Navy's next-generation submarine program faces alarming delay to 2040 Navy's next-generation SSN(X) attack submarine faces delays until 2040, with costs projected between $6.7-8 billion per vessel compared to $4 billion Virginia-class submarines.\nWhite House July 8 Trump dishes on Milley clash over leaving military equipment in Afghanistan: 'I knew he was an idiot' Trump said it \"didn't take long\" to figure out the former chairman of the Joint Chiefs of Staff Gen. Mark Milley was an \"idiot.\"\nMILITARY July 7 Navy's carrier fleet faces temporary reduction through 2027 as new ships hit development snags USS John F. Kennedy and USS Enterprise carrier deliveries delayed due to Advanced Arresting Gear issues and supply chain problems, impacting Navy fleet strength.\nPentagon July 4 200 Marines head to Florida in support of ICE as military takes stronger stance on immigration Marines from North Carolina are heading to Florida as part of a 700-personnel deployment requested by DHS to support ICE operations, performing non-law enforcement duties.\nPentagon July 3 Colby’s China-focused Pentagon playbook sparks Ukraine arms freeze The U.S. halts Patriot missile shipments to Ukraine during global review of military aid priorities, sparking debate over defense resource allocation while balancing worldwide commitments.\nIran July 3 Iran nuclear program set back 2 years after US strikes: Pentagon Pentagon reports Iran's nuclear facilities were \"completely obliterated\" in June strikes, offering a more optimistic assessment than earlier estimates while Iran acknowledges damage.\nUkraine July 3 Rep. Eugene Vindman is 'furious' about US pause on weapons to Ukraine Rep. Eugene Vindman is speaking out against the Pentagon's move to halt some weapon shipments to Ukraine, saying it puts \"lives and territory at risk.\"\nBorder security July 3 Troops at the Border: How the military’s role in immigration enforcement has exploded under Trump Military expands at border with Air Force controlling 250 miles in Texas, authorizing troops to detain migrants while civil liberties groups warn of Posse Comitatus violations.\nOpinion July 3 High school seniors see red when they learn the size of the national debt Students face reality of America's $37 trillion national debt in government class, learning interest payments, COVID-19 spending and military costs added to their burden\nUkraine July 2 Pentagon's weapons pause to Ukraine could ‘encourage’ and ‘escalate’ Putin’s war ambitions: security experts Security experts warn Pentagon's decision to withhold promised defense systems from Ukraine may embolden Russian President Vladimir Putin and undermine leverage for ceasefire talks as Russia escalates.\nUkraine July 1 Pentagon halts some weapons shipments to Ukraine over concerns about US stockpiles The Pentagon halted arms shipments to Ukraine, including Patriot missiles, after Trump’s top defense official warned U.S. stockpiles had dropped to critical levels.\nUS Air Force July 1 The future of air combat: How long will the US military still need pilots? As the Pentagon develops sixth-generation fighters like the F-47, experts disagree whether humans should remain in cockpits or if autonomous drones will soon match piloted aircraft.\nWhite House June 27 Trump would strike Iran 'without question' if it restarts nuclear weapons program President Donald Trump said that additional strikes against Iran would continue if Tehran attempted to advance its nuclear program again.\nMedia June 26 Ex-Secretary of State Condoleezza Rice calls US strikes on Iran a 'shot in the arm' for American credibility Former Secretary of State Condoleezza Rice gives her take on U.S. strikes on Iranian nuclear facilities during an exclusive interview on \"Special Report.\"\nPentagon June 26 Hegseth tears into reporters, alleging they 'cheer against Trump' and Iran strikes Defense Secretary Hegseth accused the Pentagon press corps of deliberately undermining Operation Midnight Hammer's success against Iran's nuclear program due to anti-Trump bias.\nWhite House June 26 Iran, Israel and US agree that Islamic Republic nuclear sites were 'badly damaged' despite leaked intel report President Trump’s historic precision strikes on Iran’s nuclear sites over the weekend hit their targets and “destroyed\" and “badly damaged\" the facilities’ critical infrastructure — an assessment agreed upon by Iran’s Foreign Ministry, Israel, and the United States."
    },
    {
      "url": "https://www.foxnews.com/category/topic/world-war-two",
      "text": "Nuclear Proliferation 1 day ago Russia and China tick Doomsday Clock toward midnight as Hiroshima bombing hits 80 years The Doomsday Clock moves closer to midnight as analysts debate nuclear deterrence effectiveness amid rising tensions with Russia over Ukraine and China's arsenal expansion.\nUS July 26 WWII hero's remains finally coming home after 80-year mystery is solved through military dedication The remains of Army Air Forces 1st Lt. Henry J. Carlin, who disappeared in a WWII crash over Burma in 1943, have been identified and will be buried at Arlington National Cemetery.\nHealth July 22 Higher cancer rates linked to WWII radioactive waste in Midwestern creek Radioactive contamination from Coldwater Creek in Missouri linked to higher cancer rates, a Harvard study finds, as Congress expands the Radiation Exposure Compensation Act.\nWorld War Two July 20 Jake Larson, WWII veteran turned TikTok's 'Papa Jake,' dies at 102, granddaughter announces TikTok star \"Papa Jake\" Larson, who planned the Normandy invasion and survived D-Day, passed away at 102 after sharing his World War II memories online.\nHistory July 9 WWII American warship's severed bow found 80 years after being blown off in battle After 80 years, researchers located the bow of USS New Orleans torn off by a Japanese torpedo during a 1942 WWII naval battle that killed over 180 crew members.\nLifestyle July 4 Viral 102-year-old WWII veteran has message about America: 'How lucky we all are' World War II veteran Jake Larson \"Pape Jake\" becomes TikTok sensation at 102, recounting his D-Day experiences and expressing gratitude for American freedom on Independence Day.\nMedia June 28 James Cameron slams 'Oppenheimer' avoiding aftermath of atomic bombings on Japan as 'moral cop-out' Filmmaker James Cameron calls \"Oppenheimer\" a \"moral cop-out\" for avoiding bombing aftermath scenes, as he develops his own Hiroshima film to address the significant omission.\nVIDEO June 22 Israeli official insists Trump acted before US was attacked Israeli strategic affairs minister Ron Dermer makes the case that President Donald Trump did not allow any 'threat to materialize' in his strikes against Iran on 'Life, Liberty & Levin.'\nWorld War Two June 14 Reporter's Notebook: Recalling an American WWII hero who helped fight off Nazi forces during Normandy invasion Eighty-one years after William Owens helped stop Nazi forces in Normandy, the Army posthumously awarded him the Distinguished Service Cross in recognition of his bravery.\nTravel June 12 WWII hero's special memento finally comes home to his family after 80 years A World War II soldier's dog tag is returned to his family 80 years after his death. It was discovered by a metal detectorist on the island where the soldier's plane crashed in 1945.\nVIDEO June 8 D-Day veteran reflects on his survival of multiple World War II battles Fox News chief foreign affairs correspondent Greg Palkot discusses the 81st anniversary of D-Day on ‘America’s Newsroom.’\nWorld War Two June 7 Reporter’s Notebook: Remembering courage on the 81st anniversary of D-Day The 81st D-Day commemoration drew large crowds to honor the 75,000 US troops who fought at Normandy, while centenarian veterans share reflections on their time in combat.\nVIDEO June 7 WWII veterans, Hegseth reflect on legacy of D-Day Fox News senior foreign affairs correspondent Greg Palkot discusses World War II veterans and their return to Normandy to mark the 81st anniversary of D-Day on ‘Special Report.’\nFox News Flash June 7 Defense Secretary Pete Hegseth reveals why military recruitment has soared under Trump Defense Secretary Pete Hegseth highlights historic military recruitment numbers, with the Army alone reaching 61,000 recruits for fiscal year 2025, driven by renewed patriotism.\nWorld War Two June 6 On 81st anniversary of D-Day, one US Navy veteran's son is the first American Pope On the 81st anniversary of the unprecedented D-Day invasion at Normandy, the memory of one Navy veteran lives on after his son was named the first American Pope in history.\nTravel June 5 World War II veterans travel to Normandy for emotional D-Day commemoration The Best Defense Foundation brought 23 former servicemen to Normandy's beaches to mark the 81st anniversary of D-Day this year. Fewer than 67,000 WWII veterans were still alive as of 2024.\nWorld June 4 WWII bombs found in European city force massive evacuation operation Three U.S. World War II bombs found in Cologne defused after prompting the evacuation of 20,000 residents and the closure of hospitals, businesses and transportation routes.\nMedia May 26 Jewish war hero buried in Italy gets right headstone changed 80 years later A Jewish World War II medic killed in action trying to save his comrades and buried beneath a cross had his headstone changed after 80-years-long mistake\nVIDEO May 25 Remembering our fallen heroes this Memorial Day 'The Big Weekend Show' co-host Joey Jones previews his Fox Nation documentary 'Sledgehammer: My Father the WWII hero' and pays tribute to loved ones who served in the military with Fox News anchor Kevin Corke.\nAntisemitism Exposed May 8 Eisenhower’s great-grandson warns Holocaust denial is rising 80 years after WWII in Europe ended Merrill Eisenhower Atwater, great-grandson of President Dwight D. Eisenhower, recently walked from Auschwitz to Birkenau with survivors, urging global vigilance as Holocaust denial grows.\nVIDEO May 7 What to expect in London's 4-day commemoration of 80 years since end of WWII Fox News senior foreign affairs correspondent Greg Palkot has the latest on 'reconciliation' in the British Royal family and previews what to expect in the United Kingdom's commemoration of the end of World War II on 'Fox & Friends.'\nDonald Trump May 2 Trump declares May 8 as 'Victory Day' for World War II: 'Going to start celebrating our victories again!' President Trump announced plans to designate May 8 as World War II \"Victory Day\" and Nov. 11 as World War I \"Victory Day,\" stating that we are \"going to start celebrating our victories again.\"\nRussia April 28 Russia declares 3-day ceasefire in Ukraine for WWII Victory Day Russian President Vladimir Putin declared a three-day ceasefire in the war with Ukraine next month to celebrate the Soviet Union’s victory over Nazi Germany during World War II.\nOpinion April 27 Ike, my great-grandfather, documented Nazi death camps so world would never forget. I’m continuing his mission Eighty years ago, in the final days of World War II, my great-grandfather, Gen. Dwight Eisenhower, walked into a place that changed him forever: the Nazi concentration camp at Ohrdruf.\nPope Francis April 26 Popes who have served the Catholic Church for the past 100 years: Champions of truth, faith and love Pope Francis, Pope John Paul II and Pope Benedict XVI are among the elected bishops of Rome who have led the Catholic Church over the past century.\nTravel April 23 Divers discover vintage car in WWII shipwreck A vintage Ford Super Deluxe car was discovered by divers while exploring the USS Yorktown, which was sunk during World War II in 1942 during the Battle of Midway.\nOpinion April 17 China’s economic woes threaten real war amid tariff battle The top reason countries go to war is economic and President Donald Trump’s tariff battle is now focused on communist China, just as Beijing suffers a host of serious financial challenges.\nWorld War Two April 9 New book reveals untold story of Gen. Wainwright, highest-ranking American POW of World War II Learn the story of Gen. Jonathan Wainwright, who became the highest-ranking American POW during WWII, in Jonathan Horn's newest book, \"The Fate of the Generals.\"\nOpinion April 6 The mission St. John Paul II calls us to fulfill, 20 years after he left us Despite the two decades since his death, John Paul still has a great deal to teach us about human dignity, God’s boundless mercy and the treasures of our faith.\nMedia April 5 James Carville compares law firms, powerful groups cooperating with Trump to Nazi collaborators Democratic strategist James Carville warned that law firms and corporations who cooperate with the Trump administration may be treated like Nazi collaborators."
    },
    {
      "url": "https://www.foxnews.com/us/development-nuclear-bomb-24-times-more-powerful-than-hiroshimas-significantly-ahead-schedule",
      "text": "The development of a nuclear bomb that would be 24 times more powerful than the one dropped on Hiroshima, Japan, during World War II is \"significantly ahead of schedule,\" according to U.S. national security officials.\n\"The National Nuclear Security Administration (NNSA) will complete the First Production Unit of the B61-13, a modern variant of the B61 nuclear gravity bomb, this fiscal year and significantly ahead of schedule,\" an NNSA spokesperson told Fox News.\n\"One of seven warhead modernization programs to ensure the reliability and effectiveness of the U.S. nuclear stockpile, the B61-13 will provide additional options against certain harder and large-area military targets,\" the spokesperson added. \"NNSA accelerated delivery of the weapon by leveraging manufacturing processes from the related B61-12 program, whose final unit was completed in 2024, and implementing a range of technical innovations to optimize production.\"\nSUPPORTERS DEFEND TRUMP’S PICK TO CONTROL AMERICA’S NUCLEAR ARSENAL BEFORE SENATE GRILLING\nThe process for the newest version began in the Biden administration in 2023, and it is now going into full production seven months ahead of schedule. A Department of Defense fact sheet from 2023 said the B61-13 would \"strengthen deterrence of adversaries,\" referring to the 2022 nuclear posture review that observed U.S. adversaries like China and Russia continue to expand their nuclear forces while \"increasing reliance on nuclear weapons.\"\nThe atomic bomb dropped on Hiroshima was about a 15-kiloton bomb. The DoD fact sheet released in October 2023 said the \"B61-13 will have a yield similar to the B61-7, which is higher than that of the B61- 12.\"\nCiting defense officials, the Federation of American Scientists said the B61-7 has a maximum yield of 360 kilotons, making it 24 times more powerful than the bomb dropped on Hiroshima. The B61-13, therefore, would also be 14 times more powerful than the 25-kiloton bomb dropped on Nagasaki.\nSandia National Laboratories, where the new bomb is being developed, said the B61-13 program \"used innovative program planning that resulted in projected delivery seven months earlier than expected, a more than 25% decrease in overall time to first production unit.\" Their statement cited \"a critical challenge and urgent need\" for the acceleration and said the B61-13 \"team reprioritized qualification activities, planned tests with U.S. Air Force stakeholders and jointly completed requirements with Los Alamos National Laboratory and NNSA.\"\nREPUBLICAN LAWMAKER SAYS ENERGY 'UNDERPINS EVERYTHING WE DO'\n\"Their creativity in system qualification put an aggressive set of plans in motion to meet stakeholder expectations,\" Sandia National Laboratories said.\nThe statement comes a day after President Donald Trump's nominee for NNSA administration, former Rep. Brandon Williams, faced off with senators during his confirmation hearing.\nWilliams notably testified that he would not advise the resumption of nuclear detonation tests last conducted in the United States in 1992. He said the ultimate decision would be \"above my paygrade\" but that he would not recommend tests and instead preferred to rely on \"scientific information,\" such as computer modeling done at NNSA laboratories based on data gathered from nonnuclear detonation tests.\nCLICK HERE TO GET THE FOX NEWS APP\nHis response came during a line of questioning by Sen. Jacky Rosen, D-Nev., who cited how \"millions of people and acres of land were contaminated by radiation\" during nuclear detonation testing conducted in her home state during the Cold War."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/travel/general/theme-parks",
      "text": "Travel 1 day ago Dollywood tops Disney parks in best amusement park rankings survey A Tripadvisor survey ranked America's best amusement parks based on millions of reviews, with Dollywood in Tennessee claiming the top spot ahead of Disney parks. Check out the details.\nWorld 6 days ago Amusement park ride snaps at Saudi Arabia park, with 23 reported injured Ride arm carrying passengers breaks off mainframe at Saudi Arabia amusement park, leaving 23 injured including three in critical condition.\nPennsylvania July 25 9-year-old dies at Hersheypark's The Boardwalk water park: 'Our deepest condolences' A 9-year-old child died on Thursday after visiting Hersheypark’s The Boardwalk water park in Hershey, Pennsylvania, according to the company.\nTheme Parks July 24 'Tilt' roller coaster at Cedar Point malfunctions for 3rd time since opening, leaving riders suspended in air Visitors at the Cedar Point theme park in Sandusky, Ohio, got stuck on the \"Siren's Curse\" roller coaster.\nChina June 3 Disneyland China visitors caught on camera brawling over apparent line-cutting dispute Two couples reportedly clashed at Shanghai Disneyland's Crazy Animal City attraction over line cutting, leading to a brawl that shocked onlookers.\nVIDEO May 28 Fox Business Briefs 5/28 Ford recalls over 1 million U.S. vehicles over rearview camera issue; Jeep-maker Stellantis names America boss as CEO; Macy’s cuts profit outlook; Dollywood crowned 'favorite theme park' in 2024.\nTravel May 18 Abandoned 'Wild West' theme park frozen in time shocks visitor: 'Left to rot' The eerie remains of two abandoned theme parks still stand in remote regions of Japan. They were discovered and documented by explorer Lukka Bradburn; see the pictures.\nVIDEO May 7 Florida father reveals shocking cost of Disney day trip Small business owner and father of three Craig Stowell joins 'Fox & Friends' to discuss his recent viral video detailing the cost of a Disney day trip.\nUS Fires April 4 SUV catches fire at Disneyland, black smoke sent drifting over parking structure A car caught fire at a Disneyland parking structure on Friday before it was extinguished, but no one was injured, authorities told Fox News Digital.\nCrime March 29 Disney failed to protect guests from employee taking ‘upskirt’ photos, lawsuit alleges A new lawsuit alleges that Disney failed to protect guests from employee taking \"upskirt\" photos of guests at its Florida theme park in 2023.\nCalifornia March 23 California stuntman crashes to the ground as human cannonball act goes horribly wrong, video shows A world-renowned stuntman is recovering after his human cannonball stunt took a horrifying turn when a gust of wind knocked him off course in front of onlookers at a California fair.\nFlorida March 20 Orlando ride maintenance tech alleges safety issues were ignored before teen fell to his death in 2022: suit A former maintenance tech for the now-closed FreeFall ride at ICON Park in Orlando filed a lawsuit alleging safety issues were ignored in the weeks before Tyre Sampson's 2022 death.\nTravel February 15 Disney's 'It's a Small World' ride to get new song lyrics The \"It's a Small World\" ride at Disneyland in Anaheim, California, will debut a new set of song lyrics in July 2025. The song was first released in 1964.\nTheme Parks February 8 Disneyland, Universal Studios Hollywood, offering free tickets to firefighters Two Southern California theme parks are offering free tickets as a thank you to those who fought the recent wildfires that devastated parts of Los Angeles and the surrounding area.\nHotels January 14 Malaysia is home to the world's largest hotel, with over 7K rooms for guests The Guinness World Record for the largest hotel by number of rooms goes to First World Hotel in Malaysia. The hotel boasts over 7,000 hotel rooms for guests to lounge in.\nUS Crime January 13 Fired Disney World employee pleads guilty to hacking menu, removing life-saving allergy information A former Disney World employee changed menus to falsely indicate that food items didn't contain deadly allergens like peanuts, authorities said.\nTheme Parks November 19 Riders caught on camera stuck in midair on California amusement park ride Knott's Berry Farm officials said that several riders got stuck on one of theme park’s rides for over two hours Monday afternoon.\nTheme Parks November 14 Six Flags shuts down Kingda Ka roller coaster as fans sound off: 'Heartbreaking and insulting' Kingda Ka, the world's tallest roller coaster, will be demolished in the near future, New Jersey's Six Flags Great Adventure announced. Fans took to social media to react to the news.\nTravel November 12 Virginia amusement park to open 'world's tallest and longest launched wing' roller coaster Kings Dominion Amusement Park in Doswell, Virginia, has announced it will open the \"world's tallest and longest launched winged\" roller coaster in 2025. The ride will travel 65 mph.\nWorld October 29 10 injured after cars on giant pendulum ride break apart midair, horrifying video shows Frightening video shows the moment two gondola cars detach from a thrill-seeking amusement park ride and crash, leaving ten people injured, six critically.\nVIDEO October 29 Terrifying video shows moment cars break off on amusement park ride injuring 10 A frightening video shows the moment gondolas on an amusement park ride break off, injuring 10. (Credit: Jam Press Vid)\nTRAVEL October 17 Universal Orlando announces opening date for its newest theme park Epic Universe, the newest theme park at Universal Orlando Resort in Orlando, Florida, will open in 2025. The park will include Super Nintendo World and Harry Potter's Ministry of Magic.\nFOOD October 4 Halloween Horror Nights event offers 5 frightful foods and a chilling drink: 'Viral sensation' Halloween Horror Nights is back at the Universal theme parks on both coasts - and with the haunted houses come some delightfully spooky new food and drink options.\nCRIME September 26 Police say woman with 2 children arrested at Disneyland after not paying for tickets is a repeat offender The mother of two arrested at Disneyland this week was uncooperative and refused to comply with requests to provide her identification, authorities said.\nDisney September 26 Woman arrested at Disneyland for failing to show ID: video A woman was arrested at Disneyland in Anaheim, California, after she allegedly failed to show her ID to park security and did not buy tickets for her children.\nVIDEO September 26 Woman arrested at Disneyland after failing to show valid ID A woman accompanied by two young children was arrested at Disneyland in Anaheim, California after she failed to show park officials a valid ID. (Tiktok/ @diz.tok)\nTheme Parks September 24 Kings Dominion Halloween Haunt event breaks down into ‘mass chaos’ as teens brawl, police say The Halloween Haunt event at the Kings Dominion theme park in Virginia erupted into \"mass chaos\" this past weekend as teens began fighting, police say.\nCalifornia September 23 Universal Studios unleashes first all-female Halloween haunted house to counter 'male-centric' genre Universal Studios Hollywood featured its first all-female monster maze as part of the park's annual Halloween Horror Nights event from September to October.\nOregon September 20 Oregon amusement park files lawsuit against ride manufacturer after it leaves guests hanging upside down After dozens of riders at an Oregon amusement park were left hanging upside down, two lawsuits were brought against the theme park and the ride manufacturer.\nTRAVEL September 19 Cedar Point theme park unveils record-breaking 'tilt' roller coaster for 2025 Cedar Point, a theme park in Sandusky, Ohio, is set to open \"Siren's Curse,\" its 19th roller coaster, in 2025. The ride will be the longest and fastest of its kind in North America."
    },
    {
      "url": "https://www.foxnews.com/politics/california-beach-resist-protest-pushes-kindness-while-calling-86-47-anti-trump-message",
      "text": "Nearly 1,000 people gathered at Main Beach in Santa Cruz, California, on Saturday for a Pride Month protest aimed squarely at President Donald Trump.\nParticipants formed a massive human banner that spelled out \"Resist!\" in rainbow colors as part of a demonstration organized by Indivisible Santa Cruz County.\nThe 220-foot-wide display, with letters reaching 70 feet high, was designed by longtime left-wing activist Brad Newsham.\nOrganizers described the event as a peaceful act of resistance and a show of solidarity with the LGBTQ+ community.\nSEATTLE MAYOR ACCUSED OF LYING AFTER BLAMING CHRISTIAN RALLY FOR PARK VIOLENCE\n\"It’s very important, the more people [who] can show our neighbors, our politicians in the world, that nonviolent resistance is the way to express our dissatisfaction with the way our country’s going,\" said event organizer Becca Moeller to Lookout Santa Cruz.\nBut just above the colorful banner was a very different kind of message: \"86 47,\" a phrase many interpreted as a call to \"get rid of\" the 47th President of the United States.\nIn slang, \"86\" typically means to cancel, eliminate, or even destroy. Combined with \"47,\" the number now associated with President Trump’s second term, the phrase has raised alarms among critics who say it crossed a line.\nEarlier this month, former FBI Chief James Comey posted a similar message in the sand, but instead of kelp, they were shells. He has since removed the post after widespread criticism and action by law enforcement.\n\"We don’t need a king. We want to go back to the way we were. We want to make America kind again,\" said protester Beth Basilius to Lookout Santa Cruz.\nWhile the event promoted \"kindness\" and inclusivity, the imagery told a more conflicted story.\n\"They claim they want to make America ‘kind’ again, but then they spell out ‘86 47’ in the sand. That’s not kindness — that’s a coded call to eliminate someone they disagree with. It’s hypocritical,\" said Mike LeLieur, chair of the Santa Cruz County Republican Party to Fox News Digital.\nLeLieur said local conservatives face growing hostility from the political left.\n\"We’ve had vehicles vandalized, tires slashed, and windows broken. I was forced off the road and attacked just for having a Trump sticker. At our State of the Union watch party, we were swarmed by angry protesters. It’s been nonstop hostility — and these are the same people who call themselves the ‘Party of Peace.’\"\nJust 8.5% of voters in the city of Santa Cruz are registered Republicans, according to the most recent data from the California Secretary of State.\nSupporters of the protest claimed that \"86 47\" was a symbolic rejection of Trump’s agenda, not a literal threat. But critics say that argument falls flat in a political climate where coded language carries real-world consequences.\n\"In California — and especially in Santa Cruz County — the left is creating a political environment of non-acceptance and persecution,\" said Daniel Enriquez, a representative of the California Republican Assembly. \"It’s consistent with the goals of socialist movements throughout history.\"\nJenny Evans, co-leader of Indivisible Santa Cruz County, defended the event.\n\"When a great number of people come out to do something like this, it just is one more thing to show that we’re not all saying, ‘Fine, fine. We’ll go along with whatever you want,’\" she said to Lookout Santa Cruz.\nThe event was also part of Santa Cruz’s 50th Pride celebration. Participants were instructed to dress in matching rainbow colors, coordinated with fabric laid out across the beach starting at 7 a.m.\nThe protest was peaceful, but critics say calling for kindness while displaying \"86 47\" sent a message that was anything but.\nCLICK HERE TO GET THE FOX NEWS APP\nIndivisible Santa Cruz County did not immediately respond to Fox News Digital's request for comment."
    },
    {
      "url": "https://www.foxnews.com/category/politics/defense/wars",
      "text": "Donald Trump 18 hours ago Trump open to meet Putin face-to-face next week followed by three-way talks with Ukraine's Zelenskyy Trump schedules back-to-back diplomatic meetings with Russia's Putin and Ukraine's Zelenskyy in coming weeks according to Fox News reports.\nVIDEO 1 day ago Israeli pleads for release of brother held hostage by Hamas in Gaza Ilay David joins ‘Fox & Friends’ to call for the release of his brother, Evyatar David, who has been held and starved by Hamas in Gaza since the October 7th terror attacks on Israel.\nVIDEO 1 day ago Fox News gets rare access inside a Gaza aid center 'America's Newsroom' co-anchor Bill Hemmer details the effort of the Trump administration to distribute food in Gaza from Sderot, Southern Israel.\nWorld 1 day ago Fox News gets inside look at Gaza humanitarian situation as Israel weighs next steps Fox News was given an inside look at an aid site run by the Gaza Humanitarian Foundation as the organization faces fierce international backlash.\nVIDEO 2 days ago Trump will not submit to Putin's 'psychological warfare' like Biden did: Gen. Jack Keane Fox News senior strategic analyst Gen. Jack Keane (ret.) discusses President Donald Trump deploying two nuclear submarines near Russia on 'America's Newsroom.'\nVIDEO July 29 Trump touts foreign policy wins during Scotland golf course visit: 'Stopped about five wars' President Donald Trump said during a visit to his gold course in Aberdeen, Scotland, that he \"stopped about five wars\" and would soon return to Washington, D.C., because that's \"much more important than playing golf.\"\nOpinion July 26 Obama and Democrats don’t get it: Masculinity is not the problem. Erasing it is The political impact of challenging masculinity, as male voters abandon the Democratic party following rhetoric that questions men's roles as providers and protectors.\nVIDEO July 25 Russia-Ukraine 'momentum shift' is taking place despite major challenges: Gen. Jack Keane Fox News senior strategic analyst Gen. Jack Keane explains why Russia seems to have no interest in a ceasefire with Ukraine on 'Fox & Friends.'\nIran July 8 Iran says it can strike the US and Israel for two years. Does it really have that power? Despite setbacks to its missile program, Iran remains the largest ballistic missile power in the Middle East, with proxies like the Houthis posing regional threats.\nUkraine July 8 US will 'have to' send weapons to Ukraine, Trump says days after Pentagon pause President Donald Trump said the U.S. would be sending defensive weapons to Ukraine so it could defend itself from Russia’s ongoing invasion, days after the Pentagon said it was pausing such deliveries.\nVIDEO July 8 Trump says US must send more weapons to Ukraine, days after Pentagon pause President Donald Trump says the U.S. will have to send more weapons to Ukraine, just days after Pentagon paused critical weapons deliveries to Kyiv.\nOpinion July 6 The unwinnable war America's Founding Fathers fought and won changed human history forever The Declaration of Independence is a revolutionary document that transformed governance from monarchy to democracy and established that all people are created equal.\nMedia July 4 Liberal pundit says US is the 'bad guy on world stage,' should face international sanctions like North Korea Elie Mystal argued the US should face international sanctions like those imposed on \"rogue states,\" criticizing President Trump's airstrikes while ignoring the subsequent ceasefire agreement.\nMedia July 1 Taylor Lorenz mocked by Piers Morgan panel after she defends band's 'Death to the IDF' chant Taylor Lorenz was ridiculed on Piers Morgan's show after she defended UK band Bob Vylan's \"Death to the IDF\" chant as a protest and not a call for violence.\nMedia June 30 Far-left actor John Cusack says Iran 'should get' nukes to protect Middle East from US and Israel Anti-Israel and anti-Trump actor John Cusack called for Iran to obtain nuclear weapons following U.S. strikes, saying it's the only way to defend the Middle East.\nDonald Trump June 27 Trump touts administration’s progress on peace deals, says world leaders ‘respect our country again’ President Donald Trump predicted there will be a ceasefire in Gaza sometime \"within the next week\" and touted the administration's success achieving peace through strength.\nIsrael June 25 NY lawmakers call on Hochul to aid Jews stranded in Israel after DeSantis facilitates rescue flights Senate Republicans call on Governor Hochul to evacuate New Yorkers from Israel, highlighting New York's significant Jewish population and responsibility to act\nOpinion June 25 The Israeli-Iranian war is not over—it has just entered a dangerous pause Israel and Iran still maintain their strategic objectives despite a formal ceasefire, with nuclear ambitions and proxy networks ensuring the conflict has merely shifted forms\nVIDEO June 24 Sean Hannity: Where were Dems when these presidents all ordered strikes without congressional approval? Fox News host Sean Hannity debunks the liberal media's lie that President Donald Trump defied the Constitution by striking Iranian nuclear sites on 'Hannity.'\nOpinion June 24 SEN. BERNIE SANDERS: America must not go to war with Iran The United States cannot get involved with Iran. We must learn our lessons from Vietnam and Iraq. Trump's Iran strikes and Netanyahu's influence on American policy must be checked.\nVIDEO June 23 Iran's military would rather 'die a martyr' than take this route, Israeli activist says Journalist Emily Austin outlines what retaliation to expect from Iran's military following strikes to their nuclear facilities on 'Fox News @ Night.'\nVIDEO June 23 Middle East countries await Iran's next move after strikes to its nuclear program Fox News chief national security correspondent Jennifer Griffin has the latest on how Iran is retaliating against 'Operation Midnight Hammer' on 'Special Report.'\nVIDEO June 23 Iranian regime has a 'strategic dilemma,' former Trump envoy says Former State Department deputy special envoy Ellie Cohanim breaks down what she calls the Iranian regime's 'strategic mistake' on 'America Reports.'\nIran June 23 Bush's War on Terror vs Trump's Iran approach: How US Middle East strategy evolved Middle East policy shifted from Bush-era interventions to Trump's approach, with Israel acting against Iran's nuclear program while EU-3 negotiation methods falter.\nVIDEO June 23 Explosive footage shows Israeli strike on infamous Iranian prison An Israeli strike hit Tehran’s Evin Prison on June 23. The site has been used to house dissidents and political prisoners. (Storyful)\nVIDEO June 22 Israeli official insists Trump acted before US was attacked Israeli strategic affairs minister Ron Dermer makes the case that President Donald Trump did not allow any 'threat to materialize' in his strikes against Iran on 'Life, Liberty & Levin.'\nPolice and Law Enforcement June 22 Los Angeles County Sheriff's Department forced to backtrack after bizarre condolences for US strike on Iran The Los Angeles County Sheriff's Department deleted a bizarre X post expressing condolences for Iran after the U.S. attacked several of its key nuclear sites.\nVIDEO June 22 America's 'long and winding' road to attacking Iran Fox News correspondent Gillian Turner examines how decades of diplomatic tensions with Iran led to U.S. airstrikes.\nVIDEO June 22 Inside US military's precision strike on Iranian nuclear sites Former U.S. Navy intelligence officer Capt. Todd Sawhill analyzes President Donald Trump's 'coordinated' attacks on three Iranian nuclear facilities.\nVIDEO June 22 Operation Midnight Hammer: How the US used deception to attack Iran Fox News correspondent Lucas Tomlinson shows how the United States used the element of surprise to strike Iran on 'Special Report.'"
    }
  ],
  "argos_summary": "A protest at Disneyland's \"It's a Small World\" attraction featured a doll holding a sign reading \"Remember Hiroshima,\" which sparked online speculation. The stunt was orchestrated by Ben Cohen, co-founder of Ben & Jerry's, as part of his \"Up in Arms\" campaign against U.S. military spending and the ongoing war in Gaza. Cohen criticized the U.S. government's military budget, calling it a bipartisan issue and emphasizing the need to remember the consequences of nuclear warfare.",
  "argos_id": "REZEZJQDR"
}