{
  "url": "https://finance.yahoo.com/news/ocean-city-maryland-bids-farewell-142900953.html",
  "authorsByline": "Ocean City Maryland Tourism",
  "articleId": "e6d0a40f10644750ab6e00e9b1959eb8",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/qwifUC2MlFku5Q_SF4qluA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01MzQ7Y2Y9d2VicA--/https://media.zenfs.com/en/globenewswire.com/556dd27a769b7a5e5fdbb1a0ffe9fecb",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T14:29:00+00:00",
  "addDate": "2025-08-07T14:39:02.091998+00:00",
  "refreshDate": "2025-08-07T14:39:02.092001+00:00",
  "score": 1.0,
  "title": "Ocean City, Maryland Bids Farewell to Summer with Travel Deals and Events",
  "description": "‘Summer Send Off’ programming to celebrate the end of summer with an open-air celebration and lodging discounts, welcoming visitors to book late-August stays Ocean City, Maryland Celebrates the End of Summer Visitors can take advantage of travel deals when they book their late-August stays Ocean City, Maryland, Aug. 07, 2025 (GLOBE NEWSWIRE) -- Today, Ocean City, Maryland (OCMD) announced a variety of end of summer travel and lodging deals, as well as an inaugural Summer Sendoff event that will",
  "content": "‘Summer Send Off’ programming to celebrate the end of summer with an open-air celebration and lodging discounts, welcoming visitors to book late-August stays\n\nOcean City, Maryland, Aug. 07, 2025 (GLOBE NEWSWIRE) -- Today, Ocean City, Maryland (OCMD) announced a variety of end of summer travel and lodging deals, as well as an inaugural Summer Sendoff event that will occur from August 21-24. The beloved East Coast beach town is providing visitors one last chance to experience the joy and bliss of summer in Ocean City.\n\nThe Summer Send Off will be four full days of fun throughout the town, with the main events taking place as weather permits. Guests can expect a spectacular display and a celebration like no other. Glowing hot air balloons will light up the boardwalk, giant kites will be dancing in the sky and laser beams will play across the balloons. The fun doesn't end there, families can enjoy live music and ice cream over the weekend at Sundaes in the Park.\n\nSelect hotels are offering deals and specials for guests booking their late-August getaways. All deals below, excluding the Marriott, are redeemable from August 5-24, 2025.\n• SeaLoft Oceanfront Hotel: Take advantage of 30% off a three-night stay from August 21-24.\n• Residence Inn - Marriott: The Marriott is offering an Endless Summer Escape package. Guests that book a stay from August 22-24 can take advantage of a $349 rate, with the possibility of adding on weekdays for $199. This deal is redeemable August 5-18.\n• Princess Royal Oceanfront Resort: Enjoy 15% off when you extend your stay to three or four nights.\n• Hotel Monte Carlo and Monte Carlo Boardwalk: Guests can enjoy two free drinks at the rooftop bar overlooking the festivities when they use the booking code: SSO.\n• Beach Bum: Stay in beautiful West Ocean City and enjoy 15% off a three-night stay and 20% off a four-night stay.\n\n“We are excited to close out a magical summer and provide families and visitors with a fun and exciting final celebration. We also want to give back to our visitors and provide them with some discounts and deals, so they have the opportunity to experience summer in Ocean City before the season ends.” said Tom Perlozzo, Director of Tourism and Business Development for Ocean City Maryland Tourism. “From glowing hot air balloons to free music in the park, there is something for every family and traveler at our Summer Send Off.”\n\nTo learn more about the Summer Sendoff and Ocean City’s summer deals, visit the following website: Summer Sendoff .\n\n### \n\nAbout Ocean City, Maryland: \n\nLocated along Maryland’s coast in Worcester County, Ocean City OCMD stretches along 10 miles of beach from the Inlet to the Delaware state line. Awarded as one of TripAdvisor’s Top 10 Beaches and “One of America's Cleanest, Greenest Beach Communities,” it claims distinct neighborhoods - Downtown, Midtown and Uptown - each with a charm and offering all its own. In addition to its beaches, OC offers a famous 3-mile boardwalk, numerous amusement parks, 17 national championship golf courses, 200+ restaurants and the Roland E. Powell Convention Center. Accommodations include more than 10,000 hotel rooms from major hotel chains to quaint, locally owned gems and 21,000 rentable condominiums. The convenient resort town, by car, is within five hours of New York and Richmond, and less than three hours from Baltimore, Washington, D.C., and Philadelphia and, by air, the Salisbury/Ocean City Regional Airport is just 30 minutes from OC. To learn more and start planning your trip visit, ococean.com.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=hU3Jur9kq8E1xcjf0Isg20rVEgehO4g-eb-GrGasYpFCJOLCQ6KHWU34e8v4AG58L8v5fQMTMl5VMr4e5hPvoe4Q1CZp5UumI3C3vpXCesMkAZeVq8T8aireV_SgxXZi60VgOQ3u2vn-TeNE2Z3p8LvDlzQCYLmjcfGdeFYmojY=",
    "https://www.globenewswire.com/Tracker?data=XiPQR2LoIgxi6-4MiOGGNJAkQZw_hOdZpGIENbsbonzHw8nYJiAtGqSt5bPk0GIWvDH_mYWBrNXCeZAUsG_-Cw==",
    "https://www.globenewswire.com/Tracker?data=zcrIpuTU9GU5Yd_ysNuJfbufje6hJgtcNrlQ2uAsBR_zmXQ5nV5uWRxGZM2uS8c2VsMHAeyA_raYHPF0UpY4EKO_gJwcqldEWBppOF9Q3m2UtF0Ra42MjN6qrgc8mPp45GKDcJxAVovuDrS-WREAFZRmbZTEaG7RYmqdxGXmFUfxOZjqNyWur3JzTTskorEx",
    "https://www.globenewswire.com/Tracker?data=kK8npGWKpzxzYHYFFVIoHEWPSh2L3fpMaFIA_Ga_Iwhpr6IHjrB64ahQsXPHeeODmOiGysqgaFs4If88Ym-blbUeTcxaEx0zrQLMLMz2XMRn7U_EWwbApQFauJJqUdDkVzhZbO-1l7TaVMRjNQ7pOg==",
    "https://www.globenewswire.com/Tracker?data=gg7mYf0jO_bPprWb7-74jdEN1iGX7_-qcVlC8ov5kCS5IW71zRMOhMNr1Dm_HVbQ7xOmu6Q_Q0_sYhupvg3HFKNnx7J4WImGB8Pu_U5JOsrFxtsXG33rUkaeZFcfPdeR",
    "https://www.globenewswire.com/Tracker?data=gg7mYf0jO_bPprWb7-74jbmSLnWhzG2WI5ThNNYBHa5X6gos5w7aN3Wlv7vfU4sClN18w0Rz4H8pE9HjS4PlkPbDh-DoXZzuwQ9VLWFpo03-cwGW0-m1-KNXwlnuGHk5",
    "https://www.globenewswire.com/Tracker?data=s5ak6gu22qKgOW8APcv4nct3E3-iXFtIDzdA5G9E_n7l6dbudt14aKCoDD99rx95vR7t18Bf3IRiq1nTw3ahdJorP8nAJabeYx_FtKM-NhQBTv3W3AQ_gyWaqkW8-nUaAzHgP2TEMKcOvAMtyu10T-0YmE8qt_D5kN2tNqBZP5fI9jPxU6zVGA9eofTvXghEqlfFcIHsvuNMjf9dlhdOhw==",
    "https://www.globenewswire.com/Tracker?data=2OBDluiEu0INInkLJ_5Tb4GwAdqmnD7nbbxLEUtQKmEv-P0-5eB9eEdK-KFIsQ0agxHYJ0hDQS-S9Yn9PxXg7UcsuZsFFU821PU7yY8ntZaez-4Q_cJLQwOzzo-pgCV1_Im6AEJytdf8MoRHLdSfT61holWkALb0tltZbJp60l4=",
    "https://www.globenewswire.com/Tracker?data=y6bNvF2OCeA2YFhmsGAwVfhp3KxE7-BrqADfH3GBb_uZCraKkqS4olCzq5YIbXYzZMfpZalUVFPgjK-ReSueFb5P7u7kLTSVVmXuPVnNoU0=",
    "https://www.globenewswire.com/Tracker?data=3aQ14eu6B1pWT3Cpqs3tetb90kpYC5A2nKqwTxJRga7gJDXH8b6_JCRyzt6Stsc2ti67GBoMkyUHDdnLNCvA3cjQFfo9twt63zqU8SYX-u_geTJFZCBHsMYRqFGhL4AawctINGvQEjq_YlsUTcJ7kA==",
    "https://www.globenewswire.com/Tracker?data=gmz6Lqzfx7t_QqDdVSr-gzVV9rJyGKwmu90bYh4SwOYi2eBQETbx7-zGDfDWqv3zeAUUvWiTVjkDLsWrKjgC0hubu7K9uiWu-9w8XLk1NLb3Fh9ZTsf37EX62th4CKBnPOzD1YswxgJa8AC3pmbTyIUmGaoEM2BDFMPcGzqA7ICw2wnt-qdADFidBhBN4Yus"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ocean City",
      "weight": 0.10115716
    },
    {
      "name": "Ocean City Maryland Tourism",
      "weight": 0.10005443
    },
    {
      "name": "Ocean City OCMD",
      "weight": 0.09848738
    },
    {
      "name": "West Ocean City",
      "weight": 0.096378215
    },
    {
      "name": "beautiful West Ocean City",
      "weight": 0.09223844
    },
    {
      "name": "Ocean City’s summer deals",
      "weight": 0.071085975
    },
    {
      "name": "Summer Sendoff",
      "weight": 0.06929678
    },
    {
      "name": "Travel Deals",
      "weight": 0.06688075
    },
    {
      "name": "Glowing hot air balloons",
      "weight": 0.06479057
    },
    {
      "name": "glowing hot air balloons",
      "weight": 0.06479057
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.9111328125
    },
    {
      "name": "/Travel & Transportation/Travel Guides & Travelogues",
      "score": 0.7890625
    },
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.57861328125
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.47265625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Beaches & Islands",
      "score": 0.431396484375
    },
    {
      "name": "/News/Local News",
      "score": 0.42626953125
    },
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.3583984375
    },
    {
      "name": "/Travel & Transportation/Hotels & Accommodations/Other",
      "score": 0.327392578125
    }
  ],
  "sentiment": {
    "positive": 0.43603516,
    "negative": 0.06341553,
    "neutral": 0.50097656
  },
  "summary": "Ocean City, Maryland, has announced a series of travel and lodging deals, including an inaugural Summer Sendoff event from August 21-24. The event will be held throughout the town, featuring a spectacular display of hot air balloons, giant kites dancing in the sky, and laser beams playing across the balloons. Additionally, guests can enjoy live music and ice cream over the weekend at Sundaes in the Park. Select hotels are offering deals and specials for guests booking late-August stays. All deals are redeemable from August 5-24, 2025.",
  "shortSummary": "Ocean City, Maryland, is celebrating the end of summer with numerous travel deals and events, including the inaugural Summer Sendoff event on August 21-24.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "42fce0c674bb4ae9a91702b345a56556",
  "places": [
    {
      "osmId": "13299347",
      "city": "Ocean City",
      "county": "Worcester County",
      "state": "Maryland",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 38.3348728,
        "lon": -75.0847659
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=gg7mYf0jO_bPprWb7-74jdEN1iGX7_-qcVlC8ov5kCS5IW71zRMOhMNr1Dm_HVbQ7xOmu6Q_Q0_sYhupvg3HFKNnx7J4WImGB8Pu_U5JOsrFxtsXG33rUkaeZFcfPdeR",
      "text": "Summer Send Off Endless Summer Escape! Residence Inn by Marriott\nOur summer send off package is called Endless Summer Escape. It includes rates of $349 for…\nYour browser is not supported for this experience.\nWe recommend using Chrome, Firefox, Edge, or Safari.\nExperience an event unlike any other at the Summer Send Off! The spectacular display will feature glowing hot air balloons, a high-energy laser show, and giant kites dancing above the sand. Enjoy the celebration as we bid summer farewell with this exciting open air event!\nWhile we're planning for four days of fun all throughout town, the main event will take place on two days during the weekend, weather dependent.\nWhere: On the beach from Dorchester Street to 3rd Street\nWhen: Two days between August 21-24 (chosen dates are weather dependent)\nExplore all of the options below!\nOur summer send off package is called Endless Summer Escape. It includes rates of $349 for…\nStay Longer and Save - 15% off BAR *maximum of 4 nights, minimum of 3 nights* Changes to length…\nMonte Carlo Summer Send Off •Includes two beverage vouchers per adult for the rooftop bar at…\n30% off a 3-night stay 8/21 through 8/24\nPackage title and description: Monte Carlo Summer Send Off •Includes two beverage vouchers per…\nSummer Send-Off: Select a room or cabin at West Ocean City's best kept secret- Beach Bum…\nDepending on wind conditions, you’ll see either massive, colorful kites fill the air, OR tethered hot air balloons create a breathtaking skyline. Wind speed and safety will determine which display is activated on event day.\nStay tuned closer to the event for specific information.\nEight Hot Air Balloons. One Unforgettable Backdrop.\nEnjoy the magic of eight hot air balloons lighting up the Boardwalk! The event will feature four whimsical, special shape balloons and four traditional teardrop styles tethered & illuminated. This static glow experience offers a rare chance to see the full-on glow of tall and radiant hot air balloons up close!\nPlease note: This event will not include hot air balloon rides; it is a viewing experience.\nWhimsical Shapes Soaring High Above the Sand\nGlance toward the sky to take in the view of a giant kite exhibition! Just north of the balloon display, ten massive \"monster show kites\" will add a fun spectacle to the beach.\nA Sky Full of Light, Music, and Movement\nEach night from 9-10pm, a laser show will fill the sky with movement. Beams will also play across the balloons, creating a high-energy contrast to the stillness of the balloon glow. It’s a one-hour show, built to be seen from the sand! Bring your beach chairs!\nThe fun doesn't stop there! All weekend long, enjoy fun activities with family entertainment and popular events like Sundaes in the Park.\nSunset Park, S. Division St. & The Bay | 7 - 9 pm\nJoin us for unforgettable evening of music and sunset views at Sunset Park Party Nights! Enjoy an epic free concert from Full Circle as you're treated to a stunning sunset over the Isle of Wight Bay.\nNorthside Park, 125th St. & The Bay | 7 - 9 pm\nEnjoy a family concert with music from The Mashup! Children are offered various free activities and entertainment. Ice cream available for purchase! Stay until nightfall to enjoy FIREWORKS!"
    },
    {
      "url": "https://www.globenewswire.com/Tracker?data=XiPQR2LoIgxi6-4MiOGGNJAkQZw_hOdZpGIENbsbonzHw8nYJiAtGqSt5bPk0GIWvDH_mYWBrNXCeZAUsG_-Cw==",
      "text": "The Official Website\nOcean City, Maryland\nThe summer is here in Ocean City, Maryland, where 10 miles of clean, sparkling beaches meet the peaceful charm of the Assawoman Bay. As we enjoy longer nights and warm summer breezes, our beloved beach town comes alive with exciting events and seasonal celebrations. With a wide variety of accommodations, the summer is the perfect time to rediscover our golden sands, friendly atmosphere, and the simple joys of a day at the beach. Whether you're looking for a quiet, relaxing getaway, a fun-filled family adventure, or you're here on business, Ocean City’s natural beauty and local, small town charm make it a must-visit this summer. So, pack your flip flops and come see why Ocean City is Somewhere to Smile About!\nAugust 21-24 | Summer Send Off\nExperience an event unlike any other at the Summer Send Off!\nThe spectacular display will feature glowing hot air balloons, a high-energy laser show, and giant kites dancing above the sand. Enjoy the celebration as we bid summer farewell with this exciting open air event! And while you're here, enjoy fun activities with family entertainment and popular events happening all around town.\nUpcoming Events\nSunset Park Party Nights\nJoin us for unforgettable evenings of music and sunset views at Sunset…\nAll About Sharks - Free Summer Program at OCLSSM\n- OC Life-Saving Station Museum\nSeptember 6 | Northside Park\nJoin us on September 6, 2025, at Northside Park for a delectable waterfront experience featuring top Maryland restaurants, live music, and more! Kids 16 and under are free!\nTop\n5\nTrip Ideas For The Season\nCuisine Scene: OC's Newest Hot Spots\nNew Hot Spots With the Best Cuisines Ocean City in 2025 is serving up some…\nTravel Itinerary: A Guide for the Fitness Guru\nIf your idea of a perfect vacation includes breaking a sweat and soaking up the…\nOcean City’s Top 10 Upcoming Events\nFrom world-famous fishing tournaments to hot air balloon glows, live concerts to…\nWe Asked, You Answered: The Best Beach Bars and Nightlife in Ocean City\nOcean City, Maryland is known for its gorgeous beaches and sunshine-soaked…\nMid-Week Stays to Smile About in Ocean City\nLooking for the perfect time to visit Ocean City without the weekend crowds?…\nFun For Every Season\nBiking\nBiking in Ocean City, MD offers a picturesque and exhilarating…\nArts & Culture\nTake a break from the beach and enjoy our theater, music and…\nAmusement & Water Parks\nWhether you have kids or you’re just a kid at heart…\nSurfing\nWith its pristine shorelines, surfing in Ocean City is…\nFishing\nWant to put your angling skills to the test? Or maybe you just…\nGolf\nBecause OCMD boasts 17 championship courses designed by the legends of…\nKayaking, Canoeing, & SUP\nOcean City, Maryland kayak rentals are a great way to see one…\nEvents & Tickets\nView upcoming events at the Performing Arts Center.\nShop, Relax, Repeat!\nWhether you are window shopping, picking out a souvenir to bring back…\nIndoor Activities\nLooking for things to do in Ocean City, Maryland when it…\nNovember 22 | Roland E. Powell Convention Center\nFeaturing the Forever Young Tour with Vanilla Ice, Treach of Naughty by Nature, Rob Base, Color Me Badd, O-Town, Ryan Cabrera, LFO, and Young MC, hosted by Chris Kirkpatrick of *NSYNC, and 70's Soul Jam featuring The Spinners, The Legendary Blue Notes, and William Hart's Delfonics, hosted by Jimmie \"JJ\" Walker!"
    },
    {
      "url": "https://www.globenewswire.com/Tracker?data=y6bNvF2OCeA2YFhmsGAwVfhp3KxE7-BrqADfH3GBb_uZCraKkqS4olCzq5YIbXYzZMfpZalUVFPgjK-ReSueFb5P7u7kLTSVVmXuPVnNoU0=",
      "text": "The Official Website\nOcean City, Maryland\nThe summer is here in Ocean City, Maryland, where 10 miles of clean, sparkling beaches meet the peaceful charm of the Assawoman Bay. As we enjoy longer nights and warm summer breezes, our beloved beach town comes alive with exciting events and seasonal celebrations. With a wide variety of accommodations, the summer is the perfect time to rediscover our golden sands, friendly atmosphere, and the simple joys of a day at the beach. Whether you're looking for a quiet, relaxing getaway, a fun-filled family adventure, or you're here on business, Ocean City’s natural beauty and local, small town charm make it a must-visit this summer. So, pack your flip flops and come see why Ocean City is Somewhere to Smile About!\nAugust 21-24 | Summer Send Off\nExperience an event unlike any other at the Summer Send Off!\nThe spectacular display will feature glowing hot air balloons, a high-energy laser show, and giant kites dancing above the sand. Enjoy the celebration as we bid summer farewell with this exciting open air event! And while you're here, enjoy fun activities with family entertainment and popular events happening all around town.\nUpcoming Events\nSunset Park Party Nights\nJoin us for unforgettable evenings of music and sunset views at Sunset…\nAll About Sharks - Free Summer Program at OCLSSM\n- OC Life-Saving Station Museum\nSeptember 6 | Northside Park\nJoin us on September 6, 2025, at Northside Park for a delectable waterfront experience featuring top Maryland restaurants, live music, and more! Kids 16 and under are free!\nTop\n5\nTrip Ideas For The Season\nCuisine Scene: OC's Newest Hot Spots\nNew Hot Spots With the Best Cuisines Ocean City in 2025 is serving up some…\nTravel Itinerary: A Guide for the Fitness Guru\nIf your idea of a perfect vacation includes breaking a sweat and soaking up the…\nOcean City’s Top 10 Upcoming Events\nFrom world-famous fishing tournaments to hot air balloon glows, live concerts to…\nWe Asked, You Answered: The Best Beach Bars and Nightlife in Ocean City\nOcean City, Maryland is known for its gorgeous beaches and sunshine-soaked…\nMid-Week Stays to Smile About in Ocean City\nLooking for the perfect time to visit Ocean City without the weekend crowds?…\nFun For Every Season\nBiking\nBiking in Ocean City, MD offers a picturesque and exhilarating…\nArts & Culture\nTake a break from the beach and enjoy our theater, music and…\nAmusement & Water Parks\nWhether you have kids or you’re just a kid at heart…\nSurfing\nWith its pristine shorelines, surfing in Ocean City is…\nFishing\nWant to put your angling skills to the test? Or maybe you just…\nGolf\nBecause OCMD boasts 17 championship courses designed by the legends of…\nKayaking, Canoeing, & SUP\nOcean City, Maryland kayak rentals are a great way to see one…\nEvents & Tickets\nView upcoming events at the Performing Arts Center.\nShop, Relax, Repeat!\nWhether you are window shopping, picking out a souvenir to bring back…\nIndoor Activities\nLooking for things to do in Ocean City, Maryland when it…\nNovember 22 | Roland E. Powell Convention Center\nFeaturing the Forever Young Tour with Vanilla Ice, Treach of Naughty by Nature, Rob Base, Color Me Badd, O-Town, Ryan Cabrera, LFO, and Young MC, hosted by Chris Kirkpatrick of *NSYNC, and 70's Soul Jam featuring The Spinners, The Legendary Blue Notes, and William Hart's Delfonics, hosted by Jimmie \"JJ\" Walker!"
    },
    {
      "url": "https://www.globenewswire.com/Tracker?data=gg7mYf0jO_bPprWb7-74jbmSLnWhzG2WI5ThNNYBHa5X6gos5w7aN3Wlv7vfU4sClN18w0Rz4H8pE9HjS4PlkPbDh-DoXZzuwQ9VLWFpo03-cwGW0-m1-KNXwlnuGHk5",
      "text": "Summer Send Off Endless Summer Escape! Residence Inn by Marriott\nOur summer send off package is called Endless Summer Escape. It includes rates of $349 for…\nYour browser is not supported for this experience.\nWe recommend using Chrome, Firefox, Edge, or Safari.\nExperience an event unlike any other at the Summer Send Off! The spectacular display will feature glowing hot air balloons, a high-energy laser show, and giant kites dancing above the sand. Enjoy the celebration as we bid summer farewell with this exciting open air event!\nWhile we're planning for four days of fun all throughout town, the main event will take place on two days during the weekend, weather dependent.\nWhere: On the beach from Dorchester Street to 3rd Street\nWhen: Two days between August 21-24 (chosen dates are weather dependent)\nExplore all of the options below!\nOur summer send off package is called Endless Summer Escape. It includes rates of $349 for…\nStay Longer and Save - 15% off BAR *maximum of 4 nights, minimum of 3 nights* Changes to length…\nMonte Carlo Summer Send Off •Includes two beverage vouchers per adult for the rooftop bar at…\n30% off a 3-night stay 8/21 through 8/24\nPackage title and description: Monte Carlo Summer Send Off •Includes two beverage vouchers per…\nSummer Send-Off: Select a room or cabin at West Ocean City's best kept secret- Beach Bum…\nDepending on wind conditions, you’ll see either massive, colorful kites fill the air, OR tethered hot air balloons create a breathtaking skyline. Wind speed and safety will determine which display is activated on event day.\nStay tuned closer to the event for specific information.\nEight Hot Air Balloons. One Unforgettable Backdrop.\nEnjoy the magic of eight hot air balloons lighting up the Boardwalk! The event will feature four whimsical, special shape balloons and four traditional teardrop styles tethered & illuminated. This static glow experience offers a rare chance to see the full-on glow of tall and radiant hot air balloons up close!\nPlease note: This event will not include hot air balloon rides; it is a viewing experience.\nWhimsical Shapes Soaring High Above the Sand\nGlance toward the sky to take in the view of a giant kite exhibition! Just north of the balloon display, ten massive \"monster show kites\" will add a fun spectacle to the beach.\nA Sky Full of Light, Music, and Movement\nEach night from 9-10pm, a laser show will fill the sky with movement. Beams will also play across the balloons, creating a high-energy contrast to the stillness of the balloon glow. It’s a one-hour show, built to be seen from the sand! Bring your beach chairs!\nThe fun doesn't stop there! All weekend long, enjoy fun activities with family entertainment and popular events like Sundaes in the Park.\nSunset Park, S. Division St. & The Bay | 7 - 9 pm\nJoin us for unforgettable evening of music and sunset views at Sunset Park Party Nights! Enjoy an epic free concert from Full Circle as you're treated to a stunning sunset over the Isle of Wight Bay.\nNorthside Park, 125th St. & The Bay | 7 - 9 pm\nEnjoy a family concert with music from The Mashup! Children are offered various free activities and entertainment. Ice cream available for purchase! Stay until nightfall to enjoy FIREWORKS!"
    }
  ],
  "argos_summary": "Ocean City, Maryland is hosting its inaugural Summer Send Off event from August 21-24, 2025, featuring glowing hot air balloons, giant kites, and a laser show, alongside various family-friendly activities. To celebrate the end of summer, select hotels are offering lodging discounts for visitors booking late-August stays. The event promises a vibrant atmosphere with live music, ice cream, and special promotions at local accommodations.",
  "argos_id": "SP328SWSJ"
}