{
  "url": "https://www.zdnet.com/article/ive-upgraded-to-every-google-pixel-flagship-model-in-recent-years-heres-why-2025-will-be-different/",
  "authorsByline": "Kerry Wan",
  "articleId": "d7cfeba56b294515ae72b04317feca3b",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/20ab1ad00bb96f84b90c5da0705a895fb2ed63e5/2025/04/10/bec8e887-17e1-4b4b-9c64-8306b308c3b0/dsc05288.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T16:14:00+00:00",
  "addDate": "2025-08-07T16:22:51.629831+00:00",
  "refreshDate": "2025-08-07T16:22:51.629833+00:00",
  "score": 1.0,
  "title": "I've owned every Google Pixel flagship phone since the first - here's why 2025 will be different",
  "description": "Essential improvements and feature parity make the standard Pixel 10 phone a potential winner in 2025.",
  "content": "• The Google Pixel 10 is expected to receive significant upgrades this year, including a dedicated telephoto lens.\n• Greater feature parity with the Pro models, combined with no expected price increases, makes the standard Pixel an enticing option.\n• It still won't be the best option for power users, especially if you want the most capable camera system from Google.\n\nGoogle's non-Pro Pixel phone has always been the \"safe pick.\" It's the model I recommend to most users, so long as they can live without the Pro features -- whether that's an extra telephoto camera, more RAM, or better hardware.\n\nAlso: This rumored Pixel 10 feature puts Google above Samsung and OnePlus for me - here's why\n\nWhile there's little left to the imagination as far as what the upcoming Google Pixel 10 phones will look like, if the leaks and rumors are true, there will be a notable shift in dynamics this year. I'll say it now: The Pixel 10, not the Pixel 10 Pro, will be both the safe pick and the best pick in 2025. I'm not alone in that belief, and here's why.\n\nAn early look at marketing renders suggests that the base-model Pixel 10 will finally get a dedicated telephoto lens, rounding out the traditional main and ultrawide sensors. Whether it's pulled from last year's Pixel 9 Pro Fold or another older model, having a greater optical zoom range will allow users to capture distant subjects with more clarity and detail.\n\nIt's a big win, whether you frequently capture photos of your child or pet running around from afar, or want to preserve the liveliness of an artist from your nose-bleed seats.\n\nAlso: Google will announce its next lineup of Pixels on August 20 - Here's what we know\n\nThere is one notable trade-off with this design decision: Google is reportedly downgrading the main and ultrawide sensors of the Pixel 10 to match the Pixel 9a (which had an inferior camera system to last year's Pixel 9) in order to integrate the additional telephoto sensor. While I found the Pixel 9a's 48MP shooter capable enough for most environments, camera buffs may be more drawn to the Pixel 10 Pro for this reason.\n\n2. The same Tensor G5 chip as the Pro\n\nGoogle's in-house Tensor chipset doesn't necessarily have the best track record for performance, cellular connectivity, and efficiency, but things are looking up with the upcoming G5 model. If the rumored 3nm design and TSMC-based manufacturing (versus Samsung Foundry) are to be realized, we may finally be looking at a system processor that delivers snappy day-to-day performance while also reliably maintaining heat and power usage.\n\nAlso: Google's latest chip is all about reducing one huge hidden cost in AI\n\nTo be clear, I'm not expecting the Tensor G5 to set new benchmark high scores or compete closely with the Samsung Galaxy S25 Ultra or OnePlus 13; that's never really been the draw of Google's in-house silicon.\n\nInstead, having the same processor as the Pro models should give the standard Pixel 10 access to all of Google's latest AI tools, many of which have landed well with consumers over the past year. Perhaps most importantly, Google will still have full rein over the Pixel line's software and security updates, allowing the devices to stay more feature-relevant than any other Android phone on the market.\n\n3. The flashiest features will be on the non-Pro model\n\nFrom the feature parity that includes magnet-based Qi2 wireless charging capabilities to a charming new Indigo blue color, it's likely that the Google Pixel 10 will be the model that appeals to most people. It certainly has for me, much like how the ultramarine iPhone 16 stuck out in the spread of subdued, monotone Pro model handsets last year.\n\nAlso: The best Android phones to buy in 2025\n\nAnother hardware difference between the regular and Pro Pixel phones this year will be the textured sides, with the former being matte-treated and the latter having a glossy finish. From having tested various handsets with various industrial designs over the years, I've found that matte-treated side rails are the most effective. The finish resists retaining oil and fingerprint smudges, keeping the phone looking cleaner.\n\nAlas, the Pixel 10's lower price point, projected to still be $799 for the 128GB configuration, makes it a compelling upgrade for anyone coming from an older handset. We'll learn more about the new Pixel 10 phones during the Made by Google event on August 20, so stay tuned.\n\nZDNET has reached out to Google for more details on the rumors and will report back with any new information.",
  "medium": "Article",
  "links": [
    "https://www.zdnet.com/article/why-i-recommend-this-450-google-pixel-deal-over-competing-models-from-samsung-and-oneplus/",
    "https://www.zdnet.com/article/yes-you-need-a-firewall-on-linux-heres-why-and-which-to-use/",
    "https://www.zdnet.com/article/7-common-household-devices-to-unplug-to-save-money-on-your-electricity-bill/",
    "https://www.zdnet.com/article/googles-latest-chip-is-all-about-reducing-one-huge-hidden-cost-in-ai/",
    "https://www.zdnet.com/article/is-a-refurbished-macbook-worth-it-i-did-the-math-and-heres-my-buying-advice/",
    "https://www.zdnet.com/article/why-i-recommend-the-samsung-s25-ultra-over-competing-android-phones-and-its-250-off/",
    "https://www.zdnet.com/article/best-android-phone/",
    "https://www.zdnet.com/article/google-just-teased-its-new-flagship-phone-early-heres-what-weve-gathered/",
    "https://www.zdnet.com/article/oneplus-flagship-phone-is-a-solid-alternative-to-the-galaxy-s25-ultra-heres-why/",
    "https://www.androidheadlines.com/google-pixel-10-renders",
    "https://www.zdnet.com/article/this-rumored-pixel-10-feature-puts-google-above-samsung-and-oneplus-for-me-heres-why/",
    "https://www.zdnet.com/article/microsoft-authenticator-wont-manage-your-passwords-anymore-or-most-passkeys/",
    "https://www.reddit.com/r/GooglePixel/comments/1mhgwxf/exclusive_new_google_pixel_10_renders_show_every/",
    "https://www.androidheadlines.com/google-pixel-10-official-renders",
    "https://www.zdnet.com/article/google-will-announce-its-next-lineup-of-pixels-on-august-20-heres-what-we-know/",
    "https://www.reddit.com/r/GooglePixel/comments/1gtketh/tested_are_googles_tensor_chips_really_that_hot/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Pixel",
      "weight": 0.09614977
    },
    {
      "name": "Google",
      "weight": 0.081805475
    },
    {
      "name": "Googles non-Pro Pixel phone",
      "weight": 0.07531321
    },
    {
      "name": "every Google Pixel flagship phone",
      "weight": 0.07363923
    },
    {
      "name": "last year",
      "weight": 0.06608939
    },
    {
      "name": "Pro",
      "weight": 0.065217145
    },
    {
      "name": "The Google Pixel",
      "weight": 0.063120745
    },
    {
      "name": "the Google Pixel",
      "weight": 0.063120745
    },
    {
      "name": "Pixel 9 Pro Fold",
      "weight": 0.060830142
    },
    {
      "name": "last years Pixel",
      "weight": 0.06081581
    }
  ],
  "topics": [
    {
      "name": "Google Pixel"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.86474609375
    },
    {
      "name": "/News/Technology News",
      "score": 0.79833984375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.7470703125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.740234375
    }
  ],
  "sentiment": {
    "positive": 0.47631836,
    "negative": 0.11291504,
    "neutral": 0.4111328
  },
  "summary": "The Google Pixel 10 is expected to receive significant upgrades this year, including a dedicated telephoto lens, and greater feature parity with the Pro models. However, the standard Pixel won't be the best option for power users, especially if they want the most capable camera system from Google. Marketing renders suggest that the base-model Pixel 10 will get a dedicated Telephoto lens. This will allow users to capture distant subjects with more clarity and detail. However this trade-off may make the Pixel 10 Pro more appealing due to its superior camera system. The same Tensor G5 chip as the Pro is also expected to provide the same performance and connectivity, but this could allow the standard phone to access all of Google's latest AI tools. The lower price point for the 128GB configuration makes it a compelling upgrade for anyone coming from an older 128GB model.",
  "shortSummary": "The upcoming Google Pixel 10, featuring a dedicated telephoto lens and Tensor G5 processor, offers enhanced multimedia features and affordable price options, but may not be ideal for power users.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fe7de69fb75b415786d9dc9bbdc1f6e5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.zdnet.com/article/is-a-refurbished-macbook-worth-it-i-did-the-math-and-heres-my-buying-advice/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nIs a refurbished MacBook worth it? I did the math, and here's my buying advice\nI remember when people used to scoff at refurbished tech. Buying a used phone or computer was like rolling the dice: you never knew exactly what you were getting.\nWell, the times certainly have changed. And, in this economy, the prices on refurbished tech are looking more and more tempting. Consumers are challenging this idea that we're all supposed to buy brand new phones and laptops every few years, and in the process, the market for refurbished tech has blown up.\nAlso: Should you buy a refurbished iPad? I tried one from Back Market and here's my verdict\nHaving never purchased a refurbished product myself, I was very curious as to how the experience would go with a new (used) laptop. So, I connected with the folks at Back Market and acquired a $950 MacBook Pro M1 from 2021 to test out as my main driver for a few weeks.\nI'll say right now: it wasn't a perfectly seamless experience, but buying brand new tech rarely is, either. Here's how it went, and what I've learned from the process.\nHow Back Market works\nFirst thing you should know is that the retailer offers different tiers of products: you can buy a MacBook in Fair, Good, Excellent, or Premium condition, with the prices scaling higher with better condition. If you're wondering what Fair condition looks like, it could include some visible signs of use, but ultimately, the internal parts have been inspected and verified by Back Market to be in good working order.\nAfter choosing the level of wear you're comfortable with, you then go through and choose the processor, memory amount, storage, and color of your new MacBook -- just like you would a brand new one.\nAlso: Your MacBook is getting a major upgrade for free - 5 MacOS 26 features I'm trying right now\nLastly, you can choose to include a trade-in with another device as part of the purchase. This process consists of a Back Market rep appraising your device and giving you an offer in a dollar amount. You then have 21 days to ship the item to Back Market, and once they get it, they'll cut you a rebate check.\nCan you trust a refurbished item?\nI don't blame you for being wary of used tech. But keep in mind that Back Market only takes in products it knows it can resell, and even then, it has to pass a 25-point inspection test to ensure they're in good enough condition.\nThis testing, repair, and parts replacement process is what sets a refurbished MacBook apart from a used one you'd buy straight from the hands of someone on Facebook Marketplace, for example.\nBesides a few signs of wear and tear (which you can realistically expect from a device in the Fair or Good categories), the primary thing to consider is the device's battery life. Luckily, you can see your MacBook's battery capacity in the settings, along with a host of other information, including how many cycles it's gone through.\nAlso: MacBook Pro vs. MacBook Air: How to decide which Apple laptop you should buy\nThe rule of thumb is to replace a battery that has dipped below 80% capacity, so a device purchased through Back Market should be above that mark, with Premium tier devices certified to be above 90%.\nThe MacBook Pro M1 I got from Back Market arrived in the Premium tier, so there was actually not a scratch or dent on the device at all. The screen looked flawless. The battery capacity was at 95%, and I had no issues with the keyboard or trackpad.\nThe only issue I experienced was that a day or two after I first set it up, it randomly booted up in recovery mode, prompting me to reinstall the latest OS. I did so, and it hasn't happened again since.\nHow much do you save?\nHere's the big question. How much are you really saving? Let's break it down based on three different comparable MacBook Pros from different generations: the M1 Pro I got from 2021, the M2 from 2023, and the latest MacBook Pro on the market, the M4 from 2024:\nCPU | Memory/Storage | Price | |\nMacBook Pro M1 14\" (Refurbished) | M1 Pro 10-core | 16GB, 1TB | |\nMacBook Pro M2 14\" (New) | M2 Pro 10-core | 16GB, 1TB | |\nMacBook Pro M4 14\" (New) | M4 Pro 10-core | 16GB, 1TB |\nThe refurbished M1 is not available new from most retailers, but you can still get new M2s from Amazon. As you can see, it's significantly cheaper -- over $600 less -- than the next generation up with comparable hardware. The difference between the M2 and M4, however, is smaller; just a few hundred dollars.\nIf you're wondering how they compare, CPU benchmarking results from Geekbench put the M1 and M2 10-core CPUs quite close together, with the M4 understandably a bit further off. These numbers refer to the CPU's performance limits under a heavy load, showing that the newer MacBooks have more power under the hood on the top end.\nAlso: The MacOS 26 public beta is here - How to install (and which models support it)\nBut the differences are not earth-shattering, here. When it comes to everyday tasks like working out of a browser, running productivity software, and multitasking with different apps across the latest MacOS, the difference in performance is not as easy to identify.\nAnd yes, the M1 MacBook Pro will be able to upgrade to the all-new MacOS 26 Tahoe when it comes out this fall, meaning it'll have the same operating system as newer MacBooks.\nGeekbench Single-Core CPU | Geekbench Multi-Core CPU | |\nMacBook Pro M1 14\" (Refurbished) | 2,451 | 10,983 |\nMacBook Pro M2 14\" (New) | 2,648 | 12,310 |\nMacBook Pro M4 14\" (New) | 3,742 | 14,693 |\nThe final verdict\nSo, should you buy a refurbished MacBook? If you want to enjoy the latest features like iPhone mirroring, the new and improved spotlight, and the liquid glass UI redesign in MacOS 26 and don't need the top-of-the-line processing power, then absolutely, yes.\nYou can get a refurbished MacBook Pro M1 with 16GB of unified memory for $841 less than a MacBook Pro M4 with a 10-core CPU. If you're not editing 4K video, animation, or rendering large image files, a top-tier processor might be overkill.\nAlso: How to make any MacOS app start at login - to save you time and clicks\nThat being said, by choosing a refurbished laptop, you'll want to carefully weigh the trade-offs. Make sure you're opting for enough local storage to future-proof your device, decide what kind of physical condition you're comfortable with, and make sure the device you choose has a healthy battery.\nLastly, keep in mind that Back Market is not the only place to purchase refurbished MacBooks, Apple has its own official refurbished store where you can purchase everything from MacBooks to iPads to Apple Watches."
    },
    {
      "url": "https://www.zdnet.com/article/this-rumored-pixel-10-feature-puts-google-above-samsung-and-oneplus-for-me-heres-why/",
      "text": "This rumored Pixel 10 feature puts Google above Samsung and OnePlus for me - here's why\nThere's been no shortage of Pixel 10 leaks leading up to its expected August launch event -- even Google has taken part in it.\nWhile early renders and marketing imagery point to a family of phones that look nearly identical (if not the same) as the last generation, the biggest feature upgrade with the Pixel 10 series may actually be hidden in plain sight.\nQi2 certification\nI'm talking about Qi2 certification, the wireless charging standard introduced at CES more than two years ago that has yet to gain widespread market adoption due to material costs, lack of user demand, and other reasons, according to brands. At the time of writing, only recent iPhone and Samsung models and the HMD Skyline are considered Qi2‑ready. That's it.\nAlso: The next big wireless charging leap is coming soon: What Qi2 25W means for Android phones\nIf the latest rumors are true, the Pixel 10 series will join that list, while also surpassing the likes of Samsung for one key reason: magnets.\nBased on a recent leak by Evan Blass, it appears the Pixel 10 will support magnet-based accessories without a special case or adhesive adapter. Theoretically, you'd be able to attach existing MagSafe products to the Pixel 10 without worrying that they'll slip off.\nNotably, the leak shows a product render of the base model Pixel 10, with its rumored aquamarine finish and additional camera sensor on the rear. With the Pro models expected to feature the same capabilities (and more), it can be assumed that the Pixel 10 Pro, Pro XL, and Pro Fold will also receive a Qi2 upgrade.\nWhy is this a big deal?\nSee, the big pull when Qi2 was introduced wasn't necessarily the faster wireless charging rate, but the concept of magnetic accessories -- think MagSafe for Android phones.\nAlso: Google just teased its new flagship phone early - here's what we've gathered\nBy encouraging phone makers to embed a magnetic adapter within the devices, users can seamlessly snap on portable chargers, tripods, and other tools. It also promotes a more optimal and direct charging experience when docking a phone on a charging pad.\nThe Wireless Power Consortium later revealed that in-body magnets weren't required for Qi2 qualification. As a result, phone manufacturers are relying on cases with magnets to handle the physics, rather than incorporating them into the phones themselves.\nWhile the attempts to circumvent the lack of in-body magnetic adapters are admirable, Google has the perfect opportunity to correct the situation and truly open up an accessory ecosystem that rivals the iPhone.\nZDNET has reached out to Google to get more details on the matter and will report back with any new information.\nSign up for our News Alerts to never miss an update."
    },
    {
      "url": "https://www.zdnet.com/article/oneplus-flagship-phone-is-a-solid-alternative-to-the-galaxy-s25-ultra-heres-why/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nOnePlus' flagship phone is a solid alternative to the Galaxy S25 Ultra - here's why\nRight now, you can buy the OnePlus 13 from Amazon at a $50 discount, whether you choose the 256GB or 512GB variant.\nIt's not often that I review a smartphone in the first few calendar weeks and feel confident in calling it a \"Phone of the Year\" contender. But when I tested the OnePlus 13 back in January, that's precisely what happened.\nWhether Google finally launches a Pixel Pro Fold with a flagship camera system this summer, or Apple releases a thinner iPhone in the fall, the OnePlus 13 will likely still be on my mind when the year-end nominations are due.\nAlso: Yes, an Android tablet finally made me reconsider my iPad Pro loyalty\nThere's a lot going for the latest flagship phone, from the more secure (and reliable) ultrasonic fingerprint sensor to the IP69 rating to the 6,000mAh Silicon NanoStack battery. It's also one of the first phones in North America to feature Qualcomm's new Snapdragon 8 Elite chip, which promises improvements to performance, efficiency, and AI workloads.\nI tested the OnePlus 13 alongside my iPhone 16 Pro Max and Google Pixel 9 Pro XL to see exactly how the Android phone stacked up against one of the best phones so far in 2025. In a few ways, the OnePlus 13 falls short, but in many ways, it puts the iPhone and Pixel to shame.\nWhen I first unboxed the OnePlus 13 and held it in my hand, my reaction was audible. Allow me to geek out here: The slightly curved glass, the slimness of the phone, and the overall appearance made my then-four-month-old iPhone look and feel outdated. It's as if OnePlus made the iPhone 17 Air before Apple did.\nHowever, what sells the OnePlus 13 design for me is the new Midnight Ocean (blue) color, which flaunts a vegan-leather backing that makes the phone visually distinctive and more comfortable to hold than its glass-only predecessors.\nAlso: I replaced my Samsung S25 Ultra with the Edge model for three weeks - here's my verdict now\nThe texture isn't as rough and grippy as actual leather, though, so I'd be interested in seeing how it ages over the year. (April 2025 update: The textured backing is holding up well, save for a few dark spots on the corners, likely caused by the phone rubbing against my palms.)\nIf you were hoping the first major Android phone of 2025 would feature Qi2 wireless charging, I have good news and bad news. While the OnePlus 13 doesn't have an in-body Qi2 charging coil, meaning MagSafe (and similar) accessories won't attach directly to the back of the device, OnePlus has embedded magnetic guides within its protective covers, enabling users to take advantage of the accessories so long as the OnePlus 13 is encased. It's a burdenless workaround, but one that hopefully won't be necessary with the next model.\nFor what it's worth, since publishing this review, several other Android phones have been released, including the Samsung Galaxy S25 Ultra, Nothing Phone 3a Pro, and Motorola Razr Ultra -- none of which feature Qi2 wireless charging.\nFor years, one aspect that's held OnePlus phones back is the water and dust resistance rating, or lack thereof. With the OnePlus 13, the company is finally taking a stronger stance on the endurance standard, certifying the phone with an IP69 rating. It's a step above the IP68 ratings we commonly see on competing devices, and allows the OnePlus 13 to withstand high-pressure, high-temperature water jets and humidity changes.\nAlso: How to clear your Android phone's cache and make it feel like new\nIn practice, this means the OnePlus 13 can function properly even if you leave it in your washer and dryer, dishwasher, or a pot of boiling soup. The IP69 rating feels very much like a flex, but it's a benefit that users will appreciate when they least expect it.\nPowering the device is a Qualcomm Snapdragon 8 Elite chip that, from my months of usage, has some noticeable strengths and weaknesses. For day-to-day usage, such as bouncing between productivity apps, definitely not scrolling through TikTok, and taking photos and videos, the processor handles tasks gracefully. It helps that OxygenOS 15, based on the latest version of Android, has some of the smoothest animations I've seen on a phone.\nAlso: Finally, Bluetooth trackers for Android users that work better than AirTags (and are cheaper)\nBut once you fire up graphics-intensive applications like Adobe Premiere Rush and Honkai Star Rail, you'll notice some stuttering as the higher heat development leads to throttling performance. This isn't a dealbreaker, per se, as the nerfs are only apparent when you're using the device for a prolonged time.\nI've actually been using the OnePlus 13 quite liberally, as the 6,000mAh Silicon NanoStack battery has kept my review unit running for at least a day and a half per charge. That's unseen with any other mainstream phone in the US market, and I fully expect more manufacturers to adopt silicon batteries for their greater energy density. If not that, copy the 80W fast charging or 50W wireless charging; they're quite the revelation.\nOn the camera front, the OnePlus 13, with its triple camera setup (50MP wide, ultrawide, and telephoto), has been a reliable shooter throughout most of my days. While the Sony LYT-808 sensor isn't on par with the one-inch sensors I've tested on international phones like the Xiaomi 15 Ultra, it does an excellent job of capturing details and finishing the output vividly. If you're a fan of sharp, bright, and slightly oversaturated imagery (read: more colorful than how the actual subject appears), then the OnePlus 13 will serve you well.\nAlso: The best Android phones to buy in 2025\nWhere the camera sensors fall short is in post-processing and AI-tuning features. For example, the phone leans heavily on computational photography to contextualize details when taking far-distance shots. This sometimes leads to images with an artificial, over-smoothing filter. But when the backend software works, it can reproduce details that you probably didn't think you'd capture in the first place.\nZDNET's buying advice\nFor a starting price of $999, the OnePlus 13 delivers some seriously good value -- possibly the best of all the major flagship phones I've tested so far this year. The company has improved the device in almost every way, from the design to the performance to its accessory ecosystem.\nI just wish OnePlus offered more extensive software support, as the OnePlus 13 will only receive four years of Android OS updates and six years of security updates. Samsung, Google, and Apple offer at least seven years of OS support. If you can shoulder the shorter promise of longevity, this is one of the easiest phones for me to recommend right now.\nWhy the OnePlus 13 gets an Editors' Choice award\nWe awarded the OnePlus 13 an Editors' Choice because it nails all the fundamentals of a great smartphone experience while leading the market in some regards, such as battery and charging, durability, and design. The specs this year are noticeably improved compared to its predecessor, the OnePlus 12, with a faster processor, lighter build, larger battery capacity, and a more capable camera system. Most importantly, the OnePlus 13 starts at $899, undercutting its closest competitors like the Google Pixel 9 Pro XL and Samsung Galaxy S25 Ultra.\nThis story was originally published on January 7, 2025, and was updated on July 15, 2025, adding information for a new Prime Day discount."
    },
    {
      "url": "https://www.androidheadlines.com/google-pixel-10-renders",
      "text": "Google is preparing to launch the Pixel 10 series in just over two weeks time, and as we get closer to the Made by Google event, we’re seeing more and more leaks. Including today’s leak where we have eight renders of the Google Pixel 10 in the new “Frost” color.\nThis is showing the phone from virtually every angle. We can finally see the front, as well as the sides, here.\nOther than this new color, there’s not many differences here when it comes to the design. The only other difference here is going to be that larger camera visor on the back. The camera bar itself is about the same size, but the glass over the cameras is now larger, since it is a triple-camera setup this year.\nGoogle is sticking with the same matte finish on the back as well as the sides here. That’s a great design choice, and one that many would hope Google would bring to the Pixel 10 Pro models, but that’s not happening. Apparently “Glossy” is more “premium”.\nPixel 10 will go official on August 20\nThe Google Pixel 10 is set to be announced on August 20, at Google’s annual event in New York City. As we have already exclusively reported, the Pixel 10 will not be getting a price increase this year. In the US, the Pixel 10 price will start at $799 for 128GB of storage, while the 256GB model will be $899. In Canada, those prices are $1,099 and $1,229, respectively.\nGoogle is sticking with the same 6.3-inch OLED display when it comes to Pixel 10 specs. It will also sport the new Tensor G5 processor, which is a 3nm processor manufactured by TSMC and it will also include Google’s first custom-made ISP.\nAlong with that Tensor G5, there will also be 12GB of RAM and either 128GB or 256GB of storage on-board. When it comes to those cameras, we have a 48-megapixel primary sensor this year, and a 12-megapixel ultrawide which have both been downgraded from the Pixel 9. And finally, that telephoto is a 10.8-megapixel sensor, the same sensor as the Pixel 9 Pro Fold and the Pixel 10 Pro Fold."
    },
    {
      "url": "https://www.zdnet.com/article/best-android-phone/",
      "text": "I test dozens of Android phones every year: Here's how Google, Samsung, and more stack up\nWhy you can trust ZDNET\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest mobile deals of the week\n- $350 (save $50)\n- $525 (save $125)\n- $300 (save $100)\n- $338 (save $291)\nThe best Android phones in 2025 consist of various models from various brands. That's the beauty of the current landscape, which spans from the best foldable phones, like the Samsung Galaxy Z Fold 7 and Google Pixel 9 Pro Fold, that challenge the status quo, to cheap phones, like the CMF Phone 2 Pro and Google Pixel 9a, that cater to consumers on a budget. Just this month, Samsung kicked off hot foldable summer with two new releases, and I expect other phone makers to follow suit in 2025.\nOf all the top handsets we've tried and tested at ZDNET, the best Android phones offer a robust hardware-software package with just enough innovation to keep the user excited.\nWhat is the best Android phone right now?\nI thoroughly test every Android phone that makes its way onto my desk, spending at least two weeks (and up to months) with each device before deciding whether it fits within ZDNET's buying guide. My pick for the best Android phone overall is the Samsung Galaxy S25 Ultra for $1,299, which features the company's flagship features and capabilities, including an S Pen stylus for precision inputs, AI features for productivity and creativity, a 200MP camera system, and the most durable display on any Galaxy phone yet.\nThe Nothing Phone 3a Pro is another frontrunner for its sheer value. It sells for $459 yet offers premium features like a 120Hz OLED display, a Qualcomm Snapdragon 7s Gen 3 chip, and capable cameras backed by a new telephoto lens.\nAlso: The best cheap phones in 2025: Expert tested and reviewed\nBest Android phones in 2025\nWhy we like it: The Samsung Galaxy S25 Ultra is the best handset of all the Android phones we've tested. The new Galaxy AI embedded in the device brings a slew of generative AI capabilities, including real-time phone call translations, multi-app AI voice prompts, enhanced photo editing, and a new AI Select tool that offers contextual shortcuts based on what you hover over. Notably, I've found that most of these features outperform AI tools offered by competing Android phones regarding speed, reliability, and practicality.\nLike its predecessor, the S24 Ultra, the S25 Ultra is built with a large 6.9-inch AMOLED and a reliable 5,000mAh battery. It helps that the S25 Ultra is made of a lightweight yet durable titanium frame and features Corning's Gorilla Armor 2, which is ideal for users who worry about damaging or scuffing up their devices.\nUnder the hood, the S25 Ultra includes an upgraded Snapdragon 8 Elite for Galaxy chipset for improved graphics and AI features and 12GB of RAM. From our testing, the Qualcomm processor not only yields greater day-to-day performance but also improved power efficiency for longer endurance (roughly nine hours of typical use per charge).\nLastly, the big upgrade for the new camera system is a 50MP ultrawide lens that produces greater detail and vividness when capturing landscape and macro shots.\nReview: Samsung Galaxy S25 Ultra\nWho it's for: Although the price of the S25 Ultra is still fairly inaccessible at $1,299, the phone's upgrades make it well worth it for users holding onto three to four-year-old devices, and are looking to switch to something more capable. The S25 Ultra retains last year's anti-reflection screen which, when paired with the larger cooling chamber, makes it a fantastic multimedia device and easy to use when outdoors.\nIf money is no object, or you score a competitive offer from your local carrier or retailer, then the S25 Ultra is the best phone you can buy today.\nWho should look elsewhere: With the S25 Ultra, you'll have to live with the fact that the S Pen no longer supports Bluetooth gestures, which previously allowed users to snap with a click of the stylus key. And if you're tight on budget or not a fan of the Ultra model's boxier footprint, I'd recommend a lower-tier S25 model or check out the OnePlus 13. Both options offer similar features but for less money.\nSamsung Galaxy S25 Ultra specs: Processor: Qualcomm Snapdragon 8 Elite for Galaxy | Display size: 6.9 inches | Storage options: Up to 1TB | Rear cameras: 200MP main, 50MP ultrawide, 50MP telephoto with 5x zoom, 10MP telephoto with 3x zoom | Front camera: 12MP | Battery: 5,000mAh | Price: Starting at $1,299\nWhy we like it: The Samsung Galaxy Z Fold 7 is the best foldable phone going into the rest of 2025, thanks to its ultra-thin form factor and market-leading camera system, which captures more lifelike images than competing models from OnePlus and Google, based on our tests.\nSamsung took the traditional smartphone route when refining the outer display of the Samsung Galaxy Z Fold 7, opting for a wider, more regular aspect ratio panel than last year's narrower Galaxy Z Fold 6. That makes a notable difference in hand-feel and ergonomics, even though the two phones are only $100 apart. Compared to the standard slab-style phone, you're simply getting more screen with the Z Fold 7, with a larger 8-inch display when unfolded. For reference, most modern-day phones range from 6 to 6.8 inches.\nNaturally, all the content I've been consuming on the phone, like video streaming, social media feeds, and Google Maps, is portrayed in a highly consumable manner; nothing feels disorienting or cropped out. While the foldable doesn't match its Ultra sibling spec-for-spec, the Z Fold 7 truly shines and more than makes up for the \"inferior\" 200MP camera system in long exposure shots and selfies, thanks to its self-standing nature.\nReview: Samsung Galaxy Z Fold 7\nWho it's for: I often recommend the Samsung Galaxy Z Fold over other foldables because of Samsung's feature-rich approach to software. Running on the OneUI launcher (over Android 16) means you can expect a simple yet customizable user interface, with support for up to seven years of operating system and security updates. I can't say the same for the OnePlus Open or Motorola Razr.\nThis ultra-slim form factor is also ideal for multitaskers and other users who want to see as much information at once as possible without reaching for a tablet or laptop. You simply won't find a foldable with better ergonomics right now than this.\nWho should look elsewhere: With a starting price tag of $1,999, you're mostly paying for the innovation factor with this phone. So if you're more interested in a safe and reliable handset that's arguably much easier to repair, then I'd recommend a traditional slab phone like the Samsung Galaxy S25 series instead.\nUsers shopping for a foldable phone should consider the Google Pixel 9 Pro Fold if they prefer a handset with less bloatware and a stubbier design, or last year's Samsung Galaxy Z Fold 6 if they want S Pen stylus support, which the Z Fold 7 omits.\nSamsung Galaxy Z Fold 7 tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display sizes: 6.5-inch exterior and 8-inch interior | Storage options: 256GB, 512GB, or 1TB | Rear cameras: 200MP wide, 12MP ultrawide, 10MP telephoto | Front cameras: 10MP front | Battery: 4,400mAh | Price: Starting at $1,999\nWhy we like it: There are three key reasons why you should buy the latest Nothing phone over any other mid-range phone: For $459, you get a decent-sized 6.77-inch AMOLED that ramps up to a 120Hz refresh rate, a reliable 50MP camera system, and a charming design (both hardware and software) that's rare in this price range.\nCompared to the latest Google Pixel 9a and Apple iPhone 16e, the Nothing Phone 3a Pro fields a transparent glass backing that's decorated with screws and data ribbons underneath. This is all accented with the brand's popular Glyph interface, an array of LEDs that shine and sparkle depending on incoming notifications, calls, timers, and more. It's a hardware package that makes other midrange phones look outdated and should appeal to fashion-forward users or folks who value innovation above all else.\nThe Nothing Phone 3a Pro is rather competitive in specs, too, with a 6.77-inch 120Hz display that's larger and brighter (up to 3,000 nits) than its closest competitors. While it's only a Qualcomm Snapdragon 7s Gen 3 chipset powering the system -- meaning it won't breeze past Fortnite runs at max graphics -- I've found the processor good enough for daily browsing, social media consumption, and streaming movies.\nReview: Nothing Phone 3a Pro\nWho it's for: If bang for your buck is what you're after, consider the Nothing Phone 3a Pro. It's a great-value handset that's designed to appeal to tech enthusiasts, trailblazers, and fashion-forward consumers. It also has a rather minimal software experience that will please users looking for a bloatware-free interface. Still, there's just enough easter eggs across widgets, settings, and customization options to prevent you from getting bored.\nWho should look elsewhere: Of course, some limitations are expected from a phone in this price range, such as a less-capable camera system that can be inconsistent in contrast levels and color (e.g., making the sky appear muted or not having much depth between the subject and background). There's also no wireless charging support, a typical omission in this price range but still an annoyance for users who have adopted the technology. If that's a feature you require, I'd recommend the Google Pixel 9a instead.\nThe last thing to note is that the Nothing Phone 3a Pro is only available through the company's Beta Program, at least here in the US. It's free to join but requires you to sign up on its website to buy the phone, meaning the Phone 3a Pro is unavailable at your local retailer or carrier store. That may be a dealbreaker for some.\nNothing Phone 3a Pro tech specs: Processor: Qualcomm Snapdragon 7s Gen 3 | Display size: 6.77 inches | Storage options: 256GB | Rear cameras: 50MP main, 50MP telephoto, 8MP ultrawide | Front camera: 50MP | Battery: 5,000mAh | Price: $459\nWhy we like it: The OnePlus 13 delivers one of the more well-rounded flagship experiences we've tested, with a large 6.8-inch, 120Hz AMOLED, a 6,000mAh battery, a triple camera setup with a competent 50MP main lens at the helm, the latest Snapdragon 8 Elite processor, and more. For $899, it's very difficult to find a better flagship phone deal right now.\nPutting the value aspect aside, the OnePlus 13 shines with its charging speed; it's something I've learned to not take for granted, as competing Android flagships tend to require hours longer to top up. From my tests, the phone's 80W wired charging can power it from 0% to 50% within 10 minutes, with a full charge taking less than 30 minutes.\nThat's compared to the Samsung Galaxy S25 Plus, for example, which takes more than an hour to fully charge with its 45W standard. OnePlus also includes the 80W charger in the box, a free bonus that will benefit users who don't want to spend any more on accessories and are always on the go.\nAnother vantage point is the OnePlus 13's IP69 rating, which laps its predecessor, the OnePlus 12, in water resistance. By IP69 standards, the phone can withstand high-pressure, high-temperature water jets and humidity changes. In other words, leaving the device in a washer and dryer, or even dropping it in a pot of boiling soup, won't damage it.\nReview: OnePlus 13\nWho it's for: The OnePlus 13 starts at $899, which is cheaper than its closest (current) competitors, the $999 Samsung Galaxy S25 Plus and Google Pixel 9 Pro. The price point alone makes it worthy of recommending to consumers looking for a flagship phone experience without needing to fork up $1,000 or more. For the money, you'll also get the fastest charging speeds on the US market, great for users who are always on the go or require as much power as possible in a given time.\nWho should look elsewhere: While the OnePlus 13 hits almost every mark from our testing, alternatives like the Google Pixel 9 Pro XL and Samsung Galaxy S25 Plus are more readily available at carrier stores and promise longer software support, both of which are ideal for users looking for a device they can hold onto for the next 5+ years.\nThe OnePlus 13 also falls short when it comes to video-recording, with our tests exposing its inconsistent HDR capturing, color processing, and imperfect stabilization. Therefore, users who may lean heavier on video-recording should consider other flagship phones like the iPhone 16 Pro.\nOnePlus 13 tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display size: 6.8 inches | Storage options: 256GB/512GB | Rear cameras: 50MP main, 50MP ultrawide, and 50MP telephoto | Front camera: 32MP | Battery: 6,000mAh | Price: Starting at $899\nWhy we like it: When it comes to camera performance, I've been equally impressed with the output from the big three (Apple, Samsung, and Google). But more often than not, Google's Pixel camera system takes the cake, with the latest Pixel 9 Pro models outpacing the Samsung Galaxy S25 Ultra and iPhone 16 Pro when it comes to shutter speed (to capture fast-moving subjects like cars and sports), post-processing, and color accuracy.\nOf course, real-time capturing is only half the battle with mobile photography; there's also post-processing and the flexibility of devices with editing and tweaking subjects. In that regard, the Pixel 9 Pro, powered by a Tensor G4 chipset, may just have the most flexible and creative photo toolbox on the market, with AI features like Magic Editor, Photo Unblur, and Best Take that allow you to modify the pictures you capture to achieve the best (or most ideal) shot.\nBoth the Pixel 9 Pro and Pro XL feature a reliable triple lens setup based on our tests, with a 50MP primary lens, a 48MP ultrawide, and a 48MP 5x telephoto lens that's great for users looking to capture distant subjects like statues and buildings. They're backed by useful software features like Google's Super Res Zoom (for up to 30x zoom photos), 8K video upscaling, and a new Add Me feature that lets you snap and merge two photos -- useful for family photos and during times when you don't have a spare cameraman.\nReview: Google Pixel 9 Pro XL\nWho it's for: It certainly helps that the Google Pixel 9 Pro series, which includes the $899 Pro and $1,099 Pro XL, undercut Apple and Samsung's flagship phones. (That's not counting the occasional deals we've seen during major holiday and commerce events.) For reference, the iPhone 16 Pro Max costs $1,199, and the Samsung Galaxy S25 Ultra costs $1,299. Therefore, we recommend the Pixel to customers who are aggressively searching for a good phone deal.\nUsers who prefer a less bloated software experience should also consider the Google Pixel 9 Pro series over its Android competitors like the Samsung Galaxy S25 and OnePlus 13, as Google's Pixel launcher is free of unnecessary third-party apps. The Google Pixel line is also among the first to receive the latest Android software features, an aspect that should appeal to enthusiasts and developers.\nWho should look elsewhere: While the Pixel 9 Pro series performs well for photo capturing, if you're looking for a phone camera that specializes more in video-capturing (especially with Pro modes), I'd recommend the iPhone 16 Pro Max or Samsung Galaxy S25 Ultra, both of which have better image stabilization and motion-smoothening.\nGoogle Pixel 9 Pro tech specs: Processor: Google Tensor G4 | Display size: 6.3 and 6.7 inches | Storage options: 128GB/256GB/512GB/1TB | Rear cameras: 50MP main, 48MP ultrawide, and 48MP telephoto | Front camera: 42MP | Battery: 4,700mAh/5,060mAh | Price: Starting at $999 (Pro) and $1,099 (Pro XL)\nWhy we like it: Deciding on the best compact phone came down to the wire, with Motorola's Razr Ultra just scraping by Samsung's Galaxy Z Flip 7. I went hands-on with the new Razr Ultra model earlier this year, and was thoroughly impressed by the improved hinge system (read: the phone feels sturdier to flip open and close), as well as the performance, which is underpinned by an updated Qualcomm Snapdragon 8 Elite chipset and 12GB of RAM.\nMotorola's outer display still supports virtually any app you throw at it, meaning you can browse the web, play games, scroll TikTok, and do other mobile tasks without ever needing to flip open the device. Samsung's platform is more limited in this regard, which always felt like a missed opportunity when testing.\nIt also helps that the Razr Ultra has a textured backing, including new Alcantara and Wood finishes, which I've found to be easier to hold and grip than competing flip phones. Considering how fragile these foldable devices can be -- anything with so many moving parts typically are -- the enhanced grip is easy to appreciate.\nReview: Motorola Razr Ultra (2025)\nWho it's for: At $1,299, the Razr Ultra is not a cheap flip phone by any means. That's why its more affordable siblings, the Razr and Razr Plus, exist. But if you want the most complete, durable, and visually-stimulating flip phone on the market right now, you'll have to pay to play with the Razr Ultra.\nI applauded Motorola for exploring new color and material finishes with this year's Razr, and that's something fashion-forward users will likely favor too. The battery on this year's model -- 4,700mAh, up from 4,000mAh -- is also much larger, which you can never really complain about.\nWho should look elsewhere: When buying the Razr Ultra, you should also consider aspects like Motorola's relatively short software update cadence, which ranges from 2 to 3 years, versus Google and Samsung's 7 years. If you're looking for a phone that's even more forgiving when dropped, I'd invest in a traditional slab handset instead, like the Samsung Galaxy S25 series or iPhone 16 Pro series.\nMotorola Razr Ultra (2025) tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display sizes: 4-inch exterior and 7-inch interior | Storage options: 512GB, 1TB | Rear cameras: 50MP wide, 50MP ultrawide | Front camera: 32MP wide | Battery: 4,700mAh | Price: $1,299\nWhy we like it: Whether you game on existing mobile apps or take to the cloud for streaming, Android manufacturers have spent the past decade forging a new category of gaming-tailored smartphones, and the Asus ROG Phone 9 series may just be the best in its class.\nHere's a rundown of its key gaming features: The phone has one of the smoothest 185Hz refresh rate displays I've tested (compared to the 120Hz and 144Hz configurations on competing models like the RedMagic 10 Pro), 16GB of RAM, a Snapdragon 8 Elite chipset to power through games and background tasks, capacitive side triggers that are mappable to various in-game functions, an additional LED back panel that one Reddit user says is \"screaming my name,\" and a 5,800mAh battery keeping the lights turned on. It's a mouthful, I know.\nThe latest model features various AI tools, like a wallpaper generator, to suit your theming preferences. For gamers, the phone supports X Sense, which uses AI to learn your in-game patterns so that the phone can automatically perform tasks for you, such as picking up objects as you move around in Genshin Impact. I tested several of these AI features at CES and was impressed with how naturally Asus had embedded them into the phone's software.\nAlso: The best gaming PCs of 2025: Expert tested\nWho it's for: Notably, that large-capacity battery of the Asus ROG Phone 9 bests most high-end phones in the US market, including the Samsung Galaxy S25 Ultra (5,000mAh) and iPhone 16 Pro Max (4,685mAh), making it a fantastic pick for power users and mobile gaming enthusiasts.\nThe software is also rich with gaming-centric settings and customizations, ideal for gamers who like to tinker, but not for the everyday consumer who's just getting started.\nWho should look elsewhere: From my testing, the Asus ROG Phone 9 series falls short when it comes to camera performance and software experience -- both of which are common among gaming phones. With all the focus on rendering graphics and processing power, the 50MP camera on the ROG Phone can produce washed-out and over-sharpened photos, and therefore, I don't recommend it for users shopping for a reliable camera phone.\nFor those reasons, I'd suggest either the OnePlus 13 or Samsung Galaxy S25 Ultra to anyone who wants a handset that's less polarizing. Both of those models are more capable of handling day-to-day tasks -- on top of mobile gaming.\nAsus ROG Phone 9 Pro tech specs: Processor: Qualcomm Snapdragon 8 Elite | Display size: 6.78 inches | Storage options: 256GB/512GB/1TB | Rear cameras: 50MP main,13MP ultrawide, and 5MP macro | Front camera: 32MP | Battery: 5,800mAh | Price: Starting at $999\nWhich is the right Android phone for you?\nAll of these phones run the same base operating system, but the user interfaces range from stock Android to more elaborate options. First, you need to figure out which best fits your needs.\nCamera performance across the board is solid for just about every phone on the list, but some are better than others. If you plan to capture photos as your primary function, you should look to Google, Samsung, or even OnePlus.\nIf you plan to spend $1,000 or more, you may also want your phone to last at least a couple of years. You should consider companies with a good track record of regular updates, notably Google and Samsung, which currently promise seven years of software support.\nChoose this Android phone… | If you want… |\nSamsung Galaxy S25 Ultra | The overall best with nearly no compromises. Buy this phone if you want a device that delivers on display and camera quality, AI features, and battery life. It also comes with an S Pen stylus for precision inputs. |\nSamsung Galaxy Z Fold 7 | The best foldable phone on the market right now, whether you're based in the US or not. The Samsung Galaxy Z Fold 7 is built with comfort in mind and features a much-desired 200MP main camera sensor. |\nGoogle Pixel 9 Pro | A clean and minimal software experience and several Google-exclusive perks, like Add Me and Video Boost, distinguish the Pixel 9 Pro from the rest of the competition. |\nOnePlus 13 | A phone that takes less than 30 minutes to completely top up, with other specifications that are just as capable. The best is its $899 starting price, which undercuts its flagship competitors. |\nNothing Phone 3a Pro | Arguably the best sub-$500 phone on the market right now, with a design that distinguishes itself from competing mid-range handsets. |\nAsus ROG Phone 9 Pro | A high-performance package that comes with all the features necessary for an enjoyable gaming experience. That includes side triggers and a cooling fan add-on. |\nMotorola Razr Ultra (2025) | A compact phone that doesn't compromise on performance. It's rare to find such a combination, but that's exactly what you're getting with this clamshell foldable. |\nHow we test Android phones\nZDNET's review team spends upwards of a year testing the ins and outs of every major Android release, evaluating the day-to-day performance, camera quality, battery life and endurance, and more. Here's a breakdown of every factor we consider before we make recommendations:\n- Design and ergonomics: How good a phone looks and feels plays a big role in many users' buying journeys, so we consider these aspects heavily when testing.\n- Performance: Several factors affect a phone's performance, including LTE/5G signal, battery life, and background tasks. Therefore, we typically begin our evaluations with a fully charged handset, with all background tasks closed, and with as stable of a mobile connection as possible.\n- Camera quality: ZDNET tests phone cameras by capturing hundreds of photos and videos of various subjects and in various lighting conditions. We also compare the output to that of older models.\n- Battery life and charging: It's also important for us to evaluate how long phones last under light, moderate, and heavy usage, how long they take to recharge, and how they do it (wired, wireless, or both).\n- Special features: These features distinguish tested devices from a bustling smartphone market and hopefully bring added value to users, not the opposite.\n- Pricing and availability: Beyond budget considerations, we also note if a phone is available in the US or only internationally.\nFor a more extensive breakdown, check out our comprehensive phone testing methodology page.\nWhat is better, an iPhone or an Android?\nCustomizability remains one of the biggest vantage points of Android, even though Apple has done a commendable job over the past two to three iOS versions to give its users more autonomy. You can also expect Android phones to support the most innovative features in the mobile industry, like foldable displays and faster USB-C charging. The caveat of being more experimental is that Android phones are generally not as consistent and reliable as iPhones.\nOn the flip side, iPhones are notorious for their stability and ease of use. If you're not one to tinker with your gadgets, then you'll fit right into the iOS ecosystem. Features like iMessage and FaceTime are also key differentiators when comparing iPhones to Android. Those two features alone can dictate your decision.\nKerry Wan's smartphone advice\nI've used dozens of smartphones in the past year alone, learning the ins and outs -- the tips and tricks -- to make the most out of my handset. Here are my three biggest pointers on taking care of your smartphone in 2025:\nSpeeding up your smartphone\nSomething I always do when setting up a new Android phone is dialing up animation and transition speeds. You can do this by turning on Developer Options, a backend catalog of system settings meant for developers to access (but rules were meant to be broken, right?).\nAlso: Best phones for battery life: Great battery, even better performance\nTo turn on Developer Options, go into your About Phone page in the settings and look for the Build Number. Tap on that seven times, and you should see a pop-up indicating that Developer Options has been turned on. Now, the activated tab will appear in the main settings list. From there, scroll down until you find Windows, Transition, and Animator duration scale. Tap into each and switch from 1x (default) to 0.5x to double the speed of your phone's animations.\nOptimizing your battery health\nTo preserve your phone's battery life, it's best to charge it between 20% and 80% and never let it drop to 0% or charge fully to 100%. This is because the heat generated from overcharging the phone can burn (or degrade) the battery, reducing its number of charge cycles. This phenomenon is the reason why you shouldn't charge your phone overnight or leave it plugged in for an extended period of time.\nWhen in doubt, after a year or two of usage, consider getting your phone's battery swapped to refresh its charge cycles. You'll be amazed at how well it functions again.\nHow to keep your phone clean\nUnless you're invested in a repairs and warranty plan like Samsung Care, consider suiting your phone with a protective case and/or tempered glass screen protector. Beyond drop protection, the two accessories will prevent the phone from getting scratches, scuffs, and other blemishes and can greatly reduce the chance of water damage. For what it's worth if a manufacturer claims its phone is rated IP68, that means the device can withstand dust ingress and be submerged in water for up to 30 minutes at 1 meter deep.\nFAQ on smartphones\nWhen do new phones come out?\nWhile the year just started, we can look at past industry trends to understand when new phones will be released. Below is a list of expected release dates/timeframe for major phones in 2025.\n- Samsung Galaxy S25 series: January\n- OnePlus 13 series: January\n- Apple iPhone 16e: February\n- Google Pixel 9a: March\n- Motorola Razr Ultra: May\n- Samsung Galaxy S25 Edge: May\n- Samsung Galaxy Z Fold 7 and Z Flip 7: July\n- Google Pixel 10 series: August\n- Apple iPhone 17 series: September\nWhen is the Google Pixel 10 series expected to release?\nGoogle recently confirmed that its next \"Made by Google\" hardware event, which showcases the company's latest Pixel, Nest, and other products, will take place on August 20, 2025 in New York.\nAt this summer's product event, we're expecting the company to debut the new Pixel 10 Series, featuring the standard Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and Pixel 10 Pro Fold, alongside new Pixel Watches and earbuds.\nWhat is the best brand for Android phones?\nThe beauty of Android is that you have a lot of options. So the answer to \"Which brand is best?\" depends on your feature, user interface, and design preferences. If you prefer a more minimalistic approach to hardware and software, Google's Pixel line will serve you best. If you want everything but the kitchen sink in a smartphone, go with Samsung. For more unique value propositions like ultra-fast charging and a smooth interface, give OnePlus phones a try.\nBudget is also worth considering, but today, every major manufacturer, including Google and Samsung, offers Android phones in every price category (budget, mid-range, and premium) so it won't be your biggest decider.\nWhat is the most reliable smartphone brand?\nIn the grand scheme, Apple is the most reliable smartphone brand, with the longest, most consistent support of all manufacturers. If we're looking at Android makers only, then Samsung would take the crown, with a promise of up to seven years of software updates for its latest phones, expansive carrier support across the US (and overseas), and one of the most reliable repair and insurance infrastructures.\nHow long does an Android phone last?\nMost Android phones today should last at least seven years. For example, the latest handsets from Google and Samsung come with up to seven years of software support, meaning they'll receive updates and security patches for the long term. Of course, this applies more to flagship and some mid-range phones, whereas budget devices that sell for $300 and less tend to receive shorter commitments.\nAlso: How to find out what apps are draining your Android phone's battery\nHow you handle and use your phone will also determine its lifespan. It's highly advised not to keep your phone charged overnight as that can trigger faster battery degradation. It also helps to put on a case and/or screen protector to keep the device's hardware functioning properly.\nIf it ever feels like your phone isn't lasting as long as it once did, consider swapping out its battery before replacing it with a new device altogether.\nWhich Android version is best?\nThe latest version of Android is 99% of the time also the best version. At the moment, that's Android 16.\nWhat is the latest version of Android in 2025?\nThe latest version of Android is Android 16, which debuted with the Google Pixel series, has officially launched across major Android models, including Samsung and OnePlus.\nAndroid 16 features new tools like Live Updates, which display real-time tickers on the notification bar, auto-grouping of alerts, desktop windowing, accessibility enhancements, and better security and privacy in general.\nWhich phones get Android 16?\nThe latest version of Android is supported by most smartphone releases in recent years, including the following:\n- Google Pixel 6 series to Pixel 9 series (foldables included)\n- Samsung Galaxy S22 series to S25 series (foldables and A-series models included)\n- OnePlus 11 to OnePlus 13 series\n- Select Sony, Motorola, Nothing, Xiaomi, Honor, Vivo, and Oppo models\nWhich phone OS is most secure?\nTo generalize, most consumers will be choosing between iOS and Android, and between the two, iOS is the more secure operating system.\nThe main reason is that the abundance of Android phones and app makers means there are more opportunities for hackers and data thieves to access your personal information and/or install malware. How these attacks are prevented and managed varies across manufacturers, with some OEMs like Google doing a better job than others like Xiaomi.\nWhile iOS on iPhones may feel more restrained and limited in customizations, that results in a more protected and secure software experience, from app availability on the store to how you download files online.\nCan I use eSIM on an Android phone?\nWhile Apple's iPhone 14 made headlines for its eSIM integration, the digital service also works -- and has for some time -- with Android devices, including the latest Google Pixel, Samsung Galaxy, and OnePlus smartphone. As always, it's best practice to consult with your local carrier before converting to eSIM.\nWhat is the best small Android phone?\nBesides the Motorola Razr Ultra, the Samsung Galaxy S25 is a worthy runner-up, with a 6.2-inch AMOLED, up to 512GB of storage, and a flat-edge design that makes it all the easier to manage with one hand. During ZDNET's testing, the small-but-mighty Android proved capable of handling apps and services typically run on larger devices.\nLatest updates\n- In our July update, we replaced the Google Pixel 9 Pro with the Samsung Galaxy Z Fold 7 for \"Best foldable Android phone.\" More information has also been added regarding Google's upcoming Pixel hardware event.\n- In our June update, we added information about Android 16, which officially launched with the Google Pixel devices.\n- In our May update, we added information regarding what other phones users can expect later this year, including the Galaxy S25 Edge, Z Flip 7, and Z Fold 7. The Motorola Razr Ultra has replaced the Motorola Razr Plus (2024) for \"Best compact Android phone.\" We also added context of the Samsung Galaxy S25 Edge.\n- In our April update, we added information regarding Mobile World Congress (MWC). The OnePlus Open was also replaced by the Google Pixel 9 Pro Fold for \"best foldable phone.\"\nAre there alternative smartphones worth considering?\nOutside of this list of excellent options, here are worthy alternatives that will surely delight you, including foldables, budget picks, and more."
    },
    {
      "url": "https://www.zdnet.com/article/google-just-teased-its-new-flagship-phone-early-heres-what-weve-gathered/",
      "text": "Google just teased its new flagship phone early - Here's what we've gathered\nThe next Made by Google event isn't until next month, but Google has spilled the beans early by officially unveiling the Pixel 10. The Google Store has been updated with a new header video showing off the upcoming smartphone. The short clip only displays the device from a single angle, but still manages to reveal quite a lot.\nAlso: The best Google Pixel phones to buy in 2025\nThe Pixel 10 bears a striking resemblance to the Pixel 9, sporting the same isolated camera island on the back. We saw only a single color option in the video -- a matte gray with a shiny border. A recent leak states that the phone will be available in four colors: Obsidian (black), Indigo (blue), Frost (light gray), and Limoncello (a yellowish-green). It appears that Google revealed Frost in the teaser.\nIf you look closely, you'll notice three lenses peering from behind the glass. It's possible we're looking at the Pixel 10 Pro since the Pro models have three lenses. However, recent rumors claim that the base model will also have a triple camera setup.\nNew camera tech\nUsing the Pixel 9 Pro as an example, it's possible the Pixel 10 will have a 50MP wide lens, a 48MP ultrawide lens, and a 48MP telephoto option. That last camera could be something special. According to a June report from Android Headlines, Google is adding a macro functionality to the 5x telephoto sensor, turning it into a \"Tele-Macro\" lens.\nThis combination will apparently improve macro photography by allowing users to be further away from a subject. It is also said to improve the overall quality. Whether or not this Tele-Macro will be present on every Pixel 10 model (or if it's even real in the first place) is unknown.\nAssuming that this is the base Pixel 10, it is very possible that the other rumors are, at the very least, somewhat correct. The future smartphone will not be a complete overhaul of the previous generation. Instead, it will be a refinement of the series, introducing upgrades in key areas, such as the new Tensor G5 chipset to improve performance.\nIf you're ready for an upgrade and want to get your hands on the Pixel 10, Google is offering an exclusive offer to anyone who signs up for email notifications. On August 20, you'll receive a promotional coupon code and instructions on how to redeem it in order to get a discount on a \"specified Google Pixel 10 device\".\nExactly how much the discount will be or which Pixel 10 model is eligible are unknown at the time of this writing, but it's likely to be around $100, similar to what we saw last year with the Pixel 9.\nMade By Google 2025 kicks off on August 20 at 10 a.m. PST / 1 p.m. EST, and we're likely to see Google unveil more than just new phones. Specifically the new Google Pixel Watch 4 -- the next smartwatch in the lineup -- and new Pixel Buds Pro.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends."
    },
    {
      "url": "https://www.zdnet.com/article/yes-you-need-a-firewall-on-linux-heres-why-and-which-to-use/",
      "text": "Yes, you need a firewall on Linux - here's why and which to use\nZDNET's key takeaways\n- Linux is highly secure, but you should still have a firewall.\n- You should know if your ISP's hardware (gateway) uses a firewall.\n- One of the easiest Linux firewalls is UFW and its GUI sidekick, GUFW.\nI've been using Linux for nearly 30 years. Over those years, I've experienced only one security issue (a rootkit on a server I inherited). The reason for that is Linux's heightened security. Out of the box, it includes a tight permissions system and security mechanisms (such as AppArmor and SELinux) that do an amazing job of locking down the operating system.\nBut what about the firewall? You know about firewalls, especially if you've used Windows (because Microsoft's OS has always depended on them). And before you think it, no matter how secure your web browser is, it's not enough.\nAlso: Thinking about switching to Linux? 9 things you need to know\nAlmost every Linux distribution ships with a firewall that is ready to use. Oddly enough, however, some distributions ship with the firewall disabled.\nThat seems counterintuitive for an operating system that hangs its hat on security.\nThe big question you may ask is, \"Does Linux even need a firewall?\"\nBefore answering that question, I'll ask you some questions:\n- Is your Linux machine on a home network?\n- Does your home network have a router that includes a firewall?\n- Is your router regularly updated?\n- If your home network has a router with a firewall, are there any ports open?\n- Do you have sensitive data on your computer?\nYou might not know the answers to those questions, which means you might have to contact your ISP and ask them about the hardware in use. For example, AT&T Fiber does include a firewall on its gateway hardware. Comcast's Xfinity gateways also include a firewall.\nAlso: 8 things you can do with Linux that you can't do with MacOS or Windows\nIf you know your ISP hardware includes a firewall, the need for a firewall on your Linux machines is less pressing than otherwise.\nBut does that mean you should forget about the firewall?\nI say, no.\nI say, the more security, the better.\nFor example, your ISP's gateway goes without updates, which could leave it vulnerable to attacks. Some ne'er-do-well figures out what gateway you're using, breaks through its unpatched defenses, and has access to your network. If your Linux machine isn't protected via a firewall, that bad actor could access the machine through an open port and have at the data it contains.\nYou don't want that.\nErgo… firewall.\nBut which one should you use?\nDifferent distributions ship with different firewalls. For example, Ubuntu (and those based on Ubuntu) ship with Uncomplicated Firewall (UFW), whereas Fedora (and those based on Fedora) ship with firewalld. Although both are solid options, I give the nod to UFW because it's so easy to use. And if you don't want to use the command line, there are GUI apps you can install to control UFW.\nAlso: You can try Linux without ditching Windows first - here's how\nEven from the command line, UFW is easy. To enable it, issue the command:\nsudo ufw enable\nOnce enabled, all ports are closed, and accessing your machine is made exponentially more challenging. Let's say, however, that you regularly use SSH to access that machine from your LAN. For that, you could issue the command:\nsudo ufw allow ssh\nOr maybe you want to only allow SSH from a single IP address within your LAN, which can be done with:\nsudo ufw allow from IP_ADDRESS to any port 22 proto tcp\nWhere IP_ADDRESS is the address of the machine you want to allow in.\nThose same actions with Firewalld look like this:\nsudo firewall-cmd --zone=public --permanent --add-service=ssh\nOr\nsudo firewall-cmd --permanent --add-source=IP_ADDRESS --zone=drop\nsudo firewall-cmd --permanent --add-service=ssh\nsudo firewall-cmd --reload\nsudo firewall-cmd --list-all --zone=drop\nsudo firewall-cmd --list-all\nWhere IP_ADDRESS is the address of the machine you want to allow in.\nObviously, UFW is the easier tool, and I would always recommend it over firewalld for those who are just getting into Linux.\nAnd if you want a GUI for UFW, try GUFW (which can be installed from your GUI app store).\nIn the end, the answers to the questions are simple:\n- Do you need a firewall on Linux? - yes\n- Which one should you use? - UFW\nUnderstand that if you want to use UFW on Fedora-based systems, you must install it. To do that, issue the following commands:\nsudo systemctl stop firewalld\nsudo systemctl disable firewalld\nsudo dnf remove firewalld\nsudo dnf install ufw\nsudo ufw enable\nYou now have UFW running on your Fedora-based distribution.\nWith a firewall active, your Linux machine will be better protected, should someone get around the defenses of your ISP's hardware. As always, it's better to be safe than sorry.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/googles-latest-chip-is-all-about-reducing-one-huge-hidden-cost-in-ai/",
      "text": "Google's latest chip is all about reducing one huge hidden cost in AI\nDuring its Google Cloud Next 25 event Wednesday, the search giant unveiled the latest version of its Tensor Processing Unit (TPU), the custom chip built to run artificial intelligence -- with a twist.\nAlso: Why Google Code Assist may finally be the programming power tool you need\nFor the first time, Google is positioning the chip for inference, the making of predictions for live requests from millions or even billions of users, as opposed to training, the development of neural networks carried out by teams of AI specialists and data scientists.\nIronwood TPU\nThe Ironwood TPU, as the new chip is called, arrives at an economic inflection point in AI. The industry clearly expects AI moving forward to be less about science projects and more about the actual use of AI models by companies.\nAnd the rise of DeepSeek AI has focused Wall Street more than ever on the enormous cost of building AI for Google and its competitors.\nThe rise of \"reasoning\" AI models, such as Google's Gemini, which dramatically increases the number of statements generated by a large language model, creates a sudden surge in the total computing needed to make predictions. As Google put it in describing Ironwood, \"reasoning and multi-step inference is shifting the incremental demand for compute -- and therefore cost -- from training to inference time (test-time scaling).\"\nAlso: Think DeepSeek has cut AI spending? Think again\nThus, Ironwood is a statement by Google that its focus on performance and efficiency is shifting to reflect the rising cost of inference versus the research domain of training.\nAn inference chip\nGoogle has been developing its TPU family of chips for over a decade through six prior generations. However, training chips are generally considered a much lower-volume chip market than inference. That is because training demands rise only as each new, gigantic GenAI research project is inaugurated, which is generally once a year or so.\nIn contrast, inference is expected to meet the needs of thousands or millions of customers who want day-to-day predictions from the trained neural network. Inference is considered a high-volume market in the chip world.\nGoogle had previously made the case that the sixth-generation Trillium TPU, introduced last year, which became generally available in December, could serve as both a training and an inference chip in one part, emphasizing its ability to speed up the serving of predictions.\nIn fact, as far back as the TPU version two, in 2017, Google had talked of a combined ability for training and inference.\nAlso: Google reveals new Kubernetes and GKE enhancements for AI innovation\nThe positioning of Ironwood as mainly an inference chip, first and foremost, is a departure.\nNecessary investment\nIt's a shift that may also mark a change in Google's willingness to rely on Intel, Advanced Micro Devices, and Nvidia as the workhorse of its AI computing fleet. In the past, Google had described the TPU as a necessary investment to achieve cutting-edge research results but not an alternative to its vendors.\nIn Google's cloud computing operations, based on the number of \"instances\" run by customers, Intel, AMD, and Nvidia chips make up a combined 99% of processors used, versus less than a percent for the TPU, according to research by KeyBanc Capital Markets.\nThat reliance on three dominant vendors has economic implications for Google and the other giants, Microsoft and Amazon.\nAlso: 10 key reasons AI went mainstream overnight - and what happens next\nWall Street stock analysts, who compile measures of Google's individual lines of business, have, from time to time, calculated the economic value of the TPU. For example, in January, stock analyst Gil Luria of the boutique research firm DA Davidson wrote that \"Google would have generated as much as $24 billion of revenue last year if it was selling TPUs as hardware to NVDA [Nvidia] customers,\" meaning in competition with Nvidia.\nConversely, at a time when the cost of AI escalates into multi-hundred-billion-dollar projects such as Stargate, Wall Street analysts believe that Google's TPU could offer the company a way to save money on the cost of AI infrastructure.\nAlso: DeepSeek's new open-source AI model can outperform o1 for a fraction of the cost\nAlthough Google has paid chip-maker Broadcom to help it take each new TPU into commercial production, Google might still save money using more TPUs versus the price it has to pay to Intel, AMD, and Nvidia to consume ever-larger fleets of chips for inference.\nIronwood vs. Trillium\nTo make the case for Ironwood, Google on Wednesday emphasized the technical advances of Ironwood versus Trillium.\nGoogle said Ironwood gets twice the \"performance per watt\" of Trillium, as measured by 29.3 trillion floating-point math operations per second.\nThe Ironwood part has 192GB of DRAM memory, dubbed HBM, or high-bandwidth memory, six times as much as Trillium. The memory bandwidth transmitted is 4.5 times as much, 7.2 terabits per second.\nAlso: Nvidia dominates in gen AI benchmarks, clobbering 2 rival AI chips\nGoogle said those enhancements are supposed to support much greater movement of data in and out of the chip and between systems.\n\"Ironwood is designed to minimize data movement and latency on chip while carrying out massive tensor manipulations,\" said Google.\nScaling AI infrastructure\nThe memory and bandwidth advances are all part of Google's emphasis on \"scaling\" its AI infrastructure.\nThe meaning of scaling is to be able to fully use each chip when grouping together hundreds or thousands of chips to work on a problem in parallel. More chips dedicated to the same problem should lead to a concomitant speed-up in performance.\nAgain, scaling has an economic component. By effectively grouping chips, the TPUs can achieve greater \"utilization,\" the amount of a given resource that is actually used versus the amount being left idle. Successful scaling means higher utilization of chips, which is good because it means less waste of an expensive resource.\nAlso: 5 reasons why Google's Trillium could transform AI and cloud computing - and 2 obstacles\nThat's why, in the past, Google has emphasized Trillium's ability to \"scale to hundreds of thousands of chips\" in a collection of machines.\nWhile Google didn't give explicit details on Ironwood's scaling performance on inference tasks, it once again emphasized on Wednesday the ability of \"hundreds of thousands of Ironwood chips to be composed together to rapidly advance the frontiers of GenAI computation.\"\nAlso: Intel's new CEO vows to run chipmaker 'as a startup, on day one'\nGoogle's announcement came with a significant software announcement as well, Pathways on Cloud. The Pathways software is code that distributes parts of the AI computing work to different computers. It had been used internally by Google and is now being made available to the public.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/google-will-announce-its-next-lineup-of-pixels-on-august-20-heres-what-we-know/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nGoogle will announce its next lineup of Pixels on August 20 - Here's what we know\nThe date has been set: Google's next \"Made by Google\" event will be held on Wednesday, August 20, at 1 p.m. EST. This news comes from industry insider Mark Gurman of Bloomberg, who posted a screenshot of the invitation on X and was later confirmed by the official Made by Google account.\nAlso: The best Google Pixel phones to buy in 2025\nThere have been very few leaks this time around, so details are scarce, but Google is expected to follow tradition by revealing its new smartphones, specifically the Pixel 10 series and a fourth-generation Pixel Watch.\nThe new Pixel 10 series\nThe Pixel 10 series will consist of the base Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and the Pixel 10 Pro Fold. This upcoming generation likely won't be a design overhaul, as the devices are \"expected to closely resemble the Pixel 9 series\". However, they will reportedly have new processors, introduce some hardware refinement, as well as \"other iterative upgrades\".\nThe new base model Pixel 10 looks like it may come with an extra camera, bringing it up to three total to match the Pro version. What this will do the device's price, however, remains to be seen. Personally, I'm wary of any big price increases to the base model, as Google has already carved out a market for the Pixel's combination of features and approachable price point.\nRegarding the processor in question, it's said to be the Tensor G5, a chipset Google has developed in collaboration with TSMC (Taiwan Semiconductor Manufacturing Company). This marks a shift away from the Samsung-produced processors in previous generations of Pixels. It's likely we'll hear a lot more about these new chips' performance and battery efficiency at the event.\nPixel 10 Pro Fold specs: More of the same?\nSome leaked specs for the Pixel 10 Pro Fold show that the new phone shares a lot of similarities with the Pixel 9 Pro Fold. The inner display is still an eight-inch OLED panel running at 120Hz, and it still operates on 16GB of memory. The camera system doesn't look like it's changing much, either.\nAlso: How your Pixel phone can now help you shoot expert-level photos and video\nHowever, one thing to note is the outer OLED display on the 10 Pro Fold is bigger at 6.4 inches, and the model will have a larger 5,015mAh battery. This mirrors adjustments to the display and battery we saw this month on Samsung's new Galaxy Z Flip 7.\nSpeaking about price, the Pixel 10 Pro Fold will likely be positioned as a more accessible version to Samsung's thousand-dollar-plus Galaxy Z Fold 7, leaning on a fresh interface and additional AI-powered features rather than premium hardware.\nAs for non-smartphone devices, the Pixel Watch 4 will likely make an appearance. Not much is known about the wearable, but according to notable leaker OnLeaks, the future smartwatch will look like a thicker Pixel Watch 3 sitting at 14.3mm instead of 12.3 mm. The extra bulk could account for a bigger battery. Other possible reveals include the Pixel Buds 2a and the next generation of Android XR glasses.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends."
    },
    {
      "url": "https://www.zdnet.com/article/microsoft-authenticator-wont-manage-your-passwords-anymore-or-most-passkeys/",
      "text": "Microsoft Authenticator won't manage your passwords anymore - or most passkeys\nZDNET's key takeaways\n- Microsoft is a prolific supporter of using passkeys over passwords.\n- Authenticator will no longer save your passwords.\n- But Authenticator can't be your comprehensive passkey manager.\n- The Edge browser will likely fill that role one day, but it's not there yet.\nFor most of this year, Microsoft has been warning users that they will no longer be able to use its Authenticator mobile application for user ID and password management. As reported by CNET on July 29, 2025, \"In June, the company stopped letting users add passwords to Authenticator…. And starting Aug. 1, you'll no longer be able to use saved passwords.\"\nAlso: How passkeys work: The complete guide to your inevitable passwordless future\nTo me, the dire warnings of this pending doomsday-like deadline are reminiscent of the run-up to January 1, 2000 -- the so-called \"Y2K problem\" -- when it was anticipated that computers everywhere would experience a meltdown because their programmers never considered the possibility that their software would still be in use in the 21st century.\nThe great passkey migration\nBut most of this reporting overlooks the bigger shift that's underway across Microsoft's identity management portfolio and, in many cases, is missing key details about the future roles of Microsoft Authenticator and the Microsoft Edge browser when it comes to another colossal shift that's currently in progress: the world's transition from passwords to passkeys.\nA passkey is unequivocally a safer credential than a password when it comes to logging into websites and apps. Passkeys cannot be guessed, the same passkey cannot be reused across different websites and apps, and you cannot be tricked into divulging your passkeys to malicious actors through techniques such as phishing, smishing, squishing, and malvertising. Even if you're strengthening user IDs and passwords with additional factors of authentication, passkeys are a better and more secure alternative.\nAlso: I replaced my Microsoft account password with a passkey - and you should, too\nIn fact, of the major technology vendors that are encouraging end-users to switch to passkeys, no vendor is pushing users to transition as hard as Microsoft is. But, at the same time that Microsoft is aggressively campaigning for that transition, we are still waiting for Microsoft to offer the comprehensive credential management capabilities that are necessary to support that future.\nManaging passwords after Authenticator\nFor users who managed their user IDs and passwords with Authenticator and want to stay with Microsoft-based solutions to manage their user IDs and passwords, their only option is to export their passwords from Microsoft Authenticator to Microsoft's Edge web browser. Once users do this, Edge will not only take over the role of managing those user IDs and passwords, it will also handle the auto-provisioning of those credentials (a.k.a. autofill) at the time of login and the synchronization of those credentials to the user's other copies of Edge.\nIn addition to Windows, Edge is available on MacOS, iOS, Android, and Linux. Given Edge's cross-platform reach when compared to that of Microsoft Authenticator (iOS and Android), it makes more sense for Edge to handle credential management and autofill.\nAlso: What if your passkey device is stolen? How to manage risk in our passwordless future\nThis approach, where Microsoft is facilitating credential management through the browser instead of a mobile application closely resembles the way Google is handling credential management and autofill through its Chrome browser. Both browsers are based on Chromium and offer users some basic password management capabilities, and both rely on a central cloud to handle credential synchronization to the same browser on other devices.\nThe problem with non-syncable passkeys\nBut, at the time this article was published, whereas Chrome's password management capabilities will auto-provision and synchronize credentials of both types (passwords and passkeys) to a user's other installations of Chrome, Edge can only synchronize passwords. According to a Microsoft spokesperson who was interviewed for this story, \"passkeys created for services like PayPal and eBay are stored as device-bound credentials in Windows and can be accessed via Windows Settings > Accounts > Passkeys. These are not stored or synced in Edge.\"\nIn other words, Edge for Windows is capable of handling and auto-provisioning passkeys during a login, but not the other versions of Edge. I confirmed this by trying to use Edge for Android to register a passkey for eBay. A lot happens behind the scenes when you register a passkey for the first time, and I explain the process in How Passkeys Work: Let's Start the Registration Process.\nAlso: 10 passkey survival tips: Prepare for your passwordless future now\nWhereas an eBay passkey registration option exists when using Edge for Windows, no such option was available to me on Edge for Android. In addition to that limitation, the eBay passkey that I was able to establish on Edge for Windows could not be synchronized to my copy of Edge for Android. This confirmed the spokesperson's statement about passkeys being \"stored as device-bound credentials in Windows.\" Device-bound passkeys are also referred to as \"non-syncable passkeys.\" As I wrote in my detailed comparison of syncable passkeys to device-bound passkeys (something that ever user should know going forward), device-bound passkeys are tied to the device that was used to create them and cannot be synchronized to another device. As it turns out, the passkey that I established through Edge running on my copy of Windows 11 was bound via Windows Hello to the Trusted Platform Module (TPM) in my HP Notebook.\nThis raises the question of where, across Microsoft's portfolio, users might be able to find support for syncable passkeys since they are by far the most convenient form of passkey to use for the websites and apps that support them. After all, the company is already supporting syncable user IDs and passwords through Edge. The last thing most users want to do is manage multiple device-bound passkeys for each website and app they use. Better to just have one, just like a password.\nYour passkey management options now\nThis is where the confusion sets in. Across most of the articles that reported on the elimination of user ID and password support in Microsoft Authenticator, the authors also noted that Authenticator would continue to support passkeys and that the user could continue to rely on Authenticator to authenticate (login) with those passkeys (see my explanation of what really happens during your 'passwordless' passkey login). It's not surprising that most of the articles said this. After all, Microsoft's own post about the changes to Authenticator very clearly states, \"Authenticator will continue to support passkeys. If you have set up Passkeys for your Microsoft Account, ensure that Authenticator remains enabled as your Passkey Provider. Disabling Authenticator will disable your passkeys.\"\nThis certainly piqued my interest. On the surface, it was strangely starting to look like Microsoft was moving all user ID and password management to Edge while at the same time fracturing passkey management across Microsoft Authenticator and Edge for Windows instead of moving full support for both syncable passwords and syncable passkeys to Edge (which is exactly how Chrome does it). So I went back to Microsoft to make sure that I understood things correctly. I apparently didn't.\nAlso: Passkeys won't be ready for primetime until Google and other companies fix this\n\"Authenticator will always continue to support device-bound passkeys for Entra accounts,\" a Microsoft spokesperson told me. \"You'll always be able to create one of those today and in the future.\" There's a lot to unpack there. Not only are Authenticator-managed passkeys also device-bound passkeys (in other words, they cannot be synchronized), the passkey support found in Authenticator is for users of Microsoft Entra ID, Microsoft's cloud-based identity management solution (formerly known as Azure Active Directory) for businesses. In other words, the passkey support found in Microsoft Authenticator is not for those of us in the general user population who just want to manage their credentials. And it still lacks any synchronization capabilities.\nIn a nutshell, for those of us in the general user population who want to manage and use passkeys in addition to user IDs and passwords, Microsoft offers one option: Edge on Windows. Additionally, neither Edge for Windows nor Microsoft Authenticator (for Entra ID users) offers passkey synchronization. The only type of passkeys that Microsoft currently supports are device-bound (non-syncable) passkeys. This is obviously not ideal, and knowing some of the folks at Microsoft, I'm sure they would agree (especially given how hard the company is selling the idea of passkeys right now).\nMy conclusion as I try to take a 30,000-foot view of this situation is that when it comes to all of the different Microsoft technologies that play a role in credential management -- Windows, Windows Hello, Authenticator, Edge, Microsoft Wallet, Entra ID, passkeys, etc. -- the company has a lot of different pieces on the chessboard. Moving them all into the ideal position to support the secure credential management future it is selling is easier said than done.\nAlso: What really happens during your 'passwordless' passkey login?\nIn the same way that a chess player (and opponent) always think and anticipate a few moves ahead, it's hard not to see that at some point, sooner or later (probably sooner), Microsoft will support syncable passkeys across all its versions of Edge just like it does now with user IDs and passwords (and just like Chrome does). That is the only logical outcome given its strongly worded messages to migrate passwords from Authenticator to Edge.\nBut until that final chess move happens, users have options in the other credential management companies, including Google and all the third-party password managers (1Password, BitWarden, Dashlane, LastPass, NordPass, etc.) that support syncable passkeys and passwords in a single solution.\nStay ahead of security news with Tech Today, delivered to your inbox every morning."
    },
    {
      "url": "https://www.androidheadlines.com/google-pixel-10-official-renders",
      "text": "This is your first look at the official renders for the Google Pixel 10, which Google has confirmed will be announced on August 20.\nThe Google Pixel 10 colors will include Obsidian, Indigo, Frost, and Limoncello. The Obsidian is obviously Google’s black color, which they’ve offered for many years now. While the Indigo is a real royal blue, a bit lighter than the blue shadow on the Galaxy Z Fold 7. Frost is a much lighter blue, almost like the iPhone 15 from a couple of years ago, and finally, the Limoncello is a yellow-green color.\nThese are all pretty bright colors, and an interesting color palette for Google, even on its base model. Especially since the Porcelain color is missing from the base Pixel 10, now.\nThe biggest change, is the camera bar\nThis year, the biggest change on the Google Pixel 10 is actually going to be in the camera bar. It’s not actually a larger camera bar; however, the glass on the camera bar is now larger. This is due to Google adding a third camera to the Pixel 10 – finally adding that telephoto camera.\nAs we’ve already reported on, all Google Pixel 10 camera sensors are going to be smaller this year. This is likely to help differentiate the Pixel 10 from the Pixel 10 Pro models, since there’s no reason why the Pixel 10 can’t have the exact same sensors as the “Pro” models.\nThe primary sensor will be a 48-megapixel sensor, with a 12-megapixel ultrawide and a 10.8-megapixel telephoto sensor. These sensors come from the Pixel 9a, and the telephoto comes from the Pixel 9 Pro Fold.\nObviously, the Google Pixel 10 specs look like a pretty huge downgrade. But an important thing to remember is Google’s computational photography. It works better on these smaller sensors, versus the larger ones we have on the “Pro” models. This is a big reason why the Pixel a-series typically wins the blind smartphone camera tests every single year.\nThe Google Pixel 10 release date is set for August 20, with pre-orders opening that same day. Devices are set to start shipping on August 28."
    },
    {
      "url": "https://www.zdnet.com/article/why-i-recommend-the-samsung-s25-ultra-over-competing-android-phones-and-its-250-off/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWhy I recommend the Samsung S25 Ultra over competing Android phones (and it's $250 off)\nZDNET's key takeaways\n- The Samsung Galaxy S25 Ultra is a premium flagship meant for users who want the most out of their phone, with a starting price of $1,299.\n- Key improvements include new Galaxy AI features, a Qualcomm Snapdragon 8 Elite chipset, and a 50MP ultrawide lens.\n- No major shifts to camera hardware, battery size, and charging speeds leave a lot to be desired.\nThe 256GB Galaxy S25 Ultra is available for $1,050 in Titanium Silverblue and Titanium Whitesilver, which is its lowest price yet. The 512GB S25 Ultra is also on sale and can be bought for as low as $1,299.\nSamsung's Big Bad Galaxy phone is here, and it may be the least surprising device I've tested so far. The Galaxy S25 Ultra, which starts at the same bold price as last year, $1,299, remains the company's do-everything handset. This premium Android phone is now Samsung's best phone overall, with a more durable display, an upgraded camera lens with some handy editing tricks, and the latest Qualcomm processor keeping things running. Oh, and yes, AI is everything, everywhere, all at once.\nAlso: I changed 10 Samsung phone settings to give it a significant performance boost\nWhile last year's Galaxy S24 series ushered in Samsung's Galaxy AI era, this year feels more like the company cementing itself as the leader in the smartphone space, besting Apple and even Google (for now) on features and capabilities. How decorative that honor is ultimately depends on how invested you are in using AI.\nI've spent a month testing the S25 Ultra and wasn't too surprised to find myself both fascinated and bored. After all, this is now Samsung's fifth iteration of the S-series Ultra model, and the changes year-over-year have been modest, to be generous. But if you're currently using a three- to four-year-old handset and considering an upgrade, take this first-hand testimonial to heart. (And if you're an enthusiast, it'll matter just as much to you.)\nThe Galaxy S Ultra has always been a big-phone, two-handed affair, and that holds this year. When I first unboxed the S25 Ultra, it felt like the fanciest calculator ever (and I mean that in a nice way), with its round edges and tall stature. Coming from the OnePlus 13 I reviewed back in January -- which, on paper, is relatively similar in size -- the S25 Ultra had a bolder and more striking presence.\nFortunately, the device is not as top-heavy as I remember previous models being, even though Samsung encased the four rear cameras with thicker rings this time around. In fact, the S25 Ultra is lighter than its predecessor by 16 grams, earning it the title of the thinnest Galaxy S Ultra ever. You should still opt for the slimmer S25 and S25 Plus if that's the form factor you're after, and you'll likely hear more about the \"thinnification\" of phones later this year. Furthermore, if small phones are your style, refer to our roundup of the best small phones of 2025.\nAlso: This midrange Galaxy phone can make you forget ever wanting a flagship - and it's on sale\nThe other notable design upgrade with the S25 Ultra is the Corning Gorilla Armor 2 layered over the front display. It doesn't take away from the anti-reflection surface treatment that made headlines on last year's S24 Ultra, yet promises improved drop protection and scratch resistance. I believe it. My S24 Ultra last year had numerous micro scratches after just days of testing, while my S25 Ultra review unit has remained pristine so far -- even after I removed the privacy screen protector I initially installed on it.\nNow, if only Samsung could bring back the glory days of psychedelic Aura Glow finishes because these S25 Ultra colors are uninspiring. Perhaps it's the nature of titanium finishes or the harsh reality that consumers are more likely to opt for safer colors with black, white, and silver hues than poppy and bright. Regardless, you'll want to slap on a case to give your S25 Ultra even a touch of personality.\nUnder the hood is a new Qualcomm Snapdragon 8 Elite chip for Galaxy, which is an overclocked variant of the processor powering competing Android phones in 2025 like the OnePlus 13 and Honor Magic 7 Pro. The most notable benefit of the chipset comes in the form of AI experiences -- specifically, a 40% increase in NPU performance compared to last year's Snapdragon 8 Gen 3.\nAlso: Samsung Galaxy S25 Ultra vs. OnePlus 13: I compared the best Android phones, and it was very close\nIn layman's terms, on-device AI features should take up less bandwidth and power to operate while also functioning quickly. I saw the results in person, placebo effect or not, as my S25 Ultra can swiftly remove subjects (along with their shadows) from the background of photos via Generative Edit and pull up Gemini search results in a matter of seconds. I ran a couple of response tests with the iPhone 16 Pro (running Siri and ChatGPT) and Google Pixel 9 Pro (running Gemini), and the Galaxy S25 Ultra was the clear front-runner.\nYou can also credit the performance to the enhanced Gemini app, which can now be fired up with a long press of the power button. Previously, Samsung phones were limited to Bixby -- or Google Assistant, if you made some sketchy backend modifications -- so this change is a breath of fresh air. It makes transitioning from any other Android phone with Gemini as the default assistant much more burdenless.\nSpeaking of which, the new Gemini-Bixby hybrid AI agent, as Samsung confusingly presents it, can handle natural-sounding, conversational chains of actions, such as looking up the upcoming schedule of your favorite sports team and adding the date(s) to your calendar. While the agent-like capability mainly works across Google and Samsung apps, some third-party services like Spotify are supported, too.\nAlso: Samsung is giving these Galaxy phones a big One UI upgrade - here's which models qualify\nThe important thing is knowing how to phrase your commands. For example, when I asked the AI agent to create a Spotify playlist for road trips and send it to my wife, it responded that it was unable to do so. When, instead, I asked it to find songs that were good for road trips, it curated the list and drafted a modifiable text message. My AI advice: if a prompt doesn't work, try and try again.\nConsidering the Galaxy S24 series introduced Google's Circle to Search feature, and the S25 series is doing the same for the enhanced Gemini-Bixby experience, it wouldn't be farfetched to say that Samsung, not Google, makes the best AI phone on the market right now.\nSome other new Galaxy AI tools, like AI Select and Now Brief, only reinforce that statement. The former is an adaptive, context-aware screen selection tool, and the latter gives daily summaries of the weather, calendar events, and news.\nAlso: Samsung Galaxy S25 Edge hands-on: This ultra-thin phone made my iPhone feel outdated\nI just wish Now Brief showed me more than just political news; even after two weeks since setting my topic preferences within my Samsung News app to technology and sports, the app still treats my mornings with the generic \"Uplifting Morning Prep\" Spotify playlist and latest scoop on the US president signing executive orders.\nOne of the key reasons to buy a Galaxy Ultra phone continues to be the camera, though Samsung hasn't improved the specifications much this year -- at least on paper. The only hardware change is the 50-megapixel ultrawide lens (up from 12MP), which, from my two weeks' worth of shots, yields greater detail and vividness, especially when capturing macro photos.\nThe rest of the lenses, such as the 200MP wide, 50MP 5x telephoto, and 10MP 3x telephoto, are identical to last year's S24 Ultra, but several internal contributors like the improved ISP of the Qualcomm chip have made the S25 Ultra's output more true to real life, especially when it comes to face tones and details in low light.\nAlso: The best Samsung phones to buy in 2025\nThere's a bigger focus on the software side of things, with Samsung introducing helpful photo and video features like 10-bit HDR video recording by default to capture a wider dynamic range, a new Audio Eraser feature that lets you adjust the volumes of various frequencies (classified as audio subjects like voices, wind, and noises), and the ability to record in Galaxy Log mode.\nThe latter feature allows you to spot overexposed areas better and adjust the dynamic range while recording videos. It also allows you to apply LUTs in post for better color and light control.\nZDNET's buying advice\nMy month of testing the Samsung Galaxy S25 Ultra confirms several things for me. While most aspects of the phone, such as the vibrant, glare-free display and versatility across the cameras and AI features, are easy to appreciate, the upgrades this year feel iterative and safe.\nIn ways, Samsung has even taken a few steps back, with the S Pen stylus no longer supporting Bluetooth controls and gestures, and the company opting for Qi2-ready cases instead of embedding the actual technology within its phones. Samsung may reason the absence of magnets with added weight and bulk, but it's inexcusable when Apple continues to make the iPhone slimmer while offering similar functionality.\nAlso: I've tested every Samsung Galaxy S25 model - and my favorite isn't the Ultra\nIt's understandable that early adopters and tech enthusiasts might feel underwhelmed by the S25 Ultra; when you brand your phone as \"Ultra,\" it should, theoretically, lead the market in multiple aspects. In today's landscape, however, Samsung needs to give us a bit more than just a new chip and some software features. Otherwise, it's becoming harder and harder for me to justify spending $1,300 on a phone.\nBut for consumers who are coming from an S21 series, Pixel 6 or 7, or even an older iPhone, Samsung's new flagship handset checks almost every box. Just make sure to survey your local carrier or retailer for a generous trade-in deal before you make the investment.\nWhen will this deal expire?\nIt's unknown exactly how long this deal will last as an expiration date wasn't given, but don't expect it to last for very long. Act fast and take advantage of the discounts while they last.\nDeals are subject to sell out or expire at any time, though ZDNET remains committed to finding, sharing, and updating the best product deals for you to score the best savings. Our team of experts regularly checks in on the deals we share to ensure they are still live and obtainable. We're sorry if you've missed out on a deal, but don't fret -- we constantly find new chances to save and share them with you on ZDNET.com.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.\nThis article was originally published on January 21, 2025, and was updated on June 2, 2025."
    },
    {
      "url": "https://www.zdnet.com/article/7-common-household-devices-to-unplug-to-save-money-on-your-electricity-bill/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\n7 common household devices to unplug to save money on your electricity bill\nCosts are steadily rising in the US, and energy costs are a prominent example. This is made worse by summer temperatures being at record highs, with heat waves wreaking havoc across various states in the past few weeks. As someone who's gone through a few of these this summer alone, I'm constantly looking for ways to conserve energy.\nThere are many little things you can do that can shave dollars off your monthly energy bill, and they go beyond switching off the lights when you leave the room. Did you know you can save 3% on cooling costs for every 1°F increase in your thermostat? As a fan of data, I've looked into multiple quantifiable ways to save energy and how these translate into saving money.\nAlso: Apple's tariff costs and iPhone sales are soaring - how long until device prices are too?\nUnplugging a single device when not in use isn't going to save you a bucket of cash. But unplugging multiple devices adds up quickly to help you save, especially when you make a habit of it. Here are the devices you should unplug when they're not in use, and how doing so could save you almost $200 a year, depending on your local rates.\n1. TVs, gaming consoles, and office devices\nIt's easy to forget to unplug TVs that aren't in daily use, but it happens more often than you'd think. This is especially true if you have a TV in a guest room or common area that isn't often occupied. Simply unplugging your TVs when not in use could save you between $2 and $6 a year for each one. As soon as I learned this, I ran to unplug my guest room and office TV.\nSimilarly, a printer left plugged in can cost between $3 and $8 a year when idle. One can consume between 2W and 6W when not in use, adding another good savings option.\nAlso: These jobs face the highest risk of AI takeover, according to Microsoft\nA single gaming console like a PlayStation or Xbox can consume between 1.5W and 10W in standby power, which can cost up to a dollar each month for a device that is not in use. It's a good idea to unplug these devices when you'll be out of the house or overnight, just keep in mind that you may still want to leave them in rest mode so you don't miss an update.\nYou should also consider unplugging sound bars and speakers when not in use, especially in areas that don't get daily use.\n2. Coffee makers and kitchen devices\nUnfortunately, I learned the hard way that my Keurig coffeemaker was driving up my power bill. I kept my Keurig in standby mode, rather than asleep, so it was always ready to brew a cup of coffee. This can consume from 60W and 70W because it has to keep the water warm and ready. This can translate into up to $60 a year.\nAlso: This unexpected robot vacuum made me forget about my $2,000 Roborock\nSimilarly, a mini-fridge can cost you up to $130 a year to run, which doesn't always pay off if you don't need it to run all the time. I used to forget to refill my mini-fridge, so it ended up running empty for weeks, wasting between 50-100W of energy and costing me money. If you have a mini-fridge that you only use seasonally, like in your sunroom during summer months, it's best to unplug it when not in use. Doing so can save you over $10 a month on energy bills.\n3. Smart home devices that are mostly idle\nMost smart home devices are focused on improving energy efficiency, but they can also be vampire devices. Smart devices are always consuming energy because they remain connected to either the internet or another device, like a hub. However, smart devices tend to consume very low phantom loads, so you don't need to rush to unplug them all.\nSmart bulbs and plugs, though small, are always drawing a small amount of power, around 1W. This only costs you between $0.65-$1.30 a year, depending on your local rate, but it can add up if you have multiple of these devices, especially if you don't use them often.\nI have a lot of smart bulbs at home and I kill the switch on the ones that I know we won't be using un the near future. Similarly, I unplug my smart plugs when they don't have a device plugged into them.\nAlso: I let this Segway robot mow my lawn for months - here's why it's been irreplaceable for me\nA smart plug can often save you money on your energy bill. For example, if you have an older Keurig without scheduling capabilities that you'd like to have ready when you wake up, you can put a smart plug on it and schedule it to turn on just an hour a day. I also use my smart plugs to run a grow light for houseplants, a fan, and an older lamp.\n4. Older devices around your home\nMany people still have older devices plugged in that they haven't used in a long time, but either forgot or simply don't think twice about it. A single set-top cable box, DVR, or Blu-ray player can cost you up to $20 a year to power when not in use, depending on your local rates.\nLook around your home and see what is plugged in that doesn't need to be, including alarm clocks, cordless phone bases, electric kettles, hair dryers, and more. Unplugging these devices and only plugging them back in before using them can pay off, even if it's just a few dollars a month.\nFAQs\nMore tips to save on utilities this summer\nEven as the temperatures reach scorching highs, there are many ways to save on your utility bills this summer.\nHere are some things you can do to save money on your energy bills:\n- Run a fan instead of turning down the A/C: Your central air conditioner unit uses between 2,000W and 2,500W when running, while a ceiling fan, for example, uses around 50W. You can set your thermostat between 4-6 degrees higher during the warmer months and use a fan to save energy costs and the life of your A/C unit.\n- Keep the heat out: A warmer house takes more effort to cool, so you should make sure your windows are completely shut and your home is properly insulated. Closing the blinds and adding blackout curtains in some rooms can also maintain a cooler temperature throughout the day.\n- Switch to LED bulbs: I'm sure you've heard this before, but this is a fantastic way to save on your utility bill. LED bulbs use 80-90% less energy than traditional incandescent bulbs and generate less heat.\n- Learn about energy savings through your utility provider: Many providers offer opportunities to save on your energy bills, especially during peak usage days and hours. Find out if your utility provider has a savings program and what you can do to participate in it.\nWhat are vampire devices?\nYou've likely heard about unplugging common household appliances and devices when not in use to save energy. Devices that consume energy even while they're switched off are aptly called 'vampire devices,' and you may have more of them in your home than you think.\nAlso: This thermostat mistake was costing me hundreds: 3 tips to get the best temperature control\nThe US Department of Energy recommends unplugging devices when not in use to reduce phantom loads. Doing so can save you up to 10% on your energy bill, which is a pretty significant amount for such little effort.\nDoes unplugging devices actually save money?\nUnplugging devices can help you save more energy than you'd think, especially if you often forget to switch off appliances like your Keurig. Many of the devices in our homes consume power even if they're not in use, and the key to saving on your energy bills lies in compounding your potential to conserve energy.\nAs someone with a whole-home backup system that sees multiple power outages a year, I make a habit of unplugging devices to save energy. This is even more evident when the power goes out and I go through all my home's circuits using the EcoFlow Smart Home Panel. The EcoFlow app shows me the load that each circuit in my home carries at any given time, and lets me turn them off from my phone.\nAlso: I let this Segway robot mow my lawn for months - here's why it's been irreplaceable for me\nWhen the power goes out, I unplug devices that aren't essential and turn off non-critical circuits. If my home consumes 1.2kWh at any given time, I can easily halve this by unplugging devices and switching off circuits. I unplug anything from smart plugs and lamps to air purifiers and robot vacuums that don't need to be used during a power outage, and I keep my home running with only 330Wh to 600Wh to extend the life of my backup battery.\nGet the best tech tips in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/why-i-recommend-this-450-google-pixel-deal-over-competing-models-from-samsung-and-oneplus/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWhy I recommend this $450 Google Pixel deal over competing models from Samsung and OnePlus\nZDNET's key takeaways\n- The Google Pixel 9a is the latest midrange phone from the company and retails for $499.\n- It features a new Tensor G4 chip, helpful AI tools, an improved main camera, and the largest battery of any Pixel.\n- You'll have to settle for some budget trade-offs, including the lack of a telephoto lens and slower charging speeds.\nFor a limited time, Amazon is offering the Google Pixel 9a for $50 off for Prime Day, bringing it down to an even more accessible price of $449 (from $499).\nI'm inclined to think that the folks behind the latest Google Pixel 9a are from the future because if there's one thing that the phone gets right, it's timing.\nThe latest Pixel 9a retails for $499, making it a stellar phone investment in today's -- and the foreseeable future's -- unpredictable economy. Of course, the recent tariff news I've been tiptoeing through has been in discussions since January.\nAlso: What to expect from Samsung Unpacked tomorrow: Galaxy Z Fold 7, Flip 7, Watch 8 Series, more\nBut with the latest wave of announcements, it's clear that the consumer electronics market is about to go into a full-blown frenzy, as brands brace for impact, prices teeter on the edge, and shoppers rush to lock in value before the storm truly hits.\nThat means devices like the Pixel 9a -- ones that promise long-term benefits at a relatively affordable price -- matter more than ever. The timing alone makes the Pixel 9a one of the most significant devices of 2025, even if it wasn't meant to be when first unveiled.\nMacroeconomics 101 aside, here's what you need to know about the Pixel 9a I've been driving daily for more than a month, including who should buy it and what makes it worth upgrading to.\nI'll admit: initially, I wasn't sold on the Pixel 9a's new hardware and design. The bezels are noticeably thick by today's standards – even when compared to similarly priced devices like the $459 Nothing Phone 3a Pro and $399 Samsung Galaxy A36 5G – and removing the Pixel-famous camera bar was a choice.\nIn theory, stripping down the back of the phone makes the Pixel harder to distinguish in a sea of glass sandwiches. In practice, this has two benefits: hand placement and reduced dust accumulation. While I would previously tuck my index finger underneath the camera bar to keep the phone upheld, not having the physical obstruction now means I can hold the phone much more freely.\nAlso: I changed 8 settings on my Pixel phone to significantly improve the battery life\nWhy is this tech nerd geeking out about ergonomics? Because the Pixel 9a's power button is fairly high, hand placement is one aspect you don't want to limit yourself to.\nThat same power button prompts Gemini, which replaces Google Assistant on the Pixel 9a and can now fulfill more complex tasks, including multimodal, vision-based assistance.\nIf there's one thing we can all agree on, it's that Pixel phones are notorious for collecting dust between the crevices of the camera bar. This is especially true if you have a case equipped, which further traps debris and particles near the camera bar.\nThe Pixel 9a has none of those problems, maintaining a clean aesthetic after almost a month of going in and out of jean pockets, my backpack, and a gadget-filled shoulder bag.\nAlso: My Android Auto was having trouble connecting until I did this one thing\nI'm also a fan of the brighter display, which now ramps up to 2,700 nits of peak brightness versus the Pixel 8a's 2,000 nits. The improved luminance was noticeable when I put the two Pixel phones through my infamous torture test -- aka reading text-heavy webpages from the window seat of a bridge-crossing commuter bus. Very scientific, I know.\nBut most end consumers will appreciate the practicality of such upgrades, and the Pixel 9a delivers when it comes to consuming content under the springtime sun.\nThe day-to-day benefits extend to the processing power of the Pixel 9a, which features the same Tensor G4 chipset as the other Pixel 9 series models, including the $1,099 Pixel 9 Pro XL and $1,799 Pixel 9 Pro Fold. Paired with 8GB of RAM, today's minimum amount of memory to run hybrid AI features, you're looking at a phone that handles most tasks gracefully.\nGoogle says switching to the Tensor G4 chip yields a 30% speed bump in web browsing over last year's Tensor G3, and I believe it. With the Pixel 9a and Pixel 8a in hand (and on the same Wi-Fi network), the former loaded up the various image carousels, web links, and the story river on ZDNET's homepage a few seconds faster. Save a few seconds here and there, and you're looking at an accumulatively snappier browsing experience.\nThe big question is how the Tensor G4 holds up over time. By that, I mean cellular performance, power efficiency, and memory management after 1-2 years, as those have all been issues raised by real customers. In Google's defense, the company doesn't necessarily market its devices as multitasking powerhouses or ones that can spell the end of gaming consoles. Regardless, I'll be keeping tabs.\nAlso: This unique Android phone is a solid alternative to the flagships - especially at this price\nI'm more hopeful about the Pixel 9a's future because of its battery and endurance. Unsurprisingly, this is one of the longest-lasting Pixel phones I've tested, with a 5,100mAh capacity that sets a new record for Google.\nThe 1-2 extra hours I've squeezed out of the Pixel 9a compared to the Pixel 8a (4,492mAh) have been admirable, especially with my camera-heavy workflow. In fact, my battery tests -- which consist of 45 minutes of continuous usage, from browsing social media feeds to streaming videos to making calls -- put the Pixel 9a in pole position above the Pixel 9 Pro XL. Now, if only Google could improve the wired charging speed from the sluggish 23W rating. Give me 65W! 45W! I'll even take 30W.\n(While I'm here: the flush camera design of the Pixel 9a also makes it much more compatible with various wireless charging docks.)\nOn paper, the new 48-megapixel primary camera on the Pixel 9a looks like a downgrade from last year's 64MP shooter, but the larger image sensor on the former does make a difference.\nAlso: I tried the controversial Android phone that's got the internet buzzing - and left impressed\nI mostly noticed the performance gap when evaluating night-time photos and in environments with less-than-usual lighting. Pinching into photos shows the Pixel 9a capturing more detail and vividness, naturally resulting in better contrast and color accuracy. The Pixel 9a also nails skin tones, which can be very difficult when your environment's color temperature (read: leaning more orange or blue) is off.\nWhat left me wanting more was the zoom capabilities, as I felt the lack of a dedicated telephoto lens when I recently attended a New York Knicks game and couldn't grab a quality shot of the tip-off with the 8x (max) optical zoom -- even though I sat just a few sections away from the court. (A more distant shot of the full arena, taken with the 13MP ultrawide and pictured above, looked fantastic.)\nSimilar emotions were felt when I tried to capture the unshakable aura of turkeys crossing a street on Staten Island. The curiosity killed me, and one step closer meant the birds bolting away.\nZDNET's buying advice\nMoney is a sensitive topic now more than ever, so here's my buying advice after testing the Google Pixel 9a and every other A-series device since 2019.\nThis is the most well-rounded phone you can buy for under $500, and the intrinsic value that comes with it -- the seven years of software support, the various AI features that have trickled down from more premium Pixel phones, etc. -- makes it a more reasonable choice than its flashier competitors.\nWhether you value a good display, reliable battery life, or a camera that gets the shots you want (just don't be too ambitious), the Pixel 9a will serve you well. It's one of the few best Android phones I'd recommend for its listing price and more so if there's a carrier deal that fits your plan.\nBut should you buy one if you're using a 1-2 year-old handset? Probably not. Instead, I suggest waiting for the next big sales event, as the $799 Pixel 9 will likely fall within a similar price range -- again.\nIf you can wait it out, the Pixel 9, for around $50-$100 more, is the better smartphone deal, and it's a device we consider the best option for most consumers right now, including power users and business professionals. Regardless, your options in the midrange market are promising right now, and the timing couldn't be better.\nHow we test phones\nZDNET's review team spends upwards of a year testing the ins and outs of every major phone release, evaluating the day-to-day performance, camera quality, battery life and endurance, and special features. Here's a breakdown of every factor we consider before we make recommendations:\n- Design and ergonomics: How good a phone looks and feels plays a big role in many users' buying journeys, so we consider these aspects heavily when testing.\n- Performance: Several factors affect a phone's performance, including LTE/5G signal, battery life, and background tasks. Therefore, we typically begin our evaluations with a fully charged handset, all background tasks closed, and as stable a mobile connection as possible.\n- Camera quality: ZDNET tests phone cameras by capturing hundreds of photos and videos of various subjects and in various lighting conditions. We also compare the output to that of older models.\n- Battery life and charging: It's also important for us to evaluate how long phones last under light, moderate, and heavy usage, how long they take to recharge, and how they do it (wired, wireless, or both).\n- Special features: These features distinguish tested devices from a bustling smartphone market and hopefully bring added value to users, not the opposite.\n- Pricing and availability: Beyond budget considerations, we also note if a phone is available in the US or only internationally.\nFor a more extensive breakdown, check out our comprehensive phone testing methodology page.\nThis article was originally published on April 10, 2025, and was updated on July 8, 2025."
    }
  ],
  "argos_summary": "The upcoming Google Pixel 10 is set to launch on August 20, 2025, featuring significant upgrades including a dedicated telephoto lens and the new Tensor G5 processor. While the standard model will offer improved camera capabilities with a triple-camera setup, it will have downgraded main and ultrawide sensors compared to previous models. The Pixel 10 is expected to maintain its price point of $799, making it an attractive option for consumers seeking a reliable smartphone without the premium features of the Pro models.",
  "argos_id": "SWLBB1VEY"
}