{
  "url": "https://www.bostonglobe.com/2025/08/07/nation/israeli-embassy-hate-crime-murder-charges-washington/",
  "authorsByline": "ALANNA DURKIN RICHER",
  "articleId": "9b041e4e3dae43468387269601d242b3",
  "source": {
    "domain": "bostonglobe.com",
    "location": null
  },
  "imageUrl": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/GQQX4AGN43XETTWP54QL2LZIMA.jpg?auth=3c47fae98fe37bd6b181e1ccc22dfb5f5c75cebc968b69dbb212dc6bdef9234b&width=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:53:24.234000+00:00",
  "addDate": "2025-08-07T14:03:03.709140+00:00",
  "refreshDate": "2025-08-07T14:03:03.709144+00:00",
  "score": 1.0,
  "title": "Man accused of killing Israeli Embassy staffers indicted on federal hate crime and murder charges",
  "description": "Elias Rodriguez is accused of gunning down Yaron Lischinsky and Sarah Milgrim as they left an event at the museum in May.",
  "content": "WASHINGTON (AP) — The man accused of fatally shooting two staff members of the Israeli Embassy in Washington outside a Jewish museum has been indicted on federal hate crime and murder charges, according to court documents unsealed Wednesday. The indictment, filed in federal court in Washington, charges Elias Rodriguez with nine counts, including a hate crime resulting in death. The indictment also includes notice of special findings, which would allow the Justice Department to potentially pursue the death penalty. Elias Rodriguez is accused of gunning down Yaron Lischinsky and Sarah Milgrim as they left an event at the museum in May. He was heard shouting “Free Palestine” as he was led away after his arrest. He told police, “I did it for Palestine, I did it for Gaza,” federal authorities have said.\n\nRodriguez had previously been charged with murder of foreign officials and other crimes, and the hate crimes charges were added after prosecutors brought the case to a grand jury. It means prosecutors will be tasked with proving Rodriguez was motivated by antisemitism when he opened fire on Lischinsky and Milgrim, a young couple who were about to become engaged. A guide through the most important stories of the morning, delivered Monday through Friday. Prosecutors have described the killing as calculated and planned, saying Rodriguez flew to the Washington region from Chicago ahead of the Capital Jewish Museum event with a handgun in his checked luggage. He purchased a ticket for the event about three hours before it started, authorities have said in court papers. An attorney for Rodriguez didn’t immediately respond to an email seeking comment Wednesday. Witnesses described him pacing outside before approaching a group of four people and opening fire. Surveillance video showed Rodriguez advancing closer to Lischinsky and Milgrim as they fell to the ground, leaning over them and firing additional shots. He appeared to reload before jogging off, officials have said. After the shooting, authorities say Rodriguez went inside the museum and stated that he “did it.” “I did it for Palestine, I did it for Gaza, I am unarmed,” he spontaneously said, according to court documents. He also told detectives that he admired an active-duty Air Force member who set himself on fire outside the Israeli Embassy in February 2024, describing the man as “courageous” and a “martyr.”",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Elias Rodriguez",
      "weight": 0.09217254
    },
    {
      "name": "Rodriguez",
      "weight": 0.088078514
    },
    {
      "name": "federal court",
      "weight": 0.08248682
    },
    {
      "name": "Israeli Embassy",
      "weight": 0.07732416
    },
    {
      "name": "Israeli Embassy staffers",
      "weight": 0.07719003
    },
    {
      "name": "federal authorities",
      "weight": 0.07684674
    },
    {
      "name": "court documents",
      "weight": 0.06937289
    },
    {
      "name": "other crimes",
      "weight": 0.0688467
    },
    {
      "name": "Sarah Milgrim",
      "weight": 0.0684321
    },
    {
      "name": "Yaron Lischinsky",
      "weight": 0.06765379
    }
  ],
  "topics": [
    {
      "name": "Murder"
    },
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9697265625
    },
    {
      "name": "/News/Other",
      "score": 0.96240234375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.95947265625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.8310546875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.68359375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.64990234375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.405029296875
    },
    {
      "name": "/People & Society/Other",
      "score": 0.305419921875
    }
  ],
  "sentiment": {
    "positive": 0.06933594,
    "negative": 0.65283203,
    "neutral": 0.27807617
  },
  "summary": "Elias Rodriguez, the man accused of fatally shooting two staff members of the Israeli Embassy in Washington, has been indicted on federal hate crime and murder charges. The indictment, filed in federal court in D.C., charges him with nine counts, including a hate crime resulting in death. The Justice Department may pursue the death penalty. Rodriguez is accused of gunning down Yaron Lischinsky and Sarah Milgrim as they left an event at the museum in May. Prosecutors have described the killing as planned and calculated. Rodriguez had previously been charged with murder of foreign officials and other crimes, and the hate crimes charges were added after prosecutors brought the case to a grand jury.",
  "shortSummary": "Elias Rodriguez, accused of killing two Israeli Embassy employees outside a Jewish museum in Washington, was indicted with nine counts of hate crime and murder.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "899041256de4458ebc3b62348d593d98",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Elias Rodriguez has been indicted on federal hate crime and murder charges for the fatal shooting of two Israeli Embassy staff members outside a Jewish museum in Washington. The indictment includes nine counts, with prosecutors alleging that Rodriguez was motivated by antisemitism, as he reportedly shouted pro-Palestinian statements during and after the attack. Authorities describe the shooting as premeditated, with Rodriguez traveling from Chicago specifically for the event and planning the attack in advance.",
  "argos_id": "TZUGCVYFQ"
}