{
  "url": "https://www.usatoday.com/story/news/nation/2025/08/07/geomagnetic-storm-aurora-northern-lights/85543888007/",
  "authorsByline": "Eric Lagatta",
  "articleId": "9045d94b3bda4800ba01fd8669689970",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/05/11/NREG/73652646007-eug-051124-northern-lights-03.jpg?crop=4923,2770,x0,y518&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:55:04+00:00",
  "addDate": "2025-08-07T13:58:39.946895+00:00",
  "refreshDate": "2025-08-07T13:58:39.946897+00:00",
  "score": 1.0,
  "title": "Could northern lights appear in US this week? Geomagnetic storm could trigger auroras",
  "description": "A coronal mass ejection hurtling from the sun toward Earth could trigger a geomagnetic storm, making the northern lights visible in up to 18 US states",
  "content": "• The auroras are a natural light display in Earth's sky that are famously best seen in high-latitude regions of the Northern and Southern hemispheres.\n• The possible geomagnetic storm could be strong enough to trigger views of the northern lights, also known as auroras, in some northern and upper Midwest states.\n• A minor-moderate geomagnetic storm could also cause \"manageable effects to some technological infrastructure,\" according to NOAA.\n\nWhen experienced stargazers in the continental United States hear the words, \"geomagnetic storm,\" likely one question comes to mind: Are we getting some northern lights?\n\nIn this case, the answer is definitive: Yes.\n\nAn explosion on the sun's outermost atmosphere of charged particles, known as a coronal mass ejection, has been hurtling toward Earth since Aug. 5, according to the National Oceanic and Atmospheric Administration. The agency's Space Weather Prediction Center has since been tracking the ejection, which it said has the potential to soon trigger a geomagnetic storm on Earth.\n\nWhat does that mean for skywatchers? Well, the particles flowing from the sun could interact with our planet's magnetosphere in ways that trigger the northern lights, also known as the aurora borealis.\n\nFor the next two nights, the luminous green and red glow of the auroras may be more widely visible than is typical in up to 18 states in the U.S.\n\nHere's everything to know about the solar storm, as well as where and when to see the northern lights it could produce in the U.S.\n\nWeaker solar activity won't be noticeable here on Earth.\n\nBut a geomagnetic storm with enough energy output has the potential to disrupt satellites, communications systems, and even ground-based technologies like power grids if directed at our planet. In extreme cases, powerful solar events even pose risks to spacecraft and astronauts, NASA says.\n\nAbout a year ago, in May 2024, a historically powerful geomagnetic storm was responsible for some reports of power grid irregularities and interference with GPS signals – even farming equipment. On the bright side, it also unleashed spectacular views of the northern lights in parts of the country where auroras are not often visible.\n\nIn this case, a rapid, intense flash of electromagnetic energy ranks as a G1-G2 on NOAA's scale, indicating a minor-moderate geomagnetic storm that could cause \"manageable effects to some technological infrastructure,\" the agency stated.\n\nA moderate geomagnetic storm is also strong enough to unleash views of the northern lights, also known as auroras, in some northern and upper midwest states.\n\nWhat are the northern lights?\n\nThe auroras are a natural light display in Earth's sky that are famously best seen in high-latitude regions of the Northern and Southern hemispheres.\n\nThe phenomenon is caused when electrically charged particles from space enter Earth's atmosphere and collide with molecules and gases like oxygen and nitrogen, causing the atmospheric particles to gain energy. To return to their normal state, the particles release that energy in the form of light, according to the University of Alaska at Fairbanks Geophysical Institute website, which tracks the phenomenon.\n\nAs auroras form, Earth's magnetic field redirects the particles toward the poles through a process that produces a stunning display of rays, spirals and flickers that have fascinated humans for millennia. Whether hues of green, red, blue and even pink dance about in the sky depends on the altitude where the collisions occur, as well as the composition and density of the atmosphere at the time.\n\nWhere could auroras be visible?\n\nFor most of the time, auroras are best seen around the magnetic poles of the Northern and Southern hemispheres in Europe, Asia and North America. In the U.S., Alaska is well known to have the best viewing opportunities for the northern lights.\n\nBut a geomagnetic storm tracked by the National Oceanic and Atmospheric Administration is expected to make the auroras visible farther from the poles.\n\nThe geomagnetic activity detected by NOAA's Space Weather Prediction Center has a Kp index of 6 on Thursday, Aug. 7, meaning the northern lights will be active and brighter further from the poles, according to the agency.\n\n\"At this geomagnetic activity level, it might be possible to see the aurora from the northern edge of the United States,\" NOAA says on its website.\n\nIn the U.S., the auroras will be visible Thursday to at least the northern parts of the following states:\n\nA thin red \"viewline\" representing the southern-most locations from which you may see the aurora on the northern horizon extends to:\n\nThe geomagentic storm will be less powerful Friday, Aug. 8, but is forecast to still be strong enough to trigger the northern lights once again across the northern U.S.\n\nBy then, though, NOAA predicts the KP index will be downgraded to a 5, which still means the auroras are still bright further than usual from the poles.\n\n\"If you are in the right place, these aurora can be quite pleasing to look at,\" according to NOAA's description of of 5-rating on the KP scale.\n\nWhen, how to see the northern lights\n\nEven though conditions are prime for more impending aurora shows, experts have long struggled to accurately forecast exactly when and where the phenomenon will ever occur. Even the best predictions can accurately be made only a few days or even hours in advance.\n\nBut as a rule of thumb, if the weather is clear, the best aurora is usually visible within an hour or two of midnight, according to NOAA. And if it looks as if the northern lights will flare up near you, you should get away from cities and travel to dark locations free from light pollution so you can best see them.\n\nThe agency also maintains an aurora dashboard that should help skygazers track the phenomenon. NOAA's 30-minute aurora forecast may be particularly useful for regular updates on viewing opportunities.\n\nEric Lagatta is the Space Connect reporter for the USA TODAY Network. Reach him at elagatta@gannett.com",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/graphics/2025/08/06/sun-solar-flares-sunspot-auroras-earth-impact/85530378007/",
    "https://www.usatoday.com/story/news/nation/2025/04/16/northern-lights-forecast-visible-aurora-borealis/83113563007/",
    "https://www.usatoday.com/story/news/weather/2024/05/18/northern-lights-forecast-when-will-they-appear-again/73704951007/",
    "https://www.gi.alaska.edu/monitors/aurora-forecast",
    "https://app.adjust.com/1el9h6z4",
    "https://www.usatoday.com/picture-gallery/news/nation/2024/05/11/solar-storm-northern-lights-visible-us-auroras/73654755007/",
    "https://www.swpc.noaa.gov/products/aurora-viewline-tonight-and-tomorrow-night-experimental",
    "https://www.swpc.noaa.gov/products/aurora-30-minute-forecast",
    "https://www.usatoday.com/story/news/nation/2024/05/10/severe-solar-storm-2024/73642315007/",
    "https://www.usatoday.com/story/news/nation/2025/07/25/rocket-lab-neutron-launch/85352652007/",
    "https://www.swpc.noaa.gov/noaa-scales-explanation",
    "https://www.usatoday.com/story/news/nation/2025/08/05/jupiter-venus-conjunction-pairing/85522877007/",
    "https://www.usatoday.com/story/graphics/2024/05/18/northern-lights-colors-explained/73731506007/",
    "https://www.usatoday.com/picture-gallery/news/nation/2025/07/16/perseid-meteor-shower-photos/85236180007/",
    "https://www.usatoday.com/story/entertainment/movies/2025/07/28/apollo-13-imax-release-nasa-tom-hanks/85402136007/",
    "https://www.swpc.noaa.gov/news/g1-g2-minor-moderate-watch-issued-08-09-aug-2025",
    "https://www.spaceweather.gov/content/tips-viewing-aurora",
    "https://www.usatoday.com/story/news/nation/2024/05/14/northern-lights-solar-storms-farmers-tractors-gps/73687368007/",
    "https://www.usatoday.com/story/news/nation/2024/05/11/aurora-borealis-photos-northern-lights-seen-us-europe/73652013007/",
    "https://www.usatoday.com/story/news/nation/2025/06/18/nasa-sun-solar-flare-communications-blackouts/84256538007/",
    "https://www.usatoday.com/story/news/nation/2025/08/06/dumbbell-nebula-august-where/85523243007/",
    "https://www.swpc.noaa.gov/communities/aurora-dashboard-experimental",
    "https://www.usatoday.com/story/news/nation/2024/05/10/northern-lights-aurora-when-time/73638964007/",
    "https://www.usatoday.com/story/news/nation/2023/06/28/nasa-internet-apocalypse-solar-storm-prep/70361827007/",
    "https://www.usatoday.com/story/news/nation/2025/07/28/crew-10-nasa-spacex-starliner/85359166007/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "northern lights",
      "weight": 0.10137543
    },
    {
      "name": "auroras",
      "weight": 0.08781942
    },
    {
      "name": "Geomagnetic storm",
      "weight": 0.0858636
    },
    {
      "name": "geomagnetic storm",
      "weight": 0.0858636
    },
    {
      "name": "Northern",
      "weight": 0.08158438
    },
    {
      "name": "more impending aurora shows",
      "weight": 0.078636475
    },
    {
      "name": "light",
      "weight": 0.07003992
    },
    {
      "name": "charged particles",
      "weight": 0.059141926
    },
    {
      "name": "NOAA",
      "weight": 0.05677769
    },
    {
      "name": "Space Weather Prediction Center",
      "weight": 0.055426627
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Weather",
      "score": 0.91259765625
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.6181640625
    }
  ],
  "sentiment": {
    "positive": 0.07348633,
    "negative": 0.56591797,
    "neutral": 0.36083984
  },
  "summary": "A geomagnetic storm could trigger views of the northern lights, also known as auroras, in some northern and upper Midwest states. The National Oceanic and Atmospheric Administration (NOAA) has been tracking a coronal mass ejection from the sun's outermost atmosphere, known as an explosion of charged particles, which have been hurling toward Earth since Aug. 5. The agency's Space Weather Prediction Center has been monitoring the solar storm for potential activity. The storm could also cause \"manageable effects to some technological infrastructure\" if directed at Earth, potentially disrupting satellites, communications systems, and ground-based technologies like power grids. The aurora borealis are a natural light display in Earth's sky that are typically seen in high-latitude regions of the Northern and Southern hemispheres.",
  "shortSummary": "A possible geomagnetic storm could trigger auroras in some northern and upper Midwest states, potentially impacting telecommunications, weather systems, and technology.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2b7093f7fa834d8c965c1a7366383a92",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/news/nation/2023/06/28/nasa-internet-apocalypse-solar-storm-prep/70361827007/",
      "text": "'Internet apocalypse': How NASA's solar-storm studies could help save the web\nThe emergence of an impending solar storm has brought with it the remote possibility that within the next decade, the people of Earth could be left without internet access for months.\nIf the internet fails on a scale that large, the consequences could be devastating — causing billions of dollars of losses per day to the U.S. economy and impeding the production and supply chains for essential materials like food and medicine. But scientists at NASA are seeking to prevent such a catastrophe with the launch years ago of a probe that will allow them to study and prepare for how a solar storm could effect the planet's infrastructure.\nSo, how likely is it that humankind could face what many have deemed the \"internet apocalypse?\"\nHere's what we know:\nUFO hearing: Craving more aliens? Here are 3 UFO docuseries streaming now\nSolar flares lead to threatening solar storms\nSolar wind is created by the outward expansion of charged particles from the Sun's corona on the outermost atmosphere, according to NASA. Though much less dense than wind on Earth, it is much faster — typically blowing at speeds of one to two million miles per hour.\nDue to the winds that solar storms generate near the sun, the atmospheric impacts can potentially be felt on Earth. Solar flares and coronal mass ejections drive the storms, which release solar particles and electromagnetic radiation toward our planet, according to NASA.\nAs the frequency of coronal mass ejections increases at the height of its 11-year cycle, which NASA said is expected to be in 2025, electromagnetic activity on the sun peaks. What that so-called \"solar maxiumum\" means for us earthlings is that the risk for disruption on our planet increases.\nThe activity has the potential to cause geometric storms, which could hinder satellite signals, radio communications, internet and electrical power grids — resulting in a technological collapse.\nA small chance exists that the solar storm could trigger an outage\nThe chances of a storm triggering a cataclysmic internet outage are minimal, according to one study from two years ago. But the threat is still nothing to scoff at.\nA 2021 study — published by Sangeetha Abdu Jyothi, a computer science expert at the University of California, Irvine — concluded that a 1.6% to 12% chance exists that an extended disruption to the internet could occur within the next decade due to a solar storm.\nThe study goes on to estimate that a failure of that magnitude could cost the U.S. economy — where the risk of internet disruption is higher than in Asia — as much as $7 billion per day.\nTo the moon and back: Astronauts get 1st look at Artemis II craft ahead of lunar mission\nThis sort of disruption is not unprecedented\nA destructive solar storm in 1989 caused electrical blackouts across Quebec for 12 hours, according to NASA, plunging millions of Canadians into the dark and closing schools and businesses.\nBut it was in 1859 when the most intense solar storm on record, the Carrington Event, wreaked its havoc. The storm sparked fires at telegraph stations and prevented messages from being sent.\nA NASA probe could be key to staving off internet failure\nYears ago, the space agency released the Parker Solar Probe in an effort to avert what the Weather Channel referred to in a June report as the \"internet apocalypse.\"\nThe spacecraft launched in 2018 on a journey that in 2021 brought it close to the sun's surface, entering its upper atmosphere, the corona, where the solar wind is generated, according to NASA. It was there where the probe endured harsh conditions to gather vital information about the sun, which NASA researchers said lead to new insights about how solar winds reach supersonic speeds and impact the larger space weather system.\n\"Just as landing on the Moon allowed scientists to understand how it was formed, touching the very stuff the Sun is made of will help scientists uncover critical information about our closest star and its influence on the solar system,\" the agency said in a statement at the time.\nBecause of the probe mission, NASA also earlier this year learned that the solar wind could be largely fueled by small-scale jets of energy, known as “jetlets,” at the base of the corona.\n“The findings make it much easier to explain how the solar wind is accelerated and heated,” Craig DeForest, a solar physicist at the Southwest Research Institute in Boulder, Colorado, said in NASA's report. “We’re not finished with the puzzle yet, but this is a major step forward for understanding a central mystery of solar physics.”\nMore recently, NASA created a new computer model that combines artificial intelligence and satellite data that \"could sound the alarm for dangerous space weather\" like a cosmic tornado siren. The new technology can predict where an impending solar storm will strike Earth with a 30-minute warning, vital minutes that could be the time needed to prepare and prevent severe impacts on power grids and other critical infrastructure.\nAn international team of researchers at the Frontier Development Lab — a public-private partnership that includes NASA, the U.S. Geological Survey, and the U.S. Department of Energy — have been using artificial intelligence to look for connections between the solar wind and geomagnetic disruptions that wreak havoc on technology. An AI method called “deep learning,” allows researchers to trains computers to recognize patterns based on previous examples.\n\"There could one day be solar storm sirens that sound an alarm in power stations and satellite control centers around the world,\" NASA researchers predict, \"just as tornado sirens wail in advance of threatening terrestrial weather in towns and cities across America.\"\nEric Lagatta covers breaking and trending news for USA TODAY. Reach him at elagatta@gannett.com and follow him on Twitter @EricLagatta."
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2024/05/14/northern-lights-solar-storms-farmers-tractors-gps/73687368007/",
      "text": "Solar storm not only unveiled northern lights. It caused technology issues for farmers.\nWidespread reports have surfaced of farmers in the U.S. and Canada who experienced disruptions in their GPS systems amid the powerful solar storm that hit Earth on Friday.\nThe powerful solar storm that made those dazzling northern lights visible across the U.S. also reportedly caused some headaches for North America's farmers.\nAnd it couldn't have come at a worse time.\nSolar flares erupting on the sun's surface sent coronal mass ejections hurtling toward Earth on Friday, causing a geometric storm that interfered with farming equipment at the height of planting season. Tractors and other pieces of equipment relying on GPS succumbed to navigational errors when those charged particles, courtesy of the sun, interacted with Earth's magnetic field.\nSuch technology has become indispensable to many farmers, who have long said it serves as a tracking or guidance system to help them plant precisely and map field boundaries, according to Rural Roots Canada. Reports and warnings across the continent indicate that for many farmers, those operations came to a temporary halt during the weekend.\nHere's what to know:\nNorthern lights: Solar storm makes auroras visible to much of US, world during solar storms\nGPS outages caused by solar storm reported in U.S, Canada\nFor more than two weeks, Minnesota farmer Patrick O'Connor's plans to plant corn had been thwarted by rain.\nO'Connor told The New York Times that he had hoped to catch up on his planting on Friday night, before a much different kind of storm once again undermined him.\nAmid the geometric storm, O'Connor said he received a warning about his GPS system. But when he called a technical help line, a message informed him that an outage had occurred and nothing could be done to fix it.\n\"I've never dealt with anything like this,\" O'Connor told the Times.\nIn Nebraska, another farmer told 404 Media, an online technology-centric publication, that the solar storm similarly shut down all of his operations.\n“All the tractors are sitting at the ends of the field right now,\" the farmer, Kevin Kenney, told the outlet. “No GPS.\"\nIn Canada, where communications disruptions were reportedly minimal, agricultural groups on Facebook were filled with posts about widespread GPS outages, according to Rural Roots.\nThe disruptions didn't come out of nowhere for farmers like Kenney and O'Connor. Farm equipment suppliers had previously warned of the storm's impending arrival and the disruptions it could cause.\nOn Saturday, Landmark Implement, which sells John Deere farming equipment in the Midwest, advised farmers that the storm had caused the accuracy of its systems to be “extremely compromised.”\n\"We are in search of tool(s) to help predict this in the future so that we can attempt to give our customers an alert that this issue may be coming,\" the company said in its statement. \"We do believe this (is a) historic event and it isn’t something that we are going to have to continue to battle frequently.\"\nGeometric storm was most severe since 2003\nSeven coronal mass ejections from the solar flares entered Earth's outer atmosphere Friday – a day after the National Oceanic and Atmospheric Administration issued a rare storm watch for the first time in 19 years.\nThe charged particles, when released toward Earth, have the potential to interfere with our infrastructure, causing disruptions to the electric power grid, radio and satellite operations. Because the sun is reaching the height of its 11-year solar cycle, this solar storm was the strongest solar storm to reach Earth since October 2003.\nAs anticipated, sparse reports of power grid irregularities and functional decreases in high-frequency, communications and GPS systems did surface during the weekend, according to, the National Oceanic and Atmospheric Administration.\nThe powerful geometric storm also unleashed spectacular views of the northern lights.\nMinor storms were reportedly still possible Tuesday, and more solar flares are possible in the near future as the sun continues to become more active at the height of its 11-year cycle.\nEric Lagatta covers breaking and trending news for USA TODAY. Reach him at elagatta@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/graphics/2025/08/06/sun-solar-flares-sunspot-auroras-earth-impact/85530378007/",
      "text": "The sun is spewing massive solar flares toward Earth. Here's what happens next.\nAfter weeks of reduced activity, the sun erupted with three powerful flares on a single day. That could send solar flares toward Earth, impacting electronics and making it possible to view the northern lights.\nThese blasts of solar radiation, known as coronal mass ejections, or CMEs, came from the AR4168 sunspot region on Aug. 3-4, according to Space.com and EarthSky. It fired its most powerful outburst, an M4.4-class flare, on Aug. 5. Space.com reports that the explosions could provide an opportunity to view the northern lights in northern Maine and Michigan on Aug. 8.\nHow Earth's atmosphere shields it from solar flares\nUnable to view our graphics? Click here to see them.\nAlthough no significant \"space weather\" effects have been verified so far, one flare might have sent a small burst in Earth's direction. Space physics student and aurora chaser Vincent Ledvina posted on X that it has a 12% chance of impact and could arrive around midnight Coordinated Universal Time on Aug. 7, according to Space.com.\nThe Earth's atmosphere and magnetic field shield us from most of the sun's radiation, so solar flares are unlikely to harm people or animals directly on the surface. But the bursts can cause problems with technology and infrastructure.\nImpact of solar flares on Earth\nAR3038, another area of several active sunspots, also could release more M-class solar flares, the second-most powerful of the five classifications. The strongest solar flares are X-class outbursts, according to NASA. Flares of the M class, which are 10 times smaller than those of the X class, are followed by flares of the C class, B class, and A class, which are too weak to have a major impact on Earth.\nThe National Oceanic and Atmospheric Administration has classified solar flares into these five categories. The intensity of the X-rays they emit determines their identification. Like the Richter scale used to gauge earthquake intensity, each class letter denotes a tenfold increase in energy production, according to Space.com. Flares can last minutes to hours and can be seen as bright spots on the sun from telescopes.\n- A: Smallest flare\n- B: 10 times more powerful than A\n- C: 10 times more powerful than B\n- M: 10 times more powerful than C\n- X: 10 times more powerful than M\nCONTRIBUTING George Petras"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/06/dumbbell-nebula-august-where/85523243007/",
      "text": "One of 'easiest-to-observe nebulas' will be visible in August: Where, how to see it\nThe \"dumbbell nebula\" should be visible throughout August and beyond high in the sky anywhere in the United States.\nStargazers have plenty of reasons to look up throughout August – a month marked by meteor showers, planetary conjunctions and even a visible nebula.\nYes, a formation known as the \"dumbbell nebula\" – nicknamed because it looks like, well, a dumbbell – should be easy to spot throughout the month, NASA said in an August skywatching guide.\nBut unlike other cosmic phenomena that will appear in August, the \"dumbbell nebula\" unfortunately won't be visible to the naked eye. The good news? You still don't need any especially advanced equipment to see it.\nHere's what to know about the \"dumbbell nebula\" and how to see it in the August skies.\nWhat is a nebula?\nA nebula, such as the two that the Vera C. Rubin Observatory analyzed earlier in 2025, is a luminescent giant cloud of dust and gas in space.\nA nebula could be the result of an explosion of a dying star such as a supernova, which throws out gas and dust, according to NASA. Other nebulae are regions where new stars are beginning to form, such as the Cat's Paw nebula that the James Webb Space Telescope recently studied in unprecedented detail.\nWhat is the 'dumbbell nebula?'\nThe \"dumbbell nebula,\" also known as Messier 27, is what astronomers refer to as a planetary nebula due to its round, planet-like appearance when viewed through a telescope, according to NASA.\nSpotted in 1764 by French astronomer Charles Messier, the \"dumbbell nebula\" is the first planetary nebula ever discovered. It's located 1,200 light-years away in the constellation Vulpecula.\nThe result of an aging star that shed its outer layers to create a colorful glow, the \"dumbbell nebula\" is composed of knots of gas and dust – some of which resemble fingers pointing at the central star.\nThe formation is also enormous.\nSome of the isolated clouds of gas and dust are 10.5 billion to 34.7 billion miles wide – larger than the distance from the sun to Pluto. Each cloud contains as much mass as three Earths, according to NASA.\nWhen, where will 'dumbbell nebula' be visible in August?\nThe \"dumbbell nebula\" should be visible throughout August and beyond high in the sky anywhere in the United States.\nThe \"dumbbell nebula\" appears within a pattern of stars known as the Summer Triangle, which is in prime position in August for observers in the Northern Hemisphere.\nFortunately for stargazers, the formation is considered to be \"one of the easiest-to-observe nebulas in the sky,\" Chelsea Gohd of NASA's Jet Propulsion Laboratory said in a video with August skywatching tips.\nHow to see 'dumbbell nebula'\nStargazers will need binoculars or a small telescope to observe the \"dumbbell nebula,\" which can be found high overhead in the first half of each night in the Summer Triangle. Observers will be able to spot it a third of the way between bright stars Altair and Deneb.\nThe nebula will appear as a small, faint patch of light about a quarter of the width of a full moon."
    },
    {
      "url": "https://app.adjust.com/1el9h6z4",
      "text": "The USA TODAY news app gets you to the heart of the matter — fast. Whether it's money, sports, entertainment, or breaking news, get succinct, personalized coverage along with award-winning videos, captivating photography, and interactive user features. The point is — get major news coverage all in a compact device that fits right in the palm of your hand.\nAPP FEATURES\n• National and breaking news, including access to 200+ local publications.\n• News to the point: Easily keep up with news, sports, money, entertainment, health, and more with quick reads.\n• A personalized feed: Pick your favorite subjects in My Topics and receive a curated feed on the For You page.\n• eNewspaper: Just like our print edition but accessible on your mobile devices. And access to 200+ local eNewspapers.\n• Puzzles: Play Crossword, QuickCross, and Sudoku (tablet only) to keep your mind sharp.\n• Award-winning podcasts: Listen to your favorite USA TODAY NETWORK podcasts on demand.\n• Stay up-to-date with election news, analysis, and results.\nSubscription Information:\n• The USA TODAY app is free to download and all users can access a sampling of free articles every month.\n• Subscriptions are charged to your account at confirmation of purchase and automatically renew each month or year, unless turned off in your account settings at least 24 hours before the end of the current period. See \"Subscription Support\" in the app's Settings for more details and customer service contact information.\nMore Information:\n• Privacy Policy: https://cm.usatoday.com/privacy/\n• Terms of Service: https://cm.usatoday.com/terms/\n• Questions or comments? Visit http://www.usatoday.com/mobile-apps or email: mobilesupport@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/07/25/rocket-lab-neutron-launch/85352652007/",
      "text": "Could this California company challenge SpaceX’s Falcon 9? What to know about Rocket Lab\nRocket Lab has increasingly been in the news over mounting anticipation for the first launch of its upcoming Neutron rocket.\n- Rocket Lab is a launch service provider and spaceflight company founded in 2006 and based in Long Beach, California.\n- The Neutron is central to Rocket Lab's plans to shift from small satellite deployments to missions with heavier payloads.\n- Rocket Lab has already spent years reliably launching its smaller Electron rocket to deliver small satellites and other payloads to orbit for civil and commercial contractors.\nRocket Lab, a spaceflight company based in California, has spent years building up a reputation as a reliable launch service provider for small satellites.\nNow, though, the venture has its sights set on bigger targets: Procuring some of those lucrative government and commercial contracts that have long been the domain of Elon Musk's Texas-based SpaceX.\nMaybe you've heard about Rocket Lab's diminutive Electron launch vehicle, which the company bills as the second-most active rocket in the U.S. Or maybe you've heard about its next-generation Neutron spacecraft, which could soon be making its inaugural flight from Virginia.\nWhichever may be the case, here's everything to know for those interested in Rocket Lab and its future plans for spaceflight.\nWhat is Rocket Lab?\nRocket Lab is a launch service provider and spaceflight company founded in 2006 and based in Long Beach, California.\nThe company operates out of three launch pads at two launch sites, including one in New Zealand and two in Virginia at the Mid-Atlantic Regional Spaceport within NASA's Wallops Flight Facility.\nRocket Lab Neutron launch date\nRocket Lab has increasingly been in the news over mounting anticipation for the first launch of its upcoming Neutron rocket.\nThe satellite launch vehicle is central to Rocket Lab's plans to shift from small satellite deployments to missions with heavier payloads.\nBut when exactly the Neutron rocket could make its orbital debut has yet to be determined.\nRocket Lab continues to work through a checklist of requirements before Neutron can get off the ground for its maiden flight. That includes integrating – or stacking – the rocket stages and getting its commercial launch license from the Federal Aviation Administration, according to the company's first-quarter earnings presentation provided to the USA TODAY Network.\nThe good news? Construction on infrastructure at the launch pad is on schedule, according to the report. Earlier in July, Rocket Lab also announced that the company had awarded a contract to shipbuilder Bollinger Shipyards to support the build of a 400-foot ocean landing platform named \"Return On Investment.\"\nBut the challenge for Rocket Lab will be in transporting the components of the Neutron to the facility, according to the website TechCrunch. The vehicle must be shipped in segments to Rocket Lab's Launch Complex 3 in Virginia, where it will be fully mated as a rocket.\nCould Neutron challenge SpaceX, Falcon 9?\nMany space industry analysts have said that Neutron could emerge as a credible challenger to SpaceX’s Falcon 9 in the medium-lift launch market.\nRocket Lab is developing the Neutron rocket – which already has contracts with the Department of Defense – for commercial, civil and military space operations. That includes satellite constellation deployments, cargo resupply missions to the International Space Station and interplanetary missions.\nThe arena is one that SpaceX, founded by billionaire Elon Musk in 2002, has dominated for years with its Falcon 9 rocket – one of the most active rockets in the world. The Falcon 9 is routinely the rocket of choice to launch NASA astronaut missions to the International Space Station and is the exclusive launch provider for Musk's Starlink satellite deliveries.\nAt 141-feet-tall, Neutron is smaller in stature than SpaceX's two-stage, 230-foot Falcon 9. But like the Falcon 9, Neutron is designed to be reusable so that it can launch more frequently.\nIts design features an integrated system that brings Neutron’s first stage and payload fairings back to Earth as a single stage. Capable of delivering about a 14-ton (more than 28,600 pounds) payload to low-Earth before landing, Neutron is powered by Rocket Lab’s newly developed Archimedes engine.\nRocket Lab's emergence also comes at a time of mounting public discord between Musk and President Donald Trump.\nWhat is Rocket Lab's Electron rocket?\nRocket Lab has already spent years reliably launching its smaller Electron rocket to deliver small satellites and other payloads to orbit for civil and commercial contractors.\nAt 59 feet tall, Electron is capable of carrying just 661 pounds of cargo to space, according to Rocket Lab. A version of the rocket is also tailored for Rocket Lab's hypersonic HASTE launches.\nOne of the two launch complexes where Electron can launch is right next door to the Neutron's new launch complex.\nSince its first orbital launch in January 2018, the Electron has delivered more than 200 satellites to orbit and become one of the most frequently launched U.S. rockets, second only to the Falcon 9, according to Rocket Lab.\nIn June alone, the Electron launched four times on both government and commercial missions, according to Rocket Lab.\nThe most recent mission came June 28 when the Electron launched a single satellite to space for \"a confidential commercial customer,\" Rocket Lab announced in a press release. The mission was the second of two launches from the same launch site in less than 48 hours, a new launch record for the company.\nIs Rocket Lab a good stock to buy? Whether to invest\nUnlike SpaceX, Rocket Lab is publicly traded.\nWhile Rocket Lab's stock is up 800% over the past year, according to Forbes, the company is not yet profitable.\n\"A lot hinges on Rocket Lab’s ability to evolve its revenue model and reach sustained profitability,\" Sasirekha Subramanian, an equity research content expert, wrote for Forbes.\nEric Lagatta is the Space Connect reporter for the USA TODAY Network. Reach him at elagatta@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2024/05/10/northern-lights-aurora-when-time/73638964007/",
      "text": "When could you see the northern lights? Aurora forecast for over a dozen states this weekend\nRead the latest on the northern lights this weekend: Saturday's forecast says parts of U.S. could see auroras.\nA series of strong solar flares that the sun has been emitting since Wednesday morning could cause the northern lights to become visible this weekend to a wide swath of the United States.\nThe coronal mass ejections (CMEs) hurtling toward Earth prompted the National Oceanic and Atmospheric Administration to issue a rare Severe (G4) Geomagnetic Storm Watch on Thursday for the first time in 19 years. The geomagnetic storms that the CMEs would produce pose a limited threat to our communications, but they can also trigger the aurora borealis, better known as the northern lights.\nAnd because the sun is at the height of its 11-year-cycle, the auroras have a very good chance of being seen by more Americans than usual.\nHere's what to know about the northern lights, and when and where you may catch a glimpse of them this weekend.\nGood news on northern lights: Experts predict years of awesome aurora viewing\nWhat are the northern lights?\nThe auroras are a natural light display in Earth's sky that are famously best seen in high-latitude regions.\nThe northern lights materialize when energized particles from the sun reach Earth's upper atmosphere at speeds of up to 45 million mph, according to Space.com. Earth's magnetic field redirects the particles toward the poles through a process that produces a stunning display of rays, spirals and flickers that has fascinated humans for millennia.\nGeomagnetic storm: Solar storm is powerful enough to disrupt communications: Why NOAA says not to worry\nWhen might the northern lights be most visible?\nThis week's solar activity brings with it the increased possibility of seeing the aurora across the U.S.\nThough the timing is uncertain and the northern lights can be a particularly fickle forecast, officials at NOAA said the coronal mass ejections could reach Earth as early as Friday evening into Saturday, Shawn Dahl, a space weather forecaster at SWPC, told reporters Friday morning during a news briefing.\nExperts from NOAA said auroras could be visible into Sunday.\nThe best aurora is usually within an hour or two of midnight (between 10:00 p.m. and 2:00 a.m. local time). These hours expand towards evening and morning as the level of geomagnetic activity increases, according to NOAA.\nWhere might the northern lights be best seen in the US?\nThe northern half of the U.S. is forecasted to be in the view path where the auroras may be most visible.\nThe best chances appear to be in northern Montana, Minnesota, Wisconsin and the majority of North Dakota, according to SWPC's experimental Aurora viewline. The visibility for viewing will also depend on local weather conditions and city lights.\nExperts at NOAA said the northern lights may even be visible as far south as Alabama and Northern California. If all else fails, experts even recommend taking a photo of the night sky with your cell phone – you never known what you may capture.\n\"Things that the human eye can't see, your phone can, so it'll be interesting to see just how far south we're getting aurora images this time,\" said Brent Gordon, Chief of Space Weather Services Branch for SWPC, on the Friday call with reporters.\nThe National Weather Service on Friday shared an aurora forecast for Friday night and early Saturday morning, showing more than a dozen states with at least a chance to see the lights.\nHow does the solar maximum influence the northern lights?\nExplosive bursts of radiation known as solar flares and coronal mass ejections (eruptions of solar material) drive the geometric storms, releasing solar particles and electromagnetic radiation toward our planet.\nAs the frequency of coronal mass ejections increases at the height of its 11-year cycle, which NASA said is expected to be in 2025, electromagnetic activity on the sun peaks. What that so-called \"solar maximum\" means for us is that the risk increases for disruption to satellite signals, radio communications, internet and electrical power grids.\n'God's Hand' revealed in cosmos: Telescope images reveal 'cloudy, ominous structure' known as 'God's Hand' in Milky Way\nLast December, a powerful burst of energy created the largest solar flare that NASA had detected since 2017.\nThe last G4 level solar storm hit Earth in March, one of only three storms of that severity observed since 2019, according to NOAA's Space Weather Prediction Center.\nJust like in March, the upcoming solar storm will have particles flowing from the sun that get caught up in Earth's magnetic field, causing colorful auroras to form as they interact with molecules of atmospheric gases. The resulting glowing green and reddish colors of the aurora may be quite a sight to see.\nContributing: Doyle Rice, USA TODAY\nEric Lagatta covers breaking and trending news for USA TODAY. Reach him at elagatta@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/movies/2025/07/28/apollo-13-imax-release-nasa-tom-hanks/85402136007/",
      "text": "'Apollo' 13 heads to IMAX: What to know about the real mission behind the movie\nThe Oscar-winning film directed by Ron Howard tells the true story of a near-disastrous 1970 NASA lunar mission.\n- \"Apollo 13\" stars Tom Hanks, the late Bill Paxton and Kevin Bacon as three NASA astronauts who must navigate safely back to Earth after their spacecraft encounters troubles on the way to the moon.\n- To mark the Oscar-winning film's 30th anniversary, \"Apollo 13\" will soon head to IMAX theaters.\n- 'Apollo 13\"' is inspired by the nearly disastrous April 1970 mission of the same name that launched from the Kennedy Space Center in Florida.\nHouston, we have ... an IMAX release.\nMore than 55 years ago, three astronauts en route to the moon had to abandon their dreams of reaching the lunar surface when their spacecraft encountered some serious trouble. The spacefarers' perilous journey back to Earth was later recounted in 1995's \"Apollo 13,\" the Oscar-winning film with the same title as the now-infamous NASA mission.\nTo mark the movie's 30th anniversary, \"Apollo 13\" is heading to IMAX theaters.\nDirected by Ron Howard and starring Tom Hanks, the late Bill Paxton and Kevin Bacon, \"Apollo 13\" bills itself as \"the dramatic true story\" of how NASA engineers in Houston worked with the three astronauts to get them home safely.\nBut how much of Hollywood's retelling is fact. vs fiction?\nHere's what to know about \"Apollo 13,\" its impending cinematic re-release and the true story of the real-life mission that inspired the film.\n'Apollo 13' heading to IMAX theaters in US\nUniversal Pictures and IMAX announced on Thursday, July 24, that \"Apollo 13\" is heading back to IMAX theaters, which are known for having larger screens than a typical movie theater and steep stadium seating.\nThe IMAX premiere on Sept. 19 is meant to celebrate the 30th anniversary of the film's original June 30, 1995, theatrical release.\nThis isn't the first time \"Apollo 13\" was shown in IMAX long after its initial theatrical run: A digital remaster of the movie was released for IMAX in 2002.\nHow accurate was 'Apollo 13' movie? What to know about NASA mission\n\"Apollo 13\" is inspired by the nearly disastrous April 1970 mission of the same name in which NASA's third planned mission to the moon had to be abandoned when an oxygen tank exploded on the service module.\nFor the three astronauts selected for the mission – Jim Lovell, Jack Swigert and Fred Haise – the critical mishap two days into the mission transformed the spaceflight into a life-or-death situation. Relying on backup life-support systems on the Apollo Lunar Module meant to transport them to the moon's surface from orbit, the astronauts used primitive methods of celestial navigation to make their way back to Earth.\nWhile in constant communication with flight controllers in Houston, the astronauts safely made a water landing on April 17, 1970, in the South Pacific Ocean – six days after launching from NASA's Kennedy Space Center in Florida.\nRon Howard, who directed \"Apollo 13,\" went to great effort to ensure the on-screen depiction of the mission was as accurate and realistic as possible. Lovell and NASA experts consulted on the film, which was even partially filmed at the Kennedy Space Center.\nWho were the astronauts of NASA's Apollo 13 mission?\nThe mission was under the command of Cleveland, Ohio, native Jim Lovell, then a veteran of three previous spaceflights who was selected as a NASA astronaut in September 1962.\nJack Swigert, the command module pilot, had been selected as a NASA astronaut in 1966. Swigert, a native of Denver, was a backup astronaut for the Apollo 13 mission and replaced astronaut Ken Mattingly, who was grounded after exposure to rubella.\nThe third crew member of Apollo 13 was Biloxi, Mississippi, native Fred Haise, the lunar module pilot who was part of the same astronaut class as Swigert.\nLovell, 97, and Haise, 91, are the two remaining living crew members of Apollo 13.\n'Apollo 13' 30th anniversary trailer\n'Apollo 13' cast: Tom Hanks, Bill Paxton, Kevin Bacon star\n\"Apollo 13\" features an ensemble cast portraying the mission's astronauts, their families and the NASA engineers who helped get them home.\nHere's a look:\n- Tom Hanks as NASA astronaut Jim Lovell\n- Bill Paxton as NASA astronaut Fred Haise\n- Kevin Bacon as NASA astronaut Jack Swigert\n- Gary Sinise as NASA astronaut Ken Mattingly\n- Ed Harris as Gene Kranz, NASA's chief flight director\n- Kathleen Quinlan as Marilyn Lovell"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/07/28/crew-10-nasa-spacex-starliner/85359166007/",
      "text": "Crew-10 astronauts to depart ISS: How they set stage for ‘stuck’ Starliner crew to leave\nFour Crew-10 astronauts arrived March 15 at the International Space Station, making it possible for NASA astronauts Butch Wilmore and Suni Williams, who crewed the Starliner, to depart.\n- Wilmore and Williams became fixtures of the news cycle when the vehicle they flew to the space station in June 2024 encountered a series of technical issues.\n- Williams and Wilmore eventually departed the space station with the Crew-9 team and safely landed March 17 off the Florida Coast following the arrival of the Crew-10 mission.\n- Now, the astronauts of the Crew-10 mission are due to return to Earth themselves following the impending arrival of their own replacements.\nIn mid-March, four spacefarers arrived at the International Space Station on a mission that at any other time would have been relatively routine and unremarkable.\nNASA astronauts Nichole Ayers and Anne McClain were joined by Japanese astronaut Takuya Onishi and Russian cosmonaut Kirill Peskov on a mission known as Crew-10 that took on far more significance than most of the regular ventures jointly carried out by SpaceX and NASA.\nAs expected, awaiting the Crew-10 contingent at the orbital outpost were months of scientific experiments tailored to be conducted in microgravity. Crucially, though, the mission also attracted plenty of headlines and fanfare as it cemented its place in spaceflight history for its role in ending the infamous Starliner saga.\nThe Crew-9 team may have arrived in September on a spacecraft with room for the two astronauts who crewed the doomed Boeing Starliner to hitch a ride home, but it was the arrival of the Crew-10 astronauts at the space station that set the stage for Butch Wilmore and Suni Williams to make their long-awaited homecoming.\nNow that the Crew-10 astronaut are soon due to depart the space station more than four months later, here's everything to know about the mission and why it made headlines.\nWhat was the Crew-10 mission? Astronauts relieve 'stuck' Starliner crew\nThe March 15 arrival of Crew-10 astronauts at the space station made it possible for astronauts Wilmore and Williams, who arrived in June on the doomed Starliner, to finally depart.\nThe mission got off the ground a day earlier from NASA's Kennedy Space Center. The U.S. space agency had been working toward a February liftoff before announcing in December 2024 that the mission had been pushed to late March to give SpaceX more time to prepare a new Dragon capsule.\nThe launch date was then moved up to mid-March – most likely because of pressure from President Donald Trump and SpaceX founder Elon Musk – when NASA decided to instead use a previously flown Dragon.\nThe Dragon docked at the orbital outpost after a 28-hour journey, allowing the crew to exit the vehicle and enter the space station through its Harmony module. Once aboard, the four Crew-10 spacefarers officially greeted the Expedition 72 crew members, including the astronauts who flew aboard the Starliner.\nWhat happened with the Boeing Starliner?\nSelected for the inaugural crewed flight of the Boeing Starliner, Wilmore and Williams became fixtures of the news cycle when the vehicle they flew to the space station in June 2024 encountered a series of technical failures.\nNASA and Boeing ultimately decided that the troubled Starliner capsule wasn't safe enough to crew and would instead undock and return to Earth without them.\nOn Sept. 28, 2024, NASA launched the SpaceX Crew-9 mission as planned, but with one crucial change: Just two astronauts – Nick Hague of NASA and Russian cosmonaut Aleksandr Gorbunov – headed to the space station on a Dragon, leaving two empty seats on their vehicle reserved for Wilmore and Williams.\nNASA opted to keep Williams and Wilmore at the station a few extra months rather than launch an emergency mission to return them to Earth and leave the station understaffed.\nWilliams and Wilmore eventually departed the space station with the Crew-9 team and safely landed March 17 off the Florida coast after the arrival of the Crew-10 mission.\nWhen will SpaceX launch Crew-11 astronauts on NASA mission?\nNow, the astronauts of the Crew-10 mission are set to return to Earth themselves after their own replacements arrive.\nThe Crew-11 mission is scheduled to launch no earlier than 12:09 p.m. ET Thursday, July 31, from near Cape Canaveral, Florida, according to NASA.\nAs the name suggests, Crew-11 is NASA and SpaceX's 11th science expedition to the International Space Station.\nThe missions, most of which last about six months, are contracted under NASA's commercial crew program. The program allows the space agency to pay SpaceX to launch and transport astronauts and cargo to orbit aboard the company's own vehicles, freeing up NASA to focus on its Artemis lunar program and other spaceflight missions, including future crewed voyages to Mars.\nSelected for the mission are NASA astronauts Zena Cardman and Mike Fincke; Japanese astronaut Kimiya Yui of the Japan Aerospace Exploration Agency (JAXA); and Russian Oleg Platonov, a Roscosmos cosmonaut.\nSpaceX uses its Falcon 9 rocket – one of the most active in the world – to launch the crew missions from Launch Complex 39A at NASA’s Kennedy Space Center. The astronauts themselves ride a Dragon crew capsule – the only U.S. spacecraft capable of carrying astronauts to and from the space station – which separates from the rocket in orbit.\nAhead of the planned launch, the Dragon has been stacked atop the Falcon 9 rocket, which was rolled out July 27 to the launch pad before being raised to a vertical position, according to NASA.\nWhen will the Crew-10 astronauts depart ISS and return to Earth?\nThe arrival of Cardman, Fincke, Yui and Platonov will ultimately pave the way for their predecessors, the Crew-10 contingent, to depart the space station and head back to Earth.\nBut the Crew-10 astronauts won't leave right away. What follows upon the arrival of any astronauts is a brief handover period in which the new crew members are familiarized with the orbital laboratory and station operations.\nMcClain, Ayers, Onishi and Peskov will depart a few days later on the same Dragon capsule that flew them to the space station. Mission teams also will have to review weather conditions off California, where the Dragon will splash down.\nWho else is at the International Space Station?\nAnother three spacefarers are also living and working about the International Space Station as members of Expedition 73.\nThey are NASA astronaut Jonny Kim and cosmonauts Sergey Ryzhikov and Alexey Zubritsky, who flew to the outpost in April.\nEric Lagatta is the Space Connect reporter for the USA TODAY Network. Reach him at elagatta@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/04/16/northern-lights-forecast-visible-aurora-borealis/83113563007/",
      "text": "There's still a chance to see northern lights in some states tonight: Here's what to know\nCanadians and residents of Alaska still have the best views of northern lights, but several northern U.S. states should still be able to have a coveted view of the stunning light display.\nThe northern lights revealed themselves to a handful of U.S. states Tuesday night, but if you missed out, you may still have a chance to catch a glimpse tonight.\nA powerful solar storm has sent particles flowing from the sun that are interacting with Earth's magnetosphere in ways that are triggering the northern lights, also known as the aurora borealis. While the solar storm could pose a minimal threat to things like satellites, GPS signals and power grids, the activity means the luminous green and red glow of the auroras may be more widely visible than is typical.\nCanadians and residents of Alaska still have the best views of northern lights, but several northern U.S. states should still be able to have a coveted view of the stunning light display Wednesday night.\nHere's what to know about the northern lights and how to see them.\nWhere will the auroras be visible?\nFor most of the time, auroras are best seen around the magnetic poles of the Northern and Southern hemispheres in Europe, Asia and North America. In the U.S., Alaska is well known to have the best viewing opportunities for the northern lights.\nBut a solar storm tracked by the National Oceanic and Atmospheric Administration has make the auroras visible farther from the poles.\nThe geomagnetic activity detected by NOAA's Space Weather Prediction Center has a Kp index of 5, meaning the northern lights will also be brighter, according to the agency.\n\"If you are in the right place, these aurora can be quite pleasing to look at,\" NOAA says.\nIn the U.S., the auroras became widely visible Tuesday, and may still visible Wednesday to at least parts of the following states:\n- Washington\n- Idaho\n- Montana\n- North Dakota\n- Minnesota\n- Wisconsin\nA thin red \"viewline\" representing the southern-most locations from which you may see the aurora on the northern horizon extends to:\n- Wyoming\n- South Dakota\n- Iowa\n- Michigan\n- New York\n- Vermont\n- New Hampshire\n- Maine\nWhen is the best time to see the northern lights?\nEven though conditions are prime for more impending aurora shows, experts have long struggled to accurately forecast exactly when and where the phenomenon will ever occur. Even the best predictions can accurately be made only a few days or even hours in advance.\nBut as a rule of thumb, if the weather is clear, the best aurora is usually visible within an hour or two of midnight, according to NOAA. And if it looks as if the northern lights will flare up near you, you should get away from cities and travel to dark locations free from light pollution so you can best see them.\nThe agency also maintains an aurora dashboard that should help skygazers track the phenomenon. NOAA's 30-minute aurora forecast may be particularly useful for regular updates on viewing opportunities.\nWhat causes the northern lights?\nThe auroras are a natural light display in Earth's sky that are famously best seen in high-latitude regions of the Northern and Southern hemispheres.\nThe phenomenon is caused when electrically charged particles from space enter Earth's atmosphere and collide with molecules and gases like oxygen and nitrogen, causing the atmospheric particles to gain energy. To return to their normal state, the particles release that energy in the form of light, according to the University of Alaska at Fairbanks Geophysical Institute website, which tracks the phenomenon.\nAs auroras form, Earth's magnetic field redirects the particles toward the poles through a process that produces a stunning display of rays, spirals and flickers that have fascinated humans for millennia. Whether hues of green, red, blue and even pink dance about in the sky depends on the altitude where the collisions occur, as well as the composition and density of the atmosphere at the time.\nWhy northern lights activity is increasing\nNow that the sun is at the height of its 11-year cycle, the increase in solar activity has more frequently fueled \"space weather\" that produces the right conditions for northern lights to flourish.\nRegions of intense magnetic activity known as sunspots are proliferating on the solar surface and are capable of releasing intense bursts of radiation resulting in solar flares that can hurtle toward Earth at the speed of light, according to NOAA. Some of the flares can be accompanied by coronal mass ejections, or clouds of plasma and charged particles, that emerge from the sun's outermost atmosphere, the corona.\nThese ejections can collide with Earth’s magnetosphere, the barrier protecting humanity from the harshest effects of space weather, to produce geomagnetic storms that unleash spectacular views of the northern lights in parts of the country where auroras are not often visible.\nWhat's more, because NASA expects the solar maximum to continue into 2025, aurora chasers should have plenty more opportunities to catch the northern lights."
    },
    {
      "url": "https://www.spaceweather.gov/content/tips-viewing-aurora",
      "text": "Tips on Viewing Aurora:\nViewing the aurora depends on four important factors\n- Geomagnetic Activity: If the geomagnetic field is active, then the aurora will be brighter and further from the poles. Geomagnetic activity is driven by solar activity and solar coronal holes and thus it waxes and wanes with time. The level of geomagnetic activity is indicated by the planetary K index or Kp. The Kp index ranges from 0 to 9.\n- For Kp in the range 0 to 2, the aurora will be far north, quite dim in intensity, and not very active.\n- For Kp in the range of 3 to 5, the aurora will move further from the poles, it will become brighter and there will be more auroral activity (motion and formations). If you are in the right place, these aurora can be quite pleasing to look at.\n- For Kp in the range 6 to 7, the aurora will move even further from the poles and will become quite bright and active. At this geomagnetic activity level, it might be possible to see the aurora from the northern edge of the United States.\n- For Kp in the range 8 to 9, the aurora will move even further towards the equator and it will become very bright and very active. These are the events that create the best aurora and the extended auroral oval will be observable by the most people. At these levels, aurora may be seen directly overhead from the northern states of the USA.\nIt should be noted that the relationship between Kp and auroral latitude are approximate and represent averages. There will be times when these relationships do not hold up exactly.\nThere is an approximate relationship between Kp and the equatorward extent of the auroral oval. This relationship holds true in geomagnetic latitude, not geographic. At Kp = 0, the equator ward edge of the auroral oval is approximately 66 degrees. And it moves equatorward about 2 degrees for each level of Kp. So for Kp = 1, the aurora would move down to 64 degrees, for Kp=2, it would move to 62 degrees, etc… until reaching Kp of 9 at 48 degrees magnetic latitude.\n- Location: Go towards the magnetic poles. The north magnetic pole is currently about 400 km (250 miles) from the geographic pole and is located in the islands of north east Canada. Find a place where you can see to the north ( or south if you are in the southern hemisphere). Given the right vantage point, say for example on top of a hill in the northern hemisphere with an unobstructed view toward the north, a person can see aurora even when it is 1000 km (600 miles) further north. It should be noted that if you are in the right place under the aurora, you can see very nice auroral displays even with low geomagnetic activity (Kp = 3 or 4).\n- It must be dark: Go out at night. Get away from city lights. The full moon will also diminish the apparent brightness of the aurora (not the actual brightness). One caveat that people often neglect to think of is that the high latitudes where aurora occur are also latitudes where it doesn’t get dark in the summer. So combining a summer vacation to the arctic with aurora watching usually doesn’t work. The aurora may still be there but it is only visible when it is dark.\n- Timing: Best aurora is usually within an hour or two of midnight (between 10 PM and 2 AM local time). These hours of active aurora expand towards evening and morning as the level of geomagnetic activity increases. There may be aurora in the evening and morning but it is usually not as active and therefore, not as visually appealing.\nThe best Seasons for aurora watching are around the spring and fall equinoxes. Due to subtleties in the way the solar wind interacts with Earth’s magnetosphere, there is a tendency towards larger geomagnetic storms, and thus better auroras, to occur near the equinoxes. However, the number of hours of darkness decreases (increases) rapidly near the spring (fall) equinox so this caveat must be considered for those traveling to see the aurora.\nBelow are maps showing the most southern extent of where aurora might be observable for different levels of the geomagnetic Kp index (and the NOAA G scale). It should be noted that the aurora can often be observed hundreds of kilometers (miles) equatorward of the actual aurora so these figures do not indicate where the aurora may be but rather the point from which it may be observed.\nAdditional Resources:"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/06/18/nasa-sun-solar-flare-communications-blackouts/84256538007/",
      "text": "Sun releases a powerful solar flare. But don't expect unusual northern lights in US\nThe explosive burst of radiation peaked on the evening of Tuesday, June 17, matching the intensity of the first of two solar flares detected in May.\nThe sun has emitted a powerful solar flare that has the capability to interfere with technology on Earth.\nThe explosive burst of radiation peaked on the evening of June 17, matching the intensity of the first of two solar flares detected in May.\nThis particular flare wasn't accompanied by a geomagnetic storm that can strike Earth's magnetic field and trigger the northern lights. But because the flare occurred on the sun's Earth-facing side, things like radio communications, power grids and navigation signals could be disrupted, according to the National Oceanic and Atmospheric Administration.\nReports have already surfaced of a shortwave radio blackout centered over the Pacific Ocean that was especially strong over Hawaii, according to NOAA.\nNASA also captured an image of the sun's bright energy burst, which it shared in a blog post.\nWhat are solar flares?\nConsidered our solar system's largest explosive events, solar flares occur when magnetic energy associated with sunspots is released into space, creating intense bursts of radiation. These flares are often associated with solar magnetic storms known as coronal mass ejections and can be as strong as a billion hydrogen bombs.\nSolar flares can last mere minutes or can drag on for hours, depending on their intensity. NASA classifies solar flares based on their strength, with A-class the smallest and X-class – which is what was recently detected – the largest.\nEach letter represents a tenfold increase in energy output and includes a scale of 1 to 9 in each class. The exception is the X-class, since there are flares that have been recorded exceeding 10 times the power of an X-1.\nIn May 2024, the largest solar flare since 2017 was detected, ranking at an X-8.7 magnitude. Then in 2025, a flare May 13 was classified as an X-1.2 , and another the next day was listed as an X-2.7.\nBut the most powerful flare measured with modern methods was in 2003. The event was so powerful it overloaded the sensors measuring it, cutting out at X-28, according to NASA.\nSolar flares and other solar activity, such as solar storms, increase every 11 years as the sun reaches the height of its 11-year cycle, the solar maximum, which last occurred in late 2024.\nNASA captures image of powerful solar flare\nThe flare detected recently was also classified as an X-1.2 magnitude, according to NOAA's Space Weather Prediction Center.\nNASA’s Solar Dynamics Observatory, which observes the sun, was able to capture an image of the event, which the agency said peaked at around 5:49 p.m. ET June 17.\nCould we see the northern lights?\nSolar flares emit radiation, mostly in the form of ultraviolet light and X-rays, that can hurtle toward Earth at the speed of light. Some of these flares can be accompanied by coronal mass ejections, or clouds of plasma and charged particles, that emerge from the sun's outermost atmosphere, the corona.\nThese ejections can collide with Earth’s magnetosphere, the barrier protecting humanity from the harshest effects of space weather, to produce geomagnetic storms that not only pose a hazard to earthly technologies but also play a role in unleashing northern lights.\nBut because this powerful flare was not accompanied by a coronal mass ejection, don't expect any unusual aurora activity. The Space Weather Prediction Center tracks the northern lights through an online dashboard.\nCould solar flare disrupt communications on Earth?\nWeaker solar flares won't be noticeable here on Earth.\nBut those with enough energy output to rank as an X-class have the potential to disrupt satellites, communications systems, and even ground-based technologies like power grids if directed at our planet. In extreme cases, powerful flares even pose risks to spacecraft and astronauts, NASA says.\nAbout a year ago, in May 2024, a historically powerful geomagnetic storm was responsible for some reports of power grid irregularities and interference with GPS signals – even farming equipment. On the bright side, it also unleashed spectacular views of the northern lights in parts of the country where auroras are not often visible.\nIn this case, a rapid, intense flash of electromagnetic energy ranked as an R3 on NOAA's scale, making it strong enough to disrupt radio signals on the sunlit side of the planet. Ham radio operators around Hawaii may have noticed a loss of signal at frequencies below 25 MHz, according to spaceweather.com.\nEric Lagatta is the Space Connect reporter for the USA TODAY Network. Reach him at elagatta@gannett.com"
    },
    {
      "url": "https://www.swpc.noaa.gov/products/aurora-viewline-tonight-and-tomorrow-night-experimental",
      "text": "This is a prediction of the intensity and location of the aurora borealis tonight and tomorrow night over North America. It also shows a 'viewline' that represents the southern-most locations from which you may see the aurora on the northern horizon. This product is based on the OVATION model and uses the maximum forecast geomagnetic activity (Kp) between 6pm and 6am US Central Time. The images are updated continuously, with the transition when \"tomorrow night\" becomes \"tonight\" occurring at 12:00Z (i.e., within an hour of the end of the 6pm-6am Central Time window that is used here to define \"night\").\nThe two maps show the aurora and viewline tonight and tomorrow night. The brightness and location of the aurora is typically shown as a green oval centered on Earth’s magnetic pole. The green ovals turn red when the aurora is forecast to be more intense. Aurora can often be observed somewhere on Earth from just after sunset or just before sunrise. The aurora is not visible during daylight hours. The aurora does not need to be directly overhead but can be observed from as much as 1000 km away when the aurora is bright and if conditions are right.\nA short term forecast (~30 minutes) along with the last 24 hours of activity can be found on the Aurora - 30 Minute Forecast page. And SWPC's new Aurora Dashboard (Experimental) collects the products and information from across SWPC's website for a one-stop shop.\nThe OVATION (Oval Variation, Assessment, Tracking, Intensity, and Online Nowcasting) model is an empirical model of the intensity of the aurora developed at the Johns Hopkins University, Applied Physics Laboratory by Patrick Newell and co-workers[1]. For tonight's and tomorrow night's aurora viewline prediction the SWPC 3-Day Geomagnetic Forecast (Kp index) is used to drive the OVATION model. The model uses maximum forecast geomagnetic activity (Kp) between 6pm and 6am US Central Time tonight and tomorrow night\nFor more information on the OVATION model and aurora products, see:\n- Newell, P. T., T. Sotirelis, and S. Wing (2009), Diffuse, monoenergetic, and broadband aurora: The global precipitation budget, J. Geophys. Res., 114, A09207, doi:10.1029/2009JA014326(link is external).\n- Machol, J. L., Green., J. C., Redmon, R. J., Viereck, R. A., Newell, P. T., (2012), Evaluation of OVATION Prime as a forecast model for visible aurorae, Space Weather, 10, 3, doi.org/10.1029/2011SW000746\nIn 2022, the view-line product presented here for tonight's and tomorrow night's aurora first debuted.\nThe history of the OVATION model can be found on the 'History' tab of the Aurora - 30 Minute Forecast page.\nBecause the view-line images are based on forecast Kp, the images themselves are not archived."
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2024/05/11/aurora-borealis-photos-northern-lights-seen-us-europe/73652013007/",
      "text": "Northern lights on full display across US, Europe on Friday: See photos\nThe northern lights provided a rare sight for residents across the U.S. and around the world Friday night, with a powerful solar storm fueling a spectacle seen as far south as the Florida Keys.\nStrong solar flares the sun has been emitting since Wednesday morning were responsible for the northern lights being visible across a wide swath of North America and Europe.\nSeven coronal mass ejections began entering the Earth's outer atmosphere on Friday, said the National Oceanic and Atmospheric Administration. The agency issued a rare Severe (G4) Geomagnetic Storm Watch this week for the first time in 19 years, but announced Friday evening that extreme (G5) conditions reached Earth at 6:54 p.m. Eastern time. The last extreme event occurred with the \"Halloween storms\" in October 2003.\nBecause the sun is at the height of its 11-year-cycle, conditions were optimal for the auroras to put on a light show that electrified sky watchers and appeared to far more Americans than usual.\n\"I never in my wildest dreams thought I would see it from my front yard in Key Largo (Florida,) said Mike Theiss, a veteran extreme nature photographer and storm chaser. He'd been seeing the news about the solar storms all day Friday and was \"a bit jealous\" he would miss out on the auroras. But then he started seeing photos posted in real time on social media, in South Carolina, then Georgia and then the Bahamas.\nIncredulous about that sighting, he figured he'd take a chance. \"I walked out the front door and there were the lights. I could see a faint red glow with the naked eye,\" Theiss told USA TODAY. \"I was looking at the northern lights. I still can't believe it.\"\nSky gazers, if you didn’t have a chance to catch the northern lights on Friday, May 10, you can try again today. Forecasters are predicting that the aurora will be visible across many parts of the United States if the weather permits. There have been several reports of power grid irregularities and functional decreases in high-frequency, communications and GPS systems, according to a report from NOAA.\nAlthough the northern lights did interrupt some system functionalities, the phenomena has caused major mishaps in the past. In 1989, the aurora managed to knock out the power in Quebec for nine hours. However, the aurora was the strongest in 1859 when the lights shined so bright it was mistakenly for daylight and lasted for a day, The Planetary Society reported.\nHere's a look at some of the images captured around the U.S. and in Europe.\nNorthern lights: What's your chance of seeing the northern lights tonight? A look at Saturday's forecast\nGeomagnetic Storm: Solar storm is powerful enough to disrupt communications: Why NOAA says not to worry\n'Absolutely incredible'\nUnbelievable illumination of the Aurora borealis in Florida\nAurora borealis 'dazzle' in the sky in Europe\nContributing: Dinah Voyles Pulver, USA TODAY."
    },
    {
      "url": "https://www.swpc.noaa.gov/products/aurora-30-minute-forecast",
      "text": "|\nNorthern Hemisphere |\nSouthern Hemisphere |\nThis is a short-term forecast of the location and intensity of the aurora. This product is based on the OVATION model and provides a 30 to 90 minute forecast of the location and intensity of the aurora. The forecast lead time is the time it takes for the solar wind to travel from the L1 observation point to Earth.\nThe two maps show the North and South poles of Earth respectively. The brightness and location of the aurora is typically shown as a green oval centered on Earth’s magnetic pole. The green ovals turn red when the aurora is forecasted to be more intense. The sunlit side of Earth is indicated by the lighter blue of the ocean and the lighter color of the continents. Aurora can often be observed somewhere on Earth from just after sunset or just before sunrise. The aurora is not visible during daylight hours. The aurora does not need to be directly overhead but can be observed from as much as a 1000 km away when the aurora is bright and if conditions are right.\nThe aurora is an indicator of the current geomagnetic storm conditions and provides situational awareness for a number of technologies. The aurora directly impacts HF radio communication and GPS/GNSS satellite navigation. It is closely related to the ground-induced currents that impact electric power transmission.\nFor many people, the aurora is a beautiful nighttime phenomenon that is worth traveling to arctic regions just to observe. It is the only way for most people to actually experience space weather.\nThese links provide a discussion of the aurora phenomena and tips for the best opportunities to view aurora at various locations around the world.\nThe OVATION (Oval Variation, Assessment, Tracking, Intensity, and Online Nowcasting) model is an empirical model of the intensity of the aurora developed at the Johns Hopkins University, Applied Physics Laboratory by Patrick Newell and co-workers1. The model uses the solar wind velocity and interplanetary magnetic field measured at the L1 orbit position at 1.6 million km (1 million miles) upstream from earth as input and calculates three types of electron precipitation and the proton precipitation which strongly correlate with the aurora. An estimate of aurora viewing probability can be derived by assuming a linear relationship to the intensity of the aurora. This relationship was validated by comparison with data from the Ultraviolet imager (UVI) instrument on the NASA Polar satellite(2).\nOn occasion, the input solar wind data are either contaminated or unavailable. In those instances, an alternative estimate of the solar wind forcing, based on the current Kp geomagnetic index is used to drive the OVATION model. When this occurs, there is no forecast lead time.\nFor more information on the OVATION model and aurora products, see:\n- Newell, P. T., T. Sotirelis, and S. Wing (2009), Diffuse, monoenergetic, and broadband aurora: The global precipitation budget, J. Geophys. Res., 114, A09207, doi:10.1029/2009JA014326(link is external).\n- Machol, J. L., Green., J. C., Redmon, R. J., Viereck, R. A., Newell, P. T., (2012), Evaluation of OVATION Prime as a forecast model for visible aurorae, Space Weather, 10, 3, doi.org/10.1029/2011SW000746\nIn 2009, Newell et. al., developed the OVATION model.\nIn 2011, NOAA (NCEI and SWPC) developed a real-time version of the OVATION model to forecast the location and intensity of the aurora. Machol and Redmon (NCEI) developed the real-time ovation model. Viereck (SWPC) implemented the model and developed the graphical products to run in realtime to create aurora forecasts.\nIn 2013, Newell upgraded the OVATION Prime model so that it would more accurately capture large geomagnetic storms. The original model, based solely on DMSP data, was only reliable to Kp of 7. By adding data from the NASA TIMED GUVI instrument, Newell et al., were able to expand the model to include the larger storm values of Kp of 8 and 9.\nIn 2016, NOAA SWPC shared the operational OVATION code (written in IDL) with the UK Met Office in the UK. The UK Met Office converted the OVATION model from IDL to Python.\nIn 2020, NOAA SWPC implemented the new version of the OVATION Prime model into operations. This version has been dubbed OVATION 2020.\nThe Auroral Forecast product is based on the OVATION Prime model developed by P. Newell at the Johns Hopkins, Applied Physics Laboratory.\nThe latest 24 hours of image frames comprising the Northern and Southern hemisphere loops (with time-tagged file names) are available: Northern, Southern\nThe most recent Northern and Southern Hemisphere images (with static file names) are available: Northern, Southern\nAuroral data in a grided format for the entire Earth is available in compressed JSON format: The latest JSON file is available as well.\nThe Hemispheric Power Index, an estimate of the total auroral energy input at each pole, is available in ASCII format: latest HPI"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/05/jupiter-venus-conjunction-pairing/85522877007/",
      "text": "Jupiter-Venus conjunction: How to see our solar system's 2 brightest planets in August\nHere's what to know about the rendezvous between Jupiter and Venus, and how to see the two bright planets in August.\nFrom meteor showers to visible nebulas, August is primed to be an action-packed month for stargazers in the United States.\nAnd one of the highlights of the month? The impending meet-up of Jupiter and Venus.\nThe gas giant Jupiter, our solar system's largest planet, is due to make a close approach in August with Venus, NASA said in an August skywatching guide. The rendezvous, known in astronomy terms as a conjunction, comes a few months after Venus underwent an inferior conjunction in March – meaning it appeared in the sky after sunset and again before sunrise.\nWhat that means for observers here on Earth is that both planets should be visible together for the next few days.\nHere's what to know about the Venus-Jupiter conjunction, and how to see the two bright planets in August.\nWhat is a planetary conjunction?\nA planetary conjunction is an astronomical event in which at least two planets – sometimes more – appear to our vantage from Earth to be close together in the sky.\nEven though the planets are in reality still tens of millions of miles apart, the events present a special opportunity for astronomers and casual stargazers to see multiple worlds in our solar system at one time.\nSo, what causes conjunctions to take place?\nAs planets in our solar system orbit the sun at varying speeds, sometimes their orbital paths bring them close together on the same side of the sun. When this event lines up with our view from Earth, we get a conjunction, according to the nonprofit Planetary Society.\nWhen is the Venus-Jupiter pairing?\nVenus and Jupiter are making their close approaches to one another and will shine brightly to the east before sunrise throughout August, according to NASA.\nThe planets should appear closest to one another between Aug. 11 and 12. What's more, Venus and Jupiter's cosmic rendezvous should take place against a backdrop of bright stars – including Orion, Taurus, Gemini and Sirius.\nA crescent moon, appearing as a thin sliver, should even join the planets in the sky after they separate again Aug. 19-20.\nHow to see Venus, Jupiter conjunction in August\nWhile telescopes certainly will enhance the view, spectators don't necessarily need any equipment to spot Venus and Jupiter in the pre-dawn sky from the Northern Hemisphere. Why? After the sun and moon, they're the two brightest objects in our solar system.\nSeek out locations with unobstructed views of the horizons and check the weather forecast to ensure skies will be clear. Then, simply look to the east to find what will appear as two uncommonly bright stars, and you're likely looking at the two planets.\nEric Lagatta is the Space Connect reporter for the USA TODAY Network. Reach him at elagatta@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/graphics/2024/05/18/northern-lights-colors-explained/73731506007/",
      "text": "Northern lights' colors: A look at what's producing them at the molecular level\nIf you've looked at social media feeds in the past week, they've likely been jammed with bedazzling photos of the aurora borealis – the northern lights – in a spectrum of colors that go beyond the usual green lights commonly associated with the phenomenon.\nThe auroras occur when the Earth's magnetic field becomes disrupted by intense solar winds traveling at 3 million mph that carry plasma particles that interact with gases – namely oxygen and nitrogen – in the planet's atmosphere.\nBut what provides the magic of these lights is happening at the molecular level in these gases.\nMore lights: One week ago, the northern lights stunned America. When will it happen again?\nNorthern Lights' origins: Can't wait for the next aurora borealis to dance across the sky? You're in luck.\nWhy are there different colors of Northern Lights?\nThe colors we see emanating from the aurorae are a direct result of activity happening at the atomic level in air molecules. When plasma particles from solar flares collide with molecules in the atmosphere, the electrons jump due to their excited energy level. As the electrons return to their normal state, the excess energy is released from the atom as a photon of light. Oxygen atoms emit a ghostly green color, the most common type of Northern Lights.\nRecent displays witnessed as far south as Florida and Texas, however, appeared in reds, blues and purples. These colors are caused by a combination of nitrogen, hydrogen and helium present at different levels in the atmosphere where oxygen is thinner.\nWill we see the Northern Lights again?\nYes. According to predictions by NASA scientists, the next peak in the kind of solar activity that spews large eruptions in energy and material – called a solar maximum – will occur in July 2025. The northern lights are expected to get stronger and more frequent as the solar maximum approaches.\nFor now, NASA scientists have more data to work with to study the impact solar flares have on Earth's upper atmosphere, satellites and infrastructure in space.\nCONTRIBUTING Doyle Rice and George Petras, USA TODAY\nSOURCES: NASA, AuroraWatch UK / Lancaster University, Reuters"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2024/05/10/severe-solar-storm-2024/73642315007/",
      "text": "Solar storm is powerful enough to disrupt communications: Why NOAA says not to worry\nAny solar storm of this magnitude has the potential to interfere with Earth's infrastructure. While NOAA alerted satellite and grid operators, most people are encouraged to catch some rare auroras.\nAn uncommonly strong solar storm is hurtling toward Earth, bringing with it the power to disrupt some communications and even produce some dazzling northern lights.\nThe storm's impending arrival prompted the National Oceanic and Atmospheric Administration to issue a rare storm watch Thursday to warn about the possible toll it could take when the solar eruption reaches Earth as early as Friday evening.\nBut before you go preparing for some sort of emergency, most of those at risk of enduring the storm's wrath are power plant operators and those aboard spacecrafts. Instead, if you live anywhere in the northern part of the United States, tonight may be a good time to head outside and try to catch some auroras, NOAA officials said at a Friday news conference.\n“It’s a very rare event to happen,” Shawn Dahl, a forecaster and coordinator at NOAA's Space Weather Prediction Center, said Friday. \"We haven't seen this in a long time.\"\nHere's what to know about the solar storm.\n'God's Hand' seen in Milky Way: Telescope images reveal 'cloudy, ominous structure' known as 'God's Hand'\nSolar flares unleash coronal mass ejections toward Earth\nNOAA has been tracking the explosive bursts of radiation known as solar flares since Wednesday from a sunspot cluster that's a whopping 16 times wider than Earth.\nThe solar flares have unleashed at least five coronal mass ejections – clouds of plasma and charged particles – that are now making their way toward our planet at a breakneck pace, said Brent Gordon, chief of the space services branch of the Space Weather Prediction Center.\nBy releasing solar particles and electromagnetic radiation toward our planet, the coronal mass ejections are what drive the geometric storms toward Earth. Such electromagnetic activity will only increase as the sun continues to reach the height of its 11-year solar cycle, which NASA said is expected to be in 2025.\nForecasters use a five-level scale to measure geometric storms. At a G4, this one is just a single level away from being the most severe solar storm possible, according to NOAA. The Severe (G4) Geomagnetic Storm Watch the agency posted on Thursday marked its first since 2005.\nLast December, a powerful burst of energy created the largest solar flare that NASA had detected since 2017.\nA destructive solar storm in 1989 caused electrical blackouts across Quebec for 12 hours, according to NASA, plunging millions of Canadians into the dark and closing schools and businesses. The most intense solar storm on record, the Carrington Event, occurred in 1859 – sparking fires at telegraph stations and preventing messages from being sent.\nThe last G4 level solar storm hit Earth in March, one of only three storms of that severity observed since 2019, according to NOAA's Space Weather Prediction Center. The last time Earth was hit by a G5 storm was October 2003, when power outages were reported in Sweden and transformers were damaged in South Africa, NOAA officials said Friday.\nSolar storm has potential to disrupt satellites, power grid\nDon't expect anything like that this time around.\n“We are not anticipating that,\" Dahl said Friday.\nHowever, any solar storm of this magnitude has the potential – however remote – to interfere with our infrastructure. Anything including communications, the electric power grid, radio and satellite operations are threatened by the looming storm, which could trigger blackouts and disrupt navigation systems.\nNOAA officials have seen no evidence from the past that solar storms can disrupt cellular service, Dahl said.\nDahl said NOAA has alerted satellite, grid and pipeline operators so they can prepare.\nIn the meantime, a NASA spacecraft orbiting about 1 million miles from Earth will help forecasters measure the solar wind and understand the exact timing and threat it poses.\nBut no matter what happens, rest assured that you and other people are safely protected by Earth’s magnetic field.\nHow to see the northern lights this weekend\nThe solar storm is expected to trigger the aurora borealis, the famous natural light display better known as the northern lights.\nFrom Friday through Sunday, those in the northern half of the U.S. – potentially as far south as Alabama and northern California – have the chance of glimpsing some of the auroras amid the effects of the solar storm, according to NOAA.\nIf the weather is clear, the best aurora is usually visible within an hour or two of midnight, according to NOAA.\nThe upcoming solar storm will have particles flowing from the sun that get caught up in Earth's magnetic field, causing colorful auroras to form as they interact with molecules of atmospheric gases. Earth's magnetic field redirects the particles toward the poles through a process that produces a stunning display of rays, spirals and flickers that has fascinated humans for millennia.\nNOAA also maintains an aurora dashboard that provides short-term forecasts of the northern lights.\nContributing: Doyle Rice, USA TODAY\nEric Lagatta covers breaking and trending news for USA TODAY. Reach him at elagatta@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/news/weather/2024/05/18/northern-lights-forecast-when-will-they-appear-again/73704951007/",
      "text": "One week ago, the northern lights stunned America. When will it happen again?\nEven though experts say conditions are primed for more aurora shows over the next few years, predicting exactly when and where is a challenge.\nOne week ago, a spectacular northern lights display wowed millions of Americans. Experts and aurora chasers say that was likely just the beginning of the spectacles as our sun heads into what's known as the \"solar maximum.\"\nBut when exactly will the northern lights appear again? Even though experts say conditions are primed for more aurora shows over the next few years, predicting exactly when and where they occur will continue to be a challenge. Even the best predictions can only accurately be made a few days or even hours in advance.\nFor those who caught the forecast in time last week and headed outside, the view was \"epic,\" aurora chaser Melissa F. Kaelin told USA TODAY via e-mail days after the event. Last week's dramatic display of the northern lights near Dexter, Michigan, \"rivals anything I've seen in 12 years of aurora chasing. The excitement still gives me chills,\" she said.\nAmazingly, aurora were seen in all 50 states of the U.S. last week and across Europe and even Australia.\nExperts say it's a great time to be an aurora chaser.\n\"Solar max has definitely arrived,\" astronomer Tony Phillips, of SpaceWeather.com, told USA TODAY this week via e-mail. Phillips said the solar maximum could last for 2 or 3 years.\n\"The May 10th superstorm may have been just the first of several magnificent displays we experience between now and 2026,\" he said.\nSo what's causing all of the excitement? Why is the aurora so visible, all of a sudden? Experts say it all has to do with our sun, solar cycles and the solar maximum. Here's the details:\nWhat are solar cycles? What is the solar maximum?\nSolar cycles track the activity level of the sun, our nearest star. A cycle is traditionally measured by the rise and fall in the number of sunspots, but it also coincides with increases in solar flares, coronal mass ejections, radio emissions and other forms of space weather.\n\"The sun has an 11-year cycle where it goes through maximum and minimum,\" Shannon Schmoll, the director of the Abrams Planetarium at Michigan State University told USA TODAY in an interview last year. \"This results in the number of sunspots seen on the sun. Sunspots result from areas of the sun that have stronger magnetic fields.\"\nThe number of sunspots on the sun's surface changes on a fairly regular cycle, which scientists refer to as the sun's 11-year solar cycle. Sunspot activity, and hence auroral activity, tends to peak every 11 years.\nSunspots produce solar flares and coronal mass ejections, which create the geomagnetic storms here on Earth that cause the aurora to appear.\n\"We are entering the peak of Solar Cycle 25,\" Erica Grow Cei, a spokesperson for the National Weather Service, told USA TODAY this week in an e-mail. \"This period of heightened activity is expected to last into the first half of 2025,\" she added, meaning that additional chances for seeing the aurora will continue for at least the next year.\nKaelin said the 11-year solar maximum \"holds enormous potential for aurora chasers, but until Friday (May 10), we were worried it was going to be a quiet year.\" She said that although there had been a number of impressive solar flares, \"the ejections of solar wind that these eruptions create have been mostly directly away from Earth. Until now!\"\nOne solar flare that blasted off the sun this week was the strongest in seven years, but it was pointed away from the Earth, scientists said.\nWhen will the next northern lights show be? We won't know until days – or hours – before.\nWhat's the northern lights forecast for the days and months ahead?\n\"More chances may wait for us in the days ahead, as we watch the number of sunspots on the sun explode,\" Kaelin said this week via e-mail. \"But we can only predict these impacts with any certainty about three days in advance, and it's an emerging science.\n\"Humans still have a lot to learn about space weather,\" she admitted.\nIndeed, the aurora can be fickle to forecast. Unlike terrestrial weather, scientists who forecast space weather – which includes the aurora – must rely on observations of the sun, 93-million-miles-away, to make their predictions.\n\"There are so many uncertainties, it makes it difficult to predict,\" Bill Murtagh, the program coordinator at the Space Weather Prediction Center, told USA TODAY last year. And as hard as it is to forecast weather here on Earth, \"we are decades behind the forecast capabilities of our colleagues in meteorology,\" he admitted, referring to space weather.\nSolar cycles tracked back to Colonial era\nHow are solar cycles measured? \"The timing of the maximum and minimum of the solar cycle is predicted based largely on historical values and is verified through observations,\" Cei told USA TODAY.\n\"The cycle is about 11 years in length, and in that regard it is very predictable. This solar cycle is known as #25 because it has been tracked for that long – back to the Colonial era,\" she said.\n\"Here is the chart for the current cycle, which you can see is running hotter than originally predicted,\" Cei said.\nAuroras also bring danger for electrical grid\nBut with the exciting news about the uptick in aurora sightings also comes the worrisome side of heightened solar activity: It can interfere with the electrical grid, degrade GPS signals, increase orbital drag on satellites, and pose radiation hazards to airline crews and astronauts, the Space Weather Prediction Center warned.\nStronger solar cycles produce more solar storms with greater intensity and therefore pose a larger hazard for these critical technologies and services, the prediction center said.\nMinor disruptions from last week's geomagnetic storm\nThe solar storm, which prompted NOAA to issue a watch alert for the first time in 19 years, caused some power grid irregularities and interfered with GPS signals – even farming equipment.\nHowever, \"based solely on the impacts that were reported to us, the disruptions were minor,\" Cei said this week. \"We may be able to provide specifics in the future, but not at this time, as many of our stakeholders have requested that we share this information in generalities.\"\nIn general, she added that preparation pays off: \"From what we've gathered so far (and this will be an ongoing process), it was a combination of infrastructure improvements over the past decade or so, plus excellent forecast information and decision support from the Space Weather Prediction Center that led to Americans experiencing a low-impact event.\"\nMore: NOAA detects another solar flare following sun-produced geomagnetic storm: 'Not done yet'\nWhat are the northern lights?\nThe auroras are a natural light display in Earth's sky that are famously best seen in high-latitude regions.\nThe aurora forms when the particles flowing from the sun get caught up in the Earth's magnetic field. The particles interact with molecules of atmospheric gases to cause the famed glowing green and reddish colors of the aurora, according to NASA.\nThe composition and density of the atmosphere and the altitude of the collisions determine the colors of the lights, the University of Alaska, Fairbanks, said. \"The aurora is most often seen as a striking green, but it also occasionally shows off other colors, ranging from red to pink or blue to purple,\" the University said on its website."
    },
    {
      "url": "https://www.gi.alaska.edu/monitors/aurora-forecast",
      "text": "[{\"predicted_time\":\"2025-08-04\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-05\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-06\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-07\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-08\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-09\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-10\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-11\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-12\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-13\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-14\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-15\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-16\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-17\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-18\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-19\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-20\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-21\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-22\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-23\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-24\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-25\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-26\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-27\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-28\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-29\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-30\",\"kp\":\"3\"}]\n[{\"predicted_time\":\"2025-08-04\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-05\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-06\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-07\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-08\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-09\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-10\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-11\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-12\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-13\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-14\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-15\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-16\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-17\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-18\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-19\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-20\",\"kp\":\"5\"},{\"predicted_time\":\"2025-08-21\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-22\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-23\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-24\",\"kp\":\"2\"},{\"predicted_time\":\"2025-08-25\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-26\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-27\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-28\",\"kp\":\"4\"},{\"predicted_time\":\"2025-08-29\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-30\",\"kp\":\"3\"}]\n[{\"id\":\"74449\",\"kp\":\"1.33\",\"predicted_time\":\"2025-08-07 00:00:00\"},{\"id\":\"74452\",\"kp\":\"2\",\"predicted_time\":\"2025-08-07 03:00:00\"},{\"id\":\"74455\",\"kp\":\"1.33\",\"predicted_time\":\"2025-08-07 06:00:00\"},{\"id\":\"74458\",\"kp\":\"2.33\",\"predicted_time\":\"2025-08-07 09:00:00\"},{\"id\":\"74461\",\"kp\":\"2.33\",\"predicted_time\":\"2025-08-07 12:00:00\"},{\"id\":\"74464\",\"kp\":\"2.33\",\"predicted_time\":\"2025-08-07 15:00:00\"},{\"id\":\"74467\",\"kp\":\"2.67\",\"predicted_time\":\"2025-08-07 18:00:00\"},{\"id\":\"74470\",\"kp\":\"4.33\",\"predicted_time\":\"2025-08-07 21:00:00\"},{\"id\":\"74450\",\"kp\":\"4.67\",\"predicted_time\":\"2025-08-08 00:00:00\"},{\"id\":\"74453\",\"kp\":\"6\",\"predicted_time\":\"2025-08-08 03:00:00\"},{\"id\":\"74456\",\"kp\":\"4.33\",\"predicted_time\":\"2025-08-08 06:00:00\"},{\"id\":\"74459\",\"kp\":\"3.67\",\"predicted_time\":\"2025-08-08 09:00:00\"},{\"id\":\"74462\",\"kp\":\"3\",\"predicted_time\":\"2025-08-08 12:00:00\"},{\"id\":\"74465\",\"kp\":\"3.33\",\"predicted_time\":\"2025-08-08 15:00:00\"},{\"id\":\"74468\",\"kp\":\"3.67\",\"predicted_time\":\"2025-08-08 18:00:00\"},{\"id\":\"74471\",\"kp\":\"4\",\"predicted_time\":\"2025-08-08 21:00:00\"},{\"id\":\"74451\",\"kp\":\"5\",\"predicted_time\":\"2025-08-09 00:00:00\"},{\"id\":\"74454\",\"kp\":\"4.33\",\"predicted_time\":\"2025-08-09 03:00:00\"},{\"id\":\"74457\",\"kp\":\"3.67\",\"predicted_time\":\"2025-08-09 06:00:00\"},{\"id\":\"74460\",\"kp\":\"4\",\"predicted_time\":\"2025-08-09 09:00:00\"},{\"id\":\"74463\",\"kp\":\"3\",\"predicted_time\":\"2025-08-09 12:00:00\"},{\"id\":\"74466\",\"kp\":\"3.33\",\"predicted_time\":\"2025-08-09 15:00:00\"},{\"id\":\"74469\",\"kp\":\"3.67\",\"predicted_time\":\"2025-08-09 18:00:00\"},{\"id\":\"74472\",\"kp\":\"4\",\"predicted_time\":\"2025-08-09 21:00:00\"}]\n[{\"predicted_time\":\"2025-02-08 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-02-09 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-02-10 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-02-11 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-02-12 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-02-13 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-02-14 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-02-15 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-02-16 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-02-17 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-02-18 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-02-19 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-02-20 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-02-21 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-02-22 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-02-23 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-02-24 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-02-25 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-02-26 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-02-27 01:00:00\",\"kp\":\"5.67\"},{\"predicted_time\":\"2025-02-28 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-03-01 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-03-02 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-03-03 01:00:00\",\"kp\":\"1.67\"},{\"predicted_time\":\"2025-03-04 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-03-05 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-03-06 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-03-07 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-03-08 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-03-09 01:00:00\",\"kp\":\"5.67\"},{\"predicted_time\":\"2025-03-10 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-03-11 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-03-12 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-03-13 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-03-14 01:00:00\",\"kp\":\"5.67\"},{\"predicted_time\":\"2025-03-15 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-03-16 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-03-17 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-03-18 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-03-19 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-03-20 01:00:00\",\"kp\":\"2\"},{\"predicted_time\":\"2025-03-21 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-03-22 01:00:00\",\"kp\":\"5.67\"},{\"predicted_time\":\"2025-03-23 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-03-24 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-03-25 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-03-26 01:00:00\",\"kp\":\"6.33\"},{\"predicted_time\":\"2025-03-27 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-03-28 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-03-29 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-03-30 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-03-31 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-04-01 01:00:00\",\"kp\":\"2\"},{\"predicted_time\":\"2025-04-02 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-04-03 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-04-04 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-04-05 01:00:00\",\"kp\":\"5.67\"},{\"predicted_time\":\"2025-04-06 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-04-07 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-04-08 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-04-09 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-04-10 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-04-11 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-04-12 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-04-13 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-04-14 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-04-15 01:00:00\",\"kp\":\"6.33\"},{\"predicted_time\":\"2025-04-16 01:00:00\",\"kp\":\"7.67\"},{\"predicted_time\":\"2025-04-17 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-04-18 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-04-19 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-04-20 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-04-21 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-04-22 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-04-23 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-04-24 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-04-25 01:00:00\",\"kp\":\"2\"},{\"predicted_time\":\"2025-04-26 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-04-27 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-04-28 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-04-29 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-04-30 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-05-01 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-05-02 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-05-03 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-05-04 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-05-05 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-05-06 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-05-07 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-05-08 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-05-09 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-05-10 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-05-11 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-05-12 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-05-13 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-05-14 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-05-15 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-05-16 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-05-17 01:00:00\",\"kp\":\"6.33\"},{\"predicted_time\":\"2025-05-18 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-05-19 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-05-20 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-05-21 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-05-22 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-05-23 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-05-24 01:00:00\",\"kp\":\"1.67\"},{\"predicted_time\":\"2025-05-25 01:00:00\",\"kp\":\"2\"},{\"predicted_time\":\"2025-05-26 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-05-27 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-05-28 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-05-29 01:00:00\",\"kp\":\"6.67\"},{\"predicted_time\":\"2025-05-30 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-05-31 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-06-01 01:00:00\",\"kp\":\"8\"},{\"predicted_time\":\"2025-06-02 01:00:00\",\"kp\":\"6.67\"},{\"predicted_time\":\"2025-06-03 01:00:00\",\"kp\":\"7\"},{\"predicted_time\":\"2025-06-04 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-06-05 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-06-06 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-06-07 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-06-08 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-06-09 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-06-10 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-06-11 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-06-12 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-06-13 01:00:00\",\"kp\":\"6.33\"},{\"predicted_time\":\"2025-06-14 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-06-15 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-06-16 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-06-17 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-06-18 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-06-19 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-06-20 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-06-21 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-06-22 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-06-23 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-06-24 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-06-25 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-06-26 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-06-27 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-06-28 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-06-29 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-06-30 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-07-01 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-07-02 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-07-03 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-07-04 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-07-05 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-07-06 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-07-07 01:00:00\",\"kp\":\"5.33\"},{\"predicted_time\":\"2025-07-08 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-07-09 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-07-10 01:00:00\",\"kp\":\"1.33\"},{\"predicted_time\":\"2025-07-11 01:00:00\",\"kp\":\"4.33\"},{\"predicted_time\":\"2025-07-12 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-07-13 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-07-14 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-07-15 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-07-16 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-07-17 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-07-18 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-07-19 01:00:00\",\"kp\":\"2.33\"},{\"predicted_time\":\"2025-07-20 01:00:00\",\"kp\":\"2\"},{\"predicted_time\":\"2025-07-21 01:00:00\",\"kp\":\"2\"},{\"predicted_time\":\"2025-07-22 01:00:00\",\"kp\":\"5\"},{\"predicted_time\":\"2025-07-23 01:00:00\",\"kp\":\"4.67\"},{\"predicted_time\":\"2025-07-24 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-07-25 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-07-26 01:00:00\",\"kp\":\"4\"},{\"predicted_time\":\"2025-07-27 01:00:00\",\"kp\":\"1.67\"},{\"predicted_time\":\"2025-07-28 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-07-29 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-07-30 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-07-31 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-01 01:00:00\",\"kp\":\"3.33\"},{\"predicted_time\":\"2025-08-02 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-03 01:00:00\",\"kp\":\"3.67\"},{\"predicted_time\":\"2025-08-04 01:00:00\",\"kp\":\"2.67\"},{\"predicted_time\":\"2025-08-05 01:00:00\",\"kp\":\"3\"},{\"predicted_time\":\"2025-08-06 01:00:00\",\"kp\":\"2.33\"}]\nAurora Forecast\nYou are viewing 3-Day Forecast data in Alaska time.\nTime Zone:\nN. America\nEurope\nN. Pole\nS. Pole\nAlaska\nTime Zone:\n3-Day Forecast\nTime (UTC)\n27-Day Forecast\nDate\nHistorical Data\nDate\nLive Cameras\nLive Cameras\nCurrent Activity\nWatch the last few seconds of the animation to see what is predicted over your location in the next 30 minutes.\nSource: Space Weather Prediction Center\nViewing the Aurora\n- How often can I see aurora?\n-\nThere is always some aurora at some place on Earth; however, the sky must be dark and at least partially clear in order for the aurora to be visible. When the flow of particles known as the solar wind is calm, the aurora might only be occurring at very high latitudes and appear faint, but nevertheless, there is still aurora. Sunlight and clouds are the biggest obstacles to observing this elusive phenomenon.\n- Where is the best place to see aurora?\n-\nThe best places to view aurora are high northern latitudes during the winter in northern Europe, Asia and North America.\nTo see the aurora you need a mostly clear and dark sky. During very large auroral events, the aurora may be seen at lower latitudes throughout the world, but these are rare. During an extreme event in May 2024, the aurora borealis was visible as far south as India, Morocco and Mexico and the aurora australis as far north as Perth, Australia, Argentina, and Namibia.\nDuring average activity levels, auroral displays will be overhead at high northern or southern latitudes. Places like Fairbanks, Alaska; Dawson City, Yukon; Yellowknife, NWT; Churchill, Manitoba; the southern tip of Greenland; Reykjavik, Iceland; Tromsø, Norway; and the northern coast of Siberia all offer a good chance to view the aurora overhead.\nAt lower latitudes, you might be able to see aurora on the northern horizon when activity picks up a little. In the southern hemisphere, the aurora has to be fairly active before it can be seen from places other than Antarctica. Hobart, Tasmania and the southern tip of New Zealand have about the same chance of seeing aurora as Vancouver, B.C., South Dakota, Michigan, Scotland, or St. Petersburg, Russia. Fairly strong auroral activity is required for aurora viewing in those locations.\n- What is the best time of day to see aurora?\n-\nAlthough aurora occurs throughout the night, the best time to watch for the aurora is the three or four hours centered around midnight. Active auroral displays tend to be more diffuse and fragmented later in the night, which means that 9 p.m. to 3 a.m. is typically the time period with higher probability of seeing spectacular auroral displays over interior Alaska in winter. Since clear sky and darkness are both essential to see aurora, the best time is determined by the weather and by the sunrise and sunset times.\nMoonlight may also affect aurora viewing. When the moon is full or close to full, the added ambient light may prevent you from seeing dim auroral features. However, this same effect also may enhance their colors. The bright moon activates more color and detail-sensitive cone cells in your eyes. In contrast, rods are photoreceptor cells that work well in the dark, but only produce images in black and white and with low levels of detail. Moonlight provides cone cells with the right amount of light to “turn on” so you can see colors in the aurora. When the aurora becomes very bright, even with no moon you may see colors in the aurora. For photography enthusiasts, third-quarter or new moon phases are best. The aurora in the sky can shine on the ground and produce interesting reflections that get “washed out” when the moon is more full. Note: In the Arctic, the first-quarter moon does not set below the horizon, while the third-quarter moon does not rise.\n- What time of year is best for seeing aurora?\n-\nPartially clear skies are a requirement (the clearer the sky, the more aurora that can be seen), so you should try to choose a location and a season that has the clearest skies. Statistically, the continental locations in Russia, Alaska and western Canada under the auroral zone have the clearest skies, and in the spring, the skies of Iceland and Scandinavia are usually clear. Furthermore, there is a quite strong (but poorly understood) tendency for auroral activity to be more intense around fall and spring equinox compared to summer and winter solstice known as the “Russell-McPherron effect.” This means that the statistical likelihood of seeing aurora over Interior Alaska is roughly twice as high on the equinox as it is at solstice. With these factors combined, aurora viewing may be best in locations with clear skies and around the spring (March) or fall (September) equinox.\nSunlight prevents viewing the aurora during the summer at high latitudes. The skies at night are simply too bright as the sun climbs in the sky until the June 21 solstice and then descends. (If active, aurora can generally be seen after civil twilight. See day length in your viewing location). Here in Fairbanks, at about latitude 64.8, our aurora viewing “season” is roughly August 21 to April 21. The odds are in your favor between those dates: if the weather is clear and you stay for at least three nights, it’s highly likely (though never certain!) that you will see the aurora. Although the sun does set to varying degrees in Fairbanks between April 22 and August 20, the sky doesn’t get dark enough to see the aurora even if it was a spectacular display.\nNote: There are two “shoulder seasons,” one for some time after April 21 and the other for some time before August 20, where the skies are dark enough to potentially see aurora for very brief periods of time during twilight. However, when scheduling your aurora viewing travel, we recommend avoiding these shoulder seasons and visiting between August 21 and April 21.\n- Why are some years better than others to view the aurora?\n-\nThe number of sunspots on the sun's surface changes on a fairly regular cycle, which scientists refer to as the sun's 11-year cycle variation. Sunspot activity tends to peak every 11 years. This peak is called the solar maximum. The last solar maximum was in 2014; the next is expected in winter 2024-25. Auroral activity tends to peak slightly after the solar maximum by around one year. Like the transitions between summer and winter seasons on Earth, the sun’s activity cycle takes time to ascend to solar maximum and decline to solar minimum. Although the chances of seeing the aurora at lower latitudes increase when the sunspot cycle is at a maximum, aurora viewing at higher latitudes is not as dependent on the solar maximum because the auroral oval is normally present.\n- Where should I view the aurora when I'm in Fairbanks, Alaska?\n-\nFor specific information on accommodations, tour companies, etc., we suggest www.explorefairbanks.com.\nPeople who live in Fairbanks are accustomed to spectacular views of the aurora borealis. Many residents routinely stay up late to photograph this phenomenon or simply to experience the widely different forms it takes with each new display. Some people view the aurora from their homes, but many travel away from the city lights for the most spectacular views.\nVisitors to Fairbanks should plan to watch from a hill away from city lights with a clear view of the horizon, since the aurora can occur in any part of the sky. During solar activity maximum years, many auroral substorms start south of Fairbanks. During years of minimum solar activity, many auroral substorms start north of Fairbanks and occur in the midnight hours.\nAlthough trees make good foreground subjects in auroral photographs, too many of them can limit the full experience of the aurora, so photographers may want to search out a location with a clear view of the northern horizon. Another concern for visitors is the extremely cold winter weather. In those conditions, small problems may become disasters in remote areas. If you are aurora hunting at cold temperatures, please be prepared! Visit this page for tips on safely enjoying the winter season.\nRecommended aurora viewing sites around Fairbanks include:\n- Chena Lakes Recreation Area\n- Tanana Lakes Recreation Area, just south of Fairbanks\n- Cleary Summit\n- Ester, Wickersham and Murphy Domes\n- Haystack Mountain on the Elliot Highway\n- Some turnouts along the Elliot, Steese and Parks Highways and Chena Hot Springs Road\n- Some turnouts along Nordale Road\n- Ballaine Road turnout near the Goldstream Creek bridge\n- Visit the Explore Fairbanks Winter Guide\nScience of the Aurora\n- What is the aurora?\n-\nThe aurora is a luminous glow frequently seen around the geomagnetic poles of the northern (aurora borealis) and southern (aurora australis) hemispheres. The light is caused by collisions between electrically charged particles streaming from outer space that enter Earth’s atmosphere and collide with molecules and atoms of gas (primarily oxygen and nitrogen). When the electrons and protons from the sun collide with gases in the Earth’s atmosphere, the atmospheric particles (or gases) gain energy. To return to their normal state, they release that energy in the form of light. The principle is similar to what happens in a neon light: electricity runs through the light fixture to excite the neon gas inside, and when the neon is excited, it gives off a brilliant light.\nThe dancing lights of the aurora are seen around the magnetic poles of the northern and southern hemispheres because the electrons from the sun travel along magnetic field lines in the Earth’s magnetosphere. The magnetosphere is the extension of Earth’s magnetic field into a vast, comet-shaped bubble around our planet that acts as a sort of protective shield against space weather. The magnetosphere works to deflect and funnel particles from the solar wind into the space environment surrounding our planet. The “weak points” of our protective magnetic shield are over the poles where field lines converge. Many particles end up funneled over these areas with some penetrating into the upper atmosphere and colliding with other atoms or molecules to produce aurora light.\n- What is the auroral oval?\n-\nThe two figures below show the locations with the most frequent occurrences of aurora borealis (left) and aurora australis (right) during the period of best viewing around the middle of the night. The “quiet” state of the aurora is on average a thin oval band situated around 67-68 degrees in geomagnetic latitude. Under quiet solar wind conditions, the aurora will most likely occur inside the region shown with the auroral oval, and if you travel to these regions during dark and clear conditions and stay for 3-7 days, you will most likely see the aurora. These auroral ovals can expand when geomagnetic activity is enhanced, bringing sightings of aurora to lower latitudes. This three-day forecast and many other sites, including the NOAA Space Weather Prediction Center (SWPC), rely on the Kp index as an indicator of the auroral oval size. Inside the auroral oval, however, Kp is less relevant, since even when global activity is low, auroral activity can be high.\n- What makes the colors of the aurora?\n-\nThe composition and density of the atmosphere and the altitude of the collisions determine the colors. The aurora is most often seen as a striking green, but it also occasionally shows off other colors, ranging from red to pink or blue to purple. Oxygen at about 60 miles up gives off the familiar green-yellow color, while oxygen at higher altitudes (about 200 miles above Earth’s surface) gives all-red auroras. Nitrogen in different forms produces the blue light. Purple occurs when nitrogen at higher altitudes mixes with the red auroral emissions from oxygen. Within a small layer between the red and green aurora, it is possible to even see orange!\nCameras have different sensitivities to colors than the human eye; therefore, there is often more red aurora in photos than you can see with the unaided eye. Just like sunlight, which appears to be white, is a blend of the colors of the rainbow, the aurora is also a mixture of colors. The overall impression is a greenish-whitish glow. Since there is more oxygen at high altitudes, the red aurora tends to be on top of the regular green aurora. Very intense aurora often has a purple rim at the bottom. The purple results from a mixture of blue and red emissions from nitrogen molecules.\n- What is the altitude of the aurora?\n-\nThe bottom edge of the aurora is typically about 60 miles (100 kilometers) above the surface of the Earth. The top of the visible aurora peters out at about 120 to 200 miles (200 to 300 kilometers), but sometimes aurora can be seen as high as 500 miles (800 kilometers).\nViewing angle also impacts what one sees when aurora gazing; see the image below (courtesy of Aurorasaurus).\n- What are the types of aurora?\n-\nAuroral forms can be divided into broad categories based on activity level and the viewer's perspective.\nHomogeneous arc\nAt its least active, the auroral curtain forms diffuse, glowing streaks hanging quietly in the sky. This form has no distinct structure.\nRayed arc\nWhen the aurora becomes slightly more active, vertical stripes or striations, called rays, form. These are actually fine pleats in the auroral curtain.\nRising vapor column\nThe auroral curtain sometimes appears to touch a distant mountain top or even rise like smoke. This illusion occurs because you are seeing a several-hundred mile long aurora near the horizon where perspective gives the illusion that it is touching the ground.\nCorona\nThe aurora may appear as rays shooting out in all directions from a single point in the sky. This dramatic form occurs when you are directly beneath the swirls and folds of an active curtain. The rays are actually hundreds of miles long and perspective makes them appear to converge.\n- Can you hear the aurora?\n-\nThe best answer is “Maybe.” It is easy to say that the aurora makes no audible sound. The upper atmosphere is too thin to carry sound waves, and the aurora is so far away that it would take a sound wave five minutes to travel from an overhead aurora to the ground. But many people claim that they hear something at the same time when there is aurora in the sky. We are aware of only one case where a microphone has been able to detect audible sound associated with aurora (visit Auroral Acoustics: the web site does not have sound samples, but you'll find a link to an in-depth paper and recent news on this topic). The sound is often described as whistling, hissing, bristling or swooshing. Some even describe it like sizzling bacon on a pan. What gives people the sensation of hearing sound during auroral displays is an unanswered question. By searching for an answer to that question, we will probably learn more about the brain and how sensory perception works than about the aurora.\n- Can you predict when and where there will be aurora?\n-\nScientists can predict when and where there will be aurora, but with less confidence than they can predict the regular weather.\nThe ultimate energy source for the aurora is the solar wind. When the solar wind is calm, there tends to be minimal aurora; when the solar wind is strong and perturbed, there is a chance of intense aurora. The sun turns on its own axis once every 27 days, so an active region that produced perturbations which resulted in aurora might again cause aurora 27 days later. The solar wind takes approximately three days to get to the Earth on its way from the sun. Observing the sun and predicting perturbations in the solar wind resulting from events taking place on the sun (such as flares or coronal mass ejections) provides information in a few days in advance of possible auroral displays. Spacecraft such as the Solar and Heliospheric Observatory (SOHO), Solar Terrestrial Relations Observatory (STEREO) and Solar Dynamics Observatory (SDO) provide researchers with data on activity occurring on the surface of the sun as well as in the solar magnetic field.\nAnother source of data used to predict the aurora comes from satellites located approximately 90 minutes or 1,500,000 km away from Earth. The Deep Space Climate Observatory (DSCOVR) and Advanced Composition Explorer (ACE) Real-Time Solar Wind satellites provide real-time data to researchers about geomagnetic storms. Data from these satellites provide about one to two hours warning of conditions that may cause enhanced auroral displays.\n- What is the solar wind?\n-\nStreams of charged particles that produce the aurora come from the corona, the outermost layer of the sun's atmosphere. The corona is exceedingly hot, measuring more than two million degrees Fahrenheit. The high temperature causes hydrogen atoms to split into protons and electrons, and the resulting gas of charged particles is called plasma, which is electrically conductive. The solar plasma is so hot that it breaks free of the sun's gravitational force and blows away from the surface in all directions. The movement of this plasma is called solar wind. The intensity of the solar wind and the magnetic field carried by it change constantly. When the solar wind blows more strongly, we see more active and brighter aurora on Earth.\n- What are Kp numbers?\n-\nThe Kp number is a numeric scale that describes geomagnetic activity. The number is computed by averaging the magnetic activity from around eight stations around the world every three hours. The metric ranges from 0 to 9 (with 0 being calm, 1 very weak, and all the way up to 9, which would represent an extreme geomagnetic storm). On average, there are only one or two extreme geomagnetic storms per solar cycle (~11 years). Anything above a Kp 5 is classified as a geomagnetic storm.\nThe Kp index was introduced by a German scientist named Julius Bartels in 1939. The abbreviation Kp comes from the German \"Kennziffer Planetarische,\" which translates loosely as “planetary index number,” although it is better known in English as simply the planetary index, and is usually designated as Kp (number from 0-9).\nCan the Kp forecast the aurora in Fairbanks? Yes and no. Kp index is derived from 3-hour averages of observations from equatorial magnetometer stations to characterize global magnetic activity. When global geomagnetic activity is higher, the likelihood of seeing aurora increases globally. However, local conditions could be quite different from global activity. That's why scientists divide geomagnetic activity into two categories: geomagnetic storms and substorms. Auroral phenomena are more closely related to substorms, which are used to define the almost nightly occurrences of auroral activity. Aurora chasers use local magnetometer measurements (like our GIMA chain), aurora cameras (like our Poker Flat DASC; see under “Live Cameras” on this page), models like OVATION, or reports from social media or sites like Aurorasaurus for more accurate, real-time information.\nForecasting the Aurora\n- What's happening now?\n-\nMagnetometers provide a quantitative view of the level of geomagnetic disturbance occurring. A sudden steep change (i.e., tens or hundreds of nanotesla) in the magnetometer data is usually an indicator that an extended period (0.5 hours or more) of active aurora is beginning. This is especially true just before midnight. Scientists also find it helpful to see the time history of the magnetometer trace, since other indicators, like the all-sky camera, only show current conditions.\nVisit the magnetometer monitor for a chart of the current conditions, and view the all-sky camera at Poker Flat Research Range (65.13° N, 147.49° W) to see aurora occurring northeast of Fairbanks, Alaska. The Poker Flat camera and others are linked on this page under the “Live Cameras” section.\n- 1-hour Forecast\n-\nThe National Oceanic and Atmospheric Administration (NOAA) Space Weather Prediction Center (SWPC) OVATION is updated every 5 minutes. The animation shows auroral activity that occurred over the Northern Hemisphere in the last 24 hours. The animation is in Coordinated Universal Time (UTC); fast forward to the last few seconds of the animation to see what is predicted for the next 30 minutes. The model depicts a day/night terminator showing what areas of the world are sunlit and what areas are in darkness. Auroras cannot be seen during the daytime.\n- 3-day Forecast\n-\nRemote sensing spacecraft monitor the sun for indications of eruptions that eject solar material towards the Earth, or regions where continuous high-speed streams of material are escaping and heading earthward. In either case, the travel time to Earth for such material leaving the sun is 1 to 3 days. This allows relatively accurate forecasts to be made on these look-ahead time scales.\n- 27-day Forecast\n-\nJust as Earth rotates on its axis and makes a complete rotation every 24 hours, the sun spins on an axis and makes one complete rotation every ~27 days. Coronal holes on the sun allow solar material to flow out at high speeds. When these holes on the sun are facing Earth, we may experience enhanced auroral displays, among other effects. As the sun rotates, these coronal holes and other active regions result in high-speed streams of plasma that are likely to reoccur every 27 days until the phenomena dissipate; therefore, if there is high auroral activity today, it’s possible that there will be high auroral activity again in 27 days. This 27-day period is known as the Carrington Rotation."
    },
    {
      "url": "https://www.swpc.noaa.gov/noaa-scales-explanation",
      "text": "Hide introduction\nGeomagnetic Storms\n| Scale | Description | Effect | Physical measure | Average Frequency (1 cycle = 11 years) |\n|---|---|---|---|---|\n| G 5 | Extreme | Power systems: Widespread voltage control problems and protective system problems can occur, some grid systems may experience complete collapse or blackouts. Transformers may experience damage. Spacecraft operations: May experience extensive surface charging, problems with orientation, uplink/downlink and tracking satellites. Other systems: Pipeline currents can reach hundreds of amps, HF (high frequency) radio propagation may be impossible in many areas for one to two days, satellite navigation may be degraded for days, low-frequency radio navigation can be out for hours, and aurora has been seen as low as Florida and southern Texas (typically 40° geomagnetic lat.). |\nKp = 9 | 4 per cycle (4 days per cycle) |\n| G 4 | Severe | Power systems: Possible widespread voltage control problems and some protective systems will mistakenly trip out key assets from the grid. Spacecraft operations: May experience surface charging and tracking problems, corrections may be needed for orientation problems. Other systems: Induced pipeline currents affect preventive measures, HF radio propagation sporadic, satellite navigation degraded for hours, low-frequency radio navigation disrupted, and aurora has been seen as low as Alabama and northern California (typically 45° geomagnetic lat.). |\nKp = 8, including a 9- | 100 per cycle (60 days per cycle) |\n| G 3 | Strong | Power systems: Voltage corrections may be required, false alarms triggered on some protection devices. Spacecraft operations: Surface charging may occur on satellite components, drag may increase on low-Earth-orbit satellites, and corrections may be needed for orientation problems. Other systems: Intermittent satellite navigation and low-frequency radio navigation problems may occur, HF radio may be intermittent, and aurora has been seen as low as Illinois and Oregon (typically 50° geomagnetic lat.). |\nKp = 7 | 200 per cycle (130 days per cycle) |\n| G 2 | Moderate | Power systems: High-latitude power systems may experience voltage alarms, long-duration storms may cause transformer damage. Spacecraft operations: Corrective actions to orientation may be required by ground control; possible changes in drag affect orbit predictions. Other systems: HF radio propagation can fade at higher latitudes, and aurora has been seen as low as New York and Idaho (typically 55° geomagnetic lat.). |\nKp = 6 | 600 per cycle (360 days per cycle) |\n| G 1 | Minor | Power systems: Weak power grid fluctuations can occur. Spacecraft operations: Minor impact on satellite operations possible. Other systems: Migratory animals are affected at this and higher levels; aurora is commonly visible at high latitudes (northern Michigan and Maine). |\nKp = 5 | 1700 per cycle (900 days per cycle) |\nSolar Radiation Storms\n| Scale | Description | Effect | Physical measure (Flux level of >= 10 MeV particles) |\nAverage Frequency (1 cycle = 11 years) |\n|---|---|---|---|---|\n| S 5 | Extreme | Biological: Unavoidable high radiation hazard to astronauts on EVA (extra-vehicular activity); passengers and crew in high-flying aircraft at high latitudes may be exposed to radiation risk. Satellite operations: Satellites may be rendered useless, memory impacts can cause loss of control, may cause serious noise in image data, star-trackers may be unable to locate sources; permanent damage to solar panels possible. Other systems: Complete blackout of HF (high frequency) communications possible through the polar regions, and position errors make navigation operations extremely difficult. |\n105 | Fewer than 1 per cycle |\n| S 4 | Severe | Biological: Unavoidable radiation hazard to astronauts on EVA; passengers and crew in high-flying aircraft at high latitudes may be exposed to radiation risk. Satellite operations: May experience memory device problems and noise on imaging systems; star-tracker problems may cause orientation problems, and solar panel efficiency can be degraded. Other systems: Blackout of HF radio communications through the polar regions and increased navigation errors over several days are likely. |\n104 | 3 per cycle |\n| S 3 | Strong | Biological: Radiation hazard avoidance recommended for astronauts on EVA; passengers and crew in high-flying aircraft at high latitudes may be exposed to radiation risk. Satellite operations: Single-event upsets, noise in imaging systems, and slight reduction of efficiency in solar panel are likely. Other systems: Degraded HF radio propagation through the polar regions and navigation position errors likely. |\n103 | 10 per cycle |\n| S 2 | Moderate | Biological: Passengers and crew in high-flying aircraft at high latitudes may be exposed to elevated radiation risk. Satellite operations: Infrequent single-event upsets possible. Other systems: Small effects on HF propagation through the polar regions and navigation at polar cap locations possibly affected. |\n102 | 25 per cycle |\n| S 1 | Minor | Biological: None. Satellite operations: None. Other systems: Minor impacts on HF radio in the polar regions. |\n10 | 50 per cycle |\nRadio Blackouts\n| Scale | Description | Effect | Physical measure | Average Frequency (1 cycle = 11 years) |\n|---|---|---|---|---|\n| R 5 | Extreme | HF Radio: Complete HF (high frequency) radio blackout on the entire sunlit side of the Earth lasting for a number of hours. This results in no HF radio contact with mariners and en route aviators in this sector. Navigation: Low-frequency navigation signals used by maritime and general aviation systems experience outages on the sunlit side of the Earth for many hours, causing loss in positioning. Increased satellite navigation errors in positioning for several hours on the sunlit side of Earth, which may spread into the night side. |\nX20 (2 x 10-3) |\nLess than 1 per cycle |\n| R 4 | Severe | HF Radio: HF radio communication blackout on most of the sunlit side of Earth for one to two hours. HF radio contact lost during this time. Navigation: Outages of low-frequency navigation signals cause increased error in positioning for one to two hours. Minor disruptions of satellite navigation possible on the sunlit side of Earth. |\nX10 (10-3) |\n8 per cycle (8 days per cycle) |\n| R 3 | Strong | HF Radio: Wide area blackout of HF radio communication, loss of radio contact for about an hour on sunlit side of Earth. Navigation: Low-frequency navigation signals degraded for about an hour. |\nX1 (10-4) |\n175 per cycle (140 days per cycle) |\n| R 2 | Moderate | HF Radio: Limited blackout of HF radio communication on sunlit side, loss of radio contact for tens of minutes. Navigation: Degradation of low-frequency navigation signals for tens of minutes. |\nM5 (5 x 10-5) |\n350 per cycle (300 days per cycle) |\n| R 1 | Minor |\nHF Radio: Weak or minor degradation of HF radio communication on sunlit side, occasional loss of radio contact. Navigation: Low-frequency navigation signals degraded for brief intervals. |\nM1 (10-5) |\n2000 per cycle (950 days per cycle) |"
    }
  ],
  "argos_summary": "A recent geomagnetic storm, triggered by a coronal mass ejection from the sun, has made the northern lights visible across a wider area than usual, including parts of the continental U.S. and as far south as Alabama and Northern California. The storm, classified as G1-G2 on NOAA's scale, could also cause manageable effects on technology, such as disruptions to satellites and power grids. Experts predict that the solar activity will continue to increase, providing more opportunities for aurora sightings in the coming years.",
  "argos_id": "U407KSE5A"
}