{
  "url": "https://www.fastcompany.com/91380719/think-the-cybertruck-looks-weird-check-out-its-wedge-shaped-predecessors",
  "authorsByline": "Nate Berg",
  "articleId": "02035bcfb98043e295aa9c8206fdbb65",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/08/p-1-91380719-wedge-car-design.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T12:34:34+00:00",
  "addDate": "2025-08-07T12:51:22.552376+00:00",
  "refreshDate": "2025-08-07T12:51:22.552378+00:00",
  "score": 1.0,
  "title": "Think the Cybertruck looks weird? Check out its wedge-shaped predecessors",
  "description": "A new exhibition explores wedge-shaped cars that emerged in the 1960s, and looks at the way radical ideas have changed automotive design.",
  "content": "If this sounds like the kind of question one might ask when seeing a Tesla Cybertruck for the first time, it’s actually just a rhyme of history. That head-turner/head-scratcher was the 1968 Alfa Romeo Carabo, an outrageously pointy concept car that radically diverged from the teardrop designs of the day. It was arguably the start of a bold, if short-lived, new chapter in the history of car design: the wedge. The Bertone-designed Alfa Romeo Carabo debuted at the 1968 Paris Motor Show. [Photo: LAT Images/Getty Images] The Petersen Automotive Museum in Los Angeles explores this wildly experimental era in car design with The Wedge Revolution: Cars on the Cutting Edge, a new exhibition now on display. The exhibition features dozens of cars designed between the late 1960s and mid-’80s that used a blocky wedge shape as their defining form factor. They were oddball designs at the time, and most didn’t make it past the concept stage, but they heralded a rebellious era in car design that may just be underway once more. Case in point: the Cybertruck. “That’s why Franz was involved in the show,” says Jonathan Eisen, a curator at the Petersen museum. The Franz he’s talking about is Tesla’s chief designer, Franz von Holzhausen, creator of the Cybertruck, who was called in to cocurate the exhibition. “He’s very enthusiastic about the classic wedge cars.”\n\nLike his own design, the wedge cars of the mid-20th century seemed to have come out of nowhere. Eisen says the dominant design approach at the time was either the teardrop-shaped coupes made in France or the bulbous, chrome-laden sedans from American carmakers. But as the main designers behind these cars retired, a new generation came in ready to try something completely different. “They went the opposite way,” Eisen says. “They did away with all the ornamentation. And instead of smooth, flowing lines they decided that they were going to use sharp edges and flat planes and base the look of the car on the wedge.” Carmakers including Chevrolet, Honda, BMW, Aston Martin, Lamborghini, and Bertoni all dabbled in wedge-shaped car design. One concept car featured in the exhibition, the 1976 Honda Civic Lady, was an angular version of the Civic, one of the most popular compact cars of the era. With a wedge nose and a station wagon tail, it showed off a combination of design and sensibility. Though never intended for production, its DNA lived on for decades.\n\n“If you then look at Hondas from the 1980s and even into the 1990s, you could absolutely see that they go back to this one car,” Eisen says. Other cars in the show are far less sensible, like the batwinged 1979 Aston Martin Bulldog concept car and the 1977 UrbaCar, a dune buggy meets bumper car. On the extreme end, the 1971 Lamborghini Countach concept car came to define the sharp and wedgy shape of Lamborghinis for decades. These car companies “weren’t afraid to put something out there that maybe isn’t traditionally beautiful, but it’s still unlike anything else on the road and will absolutely draw your attention to it,” Eisen says. “A car doesn’t necessarily have to be pretty to be successful. The way that SUVs are so popular is proof of that. “\n\nThe Cybertruck, on the other hand? Eisen calls it the only true wedge car on the road today, and possibly the start of a more adventurous era in car design, even if its success is questionable. “That car obviously has a very controversial design, and you could even say that it’s been thoroughly rejected by the mass public,” he says. “Maybe people aren’t ready for it yet. But eventually, I think we will see more creativity.” In recent decades, car design has been very safe, and guided by aerodynamics, efficiency, and, above all, marketing, according to Eisen. The heyday of the wedge was less constrained and, arguably, more interesting. “I think it’s worth celebrating the fact that it’s okay to take chances,” Eisen says. The Wedge Revolution is on display through September 2026.",
  "medium": "Article",
  "links": [
    "https://www.fastcompany.com/91338704/tesla-cybertruck-is-officially-a-flop",
    "https://www.fastcompany.com/newsletters",
    "https://www.fastcompany.com/section/marketing",
    "http://www.petersen.org/",
    "https://www.mansueto.com/privacy-policy/",
    "https://www.petersen.org/wedge-exhibit",
    "https://www.fastcompany.com/apply/most-innovative-companies"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "car design",
      "weight": 0.12682545
    },
    {
      "name": "cars",
      "weight": 0.10974756
    },
    {
      "name": "Other cars",
      "weight": 0.10711558
    },
    {
      "name": "bumper car",
      "weight": 0.1064907
    },
    {
      "name": "wedge-shaped car design",
      "weight": 0.0813863
    },
    {
      "name": "design",
      "weight": 0.0777866
    },
    {
      "name": "oddball designs",
      "weight": 0.07651117
    },
    {
      "name": "the only true wedge car",
      "weight": 0.07049078
    },
    {
      "name": "the classic wedge cars",
      "weight": 0.068709746
    },
    {
      "name": "Jonathan Eisen",
      "weight": 0.067029156
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.853515625
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Sports Cars",
      "score": 0.470703125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Luxury Vehicles",
      "score": 0.464599609375
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.44873046875
    },
    {
      "name": "/Autos & Vehicles/Custom & Performance Vehicles",
      "score": 0.4365234375
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Trucks, Vans & SUVs",
      "score": 0.34716796875
    }
  ],
  "sentiment": {
    "positive": 0.17687988,
    "negative": 0.37841797,
    "neutral": 0.44433594
  },
  "summary": "The Petersen Automotive Museum in Los Angeles has launched a new exhibition, The Wedge Revolution: Cars on the Cutting Edge, featuring dozens of cars designed between the late 1960s and mid-’80s that used a wedge shape as their defining form factor. The exhibition, which also features Tesla's chief designer Franz von Holzhausen, explores this experimental era in car design with cars from Chevrolet, Honda, BMW, Aston Martin, Lamborghini, and Bertoni. The curator at the museum, Jonathan Eisen, calls this era of car design more adventurous and more innovative than the previous era of teardrop-shaped coupes or American carmakers. The exhibit also features concept cars from the 1970s, including the 1976 Honda Civic Lady and 1971 Lamborghinis.",
  "shortSummary": "The Tesla Cybertruck's predecessor in wedge-shaped cars, the 1968 Alfa Romeo Carabo, marked the start of a rebellious era in car design, but its predecessor’s distinctive design remains a controversial one.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2070eb4c45b9472991ed5749b421b063",
  "places": [],
  "scraped_sources": [
    {
      "url": "http://www.petersen.org/",
      "text": "Now Open\nExplore the New Vault!\n300+ New Vehicles, a New Area and more!\nNow Open\nTotally Awesome!\nCars and Culture of the 80’s & 90’s\nEVENTS\nUpcoming Events\n6060 Wilshire Blvd.\nLos Angeles, CA 90036\nOpen 7 Days a Week\n10 AM - 6 PM\nPlan Your Visit\nJoin thousands of fellow enthusiasts, get unlimited Museum access, exclusive perks and so much more!\nExperience over 300 of the rarest vehicles ever assembled, hidden beneath the Petersen Automotive Museum\nLatest Vehicle Spotlights\nVehicle Spotlights\nSee What Our\nGuests have to Say!\n-\n★★★★★ - The best museum I’ve ever been to. The collection is mind-blowing and every time I go back I see new cars. 10/10 recommend.\nMichael S. on Google Reviews\n-\n★★★★★ - The Petersen is a fantastic way to spend a day. They have different exhibits all the time, timeless classics and a great little café.\nJesse G. on Google Reviews\n-\n★★★★★ - I love this museum. With constant changes in displays, there is always something new. If you like cars at all, this is a must.\nJake R. on Google Reviews\n-\n★★★★★ - Coolest museum I think I’ve ever been to! If you’re a fan of movies cars or museums, you do not want to miss out!\nCJ on Google Reviews\n-\n★★★★★ - I had the most wonderful time here!!! Cars were breathtaking. All the staff were so nice and so welcoming. I will be back sooner than later.\nMonique W. on Google Reviews\nVisit the Museum and explore hundreds of vehicles, see their impact on the industry\nGet Museum Tickets\nExplore the Vault\nExperience over 300 of the rarest vehicles ever assembled, hidden beneath the Petersen Automotive Museum"
    },
    {
      "url": "https://www.petersen.org/wedge-exhibit",
      "text": "The Wedge Revolution\nCars on the Cutting Edge\nOpening August 2nd, 2025\nLIFE\nEDGE\nTHE\nON\n2nd Floor\nDesign Gallery\nOpening August 2nd\nVehicles are subject to change within the exhibit without notice.\nCarving a New Path\nThe history of the automobile is full of high points and heydays: the formative brass era, the voluptuous streamline era, the fins of the space age, the lithe sports cars of the 1960s, the “Radwood” ’80s and ’90s, and the tech advancements of the 21st century. One stretch of time remains largely uncelebrated because it was overshadowed by global events and safety developments that put a damper on automotive energy in much of the world. This period—the 1970s (or, more broadly, 1965-1985)—was, in fact, a remarkable era of automotive design and the ultimate inverse reaction to the curvaceous and excessive styling so prevalent in the decades bracketing WW2. Eschewing the chrome and fins that dominated the cars of the late 50s and early 60s, influential designers in this period emphasized angular silhouettes and faceted planes, with body triangulation from front to rear in a style most commonly referred to as the “wedge.”\nExperience the Wedge\nVehicle Sneak Peek\nVehicles are subject to change within the exhibit without notice.\n1970 LANCIA STRATOS HF ZERO\n1966 CANNARA I\nExhibit Imagery\nExplore all our current exhibitions at the Petersen Automotive Museum\nCurrent Exhibits\nExplore the Vault\nExperience over 300 of the rarest vehicles ever assembled, hidden beneath the Petersen Automotive Museum"
    }
  ],
  "argos_summary": "The Petersen Automotive Museum in Los Angeles is showcasing an exhibition titled 'The Wedge Revolution: Cars on the Cutting Edge,' which highlights the bold wedge-shaped car designs from the late 1960s to the mid-1980s. This era marked a departure from traditional car aesthetics, favoring sharp edges and flat planes, with notable contributions from manufacturers like Alfa Romeo, Lamborghini, and Honda. The exhibition, co-curated by Tesla's chief designer Franz von Holzhausen, also draws parallels to contemporary designs like the Tesla Cybertruck, suggesting a potential resurgence of adventurous car design.",
  "argos_id": "YNB4GEK28"
}