{
  "url": "https://www.washingtonpost.com/world/2025/08/07/myanmar-earthquake-building-collapse-construction-flaws/791e88ca-7391-11f0-84e0-485bb531abeb_story.html",
  "authorsByline": "Associated Press",
  "articleId": "5069ef288eaf41e6bc876f28f350c580",
  "source": {
    "domain": "washingtonpost.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OZ3IPWTTSEI7BBHAJBN3KMNL5M_size-normalized.jpg&w=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T13:21:49+00:00",
  "addDate": "2025-08-07T13:33:21.965541+00:00",
  "refreshDate": "2025-08-07T13:33:21.965543+00:00",
  "score": 1.0,
  "title": "Prosecutors in Thailand issue indictments for dozens in deadly building collapse",
  "description": "State prosecutors in Thailand have formally indicted 23 individuals and companies on charges related to the collapse of a Bangkok office building that collapsed after an earthquake, killing at least 92 people",
  "content": "BANGKOK — State prosecutors in Thailand have formally indicted 23 individuals and companies on charges related to the collapse of a Bangkok office building that collapsed after an earthquake, killing at least 92 people. The partially built high-rise, which was to house the new State Audit Office, was the only one in Thailand to completely collapse on March 28 due to the 7.7 magnitude earthquake, which was centered in neighboring Myanmar .\n\nThose indicted include the lead contractors for the project: Italian-Thai Development Co. and its Chinese joint venture partner for the project, the China Railway No. 10 company.\n\nItalian-Thai Development’s president, Premchai Karnasuta, and China Railway No. 10’s local director, Zhang Chuanling, were also indicted along with others, including designers, engineers and several other companies.\n\nThe charges in the various indictments include professional negligence in design, supervision, or construction practices that failed to comply with engineering standards, resulting in danger to others and causing deaths, according to a statement from the Office of the Attorney General.\n\nSeveral of those indicted Thursday had already surrendered to police and denied any wrongdoing.\n\nAn investigation by police and other officials found design and structural flaws were behind the building’s collapse and that some of the officially approved designs were not implemented.\n\nThe epicenter of the quake was in central Myanmar, where it killed more than 3,700 people and caused major damage in Mandalay, the country’s second-biggest city, and in the capital Naypyitaw.\n\nThe indictment of Italian-Thai Development’s Premchai is his second major tangle with the law. In 2019, he was convicted of killing protected animals and illegal possession of weapons while hunting in a wildlife sanctuary for which he served about three years in prison.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/bangkok-building-collapse-thailand-myanmar-earthquake-ee56ec5b47304c771d38c5998e587a5e",
    "https://www.youtube.com/watch?v=cxDbwy8txDs",
    "https://apnews.com/article/myanmar-thailand-earthquake-71d51dfc7339e017b1d116c105effab4",
    "https://apnews.com/article/thailand-bangkok-building-collapse-end-search-f697b0d506f6a531f2ff5d83f9362438"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "several other companies",
      "weight": 0.083107956
    },
    {
      "name": "deadly building collapse",
      "weight": 0.077780746
    },
    {
      "name": "State Audit Office",
      "weight": 0.07371062
    },
    {
      "name": "major damage",
      "weight": 0.06655205
    },
    {
      "name": "other officials",
      "weight": 0.06419878
    },
    {
      "name": "companies",
      "weight": 0.06360253
    },
    {
      "name": "central Myanmar",
      "weight": 0.062877536
    },
    {
      "name": "Thailand",
      "weight": 0.062043924
    },
    {
      "name": "Premchai Karnasuta",
      "weight": 0.061722882
    },
    {
      "name": "illegal possession",
      "weight": 0.060944743
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9677734375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.9482421875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.89208984375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.77587890625
    },
    {
      "name": "/News/Local News",
      "score": 0.7060546875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.38525390625
    }
  ],
  "sentiment": {
    "positive": 0.03982544,
    "negative": 0.7841797,
    "neutral": 0.17651367
  },
  "summary": "Thailand's state prosecutors have indicted 23 individuals and companies on charges related to the collapse of a Bangkok office building that collapsed after an earthquake, killing at least 92 people. The partially built high-rise was the only one in Thailand to completely collapse due to the 7.7 magnitude earthquake centered in Myanmar. The lead contractors for the project, Italian-Thai Development Co. and China Railway No. 10, were among the companies indicted. The charges include professional negligence in design, supervision, or construction practices that failed to comply with engineering standards, resulting in danger to others and causing deaths. Several of the indicted individuals have already surrendered to police and denied any wrongdoing. An investigation found design and structural flaws were behind the building’s collapse and some of the officially approved designs were not implemented.",
  "shortSummary": "Thailand's prosecutors have indicted 23 individuals and companies over the collapse of a Bangkok office building, killing at least 92 people.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5cf37be309464148a1e3518c8b7bc1e1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/myanmar-thailand-earthquake-71d51dfc7339e017b1d116c105effab4",
      "text": "Myanmar earthquake death toll rises to 3,145 as more bodies found\nMyanmar earthquake death toll rises to 3,145 as more bodies found\nBANGKOK (AP) — The death toll from the earthquake that hit Myanmar nearly a week ago rose Thursday to 3,145 as search and rescue teams found more bodies, the military-led government said, and humanitarian aid groups scrambled to provide survivors medical care and shelter.\nInformation Minister Maung Maung Ohn also announced at a meeting in the capital, Naypyitaw, that 4,589 people were injured and 221 others were missing, state television MRTV reported.\nThe epicenter of the 7.7 magnitude quake on March 28 was near Mandalay, Myanmar’s second-largest city. It brought down thousands of buildings, buckled roads and destroyed bridges in multiple regions.\nLocal media reports of casualties have been much higher than the official figures. With telecommunications widely out and many places difficult to reach, the numbers could rise sharply as more details come in.\nA report issued Thursday by the U.N. Office for the Coordination of Humanitarian Affairs estimated that the earthquake and aftershocks have affected more than 17 million people across 57 of the country’s 330 townships, including more than 9 million who were severely affected.\n“The coming days will be critical in determining the full scale of the disaster’s impact and the response required to meet the needs of millions affected,” it said.\nU.N. Secretary-General António Guterres said U.N. humanitarian chief Tom Fletcher and special envoy Julie Bishop will arrive in Myanmar on Friday.\nThe secretary-general appealed to the international community to immediately step up funding for quake victims “to match the scale of this crisis,” and urged unimpeded access to reach those in need.\n“The earthquake has supercharged the suffering – with the monsoon season just around the corner,” he said.\nThe World Health Organization said that according to its initial assessment, four hospitals and one health center had been completely destroyed, while another 32 hospitals and 18 health centers had been partially damaged.\n“With infrastructure compromised and patient numbers surging, access to health care has become nearly impossible in many of the worst-hit areas,” the U.N. said. “Thousands of people are in urgent need of trauma care, surgical interventions and treatment for disease outbreaks.”\nA mobile hospital from India and a joint Russian-Belarusian hospital also were now operating in Mandalay.\nWith many left homeless by the quake, and many others staying away from their homes because of fears that ongoing aftershocks will bring them down, workers in Naypyitaw labored in the 40 C (104 F) heat to busily erect big tents in open fields to provide some shelter.\nIn Mandalay, local residents gave slices of watermelon to Chinese volunteers taking a break from the high temperatures.\nMore than 1,550 international rescuers were operating alongside locals on Thursday, according to a statement from the military. Rescue supplies and equipment have been sent by 17 countries.\nMyanmar’s military seized power in 2021 from the democratically elected government of Aung San Suu Kyi, sparking what has turned into a civil war.\nThe quake worsened an already dire humanitarian crisis, with more than 3 million people displaced from their homes and nearly 20 million in need even before it hit, according to the United Nations.\nAs concerns grew that ongoing fighting could hamper humanitarian aid efforts, the military declared a temporary ceasefire Wednesday, through April 22. The announcement followed unilateral temporary ceasefires announced by armed resistance groups opposed to military rule.\nThe military said that it would still take “necessary” measures against those groups, if they use the ceasefire to regroup, train or launch attacks.\nAlready on Thursday, there were reports from local media in Kachin state in the north of Myanmar that military attacks continued in several areas, but they couldn’t be independently confirmed.\nPrior to the earthquake, the military was battling the Kachin Independence Army militia group. The KIA on Wednesday also declared a ceasefire but reserved the right to defend itself. It was unclear how the reported fighting broke out.\nThe earthquake shook Kachin, but there have been no reports of damage there.\nIn Bangkok, where the quake brought down a skyscraper under construction, the search for survivors and bodies continued as Gov. Chadchart Sittipunt said that a possible sound of life was detected in the rubble. By near day’s end, however, nobody was found.\nTwenty-two people were killed and 35 injured in the city, mostly by the collapse of the unfinished building.\n___\nJintamas Saksornchai contributed to this report."
    },
    {
      "url": "https://apnews.com/article/thailand-bangkok-building-collapse-end-search-f697b0d506f6a531f2ff5d83f9362438",
      "text": "Bangkok officials end search operation at the skyscraper that collapsed following an earthquake\nBANGKOK (AP) — Thai authorities on Tuesday officially ended the search operation at the building under construction in the capital, Bangkok, that collapsed following an earthquake that killed dozens over a month ago.\nThe 7.7 magnitude quake on March 28 centered in Myanmar, more than 800 miles (1,200 kilometers) away, killed at least 96 people in Bangkok, mostly at the collapsed site. More than 3,000 were killed in Myanmar.\nEighty-nine bodies have been retrieved from the rubble while seven people remain unaccounted for at the site, officials said. They said they would continue to test hundreds of pieces of human remains to identify those still missing.\nThe collapse sparked questions about the enforcement of construction safety and corruption. The high-rise building, meant to be the new office of the State Audit Office, was the only building that suffered a total collapse that day.\nThe police on Tuesday said they are still investigating and will continue to collect evidence from the collapse site until the end of this month.\nAuthorities are probing several companies and individuals for any wrongdoing in relation to the collapse, including the state-run Chinese contractor, China Railway No. 10 Engineering Group. The investigation has led to the arrest of its Chinese executive in Thailand, identified as Zhang, and three Thai shareholders on suspicion of operating the business through the use of nominees.\nForeigners can operate a business in Thailand, but it must be a joint venture with a Thai partner, and they cannot own more than 49% to protect local competitiveness.\nAnother Thai-Chinese company, Xin Ke Yuan Steel, also came under scrutiny over the quality of the steel rods provided for the building. Industry Minister Akanat Promphan said two types of steel rods found at the collapse site did not pass safety standards and that Xin Ke Yuan supplied both. The company has denied any wrongdoing."
    },
    {
      "url": "https://apnews.com/article/bangkok-building-collapse-thailand-myanmar-earthquake-ee56ec5b47304c771d38c5998e587a5e",
      "text": "Thai construction magnate facing charge over Bangkok tower collapse surrenders to police\nThai construction magnate facing charge over Bangkok tower collapse surrenders to police\nBANGKOK (AP) — A construction magnate, builders, designers and engineers surrendered to police Friday on criminal negligence charges over the collapse during the March 28 earthquake of a Bangkok high-rise in which 92 people died.\nPremchai Karnasuta, president of Italian-Thai Development Co, the main Thai contractor for the building project, as well as designers and engineers, was among 17 charged with the felony of professional negligence causing death, Bangkok deputy police chief Noppasin Poonsawat said.\nNoppasin said those who met police on Friday formally denied the charges. Several have previously issued public denials in response to allegations in the media.\nNinety-two people were confirmed dead in the rubble of the building that had been under construction. A small number of other people remain unaccounted for.\nThe building, which was to become a new State Audit Office, was the only one in Thailand to collapse in the earthquake that was centered in neighboring Myanmar. The search for victims at the site has been halted, though efforts to identify remains through DNA will continue.\nNoppasin said at a news conference that evidence and testimony from experts suggested the building plan did not meet standards and codes. The Bangkok Post newspaper said police had also determined the project showed “structural flaws in the core lift shaft and substandard concrete and steel.”\nThai media have reported allegations of wrongdoing in the project almost every day since the building’s collapse, many of them involving irregular documentation for the project. Their reports have highlighted the role of Italian-Thai’s Chinese joint venture partner, the China Railway No. 10 company, which is involved in projects around the world.\nOne of the 17 charged Friday was Chinese executive Zhang Chuanling, a director at China Railway No. 10’s joint venture with Italian-Thai Development. He was previously arrested last month on a charge of violating Thai business law by wrongly using Thai nominees to serve as the Chinese firm’s proxies to allegedly control the joint venture. Three Thai executives were also arrested on the charge.\nA Criminal Court issued arrest warrants for the 17 on the negligence charge on Thursday. Noppasin said 15 turned themselves in at a police station in the morning and the remaining two were expected to do so later.\nAll 15 were driven in police vehicles to the Bangkok Criminal Court, which approved a police detention request and denied the suspects’ bail applications, local media reported.\nThe epicenter of the quake was in central Myanmar, where it killed more than 3,700 people and caused major damage in Mandalay, the country’s second biggest city, and the capital Naypyitaw.\nPremchai’s case is his second major tangle with the law. In 2019, he was convicted of wildlife poaching and served about three years in prison.\nHe was found guilty of killing protected animals and illegal possession of weapons after park rangers found a hunting party at a wildlife sanctuary in 2018 with carcasses of a rare black panther, a kalij pheasant and a barking deer. The panther had been butchered and its meat cooked for soup."
    }
  ],
  "argos_summary": "Thai state prosecutors have indicted 23 individuals and companies, including the main contractors Italian-Thai Development Co. and China Railway No. 10, for professional negligence related to the collapse of a Bangkok office building during a 7.7 magnitude earthquake, which resulted in at least 92 deaths. Investigations revealed design and structural flaws in the building, which was intended to house the State Audit Office. The earthquake also caused significant devastation in Myanmar, with the death toll exceeding 3,700 and millions affected by the disaster.",
  "argos_id": "ZA3840NT0"
}