{
  "url": "https://finance.yahoo.com/news/fundamental-administrative-services-llc-provides-220000604.html",
  "authorsByline": "PR Newswire",
  "articleId": "9f79a6d76b504ba28bcb40993f5745cc",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/1ef4f1f882261f2a12affd190f1787ed",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T22:00:00+00:00",
  "addDate": "2025-08-15T22:06:55.177590+00:00",
  "refreshDate": "2025-08-15T22:06:55.177591+00:00",
  "score": 1.0,
  "title": "Fundamental Administrative Services, LLC Provides Notice of Data Security Event",
  "description": "Fundamental Administrative Services, LLC (\"Fundamental\") issued notice of a data security event that potentially affected information related to certain residents of the long-term care facilities for which it provides administrative services.",
  "content": "SPARKS, Md., Aug. 15, 2025 /PRNewswire/ -- Fundamental Administrative Services, LLC (\"Fundamental\") issued notice of a data security event that potentially affected information related to certain residents of the long-term care facilities for which it provides administrative services.\n\nOn or about January 20, 2025, Fundamental became aware of suspicious activity related to its computer network. In response, Fundamental quickly worked to secure all systems and began an investigation to determine the full nature and scope of the activity. The investigation determined that between October 27, 2024, and January 13, 2025, an unauthorized actor copied certain files from its computer network. Fundamental promptly began an internal review to determine the individuals whose information is stored on its computer systems and for whom it maintains current and accurate contact information. Fundamental is providing appropriate notification via written letter to the individuals for whom it identified current contact information.\n\nFundamental determined the following types of information may be contained in the impacted files: name, Social Security number, driver's license or state identification number, financial account information, date of birth, medical treatment information, health insurance policy number, and/or Medicare/Medicaid plan name.\n\nIndividuals seeking additional information regarding this incident, may call a toll-free assistance line that Fundamental established at 1-855-202-3346, Monday through Friday from 9 a.m. to 9 p.m. Eastern Time (excluding major U.S. holidays).\n\nIndividuals can also find additional information on how they can help protect their personal information, along with additional resources on Fundamental's website at https://fundltc.com/. As a precautionary measure, Fundamental encourages potentially affected individuals to remain vigilant against incidents of identity theft by reviewing account statements and monitoring credit reports for suspicious activity and to detect errors. Instances of known or suspected identity theft should be reported to the Federal Trade Commission, law enforcement, and the relevant state Attorneys General.\n\nFundamental takes this incident and the security of personal information in its care seriously. Upon discovering the incident, Fundamental took steps to further increase the security of its systems and investigate the nature and scope of the incident. As part of its ongoing commitment to the privacy of information in its care, Fundamental implemented additional technical security measures designed to prevent similar future incidents. Fundamental is also reviewing and enhancing existing policies and procedures.",
  "medium": "Article",
  "links": [
    "https://c212.net/c/link/?t=0&l=en&o=4489672-1&h=1053958241&u=https%3A%2F%2Ffundltc.com%2F&a=https%3A%2F%2Ffundltc.com%2F"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "additional information",
      "weight": 0.10626144
    },
    {
      "name": "personal information",
      "weight": 0.0997385
    },
    {
      "name": "financial account information",
      "weight": 0.09962682
    },
    {
      "name": "current contact information",
      "weight": 0.0987036
    },
    {
      "name": "information",
      "weight": 0.09746715
    },
    {
      "name": "Fundamental",
      "weight": 0.09649912
    },
    {
      "name": "Fundamental Administrative Services",
      "weight": 0.094942756
    },
    {
      "name": "medical treatment information",
      "weight": 0.09478635
    },
    {
      "name": "additional technical security measures",
      "weight": 0.08457199
    },
    {
      "name": "Data Security Event",
      "weight": 0.074035585
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.76171875
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.72216796875
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.39990234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.363037109375
    }
  ],
  "sentiment": {
    "positive": 0.16022825,
    "negative": 0.26375288,
    "neutral": 0.57601887
  },
  "summary": "Fundamental Administrative Services, LLC, has issued a notice of a data security event that potentially affected information related to certain residents of its long-term care facilities. The incident occurred on or about January 20, 2025, when Fundamental became aware of suspicious activity related to its computer network. The unauthorized actor allegedly copied certain files from its computer system between October 27, 2024, and January 13, 2025. The company is providing appropriate notification via written letter to the individuals for whom it identifies as individuals whose information is stored on its computer systems and maintains current and accurate contact information. As a precautionary measure, Fundamental encourages individuals to remain vigilant against incidents of identity theft by reviewing account statements and monitoring credit reports for suspicious activity.",
  "shortSummary": "Fundamental Administrative Services, LLC issued a notice of a data security event affecting information about individuals in its care, urging vigilance against identity theft and other potential identity theft concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7fad2e67425f43c9a927358e7f077fe6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Fundamental Administrative Services LLC announced a data security event that exposed personal information of residents in long‑term care facilities, with an unauthorized actor copying files between October 27, 2024, and January 13, 2025. The compromised data could include names, SSNs, driver’s license numbers, financial account details, medical and insurance information, and dates of birth. Affected individuals are being notified by letter and can obtain further details via a toll‑free line or the company’s website, which also offers guidance on protecting against identity theft. The company has tightened security measures and is reviewing policies to prevent future incidents.",
  "argos_id": "3D1BXKSUY"
}