{
  "url": "https://people.com/friends-left-note-on-hikers-car-in-case-he-didnt-return-from-waterfall-he-was-found-trapped-2-days-later-11791970",
  "authorsByline": "Sam Gillette",
  "articleId": "7267cbafba1f413d992faabd4595e9a3",
  "source": {
    "domain": "people.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://people.com/thmb/P_1EAkn-q0NhPlWHydj5EMXYDG8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(745x407:747x409)/Rescue-Saves-Man-Trapped-Behind-Waterfall-081525-tout-e8c9cece80cf4e6ba6f7cdf2799ae198.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T20:57:43+00:00",
  "addDate": "2025-08-15T21:09:44.006737+00:00",
  "refreshDate": "2025-08-15T21:09:44.006738+00:00",
  "score": 1.0,
  "title": "Friends Left Note on Hiker’s Car in Case He Didn’t Return from Waterfall. He Was Found Trapped 2 Days Later",
  "description": "A missing 46-year-old California man was found safe, but dehydrated, after he was trapped for two days behind a raging waterfall in the Sequoia National Forest, authorities said.",
  "content": "A missing 46-year-old California man was found safe, but dehydrated, after he was trapped for two days behind a raging waterfall in the Sequoia National Forest, authorities said.\n\nOn Sunday, Aug. 10, Ryan Wardwell planned to rappel the Seven Teacups waterfalls near the North Fork of the Kern River in California, but didn’t return to his car by late Sunday night, the Tulare County Sheriff's Office said in a statement obtained by PEOPLE.\n\nWardwell had hiked to the top of the falls with four friends, who decided to turn back after seeing the power of the rushing water, California Highway Patrol flight officer paramedic Mike Crane told the .\n\nBut Wardwell, who had rappelled the waterfalls four times before, decided to go on his own. After his friends got back to the trailhead, they left a note on his car, telling people nearby to report Wardwell as missing if his vehicle was still there the next day, the paper reported.\n\nBy Monday, Aug. 11, the sheriff’s office received reports that Wardwell was missing and was last seen at the top of the Seven Teacups waterfalls the evening prior.\n\nAfter an extensive search of the area, “using aircraft equipped with camera and infrared technology,” emergency responders were able to locate the missing man’s possible location, but it was too late to rescue him. Officials planned to return “at first light” the next day when it was safer.\n\nOn the morning of Tuesday, Aug. 12, a drone found Wardwell alive behind a large waterfall. The man told deputies that “he had come off his rappel lines and got trapped behind the waterfall because of the extreme hydraulics of the river,\" officials said.\n\nWardwell had stationed himself in a dark cave beneath the waterfall, where he huddled, soaking wet, for two days, the Chronicle reported.\n\n“He tried for days to escape, but there was nothing he could do to break through,” Capt. Kevin Kemmerling of the Tulare County Sheriff’s Office told the outlet. “There was no way for him to warm up or dry out in there, so it had to have been miserable.”\n\nA member of the rescue team was lowered down into the waterfall from the helicopter, secured Wardwell, before both men were hoisted to safety, authorities said. Officials described it as a “stunning survival story” and shared footage of the rescuer being carefully lowered to the cave entrance and the extraction of the two men.\n\n“I got the impression that maybe he didn’t know if he was ever going to get out of there,” Crane, who operated the hoist and spoke to Wardwell after his rescue, told the Chronicle .\n\nOnce Wardwell was on a dry landing zone, he received treatment for minor injuries and dehydration. Members of his family were there, waiting for him.\n\nThe Seven Teacups is a string of pools created by the strong currents of Dry Meadow Creek, according to AllTrails . Hikers are not advised to continue into the pools “without extensive canyoneering experience and proper equipment,” according to the hiking guide.\n\n Never miss a story — sign up for to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. \n\nAfter the death-defying incident, officials urged people to be aware of their experience level and the surrounding environment before venturing into white-water rivers.\n\n“Stay Safe, Stay Smart and Stay Alive,” the sheriff’s office said.",
  "medium": "Article",
  "links": [
    "https://people.com/23-year-old-man-hailed-ride-rocky-mountain-national-park-disappeared-11791502",
    "https://www.sfchronicle.com/outdoors/article/seven-teacups-waterfall-rescue-20817800.php",
    "https://people.com/boy-7-permanent-injuries-hit-by-falling-drone-during-holiday-show-suit-11791556",
    "https://www.alltrails.com/trail/us/california/seven-tea-cups-7tc-vis-dry-creek-meadow",
    "https://forms.dotdashmeredith.com/people-news-inline",
    "https://people-app.onelink.me/HNIa/kz7l4cuf",
    "https://www.facebook.com/reel/2150872688754272"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ryan Wardwell",
      "weight": 0.07805633
    },
    {
      "name": "Wardwell",
      "weight": 0.07786564
    },
    {
      "name": "Waterfall",
      "weight": 0.076261915
    },
    {
      "name": "California Highway Patrol flight officer paramedic Mike Crane",
      "weight": 0.06370472
    },
    {
      "name": "compelling human interest stories",
      "weight": 0.060811587
    },
    {
      "name": "extensive canyoneering experience",
      "weight": 0.060322218
    },
    {
      "name": "California Highway Patrol",
      "weight": 0.058874317
    },
    {
      "name": "days",
      "weight": 0.05760102
    },
    {
      "name": "Seven Teacups",
      "weight": 0.057267584
    },
    {
      "name": "late Sunday night",
      "weight": 0.05281826
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97802734375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.7744140625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.76171875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.67626953125
    },
    {
      "name": "/News/Other",
      "score": 0.6015625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.30908203125
    }
  ],
  "sentiment": {
    "positive": 0.063119404,
    "negative": 0.6862615,
    "neutral": 0.25061914
  },
  "summary": "Ryan Wardwell, a 46-year-old California man, was found safe but dehydrated after being trapped behind a raging waterfall in the Sequoia National Forest. Wardwell had planned to rappel the Seven Teacups waterfalls with four friends but decided to go solo after they returned home from the hike. After an extensive search, emergency responders were able to locate Wardwell's possible location but it was too late to rescue him. On the morning of Aug. 12, a drone found Wardwell alive behind a large waterfall. He had been huddled in a dark cave beneath the waterfall for two days and was rescued by a member of the rescue team. After his rescue, Wardwell was treated for minor injuries and dehydration.",
  "shortSummary": "A 46-year-old California man, Ryan Wardwell, was rescued from a raging waterfall after leaving a note indicating his disappearance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0606c3dafefc4d52b6b1f3ef69c22518",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://people.com/boy-7-permanent-injuries-hit-by-falling-drone-during-holiday-show-suit-11791556",
      "text": "Boy, 7, Has ‘Permanent’ Injuries After Being Hit by Falling Drone During Holiday Show: Suit The drone allegedly struck the boy \"in the face and chest, causing severe and permanent injuries\" By Ingrid Vasquez Ingrid Vasquez Ingrid Vasquez is a Digital News Writer at PEOPLE. She graduated from The University of Texas at Austin with a Bachelor in Journalism. Before joining the team, she worked as an Editor at FanSided and provided work in the celebrity and lifestyle space for brands that include Teen Vogue, Cosmopolitan, EW, and more. People Editorial Guidelines Published on August 14, 2025 10:08PM EDT 1 Comment The boy who was injured at the holiday drone show at Lake Eola on Dec. 21, 2024. Credit : Jessica Lumedge NEED TO KNOW A boy in Florida had to undergo emergency open-heart surgery after being injured at a holiday drone show in December 2024Edgerton has since filed a lawsuit against the city of Orlando and othersThe boy's alleged injuries are described in the lawsuit as \"past and future medical expenses, pain and suffering, mental anguish, disfigurement, disability, loss of enjoyment of life, and other economic and non-economic damages\" The mother of a 7-year-old boy who had to undergo emergency open-heart surgery after being injured at a holiday drone show in December 2024 is suing the city of Orlando, Fla., as well as other companies involved in the incident, a new lawsuit shows. The boy was with his parents, Jessica Lumedge and Adriana Edgerton, watching the show at Lake Eola on Dec. 21, 2024. The complaint obtained by PEOPLE alleges that, during the show, \"multiple drones malfunctioned, causing these drones to leave formation, deviate from the coordinated flight path and breach the designated geofenced perimeter.\" One of the drones allegedly \"entered the space occupied by spectators at a high rate of speed,\" striking the boy \"in the face and chest, causing severe and permanent injuries.\" Lake Eola during the holiday season. Getty The alleged injuries are described as \"past and future medical expenses, pain and suffering, mental anguish, disfigurement, disability, loss of enjoyment of life, and other economic and non-economic damages.\" As previously reported by PEOPLE, the boy underwent emergency open-heart surgery. According to Law & Crime, the boy spent roughly 10 days in he hospital and continues to recover from his injuries. The boy sustained \"traumatic, permanent injuries requiring medical treatment, and will continue to suffer physical, emotional, and financial harm,\" according to the lawsuit. A GoFundMe created to help with medical funds has raised over $36,000 of its $50,000 goal. Related Stories Pregnant Wife of Former NBA Star Says She's Still 'Traumatized' After Being Bitten by Shark, Thanks 'Angel' Who Helped Her Teenage Trapeze Artist Injured After Falling from the Air While Using Aerial Silks in Circus Accident The lawsuit claims that the City of Orlando should have known that the drone show \"involved high-risk aerial equipment\" and that the drones \"posed a foreseeable and unreasonable risk of harm to the public.\" According to a preliminary report by the National Transportation Board (NTSB), a review of aircraft logs revealed a 7-degree misalignment with the show position, resulting in the geo hard fence being too close to the audience. \"In addition, the fence was set to 5 meters rather than the company's standard of 1 meter. The combined errors resulted in a reduced safety area that was outside of company standards,\" the report said. The boy who was injured at the holiday drone show at Lake Eola on Dec. 21, 2024. Jessica Lumedge The city of Orlando, Sky Elements, and the drone's manufacturer are accused of negligence. The software developer for the drones is accused of strict liability. Sky Elements told PEOPLE it is aware of the filing; however, \"as this is an ongoing legal matter, we cannot comment further at this time.\" A spokesperson for the city of Orlando told PEOPLE that the city had yet to be served as of Wednesday, Aug. 13. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. PEOPLE has reached out to the city of Orlando, NTSB, and an attorney for the plaintiff for comment. Close Leave a Comment Read more: Human Interest Real People"
    },
    {
      "url": "https://people.com/23-year-old-man-hailed-ride-rocky-mountain-national-park-disappeared-11791502",
      "text": "23-Year-Old Man Hailed a Ride to Rocky Mountain National Park, Then He Disappeared Blake Kieckhafer was last seen on Thursday, August 7 By Jillian Frankel Jillian Frankel Jillian Frankel is a staff writer at PEOPLE covering current events. She previously worked as a producer and reporter for NBC News. People Editorial Guidelines Published on August 14, 2025 06:04PM EDT 1 Comment Blake Kieckhafer, 23, was last seen alive on Thursday, August 7 at Rocky Mountain National Park. Credit : nps.gov NEED TO KNOW Blake Kieckhafer, 23, disappeared after taking a ride share service to Rocky Mountain National Park in Colorado, National Park Service officials sayHe was last seen on Thursday, August 7, when he was dropped off at the park by a ride share serviceHis family reported him missing on Monday, August 11 A 23-year-old man is missing after hailing a ride share service to Rocky Mountain National Park in Colorado, park officials say. Search efforts began after the family of Blake Kieckhafer, from Omaha, Nebraska, reported him missing to park rangers on Monday, August 11, a National Park Service spokesperson said in a statement on Tuesday, August 12. Our new app is here! Free, fun and full of exclusives. Scan to download now! Kieckhafer was last spotted in the Upper Beaver Meadows area of the park on Thursday, August 7 around 5:20 p.m. local time, when he was dropped off by the ride share service, the park spokesperson said. No updates have been shared since and park officials did not immediately respond to PEOPLE's request for comment. Related Stories N.C. Woman Found Alive 9 Months After She Went Missing with Her Car Abandoned Near Off-the-Grid Calif. Desert Community Man, 35, Goes Missing at Grand Canyon National Park, Leaving His Truck Behind in Trail Parking Lot Kieckhafer's brother Justin pleaded for information in a Facebook group post on Sunday, August 10, calling it a \"shot in the dark.\" He said Blake bought something at an O'Reilly Auto Parts shop and purchased a day pass to Rocky Mountain National Park that was scanned on Thursday evening, the day he was last seen. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Blake was last seen wearing a dark T-shirt, dark pants, and a dark baseball cap with no logo, according to park officials. He was carrying a small, maroon daypack and is about 5'11\" and 180 lbs. with short blond hair, a mustache and blue/green eyes. Officials are urging those with information about Kieckhafer's whereabouts to call the National Park Service Investigative Services Bureau Tip Line or submit a tip online or via email. Close Leave a Comment Read more: Human Interest Real People"
    }
  ],
  "argos_summary": "A 46‑year‑old California hiker, Ryan Wardwell, was rescued after two days trapped behind the Seven Teacups waterfalls, with rescuers using a drone and helicopter to extract him from a dark cave. Separately, a 7‑year‑old boy in Florida sustained permanent injuries when a drone from a holiday show struck him, leading to a lawsuit against the city of Orlando and other parties. In Colorado, 23‑year‑old Blake Kieckhafer disappeared after a rideshare drop at Rocky Mountain National Park, with no updates since his last sighting on August 7 and authorities urging tips.",
  "argos_id": "3OA86BM24"
}