{
  "url": "https://nypost.com/2025/08/15/us-news/trump-claims-great-progress-in-putin-meeting-but-holds-details-close-pending-calls-to-zelensky-european-allies/",
  "authorsByline": "Steven Nelson, Diana Nerozzi",
  "articleId": "609595c4d052430b88751ef9b48ac032",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/us-president-donald-trump-russian-109649533.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T23:20:11+00:00",
  "addDate": "2025-08-15T23:22:32.076447+00:00",
  "refreshDate": "2025-08-15T23:22:32.076449+00:00",
  "score": 1.0,
  "title": "Trump claims ‘great progress’ in Putin meeting — but holds details close pending calls to Zelensky, European allies",
  "description": "President Trump proclaimed Friday he and Russian President Vladimir Putin made “great progress” toward ending Moscow’s war on Ukraine after meeting for nearly three hours in Alask…",
  "content": "ANCHORAGE— President Trump proclaimed Friday he and Russian President Vladimir Putin made “great progress” toward ending Moscow’s war on Ukraine after meeting for nearly three hours in Alaska — while cautioning “there’s no deal until there’s a deal.”\n\nTrump, 79, and Putin, 72, didn’t publicly mention any details of a preliminary “understanding” toward ending the long-running war, with the US leader saying he would be calling Ukrainian President Volodymyr Zelensky and key European allies to discuss negotiations.\n\n“There were many, many points that we agreed on, most of them,” Trump said at a media availability where neither he nor Putin took any questions.\n\nHere’s the latest on Trump and Putin’s summit in Alaska\n• What to expect from Friday’s Trump-Putin summit on US soil: Will a peace deal actually be reached?\n• White House releases new details on Trump-Putin summit in US, calls it a ‘listening exercise’\n• Trump rails against ‘unfair’ media quoting ‘fired losers’ ahead of high-stakes meeting with Putin\n\n“I would say a couple of big ones that we haven’t quite got there, but we’ve made some headway,” he added. “So there’s no deal until there’s a deal. I will call up NATO in a little while, I will call up the various people that I think are appropriate, and, of course, call up President Zelensky and tell them about today’s meeting. It’s ultimately up to them.”",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/13/world-news/trump-slams-media-coverage-ahead-of-high-stakes-putin-meeting/",
    "https://nypost.com/2025/08/09/world-news/ukraine-european-leaders-counter-russian-cease-fire-plan-ahead-of-trump-and-putin-meeting/",
    "https://nypost.com/2025/08/15/us-news/trump-admin-live-updates-putin-meeting-national-guard-in-dc-more-news/",
    "https://nypost.com/2025/08/12/us-news/white-house-confirms-trump-putin-summit-in-anchorage-calling-it-listening-exercise/",
    "https://nypost.com/2025/08/12/world-news/what-to-expect-from-fridays-trump-putin-summit-on-us-soil-will-a-peace-deal-actually-be-reached/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Trump",
      "weight": 0.12344704
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.11997183
    },
    {
      "name": "Putin meeting",
      "weight": 0.11865821
    },
    {
      "name": "Vladimir Putin",
      "weight": 0.110875234
    },
    {
      "name": "Putin",
      "weight": 0.10770732
    },
    {
      "name": "President Zelensky",
      "weight": 0.10476761
    },
    {
      "name": "Ukrainian President Volodymyr Zelensky",
      "weight": 0.10399667
    },
    {
      "name": "Trump",
      "weight": 0.1035281
    },
    {
      "name": "Volodymyr Zelensky",
      "weight": 0.08548003
    },
    {
      "name": "US soil",
      "weight": 0.08543993
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97900390625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.921875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.892578125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.7724609375
    },
    {
      "name": "/News/World News",
      "score": 0.61474609375
    }
  ],
  "sentiment": {
    "positive": 0.16061534,
    "negative": 0.42430303,
    "neutral": 0.41508165
  },
  "summary": "President Trump and Russian President Vladimir Putin have made \"great progress\" towards ending Moscow's war on Ukraine, despite not publicly announcing any details of a preliminary agreement. Instead, they will instead discuss discussions with Ukrainian President Volodymyr Zelensky and European allies.",
  "shortSummary": "President Trump declared progress on ending Ukraine’s civil war with Vladimir Putin, while keeping his distance from key negotiations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3ba45657574e4282a491371fabea49f1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/12/world-news/what-to-expect-from-fridays-trump-putin-summit-on-us-soil-will-a-peace-deal-actually-be-reached/",
      "text": "What to expect from Friday’s Trump-Putin summit on US soil: Will a peace deal actually be reached?\nWASHINGTON — President Trump’s Friday meeting with Russian dictator Vladimir Putin may be the most-watched Washington-Moscow summit in decades — but don’t expect any major decisions to be made as the US president seeks a “more firm understanding” of how to end Moscow’s war on Ukraine, sources and experts tell The Post.\nTrump, 79, plans to treat the meeting as a “listening exercise” rather than a high-stakes negotiation, White House press secretary Karoline Leavitt said Tuesday.\nWhile Putin, 72, has set audacious conditions for agreeing to a cease-fire with Ukraine, the US has made no concrete decision to date on whether to support them, sources familiar with the matter tell The Post.\nWhat Russia wants\nAmong the demands reportedly pushed by Putin — almost entirely unchanged from the start of the war nearly three-and-a-half years ago — is the formal recognition by the US and Ukraine of the Donetsk and Luhansk oblasts as Russian territory, despite Moscow being unable to secure them in 11 years of trying.\nThis recognition would include the roughly 30% of Donetsk and Luhansk that Russia does not control.\nThe Kremlin also seeks a freezing of the current front lines.\nThe desires were communicated to Trump by Special Envoy Steve Witkoff, who met with Putin at the Kremlin last week, according to European officials.\nHere are the latest details on Trump and Putin's meeting in Alaska\n- The meeting will take place in Anchorage, Alaska at Joint Base Elmendorf-Richardson.\n- Trump said his sitdown with Putin in Alaska will be “setting the table” for a possible future meeting about the war in Ukraine with Ukrainian President Volodymyr Zelensky present.\n- Putin suggested the US and Russia could reach a deal on nuclear arms control.\n- President Trump estimated Thursday there is a 25% chance that his Alaska summit will fail.\n- Zelensky met with European world leaders ahead of the meeting between Trump and Putin.\nHowever, Russia has not made these demands public, which is one reason why Ukrainian President Volodymyr Zelensky would like a sitdown with Putin — to get the terms direct from the horse’s mouth.\nRussia has also pushed for Ukraine to formally agree to never join NATO, a halt to shipments of Western weapons to Ukraine and a prohibition on NATO-aligned soldiers from setting foot on Ukrainian territory.\nDespite the White House insisting the war will be the primary topic, Russian officials have indicated they see the Alaska summit as a prime opportunity to discuss potential deals with the US — including opening up Alaskan airspace to Russian flights.\n“We hope that the upcoming summit will give impetus to the normalization of bilateral relations,” Russia’s deputy Foreign Minister Sergey Ryabkov told state media site Izvestia, noting that restoration of air traffic could be a possible topic.\nThe Arctic and economic cooperation are also topics that interest Russia, Putin adviser Yuri Ushakov said, noting that the Kremlin hopes the meeting will lead to Trump going to Russia in the future.\nHere’s the latest on Trump and Putin’s summit in Alaska\n- What to expect from Friday’s Trump-Putin summit on US soil: Will a peace deal actually be reached?\n- White House releases new details on Trump-Putin summit in US, calls it a ‘listening exercise’\n- Ukraine, European leaders counter Russian cease-fire plan ahead of Trump and Putin meeting\n- Trump rails against ‘unfair’ media quoting ‘fired losers’ ahead of high-stakes meeting with Putin\nHowever, Russia observers have expressed concerns over the Alaska location — particularly as Moscow’s hardliners have long “lamented the loss of Russia’s larger territorial extent throughout history,” George Barros of the Institute for the Study of War said Tuesday.\n“Russian nationalists have manufactured a pseudo-historical argument for why America’s purchase of Alaska [in 1867] was illegitimate, and that Alaska is therefore actually legally Russian,” he said. “This is all nonsense, of course.”\n“The Russian nationalist doesn’t respect the United States, but rather invents territorial disputes with its neighbors and seethes at Russa’s diminished geography.”\nWhat Ukraine wants\nZelensky, 47, has called Moscow’s demands untenable for establishing a cease-fire, but has signaled openness to some concessions — so long as they are made as part of a final peace deal.\nEnding the war after more than three grueling years would be a positive for Zelensky, as his country has been ravaged by missile strikes, mines and Russian infantry.\nBut the Ukrainian leader has been clear he will not accept peace at any price.\nZelensky has been adamant that Ukraine receive security guarantees, like NATO membership or nuclear weapons, to ensure Russia doesn’t invade again in the future.\n“It is impossible to talk about Ukraine without Ukraine, and no one will recognize that. That’s why this conversation may be important for their bilateral track, but they cannot decide anything on Ukraine without us,” Zelensky told reporters in Kyiv Tuesday. “I hope the US president understands that and takes into account.”\nWhat Trump wants\nFriday will give the president a chance to observe Putin with his own eyes to better assess whether the Russian dictator is “tapping [him] along” with empty promises of peace, as Trump himself has occasionally suggested might be the case.\n”Only one party that’s involved in this war is going to be present, and so this is for the president to go in and to get, again, a more firm and better understanding of how we can hopefully bring this war to an end,” Leavitt said.\nSecretary of State Marco Rubio similarly described the summit as a “feel-out meeting, to be honest.”\n”The president talked to Putin on the phone three or four times, OK? And nothing has come of it — or at least we haven’t gotten to where we want to be,” he said. “And so the president feels like, ‘Look, I’ve got to look at this guy across the table. I need to see him face-to-face. I need to hear him one-on-one. I need to make an assessment by looking at him.’”\nTrump made ending the war in Ukraine one of his major 2024 campaign promises, and securing a peace deal would provide a major bulwark for his foreign policy legacy.\nTo that end, Trump is expected to raise the issue of land swaps between Russia and Ukraine to gauge Putin’s reaction. The US president will also speak to European leaders ahead of Friday’s meeting in addition to after the sitdown, sources familiar with the preparations say.\n“The next meeting will be with Zelensky and Putin, or Zelensky and Putin and me. I’ll be there if they need, but I want a meeting set up between the two leaders,” Trump said Monday. “There’ll be some land swapping.”"
    },
    {
      "url": "https://nypost.com/2025/08/12/us-news/white-house-confirms-trump-putin-summit-in-anchorage-calling-it-listening-exercise/",
      "text": "White House confirms Trump-Putin summit in Anchorage, calling it ‘listening exercise’\nWASHINGTON — President Trump will meet Russian President Vladimir Putin on Friday in Anchorage, Alaska, for what White House press secretary Karoline Leavitt billed as a “listening exercise.”\n“Only one party that is involved in the war is going to be present,” Leavitt told reporters Tuesday, “and so this is for the president to go and get a better understanding of how we can hopefully bring this war to an end.”\nSwitzerland, Turkey and the United Arab Emirates had been among the speculated locations for the closely watched summit, the first sit-down between Putin and an American president since the February 2022 invasion of Ukraine.\n“There were many sites discussed, but of course, Alaska is a state within the United States of America, so the president is very honored,” Leavitt said.\nA venue for the meeting has not been made public, but Anchorage — a city of around 300,000 — is already experiencing an influx of officials and reporters seeking hotel rooms and other amenities to cover the high-level talks.\nHere’s the latest on Trump and Putin’s summit in Alaska\n- What to expect from Friday’s Trump-Putin summit on US soil: Will a peace deal actually be reached?\n- White House releases new details on Trump-Putin summit in US, calls it a ‘listening exercise’\n- Ukraine, European leaders counter Russian cease-fire plan ahead of Trump and Putin meeting\n- Trump rails against ‘unfair’ media quoting ‘fired losers’ ahead of high-stakes meeting with Putin\nRussian state media have speculated the meeting could take place at a military base, or at the Alyeska resort south of downtown Anchorage in the Girdwood neighborhood.\nBut reservations are hard to come by on such short notice and the US team is racing to provide the Russian delegation with credentials — as well as arranging adequate security for Trump without the typical weeks or months of lead time.\nThe Kremlin also extended an invitation for Trump to cross into Russian territory from Alaska, but Leavitt said the president would not leave US soil — despite Trump himself saying several times on Monday that he was “going to Russia.”\n“Perhaps there are plans in the future to travel to Russia,” the press secretary said, but Friday’s meeting will take place entirely in Alaska.\nUkrainian President Volodymyr Zelensky will not be joining the talks, Leavitt reaffirmed, because Putin himself asked Trump to meet one-on-one.\n“The president is agreeing to this meeting at the request of President Putin,” she said, noting that Trump plans to call Zelensky and other European leaders once the sitdown is done."
    },
    {
      "url": "https://nypost.com/2025/08/13/world-news/trump-slams-media-coverage-ahead-of-high-stakes-putin-meeting/",
      "text": "Trump rails against ‘unfair’ media quoting ‘fired losers’ ahead of high-stakes meeting with Putin\nPresident Trump raged against the “unfair” media over their coverage of his high-stakes summit with Russian tyrant Vladimir Putin in Alaska on Friday.\n“Very unfair media is at work on my meeting with Putin. Constantly quoting fired losers and really dumb people like John Bolton, who just said that, even though the meeting is on American soil,” Trump seethed on Truth Social Wednesday.\n“‘Putin has already won.’ What’s that all about? We are winning on EVERYTHING. The Fake News is working overtime (No tax on overtime!). If I got Moscow and Leningrad free, as part of the deal with Russia, the Fake News would say that I made a bad deal! But now they’ve been caught,” he added.\nLeningrad reverted to its pre-Bolshevik name, St. Petersburg, in 1991.\nTrump’s anticipated meeting at Joint Base Elmendorf-Richardson with Putin will mark the first time the Russian leader sets foot on US soil in about a decade. It will also be Putin’s first in-person meeting with a US president since he began the brutal invasion of Ukraine in 2022.\nSince returning to the White House in January, Trump has made ending the bloody war in Ukraine one of his top foreign policy objectives. Over recent months, he has soured on Putin over the brutal Russian drone and missile strikes on Ukrainian civilians.\nCritics such as Trump’s former national security adviser John Bolton have argued that the president will be welcoming a “rogue leader of a pariah state” into the US and that Putin will attempt to “take advantage” of him.\nThe Friday summit meeting comes after special envoy Steve Witkoff met with the Russian leader at the Kremlin last week, ahead of Trump’s deadline for Moscow to move toward peace or else the US would work to cut off its oil exports using steep economic penalties.\nHere’s the latest on Trump and Putin’s summit in Alaska\n- What to expect from Friday’s Trump-Putin summit on US soil: Will a peace deal actually be reached?\n- White House releases new details on Trump-Putin summit in US, calls it a ‘listening exercise’\n- Ukraine, European leaders counter Russian cease-fire plan ahead of Trump and Putin meeting\n- Trump rails against ‘unfair’ media quoting ‘fired losers’ ahead of high-stakes meeting with Putin\nDetails about Putin’s exact conditions for bringing about an end to his country’s war are murky and have drawn confusion from European allies.\nUkrainian President Volodymyr Zelensky has publicly cast doubt on making significant territorial concessions to Russia and underscored that Ukraine must have a say in any potential deal.\nThe Trump administration is working toward a trilateral summit among Trump, Putin and Zelensky and sees the Alaska meeting as a step toward that goal, according to Vice President JD Vance.\nOne of Trump’s close allies, NATO Secretary General Mark Rutte, has claimed the president is “testing” Putin and trying to gauge his openness to peace.\nSecretary of State Marco Rubio similarly implied that Trump is attempting to get a better sense of whether the Russian dictator is open to peace.\n“The president talked to Putin on the phone three times or four times. Okay. And nothing has come of it — or at least we haven’t gotten to where we want to be,” Rubio told “Sid and Friends in the Morning” on Tuesday.\n“So the president feels like, ‘Look, I’ve got to look at this guy across the table. I need to see him face-to-face,'” he added. “‘I need to make an assessment by looking at him.'”"
    }
  ],
  "argos_summary": "President Trump met Russian President Vladimir Putin in Anchorage, Alaska, for a three‑hour discussion that he described as a “listening exercise” and claimed made “great progress” toward ending Russia’s war in Ukraine, though no concrete terms were disclosed.  Trump said he would call Ukrainian President Volodymyr Zelensky and European allies to discuss any potential agreements, emphasizing that a deal would only come if all parties agreed.  Russian demands reportedly include recognition of Donetsk and Luhansk as Russian territory, a freeze of front lines, and Ukraine’s refusal to join NATO, while Ukraine insists on security guarantees and a final peace deal that protects its sovereignty.  The summit was seen by U.S. officials as a chance to gauge Putin’s willingness to negotiate, with no immediate outcomes expected and the meeting positioned as a precursor to a possible trilateral summit involving Zelensky.  Media coverage highlighted the lack of detail, the political stakes for Trump’s 2024 campaign, and the broader international debate over the feasibility of a cease‑fire under Moscow’s conditions.",
  "argos_id": "48PG69P1W"
}