{
  "url": "https://www.pymnts.com/artificial-intelligence-2/2025/enterprises-confront-the-real-price-tag-of-ai-deployment/",
  "authorsByline": "PYMNTS",
  "articleId": "207a1d72e91b4677ac556cf633649030",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2024/11/AI-costs-artificial-intelligence.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T20:27:48+00:00",
  "addDate": "2025-08-15T20:35:00.453373+00:00",
  "refreshDate": "2025-08-15T20:35:00.453374+00:00",
  "score": 1.0,
  "title": "Enterprises Confront the Real Price Tag of AI Deployment",
  "description": "The rush to integrate artificial intelligence (AI) into enterprise operations is colliding with a complex and sometimes underestimated reality: Deploying",
  "content": "In the long run, the true cost of AI to businesses may be not adopting the technology in the first place, and risk falling behind.\n\nSelf-hosting and embedded AI can significantly reduce expenses compared to cloud-only or standalone tools, especially at scale.\n\nEnterprise AI projects often cost far more than model fees alone, with hidden infrastructure, integration and compliance pushing total spending higher.\n\nThe rush to integrate artificial intelligence (AI) into enterprise operations is colliding with a complex and sometimes underestimated reality: Deploying AI at scale can be pricey, and the true cost can extend far beyond the per-million-token rates on vendor websites.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nAccording to recent PYMNTS Intelligence data, the cost of deploying AI is the second biggest drawback of generative AI adoption, with 46.7% citing it as a concern, following only integration complexity.\n\nOn paper, the cost of using today’s generative models is falling based on what AI companies are charging.\n\nFor example, OpenAI’s GPT-4 with an 8K context window had cost $30 per million input tokens and $60 per million output tokens as of early 2023. This year, GPT-4 Turbo, which is more powerful, nonetheless costs 50% to 67% less: $10 per million input tokens and $30 for the output.\n\nAccording to Stanford’s 2025 Artificial Intelligence Index report, as AI models become more capable and smaller, the costs for applying them in use cases — inference — “have fallen anywhere from nine to 900 times per year,” the report said.\n\nWhen it comes to infrastructure, costs have declined by 30% annually, while energy efficiency has improved by 40% each year, according to the Stanford report. Moreover, open-weight models that are free to use are closing the gap with closed models in performance.\n\nBut these headline numbers tell only part of the story.\n\nAlthough the cost of the models has dropped since 2022, the overall cost of ownership “has been resistant to declines,” said Muath Juady, founder of SearchQ.AI. “The real expenses lie in the hidden infrastructure, including data engineering teams, security compliance, constant model monitoring, and integration architects necessary to connect AI with existing systems.”\n\nFor every dollar spent on AI models, businesses are spending five to $10 to make the models “production-ready and enterprise-compliant,” Juady told PYMNTS. “The integration challenges tend to be more expensive than the technology itself and require substantial investment in change management and process redesign, which many organizations underestimate.”\n\nMoreover, the cost of AI deployment “is not a one-time expense but an ongoing operational commitment,” Juady added.\n\nSo why is AI adoption soaring? Juady said, “businesses that are successfully adopting AI are not waiting for costs to drop further; they are identifying specific use cases where even current costs can provide a measurable ROI.”\n\nFor many enterprises, early decisions, such as whether to self-host, use the cloud or use third-party infrastructure, can dictate as much as 40% of AI expenses, said Pavel Bantsevich, project manager and solutions advisor at Pynest. Cloud-based hosting may be ideal for prototypes, but costs can spike as workloads scale.\n\nBantsevich said he worked with a U.S. construction company that’s been in business for a century to develop an AI predictive analytics tool and hosted it in the cloud. Infrastructure costs came to under $200 a month. But once it went live and people started using it, costs soared to around $10,000 a month. Switching to self-hosting using Meta’s open-source Llama model instead of the cloud lowered the cost to about $7,000 a month and has remained under control.\n\nIn another case, a European retailer client of Bantsevich’s with more than 50,000 employees wanted to implement a computer vision module for self-checkout machines. But the company didn’t want to use the cloud. It self-hosted instead using a small Llama AI model that performed well. Costs came to less than $10 a month per machine. “If a cloud solution had been selected, the numbers would have gone sky high,” he said.\n\nBantsevich believes that costs will continue to decline because datasets are more readily available today and cloud providers also have cut rates to retain customers. “It is likely we shall see AI costs be similar to electricity bills in the near future,” he predicted.\n\nMeanwhile, Bill Chief Financial Officer Rohini Jain advised businesses to take advantage of AI that is already embedded in the platforms they use, such as those for invoicing, payments or forecasting, rather than adding standalone tools with “uncertain” pricing. “Integrated solutions typically offer better ROI and more predictable costs, such as subscription pricing,” she said.\n\nFergal Glynn, CMO and AI security advocate of Mindgard, said deploying AI can cost as little as $10,000 for basic projects, while large-scale enterprise systems can run into millions of dollars. Most companies spend between $50,000 and $500,000 for practical use cases like analytics tools or chatbots; smaller firms often pay less by using off-the-shelf AI.\n\nNicole DiNicola, global vice president of marketing at Smartcat, told PYMNTS that adopting AI doesn’t have to be “all or nothing.”\n\n“Many platforms, including free or low-cost options, make it easy for organizations to start small and scale their adoption over time,” DiNicola said. “Unlike legacy SaaS, which often requires lengthy onboarding, upfront costs, and full-scale deployment to show value, AI can deliver meaningful impact without being fully integrated organization-wide.”\n\nDiNicola pointed to teams embedding AI into workflows and already gaining efficiencies and cost savings. “AI tends to compound in value, but even small-scale adoption can drive clear and measurable improvements.”\n\nA worse outcome would be letting the cost and complexity of AI scare a business into avoiding AI deployment in the first place.\n\n“Inaction is often the more expensive path, even if it’s less obvious upfront,” DiNicola added. “While that delay might feel safe, early adopters are already building momentum, improving processes, learning faster, and expanding their competitive advantage.”\n\nHow to Choose Between Deploying an AI Chatbot or Agent\n\nSmall Business, Big AI: How SMBs Are Leveling the Playing Field With Enterprise Giants\n\nAI in Accounting Services May Level Playing Field for Small Businesses",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/artificial-intelligence-2/2025/ai-in-accounting-services-may-level-playing-field-for-small-businesses/",
    "https://www.pymnts.com/study_posts/high-impact-big-reward-meet-the-genai-focused-cfo/",
    "https://www.pymnts.com/subscribe/",
    "https://www.linkedin.com/in/rohini-jain-9586485/",
    "https://community.openai.com/t/understanding-gpt-4-api-pricing-with-respect-to-roles-and-request-response/195879",
    "https://www.linkedin.com/in/fergalglynn/",
    "https://www.pymnts.com/news/artificial-intelligence/2025/how-to-choose-between-deploying-ai-chatbot-versus-agent/",
    "https://www.linkedin.com/in/pavel-bantsevich/?originalSubdomain=pl",
    "https://hai.stanford.edu/assets/files/hai_ai_index_report_2025.pdf",
    "https://www.pymnts.com/artificial-intelligence-2/2025/small-business-big-ai-how-smbs-are-leveling-the-playing-field-with-enterprise-giants/",
    "https://platform.openai.com/docs/pricing",
    "https://www.linkedin.com/in/nicoledinicola/",
    "https://www.linkedin.com/in/muath-juady/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI costs",
      "weight": 0.11831988
    },
    {
      "name": "AI models",
      "weight": 0.1017013
    },
    {
      "name": "Enterprise AI projects",
      "weight": 0.09385606
    },
    {
      "name": "AI expenses",
      "weight": 0.093223795
    },
    {
      "name": "AI adoption",
      "weight": 0.09263836
    },
    {
      "name": "AI companies",
      "weight": 0.09193794
    },
    {
      "name": "AI Deployment",
      "weight": 0.09173235
    },
    {
      "name": "AI deployment",
      "weight": 0.09173235
    },
    {
      "name": "AI",
      "weight": 0.09098971
    },
    {
      "name": "Infrastructure costs",
      "weight": 0.090021886
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.88134765625
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.77099609375
    },
    {
      "name": "/News/Technology News",
      "score": 0.7568359375
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.74072265625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.6376953125
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.63232421875
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Data Management",
      "score": 0.390869140625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.332763671875
    }
  ],
  "sentiment": {
    "positive": 0.06849032,
    "negative": 0.7256328,
    "neutral": 0.20587692
  },
  "summary": "The cost of integrating artificial intelligence (AI) into enterprise operations can be underestimated, as it can be costly. Self-hosting and embedded AI can significantly reduce expenses compared to cloud-only or standalone tools, especially at scale. However, the true cost can extend beyond per-million-token rates on vendor websites. According to PYMNTS Intelligence data, the cost of deploying AI is the second biggest drawback of AI adoption, with 46.7% citing it as a concern. Stanford's 2025 Artificial Intelligence Index report found that as AI models become more capable and smaller, costs for applying them in use cases have fallen anywhere from nine to 900 times per year. Despite this, the overall cost of ownership has been resistant to declines. For every dollar spent on AI models, businesses are spending five to $10 to make the models “production-ready and enterprise-compliant” and require substantial investment in change management and process redesign.",
  "shortSummary": "Despite advancements in AI, scale-scale adoption can cost significantly more than initial costs, with hidden infrastructure and integration challenges posing a significant risk to enterprise success.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7006fed1c91f415ea462351a8d7bf49c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://community.openai.com/t/understanding-gpt-4-api-pricing-with-respect-to-roles-and-request-response/195879",
      "text": "80\n1\nGPT-4 8k model price:\n3 cents per 1k tokens for the prompt\n6 cents per 1k tokens for the completion\nIs “prompt” here another word for (http)request?\nAnd “completion” means response?\nI see another interpretation: it depends on the role:\n{\n\"model\": \"gpt-3.5-turbo\",\n\"messages\": [\n{\"role\": \"user\", \"content\": \"Hi, can you help me find a good restaurant nearby?\"},\n{\"role\": \"assistant\", \"content\": \"Of course! What type of cuisine are you in the mood for?\"},\n{\"role\": \"user\", \"content\": \"I'm feeling like having Italian food tonight.\"},\n{\"role\": \"assistant\", \"content\": \"Great! I recommend trying out Trattoria Toscana. It's a cozy little Italian place with great pasta dishes.\"},\n{\"role\": \"user\", \"content\": \"That sounds perfect! What's the address?\"},\n{\"role\": \"assistant\", \"content\": \"The address is 123 Main Street. Enjoy your meal!\"}\n]\n}\nHere we would concatenate all contents from the user role, and this gets then tokenized and costs 3 cents per 1k tokens. While at the same time the assistant contents are computationally different and thus cost 6 cents per 1k tokens.\nAlso: am I right that the JSON skeleton of my request does not count towards the token limit? Only the concatenations of the “content” values?\nYou’re charged for every token going in and every token coming out. With practice, you can learn how to pare down prompts to the bare minimum to get what you’re after for the best price. Alternatively, in some cases, it might be possible to craft a prompt and give it one or two examples (one-shot or two-shot) and get as good results for a lot cheaper $0.002/1000 tokens for GPT-35-turbo…\n2 Likes\n80\n3\nOkay good, so indeed “prompt” means “https request” while “completion” means “http response”. OpenAI just preferred using some different wording here.\nI have already been able to develop some routines to greatly reduce the token count. For example today from 904 down to 161 tokens. Anyway, thanks for the response, I don’t want to go too offtopic here!\nsorry to reopen an old question, but what about the json skeleton? I’m still confused about this: Am I charged also for the tokens in the word “model”, “messages”, “role” and “content” every time they appear? What about the tokens of “{”, “}”, “[”, “]”?\n80\n5\nMy understanding is that the json skeleton does not count towards the token count. Instead we take the concatenation of all \"content\"s of our “messages”, tokenize that and do the same with the engine response. Only those tokens count.\nBut yes, if I send ten messages with 100 tokens each (i.e. the value corresponding to “content”) then I’ll have to pay for 1k tokens. If the response is 500 tokens then those need to be paid too.\n_j\n6\nYou only count the tokens within “content”.\nHowever the role messages and the call itself does have overhead from the unseen format by which these messages are passed via AI language.\nFirst role: 7 tokens\nAdditional role: 4 tokens\n1 Like"
    },
    {
      "url": "https://www.pymnts.com/artificial-intelligence-2/2025/small-business-big-ai-how-smbs-are-leveling-the-playing-field-with-enterprise-giants/",
      "text": "“Our small business had been struggling for a while to give our agents the kind of in-depth training bigger companies can afford,” Schlesinger told PYMNTS. “But that changed this year when we started using Gemini to roleplay tough conversations.”\nInstead of hiring expensive coaches or having sales agents attend lengthy workshops, Schlesinger said his company used Gemini to simulate conversations so agents could rehearse responses in a realistic setting.\nThe outcome? “It prepares my agents better and faster than any sales course,” Schlesinger said. “They actually find the practice sessions incredibly helpful and build real skills.”\nWhile sales didn’t suddenly jump by 50%, Schlesinger noticed something more valuable. “That new level of confidence and the positive client interactions that result are a huge ‘bonus’ for our whole team.”\nFor Schlesinger, Gemini became the in-house trainer his team never had, leveling the playing field between his firm and much larger competitors.\nSchlesinger’s story isn’t unique. Small and medium-sized businesses (SMBs) across the country are embracing artificial intelligence (AI) as a way to compete against large enterprises.\nBy automating processes, augmenting talent, and accelerating decision-making, AI enables smaller firms to bypass legacy systems and leap directly into an AI-first business model — one that can rival what large incumbents offer.\nNew data from Verizon Business’ 2025 State of Small Business Survey showed that 38% of SMBs are integrating AI into operations. Over a quarter (28%) are deploying AI for marketing and social media, while 24% use it for written communications. Nearly a quarter use it to power digital personal assistants that can help with customer service. Other uses include cybersecurity and hiring and retention of workers.\n“Small business owners are entering a new chapter of digital business with the rise of AI,” said Aparna Khurjekar, chief revenue officer, business markets and SaaS at Verizon Business, in a statement.\nStaying competitive is an imperative for smaller companies, especially in uncertain economic times. According to a May 2025 PYMNTS Intelligence report, half of SMBs must rely on funds they get from day-to-day sales or from the bank just to survive.\n“This highlights the precarious financial position of a significant portion of the SMB landscape, leaving them vulnerable to fluctuations in revenue caused by a shifting business environment,” the report said. Particularly dependent are hotels, restaurants and entertainment businesses.\nRead more: How Retail Small Businesses Finance Survival in Uncertain Times\nCompeting on Smarts, Not Scale\nThe adage “work smarter, not harder” applies to SMBs and AI.\n“Smaller businesses can’t compete with bigger businesses on scale — so they need to compete on smarts,” said Mary Kay Bowman, executive vice president and general manager of payments and financial services at software provider BILL.\n“The smartest thing small businesses can do is use AI to unlock top-tier finance expertise and tools that were only ever available to enterprise companies.”\nBowman told PYMNTS that the best AI tools for SMBs aren’t flashy tech add-ons but are built with small business needs in mind. “Silicon Valley needs to be delivering AI that actually delivers tangible outcomes that small businesses need: saving time, improving accuracy, and freeing up bandwidth to focus on growth.”\nJackie Sinclair, a consultant who works with SMBs, agreed. “Let’s face it – running a small business often means doing everything yourself. But AI is flipping that script,” she said. “It’s giving small business owners the power to operate like they’ve got a full team behind them, minus the overhead.”\nKevin Green, chief marketing officer at Hapax, added that smaller businesses have the opportunity to “leapfrog” larger institutions by using customized, industry-specific solutions and focusing on operational and process improvements that are critical to success.\n“There is so much innovation happening around AI with big tech pumping out new features every week,” Green told PYMNTS. “We are shown countless examples of tactical use cases that are impressive, but often don’t integrate elegantly into how we do business.”\nOne example of customization comes from LegalZoom. CEO Jeff Stibel told PYMNTS that his company’s partnership with Perplexity gives small businesses direct access to their legal tools inside AI-powered search.\n“This first-of-its-kind collaboration reflects how small businesses are increasingly turning to AI not just for efficiency but for confidence as well,” Stibel said. “While AI cannot replace legal advice, it can be the first step from which we at LegalZoom can then complete the process.”\nCustomer service is another area of disruption. Robin Westerling, CEO of Longvadon, said AI agents from Salesforce’s AgentForce let them mitigate and resolve customer issues and enabled the company to shrink from three to one customer support staff while maintaining quality service.\nFor SMB leaders unsure where to begin, Schlesinger advised them to “explore how AI tools might help you fill gaps where you don’t have big-company resources. … This can help you offer truly top-notch service that makes your customers feel understood and valued, just like the bigger players do.”\nWhat Businesses Are Using\nHere are some tools SMBs are using, according to Sinclair:\n- Marketing: Tools like ChatGPT, Jasper and Copy.ai help SMBs write captions, blogs and emails faster and smarter.\n- Design: Canva’s Magic Studio, Runway and Lumen5 let business owners create professional graphics and videos without a designer.\n- Accounting and finance: QuickBooks AI, WaveApps, and Xero simplify bookkeeping and forecasting.\n- Admin and legal: DoNotPay and Spellbook help draft contracts and other legal documents and answer FAQs.\n- Operations: Notion AI, GoHighLevel and ClickUp Brain automate workflows so businesses don’t lose track when things get busy.\nRead more: Brewing Storm: Why 1 in 5 Smaller Businesses Without Financing Fear They May Not Survive Tariffs\nRead more: The Urban-Rural Economic Divide: How Location Affects SMBs’ Outlook\nRead more: The Customer Is Always Right: How SMBs Can Attract and Keep Customers"
    },
    {
      "url": "https://www.pymnts.com/artificial-intelligence-2/2025/ai-in-accounting-services-may-level-playing-field-for-small-businesses/",
      "text": "Artificial intelligence (AI) is leveling the playing field in accounting services, giving small and medium-sized business (SMB) owners access to robust tools once reserved for large enterprises.\nTraditional client accounting services — which include labor-intensive, often manual tasks like bookkeeping, payroll and financial reporting — are being modernized by automation and data analytics. For example, Intuit on Tuesday (July 22) debuted AI agents in its Enterprise Suite that can handle routine accounting tasks, among other things.\n“AI will amplify the value of accounting services for SMBs,” said Ariege Misherghi, senior vice president and general manager of accounts payable, accounts receivable and accountant channel at Bill.\n“Once routine tasks like data extraction and invoice processing are automated, accountants will be freed up to focus on higher value advisory work that only humans can provide: applying judgement, guiding SMBs through complex financial decisions and delivering strategic insights,” Misherghi told PYMNTS.\nFor SMBs, AI is leveling the playing field, Misherghi said. In Bill’s survey of 1,000 SMB executives, 67% said AI would improve financial forecasting and planning, while 65% said it would help with cost management.\nBut only 21% are using AI tools to manage accounting and financial operations, according to a separate small business survey from Verizon.\nLisa Huang, senior vice president of product management at Xero, said many accounting systems remain manual even as external pressures mount for the industry.\n“The accounting and bookkeeping industry is at a turning point,” Huang told PYMNTS. “Many professionals are overworked and under-resourced, facing increasing client demand and rising pressure from evolving regulatory and compliance requirements.”\n“At the same time, the profession is undergoing a generational shift, with more practitioners exiting the workforce than entering it, creating a looming talent shortage,” Huang said. “Despite all this, the systems many accountants rely on remain heavily manual, reducing their capacity to offer high-value advisory services and strategic guidance to clients.”\nSee also: Panel: Small Businesses Want Control, Automation Gives It to Them\nNot Just About Automation\nBen Alarie, CEO of Blue J, a generative AI tax research platform, said smaller firms have long been at a disadvantage in accounting services.\n“Historically, accounting practices and SMBs have been underserved by legacy tax research tools, which have been costly, complex and ultimately misaligned with the realities of SMB workflows,” Alarie told PYMNTS. “Generative AI, especially purpose-built platforms, flip this dynamic.”\nGenerative AI gives practitioners instant access to clear, citation-backed answers, “dramatically reducing manual research time and levelling the playing field for firms that can’t afford large research teams,” Alarie said. The result is “higher-quality work with fewer resources.”\nMore specifically, “AI can transform accounting for SMBs by automating rote manual tasks, surfacing actionable real-time financial insights like ‘you’re spending double on subscriptions last quarter,’ and monitoring systems for out-of-pattern spending,” Jonathan Bailey, CTO of B2B payments firm Extend, told PYMNTS.\nBut it’s not just about automation. With the advent of agents, “AI will continue to enable more personalized experiences, more automation of complicated or tedious workflows, more insights and intelligence and — importantly — greater security and compliance,” Bailey said.\nKevin Akeroyd, CEO of tax compliance software provider Sovos, told PYMNTS that AI is also shifting accounting “from a reactive process to a more proactive one for SMBs.” Instead of chasing down discrepancies or filing reports after deadlines, SMBs can use AI to spot issues early and make faster decisions.\nWhat’s more is “you no longer need a technical team to ask complex questions or spot issues,” Akeroyd said.\nTwo things are essential for proper harnessing of AI in accounting services: “clean data and trusted software,” Fergal Glynn, CMO and AI security advocate at Mindgard, told PYMNTS.\n“The modern platforms offer transparency — they show their work and allow you to verify important details. With the right setup and a human eye on critical decisions, AI becomes not just a tool, but a trusted partner in running a leaner, smarter business,” Glynn said.\nRead more:\nAccounting Firms Aim Higher as AI Handles the Heavy Lifting\nAlphabet-Backed Pennylane Raises $82 Million to Expand Accounting Platform Across Europe\nDigits Debuts AI Accounting Tool and Welcomes Xero Co-Founder\nFor all PYMNTS AI coverage, subscribe to the daily AI Newsletter."
    },
    {
      "url": "https://www.pymnts.com/news/artificial-intelligence/2025/how-to-choose-between-deploying-ai-chatbot-versus-agent/",
      "text": "But how are AI agents different from AI chatbots, and why should businesses care?\nUnderstanding how they differ can help businesses choose the right solution for the right job and avoid underusing or overcomplicating their AI investments.\nAn AI chatbot or assistant is a program that uses natural language processing to interact with users in a conversational way. Think of ChatGPT. It can answer questions, guide users and simulate dialogue.\nChatbots only react to prompts. They don’t act on their own or carry out multistep goals. They are helpful and conversational but ultimately limited to what they’re asked.\nAn AI agent goes a step further. Like a chatbot, it can understand natural language and interact conversationally. But it also has autonomy and can complete tasks. It is proactive.\nInstead of just replying, an AI agent can make decisions, take actions across systems, plan and carry out multistep processes, and learn from past interactions or external data.\nFor example, imagine a travel platform. An AI chatbot might help a user plan their travel itinerary. An AI agent, on the other hand, could do more, such as:\n- Understand the request, such as booking a flight to Los Angeles.\n- Search multiple airline sites.\n- Compare flight options based on user preferences.\n- Book the flight.\n- Send a confirmation email.\nAll of this could happen without the user needing to click through a series of links or speak to a human agent. AI agents can be embedded in customer service, HR systems, sales platforms and the like.\nRead also: Understanding the Difference Between AI Training and Inference\nWhy Businesses Should Care\nKnowing the difference can help a business plan more strategically. AI chatbots use less inference than AI agents and therefore are more cost-effective. Moreover, businesses can use AI chatbots and AI agents for very different outcomes.\nAI chatbot use cases include the following:\n- Customer service\n- Data retrieval\n- Planning and analysis\n- Basic IT support\n- Conversation\n- Writing documents\n- Code generation\nAI agent use cases include the following:\n- Automated checkout\n- Automated content curation\n- Travel and reservation execution tasks\n- Shopping and payment processing\nAI chatbots and AI agents both use natural language and large language models, but their functions are different. Chatbots are answer machines while agents are action bots.\nFor businesses looking to improve how they serve customers, streamline operations or support employees, AI agents offer a new level of power and flexibility. Knowing when and how to use each tool can help companies make smarter AI investments.\nTo choose between deploying an AI chatbot or AI agent, consider the following:\n- Budgets: AI chatbots are cheaper to run since they use less inference.\n- Complexity of use case: For straightforward tasks, use a chatbot. For tasks that need multistep coordination, use an AI agent.\n- Skilled talent: Assess the IT team’s ability to handle chatbots versus agents. Chatbots are easier to deploy and update. AI agents require more advanced machine learning, natural language processing and other skills.\nFor all PYMNTS AI coverage, subscribe to the daily AI Newsletter.\nRead more:"
    },
    {
      "url": "https://www.pymnts.com/study_posts/high-impact-big-reward-meet-the-genai-focused-cfo/",
      "text": "High Impact, Big Reward: Meet the GenAI-Focused CFO\nMay 2024\nSix in 10 CFOs say GenAI is the greatest innovation of our time — and the promise of this technology energizes CFOs everywhere. This analysis, the first in PYMNTS Intelligence’s new 2024 CAIO Report, examines the enterprise landscape of GenAI applications, including the positive impacts and challenges these firms face in integrating GenAI. Our analysis spans the range of low-risk, low-impact GenAI through strategic, high-impact GenAI. This monthly report monitors GenAI integration trends and sentiment across companies with at least $1 billion in revenues in the United States.\n• Just 30% of enterprises fully use strategic, high-impact GenAI applications.\n• 39% of CFOs at companies with the highest total impact of GenAI applications report very positive ROI.\n• Firms using GenAI less strategically are 50% more likely than the average company to say a lack of executive support hinders their success.\nGet Unlimited Access\nComplete the form below for free, unlimited access to all our Data Studies, Trackers, and MonitorEdge reports.\nThank you for registering. Please confirm your email to view all our Trackers.\nOne of generative artificial intelligence’s most appealing aspects is its seemingly limitless uses, ranging from the most routine to the most complex and strategic. Routine GenAI use may help firms complete individual tasks or summarize information. Complex applications of GenAI can do more without human help, such as monitoring processes and creating content.\nEnterprise CFOs have been measuring the impact of implementing GenAI. PYMNTS Intelligence’s data finds that firms using GenAI in the most strategic and impactful ways reaped the benefits. These firms were most likely to report a positive return on investment. Integrating GenAI leads to positive internal efficiencies and innovation outcomes.\nStill, integrating GenAI has its challenges. Of all the CFOs in the survey, just less than one-third said the faced a lack of executive support. Nearly half of CFOs at companies using low-impact applications said the same.\nThese are just some findings in the first edition of “The 2024 CAIO Report.” This PYMNTS Intelligence series offers a monthly recap of the players and innovators using GenAI to revolutionize how they manage key parts of business. The series will benchmark GenAI’s various uses and impacts on operations and business performance over time. The study will rotate between thoughts of CFOs, chief operating officers (COOs) and chief marketing officers (CMOs) of firms with more than $1 billion in revenue.\nThis edition looks at the landscape of GenAI applications and the impacts and challenges CFOs face during integration at U.S. firms. It draws on results from a survey of 60 CFOs held from March 5 to March 15.\nThe 2024 CAIO Report Series studies GenAI in depth, focusing on how enterprises use the technology to accomplish 13 distinct tasks. Each task is classified based on how routine, complex, risky and impactful it is to the business. Based on those classifications, PYMNTS Intelligence developed a proprietary weighting scheme assigning firms a total score based on how impactful the applications are for the company.\nThese firms are grouped into low-impact, medium-impact or high-impact personas for our analysis. Firms with just a few routine applications would fall in the low-impact firm persona. These firms are most likely to have applications that help an individual with a specific task, are less risky and are limited to summarizing information. Examples are literature reviews, drafting emails or helping to access information from a catalog.\nOn the other hand, a firm with multiple highly strategic applications would be in the high-impact persona. These firms use more than one complex multifunction GenAI application to monitor multiple processes, make assessments and generate new content. These applications also come with risks since they can directly impact business outcomes. Examples are operating an autonomous cybersecurity system, monitoring production processes in real time or developing innovative product designs.\nGenAI IMPACT PERSONAS SUMMARIZED\nHigh-impact firms: Multiple, highly complex, strategic GenAI applications Medium-impact firms: At least some medium complexity GenAI applications Low-impact firms: Mostly simple, routine GenAI applications\nThe GenAI Opportunity\nSix in 10 companies believe GenAI is the most significant technological innovation of our time. All CFO respondents use it — but most don’t take full advantage.\nIf there is one thing that CFOs agree on, it is GenAI’s positive impact on business. All surveyed enterprises — companies with at least $1 billion in revenue — reported using the technology. Additionally, 63% of CFOs agreed that GenAI is the most significant innovation of our time.\nHowever, the way these companies use GenAI varies. Most companies use GenAI for routine and less risky tasks, such as summarizing information or accessing a catalog. On average, all surveyed companies reported that they use the technology for at least three routine or medium complexity tasks.\nPYMNTS Intelligence found that just 30% of surveyed enterprises are taking full advantage of using multiple strategic GenAI applications. These are applications capable of making a high impact: monitoring multiple processes, making assessments based on diverse inputs or creating new content. Curiously, the firms that used more high-impact GenAI applications did not necessarily invest more. Firms with a high total impact score — meaning they used more strategic and complex GenAI applications — invested 25% less on the technology than those using less strategic applications that landed in the middle in terms of impact.\nStrategic GenAI’s Positive ROI\nFirms using strategic and impactful GenAI applications are three times more likely to report very positive ROI than those only using low-impact, routine GenAI applications.\nWhile using more GenAI applications aligns with positive ROI, an aspect of this trend worth noting is that firms using more applications also use them strategically. Surveyed enterprises use an average of three routine applications, and firms reporting positive ROI use an average of 5.6. The data revealed that 50% of firms using more than five applications reported a very positive ROI. However, among surveyed firms that use fewer than five applications, just 6.3% of firms have very positive ROI.\nThe Role Executives Play\nFirms using GenAI less strategically are 50% more likely than the average company to say lack of executive support hinders success.\nSuccessful integration of GenAI applications at any level requires organizational support. Of all CFOs surveyed, 32% said they faced a lack of executive support. Forty-eight percent of CFOs at companies using low-impact applications said they also lacked executive support.\nChampioning GenAI from the top can be crucial. Integrating GenAI applications into existing workflows is a challenge for companies using low-impact applications, as 57% cited this as a drawback.\nCompanies with high-impact GenAI applications, in turn, have their own issues to contend with. The complexity of the applications used in these companies allows more concerns. These include data security concerns, cited by 56% of enterprises using high-impact applications, and costs related to use, cited by 61%.\nCFOs from medium-impact firms, which use slightly less complex GenAI applications than high-impact firms, have their own of challenges. These CFOs reported that their efforts to integrate GenAI applications are challenging due to tools that are difficult to use (52%), integration complexity (48%) and confusion about what tools they should use (43%).\nSkilled Workers Still Needed\nSix in 10 CFOs say GenAI has already reduced the need for low-skilled workers, but demand for skilled workers is up, and firms using GenAI strategically are 26% more likely to save money on resources.\nOne main reason for the rush to use GenAI in workflows is the outsized benefits it can provide. Eight in 10 CFOs from high-impact enterprises said using GenAI has shown positive outcomes for internal efficiencies and innovation. Among the positive outcomes reported by CFOs, resource allocation, new product innovation and the ability to adapt to changing markets emerged as key benefits. GenAI is also fueling business expansion and helping CFOs make decisions faster.\nWhether GenAI threatens human jobs has been a hot-button issue. Data shows that although executives have already seen the need for low-skilled workers lessen, that trend has not carried over to the more analytically skilled workforce.\nThe data suggests that firms using medium-impact applications need more analytically skilled workers to manage the newly acquired tools. Companies using high-impact, strategic GenAI may be able to function without as marked of an increase in an analytically skilled workforce due to increased automation capacity in more strategic applications.\nConclusion\nEnterprise CFOs are keen on using GenAI applications. However, not all GenAI should be treated the same. It can range from low-impact applications for everyday tasks such as drafting an email or summary to the more complex, strategic applications of monitoring cybersecurity systems in real time. The benefits of the most strategic GenAI integrations outweigh the challenges many CFOs face. Eight in 10 of the most strategic impact groups reported positive outcomes with efficiencies and innovation. Strategic uses of this technology align with higher ROI, and businesses are paying attention, as 47% of CFOs are ready to increase their investments in GenAI in the coming year.\nMethodology\n“The Impact of Implementing GenAI — and How to Maximize ROI,” a PYMNTS Intelligence report, is based on an analysis of 60 responses from CFOs from companies earning at least $1 billion in revenue in the U.S. The survey was held from March 5 to March 15. It looked at how enterprises use these tools, what issues they experience, what the impact is on their bottom lines and how executives see its role in the future of work.\nFor the analytical framework, PYMNTS Intelligence considered 13 different tasks done by GenAI. Each task is classified based on how routine, complex, risky and impactful it is to the business. Based on this system, we developed a proprietary weighting scheme assigning firms a total score to show how impactful the applications are. A firm with just a few routine applications would fall into the low-impact group. Conversely, a firm with multiple highly strategic applications would be considered high-impact. This framework considers how many people are involved in the task, how many inputs are considered and to what extent GenAI helps one person complete a task rather than an entire process.\nAbout\nPYMNTS Intelligence is a leading global data and analytics platform that uses proprietary data and methods to provide actionable insights on what’s now and what’s next in payments, commerce and the digital economy. Its team of data scientists include leading economists, econometricians, survey experts, financial analysts and marketing scientists with deep experience in the application of data to the issues that define the future of the digital transformation of the global economy. This multi-lingual team has conducted original data collection and analysis in more than three dozen global markets for some of the world’s leading publicly traded and privately held firms.\nThe PYMNTS Intelligence team that produced this report:\nSVP and Head of Analytics: Scott Murray\nSVP, Data Products and Senior Analyst: Yvonni Markaki, PhD\nSenior Writer: Anna Sofia Martin\nWe are interested in your feedback on this report. If you have questions\nor\ncomments, or if you would like to subscribe to this report, please email\nus at\nfeedback@pymnts.com.\nDisclaimer\nThe 2024 CAIO Report may be updated periodically. While reasonable efforts are made to keep the content accurate and up to date, PYMNTS MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, REGARDING THE CORRECTNESS, ACCURACY, COMPLETENESS, ADEQUACY, OR RELIABILITY OF OR THE USE OF OR RESULTS THAT MAY BE GENERATED FROM THE USE OF THE INFORMATION OR THAT THE CONTENT WILL SATISFY YOUR REQUIREMENTS OR EXPECTATIONS. THE CONTENT IS PROVIDED “AS IS” AND ON AN “AS AVAILABLE” BASIS. YOU EXPRESSLY AGREE THAT YOUR USE OF THE CONTENT IS AT YOUR SOLE RISK. PYMNTS SHALL HAVE NO LIABILITY FOR ANY INTERRUPTIONS IN THE CONTENT THAT IS PROVIDED AND DISCLAIMS ALL WARRANTIES WITH REGARD TO THE CONTENT, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT AND TITLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF CERTAIN WARRANTIES, AND, IN SUCH CASES, THE STATED EXCLUSIONS DO NOT APPLY. PYMNTS RESERVES THE RIGHT AND SHOULD NOT BE LIABLE SHOULD IT EXERCISE ITS RIGHT TO MODIFY, INTERRUPT, OR DISCONTINUE THE AVAILABILITY OF THE CONTENT OR ANY COMPONENT OF IT WITH OR WITHOUT NOTICE.\nPYMNTS SHALL NOT BE LIABLE FOR ANY DAMAGES WHATSOEVER, AND, IN PARTICULAR, SHALL NOT BE LIABLE FOR ANY SPECIAL, INDIRECT, CONSEQUENTIAL, OR INCIDENTAL DAMAGES, OR DAMAGES FOR LOST PROFITS, LOSS OF REVENUE, OR LOSS OF USE, ARISING OUT OF OR RELATED TO THE CONTENT, WHETHER SUCH DAMAGES ARISE IN CONTRACT, NEGLIGENCE, TORT, UNDER STATUTE, IN EQUITY, AT LAW, OR OTHERWISE, EVEN IF PYMNTS HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\nSOME JURISDICTIONS DO NOT ALLOW FOR THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, AND IN SUCH CASES SOME OF THE ABOVE LIMITATIONS DO NOT APPLY. THE ABOVE DISCLAIMERS AND LIMITATIONS ARE PROVIDED BY PYMNTS AND ITS PARENTS, AFFILIATED AND RELATED COMPANIES, CONTRACTORS, AND SPONSORS, AND EACH OF ITS RESPECTIVE DIRECTORS, OFFICERS, MEMBERS, EMPLOYEES, AGENTS, CONTENT COMPONENT PROVIDERS, LICENSORS, AND ADVISERS.\nComponents of the content original to and the compilation produced by PYMNTS is the property of PYMNTS and cannot be reproduced without its prior written permission."
    }
  ],
  "argos_summary": "The article explains that while generative AI model costs are falling, the true expense for enterprises lies in hidden infrastructure, integration, compliance, and ongoing operations, often outweighing token fees. It highlights that self‑hosting or embedded AI can cut costs and that many businesses are adopting AI incrementally to avoid falling behind. The piece also discusses how small and medium‑size firms are using AI to level the playing field, especially in accounting and customer service, and contrasts chatbots with more autonomous AI agents. Finally, a CFO survey shows that strategic, high‑impact AI deployments yield higher ROI, but many firms still face integration and executive‑support challenges.",
  "argos_id": "7K70WI6UQ"
}