{
  "url": "https://www.cnet.com/tech/services-and-software/ufc-319-du-plessis-vs-khamzat-everything-to-know-to-watch-via-livestream/#ftag=CADf328eec",
  "authorsByline": "Kevin Lynch",
  "articleId": "bac0f3f9c7284ce28745a981f010f289",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/7b33c60d7cb68c9ccd848b5798e60a5b9d3442c4/hub/2025/08/15/975769b8-8dfa-4747-a6fb-563acfc0c9c2/gettyimages-2230183446.jpg?auto=webp&fit=crop&height=614&width=1092",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-16T00:00:04+00:00",
  "addDate": "2025-08-16T00:09:59.324042+00:00",
  "refreshDate": "2025-08-16T00:09:59.324044+00:00",
  "score": 1.0,
  "title": "UFC 319: du Plessis vs. Chimaev — Everything to Know to Watch via Livestream",
  "description": "Middleweight champ faces a tricky title defense against the unbeaten Russian.",
  "content": "After a week that has seen the premier MMA promotion company ink a new multi-billion dollar TV deal, as well as firm up plans for an event at the White House, it's back to business in the Octagon this weekend, with UFC 319 offering up an intriguing middleweight title fight in Chicago.\n\nSaturday's main event sees South Africa's Dricus du Plessis aiming for a third successful title defense in a row as he takes on unbeaten Russian challenger Khamzat Chimaev.\n\nDu Plessis claimed the title with a win over Sean Strickland at the start of last year and comes into this fight off the back of an unanimous decision victory in a rematch with Strickland at UFC 312 in February.\n\nChimaev hasn't fought since his win over former champ Robert Whittaker at UFC 308 last October, in a devastating performance that saw him dislocate the New Zealander's jaw in a first-round submission.\n\nCatch all the action live by following our guide to watching UFC 319.\n\nUFC 319 takes place at the United Center in Chicago, Illinois, on Saturday Aug. 16. The main card gets going at 9 p.m. CDT local time (10 p.m. ET, 7 p.m. PT). Here are all the details for multiple time zones.\n\nIt's hard to say exactly when the main event will take place but if you're looking to only watch the fight between du Plessis and Chimaev, ring walks will start no earlier than midnight ET (9 p.m. PT).\n\nHow to watch UFC 319 in the US\n\n\n\nWhile live UFC coverage in the US is set to change hands next year, for the time being ESPN Plus remains its home and the place to head to if you want to watch UFC 319, with Saturday's card being offered as a pay-per-view event. The cost structure is a bit confusing, but here are the options to watch UFC on ESPN, according to ESPN's site:\n• Existing annual ESPN Plus subscribers can order the upcoming UFC card for $80.\n• New ESPN Plus subscribers can buy a bundle of the UFC 319 PPV event (streaming in HD) and an ESPN Plus annual recurring subscription for $135. This is a decent deal. The ESPN Plus annual subscription will auto-renew after one year, at the price of an ESPN Plus annual subscription at the time of auto-renewal.\n\nYou can do all of the above at the link below.\n\nHow to watch UFC 319 in the UK\n\nMMA fans in the UK can watch all the action from Chicago via TNT Sports and the good news is that unlike some UFC events on the network this event won't be PPV. Coverage gets underway on TNT Sports 1 with the prelims at 1 a.m. BST in the early hours of Sunday morning.\n\nHow to watch UFC 319 in Australia\n\nYou can watch UFC 319 through Main Event on Foxtel. That means you can also watch online via sports streaming service Kayo for AU$60.\n\nHow to watch UFC 319 in Canada\n\nUFC 319's main card is available to watch through a variety of PPV providers, including cable operators such as Bell, Rogers and Shaw, as well as streaming services such as DAZN, Sportsnet Plus and UFC Fight Pass. Whichever option you choose, it's a PPV fee of CA$70 across the board.\n\nIt's also worth noting that early prelims will be available to stream via UFC Fight Pass, while the event's Prelims will be shown on Sportsnet and TVA Sports.",
  "medium": "Article",
  "links": [
    "https://www.tntsports.co.uk",
    "https://mainevent.kayosports.com.au/ufc/",
    "https://www.cnet.com/tech/services-and-software/ufc-streaming-moves-to-paramount-in-multi-billion-dollar-deal/",
    "https://www.espn.com/espnplus/player/_/id/966fca50-8969-4ad0-bc82-11c4affd21d6",
    "https://www.shaw.ca/tv/channels/pay-per-view",
    "https://www.bell.ca/Promotions/Sports-packages",
    "https://www.rogers.com/tv/pay-per-view",
    "https://www.cbsnews.com/news/ufc-to-host-first-ever-white-house-fight-on-july-4-2026-dana-white/",
    "https://www.sportsnetplus.ca/ufc",
    "https://go.web.plus.espn.com/c/159047/531511/9070?&sharedId=cnet&u=https%3A%2F%2Fsecure.web.plus.espn.com%2Fpurchase%2Fannual&subId1=cn-ffd3b995-ce7d-4fd3-b669-cf47c5d3b4c1-dtp",
    "https://go.web.plus.espn.com/c/159047/531511/9070?&sharedId=cnet&u=https%3A%2F%2Fplus.espn.com%2Fppv-ufc&subId1=cn-b8731f148b1046168eb51f2c5963b455-dtp",
    "https://go.web.plus.espn.com/c/159047/531511/9070?&sharedId=cnet&u=https%3A%2F%2Fplus.espn.com%2F&subId1=cn-6552f71d-f65c-476a-898b-044c362ca683-dtp",
    "https://www.dazn.com",
    "https://www.cnet.com/tech/services-and-software/ufc-streaming-moves-to-paramount-in-multi-billion-dollar-deal/#link={%22linkText%22:%22live%20UFC%20coverage%20in%20the%20US%20is%20set%20to%20change%20hands%20next%20year%22,%22target%22:%22%22,%22href%22:%22https://www.cnet.com/tech/services-and-software/ufc-streaming-moves-to-paramount-in-multi-billion-dollar-deal/%22,%22role%22:%22standard%22,%22absolute%22:%22%22}",
    "https://www.tvasports.ca/",
    "https://ufcfightpass.com"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "UFC",
      "weight": 0.10267716
    },
    {
      "name": "UFC Fight Pass",
      "weight": 0.09932006
    },
    {
      "name": "live UFC coverage",
      "weight": 0.09686926
    },
    {
      "name": "ESPN Plus",
      "weight": 0.0913018
    },
    {
      "name": "New ESPN Plus subscribers",
      "weight": 0.08939877
    },
    {
      "name": "Existing annual ESPN Plus subscribers",
      "weight": 0.08777285
    },
    {
      "name": "Sportsnet Plus",
      "weight": 0.07440282
    },
    {
      "name": "ESPN",
      "weight": 0.06877132
    },
    {
      "name": "Dricus du Plessis",
      "weight": 0.06745935
    },
    {
      "name": "du Plessis",
      "weight": 0.067260586
    }
  ],
  "topics": [
    {
      "name": "UFC"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97607421875
    },
    {
      "name": "/Sports/Combat Sports/Martial Arts",
      "score": 0.378662109375
    }
  ],
  "sentiment": {
    "positive": 0.24337563,
    "negative": 0.17517924,
    "neutral": 0.58144516
  },
  "summary": "UFC 319: Dricus du Plessis vs. Khamzat Chimaev is the main event of the middleweight title fight in Chicago, taking place at the United Center in Chicago on August 16. The main event will see duPlessis aiming for his third successful title defense in a row. While live UFC coverage in the US is set to change hands next year, ESPN Plus remains the primary source for live coverage. The event will be broadcast on TNT Sports 1 in the UK, with coverage starting at midnight ET (9 p.m. GMT) and coverage on BT Sport in Australia, Canada, and TNT Sports in the U.S.",
  "shortSummary": "UFC 319 in Chicago features a middleweight title fight between Dricus du Plessis and Khamzat Chimaev, with multiple streaming options available across the globe.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8d79b76523a24a6ea20db25675d5d959",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/tech/services-and-software/ufc-streaming-moves-to-paramount-in-multi-billion-dollar-deal/",
      "text": "Fight fans might have to rethink their entertainment plans. Paramount has struck a blockbuster deal to become the exclusive US broadcaster of UFC fights, agreeing to pay $7.7 billion over seven years starting in 2026. The deal, with UFC parent company TKO Group, will put all UFC events on Paramount-owned platforms, including Paramount Plus and CBS.\nThat means fans who are used to occasionally forking out for a pay-per-view UFC fight will have to consider a Paramount Plus subscription instead. All UFC events will be included in Paramount Plus subscriptions. Select events will be simulcast on CBS.\nRead also: South Park Locks Into Paramount Plus With $1.5 Billion Streaming Deal\nThe move is part of Paramount's push to beef up its live sports offerings as the streaming wars escalate. UFC has grown into one of the most valuable sports properties, attracting a younger, global audience that streaming services are eager to capture.\nFor viewers, the deal means UFC coverage will shift away from its US home on ESPN, changing how fans watch and pay for fights. Paramount merged with David Ellison's Skydance after its purchasing of Paramount Global from Shari Redstone on Aug. 7.\n\"This deal puts UFC amongst the biggest sports in the world,\" UFC CEO and president Dana White posted on X. \"The exposure provided by the Paramount and CBS networks under this new structure is a huge win for our athletes and anyone who watches and loves this sport.\"\nThe deal comes as media companies face mounting pressure to secure live content to keep subscribers from jumping to their rivals. With UFC locked in, Paramount is betting that octagon action will help it land a decisive blow in the fight for streaming dominance."
    },
    {
      "url": "https://www.cbsnews.com/news/ufc-to-host-first-ever-white-house-fight-on-july-4-2026-dana-white/",
      "text": "Dana White says UFC will host first-ever White House fight on July 4: \"It is definitely going to happen\"\nThe Ultimate Fighting Championship will stage a historic fight at the White House on July 4, 2026, marking America's 250th birthday with what would be the first professional mixed martial arts event ever held at the presidential residence, UFC CEO Dana White confirmed Tuesday.\n\"It is definitely going to happen,\" White told \"CBS Mornings.\"\nWhite said he spoke with President Donald Trump Monday night about the event and plans to meet with Mr. Trump and Ivanka Trump at the end of this month to finalize details and review venue renderings. A source familiar with the planning confirmed that the White House expected the event to happen.\n\"When he called me and asked me to do it, he said, 'I want Ivanka in the middle of this,'\" White said. \"So Ivanka reached out to me, and her and I started talking about the possibilities, where it would be and, you know, I put together all the renderings.\"\nThe announcement comes as UFC finalizes a groundbreaking seven-year streaming deal with Paramount worth an average of $1.1 billion annually. The agreement represents a significant shift from UFC's traditional pay-per-view model, with select events to be simulcast on CBS.\nWhite called the Paramount deal \"one of the massive, major milestones in my career and in the history of the sport.\"\nWhite said the media world is changing but believes pay-per-view is still strong.\n\"I don't know if there's a better way,\" White said. \"There are so many disruptors in the world right now. Who would have thought taxi cabs would disappear or cable television would start to go away?\"\nWhite said that UFC will continue hosting pay-per-view events, including one scheduled for Saturday in Chicago, while embracing streaming platforms for broader reach.\n\"Live sports, you have to watch live. You have to tune in. It is a destination watch,\" he said. \"Sports are a big deal to these streaming services.\"\nNo fighters have been announced for the White House event, which White said remains nearly a year away. The venue would mark an unprecedented location for a professional mixed martial arts event that regularly fills stadiums and arenas.\nThe Paramount deal places UFC alongside other major sporting events broadcast on CBS, including the Masters Tournament, NCAA Final Four and Super Bowl.\nParamount, a Skydance Corporation, is the parent company of CBS News."
    },
    {
      "url": "https://www.bell.ca/Promotions/Sports-packages",
      "text": "Sports packages\nPremium entertainment\nPay-per-view\nUFC 319: Du Plessis vs. Chimaev\nUFC returns to United Center in the Windy City of Chicago on August 16 with a stacked UFC 319 event featuring one of the most highly anticipated middleweight title fights in years. South Africa’s Dricus Du Plessis has taken UFC by storm since arriving in the Octagon in 2020, and after winning the UFC middleweight crown against Sean Strickland, he’s continued to dominate with wins over Israel Adesanya and Strickland in their February rematch. But many believe his toughest test to date will be unbeaten challenger Khamzat Chimaev, whose list of UFC victories includes the names of Robert Whittaker, Kamaru Usman and Gilbert Burns.\nLive on Pay-per-view Saturday, August 16 at 10 p.m. (ET).\nCurrent price\n- How to order: Detailed instructions\n- Fibe TV\nTune in to channel 994 to order.\n- Fibe TV appvisit fibetv.ca\n-\nSatellite TV\nTune in to channel 832 (HD) or 399 (SD)\nlog in to MyBell to order.\nPremium sports packages\nPremium sports channels\n- Fibe TV\n- Satellite TV\nSports Fan\nEnjoy the all-in-one package made especially for sports enthusiasts. Sports Fan offers a wide variety of national and international sports including NHL, CFL and NFL, NBA, MLB and MLS. You can also follow curling, combat sports like MMA and boxing, major golf and tennis tournaments, NASCAR, Formula 1, NCAA March Madness and more.\nPrice without limited-time credits\nSports Franco\nEnjoy sports programming in French, including NHL games on Saturdays and the playoffs, plus CF Montréal, tennis tournaments and RAW fights. In addition, you can watch live broadcasts of major events, interviews with sports figures, late-night recaps of major games of the day and much more.\nPrice without limited-time credits\nTSN1, 2, 3, 4, 5 & TSN 4K\nTSN is Canada's Sports Leader. With a broad portfolio of multimedia sports assets, TSN delivers world-class content.\nPrice without limited-time credits\nSportsnet World, beIN SPORTS, HPItv and Willow TV\nEnjoy a wide variety of sports content including football, rugby and cricket league games. See sports analysis of the top leagues from around the planet and follow horse racing and pool odds from tracks all over North America.\nPrice without limited-time credits\nSportsnet (East, Ontario, Pacific, West)\nSportsnet broadcasts more NHL hockey featuring Canadian clubs than any other broadcaster. Sportsnet Connected, the network's news arm, provides regional, national and international sports coverage.\nPrice without limited-time credits\nSportsnet World\nSportsnet World features hundreds of must-see international football matches you won’t find anywhere else. It’s also home to world-class rugby and more.\nPrice without limited-time credits\nWillow TV\nWillow TV is the premier broadcaster dedicated to cricket 24 hours a day, seven days a week, with a focus on carrying major international cricket matches live.\nPrice without limited-time credits\nHPItv\nHPItv is your live feed to world-class horse racing, delivered directly to your home. Whether you’re a casual racing fan or a hardcore handicapper, HPItv will entertain you with up to six popular thoroughbred and standardbred tracks from across the world at the same time, 24/7.\nPrice without limited-time credits\nHPItv West\nHPItv West brings you the same world-class horse racing as HPItv, with a focus on tracks from the west coast, giving you access to live, full card daily coverage.\nPrice without limited-time credits\nHPItv Premium\nHPItv Premium includes both HPItv Canada and HPItv International to bring you the best horse racing from Canada and abroad. Expect to see tracks like Woodbine and Mohawk on HPItv Canada and premier tracks from across the world – including the U.S., South Africa and Australia – on HPItv International.\nPrice without limited-time credits\nIndividual channels\n$15.00/mo.\n$7.00/mo.\n$4.00/mo.\n$4.00/mo.\n$4.00/mo.\n$7.00/mo.\n$4.00/mo.\n$4.00/mo.\n$4.00/mo.\n$17.00/mo.\nSports Fan\nEnjoy the all-in-one package made especially for sports enthusiasts. Sports Fan offers a wide variety of national and international sports including NHL, CFL and NFL, NBA, MLB and MLS. You can also follow curling, combat sports like MMA and boxing, major golf and tennis tournaments, NASCAR, Formula 1, NCAA March Madness and more.\nPrice without limited-time credits\nSports Franco\nEnjoy sports programming in French, including NHL games on Saturdays and the playoffs, plus CF Montréal, tennis tournaments and RAW fights. In addition, you can watch live broadcasts of major events, interviews with sports figures, late-night recaps of major games of the day and much more.\nPrice without limited-time credits\nTSN1, 2, 3, 4, 5\nTSN is Canada's Sports Leader. With a broad portfolio of multimedia sports assets, TSN delivers world-class content.\nPrice without limited-time credits\nSportsnet World, beIN SPORTS and HPItv\nEnjoy a wide variety of sports content including football, rugby and cricket league games. See sports analysis of the top leagues from around the planet and follow horse racing and pool odds from tracks all over North America.\nPrice without limited-time credits\nSportsnet (East, Ontario, Pacific, West)\nSportsnet broadcasts more NHL hockey featuring Canadian clubs than any other broadcaster. Sportsnet Connected, the network's news arm, provides regional, national and international sports coverage.\nPrice without limited-time credits\nSportsnet World\nSportsnet World features hundreds of must-see international football matches you won’t find anywhere else. It’s also home to world-class rugby and more.\nPrice without limited-time credits\nHPItv\nHPItv is your live feed to world-class horse racing, delivered directly to your home. Whether you’re a casual racing fan or a hardcore handicapper, HPItv will entertain you with up to six popular thoroughbred and standardbred tracks from across the world at the same time, 24/7.\nPrice without limited-time credits\nHPItv West\nHPItv West brings you the same world-class horse racing as HPItv, with a focus on tracks from the west coast, giving you access to live, full card daily coverage.\nPrice without limited-time credits\nHPItv Premium\nHPItv Premium includes both HPItv Canada and HPItv International to bring you the best horse racing from Canada and abroad. Expect to see tracks like Woodbine and Mohawk on HPItv Canada and premier tracks from across the world – including the U.S., South Africa and Australia – on HPItv International.\nPrice without limited-time credits\nIndividual channels\n$15.00/mo.\n$7.00/mo.\n$4.00/mo.\n$4.00/mo.\n$4.00/mo.\n$7.00/mo.\n$4.00/mo.\n$4.00/mo.\n$4.00/mo.\n$17.00/mo."
    },
    {
      "url": "https://www.tvasports.ca/",
      "text": "D’après NHL Network\nUn joueur du CH dans l’équipe du 21e siècle\naujourd'hui à 19h43\nL’ancien défenseur du Canadien Shea Weber se retrouve dans la formation des meilleurs joueurs du 21e siècle dévoilée vendredi par le NHL Network.\naujourd'hui à 19h43\nL’ancien défenseur du Canadien Shea Weber se retrouve dans la formation des meilleurs joueurs du 21e siècle dévoilée vendredi par le NHL Network.\naujourd'hui à 15h30\nL’attaquant sait exactement quand il réalisera qu’il fait partie du Canadien.\naujourd'hui à 20h34\nMaddox Schultz n’est peut-être qu’un espoir pour le repêchage de 2028, mais les amateurs auront déjà l’occasion de l’observer dès la saison prochaine.\naujourd'hui à 17h01\nUn ancien employé des Blackhawks argue avoir été renvoyé à la suite d’une entrevue avec un média couvrant les enjeux de la communauté LGBTQ+.\naujourd'hui à 18h12\nL’international ghanéen de Bournemouth, Antoine Semenyo, a été victime d’insultes racistes de la part d’un partisan de Liverpool.\naujourd'hui à 16h17\nMalgré une remontée en troisième période, le Canada a été éliminé en demi-finale du tournoi Hlinka-Gretzky, vendredi, à Brno, en Tchéquie.\naujourd'hui à 11h35\nC’est en grande partie grâce aux excellentes performances de ses jeunes joueurs que le Canadien de Montréal a participé aux séries l’an dernier.\naujourd'hui à 08h42\n«Nous espérons qu’il soit prêt à temps pour le début de la saison ou à un certain moment cet automne.»\naujourd'hui à 00h00\nIls seront une cinquantaine de Québécois à évoluer dans la LNH la saison prochaine, la majorité avec le Canadien.\nhier à 19h44\nL'ancien joueur des «Caps» ne semble pas avoir trop perdu de son sens du jeu malgré une absence prolongée.\nhier à 19h32\n«Ce sera différent parce qu’il y a moins d’attentes et quand il y a moins d’attentes, tu peux surprendre.»\nhier à 18h25\nLe vétéran défenseur n’a pas aimé la fin de son association avec l’équipe.\nhier à 17h20\nPlusieurs athlètes, entraîneurs, organisations et diffuseurs sont sur les dents en espérant une résolution rapide du conflit.\nhier à 16h03\nCertains contrats font très bien paraître les DG... et d’autres pas mal moins.\nhier à 15h42\nLe quart-arrière Caleb Evans ne l’aura pas facile à son premier départ de la saison, samedi, face aux Lions de la Colombie-Britannique.\nhier à 15h17\nLe directeur soccer quitte le bateau à son tour.\nhier à 10h50\nSi cela peut en rassurer certains, elles sont en cours.\nhier à 08h58\nKeaton Verhoeff ne manque pas d’ambition.\nhier à 00h00\nLe jeune homme a pris du coffre et s’alimente de façon plus rigoureuse.\nhier à 00h00\nUne vedette de l’internet a aidé l’attaquant à améliorer son arsenal de feintes durant son adolescence.\nle 13 août\nLes postes sont rares, mais le CH compte sur quelques espoirs de talent qui pourraient causer la surprise.\nle 13 août\nLe propriétaire des Hurricanes serait sur le point d'acquérir une deuxième franchise parmi les quatre sports majeurs en Amérique du Nord.\nle 13 août\nLes frères Lane et Cole Hutson suivent des parcours très semblables vers la LNH et ça ne passe pas inaperçu aux yeux des experts.\nle 13 août\nLe porteur de ballon des Bills a accepté une prolongation de contrat de quatre ans qui lui rapportera un total de 48 millions $.\nle 12 août\nChaque semaine, nous revenons sur les performances québécoises dignes de mention livrées dans le circuit canadien.\nle 12 août\nL'histoire du sport a vu passer une panoplie d'athlètes plutôt mal nommés...\nle 12 août\nLa légende des Leafs se console en revenant sur la Coupe Canada en 1976\nle 12 août\nL’ex-attaquant est le dernier joueur du Canadien à avoir inscrit 40 buts, en 1993-1994.\nle 12 août\nLe patron de l'UFC Dana White, proche de Donald Trump, a annoncé mardi la tenue d'une soirée MMA à la Maison-Blanche le 4 juillet 2026.\nle 12 août\nMême s’il a tout gagné durant sa carrière de hockeyeur, Evgeni Malkin serait le joueur le plus sous-estimé de l’histoire.\nle 12 août\nDe l'action, il y en a eu lors des 15 dernières années chez le Canadien.\nle 12 août\nSerge Savard a annoncé la venue du hockey masculin et féminin à l'Université de Sherbrooke.\nle 12 août\nKent Hughes tenterait toujours d'améliorer son équipe en vue de la prochaine campagne.\nle 12 août\nLe rêve inespéré à Hawaï du receveur québécois Nicholas Cenacle.\nle 11 août\nSans club depuis la fin de la plus récente saison, Jack Johnson s’est vu octroyé un contrat d’essai professionnel par le Wild du Minnesota, lundi."
    },
    {
      "url": "https://www.cnet.com/tech/services-and-software/ufc-streaming-moves-to-paramount-in-multi-billion-dollar-deal/#link={%22linkText%22:%22live%20UFC%20coverage%20in%20the%20US%20is%20set%20to%20change%20hands%20next%20year%22,%22target%22:%22%22,%22href%22:%22https://www.cnet.com/tech/services-and-software/ufc-streaming-moves-to-paramount-in-multi-billion-dollar-deal/%22,%22role%22:%22standard%22,%22absolute%22:%22%22}",
      "text": "Fight fans might have to rethink their entertainment plans. Paramount has struck a blockbuster deal to become the exclusive US broadcaster of UFC fights, agreeing to pay $7.7 billion over seven years starting in 2026. The deal, with UFC parent company TKO Group, will put all UFC events on Paramount-owned platforms, including Paramount Plus and CBS.\nThat means fans who are used to occasionally forking out for a pay-per-view UFC fight will have to consider a Paramount Plus subscription instead. All UFC events will be included in Paramount Plus subscriptions. Select events will be simulcast on CBS.\nRead also: South Park Locks Into Paramount Plus With $1.5 Billion Streaming Deal\nThe move is part of Paramount's push to beef up its live sports offerings as the streaming wars escalate. UFC has grown into one of the most valuable sports properties, attracting a younger, global audience that streaming services are eager to capture.\nFor viewers, the deal means UFC coverage will shift away from its US home on ESPN, changing how fans watch and pay for fights. Paramount merged with David Ellison's Skydance after its purchasing of Paramount Global from Shari Redstone on Aug. 7.\n\"This deal puts UFC amongst the biggest sports in the world,\" UFC CEO and president Dana White posted on X. \"The exposure provided by the Paramount and CBS networks under this new structure is a huge win for our athletes and anyone who watches and loves this sport.\"\nThe deal comes as media companies face mounting pressure to secure live content to keep subscribers from jumping to their rivals. With UFC locked in, Paramount is betting that octagon action will help it land a decisive blow in the fight for streaming dominance."
    }
  ],
  "argos_summary": "UFC 319 in Chicago features a middleweight title bout between champion Dricus du Plessis and unbeaten challenger Khamzat Chimaev, with the fight slated for August 16 at the United Center.  In the United States the event will be available on ESPN Plus as a pay‑per‑view, while the UK, Australia and Canada have their own streaming and PPV options.  The promotion is also finalising a landmark seven‑year deal with Paramount that will move all UFC events to Paramount Plus and CBS, ending the company’s long‑standing relationship with ESPN.  Meanwhile, UFC CEO Dana White confirmed plans for a historic White House fight on July 4, 2026, as part of the sport’s growing media and cultural reach.",
  "argos_id": "8BNV7JFNS"
}