{
  "url": "https://www.polygon.com/what-your-favorite-ufo-50-game-says-about-you/",
  "authorsByline": "Giovanni Colantonio",
  "articleId": "ccdbd5235dfb42a38e939914750d8b72",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/2024/09/ufo50_ss12.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T17:54:13+00:00",
  "addDate": "2025-08-15T18:11:31.004950+00:00",
  "refreshDate": "2025-08-15T18:11:31.004953+00:00",
  "score": 1.0,
  "title": "What your favorite UFO 50 game says about you",
  "description": "With UFO 50 now out on Nintendo Switch, allow us to guess your whole deal based solely on your favorite game in the retro game collection.",
  "content": "It took nearly a year, but UFO 50 is finally on Nintendo Switch. The news — an announcement that was unceremoniously shoved into a montage during last week’s Nintendo Indie Showcase — is a cause for celebration. The retro tribute is a staggering accomplishment that packs 50 original 8-bit games into one polished package. It’s a perfect companion for a portable console that every Switch owner should consider checking out.\n\nI’ve spent a lot of time with UFO 50 since its launch, putting nearly 100 hours into the collection on Steam Deck. In that time, I’ve had countless debates with friends about which games are the best in the bunch. No two lists are ever the same, and that’s the beauty of UFO 50: It’s an eclectic package that satisfies several personalities at once. You can tell a lot about a person based on their favorite game in the pack.\n\nSo, what does your favorite UFO 50 game say about you? After analyzing each game extensively, I am now able to clock the core essence of your personality with 99.999% accuracy based on which one you love. It’s just science. And if you’ve yet to dig into the daunting collection at all, consider this an easy guide to figuring out where to start, organized by the “chronological” order in which they appear in the game. You can’t go wrong with any game, but there’s something in UFO 50 that’s specifically for you, I promise.\n• Barbuta: You have a keen sense of mystery that was shaped by early PC games that you swear are real, but you can’t find any trace of them online.\n• Bug Hunter: Into the Breach fundamentally changed your personality in 2018 and now your personal brand is evangelizing indie games.\n• Ninpek: You used to get excited about family parties because it meant that you got to sneak down to our aunt’s basement and play NES.\n• Paint Chase: You don’t intentionally seek out “satisfying videos” on Instagram, but you don’t scroll away when the algorithm serves you a soap crushing video either.\n• Magic Garden: You have been called a “casual gamer” on multiple occasions but you have 100 hours logged in several versions of Puyo Puyo.\n• Mortol: You’re into death as an aesthetic, but in a Donnie Darko way.\n• Velgress: You have been arguing that the best Metroid game is the first one for so long and so fiercely that it’s too late for you to reassess your opinion. You have also only played the original Metroid for minutes at a time within the GameCube version of Animal Crossing.\n• Planet Zoldath: You love using the term “hard sci-fi” but you’re not actually sure what it means.\n• Attactics: You’re the direct target of the “How often do you think about the Roman Empire?” meme.\n• Devilition: You grew up in Massachusetts and had to learn about the Salem witch trials, and now you’re always looking for an excuse to flex your knowledge on it.\n• Kick Club: You have redirected a conversation about a hot new AAA game into one about the history of Taito in every Discord server you’ve ever been in.\n• Avianos: You know what all the X’s in “4X strategy” stands for and don’t understand why everyone else can’t keep it straight.\n• Mooncat: You have done LSD. This week.\n• Bushido Ball: Shogun was appointment viewing for you when it was airing, but you have never heard of Yojimbo.\n• Block Koala: At any given point, you are the only person in a room who knows what the word “sokoban” means.\n• Camouflage: Puzzles are kind of your whole thing, but you’ll take the fact that you look up solutions every once and a while to your grave.\n• Campanella: You’re the kind of person who intentionally picks up hobbies like knitting because you get a rush every time you thread a needle.\n• Golfaria: You’re a sucker for a great elevator pitch and can reliably decide whether or not you will like something based on one. Also, you’re into golf “intellectually” even though you’ve only been to a driving range once.\n• The Big Bell Race: If you are casually scrolling a streaming service looking for a movie to watch, you will not even consider putting something on that is over 100 minutes.\n• Warptank: You’re morally opposed to the very idea of war, but you still think tanks look pretty cool and don’t quite know how to square those two feelings.\n• Porgy: You watch Jaws on the 4th of July every year without fail.\n• Onion Delivery: You’re all about gross out humor. Smelly farts, belching — that’s the pinnacle of humor for you. Wario is your style icon.\n• Party House: You’re that person who invites people over to play board games and then breaks out the most complicated one possible and spends two hours explaining the rules.\n• Hot Foot: Middle school gym class was the peak of your life and you’ve been trying to recapture your glory days ever since.\n• Divers: You also watch Jaws every 4th of July, but it’s because you’re a marine biologist.\n• Rail Heist: Any time you walk into a room, you look around and try to figure out what you could use as a weapon if it came to that. It never has.\n• Vainger: You’re a traditionalist. You have a firm idea of what a video game looks like and it involves getting power ups and robots.\n• Rock On! Island: You spent a lot of time in your youth sneaking onto Addicting Games on the school computer.\n• Pingolf: Minigolf is your go-to date idea, and honestly? It always works, because you know the cool spots.\n• Mortol II: You are an academic who is a little self-conscious about the fact that you like games, so you make a big point to intellectualize them.\n• First Hell: You talk about how much of a cinephile you are, but all of your favorite movies are things like They Live and RoboCop.\n• Overbold: Everyone you know quietly has made a pact to never let you near a card table because they know that you will always double down when given the option despite the fact that it almost never works in your favor.\n• Campanella 2: You know that children’s toy where you’re tasked with tilting a wooden board to move a marble, avoiding a maze full of holes en route to the other side? That was your favorite toy growing up.\n• Hyper Contender: Anytime a new platform fighting game comes out, you make a big deal about how much better it is than Super Smash Bros. solely because it has a hyper specific bit of movement tech that is impossible to execute.\n• Valbrace: This one is too easy. You know what your deal is.\n• Rakshasa: You’re not a spiritual person, something that you make a big show out of any chance you can get (but you secretly hope that reincarnation is real).\n• Star Waspir: You just like shmups. That’s it. That’s the only way that Star Waspir is your favorite UFO 50 game. Shmups are just your whole thing, to the point where you actually call them shmups.\n• Grimstone: You only bought UFO 50 because someone told you that there was an ode to Dragon Quest in it. It is the only game you’ve played in the collection and you are preparing a three-hour YouTube video about it.\n• Lords of Diskonia: You were all about Pogs and Beyblades as a kid even though you didn’t really know how to actually play with either correctly.\n• Night Manor: You are constantly asking your friends if they’ve seen this great new horror movie on Shudder, and when they tell you they don’t have Shudder, you are genuinely taken aback by it.\n• Elfazar’s Hat: You’re an amateur magician, and you always wait until at least six months into a friendship to reveal that fact.\n• Pilot Quest: You’re an aggressive multitasker and that skill has allowed you to always make it look like you’re very busy at work when you’re actually playing three games at the same time.\n• Mini & Max: A lot of these have been fairly backhanded dunks, but I honestly think that anyone who’s favorite UFO 50 game is this one is just a nice person. Good-hearted, whimsical, pleasant to be around. A real bundle of light.\n• Combantants: You have eaten a bug before, on purpose.\n• Quibble Race: Look man, we need to talk. The sports betting is getting out of hand. I didn’t mind putting down $10 on the Browns to win an underdog game here and there, but I thought we were just goofing around. You’ve got to stop texting me and asking if I want in on your Bruins parlay. Since when do you even watch hockey? Is hockey even on TV anymore?\n• Seaside Drive: You think Miami is the coolest city in the world because you have only ever seen it in Grand Theft Auto: Vice City.\n• Campanella 3: Your only goal in life is to ride Star Tours one day.\n• Cyber Owls: You’re a self-proclaimed amateur birder who is always confidently identifying warblers as sparrows.\n\nUFO 50 is available now on Windows PC and Nintendo Switch.",
  "medium": "Article",
  "links": [
    "https://www.polygon.com/review/452079/ufo-50-review-pc/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "board games",
      "weight": 0.07701427
    },
    {
      "name": "games",
      "weight": 0.076229
    },
    {
      "name": "indie games",
      "weight": 0.07398666
    },
    {
      "name": "early PC games",
      "weight": 0.071364775
    },
    {
      "name": "UFO",
      "weight": 0.0489344
    },
    {
      "name": "a hot new AAA game",
      "weight": 0.04502691
    },
    {
      "name": "a new platform fighting game",
      "weight": 0.044380188
    },
    {
      "name": "the best Metroid game",
      "weight": 0.043874595
    },
    {
      "name": "their favorite game",
      "weight": 0.043786224
    },
    {
      "name": "time",
      "weight": 0.04376265
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.9482421875
    },
    {
      "name": "/Computers & Electronics/Consumer Electronics/Game Systems & Consoles",
      "score": 0.576171875
    },
    {
      "name": "/Games/Computer & Video Games/Other",
      "score": 0.355712890625
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.329345703125
    }
  ],
  "sentiment": {
    "positive": 0.32086924,
    "negative": 0.2170315,
    "neutral": 0.46209925
  },
  "summary": "Nintendo has released its classic 8-bit games, UFO 50, on its Nintendo Switch. The game is a compact package that packs 50 original 8-Bit games into a portable console. The announcement was announced at the Nintendo Indie Showcase and is a cause for celebration. The author has spent nearly 100 hours of time with UFO 50 since its launch and has had numerous debates with friends about which games are the best in the bunch. He suggests that the game can tell a lot about a person's personality based on their favorite game in the pack. The article also provides a guide to starting the daunting collection, organized by the order in which they appear in the game.",
  "shortSummary": "UFO 50, a comprehensive retro video game collection featuring 50 original 8-bit games, reveals distinct personality traits and deep-rooted interests, idealizing a portable console user's hobbies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8ea3e9128e3c4daaa73281547de34200",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.polygon.com/review/452079/ufo-50-review-pc/",
      "text": "The issue I had reviewing UFO 50 is not the issue you will have playing it.\nPresenting itself as an anthology of all 50 games developed by UFO Soft, a fictional game studio active from 1982-89, UFO 50 is all about breadth and variety. The player is presented with the entire catalog of games from the outset, and they can choose to play them in any order, and for any length of time. These are not WarioWare-style microgames, mind you. They are fully-fledged titles of varying length, ranging from arcade-style side-scrollers to fully developed dungeon crawlers, all presented in the 8-bit style of the imagined “LX” console on which they were first released.\nWhen we award the Polygon Recommends badge, it’s because we believe the recipient is uniquely thought-provoking, entertaining, inventive, or fun — and worth fitting into your schedule. If you want curated lists of our favorite media, check out What to Play and What to Watch.\nI chose to play the games in chronological order, which is how they are presented by default. In order to review the game, I felt it was important to play all 50, in part because it felt important to at least sample the entirety of what is presented here, but also because, as I quickly came to realize, the unique joy of UFO 50 comes not just from playing the individual games, but from seeing ideas develop over the fictional company’s entire oeuvre. Recurring mechanics, characters, and themes morph and deepen over time. Accordingly, I tried to play enough of each game to comment on it, moving on once I’d gotten a sense of its design and scope, keeping the ultimate goal of finishing my review on time.\nThen I got to Bushido Ball, and, well, I kind of forgot about all that.\nEvery game in the collection comes with a short description to give you a sense of what you’re playing. Here’s what it said for Bushido Ball: “It’s the annual Bushido Ball tournament. Choose from 6 fighters and compete to win!” A sports game, I thought. Got it. Bushido Ball was not the first sports-themed game, chronologically. That honor would belong to Kick Club, released one year before. But Bushido Ball, which I would roughly describe as samurai tennis, was so intensely fun that I accidentally played it for an hour and a half straight, losing sight of my goal of playing all 50 titles on only the 14th game in the lineup.\nIn Bushido Ball, you volley a ball back and forth, slicing it with your sword or, more awkwardly and less effectively, blocking it with your body. You build up a special meter with every successful slice of the ball, allowing you to use two special moves unique to your chosen character. The game progresses tournament style, with increasing difficulty as the volleys get faster and faster, requiring you to discover that you’ve actually had the ability to lob the ball all along (hold the joystick back while you press slice), as well as discovering the ways in which different moves can counter backspin and power shots. The whole thing is a total audiovisual joy and, in addition to the single-player mode, is one of 25 titles in the anthology that includes local multiplayer. If you have a friend, a couch, and fond memories of playing titles like Towerfall or Nidhogg, Bushido Ball alone will make UFO 50 a must-play title in a year filled with must-play titles.\nAnd that’s just one game out of 50.\nThe way I played UFO 50 is not how you should play UFO 50. When a game like Bushido Ball captures your interest, you can and should let yourself get lost in its depth. That’s the joy of this title, full stop. Whether it’s the deck-building party-throwing simulator, the idle game that generates resources while you play the other games, or the three sequels to a game starring an adorable red spacecraft, UFO 50 has an RPG’s worth of content within it — including an honest-to-goodness turn-based RPG. As I sampled title after title, there were many more that I wanted to get lost in, including a Pikmin-ish game starring killer ants, a clever puzzler involving a color-changing chameleon, and an adventure game where you play as a sentient golf ball. UFO 50 has more ideas than any game I’ve played in decades, and the magical thing is they’re all executed well. UFO Soft might not be a real developer, but by the time you’re done with UFO 50, you’ll wish it was.\nWhich brings me back to the metafictional element of the game. The opening credits posit that, in 2018, Mossmouth and friends (game developers Derek Yu, Jon Perry, Eirik Suhrke, Paul Hubans, Ojiro Fumoto, and Tyriq Plummer, to be specific) discovered a lost LX console in a storage facility, working to rescue the games and make them work on a modern PC. To quote LCD Soundsystem, UFO 50 trades in “borrowed nostalgia for the unremembered ’80s,” functioning as a love letter to 8-bit games and ’80s consoles. But beyond that, it’s also a beautiful reflection on game development itself. Every title is worthy in its own right, but it’s the way they build on each other that makes UFO 50 fly.\nTake the first game in the anthology, Barbuta. It is not, to my tastes, consistently fun. It is a brutal Metroid-like with one-hit deaths and only six continues to complete the entire game, and I moved on from it quickly. But without Barbuta, there would be no Mortol, where each time you die, you can make your body into a ledge or stone that makes your next attempt even easier, an idea that gets further evolved in Mortol 2, which turns that concept into a Metroidvania where you get 99 sacrificial characters — warriors, gunners, ninjas, and more — to complete the game, which resets every time you turn it off. You can also track the way the original Campanella charts the course for the expanded sequel, only to take a strange turn in Campanella 3, the penultimate game from the fictional studio. Taking the metafictional conceit even further, you can imagine a critic thinking that 3 lacked the things that made 1 and 2 unique, and that, however enjoyable it is in its own right, one could argue that it isn’t worthy of the Campanella name.\nAll told, whether you are tracking the histories of individual fictional developers or just the ideas that reoccur from UFO Soft’s very first games to its very last, there is enough going on here to write a dissertation. You can and will get lost in this title and the world it imagines. This is a feast of a game, presented buffet style.\nI wholeheartedly recommend UFO 50 on a gameplay level alone. I feel confident in saying, should you be able to stomach high difficulty and occasionally obtuse objectives, you will find a game, or two, or 30 in UFO 50 that will resonate with you. But I also recommend UFO 50 as a metafictional narrative argument that we all benefit when the same people have the opportunity to make multiple titles together. In an industry plagued by layoffs and closures, UFO 50 imagines a group of people who made 50 games together, building off of successes and taking wild swings throughout their career. Sure, it’s a work of fiction, but it’s a hopeful one.\nUnmatched in its scope and execution, UFO 50 is a game about creativity and persistence that rewards every minute spent with it. You’ll wish there were another 50 to play next.\nUFO 50 will be released Sept. 18 on Windows PC. The game was reviewed on PC using a pre-release download code provided by Mossmouth. Vox Media has affiliate partnerships. These do not influence editorial content, though Vox Media may earn commissions for products purchased via affiliate links. You can find additional information about Polygon’s ethics policy here."
    }
  ],
  "argos_summary": "UFO 50, a collection of 50 retro‑style 8‑bit games from the fictional 1980s studio UFO Soft, has finally launched on Nintendo Switch after a year of development. The review praises its breadth, noting how each title builds on the previous ones, and highlights standout entries like the samurai‑tennis game Bushido Ball. The anthology is framed as a metafictional love letter to 80s gaming, offering a narrative about a team of developers creating a full catalog together. Overall, the piece recommends UFO 50 for its creative depth, challenging gameplay, and hopeful commentary on collaborative game development.",
  "argos_id": "9YVXAU3FU"
}