{
  "url": "https://www.yahoo.com/entertainment/articles/megadeth-announces-retirement-final-album-161701492.html",
  "authorsByline": "Jack Irvin",
  "articleId": "48034bdf827844ce81ffaae824206ef1",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/1effabafe3d8883d929df2768fcddb89040c9040cecdb68a64b03f5620dccbe8/ynews/resizefill_w1200/https://media.zenfs.com/en/people_218/adc33cd15047b3b9cbb4424ce1567c61",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T16:17:01+00:00",
  "addDate": "2025-08-15T16:33:47.169093+00:00",
  "refreshDate": "2025-08-15T16:33:47.169095+00:00",
  "score": 1.0,
  "title": "Megadeth Announces Retirement, Final Album and Farewell Tour: 'The Hardest Part of All of This Is Saying Goodbye'",
  "description": "\"Don't be mad, don't be sad, be happy for us all, come celebrate with me these next few years,\" said Dave Mustaine in a statement",
  "content": "It's time for Megadeth to say goodbye.\n\nMore than 40 years after the metal band — comprised of Dave Mustaine, James LoMenzo, Dirk Verbeuren and Teemu Mäntysaari — first formed in 1983, vocalist and guitarist Mustaine announced the group's retirement in a statement shared to their website on Thursday, Aug. 14.\n\n\"There's so many musicians that have come to the end of their career, whether accidental or intentional,\" he wrote. \"Most of them don't get to go out on their own terms on top, and that's where I'm at in my life right now. I have traveled the world and have made millions upon millions of fans and the hardest part of all of this is saying goodbye to them.\"\n\nMustaine said, \"We can't wait for you to hear this album and see us on tour. If there was ever a perfect time for us to put out a new album, it's now. If there was ever a perfect time to tour the world, it's now. This is also a perfect time for us to tell you that it's our last studio album.\"\n\n\"We've made a lot of friends over the years and I hope to see all of you on our global farewell tour. Don't be mad, don't be sad, be happy for us all, come celebrate with me these next few years,\" he continued.\n\nThe former Metallica member added, \"We have done something together that's truly wonderful and will probably never happen again. We started a musical style, we started a revolution, we changed the guitar world and how it's played, and we changed the world. The bands I played in have influenced the world. I love you all for it. Thank you for everything.\"\n\nAccording to Megadeth's website, the group's upcoming seventeenth studio album is slated to drop early next year, and Mustaine is also gearing up to release a memoir.\n\nThe band has European tour dates scheduled for September and October.\n\nMegadeth's retirement announcement arrived alongside an animated video starring the band's mascot, Vic Rattlehead. \"For over four decades, I've been chained in silence. But the end demands my voice. It is confirmed the next Megadeth studio album will be the last. 40 years of metal forged in steel, ending in fire,\" said the character.\n\nRattlehead continued, \"And when the new year rises, the global farewell tour, you've heard the warning. Now prepare yourselves, cyber army. Stay loud, stay tuned, and meet me on the front lines.\"\n\nThroughout Megadeth's career, the band earned eight top-10 albums on the Billboard 200 chart. One of their singles, 1992's \"Symphony of Destruction,\" hit the Billboard Hot 100 singles chart at No. 71.\n\nMegadeth won a Grammy Award for Best Metal Performance in 2017 for their song \"Dystopia.\" They've been nominated 12 other times at the awards show.",
  "medium": "Article",
  "links": [
    "https://people.com/megadeth-marty-friedman-was-too-short-to-join-kiss-8702005",
    "https://www.megadeth.com/blogs/news/final-album-global-farewell-tour",
    "https://people.com/megadeth-announces-retirement-final-album-farewell-tour-11791852",
    "https://www.youtube.com/watch?v=2_V_BXwC-eY"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Farewell Tour",
      "weight": 0.07797214
    },
    {
      "name": "Final Album",
      "weight": 0.07571162
    },
    {
      "name": "European tour dates",
      "weight": 0.07105306
    },
    {
      "name": "Dave Mustaine",
      "weight": 0.069017604
    },
    {
      "name": "Megadeth",
      "weight": 0.067527205
    },
    {
      "name": "Mustaine",
      "weight": 0.063573055
    },
    {
      "name": "tour",
      "weight": 0.06339563
    },
    {
      "name": "the next Megadeth studio album",
      "weight": 0.06334676
    },
    {
      "name": "time",
      "weight": 0.062892705
    },
    {
      "name": "Best Metal Performance",
      "weight": 0.060987476
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.8388671875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.82958984375
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.458740234375
    }
  ],
  "sentiment": {
    "positive": 0.12873827,
    "negative": 0.4991996,
    "neutral": 0.37206206
  },
  "summary": "Megadeth has announced its retirement from performing more than 40 years into their career, with vocalist and guitarist Dave Mustaine stating that the hardest part of the process is saying goodbye to their fans. The metal band, formed in 1983, has been touring the world and earning eight top-10 albums on the Billboard 200 chart. The band's final album is set to be released next year and Mustaine is also preparing to release a memoir. Despite the announcement, Megadeth's mascot, Vic Rattlehead, voiced the news alongside an animated video featuring the band's mascot.",
  "shortSummary": "Megadeth announced their retirement, with their upcoming album, farewell tour, and upcoming memoirs, marking a 40-year career with a global tour.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "50523f89983b410db43f1108b25bb408",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.megadeth.com/blogs/news/final-album-global-farewell-tour",
      "text": "“There's so many musicians that have come to the end of their career, whether accidental or intentional. Most of them don't get to go out on their own terms on top, and that's where I'm at in my life right now. I have traveled the world and have made millions upon millions of fans and the hardest part of all of this is saying goodbye to them.\nWe can't wait for you to hear this album and see us on tour. If there was ever a perfect time for us to put out a new album, it's now. If there was ever a perfect time to tour the world, it's now. This is also a perfect time for us to tell you that it's our last studio album. We've made a lot of friends over the years and I hope to see all of you on our global farewell tour. Don't be mad, don't be sad, be happy for us all, come celebrate with me these next few years. We have done something together that's truly wonderful and will probably never happen again. We started a musical style, we started a revolution, we changed the guitar world and how it's played, and we changed the world. The bands I played in have influenced the world. I love you all for it. Thank you for everything.”\n- Dave Mustaine\nVIC SPEAKS\nPhoto credit: Ross Halfin\nMEGADETH are set to release their forthcoming album via MUSTAINE’s Tradecraft imprint in partnership with Frontiers Label Group’s new BLKIIBLK label early next year. It will launch with the project's first single (TBA) in tandem with global pre-orders this fall. Also set for next year is a new memoir from Mustaine, details of which will be revealed in the coming months."
    },
    {
      "url": "https://people.com/megadeth-announces-retirement-final-album-farewell-tour-11791852",
      "text": "Megadeth Announces Retirement, Final Album and Farewell Tour: 'The Hardest Part of All of This Is Saying Goodbye' \"Don't be mad, don't be sad, be happy for us all, come celebrate with me these next few years,\" said Dave Mustaine in a statement By Jack Irvin Jack Irvin Jack Irvin has over five years of experience working in digital journalism, and he’s worked at PEOPLE since 2022. Jack started in the industry with internships at Rolling Stone and Entertainment Tonight, and he worked as a writer for publications including Bustle, MTV News, Shondaland, L’Officiel USA, Ladygunn, Flood and PopCrush before joining PEOPLE. In his current role, Jack covers daily music news and has interviewed both up-and-coming and established artists including Dolly Parton, Michelle Branch, Ashanti, Cyndi Lauper, Normani, Carly Rae Jepsen and Coco Jones. People Editorial Guidelines Published on August 15, 2025 12:17PM EDT Leave a Comment Megadeth's James LoMenzo, Dave Mustaine and Kiko Loureiro in June 2022. Credit : Per Ole Hagen/Redferns It's time for Megadeth to say goodbye. More than 40 years after the metal band — comprised of Dave Mustaine, James LoMenzo, Dirk Verbeuren and Teemu Mäntysaari — first formed in 1983, vocalist and guitarist Mustaine announced the group's retirement in a statement shared to their website on Thursday, Aug. 14. \"There's so many musicians that have come to the end of their career, whether accidental or intentional,\" he wrote. \"Most of them don't get to go out on their own terms on top, and that's where I'm at in my life right now. I have traveled the world and have made millions upon millions of fans and the hardest part of all of this is saying goodbye to them.\" Megadeth's James LoMenzo, Dave Mustaine and Kiko Loureiro in June 2022. Per Ole Hagen/Redferns Mustaine said, \"We can't wait for you to hear this album and see us on tour. If there was ever a perfect time for us to put out a new album, it's now. If there was ever a perfect time to tour the world, it's now. This is also a perfect time for us to tell you that it's our last studio album.\" \"We've made a lot of friends over the years and I hope to see all of you on our global farewell tour. Don't be mad, don't be sad, be happy for us all, come celebrate with me these next few years,\" he continued. Related Stories Aerosmith’s Joe Perry Says He ‘Wouldn’t Bet’ on the Band Touring Again as Steven Tyler ‘Doesn’t Want to’ Sharon Osbourne Shares Ozzy’s Bittersweet Final Words About His Fans in Resurfaced Interview The former Metallica member added, \"We have done something together that's truly wonderful and will probably never happen again. We started a musical style, we started a revolution, we changed the guitar world and how it's played, and we changed the world. The bands I played in have influenced the world. I love you all for it. Thank you for everything.\" According to Megadeth's website, the group's upcoming seventeenth studio album is slated to drop early next year, and Mustaine is also gearing up to release a memoir. The band has European tour dates scheduled for September and October. Megadeth's retirement announcement arrived alongside an animated video starring the band's mascot, Vic Rattlehead. \"For over four decades, I've been chained in silence. But the end demands my voice. It is confirmed the next Megadeth studio album will be the last. 40 years of metal forged in steel, ending in fire,\" said the character. James LoMenzo, Dick Verbeuren, Dave Mustaine and Teemu Mäntysaari in June 2025. Per Ole Hagen/Redferns Rattlehead continued, \"And when the new year rises, the global farewell tour, you've heard the warning. Now prepare yourselves, cyber army. Stay loud, stay tuned, and meet me on the front lines.\" Throughout Megadeth's career, the band earned eight top-10 albums on the Billboard 200 chart. One of their singles, 1992's \"Symphony of Destruction,\" hit the Billboard Hot 100 singles chart at No. 71. Megadeth won a Grammy Award for Best Metal Performance in 2017 for their song \"Dystopia.\" They've been nominated 12 other times at the awards show. Close Leave a Comment Read more: Entertainment Music Rock Music"
    },
    {
      "url": "https://people.com/megadeth-marty-friedman-was-too-short-to-join-kiss-8702005",
      "text": "Ex-Megadeth Guitarist Marty Friedman Recalls Being Told He Wasn't Tall Enough to Join KISS in Throwback Interview The rocker revealed KISS' team approached him for a potential job playing in the band as \"they were changing guitar players\" By Jack Irvin Jack Irvin Jack Irvin has over five years of experience working in digital journalism, and he’s worked at PEOPLE since 2022. Jack started in the industry with internships at Rolling Stone and Entertainment Tonight, and he worked as a writer for publications including Bustle, MTV News, Shondaland, L’Officiel USA, Ladygunn, Flood and PopCrush before joining PEOPLE. In his current role, Jack covers daily music news and has interviewed both up-and-coming and established artists including Dolly Parton, Michelle Branch, Ashanti, Cyndi Lauper, Normani, Carly Rae Jepsen and Coco Jones. People Editorial Guidelines Published on August 27, 2024 02:05PM EDT Leave a Comment Marty Friedman was ready to \"Rock and Roll All Nite\" with KISS, but his dream was quickly put to rest. In a 2019 interview with Sam Ash Music that's been getting a second life online, the former Megadeth guitarist recalled a time where he was approached to join KISS — but was ultimately told he wasn't tall enough to perform in the legendary rock band. \"When they were changing guitar players a long time ago, I got a call from somebody from KISS’ people,\" said Friedman, 61, who played in Megadeth from 1990 through 2000. \"They say, ‘Do you think you’d be interested in auditioning for KISS?’ And I’m like, ‘Tell me when and where.’\" Gene Simmons Considers KISS Catalog Sale a 'Natural Thing': 'Out of Respect and Love for the Fans' (Exclusive) KISS; Marty Friedman. Mick Hutson/Redferns; Jun Sato/WireImage Next, KISS' team had a few more questions. He recalled, \"'You don’t have any facial hair, do you?’ No. ‘You got long hair, right?’ Right. ‘You’re skinny, right?’ Right. ‘And you’re over 6 feet tall?’ and I’m like, ‘What? I’m like 5’7 and a half, but I’ll have an operation, I’ll do something.'\" \"They were like, ‘I’m sorry, it’s not going to work out.’ I was so bummed,\" said Friedman. He added, \"I totally get it, but I would’ve done anything. If there was an operation available at the time, I would’ve done it.\" Gene Simmons Jokes It Would've Been 'Smarter' for KISS to Wear 'T-Shirts and Sneakers' over '40 Lbs. of Armor' (Exclusive) Marty Friedman. Terry Wyatt/Getty It's unclear exactly when the meeting went down, but the band's latest guitarist is Tommy Thayer, who joined KISS in 2002 — about two years after Friedman wrapped his time with Megadeth. KISS' Gene Simmons recently shared his own thoughts on the band's strict image, telling PEOPLE in April that the group may not have recently retired if their signature looks were different. “It’s not like having a Sunday walk, it’s not the same. In hindsight, we would have been smarter putting on T-shirts and sneakers and going out there Ramone-style, and just strumming the guitar,” he joked at the time. Close Leave a Comment Read more: Entertainment Music Rock Music"
    }
  ],
  "argos_summary": "Megadeth announced their retirement, revealing that their forthcoming seventeenth studio album will be the last and that they will embark on a global farewell tour. Lead vocalist and guitarist Dave Mustaine expressed gratitude to fans and highlighted the band's impact on metal, noting the release of a memoir and the album’s early‑next‑year debut. The band’s European tour is scheduled for September and October, and an animated video featuring their mascot Vic Rattlehead accompanied the announcement. Megadeth’s career includes eight top‑10 Billboard 200 albums, a 2017 Grammy win, and numerous nominations.",
  "argos_id": "AS8N1BAI7"
}