{
  "url": "https://nypost.com/2025/08/15/sports/chiefs-owner-clark-hunt-opens-up-on-taylor-swift-whirlwind/",
  "authorsByline": "Thomas Gamba-Ellis",
  "articleId": "155c0beaaf794fcc9ef0e00c64181c5f",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-3e1w1uxqt-1755298355573.jpg?quality=75&strip=all&1755283974&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T23:39:27+00:00",
  "addDate": "2025-08-15T23:41:16.654483+00:00",
  "refreshDate": "2025-08-15T23:41:16.654484+00:00",
  "score": 1.0,
  "title": "Chiefs owner opens up on Taylor Swift ‘whirlwind’ — and the complete change she ‘unintentionally’ ushered in",
  "description": "The Taylor Swift effect has reached the Chiefs, according to owner Clark Hunt.",
  "content": "The Taylor Swift effect has reached the Chiefs, according to owner Clark Hunt.\n\nDuring an interview on “The Pat McAfee Show” on Friday, Hunt discussed the effect Swift’s relationship with Travis Kelce has had on his organization following her appearance on the tight end’s “New Heights” podcast.\n\nHunt was nothing short of positive when discussing Swift — specifically citing her impact with female Chiefs fans over recent seasons.\n\n“It’s been a whirlwind, I would say, for the organization over the last two years since Taylor literally stepped into our lives. She’s done an amazing job, unintentionally, of increasing our female fanbase.\n\n“We used to be about a 50-50 ratio, male-to-female fanbase, and now 57 percent of our fans are female, which I think is probably the highest in the National Football League. So there’s absolutely been a Taylor Swift effect.”\n\nHunt also shared his support of Swift and Kelce’s relationship, saying that the two make an “amazing couple.”\n\n“Let me just say how happy we are for their relationship,” Hunt said. “They’re an amazing couple, and watching the two of them together is really special. That podcast, seeing them side by side talking about their relationship, was absolutely amazing.”\n\nDuring her time on the “New Heights” podcast on Wednesday, the 14-time Grammy winner opened up about her “rookie” NFL season during the early stages of her and Kelce’s relationship, revealing the moment that means the most to her from that year.\n\nSwift, who started dating Kelce in 2023, said she cherished the moment when Kelce’s mother invited her down to the field to celebrate the Chiefs’ AFC Championship game win in 2024.\n\n“The first time I stepped on the field, which would have been when you won the AFC Championship, the first season that I was with you, and it was in Baltimore, and we’re in the suite and you just won the AFC Championship, we’re freaking out and everybody’s screaming, and [Travis’] mom goes, ‘Alright, let’s go down to the field,’” Swift, 35, said during the podcast.\n\n“I was like, ‘What, we’re doing, what do you mean? We’re going where?’ And she’s like, ‘We’re going down to the field,’ and I was like, ‘Did he say that that’s OK?’ Cause we hadn’t talked about this.”",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/15/sports/logan-paul-model-nina-agdal-married-in-italy-wedding/",
    "https://x.com/PatMcAfeeShow/status/1956407734120923166",
    "https://nypost.com/2025/08/15/sports/the-tragedy-ruining-jordan-spieths-career-gary-player-doesnt-hold-back/",
    "https://nypost.com/2025/08/14/sports/taylor-swift-reveals-cherished-nfl-moment-with-travis-kelce-she-didnt-expect/#",
    "https://nypost.com/2025/08/14/sports/taylor-swift-reveals-cherished-nfl-moment-with-travis-kelce-she-didnt-expect/",
    "https://nypost.com/2025/08/15/sports/halle-berry-fires-back-at-ex-yankees-star-husbands-comments-cooking-cleaning-and-mothering/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taylor Swift",
      "weight": 0.10691839
    },
    {
      "name": "female Chiefs fans",
      "weight": 0.098375924
    },
    {
      "name": "Swift",
      "weight": 0.093647584
    },
    {
      "name": "Travis Kelce",
      "weight": 0.08961037
    },
    {
      "name": "AFC Championship",
      "weight": 0.08817977
    },
    {
      "name": "Chiefs owner",
      "weight": 0.083041534
    },
    {
      "name": "owner Clark Hunt",
      "weight": 0.080198094
    },
    {
      "name": "Kelce",
      "weight": 0.077427454
    },
    {
      "name": "recent seasons",
      "weight": 0.074880116
    },
    {
      "name": "Clark Hunt",
      "weight": 0.07389357
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    },
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.994140625
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9140625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.818359375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.73681640625
    },
    {
      "name": "/News/Sports News",
      "score": 0.35986328125
    }
  ],
  "sentiment": {
    "positive": 0.33375925,
    "negative": 0.30969593,
    "neutral": 0.35654485
  },
  "summary": "The Taylor Swift effect has impacted the Kansas City Chiefs football team, according to owner Clark Hunt. During an interview on \"The Pat McAfee Show,\" Hunt highlighted the impact of Swift's relationship with Travis Kelce on the team, stating that it has been a \"whirlwind\" for the team over the past two years. He also shared his support for Swift and Kelce's relationship, calling them an \"amazing couple\". The change in fan demographics has resulted in a significant increase in female fans, with 57 percent of the 57% of the team now being female.",
  "shortSummary": "Chief Chiefs owner Clark Hunt praised the Taylor Swift effect on the team, highlighting her impact on female fans and praising her relationship with Travis Kelce.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "78c4dfe396014e318efd88a1a8023bd1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/14/sports/taylor-swift-reveals-cherished-nfl-moment-with-travis-kelce-she-didnt-expect/#",
      "text": "The moment Taylor Swift cherishes the most from her “rookie” NFL season was something she never originally anticipated.\nWhen reflecting on her first season as a member of Chiefs Kingdom during her highly hyped appearance on boyfriend Travis Kelce’s “New Heights” podcast Wednesday, the 14-time Grammy winner revealed she was taken aback by the media blitz that followed Kansas City’s AFC Championship win in 2024 and was startled over the suggestion that she would join his family on the field for the jubilant celebrations.\n“The first time I stepped on the field, which would have been when you won the AFC Championship, the first season that I was with you, and it was in Baltimore, and we’re in the suite and you just won the AFC Championship, we’re freaking out and everybody’s screaming, and [Travis’] mom goes, ‘Alright, let’s go down to the field.’ I was like, ‘What, we’re doing, what do you mean? We’re going where?’ And she’s like, ‘We’re going down to the field,’ and I was like, ‘Did he say that that’s OK?’ Cause we hadn’t talked about this,” Swift, 35, recalled of the Chiefs’ 17-10 victory over the Ravens at Baltimore’s M&T Bank Stadium in January 2024.\nThat’s when Kelce matriarch Donna assured the pop megastar that her son — who had just punched his ticket to his fourth Super Bowl — would want her there for the Chiefs’ latest victory lap.\n“She was like, ‘Trust me, he wants you there,’ and I was like, ‘OK, she would know,’ and so, I’m walking out onto this field and it’s like — there’s so many lights, and I’ve never seen this many cameras, I’ve never seen this much media in my life, and I’ve seen a lot of media. And then the media sees me, and then they just start running at me, and I’m looking at you, and then you’re screaming into the mic, cause when there’s a mic and there’s Travis, he physically needs to scream into it. So basically, I’m experiencing this whole heightened scenario that I had no idea five minutes before I was going to be experiencing, and it’s one of my most cherished memories,” Swift recalled.\nFollow Taylor Swift live updates from Page Six for the latest news, photos, fan theories and more\nSwift, who started dating Kelce in the summer of 2023 and made her first Chiefs appearance that September, embraced the tight end on the field in the surreal scene.\n“I was so proud that you came down there to join me for that moment,” Kelce told Swift, who replied, “It was so magical, it was so fun, it’s crazy to get to see someone you love work that hard and have that kind of euphoric payoff where, you did it, underlined a hundred times …. I had such a great rookie year.”\nTwo weeks later, Swift joined Kelce on the field again at Allegiant Stadium in Las Vegas, where Kansas City defeated San Francisco in overtime, 25-22, to win Super Bowl 2024.\nBeyond Swift’s foray into football, the singer spoke at length Wednesday about her relationship with Kelce and her upcoming album, “The Life of a Showgirl,” which drops Oct. 3.\nThe Chiefs open the 2025 season on Sept. 5 against the Chargers in São Paulo, Brazil."
    },
    {
      "url": "https://nypost.com/2025/08/15/sports/the-tragedy-ruining-jordan-spieths-career-gary-player-doesnt-hold-back/",
      "text": "Gary Player believes Jordan Spieth can be the standard in golf.\nAnd that’s why the golf legend said it’s a “tragedy” that Spieth has fallen off due to what he believes is poor coaching.\n“Jordan Spieth, I think, is the best golfer in the world, but in my opinion, he was taught the wrong thing. He was taught the wrong thing. And he just went downhill,” Player said in a video “The Golf Supply” YouTube channel posted this week. “If you had a man like Ben Hogan teaching Jordan Spieth, he would be the best in the world. He’s such a competitor, such a wonderful man. A wonderful guy for golf, the best short game, oh man, best course management, but, man, he just can’t hit the ball, ya know? That is a tragedy.“\nPlayer, 89, tackled Spieth’s career while teaching a player and discussing the “tremendous lack of knowledge” in the sport.\nHe bemoaned the coaching that American players are receiving, specifically the bowed wrist technique, saying once players do that, “you’re gone” and “your golf career is limited.”\n“I would say in America today, the golf pros that are teaching know less about golf,” he said.\nPlayer, who won nine majors, first mentioned Dustin Johnson, asking: “When’s the last you heard of Dustin Johnson?”\nHe later told the student how a golfer has to get his hands under the club and then commented on Spieth and Rickie Fowler.\nPlayer did, though, have some hope for Spieth, saying he saw his swing recently.\n“So, he might do a lot better this week,” Player said, “I’m hoping he will.”\nSpieth, 31, ranked as the top player in the world in 2015 and has won three majors in his career, but last did so in 2017, when he triumphed at The Open Championship.\nHe currently ranks 52nd in the sport and has not won an event since the 2022 RBC Heritage.\nSpieth has finished fourth twice this year, but also tallied 40th, 31st and 38th results in his last three events, respectively.\nHe withdrew from an event due to injury for the first time in his career earlier this year.\nSpieth is not competing in this week’s BMW Championship since he finished outside the top 50 of the FedEx Cup standings."
    },
    {
      "url": "https://nypost.com/2025/08/15/sports/logan-paul-model-nina-agdal-married-in-italy-wedding/",
      "text": "WWE star Logan Paul and model Nina Agdal got married during a ceremony in Lake Como, Italy, on Friday, according to a video shared by his younger brother, Jake, on Instagram.\nIt marked a return to the area where Paul proposed in July 2023, which was just over a year after the couple was spotted at a restaurant in London with friends.\nAnd the ceremony that, according to TMZ, was officiated by Mike Majlak — the “Impaulsive” podcast co-host — caused Jake to become emotional, as he captioned the video with, “I’ve seriously been crying.”\nPaul and Agdal welcomed their first child, Esmé, in September 2024, and she was in attendance at the ceremony, too, along with Jake and his fiancée, Jutta Leerdam.\nDuring the ceremony, Paul donned a white jacket, a black bow tie and black pants, and the pair of couples posted for a photo afterward.\nPaul and Agdal were spotted in Cernobbio on Wednesday paddling separate canoes and swimming, and Paul also shared a series of photos and videos — including one of the couple practicing their dance for the ceremony — to reveal that it was his “wedding week.”\nWhen Paul proposed to Agdal at Hotel Passalacqua last year, Agdal was “completely blindsided by the proposal and was visibly surprised” — and the ring was the wrong size, a witness told the Daily Mail at the time.\nThen, Paul reportedly called Jake and said, “Bro, you have a sister,” the outlet added.\n“Today is the day I ask the love of my life to marry me,” Paul said in a 2023 YouTube video that provided a behind-the-scenes glimpse at the proposal. “Fourteen months ago, I fell in love with the most beautiful human being I’ve ever seen in my life, and I have been waiting for this day ever since.”\nPaul’s fame has skyrocketed after making his in-ring WWE debut in 2022, and he spent time on the field pregame at Yankee Stadium two weeks ago ahead of WWE SummerSlam — posing with Aaron Judge and getting the superstar to sign a baseball.\nBut before Paul faces John Cena in a singles bout at WWE Clash in Paris on Aug. 31, he took a break for the extravagant ceremony."
    },
    {
      "url": "https://nypost.com/2025/08/15/sports/halle-berry-fires-back-at-ex-yankees-star-husbands-comments-cooking-cleaning-and-mothering/",
      "text": "Halle Berry heard the comments made by her ex-husband, David Justice, on the demise of their marriage, saying he left her in 1996 because “she don’t cook, don’t clean, don’t really seem motherly.”\nThe Academy Award-winning actress seemingly trolled the retired MLB player in a post on Instagram Thursday, which included a carousel of snapshots showing her laughing and vacationing with her boyfriend, Van Hunt.\n“Phew…! cooking, cleaning and mothering,” wrote Berry, who turned 59 on Thursday.\nOther snapshots showed the actress laughing and lounging on an outdoor bed in the middle of the ocean while holding a wine glass in between her toes.\nOne photo showed her holding a card that said, “Mom” with a hearts on it.\nBerry shares a daughter, Nahla, 17, with ex-boyfriend Gabriel Aubry, and a son Maceo, 11, with ex-husband Oliver Martinez, to whom she was married from 2013-16.\nThe caption seemingly referenced her ex Justice’s recent comments made during an Aug. 7 appearance on former NBA star Matt Barnes’ “All the Smoke” podcast — when Justice discussed his four-year marriage to Berry before their divorce was finalized in 1997.\n“There really wasn’t a lot of negative attention until I decided to leave her in 1996,” the ex-Yankees star said. “… She asked me to marry her after knowing me for five months. I said, ‘OK’ because I couldn’t say no … but I don’t know if my heart was really into it.\n“… My knowledge and wisdom around relationships wasn’t vast. So I’m looking at my mom, and I’m a midwest guy, so in my mind I’m thinking, a wife at that time should cook, clean — and then I’m thinking, ‘OK if we have kids, is this the woman I want to have kids with or a family with.\n“And at that time, as a young guy, she don’t cook, don’t clean, don’t really seem like motherly and then we start having issues.”\nJustice added that he was “footing everything” at the time because Berry “didn’t have any money.”\nHalle and Hunt went public with their relationship in 2020.\nDuring a joint interview on “TODAY with Jenna & Friends” in June, the music artist joked that he proposed to the “Monster’s Ball” actress.\n“So I put out the proposal, and it’s still on hold as you can see,” Hunt, 55, said as Berry laughed. “It’s just out there floating. You know, maybe you can encourage her.”\nBerry explained why things have been on hold in terms of getting married.\n“Well, I’ve been married three times. Van has been married once, and so, no, we don’t feel like we have to get married to validate our love in any way. We don’t,” Berry said.\n“But I think we will get married just because, out of the people I’ve been married to, this is the person I should have married. And I feel like I should, we should get married, but it’s not because we feel like we have to. I think it’s something that we would like to do just because we want that expression.”\nBerry was married to her second husband, musician Eric Benét, from 2001-05."
    },
    {
      "url": "https://nypost.com/2025/08/14/sports/taylor-swift-reveals-cherished-nfl-moment-with-travis-kelce-she-didnt-expect/",
      "text": "The moment Taylor Swift cherishes the most from her “rookie” NFL season was something she never originally anticipated.\nWhen reflecting on her first season as a member of Chiefs Kingdom during her highly hyped appearance on boyfriend Travis Kelce’s “New Heights” podcast Wednesday, the 14-time Grammy winner revealed she was taken aback by the media blitz that followed Kansas City’s AFC Championship win in 2024 and was startled over the suggestion that she would join his family on the field for the jubilant celebrations.\n“The first time I stepped on the field, which would have been when you won the AFC Championship, the first season that I was with you, and it was in Baltimore, and we’re in the suite and you just won the AFC Championship, we’re freaking out and everybody’s screaming, and [Travis’] mom goes, ‘Alright, let’s go down to the field.’ I was like, ‘What, we’re doing, what do you mean? We’re going where?’ And she’s like, ‘We’re going down to the field,’ and I was like, ‘Did he say that that’s OK?’ Cause we hadn’t talked about this,” Swift, 35, recalled of the Chiefs’ 17-10 victory over the Ravens at Baltimore’s M&T Bank Stadium in January 2024.\nThat’s when Kelce matriarch Donna assured the pop megastar that her son — who had just punched his ticket to his fourth Super Bowl — would want her there for the Chiefs’ latest victory lap.\n“She was like, ‘Trust me, he wants you there,’ and I was like, ‘OK, she would know,’ and so, I’m walking out onto this field and it’s like — there’s so many lights, and I’ve never seen this many cameras, I’ve never seen this much media in my life, and I’ve seen a lot of media. And then the media sees me, and then they just start running at me, and I’m looking at you, and then you’re screaming into the mic, cause when there’s a mic and there’s Travis, he physically needs to scream into it. So basically, I’m experiencing this whole heightened scenario that I had no idea five minutes before I was going to be experiencing, and it’s one of my most cherished memories,” Swift recalled.\nFollow Taylor Swift live updates from Page Six for the latest news, photos, fan theories and more\nSwift, who started dating Kelce in the summer of 2023 and made her first Chiefs appearance that September, embraced the tight end on the field in the surreal scene.\n“I was so proud that you came down there to join me for that moment,” Kelce told Swift, who replied, “It was so magical, it was so fun, it’s crazy to get to see someone you love work that hard and have that kind of euphoric payoff where, you did it, underlined a hundred times …. I had such a great rookie year.”\nTwo weeks later, Swift joined Kelce on the field again at Allegiant Stadium in Las Vegas, where Kansas City defeated San Francisco in overtime, 25-22, to win Super Bowl 2024.\nBeyond Swift’s foray into football, the singer spoke at length Wednesday about her relationship with Kelce and her upcoming album, “The Life of a Showgirl,” which drops Oct. 3.\nThe Chiefs open the 2025 season on Sept. 5 against the Chargers in São Paulo, Brazil."
    }
  ],
  "argos_summary": "Owner Clark Hunt credits Taylor Swift’s relationship with Chiefs tight end Travis Kelce for boosting the team’s female fanbase to 57%, the highest in the NFL, and praised their partnership as an \"amazing couple.\" Swift discussed her surprise field‑walk experience during the Chiefs’ 2024 AFC Championship win on Kelce’s podcast, highlighting the media frenzy she encountered. In unrelated sports news, golf legend Gary Player criticized coaching that he believes has harmed Jordan Spieth’s career, while WWE star Logan Paul celebrated his wedding to model Nina Agdal in Italy. Actress Halle Berry responded to former husband David Justice’s remarks about their divorce with a light‑hearted Instagram post, noting her current relationship with musician Van Hunt and her plans to marry when the time feels right.",
  "argos_id": "BFWD7WL0A"
}