{
  "url": "https://financialpost.com/transportation/airlines/air-canada-risks-pyrrhic-victory-in-sending-flight-attendants-to-the-picket-lines-says-td-analyst?itm_source=airlines",
  "authorsByline": "gmvsuhanic@postmedia.com",
  "articleId": "964fe81438ee420f8ed75ec3820a117f",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/08/air-canada-gs0815.jpg",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-15T22:07:09+00:00",
  "addDate": "2025-08-15T22:14:31.889039+00:00",
  "refreshDate": "2025-08-15T22:14:31.889070+00:00",
  "score": 1.0,
  "title": "Air Canada risks 'pyrrhic victory' in sending flight attendants to the picket lines, says TD analyst",
  "description": "TD Cowen analyst says Air Canada should settle with flight attendants to 'secure labour peace' as investors grow frustrated. Keep reading.",
  "content": "It looks like the situation is becoming “acrimonious” so settling with flight attendants should be the priority to secure “labour peace,” Tom Fitzgerald said in a note.\n\nFlight attendants who work on the Air Canada and Air Canada Rouge airlines are set to hit the picket lines on the weekend after issuing a 72-hour strike notice on Wednesday. In anticipation of the looming deadline, the company began cancelling flights as preparation for grounding all flights unless the two parties can come to an agreement before the deadline.\n\nThe 10,000 flight attendants, who are represented by the Canadian Union of Public Employees, are seeking pay for work they do on the ground ahead of a flight taking off, among other issues.\n\nBreaking business news, incisive views, must-reads and market signals. Weekdays by 9 a.m.\n• There was an error, please provide a valid email address. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Posthaste will soon be in your inbox. We encountered an issue signing you up. Please try again\n\n“We appreciate management wanting to be judicious on costs and not offer more than necessary in a negotiation,” Fitzgerald said, adding that he thinks it would be better for airline executives to extend an “olive branch.”\n\nHe said that a 50 per cent or 100 per cent increase in boarding pay — currently that work is unpaid — and about a one percentage point rise in annual pay are worth it to “secure labour peace and happy front-facing employees” while also securing good public opinion.\n\nFitzgerald also said that the investors he has spoken with are starting to express “frustration” with management’s approach and see their strategy as “penny-wise but pound-foolish.”\n\nFor every day of the work stoppage, he said the company will lose $75 million in earnings before interest, taxes, depreciation and amortization (EBITDA), with a total hit of $300 million assuming the strike lasts three days and then operations restart two days later, something management has suggested.\n\n“Ultimately, we still view the business as very attractive and believe the company will be set up well in the years ahead if it can move past this volatile post-COVID period,” he said.",
  "medium": "Article",
  "links": [
    "https://financialpost.com/tag/air-canada/",
    "https://financialpost.com/subscribe",
    "https://financialpost.com/tag/canadian-union-of-public-employees/",
    "https://financialpost.com/video-centre/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Flight attendants",
      "weight": 0.099059
    },
    {
      "name": "flight attendants",
      "weight": 0.099059
    },
    {
      "name": "flights",
      "weight": 0.08393072
    },
    {
      "name": "annual pay",
      "weight": 0.06577256
    },
    {
      "name": "boarding pay",
      "weight": 0.06573257
    },
    {
      "name": "Breaking business news",
      "weight": 0.065486565
    },
    {
      "name": "Air Canada Rouge",
      "weight": 0.064470895
    },
    {
      "name": "labour peace",
      "weight": 0.06446046
    },
    {
      "name": "other issues",
      "weight": 0.06426078
    },
    {
      "name": "Tom Fitzgerald",
      "weight": 0.061420828
    }
  ],
  "topics": [
    {
      "name": "Airlines"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.91845703125
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.78515625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.7158203125
    },
    {
      "name": "/News/Other",
      "score": 0.60107421875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.53955078125
    }
  ],
  "sentiment": {
    "positive": 0.059155807,
    "negative": 0.7493733,
    "neutral": 0.19147082
  },
  "summary": "Air Canada's flight attendants, who work on the Air Canada and Air Canada Rouge airlines, have issued a 72-hour strike notice and are seeking pay for their work on ground preparation for the weekend. The company has begun cancelling flights in preparation for grounding all flights unless an agreement can be reached before the deadline. TD analyst Tom Fitzgerald believes settling with flight attendants should be the priority to secure \"labour peace\". He also suggested that a 50% or 100% increase in boarding pay and a one percentage point rise in annual pay could be worth it, while also securing good public opinion. For every day of the work stoppage, he estimates that the company will lose $75 million in earnings before interest, taxes, depreciation and amortization (EBITDA) for every day.",
  "shortSummary": "Air Canada faces a potential $75 million loss due to flight attendants on strike over unpaid work, prompting calls for strategic patience.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ada783a913d04683b400dc01f35e5096",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Air Canada and Air Canada Rouge flight attendants, represented by the Canadian Union of Public Employees, have issued a 72‑hour strike notice and are set to picket, prompting the airline to cancel flights in anticipation of a full grounding. The attendants demand pay for ground work before takeoff, a 50‑100% increase in boarding pay, and a one‑percentage‑point raise in annual wages. Management, led by Tom Fitzgerald, urges a conciliatory approach, warning that a three‑day strike could cost the airline $300 million in EBITDA and that investors are growing frustrated with the current strategy. Fitzgerald maintains that resolving the dispute will secure labor peace, improve public perception, and position the company well for future growth.",
  "argos_id": "BIZE9K01I"
}