{
  "url": "https://www.forbes.com/sites/joshweiss/2025/08/15/how-a-pokemon-parody-musical-is-cleverly-skewering-our-childhood-with-some-help-from-the-og-voice-of-professor-oak/",
  "authorsByline": "Josh Weiss",
  "articleId": "79c3102588f5407e959c67999195c8b4",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689cc2d1c9306e888e56bc81/0x0.jpg?format=jpg&crop=2772,1558,x0,y0,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T18:13:37+00:00",
  "addDate": "2025-08-15T18:20:22.429166+00:00",
  "refreshDate": "2025-08-15T18:20:22.429167+00:00",
  "score": 1.0,
  "title": "How A Pokemon Parody Musical Is Cleverly Skewering Our Childhood",
  "description": "Brandon Zelman and Harrison Bryan are taking the premise of Pokemon into uncharted territory!",
  "content": "Brandon Zelman and Harrison Bryan are grabbing life by the balls!\n\nMaybe I should back up for a second. Like most millennials, the creative partners grew up on a steady diet of Pokémon. From the video games, to the collectable trading cards, to the anime TV series, the wonderful world of Pocket Monsters was — and continues to be — a cornerstone of their respective identities.\n\n\"I’m a lifelong fan,” Zelman, who hosts a Pokémon-centric podcast, declares over Zoom. “And now we’re coming up on the 30th year. It’s so crazy to have been a fan of something for that long and for it to have been engaging the whole time.”\n\nMeanwhile, Bryan (creator of A Hanukkah Carol) recently attempted to beat the original Pokémon Blue with nothing but a roster of Meowths. Pretty hardcore.\n\nGiven the duo’s undying affection for the franchise, it only made sense for them to write — what else? — an immersive Pokémon parody musical! And given that Pokémon trainers catch and store their pugilistic creatures in nifty orbs that fit snugly on one’s belt, the project could only be named — what else? — BALLS: The Monster-Catchin’ Musical Comedy, which has enjoyed an extremely limited pop-up run throughout New York City these last few months.\n\n“We were sort of averse to the typical parody, things that are just a little too one-to-one for us,” Zelman explains. “So we set off with the intention of playing in this sandbox of a slightly existing world and then subverting it; restructuring it into our own sand castles to create an original story that was as much about our relationship to the video game and anime in the ‘90s as it was about the material itself.”\n\n“As we developed the piece, as we wrote it, as we created these songs and these scenes, we never lost sight of how excited our 10-year-old [selves] would be that we get to re-examine our childhood through this parody,” echoes Bryan, who also stars in the show as the antagonistic Warlordturtle.\n\nThat’s just one of 151 original “Collectabuddies\" — all of whom have their own “satiric game cards” and are safe from incurring the wrath of the notoriously litigious Nintendo, which owns stake in the Pokémon franchise — created for BALLS. “It’s really both a celebration and an evolution of the material,” Zelman affirms. “We managed to dance our way through where we never actually quite touch any trademarked material. It was an elegant dance around any of that kind of stuff. We're really, really proud of the material and the world that we created out of it.”\n\nThe resultant book and lyrics shine a hilarious spotlight on the dubious premise Pokémon presents: encouraging the player to capture wild animals and force them into combat. “There’s this suspension of disbelief when you’re playing it,” notes Zelman. “Obviously, we’re in this magical world, this is how it works. The monsters listen, you tell them what to do, you capture them, you fight them, and all of this is totally kosher. It’s the basis of this whole society.”\n\n“What does it mean to capture a wild monster and force it to be my friend and fight other monsters?” muses Bryan. “These are the ethical and kind of hilarious questions we now get to explore in our 30s when, at 10-years-old, we were just begging for more and never asking.\"\n\nAnother question they both had: “What if the non-playable character becomes the hero?” To that end, BALLS imagines a reality where the kindly Professor NPC who offers you a choice of three starter monsters is actually the one who created both the technology and normalized culture of trapping living things in spherical prisons. This plan to make the world safe by rebranding wild animals into “Collectabuddies” eventually blows up in The Professor’s face like a self-destructing Electrode and sparks an adventure that also ropes in the man’s “piece of sh** — aka The Rival (Teresa Attridge dialing the insufferable Gary Oak archetype up to eleven).\n\n“The major relationship in the show is between an older generation and a younger generation fighting over what’s right about this world,” explains Bryan, who doesn’t “see a ton of parody musicals” with messages about defying limitations (both personal and societal) and the critical need for environmental conservation. “We’ve been in contact and partnership with the New York Marine Rescue Center, and some of our our proceeds have gone to helping these turtles get rehabilitated and returned to the wild. We’ve even adopted a turtle.”\n\nHe later continues: “We have embraced the interactivity of the raw material and [the fact] that this show is not just a theater experience. This show is also a game. It is also a cartoon … It’s very rare to experience both a non-scripted narrative and a very precise, timed-out musical to a track. We are so ambitious in how we tell this story that I think traditional theatergoers will be like, ‘Wow, look at these theatrical conceptions!’ And non-theater goers are going into this and saying, ‘Wow, what a party!’\"\n\nTo raise money for the multimedia production that involves everything from puppets to video segments, the creators turned to Kickstarter, ultimately netting just over $36,000 out of a $30,000 goal and becoming one of the crowdfunding site’s “Projects We Love.”\n\nFor the music, Zelman and Bryan called on composers like Lena Gabrielle (Emojiland), Pippa Cleary (The Great British Bake Off Musical), Joriah Kwamé (Little Miss Perfect), Aaron Kenny (The Little Mermaid), and Grace Yurchuk (Caesar: The Musical), Allan Nalven (\"LSDJ\"), and Matthew Ryan Hunter (NBC) for something in the vein of the \"SpongeBob musical where you have a lot of different musical artists lending their voices to give that sort of eclectic feel,\" Zelman says.\n\nAllan Nalven even went so far as to compose music inside an actual GameBoy console “to create the most authentic music and sound effects that you could achieve,” Zelman adds. And while the show is very much a satire, it never forgets to pay homage to the fandom that led to its existence in the first place. “We were dedicated to making sure the lyrics were dense with Easter eggs. So you could go back, revisit it, and be like, ‘Oh, that’s a reference to that very, very niche memory I have of this very, very peculiar aspect of this thing that was buried in the back recesses of my brain!’”\n\n“It’s important to us that we’re celebrating it while we’re lampooning it,” agrees Bryan. \"I think it’s fair to say that in many respects, it shaped so much of our social interactions and friendships. That’s really important to celebrate while lampooning.\"\n\nThe creators also sought input from individuals who aren’t die-hard Pokémon fans as a way to combat any rose-colored missteps. “If they didn’t love the story and characters, they wouldn’t be as on board as they are now with this adventure,” Bryan explains. “So I think working outside of our own fandom actually proved tremendous in the creative process.”\n\nAbout a month before BALLS was set to debut its first performance, however, the actor playing the Professor dropped out, leaving the entire production in the lurch. With nothing to lose, Zelman and Bryan made a Hail Mary offer to Stuart Zagnit, OG voice of Professor Oak in the English dub of the Pokémon anime series, never thinking he’d actually accept.\n\n“It is a very strange merging of the things that are probably the most important to me,” Zagnit, a veteran of the musical theater scene, says of the meta casting. “Having been involved with Pokémon for the first 10 years of its existence is something I’m very proud of, but I kind of put it in a different side of my life and career. It wasn’t until the anime convention world really emerged that I re-embraced it. So now, to have a vehicle that actually blends both sides of my professional performing career, is kind of like a dream that I never imagined would be realized.”\n\nOne thing’s for certain: this ain’t the kindly Professor of you remember, with BALLS taking Zagnit to “places I have never gone before,” he says. “People get to hear me say really off color-things that I would never have said [in the anime]. It’s kind of fun to let go and be in that persona, but also be breaking out of the persona at the same time.”\n\nZelman adds that a lot of the \"crude, rude, and lewd stuff” contained within the show isn’t just for shock value. \"It’s all there because when you’re a little kid and you have the power to name your character, you might just go ahead and call them ‘Butthead,’” he notes. “That might be an act of rebellion, [but] you walk around and you get a laugh every single time. We’re trying to really lock into that youthful feeling of picking up a game and entering this world that’s familiar, but different every time.”\n\nBecause of the pop-up rollout, there have only been about a week’s worth of BALLS performances across a period of fourth months, according to Zagnit’s estimate (those wishing to check it out can follow the official Instagram for regular announcements).\n\nBut if the team has its way, this smattering of shows is the start of something much bigger, “the beginning of a movement,\" Bryan says.\n\n“I think what we’re creating here is really special, and there’s a huge community for it in New York and around the world. There is a renaissance of independent theater-making Off-Broadway that is proving to be a more sustainable model than the large, corporate worlds of the Broadway theaters. If we can help pave a way for more theater makers who are game to think outside the box and include audiences of larger accessibilities, then that would be a very noble endeavor for BALLS.”\n\n“We’ve got all kinds of dreams,” Zelman finishes. “As we continue to grow and reach our audience, we’re really trying to find ways to touch people who maybe aren’t so familiar with theater, but are familiar with our inspiration. So we want to go to conventions. We want to take it out on the road and meet people where they are … I want to be at trading card shows. I want to have ‘BALLS Fest.’ I’m hungry for it. I want people to meet our monsters, see our show, and celebrate with us.\"\n\nZagnit closes out the discussion by appealing to potential investors, who have a unique opportunity “to get in on the ground floor\" of a project with plenty of room to — dare I say it? — evolve. “There’s a big audience out there that just wants to go and have a good time,\" he concludes. \"And we certainly give them a good time.”\n\nThe musical will enjoy a panel at this year’s edition of New York Comic Con with the Q&A discussion moderated by none other than Veronica Taylor, the original voice of Ash Ketchum. More details can be found here!",
  "medium": "Article",
  "links": [
    "https://www.wtpokemon.com/",
    "https://www.instagram.com/ballsmusical/?hl=en",
    "https://www.roundhousetheatre.org/on-stage/explore/a-hanukkah-carol/",
    "https://www.harrisonbryan.com/",
    "https://www.instagram.com/stuzagnit/?hl=en",
    "https://www.ballsmusical.com/",
    "https://www.newyorkcomiccon.com/en-us/things-to-do/panels/panel-information.html?gtID=904022&panel-name=The-Voices-of-Ash-Ketchum-and-amp-Professor-Oak-BATTLE-with-BALLS-The-Monster-Catchin-Com%C3%A9dy",
    "https://www.kickstarter.com/projects/ballsmusical/balls-the-monster-catchin-musical-comedy",
    "https://ucbcomedy.com/people/brandon-zelman/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Pokémon",
      "weight": 0.051356263
    },
    {
      "name": "Pokémon trainers",
      "weight": 0.051302124
    },
    {
      "name": "Zelman",
      "weight": 0.048247527
    },
    {
      "name": "trading card shows",
      "weight": 0.04809667
    },
    {
      "name": "Brandon Zelman",
      "weight": 0.047450364
    },
    {
      "name": "Harrison Bryan",
      "weight": 0.04681302
    },
    {
      "name": "Bryan",
      "weight": 0.046386078
    },
    {
      "name": "BALLS performances",
      "weight": 0.04596844
    },
    {
      "name": "New York",
      "weight": 0.045227643
    },
    {
      "name": "New York City",
      "weight": 0.044704657
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.459228515625
    },
    {
      "name": "/Arts & Entertainment/Comics & Animation/Anime & Manga",
      "score": 0.38671875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.381591796875
    },
    {
      "name": "/Arts & Entertainment/Movies/Animated Films",
      "score": 0.32080078125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.313232421875
    }
  ],
  "sentiment": {
    "positive": 0.19197115,
    "negative": 0.40934047,
    "neutral": 0.39868838
  },
  "summary": "Brandon Zelman and Harrison Bryan, two creative partners, have created an immersive Pokémon parody musical, BALLS: The Monster-Catchin’ Musical Comedy. The project, named after the iconic world of Pokémon, explores the role of the game and its creators to create an original story that reflects their personal relationship to the game. The musical, which has had a limited pop-up run in New York City, includes 151 original “collectabuddies” all of whom are safe from incurring the wrath of Nintendo, which owns a stake in the Pokémon franchise. The show is set to be performed by a younger generation and reflects a shift in societal attitudes towards the older generation.",
  "shortSummary": "Brandon Zelman and Harrison Bryan's Pokémon parody musical BALLS deconstructs the genre, exploring human evolution and social evolution through engaging, context-rich performances.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f955d4163148479bb72e4948f85dc3ca",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.roundhousetheatre.org/on-stage/explore/a-hanukkah-carol/",
      "text": "A HANUKKAH CAROL\nor GELT TRIP! THE MUSICAL\n< Back To What's OnMusic by Aaron Kenny\nLyrics by Rob Berliner\nBook by Harrison Bryan & Rob Berliner\nOriginal Concept by Harrison Bryan\nDirected and Choreographed by Marlo Hunter\nNovember 20 - December 29, 2024 | World Premiere\nMisanthropic millennial influencer Chava Kanipshin’s internet followers are turning into haters. Desperate to regain her popularity, Chava shuns anything and anyone she sees as an obstacle, including her family, friends, and holiday traditions. But on the first night of Hanukkah, Chava is visited by the ghost of deceased social media star Mimi Marley and other spirits who warn her to change her ways—or be cursed forever. The spirits lead Chava on a madcap journey through Hanukkahs past, present, and future to help her reconnect with her spirit of generosity, her Jewish identity, and an appreciation of her real-life supporters. Winner of the Audience Favorite Award at the Broadway Shark Tank, A Hanukkah Carol is a heartfelt, family-friendly riff on a holiday classic that celebrates making the world a kinder place.\nA Hanukkah Carol is produced by special arrangement with Daryl Roth, Jim Kierstead, and Feelin' Gelty.\nThank you to our sponsors:\nLead Sponsors: David & Sherry Smith and The GPS Fund\nSponsors: Bonnie & Alan Hammerschlag and Martha Newman & Brian Sutton\nPegaschvitz Sponsors: Ellen & Jon Bortz\nAdditional Support from Nan Beckley and Gil & Rona Eisner\nThe 2024-2025 Season is sponsored by Linda J. Ravdin and Don Shapero.\nAdditional content about A Hanukkah Carol, including dramaturgy and program notes, can be found in our ONLINE PROGRAM."
    }
  ],
  "argos_summary": "Brandon Zelman and Harrison Bryan created the Pokémon parody musical BALLS: The Monster‑Catchin’ Musical Comedy, a satirical take on the franchise that explores themes of childhood nostalgia, ethics of capturing creatures, and generational conflict. The show features original characters called Collectabuddies, a mix of puppetry, video, and eclectic music from various composers, and was funded via Kickstarter with $36,000 raised. The production has run a limited pop‑up series in New York City, cast a former Pokémon voice actor as the Professor, and plans to expand to conventions and a potential festival. The article also briefly mentions Bryan’s other musical, A Hanukkah Carol, a family‑friendly holiday satire that won an audience award and is slated for a 2024‑2025 premiere.",
  "argos_id": "C58OEBLKK"
}