{
  "url": "https://lifehacker.com/tech/youtube-music-adds-trim-silence",
  "authorsByline": "Jake Peterson",
  "articleId": "8af0f210e23349b28fb17f663094a427",
  "source": {
    "domain": "lifehacker.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://lifehacker.com/imagery/articles/01K2QKS50FKG1DMSKYD2ZF1BFF/hero-image.fill.size_1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T20:30:00+00:00",
  "addDate": "2025-08-15T20:37:31.663208+00:00",
  "refreshDate": "2025-08-15T20:37:31.663210+00:00",
  "score": 1.0,
  "title": "YouTube Music Finally Added a Long-Missing Google Podcasts Feature",
  "description": "YouTube Music is adding a trim silence feature for the first time, which was originally present in Google Podcasts.",
  "content": "There are a lot of podcast apps out there, but the easiest one to use is the one that comes built into your phone. For Android users, that was Google Podcasts—that is, until last year, when Google killed off its flagship podcast app. Again, you have your choice among alternatives, but if you go with Google's choice, you might've found your way to YouTube Music.\n\nLike Spotify, Google's music app offers podcast support—though it's a bit more limited. If you're used to the polish and feature set of a dedicated podcast app (or, frankly, even Spotify), YouTube Music might be a tough adjustment. There are signs that things are changing, however. Google hasn't totally abandoned progress for the podcast side of YouTube Music. In fact, it's bringing a feature that was lost in the transition from Google Podcasts.\n\nWhen Google invited users to move over to YouTube Music, it forgot a key Google Podcast feature: \"trim silence.\" The idea behind the feature is to automatically remove any segments of silence or dead air,so you're only ever listening to the show. Trim silence definitely runs the risk of ruining any intentional suspense created by podcast makers, but it also makes episodes that we watch on 1.5x, 2x, or even 3x even faster. If your goal is to listen to as many podcasts as possible and to cut out any and all extra moments, trim silence is your friend—and you're likely missing it if you use YouTube Music.\n\nThat is now changing: As reported by Android Authority, Google is rolling out a trim silence option in the YouTube Music app. The feature was first spotted by this Redditor, but I can confirm the option is now in my YouTube Music app as well. It's a long time coming: 9to5Google spotted trim silence in YouTube Music's code back in March of 2024, though it never materialized in an app update. Nearly a year and a half later, it's here.\n\nHow to use trim silence in YouTube Music\n\nIt's not clear at this time whether the feature is being added server-side or via a software update. To be safe, make sure you're running the latest version of YouTube Music. I'm also only currently seeing the feature in the Android version of YouTube Music, so iOS users may need to wait.\n\nNext, start a podcast, then tap the playback speed option to the left of the playback controls. Here, you should see the \"Trim silence\" option: Just tap it, or the toggle, to turn it on.",
  "medium": "Article",
  "links": [
    "https://blog.youtube/news-and-events/podcast-destination-on-youtube-music/",
    "https://www.reddit.com/r/YoutubeMusic/comments/1mr0d7r/trim_silence_on_podcasta/",
    "https://lifehacker.com/best-podcast-apps",
    "https://www.androidauthority.com/youtube-music-trim-silence-2-3588028/",
    "https://lifehacker.com/entertainment/which-is-better-spotify-vs-youtube-music",
    "https://9to5google.com/2024/03/13/youtube-music-trim-silence-prep/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "YouTube Music",
      "weight": 0.14142261
    },
    {
      "name": "podcast apps",
      "weight": 0.11939835
    },
    {
      "name": "YouTube",
      "weight": 0.10907338
    },
    {
      "name": "Trim silence",
      "weight": 0.107994325
    },
    {
      "name": "trim silence",
      "weight": 0.107994325
    },
    {
      "name": "podcast makers",
      "weight": 0.10343811
    },
    {
      "name": "Google Podcasts",
      "weight": 0.10241605
    },
    {
      "name": "podcast support",
      "weight": 0.10195741
    },
    {
      "name": "Google Podcast",
      "weight": 0.097738035
    },
    {
      "name": "Google",
      "weight": 0.09595517
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.65283203125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.31494140625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.31103515625
    }
  ],
  "sentiment": {
    "positive": 0.10295919,
    "negative": 0.45717,
    "neutral": 0.43987083
  },
  "summary": "Google has added a new feature to its YouTube Music app, allowing users to remove any segments of silence or dead air from podcasts, a feature that was lost during the transition from Google Podcasts. The feature was first spotted by a Redditor and is now being implemented in the YouTube Music App. This move follows a long wait for a feature previously spotted in the app's code by 9to5Google. It is unclear whether this feature is server-side or via a software update.",
  "shortSummary": "Google has added trim silence to YouTube Music, replacing Google Podcasts with a feature that was previously missing, allowing users to seamlessly play podcasts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "60513ff956cb435cb63bed3d93f9f303",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://9to5google.com/2024/03/13/youtube-music-trim-silence-prep/",
      "text": "As Google Podcasts fades away, YouTube Music is bolstering its podcasts offering as a new update prepares to add a “Trim Silence” option.\nAbout APK Insight: In this “APK Insight” post, we’ve decompiled the latest version of an application that Google uploaded to the Play Store. When we decompile these files (called APKs, in the case of Android apps), we’re able to see various lines of code within that hint at possible future features. Keep in mind that Google may or may not ever ship these features, and our interpretation of what they are may be imperfect. We’ll try to enable those that are closer to being finished, however, to show you how they’ll look in the case that they do ship. With that in mind, read on.\nYouTube Music wasn’t designed from day one to be a podcasting app, but Google has been building out the functionality fairly quickly over the past year or so, adding needed features like adding podcasts via RSS and automatic downloads for new episodes. But, still, as our Abner Li brought out recently, it’s still missing a lot of podcast features, and all while the clock is ticking on Google Podcasts.\nIn the latest version of YouTube Music, v6.43.52, Google has set the foundation for support for a “Trim Silence” feature.\nThis feature, which is available in Google Podcasts and many other podcast apps, can find stretches of silence in a podcast and automatically skip past that, resulting in a slightly shorter runtime. We found the following strings in the latest update:\n<string name=”trim_silence_label”>Trim silence</string>\n<string name=”trim_silence_description”>Skip stretches of silence during episodes</string>\nUnfortunately, the functionality isn’t currently live in YouTube Music. Likely, it’s either waiting on a server-side component or another future app update. Either way, it’s good to see this is on its way.\nMore on YouTube Music:\n- Here’s how to export your subscriptions from Google Podcasts before it shuts down\n- Give Whimsy Back to YouTube Music\n- YouTube Music redesigns web player to match Now Playing on Android\nFollow Ben: Twitter/X, Threads, Bluesky, and Instagram\nThanks to JEB Decompiler, from which some APK Insight teardowns benefit.\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://www.androidauthority.com/youtube-music-trim-silence-2-3588028/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nYouTube Music just got a new podcast superpower that's been a long time coming\n4 hours ago\n- Google Podcasts used to offer the ability to remove gaps of silence from podcasts.\n- When Podcasts was retired, YouTube Music did not offer a similar tool.\n- Work on a “trim silence” option for YouTube Music was spotted last year, and the feature is finally available now.\nProgress is supposed to mean improvement, right? While we’re no strangers to seeing Google transform one app into another, merging features in the process, it’s extremely frustrating when we lose some functionality along the way. Something along those lines happened when we lost Google Podcasts and users were pushed over to YouTube Music, but we’re happy to say the situation has finally righted itself.\nWe’re talking specifically about the ability to for podcast apps to automatically remove any lengthy periods of silence. Ideally, producers would edit those out prior to publishing their podcasts, but we have to live with the reality we have, and it ended up being a useful option to have. Google Podcasts picked up that tool all the way back in 2018, but we haven’t had a similar ability for YouTube Music.\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more.\nLast year, though, it started to look like that was changing. Back in March of 2024, evidence was spotted in an APK teardown that revealed work towards a new “trim silence” option for YouTube Music. We were hopeful that would be going live shortly, but months passed and we never saw it arrive.\nHere in the summer of 2025, we nearly forgot YouTube Music was even working on this tool, but then over on the YouTube Reddit sub, user Timely-Junket-2851 shared that they had spotted the option showing up at the bottom of their playback speed controls.\nSure enough, we’ve confirmed it’s here on our own devices. After uninstalling updates and walking things back through recent releases, we can see that Google finally delivered the feature sometime over the course of the past month.\nHas it been too long coming? Absolutely. Should Google have done a little more work to make sure YouTube Music was just as full-featured as Google Podcasts before shutting that down? You won’t find any argument here. But despite a few lingering frustrations, we’re mainly just happy to finally see this new ability land.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://lifehacker.com/best-podcast-apps",
      "text": "Google shut down Google Podcasts on April 2, 2024, adding the app to the pile of dead Google services, and leaving many Android users without their podcatcher of choice. And iOS users don't have it much better. While Apple Podcasts has improved a bit of late, particularly with the launch of automatic transcripts in iOS 17.4, it has never really recovered from the disastrous overhaul it got back in 2021.\nThankfully, podcasts are still hugely popular, and, there are more top-tier podcast managers on Android and iOS than ever before. Keep reading to discover your best option to manage podcasts on your mobile devices—and consider a few backup suggestions if you're seeking a more novel podcast app experience.\nPocket Casts is the podcast app to beat\nPlatforms: Free on iOS and Android; Plus Subscription ($40/year) or Premium Subscription ($100/year) on iOS, Apple Watch, Android, Mac, Windows, and the web.\nPocket Casts brings together almost every useful feature found across pretty much every other podcast manager out there, plus plenty that are unique. The app also delivers them via a slick interface that’s easy to use—and best of all, it’s free (though paying for a membership does get you some extra perks).\nA few of the standout features include audio enhancement options: The built-in “volume boost” makes it easier to hear people’s voices while reducing background music or noise; “trim silences” cuts out long pauses; and you can adjust the playback speed anywhere from 0.5x to 3x (and doing so does not affect voice pitch).\nPocket Casts users can sync their subscriptions and playback position across multiple devices, and the app features robust options for finding new podcasts (including the ability to search by episode), so you can find all the podcasts that have talked about a specific topic, and view your listening history. You can also play third-party media files stored on your device and set sleep timers that will pause your podcast when you’re listening before bed.\nWhile the free version is packed with features, it isn’t perfect. For instance, the playlist and filter options could be more robust. You can queue up a playlist on a whim, or filter your podcast subscriptions and list of downloaded episodes using a small selection of preset categories, but you cannot sort your subscriptions by topic or create your own self-updating playlists. Given how many features Pocket Casts packs in, it seems odd that it lacks this kind of customization.\nDespite that nagging issue, I like how Pocket Casts looks and feels. Not only does the app cover all the basics, but it also has a few customizable gesture options (such as setting a left-swipe to archive episodes), and even a dark theme.\nThe free version of Pocket Casts is available on Android and iOS and includes all of the features I’ve discussed thus far, but there’s also a premium Pocket Casts Plus option if you want access to more features and wider device support. For $40 annually, Plus subscribers get access to the Mac, Windows, web, and standalone Apple Watch versions of Pocket Casts, plus 20GBs of cloud storage that can be accessed across all your connected devices. If you really love the app, you can also sign up for a Patron membership ($100/year) that ups your cloud storage and gives you early access to new features.\nThe best of the rest\nWhile PocketCasts remains my go-to recommendation for both Android and iOS, I've curated a handful of alternatives that deserve recognition for their reliability and features in case PocketCasts doesn't suit your needs. I've included both Android and iOS apps, though some are only available on one platform.\nProcast (Android/iOS)\nProcast is a great choice if you like to tweet or share your thoughts about your favorite shows. A built-in clip feature lets you snip a bit of a podcast to supplement a tweet or text. It also has a neat “swipe to your inbox” feature that lets you add episodes to your queue with a simple swipe. Procast is a solid choice for iOS and Android users.\nOvercast (iOS)\nOvercast is an iOS-exclusive app packing tons of features, including support for Apple Watch. You get playback controls like adjustable playback speeds, audio boost, and automatic silence trimming, and the app automatically holds your place when you stop listening partway through. Overcast also lets you create custom playlists in a couple of taps or listen to every podcast you’ve downloaded in a continuous stream. There are also welcome quality-of-life options like the ability to add Siri Shortcuts and customize your headphone, remote, and car dashboard controls. The main downsides are its meager discoverability for new shows, and the free version is ad-supported, but you can pay $10/year to remove them and unlock other features like side-loading audio files saved on your iPhone. You can download Overcast on the iOS App Store.\nPodcast Addict (Android)\nPodcast Addict is a free Android app packed with handy features like customizable playlists and adjusting unique listening settings per podcast. You can also tag your favorite shows with listening priority and even rate and review series in the app, much like you can with Apple Podcasts. Along with the millions of podcasts available in the app, Podcast Addict also features over 120,000 radio stations and over 20,000 audiobooks. It also supports Android Auto and Chromecast. The free version displays ads (just a simple banner ad across certain screens), while the premium version costs $.99 per month or $9.99 per year, and grants extra features like a playlist widget and additional app themes. You can download Podcast Addict on the Google Play Store."
    }
  ],
  "argos_summary": "Google Podcasts was discontinued in April 2024, prompting users to migrate to YouTube Music, which has now added a long‑awaited “Trim silence” feature that automatically skips gaps in podcast episodes. The option appears in the Android version of YouTube Music under playback speed controls and is expected to roll out to iOS soon. While YouTube Music continues to grow its podcast functionality, the article also highlights other popular podcast managers such as Pocket Casts, Overcast, Procast, and Podcast Addict, noting their key features and subscription options. Overall, the update restores a useful tool lost during the transition and offers alternatives for users seeking robust podcast apps. ",
  "argos_id": "D4L7604P3"
}