{
  "url": "https://www.morningstar.com/news/marketwatch/20250815213/how-improving-the-lives-of-black-seniors-will-help-all-older-adults",
  "authorsByline": "",
  "articleId": "1202a0c9ac3c489790bb1018cb77c9c3",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T13:28:00-05:00",
  "addDate": "2025-08-15T18:42:07.399291+00:00",
  "refreshDate": "2025-08-15T18:42:07.399292+00:00",
  "score": 1.0,
  "title": "How improving the lives of Black seniors will help all older adults",
  "description": "",
  "content": "Older Black adults face more health and wealth struggles than their peers, a new book says\n\nThe U.S. population of older Black adults is projected to reach 7.5 million by 2030, up from 4.9 million in 2019.\n\nIn his new book, \"Aging While Black: A Radical Reimagining of Aging and Race in America,\" Raymond Jetson, a former state lawmaker and health department official from Louisiana, says the United States can't afford to ignore the problems of older Black Americans.\n\n\"It's part of America's story. How Black people age in America ultimately impacts how well America ages,\" Jetson said in an interview with MarketWatch. \"When a community or government opens the door for Black people, it opens the door for communities far beyond Black people. Something as fundamental as the civil rights laws that were passed in the '60s - largely in the interest of Black people at the time - have benefited many other communities.\"\n\nJetson's book arrives as the population of older Black people in the U.S. is projected to reach 7.5 million by 2030, up from 4.9 million in 2019, according to a 2020 report from the Administration for Community Living, which is part of the U.S. Department of Health and Human Services.\n\nRead: Agency for older adults and people with disabilities to be shuttered under HHS cuts\n\n\"Often we talk about aging as a universally shared experience, but that is not the case for aging Black people in the country,\" Jetson said. \"The experience of aging Black people in this country is rooted in the lives they have lived and the issues they faced - their lived environment, lack of public transportation, lack of access to healthcare and financial services. If this is your community of origin, you begin life at a disadvantage, and it compounds over time.\"\n\nOlder Black Americans have shorter life expectancies than their peers of other races, as well as increased risk of chronic conditions such as diabetes, dementia, stroke, cancer and hypertension, Jetson wrote in his book. Black women are 40% more likely to die of breast cancer than white women, for example.\n\nWhen it comes to wealth, Black Americans also lag behind every other group, Jetson said: They make up 13% of the U.S. population but possess only 2% of the nation's wealth.\n\nAnd while older Black adults make up 9% of the older adult population, they represent 21% of older adults living below the federal poverty level. Meanwhile, the median wealth of Black families is less than 15% of that of white families, according to the book.\n\nJetson, 69, has served as a state legislator, a nonprofit executive and a pastor, but he said this new chapter of his life as an author and an advocate may be his most ambitious yet.\n\nHis plan, he said, is built on three pillars that involve strengthening and changing community networks to meet the realities of aging; embracing innovation by using and mastering technology; and leaning into the philosophy known as Sankofa, or honoring the African principle of learning from the past to create a better future.\n\n\"We need to mobilize businesses, congregations and social organizations and embolden them to challenge the social systems,\" Jetson said, adding, \"Reflection is not enough. What actions can I take locally?\"\n\nJetson said his call for action is both more important and more difficult in the current political climate.\n\n\"It's not exactly the best environment to have the conversation. But that's part of the purpose of the book. It's to wave respectfully and say, 'We have these differences,'\" Jetson said.\n\n\"There's an intentionality to undermine,\" he said of the current political climate. \"Not a dismantling, because dismantling assumes it could be put back together. So what we are seeing is a destruction of the systems and structures that supported the aging community broadly but have an exacerbating impact on aging Black people.\"\n\nSomething as seemingly small as President Donald Trump's executive order to eliminate paper checks for Social Security benefits and tax refunds has a profound impact on older adults and especially Black people, Jetson said.\n\nRead: Social Security will stop sending paper checks soon. How to make sure you still get your benefits on time.\n\n\"When you consider an 83-year-old woman who is Black and not technologically savvy and happens to live in a neighborhood with no banking that is accessible to her - what are the implications of that?\" he said.\n\n\"And when you multiply that and look at the apparatus that supports older people like the Older Americans Act or the Administration for Community Living, it has a real and direct impact on people. There's also a rising tide of rhetoric and mean-spiritedness that surrounds it that's also problematic,\" Jetson said.\n\nThe Older Americans Act, which helped provide nutritional support, in-home assistance, transportation, legal aid and caregiver support, has yet to be re-funded. Meanwhile, the Administration for Community Living, which helped older adults and those with disabilities, has been defunded.\n\n\"The fractured structures that we see, the brokenness and the breaking of structures, will only exacerbate the vulnerabilities people face,\" Jetson said. \"Aging while Black in America is filled with complexity. It requires a rethinking or reimagining of what's possible. I don't believe tweaks around the margins are going to change what we see happening.\"\n\nThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "older Black people",
      "weight": 0.10875172
    },
    {
      "name": "aging Black people",
      "weight": 0.10418618
    },
    {
      "name": "Black people",
      "weight": 0.10059857
    },
    {
      "name": "Older Black adults",
      "weight": 0.10032343
    },
    {
      "name": "older Black adults",
      "weight": 0.10032343
    },
    {
      "name": "older Black Americans",
      "weight": 0.09817347
    },
    {
      "name": "older people",
      "weight": 0.09119966
    },
    {
      "name": "Black Americans",
      "weight": 0.08675144
    },
    {
      "name": "Black women",
      "weight": 0.082768306
    },
    {
      "name": "Black",
      "weight": 0.08007621
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Other",
      "score": 0.89599609375
    }
  ],
  "sentiment": {
    "positive": 0.17498526,
    "negative": 0.4733424,
    "neutral": 0.35167235
  },
  "summary": "Aging While Black: A Radical Reimagining of Aging and Race in America, by Raymond Jetson, a former state lawmaker and health department official from Louisiana, has released a book about the health and wealth struggles of older Black adults in the U.S. The population of older black adults is expected to reach 7.5 million by 2030, up from 4.9 million in 2019, according to a 2020 report from the Administration for Community Living. Jetson argues that how Black people age in America ultimately impacts how well America ages. He also notes that the civil rights laws that were passed in the '60s have benefited other communities beyond Black people. His plan involves strengthening and changing community networks to meet the realities of aging, embracing innovation by using technology and embracing Sankofa, or honoring the African principle of learning from the past to create a better future.",
  "shortSummary": "Raymond Jetson's new book, \"Aging While Black\" addresses disparities between older Black adults and their health and wealth, emphasizing the need to address these disparities in America's aging population.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b8c8aed21f434efa89fc68ffc9f5d6e8",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Raymond Jetson’s new book, \"Aging While Black,\" argues that older Black adults face disproportionate health and wealth challenges—shorter life expectancy, higher chronic disease rates, and a median wealth far below that of white families—while the U.S. population of older Black adults is set to rise to 7.5 million by 2030. Jetson links these disparities to systemic barriers such as limited transportation, healthcare access, and financial services, and urges a three‑pillar strategy of community network strengthening, technology adoption, and the Sankofa principle to reshape aging policy. The book also critiques recent policy cuts, including the defunding of the Older Americans Act and Administration for Community Living, and the elimination of paper Social Security checks, which disproportionately harm older Black adults who may lack digital literacy or banking access. His call for action stresses that incremental changes are insufficient and that a broader, more inclusive approach to aging is essential for all Americans.",
  "argos_id": "EKNHJSD7R"
}