{
  "url": "https://nypost.com/2025/08/15/business/winklevoss-twins-reveal-more-details-in-gemini-ipo-filing/",
  "authorsByline": "Reuters",
  "articleId": "c4af3860ea0d4d78a8de668272ba8e50",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/winklevoss-twins-gemini-ipo.jpg?quality=75&strip=all&1755283703&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T23:43:57+00:00",
  "addDate": "2025-08-15T23:46:10.400045+00:00",
  "refreshDate": "2025-08-15T23:46:10.400046+00:00",
  "score": 1.0,
  "title": "Winklevoss twins reveal more details in Gemini IPO filing as crypto-friendly Trump boosts investor demand",
  "description": "Gemini’s revenue fell and losses widened in the first half of 2025, the cryptocurrency exchange said in a US IPO filing, joining a wave of digital-asset firms seeking to tap public markets.",
  "content": "Gemini’s revenue fell and losses widened in the first half of 2025, the cryptocurrency exchange said in a US IPO filing, joining a wave of digital-asset firms seeking to tap public markets.\n\nTerms of the offering were not disclosed in the filing, made public on Friday.\n\nThe company reported a net loss of $282.5 million on a total revenue of $68.6 million in the six months ended June 30, compared with a net loss of $41.4 million on a revenue of $74.3 million year earlier.\n\nUS IPO activity has rebounded in recent months following a slowdown earlier this year caused by uncertainty over trade policy changes, with several new listings drawing strong investor demand.\n\nDigital asset companies have also featured prominently in the IPO market in recent months, including blockbuster debuts from stablecoin issuer Circle and cryptocurrency exchange Bullish.\n\nBullish’s debut on Wednesday made it the second listed cryptocurrency exchange in the country after Coinbase Global. Gemini will become the third public crypto exchange once it goes public.\n\n“The question for investors regarding Gemini revolves around the business mix and moat of trading versus custody, how they differentiate on trust and growth, and what they do that Coinbase can’t copy by Tuesday,” said Michael Ashley Schulman, partner and CIO at Running Point Capital.\n\nGemini said it will use IPO proceeds for general corporate purposes and to repay all or part of its third-party debt.\n\nThe exchange also supports stablecoins on its platform, a segment that has drawn attention following last month’s signing of the GENIUS Act, a new US law establishing a regulatory framework for stablecoins.\n\nGemini issues the Gemini Dollar (GUSD), a stablecoin pegged 1:1 to the US dollar.\n\nThe company, which also supports more than 70 cryptocurrencies and operates in over 60 countries, confidentially filed for an IPO in June.\n\nGemini, which was founded in 2014 by billionaire twins Tyler and Cameron Winklevoss, plans to list on Nasdaq under the ticker symbol “GEMI.” Goldman Sachs and Citigroup are acting as lead bookrunners.\n\nThe Winklevoss twins rose to prominence after suing Facebook, and its CEO Mark Zuckerberg, alleging he stole their idea for the social network. They settled in 2008 for cash and Facebook stock.\n\nRegulatory clarity under the Trump administration, rising institutional adoption, and increasing ETF inflows have bolstered investor confidence and helped integrate crypto into mainstream finance.\n\nIn a watershed moment for the industry, Coinbase became the first blockchain-focused company to join the S&P 500 earlier this year. Block, which facilitates bitcoin purchases, joined the index in July.\n\nThe shift marks a turnaround for an industry that spent more than a decade under heavy regulatory scrutiny worldwide.\n\n“We’ve seen a shift from speculation to sustainability. Institutional investors are looking for proof points – real clients, regulated products, and long-term market alignment. This is how the sector matures, and it will likely set the stage for other crypto firms keen to list their shares,” said Nick Jones, founder of crypto firm Zumo.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/14/business/kelloggs-becomes-first-company-to-sign-legally-binding-agreement-removing-toxic-dyes-from-cereals/",
    "https://nypost.com/2025/08/15/business/atampt-customers-can-receive-up-to-7500-in-17m-data-breach-settlement-heres-how-to-claim/",
    "https://nypost.com/2025/07/18/business/crypto-market-cap-surges-past-4-trillion-on-landmark-genius-act-law/",
    "https://nypost.com/2025/08/15/business/american-eagle-almost-paralyzed-by-body-positivity-before-it-launched-sultry-sydney-sweeney-ads/",
    "https://nypost.com/2025/06/06/business/winklevoss-twins-gemini-crypto-exchange-files-for-ipo/",
    "https://nypost.com/2025/06/05/business/crypto-giant-circles-shares-spike-123-in-strong-nyse-debut/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gemini IPO filing",
      "weight": 0.08901058
    },
    {
      "name": "US IPO activity",
      "weight": 0.07656573
    },
    {
      "name": "other crypto firms",
      "weight": 0.06903559
    },
    {
      "name": "IPO proceeds",
      "weight": 0.06754644
    },
    {
      "name": "cryptocurrency exchange Bullish",
      "weight": 0.066823624
    },
    {
      "name": "crypto firm Zumo",
      "weight": 0.06632597
    },
    {
      "name": "Institutional investors",
      "weight": 0.064867415
    },
    {
      "name": "Digital asset companies",
      "weight": 0.06409176
    },
    {
      "name": "strong investor demand",
      "weight": 0.06403245
    },
    {
      "name": "investor demand",
      "weight": 0.06377434
    }
  ],
  "topics": [
    {
      "name": "Cryptocurrency"
    },
    {
      "name": "IPO"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Politics"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.990234375
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.89599609375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.63037109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.49853515625
    }
  ],
  "sentiment": {
    "positive": 0.122910514,
    "negative": 0.5485652,
    "neutral": 0.3285243
  },
  "summary": "Gemini, a US IPO filing, revealed that the company's revenue fell and losses widened in the first half of 2025. The company reported a net loss of $282.5 million on a total revenue of $68.6 million in the six months ended June 30, compared to $41.4 million the previous year. The firm plans to list on Nasdaq under the ticker symbol “GEMI” and use IPO proceeds for general corporate purposes and to repay all or part of its third-party debt. The move comes as regulatory clarity under the Trump administration and increased investor confidence have boosted investor confidence.",
  "shortSummary": "Gemini, a cryptocurrency exchange founded by the Winklevoss twins, filed for an IPO amid rising investor confidence and regulatory clarity in digital assets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1286b189145c45709417476416a10793",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/07/18/business/crypto-market-cap-surges-past-4-trillion-on-landmark-genius-act-law/",
      "text": "Crypto market cap surges past $4 trillion on landmark GENIUS Act law\nThe total market value of crypto assets surged past the $4 trillion mark for the first time ever on the back of landmark legislation to regulate the industry – marking a milestone that reflects its shift from a nascent asset class to a central part of the global investment landscape.\nThe surge came as President Trump on Friday signed into law the GENIUS Act, the first-ever federal law to regulate stablecoins — a form of cryptocurrency pegged to a real-world asset.\nThe law — passed after a bruising battle in Congress — introduces federal or state oversight of stablecoins tied to the US dollar in a move that helps legitimize a market that has been left largely unregulated.\nCitigroup analysts have estimated that the stablecoin market could grow to $3.7 trillion by 2030.\n“Anyone who has never invested before, I’m not sure this is the best level to be buying crypto at the moment and in fact I would say the other way,” Ken Mahoney, chief executive of Mahoney Asset Management, told The Post.\n“If you have some decent profits, it’s always good to sell it off incrementally.”\nThe market cap record was driven by a rally in altcoins, a term used to refer to all tokens beside Bitcoin.\nEther jumped nearly 20% over the past five days to trade at around $3,500 as of 5:30 p.m. ET, while benchmark Bitcoin hit a record $123,205 earlier this week. The world’s most popular digital token was trading at around $117,000 at 5:30 p.m. ET.\nUniswap soared 20% on Friday and Solana, known for its meme coins, gained 5.6%.\nInvestors have been pouring into crypto ETFs in anticipation of “Crypto Week,” hopeful that Trump’s signature on the bills could help cryptocurrency shake its reputation as a contrarian asset.\nBitcoin funds have seen $5.5 billion inflows so far in July. Ether ETFs have brought in $2.9 billion.\n“The Genius Act will go down in history as a law that served as a foundational step in mainstreaming of crypto as an asset class,” said Chris Perkins, president, CoinFund.\nMahoney cautioned that the crypto market will likely cool off after the legislation has finished working its way through headlines, as “everything runs its course and runs hot at some point.”\nThe House on Thursday also passed two broader bills related to cryptocurrency that are awaiting Senate consideration.\nThe Digital Asset Market Clarity Act installs additional regulatory framework around digital assets and the Anti-CBDC Surveillance State Act seeks to block the Federal Reserve from issuing a central bank digital currency, or CBDC, directly to individuals.\nAfter signing the GENIUS ACT, Trump called back to his keynote address at a Bitcoin conference last year.\n“I pledged that we would bring back American liberty and leadership and make the United States the crypto capital of the world,” Trump said.\n“And that’s what we’ve done. And under the Trump administration, this is only going further.”\nThe GENIUS Act — short for the Guiding and Establishing National Innovation for US Stablecoins — requires monthly public disclosure of reserve competition and annual audited financial statements for issuers with a market cap higher than $50 billion, according to the Senate Banking Committee.\n“Just as I promised last year, the GENIUS Act creates a clear and simple regulatory framework to establish and unleash the immense promise of dollar-backed stablecoin,” Trump said.\n“This could be perhaps the greatest revolution in financial technology since the birth of the internet itself.”\nTrump has made an estimated $150 million from trading of his $Trump meme coin since its launch in January through mid-June, according to an analysis by crypto-risk modeling firm Gauntlet.\nA so-called “unlock” of Trump meme coins this week is expected to add another $100 million to the president’s fortune, according to crypto research site Messari."
    },
    {
      "url": "https://nypost.com/2025/06/06/business/winklevoss-twins-gemini-crypto-exchange-files-for-ipo/",
      "text": "Gemini — a crypto exchange run by billionaire twins Tyler and Cameron Winklevoss — disclosed Friday it had confidentially filed for a US initial public offering, as digital asset firms seize on renewed market momentum.\nSeveral high-profile companies, including those in high-risk sectors such as crypto and financial technology, have launched successful listings in recent weeks, reflecting pent-up demand and renewed vigor in the capital markets.\nEarlier this week, stablecoin issuer Circle went public in a blowout debut on the New York Stock Exchange.\n“Pre-IPO crypto companies would be crazy not to move ahead with listings after seeing how Circle traded,” said Matt Kennedy, senior strategist at Renaissance Capital, a provider of IPO-focused research and ETFs. “Crypto can be an unpredictable market, so when you get a chance like this, you take it.”\nThe surge in cryptocurrency IPOs signals a turning point for the industry, reflecting growing confidence among digital asset firms to attract mainstream investors and bringing increased transparency, regulatory scrutiny and capital that could help solidify crypto’s place in traditional financial markets.\nGemini, which operates a trading platform enabling investors to buy, sell and store more than 70 crypto tokens, said it has not yet determined the size or proposed price range for its offering.\n“Gemini’s move contributes to the broader momentum and reinforces the idea that crypto-native firms are increasingly preparing to access public markets,” said Kat Liu, vice president at IPOX.\n“More broadly, this signals that long-anticipated firms are now ready to reengage with public capital,” Liu added, noting that investor appetite is returning, especially for companies with well-defined business models in strategic sectors such as fintech, AI and digital assets.\nThe Winklevoss twins shot to fame after they sued Facebook and its CEO Mark Zuckerberg, alleging he had stolen their idea for the social networking site. They agreed to a settlement in 2008, in which they received cash and Facebook stock.\nGrowing momentum\nThe global cryptocurrency market is currently valued at roughly $3.3 trillion with bitcoin trading firmly above the key $100,000 apiece milestone, according to data from CoinMarketCap.\n“A successful listing would confirm that the crypto thaw is real,” said Michael Ashley Schulman, partner and CIO at Running Point Capital Advisors. “If equity underwriters smell a new fee stream, expect the calendar to unfreeze for everything from fintech to AI chips.”\nThe industry, particularly after the approval of spot bitcoin ETFs in the US, has attracted billions in inflows from institutional investors seeking exposure to the asset class.\nIn May, Coinbase became the first US crypto-focused company to join the S&P 500, a watershed moment for the industry that signaled rising mainstream acceptance of digital assets.\nAs the crypto sector matures financially and gains regulatory footing, firms are becoming more integrated into traditional markets, though analysts caution that volatility and shifting rules still pose challenges.\nThis marks a sharp turnaround for an industry that spent more than a decade under intense regulatory scrutiny worldwide.\nAfter the collapse of crypto exchange FTX in 2022, many institutional investors retreated from the digital asset market. Prices later recovered, and the sector gained fresh momentum when President Trump voiced support during his campaign, pledging to be a “crypto president.”"
    },
    {
      "url": "https://nypost.com/2025/06/05/business/crypto-giant-circles-shares-spike-123-in-strong-nyse-debut/",
      "text": "Crypto giant Circle Internet Group’s stock surged 168% above their initial offer price on Thursday in a major boost to an IPO market that had stagnated in recent months.\nShares of Circle, which moved to New York from Boston last year and is led by CEO Jeremy Allaire, opened at $69 and closed at $83.23. That pushed the company’s valuation to $18.36 billion. It is the second-largest public listing by a crypto firm.\nThe strong projected debut came after Circle priced its IPO at $31 per share after the market closed on Wednesday – up from an earlier expected range of $27 to $28 per share.\nCircle is best known as the issuer of USD Coin (USDC), which is pegged one-for-one to the US dollar. USDC is the world’s second-largest stablecoin by market capitalization, trailing only Tether’s USDT, according to data from CoinMarketCap.com.\nThe firm earlier said it will raise about $1.1 billion on an offering of 34 million shares.\nStablecoins are a type of cryptocurrency with value directly pegged to a “stable” asset, like the US dollar or gold. They are seen as a less volatile investment option than cryptocurrencies like bitcoin, which can experience major price swings during periods of market instability.\nCircle will be listed on the New York Stock Exchange under the ticker “CRCL.” The IPO is led by JPMorgan, Goldman Sachs and Citigroup.\nARK Investment Management, the firm led by famed tech investor Cathie Wood, has signaled interest in buying up to $150 million in shares, according to a regulatory filing.\nThe successful debut could nudge other crypto companies to explore IPOs.\n“The more crypto companies that go public, the easier it will be for future crypto companies,” Matt Kennedy, senior strategist at Renaissance Capital, told Reuters.\nStablecoins and other types of cryptocurrency have boomed in popularity in recent months following President Trump’s election victory.\nTrump, who won the White House with the backing of many major crypto executives, has vowed to loosen the strict regulatory policy adopted under former President Joe Biden.\nLast month, the US Senate voted to advance the GENUIS Act, which would establish a first-of-its-kind regulatory framework for stablecoins. A different version of a stablecoin bill is up for consideration in the House."
    },
    {
      "url": "https://nypost.com/2025/08/15/business/american-eagle-almost-paralyzed-by-body-positivity-before-it-launched-sultry-sydney-sweeney-ads/",
      "text": "American Eagle ‘almost paralyzed by body positivity’ before it launched ‘sultry’ Sydney Sweeney ads\nAmerican Eagle Outfitters has made a bold, divisive bet on its “sultry” Sydney Sweeney ads — but only after its commitment to the “body positivity” movement started to falter, experts told The Post.\nA decade ago, the mall-based chain’s 20-year-old lingerie brand Aerie famously took off as millennials shunned Victoria’s Secret and its leggy, angel-winged supermodels in favor of Aerie’s ads featuring ordinary women and diverse body types.\nBut recently, American Eagle’s flagging sales show that “inclusive fashion” has its limits — especially after the election of President Trump, experts say.\n“They were almost paralyzed by their body positivity movement and were cautious about coming across too sexy,” according to retail analyst Gabriella Santaniello, who heads up A-Line Partners.\nIn recent months, the retailer has been pivoting to more provocative looks — even before the Sweeney campaign rocked the internet late last month, Santaniello said.\nString bikinis and “cheeky bottoms” that expose more of women’s butts, for example, were previously only available on American Eagle’s website, but started cropping up in its stores earlier this year, she noted.\nSusan Scafidi, director of the Fashion Law Institute, has likewise noticed “edgier” looks and “more sultry styling. “This means featuring fewer boxy t-shirts and more cropped camisoles,” she said.\nWhat’s more — unlike competitors including Abercrombie & Fitch, Hollister, and the Gap — some pages on American Eagle’s website have lately shown models going braless under various tops — and they aren’t always subtle about it.\n“All of the teen retailers shy away from the nipple,” Santaniello said. “That’s why it’s so odd that they’re going for it.”\nThen, in late July, came the Sweeney spots. In one video, the “White Lotus” and “Euphoria” star tinkers under the hood of a vintage Mustang GT350 before slamming it shut, wiping her hands on the butt of her jeans — and peeling off in a cloud of burning rubber.\nDays later, President Trump gushed that the ads were “hot” and “fantastic” after he learned Sweeney was a registered Republican. The company’s shares surged 23% on Trump’s comment, drawing comparisons to meme stocks.\n“They had to do something different,” said Hitha Herzog, a fashion management professor at Parsons School of Design. “We have a conservative president in office and we are seeing conversations that skew away from body positivity, inclusion and diversity.\n“American Eagle has always been good about knowing where the conversations are going,” Herzog added.\nTraffic to American Eagle’s US website soared following the campaign’s rollout on July 23, rising more than 60% on July 28 compared to the same day last year, according to data and insights company Consumer Edge.\nMeanwhile, however, left-wing critics seized upon the campaign’s tagline “Sydney Sweeney Has Great Jeans”. In one clip, Sweeney explains that genes “often determin[e] traits like hair color, personality and even eye color,” before declaring, “My jeans are blue.”\nAn ensuing fracas claimed the ads were promoting Nazi ideology, calling for boycotts of the 48-year-old company. According to a survey this week by Axios and Generation Lab, 39% of young women and 42% of Democrats said the ads made them less likely to buy American Eagle jeans.\nIn the week of Aug. 3, foot traffic at American Eagle stores dropped 8.9% on top of a 3.9% decline the previous week — far steeper than drops at rival chains including Abercrombie and the Gap, according to Pass_by.\n“When a brand sees momentum stall so sharply, it often reflects a reputational or cultural factor,” said James Ewen, vice president of marketing for Pass_by.\nAmerican Eagle posted its only message about the ad so far on Aug. 1 on its Instagram account.\n“Sydney Sweeney Has Great Jeans is and always was about the jeans. Her jeans. Her story. We’ll continue to celebrate how everyone wears their AE jeans with confidence, their way. Great jeans look good on everyone,” the company said."
    },
    {
      "url": "https://nypost.com/2025/08/15/business/atampt-customers-can-receive-up-to-7500-in-17m-data-breach-settlement-heres-how-to-claim/",
      "text": "AT&T customers can receive up to $7,500 in $17M data breach settlement: Here’s how to claim\nFormer and current AT&T customers are eligible to receive up to $7,500 as part of a settlement involving class-action lawsuits over two major data breaches.\nThe telecommunications giant said earlier this month that it has reached a proposed settlement of $177 million – including $149 million for the first class-action lawsuit and $28 million for the second.\nThe first case involved a data breach revealed in March 2024 that impacted 73 million current and former account holders.\nHackers stole personal information like birth dates and Social Security numbers and spread this data across the dark web.\nA second breach announced in July 2024 compromised the call and text records of “nearly all” of AT&T’s customers.\nThose logs were downloaded by hackers onto a third-party platform.\nThe $177 million settlement is still awaiting approval, with a final hearing scheduled for Dec. 3 in the US District Court for the Northern District of Texas.\nHow do I know if I am eligible?\nCurrent and former customers can file for compensation if their data was jeopardized in the breach ahead of the December hearing.\nEligible customers will receive an email alert from attsettlement@e.emailksa.com – the address for Kroll Settlement Administration.\nCustomers who are unsure if they qualify can call (833) 890-4930, KSA said.\nHow do I file for payment?\nTo receive compensation, you must fill out a claim form at telecomdatasettlement.com by Nov. 18.\nIf you choose to file a claim, you forfeit your right to sue AT&T.\nHow much payment can I expect?\nThose impacted by the March 2024 data breach are eligible for up to $5,000, according to the settlement website. They can make claims for losses “that occurred in 2019, or later.”\nCustomers affected by the July 2024 breach are eligible for up to $2,500 “for losses that occurred on or after April 14, 2024.”\nThose impacted by both hacks are eligible for up to $7,500 as an “overlap settlement class member.”\nAT&T will require documentation of the losses to show they are “fairly traceable” to the data breaches.\nWhen will I receive payment?\nPayouts likely won’t be sent out until the end of the year at the earliest, but could take longer if appeals are filed after the Dec. 3 hearing.\nIt will also take time for the claim forms to be processed, according to the settlement claim site."
    },
    {
      "url": "https://nypost.com/2025/08/14/business/kelloggs-becomes-first-company-to-sign-legally-binding-agreement-removing-toxic-dyes-from-cereals/",
      "text": "Kellogg’s becomes first company to sign legally binding agreement removing toxic dyes from cereals\nAfter months of investigation and negotiations, Texas Attorney General Ken Paxton announced Wednesday that WK Kellogg Co. “Kellogg’s” will permanently remove toxic dyes from its cereals.\nIn a historic legal agreement, Paxton and Kellogg’s signed an Assurance of Voluntary Compliance (AVC), which certifies that the company commits to removing artificial food colorings from its cereals by the end of 2027.\nWhile other companies have verbally committed to removing food dyes, Kellogg’s is the first to officially sign a legally binding agreement confirming that it will remove food colorings, according to Paxton’s office.\n“Following months of investigating and negotiating, I’m proud to officially say Kellogg’s will stop putting these unhealthy ingredients in its cereals,” Paxton wrote in a statement.\n“The signed AVC demonstrates that Kellogg’s is committed to keeping this pledge, and I commend the company for doing the right thing.”\nPaxton encouraged other food manufacturers to sign similar agreements to “demonstrate their commitment to helping Americans live healthier lives.”\nIn February, Paxton’s office issued a Civil Investigative Demand (CID) to Kellogg’s, and formally announced an investigation in April after the company claimed it would remove petroleum-based food colorings in the US, but allegedly did not do so.\nInstead, Paxton’s office claimed Kellogg’s removed toxic ingredients in Canada and Europe, while continuing to put different types of blue, red and yellow dyes in American cereals.\nKellogg’s markets popular cereals such as Froot Loops, Apple Jacks, Frosted Flakes and Rice Krispies as “healthy,” Paxton previously said.\nHowever, he noted that some varieties contain petroleum-based artificial dyes linked to hyperactivity, obesity, autoimmune disorders, endocrine issues and cancer.\n“A critical part of fighting for our children’s future is putting an end to companies’ deceptive practices that are aimed at misleading parents and families about the health of food products,” Paxton wrote in a statement. “Artificial food colorings have been shown to have disastrous impacts on health, and in no world should foods that include these dyes be advertised as ‘healthy.’\n“There will be accountability for any company, including Kellogg’s, that unlawfully makes misrepresentations about its food and contributes to a broken health system that has made Americans less healthy,” he added."
    }
  ],
  "argos_summary": "Gemini, the Winklevoss twins’ crypto exchange, filed a confidential IPO after reporting a $282.5 million net loss and $68.6 million revenue in the first half of 2025, amid a broader wave of digital‑asset firms tapping public markets. The filing comes as the crypto sector rebounds, with the market cap exceeding $4 trillion after the passage of the GENIUS Act, which imposes regulatory oversight on dollar‑backed stablecoins and has boosted investor confidence. The article also notes other recent headlines: American Eagle’s shift to sultry Sydney Sweeney ads sparked backlash, AT&T is offering up to $7,500 to customers affected by two data‑breach lawsuits, and Kellogg’s has signed a binding agreement to remove toxic dyes from its cereals by 2027. Together, the pieces illustrate a crypto market regaining traction, regulatory milestones, and a mix of corporate controversies and consumer‑health initiatives.",
  "argos_id": "ESOYSSVOQ"
}