{
  "url": "https://www.ibtimes.com/after-repeated-explosions-new-test-musks-megarocket-3781034",
  "authorsByline": "AFP News",
  "articleId": "9e223af4d16b4e5d9c6e16505996a1d7",
  "source": {
    "domain": "ibtimes.com",
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://d.ibtimes.com/en/full/4616468/massive-starship-rocket-launches-test-flight-spacexs-base-texas.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T18:06:11-04:00",
  "addDate": "2025-08-15T22:19:58.470616+00:00",
  "refreshDate": "2025-08-15T22:19:58.470618+00:00",
  "score": 1.0,
  "title": "After Repeated Explosions, New Test For Musk's Megarocket",
  "description": "Elon Musk's SpaceX announced Friday that its Starship megarocket is scheduled to blast off on a new test flight next weekend after recent attempts have ended in fiery explosions.",
  "content": "Elon Musk's SpaceX announced Friday that its Starship megarocket is scheduled to blast off on a new test flight next weekend after recent attempts have ended in fiery explosions.\n\nThe biggest and most powerful launch vehicle in history is planned to return Americans to the Moon -- and is central to the dreams of colonizing Mars envisioned by Musk, the world's richest person.\n\nBut repeated explosions that sent debris raining down over Caribbean islands and disrupted flights have piled pressure onto SpaceX to pull off a smoother trial run.\n\nThe rocket's 10th test flight is set to launch as soon as August 24 from the company's Starbase facility in Texas, SpaceX said on its website.\n\nDuring two test flights earlier this year, the rocket's upper stage -- which is the spacecraft intended to carry crew and cargo -- erupted in fiery cascades not long after launch.\n\nStarship managed to make it to space during the last test in late May, however it then blew up when a fuel leak caused it to lose control.\n\nThe rocket's propulsion system was also supposed to execute a planned splashdown in the Gulf of Mexico -- but it disintegrated before reaching the water.\n\nStanding 403 feet (123 meters) tall, the black-and-white behemoth is designed to eventually be fully reusable and launch at relatively low cost.\n\nSpaceX has been betting that its \"fail fast, learn fast\" ethos -- which helped it dominate commercial spaceflight -- will once again pay off.\n\nBut the latest string of setbacks, which also includes an explosion during a routine ground test in June, has raised serious questions about Starship's progress.\n\nMusk -- who is known for making extremely ambitious proposals -- maintains that the rocket will launch its first uncrewed missions to Mars next year.\n\nSpaceX has also been sharply criticized over the impact its launches have on people and the environment near where its rockets blast off.\n\nIn June, Mexican President Claudia Sheinbaum threatened to sue SpaceX over falling debris and contamination from its launches.\n\nMore Starship tests are expected in the coming months, however, after the US aviation regulator approved the number of its annual launches increasing from five to 25.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "More Starship tests",
      "weight": 0.09197141
    },
    {
      "name": "SpaceX",
      "weight": 0.08447823
    },
    {
      "name": "fiery explosions",
      "weight": 0.07189856
    },
    {
      "name": "Repeated Explosions",
      "weight": 0.07065742
    },
    {
      "name": "repeated explosions",
      "weight": 0.07065742
    },
    {
      "name": "launch",
      "weight": 0.06853388
    },
    {
      "name": "flights",
      "weight": 0.06431144
    },
    {
      "name": "Musk",
      "weight": 0.06276914
    },
    {
      "name": "Starship",
      "weight": 0.061689638
    },
    {
      "name": "late May",
      "weight": 0.05978198
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.7802734375
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.6025390625
    },
    {
      "name": "/News/Other",
      "score": 0.57861328125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.414794921875
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.3974609375
    }
  ],
  "sentiment": {
    "positive": 0.037616,
    "negative": 0.78717077,
    "neutral": 0.17521325
  },
  "summary": "Elon Musk's SpaceX is set to conduct a new test flight for its rocket, the Starship megarocket, scheduled for August 24 from its Starbase facility in Texas. The rocket, which is designed to return Americans to the Moon and is central to Musk's vision of colonizing Mars, has been plagued by explosions that sent debris over Caribbean islands and disrupted flights. The last test took place in May, but the rocket's upper stage exploded shortly after launch due to a fuel leak. This latest setback has raised serious questions about Starship's progress.",
  "shortSummary": "Elon Musk's SpaceX is launching its Starship megarocket on August 24 after multiple explosions and environmental concerns raised by its upcoming launch.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c26e398444bd4030b75d4703064686b1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "SpaceX plans to launch its Starship megarocket on August 24 for its 10th test flight after a series of fiery explosions that damaged the vehicle and caused debris to fall over the Caribbean. The 403‑foot rocket, designed to be fully reusable, has suffered multiple upper‑stage failures, including a fuel‑leak‑induced loss of control in May and a ground‑test blast in June. Elon Musk insists the vehicle will soon carry uncrewed missions to Mars, while the company faces criticism from Mexican officials over debris and environmental impacts. The U.S. aviation regulator has approved an increase in annual launches from five to 25, signaling continued testing despite setbacks.",
  "argos_id": "HCWK2MNUI"
}