{
  "url": "https://www.forbes.com/sites/joshkatzowitz/2025/08/15/moses-itauma-vs-dillian-whyte-odds-records-prediction/",
  "authorsByline": "Josh Katzowitz",
  "articleId": "237e32a550b44feb90eadf6c9eeed07c",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689f8b293b68fcf95b44ca21/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T20:02:12+00:00",
  "addDate": "2025-08-15T20:20:58.604319+00:00",
  "refreshDate": "2025-08-15T20:20:58.604321+00:00",
  "score": 1.0,
  "title": "Moses Itauma Vs. Dillian Whyte: Odds, Records, Prediction",
  "description": "Dillian Whyte is a veteran who has fought at the highest levels. But at his age, can he handle Moses Itauma.",
  "content": "The last time Dillian Whyte fought on such a big world stage, he was getting knocked around by Tyson Fury and basically looked like he was done boxing meaningful matches. But on Saturday, Whyte, at the age of 37, has another chance to headline a big-time show. The problem? Moses Itauma, one of the best prospects in the sport, is looking to duplicate Fury’s performance by knocking out Whyte. Here’s everything you need to know about Moses Itauma vs. Dillian Whyte, including the odds, their records and a prediction on who will win.\n\nWhen Whyte fought Fury three years ago, he was certainly the underdog. But some believed he still had a chance (and he was only a relatively modest +350 underdog). And then Fury went to work blasting him with punches. Will Itauma do the same?\n\n“I'm up against it [vs. Itaumi], but it's a good place to be. I haven't got anything to lose, so it's good to be in this position. I've got nothing to prove to myself,” Whyte said this week. “I've far surpassed where I've come from. Sometimes, I think to myself: I’m 37 years old, I've got a wife, kids, and I'm one of the best fighters in the world. Sometimes, it's unbelievable. I'd love to get a chance to avenge my defeats, and I'd love to fight for a world title again. I don't think I did myself justice last time. Sometimes, you're there but not really there, and I think that's what happened in the Fury fight.”\n\nIf he’s “not really there” against Itauma, that potentially could be a dangerous problem.\n\nEven though Itauma hasn’t faced anybody at Whyte’s level (even if Whyte’s prime was at least a half-decade ago), the 20-year-old has impressed observers with his power and skills.\n\n“Dillian is a big name, good opposition,” Itauma told the Toe2Toe podcast, via Sky Sports. “It's for me to go in there and do the job. I've got to box to a game plan. If I box to the game plan, it shouldn't be a long night.”\n\nConsidering none of his last eight opponents have lasted into the third round, Itauma makes a good point. And Whyte, while considered a tough guy, has been knocked out in all three of his losses. That could make for a bad combination and a short night for Whyte.\n\nBut those are lofty expectations for Itauma, his trainer said.\n\n“I don’t like the whole, ‘Oh, Moses blows him [Whyte] away in a couple of rounds,’” Ben Davison said, via Boxing Scene. “Because if there was any other heavyweight boxing Dillian Whyte — any other heavyweight — they wouldn’t be saying he was a one- or two-round job. Not one other heavyweight. No one.\n\n“I’m not saying that can’t happen, but if that was to happen, [Itauma] deserves credit for that. For that to just be, ‘Ah, it’s expected.’ What? Where’s that come from? It’s a good name, a great chance for him to show where he’s at, but also, at the same time, it’s a big step up for him as well.”\n\nHere’s more info on the Moses Itauma vs. Dillian Whyte showdown that U.S. viewers can watch on DAZN PPV for $49.99 beginning at 12:45 p.m. ET on Saturday.\n\nItauma is the hefty betting favorite at -900 (bet $900 to win $100), while Whyte is the +550 underdog (win $550 on a $100 wager). I don’t think taking Whyte’s money line is an outlandish decision, but maybe wait to see if it gets to +600 close to the fight. Otherwise, you could go with Itauma by stoppage at -400. If you’re interested in an over-under, you could go under 3.5 rounds at +162.\n\nIf you were looking for a fun parlay for this weekend’s action of boxing (and this is only for entertainment purposes), I might take Itauma to stop Whyte at -400, Nick Ball to beat Sam Goodman by decision at +187 and Filip Hrgovic to beat David Adeleye at -500. If all those hit, you’d earn a $330 profit on a $100 wager.\n\nWhyte, by far, will be the biggest name so far on Itauma’s resume. For Itauma (12-0, 10 KOs), the most recognizable name on his list of opponents is the long-faded Mariusz Wach. In his last two fights, though, Itauma’s opponents were a combined 43-2. For what it’s worth, Itauma is on an eight-fight stoppage streak.\n\nWhile amassing a 31-3 (21 KOs) record during his 14-year career, Whyte has proven he can beat B-level and below fighters (at least he could when he was his prime). But when faced against true world class competition, he’s fallen to fighters like Anthony Joshua, Tyson Fury and Alexander Povetkin. His biggest victories came against Povetkin in their rematch, Joseph Parker and Derek Chisora twice when Chisora was closer to his prime.\n\nThough he never won a world title, Whyte has had a productive career, and he’s been in some rugged, exciting fights. Hopefully, he will look back on his career and feel proud. But this won’t end well for him vs. Itauma, who’s too young and too powerful for Whyte. Say, Itauma by fourth-round stoppage.",
  "medium": "Article",
  "links": [
    "https://www.boxingscene.com/articles/dillian-whyte-a-big-step-up-for-moses-itauma-but-one-he-can-handle",
    "https://www.forbes.com/sites/joshkatzowitz/2022/04/22/tyson-fury-vs-dillian-whyte-odds-records-prediction/",
    "https://www.forbes.com/sites/joshkatzowitz/2021/03/26/alexander-povetkin-vs-dillian-whyte-ii-odds-records-prediction/",
    "https://www.dazn.com/en-US/news/boxing/moses-itauma-vs-dillian-whyte-grand-arrivals-avenge-losses-fury/accxr22fxv1r16axmbayfzgll",
    "https://www.skysports.com/boxing/news/12183/13410664/moses-itauma-hints-ruthless-gameplan-could-deliver-explosive-dillian-whyte-knockout",
    "https://www.nj.bet365.com/?_h=4r18ya75g2O4nRgTA2UqVg%3D%3D#/AC/B9/C1/D8/E23477107/F8/G179638901/H4/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Dillian Whyte",
      "weight": 0.11144773
    },
    {
      "name": "Moses Itauma",
      "weight": 0.103876896
    },
    {
      "name": "Whyte",
      "weight": 0.10258887
    },
    {
      "name": "Itauma",
      "weight": 0.09608837
    },
    {
      "name": "Tyson Fury",
      "weight": 0.06550621
    },
    {
      "name": "good opposition",
      "weight": 0.06332963
    },
    {
      "name": "Dillian",
      "weight": 0.058725595
    },
    {
      "name": "true world class competition",
      "weight": 0.0578484
    },
    {
      "name": "Whyte’s money line",
      "weight": 0.056808893
    },
    {
      "name": "Fury",
      "weight": 0.056413423
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9921875
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.429931640625
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.423828125
    },
    {
      "name": "/Sports/Combat Sports/Boxing",
      "score": 0.3603515625
    },
    {
      "name": "/Sports/Combat Sports/Martial Arts",
      "score": 0.334716796875
    }
  ],
  "sentiment": {
    "positive": 0.15713428,
    "negative": 0.47778517,
    "neutral": 0.36508062
  },
  "summary": "Dillian Whyte, a 37-year-old heavyweight, is set to face Moses Itauma, one of the best prospects in the sport, in a big-time show against one of their peers. Despite being the underdog in the previous fight against Tyson Fury, Whyte believes he has a better chance to headline a major show. Despite not having faced anyone at Whyte's level, Heauma has impressed observers with his power and skills. Despite his three losses, Despite being considered a tough guy, Whyate has been knocked out in all three of his losses. The fight will be shown on DAZN PP for $49.99 on Saturday.",
  "shortSummary": "Moses Itauma aims to knock out Dillian Whyte, the oldest boxer in the world, with high expectations and a challenging task ahead.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "988687f1327343c4bbd7fa739d9490e1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.skysports.com/boxing/news/12183/13410664/moses-itauma-hints-ruthless-gameplan-could-deliver-explosive-dillian-whyte-knockout",
      "text": "Moses Itauma hints ruthless gameplan could deliver explosive Dillian Whyte knockout\nMoses Itauma bidding to add Dillian Whyte to growing list of knockout victims in Saudi Arabia; 20-year-old heavyweight prospect explains to Toe2Toe podcast that dominant victory could maintain trajectory to world title contention\nWednesday 13 August 2025 12:59, UK\nRising heavyweight sensation Moses Itauma has hinted his ruthless gameplan for Dillian Whyte could deliver yet another explosive early knockout in Saudi Arabia.\nItauma faces the sternest test of his career as he headlines against former world title challenger Whyte this Saturday.\nThe 20-year-old prodigy enters the ring with a perfect record of 12 wins, 10 of them knockouts inside two rounds, and arrives in Riyadh off the back of an eight-fight knockout streak.\n- Not got Sky? Get Sky Sports or stream with no contract on NOW 📺\n- Choose the Sky Sports push notifications you want!\nItauma plans to make Whyte - who has fought the likes of Tyson Fury and Anthony Joshua - the highest-profile addition to his growing list of victims.\n\"Dillian is a big name, good opposition,\" he told the Toe2Toe podcast. \"It's for me to go in there and do the job. I've got to box to a game plan. If I box to the game plan, it shouldn't be a long night.\"\nThe bout marks Itauma's first time headlining a major show but he's undaunted by the occasion and is instead relishing the occasion and the step up in quality.\n\"This is my first headline show, it's in Saudi Arabia against Dillian Whyte and I'm only 20 years old,\" he said.\n\"Just having that comes with pressure, but I love a bit of pressure. I acknowledge it, but I don't feel it. I know it's there, but I don't let it sink in - only because it does me no favours. I'm ready to perform Saturday night.\"\nUsyk next?\nThe ruthless manner in which Itauma has dismantled every opponent so far has sparked calls for him to be fast-tracked into the world title conversation.\nAlready ranked first by the WBO, a dominant win over Whyte would only intensify talk of a showdown with undisputed heavyweight king Oleksandr Usyk.\n\"One day, inshallah,\" Itauma added. \"I'm learning my Arabic since I've been out in Saudi!\n\"I think it will happen. I think Joseph Parker and Agit Kabayel do deserve the opportunity to fight for those belts. But you don't get what you deserve nowadays, you get what you negotiate for.\n\"If I am able to beat Dillian Whyte in good fashion, and I'm already ranked No 1 with the WBO, so I do feel I'll be in a position to fight him.\""
    },
    {
      "url": "https://www.forbes.com/sites/joshkatzowitz/2021/03/26/alexander-povetkin-vs-dillian-whyte-ii-odds-records-prediction/",
      "text": "The last time Dillian Whyte was knocked out, he went on to reel off 11-straight wins and set himself up for a title shot. Now that he’s coming off another stoppage loss, his rematch vs. Alexander Povetkin on Saturday could make or break the rest of his boxing career. And it could put him back into heavyweight title contention. Here’s everything you need to know about Alexander Povetkin vs. Dillian Whyte, including the odds, their records and a prediction on who will win.\nThe first time Whyte and Povetkin met last August, Whyte was winning the fight on the scorecards and had knocked down Povetkin twice in the fourth round. But in the process of trying to put Povetkin away for good in the fifth, Povetkin caught Whyte with a beautiful uppercut that sent him to the canvas in a heap. It was the knockout (and one of the best comebacks) of the year.\n“I was a fighter a long time before I was a boxer. I’ve been knocking people out for a long time,” Whyte said. “I carry a lot of power in both hands. Povetkin is a very cagey guy and an experienced guy, a very patient guy. He’s a tough guy as well. Last time I didn’t land properly and he went down, but he showed resilience by getting up and then he stopped me. This time when I hit him, he’ll stay down.”\nEven though he’s coming off that knockout loss, Whyte is still the betting favorite. Probably because he performed well against Povetkin up until the moment he got caught but also because Povetkin is 41 and because his career seemingly is winding down. There’s no doubt, though, that Povetkin can be tricky in the ring and that he still has plenty of power.\nOh, and don’t call his uppercut of Whyte a lucky punch.\n“It definitely wasn’t a lucky punch,” Povetkin said this week. “People who think that don’t understand boxing. I was training on that punch from the left and the right side. There was nothing about a lucky punch in this case.”\nWhyte probably understands this as well. But that hasn’t stopped him from questioning why he’s had to wait seven months for a rematch or whether Povetkin really tested positive for COVID-19 that forced a postponement on the rematch. Maybe he’s trying to psyche out Povetkin. Maybe he’s just talking trash to draw in more viewers.\nEither way, Whyte realizes this is a must-win fight. And the way he’s transformed his body tells the tale.\nSaid Whyte: “I don’t care if I have to throw two jabs and move or get in and throw power punches and rough him up. I’ll do whatever I have to do. I’m not worried about a career-best performance, I’m worried about getting the win. My mindset is I’ve got a job to do and I’ll do whatever I need to do to get it done … It's the biggest fight of my career. I’m coming off a loss to the guy. The good thing is this is heavyweight boxing. One fight changes everything.”\nHere’s more info on the Alexander Povetkin vs. Dillian Whyte showdown that U.S. viewers can watch on DAZN beginning at 2 p.m. ET on Saturday.\nAlexander Povetkin vs. Dillian Whyte odds\nIt makes sense that Whyte would be the betting favorite against Povetkin even though Povetkin knocked him out last time (Povetkin is much older and was getting beat up by Whyte before the stoppage). But the money keeps coming in on Whyte. As of Friday, Whyte was a -400 favorite (bet $400 to win $100) on Bet 365, but when the rematch was first announced, he was only -275. Povetkin, meanwhile, is +275 (earn $275 on a $100 wager).\nSports Betting Dime has virtually the same odds with Whyte at -400 and Povetkin at +280. If it were me, I’d avoid the Whyte money line and bet on him to win by KO/TKO at -175. He was trending that way in their first encounter, and I think he’ll finish the job on Saturday. You could pick Whyte to win by KO in either rounds 4-6 or 7-9, but I don’t think there’s enough value for you there at +350.\nIf you like Povetkin to pull off another upset, you could pick him to win by KO/TKO at +333.\nAlexander Povetkin vs. Dillian Whyte records\nPovetkin is a former heavyweight titlist and Olympic gold medalist, and though he’s had a successful career and has built an impressive record of 36-2-1 (25 KOs), he’s never beat the absolute best of the division. His two losses came to Wladimir Klitschko and Anthony Joshua. In my eyes, Whyte is not as good as those fighters but is still better than Povetkin’s best wins (Carlos Takam, Marco Huck).\nWhyte has waited years as a mandatory title opponent to finally get his shot at a belt. Then, his KO loss to Povetkin wiped out that opportunity. But if Whyte (27-2, 18 KOs) wins the rematch, he, once again, will be considered one of the five best heavyweights in the world.\nAlexander Povetkin vs. Dillian Whyte prediction\nWhyte is dead serious about this rematch. And he should be. Eddie Hearn, Whyte’s promoter, said this week that “if he loses against Povetkin, [a shot at a heavyweight championship] is out—and it's not just out for six months or a year. That could be out forever.” Obviously, Povetkin is still dangerous. But Whyte might be a little more cautious this time around and look to box a little more. Until the late rounds when Whyte stops Povetkin. Say, Whyte by stoppage in the ninth round."
    },
    {
      "url": "https://www.boxingscene.com/articles/dillian-whyte-a-big-step-up-for-moses-itauma-but-one-he-can-handle",
      "text": "Trainer Ben Davison has worked with all shapes and styles of fighter. From the southpaw skills of Billy Joe Saunders to the towering trickery of Tyson Fury and the athletic power of Anthony Joshua, the coach has seen a lot.\nArguably, some of his finest work is coming with fast-rising heavyweight Moses Itauma.\nBoxingScene’s 2024 Prospect of the Year is tabbed by most hardcore aficionados as one of the sport’s brightest hopes.\nItauma, 12-0 (10 KOs), will next face veteran contender Dillian Whyte in a notable step up this Saturday on DAZN PPV from ANB Arena in Riyadh, Saudi Arabia.\nStill only 20, Itauma – a Slovakian-born British southpaw raised in Chatham, Kent – is expected to have his way with Whyte.\nAccording to Davison, that should not be the case at this stage of his career. But such is the buzz around Itauma that it is widely believed that Whyte will join Mariusz Wach, Demsey McKean and Mike Balogun on his growing highlight reel.\nWach lasted two rounds, as did Balogun. McKean was gone in one. Itauma knocked the three men down five times in all over the course of his past three starts.\nItauma’s manager, Frank Warren, has talked extensively about his belief in the talent his fighter has.\nDavison knows it has got to the point where Itauma – having his fourth fight in 13 outings in Saudi Arabia – is expected to shine brightly every time.\n“I don’t like the whole, ‘Oh, Moses blows him [Whyte] away in a couple of rounds,’” Davison said. “Because if there was any other heavyweight boxing Dillian Whyte – any other heavyweight – they wouldn’t be saying he was a one- or two-round job. Not one other heavyweight. No one.\n“I’m not saying that can’t happen, but if that was to happen, [Itauma] deserves credit for that. For that to just be, ‘Ah, it’s expected.’ What? Where’s that come from? It’s a good name, a great chance for him to show where he’s at, but also, at the same time, it’s a big step up for him as well.”\nDavison understandably takes a cautious approach, though the numbers are in line with public perception.\nItauma boasts an 83 per cent KO ratio, and Whyte, 31-3 (21 KOs) has been stopped in all of his three losses, which have come against Anthony Joshua, Alexander Povetkin and Tyson Fury.\nJoshua went on to become a two-time, unified heavyweight titlist, while Fury was the lineal and WBC heavyweight champion at the time of their April 2022 affair.\nWhyte avenged the Povetkin loss, and he has won three since a Fury uppercut turned his lights out at London’s Wembley Stadium. His current streak includes victories over Jermaine Franklin, Christian Hammer and Ebeneezer Tetteh.\nItauma is unlike any heavyweight out there, and Davison has been working with him to enhance the fighter’s own style.\n“I'll be honest I thought he lacked identity,” Davison said of his start with Itauma. “I thought he had a great skill set, but [his identity] wasn’t very clear. The way I explain it is, this is the chunk of the tree and then we’ve got branches, we can branch off it … this is the fundamentals, this is what the rest of my work comes off. I think that’s what he's developed now.”\nItauma was on Davison’s radar long before the prospect turned pro.\nHe had already been making waves in gyms in the UK as an amateur, and he visited Davison’s gym to spar Jeamie TKV, who is trained by Barry Smith at Davison’s Performance Centre in Essex, UK.\nItauma has boxed just 25 rounds as a pro. Whyte is approaching 200. And it is rounds that Davison would like to see Itauma start to bank.\n“I mean, it’s so cliche, but it would do him the world of good,” Davison added. “Do you have to have it? No, he’s getting rounds in the gym. So again, he’s got a good enough IQ and he’s got an understanding now of, I can see the signs of what would make the rounds an issue. I now understand why that would happen and how to prevent that from happening.”\nBut rounds are proving tough to get.\nItauma’s power, tactics, speed and movement have left everyone floundering. The two opponents who went the distance with him managed to do six rounds in his third and fourth fights.\nAnd the pressure must be mounting, with the expectation not just on Itauma but on Davison, too. But the coach is well-qualified for it, having marshaled Tyson Fury through his return and coached Anthony Joshua on some big nights.\n“Yeah, of course, you get that,” Davison admitted. “Obviously [Itauma is] probably as big of a prospect as you’re going to have, to be honest, but I’ve had other big prospects as well. It’s part and parcel for the game.\n“But that’s there, unless you’ve got a lad that not many people know about, in six-rounders, eight-rounders, 10-rounders, whatever, then there’s not much pressure on. But the rest of them, it’s the same as working with somebody at a very high level. There’s always going to be pressure, but that’s what motivates and keeps you disciplined and makes sure you make the right moves at the right time.”\nThat is crucial, and there is no rush at Itauma’s age.\nAt the same time, Davison is bullish about what he has.\n“There isn't anybody that I would hesitate to put him in with,” he said, before qualifying the statement. “When I say that, there’s a difference between ‘That fight makes more sense than that fight,’ because that fight might be just as hard, but there’s more to gain fighting that person.”\nIt was Turki Alalshikh, the Saudi power broker, who fired off a message on X that Itauma versus undisputed heavyweight champion Oleksandr Usyk, 24-0 (15 KOs), is the fight to make. Itauma is unranked in Ring’s top 10, but he is No. 1 in the WBO, No. 2 in the WBA, No. 6 in the IBF and No. 11 with the WBC.\n“Yeah, so that is a prime example,” Davison said, asked about the mention of Usyk-Itauma. “That is the one for me, because I think if it was a six-round fight, I would put my money on Moses. But it’s a 12-round fight. That’s not necessarily anything to do with gas tank; that’s just to do with experience in a sense of having to think at that level for that duration. But like I said, I wouldn’t hesitate to do that fight.”\nIt comes down to patience and, as Davison said, making the right moves at the right time.\nWarren, Itauma’s promoter, is the master at that. Given a heavyweight’s propensity to develop later, there is no blind rush with Itauma; one false move among the big men and things can change with a single punch.\n“That can happen at any level, any weight in boxing,” said Davison. “But especially with a heavyweight.”\nTris Dixon covered his first amateur boxing fight in 1996. The former editor of Boxing News, he has written for a number of international publications and newspapers, including GQ and Men’s Health, and is a board member for the Ringside Charitable Trust and the Ring of Brotherhood. He has been a broadcaster for TNT Sports and hosts the popular “Boxing Life Stories” podcast. Dixon is a British Boxing Hall of Famer, an International Boxing Hall of Fame elector, is on The Ring ratings panel and is the author of five boxing books, including “Damage: The Untold Story of Brain Trauma in Boxing” (shortlisted for the William Hill Sportsbook of the Year), “Warrior: A Champion’s Search for His Identity” (shortlisted for the Sunday Times International Sportsbook of the Year) and “The Road to Nowhere: A Journey Through Boxing’s Wastelands.” You can reach him @trisdixon on X and Instagram."
    },
    {
      "url": "https://www.forbes.com/sites/joshkatzowitz/2022/04/22/tyson-fury-vs-dillian-whyte-odds-records-prediction/",
      "text": "Tyson Fury is one of boxing’s most prolific trash talkers. If he doesn’t like you (or he pretends he doesn’t like you) or doesn’t feel like you deserve respect, he will literally shout out about it from every rooftop he can find. But whether he’s actually thinking about retiring after Saturday night’s fight vs. Dillian Whyte or he actually has some respect for his opponent, Fury has been calmer than normal this week. Whether that means anything for his heavyweight championship fight remains to be seen. Either way, here’s everything you need to know about Tyson Fury vs. Dillian Whyte, including the odds, their records and a prediction on who will win.\nFury is coming off two impressive knockouts of Deontay Wilder. While Whyte has more technical skills, he has less punching power than Wilder. So, maybe Fury doesn’t feel he has to be quite as cautious against Whyte, because the threat of a one-punch knockout doesn’t loom quite as large.\nStill, Fury clearly knows Whyte is dangerous.\n“Dillian Whyte is a good fighter,” Fury said. “He is a good, strong, solid man. He’s big. He’s strong. He’s tough. He’s game. He’s got good power. He’s knocked out a lot of men. He’s had a good learning career as well. He’s got a lot of experience in the fight game. He’s definitely a man that needs a lot of respect. And that’s why I’ve given all this training camp we’ve had. I’ve had everything I can possibly do to train for this. I’ve haven’t left any stones unturned. I’ve trained as hard for Dillian as I have for Wilder or Klitschko.”\nFury, though, also has been more wistful in the leadup to this fight. Perhaps it’s because he’s actually serious about possibly retiring.\n“It’s been an amazing journey,” he said. “From where I started all those years ago to the ups and downs and being away from boxing and being fat as ****, 28 stone. To coming back and being mentally out, a druggie and an alcoholic—all of the rest of the stuff—I’m not ashamed of it. It’s a part of who I am. To coming back and getting back to the top of the world and having three big fights with Deontay Wilder over there in the U.S., and now being back in England after all these years, four years away, and now I’m fighting my old pal Dillian Whyte back at home for all the glory and all the belts. Who would have thought it?”\nIt's true. Despite his mental and physical issues, Fury has been a heavyweight champion since he beat Wladimir Klitschko in 2015. Whyte, meanwhile, has never tasted that kind of glory. He’s been a top-five heavyweight for the past several years, but he’s never had the career-changing opportunity he’ll get vs. Fury.\n“This is one of those fights where I’ve been working on being adaptable,” Whyte said. “I’m going to have to adapt, make smart decisions, when I need to do what and how I need to do it, and how I need to approach what I’m doing. So that’s it. There’s no strategy here. That’s it. I just need to go in there and do my thing.”\nHere’s more info on the Tyson Fury vs. Dillian Whyte showdown that U.S. viewers can watch for $69.99 on ESPN+ PPV beginning at 2 p.m. ET on Saturday.\nTyson Fury vs. Dillian Whyte odds\nWhile Fury is the solid betting favorite, more people seem to be wagering on Whyte. As of this writing, Fury is a -450 favorite (bet $450 to win $100), while Whyte is the +350 underdog. It’s the lowest odds I’ve seen for Whyte so far, so if you took him at +450 when the fight was first announced, you’re probably feeling pretty good about that. Fury, meanwhile, has been as wide as -700, so if you like Fury to defend his championship, now’s a decent time to bet on him.\nIf you want to get a little more specific, betting on Fury to win by KO/TKO is -125 and by decision at +240 (to me, it’s a 50-50 proposition for how Fury could win this fight, so perhaps the points decision is the slightly better value). If you like Whyte, I might take him to win by stoppage at +450 (or if you’re really brave, a Whyte decision victory would pay off at 22/1). I wouldn’t even mind getting even more granular than that with a Fury stoppage in rounds 7-12 at +187.\nTyson Fury vs. Dillian Whyte records\nFury is undefeated at 31-0-1 (22 KOs), and he’d certainly like to retire undefeated (if he, in fact, does retire). Though Fury has one of the most unique set of skills of any heavyweight champion in boxing history, his resume still isn’t that fantastic. He squeaked by Wladimir Klitschko in 2015, and though he probably should have been awarded all three of his fights vs. Deontay Wilder, Fury went 2-0-1 with 2 KOs. His victories vs. Otto Wallin (in 2019) and Dereck Chisora (in 2014) look even better in retrospect. But is this a Hall of Fame resume? Maybe not.\nWhyte (28-2, 19 KOs) has had some nice victories and some tremendous letdowns. In the biggest fight of his life, he managed to hurt Anthony Joshua early in their 2015 matchup but then was knocked out in the seventh round. He also, a little surprisingly, got knocked out by Alexander Povetkin in 2020. But Whyte has good wins as well, stopping Povetkin in their rematch, outpointing former titlist Joseph Parker, and beating Chisora twice in fantastically exciting bouts.\nTyson Fury vs. Dillian Whyte prediction\nIf this fight happened two years ago, I’d be inclined to pick Fury to win by decision. But considering how aggressive and powerful Fury was vs. Wilder and considering Whyte’s chin can be shaky, I think Fury will knock out Whyte. It’ll be difficult, though, and Whyte’s power might cause problems for Fury early. In the end, it’ll be Fury by stoppage in the eighth round.\nUPDATE: If you took Fury to win by stoppage in rounds 7-12, you missed it by 1 second. That’s because Fury laid out Whyte with a massive uppercut late in the sixth round, Whyte got up wobbly and the referee stopped the fight at 2:59 of the sixth round. But still, that’s great news if you picked Fury to win by KO/TKO, and you picked up an additional $80 with your $100 wager.\nWith the victory, Fury made a $33.6 million purse, while Whyte walked away with $7.4 million."
    }
  ],
  "argos_summary": "The piece previews Dillian Whyte’s upcoming bout against 20‑year‑old prospect Moses Itauma, noting Whyte’s recent knockout losses and the expectation that Itauma could stop him early, with betting odds heavily favoring the younger fighter. It also references Whyte’s rematch with Alexander Povetkin and a potential fight with Tyson Fury, outlining Whyte’s ambition to regain title contention and the contrasting styles and records of each opponent. Overall, the article highlights Whyte’s challenging path against rising talent and seasoned champions, offering odds, predictions, and context for each matchup.",
  "argos_id": "HR7SJJPX7"
}