{
  "url": "https://www.cbsnews.com/newyork/news/lost-college-ring-found-on-long-island/",
  "authorsByline": "By\n                        \n              \n                            \n          \n            \n                Carolyn  Gusoff\n            \n\n            \n              \n                \n                  \n                \n              \n\n              \n                                  \n                    \n                  \n                \n                \n                  Carolyn  Gusoff\n\n                                  \n              \n\n                              \n                  Carolyn Gusoff has covered some of the most high profile news stories in the New York City area and is best known as a trusted, tenacious, consistent and caring voice of Long Island's concerns.\n                \n              \n              Read Full Bio\n            \n          \n\n          \n            Carolyn  Gusoff",
  "articleId": "002f2bd9731f477eb9fca1cb033033af",
  "source": {
    "domain": "cbsnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/08/15/7967b584-437a-4b6f-9e0a-09d7a1b7d27b/thumbnail/1200x630/8835321c349e922f25eca4009d3a6a99/gusoff-5p-pkg-fordham-g-wcbseryr-hi-res-still-00-00-5513.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T18:20:22-04:00",
  "addDate": "2025-08-15T22:24:57.797613+00:00",
  "refreshDate": "2025-08-15T22:24:57.797615+00:00",
  "score": 1.0,
  "title": "Texas man reunited with his lost college ring 56 years after it slipped into the Long Island sound",
  "description": "After spending more than a half century at the bottom of the Long Island Sound, a long lost college ring has been reunited with its owner.",
  "content": "After spending more than a half century at the bottom of the Long Island Sound, a long lost college ring has been reunited with its owner.\n\nIt's thanks to Port Jefferson resident Dave Orlowski, who uses a metal detector to hunt for history and treasures. He's unearthed dozens of jewels, but their owners can be unknowable.\n\n\"I don't do it for money. I do it for the thrill,\" Orlowski said. \"You never know what you're going to pull out.\"\n\nWeeks ago, at Cedar Beach in Mount Sinai, Orlowski pulled out a priceless treasure, complete an ID.\n\n\"It said Alfred DiStefano, class of 1969, Fordham University,\" Orlowski said.\n\nThat started another hunt. Orlowski contacted Karen Manning, the Facebook page administrator for the Fordham Class of '69.\n\n\"Al sent me a message, and I said did you lose your ring, your Fordham ring, and he said yes, a long time ago,\" Manning explained.\n\nFifty six years ago, to be precise.\n\nThe ring was shipped to Alfred DiStefano in Texas, where the retired doctor had his postman record the reunion.\n\n\"This is a miracle. I couldn't describe it any other way,\" he said.\n\nHe recalled watching the sunset on a pier near Cedar Beach in 1969.\n\n\"I remember it like it was yesterday. I remember watching it slip off my finger into the water, and it was deep,\" he said. \"I said, it's gone.\"\n\nDiStefano said the gold palladium ring held up remarkably well after spending 56 years in the Long Island Sound.\n\n\"It's great. I haven't taken it off since I got it. I figured if I make it another 56 years, it will be on my finger. They can bury me in it,\" he said.\n\nThe ring, worth about $100 in 1969, could now have been sold for more than $3,000. Orlowski credits his wife for helping him decide it was worth far more than its weight in gold.\n\n\"She said if it were your ring, you would want it returned, and I said question answered, right there,\" Orlowski said.\n\n\"I think a lot of people would not go out of their way, the extra mile. He did, and I really appreciate it,\" DiStsfano said.\n\n\"He's very happy. It makes me happy that it made him happy,\" Orlowski said.\n\nThe ring was buried more than a foot deep. With the help of good hearts, it found its way home.",
  "medium": "Article",
  "links": [
    "https://www.cbsnews.com/team/carolyn-gusoff/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Dave Orlowski",
      "weight": 0.09658017
    },
    {
      "name": "Port Jefferson resident Dave Orlowski",
      "weight": 0.094438784
    },
    {
      "name": "Orlowski",
      "weight": 0.09282714
    },
    {
      "name": "Long Island",
      "weight": 0.07905659
    },
    {
      "name": "Alfred DiStefano",
      "weight": 0.072662584
    },
    {
      "name": "Cedar Beach",
      "weight": 0.06783154
    },
    {
      "name": "Fordham University",
      "weight": 0.06768002
    },
    {
      "name": "Karen Manning",
      "weight": 0.06529097
    },
    {
      "name": "his lost college ring",
      "weight": 0.06427793
    },
    {
      "name": "Mount Sinai",
      "weight": 0.058986977
    }
  ],
  "topics": [
    {
      "name": "Academia"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.82666015625
    },
    {
      "name": "/News/Local News",
      "score": 0.7607421875
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.388427734375
    }
  ],
  "sentiment": {
    "positive": 0.3128086,
    "negative": 0.25438148,
    "neutral": 0.4328099
  },
  "summary": "After 56 years of searching for lost college ring, Dave Orlowski, a Port Jefferson resident, Texas, has been reunited with his long lost Fordham University college ring. The ring, which was found at Cedar Beach in Mount Sinai, was identified by Orlow as Alfred DiStefano, class of 1969, and sent to the Facebook page administrator for the Fordham Class of '69. The retired doctor had his postman record the reunion. The gold palladium ring was found to have survived its 56 years in the Long Island Sound and could have sold for over $3,000.",
  "shortSummary": "A Texas man was reunited with his lost college ring 56 years after it was lost in the Long Island Sound, thanks to Dave Orlowski's treasure hunt.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1e6c9b70dd394517aa6de3f4964511af",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/team/carolyn-gusoff/",
      "text": "Lost ring returned 56 years after it slipped into the Long Island Sound\nAfter spending more than a half century at the bottom of the Long Island Sound, a long lost college ring has been reunited with its owner.\nCarolyn has covered some of the most high profile news stories in the New York City area and is best known as a trusted, tenacious, consistent and caring voice of Long Island's concerns.\nHer documentary 37% on CBS News New York exposed the shocking dysfunction of a school district on Long Island with one of the worst graduation rates in the USA.\nHer CBS New York investigative story \"Littered Landscape\" earned a 2020 Emmy Award, a First Place New York AP Award, LI Press Club and FOLIO awards, and resulted in the overdue clean up of many Long Island's adopted highways.\nShe came to WCBS in 2012 after three years at Fox5 WNYW where she often covered the lead story of the day on Good Day New York. Prior to that, she was with WNBC for 15 years. In addition to her reporting role as Long Island Bureau Chief, she co-anchored the station's top-rated Saturday and Sunday morning program \"Weekend Today in New York\" for five years.\nHer reporting over the last three decades includes some of the biggest New York stories of our time: the terror attacks of 9-11, massive power outages and the massacre on the Long Island Railroad. She reported tirelessly on the devastation wrecked by Hurricane Sandy. She was one of the first reporters on the scene at three commercial jetliner crashes (Avianca Flight 52, TWA Flight 800, American Airlines Flight 587). During the Blizzard of '96, Gusoff reported for 36 hours straight on the historic storm's toll and has been in the thick of nearly every major weather event to strike the New York area since.\nGusoff moved to NBC from News 12 Long Island where she was credited for in-depth coverage of national stories such as the kidnapping of Katie Beers, the Tankleff murders and the Amy Fisher/Joey Buttafuoco scandal. She was also a fill-in anchor for the nation's first 24-hour regional news network. Her broadcasting career began as anchor/ reporter for the ABC affiliate, WEVU-TV, in Fort Myers, Florida.\nHer collaboration with Katie Beers on Buried Memories has earned her the distinction as a New York Times best-selling author.\nHer many honors include four New York Emmy Awards and 17 New York Emmy nominations for Journalistic Enterprise-Long Island beat reporting, writing, research and environmental reporting and was part of the winning team that earned WCBS an Emmy for its coverage of Superstorm Sandy. Gusoff also won a New York Emmy Award for On-Camera Performance/General Assignment Reporting for the Mepham Hazing Scandal.\nIn more than three decades, Gusoff has won scores of Long Island Fair Media Council FOLIO Awards.\nGusoff holds a Master of Science Degree in Journalism from Columbia University and a Bachelor of Arts Degree in Government and English from Cornell University, where she was Editor-in Chief of the Cornellian and a U.S. Congressional intern for then Senator Joe Biden and U.S Senator Alfonse D'Amato.\nShe devotes much of her time in leadership roles to charitable causes and local community organizations. Carolyn is a recipient of the Public Relations Professionals of Long Island's Outstanding Media Member Award. She has survived breast cancer twice and working motherhood, and speaks publicly with passion and humor about both challenges.\nGusoff was born in New York City and lives in Nassau County with her husband and their two children.\nAfter spending more than a half century at the bottom of the Long Island Sound, a long lost college ring has been reunited with its owner.\nA 16-year-old Long Island girl was banned from school for not taking a required vaccine, but a federal judge has ordered her district to allow the rising junior to return.\nA federal watchdog is launching an audit into why a dozen air traffic controllers were moved from New York to Philadelphia last year.\nThe dreaded spotted lanternfly doesn't bite and doesn't sting, but we have all been told to kill the invasive insect on sight.\nThe man accused of shooting a Suffolk County police officer appeared in court Friday, as the wounded officer was released from the hospital.\nThe officer was shot in the face and treated at Stony Brook University Hospital, where he is now in stable condition, police say.\nA Long Island woman who replaced her front lawn with native plants was issued a fine because officials said it was ugly and violated the village's code.\nOil has stopped flowing into Long Island's Mill River, but not before an estimated 1,000 gallons of greasy fluid leaked into the water.\nA former Long Island sleep center worker who pleaded guilty to placing hidden cameras in facility bathrooms was offered probation Tuesday.\nEngineers shut down the 60-year-old Fire Island Inlet Bridge on Long Island after a boat captain saw falling debris.\nLongtime former Long Island Rep. Carolyn McCarthy, who died in June, will be laid to rest on Long Island on Tuesday.\nA man is facing attempted murder charges stemming from a weekend road rage incident on Long Island. In court on Monday, his attorney called the incident self defense.\nExcessive heat is expected to hit NYC over the next few days, after summer officially arrived Friday night.\nThere is controversy over a New York State Regents exam study packet that inaccurately defines Zionism and includes factual errors on the history of the conflict.\nAuthorities say the driver died when the car crashed into the Manhasset Quaker Meeting House on Northern Blvd. near Onderdonk Ave."
    }
  ],
  "argos_summary": "A metal detectorist in Port Jefferson, Dave Orlowski, recovered a Fordham University class‑of‑1969 ring that had been lost in the Long Island Sound for 56 years. He identified the owner, Alfred DiStefano, through a Facebook group and arranged for the ring to be returned to him in Texas. DiStefano, a retired doctor, was delighted to have the gold‑palladium ring back, which had survived the sea remarkably well. The find highlights the thrill of treasure hunting and the joy of reconnecting lost items with their rightful owners.",
  "argos_id": "I2S9QZ9J9"
}