{
  "url": "https://www.latimes.com/socal/daily-pilot/news/story/2025-08-15/pac-man-exhibit-in-irvine-celebrates-45-years-of-iconic-game",
  "authorsByline": "Jessica Peralta",
  "articleId": "426be80ee0674479a5bc47089a75aed8",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/b97e2bd/2147483647/strip/true/crop/998x524+12+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2f%2Fbc%2F5864e040460db41d12a5b9050152%2F54531647998-50552109ed-b.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T23:33:35.132000+00:00",
  "addDate": "2025-08-15T23:44:27.305211+00:00",
  "refreshDate": "2025-08-15T23:44:27.305212+00:00",
  "score": 1.0,
  "title": "PAC-MAN exhibit in Irvine celebrates 45 years of iconic game",
  "description": "The exhibit runs through Sept. 28 at Great Park Gallery.",
  "content": "Visitors attend the opening reception for “Journey Through the Maze: 45 Years of PAC-MAN.” The exhibit runs through Sept. 28 at Great Park Gallery.\n\nA simple circle colored yellow with a piece taken out, and four colored “ghosts,” sparked a cultural phenomenon in 1980 that remains 45 years later.\n\nEven if you’ve never played PAC-MAN, the maze-themed video game designed by Namco (now Bandai Namco Entertainment Inc.), you can likely envision this tiny character that became big in the ’80s.\n\n“Since the official introduction, PAC-MAN sparked a worldwide phenomenon that attracted multiple generation of players across genders,” said Susan Tran, senior director of Brand Development for PAC-MAN at Bandai Namco Entertainment America Inc. in Irvine. “Its popularity led to several game sequels, a full merchandising program and hit music single as well as two animated television series.\n\n“With record-breaking achievements, PAC-MAN has been recognized by the Guinness World Records with awards such as Most Successful Coin-Operated Game. Bandai Namco continues to release new console and mobile games and this year, PAC-MAN commemorates its 45th anniversary with a variety of partnerships, activations and launches.”\n\nPart of the celebration is an exhibit running through Sept. 28 at Great Park Gallery in Irvine called “Journey Through the Maze: 45 Years of PAC-MAN,” featuring artwork and memorabilia from Bandai Namco as well as more than 50 professional artists from all over the world.\n\nThere are arcade cabinets with classic gameplay experiences, a timeline history of the game’s evolution, reproductions of original drawings, interactive displays and other activities. In May, there was a “PAC-MAN Pixel Drawing and Collage” event and in July, a PAC-MAN-themed fingerboarding (miniature skateboarding) experience with custom mini skate parks. This month featured a “Gaming Through the Ages” panel discussion with the artists featured in the exhibit.\n\n“A lot of them were mentioning and talked about [in the panel] just how simple it is, but how anxiety-inducing that game was and that’s what made it so memorable and addictive because it was so simple and iconic,” said San Diego artist Patrick Ballesteros, who is featured in the exhibit, helped curate some of the other artists and led the recent panel. “You just watch this little person go across the screen getting food, trying to avoid ghosts, and that was the whole game. But you were there hours and hours and you remember being a kid in there. … You were just putting quarters in trying to move on to the next level, not knowing if there was ever an end. I think that’s the part that connected [a lot] of these artists is because we all remembered playing the game and the actual arcade.”\n\nHe said it was very different back then compared to now, where players have online and console gaming.\n\n“I think that’s the part that has kind of elevated PAC-MAN is that we have the old-schoolers like us doing that,” he said. “But then we also introduced it to our kids, who now understand PAC-MAN and it still has that appeal.”\n\nAdam Sabolick, program coordinator for arts and exhibitions for the city of Irvine and PAC-MAN exhibit curator, said the gallery does three exhibitions a year, ranging from historic topics to pop culture and contemporary art.\n\n“It just seemed like a perfect fit for one of those kind of pop culture shows,” Sabolick said of selecting PAC-MAN as an exhibit theme. “I also think there’s a timelessness to the game in that it would resonate with, obviously, people who grew up in the ‘80s playing PAC-MAN, but also, I’m in my mid-thirties, when I go to the arcade, I go and play PAC-MAN.”\n\nHe said at the exhibition, they see a lot of children coming in and playing in the arcade cabinets — getting just as excited about it as the 55-year-olds who come in for a nostalgic experience. Sabolick said one of the really important elements of the PAC-MAN story is how it was one of the first video games that wasn’t about violence.\n\n“It’s also a very early influential game, so it’s not just like any video game,” he said. “It’s a game that kind of opened up a lot of conversations around gaming, a lot of ideas around gaming and I think some of the elements that the game kind of trail-blazed are still thought about heavily today in contemporary game design.”\n\nSabolick said there’s a whole section of the exhibit that’s focused on merchandise — with everything from lunch pails and coffee cups to vinyl records, books and temporary tattoos.\n\n“You see as technology shifts from generation to generation how PAC-MAN has constantly reinvented itself outside of the video game itself,” he said.\n\nThere’s more than 50 original artworks that make up about half of the exhibit, with a range of aesthetics, from minimalist to animated and digital representations.\n\n“We call that area of the show the tribute wall,” Sabolick said. “These are professional working artists that are paying tribute to PAC-MAN’s influence and I think that’s a really important element of the show, because the story of how the creator of PAC-MAN created PAC-MAN and came up with the concept is something that’s super inspiring, but it’s very simple as well.”\n\nThe PAC-MAN character shape was inspired by what a pizza with a slice missing looks like. Tran said Toru Iwatani set out to create a game that appealed to new audiences — something that was different from other games in the market.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other games",
      "weight": 0.083485626
    },
    {
      "name": "iconic game",
      "weight": 0.08047432
    },
    {
      "name": "contemporary game design",
      "weight": 0.07650874
    },
    {
      "name": "several game sequels",
      "weight": 0.075837724
    },
    {
      "name": "PAC-MAN exhibit curator",
      "weight": 0.07100567
    },
    {
      "name": "PAC-MAN exhibit",
      "weight": 0.07005941
    },
    {
      "name": "PAC-MAN",
      "weight": 0.06176189
    },
    {
      "name": "Bandai Namco Entertainment Inc.",
      "weight": 0.060264114
    },
    {
      "name": "Bandai Namco Entertainment America Inc.",
      "weight": 0.05851818
    },
    {
      "name": "Bandai Namco",
      "weight": 0.05763618
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.6416015625
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.59375
    }
  ],
  "sentiment": {
    "positive": 0.3941893,
    "negative": 0.1816666,
    "neutral": 0.42414418
  },
  "summary": "A 45-year-old video game PAC-MAN, designed by Namco (now Bandai Namco Entertainment Inc. in Irvine, California, has been celebrating its 45th anniversary with a special exhibit at Great Park Gallery celebrating the launch of new console and mobile games. The exhibit, \"Journey Through the Maze: 45 Years ofPAC-MAN,\" features artwork and memorabilia from Bandai Nio and over 50 professional artists from around the world. The interactive exhibit also includes arcade cabinets with classic gameplay experiences, a timeline history of the game’s evolution, reproductions of original drawings, interactive displays and activities. The event is part of a larger celebration of PAC-man's 45 years of popularity.",
  "shortSummary": "A PAC-MAN exhibit in Irvine celebrates its 45th anniversary, featuring original artwork, memorabilia, and interactive activities, with multiple partnerships and launches.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "854469e5ca71424195c9087080744ee1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The 45th‑anniversary celebration of PAC‑MAN is highlighted by an exhibit at Great Park Gallery in Irvine, featuring artwork, memorabilia, and classic arcade cabinets that trace the game’s evolution. The show includes interactive displays, a timeline, and a tribute wall with over 50 artist renditions, while events such as a pixel‑drawing contest and fingerboarding experience engage visitors of all ages. A panel discussion with participating artists explored the game’s simple yet addictive design and its lasting cultural impact. Curators emphasize PAC‑MAN’s role as a pioneering, non‑violent video game that opened new conversations in gaming and continues to reinvent itself across generations.",
  "argos_id": "IADTTTXSQ"
}