{
  "url": "https://www.yahoo.com/news/articles/opinion-death-incarceration-enough-205729054.html",
  "authorsByline": "Jennifer Herron",
  "articleId": "b53fafef5b6645539f675851aed63701",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/6a45471121a9c603dc21f0dea351fae91366beed592e0d15d97a1361fe18f0d8/ynews/resizefill_w1200/https://media.zenfs.com/en/deseret_news_992/85eb81b61d2c80bcbada4bd781cf01ee",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T20:57:29+00:00",
  "addDate": "2025-08-15T21:21:23.108869+00:00",
  "refreshDate": "2025-08-15T21:21:23.108873+00:00",
  "score": 1.0,
  "title": "Death by incarceration is enough",
  "description": "Jennifer Heron does not believe the man who killed her mother should be executed. Here's why.",
  "content": "I am the oldest daughter born to Maurine Hunsaker, who was murdered by Ralph Menzies in 1986. She was 17 years old at the time of my birth. She was on welfare and barely getting by having one child before me, and for that and other reasons I was placed for adoption.\n\nUnlike my older brother, I don’t recall meeting my birth mother, but it is possible that I did. My grandmother was a friend of the family that adopted me, which is how the adoption was arranged.\n\nI was nine when the murder happened. I did not understand why at the time, but my adopted mom made me watch the news coverage. That memory still stands out in my mind today, and I can honestly say that I have lived with the consequences of this murder for nearly 40 years.\n\nSeven years after the murder, I learned that Maurine Hunsaker was my birth mother. My adoptive parents had my aunt save every news clipping and anything that had to do with her. All of these materials were eventually given to me.\n\nShortly after I learned of her identity, I met and developed relationships with Maurine’s other children, my half-brothers and half-sister. I am so grateful, because it was through getting to know them that I got to know something of my birth mother, beyond the pain and difficulty of knowing her only through such news clippings.\n\nNot only did the heinous murder take away my birth mother and any chance I had of knowing her personally, but it also robbed me of a relationship with my birth father, whom I only recently met through a DNA test. These losses have been a constant presence in my life, affecting me in ways that are impossible to fully describe.\n\nBeing denied the chance to ever meet my parents left me with a feeling of emptiness and loneliness that has never truly gone away. It has impacted my ability to form deep connections with others, and at times, made me question my own sense of self. The latent trauma of my mother’s murder has also contributed to lifelong, ongoing struggles with anxiety and depression.\n\nOver the years, I’ve wrestled with complex emotions surrounding this case. There was a time when I felt intense hatred towards Mr. Menzies. Through personal growth and introspection, I’ve come to realize that I don’t hate Mr. Menzies as a person; I hate the actions he took that caused so much pain and suffering.\n\nI stand before you today opposed to the death penalty. While I recognize the severity of the crime that was committed, I do not believe that justice will be served by taking another life. I have experienced firsthand the consequences of a life being taken, and I cannot support a system that perpetuates this cycle of violence. Having lived with this tragedy every day for decades, I am exhausted by the constant reminders, the media attention and the uncertainty. No murder victim’s family should have to endure this.\n\nMy views are also informed by my belief that executing Mr. Menzies will only create more victims. His family will feel pain and loss, just as my family and I have. I don’t believe that justice can truly be served after so many years, and I would rather see the resources and energy being spent on this execution directed towards more productive and healing purposes.\n\nAs a society, we must hold ourselves to a higher standard. Particularly with regard to Mr. Menzies’ physical and mental conditions, I feel that executing him will reflect poorly on us as a society. He is no longer a threat to anyone, especially from a wheelchair while tethered to an oxygen tank. I would rather live in a society that values compassion and rehabilitation over retribution — especially for the least among us.\n\nI believe that true closure may be difficult to achieve for anyone who has experienced such loss. I hope that by sharing my story and my views, I can contribute to a system that focuses on healing, rather than violence. Perhaps when this chapter finally ends, I can continue to heal and find my own way to live with the pain that has shaped my life.\n\nUltimately, I’m not seeking revenge or retribution. I want to find a way to move forward from this tragedy without more violence, and without creating more family members of someone killed by unnecessary violence.\n\nClemency means mercy. The clemency process should not be a retrial, but an evaluation of whether mercy is warranted. This is why I urge the Utah Board of Pardons and Parole to commute Ralph Menzies’ sentence of execution by firing squad to a sentence of death by incarceration.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Menzies",
      "weight": 0.07593552
    },
    {
      "name": "Ralph Menzies",
      "weight": 0.06883591
    },
    {
      "name": "more family members",
      "weight": 0.06260885
    },
    {
      "name": "Menzies",
      "weight": 0.061975114
    },
    {
      "name": "Maurine Hunsaker",
      "weight": 0.058177028
    },
    {
      "name": "more violence",
      "weight": 0.057104763
    },
    {
      "name": "such news clippings",
      "weight": 0.05616933
    },
    {
      "name": "times",
      "weight": 0.050011758
    },
    {
      "name": "unnecessary violence",
      "weight": 0.048888188
    },
    {
      "name": "more victims",
      "weight": 0.04871876
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.96533203125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.87451171875
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.64990234375
    },
    {
      "name": "/News/Other",
      "score": 0.49267578125
    }
  ],
  "sentiment": {
    "positive": 0.068856,
    "negative": 0.6819703,
    "neutral": 0.2491737
  },
  "summary": "The oldest daughter of Maurine Hunsaker, murdered by Ralph Menzies in 1986, her birth mother, was placed for adoption after she was murdered. The murder left her with no chance of meeting her birth family and a lifelong struggle with anxiety and depression, which has affected her relationship with others and her sense of self. The death penalty has been condemned by the author, who believes it will not serve justice and will instead be used as a tool for healing rather than retribution. She urges the Utah Board of Pardons to commute the death penalty to a firing squad sentence of death by incarceration. The author argues that the death sentence should be commended for the sake of healing and rehabilitation, not retribution.",
  "shortSummary": "Aneurin Hunsaker, whose mother was murdered by Ralph Menzies in 1986, opposes the death penalty and advocates for mercy instead.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "82631d1526824f7b82f987c136d606d7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The author, adopted after her birth mother Maurine Hunsaker was murdered by Ralph Menzies in 1986, recounts the long‑term trauma of losing her parents and the emotional journey of learning her identity and connecting with half‑siblings. She explains how the murder has shaped her sense of self, contributed to anxiety and depression, and left her with a lingering emptiness. Despite the severity of Menzies’ crime, she opposes the death penalty, arguing that execution would perpetuate violence, cause further suffering, and that clemency would better serve healing and compassion. She urges the Utah Board of Pardons and Parole to commute Menzies’ sentence to incarceration, emphasizing that true closure should focus on rehabilitation rather than retribution.",
  "argos_id": "ITQ1YDFNP"
}