{
  "url": "https://www.businessinsider.com/interest-rates-fed-cuts-outlook-bond-market-10-year-yield-2025-8",
  "authorsByline": "Jennifer Sor",
  "articleId": "3bab0fe59a114df28ca6b9283203328e",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/689f35e2194a2d49b8aea043?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T14:50:30+00:00",
  "addDate": "2025-08-15T14:57:58.058001+00:00",
  "refreshDate": "2025-08-15T14:57:58.058002+00:00",
  "score": 1.0,
  "title": "Fed rate cuts could face a big obstacle in the bond market",
  "description": "The 10-year Treasury yield will be a key factor determining how aggressively the Fed can cut rates, Marc Sumerlin, a contender for Fed Chair, said.",
  "content": "President Donald Trump could soon get his wish for lower interest rates, but there's a wrinkle in the outlook for more cuts from the Federal Reserve. Marc Sumerlin, an economist on the president's shortlist for the next Fed Chair, said that he thinks the central bank could run into a big obstacle as it tries to lower interest rates further: the bond market.Speaking to Bloomberg on Friday, Sumerlin pointed to the Treasury yield curve, essentially the difference in yields among short and long-dated government bonds.The 10-year yield is hovering around 55 basis points above the 2-year, which indicates that the Fed has room to cut interest rates by that amount, Sumerlin said, adding that he supported a jumbo-sized 50 basis-point rate cut in September.\"You know you can cut by that amount without really upsetting things,\" Sumerlin said.But, if the Fed were to cut rates 50 basis points at its September policy meeting and the 10-year Treasury yield were to go up in response, that'll send a clear message to central bankers. \"You have to stop cutting. It's that simple,\" Sumerlin said.The 10-year US Treasury yield — which Trump's team has said the president is monitoring closely — is a major influence on borrowing costs for consumer loans like mortgages as well as corporate debt. A further rise in the 10-year would be a tough pill to swallow. The weakest part of the economy at the moment is the housing market, Sumerlin said, adding that the Fed couldn't afford to have the 10-year yield go up.\"You can't have the long-end go up. And that's your constraint right now,\" he added.It could also spell bad news for the inflation outlook. If the 10-year yield were to climb as a result of the Fed cutting interest rates, that's a sign bond investors are expecting inflation to rise as the central bank loosens monetary policy, and are pricing in higher rates in over the long term in response.Trump has harangued Fed Chair Powell for months over interest rates, demanding the Fed cut despite lingering concerns about higher inflation from tariffs. In posts on Truth Social, he's called the current central bank chief \"Too Late,\" a \"major loser,\" and flirted with the idea of firing Powell, though he clarified earlier this year that he would let him ride out the rest of his term.Sumerlin, a former economic policy advisor to President George W. Bush, is on Trump's list of contenders for the new Fed Chair. US Treasury Secretary Scott Bessent told Fox Business on Thursday that he was vetting all the candidates.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fed rate cuts",
      "weight": 0.10739798
    },
    {
      "name": "interest rates",
      "weight": 0.09998306
    },
    {
      "name": "lower interest rates",
      "weight": 0.096581146
    },
    {
      "name": "Fed Chair Powell",
      "weight": 0.09121435
    },
    {
      "name": "higher rates",
      "weight": 0.087738894
    },
    {
      "name": "rates",
      "weight": 0.0811116
    },
    {
      "name": "Fed",
      "weight": 0.0792582
    },
    {
      "name": "Marc Sumerlin",
      "weight": 0.07465032
    },
    {
      "name": "Sumerlin",
      "weight": 0.07431319
    },
    {
      "name": "yields",
      "weight": 0.07411335
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.96533203125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9267578125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9248046875
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.85986328125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.64892578125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.57080078125
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.474853515625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.4453125
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.400634765625
    }
  ],
  "sentiment": {
    "positive": 0.04128898,
    "negative": 0.81168413,
    "neutral": 0.14702684
  },
  "summary": "President Donald Trump has been lobbying for lower interest rates from the Federal Reserve, but this could pose a significant obstacle for further reductions. Economist Marc Sumerlin, who is on the president's shortlist for the next Fed Chair, suggests that the central bank may face a challenge in the bond market as it attempts to lower rates. He suggested that if the Fed were to cut rates 50 basis points at its September policy meeting and the 10-year Treasury yield were to rise in response, it would send a clear message to central bankers. This could signal bad news for the inflation outlook.",
  "shortSummary": "The Federal Reserve faces a potential hurdle in lowering interest rates, with the 10-year Treasury yield rising amid economic concerns and inflation concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8ca6fbfe59774bd5b482452a618b900c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Donald Trump is pushing for lower interest rates, but economist Marc Sumerlin warns that the Federal Reserve could hit a roadblock in the bond market. He notes that the 10‑year Treasury yield is about 55 basis points above the 2‑year, giving the Fed room for a 50‑basis‑point cut, yet such a move could push the 10‑year yield higher, signaling rising inflation expectations and hurting the housing market. Sumerlin cautions that a rise in the long‑end yield would force the Fed to halt cuts. Trump has publicly criticized Fed Chair Jerome Powell and is considering Sumerlin for the next Fed Chair position.",
  "argos_id": "JHWBUODCZ"
}