{
  "url": "https://financialpost.com/globe-newswire/first-trust-portfolios-canada-announces-cap-buffer-and-dates-of-august-buffer-etf-4",
  "authorsByline": "GlobeNewswire",
  "articleId": "c78865e907a84073b3f838a27e21d215",
  "source": {
    "domain": "financialpost.com",
    "paywall": true,
    "location": {
      "country": "ca",
      "city": "Toronto",
      "coordinates": {
        "lat": 43.6534817,
        "lon": -79.3839347
      }
    }
  },
  "imageUrl": "https://www.globenewswire.com/newsroom/ti?nf=OTUxMzY0MCM3MTAyODA1IzUwMDAyNTU2Ng==",
  "country": "ca",
  "language": "en",
  "pubDate": "2025-08-16T00:09:01+00:00",
  "addDate": "2025-08-16T00:16:29.336712+00:00",
  "refreshDate": "2025-08-16T00:16:29.336714+00:00",
  "score": 1.0,
  "title": "First Trust Portfolios Canada Announces Cap, Buffer and Dates of August Buffer ETF",
  "description": "TORONTO, Aug.  15, 2025  (GLOBE NEWSWIRE) —",
  "content": "TORONTO, Aug. 15, 2025 (GLOBE NEWSWIRE) — (“First Trust Canada”), announced today that the cap, buffer and dates for the next Target Outcome Period for the First Trust Vest U.S. Equity Buffer ETF – AUG (AUGB.F) (the “fund” or “August Buffer ETF”) are as follows:\n\nThe fund seeks an outcome that provides investors with returns (before fees, expenses and taxes) that match the price return of the SPDR® S&P 500® ETF Trust (“SPY” or “underlying ETF”), up to a predetermined upside cap, while providing a buffer against potential SPY losses. The fund is managed and sub-advised by Vest Financial LLC (“Vest”) using a “target outcome strategy” or pre-determined target investment outcome.\n\nGet the latest headlines, breaking news and columns.\n• There was an error, please provide a valid email address. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Top Stories will soon be in your inbox. We encountered an issue signing you up. Please try again\n\nIf an investor purchases hedged units after the first day of the Target Outcome Period, they will likely have a different return potential than an investor who purchased hedged units at the start of the Target Outcome Period and the buffer the fund seeks may not be available.\n\nFirst Trust Canada believes a buffer against a level of losses can help investors stay invested during volatile times. The fund offers a way to gain access to outcome-based investing—specifically to buffer against a level of downside risk while allowing growth to a maximum cap— eliminating bank credit risk, in a convenient, flexible investment vehicle.\n\n\n\n\n\n First Trust Canada is the trustee, manager and promoter of the fund. First Trust Canada and its affiliates First Trust Advisors L.P. (“FTA”), portfolio advisor to the fund, an Ontario Securities Commission registered portfolio manager and U.S. Securities and Exchange Commission registered investment advisor, and First Trust Portfolios L.P., a FINRA registered broker-dealer, are privately held companies that provide a variety of investment services. FTA has collective assets under management or supervision of approximately U.S.$278 billion as of June 30, 2025 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts. For more information, visit www.firsttrust.ca.\n\n\n\n\n\n Vest is the creator of Target Outcome Investments®, which strive to buffer losses, amplify gains or provide consistent income to a diverse spectrum of investors. Today, Vest’s Target Outcome Strategies™ are available in mutual funds, exchange-traded funds (ETFs), unit investment trusts (UITs), collective investment trusts (CITs), and customizable managed accounts / sub-advisory services. For more information about Vest and the evolution of Target Outcome Investments, visit www.vestfin.com or contact Linda Werner at lwerner@vestfin.com or 703-864-5483.",
  "medium": "Article",
  "links": [
    "https://financialpost.com/subscribe",
    "https://financialpost.com/video-centre/",
    "https://www.globenewswire.com/Tracker?data=Tob6yjzn-X6iOakQUYFOqKJtZO3701lGrifn1GyScelpTHJtBXbiL7vSlbzTB2KvFNiseBahMSszAsR45kiig2apPrC5BAKY-XltPFdPn2TAUhUrRUjisEu91aY8RP2Y"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "First Trust Canada",
      "weight": 0.085687876
    },
    {
      "name": "unit investment trusts",
      "weight": 0.08560288
    },
    {
      "name": "mutual funds",
      "weight": 0.085486524
    },
    {
      "name": "Target Outcome Investments",
      "weight": 0.085286
    },
    {
      "name": "First Trust Portfolios Canada",
      "weight": 0.08522853
    },
    {
      "name": "pre-determined target investment outcome",
      "weight": 0.08429381
    },
    {
      "name": "First Trust Portfolios L.P.",
      "weight": 0.08279998
    },
    {
      "name": "First Trust Advisors L.P.",
      "weight": 0.08051804
    },
    {
      "name": "collective investment trusts",
      "weight": 0.07702713
    },
    {
      "name": "investment services",
      "weight": 0.07059799
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96875
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.95361328125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93408203125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.640625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.3076171875
    }
  ],
  "sentiment": {
    "positive": 0.18834482,
    "negative": 0.089353405,
    "neutral": 0.7223018
  },
  "summary": "First Trust Portfolio Canada (First Trust Canada) has announced the cap, buffer and dates for the next Target Outcome Period for the First Trust Vest U.S. Equity Buffer ETF – AUG (AUGB.F), which seeks to provide investors with returns that match the price return of the SPDR® S&P 500® ETF Trust (SPY). The fund is managed and sub-advised by Vest Financial LLC (Vest), using a “target outcome strategy” or pre-determined target investment outcome. First Trust Canada is the trustee, manager and promoter of the fund. The fund offers a way to gain access to outcome-based investing and allows growth to a maximum cap.",
  "shortSummary": "First Trust Canada announced the cap, buffer and dates for the August Buffer ETF, designed to buffer against potential SPY losses, run by Vest Financial LLC.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1dc914f8ec61467795056302a0320b6d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "First Trust Canada announced the cap, buffer and dates for the next Target Outcome Period of the First Trust Vest U.S. Equity Buffer ETF – AUG (AUGB.F). The ETF seeks to match the price return of the SPDR® S&P 500® ETF Trust (SPY) up to a predetermined upside cap while providing a buffer against potential SPY losses through a target outcome strategy. First Trust Canada serves as trustee, manager and promoter, while Vest Financial LLC creates the Target Outcome Investments framework used by the fund. The announcement highlights the fund’s aim to protect investors during volatile markets and offers a flexible, outcome‑based investment vehicle.",
  "argos_id": "JPEQJAQWH"
}