{
  "url": "https://www.bbc.com/news/articles/ckgdzj5nxmlo?at_medium=RSS&at_campaign=rss",
  "authorsByline": "Maria Cassidy",
  "articleId": "a9b6d5c0e6d84669b9e9dfdb2c4dbbf1",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/19b5/live/e8bc3e30-79f3-11f0-87a7-fdfee4a863a8.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T16:16:50.544000+00:00",
  "addDate": "2025-08-15T16:31:27.916052+00:00",
  "refreshDate": "2025-08-15T16:31:27.916055+00:00",
  "score": 1.0,
  "title": "Flintshire residents without water for second day as Wales prepares for heatwave",
  "description": "Thousands of people have been left without water for a second day due to a burst water main in Broughton.",
  "content": "Residents without water as Wales prepares for heatwave\n\nFrustrated residents in Flintshire have been left without water for a second day as some parts of Wales prepare for this year's fourth heatwave. Thousands of people have been affected by a burst water main in Broughton, with residents helping deliver bottled water to others, and long queues reported at water stations. Welsh Water said the water main will be fixed on Friday afternoon, although it warned disruption could continue with supplies expected to be restored to everyone on Sunday. \"This will take time as we need to avoid causing any secondary bursts on this extensive network which is over 500km,\" it said.\n\nThe burst water main is affecting residents in Flint, Holywell, Ffynnongroyw, Greenfield, Llanerch y Mor, Mostyn, Oakenholt, Talacre, Whitford, Aston, Queensferry, Hawarden, Ewloe, Mancot, Garden City, Shotton, Northop, Deeside and the surrounding areas. Two Cymru Premier matches have also been postponed due to the disruption. Bottled water stations across Flintshire are keeping people topped up but some have seen long queues. Beth Hall, animal keeper at Greenacres Animal Park which has a variety of farm and exotic animals, said she was concerned about the impact on the animals. \"We have camels that could drink 200ml in the space of a couple of minutes. We're heavily reliant on bottled water donations,\" she said. \"We [humans] have other sources of water like fizzy drinks, but animals rely on water. \"Its affected us a lot as a business. We rely on the summer holidays to get us through winter months.\" Ricky Blackwell from Connah's Quay is part of Deeside Roundtable community group and has started delivering water to local residents. \"Obviously we go to a lot of disabled people and pensioners who haven't been able to get it, they phone up and ask for priority deliveries,\" he said. \"We put them on the list but we can't guarantee it because obviously there's such a demand at the moment. So we've taken it off our own backs to just go round and get the water out to them.\"\n\nFiona Lettsome from Queensferry has been without water since Thursday and travelled to Mold for supplies. \"I come up to my daughter's and I didn't know it had come off obviously until I saw it on the news. \"I live on my own but you still need water for things like the toilet, so I'm using my water bottle,\" she said. James Fox, from Queensferry, said his water also went off on Thursday morning. \"We've been coming since then to come and get water. There's not much we can do,\" he said.\n\nWelsh Water CEO Peter Perry has apologised to customers, and said the company was working \"around the clock\" to get water back on, as well as providing alternative supplies. He said the delay was due to the \"nature of the main\", which is 30 inches (76cm) in diameter and 16ft (5m) underground. He added the \"safety of our workforce\" had to be considered due to the complex nature of the main. The company said the repair on a large main in Broughton carried out last weekend was done to get people back on supply as quickly as possible and allow it to refill the network. \"It wasn't meant to be a temporary repair, it was meant to be a permanent repair,\" Mr Perry told BBC Radio Wales Breakfast. \"Unfortunately that began to leak,\" he said, adding that engineers had planned to fix the main on Thursday evening under \"controlled conditions\" but were unable to do so.",
  "medium": "Article",
  "links": [
    "https://www.bbc.co.uk/news/articles/c8dery99ddzo",
    "https://www.bbc.co.uk/sport/football/articles/cp3e4dgp0pwo",
    "https://www.bbc.com/news/wales",
    "https://www.bbc.co.uk/news/articles/cwy17xjv2x2o"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "bottled water",
      "weight": 0.10785413
    },
    {
      "name": "water",
      "weight": 0.10605048
    },
    {
      "name": "water stations",
      "weight": 0.10510166
    },
    {
      "name": "Bottled water stations",
      "weight": 0.1034421
    },
    {
      "name": "bottled water donations",
      "weight": 0.10171919
    },
    {
      "name": "a burst water main",
      "weight": 0.06598459
    },
    {
      "name": "The burst water main",
      "weight": 0.065164305
    },
    {
      "name": "Flintshire residents",
      "weight": 0.06358978
    },
    {
      "name": "the water main",
      "weight": 0.06264613
    },
    {
      "name": "disabled people",
      "weight": 0.059388865
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Weather",
      "score": 0.873046875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.564453125
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.486572265625
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Electricity",
      "score": 0.365966796875
    }
  ],
  "sentiment": {
    "positive": 0.036772057,
    "negative": 0.77252173,
    "neutral": 0.19070625
  },
  "summary": "Flintshire residents have been left without water for a second day as Wales prepares for the fourth heatwave. A burst water main in Broughton has affected thousands of people, with residents helping deliver bottled water to others and long queues reported at water stations. Welsh Water expects the water main to be fixed on Friday afternoon, but warned that it could take time to avoid secondary bursts on the 500km network. The disruption is affecting residents in Flint, Holywell, Ffynnongroyw, Greenfield, Llanerch y Mor, Mostyn, Mostys, Oakenholt, Talacre, Whitford, Queensferry, Mancot, and the surrounding areas. Two Cymru Premier matches have also been postponed due to the disruption. Welsh CEO Peter Perry has apologised to customers and provided alternative supplies.",
  "shortSummary": "A burst water main in Flintshire has caused widespread water shortages, causing long queues, and animal welfare concerns as Wales braces for a heatwave.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3ebfe5b5115a491fb8467557e2ceaabb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.com/news/wales",
      "text": "NewsNewsWalesWales PoliticsResidents without water as Wales prepares for heatwaveThousands of people have been left without water for a second day due to a burst water main in Broughton. 1 hr agoWalesHalf a tonne of litter found after fireworks displayVolunteers collected 433kg of rubbish in just an hour after the fireworks event at Coney Beach.4 hrs agoWalesWarning issued as teens seen 'tombstoning' off pier Police are carrying out patrols in Penarth and along the coast to try and deter people.5 hrs agoWalesParking change will drive people away, traders sayParts of Cardiff will see a reduction in free parking if proposals go ahead.6 hrs agoWalesFootball club launches sticker book after relegationAberystwyth Town Football Club's 33-year run in Welsh football's top tier ended last season.8 hrs agoWalesHalf a tonne of litter found after fireworks displayVolunteers collected 433kg of rubbish in just an hour after the fireworks event at Coney Beach.4 hrs agoWales'Cool spaces' provide help as Wales faces heatwavesParts of Wales are set to experience their fourth heatwave of the year as people try to keep cool.1 hr agoWales'I felt phenomenal shame about being sexually abused' says BryantSir Chris Bryant talks about his early life, from his alcoholic mother to being ordained as a priest.3 hrs agoWalesWarning issued as teens seen 'tombstoning' off pier Police are carrying out patrols in Penarth and along the coast to try and deter people.5 hrs agoWalesWelsh party leader 'not important' for election - ReformA senior Reform UK member says having a Welsh leader is not crucial for the 2026 Senedd election.Rees-Zammit aiming to be 'best in the world' - LamLouis Rees-Zammit wants to become \"the best back-three player in the world\" according to new boss Pat Lam.'I saw the horrors in Hiroshima after the atomic bomb'A World War Two veteran is presented with a letter of thanks by the first minister of Wales.Man denied 'life-changing' bingo winnings after glitchAdam Wall planned to use the winnings to pay for his wedding before being told it was a \"technical error\".Boy 'traumatised' after rollercoaster accident, dad saysJohn Paul Baylis was at the amusement park with his son when the \"carnage\" ensued.Features & analysisDad and son's £1m steroid lab undone by dodgy dog grooming shopIt started as a sideline to pay the rent but ended in a million-pound drug business - and jail.Women's 'symbol of love' cutlery goes to auctionThe couple would dress in top hats and ride horses through the countryside in the 18th Century.In pictures: National Eisteddfod in WrexhamSoak up the atmosphere as Wrexham plays host to this year's Welsh cultural festival.'Women like me with severe sickness have to end our pregnancies'Sarah Spooner's husband once called an ambulance as she could not get off the floor due to the pain.Is this the end of the Newport tip Bitcoin saga?Mr Howells claimed his ex-girlfriend mistakenly chucked out a hard drive containing 8,000 bitcoins.SportBroadhead fee reflects 'real Championship quality' Wrexham had to break their own transfer record to get \"real Championship quality\" in signing Nathan Broadhead says manager Phil Parkinson.One Day Cup - Gloucestershire v Glamorgan lives scoresFollow live score updates as Gloucestershire host defending champions Glamorgan in the group stages of the men's Metro Bank One Day CupRees-Zammit aiming to be 'best in the world' - LamLouis Rees-Zammit wants to become \"the best back-three player in the world\" according to new boss Pat Lam.Wales defender Morgan joins Bristol CityWales defender Esther Morgan signs for Bristol City on a two-year contract.Swansea close in on Forest midfielder StamenicSwansea City are poised to sign Nottingham Forest and New Zealand midfielder Marko Stamenic on a permanent deal.Stories from Cymru FywDisgwyl ail gyfnod o dywydd poeth yr wythnos hon i Gymru Mae disgwyl i Gymru gael ail gyfnod o dywydd poeth o fewn wythnos gyda'r tymheredd yn cyrraedd hyd at 29C mewn mannau.Rhai i fod heb ddŵr tan ddydd Sul ar ôl i bibell dorri yn y gogleddDisgwyl i nam ar bibell ddŵr yn Sir y Fflint gael ei drwsio ddydd Gwener, ond fe allai rhai fod heb ddŵr dros y penwythnos.Arweinydd Cymreig Reform UK 'ddim yn bwysig' i'r etholiadDydy cael arweinydd i blaid Reform UK yng Nghymru ddim yn bwysig ar gyfer etholiad Senedd Cymru, yn ôl aelod blaenllaw.Beth sy'n arbennig am greigiau Ynys Môn?Mae Ynys Môn yn un o'r unig ddau Geoparc Byd-eang UNESCO yng Nghymru. Dim ond 229 o leoliadau sydd wedi derbyn y statws yma yn y byd. Latest updates1 hr ago'Cool spaces' provide help as Wales faces heatwavesParts of Wales are set to experience their fourth heatwave of the year as people try to keep cool.1 hr ago1 hr agoResidents without water as Wales prepares for heatwaveThousands of people have been left without water for a second day due to a burst water main in Broughton. 1 hr ago3 hrs ago'I felt phenomenal shame about being sexually abused' says BryantSir Chris Bryant talks about his early life, from his alcoholic mother to being ordained as a priest.3 hrs ago4 hrs agoWelsh party leader 'not important' for election - ReformA senior Reform UK member says having a Welsh leader is not crucial for the 2026 Senedd election.4 hrs ago4 hrs agoHalf a tonne of litter found after fireworks displayVolunteers collected 433kg of rubbish in just an hour after the fireworks event at Coney Beach.4 hrs ago5 hrs agoWarning issued as teens seen 'tombstoning' off pier Police are carrying out patrols in Penarth and along the coast to try and deter people.5 hrs ago6 hrs agoParking change will drive people away, traders sayParts of Cardiff will see a reduction in free parking if proposals go ahead.6 hrs ago8 hrs agoFootball club launches sticker book after relegationAberystwyth Town Football Club's 33-year run in Welsh football's top tier ended last season.8 hrs ago10 hrs agoWales' papers: Pass masters and horror as ride derailsA review of the front page stories from the daily and weekly newspapers in Wales.10 hrs ago..."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/c8dery99ddzo",
      "text": "'Cool spaces' provide help as Wales faces heatwaves\n- Published\nCommunities in Wales are setting up \"cool spaces\" to help people cope with the heat as they prepare for a second blast of hot weather in the space of a week.\nTemperatures are forecasted to reach 29C in Cardiff going into the weekend, after highs of 32.8C in the city on Tuesday.\nIt means some parts of Wales are set to experience their fourth heatwave of the year, although it will be cooler in north Wales and by the coast.\nOn Thursday, Natural Resources Wales (NRW) declared drought conditions in south-east Wales following the driest six-month period in decades.\nWelsh Water said there were no plans for restrictions to be placed on the use of water, however it urged people to take precautions in the heat.\n- Published1 day ago\n- Published26 July\n- Published3 days ago\nAt Caldicot's TogetherWorks community centre in Monmouthshire, manager Isla Arendell has been trying to encourage people to use the centre as a \"cool space\" where they can meet others away from the confined warmth in their homes.\n\"I suppose it's come off from the warm space during the winter, we're looking at perhaps being sort of like a cool space where people can come in, chill, we've got a lovely community garden people can sit in,\" she said.\nMore than 100 electric fans have been donated and given out at the centre, which Ms Arendell said had proved \"very popular\".\nJohn Hubbard, 72, who was attending the men's breakfast club on the site, said he has tried hard to keep his home cool.\n\"It's sort of counter to what we normally do in this country, but closing the windows, even if it's really hot, is the thing to do,\" he said.\n\"Unfortunately, our best rooms are our lounge and our bedroom face south, so we get the full blast of the sun.\"\nTony Knight, 81, added: \"I like the hot weather as long as it's not too hot. I go out every day for a walk, but if it's too hot I walk around the supermarkets and it's nice.\"\nResidents of care homes often have less choice about where they can go to keep cool.\nAt Pen-Y-Bont Care home in Abertillery, Blaenau Gwent, staff member Luke Griffiths said the team tried to keep communal spaces cool with air conditioning, and focused on making sure residents stayed hydrated.\n\"We think ahead, we do monitor our residents' fluid intake, we set fluid targets for each resident, we encourage regular breaks for our staff members as well and we ensure the ventilation is correct in the building,\" he said.\nJohn Greenland, 65, is a resident at the home and said he struggled in the warm weather.\nHe said: \"I don't like it. If I'm hot I try and cool down a bit. I have a lot of drinks. I get very hot and I sweat like anything.\"\nMartha Lowman, 80, said she did not enjoy seeing predictions of high temperatures on the weather forecasts.\nShe said: \"I like to keep in the shade and drink plenty of fluids. It's exhausting really. It's quite unusual for us to have such hot weather.\n\"When I lived in Australia, it was normal out there but this is not normal for us.\"\nWhile linking climate change with specific individual extreme weather events can be difficult, scientists say climate change is generally making heatwaves hotter, longer and more frequent.\nAccording to BBC weather forecaster and meteorologist Sabrina Lee, we may have to get used to this sort of weather more often.\nShe said: \"We expect our summers to be hotter and drier. When we get heatwaves, they're expected to become more frequent and intense and there's going to be more concerns in the future when it comes to wildfires and droughts.\"\nShe added we may need to alter how we carry out tasks that we have previously taken for granted.\n\"I think the tone of my forecasts will become more serious. We expect to have to adapt in future years, so our daily routines may have to be changed.\n\"For example, when we take the dog for a walk, or if you're an outdoor worker, you have to tweak your schedule to avoid some of that heat.\"\nFor those planning to be outside in the warm weekend weather, Celyn-Mai Clement, 23, from St John Ambulance Cymru, advised people to keep hydrated and wear a hat and sunglasses to avoid eye damage.\n\"We advise that you cover up using loose light clothing but the best advice is to use sunscreen,\" she said.\nOn Thursday, environment watchdog Natural Resources Wales said it had recorded the driest six-month period since the drought of 1976.\nAs a result, the threshold has been met to put south-east Wales in to drought status.\n\"The lack of significant rainfall has taken its toll on the environment, and we are receiving reports of low flows and dry riverbeds in some locations, low groundwater levels as well as reports of fish in distress and algal blooms,\" said Rhian Thomas, of NRW.\n\"Catchments in south-east Wales have been particularly impacted, with rivers receiving very little rainfall in recent months, and the Usk and Wye recording persistently high river temperatures which can threaten fish populations.\"\nNRW added that a drier season meant wildfires could occur more easily, but it was the \"rivers where we're seeing that impact at the minute\".\nIt said that all of the water used daily comes from our river systems, so if we can limit our use at home, that can add up to have an impact.\nHowever, Welsh Water said there was currently no shortage of drinking water.\n\"We have no concerns about reservoir levels across our operating area, with most at levels close to what we would expect at this time of year,\" they said.\n\"We are managing the extra demand associated with the dry weather in terms of preserving storage within our network service reservoirs, but at this stage we have no plans to introduce any temporary use bans.\""
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cwy17xjv2x2o",
      "text": "Thousands still without water due to burst main\n- Published\nThousands of people remain without water after temporary repairs to a burst main failed.\nWelsh Water said a full emergency repair was under way to fix the pipe in Broughton, Flintshire, but the company expected disruption to continue until Friday evening.\nFlint, Holywell, Ffynnongroyw, Greenfield, Llanerch y Mor, Mostyn, Oakenholt, Talacre, Whitford, Queensferry, Shotton, Connah's Quay, Garden City, Hawarden, Mancot and Sandycroft have all been affected.\nBottled water stations have been set up with deliveries being made to vulnerable customers.\nWelsh Water said it \"apologised\" to customers who are experiencing disruption.\nOn Thursday afternoon, the company said it will be \"working overnight\" to restore the water supply and will \"remain on the ground\" supporting customers.\nThe company confirmed customers will be compensated as a result of the burst main.\nHouseholds are set to receive £30 for each 12 hours without a water supply.\nBusinesses will receive £75 for each 12 hours they have been without a supply and will also be able to claim for any loss of income.\nThe company said the temporary repair on a large main in Broughton carried out last weekend was done to get people back on supply as quickly as possible and allow it to refill the network.\nThat would have given the water company enough storage time to go back and complete the permanent repair without any impact on supplies.\n\"Unfortunately, the temporary repair has not held and so we have to act quickly to carry out an emergency repair before full storage could be restored,\" it added.\n\"This is complex due to the pipe being located 5m (16ft) underground and close to underground electric cables and other services, which requires extra care,\" it added.\n\"We've had to do this repair quicker than planned and with lower levels of storage in several of our service reservoirs.\"\n\"Due to the scale of the network, it will then take us some time to safely refill the system, including the service reservoirs, and in turn restore supplies but we will keep customers informed.\"\nIn a letter to customers Welsh Water CEO Peter Perry apologised for the \"challenging\" and \"frustrating\" disruption to water supplies.\n\"We will conduct a full review of the incident and all aspects of our response,\" he added.\nPublic Health Wales (PHW) has urged people affected by the burst water main to \"protect their health\" by staying hydrated.\n\"It's particularly important to make sure that young children and the elderly are drinking enough water,\" it added.\nPHW said those feeding babies should use bottles provided by Welsh Water as supermarket bottles \"may contain too much sodium\".\nWelsh Water bottles can be collected from:\nJade Jones Pavilion, Flint CH6 5ER\nPark and Ride Car Park, Deeside Industrial Park, CH5 2NY\nCounty Hall Car Park, Mold CH7 6NF\n- Published16 January\n- Published23 April 2024\n- Published12 June"
    },
    {
      "url": "https://www.bbc.co.uk/sport/football/articles/cp3e4dgp0pwo",
      "text": "Burst water pipe forces two games to be postponed\n- Published\nTwo Cymru Premier fixtures have been postponed after a burst main left thousands of people in north Wales without water.\nConnah's Quay Nomads' home match against Bala Town scheduled for Friday night and Saturday's game between Flint Town United and Haverfordwest County have been called off..\nWelsh Water said a full emergency repair was under way to fix the pipe in Broughton, Flintshire, but the company expects disruption to continue until Friday evening.\nNew dates for both fixtures have not yet been agreed.\nIn a statement, the Football Association of Wales said: \"Dŵr Cymru (Welsh Water) have indicated repairs are unable to be completed quickly due to the complex nature of the pipe's position underground and the proximity to electric cables and other services.\n\"An early decision has been made on Saturday's fixture due to Haverfordwest's travel arrangements. Rearranged dates for both fixtures will be confirmed in due course.\"\nFlint have apologised to supporters for any inconvenience.\nConnah's Quay said in a social media post, external it had offered opponents Bala several alternative options but the game has been postponed.\n\"We have been in discussions earlier today and offered a new date, a reverse fixture at Maes Tegid both tonight and tomorrow, and also a neutral venue.\n\"However, our opponents have not agreed with those offers and therefore, a new date for this fixture will be announced in due course.\""
    }
  ],
  "argos_summary": "A 30‑inch water main burst in Broughton, Flintshire has left thousands without tap water for a second day, prompting Welsh Water to conduct emergency repairs and promise full restoration by Sunday while compensating affected households and businesses. Residents have been relying on bottled water stations and community volunteers to deliver supplies, with animal parks and vulnerable customers particularly impacted. The outage has forced the postponement of two Cymru Premier football matches and disrupted local services amid a looming heatwave, while Welsh Water’s CEO has apologized and highlighted the complexity of fixing the pipe beneath 5 m of earth and nearby utilities. Concurrently, Welsh authorities are promoting “cool spaces” and water‑conservation measures to cope with the region’s fourth heatwave of the year and record drought conditions in south‑east Wales.",
  "argos_id": "JZDH8ARFO"
}