{
  "url": "https://www.miamiherald.com/news/nation-world/world/article311723648.html",
  "authorsByline": "Kate Sullivan and Josh Wingrove, Bloomberg News",
  "articleId": "ed01f0c4ff3c4998b41ffd0c4a89a51b",
  "source": {
    "domain": "miamiherald.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.mcclatchy-wires.com/public/incoming/r6722/picture311723621/alternates/LANDSCAPE_1140/897b7508-fe11-4447-8bbc-2e067ba30f4f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T19:43:37-04:00",
  "addDate": "2025-08-16T00:35:53.519690+00:00",
  "refreshDate": "2025-08-16T00:35:53.519692+00:00",
  "score": 1.0,
  "title": "Trump says he believes Xi won't act on Taiwan",
  "description": "WASHINGTON - Donald Trump said Chinese President Xi Jinping told him he would not \"move on\" Taiwan a...",
  "content": "WASHINGTON - Donald Trump said Chinese President Xi Jinping told him he would not \"move on\" Taiwan as long as the U.S. president remained in office.\n\nTrump, speaking in a Fox News interview on his way to a summit with Russian leader Vladimir Putin to discuss a ceasefire more than three years after Russia's full-scale invasion of Ukraine, argued that world leaders - including Xi - would never attempt such an undertaking while he was president.\n\n\"I don't believe there's any way it's going to happen as long as I'm here,\" Trump said. \"He'll never do it as long as you're president, President Xi told me that.\"\n\nThe U.S. has long sought to deter Beijing from any military action seeking to unify the self-governing island of Taiwan with China by force.\n\nWhile the U.S. is a top military equipment supplier to Taipei, the U.S. has traditionally avoided making an explicit security guarantee, instead maintaining a policy of strategic ambiguity.\n\nThe 1979 Taiwan Relations Act calls on the U.S. to provide Taiwan the resources to defend itself and opposes any unilateral change in status, but does not explicitly say the U.S. would intervene.\n\nDuring the campaign, Trump suggested in an interview with Bloomberg News that Taiwan \"should pay us for defense.\"\n\nCopyright (C) 2025, Tribune Content Agency, LLC. Portions copyrighted by the respective providers.\n\nThis story was originally published August 15, 2025 at 7:43 PM.",
  "medium": "Article",
  "links": [
    "https://www.miamiherald.com/news/nation-world/world"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taiwan Relations Act",
      "weight": 0.09620822
    },
    {
      "name": "U.S.",
      "weight": 0.094251774
    },
    {
      "name": "Chinese President Xi Jinping",
      "weight": 0.09420352
    },
    {
      "name": "Taiwan",
      "weight": 0.093595184
    },
    {
      "name": "President Xi",
      "weight": 0.09256521
    },
    {
      "name": "Xi Jinping",
      "weight": 0.08672051
    },
    {
      "name": "Russian leader Vladimir Putin",
      "weight": 0.08438156
    },
    {
      "name": "Tribune Content Agency",
      "weight": 0.08112619
    },
    {
      "name": "Xi",
      "weight": 0.07978726
    },
    {
      "name": "Donald Trump",
      "weight": 0.07952664
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97509765625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.9111328125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.87451171875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.81396484375
    },
    {
      "name": "/News/World News",
      "score": 0.708984375
    }
  ],
  "sentiment": {
    "positive": 0.13433157,
    "negative": 0.41255996,
    "neutral": 0.45310846
  },
  "summary": "Donald Trump has stated that Chinese President Xi Jinping has told him that he will not \"move on\" Taiwan as long as the U.S. president remains in office. This statement was made during a Fox News interview ahead of a summit with Russian President Vladimir Putin. The US has long sought to prevent any attempt by China to unify Taiwan with China by force. The 1979 Taiwan Relations Act requires the US to provide Taiwan with resources for its defense but does not specify when it would occur.",
  "shortSummary": "Donald Trump believes Chinese President Xi Jinping won't act on Taiwan while he is president, maintaining a strategic ambiguity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e315145004e54aa5b1832effa083d2d6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Donald Trump claimed that Chinese President Xi Jinping told him he would not pursue Taiwan as long as Trump remained U.S. president, a statement made during a Fox News interview on his way to a summit with Russian leader Vladimir Putin. The remark underscores the U.S. policy of strategic ambiguity toward Taiwan, which relies on the 1979 Taiwan Relations Act to provide defensive resources without an explicit military guarantee. Trump’s comment follows his earlier suggestion that Taiwan should pay for its own defense. The U.S. has historically avoided direct intervention while maintaining a deterrent stance against Chinese military action on the island.",
  "argos_id": "NMK9658KI"
}