{
  "url": "https://www.newsmax.com/politics/govplanet-donald-trump-border-wall/2025/08/15/id/1222652/",
  "authorsByline": "Nicole Weatherholtz",
  "articleId": "caf43229df0a40bfa86ed03fc092356c",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=26f78a96-697d-4468-80c9-ebcb6738afb5&SiteName=Newsmax",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T14:28:45-04:00",
  "addDate": "2025-08-15T18:43:41.678298+00:00",
  "refreshDate": "2025-08-15T18:43:41.678299+00:00",
  "score": 1.0,
  "title": "Firm to Return $350M in Border Wall Materials to Government",
  "description": "Government surplus auction house GovPlanet is reportedly set to return up to $350 million in unused construction materials from President Donald Trump's unfinished southern border wall. The company had acquired...",
  "content": "Government surplus auction house GovPlanet is reportedly set to return up to $350 million in unused construction materials from President Donald Trump's unfinished southern border wall.\n\nThe company had acquired and planned to sell the unused steel panels, bollards, and concrete after former President Joe Biden halted construction when he took office in 2021.\n\nAccording to The Hill, U.S. Customs and Border Protection is currently negotiating the return of the materials with GovPlanet for pennies on the dollar.\n\nDepartment of Homeland Security (DHS) sources told NewsNation that the government and the auction site had struck a deal but did not elaborate further. Reports indicate, however, that GovPlanet and DHS agreed last week to have a third-party contractor take possession of the materials within 90 days.\n\nOn Wednesday, Trump told reporters that Attorney General Pam Bondi is working \"very hard\" to sue GovPlanet, which reportedly put the wall building materials up for sale on its website in December.\n\nThe president, who made his remarks during a news conference at The Kennedy Center, also said that his administration intends to \"take the wall back\" and continue its construction.\n\n\"They stole the wall from us,\" Trump said. \"That wall is so expensive to build, and we had it, as you know, hundreds of miles of it ... and they came along and they basically sold it for scrap.\"\n\nHe placed the blame for the scattering of the construction components squarely on his Democrat predecessor.\n\n\"Now, this is expensive stuff,\" Trump said. \"Biden sold it for pennies on the dollar, three cents on the dollar, four cents on the dollar. He sold it.\"\n\nGovPlanet reportedly removed the wall materials from its website after a federal judge in Texas ruled in January that the Biden administration cannot sell any of the building materials or redirect funds originally earmarked for the project.\n\nIn a statement, the company said it is returning the construction materials to the government at cost to safeguard millions of taxpayer dollars.\n\n\"We are expediting the transfer of these materials to support ... border protection plans,\" the statement read. \"We value our longstanding partnership with the U.S. government ... continuing to support America's federal agencies.\"\n\nWork on the border wall is reportedly set to resume in stretches of California and Texas as soon as the unused building materials are returned. Congress approved $46.5 billion in Trump's \"big, beautiful bill\" to complete the border wall's construction.\n\nNewsmax reached out to GovPlanet and DHS for comment but did not receive an immediate response.",
  "medium": "Article",
  "links": [
    "https://thehill.com/homenews/administration/5452837-350m-border-wall-funds-returned/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Border Wall Materials",
      "weight": 0.12719393
    },
    {
      "name": "unused construction materials",
      "weight": 0.11554688
    },
    {
      "name": "GovPlanet",
      "weight": 0.077802844
    },
    {
      "name": "construction",
      "weight": 0.074691564
    },
    {
      "name": "border protection plans",
      "weight": 0.07465383
    },
    {
      "name": "President Donald Trumps unfinished southern border wall",
      "weight": 0.07386915
    },
    {
      "name": "the wall building materials",
      "weight": 0.07225511
    },
    {
      "name": "former President Joe Biden",
      "weight": 0.07148135
    },
    {
      "name": "Donald Trump",
      "weight": 0.07099194
    },
    {
      "name": "Government",
      "weight": 0.06977977
    }
  ],
  "topics": [
    {
      "name": "Immigration"
    },
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.99609375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.98095703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.97802734375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.56689453125
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.40966796875
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.368896484375
    }
  ],
  "sentiment": {
    "positive": 0.106617205,
    "negative": 0.48086792,
    "neutral": 0.4125149
  },
  "summary": "Government surplus auction house GovPlanet is reportedly planning to return up to $350 million in unused construction materials from President Donald Trump's unfinished southern border wall. The company had acquired and planned to sell the unused steel panels, bollards, and concrete after former President Joe Biden halted construction in 2021. The Department of Homeland Security (DHS) and GovPlanet have reportedly agreed to have the materials returned within 90 days. Despite this, President Trump has stated that his administration intends to continue the construction of the wall and will not tolerate the loss of the materials. The materials were reportedly put up for sale on GovPlanet's website in December after a federal judge ruled that the Biden administration could not sell or use any of the building materials or divert funds originally earmarked for the project.",
  "shortSummary": "GovPlanet is set to return up to $350 million in unused border wall construction materials to the government, amid legal concerns and ongoing construction efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9aee95d635c04fd5a02127137021c453",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "GovPlanet, the auction house that listed unused materials from President Trump's unfinished southern border wall, has agreed with the Department of Homeland Security to return the steel panels, bollards, and concrete within 90 days, reportedly at cost to the government. The deal follows negotiations over the sale of the materials, which were halted by a Texas federal judge ruling that the Biden administration could not sell them. President Trump has threatened to sue GovPlanet and said his administration will resume wall construction in California and Texas once the materials are back in government hands. The wall project, funded by a $46.5 billion appropriation, is expected to restart once the materials are returned.",
  "argos_id": "NRZ8WRDO0"
}