{
  "url": "https://www.usatoday.com/story/sports/betting/betmgm/85516746007/",
  "authorsByline": "Richard Morin",
  "articleId": "4d2b246b3f814ebca517c63d6794ea07",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/04/USAT/85516812007-usatsi-22485429.jpg?crop=8000,4501,x0,y416&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T20:00:29+00:00",
  "addDate": "2025-08-15T20:06:55.766495+00:00",
  "refreshDate": "2025-08-15T20:06:55.766497+00:00",
  "score": 1.0,
  "title": "BetMGM bonus code: Claim $1500 welcome offer in August 2025",
  "description": "Discover the BetMGM bonus code USATODAY and get a $1,500 first-bet offer when registering for an account. Learn how to claim it and more today.",
  "content": "The latest BetMGM bonus code is among the most competitive sportsbook promotions available right now. Bettors who sign up with BetMGM bonus code USATODAY can get up to $1,500 in bonus bets back if their first wager loses. Bettors in Michigan, New Jersey, Pennsylvania and West Virginia qualify for a separate offer: Bet $10, Win $150 in Bonus Bets deal with code USATODATBG150.\n\nLearn more about the BetMGM new-user promo, the types of sportsbook promos that are delivered to current customers throughout the year and learn about other benefits that make this one of the best sports betting apps.\n\nAll content has been independently reviewed and updated by USA TODAY editors to reflect current offers and betting site features. Some promotional details are provided in collaboration with Gambling.com.\n\nIt's easy to claim the best BetMGM bonus right now, and the current BetMGM bonus code offer is greater than the first-wager protection provided by other sportsbooks. After registering a new account and making a minimum deposit of $10, place a first wager of $10 or more on any eligible market. If that first bet wins, you keep the profits. If it loses, BetMGM refunds your stake in bonus bets, up to $1,500. The bonus bets are distributed as a single bonus bet for wagers below $50 and five equal bonus bets for bigger wagers.\n\nThe BetMGM promo code \"Bet & Win\" promotion in MI, NJ, PA and WV distributes three $50 bonus bets if you win your first wager.\n\nAll bonus bets have no odds limitations, can be used on any sports betting market and has a 1x playthrough, meaning that you will then have withdrawable cash profits sent directly to your BetMGM Sportsbook account.\n• Offer valid for new users only in states where BetMGM sportsbook is licensed\n• Must be 21 or older in most states, or 18 in KY, DC and WY\n• Bonus bets credited within 24 hours if the initial wager loses\n• 1x rollover applies and must be used within seven days\n• Offer not available in NY\n\nExpert take on BetMGM bonus for new users\n\nThe BetMGM sportsbook bonus code stands out for its high refund value and straightforward terms. The 1x playthrough requirement means bettors only need to wager bonus bets once before any winnings become withdrawable cash. There are no odds restrictions either, yielding full flexibility across BetMGM’s wide range of sports markets.\n\nHow to sign up and get your BetMGM bonus code\n\nThe sign-up process and is simple and fast. Here are the steps on how to claim the welcome offer and how to use BetMGM bonus code USATODAY:\n• Click any BET NOW link on this page to visit BetMGM Sportsbook. The BetMGM promo code USATODAY will auto-apply.\n• Click “Sign Up Now.” Use PayPal, Yahoo Sports or manual entry to begin.\n• Enter your name, DOB, address, phone number and last 4 digits of your SSN.\n• The BetMGM bonus code USATODAY should appear automatically. If not, type it in manually.\n• Agree to the bonus offer terms and verify your age.\n• Deposit $10 or more and place a $10+ wager on any sport\n\nWhile the welcome offer promo code can only be used once by new BetMGM users, there are many other ongoing promos for existing customers. And if you live in a state where BetMGM also offers casino play, you may also qualify for BetMGM casino bonus code offers, as well as bonuses that can be obtained through online poker or racebook wagers. It is one of the top online casinos.\n\nHere are the top BetMGM sportsbook offers for current customers:\n• Parlay plus: Increases payouts for 4- to 7-leg parlays.\n• Parlay insurance: Get a bonus bet refund if one leg of your parlay loses (typically capped at $25).\n• Known as Lion’s Boosts, these daily enhanced odds apply to top games and events.\n• Viewable from the app or site’s top banner.\n• Choose your favorite NFL or NBA team and receive team-specific promos and odds boosts.\n• Get a $100 bonus when your friend signs up via your referral link and meets requirements.\n\nAll BetMGM users are automatically enrolled in BetMGM rewards program known as MGM Rewards. You earn points through real-money bets and by visiting MGM Resorts properties.\n\nYou can use the BetMGM sportsbook bonus code first-bet offer on any sports betting market. Once you have placed that initial wager, you will then find sport-specific BetMGM sportsbook promos available each season.\n\nThe NFL is the most popular sports betting market, so through the years, BetMGM Sportsbook has offered a multitude of valuable football betting promos to those sports bettors, making it one of the top NFL betting apps.\n\nThis list of NFL betting promos includes items such as odds boosts, parlay boosts, parlay insurance (both for same game and multi-game parlays) and other ways to get bonus bets. You can use these bonus bets to wager on NFL prop bets and NFL parlays.\n\nBetMGM claims a place among the top NBA betting sites in part due to offering deals such as a “Bet $10, Win $200 in bonus bet deals”.\n\nThe qualifiers for this offer can vary, but one example of this is that if you wager $10 or more on an NBA contest and any player in that game makes a 3-point shot, you will get $200 in bet credits. This all but assures you will get the bet credits due to the fact that 3-point shots are incredibly common.\n\nOther NBA deals are also available, including the popular Select Your Squad offer.\n\nNo sport has more games available to bet on than MLB, which is why BetMGM sporadically offers a “Bet $10, Get $200” in bonus bets deal to baseball bettors. This deal was based on a bet being placed rather than the outcome of the wager, so the $10 qualifying bet was guaranteed to generate the $200 in bonus bets.\n\nBetMGM sportsbook also gets creative with its ongoing promotions for this sport and will highlight these on the MLB betting page.\n\nThe NHL had its best TV ratings in nearly a decade last year, and BetMGM rewarded those viewers who wagered on hockey with a “Bet $10, Get $200 in bonus bets” if a goal is scored in that game. It’s the type of deal that is typically only available for a short time, so keep an eye out for it at the start of the season or during the Stanley Cup Playoffs.\n\nHockey bettors can also benefit from odds and profit boosts as well as parlay insurance deals that are often made available during the season.\n\nNo time of year gets more attention from sports bettors than the pro football playoffs, which is why BetMGM goes all out with offers designed to win over new customers and is considered one of the top Super Bowl betting sites.\n\nIn recent years, BetMGM Sportsbook offered a “Bet $10, Get $200” in bonus bets deal that granted those first-time customers $200 in bet credits if at least one touchdown was scored in the game that was wagered on. This is a very high percentage deal since a playoff game with no touchdowns is very rare, and in this case the deal paid out the $200 in bonus bets. Also keep an eye out for its Super Bowl betting promos.\n\nMarch is when college basketball betting sites are deluged with potential new customers, which has led to BetMGM offering a “Bet $10, Win $200” BetMGM bonus code during the NCAA tournament in previous years.\n\nBetMGM also provides a full slate of March Madness odds, including live in-game betting options, and has a varied selection of NCAA welcome bonuses available at that time of year.\n\nThe current BetMGM bonus code and introductory offer is comparable to the Caesars sportsbook promo code previous flagship offer that generated a $1,000 bonus bet refund for a first-bet loss, but the BetMGM deal has a higher ceiling at $1,500. BetMGM also intermittently provides a “Bet $5, Get $150” in bonus bets offer or a “Bet & Win” offer that rivals the sign-up deals available via the bet365 bonus code and at DraftKings and FanDuel.\n\nThe BetMGM bonus code is designed to go toe-to-toe with other online sportsbooks, as well as compete with newcomers to the market such as the ESPN BET promo, DraftKings promo code and the FanDuel promo code. This combination of elements keeps BetMGM in competition for a spot at or near the top of the best online sportsbooks.\n\nYou can use the BetMGM promo code USATODAY in Arizona, Colorado, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maryland, Massachusetts, Michigan, New Jersey, North Carolina, Ohio, Pennsylvania, Tennessee, Virginia, Washington, D.C., West Virginia and Wyoming. It is expected there will be a BetMGM Missouri bonus code offer once Missouri sportsbook apps go live later this year.\n\nEditor's note: This offer is not available in Nevada, New York or Puerto Rico.\n\nBetMGM lands a spot in the upper tier of sportsbooks due in part to offering one of the best betting interfaces on the market today.\n\nYou can quickly find the bets you are looking for or create customized parlay wagers with ease on the betting app and website. BetMGM is well known for having very competitive odds, meaning that you can feel comfortable making this your go-to betting site.\n\nBetMGM is also one of the best sites when it comes to live in-game betting, as it updates the odds very quickly and has a streamlined betting process that gets your wager placed fast.\n\nAnother benefit of wagering at BetMGM is that it shows pregame bettors the percentage of bettors who are landing on either side of the three standard odds types. Combine that with its stellar reputation for reliability, decades of quality customer service and a wide variety of ongoing promotions, and it’s easy to see why so many sports bettors rely on BetMGM as one of their prime picks.\n\nBetMGM sportsbook offers a streamlined betting experience across both its desktop site and mobile app. The website presents betting markets, promotions and account tools in an intuitive layout, while the app delivers the same features with fast load times and easy navigation.\n\nAvailable on iOS and Android, the BetMGM app is free to download and ideal for betting on the go, giving players seamless access to odds, wagers, one-game parlays and live betting. BetMGM also has one of the best casino apps.\n• App Store rating: 4.8/5\n• \"My favorite sports app the best adjustable lines that's not available on FanDuel and other popular sportsbooks.\" - DropGz, iOS Device\n• Google Play rating: 4.2/5\n• \"Love the app, easy to use, location pin-point is perfect and the features are amazing.\" - Dan Shrider, Android Device\n• Massive choice of betting markets for each sport\n• Would like more reduced juice specials\n\nBetMGM sportsbook offers the broadest selection of banking options in the online sports betting industry. However, accepted methods vary by state. All deposits and withdrawals are free, making the banking process quick, secure and smooth.\n\nThe minimum withdrawal at BetMGM is $20 via most methods. You can request a payout anytime, but you should complete any wagering requirements on the BetMGM deposit bonus code first.\n\nWithdrawal speeds are variable. BetMGM normally processes payout requests within 1-2 days.\n\nBetMGM's support channels are responsive and helpful. Support is available through the various methods listed below:\n• Live chat: Available 24/7 and ideal for urgent matters.\n• Social media: BetMGM has an official X account and Facebook account, which bettors can use to seek answers or guidance.\n• Email: Every state has a unique email associated with it. This can be found on the contact section of BetMGM sportsbook.\n• Help center: The help center is full of an extensive selection of FAQs about a variety of matters from depositing, bonus funds and more.\n\nBetting responsibly means never wagering more than you can afford to lose and keeping a check on yourself if you start chasing losses or are spending too much time betting. BetMGM assists in responsible gaming by providing tools for you to set deposit, betting and time limits for yourself.\n\nYou can also self-exclude, and there are loads of resources to help you should you feel you are developing a problem, including links to agencies such as the National Council on Problem Gambling.\n\nBetMGM earns high marks for its sleek app, competitive odds and flexible bonus structure and ongoing promotions. With its fast interface, excellent live betting options and strong customer service, BetMGM remains one of the best sportsbooks in the U.S.\n\nClick any BET NOW button on this page to activate the BetMGM bonus code USATODAY and get up to $1,500 in bonus bets if your first wager doesn’t win. If you are in MI, PA, NJ or WV, you will activate the Bet $10, Win $150 offer.\n\nWhat is the BetMGM bonus code?\n\nThe bonus code for BetMGM is USATODAY. This triggers a bonus bet refund of up to $1,500 if your opening wager settles as a loss. It's important to point out that this offer is for new accounts only and requires a minimum deposit of $10, with the initial bet being over $10. This review delivers all the bonus rules explained and provides details on the latest BetMGM sportsbook offer.\n\nHow can you get the BetMGM sign-up bonus?\n\nYou can redeem the welcome bonus by clicking the exclusive link on this page review. It will ensure the best BetMGM bonus code USATODAY is automatically applied to your sign-up form. You can then set up an account, make your first deposit and place a bet on any sporting event to qualify for the BetMGM bonus.\n\nWho can redeem the BetMGM bonus code?\n\nThe BetMGM welcome bonus is available to anyone physically located in Arizona, Colorado, DC, Illinois, Indiana, Iowa, Kansas, Louisiana, Maryland, Massachusetts, Michigan, New Jersey, New York, North Carolina, Ohio, Pennsylvania, Tennessee, Virginia, West Virginia or Wyoming. Users must also be the legal gambling age in each state.\n\nIs the BetMGM promo available on mobile?\n\nAll BetMGM promos are available to mobile users, including the sign-up bonus, odds boost offers, parlay bonuses, bonus bets and other promos. You can claim them via the app, or you can log into your BetMGM account via any mobile browser. This guide explains how to claim BetMGM bonus offers.\n\nCan I withdraw the BetMGM Sportsbook bonus right away?\n\nBonus bets themselves are not withdrawable, but you can withdraw winnings from your BetMGM sportsbook account earned from BetMGM bonus bets right away if you so choose, as they have a 1x playthrough. Note that the minimum withdrawal at BetMGM Sportsbook is $20.\n\nHow long do BetMGM bonus funds take to arrive?\n\nThe BetMGM bet credits will arrive in your account within 24 hours after your first bet settles. You will get seven days to complete a 1x playthrough requirement on those bet credits earned via the BetMGM bonus code. BetMGM will release bonus funds from additional promos, such as parlay insurance, within a similar timeframe.\n\nCan I use the bonus on any sport?\n\nYou can use your BetMGM bonus bets on any sport. The same applies for the BetMGM welcome offer unless it indicates otherwise. An example of this exclusion might be if the BetMGM bonus code offer is something like \"Bet $10 on a TD being scored in a specific football game, get $150 in bonus bets,\" or something along those lines, where you must make that qualifying wager on the specified event.\n\nBetMGM is 100 percent legit. It delivers a terrific gaming experience, a strong welcome offer and loads of ongoing promotions, even if there is no BetMGM bonus code for existing users (you can only use the bonus code offer once). It is also licensed, legal and deploys encryption and other security measures to protect your information.\n\nHow old do you need to be to use BetMGM sportsbook?\n\nThe minimum age to claim the BetMGM welcome bonus code is 21 in most states, but 18 in Kentucky, Washington D.C. and Wyoming. All the terms for the sign-up bonus are spelled out both in this BetMGM sportsbook review as well as on the official site and app.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/sports/betting/betmgm-casino-bonus/84494475007/",
    "https://www.ncpgambling.org/",
    "https://www.usatoday.com/story/sports/betting/casino-apps/84273418007/",
    "https://www.usatoday.com/story/sports/betting/online-casinos/84230237007/",
    "https://www.usatoday.com/story/sports/betting/promos/85514300007/",
    "https://sportsdata.usatoday.com/baseball/mlb/picks"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "BetMGM bonus bets",
      "weight": 0.12003739
    },
    {
      "name": "BetMGM bonus offers",
      "weight": 0.11768808
    },
    {
      "name": "BetMGM bonus code",
      "weight": 0.11484553
    },
    {
      "name": "BetMGM casino bonus code offers",
      "weight": 0.10921059
    },
    {
      "name": "BetMGM bonus code USATODAY",
      "weight": 0.10897801
    },
    {
      "name": "BetMGM bonus funds",
      "weight": 0.1079389
    },
    {
      "name": "bonus bets offer",
      "weight": 0.10269616
    },
    {
      "name": "BetMGM sportsbook",
      "weight": 0.10053156
    },
    {
      "name": "Bonus bets",
      "weight": 0.0971758
    },
    {
      "name": "bonus bets",
      "weight": 0.0971758
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.6474609375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.331787109375
    }
  ],
  "sentiment": {
    "positive": 0.129197,
    "negative": 0.31937557,
    "neutral": 0.5514275
  },
  "summary": "The BetMGM bonus code, USATODAY, is among the most competitive sportsbook promotions available. New users can claim up to $1,500 in bonus bets if their first wager loses. Bettors in Michigan, New Jersey, Pennsylvania and West Virginia also qualify for a separate offer: Bet $10, Win $150 in Bonus Bets with code USATADATBG150. The BetMG promotion in MI, NJ, PA and WV distributes three $50 bonuses if you win your first bet. All bonus bets have no odds limitations, can be used on any sports betting market and have withdrawable cash profits sent directly to BetMMGM Sportsbook account. The sign-up process is simple and fast. While the welcome offer promo code can only be used once by new BetMMG users, there are many other ongoing promos for existing customers.",
  "shortSummary": "The BetMGM bonus code USATODAY offers up to $1,500 in bonus bets if first wager loses, with extensive benefits and no odds limitations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b870b51018164fdfaade439576390afa",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://sportsdata.usatoday.com/baseball/mlb/picks",
      "text": "Get the edge with our exclusive MLB betting picks, backed by unique data and insights that others don't offer. Check out our FAQs to learn more.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    }
  ],
  "argos_summary": "BetMGM’s current welcome offer, activated with the code USATODAY, refunds up to $1,500 in bonus bets if a new user’s first wager loses, with a 1‑x playthrough and no odds limits.  In Michigan, New Jersey, Pennsylvania and West Virginia a separate promotion gives three $50 bonus bets for a $10 win on the first wager.  The bonus is available to new accounts in most U.S. states, requires a minimum $10 deposit, and bonus bets are credited within 24 hours and must be used within seven days.  The article also outlines the sign‑up steps, additional ongoing promotions, app features, banking options, customer support, and responsible‑gaming tools offered by BetMGM.",
  "argos_id": "O3OURBJAQ"
}