{
  "url": "https://www.sfchronicle.com/sports/article/ten-hag-makes-successful-debut-after-bayer-20819521.php",
  "authorsByline": "AP Sports Writer, By CIARÁN FAHEY",
  "articleId": "6f3886a1243d4e4c94fb9dd0f8f769dc",
  "source": {
    "domain": "sfchronicle.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T19:12:35+00:00",
  "addDate": "2025-08-15T19:51:41.919820+00:00",
  "refreshDate": "2025-08-15T19:51:41.919823+00:00",
  "score": 1.0,
  "title": "Ten Hag makes successful debut after Bayer Leverkusen wins 4-0 in German Cup",
  "description": "Erik ten Hag has made a winning start as Bayer Leverkusen coach with a 4-0 result at fourth-tier team Sonnenhof Großaspach in the first round of the German Cup. Patrik Schick, Brazilian wing back...",
  "content": "Berlin's Robert Skov, left, celebrates scoring with Leopold Querfeld during the DFB Cup first round between FC Gütersloh and 1. FC Union Berlin in Gütersloh, Germany, Friday Aug. 15, 2025. (David Inderlied/dpa via AP) Gütersloh's Björn Rother, left, and Berlin's Ilyas Ansah in action during the DFB Cup first round between FC Gütersloh and 1. FC Union Berlin in Gütersloh, Germany, Friday Aug. 15, 2025. (David Inderlied/dpa via AP) Leverkusen's Arthur celebrates scoring with Edmond Tapsoba, right, during the DFB Cup 1st round soccer match between SG Sonnenhof Großaspach and Bayer Leverkusen at WIRmachenDRUCK Arena, Aspach, Germany, Friday Aug. 15, 2025. (Bernd Weißbrod/dpa via AP) Magdeburg's Rayan Ghrieb, second right, celebrates scoring with teammates during the DFB Cup first round soccer match between FC Saarbrücken and FC Magdeburg at Ludwigspark Stadium in Saarbrücken, Germany, Friday Aug. 15, 2025. (Uwe Anspach/dpa via AP) Saarbrücken's Kai Brünker, front, and Magdeburg's Tobias Müller in action during the DFB Cup first round soccer match between FC Saarbrücken and FC Magdeburg at Ludwigspark Stadium in Saarbrücken, Germany, Friday Aug. 15, 2025. (Uwe Anspach/dpa via AP)\n\nBERLIN (AP) — Erik ten Hag made a winning start as Bayer Leverkusen coach with a 4-0 result at fourth-tier team Sonnenhof Großaspach in the first round of the German Cup on Friday.\n\nPatrik Schick, Brazilian wing back Arthur, debutant Christian Kofane and Álex Grimaldo all scored, but they assumed control only after Großaspach captain Volkan Celikwas was sent off in the 66th with two bookings in as many minutes.\n\nLeverkusen was forced to defend for long periods after Schick’s 32nd-minute opener. The Czech forward also needed to clear the ball off the line.\n\nArthur scored the second shortly after Celikwas’ sending off and the other goals followed Mert Tasdelen’s late sending off for a bad challenge on Leverkusen defender Axel Tape.\n\nTen Hag, the former Manchester United manager, took over from the Real Madrid-bound Xabi Alonso and has had little time to work with a squad undergoing huge changes. Key players like Florian Wirtz, Jeremie Frimpong and Granit Xhaka have left while Kofane, Tape, Ibrahim Maza, Jarell Quansah and goalkeeper Mark Flekken all made their debuts on Friday.\n\nThe game was interrupted in the first half by a summer storm featuring hailstones. Referee Michael Bacher led the teams off the field. It resumed after a 40-minute break.\n\nUnion used dead-ball situations to take a 3-0 halftime lead, with Robert Skov firing in a free kick, and Leopold Querfeld and Danilho Doekhi scoring after corners.\n\nUnion goalkeeper Frederik Rönnow had to go off early in the second half after indicating he was feeling dizzy. Matheo Raab went on for his Union debut but had little to do as Andrej Ilić scored and then set up Jeong Woo-yeong to complete the rout.",
  "medium": "Article",
  "links": [
    "https://apnews.com/hub/soccer"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "DFB Cup",
      "weight": 0.07527178
    },
    {
      "name": "Bayer Leverkusen",
      "weight": 0.07495684
    },
    {
      "name": "Bayer Leverkusen coach",
      "weight": 0.07402077
    },
    {
      "name": "FC Saarbrücken",
      "weight": 0.07124057
    },
    {
      "name": "FC Magdeburg",
      "weight": 0.07120306
    },
    {
      "name": "FC Gütersloh",
      "weight": 0.071055025
    },
    {
      "name": "Leverkusen defender Axel Tape",
      "weight": 0.06862744
    },
    {
      "name": "Großaspach captain Volkan Celikwas",
      "weight": 0.064588234
    },
    {
      "name": "the DFB Cup first round soccer match",
      "weight": 0.06387344
    },
    {
      "name": "Leverkusen",
      "weight": 0.06365484
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.998046875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97998046875
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.6220703125
    }
  ],
  "sentiment": {
    "positive": 0.15632151,
    "negative": 0.23343784,
    "neutral": 0.61024064
  },
  "summary": "Bayer Leverkusen won 4-0 against fourth-tier team Sonnenhof Großaspach in the first round of the German Cup. Erik ten Hag, the former Manchester United manager, made his debut as Bayer Leverkusens' coach after taking over from Real Madrid-bound Xabi Alonso. The game was interrupted by a summer storm and Union used dead-ball situations to take a 3-0 halftime lead. Patrik Schick, Brazilian wing back Arthur, debutant Christian Kofane and Álex Grimaldo all scored for Leverkuses. The other goals followed Mert Tasdelen's late dismissal for a challenge on Leverkuson defender Axel Tape.",
  "shortSummary": "Erik ten Hag's debut as Bayer Leverkusen coach saw off Sonnenhof Großaspach 4-0 in the DFB Cup, with notable debuts and controversial refereeing decisions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "bd1a3aacb3a849afa69ae689204243f8",
  "places": [
    {
      "osmId": "372567612",
      "city": "Aspach",
      "county": "Rems-Murr-Kreis",
      "state": "Baden-Württemberg",
      "postcode": "71546",
      "country": "Germany",
      "countryCode": "de",
      "coordinates": {
        "lat": 48.98069635,
        "lon": 9.393014626200761
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Bayer Leverkusen, under new coach Erik ten Hag, secured a 4‑0 win over fourth‑tier Sonnenhof Großaspach in the first round of the German Cup, with goals from Patrik Schick, Arthur, Christian Kofane and Álex Grimaldo; the match featured two red cards and a 40‑minute pause due to a hailstorm. Union Berlin routed FC Gütersloh 3‑0, scoring through a free‑kick by Robert Skov and goals from Leopold Querfeld and Danilho Doekhi, while their goalkeeper had to leave early and was replaced by Matheo Raab. The article also briefly notes other first‑round fixtures, including a Magdeburg‑Saarbrücken match at Ludwigspark Stadium. Overall, the cup opener showcased decisive victories for Leverkusen and Union Berlin amid weather disruptions and squad changes.",
  "argos_id": "OP6G6VL6G"
}