{
  "url": "https://www.businessinsider.com/reese-witherspoon-parenting-kids-hollywood-made-her-cry-2025-8",
  "authorsByline": "Jason Guerrasio",
  "articleId": "a26bb976201c4df0ac5ca5f242456fa3",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/689f6aaea17a8c5b4052f597?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T19:38:14+00:00",
  "addDate": "2025-08-15T19:44:34.996031+00:00",
  "refreshDate": "2025-08-15T19:44:34.996033+00:00",
  "score": 1.0,
  "title": "Reese Witherspoon says she was 'deliriously tired' raising kids in Hollywood: 'I'd cry working 14 to 17 hours'",
  "description": "Reese Witherspoon explained the challenges of raising three children while being an actor in Hollywood.",
  "content": "Reese Witherspoon is getting candid about balancing her busy Hollywood career with motherhood.In a recent Instagram post, the \"Big Little Lies\" star posted seven photos of herself with her three kids over the years, alongside captions explaining what it's like parenting while being a major player in Hollywood.\"Someone asked me what raising three kids and building a career in Hollywood looked like…,\" the caption in the first photo reads, with a shot of Witherspoon alongside her daughter Ava Phillippe, 25, son Deacon Phillippe, 21, and youngest son Tennessee James Toth, 12. (She shares her two oldest children with ex-husband Ryan Phillippe, and her youngest with ex-husband Jim Toth.)\"It looked like spending a lot of time in trailers together,\" the next caption reads, alongside a photo of Witherspoon and Tennessee smiling in what appears to be a trailer.\"I'd cry working 14 to 17 hours, sometimes all night long, and still woke up early for carpool,\" Witherspoon continues on another slide caption. \"I was deliriously tired.\"Next to a photo with Tennessee on set, she continues: \"It looked like trying to say something positive about work when I got home at night. So my kids would know that my work was meaningful to me and could be fun!\"In the final photo, a shot of the Oscar winner with daughter Ava, the caption reads: \"In conclusion, even though it was challenging at times, having kids gave me perspective about what was important in life. Nothing was better than getting to come home and hug them and hear about their day!\"A post shared by Reese Witherspoon (@reesewitherspoon)",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Reese Witherspoon",
      "weight": 0.10332668
    },
    {
      "name": "ex-husband Ryan Phillippe",
      "weight": 0.100522116
    },
    {
      "name": "kids",
      "weight": 0.09438731
    },
    {
      "name": "Witherspoon",
      "weight": 0.09294523
    },
    {
      "name": "ex-",
      "weight": 0.08496667
    },
    {
      "name": "captions",
      "weight": 0.082984686
    },
    {
      "name": "Ava Phillippe",
      "weight": 0.08143807
    },
    {
      "name": "Hollywood",
      "weight": 0.07882391
    },
    {
      "name": "Tennessee James Toth",
      "weight": 0.076795496
    },
    {
      "name": "youngest son",
      "weight": 0.076387405
    }
  ],
  "topics": [
    {
      "name": "Celebrities"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.994140625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.88427734375
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.6845703125
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.490478515625
    }
  ],
  "sentiment": {
    "positive": 0.37500206,
    "negative": 0.14136505,
    "neutral": 0.48363286
  },
  "summary": "Reese Witherspoon, a prominent Hollywood actress, has shared her thoughts about balancing her busy career with motherhood in a recent Instagram post. She shared seven photos of herself with her three children, aged 25, 21, and 12, with captions explaining what it was like parenting while simultaneously simultaneously working in Hollywood. Witherasphen. She said she was \"deliriously tired\" and that having children gave her perspective on life.",
  "shortSummary": "Reese Witherspoon describes the challenging of raising three children in Hollywood, highlighting the need for positive thinking and highlighting her recent achievements.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6b42916365ad4055add20274af742377",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Reese Witherspoon shares a candid Instagram carousel about juggling her Hollywood career and motherhood, featuring photos of her three children over the years. She describes long work hours, late nights, and the challenge of balancing set demands with family life, yet emphasizes the perspective and joy her kids bring. Witherspoon concludes that despite the difficulties, being a mother has helped her focus on what truly matters and provides a meaningful counterbalance to her professional commitments.",
  "argos_id": "P6910A5MJ"
}