{
  "url": "https://www.forbes.com/sites/leesharrock/2025/08/15/mar-hall-a-grand-scottish-estate-reimagined-for-the-modern-luxury-traveller/",
  "authorsByline": "Lee Sharrock",
  "articleId": "1b45785eb98e4a7792e934bb174ca919",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689f290bc99ba9dee9eaa90d/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T14:26:16+00:00",
  "addDate": "2025-08-15T14:36:26.956225+00:00",
  "refreshDate": "2025-08-15T14:36:26.956226+00:00",
  "score": 1.0,
  "title": "Mar Hall: A Grand Scottish Estate Reimagined For The Modern Luxury Traveller",
  "description": "Where Scottish heritage meets modern elegance, Mar Hall’s £20 million transformation reimagines a baronial estate into a design-led sanctuary of Coorie, culture, culinary excellence and contemporary art–just minutes from Glasgow.",
  "content": "Set within 240 acres of ancient woodland overlooking the River Clyde and framed by the misty Kilpatrick Hills, Mar Hall is a five-star heritage estate that has recently undergone a meticulous £20 million transformation. A former baronial mansion built in 1828 by the esteemed Sir Robert Smirke–architect of the British Museum–for Major General Robert Walter Stuart, the 11th Lord Blantyre, Mar Hall has long been a symbol of aristocratic grandeur.\n\nLord Blantyre was accidentally shot and killed while in Belgium in 1830. Consequently his wife Fanny carried on with construction of Mar Hall, which eventually became a social hub for the Scottish elite, aristocrats and industrialists, at the peak of Clydebank’s shipbuilding industry–which famously produced the Royal Yacht Britannia, Queen Mary and Queen Elizabeth Ocean liners for the Royal Family. In the 20th century Mar Hall became a Wartime hospital, transforming from a private residence into a place of care and sanctuary.\n\nToday–under new ownership by Dubai-based Dutco Group–Mar Hall redefines what a luxury country estate can be, one that artfully balances Scottish heritage with modern, international design sensibility.\n\nMy daughter and I arrived for a mother-daughter escape, and from the moment we approached the sweeping, tree-lined driveway–glimpsing deer and rabbits through the forest–the tone was set: escapism and elegance in equal measure. We were given a warm welcome by the inimitable Alan McDougall–concierge extraordinaire–and the Mar Hall team, who anchored our stay in a tradition of Scottish hospitality at its finest.\n\nThe vision for Mar Hall’s new chapter is the result of a carefully considered redesign by Glaswegian interior designer Jim Hamilton. Known for his thoughtful aesthetic rooted in stealth luxury, Hamilton has managed to create an atmosphere that is at once opulent and inviting, with subtle nods to Scotland’s industrial and artistic heritage woven throughout.\n\nThe entrance hall is a masterstroke of timeless elegance, where heritage green walls complement original stained-glass windows, and a canopy of tropical palms sets an unexpected, lush tone. Brass fittings, vintage mirrors, marble worktops, and designer lighting create a glamorous yet grounded ambiance, reminiscent of a 19th-century Parisian brasserie–indeed, the central champagne bar is cog-shaped, inspired by archival drawings from the John Brown & Company shipyard in Clydebank.\n\nThere are no Scottish design clichés here–in fact the only tartan you might notice is on the socks worn by the staff–instead, the interiors evoke a refined sensibility. Hamilton has created an environment that feels both grand and cocoon-like, with velvet armchairs in rich jewel tones, sensuous materials like marble and leather, and a confident colour palette that echoes the surrounding natural landscape. Even the hotel’s visual identity–incorporating the Earl of Mar’s coat of arms–is subtly embossed on everything from breakfast waffles to cocktail mats and the chocolate cake in Mar Hall’s signature Afternoon Tea.\n\nHamilton gave me a tour of the hotel, explaining the reasoning behind his design philosophy for Mar Hall: “I came to the space and remembered it, but it wasn’t very welcoming. I thought ‘well it was a home, it should feel homely’, so my first point of attack was to say ‘what’s the guest’s journey here. What do they experience?’ I try to put myself in the shoes of someone arriving on a cold winter’s day, a summer’s day, a dark night or a bright morning. On a day like today when it’s slightly overcast, you get that feeling of the greenery outside. The architecture is pretty amazing, and the scale is great.”\n\nRedesigning the interiors of Mar Hall was something of a homecoming for Jim, as he grew up nearby and remembered the space from attending a wedding there years ago. He says: “We’ve worked in America, the Middle East, Europe and Africa. We’ve done a lot of travelling. This is the one that’s ten minutes from where I grew up. You never get projects as close to home as this! I’d been to a friend’s wedding here so I knew the space.”\n\nWhen Hamilton was invited to take on the interior design for Mar Hall’s revamp, he decided to look back at the building’s original incarnation as a family home and then as a hospital–both spaces where a warm welcome and metaphorical (or physical) embrace were important.\n\nThere are also a series of self-contained rooms outside of the main hotel with their own gardens, that are are based on Scottish Mountain Bothies. Hamilton explains: “When you get into the hills of Scotland there are lots of Bothies–a series of historical little huts, designed for when you get caught in bad weather. When you use a Bothie, you’re meant to leave something behind–a piece of food or a drink–so when the next person comes they’ve got food or a drink. So these rooms are meant to give you a little cuddle, like a Bothie. There are also Coorie rooms–a lot of journalists now are comparing the Scottish word Coorie to the Danish word Hygge, meaning a warm and inviting atmosphere. So the rooms at the far end of Mar Hall have been christened ‘Coorie’, after the nurses that looked after patients when it was a hospital.”\n\nScotland has produced a remarkable lineage of acclaimed designers and artists, many of whom share a connection to the influential Glasgow School of Art. Among the most iconic is Charles Rennie Mackintosh, a visionary Victorian architect and designer whose work epitomized the Art Nouveau movement and helped define the Glasgow Style–a synthesis of architecture, furniture, and decorative arts with a distinctively modern sensibility. Alongside him, artists like Margaret Macdonald Mackintosh contributed significantly to this era, shaping early modernism in Britain. In the contemporary landscape, Glasgow continues to be a crucible for innovation through alumni such as Jenny Saville, renowned for her large-scale, visceral figurative paintings that challenge conventional representations of the body. Other notable graduates include Douglas Gordon, David Shrigley, and Jim Lambie. Collectively, these artists and designers illustrate Scotland’s enduring legacy of artistic excellence and its powerful influence on global visual culture.\n\nSince Scotland has such a rich cultural heritage–and Glasgow in particular has produced so many celebrated artists and designers–it’s no surprise that the design and art collection of Mar Hall is stunning.\n\nMar Hall’s eye-catching kaleidoscopic wallpaper and jewel-coloured velvet cushions, decorated with butterfly motifs–both designed by Timorous Beasties- are a design highlight of Mar Hall’s renovation, and a clever introduction by designer Hamilton to complement his unique interior decor scheme. Timorous Beasties was established in 1990 by Glasgow School of Art. alumni Alistair McAuley and Paul Simmons, who were inspired by Victorian art critic John Ruskin’s view of the universal connection between art, nature and society.\n\nThroughout the hotel, original artwork curated by Art Pistol–an acclaimed Glasgow-based consultancy–adds depth and narrative. Art Pistol, known for nurturing talent from the Glasgow School of Art, have selected works that echo the interiors and landscape alike.\n\nScottish artist Nichol Wheatley has been commissioned to create four large panel paintings for the Club Lounge, relative to the four corners of Scotland and representing the four seasons.\n\nScottish luxury is down to more than aesthetics–it’s a feeling, perfectly encapsulated by the philosophy of Coorie, a word that conjures warmth, comfort, and closeness. Mar Hall captures this spirit perfectly. Whether you’re curled up in a velvet armchair with a novel, strolling through the gardens with immaculately pruned roses and mowed lawns–thanks to the care of landscape gardener Wayne Simon Page–or sipping a ‘wee dram’ of whisky by the fire, every moment here feels enveloped in a warm Scottish embrace.\n\nMar Hall offers 74 individually styled guest rooms and suites, including eight elegant Junior Suites, three sprawling Grand Suites, and a selection of new Spa Garden Suites. Hamilton explains that each of the mansion rooms is designed individually: “The big mansion rooms are a play on colour. So pretty much every room is a different colour. There’s no repetition, it’s not cookie cutter. Every room has a different colour palette.”\n\nWe stayed in one of the sumptuous Grand Suites with a breathtaking view of the verdant green golf course adjacent to the River Clyde–mist-covered mountains beckoning in the distance. A thoughtfully curated bookcase contained a rainbow-coloured collection of antique books, including tomes on celebrated Scottish designer Charles Rennie Mackintosh, perfect for reading whilst sinking into one of the suite’s jewel-coloured velvet chairs or sinking into the four-poster bed. Artworks curated by Art Pistol by contemporary Scottish artists decorated the walls, and the marbled bathroom was a masterclass in understated luxury. The overall effect was of staying in a private Mayfair apartment–albeit with an unparalleled view of the Kilpatrick Hills–rather than a hotel.\n\nDining at Mar Hall is a multi-sensory experience that both honours and reinvents traditional Scottish fare. Executive Chef Tony Tapia leads the charge at The Dining Room, presenting a menu grounded in hyper-local, seasonal ingredients. His interpretation of West Coast Cullen is a delicate, reimagined take on the classic fish and potato soup, while the spicy raw beef tartare–prepared tableside–adds a flourish of theatre to an already compelling dish. Argyll smoked salmon was prepared with cucumber and horseradish, and served so fresh and clean that it melted in the mouth like sashimi. Other standout dishes were Berwick crab with Apple, Kohlrabi and samphire–beautifully presented like a work of culinary art–and Orkney scallops with coriander and cordyceps.\n\nThe Afternoon Tea–curated by award-winning Executive Pastry Chef Szilard Szentesi–is an unmissable indulgence. Served in The Gallery beneath glass palms and stained-glass skylights, the tea includes exquisitely plated savouries and pastries, with flavours as intricate as their presentation. A three-tiered brass tray holds dainty sandwiches (including cucumber sandwiches fit for a Royal tea), scones with clotted cream and jam, and a selection of whimsical desserts. The chocolate cake bears the hotel’s insignia and pairs perfectly with a glass of Champagne or a pot of loose leaf green tea.\n\nSlàinte, the newly imagined cocktail bar, is where Head Mixologist Chris Mullen channels Scotland’s rich history into liquid artistry. Signature drinks such as The 180—a floral twist on the classic whisky sour named in honour of Mar Hall’s 180-year legacy—are delivered with showmanship, sometimes accompanied by smoke and mirrors.\n\nMar Hall's sprawling estate offers more than just beautiful vistas. The hotel boasts an 18-hole championship golf course with panoramic views over the River Clyde, as well as a full menu of countryside pursuits–from falconry and axe throwing to archery and rifle shooting.\n\nOur own archery and rifle shooting session–led by a kilted Scandinavian instructor–proved both enlightening and exhilarating. We learned the storied history of the bow and arrow, and enjoyed the unspoiled setting, which we accessed via golf buggy through whispering woodlands.\n\nThe spa is a sleek, modern counterpoint to the hotel’s heritage interiors, discreetly connected to the main building by a glass corridor. Here, contemporary design prevails–muted tones, clean lines, and a focus on natural Scottish wellness. Treatments use Ishga products, and we floated out of the spa on a cloud after our facial and hot stone massage. Derived from sustainably harvested Hebridean seaweed, Ishga is named after the Gaelic word for water.\n\nA Destination for a New Generation of Scotophiles\n\nMar Hall is a favourite hideaway for celebrities such as Kylie Minogue and Richard Ashcroft–who was in Scotland to support Oasis at their Edinburgh gig during our visit. Mar Hall offers a serene contrast in a countryside setting to the creative hustle of Glasgow’s bustling city centre, which is part of the reason that it attracts an eclectic clientele–from rock stars to families, wedding parties to golfers. During our stay, excitement buzzed in the air as several streets in Glasgow’s city centre had been transformed into a New York City location for the new Spiderman movie, and we visited the location where we saw a chase scene involving yellow taxi cabs being filmed.\n\nIn its latest incarnation, Mar Hall doesn’t just preserve its storied past–it elevates it through a sympathetic reimagining of the historic building for a contemporary destination. If you’re looking for an experience that fuses history with storytelling, design with discovery, culinary excellence with Coorie, contemporary art with classic design, and breathtaking Scottish scenery with outdoors activities, Mar Hall is the perfect place to visit.\n\nIn short, Mar Hall is more than a hotel–it’s a destination, an oasis of calcm, serenity and old school service surrounded by breathtaking natural beauty. One that whispers luxury in a distinctly Scottish accent.",
  "medium": "Article",
  "links": [
    "https://uk.ishga.com/?srsltid=AfmBOooNgzLChkxTt_ktTJk9YCZQHUDQwq_CSYjYYe5DMFfMYOqvuGrv",
    "https://www.marhall.com/",
    "https://www.marhall.com/eat-and-drink/the-dining-room/?_gl=1*134b45g*_up*MQ..*_ga*MTU2MjQ2OTkyMi4xNzU1MTkwMDE5*_ga_5QPMJQBKK5*czE3NTUxOTAwMTgkbzEkZzAkdDE3NTUxOTAwMTgkajYwJGwwJGgw",
    "https://www.timorousbeasties.com/profile",
    "https://www.artpistol.co.uk/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mar Hall",
      "weight": 0.086426206
    },
    {
      "name": "Mar",
      "weight": 0.06426929
    },
    {
      "name": "Scottish heritage",
      "weight": 0.054343626
    },
    {
      "name": "contemporary Scottish artists",
      "weight": 0.053738408
    },
    {
      "name": "Scottish luxury",
      "weight": 0.05245309
    },
    {
      "name": "celebrated Scottish designer Charles Rennie Mackintosh",
      "weight": 0.050839826
    },
    {
      "name": "Mar Hall’s new chapter",
      "weight": 0.04969384
    },
    {
      "name": "Mar Halls sprawling estate",
      "weight": 0.049568627
    },
    {
      "name": "Scottish artist Nichol Wheatley",
      "weight": 0.047937382
    },
    {
      "name": "Scottish",
      "weight": 0.04771597
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Tourist Destinations/Historical Sites & Buildings",
      "score": 0.662109375
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.505859375
    },
    {
      "name": "/Real Estate/Real Estate Listings/Residential Sales",
      "score": 0.3935546875
    },
    {
      "name": "/Arts & Entertainment/Visual Art & Design/Architecture",
      "score": 0.35498046875
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.30908203125
    }
  ],
  "sentiment": {
    "positive": 0.5420607,
    "negative": 0.068079144,
    "neutral": 0.38986015
  },
  "summary": "Mar Hall, a five-star heritage estate in Scotland, has undergone a £20 million transformation following a former baronial mansion built in 1828 by Sir Robert Smirke for Major General Robert Walter Stuart, the 11th Lord Blantyre, who was accidentally shot and killed in 1830. The building, which became a social hub for the Scottish elite, aristocrats, and industrialists, has been transformed into a five star heritage estate under new ownership by Dubai-based Dutco Group. The redesign of Mar Hall was undertaken by Glaswegian interior designer Jim Hamilton, known for his thoughtful aesthetic rooted in stealth luxury and incorporating subtle nods to Scotland’s industrial and artistic heritage throughout the interior. The entrance hall is a masterstroke of timeless elegance, with heritage green walls complementing original stained-glass windows and tropical palms. The central champagne bar is inspired by archival drawings from the John Brown & Company shipyard in Clydebank.",
  "shortSummary": "Mar Hall, a luxury hotel and historic estate in the Highlands, has undergone a £20 million redesign, blending Scottish heritage with modern design.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2f8a703668f043f48cc950d2335867a8",
  "places": [
    {
      "osmId": "931146009",
      "road": "Mar Hall Avenue",
      "suburb": "Bargarran",
      "town": "Bishopton",
      "county": "Renfrewshire",
      "state": "Scotland",
      "postcode": "PA7 5NW",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 55.92080345,
        "lon": -4.478472534863146
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.marhall.com/",
      "text": "A COUNTRYSIDE RETREAT, MOMENTS FROM THE CITY\nStep into Mar Hall, a peaceful countryside retreat, a soulful escape, a place for get-togethers and celebrations, a sanctuary for spa and golf lovers alike. Mar Hall is your haven of Scottish charm, offering unforgettable experiences just moments from the city.\nA 5-Star Sanctuary of Scottish Luxury\nMar Hall begins a new era - now open and welcoming you to a world of timeless elegance and modern comfort. Set within 240 acres of peaceful estate, the resort has been reimagined to offer luxury with soul: a place where guests can unwind, indulge, and feel at home. Discover it all, one chapter at a time.\nBook direct for benefits\nMidweek suite upgrade when booking before 31st August\n-\nBest price guarantee\n-\nExclusive offers\n-\nPersonalised service\n-\nNo hidden extras\n-\nComplimentary Upgrade\nNew Dining Experiences, Crafted for you\nA new era of dining at Mar Hall has arrived. With beautifully reimagined spaces, every detail has been thoughtfully designed to bring warmth, connection, and understated luxury to the table.\nThe Perfect Place for Unforgettable Beginnings\nEvery wedding at Mar Hall is a bespoke affair, bringing your vision to life with our stunning setting, luxurious spaces, and attentive service. Let us craft a day as unique and memorable as your love.\nThe Collective\nLike the feeling of gathering round with family or friends, when stories were shared, memories passed down, and laughter lingered long after the last word, The Collective is a place for those moments.\nHere, we share the heart of Mar Hall. Stories old and new. The people who bring it to life. The celebrations, the quiet moments, the partnerships, and the heritage that threads it all together.\nSo come in, settle down, and stay for a while. We’ve got stories to share, and they’re best told together."
    },
    {
      "url": "https://www.timorousbeasties.com/profile",
      "text": "About Us\nTimorous Beasties was established in Glasgow in 1990 by Alistair McAuley and Paul Simmons, who met studying textile design at Glasgow School of Art. Today, the studio is a diverse operation and has emerged as a multi-award-winning, internationally acclaimed icon.\nApproach\nTimorous Beasties’ work embodies a unique diversity of pattern, ranging from design that echoes a golden age of copperplate engraving (a time-honoured classic is the Thistle range; or Merian Palm superwide wallpaper) to examples of a distinctly edgy nature, an elegant transgression, a display of chic irreverence. Yet, the studio fully engages a design discourse with textile's history by lending an aesthetic evolution to time-honoured motifs.\nIn 2004 Timorous Beasties unveiled their critically acclaimed Glasgow Toile: by reversing the pastoral context of toiles de Jouy, they transformed the traditional toile device to create an exclusively modern urban genre. The Hotch Blotch fabric series challenges a 1000-year old aesthetic mode by placing disorder within the structure of damask pattern to reveal the inherent beauty of splatters, drips and blotches. Hunting Toile and Urban wallpapers mark a synthesis of 18th-century Chinoiserie groupings, Rococo swirls and Victorian silhouette paper cuts to create a uniquely contemporary ornamental textiles pattern repeat.\nThe art critic John Ruskin related a universal connection between nature, art and society. Timorous Beasties share a similar world view, where plants, animals and society are visually inextricable. They are devoted to how that impacts as pattern design in our daily experience of furnished spaces, from one-bedroom flats to country villas, to the halls of civic and government buildings, departure lounge backdrops, boutique enclaves, restaurants, and hotels.\nCollections & Collaborations\nSome Timorous Beasties brand clients include Johnny Walker, Nike, Fortnum & Mason, and Philip Treacy. The Studio’s gallery of cultural design commissions includes the Edinburgh International Festival 2009 graphics and book covers for Penguin, Magna, and Granta.\nHome accessories include exclusive lines for the Scottish National Portrait Gallery, Brintons carpets and Liberty London. Ranking among the Studio’s strong record for bespoke furnishing and installation commissions are the V&A boardroom, UK Supreme Court, Wellcome Trust, the Art Institute of Chicago, and the Robert Burns Museum. Exteriors range from engraved stone cladding for Bristol’s Cabot Circus to the extravagant aluminium decorative façade for Princes Square, Glasgow. Christies, Claridges, the Inter-Continental Hotel Group, and Hilton-Waldorf Astoria rank among a heady list of our commercial clients.\nTimorous Beasties have collaborated with furniture elites Ercol, S.C.P., and the design cult classic duo, .nobody&co.\nAwards\nWinners of Walpole Award for Best Emerging Brand\nCollections\nArt Institute of Chicago, US\nCooper Hewitt Museum, New York, US\nDecorative Art Collection, Hampshire County Council, UK\nGOMA, Glasgow, UK\nRoyal Ontario Museum, Toronto, Canada\nTemple Newsam, Leeds, UK\nVictoria and Albert Museum, UK"
    }
  ],
  "argos_summary": "Mar Hall, a 240‑acre heritage estate overlooking the River Clyde, has been transformed into a £20 million, five‑star resort under Dubai‑based Dutco Group. Interior designer Jim Hamilton blended Scottish tradition with modern luxury, using local art from Timorous Beasties and Art Pistol, and created distinct, colour‑coordinated rooms that echo the estate’s history as a mansion and wartime hospital. Guests enjoy a multi‑sensory dining experience led by Chef Tony Tapia, a spa using Hebridean seaweed products, an 18‑hole championship golf course, and a range of outdoor pursuits, all set against misty Kilpatrick Hills. The property attracts celebrities and families alike, offering a blend of historic charm, contemporary design, and Scottish hospitality. Mar Hall positions itself as more than a hotel—an immersive destination that fuses heritage, art, cuisine, and nature into a cohesive luxury experience.",
  "argos_id": "TSA7XT51Z"
}