{
  "url": "https://www.nytimes.com/2025/08/15/health/maha-draft-report-pesticides.html",
  "authorsByline": "Dani Blum, Benjamin Mueller, Alice Callahan",
  "articleId": "e88978245353479a8cf375c2e6a73293",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/15/multimedia/15hs-maha-gmzh/15hs-maha-gmzh-facebookJumbo.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T22:27:42.971000+00:00",
  "addDate": "2025-08-15T22:33:43.361579+00:00",
  "refreshDate": "2025-08-15T22:33:43.361580+00:00",
  "score": 1.0,
  "title": "MAHA Draft Report Brings Relief to Some, Chagrin to Others",
  "description": "A draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped.",
  "content": "A sign warned of pesticide use on a strawberry farm in Oxnard, Calif. A draft report outlining proposals to improve children’s health did not include strong restrictions on pesticides.\n\nA draft of an upcoming White House report on children’s health was not as harsh toward the agriculture industry as some of Robert F. Kennedy Jr.’s allies had hoped.\n\nSome vocal allies of Health Secretary Robert F. Kennedy Jr. expressed dismay and alarm on Friday at what they saw as concessions to the powerful agriculture industry contained in the draft of an upcoming White House report on children’s health. The draft, details of which The New York Times published on Thursday, offered proposals on food and pesticides that fell short of what many in Mr. Kennedy’s Make America Healthy Again movement had hoped for. The disclosures reopened a bitter divide among supporters of President Trump over the clearest path to improving Americans’ health. In one camp are MAHA followers, who, like the health secretary, have warned that chemicals are poisoning Americans, and they are demanding swift action to clean up the food supply. In another are influential agriculture, food and drug interests that have traditionally backed Republicans and see the specter of a crackdown on the food supply as a threat to their industries, as well as to product prices and jobs.\n\nSomewhere in the middle are more moderate allies of Mr. Kennedy, including MAHA supporters who say they understood that their revolution could not happen overnight. The draft report, a strategy document by a presidential commission established to improve children’s health, is not final and will most likely change before its release in the coming weeks. It followed a report published in May that laid out what it said were the root causes of chronic childhood diseases. But many experts disagreed with some conclusions, and the report cited studies that did not exist. The Department of Health and Human Services declined to comment on reactions to the new draft report. The document said the Trump administration would back research on technologies to help farmers reduce pesticide use and on the health effects of exposure to chemicals. It called for a campaign to raise public awareness of existing pesticide review procedures.\n\nThe draft went so far as to praise current procedures as “robust.” Just before the election, by contrast, Mr. Kennedy pledged to “ban the worst agricultural chemicals that are already prohibited in other countries.” Zen Honeycutt, the founder of Moms Across America, an advocacy group closely linked to the MAHA movement, called the draft “profoundly disappointing and dangerous.” That the document did not take a strong stance against glyphosate, a widely used herbicide, is “absolutely counter to any claim that we’re going to make America healthy again,” she said. “Clearly we have a long ways to go in educating many of the members of this administration, because we know that statement is not what Kennedy alone would have issued,” she added. “That has been influenced by the chemical industry.” David Murphy, a former fund-raiser for Mr. Kennedy’s presidential campaign, said, “MAHA is very disappointed in this report.”\n\n“We didn’t come here because we want food dyes out of Froot Loops,” he added. “We came here because we want a fundamental rewriting of our food and ag policy.” But some aligned with Mr. Kennedy said the draft report revealed the messy reality of trying to craft national policy. Charles Eisenstein, a writer who has advised Mr. Kennedy, said he was pleased with what he had read about the draft report overall. “I think what’s happening here is that activists who have been on the outside for a long time are finally getting a taste of the actual complexity of these issues, once you’re actually in a policy-making position,” he said. “Kennedy is really preserving his political capital and picking his battles,” he added.\n\nSome studies have linked glyphosate and atrazine, widely used weedkillers, to adverse health outcomes, but research in humans has been limited. “The science does have to be investigated more, in more detail, before we put out some massive statements out there to put pressure on the agricultural community, on the U.S.D.A., on the E.P.A., to start pulling back on these chemicals,” she said. “I think we have to be very careful not to lean on our passion on this,” she added. Gary Brecka, who hosts a popular wellness podcast and is influential in the MAHA movement, also said he supported the draft report. “We’d love to see broad, sweeping legislation that outlaws some of these chemicals,” he said. “But if you’re Health and Human Services or the Department of Agriculture, you also have to realize the impact — not just financially, but the impact that this would make on the food supply having to shift gears so quickly.” Privately, agriculture industry officials took heart that the draft retreated from imposing restrictions on pesticide use. And the minor measures regarding the harms of chemicals seemed to industry officials to be relatively benign.\n\nJohn Bode, the chief executive of the Corn Refiners Association, said in a statement on Friday that the group “enthusiastically supports evidence-based efforts to improve public health.” “We are encouraged by the Make America Healthy Again Commission’s efforts to achieve that goal by soliciting stakeholder feedback to find evidence-based solutions,” he said. The industry had been bracing for a more aggressive crackdown after the initial report in May claimed that glyphosate and atrazine could be linked to cancers, endocrine disruption and liver inflammation. Since then, industry groups have pressed the White House MAHA commission on what they saw as weak scientific evidence behind those findings and raised concerns about the impact of heavier restrictions on food costs and jobs. Some industry officials said the draft showed that efforts in recent months to win a seat at the table had worked. “There’s just some massive lobbying going on right now,” said Dr. Mark Hyman, a functional medicine physician and longtime friend of Mr. Kennedy. “They don’t want to lose their chemical, seed and fertilizer billions and billions of dollars that they’re making.”\n\nDr. Hyman was generally pleased with the research priorities and food policy initiatives mentioned in the draft report, like those updating federal dietary guidelines, phasing out synthetic food dyes, tightening oversight of food additives and improving nutrition education in medical schools. “It’s just so encouraging to me that these things are even talked about,” he said. Still, he added, it remains to be seen how they will be funded or put in place. The draft fulfilled another wish of agriculture trade groups: It made no mention of seed oils, despite the report from May suggesting without evidence that those oils may contribute to inflammation in the human body. The agricultural groups had since warned that restricting or banning seed oils, including those made from corn and soybeans, could shrink the domestic market for those products as they were simultaneously being hit with retaliatory tariffs because of President Trump’s trade war. But many food and nutrition experts were disappointed by the draft report, which they said failed to lay out policies that would actually improve the country’s food supply.\n\nMarion Nestle, a professor emerita of nutrition, food studies and public health at New York University, said the report was full of “waffle words,” with plans for more research and exploring policy ideas. “That’s a joke,” she said. “They promised that the policy report would lay out the actions. I don’t see them.” Ultraprocessed foods were explicitly mentioned only once, noted Lindsey Smith Taillie, a professor of nutrition at the University of North Carolina Gillings School of Global Public Health. That signaled to her that the administration wasn’t serious about reducing their prominence in the food supply. She would have liked to see a plan to improve the nutritional quality of school meals and reduce the amount of ultraprocessed foods they contain — something Mr. Kennedy has promised to do. Dr. Taillie had also hoped for clear warning labels on the front of packages of ultraprocessed foods and policies that would make healthier foods more affordable. “If I were the food industry, I would be happy with this report, because it could have gone a much different direction,” she said.\n\nInstead, the Trump administration has slashed medical research funding. It isn’t clear how much funding the new initiatives laid out in the draft might receive. For all the scrutiny that the final report will receive in coming weeks, it represents only a small piece of Mr. Kennedy’s influence over public health. “Secretary Kennedy has an extraordinary opportunity to dramatically improve the quality of the food supply and lives of Americans,” said Dr. David A. Kessler, a former head of the Food and Drug Administration who last week petitioned the agency to regulate ultraprocessed foods. “What he does is considerably more important than what any report says.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2025/05/22/well/rfk-jr-maha-report-pesticides-health.html",
    "https://www.nytimes.com/2025/08/06/well/gras-kennedy-supplements.html",
    "https://www.nytimes.com/2024/11/09/well/eat/seed-oil-effects.html",
    "https://www.nytimes.com/2025/08/14/well/rfk-jr-maha-report-draft.html",
    "https://www.nytimes.com/2025/04/07/well/marion-nestle-nutrition-food-profile.html",
    "https://www.nytimes.com/interactive/2025/06/04/health/trump-cuts-nih-grants-research.html",
    "https://www.nytimes.com/2025/08/07/us/politics/fda-kennedy-ultraprocessed-food.html",
    "https://www.nytimes.com/2024/12/18/health/mark-hyman-rfk-jr-functional-medicine.html",
    "https://www.youtube.com/watch?v=FUqUcbs7yb8&t=93s"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "MAHA Draft Report",
      "weight": 0.08914179
    },
    {
      "name": "Mr. Kennedy",
      "weight": 0.07605078
    },
    {
      "name": "food policy initiatives",
      "weight": 0.07525638
    },
    {
      "name": "Ultraprocessed foods",
      "weight": 0.07373894
    },
    {
      "name": "ultraprocessed foods",
      "weight": 0.07373894
    },
    {
      "name": "food studies",
      "weight": 0.071779974
    },
    {
      "name": "healthier foods",
      "weight": 0.071646795
    },
    {
      "name": "food dyes",
      "weight": 0.07126167
    },
    {
      "name": "food",
      "weight": 0.07115854
    },
    {
      "name": "food additives",
      "weight": 0.06967411
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.87353515625
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.85205078125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.55126953125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.418212890625
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.399658203125
    }
  ],
  "sentiment": {
    "positive": 0.047065638,
    "negative": 0.7719397,
    "neutral": 0.18099457
  },
  "summary": "A draft report outlining proposals to improve children’s health did not include strong restrictions on pesticides, according to some of Robert F. Kennedy Jr.'s allies. The move has sparked a divide among supporters of President Trump over the best path to improving Americans’ health. Some, like Kennedy, believe chemicals are poisoning Americans and demand swift action to clean up the food supply. Others, believe the proposal falls short of what many in Kennedy's Make America Healthy Again movement had hoped for. The draft report, which is not final, will most likely change before its release in the coming weeks. The Department of Health and Human Services declined to comment on reactions to the draft report.",
  "shortSummary": "A draft White House report on children’s health faces mixed reactions, with some advocating for stronger pesticide controls and others expressing concerns over consumer protection.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d81abab068634d4fb0e8c2b0685c20f1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/interactive/2025/06/04/health/trump-cuts-nih-grants-research.html",
      "text": "In his first months in office, President Trump has slashed funding for medical research, threatening a longstanding alliance between the federal government and universities that helped make the United States the world leader in medical science.\nSome changes have been starkly visible, but the country’s medical grant-making machinery has also radically transformed outside the public eye, a New York Times analysis found. To understand the cuts, The Times trawled through detailed grant data from the National Institutes of Health, interviewed dozens of affected researchers and spoke to agency insiders who said that their government jobs have become unrecognizable.\nIn all, the N.I.H., the world’s premier public funder of medical research, has ended 1,389 awards and delayed sending funding to more than 1,000 additional projects, The Times found. From the day Mr. Trump was inaugurated through April, the agency awarded $1.6 billion less compared with the same period last year, a reduction of one-fifth. (N.I.H. records for May are not yet comparable.)\nThe impacts extend far beyond studies on politically disfavored topics and Ivy League universities like Columbia or Harvard. The disruptions are affecting research on Alzheimer’s, cancer and substance use, to name just a few, and studies at public institutions across the country, including in red states that backed Mr. Trump.\n“I think people should know that research that they probably would support is being canceled,” said Eden Tanner, a chemist at the University of Mississippi, who had been working with a colleague at Ohio State University to develop a novel approach for treating glioblastoma, an aggressive form of brain cancer. Their grant had been awarded through a program designed to diversify the biomedical workforce; in April, they were notified that it was being terminated.\n“I would like to cure brain cancer,” Dr. Tanner said. “I think that's not particularly controversial.”\nMr. Trump’s campaign against medical research has been carried out without congressional approval, and the legality is unclear. Lawsuits have challenged the slashing or delaying of funding.\nFederal officials, who have accused the N.I.H. of wasteful spending, have attributed the cuts to changing scientific priorities.\nThe N.I.H. “regularly examines its research portfolio” to determine which projects are “the most meritorious,” Andrew Nixon, a spokesman for the U.S. Department of Health and Human Services, said in an email. “Regular reviews of ongoing activities will help us determine the most strategic balance of projects to support and the best way to manage them going forward, especially as we need to be responsive to the often-changing nature of biomedical scientific progress.”\nScientists fear that the sweeping cuts could do long-term damage to U.S. scientific research, which has long driven medical and financial progress for the nation. “The country is going to be mourning the loss of this enterprise for decades,” said Dr. Harold Varmus, a Nobel Prize-winning cancer biologist who served as the director of the N.I.H. during the Clinton administration and the director of the National Cancer Institute under President Barack Obama.\nN.I.H. grants, awarded in a competitive process, are typically paid out in installments. A researcher with a $1 million four-year grant, for instance, will get about $250,000 a year. Scientists can use this money to buy equipment and supplies and to pay the salaries of the researchers who work in their labs, among other things.\nFrom 2015 to 2024, there have been fewer than 20 terminations a year, on average, according to Jeremy M. Berg, former director of the National Institute of General Medical Sciences at the N.I.H. from 2003 to 2011. They were generally for extenuating circumstances, such as illness or research misconduct.\nBut since late February, the government has publicly announced the cancellation of 1,389 N.I.H. awards. The agency scoured grants for key words and phrases like “transgender,” “misinformation,” “vaccine hesitancy” and “equity,” ending those focused on certain topics or populations, according to a current N.I.H. program officer, who asked not to be identified for fear of retribution.\nStudies focused on sexual and gender minority groups were among the first on the chopping block.\nKatherine Bogen, a doctoral student at the University of Nebraska-Lincoln, had been studying post-traumatic stress, alcohol use and intimate partner violence against bisexual women. The termination notice she received assailed studies “based primarily on artificial and nonscientific categories,” calling such research “antithetical to the scientific inquiry” and alleging that it was “often used to support unlawful discrimination on the basis of race and other protected characteristics, which harms the health of Americans.”\nThe language was “very insulting,” she said. “I get this letter that tells me, ‘Your research is not science. Not only is it ascientific, it’s a useless drain on resources, and, in fact, your research could be used to discriminate against ‘actual’ Americans or ‘regular’ Americans,’ or whatever they mean.”\nThe cuts spread to grants on health equity and racial and ethnic groups. Affected projects sought to improve access to mental health care for Latino, low-income and rural communities; to reduce maternal mortality among Black women; and to prevent gun violence in Asian American communities.\nTsu-Yin Wu, a researcher at Eastern Michigan University who led the gun violence project, said that community leaders and study participants were “greatly disappointed” by the grant cancellation. “Some felt betrayed that their voices and engagement no longer matter.”\nThe agency cut grants for research on vaccine hesitancy, disinformation and misinformation, including a Northeastern University study on cancer misinformation on social media.\nIt also axed research on Covid-19, including studies that could have helped the nation respond to many infectious disease threats. Among them: a grant to Emory University and Georgia State University, where researchers had developed three potential drugs that showed promise against many RNA-based viruses, including coronaviruses, Ebola, avian influenza and measles, said George Painter, a pharmacologist at Emory who was co-leading the research.\nIn April, the agency terminated, in part or in whole, more than 350 grants meant to support students, early-career scientists or researchers from groups underrepresented in science. Among these terminations were F31 diversity grants, awarded to Ph.D. students who were members of certain racial or ethnic groups, disabled or from disadvantaged backgrounds.\nAt the University of Pittsburgh, Luzmariel Medina-Sanchez, who was born and raised in Puerto Rico, and Sierra Wilson, a first-generation college student from Utah, both had their grants canceled. “It’s not even about the work I’m doing,” said Ms. Wilson, who studies how liver cells respond to drug overdoses. “It feels like it’s about me.”\nMs. Medina-Sanchez, who studies how a microbe can help treat celiac disease, said she may leave science altogether. “I feel racially targeted,” she said. “I feel like I’m not going to be a professional in the field of science in America, because obviously my name is Luzmariel.”\n(Ms. Wilson and Ms. Medina-Sanchez stressed that they spoke only for themselves and not for the university.)\nBesides outright canceling projects, N.I.H. failed to distribute annual payments to more than 1,000 grants, The Times found.\nThe delays have stifled research on drug discovery, blood vessel health and injury response. In some cases, scientists have cut staff, paused hiring, trimmed back supplies or delayed experiments. Health officials have not explained which projects have been held up, why or for how long.\nThe Times compiled a list of the delayed grants by searching N.I.H. databases as of June 2 for ones that were funded in 2024 and expected to last beyond 2025, but have not gotten disbursements on schedule.\nIn the past, annual renewals were routine. Scientists submitted progress reports; the N.I.H. reviewed them and usually continued funding them, occasionally with a week or two of delays. But longer delays have become much more common since Mr. Trump took office.\nJoshua Kritzer, a professor of chemistry at Tufts University, investigates the basic science behind potential drug candidates, laying the groundwork for future medications. Most of his lab work is supported by a five-year N.I.H. grant that received $1.4 million over the past two years. But since February, he had been waiting for the third year of expected funding to come in. He slashed purchases of essential supplies and contemplated laying off crucial researchers on his team.\nOn Tuesday, Kritzer finally received word that his funding had been released, several days after The Times asked federal officials about his and other delayed awards.\n“Every week that’s delayed, it’s easily probably three to four weeks to get that research back to where it was,” said Dr. Kritzer, who noted that he was speaking for himself and not for his institution.\nMr. Nixon, the Department of Health spokesman, said that the agency would not discuss deliberations about specific awards but encouraged grant recipients to “speak with the designated N.I.H. officials on their award notice when questions arise.”\nIn some cases, delays have lasted so long that scientists wondered whether their grants were subject to a “shadow termination.”\nThe delays stem in part from additional screening for whether the grants align with Trump administration priorities, N.I.H. officials said. Other renewals have been delayed as overstretched N.I.H. staff members work through backlogs in funding. And political appointees are now vetting some projects, too, slowing the process further.\nN.I.H. officials said they feared being fired if they processed a grant renewal that the administration disfavored.\nIn early May, Jon Lorsch, a longtime N.I.H. institute director who was recently promoted to acting deputy director of the agency’s external funding arm, emailed staff members denouncing the renewal of grants “that focused on topics that are not supported under N.I.H./H.H.S.'s priorities,” according to a copy of the email seen by The Times.\n“The consequences of approving an award that should not have been approved could be very serious,” he wrote.\nBut Courtney Griffin, who leads a lab at the Oklahoma Medical Research Foundation and studies blood vessel development and disease, including complications due to diabetes, expressed confusion as to why her expected funding is not coming through. She and her colleagues were making contingency plans and looking for other sources of funding.\n“It’s, ironically, a really inefficient use of people’s time to be in this guessing game,” she said, adding that the time could be better spent on biomedical research.\nMonths-long delays are also affecting new grants that were being vetted when the Trump administration cracked down on grant reviews.\nA number of major Alzheimer's Disease Research Centers, some of which have operated for decades, have waited months for the Trump administration to decide whether to award them fresh five-year grants. The funding gaps have set back ongoing studies and curtailed efforts to take images of patients' brains, though the N.I.H. has recently told some centers that they would soon receive funding.\n“These centers have become a safety valve for people who can’t get a neurology appointment at a private center,” said Dr. Ann Cohen, a co-director of the University of Pittsburgh Alzheimer’s center. Now, she said, things have changed. “There are fewer clinic appointments, fewer opportunities for these individuals to get brain imaging.”\nThe N.I.H. has also said that it will no longer fund projects in which U.S. researchers distribute some of their money to international partners, throwing the future of many global health projects into question and creating funding delays for ongoing research.\nBeyond the disruption of individual projects, other proposed changes could undermine scientific research across the board, experts said. One would sharply curb funding for indirect research costs, such as building maintenance and administrative staff. And then there is Mr. Trump’s proposal to slash the N.I.H.’s total budget by about $18 billion, a cut of almost 40 percent.\nA budget cut of that scale would be “truly draconian,” said Dr. Varmus, the former N.I.H. director, who said he hoped Congress would not approve such a sharp reduction. It could leave the agency without enough money to fund promising new work, drive some scientists overseas and prompt some up-and-coming researchers to leave science altogether, he said. “You can completely destroy the system in just a couple of years,” Dr. Varmus said."
    }
  ],
  "argos_summary": "A draft White House report on children’s health, released by the Trump administration’s Health Secretary Robert F. Kennedy Jr., offers modest proposals on food and pesticide regulation, sparking disappointment among advocates who wanted stronger limits on chemicals like glyphosate and atrazine. The report praises existing pesticide review procedures and calls for research on reducing pesticide use, while largely avoiding sweeping bans or new restrictions that could impact agriculture jobs and food prices. Meanwhile, the administration has also cut NIH funding, terminating over 1,300 awards and delaying more than 1,000 projects, disproportionately affecting research on health equity, sexual and gender minorities, and infectious diseases, and raising concerns about long‑term damage to U.S. scientific progress.",
  "argos_id": "UJHUKJQUY"
}