{
  "url": "https://nypost.com/2025/08/15/real-estate/dream-of-us-home-ownership-slips-further-from-view-as-average-mortgage-costs-leap-far-past-median-incomes/",
  "authorsByline": "Mary K. Jacob",
  "articleId": "9c0f040cb9c14d2caaec89d37444ff0f",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-bjr05o82l-1755288927753.jpg?quality=75&strip=all&1755274541&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T20:16:02+00:00",
  "addDate": "2025-08-15T20:18:43.811460+00:00",
  "refreshDate": "2025-08-15T20:18:43.811462+00:00",
  "score": 1.0,
  "title": "Dream of US home ownership slips further from view — as average mortgage costs leap far past median incomes",
  "description": "A long-kept promise is increasingly under siege.",
  "content": "For generations, buying a home was the surest ticket to middle-class security — a way to build wealth, plant roots, and pass something down to the next generation.\n\nToday, that promise is under siege.\n\nIn 2024, the annual income needed to cover monthly payments on a median-priced home jumped to a whopping $126,670, data from the Harvard Joint Center for Housing Studies showed — 60% up from just three years earlier.\n\nOver the same time span, US median household income rose only 1.3% — to $80,610.\n\n“There’s no rush to be a homeowner given that differential,” Laurie Goodman, founder of the Housing Finance Policy Center at the Urban Institute, told Bloomberg.\n\nAnd the stunning financial gap is just one of many issues, tilting the math of buying against households across the country.\n\nLimited construction since the 2008 financial crisis, combined with homeowners holding on to low-rate mortgages, has kept supply thin.\n\nLabor shortages are making building more expensive, while property taxes climb and billion-dollar natural disasters erode equity.\n\nFrom 2019 through 2024, property tax bills jumped nearly 50% in Florida, 33% in Dallas, and 32% in Clark County, Nev., which includes Las Vegas, according to data from Cotality.\n\nBuilding new often costs more than buying an existing home, and labor shortages have slowed construction further.\n\nCrunch the numbers, and the consequences are clear.\n\nThe median age of first-time homebuyers climbed to 38 last year from 28 in 1991, the National Association of Realtors reported.\n\nThe share of first-time buyers fell to 24%, the lowest since record-keeping began in 1981.\n\nThe plummeting figures come as buyers can no longer count on mortgage payments being lower than rent in many markets. As recently as 2021, owning was still as affordable as renting in 21 major markets.\n\nNow the, reverse is true in 49 of the 50 largest metropolitan areas, with renting on average $908 a month cheaper, Realtor.com data showed.\n\nSome states and cities are attempting fixes.\n\nUtah recently earmarked $300 million for low-interest loans aimed at moderate-income buyers, while Rhode Island offers gap financing to spur development of affordable owner-occupied homes.\n\nMinneapolis has partnered with nonprofits on lease-to-buy programs.\n\nYet for many, the costs and risks of ownership outweigh the benefits.\n\nSome homeowners are even choosing to sell and rent, despite small mortgages.\n\n“I think they overvalue staying in a home,” Daryl Fairweather, chief economist for Redfin said. “Homes are expensive.”",
  "medium": "Article",
  "links": [
    "https://www.bloomberg.com/news/features/2025-08-13/americans-are-getting-priced-out-of-homeownership-at-record-rates",
    "https://nypost.com/2025/08/14/real-estate/nycs-charming-pre-war-apartment-buildings-still-reign-supreme-over-modern-luxury/",
    "https://nypost.com/2025/08/15/real-estate/naomi-osaka-sells-la-home-back-to-nick-and-vanessa-lachey-for-7-95m/",
    "https://nypost.com/2025/08/15/real-estate/kanye-wests-former-malibu-mansion-back-on-the-market-for-34-9-million-three-years-after-rapper-gutted-the-architectural-gem/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US home ownership",
      "weight": 0.08440646
    },
    {
      "name": "US median household income",
      "weight": 0.076116204
    },
    {
      "name": "average mortgage costs",
      "weight": 0.07516582
    },
    {
      "name": "Homes",
      "weight": 0.07510142
    },
    {
      "name": "mortgage payments",
      "weight": 0.07082853
    },
    {
      "name": "median incomes",
      "weight": 0.06776692
    },
    {
      "name": "small mortgages",
      "weight": 0.062754385
    },
    {
      "name": "Realtor.com data",
      "weight": 0.05807846
    },
    {
      "name": "property tax bills",
      "weight": 0.057553347
    },
    {
      "name": "buyers",
      "weight": 0.056169767
    }
  ],
  "topics": [
    {
      "name": "Environment-ESG"
    },
    {
      "name": "Real Estate"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.95947265625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.927734375
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.8232421875
    },
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.5791015625
    }
  ],
  "sentiment": {
    "positive": 0.08482317,
    "negative": 0.7442996,
    "neutral": 0.1708772
  },
  "summary": "The average mortgage costs have surged significantly above average incomes in the US, according to data from the Harvard Joint Center for Housing Studies. The annual annual income needed to cover monthly payments on a median-priced home in 2024 is expected to reach $126,670, a 60% increase from three years earlier, while the US median household income rose only 1.3% to $80,610. Factors such as limited construction since the 2008 financial crisis and low-rate mortgages have contributed to this disparity, including labor shortages and property taxes rising. The median age of first-time homebuyers has also increased, with the share of new home buyers falling to 24%, the lowest since record-keeping began in 1981. Some states and cities are attempting to address these issues, while others are choosing to sell and rent, despite small mortgages.",
  "shortSummary": "US home ownership is declining as mortgage costs soar above average incomes, with limited construction and property taxes increasing homeowners' costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3eb5af508bdd4b8d8568d8c88ec62ac5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/14/real-estate/nycs-charming-pre-war-apartment-buildings-still-reign-supreme-over-modern-luxury/",
      "text": "NYC’s charming, pre-war apartment buildings still reign supreme over modern luxury: ‘True history you can actually live in’\nIn an era when Manhattan’s skyline seems to sprout glass-and-steel towers by the week, a devoted subset of buyers is looking in the opposite direction, toward buildings erected long before World War II.\nThese apartments, built between the 1880s and the early-1940s, are prized for their craftsmanship and character — things that modern construction often struggles to match.\n“Pre-war apartments continue to attract a very specific type of buyer in New York City, someone who values history, craftsmanship, and architectural charm over the sleek amenities of new developments,” Ben Jacobs, a luxury real estate broker at Douglas Elliman, told 6sqft.\nMany clients, he added, are drawn to the high ceilings, thick walls, and intricate moldings that “just ‘feels like New York.’”\nThe appeal is more than aesthetic, brokers say.\nSteven Gottlieb of Coldwell Banker Warburg told the outlet, “So many of the apartments boast high ceilings, grand room scale, and details like crown moldings, beams, and elegant hardwood floors.”\nEllen Sykes, also with Coldwell Banker Warburg, pointed to practical benefits such as thicker walls for soundproofing, built-ins, and formal dining rooms.\nYet the same age that gives these homes their charm can complicate ownership.\n“A lot of pre-war buildings haven’t been kept up to date with plumbing, electrical, and overall infrastructure,” Gina Conzo, another Coldwell Banker Warburg broker, said.\nFor landmarked buildings, she added, renovations “can be difficult and even sometimes limited.”\nCorcoran’s Kirsten Jordan cautioned that older systems can hide costly surprises, with repairs often running higher than expected, along with restrictions on washers, dryers or plumbing changes.\nOwnership structure adds another wrinkle.\nMost pre-war properties are co-ops, which operate under a different set of rules than the condos common in newer buildings.\n“Since most pre-war apartments are in co-ops, this is really a co-op vs condo question,” Clif Thorn of Douglas Elliman told 6sqft.\nHe argued that co-ops can be “more financially stable overall,” citing the 2008 financial crisis, when “more condos suffered financial hardships than co-ops.”\nStill, co-ops often impose strict financial disclosures, lending rules and limits on subletting.\n“The barrier of entry to get into some of these co-ops is very high,” Conzo said, adding that most do not permit subletting, limiting investment potential.\nThorn noted that “shareholders in co-ops are having to loosen the reins a bit…in order to compete and maintain their values.”\nSome pre-war icons have been updated to meet modern expectations without sacrificing their period character.\n4 East 70th Street and 740 Park Avenue, for example, are considered buildings where “stepping into these lobbies, you immediately feel how meticulously they’ve been preserved,” Kirsten Jordan of Corcoran said.\n580 Park Avenue is also “a classic pre-war that underwent a spectacular gut renovation” and sold quickly at strong prices, Jordan said.\nOther Roth landmarks include The Ardsley, The San Remo, The Shenandoah, The Beresford, and The Normandy.\nThe Apthorp, The Belnord, and The Majestic also remain high on buyer wish lists. For those seeking a lower-profile option, Coldwell Banker Warburg’s Veronique Perrin endorsed Tudor City as “the best-kept secret for first-time buyers.”\nFor Jordan, the draw comes down to scarcity.\n“Pre-war apartments offer something rare in New York: True history you can actually live in. The supply is finite—you can’t just build another 1920s gem,” she told the outlet.\n“There’s magic in owning a piece of architectural heritage…there’s a story and a soul behind every stone.”"
    },
    {
      "url": "https://nypost.com/2025/08/15/real-estate/naomi-osaka-sells-la-home-back-to-nick-and-vanessa-lachey-for-7-95m/",
      "text": "Tennis star Naomi Osaka sells plush LA pad to Nick and Vanessa Lachey for $7.95M — three years after buying it from them for $6.3M\nNaomi Osaka is returning her keys.\nThe four-time Grand Slam champion has sold her LA residence back to Nick and Vanessa Lachey for $7.95 million — roughly three years after buying the San Fernando Valley spread from the celebrity couple for $6.3 million.\nThe transaction took place off-market, though records show the Tarzana home was quietly priced at $8.295 million in the local multiple listings service, according to the Wall Street Journal.\nDuring her ownership, Osaka undertook a substantial renovation, reworking the interiors and adding a separate structure that now houses a full gym and a spa-like recovery suite.\nThe fitness facility features neon-lit motivational slogans, while the recovery area is outfitted with a sauna, cold plunge, steam room and massage table. Her signature bear-and-flower logo is embedded in the gym floor.\nSituated on roughly half an acre, the compound includes a pool, hot tub and pickleball court, but — ironically — no tennis court. The main house offers five bedrooms, views of the surrounding mountains, and an open kitchen with a dedicated dining island.\nAmy Snider of Compass held the listing.\nThe Lacheys, known for hosting Netflix’s “Love Is Blind” and, in Nick’s case, for his role in boy band 98 Degrees, originally acquired the property in 2020 for about $5 million before selling it to Osaka the following year.\nThey recently listed another San Fernando Valley home, in nearby Encino, for $7.495 million.\nTarzana, named to honor a former ranch that belonged to “Tarzan” author Edgar Rice Burroughs, remains a sought-after enclave of golf courses, country clubs and high-end housing.\nIn July, the median sale price there was $1.3 million, according to Redfin.\nOsaka, who has captured two U.S. Open and two Australian Open titles, returned to professional play in January after giving birth to her daughter.\nThis year, she exited in the first round of the French Open and reached the final of the Canadian Open —before falling to Victoria Mboko."
    },
    {
      "url": "https://nypost.com/2025/08/15/real-estate/kanye-wests-former-malibu-mansion-back-on-the-market-for-34-9-million-three-years-after-rapper-gutted-the-architectural-gem/",
      "text": "Kanye West’s former Malibu mansion back on the market for $34.9 million — three years after rapper gutted the architectural gem\nKanye West’s hollowed-out former home is back on the market for the fourth time in five years.\nThe concrete Malibu mansion designed by world-renowned starchitect Tadao Ando relisted this week for $34.9 million, just months after going into contract.\nWest made headlines in 2022 after he gutted and subsequently abandoned the iconic residence. This most recent listing, first reported by Realtor.com, marks yet another period of uncertainty in the box-like home’s unhappy history.\nThe Montana-based luxury developer and builder Andrew Mazzella entered into contract in March for the half-restored home.\nThe deal between Mazzella and the crowd-funded firm that took the property off of West’s hands has reportedly dragged on ever since, Mansion Global reported.\nMazzella told the outlet that the unique property is “a very complicated construction project,” and said that negotiations are still ongoing.\n“I consider my business style to be that of Trump, Musk and Carl Icahn combined, so it’s not an easy process,” Mazzella told Mansion Global.\nPritzker Prize-winning architect Tadao Ando designed the minimalist four-bedroom home, dubbed “Little Ando,” in 2013. Ando is the mastermind behind Jay-Z and Beyonce’s own Malibu manse, a record-setting property called “Big Ando.”\nWest bought “Little Ando” for $57.25 million in 2021.\nWest, who had his legal name changed to “Ye,” then gutted the rare Ando home. The controversial music mogul reportedly sought to turn the abode into his own personal “bomb shelter,” and “bat cave.”\nThe rapper soon deserted the effort, however, leaving the concrete shell open to the elements between 2022 and 2023.\nThe crowdfunded real estate firm Belwood Investments snapped up the property in 2024 for just $21 million — $14 million less than what West originally asked. The firm, helmed by developer Steven “Bo” Belmont, began an ambitious restoration of the property, installing all new framing, plumbing, roofing and electrical work.\nBelwood’s 500-plus investors were set to receive an early payday after the firm listed the semi-restored property for $39 million earlier this year. It quickly entered into contract with Mazzella’s company Andrew Mazzella Ventures LLC in March for an undisclosed sum upwards of $30 million, the Wall Street Journal reported.\nMazzella made a cash offer on the still-windowless “Little Ando,” the outlet reported, with plans to finish and relist the property for between $55 to $65 million.\nNow, however, the fate of the architectural gem is in limbo once more.\nThe deal between Belwood and Mazzella was set to close in May, Mansion Global reported, and construction is currently halted. Mazzella told the outlet that the parties are “still negotiating,” and that he would keep looking for other investment opportunities if this deal falls through.\nAs of Wednesday, the three-story home is up for grabs for $34.9 million.\nJason Oppenheim of the Oppenheim Group and Mauricio Umansky of the Agency still hold the listing. Oppenheim represented West in the previous sale to Belmont."
    }
  ],
  "argos_summary": "The article highlights a widening gap between home‑ownership affordability and median incomes, noting that the income needed to cover a median‑priced home rose to $126,670 in 2024 while median household income barely increased. It contrasts this trend with the appeal of historic pre‑war New York City apartments, whose architectural charm attracts buyers despite costly maintenance and co‑op restrictions. The piece also reports on high‑profile real estate transactions: Naomi Osaka sold her renovated LA home back to its former owners for $7.95 million, and Kanye West’s Tadao Ando‑designed Malibu mansion has relisted for $34.9 million after a stalled restoration. Together, the stories illustrate shifting dynamics in the U.S. housing market, from affordability challenges to niche luxury property deals.",
  "argos_id": "VXLBIZZOJ"
}