{
  "url": "https://finance.yahoo.com/news/accord-announces-amendment-banking-facility-220000356.html",
  "authorsByline": "Business Wire",
  "articleId": "0483d98830fa4f44953cc82bc9ba0343",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/business-wire.com/de67afaf49f4f50e07d01a8503512acb",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T22:00:00+00:00",
  "addDate": "2025-08-15T22:08:28.776578+00:00",
  "refreshDate": "2025-08-15T22:08:28.776579+00:00",
  "score": 1.0,
  "title": "Accord Announces Amendment to its Banking Facility",
  "description": "TORONTO, August 15, 2025--Accord Announces Amendment to its Banking Facility",
  "content": "TORONTO, August 15, 2025--(BUSINESS WIRE)--Accord Financial Corp. (TSX – ACD) today announced it has amended its senior secured revolving credit facility (the \"Credit Facility\"), extending the maturity date to December 15, 2025.\n\nThis amendment follows two recent short-term extensions: the first announced on July 25, 2025, and the second on August 8, 2025, which extended the maturity date to August 15, 2025. Under the new terms, the total commitment will be reduced from $260 million to $200 million. The amendment also incorporates milestones tied to potential asset sales (with net proceeds to be used to repay bank indebtedness), increases the interest rate on drawn amounts by 1.00%, and updates certain financial covenants.\n\n\"While the amendment includes higher pricing and a reduced commitment, the extension provides time for the Company to continue to actively pursue a broad range of strategic initiatives to address the Company’s maturing debt obligations (totalling $217.6 million as at June 30, 2025 and coming due by January 31, 2026) and maximize shareholder value,\" said Mr. Hitzig. \"These include potential divestitures of portfolio assets or business units, as well as other financing alternatives. The Company continues to work closely with its financial advisors, but there is no assurance that these initiatives will yield a successful result. While we focus on these initiatives, profitable operating performance and growth will continue to be a challenge.\" The Company does not plan to provide further updates on its strategic initiatives unless material developments emerge.\n\nA Material Change Report and the amended Credit Facility agreement will be filed on SEDAR+ at www.sedarplus.ca.\n\nAbout Accord Financial Corp.\n\nAccord Financial is one of North America’s most dynamic commercial finance companies providing fast, versatile financing solutions including asset-based lending, factoring, inventory finance, equipment finance (in Canada), trade finance and film/media finance. By leveraging our unique combination of deep experience and independent thinking, we craft winning financial solutions for small and medium-sized businesses, simply delivered, so our clients can thrive.\n\nFor further information please visit www.accordfinancial.com or contact:\n\nForward-Looking Statements\n\nThis news release contains certain \"forward-looking statements\" and certain \"forward-looking information\" as defined under applicable Canadian securities laws. Forward-looking statements can generally be identified by the use of forward-looking terminology such as \"may\", \"will\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"believe\", \"continue\", \"plans\" or similar terminology. Forward-looking statements in this news release include, but are not limited to, statements, management's beliefs, expectations or intentions regarding the financial position of the Company and the ability of the Company to repay or refinance its outstanding debt obligations. Forward-looking statements are based on forecasts of future results, estimates of amounts not yet determinable and assumptions that while believed by management to be reasonable, are inherently subject to significant business, economic and competitive uncertainties and contingencies. Forward-looking statements are subject to various risks and uncertainties including the Company’s overall liquidity and capital resource position and its ability to repay its debt obligations when due and those risks identified in the Accord's periodic filings with Canadian securities regulators. If any or all of the Company’s outstanding debt obligations are not renewed or replaced upon expiration of their terms, and if the Company is unsuccessful in its ability to generate additional capital from sales of portfolio assets and/or business units and additional alternative financing arrangements to repay same on terms acceptable to the Company, or at all, the Company may not be able to continue to finance its operations and operate as a going concern. See Accord's most recent annual information form and most recent management’s discussion and analysis of results of operations and financial condition for a detailed discussion of the risk factors affecting Accord. Such forward-looking information represents management's best judgment based on information currently available. No forward-looking statement can be guaranteed and actual future results may vary materially. Accordingly, readers are advised not to place undue reliance on forward-looking statements or information.",
  "medium": "Article",
  "links": [
    "https://www.businesswire.com",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.accordfinancial.com&esheet=54308885&newsitemid=20250815806045&lan=en-US&anchor=www.accordfinancial.com&index=2&md5=6b6ca6c0eda6b336e9a831da0c393dd5",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedarplus.ca&esheet=54308885&newsitemid=20250815806045&lan=en-US&anchor=www.sedarplus.ca&index=1&md5=d0b0a40bf5a0e1c9869f65bfd6e97acc"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Company",
      "weight": 0.06461959
    },
    {
      "name": "winning financial solutions",
      "weight": 0.063632876
    },
    {
      "name": "Accord Financial Corp.",
      "weight": 0.06212238
    },
    {
      "name": "strategic initiatives",
      "weight": 0.0611843
    },
    {
      "name": "certain financial covenants",
      "weight": 0.060929086
    },
    {
      "name": "potential asset sales",
      "weight": 0.060553886
    },
    {
      "name": "business units",
      "weight": 0.060064703
    },
    {
      "name": "Accord Financial",
      "weight": 0.05958788
    },
    {
      "name": "further information",
      "weight": 0.059428953
    },
    {
      "name": "financial condition",
      "weight": 0.058569454
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9853515625
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.9384765625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.8076171875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.73974609375
    },
    {
      "name": "/Finance/Credit & Lending/Other",
      "score": 0.487060546875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.436767578125
    }
  ],
  "sentiment": {
    "positive": 0.3324904,
    "negative": 0.081400745,
    "neutral": 0.58610886
  },
  "summary": "Accord Financial Corp. (TSX – ACD) has amended its senior secured revolving credit facility (the Credit Facility), extending its maturity date to December 15, 2025. The new terms reduce the commitment from $260 million to $200 million and include milestones related to potential asset sales. The interest rate on drawn amounts increases by 1.00%, and updates certain financial covenants. The extension allows the company to pursue a range of strategic initiatives to address the Company’s maturing debt obligations, which totalling $217.6 million as at June 30, 2025 and coming due by January 31, 2026. The Company will not provide further updates on its strategic initiatives unless material developments emerge.",
  "shortSummary": "Accord Financial Corp. has amended its senior secured revolving credit facility to December 15, 2025, with increased pricing, and potential asset sales.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1c3f7d2a13ae4bd7a789993641d77315",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Accord Financial Corp. has amended its senior secured revolving credit facility, extending the maturity to December 15 2025 and reducing the commitment from $260 million to $200 million while raising the interest rate on drawn amounts by 1.00%. The amendment introduces milestones linked to potential asset sales and updates financial covenants. Management says the extension gives the company time to pursue strategic initiatives—such as divestitures and alternative financing—to address its $217.6 million of maturing debt due January 31 2026 and to maximize shareholder value. No further updates will be provided unless material developments occur.",
  "argos_id": "WPE89US4U"
}