{
  "url": "https://finance.yahoo.com/video/economists-saying-inflation-now-175946017.html",
  "authorsByline": "Yahoo Finance Video",
  "articleId": "593e5185fa2448339a2b10af84187e81",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/KtfSvT.fEIWmv0qVQAmudw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-08/97e0e660-7a01-11f0-9efa-64e9c7c8bc37",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T17:59:46+00:00",
  "addDate": "2025-08-15T18:09:25.729217+00:00",
  "refreshDate": "2025-08-15T18:09:25.729219+00:00",
  "score": 1.0,
  "title": "What economists are saying about inflation now",
  "description": "The hotter-than-expected July PPI print has some worried about how tariffs will impact inflation and what it ultimately means for the Federal Reserve and interest rates. Yahoo Finance Senior Reporter Allie Canal shares what some economists are saying about inflation now. To watch more expert insights and analysis on the latest market action, check out more Market Catalysts.",
  "content": "Consumer sentiment fell for the first time since April last month as inflation expectations climbed. Anxiety around the impact of tariffs is weighing on the minds of consumers, but is inflation being driven by more than just tariffs? Yahoo Finance's Allie Canal live at the Nasdaq with more. Hi Allie.\n\nHi Julie. And that's a question that's hard to say. Heading into this week, the focus was on core goods and the potential tariff impact on everything from apparel to furniture. But instead of a sharp jump in goods, we saw services inflation firm. That showed up in both the CPI and PPI reports earlier this week. The producer price index, uh, that surged to a three-year high signaling that businesses are absorbing much of the tariff burden. So the concern now is those higher costs could soon be passed on to consumers making the services side of the economy more expensive, just as the full tariff impact on goods is still set to play out. Now, markets may be mostly shrugging this off, still trading at those record highs, but economists are warning that the tariff effects haven't fully landed. Raymond James chief economist, Eugenio Aleman, he said in a note this week, quote, the full impact of tariffs is expected to materialize in next month's data, potentially pushing good prices higher. This complicates the Fed's September decision. And complicate is the key word here, Julie, especially after this morning's stable retail sales report. So this is really the chatter on Wall Street right now. And here's a bit more of what economists told us this week.\n\nmore concerned about its impact on future CPI prints. I think it's telling you that the price effects are starting to work its way throughout the supply chain. Yeah, maybe maybe the July CPI print wasn't that strong, but come August, September, we might start to see firmer prints, and that puts the Fed in a tough spot.\n\nThe good news here, as you say, is the tariff impulse into inflation wasn't as high as anticipated this month. The bad news, as you pointed out, is is that, um, services inflation was pretty soft in in prior months, and it did give the impression to many that, hey, maybe we could ignore tariff inflation because services weakness will offset it. But now I think a lot of that's reversed.\n\nThese are broad-based inflationary pressures that we're seeing just now. I I I see more reason for rates to be rising in order to not let inflation, uh, get away from us. Inflation is the risk that's on our doorstep, much more so than the labor market. Uh, the Fed officials know that.\n\nAnd we do know that markets are still pricing in with near 100% certainty that the Fed cuts interest rates in September. Of course, Jackson Hole next week is going to give us a lot of clues into the thinking of the Fed with Federal Reserve chair, Jerome Powell, set to speak. But even with that September rate cut priced in by markets, you know, investors still think we are going to see an additional one to two rate cuts for from there to really end 2025 with about three cuts in total, and then more rate cuts are expected in 2026. So we're seeing that play out a bit in in the bond market. Long-term yields, like the 30-year yield, for example, is ticking higher today. But all of this, a big question mark is we continue to wade through this data with more prints and reports expected in the weeks and months ahead, Julie.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tariff inflation",
      "weight": 0.1085752
    },
    {
      "name": "services inflation",
      "weight": 0.092781186
    },
    {
      "name": "more rate cuts",
      "weight": 0.0847003
    },
    {
      "name": "tariffs",
      "weight": 0.08351126
    },
    {
      "name": "more prints",
      "weight": 0.08243374
    },
    {
      "name": "inflation expectations",
      "weight": 0.079644956
    },
    {
      "name": "Inflation",
      "weight": 0.079297006
    },
    {
      "name": "inflation",
      "weight": 0.079297006
    },
    {
      "name": "next week",
      "weight": 0.0745777
    },
    {
      "name": "future CPI prints",
      "weight": 0.06913446
    }
  ],
  "topics": [
    {
      "name": "Inflation"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.9931640625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.92578125
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.6044921875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.54296875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.373779296875
    }
  ],
  "sentiment": {
    "positive": 0.051496055,
    "negative": 0.82503927,
    "neutral": 0.12346477
  },
  "summary": "Consumer sentiment fell for the first time since April last month as inflation expectations rose. Economists are concerned that more than just tariffs are driving inflation, with the producer price index surging to a three-year high indicating businesses are absorbing much of the tariff burden. The concern is that higher costs could soon be passed on to consumers, making services more expensive. Despite this, markets have largely shrugged off this, but economists warn that the full tariff impact on goods hasn't fully landed yet. The full impact of tariffs is expected to affect next month's data, potentially pushing good prices higher. This complicates the Fed's September decision.",
  "shortSummary": "Experts warn that inflation is driven by broader, broader pressures from tariffs, rising consumer expectations, and potential price increases, potentially impacting the Fed's interest rate decision.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1f59c092379e4c9fa4398e2e28684f6a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Consumer sentiment fell for the first time since April as inflation expectations climbed, partly due to tariff‑related cost pressures. While goods inflation has not spiked sharply, services inflation has firmed, reflected in a three‑year high PPI that signals businesses are absorbing tariff costs and may soon pass them on to consumers. Economists warn that the full tariff impact will likely appear in next month’s data, potentially prompting higher consumer prices and complicating the Fed’s September policy decision. Despite this, markets remain largely optimistic about a September rate cut, with expectations of additional cuts through 2025 and into 2026.",
  "argos_id": "X81MT6Q16"
}