{
  "url": "https://www.yahoo.com/entertainment/articles/oscar-nominee-cathy-moriarty-stars-182838114.html",
  "authorsByline": "Matthew Carey",
  "articleId": "b62a688793a647e496a09f8e2dba0b0d",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/cd159df85183b0d7fcd44c82bdb71c309e0cd70244f30e6da167258f0fcd122b/ynews/resizefill_w1200/https://media.zenfs.com/en/deadline.com/5ab2b9bfda4fdf3e1183bcdb3dd81a7a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T18:28:38+00:00",
  "addDate": "2025-08-15T18:51:59.127570+00:00",
  "refreshDate": "2025-08-15T18:51:59.127572+00:00",
  "score": 1.0,
  "title": "Oscar Nominee Cathy Moriarty Stars In Matthew Campanella’s ‘Sunday Sauce’; Plot Thickens With Sex, Guilt, Comedy And Touch Of Body Horror",
  "description": "Add fresh young talent, mix with veteran star Cathy Moriarty, season with comedy and some body horror and you have the recipe for Sunday Sauce, the new short from up-and-comer Matt Campanella. The emerging cineaste not only directed, but wrote and stars in the film, which screens Saturday at the prestigious Oscar-qualifying HollyShorts festival in …",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nAdd fresh young talent, mix with veteran star Cathy Moriarty, season with comedy and some body horror and you have the recipe for Sunday Sauce, the new short from up-and-comer Matt Campanella.\n\nThe emerging cineaste not only directed, but wrote and stars in the film, which screens Saturday at the prestigious Oscar-qualifying HollyShorts festival in Los Angeles. The action takes place in the Morris Park section of New York City where a colorful family prepares for Sunday dinner – Grandmother Nancy (Moriarty), her son Gino (Matthew Risch), Gino’s daughter Francesca (Nicole Ehinger) who is pregnant and unmarried, and a woman who sits in a chair, comatose. That would be Maria (Maria Carrozza), wife of Gino, daughter-in-law of Nancy, felled by an air conditioner 457 days previously.\n• None Alden Ehrenreich, Catherine Hardwicke, Tom Skerritt, Lexi Underwood To Be Honored At 20th HollyShorts Film Festival\n\nA lively dinner table is a place intimately familiar to Campanella as an Italian American.\n\n“Italians, we have this very staccato way of talking over each other. It can be very volatile,” Campanella tells Deadline. “One second, we’re fighting over where the fork should be placed on the table, the next second we’re hugging, crying, and nothing ever really phases us. At the end of the day, family is very strong and that bond, it’s very unique in the Italian culture. So, I kind of just built from that.”\n\nAs Gino prepares his signature Lobster Fra Diavolo and Francesca chops cucumbers for a salad – under the watchful eye of matriarch Nancy — there’s an unexpected ring of the doorbell. Unexpected for everyone but Nancy, who has secretly invited a genteel Italian émigré and her eligible grandson to dinner, in hopes of fixing up her unwed pregnant granddaughter with a suitable partner.\n\nIt’s a bravura role for Moriarty, the actress who burst onto the scene as a teenager in Martin Scorsese’s Raging Bull, playing the wife of Jake La Motta, a part that would earn her an Academy Award nomination. Here, as Nancy, she’s histrionic, a touch domineering but altogether charming. Text on screen notes she’s “Italian by marriage. Hobbies include: The Ten Commandments.”\n\n“She’s someone who I think has such a strong presence, has always had a strong presence as an actor. And of course, Raging Bull, her iconic scenes always inspired me in the films that I’ve made. Scorsese, De Niro, those types of films, as an Italian American I grew up watching,” Campanella says. “We didn’t know if we were going to be able to get her. We shared the script with her agents or team, and she resonated with the story and it kind of just went from there. For her character, it was super important to have someone like Cathy because she does, first of all, a lot of the talking in the short. It really had to feel like vocally, physically there’s this person who can deliver that energy. She did wonderful. She’s amazing.”\n\nThe plot, and the sauce, thicken in the short when Gino and the cute young dinner guest Marco (Campanella) lock eyes. It turns out they have “met” before, in a manner of speaking. The opening scene establishes that the “daddy” and the “twunk” as they label themselves in an online dating app, have expressed a certain attraction for each other, shall we say, without every realizing they would soon encounter one another face to face.\n\nCampanella describes the production as “a full family effort,” and with good reason. He and his older brother Anthony produced the film. His dad’s first cousin, who is an Italian teacher, consulted on the Italian dialogue in the script. Campanella’s aunt Maria Carrozza plays the comatose woman. And his real-life grandma, Vincenza Campanella, plays his on-screen nonna, although that wasn’t the original plan.\n\n“Our wonderful casting director, Joey Montenarello, we were working together to try to find this sort of grandmother figure who felt very fresh-off-the-boat Italian, someone who felt like they immigrated from Italy; Italian was their first language. It was quite difficult to find someone who actually fit all of those [criteria] and have this specific demeanor,” Campanella explains. “My brother who produced the film with me actually had the idea. He said, ‘Why don’t we go to ‘Nonni’ and just read the lines with her and see if she’ll do it? ‘And we did. And she was actually wonderful.”\n\nSome of the funniest moments in the film occur as Campanella’s grandmother, playing “Antonella,” voices growing displeasure with the character of her hosts – her candid remarks spoken in Italian, which eludes others around the table, except for her grandson. Her language is saltier than the salad dressing.\n\n“My grandmother, my real life ‘Nonni,’ she is very much a saint. She has not said any of these words in real life,” Campanella shares. “And she was laughing when we were reading them. She was like, ‘I haven’t said any of these words ever that she says in the film.’”\n\nThe director’s family made further contributions to Sunday Sauce. “My mother was cooking the crafty [craft services] and cooking the meals every day,” the director says. “It was about family, it was about food — why not have my real Italian mother who’s an incredible cook, who would cook it better in my opinion than just a random catering come in and do that? And that made it really special. Some of the crew people said it was the best crafty that they ever had.”\n\nCampanella is cooking up a feature length version of Sunday Sauce.\n\n“We have the script complete,” he says. “The great thing about making the short was that it really allowed me as a director and a filmmaker to understand the visual language and the world a little bit better. It was really important for me to make this into a short before feature because it’s such a unique concept and it weaves in black comedy, surrealism, a little bit of body horror and that heart that you feel for this character [Gino] who’s actually struggling with something. So I think it was really important for me, creatively, to make it for that reason, but also to show other people in the business this is possible, what the vision is.”\n• None Everything We Know About ‘Nobody Wants This’ Season 2 So Far\n• None Everything We Know About Prime Video's ‘Legally Blonde’ Prequel Series ‘Elle’\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "medium": "Article",
  "links": [
    "https://www.yahoo.com/entertainment/alden-ehrenreich-catherine-hardwicke-tom-221647914.html",
    "http://bit.ly/2TntOHq",
    "http://bit.ly/2TkcoeG",
    "https://www.yahoo.com/entertainment/hollyshorts-becomes-oscar-qualifying-festival-211541696.html",
    "http://bit.ly/31XsHSx",
    "https://www.yahoo.com/entertainment/articles/jaimie-alexander-chloe-fineman-cathy-180000392.html",
    "https://www.yahoo.com/entertainment/articles/everything-know-nobody-wants-season-003230845.html",
    "https://www.yahoo.com/entertainment/articles/everything-know-prime-video-legally-215807596.html",
    "https://www.yahoo.com/entertainment/articles/2021-22-awards-season-calendar-190021861.html",
    "https://cloud.email.deadline.com/signup/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vincenza Campanella",
      "weight": 0.06423358
    },
    {
      "name": "Campanella",
      "weight": 0.064230695
    },
    {
      "name": "Matt Campanella",
      "weight": 0.063323945
    },
    {
      "name": "Sunday dinner",
      "weight": 0.057639666
    },
    {
      "name": "Cathy Moriarty",
      "weight": 0.052654654
    },
    {
      "name": "Oscar Nominee Cathy Moriarty",
      "weight": 0.05255488
    },
    {
      "name": "veteran star Cathy Moriarty",
      "weight": 0.051777
    },
    {
      "name": "films",
      "weight": 0.04996797
    },
    {
      "name": "Sunday Sauce",
      "weight": 0.049790554
    },
    {
      "name": "real life",
      "weight": 0.0462921
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98388671875
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.9375
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.67431640625
    },
    {
      "name": "/Arts & Entertainment/Movies/Drama Films",
      "score": 0.5634765625
    },
    {
      "name": "/Arts & Entertainment/Entertainment Industry/Film & TV Industry",
      "score": 0.52392578125
    }
  ],
  "sentiment": {
    "positive": 0.17549466,
    "negative": 0.45447674,
    "neutral": 0.3700286
  },
  "summary": "Matthew Campanella's new short, 'Sunday Sauce', stars Cathy Moriarty, a veteran actor and director, Matthew Campanell, who directed and stars in the film, is set to screen at the prestigious Oscar-qualifying HollyShorts festival in Los Angeles. The film follows the story of a family preparing for Sunday dinner in New York City where a lively dinner table is a familiar scene familiar to an Italian American. The short stars Moriarty as Maria (Maria Carrozza), wife of Gino, daughter-in-law of Nancy, who was killed by an air conditioner 457 days prior. The plot thickens with sex, Guilt, Comedy, and a touch of body horror. Yahoo is using AI to generate takeaways from this article, which may not always match what's in the article but helps improve the user's experience.",
  "shortSummary": "Cathy Moriarty stars in Matthew Campanella’s short film “Sunday Sauce,\" a blend of Italian-American tension, comedy, and body horror, screening at the HollyShorts festival.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "98adf2b020264e878a0341363d7c3860",
  "places": [
    {
      "osmId": "7450676599",
      "road": "Esplanade",
      "suburb": "The Bronx",
      "city": "New York",
      "state": "New York",
      "postcode": "10469",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Morris Park",
      "coordinates": {
        "lat": 40.8545235,
        "lon": -73.8602968
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Matt Campanella’s Oscar‑qualifying short \"Sunday Sauce\" follows an Italian‑American family in New York’s Morris Park as they prepare a Sunday dinner, with Cathy Moriarty playing the domineering matriarch Nancy and Campanella himself starring as the grandson Marco. The film blends comedy, surreal body horror and black humor, drawing on Campanella’s own family for casting, dialogue, and cooking, and centers on a romantic encounter between Gino and Marco that sparks unexpected tension. Campanella explains that the short was a family‑produced project that allowed him to hone the visual language before expanding it into a feature‑length script. The article also notes other HollyShorts festival highlights and briefly mentions unrelated entertainment news about upcoming series and honorees.",
  "argos_id": "XO1KGTLM8"
}