{
  "url": "https://nypost.com/2025/08/15/us-news/nyc-construction-kingpin-who-funneled-illegal-donations-to-mayor-adams-2021-campaign-gets-wrist-slap-sentence/",
  "authorsByline": "Ben Kochman",
  "articleId": "93c7f3655aa94b2cbe418c63bac8f3d0",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/erdin-arkan-leaving-federal-court-109636073.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T21:37:30+00:00",
  "addDate": "2025-08-15T21:39:28.146134+00:00",
  "refreshDate": "2025-08-15T21:39:28.146135+00:00",
  "score": 1.0,
  "title": "NYC construction kingpin who funneled illegal donations to Mayor Adams’ 2021 campaign apologizes to taxpayers as he gets wrist-slap sentence",
  "description": "“I’m simply sorry to the New York taxpayers,” said Erden Arkan, 76, the owner of KSK Construction Group in Williamsburg, before the lax sentence was handed down in Manhattan feder…",
  "content": "A Brooklyn construction kingpin apologized to New York taxpayers Friday as he was handed a wrist-slap sentence for funneling illegal donations to Mayor Eric Adams’ 2021 campaign.\n\nErden Arkan, 76, the owner of KSK Construction Group in Williamsburg, had faced up to six months behind bars under federal sentencing guidelines, but prosecutors and a probation officer agreed no prison time was warranted.\n\n“I’m simply sorry to the New York taxpayers,” said a rueful Arkan before he was sentenced to one year of probation in Manhattan federal court.\n\nThe Turkey native pleaded guilty in January to a wire fraud charge for illegally reimbursing his employees for roughly $18,000 of donations they made toward Adams’ successful 2021 campaign for mayor.\n\nThe Adams campaign then used those funds to fraudulently hoover up public dollars under a city program that matches donations 8-to-1 with taxpayer cash, prosecutors alleged.\n\nThe feds said Adams had personally asked the wealthy magnate and a Turkish diplomat for campaign cash at an April 2021 dinner.\n\nArkan tried to convince other members of the city’s Turkish community to bundle donations to Adams at a fundraiser he held soon after the meeting at his business’s headquarters, court papers said.\n\n“Unfortunately, this is how things work in this country,” he allegedly wrote to his colleagues.\n\nAdams was charged in September 2024 with taking $123,000 in travel perk bribes and ripping off taxpayers with bogus campaign cash from Turks in exchange for help fast-tracking the opening of the Manhattan Turkish consulate building.\n\nBut the Justice Department under President Trump took the unusual move in February of pushing for the historic corruption case against Hizzoner to be dismissed, without commenting on the strength of the prosecution.\n\nThe judge overseeing both Adams and Arkan’s cases, Dale Ho, has suggested that the DOJ moved to toss the charges in exchange for the mayor’s help rolling out the White House’s immigration agenda.\n\nAdams pleaded not guilty and has also denied allegations that there was a crooked “quid pro quo” tied to the case dismissal.\n\nArkan’s lawyer, Jonathan Rosen, accused the government on Friday of being “unfair” and inconsistent in continuing to prosecute his client after Ho agreed to toss Adams’ case.\n\n“I’m commenting on the incoherence,” Rosen said.\n\nBut a visibly irked Ho shot back, “What impact does that have on the decision before me today?”\n\nThe judge added that Arkan — who said his company netted more than $1 billion in revenue since its founding in 2003 — had otherwise lived an “exemplary” life before his arrest, before wishing him good luck in the future.\n\n“I promise to do good. This will never happen again,” Arkan told the court.\n\nOn top of the one year of probation, Arkan was ordered to pay $18,000 in restitution and a $9,500 fine.\n\nA rep for Adams’ 2025 campaign did not respond to a request for comment.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/01/10/us-news/turkish-businessman-admits-to-illegally-steering-funds-to-mayor-eric-adams-2021-campaign/",
    "https://nypost.com/tag/eric-adams-indictment/",
    "https://nypost.com/2025/02/10/us-news/feds-move-to-toss-mayor-eric-adams-historic-bribery-case/",
    "https://nypost.com/2025/08/15/us-news/dramatic-video-shows-feds-re-arresting-subway-sandwich-slinger-after-he-pelted-officer-with-hero-in-dc/",
    "https://nypost.com/2025/02/13/us-news/prosecutors-were-prepping-to-charge-eric-adams-with-destroying-evidence-manhattan-us-attorneys-resignation-letter-reveals/",
    "https://nypost.com/2025/08/15/us-news/bryan-kohbergers-disturbing-porn-searches-revealed-report/",
    "https://nypost.com/2025/08/15/us-news/trump-admin-live-updates-putin-meeting-national-guard-in-dc-more-news/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Adams",
      "weight": 0.08390472
    },
    {
      "name": "Eric Adams",
      "weight": 0.083489224
    },
    {
      "name": "campaign cash",
      "weight": 0.07846402
    },
    {
      "name": "bogus campaign cash",
      "weight": 0.07718343
    },
    {
      "name": "taxpayer cash",
      "weight": 0.07680785
    },
    {
      "name": "Arkan",
      "weight": 0.076111935
    },
    {
      "name": "Erden Arkan",
      "weight": 0.07587164
    },
    {
      "name": "New York taxpayers",
      "weight": 0.07572639
    },
    {
      "name": "illegal donations",
      "weight": 0.072102904
    },
    {
      "name": "donations",
      "weight": 0.06450815
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9931640625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.96533203125
    },
    {
      "name": "/News/Local News",
      "score": 0.96240234375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.93701171875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.7119140625
    },
    {
      "name": "/News/Other",
      "score": 0.6484375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.3544921875
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.3251953125
    }
  ],
  "sentiment": {
    "positive": 0.065466546,
    "negative": 0.7226366,
    "neutral": 0.21189688
  },
  "summary": "Erden Arkan, the owner of KSK Construction Group in Williamsburg, was sentenced to one year probation for illegally reimbursing his employees for $18,000 of donations they made towards Mayor Eric Adams' 2021 campaign. Prosecutors and a probation officer agreed no prison time was needed. Arkan had pleaded guilty to a wire fraud charge in January and had been facing up to six months behind bars under federal sentencing guidelines. He also pleaded guilty in court to conspiring to bribe members of the city’s Turkish community to donate to Adams. The judge overseeing both Arkan and Adams' cases suggested that the Justice Department moved to dismiss the charges in exchange for Adams' help rolling out the White House's immigration agenda.",
  "shortSummary": "Brookbridge constructionist Erden Arkan received a wrist-slap sentence for funneling illegal donations to Mayor Eric Adams' 2021 campaign, including restitution and fines.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "19979854713a4e16af40b72036d706e1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/02/10/us-news/feds-move-to-toss-mayor-eric-adams-historic-bribery-case/",
      "text": "Trump’s DOJ to toss NYC Mayor Eric Adams’ historic bribery case, agrees with Dem that charges were politically motivated by Biden admin\nThe Justice Department ordered Manhattan prosecutors Monday to dismiss the historic bribery case against Mayor Eric Adams — siding with Hizzoner that the charges under the Biden administration were politically motivated and hampered his ability to combat the migrant crisis in New York City, The Post has confirmed.\nThe new DOJ under President Trump instructed the Southern District of New York to dismiss the case without prejudice, meaning charges could be refiled in the future, sources said.\n“You are directed, as authorized by the Attorney General, to dismiss the pending charges” against Adams, Acting Deputy Attorney General Emil Bove wrote in a letter obtained by The Post.\nThe letter notes “independent reasons” as to why Adams’ case was being tossed — including that the case was retribution for him speaking out against the Biden administration for its handling of the migrant crisis.\n“It cannot be ignored that Mayor Adams criticized the prior Administration’s immigration policies before the charges were filed, and the former US Attorney’s public actions created appearances of impropriety…”\nBove wrote that the charges have “improperly interfered with Mayor Adams’ campaign in the 2025 mayoral election” and also have “unduly restricted Mayor Adams’ ability to devote full attention and resources to the illegal immigration and violent crime that escalated under the policies of the prior Administration.”\nThe immigration crackdown is a focus for Trump out of the gate in his second term, and Adams has signaled a willingness to support harsh measures — including rolling back sanctuary city policies — that are anathema to many of his Democratic counterparts.\nBut Adams isn’t entirely in the clear, as Bove’s letter also notes that “the matter shall be reviewed by the confirmed US Attorney in the Southern District of New York, following the November 2025 mayoral election.”\n“There shall be no further targeting of Mayor Adams or additional investigative steps … and you are further directed to take all steps within your power to cause Mayor Adams’ security clearances to be restored,” he wrote.\nA motion outlining the legal reasons behind the dismissal is expected to be filed as soon as Tuesday.\nA rep for the SDNY declined to comment.\nAdams on Monday night offered a measured reaction to the news, telling a Fox News reporter while out to dinner with supermarket mogul John Catsimatidis that he had little information.\n“We were just notified of the possibility that the DOJ has communicated with the local US Attorney’s Office here,” he said, according to video posted on X. “I would like to speak to [my lawyer] first and get a better understanding of exactly what’s taking place now because right now I don’t have any information.”\nThe stunning turn of events appears to signal the end of the years-long criminal probe into Adams’ 2021 mayoral campaign that has hung over Hizzoner’s head during his scandal-plagued first term in office.\nAdams, 64, who was indicted in September, was accused of accepting thousands of dollars in free or upgraded luxury travel as bribes from foreign nationals in exchange for political favors, including helping fast-track the opening of the Turkish Consulate in Manhattan.\nThe Democratic mayor quickly denied the accusations and cast the prosecution as political retribution from the former Biden administration for speaking out on the migrant crisis.\nAs migrants flowed largely unimpeded across the US-Mexico border and reached New York City by the thousands, Adams bucked Biden as he begged for funding and a national decompression strategy.\nBut the calls went unheeded and put Adams, who once called himself the “Biden of Brooklyn,” forever out of the former president’s good graces.\nShortly after a stunning, 57-page indictment dropped, Adams vowed to fight.\n“Despite our pleas, when the federal government did nothing as its broken immigration policies overloaded our shelter system with no relief, I put the people of New York before party and politics,” he said at the time.\n“I always knew that if I stood my ground for New Yorkers that I would be a target — and a target I became.”\nThe claim of political persecution was ready-made to find a receptive audience with Trump, who made similar assertions about his myriad criminal cases.\nTrump contended after Adams’ indictment that he predicted the mayor would face federal charges for implicitly speaking out against Biden.\n“And I said, ‘You know what? He’ll be indicted within a year,’” Trump said.\nAdams’ defense team long expected a Trump administration to be more amenable to its case, either through a presidential pardon or a dismissal motion from the highest levels of the DOJ — despite the case starting under Trump’s first term in 2021.\nAnd the dismissal order comes after weeks of Adams trying to get in Trump’s good graces by going out of his way to not criticize the president and to publicly align himself with new immigration policies.\nAdams also hurried down to Trump’s inauguration on a middle-of-the-night invite hours before the ceremony and flew to have lunch with the then-president-elect at one of his golf clubs near Mar-a-Lago.\nIn addition, his celebrity attorney Alex Spiro had been working through legal back channels to find some way out of the case with either a pardon or dismissal.\nOn Jan. 31, the mayor’s defense team met with some of the highest members of the DOJ in Washington, DC.\n“As I said from the outset, the mayor is innocent — and he would prevail. Today he has,” Spiro said in a statement.\n“The facts of the case are clear: The mayor never used his official position for personal benefit. Nor did he have any role in violating campaign finance laws. Despite a lot of fanfare and sensational claims, ultimately there was no evidence presented that he broke any laws, ever. The witnesses that were promised never materialized. The additional charges that were threatened never came. Now, thankfully, the mayor and New York can put this unfortunate and misguided prosecution behind them.”\nIn a footnote, Bove’s letter contended there wasn’t a quid pro quo between Adams and the Trump administration.\n“(The) Government is not offering to exchange dismissal of a criminal case for Adams’s assistance on immigration enforcement,” it states.\nUnencumbered by the looming potential prison time, Adams can now pivot to what still is expected to be a bruising primary, with a slate of Dems looking to dethrone a seemingly vulnerable incumbent mayor.\nThe bribery case, though, was just one of the issues that dragged down Adams’ poll numbers to record lows — including crime, the migrant crisis and a cast of cronies brought into the admin by the mayor who have also found themselves in similar legal troubles.\nNews of the investigation burst onto the scene in November 2023 when Adams’ top fundraiser, Brianna Suggs, was raided by the feds, forcing the mayor to abruptly return from Washington, DC, just moments after landing.\nAgents also raided Brooklyn-based KSK Construction and the homes of Rana Abbsova, a longtime Adams staffer, and Cenk Öcal, a former Turkish Airlines executive and member of the mayoral transition team.\nDays later, the feds stopped Adams on the street and ordered him to hand over all his electronic devices, including a phone that he “forgot” the password for and feds have been unable to access.\nOn Sept. 26, then-US Attorney Damian Williams’ Southern District of New York office unveiled the indictment against the mayor.\nFor months, the mayor’s high-profile attorney Spiro has tried to convince the Biden DOJ and the judge hearing the case to dismiss it — to no avail.\nAfter Trump’s election, Williams resigned from his post and argued in a City & State op-ed that the city was “being led with a broken ethical compass” — a remark that Spiro seized upon and argued showed that the former prosecutor went after Adams to further his political career.\nThe argument featured in the dismissal letter, which contended they “created appearances of impropriety.”\nJudge Dale Ho, who has heard the case in Manhattan federal court, will still have to sign off on the dismissal, but that appears to be just a formality, with prosecutors saying they have no intention of continuing the case.\nThe dismissal could also threaten the Southern District’s reputation for independence from the political winds blowing in Washington, DC — a distinction that has earned it the nickname the “Sovereign District.”\nActing Manhattan US Attorney Danielle Sassoon, a veteran prosecutor who helped convict scruffy crypto fraudster Sam Bankman-Fried, had shot down Adams’ claims that he was indicted for “any reason other than his crimes.”\n“That claim disintegrated when discovery made clear that the investigation into Adams began more than a year earlier, based on concrete evidence that Adams had accepted illegal campaign contributions,” she wrote in a recent filing hinting at further charges against the mayor.\nSassoon, however, is likely to soon be replaced by Trump’s pick Jay Clayton, a former head of the Securities and Exchange Commission."
    },
    {
      "url": "https://nypost.com/2025/02/13/us-news/prosecutors-were-prepping-to-charge-eric-adams-with-destroying-evidence-manhattan-us-attorneys-resignation-letter-reveals/",
      "text": "Prosecutors were prepping to charge Eric Adams with destroying evidence, Manhattan US attorney’s resignation letter reveals\nManhattan federal prosecutors were prepared to bring a new bombshell indictment charging Mayor Eric Adams with destroying evidence and telling people to lie to the FBI, a letter obtained by The Post reveals.\nThe letter sent by Danielle Sassoon, who resigned from her post Thursday rather than obey an order from President Trump’s Justice Department to kill the case, also blasts the “rushed and superficial” reasoning that she says was behind Washington DC’s demand.\n“Because the law does not support a dismissal, and because I am confident that Adams has committed the crimes with which he is charged, I cannot agree to seek a dismissal driven by improper considerations,” wrote Sassoon, a Republican.\nThe former clerk for conservative Supreme Court Justice Antonin Scalia also explicitly accused Adams of offering to help Trump’s immigration agenda in exchange for the case being dropped.\n“Rather than be rewarded, Adams’s advocacy should be called out for what it is: an improper offer of immigration enforcement assistance in exchange for a dismissal of his case,” she wrote.\nThe Manhattan feds’ proposed new expanded indictment “would add an obstruction conspiracy count based on evidence that Adams destroyed and instructed others to destroy evidence and provide false information to the FBI,” reads the stunning letter, sent by Sassoon Wednesday to US Attorney General Pam Bondi.\nThe new charges would also expand on allegations that Adams asked for illegal donations from Turkish nationals as part of a “fraudulent straw donor scheme,” the letter reveals.\nSassoon says in the letter that she could no longer “credibly represent the government before the courts” if she caved to Justice Department officials’ demand for her to move to drop Adams’ case.\nActing US Deputy Attorney General Emil Bove, formerly one of Trump’s criminal attorneys in his hush money case, fired back with his own letter Thursday accepting Sassoon’s resignation — and accusing her of pressing on with a “politically motivated prosecution” in spite of main Justice’s orders.\nThe Manhattan federal prosecutors’ office has a centuries-old reputation for independence from officials in Washington, DC. It’s often referred to as the “Sovereign District.”\nBut those days of independence are over, declared Bove, himself a former alum of the office’s terrorism division.\n“No US Attorney’s Office is a separate sovereign,” Bove told The Post in a statement. “I concluded earlier this week that the prosecution of Mayor Adams must be dismissed in order to prioritize national security and public safety over continuing with a case that has been tainted from the start by troubling tactics,” Bove added.\n“There is no room at the Justice Department for attorneys who refuse to execute on the priorities of the Executive Branch — priorities determined by the American people. I look forward to working with new leadership at SDNY on the important priorities President Trump has laid out for us to make America safe again.”\nAdams, 64, has pleaded not guilty to charges that he took $123,000 worth of travel-perk bribes from Turks in exchange for fast-tracking the opening of the Turkish Consulate in Manhattan. He is also charged with soliciting illegal donations from Turks who poured tens of thousands in illegal funds into his 2021 mayoral campaign."
    },
    {
      "url": "https://nypost.com/tag/eric-adams-indictment/",
      "text": "eric adams indictment\nNYC construction kingpin who funneled illegal donations to Adams' 2021 campaign apologizes as he gets wrist-slap sentence\nAugust 15, 2025 | 5:37pm\"I'm simply sorry to the New York taxpayers,\" said Erden Arkan, 76, the owner of KSK Construction Group in Williamsburg, before the lax sentence was handed down in Manhattan federal...\nEx-Eric Adams aide pleads guilty to 2021 campaign funding scam\nAugust 12, 2025 | 5:09pmMohamed Bahi admitted that \"it was wrong\" for him to falsely claim he collected $32,000 in donations from real-estate firms at a Brooklyn fundraiser in 2020 to try to boost...\nEric Adams praises Trump for securing US border, tells all on Biden meetings about migrant crisis to 'Pod Force One'\nJuly 23, 2025 | 6:00amMayor Eric Adams praised President Trump for solving the border crisis that spiraled \"out of control\" under predecessor Joe Biden and left the city scrambling to shelter and care for...\nEric Adams' indicted ex-top aide returns to inner circle — as mayor fails to shed problematic cronies during tough re-election fight\nJuly 3, 2025 | 6:10pmHizzoner is refusing to shake scandal-scarred cronies who plagued his first administration — while telling skittish backers that they have been taken off his re-election campaign, The Post has learned.\nAdams sues NYC Finance Board over denial of $3.4 million in matching funds\nMay 28, 2025 | 12:51am“The CFB’s failure to cite any evidence to support its determination other than the indictment establishes that the CFB has no other such evidence.”\nEric Adams' unsealed documents shed new light on how NYC mayor wanted Turkey to fund reelection campaign with missed detail from original indictment\nMay 9, 2025 | 6:52pmAdams \"welcomed the offer of foreign contributions,\" the filing states.\nCache of sealed documents in Adams’ criminal case revealed — giving inside look at prosecution that will never be\nMay 9, 2025 | 4:50pmManhattan Federal Judge Dale Ho ordered that documents be made public last month.\nAdams' top fundraiser — who was raided by feds — now back to soliciting donations for mayor's reelection campaign\nMay 7, 2025 | 4:29pmSource said that Brianna Suggs has been calling around to polticos in the Big Apple to set up donor events for Adams as he starts to get his reelection campaign...\nTrump's DOJ seeking week extension after defying court order to make Mayor Adams corruption case documents public\nMay 3, 2025 | 5:30pmThe US Department of Justice will ask a federal judge Saturday for a week-long extension to unseal documents in Mayor Eric Adams dismissed corruption case – after missing the deadline...\nTrump DOJ ignores court order to make Adams corruption case documents public\nMay 3, 2025 | 12:04amThe court filings were expected to unveil unredacted warrants, including one for Hizzoner's cellphone seized by agents on a NYC street, and more than 100 pages of affidavits describing evidence...\nAdams still denied $4M in matching campaign funds despite dismissed corruption case – and he's weighing 'every legal avenue'\nMay 1, 2025 | 5:36pmThey're dismissing the dismissal.\nThree prosecutors resign over Mayor Eric Adams’ corruption case, defy DOJ 'order' to admit wrongdoing\nApril 22, 2025 | 1:35pmCelia Cohen, Andrew Rohrbach and Derek Wikstrom, who had been placed on \"administrative leave,\" blasted DOJ Deputy Attorney General Todd Blanche.\nMayor Adams is $3M in the hole for criminal defense as donations dry up\nApril 16, 2025 | 10:49amHizzoner has an unpaid tab of more than $3 million for mounting a legal defense against the federal charges, with his celebrity attorney Alex Spiro billing him nearly $2.3 million,...\nNYC's screwy Campaign Finance Board stiffs Adams, Cuomo while giving socialist Zohran Mamdani millions\nApril 15, 2025 | 8:25pmIt’s getting hard to tell which is more pathetic: this year’s crop of mayoral candidates, or the city’s system for electing one of them.\nEric Adams' 'Independent' makeover: Letters to the Editor — April 5, 2025\nApril 4, 2025 | 4:52pmNY Post readers discuss Mayor Adams announcing he will run for reelection as an independent.\nJudge was right to drop charges against Eric Adams — freeing him to do his job AND run for reelection\nApril 2, 2025 | 6:52pmJudge Dale Ho made the logical decision in permanently dropping corruption charges against Mayor Eric Adams.\nNYC political insiders mull Adams' future with criminal case tossed: 'Lazarus'-like resurrection or 'dead man walking'?\nApril 2, 2025 | 6:43pmHe's back from the dead -- or is he? Mayor Eric Adams could see a \"Lazarus\"-like political resurrection now that he's free from his criminal case, especially if the tarnished...\nAdams responds to 'baseless' criminal charges getting tossed -- and is confident he'll win re-election\nApril 2, 2025 | 12:57pmFreshly unburdened Mayor Eric Adams vowed Wednesday that he’ll win re-election after a federal judge killed his corruption case for good. Adams, in a five-minute address outside Gracie Mansion, told New...\nAdams’ historic corruption case dismissed — clearing the way for second term campaign\nApril 2, 2025 | 9:37amThe long-awaited ruling is expected to be welcome news to the embattled Adams — at least personally.\nMayor Adams urges judge to speed up ruling on dismissal of criminal case due to upcoming campaign deadline\nMarch 31, 2025 | 3:41pmNew York City mayor and alleged Turkish bribe recipient Eric Adams wants the judge weighing whether to toss his corruption case to rule by Thursday — the petition-filing deadline for..."
    },
    {
      "url": "https://nypost.com/2025/08/15/us-news/dramatic-video-shows-feds-re-arresting-subway-sandwich-slinger-after-he-pelted-officer-with-hero-in-dc/",
      "text": "Dramatic video shows feds re-arresting Subway sandwich slinger after he pelted officer with hero in DC\nWASHINGTON — The Justice Department worker accused of throwing a Subway sandwich at a federal agent was re-arrested by an armed team of at least a half-dozen US Marshals in a dramatic Wednesday night raid, new video shows.\nSean Charles Dunn, 37, was cuffed a second time inside his apartment about a mile northwest of the White House — after being slapped with a felony assault charge.\nFootage of the raid was posted by the White House on X Thursday evening with the caption: “Nighttime Routine: Operation Make D.C. Safe Again Edition.”\nIn a stunning twist, Attorney General Pam Bondi had revealed hours earlier that Dunn was a DOJ Criminal Division employee.\nIn the same statement, Bondi announced Dunn was fired from his post as an international affairs specialist working to help extradite criminal suspects to and from the US.\n“This is an example of the Deep State we have been up against for seven months as we work to refocus DOJ,” the AG said. “You will NOT work in this administration while disrespecting our government and law enforcement.”\n“He thought it was funny,” DC US Attorney Jeanine Pirro said Wednesday in announcing the federal case. Well he doesn’t think it’s funny today because we charged him with a felony: Assault on a police officer … So there, stick your Subway sandwich somewhere else!”\nDunn made an initial court appearance Thursday and was released on his own recognizance. A preliminary hearing was set for Sept. 4.\nThe suspect initially was arrested Sunday night after allegedly berating a group of Customs and Border Protection officers as “fascists” before pelting one with his late-night snack — in what observers said appeared to be an alcohol-fueled rage.\nTrump announced a surge of federal officials to help DC police fight violent crime Aug. 7 and escalated the effort Monday by asserting federal control over the Metropolitan Police Department and mobilizing the National Guard.\nDunn wielded his deli weapon at the intersection of DC’s 14th and U Streets — across from a McDonald’s where a 16-year-old girl was stabbed to death in 2023 in a dispute over sweet and sour sauce.\nJust a couple blocks north of the site, a crowd of hecklers appeared to prompt federal agents to discontinue a vehicle checkpoint on Wednesday night."
    },
    {
      "url": "https://nypost.com/2025/08/15/us-news/bryan-kohbergers-disturbing-porn-searches-revealed-report/",
      "text": "Bryan Kohberger’s disturbing porn searches ahead of gruesome Idaho student murders revealed: report\nTwisted murderer Bryan Kohberger made disturbing internet searches for women being raped and sexually assaulted while asleep, according to digital forensics experts who were due to testify at his trial.\nKohberger’s search history included terms like “raped,” “forced,” “sleeping,” “passed out” and “voyeur,” according to Heather and Jared Barnhart, who were hired in 2023 to help investigate the psychopath who broke into an off-campus university house in the middle of the night and slaughtered four students.\n“The easiest way to say it is that all of his terms were consistently around nonconsensual sex acts,” Jared Barnhart told The Daily Mail.\nAlthough Kohberger did not sexually assault any of the victims, the father of one of those killed, Kayla Goncalves, believes the killings were motivated by Kohberger’s “weird sexual fetishes.” Others have speculated that his sick plans were forced to change when he was unexpectedly confronted.\nKohberger cowardly refused to reveal his plans or motives when he unexpectedly admitted the slayings.\nThe Barnharts’ forensics company, Cellebrite, was tasked with going through Kohberger’s phone and laptop for any evidence connecting him to the murder of the four roommates knifed in their beds at their off-campus home in 2022.\nKohberger had tried to wipe the search history from his devices — even running a data-erasing software on his laptop three days after the killings — but he was not thorough enough, the experts said.\nWhile there was no record of the search history, the terms were still found his autofill data on his search engines, Heather said.\n“He did his best to leave zero digital footprint. He did not want a digital forensic trail available at all,” she told the Mail.\nThe Cellebrite team also discovered a PDF file about another serial killer and rapist, Danny Rolling — also known as the “Gainesville Ripper” — whose horrific murders targeting University of Florida students decades ago is eerily similar to Kohberger’s heinous crimes.\nHere’s the latest coverage on Bryan Kohberger:\n- Newly released crime scene photos show inside Idaho house where Bryan Kohberger killed four college students\n- Cops investigated Kohberger for eerily similar break-in a year before University of Idaho killings\n- Secret documents in Bryan Kohberger case, including pics of Idaho murder victims, could be made public\n- Newly released photo shows Bryan Kohberger just moments after arrest for Idaho murders\n- Bryan Kohberger may have used second weapon and left ‘scared’ while sparing surviving roommate: report\nRolling, who was the inspiration for the slasher classic “Scream,” murdered five UF students — four women and one man — after breaking into their homes during a four-day spree in 1990.\nHe raped all his female victims, and killed two of them with a Ka-Bar knife — the same weapon Kohberger used, prosecutors said. Rolling was executed in 2006.\nKohberger’s cell phone additionally contained creepy selfies of the killer posing shirtless and flexing his muscles, the experts said.\nHe also snapped the chilling selfie of himself giving the thumbs-up just hours after he murdered the four University of Idaho students.\nHeather, Senior Director of Forensic Research at Cellebrite, and Jared Barnhart, Head of CX Strategy and Advocacy at the company, were prepared to testify as expert witnesses at Kohberger’s trial before he pleaded guilty last month.\nKohberger was sentenced to four life sentences for killing roommates Kaylee Goncalves, Madison Mogen, Xana Kernodle and Ethan Chapin."
    },
    {
      "url": "https://nypost.com/2025/01/10/us-news/turkish-businessman-admits-to-illegally-steering-funds-to-mayor-eric-adams-2021-campaign/",
      "text": "Turkish businessman admits to illegally steering funds to Mayor Eric Adams’ 2021 campaign\nA Brooklyn businessman admitted Friday to funneling illegal campaign contributions to Eric Adams’ 2021 campaign — in the first guilty plea connected to the federal bribery case against the mayor.\nErden Arkan, the Turkish-born owner of KSK Construction Group in Williamsburg, copped to one count of conspiracy to commit wire fraud in Manhattan federal court, telling the judge he knowingly broke the law by helping to coordinate the “straw donor” scheme.\n“When I wrote the checks, I knew that the Eric Adams campaign would use the checks to apply for public matching funds,” Arkan said in English, while listening to a Turkish translation of the hearing on headphones.\nArkan reimbursed employees of his construction firm for their campaign donations at the request of a Turkish diplomatic official allegedly at the center of the case against Adams.\nStraw donor schemes are illegal because they’re used to skirt campaign contribution limits or shield who’s actually funding a candidate.\n“When you did these things, did you know that what you were doing was illegal?” Judge Dale Ho asked.\n“Yes,” Arkan, who wore a gray suit, softly replied.\nThe federal charge could come with a sentence of up to five years in prison and $250,000 fine, but prosecutors recommended that the judge only jail Arkan for up to six months, if at all, and fine him up $9,500 as part of the plea deal, court papers show.\nThe feds allege that Adams personally sought the donations from Arkan and the Turkish official at an April 2021 dinner, according to the indictment against the mayor.\nThe diplomat allegedly arranged free or heavily discounted luxury travel for Adams, the then-Brooklyn borough president, in exchange for political favors, including fast-tracking the opening of the Turkish Consulate.\nAdams has repeatedly denied any wrongdoing since the indictment dropped in September.\nIt was unclear if Arkan, who agreed to the plea deal last month, will testify against Adams.\nProsecutors requested the judge schedule Arkan’s sentencing after the mayor’s trial, which is set for April.\nArkan was released on $100,000 bail and ordered to return for sentencing on Aug. 11. He agreed to pay $18,000 in restitution.\nHis lawyer, Jonathan Rosen, declined to comment on his way out of court.\nAdams’ defense team was unfazed by the deal, saying the government hasn’t turned over any evidence in discovery connected to Arkan that would incriminate the mayor\nThe deal comes just days after the feds signaled more charges could be coming down the pike soon — telling the judge they had unearthed “additional criminal conduct” by Adams and his associates.\nKSK Construction in Williamsburg was one of the locations raided by the feds in November 2023 when news of the Southern District of New York’s probe first began public."
    }
  ],
  "argos_summary": "Brooklyn construction magnate Erden Arkan pleaded guilty to funneling illegal donations to Mayor Eric Adams’ 2021 campaign and received a one‑year probation sentence, restitution, and a fine, after prosecutors and a probation officer agreed no prison time was warranted. Arkan’s scheme involved reimbursing employees for donations that were used to obtain public matching funds, a practice tied to a broader federal investigation that also targeted Adams for alleged bribes and campaign finance violations. The DOJ, under the Trump administration, dismissed the historic bribery case against Adams, citing political motivations, but prosecutors remain poised to pursue additional charges. The case underscores the intersection of campaign finance fraud, political influence, and federal prosecutorial discretion in New York City politics.",
  "argos_id": "Y1NQMJN1R"
}