{
  "url": "https://www.macrumors.com/2025/08/22/apple-pay-supporting-national-park-foundation/",
  "authorsByline": "Joe Rossignol",
  "articleId": "296d4c23eaf647c2ab4eb74a77950b4c",
  "source": {
    "domain": "macrumors.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://images.macrumors.com/t/RQPLZ_3_iMyj3evjsWnMLVwPdyA=/1600x/article-new/2023/11/apple-pay-feature-dynamic-island.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T05:31:26-07:00",
  "addDate": "2025-08-22T12:39:40.931390+00:00",
  "refreshDate": "2025-08-22T12:39:40.931393+00:00",
  "score": 1.0,
  "title": "Apple Pay Supporting U.S. National Parks — Here's How You Can Help",
  "description": "Now through August 29, Apple will donate $10 to the National Park Foundation for every purchase made in the U.S. using Apple Pay on Apple, in...",
  "content": "Now through August 29, Apple will donate $10 to the National Park Foundation for every purchase made in the U.S. using Apple Pay on Apple.com, in the Apple Store app, or at an Apple Store, up to a maximum of $1 million.\n\n\n\nApple has supported the National Park Foundation with this annual charitable initiative since 2017.\n\nThe non-profit organization \"generates private support and builds strategic partnerships to protect and enhance America's national parks for present and future generations.\"\n\nApple celebrates U.S. national parks every August with special content across Apple Maps, Apple Podcasts, and other apps. In addition, on August 24, Apple Watch users can unlock a special national parks award in the Fitness app by recording a workout of 20 minutes or more with any app that adds workouts to the Health app.\n\nApple CEO Tim Cook is a national parks enthusiast. In 2022, he said the parks provide a \"sense of awe, tranquility, and quiet reverence only nature can inspire,\" and he emphasized that they are \"well worth protecting, today and for every generation to come.\"",
  "medium": "Article",
  "links": [
    "https://www.nationalparks.org/",
    "https://www.macrumors.com/2025/08/19/national-parks-activity-challenge-2025/",
    "https://www.macrumors.com/roundup/apple-pay/",
    "https://forums.macrumors.com/forums/apple-music-apple-pay-card-icloud-fitness.134",
    "https://www.apple.com/newsroom/2022/08/apple-celebrates-americas-parks/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. National Parks",
      "weight": 0.144924
    },
    {
      "name": "U.S. national parks",
      "weight": 0.144924
    },
    {
      "name": "Apple Pay",
      "weight": 0.12919068
    },
    {
      "name": "Apple Store",
      "weight": 0.12855579
    },
    {
      "name": "Apple Watch",
      "weight": 0.12807553
    },
    {
      "name": "Apple Maps",
      "weight": 0.12697811
    },
    {
      "name": "Apple Podcasts",
      "weight": 0.12692435
    },
    {
      "name": "Apple Watch users",
      "weight": 0.12569895
    },
    {
      "name": "Apple",
      "weight": 0.1254746
    },
    {
      "name": "Apple CEO Tim Cook",
      "weight": 0.12076875
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.84228515625
    },
    {
      "name": "/News/Technology News",
      "score": 0.8076171875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.40478515625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.345947265625
    }
  ],
  "sentiment": {
    "positive": 0.5740237,
    "negative": 0.046569787,
    "neutral": 0.3794065
  },
  "summary": "Apple will donate $10 to the National Park Foundation for every purchase made using Apple Pay on Apple. The charity has been supporting the foundation since 2017. The company celebrates U.S. national parks every August with special content on its website and an award-winning athlete.",
  "shortSummary": "Apple will donate $10 to the National Park Foundation every time a customer buys, up to $1 million, through Apple Pay, to support their efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "21fe98e24e9840bfa058254e836d057d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.macrumors.com/roundup/apple-pay/",
      "text": "Apple Pay\nAvailable in dozens of countries around the world in participating retail stores, apps, and websites.\nApple Pay Overview\nContents\nApple Pay is Apple's mobile payments service that initially launched in 2014. It is designed to allow iPhone, iPad, Mac, and Apple Watch users across the world to make payments for goods and services directly with credit and debit cards stored in their devices.\nApple Pay also lets users make one-tap purchases within apps that have adopted the Apple Pay API and on the web, with this functionality available to iPhones, iPads, and Macs with Touch ID or Face ID and NFC. Apple devices use a \"Secure Element\" for Apple Pay, keeping customer information secure and private.\nApple offers person-to-person Apple Pay payments through the Messages app on the iPhone and Apple Watch, plus there are also in-person payment options with iOS 18. Using Apple Cash, you can send money to friends or family in the United States. Apple also introduced its own credit card, the Apple Card, which has unique perks and benefits and offers deep integration with Apple Pay and the Wallet app.\nTo keep transactions secure, Apple uses a method known as \"tokenization,\" preventing actual credit card numbers from being sent over the air. Apple also secures payments using Touch ID or Face ID on compatible iPhones and continual skin contact on the Apple Watch.\nApple is aiming to replace the wallet with Apple Pay, and the one-step payment process prevents people from needing to dig through a purse or wallet to find credit or debit cards. Because it is built on existing NFC technology, Apple Pay works anywhere NFC-based contactless payments are accepted, plus it is available on the web for online purchases.\nApple Pay is the most popular mobile payment platform in the United States, and it is on track to account for 10 percent of global card transactions by 2025. Since 2014, Apple has expanded Apple Pay has expanded to over 75 countries and regions.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nSetting Up Apple Pay\nApple Pay can be set up in the Wallet app. Tapping the \"+\" icon in Wallet lets users to add a credit or debit card to Apple Pay, either selecting a card already on file with iTunes or scanning one in with the camera. Apple Pay can also be set up by using the prompts when setting up a new iPhone, iPad, or Mac.\nCredit and debit cards are verified in just a few seconds, but some cards require a phone call, app download, or an email to verify a card before it can be added to Apple Pay. Once a card is verified, it is immediately available for purchases both in stores and within apps. Up to eight cards can be registered with Apple Pay at one time.\nApple Pay can be managed in the Settings app, located in the \"Wallet and Apple Pay\" section. Each card added to Wallet is listed in that section, along with information like billing address, email, and phone number. Tapping on a card offers specific information like last digits of the card number, last digits of the Device Account Number that replaces the card number in transactions, and it also provides contact information for the bank that issued the card.\nSome cards are also able to display transaction information, offering a list of recent transactions that have been made, with Apple Pay or with a traditional purchase via physical card.\nApple Pay How Tos\nHow It Works\nIn a retail store, when approaching a point-of-sale system compatible with Apple Pay, the screen of the iPhone lights up and opens Wallet automatically, where a user can tap on a credit card to be used or pay with the default Apple Pay card.\nA payment is made by holding a compatible iPhone or Apple Watch near a checkout system that includes NFC, most of which look like standard card checkout terminals within stores. A completed payment is denoted by a slight vibration, a check mark on the screen, and a beep. On devices with Face ID, a facial scan is used for authentication, and on devices with Touch ID, a fingerprint scan is required.\nIn some stores and in some countries, users may still be asked for a PIN code due to older point-of-sale machines, transaction limitations, and laws in certain countries, but for the most part, checking out with Apple Pay is an easy one-step process that does not require a signature or PIN.\nWith Apple Pay, a cashier does not see a credit card number, a name, an address, or any other personally identifying information, making it more secure than traditional payment methods. There is no need to take out a credit card or confirm the authenticity of a credit card with a driver's license or ID card, because all of that information is stored on the iPhone and protected by several built-in security systems, including Touch ID and Face ID.\nMaking a payment online via Apple Pay is just as simple as an in store payment because it uses the same credit card and authenticates with Touch ID or Face ID in participating apps that have adopted the Apple Pay API. Using Apple Pay in an app or on a website bypasses all of the steps that are usually required when making an online purchase, including entering shipping and payment information.\nAfter an item is added to an online cart and a user initiates the checkout process, Apple Pay can be selected as the payment method. The shipping/billing address associated with the credit or debit card on file is automatically entered, as is a user's name, and the purchase is confirmed via Touch ID or Face ID. During this process, information like shipping address can be altered, which is useful when ordering a gift. Online payments using Apple Pay for the web follow the same process.\nOnline and retail store payments are both limited to participating merchants. Apple Pay is only available within apps and on websites that have adopted the Apple Pay API and to make a payment in a retail location, the shop needs to support Apple Pay directly or allow NFC payments. As of iOS 18, Apple Pay can be used with third-party browsers, even on PCs.\nIn More Detail\nCompatible Devices\nApple Pay in stores is available for the iPhone 6 and later, including all modern iPhone models. All of Apple's iPhones after the iPhone 6 include near-field communication (NFC) chips. Apple Pay also works with Apple Watch, the company's wrist-worn wearable device, plus it can be used with Macs and iPads that support Touch ID or Face ID. On non-compatible Macs, a connected iPhone can be used for authentication.\nSecurity\nApple puts a heavy emphasis on security when advertising Apple Pay, to assure iPhone owners that their payment information is safe, and, in fact, safer on an iPhone than inside of a wallet. According to former credit card executive Tom Noyes, the way Apple Pay has been designed to work makes it \"the most secure payments scheme on the planet.\"\nWhen a credit or debit card is scanned into Wallet for use with Apple Pay, it is assigned a unique Device Account Number, or \"token,\" which is stored in the phone rather than an actual card number.\nThe iPhone itself has a special dedicated chip called a Secure Element that contains all of a user's payment information, and credit card numbers and data are never uploaded to iCloud or Apple's servers. When a transaction is made, the Device Account Number is sent via NFC, along with a dynamic security code unique to each transaction, both of which are used to verify a successful payment. The dynamic security code is a one-time use cryptogram that replaces the credit card's CCV and is used to ensure that a transaction is being conducted from the device containing the Device Account Number.\nDynamic security codes and Device Account Numbers (aka, tokens and cryptograms) are not unique to Apple and are built into the NFC specification that the company is adopting. In fact, much of the Apple Pay system is built on existing technology.\nAlong with Device Account Numbers and dynamic security codes, Apple also authenticates each transaction through Touch ID or Face ID. Whenever a transaction is conducted with an iPhone, a user must place a finger on Touch ID or complete a facial scan for the payment to go through.\nWith the Apple Watch, authentication is done through skin contact. When the watch is placed on the wrist, a user is prompted to enter their passcode. After a passcode is entered, as long as the device continues to have contact with the skin (which is monitored through the heart rate sensor), it's be able to be used to make payments. If the watch is removed and skin contact is lost, it can no longer be used to make payments.\nBoth Touch ID, Face ID, and the skin contact authentication method in the Apple Watch prevent someone who has stolen an iPhone or Apple Watch from making an unauthorized payment.\nBecause Apple utilizes Device Account Numbers, a user's credit card number is never shared with merchants or transmitted with payments. Store clerks and employees do not see a user's credit card at any point, and they also do not have access to personal information like a name or address because an ID is not required for verification purposes.\nFurthermore, if an iPhone is lost, the owner can utilize the Find My app to suspend all payments from the device, without needing to go through the hassle of canceling credit cards.\nBanks are confident in Apple Pay's security, and have opted to assume liability for any fraudulent purchases made both in retail stores and online using the system.\nPrivacy\nApple has been careful to point out the company does not store or monitor the transactions that people make with Apple Pay. Apple says it does not know what people are purchasing, nor does it save transaction information.\n\"We are not in the business of collecting your data,\" said Eddy Cue during the keynote speech introducing Apple Pay. \"Apple doesn't know what you bought, where you bought it, or how much you paid. The transaction is between you, the merchant, and the bank.\"\nU.S. Partners\nCompatible Credit Cards and Banks\nApple has partnered with the major credit and debit card companies in the United States: Visa, MasterCard, Discover, and American Express. Apple has also signed deals with all major banks, including Bank of America, HSBC, Capital One, Chase, Citi, American Express, and Wells Fargo, plus it has established deals with hundreds of smaller banks across the country.\nApple Pay is compatible with a number of in-store credit cards from companies that include Kohl's, JC Penney, and BJ's, and some cards also let customers earn rewards.\nA current list of partners can be found on Apple's participating banks support document.\nRetail Partners:\nBecause Apple Pay is based on already existing NFC technology, the service works in hundreds of thousands of locations that accept contactless payments in the countries where Apple Pay is accepted. Apple Pay is accepted in more than a million retail stores, restaurants, gas stations, grocery stores, and more across the United States.\nSome of Apple's partners include Best Buy, B&H Photo, Bloomingdales, Chevron, Disney, Dunkin Donuts, GameStop, Jamba Juice, Kohl's, Lucky, McDonald's, Office Depot, Petco, Sprouts, Staples, KFC, Trader Joe's, Walgreens, Safeway, Costco, Whole Foods, CVS, Target, Publix, Taco Bell, and 7-11.\nTransit systems in Philadelphia, Portland, Chicago, New York, Boston, San Diego, Los Angeles, Hong Kong, Toronto, Montreal, Toronto, Washington, D.C., San Francisco, and 275 cities in China have added support for Apple Pay, with a list of states, countries, and regions that support Apple Pay for transit available here.\nApple Pay can be used to pay for transit on iPhone and Apple Watch, and in many of the above listed areas, Express Transit Mode is available. With Express Transit Mode, the iPhone and Apple Watch can be used to quickly pay for rides without having to unlock the device, open an app, or validate with Face ID/Touch ID.\nApple Pay is also available in many places outside of traditional retail stores, including universities, ballparks, non-profit organizations, Bitcoin payment providers, and even ATMs from Bank of America, Chase, and Wells Fargo.\nA full list of locations where Apple Pay is accepted in the United States can be found on Apple's Apple Pay website.\nApps:\nApple Pay support can be built into any app, and thousands of apps, representing businesses both big and small, accept Apple Pay as a payment method in their apps. When used in an app, Apple Pay payments can be made on iPhones and iPads equipped with Touch ID or Face ID.\nApple Pay Loyalty Card Integration\nIn the fall of 2015, Apple Pay began working with various store loyalty programs, allowing customers with loyalty cards stored in the Wallet app to use them over NFC in participating stores. Loyalty cards from eligible stores added to Wallet pop up at NFC terminals just like credit cards.\nWalgreens was the first company to support the Apple Pay loyalty program. Walgreens customers can add their Walgreens rewards cards to Wallet where they can be used like any other credit or debit card during the checkout process to earn rewards points.\nChecking out with a rewards card is a two-step process in most stores -- first it's necessary to activate the rewards card with a finger on Touch ID, followed by the actual payment. Kohl's is an exception, having introduced one-touch rewards and payment integration.\nApple's Cut\nApple collects a fee from banks each time consumers use the Apple Pay payment solution to make a purchase. According to rumors, Apple has struck individual deals with each bank it has partnered with, including Chase, Bank of America, Wells Fargo, and more.\nApple's cut is reportedly at approximately 0.15 percent of each purchase, which equates to 15 cents out of each $100 purchase.\nApple Pay on the Web\nApple Pay is also available on the web, with the payments service offered on participating websites when checking out. Many websites and payment providers like Stripe, WePay, and SquareSpace support Apple Pay on the web.\nOn Macs with a fingerprint sensor, purchases are verified through Touch ID. On other machines, purchases are verified through a connection to an Apple Watch or an iPhone, with the purchase authorized via Touch ID/Face ID, and on the iPhone and iPad, purchases are authorized through Touch ID or Face ID as normal.\nApple Cash\nApple Cash is a peer-to-peer payment option designed to allow users to send money via Apple Pay using Messages on the iPhone, iPad, and Apple Watch. Apple Cash lets you send money to friends and family with a connected debit card, similar to services like Square Cash or Venmo.\nMoney can be sent in Messages using standard fingerprint/face authentication (or skin authentication on the Apple Watch), and funds received are available in a new Apple Cash card that's located in Wallet. This card can be used to make Apple Pay purchases where Apple Pay is accepted (similar to any other credit or debit card stored in Apple Pay), or it can be transferred to a bank account. Apple partnered with prepaid card provider Green Dot for the Apple Cash card.\nLike many peer-to-peer money transferring services, sending money is free when a debit card is used, and while Apple used to allow money to be loaded using a credit card for a small fee, you can now only add money to Apple Cash via a debit card. Apple Cash is limited to the United States.\nAs of iOS 18, there is a Tap to Cash feature that allows Apple Cash to be exchanged in person by tapping two iPhones or Apple Watches together. Sending money this way does not require knowing the other person's phone number or email, making it ideal for quick in-person purchases.\nThe Apple Card\nApple in August 2019 introduced the Apple Card, its own credit card in partnership with Goldman Sachs and Mastercard. The Apple Card is a physical and digital credit card that iPhone users in the U.S. can sign up for on the iPhone.\nApple Card works like a traditional credit card, but it is deeply integrated into the Wallet app, offering up real-time views of the latest transactions and a complete overview of spending organized by category along with payment options optimized for encouraging minimal interest.\nApple has a \"Daily Cash\" cash back program that gives you 1 percent cash back on all purchases, 2 percent cash back on all Apple Pay purchases made with Apple Card, and 3 percent on all Apple-related purchases at Apple retail stores, the App Store, iTunes, and some third-party partner stores. Daily Cash is immediately available in the Wallet app, delivered on the Apple Cash card.\nApple also offers three percent cash back when using the Apple Card with Apple Pay for Uber, Uber Eats, T-Mobile, Walgreens, Nike, and Duane Reade purchases. In the future, Apple also plans to bring three percent cash back rewards to other merchants and apps.\nCustomer support for Apple Card is done through the Messages app, and there are no fees associated with the card. Apple is aiming to provide low interest rates, but APR is be based on credit score and credit approval is required. Privacy is a major focus, and the physical Apple Card - made out of titanium engraved with your name - has no number on it, no signature, and no expiration date, with info instead stored in the Wallet app.\nWe have a full guide with everything that you need to know about Apple Card available here.\nTap to Pay on iPhone\nApple in February 2022 introduced \"Tap to Pay on iPhone,\" a feature designed to allow NFC-compatible iPhones to accept payments through Apple Pay, contactless credit and debit cards, and other digital wallets, without requiring additional hardware.\nTap to Pay works with the iPhone XS or later, allowing supported iOS apps to accept iPhone to iPhone payments. At checkout, a merchant is able to prompt a customer to hold their iPhone, Apple Watch, contactless credit or debit card, or other digital wallet close to the merchant's iPhone to complete a payment over NFC. Note that Tap to Pay is separate from Tap to Cash, an iPhone-to-iPhone payment option that uses Apple Cash.\nTap to Pay is available in more than 20 countries, and it works with major payment platforms like Square, Stripe, Venmo, Clover, and more.\nPay Over Time\nWith the discontinuation of Apple Pay Later in mid-2024, Apple has added support for using buy now, pay later services from Klarna, Synchrony, and Affirm when checking out with Apple Pay on the web and in apps. iOS 18 and iPadOS 18 are required for the feature.\nInternational Expansion\nApple began expanding Apple Pay outside of the United States in 2015, launching the payment service in the UK, Australia, and Canada. From there, it expanded to dozens of other countries. Apple today is still working to expand Apple Pay worldwide, as it is not available in some major countries like India.\nApple Pay can be used with supported debit and credit cards in Argentina, Armenia, Australia, Austria, Azerbaijan, Bahrain, Belarus, Belgium, Brazil, Bulgaria, Canada, Chile, China, Colombia, Costa Rica, Croatia, Cyprus, Czech Republic, Denmark, El Salvador, Estonia, Faroe Islands, Finland, France, Georgia, Germany, Greece, Greenland, Guernsey, Guatemala, Honduras, Hong Kong, Hungary, Iceland, Ireland, Isle of Man, Israel, Italy, Japan, Jersey, Jordan, Kazakhstan, Kuwait, Latvia, Liechtenstein, Lithuania, Luxembourg, Macao, Malaysia, Malta, Mexico, Moldova, Monaco, Montenegro, Morocco, Netherlands, New Zealand, Norway, Palestine, Panama, Peru, Poland, Portugal, Qatar, Romania, San Marino, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, South Africa, South Korea, Spain, Sweden, Switzerland, Taiwan, The United States, Puerto Rico, Ukraine, United Arab Emirates, United Kingdom, Vatican City, and Vietnam.\nMore information on availability and participating financial institutions in each country or region can be found on Apple's website.\nNFC in Europe\nWhile Apple Pay is the only payment method that is able to access the NFC chip in the iPhone for tap-to-pay capabilities, that changed in the EU with the launch of iOS 17.4. The update allows third-party payment providers and banks to use the NFC chip in countries located in the European Economic Area.\nThat means alternative payment options can be set as the default that activates when an iPhone is placed near a contactless payment terminal.\nCompetition\nWalmart, the biggest retailer in the United States has refused to implement Apple Pay and has instead rolled out its own proprietary payment system, Walmart Pay. With Walmart Pay, customers can make purchases and payments in Walmart retail locations using a QR code in the Walmart app. Walmart Pay is available nationwide at all Walmart locations.\nOther Apple Pay competitors include Samsung Pay and Google Pay (formerly known as Android Pay), two mobile payment solutions created by Samsung and Google, respectively. These payment solutions are largely designed for Android devices, but even iPhone users can use Google Pay Send for sending money to friends."
    },
    {
      "url": "https://www.macrumors.com/2025/08/19/national-parks-activity-challenge-2025/",
      "text": "Apple will host its annual National Parks Apple Watch activity challenge on Sunday, August 24. The event is designed to celebrate national parks across the United States.\nApple Watch owners can earn an Apple Watch activity award by doing a workout that lasts for 20 minutes or more on August 24, 2025.\nLike all of the Apple Watch activity challenges, earning the award will provide users with animated stickers that can be used in the Messages app.\nAlong with a new Apple Watch challenge, Apple typically offers other national parks-themed content in August, including an Apple Pay donation program, Apple TV+ content, Apple Music songs, books, podcasts, and more.\nSaturday August 16, 2025 6:45 am PDT by Joe Rossignol\nApple is developing an all-new operating system codenamed \"Charismatic,\" according to Bloomberg's Mark Gurman.\nApple smart home hub concept\nThis is likely Apple's long-rumored \"homeOS\" operating system.\nIn a report this week, Gurman said both Apple's rumored smart home hub in 2026 and tabletop robot in 2027 will run the new operating system. He said the software platform will blend...\nMonday August 18, 2025 11:59 am PDT by Joe Rossignol\nThe seventh developer beta of iOS 26 is now available. While we are now in the later stages of the iOS 26 beta cycle, there are still some changes.\nBelow, we outline everything new that we have found in iOS 26 beta 7 so far.\nRedesigned Blood Oxygen Feature\nThe seventh developer betas of iOS 26 and watchOS 26 include a redesigned Blood Oxygen feature on Apple Watch Series 9, Apple Watch ...\nWednesday August 20, 2025 6:44 am PDT by Tim Hardwick\nWe're only weeks away from Apple's annual iPhone event – rumored to take place on September 9 – and along with the new iPhone 17 series, we're going to get a new version of the Apple Watch Ultra for the first time since 2023.\nBy the time the Ultra 3 is unveiled, it will have been two years since the previous model arrived. The intervening period has left plenty of room for enhancements,...\nTuesday August 19, 2025 11:25 am PDT by Juli Clover\nApple today provided developers with updated beta firmware for the AirPods Pro 2 and AirPods 4, allowing them to test the new AirPods features in iOS 26, iPadOS 26, and macOS Tahoe. The firmware is only available to developers at the current time, and a device running iOS 26, iPadOS 26, or macOS 26 is required to install the update. The firmware has a build number of 8A5343a, up from 8A5324b.\n...\nWednesday August 20, 2025 12:00 pm PDT by Joe Rossignol\nIn select U.S. states, residents can add their driver's license or state ID to the Wallet app on the iPhone and Apple Watch, providing a convenient and contactless way to display proof of identity or age at select airports and businesses, and in select apps.\nThis week, Apple announced the 10th U.S. state that has implemented the feature: Montana.\nBelow, we have recapped key details about...\nTuesday August 19, 2025 9:29 am PDT by Joe Rossignol\nApple's software engineers are testing iOS 18.6.2, according to the MacRumors visitor logs, which have been a reliable indicator of upcoming iOS versions.\nYesterday, an anonymous source with a proven track record said iOS 18.6.2 was incoming, but the update was not present in our logs at that time.\nLast year, the same anonymous source claimed that iOS 17.5.2 was in the pipeline, but Apple ...\nApple is expected to delay the launch of its base iPhone 18 model until spring 2027, marking a major shift in the company's long-established release cycle, according to South Korea's ETNews.\nThe report claims that Apple has informed some of its suppliers that the iPhone 18 will not be part of the September 2026 iPhone lineup. Instead, the company will unveil only higher-end models in the...\nWednesday August 20, 2025 8:21 am PDT by Joe Rossignol\nApple is planning to launch a new \"TechWoven\" line of cases for the iPhone 17 series, according to a leaker known as \"Majin Bu.\"\nTwo years ago, Apple stopped selling leather iPhone cases, as part of the company's efforts to reduce its carbon emissions. As an alternative, Apple introduced a new \"FineWoven\" line of fabric iPhone cases made from 68% post-consumer recycled content, but they were ...\nWill one of the activities be finding a national park that still has employees, or perhaps one that hasn't been turned over to logging and oil companies?\nApple will host its annual National Parks Apple Watch activity challenge on Sunday, August 24. The event is designed to celebrate national parks across the United States.\nApple Watch owners can earn an Apple Watch activity award by doing a workout that lasts for 20 minutes or more on August 24, 2025.\nLike all of the Apple Watch activity challenges, earning the award will provide users with animated stickers that can be used in the Messages app.\nAlong with a new Apple Watch challenge, Apple typically offers other national parks-themed content in August, including an Apple Pay donation program, Apple TV+ content, Apple Music songs, books, podcasts, and more.\nArticle Link: National Parks Apple Watch Activity Challenge Launching August 24 ('https://www.macrumors.com/2025/08/19/national-parks-activity-challenge-2025/')\nHow exactly do the National Parks benefit from an Apple Watch wearer walking 20 minutes around a city park, a forest trail, or a bike ride? I wished Apple would require both for awarding the Aug 24th sticker: an activity AND a donation to the National Parks system.\nBiggest design overhaul since iOS 7 with Liquid Glass, plus new Apple Intelligence features and improvements to Messages, Phone, Safari, Shortcuts, and more. Developer beta available now ahead of public beta in July."
    },
    {
      "url": "https://www.apple.com/newsroom/2022/08/apple-celebrates-americas-parks/",
      "text": "UPDATE\nAugust 22, 2022\nApple celebrates America’s parks\nThrough August 28, Apple is donating $10 to the National Park Foundation for every Apple Pay purchase on apple.com, in the Apple Store app, or at an Apple Store in the US\nCelebrating 106 years of the US National Park Service, Apple today introduced more ways to learn about and support America’s parks. These offerings include a $10 donation the company will make to the National Park Foundation for every Apple Pay purchase made with Apple through August 28,1 along with special content and collections on Apple Maps, Apple Podcasts, and more.\n“Whenever I visit our national parks — as I did recently in Yosemite and Glacier — I feel the sense of awe, tranquility, and quiet reverence only nature can inspire,” said Tim Cook, Apple’s CEO. “We’re proud to partner with the organizations and communities who maintain our parks, educate us about their history, and share them with the world. These treasures are well worth protecting, today and for every generation to come.”\nLast year, Apple’s support for the National Park Foundation helped young people from across the country — like Kalen Anderson, 2022 Corps Member of the Year — participate in a service corps program at a national park. This year, Anderson completed the Werowocomoco internship program at Colonial National Historical Park and Captain John Smith Chesapeake National Historic Trail through the Appalachian Conservation Corps. As part of the program formed in partnership with the National Park Foundation, he was able to engage directly in the management of a Native archeological site that is part of his Indigenous identity and heritage.\n“Of my time as a corps member and intern of the National Park Service, I have been given an opportunity that has influenced how I developed and continue to develop myself as a steward,” said Anderson, who is a member of the Nansemond Indian Nation. “I have learned that I am not only a steward of my environment, but also of my culture. The profound time I have spent working with the team around me will forever have a positive impression on who I strive to become for myself and for my community.”\nWith a passion for park preservation and an understanding of its impact on his culture, Anderson joins a collective of Indigenous service corps members who represent the next generation of national park stewards. Apple’s donation to the National Park Foundation last year, driven by customer purchases made with Apple Pay, also benefited the Leaders of Color service corps crew, which provides a supportive space for aspiring BIPOC conservationists to break into the field. This support aligns with the company’s Racial Equity and Justice Initiative, a long-term effort to address systemic racism and expand opportunities for Black, Latinx, and Indigenous communities.\n“America’s national parks are a gift we share,” said Will Shafroth, the National Park Foundation’s president and CEO. “Apple’s partnership and generous commitment help to ensure that all people see themselves in national parks and feel welcome in these places that belong to all of us.”\nIn addition to supporting these and other programs operating to preserve America’s cherished national parks through Apple Pay purchases this week, Apple customers can also enjoy the unique worlds of these parks through special collections and offerings across Apple services.\nThe Parks that Honor Native American History Guide in Apple Maps allows users to learn more about national parks celebrating Indigenous history and heritage. On Apple Podcasts, listeners can check out a collection of episodes centering Indigenous voices, including the “Yellowstone” episode of “Parks,” a podcast about the people who lived on US public lands before colonists arrived.\nApple Watch users are encouraged to celebrate the beauty of national parks everywhere with a limited edition Activity Challenge award. On August 27, users can earn the award by completing a hike, walk, run, or wheelchair workout of a mile or more.\n- Donations are limited to a maximum of $1,000,000 and go to the National Park Foundation.\nShare article\nMedia\n-\nText of this article\n-\nImages in this article"
    }
  ],
  "argos_summary": "Apple is donating $10 to the National Park Foundation for every purchase made using Apple Pay in the U.S. until August 29, 2023, with a maximum contribution of $1 million. This initiative, which has been ongoing since 2017, aims to support the preservation of national parks and includes special content across Apple services. Additionally, Apple Watch users can earn a national parks-themed award by completing a workout on August 24.",
  "argos_id": "0HY9NRRQM"
}