{
  "url": "https://finance.yahoo.com/news/exxaro-posts-robust-h1-results-110000812.html?.tsrc=rss",
  "authorsByline": "Editor OilPrice.com",
  "articleId": "56672589f30c466bb6098db77d381e7b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T11:00:00+00:00",
  "addDate": "2025-08-22T11:47:28.527480+00:00",
  "refreshDate": "2025-08-22T11:47:28.527482+00:00",
  "score": 1.0,
  "title": "Exxaro Posts Robust H1 Results on Strong Coal Sales, Manganese Expansion",
  "description": "Exxaro Resources (JSE: EXX) posts higher H1 revenue, dividend, and advances coal, manganese, and renewables growth.",
  "content": "Exxaro Resources Limited (JSE: EXX) delivered a resilient interim performance for the six months ended 30 June 2025, reporting higher earnings and dividend payouts while advancing its diversification and decarbonisation strategies.\n\nThe diversified mining and energy group grew revenue 8% year-on-year to R20.6 billion, while group EBITDA climbed 10% to R5.6 billion, maintaining a healthy 27% margin. Headline earnings per share rose 13% to R17.24, supported by improved equity-accounted income from Black Mountain Mining and stable contributions from Sishen Iron Ore Company. Net cash rose 27% to R12.4 billion, strengthening the balance sheet.\n\nExxaro’s board declared an interim dividend of R8.43 per share, marking the company’s 45th consecutive payout since its 2006 JSE listing. The group remains three years fatality-free, with a lost time injury frequency rate of 0.05, underscoring its safety focus through the recently refreshed “One Voice Safety Strategy.”\n\nCoal remained the backbone of Exxaro’s earnings, with segment EBITDA up 10% to R5.6 billion on stronger domestic and export sales, despite softer global prices. Production held steady at 19.4 million tonnes, while sales volumes rose 1%, aided by proactive logistics management that offset rail disruptions.\n\nThe group’s renewable energy subsidiary, Cennergi, produced 337 GWh in the half, in line with guidance. In February, Exxaro reached financial close on the 140 MW Karreebosch wind project with a PPA signed with Northam Platinum, boosting Cennergi’s portfolio to 437 MW. Alongside the Lephalale Solar Project, Cennergi’s capacity is set to more than double by 2027.\n\nStrategically, Exxaro advanced its diversification push with a major manganese acquisition announced in May. The R11.67 billion deal with Ntsimbintle Holdings and OMH Mauritius gives Exxaro stakes in the Tshipi Borwa mine, Jupiter Mines, Mokala, and Hotazel manganese assets. Pending regulatory approvals, the transaction is expected to close in early 2026 and will significantly broaden the company’s revenue mix beyond coal.\n\nOn the decarbonisation front, Exxaro is commissioning its first self-generation project at Grootegeluk, expected to cut Scope 2 emissions by 25%. The company also signed a memorandum of understanding with Eskom in April to address Scope 2 and 3 emissions and secured a renewable PPA with Northam Platinum to lower value-chain emissions.\n\nExxaro invested R815 million in socio-economic development during the period, with 71% of its coal procurement spend directed to black-owned local suppliers. The company also reshaped its executive structure to enhance delivery on its growth and sustainability strategies, adding leadership roles in coal, technical services, and sustainability.",
  "medium": "Article",
  "links": [
    "https://www.exxaro.com/media-and-insights/press-releases/exxaro-delivers-a-resilient-2025-half-year-performance-driven-by-a-focus-on-safety-market-to-resource-optimisation-strategy-proactive-marketing-and-logistics-and-decisive-strategy-execution/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Strong Coal Sales",
      "weight": 0.07961683
    },
    {
      "name": "Exxaro",
      "weight": 0.07508843
    },
    {
      "name": "Exxaro Resources Limited",
      "weight": 0.074203864
    },
    {
      "name": "Coal",
      "weight": 0.06107167
    },
    {
      "name": "coal",
      "weight": 0.06107167
    },
    {
      "name": "sales volumes",
      "weight": 0.0590197
    },
    {
      "name": "group EBITDA",
      "weight": 0.057790216
    },
    {
      "name": "Northam Platinum",
      "weight": 0.057253968
    },
    {
      "name": "dividend payouts",
      "weight": 0.056325004
    },
    {
      "name": "Hotazel manganese assets",
      "weight": 0.055682354
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.986328125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97607421875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9091796875
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.8154296875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.388427734375
    }
  ],
  "sentiment": {
    "positive": 0.90268874,
    "negative": 0.027020307,
    "neutral": 0.070290975
  },
  "summary": "Exxaro Resources Limited (JSE: EXX) reported a strong interim performance for the six months ending 30 June 2025, with revenue increasing by 8% year-on-year to R20.6 billion. Group EBITDA also increased by 10%, maintaining a 27% margin. Headline earnings per share rose 13% to R17.24, boosted by improved equity-accounted income from Black Mountain Mining and stable contributions from Sishen Iron Ore Company. Exxaro's board declared an interim dividend of R8.43 per share, marking the company's 45th consecutive payout since its 2006 JSE listing. The company advanced its diversification push with a major manganese acquisition announced in May, which will significantly broaden its revenue mix beyond coal.",
  "shortSummary": "Exxaro Resources Limited reported robust H1 results with strong coal sales, diversification, and sustainability strategies, including a major manganese acquisition and carbon reduction measures.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0a7951cdba18451ba8269f5e9e2739ff",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.exxaro.com/media-and-insights/press-releases/exxaro-delivers-a-resilient-2025-half-year-performance-driven-by-a-focus-on-safety-market-to-resource-optimisation-strategy-proactive-marketing-and-logistics-and-decisive-strategy-execution/",
      "text": "Key highlights:\n- Three years fatality free\n- Loss time injury frequency rate (LTIFR) of 0.05\n- Group revenue increased 8% year-on-year to R20.6 billion\n- Group EBITDA increased10% year-on-year, to R5.6 billion\n- Net cash position improved 27% year-on-year to R12.4 billion\n- Headline earnings per share (HEPS) rose 13% year-on-year to R17.24\n- Dividend declared of R8.43 per share\n- Signing of MoU with Eskom in April 2025 to reduce Scope 2 and 3 emissions\n- Karreebosch project acquisition in February 2025\n- One Voice Safety Strategy – strategy refresh in April 2025\n- Manganese transaction announced in May 2025\nExxaro Resources Limited (Exxaro) delivers a robust interim performance, underpinned by operational efficiency and marketing excellence, despite persistent global and domestic headwinds. The group reported an increase in revenue of 8% to R20.6 billion for the six-month period ended 30 June 2025 compared to R19 billion for the six-month period ended 30 June 2024 (1H24).\nGroup EBITDA rose by 10% to R5.6 billion (1H24: R5.1 billion), with an EBITDA margin of 27%, mainly driven by the strong performance of our coal business. The coal business’ EBITDA increased 10% year-on-year to R5.6 billion (1H24: R5.1 billion) on the back of higher export and domestic sales volumes, coupled with an 96% price realisation in a softer commodity price environment.\nHEPS increased 13% year-on-year to R17.24 per share, primarily driven by a 9% rise in group EBITDA and an 18% increase in adjusted equity-accounted income.\nStrong contribution from our equity-accounted investments with adjusted equity-accounted income rising by 18%, primarily driven by a positive contribution from Black Mountain Mining Proprietary Limited (Black Mountain), which benefitted from increased production and sales volumes due to more favourable mining conditions. Adjusted equity-accounted income from Sishen Iron Ore Company Proprietary Limited (SIOC) remained stable at R1.9 billion (1H24 R1.9 billion). These investments continue to help operationalise our diversification strategy and enhance the quality of our earnings.\nThe board has approved a dividend of R8.43 per share, marking Exxaro’s 45th consecutive dividend declaration since our listing on the Johannesburg Stock Exchange Limited (JSE) in 2006. This milestone underscores the resilience of our business model despite headwinds and our unwavering commitment to delivering consistent and sustainable returns to our shareholders.\nOur financial performance in the first half of 2025 (1H25) remains robust, driving strong financial results.\nSafety, which remains the organisation’s priority and underpins how we do business, was further enhanced with the launch of our refreshed safety strategy – the One Voice Safety Strategy which has since been rolled out across our operations. The organisation is currently three years fatality free. Year to date, we recorded three lost time injuries compared to four in the same period in 2024, resulting in a frequency rate of 0.05 for 1H25 in line with our safety limit of 0.05. The elimination of loss of life and achievement of zero harm across the business remains a continued and collective responsibility.\nOverall production was stable at 19.4 million tonnes in 1H25 compared to 19.3 million tonnes in 1H24. Our coal teams made strategic production calls to balance cost, quality, and market demand, demonstrating operational maturity. In total, our sales increased by 1%, mainly as a result of higher domestic and export sales, which were partly offset by reduced sales to Eskom. Exceptional efforts by the Market-to-Resource optimisation strategy and marketing and logistics teams mitigated the rail wash-away due to heavy rains at Grootegeluk, by placing Mpumalanga product in the market during this period to maintain customer commitments.\nCennergi’s operating wind assets generated 337 gigawatt-hours electricity during the reporting period, compared to 339 gigawatt-hours in the first half of 2024 largely due to high plant availability. The current period generation is in line with, in fact marginally better than, the June 2025 guidance of 335 gigawatt-hours. In February 2025, we reached financial close of the Karreebosch project, including the signed power purchase agreement with Northam Platinum. This adds 140 megawatts gross capacity to Cennergi bringing the total to 437 megawatts. Combined with our Lephalale Solar Project (LSP), these two projects will more than double Cennergi’s capacity by the first half of 2027.\nOur people remain the heartbeat of our organisation and we remain committed to maintaining a diverse, equitable, and inclusive workforce that fosters health, growth, and long-term opportunity. Exxaro’s social investment reached R815 million in supporting socio-economic development in our host communities. For our coal operations, the procurement spend on black local suppliers constituted 71% of the social investment spend. We continue to invest in our enterprise and supplier development, minerals succession and education programmes to ensure we have sustainable communities.\nTo accelerate the delivery of our Sustainable Growth and Impact strategy, we have refined our group management structure with new executive roles which include metals, technical services and commercial. We also announced the appointment of Executive Heads of Coal, Technical Services, and a designate Executive Head for Sustainability to succeed our current Executive Head who will be retiring in July 2026. This will strengthen our ability to execute on our complex projects, while a streamlined technical services division will help drive excellence across our mining, metallurgy, exploration, engineering, and projects portfolios. This re-organisation is about more than efficiency, it’s about positioning Exxaro to respond faster to market opportunities, manage risks more effectively, and deliver sustainable growth.\nIn May 2025, Exxaro entered into binding agreements to acquire shares and claims in manganese assets held by Ntsimbintle Holdings Proprietary Limited (Ntsimbintle Holdings) and OMH (Mauritius) Corp (OMH). Through this acquisition, Exxaro gains stakes in Ntsimbintle Mining Proprietary Limited (74%) giving Exxaro 60,1% effective ownership in Tshipi Borwa Mine (including 50.1% marketing rights), Jupiter Mines Limited (19.99%), Ntsimbintle Marketing and Trading Private Limited (100%), Mokala Manganese Proprietary Limited (51%), and Hotazel Manganese Mines Proprietary Limited (9%), for a purchase consideration of R11.67 billion, rising up to R14.68 billion with tag-along rights and escalations.\nPost the announcement, Ntsimbintle Holdings shareholders have approved the transaction. The Escrow and Warranty and Indemnity Insurance Agreements have been entered into. We have filed our submission to the South African Competition Authority and for Tshipi Borwa mine, as well as our submission for Ministerial approval under section 11 of the Mineral and Petroleum Resources Development Act (MPRDA). We are receiving waivers or exercise of respective pre-emptive - some are received, while some are still in progress. Subject to all approvals and consents being obtained, we remain on track for close of the transaction in the first quarter of 2026.\nThe organisation is operationalising its decarbonisation roadmap and is actively configuring its assets to support this journey, with a particular focus on medium to long-term technologies such as fleet optimisation to reduce Scope 1 emissions. A key milestone in this commitment, is the commissioning of our first self-generation initiative, being LSP at our Grootegeluk mine, which will deliver a 25% reduction in scope 2 emissions and a 17% reduction in total Scope 1 and Scope 2 emissions. Addressing Scope 3 (value chain) emissions remain a priority, and through strategic partnerships and meaningful stakeholder engagement such as the signing of a memorandum of understanding with Eskom in April 2025, we are confident in making significant progress in reducing these emissions. The signing of a power purchase agreement with our coal customer Northam Platinum will also support the reduction of our Scope 3 emissions.\nWhile global and domestic macro-economic conditions remain uncertain, we are cautiously optimistic about its ability to continue with its Market-to-Resource optimisation initiatives to make strategic operational decisions that will ensure continued stakeholder value creation. We are focused on operational efficiency including the Leeuwpan turnaround plan, closing the manganese transaction, delivering the LSP and Matla Life of Mine expansion project, and improving logistics in partnership with Transnet."
    }
  ],
  "argos_summary": "Exxaro Resources Limited reported a strong interim performance for the six months ending June 30, 2025, with an 8% increase in revenue to R20.6 billion and a 10% rise in EBITDA to R5.6 billion. The company declared an interim dividend of R8.43 per share, marking its 45th consecutive payout, while maintaining a focus on safety with a lost time injury frequency rate of 0.05. Exxaro is advancing its diversification strategy through a significant manganese acquisition and is actively pursuing decarbonisation initiatives, including a self-generation project expected to reduce emissions.",
  "argos_id": "1UFZSSFND"
}