{
  "url": "https://www.morningstar.com/news/business-wire/20250822907923/cnb-community-bancorp-inc-announces-commencement-of-issuer-tender-offer",
  "authorsByline": "",
  "articleId": "304338718c134d5eba3944eef2d25487",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T06:00:00-05:00",
  "addDate": "2025-08-22T11:36:19.939627+00:00",
  "refreshDate": "2025-08-22T11:36:19.939630+00:00",
  "score": 1.0,
  "title": "CNB Community Bancorp, Inc. Announces Commencement of Issuer Tender Offer",
  "description": "",
  "content": "CNB Community Bancorp, Inc. (OTCQX: CNBB) (referred to as the “Company”, “we”, “our”, or “us”), the parent company of County National Bank, today announced that it has commenced a tender offer to purchase up to 75,000 shares of our outstanding common stock at a price of $44.09 per share. As of August 19, 2025, CNB Community Bancorp, Inc. had 2,094,557 shares outstanding.\n\nWe have evaluated our operations, strategy, and expectations for the future and believe that, as with the 2024 tender offer, this 2025 tender offer is a prudent use of our financial resources given our existing and new markets, our historical performance, the fundamentals of our balance sheet, and the current market price for our shares.\n\nWe believe that the tender offer is the best mechanism to provide all shareholders with the opportunity to tender all or a portion of their shares and, thereby, receive a return of some invested capital in the Company. This format of repurchase also provides a method for shareholders not participating to increase their relative equity interest in us and our future operations with no additional investment. As a result, we believe that investing in our own shares in this manner is an attractive use of capital and an efficient means to provide value to our shareholders. The tender offer also provides liquidity to shareholders by providing them the opportunity to sell all or a portion of their shares at a price above the average trading price of our shares over the first seven months of 2025 without potential fluctuations in the share price and the usual transaction costs associated with market sales.\n\nThe tender offer will expire at 5:00 p.m., Eastern Daylight Time, on Wednesday, September 24, 2025, unless extended by us. Tenders of shares must be made on or prior to the expiration of the tender offer and shares may be withdrawn at any time on or prior to the expiration of the tender offer. Our obligation to purchase shares in the tender offer is not conditioned upon any minimum number of shares being tendered. The tender offer is, however, subject to the conditions set forth in the Offer to Purchase and related Letter of Transmittal documents being sent to shareholders.\n\nUnder the tender offer, shareholders of CNB Community Bancorp, Inc. common stock will be invited to choose how many shares they are willing to sell to us at $44.09 per share. If more than the maximum number of shares sought is tendered, tendering shareholders owning fewer than 100 shares, or \"odd lot\" holders, will have their shares purchased without proration and all other tendered shares will be purchased on a pro rata basis, subject to the conditional tender provisions described in the Offer to Purchase. Shareholders whose shares are purchased in the tender offer will be paid the purchase price net in cash, without interest, shortly following the expiration of the tender offer. Shareholders whose shares are not purchased in the tender offer will have their shares returned, free of charge, promptly after the expiration of the tender offer.\n\nInnisfree M&A Incorporated is the Information Agent for the offer and Continental Stock Transfer and Trust Company is the Depositary. The Offer to Purchase, Letter of Transmittal and related documents are being mailed to registered shareholders and will also be made available for distribution to beneficial owners of CNB Community Bancorp, Inc. common stock. Questions related to the offer and requests for copies of the Offer to Purchase, the Letter of Transmittal and related documents may be directed to Innisfree M&A Incorporated at (877) 750-0537 (for shareholders) and (212) 750-5833 (for banks/brokers).\n\nNeither CNB Community Bancorp, Inc. nor its Board of Directors is making a recommendation to any shareholder as to whether to tender or refrain from tendering their shares. Shareholders should carefully evaluate all information in the Offer to Purchase and the related Letter of Transmittal, should consult with their own financial and tax advisors, and should make their own decisions about whether to tender shares, and, if so, how many shares to tender.\n\nThis press release is for informational purposes only and is not an offer to buy or the solicitation of an offer to sell any shares of CNB Community Bancorp, Inc.’s common stock. The solicitation of offers to buy CNB Community Bancorp, Inc.’s common stock will only be made pursuant to the Offer to Purchase and related materials that the Company will be distributing to its shareholders.\n\nCNB Community Bancorp, Inc. (OTCQX:CNBB) is a one-bank holding company formed in 2005. Its subsidiary bank, County National Bank, is a nationally chartered full-service bank, which has served its local communities since its founding in 1934. CNB Community Bancorp, Inc. is headquartered in Hillsdale, Michigan and through its subsidiary bank offers banking products along with investment management and trust services to communities located throughout southern Michigan.\n\nThis news release and other releases and reports issued by the Company may contain \"forward-looking statements\" (as defined in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended) concerning future events and expectations including with respect to the completion of the tender offer. These statements involve known and unknown risks and are based upon a number of assumptions and estimates which are inherently subject to significant uncertainties and contingencies, many of which are beyond the control of the Company. Actual results may differ materially from those expressed or implied by such forward-looking statements. The Company cautions readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. The Company expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in the Company’s expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based. The Company is including this statement for purposes of taking advantage of the safe-harbor provisions of the Private Securities Litigation Reform Act of 1995.",
  "medium": "Article",
  "links": [
    "https://www.businesswire.com/news/home/20250822907923/en/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Issuer Tender Offer",
      "weight": 0.09423961
    },
    {
      "name": "share",
      "weight": 0.086166285
    },
    {
      "name": "shares",
      "weight": 0.086166285
    },
    {
      "name": "CNB Community Bancorp",
      "weight": 0.08454155
    },
    {
      "name": "offers",
      "weight": 0.08217362
    },
    {
      "name": "tendering shareholders",
      "weight": 0.080675274
    },
    {
      "name": "registered shareholders",
      "weight": 0.06805079
    },
    {
      "name": "Shareholders",
      "weight": 0.067919016
    },
    {
      "name": "shareholders",
      "weight": 0.067919016
    },
    {
      "name": "Tenders",
      "weight": 0.06774748
    }
  ],
  "topics": [
    {
      "name": "Mergers and Acquisitions"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9931640625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96142578125
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.90380859375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8720703125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.68310546875
    }
  ],
  "sentiment": {
    "positive": 0.13827744,
    "negative": 0.091977805,
    "neutral": 0.7697448
  },
  "summary": "CNB Community Bancorp, Inc. (OTCQX: CNBB), the parent company of County National Bank, has initiated a tender offer to purchase up to 75,000 shares of its outstanding common stock at a price of $44.09 per share. The tender offer is designed to provide all shareholders with the opportunity to tender all or a portion of their shares, thereby receiving a return of invested capital in the company. The offer is not an offer to buy or sell any shares, but it is subject to conditions set forth in the Offer to Purchase and related Letter of Transmittal documents sent to shareholders. Tenders must be made prior to the expiration of the tender offer and shares may be withdrawn at any time on or prior to this.",
  "shortSummary": "CNB Community Bancorp has launched a tender offer to purchase up to 75,000 shares at $44.09 per share, providing liquidity and shareholder options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e2f53968f3054cc883da092d91c195a8",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "CNB Community Bancorp, Inc. has initiated a tender offer to buy back up to 75,000 shares of its common stock at $44.09 per share, with the offer set to expire on September 24, 2025. This decision is based on the company's evaluation of its financial resources and market conditions, aiming to provide liquidity to shareholders and enhance their equity interest. Shareholders can tender their shares, and if the number of shares exceeds the maximum sought, odd lot holders will have priority in the purchase.",
  "argos_id": "2IJ43Y3XU"
}