{
  "url": "https://www.investing.com/news/company-news/american-integrity-surpasses-15000-policies-in-south-carolina-93CH-4206730",
  "authorsByline": "",
  "articleId": "823db9b25b7b4f47a026877ba97074d2",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T12:05:12+00:00",
  "addDate": "2025-08-22T12:13:33.605722+00:00",
  "refreshDate": "2025-08-22T12:13:33.605725+00:00",
  "score": 1.0,
  "title": "American Integrity surpasses 15,000 policies in South Carolina By Investing",
  "description": "American Integrity surpasses 15,000 policies in South Carolina",
  "content": "TAMPA - American Integrity Insurance Group, Inc. (NYSE:AII), a residential property insurer with a market capitalization of $373 million, has exceeded 15,000 policies-in-force in South Carolina, the company announced in a press release Friday.\n\nThe milestone comes as part of the company’s expansion in the Southeast region following its initial public offering and listing on the New York Stock Exchange earlier this year. American Integrity reported its total policies-in-force have reached more than 400,000, representing a 50% increase year-over-year as of August 1, 2025. InvestingPro data shows the company generated $260 million in revenue over the last twelve months, with a healthy EBITDA of $87 million.\n\n\"We didn’t just enter South Carolina—we earned our way in,\" said Bob Ritchie, Founder and CEO of American Integrity. \"We’ve been selective. We’ve grown with trusted agency partners, and we’ve remained committed to profitable underwriting every step of the way.\"\n\nFounded in 2006 and headquartered in Tampa, American Integrity specializes in residential property insurance across the Southeastern United States. The company claims its growth strategy is built on a vertically integrated platform covering underwriting, pricing, distribution, and claims management.\n\nAccording to the press release, the insurer maintains a conservative reinsurance program and a debt-free balance sheet. The company states it employs proprietary data-driven risk segmentation in its underwriting process. InvestingPro analysis confirms the company’s strong financial position, with a current ratio of 1.51 indicating liquid assets comfortably exceed short-term obligations. For deeper insights into AII’s financial health and growth prospects, investors can access the comprehensive Pro Research Report, available exclusively on InvestingPro.\n\nAmerican Integrity Insurance Group was founded in 2006 and completed its initial public offering earlier in 2025. The company focuses on residential property insurance in Southeastern states.\n\nIn other recent news, American Integrity Insurance Group reported its second-quarter 2025 earnings with impressive results. The company achieved an adjusted earnings per share (EPS) of $1.84, exceeding analyst expectations. Revenue reached $287 million, driven by a significant increase in gross premiums written. The company saw a 61% year-over-year revenue growth and a 29% increase in gross premium written, attributed to strong new business and improved retention rates.\n\nAnalysts have responded positively to these results, with Raymond James raising its price target for the company to $22 from $20 while maintaining an Outperform rating. Similarly, Piper Sandler increased its price target to $22, maintaining an Overweight rating, citing lower catastrophe losses and favorable reserve development as key factors. These developments reflect investor confidence in American Integrity Insurance’s growth potential.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/pro/AII"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "American Integrity Insurance Group",
      "weight": 0.096854255
    },
    {
      "name": "American Integrity",
      "weight": 0.09157992
    },
    {
      "name": "residential property insurance",
      "weight": 0.07344106
    },
    {
      "name": "South Carolina",
      "weight": 0.06366146
    },
    {
      "name": "American Integrity Insurance’s growth potential",
      "weight": 0.06354684
    },
    {
      "name": "American Integrity Insurance Group, Inc.",
      "weight": 0.06291675
    },
    {
      "name": "growth prospects",
      "weight": 0.061055485
    },
    {
      "name": "profitable underwriting",
      "weight": 0.06054968
    },
    {
      "name": "strong new business",
      "weight": 0.05836703
    },
    {
      "name": "American Integrity Insurance’s",
      "weight": 0.0565383
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9912109375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.8857421875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.7744140625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.77001953125
    },
    {
      "name": "/Finance/Insurance/Other",
      "score": 0.65234375
    }
  ],
  "sentiment": {
    "positive": 0.88636106,
    "negative": 0.02497283,
    "neutral": 0.088666156
  },
  "summary": "American Integrity Insurance Group (AII), a residential property insurer, has surpassed 15,000 policies-in-force in South Carolina. This milestone is part of the company's expansion in the Southeast region following its initial public offering and listing on the New York Stock Exchange earlier in the year. The company reported its total policies in force at over 400,000, a 50% increase year-over-year. American Integrity, which generated $260 million in revenue over the last year, also reported a strong EBITDA of $87 million. The insurer claims its growth strategy is built on a vertically integrated platform covering underwriting, pricing, distribution, and claims management.",
  "shortSummary": "American Integrity Insurance Group surpassed 15,000 policies in South Carolina, driven by strong growth and profitability, with strong financial prospects and reinsurance programs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "93f424db341b4288a232eb1e88ef5bf6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "American Integrity Insurance Group, Inc. has surpassed 15,000 policies-in-force in South Carolina as part of its expansion in the Southeast following its IPO earlier this year. The company reported over 400,000 total policies-in-force, a 50% year-over-year increase, and generated $260 million in revenue with an EBITDA of $87 million. Its recent second-quarter earnings showed an adjusted EPS of $1.84, exceeding expectations, and led to analysts raising their price targets, reflecting strong investor confidence in the company's growth potential.",
  "argos_id": "2MJRZUO4R"
}