{
  "url": "https://www.investing.com/news/analyst-ratings/block-stock-rating-reiterated-at-outperform-by-kbw-citing-growth-inflection-93CH-4206735",
  "authorsByline": "",
  "articleId": "ebd1fd2e7db243c3a265ce2e9e19337c",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/news/World_News_9_800x533_L_1420026261.jpg",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T12:05:41+00:00",
  "addDate": "2025-08-22T12:29:34.960023+00:00",
  "refreshDate": "2025-08-22T12:29:34.960026+00:00",
  "score": 1.0,
  "title": "Block stock rating reiterated at Outperform by KBW, citing growth inflection By Investing",
  "description": "Block stock rating reiterated at Outperform by KBW, citing growth inflection",
  "content": "Investing.com - Keefe, Bruyette & Woods (KBW) has reiterated an Outperform rating and $95.00 price target on Block Inc. (NYSE: ), according to a research note released as part of the firm’s August Opportunity series.\n\nKBW expressed confidence in Block’s growth trajectory for the remainder of the year, specifically highlighting expectations for a growth inflection across both of the company’s business segments. With a market capitalization of $45.18 billion and a strong current ratio of 1.96, Block demonstrates solid financial health. The firm believes there is \"solid potential for upside\" to second-half expectations, particularly if the macroeconomic environment remains stable.\n\nThe research note recommends investors own Block stock through the end of the year, positioning the payment technology company as an attractive investment opportunity in the current market environment. InvestingPro data reveals a perfect Piotroski Score of 9, indicating exceptional financial strength. Subscribers can access 8 additional exclusive ProTips and comprehensive financial analysis in the Pro Research Report.\n\nKBW identified Block’s upcoming November investor day as a potential catalyst for the stock. The firm expects this event could offer \"a compelling growth narrative for 2026 and beyond\" that might further support the company’s valuation.\n\nBlock Inc., formerly known as Square, operates two main business segments: its seller ecosystem for merchants and its Cash App personal financial services platform, both of which KBW anticipates will demonstrate accelerating growth in the coming months.\n\nIn other recent news, Block Inc. reported a 14% increase in gross profit for the second quarter, driven significantly by its expanding lending business, which now accounts for approximately 22% of the company’s gross profit. Truist Securities raised its price target for Block to $70, citing growth in the Cash App Borrow product as a key factor in the company’s recent revenue acceleration. Meanwhile, Jefferies lowered its price target for Block to $90, maintaining a Buy rating but noting cautious investor sentiment despite positive momentum in Square’s U.S. gross payment volume. Bernstein SocGen Group reiterated its Outperform rating and a $95 price target, emphasizing the substantial contribution of Block’s lending business to its gross profit growth. In addition to financial updates, Block unveiled a modular bitcoin mining system named Proto Rig and an open-source fleet management software called Proto Fleet. The announcement was made at Core Scientific’s facility in Dalton, Georgia, where the Proto Rigs are already in use. These developments highlight Block’s strategic focus on both financial technology and cryptocurrency innovation.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/pro/XYZ",
    "https://www.investing.com/equities/square-inc"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Block stock rating",
      "weight": 0.10115983
    },
    {
      "name": "Block Inc.",
      "weight": 0.10093537
    },
    {
      "name": "Block stock",
      "weight": 0.099363126
    },
    {
      "name": "Block",
      "weight": 0.095673144
    },
    {
      "name": "comprehensive financial analysis",
      "weight": 0.07473509
    },
    {
      "name": "growth inflection",
      "weight": 0.07421869
    },
    {
      "name": "solid financial health",
      "weight": 0.074065976
    },
    {
      "name": "accelerating growth",
      "weight": 0.07265818
    },
    {
      "name": "financial updates",
      "weight": 0.07162532
    },
    {
      "name": "exceptional financial strength",
      "weight": 0.07063596
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.984375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97900390625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96533203125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.33544921875
    }
  ],
  "sentiment": {
    "positive": 0.78206855,
    "negative": 0.051987585,
    "neutral": 0.16594385
  },
  "summary": "Keefe, Bruyette & Woods (KBW) has reiterated its Outperform rating and $95.00 price target on Block Inc. (NYSE:), citing expectations for growth inflection across both of the company's business segments. The firm believes there is \"solid potential for upside\" to second-half expectations if the macroeconomic environment remains stable. KBW also highlighted the potential for a potential catalyst for the stock, suggesting that the upcoming November investor day could offer a compelling growth narrative for 2026 and beyond that could further bolster the company’s valuation. The company, formerly known as Square, operates in two main business segments: its seller ecosystem for merchants and its Cash App personal financial services platform.",
  "shortSummary": "Keefe, Bruyette & Woods reiterated its Outperform rating for Block Inc. (NYSE) citing growth expectations across its two main business segments, citing strong financial health and strategic focus.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ad7056b15a114abbb616aee2afc82d22",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Keefe, Bruyette & Woods (KBW) has maintained an Outperform rating and a $95 price target for Block Inc., citing strong growth potential in both its business segments. The firm anticipates a positive growth inflection and highlights Block's upcoming investor day as a potential catalyst for further valuation support. Recent financial results show a 14% increase in gross profit, driven by the lending business, while other analysts have adjusted their price targets, reflecting varying investor sentiment.",
  "argos_id": "4M4LIWXTC"
}