{
  "url": "https://www.investing.com/news/company-news/sharplink-gaming-authorizes-15-billion-stock-repurchase-program-93CH-4206742",
  "authorsByline": "",
  "articleId": "057c4c6414f8423aa3293b0f58e67ba9",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T12:06:54+00:00",
  "addDate": "2025-08-22T12:13:33.606843+00:00",
  "refreshDate": "2025-08-22T12:13:33.606845+00:00",
  "score": 1.0,
  "title": "SharpLink Gaming authorizes $1.5 billion stock repurchase program By Investing",
  "description": "SharpLink Gaming authorizes $1.5 billion stock repurchase program",
  "content": "MINNEAPOLIS - SharpLink Gaming, Inc. (Nasdaq:SBET), currently valued at $2.51 billion with shares trading at $18.04, announced Friday that its Board of Directors has authorized a stock repurchase program of up to $1.5 billion of the company’s common stock. According to InvestingPro analysis, the stock has shown remarkable momentum with a 237% gain over the past six months.\n\nThe program is designed to provide the company with flexibility to repurchase shares when the stock trades at or below the net asset value (NAV) of its Ether (ETH) holdings, according to the company’s statement. InvestingPro data shows the company maintains strong liquidity with a current ratio of 6.83, though its overall financial health score indicates potential risks.\n\n\"Should there exist periods where our stock trades at or below the net asset value of our ETH holdings, it would be dilutive on an ETH per share basis to issue new equity through our capital raising efforts,\" said Joseph Chalom, Co-Chief Executive Officer of SharpLink.\n\nThe company stated that repurchases may be made through open market purchases, privately negotiated transactions or other means permitted under applicable securities laws. The timing and amount of repurchases will depend on market conditions, share price, trading volume and other factors.\n\nSharpLink, which describes itself as one of the world’s largest publicly traded companies to adopt Ether as its primary treasury reserve asset, is not obligated to repurchase any specific number of shares, and the program may be suspended or discontinued at any time.\n\nThe company noted that the stock buyback program aims to provide enhanced support to the market, optimize capital allocation and reinforce its long-term commitment to driving stockholder value.\n\nBased on information from the press release, SharpLink Gaming focuses on online gaming solutions and maintains Ethereum cryptocurrency as a significant treasury asset. For deeper insights into SBET’s valuation and financial metrics, investors can access the comprehensive Pro Research Report, available exclusively on InvestingPro, which covers over 1,400 US stocks with detailed analysis and actionable intelligence.\n\nIn other recent news, SharpLink Gaming reported a significant decline in revenue for the second quarter of 2025, with figures dropping to $700,000 from $1,000,000 a year earlier. The company also posted a substantial net loss of $103.4 million, largely attributed to non-cash accounting impairments and stock-based compensation. Additionally, SharpLink Gaming increased its Ether (ETH) holdings by purchasing 143,593 ETH, bringing its total to 740,760. The company paid an average purchase price of $4,648 per ETH during this period. To support its activities, SharpLink raised $146.5 million through its At-the-Market facility and secured an additional $390 million from a registered direct offering. These financial maneuvers reflect the company’s ongoing efforts to bolster its balance sheet. Despite the revenue decline, these developments indicate SharpLink’s strategic focus on cryptocurrency holdings and capital raising.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/pro/SBET"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "SharpLink Gaming",
      "weight": 0.08962527
    },
    {
      "name": "SharpLink",
      "weight": 0.074953966
    },
    {
      "name": "share price",
      "weight": 0.072499834
    },
    {
      "name": "open market purchases",
      "weight": 0.07030616
    },
    {
      "name": "cryptocurrency holdings",
      "weight": 0.06557021
    },
    {
      "name": "share",
      "weight": 0.0647813
    },
    {
      "name": "shares",
      "weight": 0.0647813
    },
    {
      "name": "market conditions",
      "weight": 0.064629994
    },
    {
      "name": "non-cash accounting impairments",
      "weight": 0.05898069
    },
    {
      "name": "capital raising",
      "weight": 0.05871958
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96337890625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9384765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93408203125
    }
  ],
  "sentiment": {
    "positive": 0.09595668,
    "negative": 0.6667221,
    "neutral": 0.23732118
  },
  "summary": "SharpLink Gaming, Inc. (Nasdaq:SBET), a company currently valued at $2.51 billion and shares trading at $18.04, has announced a stock repurchase program of up to $1.5 billion of its common stock. The program allows the company to repurchase shares when the stock trades at or below the net asset value (NAV) of its Ether (ETH) holdings. The repurchases may be made through open market purchases, privately negotiated transactions, or other means permitted under applicable securities laws. The timing and amount of repurchased shares will depend on market conditions, share price, trading volume, and other factors. Despite a significant decline in revenue for the second quarter of 2025, SharpLink reported a significant net loss of $103.4 million, largely attributed to non-cash accounting impairments and stock-based compensation. The company increased its Ether holdings by purchasing 143,593 ETH, bringing its total to 740,760.",
  "shortSummary": "SharpLink Gaming, Inc. has announced a $1.5 billion stock repurchase program, flexibility to repurchase shares if trading below net asset value, despite a significant decline in revenue.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "887f383506d54fe796cdf06d35a1c0da",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "SharpLink Gaming, Inc. has authorized a stock repurchase program of up to $1.5 billion as its shares trade at $18.04, reflecting a 237% gain over the past six months. The program aims to provide flexibility for repurchases when stock prices are at or below the net asset value of its Ether holdings. Despite a revenue decline to $700,000 and a net loss of $103.4 million in Q2 2025, the company has increased its Ether holdings and raised significant capital to strengthen its balance sheet.",
  "argos_id": "4NZZMO0XX"
}