{
  "url": "https://www.morningstar.com/news/marketwatch/20250822168/target-is-getting-crushed-by-walmart-here-are-the-reasons-why",
  "authorsByline": "",
  "articleId": "eb3ef31e3cff434ba653eac1b3335f75",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T06:56:00-05:00",
  "addDate": "2025-08-22T12:13:33.594737+00:00",
  "refreshDate": "2025-08-22T12:13:33.594741+00:00",
  "score": 1.0,
  "title": "Target is getting crushed by Walmart. Here are the reasons why.",
  "description": "",
  "content": "'Target retrained their customers to wait for a sale,' an analyst says\n\nShares of Target and Walmart have diverged over the past three years.\n\nIn the latter half of 2022, even as a spike in prices spurred a consumer exodus toward essentials, shares of big-box chains Walmart Inc. and Target Corp. were both moving along a similar path.\n\nBut a year later, the gap between the two had widened. Walmart's (WMT) stock took off; Target's (TGT) remained cellar-bound. A year after that, the gap continued to grow. As of Thursday's close, shares of Walmart were up 114% over the past three years, while those of Target have slid 42%.\n\nFollowing their most recent quarterly earnings this week, analysts pointed to a variety of reasons for that gulf - from the practical and financial to the existential.\n\nFor one, shoppers have made a massive flight to lower prices, which Walmart has more of, as low- and high-income consumers alike protect their pocketbooks. Walmart's size and cash also give it the advantage in handling e-commerce deliveries more quickly and ensuring that things people want are on the shelves.\n\n\"The biggest reason that Target has not been [able] to compete with Walmart is due to pricing,\" David Wagner, head of equities at Aptus Capital Advisors, told MarketWatch by email. \"We've seen multiple third-party studies showing that a similar basket at Target costs 12-15% more than the same basket at Walmart.\"\n\nHe added: \"At the end of the day, customers focus on consistency of receiving products, especially in the new world of Amazon, alongside being price-cognizant.\"\n\nThen, there are bigger questions about whether Target - which over the years has gotten by on livening up the big-box retail universe with \"Tarjay\" aesthetics - truly knows what it is in an expanding era of online delivery and convenience.\n\n\"I think for a long time - 30, 40 years - Target was doing their very best not to be Kmart,\" Brian Mulberry, senior portfolio manager at Zacks, said in an interview, adding that the chain tried to avoid blue-light specials, and wanted to be seen as an \"upgraded\" retailer where shoppers could find stylish clothing and home decor at a decent price.\n\n\"I think they have a clear idea of who they want to be,\" he said. \"They're just having a really hard time executing on that.\"\n\nHe said that Target's more recent problems went back to the pandemic. Lockdowns, concerns about the economy, and 2021's supply-chain crunch that backed up ports and warehouses left businesses with either too much product on hand, or too little, or product that wasn't arriving at the right time. Then, in 2022, Russia invaded Ukraine. Both nations grow much of the world's crops - and prices for food and energy jumped.\n\nAs they did, consumers began prioritizing the bare-bones basics, such as groceries, which comprise a majority of Walmart's sales. Meanwhile, other items, such as clothing, electronics and furniture, sat around longer on store shelves. Against this backdrop, Target, Mulberry said, had a choice: They could liquidate the stuff people weren't buying or hold on to it until it was seasonally appropriate.\n\nWalmart held on to its seasonal goods, he said. Target, he said, got caught up in the moment. And while he said it wasn't the company's fault at that time, it decided to slash prices. In the process, Target changed its customers' behavior.\n\n\"Target retrained their customers to wait for a sale,\" he said.\n\nAs U.S. tariffs blanket the global economy and threaten to make imports - and prices for consumers - more expensive, Target has again found itself at a disadvantage to Walmart. Brian Cornell, Target's outgoing chief executive, said Wednesday that the company was \"one of the largest importers in the country.\" Walmart, by contrast, has said that more than two-thirds of what it sells in the U.S. is made in the nation.\n\nDuring the second quarter, Walmart's U.S. same-store sales - a gauge of performance at older stores - rose 4.6%, helped by its grocery business and demand for health and wellness products. Target's same-store sales, by contrast, fell 1.9% during that period.\n\nStill, neither company was exactly treated kindly by investors this week following their quarterly results. Walmart is grappling with higher expectations. Target's move to bring in a new chief executive, starting in February, failed to convince Wall Street it was doing enough to address falling sales.\n\nMeanwhile, since May, according to FactSet data, the number of Wall Street analysts who follow Target that put \"sell\" ratings or the equivalent on the stock - a rarity for most stocks in general - has crept higher. The share of analyst ratings on Target that are \"sell\" or \"underweight\" stood at 16% as of this month.\n\nMichael Fiddelke, Target's incoming chief executive, said Wednesday that the company planned to take steps to rediscover its sense of style. But BMO analyst Kelly Bania, in a research note, said that \"convenience, selection and speed have rapidly evolved and redefined the competitive landscape.\"\n\nOther observers, in emailed commentary, have been harsher. Jonathan Lazarow, a founding partner of the law firm Ambrose Lazarow and a onetime investor and adviser in retailers, said Target feels like a \"slightly brighter and slightly less-depressing Walmart or Kohl's,\" adding that Fiddelke might have a shorter leash to work with. Jamie Meyers, senior analyst at Laffer Tengler Investments, said that Target appeared to be suffering from \"something of an identity crisis.\"\n\n\"It's unclear what they represent as they're not an office retailer, a low-budget chain, a dollar store or a direct competitor to Walmart or Amazon,\" Meyers said on Wednesday.\n\nHe said that Target still lacks the scale of Walmart and Amazon, and doesn't have the same bargaining power. While he said Target's digital business has shown some improvement, he said it didn't have the cash flow to match that of Walmart's own e-commerce operations.\n\n\"Even Walmart's e-commerce segment only just became slightly profitable last quarter, so Target still has a long way to go,\" he said.\n\nAnd as Target banks on style, Bryan Hayes, another strategist at Zacks, told MarketWatch that stores were sometimes disorganized. Thanks to tariffs and squeezed supply chains, items have sometimes been out of stock. He also noted that it faced consumer backlash after it retreated from its diversity goals.\n\nAlong the way, he said, it seemed to have lost sight of one of the golden rules of retail: \"Know your customer.\"\n\nThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Target",
      "weight": 0.08825406
    },
    {
      "name": "Target Corp.",
      "weight": 0.08599739
    },
    {
      "name": "Walmart",
      "weight": 0.07352788
    },
    {
      "name": "Walmart Inc.",
      "weight": 0.07244319
    },
    {
      "name": "Wall Street analysts",
      "weight": 0.060006995
    },
    {
      "name": "lower prices",
      "weight": 0.056339588
    },
    {
      "name": "Targets incoming chief executive",
      "weight": 0.05295933
    },
    {
      "name": "Targets outgoing chief executive",
      "weight": 0.052937064
    },
    {
      "name": "senior analyst",
      "weight": 0.052366987
    },
    {
      "name": "squeezed supply chains",
      "weight": 0.05186059
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.990234375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.89599609375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.857421875
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.8271484375
    },
    {
      "name": "/Food & Drink/Food & Grocery Retailers/Other",
      "score": 0.315185546875
    }
  ],
  "sentiment": {
    "positive": 0.40063798,
    "negative": 0.26877868,
    "neutral": 0.33058327
  },
  "summary": "Shares between Target and Walmart have significantly diverged over the past three years, with shares of Walmart up 114% over the period. However, the gap widened a year later, with Walmart's stock taking off and Target's remained cellar-bound. Analysts attribute this disparity to a shift in consumer preferences towards essentials, while Walmart's size and cash gives it an advantage in handling e-commerce deliveries more quickly and ensuring that things people want are on the shelves. The biggest reason for this disparity is due to pricing, with multiple third-party studies showing that a similar basket at Target costs 12-15% more than the same basket at Walmart. Concerns about Target's ability to compete with Walmart in an expanding era of online delivery and convenience are also being raised.",
  "shortSummary": "Walmart's shares surged over the past three years due to rising prices, while Target's shares stagnate due to strategic strategic retracing and economic challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c99431912a004c3e91bf56e893cc2eaa",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Target's stock has significantly underperformed compared to Walmart's over the past three years, with analysts attributing this to Target's higher prices and inability to compete effectively in the evolving retail landscape. Target's decision to discount excess inventory during the pandemic retrained customers to wait for sales, further impacting its sales performance. As Walmart benefits from a strong grocery business and a more efficient supply chain, Target faces challenges in redefining its identity and improving its operational execution.",
  "argos_id": "5QXD948RI"
}