{
  "url": "https://www.scmp.com/news/hong-kong/education/article/3322770/hong-kong-lawmakers-urge-more-teacher-training-spot-serious-child-abuse-cases",
  "authorsByline": "Ambrose Li",
  "articleId": "9aca9c078c2c42189b139323b4cfffe7",
  "source": {
    "domain": "scmp.com",
    "paywall": true,
    "location": {
      "country": "cn",
      "city": "Hong Kong Island",
      "coordinates": {
        "lat": 22.2805108,
        "lon": 114.1855595
      }
    }
  },
  "imageUrl": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/08/22/02eef8a5-0a41-41f1-8b88-82e34885785a_73b92551.jpg?itok=KdK4tXmE&v=1755843792",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T14:23:14+08:00",
  "addDate": "2025-08-22T06:33:51.178823+00:00",
  "refreshDate": "2025-08-22T06:33:51.178826+00:00",
  "score": 1.0,
  "title": "Hong Kong lawmakers urge more teacher training to spot serious child abuse cases",
  "description": "Legislators call for professional training as education authorities issue updated guidelines that mandate reporting of suspected incidents.",
  "content": "Teachers should be given more training to identify serious child abuse cases, Hong Kong lawmakers and a school representative have urged, after education authorities updated guidelines that mandate reporting of suspected incidents from next year.\n\nAccording to an Education Bureau circular issued on Wednesday, educators, social workers, therapists and psychologists working in Hong Kong schools must make a report if they suspect that a child is suffering serious harm. The policy will come into effect in January next year.\n\nThe circular maps out procedures to handle suspected cases of child abuse, including incidents of domestic violence, as failure to make a report would constitute a criminal offence under a new law passed by the Legislative Council last year.\n\nChoi Lai-fong, vice-chairwoman of the Hong Kong Federation of Education Workers and a private kindergarten principal, said that it was not easy for school staff to assess the severity of abuse cases, as they were not medical professionals.\n\n“For example, mental health issues might not be easily detected, but the child might already be in a serious situation of abuse,” she said on a radio programme on Friday.\n\n“We must be careful within the industry. In this case, it’s hard to say realistically how we will operate. It’s important to provide training for our staff.”",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "serious child abuse cases",
      "weight": 0.1288706
    },
    {
      "name": "Hong Kong schools",
      "weight": 0.11557308
    },
    {
      "name": "child abuse",
      "weight": 0.11400377
    },
    {
      "name": "Hong Kong lawmakers",
      "weight": 0.108607166
    },
    {
      "name": "abuse cases",
      "weight": 0.106657386
    },
    {
      "name": "Hong Kong",
      "weight": 0.105524875
    },
    {
      "name": "suspected cases",
      "weight": 0.098940544
    },
    {
      "name": "suspected incidents",
      "weight": 0.09004106
    },
    {
      "name": "more teacher training",
      "weight": 0.0878434
    },
    {
      "name": "school staff",
      "weight": 0.0856078
    }
  ],
  "topics": [
    {
      "name": "Academia"
    },
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.94970703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8525390625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.64501953125
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.427978515625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.39599609375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.39111328125
    },
    {
      "name": "/Jobs & Education/Education/Other",
      "score": 0.372802734375
    }
  ],
  "sentiment": {
    "positive": 0.059628718,
    "negative": 0.65659225,
    "neutral": 0.28377908
  },
  "summary": "Hong Kong lawmakers and a school representative have urged teachers to be given more training to identify serious child abuse cases. This comes after the Education Bureau updated its guidelines for reporting suspected incidents to ensure that teachers, social workers, therapists and psychologists working in schools must make a report if they suspect a child is at risk of serious harm. The new law, passed by the Legislative Council last year, mandates that failure to report suspected incidents would constitute a criminal offence.",
  "shortSummary": "Hong Kong lawmakers and a school representative urge more training for teachers to detect serious child abuse cases, as new regulations mandate mandatory reporting from January 2018.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "96078b8bce314f19ad0e31231945cee9",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Hong Kong lawmakers and educators are advocating for increased training for teachers to better identify serious child abuse cases, following updated guidelines that require mandatory reporting of suspected incidents starting January next year. The new policy, outlined in an Education Bureau circular, mandates that educators and related professionals report any suspicions of serious harm to children, with failure to do so resulting in criminal charges. Concerns have been raised about the challenges school staff face in assessing abuse severity, highlighting the need for proper training.",
  "argos_id": "6ERZ4AK74"
}