{
  "url": "https://www.wired.com/story/best-rei-labor-day-sale-deals-2025/",
  "authorsByline": "Scott Gilbertson",
  "articleId": "59305ab209164a668268c8eab01c3f62",
  "source": {
    "domain": "wired.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://media.wired.com/photos/68a66e69d3699f0e9647c9e6/191:100/w_1280,c_limit/The%20Best%20Deals%20From%20REI%E2%80%99s%202025%20Labor%20Day%20Sale.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T08:30:00-04:00",
  "addDate": "2025-08-22T12:37:11.769163+00:00",
  "refreshDate": "2025-08-22T12:37:11.769165+00:00",
  "score": 1.0,
  "title": "The Best Deals From REI’s 2025 Labor Day Sale",
  "description": "Shop these end-of-summer deals on REI, Nemo, MSR, Coleman, Fjällräven, and other outdoor brands.",
  "content": "Isn't amazing how fast summer goes by? The kids are back in school, and it's time for the annual REI Labor Day Sale. This year’s event kicks off today, August 22, and ends on Labor Day, September 2. Many items are up to 30 percent off, and REI Co-op members save 20 percent on any REI Outlet item. To get the member discount, add the promo code SAVEOUTLET at checkout.\n\nWe've rounded up the best deals on all our favorite tents, backpacks, sleeping bags, pads, cookware, outdoor apparel and more. We've also pulled in deals from competing sales at Public Lands, Backcountry, and cottage industry retailers.\n• The best value backpacking tent: REI Co-op Half Dome 2 Tent With Footprint for $224 ($75 off)\n• The puffer jacket you can wear anywhere: Patagonia Nano Puff Insulated Jacket for $167 ($73 off)\n• A great ultralight sleeping quilt: REI Co-op Magma 30 Down Trail Quilt for $247 ($82 off)\n• The best family camping tent: REI Co-op Base Camp 6 Tent for $412 ($137 off)\n• For the cushiest backcountry sleep: Therm-a-rest NeoLoft Sleeping Pad for $179 ($61 off)\n• Our favorite canister stove for backpacking: MSR PocketRocket 2 Stove for $44 ($16 off)\n\nREI tents are some of the best deals around, even more so during sales. If you'd like to learn more, see our guide to the best backpacking tents and best car camping tents.\n\nREI's Base Camp tent is WIRED's favorite car camping tent. It's extremely well designed and proved plenty weatherproof in our testing. The traditional dome tent design, with two crossed poles and two side poles holds up well in wind and the tent floor is high-quality 150-denier (150D) polyester. There's loads of storage pockets, double doors, great vents, and huge windows, making it comfortable even in summer heat.\n\nThe Wonderland 6 is REI's replacement for the Kingdom 6 and looks to be, for the most part, very similar. We haven't tested this one, but my almost 20-year-old Kingdom 6 is still going strong. For the most part, it's made of the very same ripstop nylon used in the Wonderland. With plenty of mesh, this will have better ventilation than the Base Camp above, but the rainfly doesn't come as low and the hoop design isn't quite a strong. For summer camping though, this is a great option.\n\nThe REI Half Dome 2 is the best budget 2-person backpacking tent. We’ve toted it on many a backpacking trip and found it to be plenty sturdy, quick to set up, and capable of fitting two people and their gear. It even comes with a footprint (which I never bother with, but it's nice to have it if you have to deal with prickers or pointy rocks). I really like the color options this year too, which blend in with its surroundings rather than stand out.\n\nBe sure to read through our guide to day hiking packs. While we haven't published our guide to ultralight backpacks yet, several of our picks are on sale right now and noted below.\n\nI just started testing this pack this summer as part of an upcoming ultralight backpack guide. It's very comfortable, carrying a 25 pound load without issue. I haven't lived out of it for more than a night yet, but so far I like it and it's very reasonably priced. Interestingly, there's a comment on REI saying that you're better off going with the Flash 55 and just removing the top lid to save some weight. That'll save you some cash right now, as the Flash 55 is also on sale for $150.\n\nREI's Flash 22 pack is a bargain that's hard to beat. The 22L capacity is just about perfect for day hiking, and there's plenty of pockets to organize your gear. The side pockets are big enough to hold Nalgene-size water bottles, and there's a laptop-compatible hydration sleeve, meaning it can double as an everyday carry pack as well.\n\nI've always seen the Trail 25 as REI's answer to the Mystery Ranch Rip Ruck packs. The access is similar, capacity about the same, and both make great hiking and every day carry packs. REI Co-op's Trail 25 just happens to be half the price when it's on sale.\n\nWhether you need a cheap car camping bag, or something more robust for Fall and Spring trips, we've got you covered. Be sure to read our best sleeping bags guide for even more options.\n\nREI's Magma line of down gear are some to the best deals around. The Magma 15 sleeping bag has long been an affordable sleeping bag that's perfect for shoulder season trips when the temp potentially swing lower than you're expecting (the comfort rating is 21F). There's three lengths and three widths, making it easy to get something that's perfect for your body, and the 850-fill-power goose down (bluesign-approved) packs down nice and small. If you don't need the shoulder season coverage the Magma 30 is also on sale for $262 ($87 off), and makes a great summer sleeping bag.\n\nI've just started testing this as a budget option for ultralight quilts. So far, I've been impressed. Like the sleeping bag version above, this is 95 percent of what you get from far more expensive bags. It's light (20.3 oz. for the medium), packs down small, includes straps to keep it on your sleeping pad, can be completely unzipped and used like a comforter, or snapped up in a proper footbox on colder nights.\n\nThe Boost is a hybrid bag that would work for backpacking, but can also be adjusted to a semi-retangular shape to make it more comfortable for car camping. There are arm holes, which makes reading in it a bit easier, and you can reach out to open or close the \"WarmZip\" center zipper which cinches down the Boost to make it more like a traditional mummy bag.\n\nThe “mummy” design of mummy bags is about optimizing for warmth, not comfort. But let's face it—most of us are not sleeping in situations where our survival is at stake. Therm-a-Rest has addressed this with what it calls W.A.R.M. fit, which stands for “with additional room for multiple” positions. Indeed, this bag is very roomy for a mummy design. I was able to draw my legs up when side-sleeping and spread out considerably more than with most bags. If you toss and turn through the nights, and don't want a quilt-style bag, this would be my top pick.\n\nThe Siesta is our favorite sleeping bag for car camping. You really shouldn't need to spend a lot of money on a sleeping bag for car camping. Should your best efforts to cocoon warmth around you fail, there is, after all, a car to retreat to. That's why we love the REI Siesta Hooded 20—it's plenty warm and affordable. The Siesta's rectangular cut makes it a roomier, more comfortable bag and the 20-degree rating makes it enough for three-season trips, and unlike most rectangular bags, the Siesta has a hood, which helps on those cold nights. We also like that you can zip two Siestas together.\n\nGood sleep in the backcountry can be frustratingly elusive, but one good place to start is with a quality sleeping pad. Whether you're looking for the ultimate ultralight, ultraminimal packing packing pad, or a nice plush 4-inch thick car camping behemoth, there's deals on both right now.\n\nThe NeoLoft is on the heavy side for someone who is mostly on the ultralight bandwagon, but I can't seem to leave this pad at home. It's just too comfortable. I've ended up carrying it on every trip I took this summer. It does weigh 25 ounces, but it packs down respectably small (about an inch thicker and taller than a Nalgene water bottle), and inflates to a massive 4.6-inch cushy pad that looks more like a luxury car camping pad than something for the backcountry. I highly recommended it.\n\nThis is our favorite all-around backpacking sleeping pad, the Tensor All-Season hits all the sweet spots. It weighs an acceptably light 18.2 ounces, provides a good 3-inches of padding, and has an R rating of 5.4. That works out to the best padding and R-rating for the weight. It's also mercifully quiet—none of that annoying crunching noise every time you roll over.\n\nIf you're gearing up for a winter trips, this is a good deal on a great winter sleeping pad. The Tensor Extreme Conditions has the highest R-value of any pad we've tested, yet somehow manages to pack down to about the size of a Nalgene water bottle and weight just 21 oz. (587 g). It's one thing to claim an R-value in lab tests though—a sub-zero night on the snow in a Wisconsin winter was the real test. This pad performed extremely well. Paired with a Z-Rest (see below) and a -10F sleeping bag, it kept me toasty down to 4 degrees Fahrenheit.\n\nThe Z-Lite Sol weighs next to nothing (10 ounces for the small), folds up small enough to lash to the outside of any pack, and can double as a chair, extra padding on cold nights, table, you name it. I am too old and too soft to be the sort of ultra-minimalist who gets by with just a Z-Lite for sleeping, but I still have one around on almost every backpacking trip I take.\n\nThe big fat camping pad that started the trend of big fat camping pads, the Megamat is a revelation. Trust me, you have no idea how comfortable tent camping can be until you sleep on a Megamat (or a MondoKing, see below). The 4-inch thick Exped MegaMat is soft and surprisingly firm thanks to the closed cell foam inside it, which relieves pressure and feels about as close to to the mattress in your bedroom as you're going to get in the woods.\n\nWhen I sold my Jeep I had to give up some of my overlanding dreams, but this Megamat, which cuts in to fit around the wheel wells of an SUV, has brought some of them back to life. I throw this in the back of my wife's Rav4, and, while it's not a perfect fit (check Exped to see which vehicles are supported), it's close enough that I can get a good night's sleep in the car.\n\nIf you get a Megamat, get this pump to go with it. I love this pump not so much for the inflating (though that is nice too, it speeds things up), but for the deflating. You can get all the air out and the mattress back in its stuff sack in no time with this thing. It's well worth the money, especially on sale.\n\nREI sales are the time to grab this upgrade stove. Sure, the basic version below gets the job done, but the cast iron burners of the Cascade are so much nicer and more durable. The griddle plate is also handy, perfect for cranking out pancakes. My only gripe is that I wish there were an option to get two griddles as I find the grill not nearly as useful.\n\nWalk around any campground in America and you'll likely see dozens of these, for good reason. They're easy to use, last a long time, and aren't all that expensive. The 10,000 BTU burners are plenty to cook on just about any pan you have (I use cast iron pans on mine) and the electronic ignition means you don't have to keep track of a lighter.\n\nThe MSR PocketRocket 2 is our top pick isopro backpacking stove for most people. It's lightweight (2.6 ounces), but has wide enough arms to support just about any one or two person pot. It's simple to use, even while wearing gloves, and it's efficient—at sea level (OK, technically 947 feet), it boiled 1L of water in 3 minutes 47 seconds. You can even get it simmer, though the flame radius is small so fancier cooking isn't easy. See our next pick if that's your goal.\n\nIf you want to cook in the backcountry, like legitimately cook with ingredients, not rehydrating food, the best stove I've tested is the Firebox Nano with the gas burner and diffusion plate. The Firebox Nano is a twig stove, so you have that option as well (I am fortunate to live somewhere I can use this feature), but with summer burn bans in many places, it's really the gas burner and diffusion plate that are the centerpiece here. Together, they spread out the flame enough that cooking on a 10-inch pan is pretty much like cooking on my stove at home. This is a nearly miraculous achievement for a stove setup this small and light (8 ounces).\n\nThis is a backpacking must-have for me. It turns cleanup from a tedious chore to a couple of seconds’ work. I've even perfected cleaning burnt pans with it: Boil water in the pan to loosen the burnt bits and scrape them out. It's not a massive savings, but you might as well grab one while it's a couple bucks cheaper.\n\nIf you want to bring a chair backpacking, this is one to get. It's just about the lightest on the market at 18 ounces, and it packs down nice and small. Nemo also solved the main problem with all pole chairs, backpacing or otherwise: the included base pad keeps it from sinking in soft ground.\n\nREI brand's basic proposition is that it'll get you 90 percent of the designer item, for 70 percent of the price. It's a strategy that works quite well and has generated some really great, affordable gear. This chair is a good example of that. It's not as nice as the Nemo above, but it's still comfortable (it does wobble a little, side to side when you move) and nearly half the price.\n\nPatagonia;s Nano Puff series has been a hit since it launched years ago. If you want a technical midlayer that you can also wear around town, this is the jacket to get. The fill is synthetic, but it's impressively warm and manages to stuff down almost like a down jacket.\n\nREI's Sahara sun hoodie offers UPF 50+ fabric (a polyester and spandex blend) to protect you from that high altitude sun (or any sun). It's soft and stretchy so you have a good range of movement, and there are thumbholes in the sleeves to keep them from riding up and exposing your arms. The 3-panel hood has a drawstring you can use the cinch it down and keep your neck covered as well.\n\nThe best budget rain jacket you can buy, REI's Rainier Jacket is impressively waterproof and reasonably long lasting for $70. The durable water-repellent (DWR) is PFAS-free, but still pretty good. You also get taped seams and an adjustable hood, two nice features you generally don't find in jackets this cheap.\n\nYou can't go wrong with a pair of Darn Tough merino wool socks. There's a bunch of styles and colors to choose from, but remember to go with more merino than not if you're hoping to get several days out of them. Anything over 30 percent nylon starts to smell quickly in my testing.\n\nThe awesome wool shirt from Fjällräven is about as northwoods as it gets. It's also nice and warm and soft, at least on the inside, my kids do not like the outside.",
  "medium": "Article",
  "links": [
    "https://www.wired.com/story/best-rain-jackets/#six",
    "https://cna.st/affiliate-link/3Hvxm9czoAnBvvRjF7syFgYML2fHRA23k69Agt6FGeNX8zr9xcnaErXoiN5h2qQ2syeXz4iEqGRroNR5i5fktPtwPrN264iqvxBz7E3QwoFbsDWffLzTdc6KqvAdRnsGT8ZXz5bVUjqfpzB6Vke4KfcymZJwmi6FXzx3zQS",
    "https://www.wired.com/gallery/best-day-hiking-backpacks/",
    "https://www.wired.com/story/the-best-sleeping-bags-for-every-adventure/",
    "https://www.wired.com/story/the-best-sleeping-bags-for-every-adventure/#bestcar",
    "https://cna.st/affiliate-link/C5BN9bLtpHgEjQNavwU3Sar1PJHUJrsxCG33V3oF8FaiLBK2Tc2GDNWKJGX6cntQfwjdks3AhvY1A3P4ZXymDNyFM1VchHvx9UVv7YtsgzRnZtJCUqn8A3EkbXdHo4mywjVW3hFrabuwUi6Ak7B8cRDD1gjMnbU4WDkT8XbXVtVyebt5ujx6Bdk",
    "https://cna.st/affiliate-link/PEbHSas7Jt1aagdy8ERaZ1LqYJZTGPM1fPFbSiuDtF4g9yCQzaxGP8HftHh5F3jRS5pBvGjaanvHgB8rtn9yzpuykVxbBgLf4oFSE1rcM89i62PDaYdxAmrA3guy9QFgDWTjbDxG3qsB2bQhQDgTX9efHb5uaeBHgutWGBYGkM63m1er",
    "https://cna.st/affiliate-link/FzrGcxRntjxTCUypVpMxF4THKJkDgVkKnknMUy3JQzvK68MqFvm8XiVYFbij3tnsYKcNJrDFCvweWmpY5Ysxeb9mruTpE9SjfcLM6wiYgusKoAggoLMSeD3hwghMv5XzskYdLqDArumwCGPfrnw1oAnTTp7hd8gmoPtKngk1vcXL",
    "https://www.wired.com/gallery/the-best-backpacking-tents/",
    "https://www.wired.com/gallery/best-camping-tents/#687e4d217620ac6563eee04a",
    "https://www.rei.com/product/227953/rei-co-op-flash-22-pack",
    "https://cna.st/affiliate-link/8UAFzxJzvSuamCvvVv22vzFTTKWx4UwHLWmso3mZYQTTdb3FVfGXNs1THRYeatPFJ6142U7sUM3J2D5mSWMAtqgVrxci1ugh2oGeBE9xWF7CMkwbh6W1a8Q3jhXTwHAQUZmj5hYVTdomDQvSBy2wG5kVXCivuYQGCMF7W6eMB4e6798iXrA",
    "https://cna.st/affiliate-link/2h8zKZvUAqv9ZDfxAivFV6GWZFAWEvudKvRDR2XwVsB5Dpb3NuArvtfAadNfsj14EqiFHC8SwE9gCbujhDYJeaEUphuRjRnMVqNBW3CsaGQyXmUQkWiehxeCXNdzXV5sFZ1YRBjBeRGYLB1AFXrB3i3ebk14gG2GzDi7oziDx6MVFgH13G",
    "https://www.wired.com/gallery/best-camping-chairs/",
    "https://cna.st/affiliate-link/C5BN9bLtpHgEjQNavwU3Sar1PJHUJrsxCG33V3oF8FaiLBK2Tc2GDNWKJGX6cntQfwjdks3AhvY1A3P4ZXymDNyFJRvuGnySFpfiKE9gqDNM34myS7FeYd7Jew86LNh3yZM6SxMtKieZ8bVq8qFKLKheNxpKL1J3SLDbFareMvggr2X1x3JLCxi",
    "https://www.wired.com/gallery/best-day-hiking-backpacks/#62ab510ac5ef5252e5286616",
    "https://cna.st/affiliate-link/FzrGcxRntjxTCUypVpMxF4THKJkDgVkKnknMUy3JQzvK68MqFvm8XiVYFbij3tnsYKcNJrDFCvweWmpY5Ysxeb9WZifs4sHjHqHbmPS7vyVYNKA3yzy6mS4UQWyBNjNpWeV487KJjtFq4uJc8txd5s6LSzJ3UiwxFgFoxNcRzq2r",
    "https://www.wired.com/gallery/the-best-backpacking-tents/#60df1435e801084848fb0518",
    "https://www.wired.com/gallery/best-backpacking-sleeping-pads/",
    "https://cna.st/affiliate-link/meh9fHuiYWLipnB6KA3ZTAM4tL2kCV2nNJBmBKdgep1ggjUg9xNRSd3kyervbynQ238N4dNBeQGFWy2h537mMHY6i5UnATM7D5DKYyfUXf98pmX3hmVkftoGChAADVLmnmkmu7o4VayV9pa2uXpHJLXP5CgMs2sA66ATM85Kx",
    "https://cna.st/affiliate-link/9B6f5kDzu8NHjnuK9Cc4tKCW2RM1ai3pRjbPtswZnU9GHSaUc5HaFWgbDYB2AuiejjBhHhdzkZWG9ui1YGeUdyxGAmx2egSTWLEfxQr79MCdZnYaR1eWzKgU2NbiAXwX9fqJx3bpZEMkPA14m2hfpNuTeKveodFPppVRNabFeQ8ckVqmA8UWhrUqmNdpHaJfQn",
    "https://cna.st/affiliate-link/Bid7cpAzxp9Qt6tJTmeiHPECJXLUWKfAmK9CwvxXec9DuWJBR5zSDergkUFrHpys38PUAxMci5y12VVPMXdiNBtP99992wj5eEuKHZMNSXZeRnjsiUSeBmKwT5UjSLqNQpu3FLv5mJN1VLJoDagAaicL8n2XN2uTCjAos4Pjfqc2tRK6kpiTCSrDSvnebvu3VekqUbRTTcrEtwpi7nUb7Lj9Bt86ANexvJVGnNCTKrhAdTx",
    "https://cna.st/affiliate-link/29CLTwheRZNbkdgVneC3Uq4F11oKkyKtDvxFBQSM9rveJqdUwztHnEa8xwSDx4nhEKBxduXZojqj86JugvuEQD9v1ToTbN8Gg8XQ2az5q2xvoztdyXWd7m7EX1cfMSePumtergueM7iTs6vLfjwSi8n9cJnpH1F5iSJauqHn52Xghg",
    "https://cna.st/affiliate-link/3WVdWb4brEJ3f9vNjadwUYgehPwwDf32dY3jFWdkyvbpt1yeVENaokqnP3A5u4bksaerXD4tYU4Xa2ihjttNnPAMQAx1WxpCdc3XaX2Dy5Kz8FbcXVyroPZYw3VXUyCvrRw2gUbSBxhk7f6sKic32oVMG6SKPx3o2ddp7UqKm4odABzUE4YPHL",
    "https://www.wired.com/gallery/best-reusable-water-bottles/",
    "https://cna.st/affiliate-link/6WnbuGMnBi62tSK9b8oR7uNhrHV4j3k9iATSKivYVBSW5vrF6WM2kmYUub5NPUSzvWSpraGD1mJvFfJNVVczT22NUPya3kG1qqDd77ocrmWt3uuE5piZzupKu9T4sQemSHGyv3EXzjLJYPhsXzexocFGTUFftwL3oN9o8CmcrUreGkMF1PKtKAFXqMDqbY",
    "https://cna.st/affiliate-link/PEbHSas7Jt1aagdy8ERaZ1LqYJZTGPM1fPFbSiuDtF4g9yCQzaxGP8HftHh5F3jRS5pBvGjaanvHgB8rtn9yzpuyaJZiNuDbqmrCA85zn3Q4JpcXj5cEm2nKHStb9C8sDViDxALZGz3VsrcUdjuCkGdb6UGxZVMrF74QWUVaUZAtnTYn",
    "https://cna.st/affiliate-link/C5BN9bLtpHgEjQNavwU3Sar1PJHUJrsxCG33V3oF8FaiLBK2Tc2GDNWKJGX6cntQfwjdks3AhvY1A3P4ZXymDNyFJRvuRLR7Ux5PAR5y6ZwXoY8URfvFjo88CZ31k2Acb2qaBmnsrQQnaarbBcXAvFtXjkYVtRfw5umwqYVGgKPbiZsGw8zfHmU",
    "https://cna.st/affiliate-link/ZxssCo8SeuM627f18d1ZXHgomAjC2NJb78R5CFDgdcXnYVEvyVuX5Vj11VLgtZoC6R5EMUhKmhT88LL39aY2fosL8WcRGhHhXNjngLspV6V5gMxNX8m94gcJKkJAEWzKEWXR4yxqig8jqNMQjACJW3Spi4FcSmAhgh41pUenobzimUe8q8Bc",
    "https://cna.st/affiliate-link/63B2uvSQBPtLPauL4T9jwq7Jo4XTo5cM658qavSsx7Mmfje2MkVP4euG9uGRXNTq8VjQmhGYAvT7x6UA3DVmdfVgRE6xyYV9cKQBnHLzejZ7LKnjvUcudYR1m8SRzwN1UKiAaBnkyVQQqStiNuJdHz1NQJCvvpTDePdNtfGWkLibbwp",
    "https://cna.st/affiliate-link/ZxssCo8SeuM627f18d1ZXHgomAjC2NJb78R5CFDgdcXnYVEvyVuX5Vj11VLgtZoC6R5EMUhKmhT88LL39aY2fosKsFGRgqdASKivadoHWpZoZtcGYqFCns9MAu7Fcsf8NM2oHTeBLzKNNys3Mw4bMJEjwqxyzK1DoYVBFxa4DPsk6456Toez",
    "https://www.wired.com/gallery/overlanding-guide/",
    "https://www.wired.com/gallery/best-backpacking-sleeping-pads/#68150a759c460cecc577164b",
    "https://cna.st/affiliate-link/6WnbuGMnBi62tSK9b8oR7uNhrHV4j3k9iATSKivYVBSW5vrF6WM2kmYUub5NPUSzvWSpraGD1mJvFfJNVVczT22NUPPkzvT57cEXxZNidv7Tz4h9978FebHbZn7zhZv3EVKd6QFa7czK4pEbczLToFaKANcW6PLcGm1ekGM1B4q4iz92sNYLo5X3BFniN6",
    "https://www.wired.com/review/rei-co-op-base-camp-6-family-tent/",
    "https://cna.st/affiliate-link/PEbHSas7Jt1aagdy8ERaZ1LqYJZTGPM1fPFbSiuDtF4g9yCQzaxGP8HftHh5F3jRS5pBvGjaanvHgB8rtn9yzpuyaJZiNrsWA9pzLV6k8MWSNGZA1cT3kHVd9RtVgHWf3Ymznc5r64qr2LgBAJ915XARPHobQzMmh2Qp9cDqy6ZNskyQ",
    "https://cna.st/affiliate-link/ZxssCo8SeuM627f18d1ZXHgomAjC2NJb78R5CFDgdcXnYVEvyVuX5Vj11VLgtZoC6R5EMUhKmhT88LL39aY2formRSQFNQtmo2k6m2hmxSDaWLt9s7nkjJPg7h3foozkRCFiEZ4MdVXMJRKmBtNkiZEgTMXu3sGjVo2qTk3cHYN2yb2FPVbY",
    "https://cna.st/affiliate-link/X7niGYieCH8TiZLYHxxLe42S9zAA6fkfmDGnjqmU7CfzzxzmKXiWseLeTyoE6ysiui8URrfvyxvsqMQiw5FUWCn2TipdyoPneZ6LNf4a7vD7Q1rFfCgLcsfeiFjDJcM2tqjCnqdn1WHoHjv4f1EGCJwTtttggt5k2x1KQ",
    "https://cna.st/affiliate-link/gVLYTFHP77FHrVD2wiD1iV9aSrS1tCMVhfYiXSeG72uHKkhBGw7QELC5gBBhV2h1xAp2nZfBtnPCr38VWEZktBL6cKSHni1sswu6X22kG6i8mXGdgHCtqBdPnPgydraQHm3VDptwQVofBzBq8FcheJ3xSG86p3gJ9mDvCHzNek9cLVbqmhLHbQ4CSMPCgvrsWvb7KRqcLhaJscPtwk",
    "https://www.wired.com/gallery/best-cast-iron-pans/",
    "https://cna.st/affiliate-link/meh9fHuiYWLipnB6KA3ZTAM4tL2kCV2nNJBmBKdgep1ggjUg9xNRSd3kyervbynQ238N4dNBeQGFWy2h537mMHY6tPt8hh1AJSHDKf6HoS75DLuVfW5mGW3LVT1R7JRpCkvP28Tm1xHJJEZTmYbq1RFHVr9bR4D5Vi5SF1E74",
    "https://cna.st/affiliate-link/474N76DNT3n1ogtyPnpZ1zqRzfKZycsKJirQdhkJoxFMttdQxRxEMZXSE5ATThYLaCmmvXD81Lnv4GfJkuXuiGoxhGdUnGeJwqMb6qox4gRTKpR76EoZT8ZopBchM5yMrpNYSg2Cs7w87aPkgnQay3ycWBjG",
    "https://www.wired.com/gallery/best-camping-tents/",
    "https://cna.st/affiliate-link/8UAFzxJzvSuamCvvVv22vzFTTKWx4UwHLWmso3mZYQTTdb3FVfGXNs1THRYeatPFJ6142U7sUM3J2D5mSWMAtqgVk6x9mMuwHcUTvfHm1qeSkD6jyb5sFnBg1tv8xdnE66TuqcafJHS8ze4Lx8YEAEgZ4E3cKnpKN9GTGbexJARjRP5wTvS",
    "https://cna.st/affiliate-link/5K8RQcJwUJf9wsE6eFj8HYBgqYJrG16BMBZihsx41HZhXyMVjEYt67roM2Grb58gRdxXM2YNXrRrCFCvgGGCmotHeqoQypZuUkUhSnNNnw9iZjD67QqmX8s7GcHuLdL6KwP8FV11DDMxqDMLLiUDz32Mf6xwwmWGdyB3Ny9oHmtYCDKHqYARnwS43fCTTP2hbhAPSGPr81snqTu9iSAaW4Ke8hZrbqTrmU9Z2xW2Yhx76QiX4SN7FirRwoaQBVknrGLv823vzHDHt5Mc",
    "https://www.wired.com/review/nemo-tensor-ultralight-insulated-sleeping-pad-2024/",
    "https://cna.st/affiliate-link/C5BN9bLtpHgEjQNavwU3Sar1PJHUJrsxCG33V3oF8FaiLBK2Tc2GDNWKJGX6cntQfwjdks3AhvY1A3P4ZXymDNySLE1WREbPnysfnJxLcRrduJhPHZts2KQCE3jYisDuCZENGL8B9ESg3nyvrWX4vf79zhs5eXAT3ZqQZMSZsNBx4JWMPm3UWtz",
    "https://cna.st/affiliate-link/4Q5NDE1dgN4W3btPYT8vJEUFa9YzhfgisEzrVzZEv1tW2ANV9pXPYt67B747MbPdNbaPVy1WVz5gK5GJTrpLrkXzEcgvafH5NjkT4KpzoKRYJU3P75an368JUmSyspsmhotwBrFQQUZmuC5n9mS7AnqXVpeo96VqZty13gtBN8A",
    "https://www.wired.com/gallery/best-camping-sleeping-pads/",
    "https://cna.st/affiliate-link/HR4R9gBZvZ4obDF31Qdjn8jytFFQfWs2sztugJ47bELcE3z6Jx67NWJkpnsS3dMFDLkBJ3H8HN6gaR7Dg5xqLw8y3k1V1dtAkmzKLy12dQZFpEvv4Bt61nYrJfHhbo358aVcmokdPYuVMsdA4mVrVLfudYhY1MzV1wG93pfRX2XC4ddYWA941jA5ZWr",
    "https://cna.st/affiliate-link/RLUH3gniSGMDL2j6ufRsTUAoJXksSb7TSgjgme3KyP5ZNkgMDJXQkBbxB7QHQC9kbT8VuhGqVDtqtY8jbKNJAf5iGoJbe9q6nMaBFWAFKYFiZmYYKX7t7UiKHUCM2y5ptYJZTDmAW4regLd8kqWp1rxPe4NQa9H4GsT918WvNEeJNkjEfy7M2f9ePFCUka6",
    "https://cna.st/affiliate-link/FzrGcxRntjxTCUypVpMxF4THKJkDgVkKnknMUy3JQzvK68MqFvm8XiVYFbij3tnsYKcNJrDFCvweWmpY5YsxebB67LMHv6X4HHFmBPpyGMSUmjA2S7qm5NyuEHv5uBpvhCbQwjwvp5Xb2PfnrPkYqnNJMDgJKR8U6smTiDq1oJYS",
    "https://www.wired.com/gallery/best-backpacking-sleeping-pads/#660f0ed08a58e26788308bc0",
    "https://cna.st/affiliate-link/FzrGcxRntjxTCUypVpMxF4THKJkDgVkKnknMUy3JQzvK68MqFvm8XiVYFbij3tnsYKcNJrDFCvweWmpY5Ysxeb9moWMmF5ov92sCsY79GMatEJQf2SbbKxDnqXi9KeGfuTrdmcCk65f5riaQG9HTBKMYktW5iA9Xa39AD6fBPukN",
    "https://www.wired.com/review/thermarest-neoloft-sleeping-pad/",
    "https://cna.st/affiliate-link/9SmxdK1MtTmaoBcNx8yujtrboB2iHxuNdmLHfQKFim1sQtMYY53goS8vQEzLs6mZriedGD9dHb5wj7FMbwDbRhrA9fL76W9bqsMfMocdSJvPMJfijfP5jgqREY46S8XGSgHJuk2B1t",
    "https://fireboxstove.com/product/smallest-folding-gas-grill-kit/",
    "https://cna.st/affiliate-link/ho5L3zdaYSc5Ea5AhHfX8fca15D198KeYgjxtpshzq7YhF99UrfphuD4R43pjiYAskQx5AtP6kbrvNhq3m4XHPCVJcjJfqRAMu8JiQxMAk3NV1f3wiCv5SNG5QVMzHNVnGNqvawn26hBZQcDDDGSVo97Xp",
    "https://www.wired.com/story/the-best-sleeping-bags-for-every-adventure/#shoulderseason",
    "https://cna.st/affiliate-link/8UAFzxJzvSuamCvvVv22vzFTTKWx4UwHLWmso3mZYQTTdb3FVfGXNs1THRYeatPFHjeTtP6UGXEU7HMDc5syjW7ueiQfHuWp3cLn1sxam66ipCsvUJkh127Xa44uRAe4YWhXdw26E3QYDSD5sdfw2eC2uA6uG7qXqvXHhkjyXeCr1fuj8cz",
    "https://cna.st/affiliate-link/W9sg9CqXij8AEsJEJkwNXJwy8pRupoR6VDFBj8aE9fT9g3nPkJAF1S9edhChPbuVGp7tCHMMMSWjE3TZTfU7egbTr3Lvz9zwZoCFVqkHPiEpUirMxb8kTsap4KfdWCfztiuG8kkxUMwSi3W8xT8vS8mSMzRnfJkFYvxU5gzDauUb2qeTbrUCSmdE6jaS5xxP6wMbmN6juNsAppjfVSP6u7CUVSfCN",
    "https://cna.st/affiliate-link/3WVdWb4brEJ3f9vNjadwUYgehPwwDf32dY3jFWdkyvbpt1yeVENaokqnP3A5u4bksxuFfwPEyrHYJTNK2Us1xNHs9SHLq372M1Tw5uJLm4gJDQSQ34FwPbTYW73t4s2fvuxssmhvtu6TsRcC8CzbcFnHKb3xt7vm34RJrffHB4poP6ECWeP9TG",
    "https://cna.st/affiliate-link/ZxssCo8SeuM627f18d1ZXHgomAjC2NJb78R5CFDgdcXnYVEvyVuX5Vj11VLgtZoC6R5EMUhKmhT88LL39aY2fosL8WdbDv4A8MNgVQrJcgRoBcRum8tmjfwiZTRb2wDYMrCxKXV1CBkodX6tMn4LDE6zAgN9R83sfqp6weE77VUKpw3WujTx"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "best car camping tents",
      "weight": 0.07075545
    },
    {
      "name": "REI tents",
      "weight": 0.06447113
    },
    {
      "name": "sleeping bags",
      "weight": 0.06299126
    },
    {
      "name": "REI sales",
      "weight": 0.06290262
    },
    {
      "name": "REI Co",
      "weight": 0.059729364
    },
    {
      "name": "REI Co-op members",
      "weight": 0.059520118
    },
    {
      "name": "REI",
      "weight": 0.055845775
    },
    {
      "name": "Good sleep",
      "weight": 0.055830516
    },
    {
      "name": "big fat camping pads",
      "weight": 0.055671334
    },
    {
      "name": "most bags",
      "weight": 0.055486403
    }
  ],
  "topics": [
    {
      "name": "Holidays"
    },
    {
      "name": "Labor Day"
    },
    {
      "name": "Shopping"
    }
  ],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.75830078125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.7529296875
    },
    {
      "name": "/Shopping/Consumer Resources/Coupons & Discount Offers",
      "score": 0.67529296875
    },
    {
      "name": "/Shopping/Gifts & Special Event Items/Gifts",
      "score": 0.51904296875
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.5009765625
    }
  ],
  "sentiment": {
    "positive": 0.5096047,
    "negative": 0.07345138,
    "neutral": 0.41694388
  },
  "summary": "The annual REI Labor Day Sale, which began on August 22 and ends on Labor Day, is offering items up to 30 percent off. REI Co-op members can also save 20 percent on any REI Outlet item. To get the member discount, add the promo code SAVEOUTLET at checkout. The best value backpacking tent is REI's Half Dome 2 Tent With Footprint for $224 ($75 off). Patagonia Nano Puff Insulated Jacket is on sale for $167 ($73 off). Other notable deals include a great ultralight sleeping quilt and a canister stove for backpacking.",
  "shortSummary": "REI's annual Labor Day Sale offers excellent deals on top quality tents, backpacks, sleeping bags, and outdoor gear, including REI Co-op's best-selling outdoor gear.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1397af3ba5874f83a68cd9cecf7d01ad",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.wired.com/review/nemo-tensor-ultralight-insulated-sleeping-pad-2024/",
      "text": "Nemo Equipment’s Tensor sleeping pad was my introduction to ultralight sleeping pads. I'll confess that when I unwrapped the Tensor (I went for the insulated version) and inflated it for the first time five years ago, I immediately thought of a hiker joke I’d seen on Reddit: Inflatable sleeping pads are for people who want to sleep on the ground, just not right away.\nHow would this impossibly thin, light, seemingly fragile pad not leave me on the ground after a few nights on the trail? Fast-forward five years and that same sleeping pad has been under me for over 40 nights now, and it still hasn't left me anywhere but comfortable and well-rested. That's not to say it can't fail—many a pad has left me on the ground over the decades, but the Nemo Tensor is still going strong.\nLast fall, the company sent me review samples of its new Tensor line, which has been revamped for 2024 and consists of three pads, each with varying degrees of thickness and R-values (how much insulation the pad provides, which I explain in my Best Sleeping Pads guide), tailored to specific backcountry needs.\nThree Little Pads\nThe three pads include the Tensor Trail, which is the lightest but has the lowest R-value; the Tensor All-Season, which has an R-value of 5.4; and the Tensor Extreme Conditions, which boasts a whopping 8.5 R-value and has the highest warmth-to-weight ratio on the market.\nAll three come in four sizes: regular, regular mummy, regular wide, and long wide. Put it all together and that's 12 pads to choose from—from a single lineup from one manufacturer. This is why we have an entire guide devoted to sleeping pads to help you pick the best one for your needs.\nTwo of these pads, the Tensor Trail and Tensor All-Season, are updates. They see marginal temperature boosts, but the construction remains like previous iterations. Nemo still uses a quilt-like design that helps baffles stay inflated and eliminates that springy sensation you get with vertical baffles. The insulation consists of multiple layers of bonded mylar.\nThe difference in R-value between the Trail and All-Season comes down to how many layers of insulating metal film each pad has. The Trail uses one layer, the All-Season gets two layers, and the Extreme uses four layers of what Nemo calls Thermal Mirror insulation (a metalized film). It also uses a different baffle type (more on that below). Also new this year is the beefier fabric on the bottom of these pads. Nemo now uses 40-denier nylon on the bottom, up from 30D nylon, which makes it more durable. Take that, Reddit funny guy.\nNemo's new pads are made of Bluesign-approved nylon (Bluesign certification looks at both environmental impact and worker safety) and come with the company's Vortex pump sack, which works well to inflate your bag via the zero-profile valve. I wish there were a standard for these valves so I could use the Nemo pump sack with other pads, but there isn't. There's also a stuff sack to store your pad, with a handy repair kit in the closure flap. The Nemo lifetime warranty covers any manufacturing defects, which is nice, but for more immediate solutions to that much-feared puncture, just remember the repair kit is in the stuff bag.\nAll-Season All the Way\nIf you want an all-around sleeping pad that will keep you comfortable not only in the summer but also during those shoulder seasons, the All-Season is the way to go. The All-Season's second layer of mylar film increases the R-value to 5.4 and adds only 2 ounces of weight. The packed size is nearly the same. At only $30 more for a barely heavier pad with almost double the R-value, I think this is the best sleeping pad for most people out of Nemo's current Tensor lineup."
    },
    {
      "url": "https://cna.st/affiliate-link/474N76DNT3n1ogtyPnpZ1zqRzfKZycsKJirQdhkJoxFMttdQxRxEMZXSE5ATThYLaCmmvXD81Lnv4GfJkuXuiGoxhGdUnGeJwqMb6qox4gRTKpR76EoZT8ZopBchM5yMrpNYSg2Cs7w87aPkgnQay3ycWBjG",
      "text": "MegaMat Auto\nMegaMat Auto\n- This product is carbon offset with myclimate\nSpecifications\nSpecifications\n|\nR-value 8.1 |\nTemperature -40 °F |\n|\nLength 77.6 in |\nTop Width 52 in |\n|\nBottom Width 41 in |\nThickness 4 in |\n|\nWeight 127.9 oz | 8 lbs |\nPacked Dimensions 27.6 x 11.8 in |\n|\nPump Style Self inflation/Top-Up Pump |\nIncludes Sleeping mat, Top-Up Pump, SideWinder stuff sack, temporary repair kit |\nSIZE CHART\nMaterials\nMaterials\nTop\nRecycled 50 D tricot polyester, TPU polyether film laminate, honeycomb embossed, OEKO-TEX® 100 certified\nBottom\nRecycled 75 D polyester, TPU polyether film laminate, bluesign® approved\nInsulation\n16 kg/m³ open cell PU foam, OEKO-TEX® 100 tested\nSustainability\nSustainability\nClimate Contribution\nEXPED calculates all climate emissions from the production and transportation of this product and finances certified climate protection projects through myclimate to an equal extent.\nRecycled Materials\nMore and more EXPED products are being made from recycled materials such as PET bottles and waste from the production of textiles.\nbluesign® Approved Material\nThis product uses textiles approved by bluesign®, one of the strictest textile standards for environmental & consumer protection in textile production. See MATERIALS tab for details.\nOEKO-TEX® Certified Material\nThis product uses OEKO-TEX® STANDARD 100 materials or dyes. See MATERIALS tab for details.\nPFAS Free\nThis product is free of per- and polyfluoroalkyl substances, a family of non-degradable, man-made chemicals commonly used as dirt and water repellants.\nShipping & returns\nShipping & returns\nOrders are shipped from our warehouse Monday through Friday within 2-3 business days from the time the order was placed. Orders do not ship on the weekends or holidays (visit our FAQs page for a full list of holiday closures). Please note that the 2-3 day processing time applies to all shipping services. Order turnaround may take longer over holiday closures and during periods of high order volume (such as promotional sales periods).\nEXPEDUSA.com ships to addresses in the United States, PO/APO/AEO Boxes and U.S. Territories only. If shipping to a military or U.S. Territory address, please select USPS Priority Mail at checkout.\nDeliveries shipping via UPS Ground will arrive in 8-10 days of placing your order, UPS 2-Day in 4-6 days, and UPS Next Day Air in 3-4 days. USPS shipments may take 8-10 days for delivery. These shipping rates include order processing time. Shipments to APO/FPO, AK and HI may see increased delivery times.\nEligible orders may be returned within 60 days. Closeout and used gear/seconds items are final sale and not eligible for return.\nIf you do not receive your package in the above time period, please contact us at service@expedusa.com with your Order Number.\nProduct Description\nFIRM • SOFT • PLUSH • LUXURY\nMegaMat Auto is the ultimate vehicle sleeping mat fitting many mid-size trucks, compact SUVs & wagons, and Tesla models.\nLike other sleeping mats in the MegaMat line, the MegaMat Auto features 4 inches of open-cell polyurethane foam for soft support and warmth. The brushed stretch tricot polyester face fabric creates a luxurious cradling effect.\nMegaMat Auto is self-inflating. Open the inflate valve to allow the foam to expand and draw air into the mat. Use the included Top-Up Pump to dial in your preferred firmness.\nFeatures\n-\nWheel well cutouts\nAsymmetrical mat shape fits between the wheel wells of many vehicles. Turn your vehicle into a trailhead hotel.\n-\nWelded grab handles\n3 practical welded side handles make for easier handling and carrying ability; no more awkward mat grappling.\n-\n2 inflate & 2 deflate valves\n2 sets of one-way inflate & deflate FlatValves, one at the head end and one at the foot end, allow for easy inflation & deflation no matter the mat's orientation in your vehicle.\n-\nSoft, recycled material\nThe soft & stretchy 100% recycled tricot polyester face fabric ensures maximum next-to-skin comfort & enhances the cradling effect for a truly luxurious night's sleep.\n-\n3D construction\nVertical sidewall construction maximizes available sleep area & reduces tapering at the edges — just like your bed at home!\n-\nSelf-inflating mat\nOpen the one-way inflate valve & insert the valve pin to speed up inflation. Top-Up Pump included to add air to your desired firmness.\nIn-House Gear Repair Services\nOur goal is to keep gear out of the landfill by doing repairs whenever possible. Learn more about how to submit a warranty or repair claim."
    },
    {
      "url": "https://www.wired.com/story/the-best-sleeping-bags-for-every-adventure/#shoulderseason",
      "text": "All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nJohn Muir famously set off for the mountains with “some bread and tea in a pair of blankets with some sugar and a tin cup.” I admire his ultralight spirit and disdain for comfort on the trail, but I'd be willing to bet that if Muir were around today, he'd bring a good down sleeping bag with him, if for no other reason than they're lighter than old blankets. The tea is essential though. I can't argue with that.\nWhether you’re following Muir into the backcountry, are planning the perfect family camping trip, or are trekking the Camino de Santiago, there's a sleeping bag for that. No matter how you travel, where you're headed, or how much comfort you seek, after years of testing we've found the best sleeping bags for everyone.\nUpdated November 2024: We've added Nemo's excellent Disco 15 bag as a new top pick for side sleepers, removed a sold-out Marmot bag and a discontinued Rab bag, and updated links and prices throughout.\nAdrienne So and Martin Cizmar contributed to this guide.\nBe sure to read through our other outdoor guides, including the Best Sleeping Pads, Best Tents, Best Camp Stoves, and our Camp Cooking guide.\n- Best for Backpackers: Mountain Hardware Bishop Pass 15\n- Best for Car Campers: REI Siesta Hooded 20\n- Best All-in-One Sleep System: Zenbivy Bed\n- Best Ultralight: Sea to Summit Spark 15\n- Best for Side Sleepers: Nemo Disco 15\n- Best for Active Sleepers: Therm-a-Rest Questar 20\n- Best For Spring and Fall Trips: Magma 15 Sleeping Bag\n- Best Quilt: Therm-a-rest Vesper 32\n- Best for Kids: REI Kindercone\n- Best Synthetic Sleeping Bag: Nemo's Forte 20\n- How to Pick the Perfect Sleeping Bag\n- How We Tested\n- What All The Terms Mean\nSpecial offer for Gear readers: Get WIRED for just $5 ($25 off). This includes unlimited access to WIRED.com, full Gear coverage, and subscriber-only newsletters. Subscriptions help fund the work we do every day.\nThe Best Sleeping Bag for Backpackers\nMountain Hardware's Bishop Pass 15 offers the best warmth-to-weight ratio while also managing to pack down small and not be too expensive. It isn't perfect, but it strikes the best compromise for most backpackers, being warm enough for the shoulder seasons and light enough (2 pounds and 5.4 ounces) that you won't mind it even when you barely need it in the summer. I have slept in this bag for more than two weeks, with nighttime temps ranging from 28 to 65 degrees Fahrenheit, and, yes, it was too much in the heat as a sleeping bag. But on those warmer nights, I unzipped it and covered myself like a warm blanket. For everything else, I slept very well. It's a versatile bag.\nThe Bishop Pass 15 uses 650-fill-power down wrapped in a 20-denier water-resistant ripstop nylon shell. (Note: You'll often see 20-denier written as 20D; see below for more on what those terms mean.) One of the great things about this bag is the draft collar and face gasket feature, which does a great job of keeping your head warm. With the drawcord cinched down, you can conserve even more body heat. This is one of the few bags I've tested where I didn't feel the need for a hat. The insulation does a good job of staying where it should; I didn't find any bad cold spots in this bag.\nMy only gripe about this bag is that it's tight—there's not much room for anything but me. That makes it efficient and keeps you warmer, but this is not a good option if you're looking for something roomy (see the Therm-a-Rest Questar below). I also don't love the zipper. The pull glows in the dark, which is great, and the zipper doesn't snag much, but in my experience, it also doesn't pull as easily as others. Still, those are minor gripes about a bag that gets the rest right.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 26°F / -3°C\n- Fill: 650 Fill-Power Down\nThe Best Sleeping Bag for Car Campers\nCar-camping sleeping bags aren’t a place to spend lots of money. Should your best efforts to cocoon warmth around you fail, there is, after all, a car to retreat to. That's why we love the REI Siesta Hooded 20—it's plenty warm and affordable. It's also not a mummy bag, because you're not climbing Denali; why cramp yourself if you don't have to? The Siesta's rectangular cut makes for a much roomier, more comfortable bag. The Siesta is made of recycled polyester throughout, with a polyester filling. Despite that, the lining on this bag is noticeably softer than many others in this guide.\nThe Siesta's 20-degree rating makes it enough for three-season trips, and unlike most rectangular bags, the Siesta has a hood, which helps on those cold nights. What makes this such a versatile bag, though, is the double zipper system. There's a full-length zipper, which means you can turn it into a quilt on warmer nights, and there's also a second partial-length zipper on the other side so you can have more airflow when you want it. (You can also now zip two Siestas together, which wasn't possible with earlier versions.)\n- Temp rating: 20°F / -6°C\n- Fill: 650 Fill-Power Down\nBest All-in-One Sleep System\nThe Zenbivy Bed 25 (9/10, WIRED Recommends) is hands down the most comfortable backcountry sleeping experience I've ever had. It wouldn't be my top pick for extreme situations, but so long as your expected temperatures fit in Zenbivy's range, it doesn't get more comfortable than this. The Zenbivy isn't just a sleeping bag though. It's a sheet, hood, and quilt-style bag that can be combined in various ways depending on what you want.\nThe top sheet that covers the sleeping pad is made of 50-denier polyester pongee, which is wonderfully soft and feels like your bed at home. The sheet has the hood portion of the sleeping bag attached to it. Then you lay the top quilt (made of 20D nylon) over that. This is the coolest, loosest way to use the system, perfect for those warm nights. This is how I did most of my testing since I sleep rather warm. Should the temperature drop, you can zip the quilt foot box up into a mummy bag configuration and zip the upper sides to the bottom sheet. I did this on a couple of cooler nights in the Keweenaw Peninsula when it got quite frigid.\nWhat I didn’t like as much is the sleeping pad that comes with the full Zenbivy Bed. It’s plenty comfortable, but it’s also heavy. I used it for a few car camping trips, but if you’re primarily interested in backpacking, skip it and find something lighter in our sleeping pad guide. I tested the 25F bag, but there's also a 10F version if you want something warmer.\nIf you're done with mummy bags and aren't planning extreme mountaineering trips, the Zenbivy is worth considering; it is the best night's sleep I've ever had in the backcountry.\n- Temp rating: 25°F / -4°C\n- Comfort rating: 35°F / 2°C\n- Fill: 700 Fill-Power Hydrophobic Down\nBest Ultralight Sleeping Bag\nThe Sea to Summit Spark 18 is my favorite ultralight sleeping bag. Sure, most ultralight enthusiasts use a quilt, but aside from the Zenbivy, I haven't found a quilt I like. The Spark weighs a mere 1 pound 9.7 ounces, the lightest bag in this guide. It also has the smallest pack size of any bag I've tested in this temperature range. With the included compression sack, this thing is truly tiny. It's got most of the benefits of a quilt and none of the negatives (like getting a bit uncomfortable on chilly fall nights), making it a good option for thru-hikers or anyone wanting to save ounces.\nI should say that the Sea to Summit Spark series bags were recently updated from the version I tested last year. The temperature rating has been bumped down 3 degrees, but the main difference addressed the one thing I dislike about the version I tested: The thin inner liner has been modestly upgraded to 10D nylon. The outer shell uses a PFC-free DWR coating on 10D nylon. It's still thin, and I suggest you baby this one, but even my thinner version has held up just fine. We've been testing Spark bags since 2018, when our tester took one to Comic-Con, and haven't had any durability issues.\nThe down fill is also PFC-free and made of 850+ hydrophobic down. The zippers are on the small side, but they slide well and rarely if ever snag on the bag. I've slept in this bag down to 30 degrees, and honestly, even that night I woke up hot. But this is more a testament to how hot I sleep than bag performance (which is good). Like the bishop pass, this is a tight-fitting bag. It's plenty comfy, but you need to love the mummy shape.\nWhile I have tested the 18-degree model (replaced by the new 15F), there is a whole range of Spark's: 45F, 30F, 15F, and 0F. At $549, the Spark 15 is not cheap, but high-end, ultralight gear typically comes with a hefty price tag. If you have extra cash, the Spark Pro line is worth considering as well. I haven't tested it yet, but the full-length zipper that allows the bag to become more like a quilt is interesting.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 29°F / -2°C\n- Fill: 850 Fill-Power Goose Down\nBest for Side Sleepers\nI'm always on the lookout for the best gear for side sleepers, which, when camping, usually means a quilt. For most of the year, the best side sleeper setup is the thickest self-inflating sleeping pad suitable for the distance you're carrying it (if you're only going to buy one pad, I like the Sea to Summit Comfort Plus) and a quilt of the appropriate weight. But once you get down below freezing, the quilt can be a liability as you can roll over the wrong way and crack open your bubble, losing all your warm air instantly. In those situations, I love Nemo's Disco 15. This down mummy bag was designed with a “spoon shape” for side sleepers and has a little extra room in the elbows and knees so you can roll over onto your side without feeling like you're slipping into a straight jacket.\nIt's built for temps down to 15 degrees and has zippered gills you can open to avoid overheating in the 40s, though I kept them all closed in the mid-30s and wasn't overly warm. The hood is also a little looser than most mummy bags and comes with a draft collar that you can use to tuck yourself under, but that doesn't seal tight like more traditional mummies. Given the extra roominess and the fact that it's only 650-fill power down, this bag doesn't pack down as small as some 15-degree bags, but if you want higher fill power you'll pay an obscene amount. —Martin Cizmar\nBest for Active Sleepers\nI once made the mistake of calling a sleeping bag a “mummy bag” in front of my then 8-year-old who exclaimed, “What? Who would want to be a mummy?” Good question, kid. The answer is no one. The “mummy” design is all about warmth, not comfort. But let's face it—most of us are not sleeping in situations where our survival is at stake. Therm-a-Rest has addressed this with what it calls W.A.R.M. fit, which stands for “with additional room for multiple” positions. Indeed, this bag is very roomy for a mummy design. I was able to draw my legs up when side-sleeping and spread out considerably more than with most of the other bags in this guide. If you toss and turn through the nights, and don't want a quilt-style bag, this would be my top pick.\nThe Questar uses a 20D Polyester DWR-coated outer shell fabric, which does a great job of helping the bag stay dry even when your feet press up against the walls of the too-small tent you're testing. The inside is nylon taffeta. This bag comes with Therm-a-Rest's SynergyLink Connectors, which you can use to secure the sleeping bag to the pad underneath. This, combined with the slightly wider cut, makes this one of the more comfortable bags I've used.\nWeighing 2 pounds, 3 ounces, it isn't the lightest bag at this temperature rating, but it is one of the warmest. Therm-a-Rest comfort-rates this bag to 32 degrees, but I used it several nights in Michigan's Porcupine Mountains in temps down to 25 and found it plenty warm. The Questar series is also available in 32-degree and 0-degree versions. We have not tested either, but if you're looking to save some weight and know you won't be in extreme cold, the 32-degree model is worthwhile.\n- Temp rating: 20°F / -6°C\n- Comfort rating: 32°F / 0°C\n- Fill: 650 Fill-Power Nikwax Hydrophobic Down\nBest for Spring and Fall Trips\nREI Co-Op's Magma 15 is a no-nonsense down sleeping bag. It doesn't have a lot of frills, it just gets the job done. It's the bag I most often grab for fall and early spring trips where cold weather may arrive unannounced. It has an excellent draft collar that’s very good at keeping out the chill.\nThe outside is a 15-denier nylon ripstop (Bluesign approved, with a non-fluorinated DWR coating to keep moisture at bay). Baffles are variably spaced and not stitched through, which helps the fill stay put and minimizes cold spots. I also really like the Magma hood, which is warm and stays on your head throughout the night. There's a nice interior stash pocket I use to keep my headlamp handy.\nThe Magma series comes in a bewildering array of sizes and shapes—there are nine sizes to choose from, ranging from Short Narrow, which weighs 2 pounds, to Long Wide, which is nearly 3 pounds. One of my favorite features of this bag is the anti-snag zipper, which genuinely doesn't snag, because there's a woven barrier that keeps the down baffle away from the zipper. The zipper is also full-length, extending from the bottom of the foot box to the collar. REI also makes a 30-degree version of the Magma. I have not tested it, but if you only plan to go out in the summer months, that would be my suggestion.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 21°F / -6°C\n- Fill: 850 Fill-Power Down\nA Quilt for Warmer Trips\nQuilts are preferred by gram-counting backpackers because they dispense with the unhelpful half of a sleeping shell. The bottom side of a down sleeping bag gets mashed down anyway, meaning there's no lofted insulation for added warmth. The quilt market has no shortage of cottage quiltmakers serving ultralighters and hammockers—I bought a solid one off Etsy last year. Therm-a-Rest's top-of-the-line Vesper, though, has everything you could ask for in a lightweight quilt. The 32-degree version weighs less than a pound, and ratcheting down the included comprehension sack will get it to roughly the size of a Nalgene bottle.\nThanks to 900-fill down insulation, it was more than toasty enough for nights in the low 40s in the Canadian Rockies. The down is hydrophobic, though I didn't douse it for testing. The 32-degree Vesper is cut more generously than the 20-degree version and comfortably covers my larger body frame. This is the bag I would take on any backpacking trip—if you're pushing below this temperature, you'll want to build a system with layers.\n- Temp rating: 32°F / 0°C\n- Fill: 900 Fill-Power Hydrophobic Down\nA warmer alternative: If you want to save a little cash on a Therm-a-Rest quilt and push the temp rating down well below freezing, consider the Therm-a-Rest Corus ($310). This quilt uses less expensive 650-fill-power down (more on fill power here), which drops the price by $100 while adding 20 degrees of comfort rating and just 10 ounces of weight, keeping the quilt well below 2 pounds. The Corus has a 20D nylon shell rather than the 10D found on the Vesper, which adds both weight and durability. I only pushed it into the low 40s in my testing but found I had to stick a foot out or I baked under it. I suspect the 20-degree rating might be on the conservative side. —Martin Cizmar\nKid-Friendly Sleeping Bags\nKids' sleeping bags are cut smaller so your little ones don't have to heat up a huge, adult-size sleeping bag to stay warm. While that's 100 percent true, let's be honest, a lot of the appeal of kid-size sleeping bags is the lower price. The REI Kindercone bag fills both needs, being cut to a smaller size and relatively cheap. I would take the temperature rating with a grain of salt though. There is no comfort rating, but if there were, my guess would be around 35 degrees.\nThe Kindercone makes a great car camping bag, and you can backpack with it, but it's awkward. I spent four nights in the Pisgauh Wilderness lugging this thing around for my son. It's heavy (3 pounds and 3 ounces) and huge. Our hiking distances weren't that long, so after one day of it hogging half my pack, I took to just carrying the Kindercone in my hand. As I said, it's best for car camping. For backpacking, I'd consider something that compresses a bit smaller, like the REI Co-Op Zephyr 25 ($149).\nWhile the Kindercone is a fine bag, once my kids hit about 4 feet, I put them in adult bags. I did so for two reasons. First, the temperatures we've camped in have mostly been warm enough that staying warm wasn't a concern—summers in the mountains and the Northwoods of Michigan. It's never cold enough that I'm worried about them in a 20-degree adult bag. The second reason is that sleeping bags last a long time and are a significant investment. I wanted something that would last them through their teens, however tall they might be. (Properly cared-for sleeping bags should last decades. I recently retired the North Face Blue Kazoo bag my parents bought me in 1992.) So do you need a to buy kids' bag? For younger kids, I would say yes; for older kids, probably not.\n- Temp rating: -25°F / 4°C\n- Fill: Polyester fibers\nThe Best Synthetic Sleeping Bag\nNemo's Forte 20 is a 20-degree synthetic-fill sleeping bag. It's best used as a summer bag, possibly a three-season bag, depending on where you live. While it has 20 in the name and is technically rated to 20 degrees (see below for more on what that means), the comfort rating is 30 degrees. In my testing, this feels more like where you'd want to stay temperature-wise with this bag.\nThe outer shell uses a 30-denier recycled polyester ripstop with an inside liner made from 20-denier recycled polyester taffeta. It does a good job of holding back the moisture that often forms inside a tent, which I discovered after one very soggy night of testing. The fill is what Nemo calls Zerofiber insulation, which is made from 100 percent postconsumer recycled content fibers. The Zerofiber packs down remarkably small—this is the most compact synthetic-fill bag I've tested in this temp range—and retains its ability to trap warmth even when wet.\nWhat I like most about this bag, and nearly all of Nemo's sleeping bags, is the wider cut through the torso area down to the knees. Like the Therm-a-Rest Questar above, this bag is almost a hybrid of a mummy bag and your father's good old 1970s square sleeping bag. Which is to say, this bag is roomy. The downside is that there's more dead space your body has to heat, but as someone who sleeps warm anyway, I'll take the extra room.\n- Temp rating: -20°F / -7°C\n- Comfort rating: 30°F / -1.1°C\n- Fill: Synthetic\nHow to Pick the Perfect Sleeping Bag\nA sleeping bag is typically one of the most expensive pieces of camping gear you'll buy. If none of our picks strike your fancy, here are some general guidelines.\nAre you car camping? Thru-hiking the PCT? Headed out overnight in the August heat? Plotting a winter ski traverse of the Karakoram Himalaya? Which sleeping bag is right for you depends on how you're going to use it, especially the temperatures you plan to camp or backpack in, and how you sleep—hot, cold, in between.\nUnfortunately, there isn't an ideal sleeping bag that works in all climates. If you encounter a wide range of conditions in your camping, I would consider two bags. Get one nice down bag for colder conditions and a cheaper, lightweight synthetic-fill bag for summer use.\nAs with most things in the outdoor world, you're going to pay more for lightweight materials, so if you don't need them because, for example, you're just car camping, don't pay extra for an ultralight bag. Maybe don't even pay for a down bag. Synthetic bags are generally the best budget sleeping options for those camping in the heat.\nBy the same token, if you're primarily a summer hiker, doing the Appalachian Trail in sections, you don't need a 0-degree bag. Identify your use and then look for a sleeping bag that suits you best. Also, take the temperature rating with a grain of salt. Everyone sleeps differently. I almost always sleep warm, which means I don't need a 0-degree bag in anything but the harshest situation. My colleague Adrienne So is roughly the opposite and uses a 0-degree bag in 40-degree weather. Neither one of us is “right,” we've just learned to shop around how we sleep.\nThere are two types of insulation used in today's sleeping bags, down feathers and synthetic fibers. Down comes primarily from geese and ducks. Synthetics range from nylon to polyester. The insulation works by creating pockets of air, either through the structure of a feather or the structure of a synthetic fiber. These pockets of air then trap your body heat, keeping it close, and you warm. The more loft there is—the more air pockets there are—the warmer you will be and the lower the sleeping bag's temperature rating will be.\nIn most situations, a down sleeping bag is the superior choice. It's warmer for the weight, packs smaller, and is lighter. Where down fails is when it gets wet. Wet down is generally useless—all those air pockets that trap heat are gone. Synthetics on the other hand retain more warmth when wet. No one wants to sleep in a wet sleeping bag, but if you think that's a possibility, synthetic is the way to go.\nIn recent years down has been challenged with what's marketed as hydrophobic or “dry down,” which is treated with water-repellent coatings that cause the feathers to repel water. In our experience testing, these bags do better than regular down when wet, and in many cases, they're as good as synthetics. The trade-off is that when dry, they don't have quite the loft of regular down. If you're worried about water and want to stick with down, hydrophobic down is the best choice.\nThere is also the ethical question of down. Most down is a byproduct of the food industry. The Responsible Down Standard tries to ensure that down is ethically sourced, but PETA has shown that it's far from perfect. We leave that judgment call to you, but before you rush off to buy a synthetic, remember that it involves plenty of hazardous chemicals and questionable factory working conditions.\nAfter the type of insulation, it's worth considering these factors.\n- Temperature rating: Choose a sleeping bag rated a little bit lower than the lowest temperature you expect to encounter. If you're a three-season backpacker in the southern US, the lowest you're likely to hit is around freezing, so I'd suggest a 20-degree bag. If you sleep cold, you might go down more to 10 degrees.\n- Fill power: This means how much insulation is in the bag. The higher the fill-power number the warmer the bag will be. See our fill power explainer for more information.\n- Weight: If your backpacking weight is important, you want to stay as light as you can while still staying warm. Make sure to compare bags with the same temperature rating and ideally the same fill power—otherwise, you're making an apples-to-oranges comparison.\n- Design and features: Remember to consider the extras. Do you want a full-length zipper? Do you want a full hood? Or a way to strap your bag to your pad? How about stash pockets? Sleeping bags can have quite a bit of functionality beyond keeping you toasty.\n- Your overall sleep setup: How effective your sleeping bag is, and how warm you stay, also depends on factors like your sleeping pad and which tent you're using. See our Best Sleeping Pads and Best Tents guides for more advice on which suits you best.\n- Women’s sleeping bags: Our female testers have generally found very little difference between sleeping bags for men and those for women. Many manufacturers no longer make separate bags for women, but if that's something you want to look into, we suggest Sea to Summit, which makes a range of women's sleeping bags.\nHow We Tested\nAll our testing was done in the field in tents. Collectively our testers have more than 11 decades of experience in the wilderness. To test these bags, we hiked Alaskan peaks, Texas deserts, Hawaiian beaches, Michigan's Keweenaw Peninsula, and a range of other locations and conditions across the country. It's a rough life, but someone has to do it. This is not to say it's all fun and games—just ask my kids who've had to lie still many a morning while I zapped around their sleeping bags with an infrared thermometer looking for cold spots.\nWith a mix of body types and sleeping habits, we've been able to test which bags will keep even the coldest sleepers warm and which won't make those of us who sleep hot wake up sweating. Our picks are based on first-hand experience testing in the field on real trips (alas, we don't get paid to tromp around the wilderness). We take into account the warmth, how packable a bag is, how much it weighs, and how well it stands up to life on the trail or in the trunk.\nWhat All the Terms Mean\nProbably the most common question about sleeping bags is, “What temperature-rating sleeping bag should I get?” That's a good question, answered above, but it begs another question: What do those temperature ratings mean? There are often two ratings associated with temperature: temperature rating and comfort rating.\nTemperature rating is done using standardized tests overseen by the International Standards Organization (ISO), the same group that oversees things like programming languages and electrical standards. If you're in Europe, you might also see EN (European Norm) temp ratings. These are close enough to ISO ratings that you can compare them. ISO temperature ratings are done in a lab using standardized equipment under more or less ideal conditions. They also use base layers on the dummy. In the end, ISO temps are a means of comparison, but they don't mean that you will be warm at whatever temperature rating is given.\nComfort rating is more subjective. This is the temperature at which someone who sleeps cold will still feel comfortable. So if you tend to sleep cold, the comfort rating is the one to pay attention to. Incidentally, this is the rating given to most women's sleeping bags, because according to the industry, the average woman will feel colder than the average man in a bag with the same temp rating.\nBeyond knowing what the terms mean, also know this: Ratings are not precise. Our advice for those heading into snowy conditions where warmth is critical is to buy a bag rated 10 to 15 degrees colder than the coldest temps you expect to encounter.\nThere are more types of nylon out there than anyone can keep track of, which is where the denier rating system comes from. Denier is a measure used in fabrics that is based on the linear density of a fabric. The linear density is calculated by measuring how heavy the material is (in grams) for a length of 9,000 meters. Glad we cleared that up.\nWait what? 9,000 meters of what now? It turns out there are forms of fabric so thin it helps to have that much material to get a reliable weight out of them. The important takeaway is that denier means fabric weight. The higher the number, the thicker the fabric. Fun word nerd trivia: The word denier comes from the Latin word “Denarius,” which was a Roman coin.\nIn the case of sleeping bags, denier ratings for the nylon used typically run in the 10D to 40D range, though I have tested a few with single-digit-denier nylon. Also, watch out for all sorts of trademarked names for fabric. These have nothing to do with how thick or durable they are, they're just marketing. In my experience, testing over two dozen sleeping bags, 10D fabric is fine for a sleeping bag so long as you don't abuse it.\nWe covered what hydrophobic down is above, but there are a couple of other acronyms you'll see thrown around. The main two are DWR and PFC-free. DWR stands for “durable water repellent.” This waterproofness is commonly achieved through the use of a perfluorinated compound, better known to most of us as PFC. PFC-free means the waterproof coating on the down (or sometimes the nylon as well) doesn't contain any PFCs. Alternatives include wax, silicon, and sometimes plant-based sealants. Because waterproofness isn't as critical in sleeping bags (compared to a rain jacket), there's usually no difference between PFC-free sleeping bags and those that aren't. We try to recommend only PFC-free sleeping bags."
    },
    {
      "url": "https://www.wired.com/gallery/best-cast-iron-pans/",
      "text": "The Best Cast Iron Pans for Every Kitchen\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nCast iron skillets are the original workhorse pan of the kitchen. If you don't have one, you are missing out on a world of excellently seared steaks, crispy potatoes, delicious cornbread, and countless other delights made easier by a cast iron pan. Seriously, you need a cast iron pan.\nTo help you on your way to cast iron mastery we've put together this guide to help you pick the right pan and understand how to use it and how to care for it. (Don't worry, it's no more difficult to care for than any other pan.)\nCheck out our other kitchenware guides, including the Best Carbon Steel Pans, Best Air Fryers, Best Juicers, and Best Wireless Meat Thermometers.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today.\nWhat’s So Great About Cast Iron?\nCast iron has two qualities that have endeared it to chefs across the centuries. The big one is that iron retains heat very well. That means when you add a steak to a sizzling hot pan the temperature doesn't plummet. The minute you pull the pancakes out, it's ready for more.\nThe other thing we cast iron fans love is that these pans last pretty much forever. I once visited a museum in Naples that had cast iron pans from Pompeii. OK, technically those were hammered, not cast, but let’s not split hairs, the point is iron lasts. Properly cared for they can be heirloom items handed down through the generations.\nSmooth Cast Iron vs. Rough\nVintage cast iron pans, and some of our picks here as well, feature smooth, polished cast iron, whereas most pans made after the 1960s have a rougher surface. The difference is in manufacturing. The smooth pans have been polished after casting, the rough pans have not (or at least not as much, depending on the case).\nIn terms of performance … it really doesn't matter. The polymerized oil that forms the seasoning layer means that food isn't directly in contact with the metal, so the roughness of the metal doesn't come into play in any meaningful way. That said, if you, like me, just happen to prefer the look and feel of smooth pans, there's nothing wrong with that. Likewise, if you're on a budget, the cheaper, rougher pans perform exactly the same and will last just as long. You can even smooth them out yourself if you have the tools (though you will have to reseason them in that case).\nCaring for Cast Iron\nMany people are put off of cast iron pans by the many myths regarding cast iron: They're hard to clean, you can't use soap, you can't use metal utensils, and more. These are all false. Cast iron pans aren't hard to clean—you wash them with soap and a sponge like any other pan. If something burns and is really stuck, a chainmail scrubber will make quick work of it without hurting the seasoning.\nThe only thing that differs from cleaning any other pan is that you need to make sure you dry your cast iron well. If you don't, it'll rust. Though even rust isn't the end of the world. You just scrub out the rust and seal with a little oil. I like to heat up my pans after I dry them and then wipe them down with a bit of oil, but you don't need to do that every time.\nAnd the metal utensil thing is completely false; I prefer to use metal utensils. See the accessories section below.\nOther Cast Iron Pans\nThere are quite a few boutique cast iron makers, and while none of these outshine our top picks above, they're worth considering if you don't like the others for some reason.\nCooklife 12-inch Cast Iron Skillet for $150: Cooklife's cast iron arrives mirror-smooth with a decent, but not great, coat of seasoning. It ended up with the most cornbread stuck to the pan in all my cornbread testing. That said, this is a very light, maneuverable pan that's easy to cook with. The shape is a bit different, with more sloped sidewalls, and the performance is different as well—I found this to be more like cooking with carbon steel than cast iron, but maybe that's just me. Cooklife touts the fact that you can put this in the dishwasher, which … I don't have a dishwasher and it takes like 30 seconds, tops, to wash a pan, so I don't see much of a selling point there.\nVintage Cast Iron Pans\nVintage cast iron pans by manufacturers like Griswold, Wagner, and Birmingham Stove & Range used to be the cheapest way to acquire quality, smooth cast iron. I have several Griswolds and one Wagner; each was around $20. Yes, it's true, eBay ruined the antique market. Or saved it, depending on whether you're a buyer or seller. Whatever the case, the days when you could get a good-quality vintage cast iron pan for $20 are gone. Unless you're handy at removing rust from truly abused pans (which isn't that hard but does require some work), vintage cast iron is just as pricey as a high-quality new pan. A Griswold No. 8 (10-inch) pan on eBay sells for $60 to $300, depending on condition/restoration. For that price even I, lover of old things, would rather buy a Smithey.\nThat said, if you love the idea of a vintage pan, cast iron lasts, and there are many, many good pans available on eBay. If that's the route you want to go, keep an eye out for cracks (those can't be fixed) and, depending on your stovetop, you might also want to make sure there's no “wobble.” As cast iron pans age, the iron sometimes starts to sag in the middle. This won't affect you much unless you have a glass cooktop. If you do, make sure to avoid warped pans that won't sit flat.\nIt's also worth mentioning that as cool as old cast iron pans are, you don't know the history of them. Cast iron pans get used for melting lead, catching oil, and other unsavory things. It might be worth testing your vintage pans if you have any concerns.\nHow to Season Your Cast Iron\nThis is probably the most contentious thing in the world of cast iron. Everyone has their own way of seasoning, which makes it tough for beginners. That's why all the pans we recommend above need no seasoning to get started. They are all preseasoned.\nIf you buy a vintage pan, or if you damage your pan by scorching it (it happens), you'll need to build up a few layers of seasoning. Let's start by saying that there is no one right way. If you have a method that works, great—drop it in the comments below so others can try it. This is what I have been doing for 20-plus years, and it works for me:\n- Wash your pan with soap and water. Dry thoroughly with a towel.\n- Heat your oven to 200 degrees Fahrenheit and put the pan in for 15 minutes.\n- Take the pan out (using hot pads or an oven mitt) and coat it all over with Crisco. Coat the whole pan, even the bottom.\n- Once you've got it covered in Crisco, wipe the whole thing down with a towel. Try to get as much off as you can. You won't be able to get it all no matter what you do, so there's plenty left to season it.\n- Put the pan back in the oven and crank it up to 450.\n- After 15 minutes, pull the pan out (with gloves again) and wipe it down again.\n- Put it back in the oven and bake for about an hour.\n- Turn the oven off and let it cool down completely.\n- Repeat from step 3 as necessary.\nFor a new-to-you vintage pan, I'd do this four to five times over the course of a few days. If I'm just reseasoning one of my own pans, I do this process twice, and I do it about once every couple of years."
    },
    {
      "url": "https://www.wired.com/gallery/overlanding-guide/",
      "text": "Our Favorite Overlanding Gear for Off-Road Adventure\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nOverlanding, off-road touring, four-wheeling—whatever you call it, traveling America's back roads, the real back roads, the ones that aren't paved and are rarely maintained, is an almost guaranteed adventure. Overlanding will take you out there, whether it's Arizona’s famed Senator Highway, remote beaches in Mexico's Baja peninsula, or rolling across the Australian outback.\nHowever you define it, you're going to need more than an awesome rig. That's why we put together this guide to all the overlanding gear you need to make sure you and your vehicle make it back safely. Get what you need and load up your old Jeep, Land Cruiser, tricked-out Tacoma, or full on Unimog and get out there.\nWe bring you this expertise as two enthusiasts of backroad travel. Scott lives in an RV full-time and is a former Jeep owner, while Martin is a weekend warrior who's on his second 80 series Land Cruiser. Don't see anything you like? Be sure to check out our other buying guides, including our Best Sleeping Bags, Best Camp Stoves, and Best Tents roundups.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today.\nGo-Anywhere Tires\nB.F. Goodrich\nK02\nThe first time I showed up at an off-road camp, the Eureka Campground below Animas Forks on Colorado's famed Alpine Loop, I asked the proprietor about whether I was equipped to tackle the loop. The man looked out the window at my ride. “Well, you can drive anything if you've got the right truck and the right tires,” he said. “An 80 series is the right truck; let's look at the tires.”\nBefore you do any serious overlanding, you should replace your stock tires with something that has a thicker, grippier tread. I have owned two sets of factory rims since shortly after I bought my first 80 series and have had an embarrassing number of sets of tires since. The tires I had on during that Colorado trip were a set of General Grabbers, which the man at Eureka Campground proclaimed suitable for the task. (I looked over the edge just above Animas Forks and decided I was not.) On the highway, those Grabbers certainly sounded like off-road tires! And off-road, they were pretty good. But after putting a few thousand miles on the K02s, I can confirm that the difference between an OKish set of tires and a great set is very noticeable.\nThe KO2s have been around for a decade and are Baja champions, which, in my case, is sort of like me wearing Jordan 14s and trying to hit The Last Shot. Off-road they're knobby, grippy, and steady. If you ask a guy at a campground whether you can do a trail with these tires, the answer will be a guaranteed fast yes. But, like most of us, I drive more on-road than off, and their performance getting to the trail is the reason to buy the KO2s. They're as quiet as a regular set of passenger tires with excellent handling at highway speed. —Martin Cizmar\nThe Best Tool Roll\nRadius Outfitters\nTool Roll\nFor seven years I lived in and repaired a vintage RV. This taught me the value of not just having the right tools but also finding those tools when you need them. For years I relied on plastic bins from whatever big box store was nearby when I needed one. There's even a photo of my tools in these boxes in WIRED. But digging around in them was an exercise in frustration, and they did not hold up to being flung in the dirt or dragged across concrete underneath my engine. Enter the Radius Outfiggers tool bag.\nI've written at length about how this tool roll improved my life on the road. It's well-built, made of 1680D Cordura, with heavy stitching (bartack stitching to reinforce seams). I've used it for almost two years now, tossing it around under the bus and my Jeep, working on gravel, sand, occasionally concrete, and, unfortunately, in the mud. The tool roll isn't very clean anymore, but otherwise it's held up perfectly to all the abuse I've dished out.\nThere are three levels of tool sleeves on the inside of the roll, and it can handle up to 14-inch tools. There's also a zippered sleeve that perfectly fits my shop manual. At one end of the roll is a single zippered pouch, and the other end has two identical pouches (these are where I keep my sockets wrenches). It's enough organization to keep my basic tools neat and organized but not so many pouches that I forget where I put things. Getting this balance right is no small thing, so kudos to Radius Outfitters for finding the organizational sweet spot. —Scott Gilbertson\nA Simple, Sturdy Water Jug\nArrow\n1 Gallon Clear View Refrigerator Bottle\nAsked to explain the difference between overlanding and regular ol' car camping, I often say it's more like backpacking with a car. You're in remote places instead of state campgrounds and you'll remember that as soon as you get thirsty. Overlanding adventures often take you to remote places where there's not a pump handy, meaning you need to haul water.\nMy first instinct on this was to buy a big 5-gallon water can. The problem with this is that it's annoying and awkward to use around camp, and you can't just refill it at a standard sink, so you're looking for either a hose or a camp spigot.\nI upgraded to three of these Arrow water jugs, which are very popular with RV folks because the BPA-free plastic is tough, the handle makes them easy to carry and pour from, and you can fill them in the bathroom of a Pilot Flying J if you need to. They won't stack, but square edges mean they're easy to line up in a row, and you don't risk losing your whole supply if one gets a leak. —Martin Cizmar\nBest Off-Road Route Planning and Navigation Tool\nOnX\nOff Road Maps\nThere are plenty of map applications available, but OnX is the best I've tested. The dedicated off-road version has tons of overlanding routes and is tailored specifically to four-wheel drive, expedition-style travel. Not only have its maps proved very accurate, and they're available offline, but it also includes tons of useful extras like photos and difficulty ratings (so you have a better idea of what you're getting into). The best feature is the private and public property boundaries overlay, which will help you be a better overlander.\nThe property boundary layer requires the “elite” subscription, which is a little pricier ($99/year) but well worth it to help you avoid accidentally camping on private property (which is not always clearly or accurately marked in the field). In some cases, you can even get land owner contact information, which can be helpful if you're planning a route and want to make sure a road is indeed public access. —Scott Gilbertson\nA Great Storage Box/Bag\nRux\n70L Storage Container\nThe secret to living well in small spaces—as I have done for most of the past decade—is to be very organized. As the artist and filmmaker Van Neistat so eloquently put it, the key to being organized is to kit your shit. Of course, you need to have the right kits to put your shit in.\nIn a quest to create the perfect kits for everything, I have accidentally become a collector of bags, boxes, and bins. The Rux 70L waterproof bag/box packing system is one of my best finds. Rux likes to say that its 70L “packs like a box, carries like a bag.” I think that's a fair slogan that gets to the heart of why I like it. It's all the good parts of a box combined with all the good parts of a bag.\nThe firm top and bottom help maintain a box structure and give it the ability to stack. (Well, sort of. It really depends on what's inside and what’s on top.) The lid is very easy to open. At the same time, the sides are soft, so the Rux ends up being only as tall as what's inside, which means there's no wasted space, a key point when packing everything you need into a small overlanding vehicle. —Scott Gilbertson\nFolding Shovel\nSOG\n18-Inch Folding Shovel\nThe paradox of an overlanding trip is that you need tools to get you through rough terrain, but space is always at a premium when you're living out of a vehicle. That's why I love this shovel, which folds down to a relatively tiny package and is still a totally usable, effective shovel when you unfold it. (Except that saw blade part; that's mostly useless.)\nThis is a standard part of my camping gear, whether overlanding or not. It just lives in my Jeep. Why a shovel? I don't care how all-terrain your tires are, self-reliant adventure travel means you need to be able to dig yourself out should you get stuck. A winch is important, as are some kind of traction boards, but I like to have a shovel around as well. It also helps with more mundane tasks, like clearing leaves and twigs to safely make a campfire. —Scott Gilbertson\nA Simple, Cheap Tow Strap\nUncharted Supply Co.\nThe Extractor Tow Strap\nThis inexpensive tow strap is working perfectly. And by that, I mean I have not yet had to take it out of the crate. You keep emergency gear around, because when you don't have it is exactly when you need it.\nIf you're doing serious off-roading, you probably want a proper winch. But if you're doing a little light overlanding on rutted logging and forest service roads, a strap like this is likely all you need for peace of mind and to make it easy to give you a helping hand if you get stuck. This strap is rated to 17,600-plus pounds, which is three times the weight of my Land Cruiser. It's 12 feet long, which is likely the most you need—if you're trying to rescue a vehicle farther away, you probably need a winch or a (gulp) recovery tow truck. Best of all, this strap has instructions printed on the inside fabric, so if you ever need to use it you don't have to think too much about how. —Martin Cizmar\nOur Favorite Under-the-Seat Box\nRadius Outfitters\nGear Box 3500\nAnother great storage solution from Radius Outfitters, the Gear Box 3500 is great for fitting underneath the seat of vans and other overlanding vehicles. The Gear Box is a solid, well-made, well-thought out storage box, with optional hook-and-loop dividers and a magnetic lock mechanism. The 21- by 14-inch interior capacity gives me room for bigger items, and it slides into the same spot the similarly sized cheap plastic bin used to fit.\nRadius Outfitters also make smaller organizers if you have a set of tools that doesn't require the full roll or box. It also makes some very heavy-duty-looking totes that might be nice for my larger items. —Scott Gilbertson\nThe Perfect Crate\nSidioCrate\nFull-Size Crate With Lid\nIt's true what they say: If you have lots of cargo space, you're going to fill it. For a three-week trip, I have taken to not only loading up the back of my Land Cruiser but also filling a rooftop box. This requires some careful planning. You need multiple tents, so you don't have to set up your big one for a quick overnight in a state park, and fly fishing rods that haven't been used for two years.\nI've used a lot of different crates over the years, and I have a soft spot for a basic milk crate from the thrift store and the ultra-sturdy Front Runner Wolfpack Pro. But the best crates I've used come from SidioCrate. They not only have a bevy of accessories (enough divider options to set up your box in any imaginable way, a bamboo cutting board cover) but come in various colors and sizes.\nThe simplest and best feature, though, is the clear plastic lid. This makes it possible to look inside the crate and spot your spork without having to stop and think about how you packed it. Why did no one else make a sturdy crate you could see inside without removing the top before now? They're plenty rugged and stack into a stable little tower, but the real reason to buy them is that clear lid. —Martin Cizmar\nPower Your Life\nGoalZero\nYeti 1500X\nGoal Zero's Yeti 1500X is our favorite of the midrange all-in-one battery and charging systems. It's enough power to run Goal Zero's new Alta 50 fridge ($800) for about five to six days, based on my testing. If you're charging devices as well, that number will drop some, but this is more than enough for a long weekend. If you want indefinite off-grid power, add some solar panels. Grab Goal Zero's Nomad 200 folding panels ($500) and you'll be able to charge your Yeti 1500X in about eight hours. Goal Zero claims four to eight. It will depend a lot on the time of year and where you are, in addition to the weather, but I find it best to err on the conservative side when planning. The Yeti 1500X has a USB-C PD point, 2 USB-A ports, a car charging port, a high power port (30A, Anderson connectors), and several charging ports. —Scott Gilbertson\nLight for Your Whole Camp\nGoalZero\nYeti Skylight\nWhy fiddle with a flashlight when you can simply have light for your whole camp? If you've got the Yeti power station above, this companion light from Goal Zero will light up an area about half the size of a tennis court with impressive brightness. It's a lifesaver when you're setting up camp in the dark because your late off the trail, and for larger groups of people that will otherwise be blinding each other with headlamps while they try to wash up their dishes.\nThis light folds away into a tube about the size of a pair of skis and rises to 12 feet, flooding 6,000 lumens of light to your campsite. The LEDs are spread over six flaps, which can be folded to avoid annoying neighbors or lifted straight up for maximum range. It works with the Goal Zero Yeti range of portable power stations and will last a little over two hours on medium power, which is what I found to be the ideal in my weeks of testing. —Martin Cizmar\nA Foldable Camp Table\nOru\nSwitchTable\nOru's main product line is foldable kayaks that are light enough to portage with ease and fold up as small as an inflatable (our mini review here). This table is a natural extension of that expertise, employing the company's proprietary extruded plastic to make a table that will support up to 200 pounds but folds down to roughly the size of a 24-pack of cans.\nOverlanding often means camping on forest service land where there are no stationary picnic tables at your site, so a table is key to having a place to make and eat your food. This table can be set up low like a coffee table or high like a dining table, which means it has a place at pretty much every campsite. I used it on the lower setting for a week in Maine, mostly for holding beer and snacks, but I'd have no problem putting a light stove on it. There are probably even sturdier tables, but not many come at this weight and size. —Martin Cizmar\nFridge for Your Food\nEcoflow\nGlacier Portable Refrigerator\nKeeping food cool is probably the second most important part of overlanding (after getting in and out safely). A good cooler (see below) can do the job if your trips are short, but for anything more than a long weekend, nothing will improve your overlanding life like a 12-volt refrigerator. I like Ecoflow's Glacier fridge (8/10, WIRED Recommends) because it has its own battery that will last about 40 hours on average (less when ambient temps are higher). That's enough to get through an overnight trip without worrying about charging. I've even gone all weekend on just the built-in battery when it's cooler (spring and fall trips). Throw in 200 watts of solar panels and you’ll be able to have refrigeration nearly indefinitely so long as the sun is shining.\nThe catch is that the Glacier can't charge directly off solar, which means you'll have to invest in a battery, like the Goal Zero above. It's not a cheap setup, but seriously, nothing will improve overlanding more. Did I mention the Glacier can make ice? It's sort of a gimmick, but when you've spent all day driving the hot, dusty roads of Utah, you'll appreciate ice more than most people would. —Scott Gilbertson\nA Great Cooler\nYeti\nRoadie 15 Hard Cooler\nYeti's new Roadie 15 hard cooler is the perfect size for keeping your drinks cool. and it now has a strap, making it easier to lug around camp (always get it out of your vehicle and out of the sun). I prefer the hard coolers, because they stand up better to life on the 4x4 road, and this Yeti has held up great in my testing. It'll keep your drinks cool for days (two to three usually, less as ambient temps and humidity climb). My only gripe is that it's slightly too small to fit a block of ice, which would last even longer. Even if you have the fridge above (maybe especially if you have the fridge above), a cooler is nice for drinks, because it saves you from opening the fridge every time you want a cold one. If you decided to skip the fridge, I'd suggest going with a larger cooler like the Tundra 45 ($300). —Scott Gilbertson\nWhat Is Overlanding?\nIs it just car camping? Well, yes. And no. The definition of overlanding depends on who you ask. If you want to call driving your hybrid to your local state park campground overlanding, far be it for us to stop you. But before overlanding became a marketing term to sell you expensive stuff, it usually referred to self-sufficient car camping in remote places with rough roads or even none. If you're picturing Land Rovers cutting across the savanna, parking in the shade of an acacia tree while the occupants watch a pride of lions eat a gazelle, then we're on the same page.\nMore recently, overlanding now refers to off-road, four-wheel drive car camping, no savanna or lions needed. You still need to be self-reliant, though. The ultimate overlanding vehicle is probably the Unimog, a Mercedes-Benz truck chassis that is/was often used as military vehicles and can be converted into something you can live in. But you can find people overlanding in everything from Toyota 4Runners to Subarus. If it's four-wheel drive and you can put a roof box on it, it'll work for overlanding. A lot of people get hung up on their rigs (which is fine, this the Gear section after all), but the real point of overlanding is to get out and see the world.\nWired Coupons\n10% off Dell Coupon Code for New Customers\nSamsung Promo Code: 10% off TVs\nBusiness PCs - Extra 5% Off HP Coupon Code\n10% off Canon promo code with upgrade\nExclusive NordVPN Coupon: 76% off\nLG Promo Code: 20% Off Your First Order"
    },
    {
      "url": "https://fireboxstove.com/product/smallest-folding-gas-grill-kit/",
      "text": "Smallest Folding Gas Grill Kit\nFrom: Original price was: $107.97.$89.99Current price is: $89.99.\nSmallest Folding Gas Grill Kit\nFrom: Original price was: $107.97.$89.99Current price is: $89.99.Smallest Folding Gas Grill Kit Includes:\n- G2 Firebox Nano + X-Case Kit (L-Pins & Carbon Felt are included but not shown in images, Imported – choose Titanium or Stainless Steel)\n- Firebox Wood Flame Gas Burner & Ti Ember Glow Diffuser\n- Stainless steel Grill for Firebox Nano / Scout\nOur tried and proven Firebox Nano makes the worlds smallest gas grill. Thats not all, the Firebox Nano is multi-fuel capable so if you run out of fuel mother nature will provide twigs as a backup option! Also optional is a spirit burner for when you prefer to use alcohol. This stove is so multi-fuel capable, you can even use wood pellets!\nNano Stove Owners often refer to it as a “Gem of a stove” It’s an expression of genuine admiration for a product with simple sophistication. It’s surprisingly able to do so much with so little, earning its place in backpacks around the world.\nThe Firebox Wood Flame Gas burner is also unique and multi-functional. It has an airflow adjustment valve, which changes the flame from a blue stove-top flame to an orange ambiance flame. To grill, add the included titanium diffuser plate on top of the blue flame (when stove is off) and it converts the burner to a grill, or spreads the heat out further under your pan.\nA note from the designer, Steve, about the Firebox Nano…\nTo get a high BTU from such a small structure I knew it needed to breathe freely which lent itself very well to its minimalistic design. The small diameter arms and legs are spring tempered for strength. With the Nano, less is more. Less bulk, weight and complication with plenty of function. I use the Nano primarily with the Trangia Alcohol Burner. Secondarily (as backup) with wood (twigs and sticks) which works very well but does require a bit more of your attention. The Nano works perfectly with the Trangia alcohol burner both for heat sensitive cooking and fast boiling with a wide variety of cookware. If you prefer the clean and convenient experience of cooking over alcohol, the Nano-Trangia combination provides an excellent experience for all types of camping.\nNote: Fire safety is the responsibility of the person lighting the fire. Tags: Kit-Pac\nDimensions of Stove:\nWidth: 3.0″\nHeight: 4.75″\nFolded: .25″\nMore info about the Wood Flame Gas Gas Burner & Ti Ember Glow Diffuser\n- Airflow valve alters from stove flame to ambiance fire.\n- High efficiency.\n-\nEasy control.\n-\nClicks into place on all Firebox Stoves (G2 Original Firebox, Firebox Nano, Firebox Scout, Firebox Modular Freestyle).\n-\nFire restriction compliant in most areas (check local requirements).\n-\nIncludes Titanium Flame Diffuser / Radiant Grill Adapter.\n-\nIncludes mounting pins that work for either the 5” Firebox Stove and Firebox Freestyle (cut to fit).\n-\nRuns on standard butane cartridges.\nGas Burner Includes:\nGas Burner, (2) Gas Burner Pins for use with our larger stoves and Titanium Flame Diffuser / Radiant Grill.\nThe gas burner is easy to use, has fast boil times and keeps your pans soot free. Works in all weather conditions above -22 C. Fits with all propane/butane gas cartridges with EN417 compatible threaded valves. These cartridges are available in most countries around the world. Boils 1 liter of water in 3-5 minutes (varies according to weather and quality of fuel).\nTitanium Flame Diffuser / Radiant Grill Adapter disperses heat to a wider area for more even pan cooking or can be used to create radiant heat for grilling.\nAvailable option: LPG Fuel Adaptor (pictured above). This handy attachment allows you to use any Lindal valve (screw-top) backpacking stove such as the Trangia Gas Burner with a 16.4 oz. Coleman-style propane canister. These canisters are less expensive than standard compressed fuel cans, and are readily available in camping and hardware stores throughout the US and much of the world. This works with top-mount and remote canister stoves.\nSpecifications:\nGas Burner Weight: 8.1 oz.\nOutput: 2100 W\nLength: 3 ¼” x 1 ⅜” Wide\nHose: 15” Long\nDiffuser Weight: .6 oz.\nDiffuser Dimensions: 3 ¼” diameter.\nReviews (1)\nOnly logged in customers who have purchased this product may leave a review.\nRobert Pike\n(verified owner)This little kit is so handy and versatile. It sets up quickly and takes up very little space in my Kit-Pac along with a small butane canister. It is usually accompanied by my coffee kit and Box Pot, and other items depending on the endeavor. The other day my Firebox Kit made me a hero at work! A big thunderstorm knocked the power out at the shop about 6:30 and both coffee pots in the break room were empty. I had already made my coffee with my Aeropress using beans I had just ground using the electric coffee grinder I keep in my toolbox(the break room coffee is swill!). After an hour or so one of my co-workers started griping about how he hadn’t had his coffee yet. I grabbed my Kit-Pac from the car and set up the Nano and gas burner, boiled water in the Box Pot, ground more beans with my Firebox coffee grinder, then did the AeroPress thing. My co-workers were impressed to say the least. Thankfully the power came back on before I had to make coffee for the whole crew."
    },
    {
      "url": "https://www.wired.com/review/rei-co-op-base-camp-6-family-tent/",
      "text": "When my wife and I had kids, one of the first things we did was get a bigger tent. Fifteen years ago, the nicest car camping tent I could find was REI's Kingdom 6. All these years later, that tent is still going strong (a friend is off camping in it right now), but it turned out that we never really needed all that room. I'd happily trade that room for little more strength in stormy weather, which always seem to find me when I'm camping, and a smaller footprint that will fit in more spots.\nThat's exactly what REI's Base Camp 6 tent offers. It's smaller in overall livable space than the Kingdom 6, but in my testing it has held up much better in the wind while still being big enough to comfortably sleep five.\nFamily-Friendly\nBefore I dive into the Base Camp, I should note that while REI no longer makes the Kingdom 6, it makes something close in the Wonderland 6, which is an option I'll discuss at the end. I decided to swap the space for the stronger design of the Base Camp. I also like that the squarer shape of the Base Camp fits better on smaller camping sites.\nThe REI Co-op Base Camp tent is available in four-person and six-person sizes. I tested the Base Camp 6, which I would say comfortably sleeps five adults and is just about perfect for two adults, two teenagers and one 10-year-old. REI's specs claim 84.3 square feet of interior floor space, which, compared to the rest of the family camping tents in our guide, is almost exactly average for a six-person tent. You can technically fit six sleeping pads, but it's going to be tight, which is pretty much par for the course with tents. If you want a better day-to-day living experience, size up to at least one person larger than your actual group size.\nOne thing that the Base Camp has that makes feel more livable is a plethora of pockets and ceiling hooks for storing clothes and gear out of the way. There are 14 mesh packets around the tent (more or less the whole lower portion of the tent is mesh pockets). Keeping things tidy and organized always makes life in a tent better.\nThere are two huge doors with full zippers, so you can completely open it up when you're loading stuff into it. The top of the tent is mesh, and there are two triangular mesh vents on either side of the tent, along with mesh panels on the doors. All of these can be closed up with zippers except for the roof, which is just mesh. All the venting options combine to make this a great tent for warmer nights as there’s a way to get the air moving no matter which way the wind is blowing. Even when it's dead still, it's nice to know that some heat is escaping out the top of the tent. There are vents in the rainfly as well, which can be propped open to allow a breeze through even during a storm."
    },
    {
      "url": "https://www.wired.com/story/the-best-sleeping-bags-for-every-adventure/",
      "text": "All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nJohn Muir famously set off for the mountains with “some bread and tea in a pair of blankets with some sugar and a tin cup.” I admire his ultralight spirit and disdain for comfort on the trail, but I'd be willing to bet that if Muir were around today, he'd bring a good down sleeping bag with him, if for no other reason than they're lighter than old blankets. The tea is essential though. I can't argue with that.\nWhether you’re following Muir into the backcountry, are planning the perfect family camping trip, or are trekking the Camino de Santiago, there's a sleeping bag for that. No matter how you travel, where you're headed, or how much comfort you seek, after years of testing we've found the best sleeping bags for everyone.\nUpdated November 2024: We've added Nemo's excellent Disco 15 bag as a new top pick for side sleepers, removed a sold-out Marmot bag and a discontinued Rab bag, and updated links and prices throughout.\nAdrienne So and Martin Cizmar contributed to this guide.\nBe sure to read through our other outdoor guides, including the Best Sleeping Pads, Best Tents, Best Camp Stoves, and our Camp Cooking guide.\n- Best for Backpackers: Mountain Hardware Bishop Pass 15\n- Best for Car Campers: REI Siesta Hooded 20\n- Best All-in-One Sleep System: Zenbivy Bed\n- Best Ultralight: Sea to Summit Spark 15\n- Best for Side Sleepers: Nemo Disco 15\n- Best for Active Sleepers: Therm-a-Rest Questar 20\n- Best For Spring and Fall Trips: Magma 15 Sleeping Bag\n- Best Quilt: Therm-a-rest Vesper 32\n- Best for Kids: REI Kindercone\n- Best Synthetic Sleeping Bag: Nemo's Forte 20\n- How to Pick the Perfect Sleeping Bag\n- How We Tested\n- What All The Terms Mean\nSpecial offer for Gear readers: Get WIRED for just $5 ($25 off). This includes unlimited access to WIRED.com, full Gear coverage, and subscriber-only newsletters. Subscriptions help fund the work we do every day.\nThe Best Sleeping Bag for Backpackers\nMountain Hardware's Bishop Pass 15 offers the best warmth-to-weight ratio while also managing to pack down small and not be too expensive. It isn't perfect, but it strikes the best compromise for most backpackers, being warm enough for the shoulder seasons and light enough (2 pounds and 5.4 ounces) that you won't mind it even when you barely need it in the summer. I have slept in this bag for more than two weeks, with nighttime temps ranging from 28 to 65 degrees Fahrenheit, and, yes, it was too much in the heat as a sleeping bag. But on those warmer nights, I unzipped it and covered myself like a warm blanket. For everything else, I slept very well. It's a versatile bag.\nThe Bishop Pass 15 uses 650-fill-power down wrapped in a 20-denier water-resistant ripstop nylon shell. (Note: You'll often see 20-denier written as 20D; see below for more on what those terms mean.) One of the great things about this bag is the draft collar and face gasket feature, which does a great job of keeping your head warm. With the drawcord cinched down, you can conserve even more body heat. This is one of the few bags I've tested where I didn't feel the need for a hat. The insulation does a good job of staying where it should; I didn't find any bad cold spots in this bag.\nMy only gripe about this bag is that it's tight—there's not much room for anything but me. That makes it efficient and keeps you warmer, but this is not a good option if you're looking for something roomy (see the Therm-a-Rest Questar below). I also don't love the zipper. The pull glows in the dark, which is great, and the zipper doesn't snag much, but in my experience, it also doesn't pull as easily as others. Still, those are minor gripes about a bag that gets the rest right.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 26°F / -3°C\n- Fill: 650 Fill-Power Down\nThe Best Sleeping Bag for Car Campers\nCar-camping sleeping bags aren’t a place to spend lots of money. Should your best efforts to cocoon warmth around you fail, there is, after all, a car to retreat to. That's why we love the REI Siesta Hooded 20—it's plenty warm and affordable. It's also not a mummy bag, because you're not climbing Denali; why cramp yourself if you don't have to? The Siesta's rectangular cut makes for a much roomier, more comfortable bag. The Siesta is made of recycled polyester throughout, with a polyester filling. Despite that, the lining on this bag is noticeably softer than many others in this guide.\nThe Siesta's 20-degree rating makes it enough for three-season trips, and unlike most rectangular bags, the Siesta has a hood, which helps on those cold nights. What makes this such a versatile bag, though, is the double zipper system. There's a full-length zipper, which means you can turn it into a quilt on warmer nights, and there's also a second partial-length zipper on the other side so you can have more airflow when you want it. (You can also now zip two Siestas together, which wasn't possible with earlier versions.)\n- Temp rating: 20°F / -6°C\n- Fill: 650 Fill-Power Down\nBest All-in-One Sleep System\nThe Zenbivy Bed 25 (9/10, WIRED Recommends) is hands down the most comfortable backcountry sleeping experience I've ever had. It wouldn't be my top pick for extreme situations, but so long as your expected temperatures fit in Zenbivy's range, it doesn't get more comfortable than this. The Zenbivy isn't just a sleeping bag though. It's a sheet, hood, and quilt-style bag that can be combined in various ways depending on what you want.\nThe top sheet that covers the sleeping pad is made of 50-denier polyester pongee, which is wonderfully soft and feels like your bed at home. The sheet has the hood portion of the sleeping bag attached to it. Then you lay the top quilt (made of 20D nylon) over that. This is the coolest, loosest way to use the system, perfect for those warm nights. This is how I did most of my testing since I sleep rather warm. Should the temperature drop, you can zip the quilt foot box up into a mummy bag configuration and zip the upper sides to the bottom sheet. I did this on a couple of cooler nights in the Keweenaw Peninsula when it got quite frigid.\nWhat I didn’t like as much is the sleeping pad that comes with the full Zenbivy Bed. It’s plenty comfortable, but it’s also heavy. I used it for a few car camping trips, but if you’re primarily interested in backpacking, skip it and find something lighter in our sleeping pad guide. I tested the 25F bag, but there's also a 10F version if you want something warmer.\nIf you're done with mummy bags and aren't planning extreme mountaineering trips, the Zenbivy is worth considering; it is the best night's sleep I've ever had in the backcountry.\n- Temp rating: 25°F / -4°C\n- Comfort rating: 35°F / 2°C\n- Fill: 700 Fill-Power Hydrophobic Down\nBest Ultralight Sleeping Bag\nThe Sea to Summit Spark 18 is my favorite ultralight sleeping bag. Sure, most ultralight enthusiasts use a quilt, but aside from the Zenbivy, I haven't found a quilt I like. The Spark weighs a mere 1 pound 9.7 ounces, the lightest bag in this guide. It also has the smallest pack size of any bag I've tested in this temperature range. With the included compression sack, this thing is truly tiny. It's got most of the benefits of a quilt and none of the negatives (like getting a bit uncomfortable on chilly fall nights), making it a good option for thru-hikers or anyone wanting to save ounces.\nI should say that the Sea to Summit Spark series bags were recently updated from the version I tested last year. The temperature rating has been bumped down 3 degrees, but the main difference addressed the one thing I dislike about the version I tested: The thin inner liner has been modestly upgraded to 10D nylon. The outer shell uses a PFC-free DWR coating on 10D nylon. It's still thin, and I suggest you baby this one, but even my thinner version has held up just fine. We've been testing Spark bags since 2018, when our tester took one to Comic-Con, and haven't had any durability issues.\nThe down fill is also PFC-free and made of 850+ hydrophobic down. The zippers are on the small side, but they slide well and rarely if ever snag on the bag. I've slept in this bag down to 30 degrees, and honestly, even that night I woke up hot. But this is more a testament to how hot I sleep than bag performance (which is good). Like the bishop pass, this is a tight-fitting bag. It's plenty comfy, but you need to love the mummy shape.\nWhile I have tested the 18-degree model (replaced by the new 15F), there is a whole range of Spark's: 45F, 30F, 15F, and 0F. At $549, the Spark 15 is not cheap, but high-end, ultralight gear typically comes with a hefty price tag. If you have extra cash, the Spark Pro line is worth considering as well. I haven't tested it yet, but the full-length zipper that allows the bag to become more like a quilt is interesting.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 29°F / -2°C\n- Fill: 850 Fill-Power Goose Down\nBest for Side Sleepers\nI'm always on the lookout for the best gear for side sleepers, which, when camping, usually means a quilt. For most of the year, the best side sleeper setup is the thickest self-inflating sleeping pad suitable for the distance you're carrying it (if you're only going to buy one pad, I like the Sea to Summit Comfort Plus) and a quilt of the appropriate weight. But once you get down below freezing, the quilt can be a liability as you can roll over the wrong way and crack open your bubble, losing all your warm air instantly. In those situations, I love Nemo's Disco 15. This down mummy bag was designed with a “spoon shape” for side sleepers and has a little extra room in the elbows and knees so you can roll over onto your side without feeling like you're slipping into a straight jacket.\nIt's built for temps down to 15 degrees and has zippered gills you can open to avoid overheating in the 40s, though I kept them all closed in the mid-30s and wasn't overly warm. The hood is also a little looser than most mummy bags and comes with a draft collar that you can use to tuck yourself under, but that doesn't seal tight like more traditional mummies. Given the extra roominess and the fact that it's only 650-fill power down, this bag doesn't pack down as small as some 15-degree bags, but if you want higher fill power you'll pay an obscene amount. —Martin Cizmar\nBest for Active Sleepers\nI once made the mistake of calling a sleeping bag a “mummy bag” in front of my then 8-year-old who exclaimed, “What? Who would want to be a mummy?” Good question, kid. The answer is no one. The “mummy” design is all about warmth, not comfort. But let's face it—most of us are not sleeping in situations where our survival is at stake. Therm-a-Rest has addressed this with what it calls W.A.R.M. fit, which stands for “with additional room for multiple” positions. Indeed, this bag is very roomy for a mummy design. I was able to draw my legs up when side-sleeping and spread out considerably more than with most of the other bags in this guide. If you toss and turn through the nights, and don't want a quilt-style bag, this would be my top pick.\nThe Questar uses a 20D Polyester DWR-coated outer shell fabric, which does a great job of helping the bag stay dry even when your feet press up against the walls of the too-small tent you're testing. The inside is nylon taffeta. This bag comes with Therm-a-Rest's SynergyLink Connectors, which you can use to secure the sleeping bag to the pad underneath. This, combined with the slightly wider cut, makes this one of the more comfortable bags I've used.\nWeighing 2 pounds, 3 ounces, it isn't the lightest bag at this temperature rating, but it is one of the warmest. Therm-a-Rest comfort-rates this bag to 32 degrees, but I used it several nights in Michigan's Porcupine Mountains in temps down to 25 and found it plenty warm. The Questar series is also available in 32-degree and 0-degree versions. We have not tested either, but if you're looking to save some weight and know you won't be in extreme cold, the 32-degree model is worthwhile.\n- Temp rating: 20°F / -6°C\n- Comfort rating: 32°F / 0°C\n- Fill: 650 Fill-Power Nikwax Hydrophobic Down\nBest for Spring and Fall Trips\nREI Co-Op's Magma 15 is a no-nonsense down sleeping bag. It doesn't have a lot of frills, it just gets the job done. It's the bag I most often grab for fall and early spring trips where cold weather may arrive unannounced. It has an excellent draft collar that’s very good at keeping out the chill.\nThe outside is a 15-denier nylon ripstop (Bluesign approved, with a non-fluorinated DWR coating to keep moisture at bay). Baffles are variably spaced and not stitched through, which helps the fill stay put and minimizes cold spots. I also really like the Magma hood, which is warm and stays on your head throughout the night. There's a nice interior stash pocket I use to keep my headlamp handy.\nThe Magma series comes in a bewildering array of sizes and shapes—there are nine sizes to choose from, ranging from Short Narrow, which weighs 2 pounds, to Long Wide, which is nearly 3 pounds. One of my favorite features of this bag is the anti-snag zipper, which genuinely doesn't snag, because there's a woven barrier that keeps the down baffle away from the zipper. The zipper is also full-length, extending from the bottom of the foot box to the collar. REI also makes a 30-degree version of the Magma. I have not tested it, but if you only plan to go out in the summer months, that would be my suggestion.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 21°F / -6°C\n- Fill: 850 Fill-Power Down\nA Quilt for Warmer Trips\nQuilts are preferred by gram-counting backpackers because they dispense with the unhelpful half of a sleeping shell. The bottom side of a down sleeping bag gets mashed down anyway, meaning there's no lofted insulation for added warmth. The quilt market has no shortage of cottage quiltmakers serving ultralighters and hammockers—I bought a solid one off Etsy last year. Therm-a-Rest's top-of-the-line Vesper, though, has everything you could ask for in a lightweight quilt. The 32-degree version weighs less than a pound, and ratcheting down the included comprehension sack will get it to roughly the size of a Nalgene bottle.\nThanks to 900-fill down insulation, it was more than toasty enough for nights in the low 40s in the Canadian Rockies. The down is hydrophobic, though I didn't douse it for testing. The 32-degree Vesper is cut more generously than the 20-degree version and comfortably covers my larger body frame. This is the bag I would take on any backpacking trip—if you're pushing below this temperature, you'll want to build a system with layers.\n- Temp rating: 32°F / 0°C\n- Fill: 900 Fill-Power Hydrophobic Down\nA warmer alternative: If you want to save a little cash on a Therm-a-Rest quilt and push the temp rating down well below freezing, consider the Therm-a-Rest Corus ($310). This quilt uses less expensive 650-fill-power down (more on fill power here), which drops the price by $100 while adding 20 degrees of comfort rating and just 10 ounces of weight, keeping the quilt well below 2 pounds. The Corus has a 20D nylon shell rather than the 10D found on the Vesper, which adds both weight and durability. I only pushed it into the low 40s in my testing but found I had to stick a foot out or I baked under it. I suspect the 20-degree rating might be on the conservative side. —Martin Cizmar\nKid-Friendly Sleeping Bags\nKids' sleeping bags are cut smaller so your little ones don't have to heat up a huge, adult-size sleeping bag to stay warm. While that's 100 percent true, let's be honest, a lot of the appeal of kid-size sleeping bags is the lower price. The REI Kindercone bag fills both needs, being cut to a smaller size and relatively cheap. I would take the temperature rating with a grain of salt though. There is no comfort rating, but if there were, my guess would be around 35 degrees.\nThe Kindercone makes a great car camping bag, and you can backpack with it, but it's awkward. I spent four nights in the Pisgauh Wilderness lugging this thing around for my son. It's heavy (3 pounds and 3 ounces) and huge. Our hiking distances weren't that long, so after one day of it hogging half my pack, I took to just carrying the Kindercone in my hand. As I said, it's best for car camping. For backpacking, I'd consider something that compresses a bit smaller, like the REI Co-Op Zephyr 25 ($149).\nWhile the Kindercone is a fine bag, once my kids hit about 4 feet, I put them in adult bags. I did so for two reasons. First, the temperatures we've camped in have mostly been warm enough that staying warm wasn't a concern—summers in the mountains and the Northwoods of Michigan. It's never cold enough that I'm worried about them in a 20-degree adult bag. The second reason is that sleeping bags last a long time and are a significant investment. I wanted something that would last them through their teens, however tall they might be. (Properly cared-for sleeping bags should last decades. I recently retired the North Face Blue Kazoo bag my parents bought me in 1992.) So do you need a to buy kids' bag? For younger kids, I would say yes; for older kids, probably not.\n- Temp rating: -25°F / 4°C\n- Fill: Polyester fibers\nThe Best Synthetic Sleeping Bag\nNemo's Forte 20 is a 20-degree synthetic-fill sleeping bag. It's best used as a summer bag, possibly a three-season bag, depending on where you live. While it has 20 in the name and is technically rated to 20 degrees (see below for more on what that means), the comfort rating is 30 degrees. In my testing, this feels more like where you'd want to stay temperature-wise with this bag.\nThe outer shell uses a 30-denier recycled polyester ripstop with an inside liner made from 20-denier recycled polyester taffeta. It does a good job of holding back the moisture that often forms inside a tent, which I discovered after one very soggy night of testing. The fill is what Nemo calls Zerofiber insulation, which is made from 100 percent postconsumer recycled content fibers. The Zerofiber packs down remarkably small—this is the most compact synthetic-fill bag I've tested in this temp range—and retains its ability to trap warmth even when wet.\nWhat I like most about this bag, and nearly all of Nemo's sleeping bags, is the wider cut through the torso area down to the knees. Like the Therm-a-Rest Questar above, this bag is almost a hybrid of a mummy bag and your father's good old 1970s square sleeping bag. Which is to say, this bag is roomy. The downside is that there's more dead space your body has to heat, but as someone who sleeps warm anyway, I'll take the extra room.\n- Temp rating: -20°F / -7°C\n- Comfort rating: 30°F / -1.1°C\n- Fill: Synthetic\nHow to Pick the Perfect Sleeping Bag\nA sleeping bag is typically one of the most expensive pieces of camping gear you'll buy. If none of our picks strike your fancy, here are some general guidelines.\nAre you car camping? Thru-hiking the PCT? Headed out overnight in the August heat? Plotting a winter ski traverse of the Karakoram Himalaya? Which sleeping bag is right for you depends on how you're going to use it, especially the temperatures you plan to camp or backpack in, and how you sleep—hot, cold, in between.\nUnfortunately, there isn't an ideal sleeping bag that works in all climates. If you encounter a wide range of conditions in your camping, I would consider two bags. Get one nice down bag for colder conditions and a cheaper, lightweight synthetic-fill bag for summer use.\nAs with most things in the outdoor world, you're going to pay more for lightweight materials, so if you don't need them because, for example, you're just car camping, don't pay extra for an ultralight bag. Maybe don't even pay for a down bag. Synthetic bags are generally the best budget sleeping options for those camping in the heat.\nBy the same token, if you're primarily a summer hiker, doing the Appalachian Trail in sections, you don't need a 0-degree bag. Identify your use and then look for a sleeping bag that suits you best. Also, take the temperature rating with a grain of salt. Everyone sleeps differently. I almost always sleep warm, which means I don't need a 0-degree bag in anything but the harshest situation. My colleague Adrienne So is roughly the opposite and uses a 0-degree bag in 40-degree weather. Neither one of us is “right,” we've just learned to shop around how we sleep.\nThere are two types of insulation used in today's sleeping bags, down feathers and synthetic fibers. Down comes primarily from geese and ducks. Synthetics range from nylon to polyester. The insulation works by creating pockets of air, either through the structure of a feather or the structure of a synthetic fiber. These pockets of air then trap your body heat, keeping it close, and you warm. The more loft there is—the more air pockets there are—the warmer you will be and the lower the sleeping bag's temperature rating will be.\nIn most situations, a down sleeping bag is the superior choice. It's warmer for the weight, packs smaller, and is lighter. Where down fails is when it gets wet. Wet down is generally useless—all those air pockets that trap heat are gone. Synthetics on the other hand retain more warmth when wet. No one wants to sleep in a wet sleeping bag, but if you think that's a possibility, synthetic is the way to go.\nIn recent years down has been challenged with what's marketed as hydrophobic or “dry down,” which is treated with water-repellent coatings that cause the feathers to repel water. In our experience testing, these bags do better than regular down when wet, and in many cases, they're as good as synthetics. The trade-off is that when dry, they don't have quite the loft of regular down. If you're worried about water and want to stick with down, hydrophobic down is the best choice.\nThere is also the ethical question of down. Most down is a byproduct of the food industry. The Responsible Down Standard tries to ensure that down is ethically sourced, but PETA has shown that it's far from perfect. We leave that judgment call to you, but before you rush off to buy a synthetic, remember that it involves plenty of hazardous chemicals and questionable factory working conditions.\nAfter the type of insulation, it's worth considering these factors.\n- Temperature rating: Choose a sleeping bag rated a little bit lower than the lowest temperature you expect to encounter. If you're a three-season backpacker in the southern US, the lowest you're likely to hit is around freezing, so I'd suggest a 20-degree bag. If you sleep cold, you might go down more to 10 degrees.\n- Fill power: This means how much insulation is in the bag. The higher the fill-power number the warmer the bag will be. See our fill power explainer for more information.\n- Weight: If your backpacking weight is important, you want to stay as light as you can while still staying warm. Make sure to compare bags with the same temperature rating and ideally the same fill power—otherwise, you're making an apples-to-oranges comparison.\n- Design and features: Remember to consider the extras. Do you want a full-length zipper? Do you want a full hood? Or a way to strap your bag to your pad? How about stash pockets? Sleeping bags can have quite a bit of functionality beyond keeping you toasty.\n- Your overall sleep setup: How effective your sleeping bag is, and how warm you stay, also depends on factors like your sleeping pad and which tent you're using. See our Best Sleeping Pads and Best Tents guides for more advice on which suits you best.\n- Women’s sleeping bags: Our female testers have generally found very little difference between sleeping bags for men and those for women. Many manufacturers no longer make separate bags for women, but if that's something you want to look into, we suggest Sea to Summit, which makes a range of women's sleeping bags.\nHow We Tested\nAll our testing was done in the field in tents. Collectively our testers have more than 11 decades of experience in the wilderness. To test these bags, we hiked Alaskan peaks, Texas deserts, Hawaiian beaches, Michigan's Keweenaw Peninsula, and a range of other locations and conditions across the country. It's a rough life, but someone has to do it. This is not to say it's all fun and games—just ask my kids who've had to lie still many a morning while I zapped around their sleeping bags with an infrared thermometer looking for cold spots.\nWith a mix of body types and sleeping habits, we've been able to test which bags will keep even the coldest sleepers warm and which won't make those of us who sleep hot wake up sweating. Our picks are based on first-hand experience testing in the field on real trips (alas, we don't get paid to tromp around the wilderness). We take into account the warmth, how packable a bag is, how much it weighs, and how well it stands up to life on the trail or in the trunk.\nWhat All the Terms Mean\nProbably the most common question about sleeping bags is, “What temperature-rating sleeping bag should I get?” That's a good question, answered above, but it begs another question: What do those temperature ratings mean? There are often two ratings associated with temperature: temperature rating and comfort rating.\nTemperature rating is done using standardized tests overseen by the International Standards Organization (ISO), the same group that oversees things like programming languages and electrical standards. If you're in Europe, you might also see EN (European Norm) temp ratings. These are close enough to ISO ratings that you can compare them. ISO temperature ratings are done in a lab using standardized equipment under more or less ideal conditions. They also use base layers on the dummy. In the end, ISO temps are a means of comparison, but they don't mean that you will be warm at whatever temperature rating is given.\nComfort rating is more subjective. This is the temperature at which someone who sleeps cold will still feel comfortable. So if you tend to sleep cold, the comfort rating is the one to pay attention to. Incidentally, this is the rating given to most women's sleeping bags, because according to the industry, the average woman will feel colder than the average man in a bag with the same temp rating.\nBeyond knowing what the terms mean, also know this: Ratings are not precise. Our advice for those heading into snowy conditions where warmth is critical is to buy a bag rated 10 to 15 degrees colder than the coldest temps you expect to encounter.\nThere are more types of nylon out there than anyone can keep track of, which is where the denier rating system comes from. Denier is a measure used in fabrics that is based on the linear density of a fabric. The linear density is calculated by measuring how heavy the material is (in grams) for a length of 9,000 meters. Glad we cleared that up.\nWait what? 9,000 meters of what now? It turns out there are forms of fabric so thin it helps to have that much material to get a reliable weight out of them. The important takeaway is that denier means fabric weight. The higher the number, the thicker the fabric. Fun word nerd trivia: The word denier comes from the Latin word “Denarius,” which was a Roman coin.\nIn the case of sleeping bags, denier ratings for the nylon used typically run in the 10D to 40D range, though I have tested a few with single-digit-denier nylon. Also, watch out for all sorts of trademarked names for fabric. These have nothing to do with how thick or durable they are, they're just marketing. In my experience, testing over two dozen sleeping bags, 10D fabric is fine for a sleeping bag so long as you don't abuse it.\nWe covered what hydrophobic down is above, but there are a couple of other acronyms you'll see thrown around. The main two are DWR and PFC-free. DWR stands for “durable water repellent.” This waterproofness is commonly achieved through the use of a perfluorinated compound, better known to most of us as PFC. PFC-free means the waterproof coating on the down (or sometimes the nylon as well) doesn't contain any PFCs. Alternatives include wax, silicon, and sometimes plant-based sealants. Because waterproofness isn't as critical in sleeping bags (compared to a rain jacket), there's usually no difference between PFC-free sleeping bags and those that aren't. We try to recommend only PFC-free sleeping bags."
    },
    {
      "url": "https://www.wired.com/review/thermarest-neoloft-sleeping-pad/",
      "text": "My favorite place to wake up is in a sleeping bag, which is good because I tend to wake up a lot when sleeping in a sleeping bag. It's not the bag, it's the pad underneath me. I've tried them all (it's part of my job), and while some are definitely better than others, I've never found one that quite fulfilled every backpacker’s dream—a lightweight, packable sleeping pad that feels just like the bed you left at home.\nUntil now, that is. The Therm-a-Rest NeoLoft sleeping pad isn't the lightest at 25 ounces—goodbye, ultralight readers—but the 4.6-inch cushion is a true luxury, and it offers a great night's rest, which can be more valuable than shedding a few ounces.\nThe Great Weight Debate\nThere are two problems with carrying a big sleeping pad in the backcountry. First, there's the weight you have to carry, and then there's the amount of room it takes up in your pack. The ultralight community online will try to convince you that camp comfort—that is, your shelter and your sleeping set up—aren't as important as keeping weight down, so you can move fast.\nDepending on your goals in the backcountry, that may indeed be true. But after trying it for quite a few trips, I've found it's not the case for me. For me, carrying a little more weight in the form of a heavier tent and sleeping pad affords me a better night's sleep, which helps me (on average) to hike further than I do with less weight but poorer sleep.\nTherm-a-Rest's new NeoLoft pad steps into this weight/size/comfort debate by leaning heavily on the side of comfort. It is undeniably big, relative to something like Therm-a-Rest's XLite pads or Sea to Summit's Ether Light series (our two favorite ultralight sleeping pads). For all that, though, the Neoloft isn't that big when packed down, especially considering how big it is when you inflate it.\nThe NeoLoft reliably packs down to a size that's just larger than a Nalgene water bottle—about an inch bigger around and an inch taller for the regular wide size pad that I tested. It's a tight squeeze fitting the NeoLoft in my Hyperlite Junction 40 with the rest of my gear, but it works for shorter trips where I'm not carrying a ton of food. For trips longer than three or four nights, I'd want a 55L pack. (Naturally, this will depend a lot on the size of the rest of your gear. You can see what I carry at LighterPack.)\nI'll confess that I was dreading testing this pad. I didn't want to lug it with me, but when I actually loaded it up … I didn't really notice the extra 8 ounces over the Nemo Tensor I usually carry. Again though, I am not trying to win any ultralight prizes. Rather, I'm looking for the right balance between weight and comfort.\nSleeping Pad Technology\nI test organic mattresses for WIRED, and I use roughly the same criteria to judge sleeping pads. Comfort while sleeping comes down to how well your pad keeps you warm, how well it relieves pressure, how well it provides support, and how stable it is to sleep on."
    },
    {
      "url": "https://www.wired.com/gallery/best-reusable-water-bottles/",
      "text": "The Best Reusable Water Bottles That Aren’t Stanley Cups\nFeatured in this article\nReusable water bottles are a matter of personal taste, and everyone at WIRED has strong opinions on what rules supreme. At least four of us are practically surgically attached to our top pick—the Owala FreeSip Twist ($27)—but ask our tech director, Martin Cizmar, and he’ll refer them to as “adult sippy cups.” He’s forever loyal to his trusty Nalgene ($15), a bottle that transports him straight to the premillennial days of hacky sacks and curated mixtapes. Meanwhile, editor Adrienne So swears by her Yeti Yonder ($25), even if it costs nearly $10 more.\nWe've spent years testing, sipping, and spilling our way through the best water bottles to round up our favorites. A note to remember: You only need one reusable bottle (though I won't judge if you rotate between two). More than that defeats the environmental purpose of purchasing a reusable bottle in the first place. Also, be aware that some insulated bottles use lead solder. We've removed those from our list. We have some standards, after all.\nDoes your water need to be even cleaner? Check out our guide to the Best Backpacking Water Filters. Then get one of our Best Travel Mugs or Best Tote Bags.\nUpdated May 2025: I've added the Klean Kanteen TKWide Insulated Water Bottle, Brita Premium Filtered Water Bottle, and the Larq Bottle PureVis.\nA PSA on Lead\nSome water bottle companies use lead soldering in the manufacturing of their vacuum-sealed bottles. The viral Stanley tumbler is one of them; despite stating that no lead comes into direct contact with the consumer, the company has confirmed that pellets, some of which include lead, are used in the manufacturing process to seal the bottom of the cup. Ah, semantics. The lead is enclosed in stainless steel on the bottom of the cup, and if your bottle isn't dropped or otherwise damaged, it should not come in contact with your drink or skin. However, enough brands have moved toward other methods that we don't think it's necessary. The risk of exposure might be very low, but it should be zero.\nWe also reached out to more brands to find out whether they use lead. (Yeti didn't respond to emails, but the brand's FAQ section confirms it uses lead for sealing its insulated cups. We recommend the plastic bottle above if you like the brand and want a lead-free version.)\nInsulated vs. Uninsulated Bottles\nAn insulated water bottle consists of a double-wall construction with insulating materials that prevent heat transfer. Insulated bottles are heavier and can typically hold less water compared to their uninsulated counterparts, given similar exterior dimensions. However, the advantage is that they are typically vacuum-sealed to better maintain the temperature of the liquid inside for far longer periods.\nCondensation is typical in non-insulated water bottles, since the beads of water form on the exterior of the bottle. Packing the bottle inside your bag can be inconvenient, as the condensation comes into contact with your personal items. It can damage your bag and other things inside it. Insulated bottles are made of stainless steel and other similar materials that are durable and resistant to damage. The longer lifespan means less waste in manufacturing these water bottles, and you can maximize these resources to reduce environmental impact.\nInsulated water bottles are more expensive, since more technology and a complex manufacturing process are required. But you are also paying for reusability, since you can save more money in the long run as you won’t need to replace your water bottles as often as you would with disposable, single-use plastics.\nFor hiking and outdoor climbing trips, you may prefer uninsulated bottles because it means less weight to lug around, and the concern is to have enough water rather than cold water. For everything else, insulated works just fine.\nHow Often Should I Wash My Bottle?\nEven if they never hold anything but water, bottles get gross. Mold can grow quickly, especially if you leave the cap on. Straws and mouthpieces accumulate bacteria, oils, and grime from your mouth, and any dirt and dust they pick up in your backpack.\nSome bottles can go right in the dishwasher, but be sure to take everything fully apart first, like any silicone pieces that can trap bacteria. For lids that have more nooks and crannies, we recommend hand-washing by soaking them in soapy water and then scrubbing.\nGet yourself a bottle brush and straw brush—many kits are available that include both. Even if you don't use straws, the smaller brush can be used to get into any crevices. There are special bottle-cleaning tablets around, but cleaning with regular dish soap works perfectly fine.\nPlastic bottles have a tendency to trap odors over time. You can fix this by putting a teaspoon of bleach and a teaspoon of baking soda in the bottle, filling it up with water, and letting it sit overnight. Rinse it out well the next day.\nHow Much Water Do I Need?\nThe eight-glasses rule isn't exactly accurate, but it's a solid starting point. Since water intake is highly individualized (kind of like your bottle), it's best to consult your doctor about the right amount for you. Several lifestyle factors can influence your hydration needs. If you're active or sweat a lot, for example, you generally should increase your intake to make up for losses. Warmer temperatures can also make us thirstier.\nOn the other side, it's also possible to drink too much water. According to Harvard Health, the daily fluid intake for healthy adult men (including both drinks and food) should be about 3.7 liters a day, while for women, it's around 2.7 liters. Drinking too much water can also cause overhydration and sodium levels to drop to dangerous levels in a condition called hyponatremia. Certain medications can lead to water retention, which is why it can't hurt to double-check with your physician during your next check-up. In the meantime, if you're not thirsty and your urine is colorless or light yellow, you're likely doing great, sweetie.\nNext Up\nI'll be testing the Echo Flask, a hydrogen water bottle for $300, the Bink Day Bottle, the viral glass water bottle for $34, and Takeya's 18oz Actives Water Bottle With Spout Lid for $29.\nHonorable Mentions\nbkr Spiked Big Bottle 1L for $62: Glass water bottles remain the cleanest, nontoxic, and greenest choice. Bkr's signature silicone protects the glass from shattering but also adds an edgy, grippy texture. It won't dent or clang against surfaces, and if you drop it in a crowded room, it lands with silence.\nEllo Cooper Twist Stainless Steel Water Bottle for $19: The Ello Cooper Twist Stainless Steel Water Bottle is vacuum-insulated, double-walled, and designed with a screw-on lid and carry handle. The spout is a matter of preference, but I appreciate the ceramic opening, and if you like a chug cap, it’s a solid choice.\nCamelbak Eddy+ for $16: The Camelbak Eddy+ is a durable, lightweight, recycled plastic bottle with a straw lid. Adrienne So has had several of these for years. Just be sure to let the chew top air out daily because it’s prone to collecting mold if left damp.\nPura Big Mouth Insulated Bottle for $46: Pura bottles are thin, light, and made entirely from stainless steel, so there's no plastic or powder coating (which also means they may not withstand drops and bumps). They're Made Safe certified, meaning they're made without harmful ingredients. I don't love the silicone lids, as they're very thin and floppy, but you can unscrew the whole cap to sip right from the metal rim.\nAvoid These Bottles\nWater.io Daily+ for $100: This is a bottle that tracks your sips and reminds you to drink, which sounds great, but in practice, not the best. The battery life is short, lasting for 2 to 3 days, and it requires a proprietary charger. For $100, you’d expect more perks, like filtration or self-cleaning tech, but this bottle doesn’t deliver any of that. The water also picks up a metallic aftertaste that is far from refreshing.\nAir Up Water Bottle for $40: This bottle uses scented rings to try to trick your brain into thinking it isn't drinking plain water. WIRED writer Boone Ashworth was unimpressed. It didn't smell great, and you can't use the bottle without one of those rings. The beauty of a reusable bottle is that you spend money once and get free water for years. Here, you have to keep buying refills.\nLiberty Bottleworks Uninsulated Bottle for $23: The cap of this aluminum bottle is weird, flimsy, and confusingly shaped. Our tester got his fingers stuck in it a few times and said it's uncomfortable to twist. The bottle's outer coating isn't as tough as the matte powder coating on others, and the aluminum felt weak. (He could slightly flex it with his fingers.) Also, unlike with a stainless steel bottle, the interior is covered in a food-grade coating. It's BPA-free, according to Liberty, but people who want to avoid industrial coatings should steer toward stainless steel.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today."
    },
    {
      "url": "https://cna.st/affiliate-link/29CLTwheRZNbkdgVneC3Uq4F11oKkyKtDvxFBQSM9rveJqdUwztHnEa8xwSDx4nhEKBxduXZojqj86JugvuEQD9v1ToTbN8Gg8XQ2az5q2xvoztdyXWd7m7EX1cfMSePumtergueM7iTs6vLfjwSi8n9cJnpH1F5iSJauqHn52Xghg",
      "text": "Smallest Folding Gas Grill Kit\nFrom: Original price was: $107.97.$89.99Current price is: $89.99.\nSmallest Folding Gas Grill Kit\nFrom: Original price was: $107.97.$89.99Current price is: $89.99.Smallest Folding Gas Grill Kit Includes:\n- G2 Firebox Nano + X-Case Kit (L-Pins & Carbon Felt are included but not shown in images, Imported – choose Titanium or Stainless Steel)\n- Firebox Wood Flame Gas Burner & Ti Ember Glow Diffuser\n- Stainless steel Grill for Firebox Nano / Scout\nOur tried and proven Firebox Nano makes the worlds smallest gas grill. Thats not all, the Firebox Nano is multi-fuel capable so if you run out of fuel mother nature will provide twigs as a backup option! Also optional is a spirit burner for when you prefer to use alcohol. This stove is so multi-fuel capable, you can even use wood pellets!\nNano Stove Owners often refer to it as a “Gem of a stove” It’s an expression of genuine admiration for a product with simple sophistication. It’s surprisingly able to do so much with so little, earning its place in backpacks around the world.\nThe Firebox Wood Flame Gas burner is also unique and multi-functional. It has an airflow adjustment valve, which changes the flame from a blue stove-top flame to an orange ambiance flame. To grill, add the included titanium diffuser plate on top of the blue flame (when stove is off) and it converts the burner to a grill, or spreads the heat out further under your pan.\nA note from the designer, Steve, about the Firebox Nano…\nTo get a high BTU from such a small structure I knew it needed to breathe freely which lent itself very well to its minimalistic design. The small diameter arms and legs are spring tempered for strength. With the Nano, less is more. Less bulk, weight and complication with plenty of function. I use the Nano primarily with the Trangia Alcohol Burner. Secondarily (as backup) with wood (twigs and sticks) which works very well but does require a bit more of your attention. The Nano works perfectly with the Trangia alcohol burner both for heat sensitive cooking and fast boiling with a wide variety of cookware. If you prefer the clean and convenient experience of cooking over alcohol, the Nano-Trangia combination provides an excellent experience for all types of camping.\nNote: Fire safety is the responsibility of the person lighting the fire. Tags: Kit-Pac\nDimensions of Stove:\nWidth: 3.0″\nHeight: 4.75″\nFolded: .25″\nMore info about the Wood Flame Gas Gas Burner & Ti Ember Glow Diffuser\n- Airflow valve alters from stove flame to ambiance fire.\n- High efficiency.\n-\nEasy control.\n-\nClicks into place on all Firebox Stoves (G2 Original Firebox, Firebox Nano, Firebox Scout, Firebox Modular Freestyle).\n-\nFire restriction compliant in most areas (check local requirements).\n-\nIncludes Titanium Flame Diffuser / Radiant Grill Adapter.\n-\nIncludes mounting pins that work for either the 5” Firebox Stove and Firebox Freestyle (cut to fit).\n-\nRuns on standard butane cartridges.\nGas Burner Includes:\nGas Burner, (2) Gas Burner Pins for use with our larger stoves and Titanium Flame Diffuser / Radiant Grill.\nThe gas burner is easy to use, has fast boil times and keeps your pans soot free. Works in all weather conditions above -22 C. Fits with all propane/butane gas cartridges with EN417 compatible threaded valves. These cartridges are available in most countries around the world. Boils 1 liter of water in 3-5 minutes (varies according to weather and quality of fuel).\nTitanium Flame Diffuser / Radiant Grill Adapter disperses heat to a wider area for more even pan cooking or can be used to create radiant heat for grilling.\nAvailable option: LPG Fuel Adaptor (pictured above). This handy attachment allows you to use any Lindal valve (screw-top) backpacking stove such as the Trangia Gas Burner with a 16.4 oz. Coleman-style propane canister. These canisters are less expensive than standard compressed fuel cans, and are readily available in camping and hardware stores throughout the US and much of the world. This works with top-mount and remote canister stoves.\nSpecifications:\nGas Burner Weight: 8.1 oz.\nOutput: 2100 W\nLength: 3 ¼” x 1 ⅜” Wide\nHose: 15” Long\nDiffuser Weight: .6 oz.\nDiffuser Dimensions: 3 ¼” diameter.\nReviews (1)\nOnly logged in customers who have purchased this product may leave a review.\nRobert Pike\n(verified owner)This little kit is so handy and versatile. It sets up quickly and takes up very little space in my Kit-Pac along with a small butane canister. It is usually accompanied by my coffee kit and Box Pot, and other items depending on the endeavor. The other day my Firebox Kit made me a hero at work! A big thunderstorm knocked the power out at the shop about 6:30 and both coffee pots in the break room were empty. I had already made my coffee with my Aeropress using beans I had just ground using the electric coffee grinder I keep in my toolbox(the break room coffee is swill!). After an hour or so one of my co-workers started griping about how he hadn’t had his coffee yet. I grabbed my Kit-Pac from the car and set up the Nano and gas burner, boiled water in the Box Pot, ground more beans with my Firebox coffee grinder, then did the AeroPress thing. My co-workers were impressed to say the least. Thankfully the power came back on before I had to make coffee for the whole crew."
    },
    {
      "url": "https://www.wired.com/gallery/best-camping-chairs/",
      "text": "The Best Camping Chairs\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nWhen presented with a roundup of the best camping chairs, weather-beaten adventure types will no doubt ask, “What’s wrong with the ground?” But most people appreciate a little bit more comfort when sitting down outside. Thankfully, you can now find a huge choice of ingeniously engineered folding camping chairs to suit almost every outdoor scenario, from ultralight hiking stools to luxurious hammock styles and classic recliners.\nWhether you’re thru-hiking the Triple Crown or car camping with the kids, we’ve diligently relaxed in dozens of camping chairs to find the best for comfort, portability, and versatility, whatever space or budget. The one that fits your needs for car camping is the Coleman Forester Sling Chair ($63), but the Snow Peak bamboo chair ($250) is beautiful enough to use both inside and out.\nIf your kit is in need of an upgrade, don't forget to check out the rest of WIRED's outdoor guides, which includes the Best Binoculars, the Best Backpacking Sleeping Pads, and the Best Electric Bikes.\nHonorable Mentions\nA favorite of WIRED reviewer Scott Gilbertson, this low-profile, well-padded double design is lovely for cuddling up with someone in. It's even better all to yourself.\nWhat the high backed Helinox loses in backpacking portability—it’s a full 19 inches long when packed—it makes up for with a high backrest that supports your head. The soft slung seat is a treat for your backside.\nThis stool is too expensive to wholeheartedly recommend, but if you want a seat that isn’t the ground, it weighs just 1 pound, 3 ounces and packs to a tiny 3.5- by 12-inch package. This 15-inch-high seat is ideal for fast-and-light adventures.\nHow to Choose the Best Camping Chair\nPicking the right camping chair will enhance your time in the outdoors, whether you're thru-hiking the Pacific Crest Trail or pitching up at a boutique campground. Here's what to consider to find the ideal seat for your adventures.\nPortability: For backpacking beyond the campground carpark, weight and packed size are crucial. Ultralight chairs like those from Helinox and Nemo are designed to be easy to carry. Many hardcore hikers are happy to sit on the ground or take a simple foam sit mat like the Nemo Chipper ($20).\nIf you’re car camping, RV-ing, or heading to a festival, you have the luxury of more space and time and can prioritize comfort and durability over weight. If multiple trips from the car to the camp are not an issue, then sturdier chairs with headrests, foot rests, and cup holders are more luxurious, and generally nicer to sit in for longer.\nComfort: Low-slung ultralight camping chairs are surprisingly comfortable, but don’t be fooled—they’re not as kind to your behind as a luxury reclining design with a footrest and head support. But the comfort levels of larger campground chairs varies enormously. The classic director’s style chair offers an upright sitting position, and everyone likes to be near the same height when eating dinner. They’re also easier to get out of after a few dips in the cooler. High-backed, extra-wide options give you the opportunity to snuggle down and get cozy, but low chairs can be harder to get up from.\nHow easily, and compactly, a camp chair folds is also crucial for all but the largest truck or RV owners. We found those chairs that fold into long cylinders are easier to store at home, and fit in the car, but the compromise often comes with a lack of durability. Keep clear of those chairs bought at gas stations for $20. They do not last, and will end up in the landfill.\nMaterials and Durability: Aluminum tent pole frames are lightweight and resistant to rust, making them ideal for backpacking chairs. For example, Helinox uses sturdy DAC poles. However, we have found that larger people can bend these poles by sitting in the chair. Steel frames offer more strength but add weight, meaning they’re more suitable for car camping.\nSeat fabrics like polyester and nylon are common; polyester is quick-drying and mildew-resistant, while nylon tends to be tougher and more durable. Look out for recycled polyester, as it is increasingly common. We love the Snow Peak canvas chairs for looks and comfort, but be aware, they will get grubby and require washing, and they stay damp if it rains.\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today."
    },
    {
      "url": "https://www.wired.com/gallery/best-camping-sleeping-pads/",
      "text": "The Best Sleeping Pads For Campgrounds—Our Comfiest Picks\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nCamping doesn't have to mean roughing it, especially when it comes to getting a good night's sleep. There are sleeping pads thick enough, soft enough, and durable enough to rival your bed at home.\nFor years, we've been testing sleeping pads of all shapes and sizes in search of perfection. We haven't quite found it, but there a few that get close. Read on for our take on the best car camping mats. If you're heading out for some backpacking, we've got a separate guide to light and ultralight sleeping pads: The Best Backpacking Sleeping Pads.\nBe sure to read through our other outdoor guides, including the Best Tents, Best Backpacking Water Filters, Best Camp Stoves, and our Camp Cooking guide.\nUpdate May 2025: We've completely revamped this guide, splitting off a separate backpacking sleeping pad guide and simplifying our picks. We've also updated prices and links throughout.\nHow to Choose a Sleeping Pad for Camping\nThe goal of any sleeping pad is to keep you comfortable and warm, like you're still in your bed at home, or something close to it. Ideally you'll sleep so well you'll start calling it a camping bed. Keep the following tips in mind.\nKnow your intended use. When car camping, weight is irrelevant, and the more padding and insulation, the merrier. Don't waste money on lighter sleeping pads if you aren't going to be backpacking. Of course trunk space is limited, but none of our picks are too big. Similarly, consider the climate. If you plan to camp in Michigan in the fall where cold weather is all but guaranteed, you need a much more insulated pad to protect you from cold ground temps than you do camping in Colorado in the summer.\nKnow thyself. Everyone sleeps differently, and different pads will be better for different people. Are you a side sleeper who sleeps cold? Go for a thicker pad with more insulation. Sleep every which way and always wake up hot? Get an ultralight pad that's quiet, so your tossing and turning won't disturb your tent mates.\nConsider your entire sleep system. The pad is the foundation, but how warm you sleep will also be affected by your sleeping bag, pillow, even which base layers you bring. (Many people don’t know this, but sleeping bag temperature ratings assume you’re wearing a base layer.)\nComfort is key. Sleeping pads aren't the place to skimp and save money. Go for the biggest, thickest pad you can get. It might not quite be the mattress you left at home, but the closer it is the more you'll enjoy your camping trip.\nWhat Are R-Values?\nSimply put, they're a standardized number that gives you a way to compare sleeping pads made by different companies. Elsewhere I have called them a long con by the outdoor industry, which is how they started, but these days, after years of testing and comparing, I find them useful for judging how warm or cold two pads from different companies might be. The key is to look for the acronym ASTM (or ASTM FF3340) in the sleeping pad's spec sheet. Thankfully, REI has been pressuring brands to adopt this system, so most of the R-value listings you see today use the standardized system.\nWhat is an R-value then? A sleeping pad's R-value is a measure of how much it resists heat flow. (Get it? R for “resists.”) The scale is simple. An R-value of 2 means it resists heat flow twice as much as a value of 1. So a higher R-value means the pad will better insulate you from the ground. Unlike sleeping bags, where buying too warm a bag is going to be bad for summer camping, buying a high-R-value pad and using it in warm weather won't be a big deal. Generally speaking, R-values from 4+ are good for three-season use. Lower ratings are fine for summer but might be too cold for those shoulder season trips.\nThe problem is that the R-value by itself doesn't tell you much about how warm you personally will be. Even though an R-value of 4 might be good enough for me to sleep on in winter, it might not be good enough for you if you sleep cold. In isolation, R-values tell you very little, even the standardized ones. However, if you have a pad that's not cutting it and you know it's an R-2.5, you can look for a pad with R-4 or R-5 and know that it should be warmer, which is where R-values are useful.\nSleeping Pad Tips and Tricks\nI've had very few problems with any inflatable sleeping pad I've tested. Some have lost air, but I've never had one deflate completely. That said, there are some tricks to getting the best nights’ sleep and having a pleasant trip.\nDon't inflate your pad with your mouth: For one thing, some of these pads are huge, and it's just a pain, but also, your breath is warm and moist and you're injecting it into nylon, which is a recipe for mildew and mold. Most of the pads here are self-inflating. Resist the urge to blow them up. Give them a few minutes to do their thing and you'll avoid creating that mold-friendly environment. Sometimes manufacturers include a pump sack, which is fine, though I prefer a motorized option for pads that don't self-inflate.\nDon't over-inflate: Insulated sleeping pads work by putting air and material between you and the cold ground, but that doesn't mean you need to inflate it until it's taut. It varies by pad, and you'll want to experiment to find what works best for you on your particular pad, but I generally find that letting out some air yields a more comfortable sleep. The downside is that your pad isn't as thick, and you're more likely to bottom out. I find this isn't much of an issue for stomach or back sleepers, but if you're a side sleeper it might take some time to find the sweet spot between comfort and warmth.\nCarry a repair kit: All the pads recommended below come with some kind of patch kit for punctures. Make sure you throw it at the bottom of the stuff sack in case tragedy strikes. I also like to bring some Tenacious Tape, which I find often works better for repairing air pads. While I've never had a pad completely deflate on me overnight, I have developed a few leaks that required patching in the field. Avoid damage by keeping your tent floor clean, and check your campsite for any sharp objects before pitching your tent.\nSleeping Pad Storage and Care Tips\nStorage: The best way to store a self-inflating sleeping pad, if you have room, is unrolled and fully inflated in a dry place with the valve open. This helps preserve the self-inflating aspect. If you don't have room to do this … I've stored camping air mattresses for years in a half inflated, rolled up state, and, while they definitely lose their self-inflating aspect, they survived and remain comfortable. The key is to keep them dry. Any moisture for a prolonged period of time will cause mildew damage.\nPads that aren't self-inflating can be stored deflated and rolled up, though I still like to leave the valve open.\nCleaning and Care: Keeping your mattress clean will make it last longer. Never put one of these in the wash machine. Therm-a-rest recommends washing in a bathtub or using a hose, which is what I've always done. Just make sure you have the valve(s) closed before you get the pad anywhere near water. For stubborn stains, Therm-a-rest recommends “Formula 409, BioClean All-Purpose Cleaner, or other general household cleaner.”\nHonorable Mentions\nThe following sleeping pads didn't impress us as much as the ones above, but we’d still recommend them if none of the others strike your fancy.\nKelty Kush Queen Airbed for $120: This PVC-free queen-sized airbed from Kelty includes a pump that makes inflating a snap (make sure you charge it before you go), and the 6-inch-thick pad is plenty comfortable. It is not an insulated air mattress like the REI above, so it's best for warmer months, but it can double as a spare bed at home.\nSleeping Pads to Avoid\nNot every sleeping pad is a winner. We've tested and run into issues with the following models.\nExped Flexmat Plus: What if the cheap, light, and indestructible closed-cell foam mats like the iconic Z-Rest and RidgeRest were … giant? It's a fun idea, but the Exped Flexmat Plus is a noble failure. The problem with this extra-thick, 1.5-inch, closed-cell mat is that, while relatively light, cheap, and indestructible, the foam is hard and spikey. And by “spikey” we mean that it's literally just spikes that stab you while you sleep. Fans say it requires a break-in period. After six nights on it, reviewer Martin Cizmar begged the dungeon guard for release.\nBig Agnes Q-Core: Q-Core pads are comfortable out of the box, with impressive R-value and weight stats for the price. However, you should avoid them. The unique offset I-beam construction that makes this pad so light and comfortable is somewhat notorious for failing—which is exactly what happened to Cizmar after about a year of use. In our experience, which other reviews back up, the welds that hold the top and bottom together are prone to popping apart. After adding air, you'll have a large lump that grows over time, and duct tape cannot fix it.\nExped DeepSleep: If you're thinking about an inflatable Exped but are not fully committed to shelling out for the MegaMat 10, you may be inclined to try the thinner and cheaper DeepSleep. Don't do it. The DeepSleep is 3 inches thick instead of 4, but you'll feel that inch in your bones. The DeepSleep has rugged 75-denier fabric on top and bottom instead of the soft and stretchy 50-denier polyester you find on the top of the MegaMat and some competitors. The DeepSleep is a sturdy mattress and probably fine for some people, but it's not the Exped experience most sleepers are looking for. Stick with the MegaMat. —Martin Cizmar\nKlymit Static V2: Klymit's budget inflatable pad is popular with unfussy weekend warriors because of its price point (around $50) and impressive weight (1 pound). In fact, this is why I bought one for my now 10-year-old daughter when we ventured into the backcountry for the first time, with her stuff on my back. She didn't complain, but when I used it for a night, I found it was flimsy and offered comparable cushion and less heat retention than a closed-cell foam pad like the Z-Lite. The Z-Lite weighs a couple of ounces less, and you won't have to worry about puncturing it. The more expensive inflatable beds above are great, but if you're you're looking for a lightweight budget pick, I'd stay with closed-cell foam.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today."
    },
    {
      "url": "https://www.wired.com/gallery/best-backpacking-sleeping-pads/#660f0ed08a58e26788308bc0",
      "text": "The Best Backpacking Sleeping Pads\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nWhat are these sleeping pads you speak of? When I was young, all backpacking was uphill both ways and everyone slept on the ground in sleeping bags with only a half-inch of thin closed-cell foam between us and every pebble. We also filtered our water with our teeth and ate mainly raw meat and foraged ramps. Kids these days.\nStill, I suppose there is something to be said for getting a good night’s sleep at the end of a long day on the trail. These days, there’s no shortage of packable, lightweight sleeping pads to make sure no peas (or pebbles) ever disturb your slumber on your next backpacking trip. We've spent countless nights on all manner of sleeping pads, and we’re happy to report that in all this time we’ve never had one fail on us. That said, there are some standouts—looking at you, Nemo Tensor All Season—and a few to avoid.\nHow to Choose a Backpacking Sleeping Pad\nHere are some general guidelines to keep in mind when shopping for a new sleeping pad. When backpacking, we suggest sticking with inflatable pads or self-inflating pads (though these are generally heavier), which offer the best insulation and cushioning to size and weight. Whatever you specific needs, your goal is always to find the best warmth-to-weight ratio. More warmth means more weight. Keep the following tips in mind.\nKnow your intended use. Every ounce counts, and so does the packed size. Smaller, lighter pads take up less room in your pack and are great for a thru-hike where you're trying to minimize gear size to make room for food. Also, consider the climate. If you plan to camp in Michigan in the fall where cold weather is all but guaranteed, you need a much more insulated pad to protect you from cold ground temps than you do camping in the Everglades in August. Bonus tip: Don't camp in the Everglades in August.\nKnow thyself. Everyone sleeps differently, and different pads will be better for different people. Are you a side sleeper who sleeps cold? Go for a thicker pad with more insulation. Sleep every which way and always waking up hot? Get an ultralight pad that's quiet, so your tossing and turning won't disturb your tent mates.\nConsider your entire sleep system. The pad is the foundation, but how warm you sleep will also be affected by your sleeping bag, pillow, even which base layers you bring. (Many people don’t know this, but sleeping bag temperature ratings assume you’re wearing a base layer.)\nYou might need two. Sleeping pads are not a one-size-fits-all solution. A lightweight pad that's perfect on balmy summer nights isn't going to cut it at an alpine camp in early spring. It might be tempting to just get the summer pad and bring a heavier sleeping bag in spring, but this does not lead to restful nights. A good sleeping pad means the difference between being warm and getting rest or shivering all night, even in the same sleeping bag. Trust us. We do it so you don't have to.\nComfort is key. I know I joke about sleeping on tiny closed-cell-foam pads, but there's no need anymore. This guide is proof that comfortable sleeping pads exist and weigh next to nothing. Even though I really did sleep on the ground 35 years ago, you couldn’t pay me to do it now. Now I almost always bring two pads: one inflatable and one thin closed-cell foam. The latter gives me a place to sit in the evening and adds quite a bit of warmth and a no-slip sleeping surface when I need it at night.\nWhat Are R-Values?\nThey're a long con by the outdoor industry. Or at least, they were. Now they've been standardized so, in theory, you can compare brands’ R-values and it will mean something. If you see the acronym ASTM (or ASTM FF3340), it's using this new system. If you don't, it's pretty much made up. Thankfully, REI has been pressuring brands to adopt the new system, so most of the R-value listings you see today use the standardized system.\nSo what is an R-value then? A sleeping pad's R-value is a measure of how much it resists heat flow. (Get it? R for \"resists\"?) The scale is simple. An R-value of 2 means it resists heat twice as much as a value of 1. So a higher R-value means the pad will better insulate you from the ground. Unlike sleeping bags, where buying too warm of a bag is going to be bad for summer camping, buying a high R-value pad and using it in warm conditions won't be a big deal. You're just carrying more weight than you need to.\nThe problem is that this doesn't tell you much about how warm you personally will be. Even though an R-value of 4 might be good enough for me to sleep on snow, it might not be good enough for you if you sleep cold. In isolation, R-values tell you very little, even the standardized ones. However, if you have a pad that's not cutting it and you know it's an R-2.5, you can look for a pad with R-4 or R-5 and know that it should be warmer.\nSleeping Pad Tips and Tricks\nI've had very little problems with any inflatable sleeping pad I've tested. Some have lost air, but I've never had one deflate completely. That said, there are some tricks to getting the best nights sleep and having a pleasant trip.\nDon't inflate your pad with your mouth: For one thing, some of these pads are huge, and it's just a pain, but also your breath is warm and moist and you're injecting into nylon, which is a recipe for mildew and mold. Most manufacturers include some kind of pump sack these days, which is fine. There are also motorized pumps that weigh next to nothing, like the Flextail pump.\nDon't over-inflate: Insulated sleeping pads work by putting air and material between you and the cold ground, but that doesn't mean you need to inflate it until it's taut. It varies by pad. I generally find that letting out some air yields a more comfortable sleep. The downside is that your pad isn't as thick and you're more likely to bottom out. I find this isn't much of an issue for stomach or back sleepers, but if you're a side sleeper it might take some time to find the sweet spot between comfort and warmth.\nHonorable Mentions\nThere are dozens of sleeping pads on the market and we've tested most of them over the years. While none of these made our top picks, here are some more pads we've used and enjoyed.\nSea to Summit Ether Light XT for $150: At just 17.3 ounces for the regular, the Ether Light XT is only marginally heavier than our top pick ultralight pad, and those extra 4 ounces get you quite a bit more cushion. This is a 4-inch thick pad, compared to the 3 inches of the Therm-a-rest X-Lite, which makes it a better ultralight option for side sleepers. I also happen to like the baffle design better and it seems to be a little more durable, making this an excellent alternative ultralight pad. This is also one of the best budget pads around.\nSea to Summit Women's UltraLight Insulated Air Sleeping Mat for $169: We debated for some time whether women need different air mattresses. After some long conversations with our female testers, we decided there just isn't much difference. That said, this is a fine sleeping pad for anyone. It's very close to the Sea to Summit Ultralight above.\nExped Ultra 7R for $220: Our previous top pick for winter use, Exped's Utra 7R has down insulation side it to achieve the high R-rating. At under 2 pounds for the wide version it's not that heavy for a four season pad, but it is quite bulky, taking up considerable pack space due to the down. I have used this pad down to 20 degrees Fahrenheit and was very comfortable (in a 10-degree bag). Exped rates it to -20 degrees Fahrenheit. Exped's widget pump ($55) is excellent, tiny, doubles as a light around camp, and is necessary, as you don't want the moisture from your breath inside an insulated mat.\nSea to Summit Comfort Plus SI for $125: The self-inflating Comfort Plus inhabits an interesting borderland between car camping pad and backpacking pads. At 3 pounds it's definitely not light, but if you don't mind the weight it's definitely a comfortable option. The open-cell interior offers a nicely cushy sleeping experience. WIRED's Martin Cizmar says, “I'm a large-bodied side sleeper and my hips didn't bottom out. In fact, I found it was about 80 percent as comfy as our top pick car camping pad, MondoKing 3D.”\nREI Helix Insulated Air Sleeping Pad for $169: This REI pad is comparable to the other ultralight pads in this guide, but it's noisier and heavier. There's nothing wrong with this pad; it's plenty comfy and great for three-season use, but you can get the Sea to Summit Ether Light XT for $20 less and it's lighter.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today."
    },
    {
      "url": "https://www.wired.com/gallery/best-backpacking-sleeping-pads/#68150a759c460cecc577164b",
      "text": "The Best Backpacking Sleeping Pads\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nWhat are these sleeping pads you speak of? When I was young, all backpacking was uphill both ways and everyone slept on the ground in sleeping bags with only a half-inch of thin closed-cell foam between us and every pebble. We also filtered our water with our teeth and ate mainly raw meat and foraged ramps. Kids these days.\nStill, I suppose there is something to be said for getting a good night’s sleep at the end of a long day on the trail. These days, there’s no shortage of packable, lightweight sleeping pads to make sure no peas (or pebbles) ever disturb your slumber on your next backpacking trip. We've spent countless nights on all manner of sleeping pads, and we’re happy to report that in all this time we’ve never had one fail on us. That said, there are some standouts—looking at you, Nemo Tensor All Season—and a few to avoid.\nHow to Choose a Backpacking Sleeping Pad\nHere are some general guidelines to keep in mind when shopping for a new sleeping pad. When backpacking, we suggest sticking with inflatable pads or self-inflating pads (though these are generally heavier), which offer the best insulation and cushioning to size and weight. Whatever you specific needs, your goal is always to find the best warmth-to-weight ratio. More warmth means more weight. Keep the following tips in mind.\nKnow your intended use. Every ounce counts, and so does the packed size. Smaller, lighter pads take up less room in your pack and are great for a thru-hike where you're trying to minimize gear size to make room for food. Also, consider the climate. If you plan to camp in Michigan in the fall where cold weather is all but guaranteed, you need a much more insulated pad to protect you from cold ground temps than you do camping in the Everglades in August. Bonus tip: Don't camp in the Everglades in August.\nKnow thyself. Everyone sleeps differently, and different pads will be better for different people. Are you a side sleeper who sleeps cold? Go for a thicker pad with more insulation. Sleep every which way and always waking up hot? Get an ultralight pad that's quiet, so your tossing and turning won't disturb your tent mates.\nConsider your entire sleep system. The pad is the foundation, but how warm you sleep will also be affected by your sleeping bag, pillow, even which base layers you bring. (Many people don’t know this, but sleeping bag temperature ratings assume you’re wearing a base layer.)\nYou might need two. Sleeping pads are not a one-size-fits-all solution. A lightweight pad that's perfect on balmy summer nights isn't going to cut it at an alpine camp in early spring. It might be tempting to just get the summer pad and bring a heavier sleeping bag in spring, but this does not lead to restful nights. A good sleeping pad means the difference between being warm and getting rest or shivering all night, even in the same sleeping bag. Trust us. We do it so you don't have to.\nComfort is key. I know I joke about sleeping on tiny closed-cell-foam pads, but there's no need anymore. This guide is proof that comfortable sleeping pads exist and weigh next to nothing. Even though I really did sleep on the ground 35 years ago, you couldn’t pay me to do it now. Now I almost always bring two pads: one inflatable and one thin closed-cell foam. The latter gives me a place to sit in the evening and adds quite a bit of warmth and a no-slip sleeping surface when I need it at night.\nWhat Are R-Values?\nThey're a long con by the outdoor industry. Or at least, they were. Now they've been standardized so, in theory, you can compare brands’ R-values and it will mean something. If you see the acronym ASTM (or ASTM FF3340), it's using this new system. If you don't, it's pretty much made up. Thankfully, REI has been pressuring brands to adopt the new system, so most of the R-value listings you see today use the standardized system.\nSo what is an R-value then? A sleeping pad's R-value is a measure of how much it resists heat flow. (Get it? R for \"resists\"?) The scale is simple. An R-value of 2 means it resists heat twice as much as a value of 1. So a higher R-value means the pad will better insulate you from the ground. Unlike sleeping bags, where buying too warm of a bag is going to be bad for summer camping, buying a high R-value pad and using it in warm conditions won't be a big deal. You're just carrying more weight than you need to.\nThe problem is that this doesn't tell you much about how warm you personally will be. Even though an R-value of 4 might be good enough for me to sleep on snow, it might not be good enough for you if you sleep cold. In isolation, R-values tell you very little, even the standardized ones. However, if you have a pad that's not cutting it and you know it's an R-2.5, you can look for a pad with R-4 or R-5 and know that it should be warmer.\nSleeping Pad Tips and Tricks\nI've had very little problems with any inflatable sleeping pad I've tested. Some have lost air, but I've never had one deflate completely. That said, there are some tricks to getting the best nights sleep and having a pleasant trip.\nDon't inflate your pad with your mouth: For one thing, some of these pads are huge, and it's just a pain, but also your breath is warm and moist and you're injecting into nylon, which is a recipe for mildew and mold. Most manufacturers include some kind of pump sack these days, which is fine. There are also motorized pumps that weigh next to nothing, like the Flextail pump.\nDon't over-inflate: Insulated sleeping pads work by putting air and material between you and the cold ground, but that doesn't mean you need to inflate it until it's taut. It varies by pad. I generally find that letting out some air yields a more comfortable sleep. The downside is that your pad isn't as thick and you're more likely to bottom out. I find this isn't much of an issue for stomach or back sleepers, but if you're a side sleeper it might take some time to find the sweet spot between comfort and warmth.\nHonorable Mentions\nThere are dozens of sleeping pads on the market and we've tested most of them over the years. While none of these made our top picks, here are some more pads we've used and enjoyed.\nSea to Summit Ether Light XT for $150: At just 17.3 ounces for the regular, the Ether Light XT is only marginally heavier than our top pick ultralight pad, and those extra 4 ounces get you quite a bit more cushion. This is a 4-inch thick pad, compared to the 3 inches of the Therm-a-rest X-Lite, which makes it a better ultralight option for side sleepers. I also happen to like the baffle design better and it seems to be a little more durable, making this an excellent alternative ultralight pad. This is also one of the best budget pads around.\nSea to Summit Women's UltraLight Insulated Air Sleeping Mat for $169: We debated for some time whether women need different air mattresses. After some long conversations with our female testers, we decided there just isn't much difference. That said, this is a fine sleeping pad for anyone. It's very close to the Sea to Summit Ultralight above.\nExped Ultra 7R for $220: Our previous top pick for winter use, Exped's Utra 7R has down insulation side it to achieve the high R-rating. At under 2 pounds for the wide version it's not that heavy for a four season pad, but it is quite bulky, taking up considerable pack space due to the down. I have used this pad down to 20 degrees Fahrenheit and was very comfortable (in a 10-degree bag). Exped rates it to -20 degrees Fahrenheit. Exped's widget pump ($55) is excellent, tiny, doubles as a light around camp, and is necessary, as you don't want the moisture from your breath inside an insulated mat.\nSea to Summit Comfort Plus SI for $125: The self-inflating Comfort Plus inhabits an interesting borderland between car camping pad and backpacking pads. At 3 pounds it's definitely not light, but if you don't mind the weight it's definitely a comfortable option. The open-cell interior offers a nicely cushy sleeping experience. WIRED's Martin Cizmar says, “I'm a large-bodied side sleeper and my hips didn't bottom out. In fact, I found it was about 80 percent as comfy as our top pick car camping pad, MondoKing 3D.”\nREI Helix Insulated Air Sleeping Pad for $169: This REI pad is comparable to the other ultralight pads in this guide, but it's noisier and heavier. There's nothing wrong with this pad; it's plenty comfy and great for three-season use, but you can get the Sea to Summit Ether Light XT for $20 less and it's lighter.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today."
    },
    {
      "url": "https://www.wired.com/gallery/best-camping-tents/",
      "text": "The Best Tents for Camping in Any Weather\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nCamping is intense! No, really. If you're going camping, you will probably be in a tent. While we love cowboy camping under the stars when weather permits, not everyone does, which means most of the time, you're going to want a comfy tent. To help you figure out the best car camping tent for your next outdoor adventure, we've pooled our favorites from years of testing.\nThese are the best car and family camping tents tents we've tested. If you're headed into the backcountry, backpacking or bikepacking, be sure to check out our guide to the best ultralight backpacking tents you can buy.\nYou might also like our other outdoor guides, including the Best Day-Hiking Backpacks, Best Backpacking Water Filters, the Best Merino Wool Clothes, and the Best Rain Jackets.\nUpdated August 2025: We've split backpacking tents off to a new guide, revamped our picks for 2025, and updated links and prices throughout.\nTop 7 Car Camping Tents Compared\n| Tent | Price | Weight | Vestibules | Capacity | Number of doors | WIRED | TIRED |\n|---|---|---|---|---|---|---|---|\n| REI Base Camp 6 | $549 | 20 lbs., 11.5 oz. | 2 | 5-6 | 2 | Excellent value on a sturdy, weather-proof tent | It's hard to get the rain fly door to roll up out of the way |\n| Marmot Halo 4 | $549 | 13 lbs., 11.8 oz. | 2 | 3-4 | 2 | Steep sidewalls maximize livable space. | Doors are on the small side, no standing up in this one. |\n| Snow Peak Land Nest Dome Medium | $400 | 19.2 lbs | 2 | 4 | 2 | A luxe outdoor palace for those who want to camp in style. | Can get quite warm when pitched in the direct sun. |\n| Coleman Evanston 6-person | $140 | 20.9 lbs | 0 | 5-6 | 1 | Affordable and fine if you only camp a few days year | Setup is annoying, no vestibule, fiberglass poles don't last. |\n| Mountain Hardware Bridger 6 | $950 | 23 lbs., 15.4 oz. | 1 | 4-6 | 2 | Large livable space. | Expensive for what you get. |\n| MSR Elixir 4 | $490 | 9 lbs., 4 oz. | 2 | 4-6 | 2 | Best 4-person backpacking tent we've tested. Includes footprint | It's heavy, but split between two people it's managable. |\n| Decathalon Quechua | $249 | 10.8 lbs. | 1 | 2 | 2 | Quick and easy setup. Nearly dark inside even midday | Vestibule is tiny. |\nHow to Pick the Perfect Tent for You\nThere are hundreds of tents out there. If none of our top picks quite works for you, here are a few things to consider while doing your own research.\nKnow how you plan to use your tent. Are you a car camper? Backpacker? Bike packer? All of the above? If you're primarily headed to established campgrounds, there's no need for an expensive ultralight tent. By the same token, if you're not happy until the trail head is 20 miles behind you, it might be worth sacrificing living space to save weight; see our guide to the best backpacking tents. The unfortunate truth is that there are very few tents that work well in the backcountry and the campground. It's often worth buying a good backcountry tent and something cheap for campgrounds to spare your expensive tent the added wear and tear.\nKeep the weather in mind. “three-season” or “four-season” usually refers to how much ventilation (that is, mesh) the tent has along with how close to the ground the rain fly comes. For most people, a three-season tent is fine. But if you're planning to do some winter camping, or you want some protection against the occasional early or late winter squall, then a four-season tent might be appropriate.\nWhat specs are important?\n- Floor space: We look at all the dimensions, rather than the four-person or six-person designations. Those tend to assume that all campers are pint-sized people. Remember that you will probably want to keep spare clothes or a backpack in the tent itself, and that you need it to be long enough to stretch out comfortably for your height. Be aware, though, that there are some restrictions on tent size; check the regulations at the campground you're planning to visit.\n- Headroom: Can you stand up in the tent? How steep are the walls? The steeper the side walls the better, since that gives you more space to move around.\n- Storage areas: Are there plenty of pockets to stash your smaller items? The more mesh pockets the merrier, especially higher pockets that won't reduce sleeping space. We love corner pockets for stashing headlamps to give the tent a nice even light to read by.\n- Large vestibules: Go for two if you can. And make sure they're big enough to store boots and other gear that you want to stay dry but don't want to have in the tent with you.\n- Mesh windows: You want ventilation and cross breezes for those warmer nights. Good tents will offer mesh windows down low, so the breeze is actually blowing on you while you sleep. Ideally these should open and close so you can stop that breeze when it's cool.\n- A footprint: We suggest some kind of ground cloth or footprint in most cases, so you'll want to factor in the added cost if the tent you're interested in doesn't have one.\n- Materials: These days, most tents are made from either polyester or nylon that's coated in polyurethane, silicone, or acrylic to help it shed water. Most, but not all, tents come seam-sealed so water doesn't leak in, but if yours isn't, REI has a great guide to doing it yourself. We also like to look for more eco-friendly, possibly healthier fabrics that have certifications like bluesign.\nHow We Tested Camping Tents\nIt was intense! Sorry. That joke never gets old. And sometimes it really was. We test tents individually in most cases, taking them on real trips. We try to use them the way you do, in the real world. It really doesn't matter much how a tent performs in a lab, what matters is how it does after a long day hiking as a storm is moving in or when you get to the campsite late and you're trying to set it up by headlights. That's when a tent's performance, easy of setup, and durability really matter. We try to test each tent for several weeks at time to get a feel for what it's like to live in it day in and day out. We also set them up in our backyards during more extreme weather to see how they perform, this is usually the best, most entertaining part of the testing process."
    },
    {
      "url": "https://www.wired.com/story/the-best-sleeping-bags-for-every-adventure/#bestcar",
      "text": "All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nJohn Muir famously set off for the mountains with “some bread and tea in a pair of blankets with some sugar and a tin cup.” I admire his ultralight spirit and disdain for comfort on the trail, but I'd be willing to bet that if Muir were around today, he'd bring a good down sleeping bag with him, if for no other reason than they're lighter than old blankets. The tea is essential though. I can't argue with that.\nWhether you’re following Muir into the backcountry, are planning the perfect family camping trip, or are trekking the Camino de Santiago, there's a sleeping bag for that. No matter how you travel, where you're headed, or how much comfort you seek, after years of testing we've found the best sleeping bags for everyone.\nUpdated November 2024: We've added Nemo's excellent Disco 15 bag as a new top pick for side sleepers, removed a sold-out Marmot bag and a discontinued Rab bag, and updated links and prices throughout.\nAdrienne So and Martin Cizmar contributed to this guide.\nBe sure to read through our other outdoor guides, including the Best Sleeping Pads, Best Tents, Best Camp Stoves, and our Camp Cooking guide.\n- Best for Backpackers: Mountain Hardware Bishop Pass 15\n- Best for Car Campers: REI Siesta Hooded 20\n- Best All-in-One Sleep System: Zenbivy Bed\n- Best Ultralight: Sea to Summit Spark 15\n- Best for Side Sleepers: Nemo Disco 15\n- Best for Active Sleepers: Therm-a-Rest Questar 20\n- Best For Spring and Fall Trips: Magma 15 Sleeping Bag\n- Best Quilt: Therm-a-rest Vesper 32\n- Best for Kids: REI Kindercone\n- Best Synthetic Sleeping Bag: Nemo's Forte 20\n- How to Pick the Perfect Sleeping Bag\n- How We Tested\n- What All The Terms Mean\nSpecial offer for Gear readers: Get WIRED for just $5 ($25 off). This includes unlimited access to WIRED.com, full Gear coverage, and subscriber-only newsletters. Subscriptions help fund the work we do every day.\nThe Best Sleeping Bag for Backpackers\nMountain Hardware's Bishop Pass 15 offers the best warmth-to-weight ratio while also managing to pack down small and not be too expensive. It isn't perfect, but it strikes the best compromise for most backpackers, being warm enough for the shoulder seasons and light enough (2 pounds and 5.4 ounces) that you won't mind it even when you barely need it in the summer. I have slept in this bag for more than two weeks, with nighttime temps ranging from 28 to 65 degrees Fahrenheit, and, yes, it was too much in the heat as a sleeping bag. But on those warmer nights, I unzipped it and covered myself like a warm blanket. For everything else, I slept very well. It's a versatile bag.\nThe Bishop Pass 15 uses 650-fill-power down wrapped in a 20-denier water-resistant ripstop nylon shell. (Note: You'll often see 20-denier written as 20D; see below for more on what those terms mean.) One of the great things about this bag is the draft collar and face gasket feature, which does a great job of keeping your head warm. With the drawcord cinched down, you can conserve even more body heat. This is one of the few bags I've tested where I didn't feel the need for a hat. The insulation does a good job of staying where it should; I didn't find any bad cold spots in this bag.\nMy only gripe about this bag is that it's tight—there's not much room for anything but me. That makes it efficient and keeps you warmer, but this is not a good option if you're looking for something roomy (see the Therm-a-Rest Questar below). I also don't love the zipper. The pull glows in the dark, which is great, and the zipper doesn't snag much, but in my experience, it also doesn't pull as easily as others. Still, those are minor gripes about a bag that gets the rest right.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 26°F / -3°C\n- Fill: 650 Fill-Power Down\nThe Best Sleeping Bag for Car Campers\nCar-camping sleeping bags aren’t a place to spend lots of money. Should your best efforts to cocoon warmth around you fail, there is, after all, a car to retreat to. That's why we love the REI Siesta Hooded 20—it's plenty warm and affordable. It's also not a mummy bag, because you're not climbing Denali; why cramp yourself if you don't have to? The Siesta's rectangular cut makes for a much roomier, more comfortable bag. The Siesta is made of recycled polyester throughout, with a polyester filling. Despite that, the lining on this bag is noticeably softer than many others in this guide.\nThe Siesta's 20-degree rating makes it enough for three-season trips, and unlike most rectangular bags, the Siesta has a hood, which helps on those cold nights. What makes this such a versatile bag, though, is the double zipper system. There's a full-length zipper, which means you can turn it into a quilt on warmer nights, and there's also a second partial-length zipper on the other side so you can have more airflow when you want it. (You can also now zip two Siestas together, which wasn't possible with earlier versions.)\n- Temp rating: 20°F / -6°C\n- Fill: 650 Fill-Power Down\nBest All-in-One Sleep System\nThe Zenbivy Bed 25 (9/10, WIRED Recommends) is hands down the most comfortable backcountry sleeping experience I've ever had. It wouldn't be my top pick for extreme situations, but so long as your expected temperatures fit in Zenbivy's range, it doesn't get more comfortable than this. The Zenbivy isn't just a sleeping bag though. It's a sheet, hood, and quilt-style bag that can be combined in various ways depending on what you want.\nThe top sheet that covers the sleeping pad is made of 50-denier polyester pongee, which is wonderfully soft and feels like your bed at home. The sheet has the hood portion of the sleeping bag attached to it. Then you lay the top quilt (made of 20D nylon) over that. This is the coolest, loosest way to use the system, perfect for those warm nights. This is how I did most of my testing since I sleep rather warm. Should the temperature drop, you can zip the quilt foot box up into a mummy bag configuration and zip the upper sides to the bottom sheet. I did this on a couple of cooler nights in the Keweenaw Peninsula when it got quite frigid.\nWhat I didn’t like as much is the sleeping pad that comes with the full Zenbivy Bed. It’s plenty comfortable, but it’s also heavy. I used it for a few car camping trips, but if you’re primarily interested in backpacking, skip it and find something lighter in our sleeping pad guide. I tested the 25F bag, but there's also a 10F version if you want something warmer.\nIf you're done with mummy bags and aren't planning extreme mountaineering trips, the Zenbivy is worth considering; it is the best night's sleep I've ever had in the backcountry.\n- Temp rating: 25°F / -4°C\n- Comfort rating: 35°F / 2°C\n- Fill: 700 Fill-Power Hydrophobic Down\nBest Ultralight Sleeping Bag\nThe Sea to Summit Spark 18 is my favorite ultralight sleeping bag. Sure, most ultralight enthusiasts use a quilt, but aside from the Zenbivy, I haven't found a quilt I like. The Spark weighs a mere 1 pound 9.7 ounces, the lightest bag in this guide. It also has the smallest pack size of any bag I've tested in this temperature range. With the included compression sack, this thing is truly tiny. It's got most of the benefits of a quilt and none of the negatives (like getting a bit uncomfortable on chilly fall nights), making it a good option for thru-hikers or anyone wanting to save ounces.\nI should say that the Sea to Summit Spark series bags were recently updated from the version I tested last year. The temperature rating has been bumped down 3 degrees, but the main difference addressed the one thing I dislike about the version I tested: The thin inner liner has been modestly upgraded to 10D nylon. The outer shell uses a PFC-free DWR coating on 10D nylon. It's still thin, and I suggest you baby this one, but even my thinner version has held up just fine. We've been testing Spark bags since 2018, when our tester took one to Comic-Con, and haven't had any durability issues.\nThe down fill is also PFC-free and made of 850+ hydrophobic down. The zippers are on the small side, but they slide well and rarely if ever snag on the bag. I've slept in this bag down to 30 degrees, and honestly, even that night I woke up hot. But this is more a testament to how hot I sleep than bag performance (which is good). Like the bishop pass, this is a tight-fitting bag. It's plenty comfy, but you need to love the mummy shape.\nWhile I have tested the 18-degree model (replaced by the new 15F), there is a whole range of Spark's: 45F, 30F, 15F, and 0F. At $549, the Spark 15 is not cheap, but high-end, ultralight gear typically comes with a hefty price tag. If you have extra cash, the Spark Pro line is worth considering as well. I haven't tested it yet, but the full-length zipper that allows the bag to become more like a quilt is interesting.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 29°F / -2°C\n- Fill: 850 Fill-Power Goose Down\nBest for Side Sleepers\nI'm always on the lookout for the best gear for side sleepers, which, when camping, usually means a quilt. For most of the year, the best side sleeper setup is the thickest self-inflating sleeping pad suitable for the distance you're carrying it (if you're only going to buy one pad, I like the Sea to Summit Comfort Plus) and a quilt of the appropriate weight. But once you get down below freezing, the quilt can be a liability as you can roll over the wrong way and crack open your bubble, losing all your warm air instantly. In those situations, I love Nemo's Disco 15. This down mummy bag was designed with a “spoon shape” for side sleepers and has a little extra room in the elbows and knees so you can roll over onto your side without feeling like you're slipping into a straight jacket.\nIt's built for temps down to 15 degrees and has zippered gills you can open to avoid overheating in the 40s, though I kept them all closed in the mid-30s and wasn't overly warm. The hood is also a little looser than most mummy bags and comes with a draft collar that you can use to tuck yourself under, but that doesn't seal tight like more traditional mummies. Given the extra roominess and the fact that it's only 650-fill power down, this bag doesn't pack down as small as some 15-degree bags, but if you want higher fill power you'll pay an obscene amount. —Martin Cizmar\nBest for Active Sleepers\nI once made the mistake of calling a sleeping bag a “mummy bag” in front of my then 8-year-old who exclaimed, “What? Who would want to be a mummy?” Good question, kid. The answer is no one. The “mummy” design is all about warmth, not comfort. But let's face it—most of us are not sleeping in situations where our survival is at stake. Therm-a-Rest has addressed this with what it calls W.A.R.M. fit, which stands for “with additional room for multiple” positions. Indeed, this bag is very roomy for a mummy design. I was able to draw my legs up when side-sleeping and spread out considerably more than with most of the other bags in this guide. If you toss and turn through the nights, and don't want a quilt-style bag, this would be my top pick.\nThe Questar uses a 20D Polyester DWR-coated outer shell fabric, which does a great job of helping the bag stay dry even when your feet press up against the walls of the too-small tent you're testing. The inside is nylon taffeta. This bag comes with Therm-a-Rest's SynergyLink Connectors, which you can use to secure the sleeping bag to the pad underneath. This, combined with the slightly wider cut, makes this one of the more comfortable bags I've used.\nWeighing 2 pounds, 3 ounces, it isn't the lightest bag at this temperature rating, but it is one of the warmest. Therm-a-Rest comfort-rates this bag to 32 degrees, but I used it several nights in Michigan's Porcupine Mountains in temps down to 25 and found it plenty warm. The Questar series is also available in 32-degree and 0-degree versions. We have not tested either, but if you're looking to save some weight and know you won't be in extreme cold, the 32-degree model is worthwhile.\n- Temp rating: 20°F / -6°C\n- Comfort rating: 32°F / 0°C\n- Fill: 650 Fill-Power Nikwax Hydrophobic Down\nBest for Spring and Fall Trips\nREI Co-Op's Magma 15 is a no-nonsense down sleeping bag. It doesn't have a lot of frills, it just gets the job done. It's the bag I most often grab for fall and early spring trips where cold weather may arrive unannounced. It has an excellent draft collar that’s very good at keeping out the chill.\nThe outside is a 15-denier nylon ripstop (Bluesign approved, with a non-fluorinated DWR coating to keep moisture at bay). Baffles are variably spaced and not stitched through, which helps the fill stay put and minimizes cold spots. I also really like the Magma hood, which is warm and stays on your head throughout the night. There's a nice interior stash pocket I use to keep my headlamp handy.\nThe Magma series comes in a bewildering array of sizes and shapes—there are nine sizes to choose from, ranging from Short Narrow, which weighs 2 pounds, to Long Wide, which is nearly 3 pounds. One of my favorite features of this bag is the anti-snag zipper, which genuinely doesn't snag, because there's a woven barrier that keeps the down baffle away from the zipper. The zipper is also full-length, extending from the bottom of the foot box to the collar. REI also makes a 30-degree version of the Magma. I have not tested it, but if you only plan to go out in the summer months, that would be my suggestion.\n- Temp rating: 15°F / -9°C\n- Comfort rating: 21°F / -6°C\n- Fill: 850 Fill-Power Down\nA Quilt for Warmer Trips\nQuilts are preferred by gram-counting backpackers because they dispense with the unhelpful half of a sleeping shell. The bottom side of a down sleeping bag gets mashed down anyway, meaning there's no lofted insulation for added warmth. The quilt market has no shortage of cottage quiltmakers serving ultralighters and hammockers—I bought a solid one off Etsy last year. Therm-a-Rest's top-of-the-line Vesper, though, has everything you could ask for in a lightweight quilt. The 32-degree version weighs less than a pound, and ratcheting down the included comprehension sack will get it to roughly the size of a Nalgene bottle.\nThanks to 900-fill down insulation, it was more than toasty enough for nights in the low 40s in the Canadian Rockies. The down is hydrophobic, though I didn't douse it for testing. The 32-degree Vesper is cut more generously than the 20-degree version and comfortably covers my larger body frame. This is the bag I would take on any backpacking trip—if you're pushing below this temperature, you'll want to build a system with layers.\n- Temp rating: 32°F / 0°C\n- Fill: 900 Fill-Power Hydrophobic Down\nA warmer alternative: If you want to save a little cash on a Therm-a-Rest quilt and push the temp rating down well below freezing, consider the Therm-a-Rest Corus ($310). This quilt uses less expensive 650-fill-power down (more on fill power here), which drops the price by $100 while adding 20 degrees of comfort rating and just 10 ounces of weight, keeping the quilt well below 2 pounds. The Corus has a 20D nylon shell rather than the 10D found on the Vesper, which adds both weight and durability. I only pushed it into the low 40s in my testing but found I had to stick a foot out or I baked under it. I suspect the 20-degree rating might be on the conservative side. —Martin Cizmar\nKid-Friendly Sleeping Bags\nKids' sleeping bags are cut smaller so your little ones don't have to heat up a huge, adult-size sleeping bag to stay warm. While that's 100 percent true, let's be honest, a lot of the appeal of kid-size sleeping bags is the lower price. The REI Kindercone bag fills both needs, being cut to a smaller size and relatively cheap. I would take the temperature rating with a grain of salt though. There is no comfort rating, but if there were, my guess would be around 35 degrees.\nThe Kindercone makes a great car camping bag, and you can backpack with it, but it's awkward. I spent four nights in the Pisgauh Wilderness lugging this thing around for my son. It's heavy (3 pounds and 3 ounces) and huge. Our hiking distances weren't that long, so after one day of it hogging half my pack, I took to just carrying the Kindercone in my hand. As I said, it's best for car camping. For backpacking, I'd consider something that compresses a bit smaller, like the REI Co-Op Zephyr 25 ($149).\nWhile the Kindercone is a fine bag, once my kids hit about 4 feet, I put them in adult bags. I did so for two reasons. First, the temperatures we've camped in have mostly been warm enough that staying warm wasn't a concern—summers in the mountains and the Northwoods of Michigan. It's never cold enough that I'm worried about them in a 20-degree adult bag. The second reason is that sleeping bags last a long time and are a significant investment. I wanted something that would last them through their teens, however tall they might be. (Properly cared-for sleeping bags should last decades. I recently retired the North Face Blue Kazoo bag my parents bought me in 1992.) So do you need a to buy kids' bag? For younger kids, I would say yes; for older kids, probably not.\n- Temp rating: -25°F / 4°C\n- Fill: Polyester fibers\nThe Best Synthetic Sleeping Bag\nNemo's Forte 20 is a 20-degree synthetic-fill sleeping bag. It's best used as a summer bag, possibly a three-season bag, depending on where you live. While it has 20 in the name and is technically rated to 20 degrees (see below for more on what that means), the comfort rating is 30 degrees. In my testing, this feels more like where you'd want to stay temperature-wise with this bag.\nThe outer shell uses a 30-denier recycled polyester ripstop with an inside liner made from 20-denier recycled polyester taffeta. It does a good job of holding back the moisture that often forms inside a tent, which I discovered after one very soggy night of testing. The fill is what Nemo calls Zerofiber insulation, which is made from 100 percent postconsumer recycled content fibers. The Zerofiber packs down remarkably small—this is the most compact synthetic-fill bag I've tested in this temp range—and retains its ability to trap warmth even when wet.\nWhat I like most about this bag, and nearly all of Nemo's sleeping bags, is the wider cut through the torso area down to the knees. Like the Therm-a-Rest Questar above, this bag is almost a hybrid of a mummy bag and your father's good old 1970s square sleeping bag. Which is to say, this bag is roomy. The downside is that there's more dead space your body has to heat, but as someone who sleeps warm anyway, I'll take the extra room.\n- Temp rating: -20°F / -7°C\n- Comfort rating: 30°F / -1.1°C\n- Fill: Synthetic\nHow to Pick the Perfect Sleeping Bag\nA sleeping bag is typically one of the most expensive pieces of camping gear you'll buy. If none of our picks strike your fancy, here are some general guidelines.\nAre you car camping? Thru-hiking the PCT? Headed out overnight in the August heat? Plotting a winter ski traverse of the Karakoram Himalaya? Which sleeping bag is right for you depends on how you're going to use it, especially the temperatures you plan to camp or backpack in, and how you sleep—hot, cold, in between.\nUnfortunately, there isn't an ideal sleeping bag that works in all climates. If you encounter a wide range of conditions in your camping, I would consider two bags. Get one nice down bag for colder conditions and a cheaper, lightweight synthetic-fill bag for summer use.\nAs with most things in the outdoor world, you're going to pay more for lightweight materials, so if you don't need them because, for example, you're just car camping, don't pay extra for an ultralight bag. Maybe don't even pay for a down bag. Synthetic bags are generally the best budget sleeping options for those camping in the heat.\nBy the same token, if you're primarily a summer hiker, doing the Appalachian Trail in sections, you don't need a 0-degree bag. Identify your use and then look for a sleeping bag that suits you best. Also, take the temperature rating with a grain of salt. Everyone sleeps differently. I almost always sleep warm, which means I don't need a 0-degree bag in anything but the harshest situation. My colleague Adrienne So is roughly the opposite and uses a 0-degree bag in 40-degree weather. Neither one of us is “right,” we've just learned to shop around how we sleep.\nThere are two types of insulation used in today's sleeping bags, down feathers and synthetic fibers. Down comes primarily from geese and ducks. Synthetics range from nylon to polyester. The insulation works by creating pockets of air, either through the structure of a feather or the structure of a synthetic fiber. These pockets of air then trap your body heat, keeping it close, and you warm. The more loft there is—the more air pockets there are—the warmer you will be and the lower the sleeping bag's temperature rating will be.\nIn most situations, a down sleeping bag is the superior choice. It's warmer for the weight, packs smaller, and is lighter. Where down fails is when it gets wet. Wet down is generally useless—all those air pockets that trap heat are gone. Synthetics on the other hand retain more warmth when wet. No one wants to sleep in a wet sleeping bag, but if you think that's a possibility, synthetic is the way to go.\nIn recent years down has been challenged with what's marketed as hydrophobic or “dry down,” which is treated with water-repellent coatings that cause the feathers to repel water. In our experience testing, these bags do better than regular down when wet, and in many cases, they're as good as synthetics. The trade-off is that when dry, they don't have quite the loft of regular down. If you're worried about water and want to stick with down, hydrophobic down is the best choice.\nThere is also the ethical question of down. Most down is a byproduct of the food industry. The Responsible Down Standard tries to ensure that down is ethically sourced, but PETA has shown that it's far from perfect. We leave that judgment call to you, but before you rush off to buy a synthetic, remember that it involves plenty of hazardous chemicals and questionable factory working conditions.\nAfter the type of insulation, it's worth considering these factors.\n- Temperature rating: Choose a sleeping bag rated a little bit lower than the lowest temperature you expect to encounter. If you're a three-season backpacker in the southern US, the lowest you're likely to hit is around freezing, so I'd suggest a 20-degree bag. If you sleep cold, you might go down more to 10 degrees.\n- Fill power: This means how much insulation is in the bag. The higher the fill-power number the warmer the bag will be. See our fill power explainer for more information.\n- Weight: If your backpacking weight is important, you want to stay as light as you can while still staying warm. Make sure to compare bags with the same temperature rating and ideally the same fill power—otherwise, you're making an apples-to-oranges comparison.\n- Design and features: Remember to consider the extras. Do you want a full-length zipper? Do you want a full hood? Or a way to strap your bag to your pad? How about stash pockets? Sleeping bags can have quite a bit of functionality beyond keeping you toasty.\n- Your overall sleep setup: How effective your sleeping bag is, and how warm you stay, also depends on factors like your sleeping pad and which tent you're using. See our Best Sleeping Pads and Best Tents guides for more advice on which suits you best.\n- Women’s sleeping bags: Our female testers have generally found very little difference between sleeping bags for men and those for women. Many manufacturers no longer make separate bags for women, but if that's something you want to look into, we suggest Sea to Summit, which makes a range of women's sleeping bags.\nHow We Tested\nAll our testing was done in the field in tents. Collectively our testers have more than 11 decades of experience in the wilderness. To test these bags, we hiked Alaskan peaks, Texas deserts, Hawaiian beaches, Michigan's Keweenaw Peninsula, and a range of other locations and conditions across the country. It's a rough life, but someone has to do it. This is not to say it's all fun and games—just ask my kids who've had to lie still many a morning while I zapped around their sleeping bags with an infrared thermometer looking for cold spots.\nWith a mix of body types and sleeping habits, we've been able to test which bags will keep even the coldest sleepers warm and which won't make those of us who sleep hot wake up sweating. Our picks are based on first-hand experience testing in the field on real trips (alas, we don't get paid to tromp around the wilderness). We take into account the warmth, how packable a bag is, how much it weighs, and how well it stands up to life on the trail or in the trunk.\nWhat All the Terms Mean\nProbably the most common question about sleeping bags is, “What temperature-rating sleeping bag should I get?” That's a good question, answered above, but it begs another question: What do those temperature ratings mean? There are often two ratings associated with temperature: temperature rating and comfort rating.\nTemperature rating is done using standardized tests overseen by the International Standards Organization (ISO), the same group that oversees things like programming languages and electrical standards. If you're in Europe, you might also see EN (European Norm) temp ratings. These are close enough to ISO ratings that you can compare them. ISO temperature ratings are done in a lab using standardized equipment under more or less ideal conditions. They also use base layers on the dummy. In the end, ISO temps are a means of comparison, but they don't mean that you will be warm at whatever temperature rating is given.\nComfort rating is more subjective. This is the temperature at which someone who sleeps cold will still feel comfortable. So if you tend to sleep cold, the comfort rating is the one to pay attention to. Incidentally, this is the rating given to most women's sleeping bags, because according to the industry, the average woman will feel colder than the average man in a bag with the same temp rating.\nBeyond knowing what the terms mean, also know this: Ratings are not precise. Our advice for those heading into snowy conditions where warmth is critical is to buy a bag rated 10 to 15 degrees colder than the coldest temps you expect to encounter.\nThere are more types of nylon out there than anyone can keep track of, which is where the denier rating system comes from. Denier is a measure used in fabrics that is based on the linear density of a fabric. The linear density is calculated by measuring how heavy the material is (in grams) for a length of 9,000 meters. Glad we cleared that up.\nWait what? 9,000 meters of what now? It turns out there are forms of fabric so thin it helps to have that much material to get a reliable weight out of them. The important takeaway is that denier means fabric weight. The higher the number, the thicker the fabric. Fun word nerd trivia: The word denier comes from the Latin word “Denarius,” which was a Roman coin.\nIn the case of sleeping bags, denier ratings for the nylon used typically run in the 10D to 40D range, though I have tested a few with single-digit-denier nylon. Also, watch out for all sorts of trademarked names for fabric. These have nothing to do with how thick or durable they are, they're just marketing. In my experience, testing over two dozen sleeping bags, 10D fabric is fine for a sleeping bag so long as you don't abuse it.\nWe covered what hydrophobic down is above, but there are a couple of other acronyms you'll see thrown around. The main two are DWR and PFC-free. DWR stands for “durable water repellent.” This waterproofness is commonly achieved through the use of a perfluorinated compound, better known to most of us as PFC. PFC-free means the waterproof coating on the down (or sometimes the nylon as well) doesn't contain any PFCs. Alternatives include wax, silicon, and sometimes plant-based sealants. Because waterproofness isn't as critical in sleeping bags (compared to a rain jacket), there's usually no difference between PFC-free sleeping bags and those that aren't. We try to recommend only PFC-free sleeping bags."
    },
    {
      "url": "https://www.wired.com/gallery/the-best-backpacking-tents/",
      "text": "The Best Backpacking Tents\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nPicking the best backpacking tent is in-tents. It's arguably the most important piece of backpacking gear you'll buy. You want a shelter that's strikes the right balance between weather protection, living space, durability, and weight.\nTo help you find the best backcountry shelters for every trip, whether you're thru-hiking or just out for the weekend, we've spent years (collectively) living out of dozens of tents in all kinds of inclement weather, from the rain-soaked Pacific Northwest, to the high alpine mountains of Colorado, to frigid Wisconsin winters. We've tested tents from big brands like REI Co-Op, Nemo, and Big Agnes, as well as smaller companies like Hilleberg, Gossamer Gear, and Six Moon Designs. These are the best tents we've found.\nOnce you've got your tent sorted, I recommend finding the perfect backpacking sleeping pad, a great sleeping bag, and some merino base layers to round out your backcountry sleep system. Need a car camping tent? We’ve got a guide to the best camping tents too.\nTent Vocabulary\nShopping for tents you'll quickly find yourself immersed in a world of unfamiliar terms, trying to decipher what it means that a DFC pyramid has a welded bathtub floor. Here's our guide to the terms you need to understand.\nSingle/Double Walled: A double walled tent is the most common, consisting of an inner tent (wall 1) and a rainfly (wall 2) between you and the elements. A single walled tent is, um, a single wall. The advantage of a single-walled tent is that it's lighter. The advantage of a double walled tent is that condensation (usually) escapes to the outer wall and doesn't drip on you while you're sleeping. We recommend both types.\nFreestanding: Does the tent stand up by itself or do you have to stake it out? If it stands up on its own through pole tension, it's a freestanding tent. If it doesn't, it's not. There are also some hybrid designs, often referred to as semi-freestanding, where you just have to stake out one end.\nWhen I started this guide, I was firmly in the freestanding camp. Freestanding tents seemed easier to deal with, and in some ways they are. Most camping tents these days are freestanding. After testing dozens of non-freestanding tents through, I realized freestanding wasn't as big of an advantage as I thought. All non-freestanding means is that you'll have to stake out your tent when you're pitching it. If you're expecting wind or rain you'll want to do that anyway, even if your tent is “freestanding.” The biggest downside to non-freestanding or semi-freestanding tents is that you can't easily move them once they're set up.\nVestibule: In a double-walled tent, the rainfly is usually staked out away from the door of the inner tent. That leaves a space that is not in the tent but is still protected from the rain and elements. The vestibule is a good place for stashing wet gear and cooking when it's raining, and it helps make an otherwise small tent feel much larger. Generally speaking, the bigger the vestibule, the better.\nDCF/Cuben Fiber: Dyneema Composite Fiber (DCF) is also known as Cuben fiber. Both are industry terms for tents made of Dyneema, which is a very strong, very light fabric. It's also very expensive and can be annoyingly crinkly, but when it come to going as light as possible, DCF is difficult to top. For a full breakdown of all the materials used in tents, see Tent Materials below.\nPeak Height: How tall the tent is at its highest point. Depending on the shape of the tent, this may or may not be helpful, but it can indicate how much headroom to you have in the tent. In single pole tents though, the peak height is typically high but slopes off quickly, meaning you don't have as much headroom as this number might back you think.\nDoors: Two-person and larger tents need two doors. Climbing over your hiking partner in the middle of the night isn't fun for anyone. Pretty much every two-person and larger tent I've tested lately has had two doors, but some also have a second full size vestibule, which is nice.\nWhat to Look For in a Tent\nA tent needs to be big enough for you (and a hiking partner if you have one) and all the gear you're bringing. Ideally it’ll have enough room, solid protection from the elements, while remaining lightweight. Here are some of the things to keep in mind when shopping for a backpacking tent.\nFloor Space: Not all two-person tents actually fit two people and all their gear; same with every other size tent. The thing to look at when comparing is the total floor space and the layout of that space. You want enough room for the tent to be livable should you be pinned down by bad weather. Pay special attention to which sleeping pads will fit the interior space, especially if you plan to use some of the newer, extra-cushy, extra-wide sleeping pads. Also be sure to look for tent floors that are heavier denier than the sides, as the floor is what will take most of the wear and tear.\nVestibule Space: The more, the better. Years of tent testing has taught me that the bigger the vestibule, the better the tent will be.\nPackability: Your tent is probably the biggest piece of gear in your pack (unless you're carrying a bear canister). Make sure you have room. Bigger tents (3P and up) often benefit from a compression stuff sack, which helps get them down to more manageable size. I also sometimes pack tent and rainfly separately when carrying a larger tent, which makes them easier to arrange inside your pack.\nWeight: A lightweight tent means less weight on your back. This is especially important for long-distance hikers, though we'd all love to carry less.\nSeasons: Most of our picks below are three-season tents, which means they're good for late spring, summer, and early fall camping. They aren't the best for snow though. We do have a couple four-season picks and we'll be testing some more mountaineering tents down the road. A four-season tent isn't going to keep you any warmer, but a full length rainfly that comes all the way to the ground will stop the wind and snow from getting inside.\nZippers: The heavier, the better. A lot of ultralight tents these days are moving to #3 zippers, which are indeed lighter, but at the expense of robustness. When it comes to zipping up my shelter, I like to err on the side of durability.\nTent Materials\nBackpacking tents are generally made of three main fabrics: silicone-coated nylon, (silnylon), silicone-coated polyester (silpoly), and Dyneema or Dyneema composite fabric (DCF), also known as Cuben fiber.\nDyneema tents are generally a little lighter, definitely stronger, and popular for ultralight backpacking because of the weight savings. Unfortunately, DCF is also very expensive. In my testing, they’re very loud in the wind, and the packed size is larger than a nylon or polyester tent. If you have the money, these are the lightest, toughest tents on the market.\nComparing silicone-coated polyester and nylon is not the apples-to-apples comparison it might seem like it would be. The problem is there are many factors that affect the final product beyond just the fabric. Variables like the exact fiber type used, the way the fiber is woven, the thread count, the denier rating, the coating thickness, and more all play a role that make it impossible to say nylon is better than polyester, or the opposite.\nProponents of polyester argue that nylon absorbs more water, which then makes it stretch and sag more than polyester. This is true, but I have a silnylon tent (the Hilleberg Akto) and have had no problem with sagging even in multiday rains. (If you do get some sagging, retensioning your guylines usually fixes the issue.) On the other hand, polyester often “mists” or leaks more easily than nylon, and it's not as durable. Those things are both true, but I also have a silpoly tent (an older MSR Elixir), and it's proved plenty durable; I haven't had any issues with misting. I happen to think both fabrics are fine. None of the tents we recommend below, whether silnylon or silpoly, have had any of these issues in our testing.\nPackaged Weight vs. Trail Weight\nWhy two weights? Who knows, but there's an easy solution: Ignore the trail weight.\nThe longer answer is that manufacturers want their tents to seem as light as possible so they came up with “trail weight,” which usually means the weight of just the tent, poles, and rainfly. But you need stakes, stuff sacks, and guylines too, and these things add to the weight. Trail weight doesn't match what you'll be putting on your back. That said, if you already have your stakes and guylines dialed in, and just want to know how much a new tent weighs, trail weight can be useful.\nAll of the weights in the guide below ignore any published weights and are what I got weighing each tent on my scale.\nHonorable Mentions\nThere are a lot of tents out there to choose from. Here are a few more we've tried and liked, but that didn't quite make our top picks.\nThe Lunar Solo (7/10, WIRED Review) is a fantastic value for the money. It's very light, packs down to a tiny ball, ventilates very well for a single-walled tent, and it's easy to pitch once you figure out how to do it. It does suffer from the condensations that any single wall tent will have, namely, you're going to be touching wet walls in humid conditions, but I found that the mesh walls, combined with the sliding vestibule and top vent made it pretty easy to keep condensation under control. This one was almost our top pick for best ultralight solo tent, but I do want to test the Durston X-Mid before I declare a top pick.\nThe MSR Freelite (8/10, WIRED Recommends) is a great ultralight, freestanding tent. It's semi-freestanding—you have to stake out the foot end—but I've found it very stable and great for shorter trips with family members. I also like the two-person version as a solo shelter for summer trips.\nSea and Summit's “three-plus season” tent is capable enough in almost any weather while staying crazy light—just 3 lbs., 5 oz. for the two-person model. Our tester used this tent on a five-day trip to Loon Lake in northern California in early October, a true “shoulder season” trip with daytime highs in the 80s, nighttime lows in the 40s, and overnight winds of up to 60 mph. The Telos Plus fared well, despite the wind. It's roomy enough with 27 sq. feet of interior space, and 9 sq. feet of vestibule around each door. We also like that the fly can be pitched separately and the pole bag turns into a glow stick when you stick your headlamp in it.\nMy suggestion for four-person trips is to split into two groups, each with a two-person tent. It just makes every tent more livable, and makes weight distribution easier. However, when my kids were little, there was no way two of them were sleeping in a tent in the woods without me, so I did once lug this tent into the backcountry. Despite the weight (just under 8 lbs), I do like it. It's roomy enough for four people with a good amount of gear inside as well. There’s double vestibules with enough room to keep boots and other gear out of the weather, though cooking under the vestibule is cramped and tricky. On the whole though, this is one of the better hybrid front/backcountry tents available.\nNext Up\nIn the summer of 2025, we'll be testing the new MSR Hubba Hubba (which is no longer its trademark red and white, and is now called the Hubba Hubba LT), Nemo's revamped Dagger Osmo series, along with the one-person Nemo Hornet. Finally, we'll spend some more time with the ultralight favorite, the Durston X-Mid, a strong contender for best ultralight tent.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today."
    },
    {
      "url": "https://www.wired.com/gallery/best-backpacking-sleeping-pads/",
      "text": "The Best Backpacking Sleeping Pads\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nWhat are these sleeping pads you speak of? When I was young, all backpacking was uphill both ways and everyone slept on the ground in sleeping bags with only a half-inch of thin closed-cell foam between us and every pebble. We also filtered our water with our teeth and ate mainly raw meat and foraged ramps. Kids these days.\nStill, I suppose there is something to be said for getting a good night’s sleep at the end of a long day on the trail. These days, there’s no shortage of packable, lightweight sleeping pads to make sure no peas (or pebbles) ever disturb your slumber on your next backpacking trip. We've spent countless nights on all manner of sleeping pads, and we’re happy to report that in all this time we’ve never had one fail on us. That said, there are some standouts—looking at you, Nemo Tensor All Season—and a few to avoid.\nHow to Choose a Backpacking Sleeping Pad\nHere are some general guidelines to keep in mind when shopping for a new sleeping pad. When backpacking, we suggest sticking with inflatable pads or self-inflating pads (though these are generally heavier), which offer the best insulation and cushioning to size and weight. Whatever you specific needs, your goal is always to find the best warmth-to-weight ratio. More warmth means more weight. Keep the following tips in mind.\nKnow your intended use. Every ounce counts, and so does the packed size. Smaller, lighter pads take up less room in your pack and are great for a thru-hike where you're trying to minimize gear size to make room for food. Also, consider the climate. If you plan to camp in Michigan in the fall where cold weather is all but guaranteed, you need a much more insulated pad to protect you from cold ground temps than you do camping in the Everglades in August. Bonus tip: Don't camp in the Everglades in August.\nKnow thyself. Everyone sleeps differently, and different pads will be better for different people. Are you a side sleeper who sleeps cold? Go for a thicker pad with more insulation. Sleep every which way and always waking up hot? Get an ultralight pad that's quiet, so your tossing and turning won't disturb your tent mates.\nConsider your entire sleep system. The pad is the foundation, but how warm you sleep will also be affected by your sleeping bag, pillow, even which base layers you bring. (Many people don’t know this, but sleeping bag temperature ratings assume you’re wearing a base layer.)\nYou might need two. Sleeping pads are not a one-size-fits-all solution. A lightweight pad that's perfect on balmy summer nights isn't going to cut it at an alpine camp in early spring. It might be tempting to just get the summer pad and bring a heavier sleeping bag in spring, but this does not lead to restful nights. A good sleeping pad means the difference between being warm and getting rest or shivering all night, even in the same sleeping bag. Trust us. We do it so you don't have to.\nComfort is key. I know I joke about sleeping on tiny closed-cell-foam pads, but there's no need anymore. This guide is proof that comfortable sleeping pads exist and weigh next to nothing. Even though I really did sleep on the ground 35 years ago, you couldn’t pay me to do it now. Now I almost always bring two pads: one inflatable and one thin closed-cell foam. The latter gives me a place to sit in the evening and adds quite a bit of warmth and a no-slip sleeping surface when I need it at night.\nWhat Are R-Values?\nThey're a long con by the outdoor industry. Or at least, they were. Now they've been standardized so, in theory, you can compare brands’ R-values and it will mean something. If you see the acronym ASTM (or ASTM FF3340), it's using this new system. If you don't, it's pretty much made up. Thankfully, REI has been pressuring brands to adopt the new system, so most of the R-value listings you see today use the standardized system.\nSo what is an R-value then? A sleeping pad's R-value is a measure of how much it resists heat flow. (Get it? R for \"resists\"?) The scale is simple. An R-value of 2 means it resists heat twice as much as a value of 1. So a higher R-value means the pad will better insulate you from the ground. Unlike sleeping bags, where buying too warm of a bag is going to be bad for summer camping, buying a high R-value pad and using it in warm conditions won't be a big deal. You're just carrying more weight than you need to.\nThe problem is that this doesn't tell you much about how warm you personally will be. Even though an R-value of 4 might be good enough for me to sleep on snow, it might not be good enough for you if you sleep cold. In isolation, R-values tell you very little, even the standardized ones. However, if you have a pad that's not cutting it and you know it's an R-2.5, you can look for a pad with R-4 or R-5 and know that it should be warmer.\nSleeping Pad Tips and Tricks\nI've had very little problems with any inflatable sleeping pad I've tested. Some have lost air, but I've never had one deflate completely. That said, there are some tricks to getting the best nights sleep and having a pleasant trip.\nDon't inflate your pad with your mouth: For one thing, some of these pads are huge, and it's just a pain, but also your breath is warm and moist and you're injecting into nylon, which is a recipe for mildew and mold. Most manufacturers include some kind of pump sack these days, which is fine. There are also motorized pumps that weigh next to nothing, like the Flextail pump.\nDon't over-inflate: Insulated sleeping pads work by putting air and material between you and the cold ground, but that doesn't mean you need to inflate it until it's taut. It varies by pad. I generally find that letting out some air yields a more comfortable sleep. The downside is that your pad isn't as thick and you're more likely to bottom out. I find this isn't much of an issue for stomach or back sleepers, but if you're a side sleeper it might take some time to find the sweet spot between comfort and warmth.\nHonorable Mentions\nThere are dozens of sleeping pads on the market and we've tested most of them over the years. While none of these made our top picks, here are some more pads we've used and enjoyed.\nSea to Summit Ether Light XT for $150: At just 17.3 ounces for the regular, the Ether Light XT is only marginally heavier than our top pick ultralight pad, and those extra 4 ounces get you quite a bit more cushion. This is a 4-inch thick pad, compared to the 3 inches of the Therm-a-rest X-Lite, which makes it a better ultralight option for side sleepers. I also happen to like the baffle design better and it seems to be a little more durable, making this an excellent alternative ultralight pad. This is also one of the best budget pads around.\nSea to Summit Women's UltraLight Insulated Air Sleeping Mat for $169: We debated for some time whether women need different air mattresses. After some long conversations with our female testers, we decided there just isn't much difference. That said, this is a fine sleeping pad for anyone. It's very close to the Sea to Summit Ultralight above.\nExped Ultra 7R for $220: Our previous top pick for winter use, Exped's Utra 7R has down insulation side it to achieve the high R-rating. At under 2 pounds for the wide version it's not that heavy for a four season pad, but it is quite bulky, taking up considerable pack space due to the down. I have used this pad down to 20 degrees Fahrenheit and was very comfortable (in a 10-degree bag). Exped rates it to -20 degrees Fahrenheit. Exped's widget pump ($55) is excellent, tiny, doubles as a light around camp, and is necessary, as you don't want the moisture from your breath inside an insulated mat.\nSea to Summit Comfort Plus SI for $125: The self-inflating Comfort Plus inhabits an interesting borderland between car camping pad and backpacking pads. At 3 pounds it's definitely not light, but if you don't mind the weight it's definitely a comfortable option. The open-cell interior offers a nicely cushy sleeping experience. WIRED's Martin Cizmar says, “I'm a large-bodied side sleeper and my hips didn't bottom out. In fact, I found it was about 80 percent as comfy as our top pick car camping pad, MondoKing 3D.”\nREI Helix Insulated Air Sleeping Pad for $169: This REI pad is comparable to the other ultralight pads in this guide, but it's noisier and heavier. There's nothing wrong with this pad; it's plenty comfy and great for three-season use, but you can get the Sea to Summit Ether Light XT for $20 less and it's lighter.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today."
    },
    {
      "url": "https://www.wired.com/gallery/best-camping-tents/#687e4d217620ac6563eee04a",
      "text": "The Best Tents for Camping in Any Weather\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nCamping is intense! No, really. If you're going camping, you will probably be in a tent. While we love cowboy camping under the stars when weather permits, not everyone does, which means most of the time, you're going to want a comfy tent. To help you figure out the best car camping tent for your next outdoor adventure, we've pooled our favorites from years of testing.\nThese are the best car and family camping tents tents we've tested. If you're headed into the backcountry, backpacking or bikepacking, be sure to check out our guide to the best ultralight backpacking tents you can buy.\nYou might also like our other outdoor guides, including the Best Day-Hiking Backpacks, Best Backpacking Water Filters, the Best Merino Wool Clothes, and the Best Rain Jackets.\nUpdated August 2025: We've split backpacking tents off to a new guide, revamped our picks for 2025, and updated links and prices throughout.\nTop 7 Car Camping Tents Compared\n| Tent | Price | Weight | Vestibules | Capacity | Number of doors | WIRED | TIRED |\n|---|---|---|---|---|---|---|---|\n| REI Base Camp 6 | $549 | 20 lbs., 11.5 oz. | 2 | 5-6 | 2 | Excellent value on a sturdy, weather-proof tent | It's hard to get the rain fly door to roll up out of the way |\n| Marmot Halo 4 | $549 | 13 lbs., 11.8 oz. | 2 | 3-4 | 2 | Steep sidewalls maximize livable space. | Doors are on the small side, no standing up in this one. |\n| Snow Peak Land Nest Dome Medium | $400 | 19.2 lbs | 2 | 4 | 2 | A luxe outdoor palace for those who want to camp in style. | Can get quite warm when pitched in the direct sun. |\n| Coleman Evanston 6-person | $140 | 20.9 lbs | 0 | 5-6 | 1 | Affordable and fine if you only camp a few days year | Setup is annoying, no vestibule, fiberglass poles don't last. |\n| Mountain Hardware Bridger 6 | $950 | 23 lbs., 15.4 oz. | 1 | 4-6 | 2 | Large livable space. | Expensive for what you get. |\n| MSR Elixir 4 | $490 | 9 lbs., 4 oz. | 2 | 4-6 | 2 | Best 4-person backpacking tent we've tested. Includes footprint | It's heavy, but split between two people it's managable. |\n| Decathalon Quechua | $249 | 10.8 lbs. | 1 | 2 | 2 | Quick and easy setup. Nearly dark inside even midday | Vestibule is tiny. |\nHow to Pick the Perfect Tent for You\nThere are hundreds of tents out there. If none of our top picks quite works for you, here are a few things to consider while doing your own research.\nKnow how you plan to use your tent. Are you a car camper? Backpacker? Bike packer? All of the above? If you're primarily headed to established campgrounds, there's no need for an expensive ultralight tent. By the same token, if you're not happy until the trail head is 20 miles behind you, it might be worth sacrificing living space to save weight; see our guide to the best backpacking tents. The unfortunate truth is that there are very few tents that work well in the backcountry and the campground. It's often worth buying a good backcountry tent and something cheap for campgrounds to spare your expensive tent the added wear and tear.\nKeep the weather in mind. “three-season” or “four-season” usually refers to how much ventilation (that is, mesh) the tent has along with how close to the ground the rain fly comes. For most people, a three-season tent is fine. But if you're planning to do some winter camping, or you want some protection against the occasional early or late winter squall, then a four-season tent might be appropriate.\nWhat specs are important?\n- Floor space: We look at all the dimensions, rather than the four-person or six-person designations. Those tend to assume that all campers are pint-sized people. Remember that you will probably want to keep spare clothes or a backpack in the tent itself, and that you need it to be long enough to stretch out comfortably for your height. Be aware, though, that there are some restrictions on tent size; check the regulations at the campground you're planning to visit.\n- Headroom: Can you stand up in the tent? How steep are the walls? The steeper the side walls the better, since that gives you more space to move around.\n- Storage areas: Are there plenty of pockets to stash your smaller items? The more mesh pockets the merrier, especially higher pockets that won't reduce sleeping space. We love corner pockets for stashing headlamps to give the tent a nice even light to read by.\n- Large vestibules: Go for two if you can. And make sure they're big enough to store boots and other gear that you want to stay dry but don't want to have in the tent with you.\n- Mesh windows: You want ventilation and cross breezes for those warmer nights. Good tents will offer mesh windows down low, so the breeze is actually blowing on you while you sleep. Ideally these should open and close so you can stop that breeze when it's cool.\n- A footprint: We suggest some kind of ground cloth or footprint in most cases, so you'll want to factor in the added cost if the tent you're interested in doesn't have one.\n- Materials: These days, most tents are made from either polyester or nylon that's coated in polyurethane, silicone, or acrylic to help it shed water. Most, but not all, tents come seam-sealed so water doesn't leak in, but if yours isn't, REI has a great guide to doing it yourself. We also like to look for more eco-friendly, possibly healthier fabrics that have certifications like bluesign.\nHow We Tested Camping Tents\nIt was intense! Sorry. That joke never gets old. And sometimes it really was. We test tents individually in most cases, taking them on real trips. We try to use them the way you do, in the real world. It really doesn't matter much how a tent performs in a lab, what matters is how it does after a long day hiking as a storm is moving in or when you get to the campsite late and you're trying to set it up by headlights. That's when a tent's performance, easy of setup, and durability really matter. We try to test each tent for several weeks at time to get a feel for what it's like to live in it day in and day out. We also set them up in our backyards during more extreme weather to see how they perform, this is usually the best, most entertaining part of the testing process."
    },
    {
      "url": "https://www.wired.com/gallery/best-day-hiking-backpacks/#62ab510ac5ef5252e5286616",
      "text": "The Best Day-Hiking Backpacks for Every Adventure\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nDay hikes can mean a 30-mile trek over the mountains, a quick summit run, or a walk across town with the kids. In almost every case, you're going to want a pack with room for water, food, rain gear, a small first aid kit, and personal items. The more you carry, the bigger the pack you'll need to carry it.\nWhether you're traveling fast and light or hauling gear for the family, we've tested dozens of packs to find the most comfortable, durable, and easiest-to-organize packs. We're confident that we've found the best day-hiking backpack, no matter what your needs are.\nOnce you've got your pack, check out the rest of our outdoor buying guides, including the Best Backpacking Water Filters, the Best Merino Wool Clothes, and the Best Rain Jackets.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today.\nWhat to Look for in a Day-Hiking Pack\nDay-hiking packs come in a nearly endless array of shapes and sizes, with everything from ultra-minimalist frameless packs to 35-liter monsters with separate sleeping bag compartments. The best day-hiking backpack for you will depend on what you're doing, but after thousands of trail hours, here are some things that are key to getting the right pack:\nDoes it fit? This is the single most important thing about any pack. Make sure the pack you want fits your body, or carrying it will suck no matter how many great features it has. I highly recommend heading to your local outdoor retailer and trying packs weighted with sandbags. This experience will tell you more about which pack is right than anything else. If that's not possible, read the manufacturer's suggestions on fit and sizing, because the standards will vary widely.\nDoes it have a frame? The vast majority of packs over 10 liters have some kind of internal frame, whether it's aluminum or titanium rods, a stiff plastic framesheet, or a simple sheet of foam. The stiffer and stronger the frame, the more comfortably it will carry heavier loads (generally). Frameless packs are fine up to about 8 pounds or so. After that, they tend to get very uncomfortable over long hauls.\nHow do you access items in the pack? There's no right way here, but different methods work better for different people. I happen to like rolltop, dry-bag style top loaders, but other people love bags with front access, which is sometimes called a panel loader. Most day packs offer access from the top in some way, whether its a roll top or a drawstring.\nMany top loading day packs have a lid for smaller items and an expandable sleeve that can fit extra gear. Panel loaders have zippers or other fasteners on the front of the pack to allow access all the way around. Some packs combine top access with a side zipper, letting you get into the main compartment without taking the pack completely off. And then there is Mystery Ranch, with its distinctive Y-shaped zipper access that's somewhere between top loading and panel loading but also its own thing.\nWhat’s the back panel? Larger, heavier packs often offer a nice mesh back panel that will help keep you cooler. Some packs have other venting systems, like Osprey’s AirScape back panel, which has a channel down the middle that helps with airflow. Anything that sits directly on your back is going to get sweaty.\nDoes it have a hip belt? If you’re carrying more than 10 pounds, we recommend a hip belt. Unless you’re rucking and weight is the point—in that case, carry on. Everyone else, get a pack with a hip belt, and maybe even something with hip-belt pockets for quick access to your Lara bars.\nExtra features to look for: Side pockets are handy for storing frequently accessed items. Mesh pockets that fit water bottles are especially handy. Mesh pockets offer easy access, but zippered pockets make sure nothing falls out on rough scrambles. Is there a sternum strap? (These help keep shoulder straps where they should be). How about a loop for an ice ax or trekking poles? Do the shoulder straps have a way to attach a quick-capture clip? These are all nice extras.\nHow Big of a Pack Do I Need?\nA “day hike” is a common description of an all-day outing, but when it comes to picking a pack, you need to be more precise. The best pack for a 4-miler with the family is different than the best pack for a half-day trail run, which is different than the best pack for hauling climbing gear to your favorite crag. The best day packs are versatile enough to handle multiple use cases, but some things, especially trail running and cycling, call for more specialized gear.\nThe first place to start is how big of a pack you need. Here's a rough breakdown of pack sizes in liters.\n- Up to 10 liters: Small packs are built for traveling light. Think running vests for long trail runs, and small packs for short hikes. These are generally very low profile, with room for a jacket, some water and snacks, and your personal items.\n- 11-25 liters: Packs in this range are great for longer days out or activities/conditions that require more gear. Hikers have room for a jacket (maybe a compact fleece or puffer jacket) and food, water, or a small camera. Runners can fit a larger hydration bladder. I find the 15-25 liters range to be ideal for everything from a walk in the woods to mountain biking to trail running.\n- 25-35 liters: The gear-hauling end of the day pack world, these packs are great for handling climbing gear on a approach or rain gear and food for the kids on family hikes. These packs tend to have more padding in the shoulder straps, making them better for heavy loads. This is also a good size for any winter adventures, when you need to carry extra layers.\n- 35+ liters: These are primarily backpacking packs, though some climbers might need the larger capacity.\nWhat Should I Bring?\nWhat you need on a day hike varies a lot depending on your outdoor skill level, environment, and weather, to name just a few factors. To give a detailed list is impossible, but a good rule of thumb is to always carry water, some food, a rain jacket, and a small first aid kit for blisters and cuts.\nBeyond these essentials other items you might want to consider include, map and compass, knife, some way of making fire, headlamp or flashlight, sunscreen, hat, and any personal items you need (like medication, prescription glasses, etc).\nHonorable Mentions\nWe've tested dozens of packs over the years. These did not quite make our top picks, but are still great packs and might be perfect for what you need.\nMystery Ranch Gallagator 25L for $129: This Mystery Rack pack was my introduction to wider shoulder straps, which provide more comfort without the bulk of extra padding. The result is a comfortable pack that's light (1 lb., 6 oz.) and packable, making it a great extra pack when traveling. The side pockets are big enough for a Nalgene water bottle and the 25L capacity carries everything you need for a day. It also fits under the seat of even small planes. This is a great little pack for hitting the trail or just walking around town.\nDeuter Trail 18L for $120: I have an earlier version of this pack which I love. It has a unique bottom access zipper, allowing you to access gear from the bottom or the top. I also love Deuter's Air Stripes ventilation system against your back. It's the best I've used in any pack. If you tend to sweat a lot, this is a great pack to stay a bit cooler. There's one stretch mesh side pocket and one zippered pocket and plenty of compression straps and gear loops to attach extra gear if you need it. There's even a back flap for holding you climbing helmet. Deuter also makes a women's fit version which is 2L smaller and possibly fits female bodies better, though my wife has carried this one comfortably for many a mile."
    },
    {
      "url": "https://www.wired.com/gallery/the-best-backpacking-tents/#60df1435e801084848fb0518",
      "text": "The Best Backpacking Tents\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nPicking the best backpacking tent is in-tents. It's arguably the most important piece of backpacking gear you'll buy. You want a shelter that's strikes the right balance between weather protection, living space, durability, and weight.\nTo help you find the best backcountry shelters for every trip, whether you're thru-hiking or just out for the weekend, we've spent years (collectively) living out of dozens of tents in all kinds of inclement weather, from the rain-soaked Pacific Northwest, to the high alpine mountains of Colorado, to frigid Wisconsin winters. We've tested tents from big brands like REI Co-Op, Nemo, and Big Agnes, as well as smaller companies like Hilleberg, Gossamer Gear, and Six Moon Designs. These are the best tents we've found.\nOnce you've got your tent sorted, I recommend finding the perfect backpacking sleeping pad, a great sleeping bag, and some merino base layers to round out your backcountry sleep system. Need a car camping tent? We’ve got a guide to the best camping tents too.\nTent Vocabulary\nShopping for tents you'll quickly find yourself immersed in a world of unfamiliar terms, trying to decipher what it means that a DFC pyramid has a welded bathtub floor. Here's our guide to the terms you need to understand.\nSingle/Double Walled: A double walled tent is the most common, consisting of an inner tent (wall 1) and a rainfly (wall 2) between you and the elements. A single walled tent is, um, a single wall. The advantage of a single-walled tent is that it's lighter. The advantage of a double walled tent is that condensation (usually) escapes to the outer wall and doesn't drip on you while you're sleeping. We recommend both types.\nFreestanding: Does the tent stand up by itself or do you have to stake it out? If it stands up on its own through pole tension, it's a freestanding tent. If it doesn't, it's not. There are also some hybrid designs, often referred to as semi-freestanding, where you just have to stake out one end.\nWhen I started this guide, I was firmly in the freestanding camp. Freestanding tents seemed easier to deal with, and in some ways they are. Most camping tents these days are freestanding. After testing dozens of non-freestanding tents through, I realized freestanding wasn't as big of an advantage as I thought. All non-freestanding means is that you'll have to stake out your tent when you're pitching it. If you're expecting wind or rain you'll want to do that anyway, even if your tent is “freestanding.” The biggest downside to non-freestanding or semi-freestanding tents is that you can't easily move them once they're set up.\nVestibule: In a double-walled tent, the rainfly is usually staked out away from the door of the inner tent. That leaves a space that is not in the tent but is still protected from the rain and elements. The vestibule is a good place for stashing wet gear and cooking when it's raining, and it helps make an otherwise small tent feel much larger. Generally speaking, the bigger the vestibule, the better.\nDCF/Cuben Fiber: Dyneema Composite Fiber (DCF) is also known as Cuben fiber. Both are industry terms for tents made of Dyneema, which is a very strong, very light fabric. It's also very expensive and can be annoyingly crinkly, but when it come to going as light as possible, DCF is difficult to top. For a full breakdown of all the materials used in tents, see Tent Materials below.\nPeak Height: How tall the tent is at its highest point. Depending on the shape of the tent, this may or may not be helpful, but it can indicate how much headroom to you have in the tent. In single pole tents though, the peak height is typically high but slopes off quickly, meaning you don't have as much headroom as this number might back you think.\nDoors: Two-person and larger tents need two doors. Climbing over your hiking partner in the middle of the night isn't fun for anyone. Pretty much every two-person and larger tent I've tested lately has had two doors, but some also have a second full size vestibule, which is nice.\nWhat to Look For in a Tent\nA tent needs to be big enough for you (and a hiking partner if you have one) and all the gear you're bringing. Ideally it’ll have enough room, solid protection from the elements, while remaining lightweight. Here are some of the things to keep in mind when shopping for a backpacking tent.\nFloor Space: Not all two-person tents actually fit two people and all their gear; same with every other size tent. The thing to look at when comparing is the total floor space and the layout of that space. You want enough room for the tent to be livable should you be pinned down by bad weather. Pay special attention to which sleeping pads will fit the interior space, especially if you plan to use some of the newer, extra-cushy, extra-wide sleeping pads. Also be sure to look for tent floors that are heavier denier than the sides, as the floor is what will take most of the wear and tear.\nVestibule Space: The more, the better. Years of tent testing has taught me that the bigger the vestibule, the better the tent will be.\nPackability: Your tent is probably the biggest piece of gear in your pack (unless you're carrying a bear canister). Make sure you have room. Bigger tents (3P and up) often benefit from a compression stuff sack, which helps get them down to more manageable size. I also sometimes pack tent and rainfly separately when carrying a larger tent, which makes them easier to arrange inside your pack.\nWeight: A lightweight tent means less weight on your back. This is especially important for long-distance hikers, though we'd all love to carry less.\nSeasons: Most of our picks below are three-season tents, which means they're good for late spring, summer, and early fall camping. They aren't the best for snow though. We do have a couple four-season picks and we'll be testing some more mountaineering tents down the road. A four-season tent isn't going to keep you any warmer, but a full length rainfly that comes all the way to the ground will stop the wind and snow from getting inside.\nZippers: The heavier, the better. A lot of ultralight tents these days are moving to #3 zippers, which are indeed lighter, but at the expense of robustness. When it comes to zipping up my shelter, I like to err on the side of durability.\nTent Materials\nBackpacking tents are generally made of three main fabrics: silicone-coated nylon, (silnylon), silicone-coated polyester (silpoly), and Dyneema or Dyneema composite fabric (DCF), also known as Cuben fiber.\nDyneema tents are generally a little lighter, definitely stronger, and popular for ultralight backpacking because of the weight savings. Unfortunately, DCF is also very expensive. In my testing, they’re very loud in the wind, and the packed size is larger than a nylon or polyester tent. If you have the money, these are the lightest, toughest tents on the market.\nComparing silicone-coated polyester and nylon is not the apples-to-apples comparison it might seem like it would be. The problem is there are many factors that affect the final product beyond just the fabric. Variables like the exact fiber type used, the way the fiber is woven, the thread count, the denier rating, the coating thickness, and more all play a role that make it impossible to say nylon is better than polyester, or the opposite.\nProponents of polyester argue that nylon absorbs more water, which then makes it stretch and sag more than polyester. This is true, but I have a silnylon tent (the Hilleberg Akto) and have had no problem with sagging even in multiday rains. (If you do get some sagging, retensioning your guylines usually fixes the issue.) On the other hand, polyester often “mists” or leaks more easily than nylon, and it's not as durable. Those things are both true, but I also have a silpoly tent (an older MSR Elixir), and it's proved plenty durable; I haven't had any issues with misting. I happen to think both fabrics are fine. None of the tents we recommend below, whether silnylon or silpoly, have had any of these issues in our testing.\nPackaged Weight vs. Trail Weight\nWhy two weights? Who knows, but there's an easy solution: Ignore the trail weight.\nThe longer answer is that manufacturers want their tents to seem as light as possible so they came up with “trail weight,” which usually means the weight of just the tent, poles, and rainfly. But you need stakes, stuff sacks, and guylines too, and these things add to the weight. Trail weight doesn't match what you'll be putting on your back. That said, if you already have your stakes and guylines dialed in, and just want to know how much a new tent weighs, trail weight can be useful.\nAll of the weights in the guide below ignore any published weights and are what I got weighing each tent on my scale.\nHonorable Mentions\nThere are a lot of tents out there to choose from. Here are a few more we've tried and liked, but that didn't quite make our top picks.\nThe Lunar Solo (7/10, WIRED Review) is a fantastic value for the money. It's very light, packs down to a tiny ball, ventilates very well for a single-walled tent, and it's easy to pitch once you figure out how to do it. It does suffer from the condensations that any single wall tent will have, namely, you're going to be touching wet walls in humid conditions, but I found that the mesh walls, combined with the sliding vestibule and top vent made it pretty easy to keep condensation under control. This one was almost our top pick for best ultralight solo tent, but I do want to test the Durston X-Mid before I declare a top pick.\nThe MSR Freelite (8/10, WIRED Recommends) is a great ultralight, freestanding tent. It's semi-freestanding—you have to stake out the foot end—but I've found it very stable and great for shorter trips with family members. I also like the two-person version as a solo shelter for summer trips.\nSea and Summit's “three-plus season” tent is capable enough in almost any weather while staying crazy light—just 3 lbs., 5 oz. for the two-person model. Our tester used this tent on a five-day trip to Loon Lake in northern California in early October, a true “shoulder season” trip with daytime highs in the 80s, nighttime lows in the 40s, and overnight winds of up to 60 mph. The Telos Plus fared well, despite the wind. It's roomy enough with 27 sq. feet of interior space, and 9 sq. feet of vestibule around each door. We also like that the fly can be pitched separately and the pole bag turns into a glow stick when you stick your headlamp in it.\nMy suggestion for four-person trips is to split into two groups, each with a two-person tent. It just makes every tent more livable, and makes weight distribution easier. However, when my kids were little, there was no way two of them were sleeping in a tent in the woods without me, so I did once lug this tent into the backcountry. Despite the weight (just under 8 lbs), I do like it. It's roomy enough for four people with a good amount of gear inside as well. There’s double vestibules with enough room to keep boots and other gear out of the weather, though cooking under the vestibule is cramped and tricky. On the whole though, this is one of the better hybrid front/backcountry tents available.\nNext Up\nIn the summer of 2025, we'll be testing the new MSR Hubba Hubba (which is no longer its trademark red and white, and is now called the Hubba Hubba LT), Nemo's revamped Dagger Osmo series, along with the one-person Nemo Hornet. Finally, we'll spend some more time with the ultralight favorite, the Durston X-Mid, a strong contender for best ultralight tent.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today."
    },
    {
      "url": "https://www.wired.com/gallery/best-day-hiking-backpacks/",
      "text": "The Best Day-Hiking Backpacks for Every Adventure\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nDay hikes can mean a 30-mile trek over the mountains, a quick summit run, or a walk across town with the kids. In almost every case, you're going to want a pack with room for water, food, rain gear, a small first aid kit, and personal items. The more you carry, the bigger the pack you'll need to carry it.\nWhether you're traveling fast and light or hauling gear for the family, we've tested dozens of packs to find the most comfortable, durable, and easiest-to-organize packs. We're confident that we've found the best day-hiking backpack, no matter what your needs are.\nOnce you've got your pack, check out the rest of our outdoor buying guides, including the Best Backpacking Water Filters, the Best Merino Wool Clothes, and the Best Rain Jackets.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today.\nWhat to Look for in a Day-Hiking Pack\nDay-hiking packs come in a nearly endless array of shapes and sizes, with everything from ultra-minimalist frameless packs to 35-liter monsters with separate sleeping bag compartments. The best day-hiking backpack for you will depend on what you're doing, but after thousands of trail hours, here are some things that are key to getting the right pack:\nDoes it fit? This is the single most important thing about any pack. Make sure the pack you want fits your body, or carrying it will suck no matter how many great features it has. I highly recommend heading to your local outdoor retailer and trying packs weighted with sandbags. This experience will tell you more about which pack is right than anything else. If that's not possible, read the manufacturer's suggestions on fit and sizing, because the standards will vary widely.\nDoes it have a frame? The vast majority of packs over 10 liters have some kind of internal frame, whether it's aluminum or titanium rods, a stiff plastic framesheet, or a simple sheet of foam. The stiffer and stronger the frame, the more comfortably it will carry heavier loads (generally). Frameless packs are fine up to about 8 pounds or so. After that, they tend to get very uncomfortable over long hauls.\nHow do you access items in the pack? There's no right way here, but different methods work better for different people. I happen to like rolltop, dry-bag style top loaders, but other people love bags with front access, which is sometimes called a panel loader. Most day packs offer access from the top in some way, whether its a roll top or a drawstring.\nMany top loading day packs have a lid for smaller items and an expandable sleeve that can fit extra gear. Panel loaders have zippers or other fasteners on the front of the pack to allow access all the way around. Some packs combine top access with a side zipper, letting you get into the main compartment without taking the pack completely off. And then there is Mystery Ranch, with its distinctive Y-shaped zipper access that's somewhere between top loading and panel loading but also its own thing.\nWhat’s the back panel? Larger, heavier packs often offer a nice mesh back panel that will help keep you cooler. Some packs have other venting systems, like Osprey’s AirScape back panel, which has a channel down the middle that helps with airflow. Anything that sits directly on your back is going to get sweaty.\nDoes it have a hip belt? If you’re carrying more than 10 pounds, we recommend a hip belt. Unless you’re rucking and weight is the point—in that case, carry on. Everyone else, get a pack with a hip belt, and maybe even something with hip-belt pockets for quick access to your Lara bars.\nExtra features to look for: Side pockets are handy for storing frequently accessed items. Mesh pockets that fit water bottles are especially handy. Mesh pockets offer easy access, but zippered pockets make sure nothing falls out on rough scrambles. Is there a sternum strap? (These help keep shoulder straps where they should be). How about a loop for an ice ax or trekking poles? Do the shoulder straps have a way to attach a quick-capture clip? These are all nice extras.\nHow Big of a Pack Do I Need?\nA “day hike” is a common description of an all-day outing, but when it comes to picking a pack, you need to be more precise. The best pack for a 4-miler with the family is different than the best pack for a half-day trail run, which is different than the best pack for hauling climbing gear to your favorite crag. The best day packs are versatile enough to handle multiple use cases, but some things, especially trail running and cycling, call for more specialized gear.\nThe first place to start is how big of a pack you need. Here's a rough breakdown of pack sizes in liters.\n- Up to 10 liters: Small packs are built for traveling light. Think running vests for long trail runs, and small packs for short hikes. These are generally very low profile, with room for a jacket, some water and snacks, and your personal items.\n- 11-25 liters: Packs in this range are great for longer days out or activities/conditions that require more gear. Hikers have room for a jacket (maybe a compact fleece or puffer jacket) and food, water, or a small camera. Runners can fit a larger hydration bladder. I find the 15-25 liters range to be ideal for everything from a walk in the woods to mountain biking to trail running.\n- 25-35 liters: The gear-hauling end of the day pack world, these packs are great for handling climbing gear on a approach or rain gear and food for the kids on family hikes. These packs tend to have more padding in the shoulder straps, making them better for heavy loads. This is also a good size for any winter adventures, when you need to carry extra layers.\n- 35+ liters: These are primarily backpacking packs, though some climbers might need the larger capacity.\nWhat Should I Bring?\nWhat you need on a day hike varies a lot depending on your outdoor skill level, environment, and weather, to name just a few factors. To give a detailed list is impossible, but a good rule of thumb is to always carry water, some food, a rain jacket, and a small first aid kit for blisters and cuts.\nBeyond these essentials other items you might want to consider include, map and compass, knife, some way of making fire, headlamp or flashlight, sunscreen, hat, and any personal items you need (like medication, prescription glasses, etc).\nHonorable Mentions\nWe've tested dozens of packs over the years. These did not quite make our top picks, but are still great packs and might be perfect for what you need.\nMystery Ranch Gallagator 25L for $129: This Mystery Rack pack was my introduction to wider shoulder straps, which provide more comfort without the bulk of extra padding. The result is a comfortable pack that's light (1 lb., 6 oz.) and packable, making it a great extra pack when traveling. The side pockets are big enough for a Nalgene water bottle and the 25L capacity carries everything you need for a day. It also fits under the seat of even small planes. This is a great little pack for hitting the trail or just walking around town.\nDeuter Trail 18L for $120: I have an earlier version of this pack which I love. It has a unique bottom access zipper, allowing you to access gear from the bottom or the top. I also love Deuter's Air Stripes ventilation system against your back. It's the best I've used in any pack. If you tend to sweat a lot, this is a great pack to stay a bit cooler. There's one stretch mesh side pocket and one zippered pocket and plenty of compression straps and gear loops to attach extra gear if you need it. There's even a back flap for holding you climbing helmet. Deuter also makes a women's fit version which is 2L smaller and possibly fits female bodies better, though my wife has carried this one comfortably for many a mile."
    },
    {
      "url": "https://www.wired.com/story/best-rain-jackets/#six",
      "text": "All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nEvery time I slip on a rain jacket, I give thanks that we no longer have to wrap ourselves in thick, smelly sealskin to stay dry. The best rain jackets today are more comfortable and watertight than ever, thanks to advances in weatherproof textiles and apparel design. But depending on the climate and your level of activity, sorting through different styles, technologies, and waterproof ratings can be confusing.\nEvery year, I test a dozen or so rain jackets through the soggy Pacific Northwest winter and false spring. I hike, bike, run, and walk my dogs—sometimes I even stand in the shower with my clothes on when the weather isn’t cooperating. I also got advice from Amber Williams, a consumer science educator and lecturer in textile science and pattern making at Utah State University’s Outdoor Product Design program. All to find the rain jackets worth your time and money.\nDon't forget to check out the rest of our outdoor coverage, including the Best Umbrellas, Best Puffer Jackets, Best Running Shorts, and Best Merino Wool Clothes.\nUpdated April 2025: We added the Gorewear Concurve Windbreaker, the MEC x Aquanator, the Montbell Versalite, the Rab Cinder Phantom, and the 66 North Snaefell rain jacket.\nPower up with unlimited access to WIRED. Get best-in-class reporting that's too important to ignore for just $2.50 $1 per month for 1 year. Includes unlimited digital access and exclusive subscriber-only content. Subscribe Today.\nUnderstanding Rain Jacket Tech\nTrying to decipher jackets’ product specs is almost as annoying as getting soaked by a sudden cloudburst on the trail.\nLook for laminated layers: Most technical waterproof jackets are referred to as two- or three-layer jackets. These layers usually consist of a face fabric that has been treated with a waterproofing agent like durable water repellent, which is a thin mesh for releasing water vapor, plus a protective interior lining underneath. In general, for greater durability you’ll want to look for layers that have been laminated together, rather than merely coated with a waterproofing agent. That’s the advice of Amber Williams, the consumer science educator and lecturer from Utah State University.\nWaterproof and breathability ratings: Manufacturers usually rate each fabric based on its waterproofing and breathability. For example, a rain jacket with a waterproof rating of 20,000 means that if you had an endlessly long 1-inch square tube, you could pour 20,000 millimeters of water on top of the fabric before it would start seeping through (that's over 65 feet!). A 20,000 breathability rating means that 20,000 grams of water vapor can pass through the fabric going the other direction. While the higher breathability rating might seem better, you might want to think twice if you’ll be out in the cold. Body heat can escape a breathable jacket almost as easily as water vapor.\nCheck the seams and zippers: If you want your rain jacket to last longer than an amusement park poncho, look at the seams. Shoulders are particularly vulnerable points, as most outdoor sports require you to wear a backpack that can rub and damage them. “Design lines look really sexy, but over time, they’re not going to last as long,” Williams says. Other features to look for include plasticized, water-resistant zippers and protective zipper flaps. That’s why our rain jacket picks are so expensive—a lot of new fabric tech and a lot of design details.\nCare for your jacket: You can vastly extend the life of your items by properly caring for them. Hang your jacket—don’t store it crammed in an abrasive, tiny stuff sack. If you see stains from grease, dirt, or sunscreen, or notice that water is no longer beading on the surface, you’ll need to wash it. Follow the manufacturer’s instructions. You may need a specialized detergent—many fabric detergents will leave residues that can interfere with the durable water repellent's (DWR) performance. Avoid fabric softener, bleaches, dry cleaning, and the dryer.\nBest Rain Jacket for Everyday Use\nSince the 1960s, modern rainwear has relied on carcinogenic perfluorocarbons (PFCs), or “forever chemicals.” Modern durable water repellents (DWRs) use PFCs in manufacturing, which then migrate from your clothing into soil and streams as you tromp around outside. Today, many companies are making steps to reduce the levels of PFAS in their products, probably because states are banning these kinds of chemicals. In 2023, popular outdoor retailer REI announced it would phase out any products with PFAS in its stores.\nIf you want to be dead certain that your jacket does not have PFAS, you can't go wrong with a classic rubber raincoat, like Stutterheim's Stockholm raincoat. Technical rain jacket manufacturers tend to shy away from polyurethane, because it's, well, rubbery. But the material is durable, long-lasting, windproof, waterproof, and PFC-free! I also prefer rubber rain jackets in damp coastal climates, like the Pacific Northwest. Breathability is less of a sticking point when the air is already humid.\nThis is the only rain jacket I've ever bought with my own money, because I'm so tired of having to replace my rain jacket every few years when the waterproofing wears off. I wear the Stockholm almost every day. The outer covering is made from 100 percent rubberized PVC with a cotton lining, so you don't squeak like a duck when wearing it.\nIt's true to size and roomy enough to layer a down vest under it. It has double-welded seams to keep the water out, and the hood is large enough for a baseball cap or a large beanie. I also like the buttons; when I'm just throwing on a jacket to walk the dog, it's faster and easier than making sure a seam-sealed zipper doesn't get caught in a storm flap. If you also live in a rainy climate and are sick of re-waterproofing your rain jacket every season, get one of these.\n★ Alternatives: The price of the Stockholm might make you gag. If you want a basic rubber slicker, I've also had Rains' waterproof jacket ($140) for several years now, which has a very similar, Scandinavian-inspired design but at a much more reasonable price. Baxter Woods ($300) is also a pretty great rubber slicker that's a little less than the Stockholm.\nBest Waterproof Running Jacket\nMy requirements for a running rain jacket are much different than those for an everyday one. I'm sweating, so I'm already damp, and I don't care as much if the jacket is a little more permeable. However, I want it to fit well, not chafe or rustle annoyingly, and have good ventilation so I don't become clammy when working out.\nGorewear's windbreaker is billed as the most comfortable running jacket ever, and it's absolutely true. I've been wearing this jacket outside for my 3- to 5-mile rain runs, and I barely even notice it's on. This magic is due to the fabric—it's a permeable, double-weave fabric that is DWR-treated and has a 3D fabric structure inside. Basically, there are a billion tiny fabric tent poles that hold it, suspended, over the surface of your skin so you don't get that horrible sticky feeling when your running rain jacket starts clinging to you like plastic wrap. It doesn't seem like this should work, yet it does.\nIt has all the usual running jacket essentials, like reflective details and elastic cuffs. There's a stowaway pocket, and it packs down incredibly small, nearly to the size of a handkerchief. This is a blessing, since you can stuff it in a running vest when it stops raining, and a curse, because I keep losing it. (I spent about 20 minutes searching for it in my house, since I take it with me everywhere.) Best of all, it's a mere $100, which is affordable for a high-tech rain jacket.\nI've tried so many rain jackets in the running category. Here are a few that I like:\n- Showers Pass Cloudburst for $199: This is the best if you want a running rain jacket that sheds a bit more, er, rain. It's thicker than the Gorewear windbreaker but still incredibly soft and flexible. I wear this when the outdoor temperatures drop under 40 degrees with a wool layer underneath.\n- Patagonia Houdini for $109: This is the jacket that everyone normally tells you to get. Everyone has one. It's simple and packable, and the company switched to a PFC-free DWR. However, it rustles, it's not too breathable, and I feel like I'm wearing a plastic bag.\n- Tracksmith Downpour for $400: For its exorbitant price, this is the most feature-rich jacket of the bunch, with a PFAS-free DWR on a three-layer jacket, a brimmed hood, and a 360-mesh panel for breathability. Like all of Tracksmith's gear, it's incredibly beautiful, but the colors are dark, and it doesn't have reflective details, which could be dangerous when running in the rain.\nBest Waterproof Cycling Jacket\nI hate rain gear. It's heavy, bulky, and rarely performs in true downpours, and the whole waterproof and breathable thing is a lie (you can have both, just not at the same time). Despite all that, I love the Rab Cinder Phantom and have been carrying it everywhere I go, on and off a bike. It solves almost all my issues with rain gear. It's incredibly light (3.3 ounces/114 grams for a medium), stuffs down to about the size of a tennis ball, and is somehow surprisingly waterproof.\nThe shell is 7D Pertex, which has proved to be windproof and waterproof, and when it's not raining, it's quite breathable. Pair it with a grid fleece for the ultimate in breathable warmth. At 3 ounces, there aren't a lot of bells and whistles to the Cinder Phantom. You can use the full front zip to ventilate, though it's fiddly to use while riding. There are no pit zips and, sadly, no drawstring at the waist. There is elastic, but I would love to sacrifice an ounce and have a pull string.\nThe one thing to know about the Cinder Phantom is that it is designed for cycling, which means it has a short cut with a longer back, which works great on a bike but isn't the best for hiking, since rain dripping off you pretty much lands right on your legs. That has not stopped me from using this off the bike, though. I pair it with Patagonia's new M-10 storm pants (also amazing, though less breathable), which give me full body coverage at about 10 ounces. Do I worry that the Cinder Phantom's thin fabric might not stand up to a backpack long-term? I do, but after six months, so far so good. —Scott Gilbertson\n★ Alternatives: Cleverhood is an independent, Rhode Island-based company, and its signature garment is the biking-friendly Rain Cape. The rain cape is OK, as it can fit over your heavier clothes without too much fuss. I also like the Rover Anorak ($129), which is also cut very generously and longer in the back to cover my tail as I’m riding. It also has a protected flap under the front zip so I don’t get wet when I open it up, and an enormous kangaroo pocket that’s handy for stowing my shell gloves, masks, and even bike locks in a pinch.\nBest Waterproof Hiking Jacket\nMountain Equipment Company (MEC) is the Canadian version of REI Co-op. The company was founded in the 1970s but has had financial struggles in the past few years following the pandemic surge. It now sells in the US, however, and I've been shocked by the great value in the Aquanator.\nIt has everything you need and extras you might not expect at this price, like a nice, soft chin guard on the storm flap and a laminated brim so you don't need to wear a baseball cap underneath the hood. It's made from 100 percent recycled Japanese-milled ripstop polyester that's incredibly light, and the DWR is PFAS-free. The hood has both side and back toggles for great adjustability, and it is packable in its pocket, although not as pocketable as the Gorewear. This is the jacket I've been using for spring biking recently, as the back hem extends just a little bit farther to cover my bum, and it's also a great lightweight rain jacket for spring hiking.\nPronounced “Sny-feddle,” this next-generation waterproof jacket from Icelandic brand 66°North is the first to use Polartec’s Power Shield Pro. This sustainable fabric is made from non-PFAS materials and 48 percent Biolon, a plant-based nylon alternative with a 50 percent lower carbon footprint than regular nylon. Somehow, this shell also manages to be bizarrely soft on the skin with almost no rustle. It’s generously stretchy while boasting a waterproof rating beyond 20,000 mm hydrostatic pressure (20,000 g/m2/24h breathability too).\nThe shape and style of the jacket are consistent with a premium hiking jacket rather than a serious mountaineering waterproof, with taped seams, quality YKK Aquaguard waterproof zippers, backpack-friendly pockets, and a two-way adjustable hood with a stiff peak. There’s no venting in the armpits, though, and it is relatively short.\nThis jacket doesn’t feel like a hardshell, but thankfully it performs like one. I’ve spent hours walking through drizzle and torrential rain in it and never once felt it was going to fail me. It’s sustainable, soft, and stretchy, so it doesn’t bead as well or for as long as a classic (pre-PFAS ban) Gore-Tex Pro shell, but nothing does. It’s too expensive for most budgets but is better for the planet, helps push fabric technology forward, and keeps you impressively dry and brilliantly comfortable. —Chris Haslam\nThis is probably the biggest category of rain jackets we test. Here are a few other ones that you shouldn't overlook.\n- Arc'teryx Beta SL for $500: This is the classic outdoor rain jacket. When I go camping in Oregon in the rain, everyone stands around in their identical Betas. Last year, Arc'teryx completely redesigned the line with a PFAS-free Gore-Tex expanded polyethylene (ePE) membrane. It's lighter, thinner, and more sustainable. In the pouring rain, it kept me dry underneath. I particularly like features like the very strong rubberized cuffs that stay put over my gloves.\n- Patagonia Torrentshell for $179: Another great, classic rain jacket. My spouse and I have owned versions of this 3-layer rain jacket for years, which now also has a PFC-free DWR finish.\n- Mont-Bell Versalite for $260: This ultralight (6.4 ounces, 192 grams) waterproof jacket from uber-cool Japanese brand Mont-Bell packs down so small (2.8 x 2.8 x 5.5 inches) I often forget it’s in the bottom of my bag. Despite this ridiculous packability, the two-layer 10-denier ripstop fabric offers seriously good protection against wind and rain. Mont-Bell has used two layers of Windstopper Gore-Tex here, which is technically rated as “water-resistant” but with taped seams and a generous DWR—it has a 20,000 mm HH rating, which is better than many. It’s all the more impressive given it also has a sweat-limiting 43,000 g/m²/24h breathability rating. It’s rare to find lightweight jackets as waterproof as this, and even after a year the DWR coating beads the water away without issue. My only gripe is that the material feels and sounds a bit crinkly, and the lightweight packability payoff means it won’t hold up as well to heavy-handed use. —Chris Haslam\nBest Budget Rain Jacket\nFor $100, it's tough to find a rain jacket that offers better value than the Rainier. It uses high-quality laminate waterproofing instead of the less expensive coating that many cheaper rain jackets rely on. Rather than bonding a waterproof, breathable membrane below the shell fabric, manufacturers will save money by just coating the inner surface with a waterproof, breathable film. It’s less pricey but also less durable than three-layer construction.\nThe Rainier has many great features that are tough to find in rain jackets at this price. For example, it’s made from recycled nylon, and the DWR is non-fluorinated (no PFAS). It has features like venting pit zips, is seam-taped, has a weatherproof center zip, and features an adjustable, packable hood. For casual day hikes and traveling, the Rainier jacket is a great choice. I buy the kids' version ($80) every year for my two children.\nThere are a ton of affordable rain jackets on the market. Here are the best ones we've tested.\n- Decathlon Quechua MH100 for $50: This jacket works, but it runs small and is not very breathable, and the fabric is stiff and unpleasant to wear.\n- Frogg Togg Ultralight for $25: I keep this jacket as an emergency layer in the car, but I didn't like the fabric's almost slimy texture, and it's frequently returned on Amazon for that reason. However, commerce director Martin Cizmar swears by the Frogg Togg's Xtreme Lite ($60), which is very light, protective, and runs big enough to promote air circulation. It weighs the same as jackets six times its cost.\nThese Accessories Will Keep You Dry\nHere are a few other accessories you can use to stay dry.\nThe North Face Etip Recycled Glove for $45: It's not very comfortable to have a dry torso and be soaking wet everywhere else. I use these gloves almost every day. Read our Best Touchscreen Gloves for more recommendations.\nHelly Hansen Seven Rain Pants for $85: I never seem to get quite as wet as I do when I'm biking. I own these rain pants, as well as REI's Rainier rain pants ($100). They pull on over whatever soft pants you're wearing and have PFC-free DWR treatment.\nArc'teryx Gamma Hat for $50: If your rain jacket doesn't have a laminated brim, you need a baseball cap to keep the rain off your face. I own this softshell hat, which also has a DWR finish, but any old baseball cap will do (wear it under your hood).\nXtratuf 6-Inch Deck Boots for $115: Xtratuf now makes these classic boots in all different colors, but I prefer the basic brown. These are easy to slip on, completely waterproof, and have excellent traction. I have worn these for years in the rain and snow.\nDavek Mini Umbrella for $60: If you prefer wearing jackets rather than carrying an umbrella, then you might appreciate the Davek Mini. This umbrella is designed to be tiny, yet its 34-inch canopy is enough to cover most of your head and torso. Keep it in a pocket or bag, and take it out when the rainfall gets heavy. Read our Best Umbrellas guide for more. —Julian Chokkattu\nRain Jackets I Hate\nSnow Peak Gore-Tex Rain Jacket for $600: I usually love everything that Snow Peak makes. But this jacket's pocket zipper and big zipper busted after a month of outdoor hiking in the rain and getting shoved in and out of backpacks. For $600, I expected a little more durability.\nRab Downpour Plus for $125: Likewise, Rab is also known for the quality of its jackets. But the recycled, PFAS-free Pertex shield let more water in than other jackets I tested while hiking.\nH&M StormMove for $70: I applaud H&M's move into affordable sports wear, but the StormMove soaked through after about an hour."
    }
  ],
  "argos_summary": "The REI Labor Day Sale runs from August 22 to September 2, offering discounts of up to 30% on various outdoor gear, with REI Co-op members receiving an additional 20% off outlet items using the promo code SAVEOUTLET. Featured deals include popular camping and backpacking gear such as the REI Co-op Half Dome 2 Tent, Patagonia Nano Puff Jacket, and Therm-a-rest NeoLoft Sleeping Pad. The article also highlights the importance of quality gear for outdoor activities, providing insights into various tents, sleeping bags, and cooking equipment.",
  "argos_id": "6FGYN2HXZ"
}