{
  "url": "https://www.nytimes.com/es/2025/08/22/espanol/estados-unidos/eeuu-poblacion-migrante-disminuye.html",
  "authorsByline": "Miriam Jordan",
  "articleId": "dfb99c3902d4401fbd9ca20a73972dd8",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/21/espanol/21nat-immig-decline-top-jfmc-ES-copy1/21nat-immig-decline-top-jfmc-facebookJumbo-v2.jpg",
  "country": "us",
  "language": "es",
  "pubDate": "2025-08-22T07:00:45.456000+00:00",
  "addDate": "2025-08-22T07:10:32.707220+00:00",
  "refreshDate": "2025-08-22T07:10:32.707222+00:00",
  "score": 1.0,
  "title": "La población migrante en EE. UU. disminuye por primera vez en décadas",
  "description": "Un análisis de los datos del censo realizado por el Centro de Investigaciones Pew reveló que, entre enero y junio, la población nacida en el extranjero disminuyó en casi 1,5 millones de personas.",
  "content": "Por primera vez en décadas, son más los inmigrantes que abandonan Estados Unidos que los que llegan, según un nuevo estudio, lo que constituye un primer indicio de que la estrategia de línea dura contra la migración del presidente Donald Trump está haciendo que la gente se marche, ya sea por deportación o por elección propia.\n\nUn análisis de los nuevos datos del censo publicado el jueves por el Centro de Investigaciones Pew, una organización no partidista, reveló que entre enero y junio, la población de personas nacidas en el extranjero que viven en Estados Unidos —tanto residentes con permiso legal como quienes no son inmigrantes autorizados— disminuyó en casi 1,5 millones. En junio, el país albergaba a 51,9 millones de migrantes, frente a los 53,3 millones de seis meses antes.\n\nLos funcionarios del gobierno de Trump han aplaudido la salida neta, afirmando que las presiones sobre los servicios gubernamentales han disminuido y que los mercados de trabajo se han recuperado. Y algunos partidarios de la represión de la migración dicen que no se ha ido lo suficientemente lejos.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump government officials",
      "weight": 0.09686721
    },
    {
      "name": "President Donald Trump",
      "weight": 0.09185083
    },
    {
      "name": "government services",
      "weight": 0.086068414
    },
    {
      "name": "Donald Trump",
      "weight": 0.08405446
    },
    {
      "name": "more immigrants",
      "weight": 0.08200069
    },
    {
      "name": "first",
      "weight": 0.080227986
    },
    {
      "name": "people",
      "weight": 0.07727403
    },
    {
      "name": "net exit",
      "weight": 0.075921
    },
    {
      "name": "migration",
      "weight": 0.07579308
    },
    {
      "name": "legal permission",
      "weight": 0.07328406
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.91650390625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.88037109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.6640625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.456298828125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.40966796875
    }
  ],
  "sentiment": {
    "positive": 0.024502281,
    "negative": 0.90607107,
    "neutral": 0.069426596
  },
  "summary": "",
  "shortSummary": "",
  "translation": "For the first time in decades, there are more immigrants who leave the United States than those who arrive, according to a new study, which constitutes a first indication that the hard line strategy against the migration of President Donald Trump is making people march, either by deportation or by their own choice.\n\nAn analysis of the new census data published Thursday by the PEW Research Center, a non -partisan organization, revealed that between January and June, the population of people born abroad living in the United States - both residents with legal permission such as those who are not authorized immigrants - decreased by almost 1.5 million. In June, El País housed 51.9 million migrants, compared to 53.3 million six months before.\n\nTrump government officials have applauded net exit, stating that pressures on government services have decreased and that labor markets have recovered. And some supporters of the repression of migration say that it has not gone far enough.",
  "translatedTitle": "The migrant population in the US decreases for the first time in decades",
  "translatedDescription": "An analysis of the census data carried out by the PEW Research Center revealed that, between January and June, the population born abroad decreased by almost 1.5 million people.",
  "translatedSummary": "The number of immigrants leaving the United States for the first time in decades has decreased, according to a study by the PEW Research Center. This indicates that the hard line against the migration of President Donald Trump is making people more likely to leave the country. The study also revealed that between January and June, the number of people born abroad living in the US decreased by almost 1.5 million. Despite this, some critics argue that the government has not done enough to halt the flow of immigrants.",
  "reprint": false,
  "reprintGroupId": "e573c32d4d704746827ebe59915b3343",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Por primera vez en décadas, más inmigrantes están abandonando Estados Unidos que los que llegan, según un estudio del Centro de Investigaciones Pew. Entre enero y junio, la población de inmigrantes en el país disminuyó en casi 1,5 millones, pasando de 53,3 millones a 51,9 millones. Los funcionarios del gobierno de Trump han elogiado esta salida neta, argumentando que ha aliviado la presión sobre los servicios gubernamentales y mejorado el mercado laboral.",
  "argos_id": "8W9XJIHSG"
}