{
  "url": "https://www.investing.com/news/company-news/graphjet-technology-reports-graphite-production-meets-battery-anode-standards-93CH-4206938",
  "authorsByline": "",
  "articleId": "ee1637cfc75e42bbbfe419d6893b13e8",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T13:15:36+00:00",
  "addDate": "2025-08-22T13:27:10.302695+00:00",
  "refreshDate": "2025-08-22T13:27:10.302697+00:00",
  "score": 1.0,
  "title": "Graphjet Technology reports graphite production meets battery anode standards By Investing",
  "description": "Graphjet Technology reports graphite production meets battery anode standards",
  "content": "NEW YORK - Graphjet Technology (NASDAQ:GTI) announced Friday that its graphite production now meets the standards required for use as battery anode material, according to a company press release. The micro-cap company, currently valued at $13.65 million, has seen significant trading activity with a 3-month average daily volume of 35.49 million shares.\n\nThe Malaysia-based company, which produces graphene and graphite from recycled palm kernel shells, stated it will proceed with finalizing collaborations and supply agreements with customers in the coming weeks.\n\nAhead of a planned share consolidation early next week, Graphjet has engaged an investment bank to assist with issuing additional shares to maintain market liquidity. The company has initiated steps to register these additional shares with the SEC.\n\n\"The Company has been moving at a quick pace to commercialise the Company’s products in order to move from a developmental company to a full-fledged producer of graphite, capitalising in the current demand for graphite,\" said Chris Lai, CEO of Graphjet, in the statement.\n\nFounded in 2019, Graphjet Technology claims to have the world’s first patented technology to recycle palm kernel shells, a waste product from palm seed oil production, to create single layer graphene and artificial graphite.\n\nThe company trades on the Nasdaq under the ticker GTI. The press release contained forward-looking statements regarding product commercialization and future performance that are subject to risks and uncertainties.\n\nIn other recent news, Graphjet Technology announced that its shareholders have approved a share consolidation plan, which will take effect on August 25, 2025. The consolidation involves a 1-for-60 share ratio, reducing the par value of the company’s ordinary shares. This move was confirmed at an extraordinary general meeting and aims to adjust the company’s share structure. Additionally, Graphjet has received conditional approval from the Nasdaq Hearings Panel to maintain its listing, with specific compliance deadlines set for later this year. The company is required to meet the minimum bid price and periodic filing requirements, as well as provide updates on its fundraising plans.\n\nIn Malaysia, Graphjet has partnered with Universiti Kebangsaan Malaysia to develop advanced heat sinks using graphite and graphene. This collaboration is part of the Consortium of Research Excellence 2025 initiative. Furthermore, Graphjet has received new machinery at its Malaysian factory, which will undergo installation and testing to ensure it meets performance standards. These developments highlight Graphjet’s ongoing efforts to enhance its technological capabilities and maintain its market position.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Graphjet Technology",
      "weight": 0.09225995
    },
    {
      "name": "additional shares",
      "weight": 0.08160932
    },
    {
      "name": "graphite production",
      "weight": 0.08143287
    },
    {
      "name": "Graphjet",
      "weight": 0.08127201
    },
    {
      "name": "artificial graphite",
      "weight": 0.07031752
    },
    {
      "name": "graphite",
      "weight": 0.06931853
    },
    {
      "name": "palm seed oil production",
      "weight": 0.06726122
    },
    {
      "name": "palm kernel shells",
      "weight": 0.06677687
    },
    {
      "name": "recycled palm kernel shells",
      "weight": 0.06676964
    },
    {
      "name": "battery anode standards",
      "weight": 0.06281169
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97314453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91259765625
    },
    {
      "name": "/News/Technology News",
      "score": 0.3310546875
    }
  ],
  "sentiment": {
    "positive": 0.45718408,
    "negative": 0.05328592,
    "neutral": 0.4895299
  },
  "summary": "Graphjet Technology (NASDAQ:GTI) has announced that its graphite production now meets the standards required for use as battery anode material. The Malaysia-based company, which produces graphene and graphite from recycled palm kernel shells, plans to finalise collaborations and supply agreements with customers in the coming weeks. Prior to a planned share consolidation, Graphjet has engaged an investment bank to issue additional shares to maintain market liquidity. The company's shareholders have approved a share consolidation plan, which will take effect on August 25, 2025.",
  "shortSummary": "Graphjet Technology reports its graphite production meets battery anode standards, plans share consolidation, and aims to enhance its product commercialization capabilities and liquidity with additional shares available.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6332cde5e9e44f20ad0bc6e614508dfb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Graphjet Technology has announced that its graphite production now meets the standards for battery anode material, as it prepares to finalize collaborations and supply agreements. The company, valued at $13.65 million, is moving towards commercialization and has engaged an investment bank for share consolidation and liquidity maintenance. Additionally, Graphjet has partnered with Universiti Kebangsaan Malaysia to develop advanced heat sinks and is enhancing its technological capabilities with new machinery.",
  "argos_id": "9RJE2UAZM"
}