{
  "url": "https://www.morningstar.com/news/globe-newswire/9516387/miniluxe-reports-on-record-financial-results-for-the-second-quarter-and-1h-of-2025",
  "authorsByline": "",
  "articleId": "a49c7d44ecba4b90b2eb6534b826eb1e",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T06:15:00-05:00",
  "addDate": "2025-08-22T11:36:42.450243+00:00",
  "refreshDate": "2025-08-22T11:36:42.450244+00:00",
  "score": 1.0,
  "title": "MINILUXE REPORTS ON RECORD FINANCIAL RESULTS FOR THE SECOND QUARTER AND 1H OF 2025",
  "description": "",
  "content": "Reported figures all in U.S. Dollars\n\n\n\n\n\nBoston, MA, Aug. 22, 2025 (GLOBE NEWSWIRE) -- MiniLuxe Holding Corp. (TSXV: MNLX) today announced its financial results for the 13 and 26 weeks ended June 29, 2025 (\"Q2 2025\" and “H1 2025”). The fiscal year of MiniLuxe (“The Company”) is a 52-week reporting cycle ending on Sunday closest to December 31, which periodically necessitates a fiscal year of 53 weeks; fiscal years referred to in this release consist of 52-week periods. Unless otherwise specified, all amounts are reported in U.S. dollars.\n\nMiniLuxe’s brand and purpose statement includes the aspiration to have a broader impact that positively transforms and empowers the nail care industry and its workers. Empowerment for MiniLuxe team members comes from offering a safer and healthier environment with ultra-hygienic practices, continuous professional development, economic mobility with access to health and other benefits. Additionally, with an employee’s growing tenure with the Company, there are more opportunities for career path advancement, equity ownership, and artistic self-expression.\n\nHighlights of Business Performance in Q2 2025 and 1H 2025\n• System wide YoY growth of over 12% and net full company growth YoY revenue growth of 8% for the quarter and 9% for H1 2025 from H1 2024.\n• The Company had a record summer month in June with 10% revenue growth and 18% EBITDA growth versus the prior year.\n• Gross profit increased 5% to $3.2M from $3.0M in Q2 2025.\n• Gross profit margin decreased by 1 percentage point to 43% from 44%, as a result of intentional investment in higher staffing levels to capture revenue from peak periods and high demand occasions (Mother’s Day, Juneteenth, July Fourth weekend) and also new hires with skills to deliver premium services\n• Talent retention across the company remained at 87% YoY.\n• Key subsequent hire event – Lanchi Venator as new CFO of Company.\n\nThrough Q2 2025 the Company continued its execution focus on three strategic pillars:\n• Drive growth through operating partners and franchise partners – positive momentum of Company's fleet revenue base came in part from new and existing operating partners. MiniLuxe’s first franchise partner in Brookline, Massachusetts exceeded expectation with its revenue ramp and hitting a period of profitability within its first 6 months of operations. Other operating partners in Atlanta, Florida and Texas continued to perform strongly.\n• Accelerate overall company owned studio-level profitability growth - Fleet Adjusted EBITDA increased approximately 63% compared to Q2 2024, reaching $1.4M, demonstrating the Company's continued success in improving store-level contribution. Overall focus on elevating and aligning studio management on key metrics including peak day staffing, premium services and indirect labor management helped to drive these results.\n• Increase fixed cost leverage and SG&A efficiency - The Company continued to push for SG&A efficiency and fixed cost leverage and stayed approximately flat as percent of revenue (despite several one-time SG&A expenses in H1 2025), it seeks to focus more on opportunities for SG&A efficiencies over the coming quarters.\n\nMiniLuxe continued its momentum with year-over-year growth. Q2 2025 system-wide sales delivered $7.7M versus prior year of $6.9M, translating into a year-over-year increase of 12%. Total H1 2025 system sales grew to $14M from $12.6M, an 11% year-over-year increase. On a company basis Q2 2025 net revenue increased 8% to $7.5M compared to Q2 2024 revenue of $6.9M. H1 2025 revenue was $13.6M representing 8% growth over H1 2024. This revenue growth was driven by continuous focus on levers to enhance the unit economics of the Company’s underlying fleet of studios and the overall strength on studio leaders and operating partners that it is attracting. In Q2, the median average unit volume for MiniLuxe’s top quartile studios exceeded $1.8M per unit store and for the trailing four quarters, cash contribution was up nearly 20% across the fleet.\n\nThe second quarter of 2025 also delivered positively across all key metrics of profitability. For Q2 2025 there was ~$3.2M in gross profit, representing a 5% increase from $3M in Q2 2024. H1 2025 delivered total gross profit of $5.7M, or an 8% increase over H1 2024 of $5.3M. Gross profit margin contracted slightly in Q2 2025 versus prior year by 1 percentage point, as a result of intentional investments to recruit and develop nail designers which ultimately added staffing hours. These additional staffing hours were critical towards realizing the demand across peak weekends and holidays such as Easter, Mother’s Day and the Fourth of July.\n\nAs a proxy for the health of the operating cash flows, the Company focuses on earnings before interest, tax, depreciation and amortization (EBITDA) growth. Management also sees its adjusted EBITDA as a key success indicator towards long-term profitability. In Q2 2025, the Company’s operating loss was ($1.2M) a $0.3M improvement over Q2 2024, primarily driven by higher revenue. For H1 2025, the Company’s operating loss was ($3.2M), a $0.1M improvement over H1 2024.\n\nTaking out non-cash items such as stock-based compensation, adjusted EBITDA for total company (inclusive of all overhead) came in for Q2 2025 at ~($.8M) while Fleet 4-wall adjusted EBITDA nearly doubled from prior year’s performance at $1.4M from $.8M.\n\nThe core studio base continues to drive attractive and growing unit economics with a consistent and resilient multi-year trend of growth. In Q2 2025, service revenue from the fleet increased by $0.6M to $7.4M, or 9% over Q2 2024. MiniLuxe saw strong trends on the demand and supply side of its business: (a) positive momentum on the demand side (new client and loyal client growth) and (b) growth and development of supply side (talent ecosystem growth). The Company maintained its high level of talent engagement and held a YoY retention rate of 87% at the end of the second quarter.\n\n\"Our positive and strong second quarter results represent the execution focus of the leadership and field team alongside our incredible and growing team of operating partners and field associates on delivering an exceptional and consistent client experience.” said Tony Tjan, Chief Executive Officer and Co-founder of MiniLuxe.\n\nAnd he continues, \"We are, of course, proud to have another record quarter in which we estimate our growth to be 2x industry growth for retail sales and are grateful for the loyalty of our clients and team.”\n\nThe following table outlines the consolidated statements of loss and comprehensive loss for the thirteen and twenty-six weeks ended June 29, 2025 and June 30, 2024:\n\nThe following table presents cash and cash equivalents as of June 29, 2025 and June 30, 2024:\n\nThis press release references certain non-IFRS measures used by management. These measures are not recognized under International Financial Reporting Standards (\"IFRS\"), do not have a standardized meaning prescribed by IFRS, and are therefore unlikely to be comparable to similar measures presented by other companies. Rather, these measures are provided as additional information to complement those IFRS measures by providing further understanding of the Company's results of operations from management's perspective. Accordingly, these measures should not be considered in isolation nor as a substitute for analysis of the Company's financial information reported under IFRS. The non-IFRS measures referred to in this press release are \"Adjusted EBITDA\" and \"Fleet Adjusted EBITDA.\"\n\nManagement believes Adjusted EBITDA most accurately reflects the commercial and operational reality of the Company's operations on an ongoing basis by adding back non-cash expenses. Additionally, the rent-related adjustments ensure that studio-related expenses align with revenue generated over the corresponding time periods.\n\nAdjusted EBITDA is calculated by adding back fixed asset depreciation, right-of-use asset amortization under IFRS 16, asset disposal, and share-based compensation expense to IFRS operating income, then deducting straight-line rent expenses net of lease abatements. IFRS operating income is revenue less cost of sales (gross profit), additionally adjusted for general and administrative expenses, and depreciation and amortization expense.\n\nThe Company also uses Fleet Adjusted EBITDA to evaluate the performance of its MiniLuxe Core Studio business. This metric is calculated in a similar manner, starting with Talent revenue and adjusting for non-fleet Talent revenue and cost of sales, further adjusted by fleet general and administrative expenses and finally subtracting straight line rent expense. The Company believes that this metric most closely mirrors how management views the fleet portion of the business.\n\nThe following table reconciles total company Adjusted EBITDA to net loss for the periods indicated:\n\nThe following table reconciles Fleet Adjusted EBITDA to net loss for the periods indicated:\n\nMiniLuxe, a Delaware corporation based in Boston, Massachusetts. MiniLuxe is a lifestyle brand and talent empowerment platform servicing the beauty and self-care industry. The Company focuses on delivering high-quality nail care and esthetic services and offers a suite of trusted proprietary products that are used in the Company's owned-and-operated studio services. For over a decade, MiniLuxe has been elevating industry standards through healthier, ultra-hygienic services, a modern design esthetic, socially responsible labor practices, and better-for-you, cleaner products. MiniLuxe's aims to radically transform a highly fragmented and under-regulated self-care and nail care industry through its brand, standards, and technology platform that collectively enable better talent and client experiences. For its clients, MiniLuxe offers best-in-class self-care services and better-for-you products, and for nail care and beauty professionals, MiniLuxe seeks to become the employer of choice. In addition to creating long-term durable economic returns for our stakeholders, the brand seeks to positively impact and empower one of the most diverse and largest hourly worker segments through professional development and certification, economic mobility, and company ownership opportunities (e.g., equity participation and future franchise opportunities). Since its inception, MiniLuxe has performed over 4 million services.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nThis press release contains \"forward-looking information\" and \"forward-looking statements\" (collectively, \"forward-looking information\") concerning the Company and its subsidiaries within the meaning of applicable securities laws. Forward-looking information may relate to the future financial outlook and anticipated events or results of the Company and may include information regarding the Company's financial position, business strategy, growth strategies, acquisition prospects and plans, addressable markets, budgets, operations, financial results, taxes, dividend policy, plans and objectives. Particularly, information regarding the Company's expectations of future results, performance, achievements, prospects or opportunities or the markets in which the Company operates is forward-looking information. In some cases, forward-looking information can be identified by the use of forward-looking terminology such as \"plans\", \"targets\", \"expects\", \"budgets\", \"scheduled\", \"estimates\", \"outlook\", \"forecasts\", \"projects\", \"prospects\", \"strategy\", \"intends\", \"anticipates\", \"believes\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"would\", \"might\", or \"will\" occur. In addition, any statements that refer to expectations, intentions, projections or other characterizations of future events or circumstances contain forward-looking information. Statements containing forward-looking information are not historical facts but instead represent management's expectations, estimates and projections regarding future events or circumstances.\n\nMany factors could cause the Company's actual results, performance, or achievements to be materially different from any future results, performance, or achievements that may be expressed or implied by such forward-looking information, including, without limitation, those listed in the \"Risk Factors\" section of the Company's filing statement dated November 9, 2021. Should one or more of these risks or uncertainties materialize, or should assumptions underlying the forward-looking statements prove incorrect, actual results, performance, or achievements could vary materially from those expressed or implied by the forward-looking statements contained in this press release.\n\nForward-looking information, by its nature, is based on the Company's opinions, estimates and assumptions in light of management's experience and perception of historical trends, current conditions and expected future developments, as well as other factors that the Company currently believes are appropriate and reasonable in the circumstances. Those factors should not be construed as exhaustive. Despite a careful process to prepare and review forward-looking information, there can be no assurance that the underlying opinions, estimates and assumptions will prove to be correct. These factors should be considered carefully, and readers should not place undue reliance on the forward-looking information. Although the Company bases its forward-looking information on assumptions that it believes were reasonable when made, which include, but are not limited to, assumptions with respect to the Company's future growth potential, results of operations, future prospects and opportunities, execution of the Company's business strategy, there being no material variations in the current tax and regulatory environments, future levels of indebtedness and current economic conditions remaining unchanged, the Company cautions readers that forward-looking statements are not guarantees of future performance and that our actual results of operations, financial condition and liquidity, and the development of the industry in which the Company operates may differ materially from the forward-looking statements contained in this press release. In addition, even if the Company's results of operations, financial condition and liquidity, and the development of the industry in which it operates are consistent with the forward-looking information contained in this press release, those results or developments may not be indicative of results or developments in subsequent periods.\n\nAlthough the Company has attempted to identify important risk factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other risk factors not presently known to the Company or that the Company presently believes are not material that could also cause actual results or future events to differ materially from those expressed in such forward-looking information. There can be no assurance that such information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, readers should not place undue reliance on forward-looking information, which speaks only as of the date made (or as of the date they are otherwise stated to be made). Any forward-looking statement that is made in this press release speaks only as of the date of such statement.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=NNOWRHU32Ef9Se_jGS3C6Ba2X4BF-tVPd9MQP6CoLmCR_ITXroHGFGOzJTII6LKyhD_SXa55KbsWmYfm-s0kVAXHb4xcoSMmEH89Jfck2XbzUIbec7HgdRxU-07xXsFzKtuOnb8M7iWJ9058wj1DAQ==",
    "https://www.globenewswire.com/Tracker?data=emPyVIUY1ZpTw6b01nPUDwTTRBg534FQ8IFeZkJEse4K2ETSLKssexyAs3P5r706-bBuGwD3oKY0X_VMWcE0K4n1d8lBMCxTUDszAuFwmMyDoqXB6yCC4z46IJUpLRz87PFEvIORiFTOO-L20TKL1w==",
    "https://www.globenewswire.com/news-release/2025/08/08/3130254/0/en/MINILUXE-ANNOUNCES-APPOINTMENT-OF-LANCHI-VENATOR-AS-CHIEF-FINANCIAL-OFFICER-AND-RELATED-ISSUANCE-OF-EQUITY-BASED-COMPENSATION.html",
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/b6f7d4a4-cfc6-4a8c-b883-42d6b008a2da",
    "https://www.globenewswire.com/Tracker?data=Kp1vRFP1-oAEC8ljLDqi3MSlWm0gesrNFgF2JPtvPrv4ws-RJNisW_Zoo8QyzRnKfEuL1Hsy-ZpkBJwPTlRc69bSvnIjtSGwh9BWTaTvzJGF3a_fc75SD9sIgjtEWGi8lsl7ihnmVHtGSpdCvYQapw==",
    "https://www.globenewswire.com/Tracker?data=JoBJLsL67CwAQE_UyL16bE1AEoZ4oDVdTFapp2aVzZEQFYWNd_XXbkgSwHRFlVdll3UW-V2qPTiI2_ocwR0OwSf3_LrgUPM3xt0Norv1s5iW_LxwoDd3obbdAfh8-u2q",
    "https://www.globenewswire.com/Tracker?data=1ylJN9FjgwRkRAY6FK0XIHltlKF3L6Z18YcUKqrc9htdl6Esek-5RmlLukL59yLl23yZoWyfxmzaNqsNKD7vRUiqGhmR-kAPhvTaV7ifiOhdsRNgdPaHo6EoYaSODemo0SDc5U6_nQgHfmpqk7yo_Q==",
    "https://www.globenewswire.com/Tracker?data=N0rWjbrRjoXxHld6ccW8m1iKyC7P_o-UIQz_-jhVo8TVCzAyUdRSv4RPxoiJ5-G5tx9B6o8BZSqBv_1mYcH5dA==",
    "https://www.globenewswire.com/Tracker?data=s0faMGHfhfe82yb_QOI2h76fjx4TQL3PR1Z-mp4TF73nlF8aXk8Z5IM_duFS-3B2D9prNbLwfK-sMzwHI_gVP847No6lZb52HiB9VlZoG--2nm9X-URfOEoYCSofRDdMyqXD0TRmZxuDZbiDBpOPDw=="
  ],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "net full company growth YoY revenue growth",
      "weight": 0.06764309
    },
    {
      "name": "Company",
      "weight": 0.065356724
    },
    {
      "name": "future results",
      "weight": 0.06398254
    },
    {
      "name": "financial results",
      "weight": 0.061271105
    },
    {
      "name": "RECORD FINANCIAL RESULTS",
      "weight": 0.060105156
    },
    {
      "name": "such information",
      "weight": 0.05875082
    },
    {
      "name": "actual results",
      "weight": 0.05775891
    },
    {
      "name": "such statement",
      "weight": 0.055470105
    },
    {
      "name": "total company Adjusted EBITDA",
      "weight": 0.05543339
    },
    {
      "name": "service revenue",
      "weight": 0.055379596
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9404296875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.84765625
    }
  ],
  "sentiment": {
    "positive": 0.8023838,
    "negative": 0.0815694,
    "neutral": 0.11604677
  },
  "summary": "MiniLuxe Holding Corp. (TSXV: MNLX) has reported record financial results for the second and third quarters of 2025. The company saw a YoY growth of over 12% and net full company growth of 8% for Q2 2025, with a 9% increase for H1 2025 from H1 2024. The Company had a record summer month in June with 10% revenue growth and 18% EBITDA growth compared to the prior year. Gross profit margin decreased by 1 percentage point to 43% from 44%, as a result of intentional investment in higher staffing levels and new hires with skills to deliver premium services. Talent retention across the company remained at 87% YoY. The firm continued to focus on growth through operating partners and franchise partners, with Fleet Adjusted EBITDDA increasing by 63% compared to Q2 2024, reaching $1.4M.",
  "shortSummary": "MiniLuxe Holding Corp. reported record financial results with year-over-year growth of over 12% and increased revenue and profitability, driven by strong franchise growth and improved efficiency in operations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b5b0c65b7b7f44ffa00b9fdb0338050f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/news-release/2025/08/08/3130254/0/en/MINILUXE-ANNOUNCES-APPOINTMENT-OF-LANCHI-VENATOR-AS-CHIEF-FINANCIAL-OFFICER-AND-RELATED-ISSUANCE-OF-EQUITY-BASED-COMPENSATION.html",
      "text": "MiniLuxe adds industry-leading executive with deep beauty and multi-unit franchising experience to its team while maintaining its shareholder-aligned equity-based incentive program for executive and board compensation\nBoston, MA, Aug. 08, 2025 (GLOBE NEWSWIRE) -- MiniLuxe Holding Corp. (TSXV: MNLX) today announced the appointment of its new Chief Financial Officer, Lanchi Venator.\nEffective immediately, Ms. Venator will formally assume all key financing, reporting and control functions from Ms. Elizabeth Lorber (the Company’s current Chief Commercial Officer and Acting CFO). Ms. Lorber has been serving in an interim capacity since the Company announced its plans in mid-February of 2025 for a transition in its financial leadership. Ms. Venator has been serving as a senior advisor to the Company since the beginning of the 2025 year across a range of strategic and financial matters and will report directly to MiniLuxe’s CEO, Anthony (Tony) Tjan.\nMost recently, Ms. Venator served as the Global CFO & Head of Strategy for KFC (Kentucky Fried Chicken), where she was responsible for driving growth and profitability and delivering on the annual financial performance targets for the global KFC business. While there, she had oversight over 14 international Business Unit CFOs as well as a Strategy and FP&A team based in Dallas, TX. Prior to KFC, Ms. Venator was Senior Vice President of Global Finance & Strategy and Chief of Staff to the EVP & CFO of The Estee Lauder Companies. Her 11-year tenure at Estee Lauder brought a depth of understanding of the beauty industry and responsibilities that included overseeing the development of ELC’s long range Financial Strategy, commercial analytics and growth and operational planning across Estee Lauder’s portfolio of businesses.\n“I am pleased and proud to officially welcome Lanchi to the team, despite us feeling that she has already been fully part of the team over the past six months serving as a highly valued senior advisor to me, our team and the Board. During her advisory period, we were able to not only affirm a strong chemistry and complementary of skill and responsibilities but a complete alignment on MiniLuxe’s vision to radically and positively transform the nail care industry. I look forward to partnering with her in the years ahead,” said Tony Tjan.\n“I am super excited to join the MiniLuxe team. The past months have clearly demonstrated to me the potential value creation opportunity within MiniLuxe and the fit with my strategic and financial skills and experiences across multi-unit franchising and the beauty industry can have an impact. Most important I love the people in the Company and the opportunity to redefine an industry,” said Lanchi Venator.\nAs part of the normal course of an equity-based (in lieu of cash) compensation program for key executive officers and board members, the Company is announcing the issuance of 750,000 in options and 650,000 RSUs (Restricted Stock Units) with a strike price of 0.41 cents CDN which represents a premium to the prior day closing price from the Board’s approval of such compensation approval for Ms. Venator and contemporaneously has approved a zero cash and DSU (Deferred Stock Compensation) for Board Members collectively of 545,000 DSUs. The Company notes that all such options, RSUs and DSUs are coming from the existing equity incentive plan and represent just over 1 percent of the fully diluted ownership of the Company.\nAbout MiniLuxe\nMiniLuxe, a Delaware corporation based in Boston, Massachusetts. MiniLuxe is a lifestyle brand and talent empowerment platform servicing the beauty and self-care industry. The Company focuses on delivering high-quality nail care and esthetic services and offers a suite of trusted proprietary products that are used in the Company’s owned-and-operated studio services. For over a decade, MiniLuxe has been elevating industry standards through healthier, ultra-hygienic services, a modern design esthetic, socially responsible labor practices, and better-for-you, cleaner products. MiniLuxe’s aims to radically transform a highly fragmented and under-regulated self-care and nail care industry through its brand, standards, and technology platform that collectively enable better talent and client experiences. For its clients, MiniLuxe offers best-in-class self-care services and better-for-you products, and for nail care and beauty professionals, MiniLuxe seeks to become the employer of choice. In addition to creating long-term durable economic returns for our stakeholders, the brand seeks to positively impact and empower one of the most diverse and largest hourly worker segments through professional development and certification, economic mobility, and company ownership opportunities (e.g., equity participation and future franchise opportunities). Since its inception, MiniLuxe has performed over 4 million services.\nFor further information\nChristine Mastrangelo\nInvestor Relations, MiniLuxe Holding Corp.\n(617) 684-2731\ncmastrangelo@MiniLuxe.com\nMiniLuxe.com\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release."
    }
  ],
  "argos_summary": "MiniLuxe Holding Corp. reported strong financial results for Q2 2025, with a 12% year-over-year growth in system-wide sales and an 8% increase in net revenue, reaching $7.5 million. The company emphasized its commitment to empowering its workforce through a safer work environment and professional development opportunities. Additionally, MiniLuxe appointed Lanchi Venator as its new CFO, bringing extensive experience from the beauty industry, to further drive growth and profitability.",
  "argos_id": "AB7NC6HZ7"
}