{
  "url": "https://www.investing.com/news/sec-filings/mr-cooper-group-provides-supplemental-merger-disclosures-amid-shareholder-lawsuits-93CH-4206576",
  "authorsByline": "",
  "articleId": "f810f8889a8a4be6adeaa2dbeb23518c",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/news/World_News_10_800x533_L_1420026292.jpg",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T11:13:03+00:00",
  "addDate": "2025-08-22T11:33:33.897291+00:00",
  "refreshDate": "2025-08-22T11:33:33.897295+00:00",
  "score": 1.0,
  "title": "Mr. Cooper Group provides supplemental merger disclosures amid shareholder lawsuits By Investing",
  "description": "Mr. Cooper Group provides supplemental merger disclosures amid shareholder lawsuits",
  "content": "Mr. Cooper Group Inc. (NASDAQ: ), currently valued at $11.73 billion with its stock trading at $183.44, on Friday provided additional disclosures related to its pending merger with Rocket Companies, Inc., following the filing of shareholder lawsuits and demand letters concerning the proposed transaction. The information is based on a statement released in a filing with the Securities and Exchange Commission. According to InvestingPro analysis, the company’s stock has delivered an impressive 91% return year-to-date, though current valuations suggest the stock may be trading above its Fair Value.\n\nAccording to the filing, three lawsuits were filed in the Supreme Court of the State of New York by purported Mr. Cooper stockholders between August 6 and August 7. The complaints allege that the proxy statement for the merger contains misstatements and omissions in violation of state laws, and seek to enjoin the shareholder vote and/or completion of the merger. Mr. Cooper also reported receiving demand letters from other stockholders making similar claims.\n\nThe company stated that it believes the allegations are without merit but has decided to voluntarily supplement its proxy statement to address the disclosure claims and avoid expense and delay. The supplemental information includes clarification that the second Mr. Cooper director to join the Rocket board after the merger has not yet been determined, and that as of the merger agreement date, Mr. Cooper was not party to any confidentiality agreement containing a “don’t ask, don’t waive” provision.\n\nThe filing also provides further details on financial relationships between Citi and Rocket or its affiliates, noting that Citi received approximately $14 million in aggregate fees and net interest income from Rocket and its affiliates over the two years prior to Citi’s opinion on the merger. Citi is currently providing services to Rocket and its affiliates, and estimates that future fees over the next year will be less than those payable by Mr. Cooper for Citi’s services related to the merger.\n\nAdditionally, the company disclosed the estimated value of unvested director equity awards as of the assumed merger closing date and the number of shares granted to each non-employee director in May 2025.\n\nThe special meeting for Mr. Cooper stockholders to vote on the merger is scheduled for September 3, 2025. The company noted that additional lawsuits related to the merger or proxy statement may be filed in the future.\n\nAll information is drawn from a press release statement included in the SEC filing.\n\nIn other recent news, Mr. Cooper Group Inc. reported its second-quarter 2025 earnings, revealing a mixed financial performance. The company missed its earnings per share forecast, posting $3.04 compared to the anticipated $3.24. However, Mr. Cooper Group exceeded revenue expectations, reporting $681 million against the forecasted $677.75 million. This revenue beat, along with strategic initiatives, contributed to positive market reactions.\n\nAdditionally, homebuilder and mortgage company stocks, including Mr. Cooper Group, experienced a rally following weaker-than-expected jobs data. This data led to a significant drop in short-term Treasury yields, raising expectations for Federal Reserve interest rate cuts. Rocket Companies saw a 16% surge, while Mr. Cooper Group jumped 15%, and loanDepot gained 8%. Homebuilders such as D.R. Horton, (NYSE: ), PulteGroup (NYSE: ), and (NYSE: ) also recorded notable gains. These developments reflect the recent dynamics in the market, impacting investor sentiment and financial expectations.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/equities/pulte-homes-inc",
    "https://www.investing.com/equities/wmi-holdings",
    "https://www.investing.com/equities/toll-brothers",
    "https://www.investing.com/pro/COOP",
    "https://www.investing.com/equities/lennar"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Cooper Group",
      "weight": 0.11168739
    },
    {
      "name": "Mr. Cooper Group Inc.",
      "weight": 0.10925138
    },
    {
      "name": "Mr. Cooper",
      "weight": 0.10762088
    },
    {
      "name": "Mr. Cooper stockholders",
      "weight": 0.106527254
    },
    {
      "name": "purported Mr. Cooper stockholders",
      "weight": 0.101095796
    },
    {
      "name": "Cooper",
      "weight": 0.08165044
    },
    {
      "name": "supplemental merger disclosures",
      "weight": 0.081363425
    },
    {
      "name": "proxy statement",
      "weight": 0.06663603
    },
    {
      "name": "the second Mr. Cooper director",
      "weight": 0.06579546
    },
    {
      "name": "Rocket Companies",
      "weight": 0.06371367
    }
  ],
  "topics": [
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9970703125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97900390625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96533203125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.5439453125
    }
  ],
  "sentiment": {
    "positive": 0.14457302,
    "negative": 0.227737,
    "neutral": 0.62769
  },
  "summary": "Mr. Cooper Group Inc. (NASDAQ:), currently valued at $11.73 billion with its stock trading at $183.44, has provided additional disclosures regarding its pending merger with Rocket Companies, Inc. Following shareholder lawsuits and demand letters, the company has decided to supplement its proxy statement to address these claims. The company's stock has returned a 91% year-to-date, suggesting it may be trading above its Fair Value. The firm also provided details on financial relationships between Citi and Rocket, including that Citi received approximately $14 million in aggregate fees and net interest income from Rocket and its affiliates over the two years prior to Citi’s opinion on the merger. The special meeting for Cooper stockholders to vote on the proposed merger is scheduled for September 3, 2025.",
  "shortSummary": "Mr. Cooper Group Inc. provides additional disclosures about its proposed merger with Rocket Companies amid shareholder lawsuits and demand letters, with potential market gains and earnings reports mixed.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "51e2d5bf58e9468ca8771c60b19a082b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Mr. Cooper Group Inc. is facing shareholder lawsuits regarding its pending merger with Rocket Companies, alleging misstatements in the proxy statement. The company plans to supplement its disclosures to address these claims while maintaining that the allegations are without merit. Additionally, Mr. Cooper reported mixed second-quarter earnings, exceeding revenue expectations but missing earnings per share forecasts, amidst a rally in homebuilder and mortgage stocks following weaker jobs data.",
  "argos_id": "BIETVIXJK"
}