{
  "url": "https://www.investing.com/news/analyst-ratings/hc-wainwright-reiterates-buy-rating-on-septerna-stock-as-clinical-trials-begin-93CH-4206676",
  "authorsByline": "",
  "articleId": "eb13007379544492826ad9557edfff92",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/news/news_six_pile_69x52._800x533_L_1419494215.jpg",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T11:47:20+00:00",
  "addDate": "2025-08-22T12:16:56.663330+00:00",
  "refreshDate": "2025-08-22T12:16:56.663331+00:00",
  "score": 1.0,
  "title": "H.C. Wainwright reiterates Buy rating on Septerna stock as clinical trials begin By Investing",
  "description": "H.C. Wainwright reiterates Buy rating on Septerna stock as clinical trials begin",
  "content": "Investing.com - H.C. Wainwright has reiterated its Buy rating and $26.00 price target on (NASDAQ: ), currently trading at $11.70 with a market cap of $517 million, following the company’s announcement that it has begun dosing participants in a Phase 1 trial. InvestingPro data shows the stock has surged over 100% in the past six months.\n\nSepterna announced on August 21 that it has dosed the first participants in its Phase 1 trial of SEP-631, a selective oral small molecule being developed for the treatment of chronic spontaneous urticaria and other mast cell-driven diseases.\n\nThe randomized, placebo-controlled Phase 1 SAD/MAD clinical trial is expected to enroll approximately 150 healthy adult volunteers. Dosing is currently underway in the single ascending dose (SAD) portion of the trial, which will evaluate safety and tolerability at escalating oral doses.\n\nThe multiple ascending dose (MAD) portion of the trial will assess safety and tolerability over the treatment period, with pharmacodynamics evaluated through an icatibant skin challenge.\n\nH.C. Wainwright noted that this development marks Septerna’s return to clinical-stage status following the discontinuation of SEP-786 in hypoparathyroidism, describing the news as \"a meaningful value inflection point\" for the company. InvestingPro analysis shows the company maintains strong liquidity with a current ratio of 22.09, though it’s currently burning through cash. Subscribers can access 8 additional ProTips and detailed financial metrics.\n\nIn other recent news, Septerna, Inc. reported its second-quarter financial results, revealing a widened net loss despite exceeding earnings expectations. The company posted an adjusted EPS loss of $0.56, which was $0.07 better than analyst projections of a $0.63 loss. Revenue for the quarter amounted to $100,000. Septerna’s net loss increased to $24.8 million, up from $16.4 million in the same period last year, primarily due to a rise in research and development expenses, which climbed to $22.2 million from $15.0 million year-over-year. In addition, Septerna has initiated a Phase 1 clinical trial for SEP-631, an oral treatment targeting chronic spontaneous urticaria and other mast cell-driven diseases. The trial will assess the safety, tolerability, pharmacokinetics, and pharmacodynamics of SEP-631 in healthy adult volunteers. Approximately 150 participants are expected to enroll in the randomized, placebo-controlled study, which includes both single-ascending dose and multiple-ascending dose components.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/pro/SEPN",
    "https://www.investing.com/equities/septerna-inc"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "clinical trials",
      "weight": 0.09330172
    },
    {
      "name": "Septerna stock",
      "weight": 0.08133255
    },
    {
      "name": "Septerna",
      "weight": 0.07070534
    },
    {
      "name": "escalating oral doses",
      "weight": 0.06970297
    },
    {
      "name": "other recent news",
      "weight": 0.06552304
    },
    {
      "name": "chronic spontaneous urticaria",
      "weight": 0.06537588
    },
    {
      "name": "detailed financial metrics",
      "weight": 0.06266991
    },
    {
      "name": "Buy rating",
      "weight": 0.06223226
    },
    {
      "name": "H.C. Wainwright",
      "weight": 0.05826317
    },
    {
      "name": "last year",
      "weight": 0.05794036
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96142578125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.9462890625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93701171875
    }
  ],
  "sentiment": {
    "positive": 0.890229,
    "negative": 0.029553592,
    "neutral": 0.0802174
  },
  "summary": "H.C. Wainwright has reiterated its Buy rating and $26.00 price target on Septerna stock following the company's announcement that it has begun dosing participants in a Phase 1 trial of SEP-631, a selective oral small molecule being developed for the treatment of chronic spontaneous urticaria and other mast cell-driven diseases. The randomized, placebo-controlled Phase 1 SAD/MAD clinical trial is expected to enroll approximately 150 healthy adult volunteers. The company's shares have surged over 100% in the past six months. SepternA's second-quarter financial results showed a widened net loss, largely due to increased research and development expenses.",
  "shortSummary": "H.C.Wainwright reiterates Buy rating for Septerna, which is testing SEP-631 in a Phase 1 trial for chronic spontaneous urticaria and mast cell-driven diseases.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c3b96ef10b294d67bd9164a44a605835",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "H.C. Wainwright has maintained a Buy rating and $26.00 price target for Septerna, which is currently trading at $11.70, following the initiation of a Phase 1 trial for its drug SEP-631 aimed at treating chronic spontaneous urticaria. The trial will involve around 150 healthy adult volunteers and assess the drug's safety and tolerability. Despite a widened net loss reported in its second-quarter financial results, Septerna's stock has surged over 100% in the past six months, indicating strong market interest.",
  "argos_id": "CZ52B00YE"
}