{
  "url": "https://finance.yahoo.com/news/nvidias-china-trouble-could-slash-115501006.html",
  "authorsByline": "Anusuya Lahiri",
  "articleId": "8d5299a72b3643f29fa3c19e3cae1c2b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/Benzinga/64cbd777bfd74012c0c150c50cbdb8b0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T11:55:01+00:00",
  "addDate": "2025-08-22T12:01:54.628347+00:00",
  "refreshDate": "2025-08-22T12:01:54.628349+00:00",
  "score": 1.0,
  "title": "Nvidia's China Trouble Could Slash Billions From Revenue, Analysts Warn",
  "description": "Nvidia Corp. (NASDAQ:NVDA) shares slipped on Friday after reports surfaced that the company has halted work on its H20 artificial intelligence chip for China, just as domestic rival DeepSeek unveiled a new model optimized for local processors. The developments underscore mounting headwinds for Nvidia in a critical market where Beijing is accelerating efforts to reduce reliance on U.S. technology. DeepSeek, one of China’s most closely watched AI startups, launched its upgraded V3.1 model on Thurs",
  "content": "Nvidia Corp. (NASDAQ:NVDA) shares slipped on Friday after reports surfaced that the company has halted work on its H20 artificial intelligence chip for China, just as domestic rival DeepSeek unveiled a new model optimized for local processors.\n\nThe developments underscore mounting headwinds for Nvidia in a critical market where Beijing is accelerating efforts to reduce reliance on U.S. technology.\n\nDeepSeek, one of China’s most closely watched AI startups, launched its upgraded V3.1 model on Thursday. The system is designed to run on domestic chips, reflecting Beijing’s push for technological self-sufficiency.\n\nAlso Read: Nvidia’s AI Expansion Could Push Revenue To $300 Billion By 2026, Analyst Says\n\nThe update introduces faster processing capabilities, a new FP8 precision format, and a hybrid inference structure capable of toggling between reasoning and non-reasoning tasks. The company also added a “deep thinking” feature to its platforms and plans to implement new API pricing beginning September 6.\n\nThe move comes after DeepSeek encountered performance hurdles with Huawei’s Ascend processors, forcing the startup to rely on Nvidia hardware for earlier models. Its R1 release in January rattled global markets, erasing roughly $600 billion in Nvidia’s market value amid fears of a serious new competitor.\n\nAt the same time, Nvidia is facing heightened regulatory pressure in China. The company has reportedly instructed suppliers, including Amkor Technology (NASDAQ:AMKR) and Samsung Electronics (OTC:SSNLF), to suspend work on its China-focused H20 chip.\n\nThe pause follows meetings between Chinese regulators and tech giants such as Tencent Holdings (OTC:TCEHY) and ByteDance, in which officials urged companies to pivot away from Nvidia hardware in favor of domestic alternatives from Huawei and Cambricon.\n\nAnalysts caution that the disruption could weigh on Nvidia’s near-term results. KeyBanc Capital Markets estimates that excluding China sales could cut quarterly revenue by $2 billion to $3 billion. However, strong global demand and the company’s rollout of its next-generation Blackwell B200 chips may help offset some of the pressure. China contributed 13% of Nvidia’s revenue in fiscal 2024, highlighting the strategic importance of the market.\n\nDespite the latest setback, Nvidia stock has gained more than 30% this year, cementing its dominance in the graphics processing unit segment as Big Tech players including Microsoft (NASDAQ:MSFT) and Meta Platforms (NASDAQ:META) pour billions into AI infrastructure.\n\nPrice Action: NVDA stock is trading lower by 1.14% to $172.98 premarket at last check Friday.",
  "medium": "Article",
  "links": [
    "http://finance.yahoo.com/q?s=AMKR",
    "https://www.benzinga.com/markets/tech/25/08/47274541/nvidia-suspends-china-focused-h20-chip-as-beijing-pushes-for-domestic-alternatives-analysts-warn-of-weaker-q3-outlook-report?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
    "https://www.benzinga.com/topic/nvidia?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
    "http://finance.yahoo.com/q?s=MSFT",
    "http://finance.yahoo.com/q?s=NVDA",
    "https://www.benzinga.com/analyst-stock-ratings/reiteration/25/08/47188985/nvidias-ai-expansion-could-push-revenue-to-300-billion-by-2026-analyst-says?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
    "http://finance.yahoo.com/q?s=SSNLF",
    "https://www.benzinga.com/markets/tech/25/08/47275078/deepseek-unveils-upgrade-of-flagship-ai-model-with-support-for-chinese-chips-as-beijing-races-to-cut-reliance-on-nvidia-us-tech?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
    "http://finance.yahoo.com/q?s=META",
    "https://www.benzinga.com/markets/tech/25/08/47204794/nvidia-prepares-new-china-specific-ai-chip-to-defend-market-share?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
    "http://finance.yahoo.com/q?s=TCEHY"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nvidia hardware",
      "weight": 0.09431361
    },
    {
      "name": "Nvidia stock",
      "weight": 0.09395071
    },
    {
      "name": "Nvidia",
      "weight": 0.090911075
    },
    {
      "name": "Nvidia Corp.",
      "weight": 0.08945592
    },
    {
      "name": "domestic chips",
      "weight": 0.07160265
    },
    {
      "name": "new API pricing",
      "weight": 0.06684281
    },
    {
      "name": "China",
      "weight": 0.06666459
    },
    {
      "name": "domestic rival DeepSeek",
      "weight": 0.066537425
    },
    {
      "name": "global markets",
      "weight": 0.06422598
    },
    {
      "name": "companies",
      "weight": 0.061682794
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98388671875
    },
    {
      "name": "/News/Technology News",
      "score": 0.95263671875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.93017578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.7607421875
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.53662109375
    }
  ],
  "sentiment": {
    "positive": 0.03469583,
    "negative": 0.843893,
    "neutral": 0.121411175
  },
  "summary": "Nvidia Corp. (NASDAQ:NVDA) shares fell after reports surfaced that the company has halted work on its H20 artificial intelligence chip for China, while domestic rival DeepSeek unveiled a new model optimized for local processors. This comes as Beijing is increasing efforts to reduce reliance on U.S. technology. Despite these setbacks, Nvidia stock has gained over 30% this year, cementing its dominance in the graphics processing unit segment. Analysts warn that the disruption could impact Nvidia's near-term results and could result in a significant decrease in revenue.",
  "shortSummary": "Nvidia shares fell as it halted work on its H20 AI chip in China amid regulatory concerns and competition from DeepSeek.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4a0a1b9e60f44d9c951a3cf8cea9a9f8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/analyst-stock-ratings/reiteration/25/08/47188985/nvidias-ai-expansion-could-push-revenue-to-300-billion-by-2026-analyst-says?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
      "text": "- Analyst C.J. Muse raised Nvidia’s price forecast to $240, citing Blackwell-driven growth and surging AI demand.\n- Muse projects Nvidia revenue at $48B in Q2 and $55B in Q3, with Data Center sales driving beats well above consensus.\n- See the 6X seasonal strategy set to target this fall’s biggest opportunities. Details here →\nNvidia NVDA is set to beat Wall Street’s expectations once again, driven by surging demand for AI and its new Blackwell architecture.\nWith a strong revenue forecast of $48 billion for the second quarter and expectations for continued growth through 2026, the company’s Data Center segment remains the primary growth engine, positioning Nvidia for sustained leadership in AI infrastructure.\nCantor Fitzgerald analyst C.J. Muse has upped his price forecast for Nvidia to $240, citing the company’s Blackwell-driven Data Center expansion and the rapid acceleration of AI investments.\nAlso Read: Nvidia Could Add Billions From China Sales If H20 GPUs Get Green Light From US: Analyst\nMuse maintains his Overweight rating on the stock, noting that Nvidia’s revenue is likely to surpass consensus estimates through 2026.\nMuse pointed to surging demand for artificial intelligence computing and the company’s new Blackwell architecture ramp.\nThe analyst expects Nvidia to deliver a strong beat again and raise when it reports fiscal second-quarter results on August 27. He projects revenue of $48 billion and EPS of $1.06, compared with consensus expectations of $45.8 billion and $1.00 per share.\nData Center sales remain the core driver, with Muse forecasting $42.9 billion from that segment alone. Looking ahead to the October quarter, he estimates $55 billion in revenue and $1.25 in EPS, again ahead of consensus at $52.6 billion and $1.18, with Data Center contributing about $49.9 billion.\nFor the long term, Muse models Nvidia’s Data Center revenue at $200 billion in calendar 2025 and $300 billion in calendar 2026, well above current Street forecasts of $181 billion and $235 billion, respectively.\nHe projects earnings power of $4.85 per share in calendar 2025 and $8.00 in calendar 2026, compared with consensus at $4.37 and $5.89.\nHe highlighted accelerating hyperscaler capital expenditures, expected to grow 57% in calendar 2025 and another 20% in calendar 2026, a $1.5 trillion global sovereign AI investment pipeline, and increasing enterprise adoption as the key drivers of this expansion.\nMuse acknowledged ongoing headwinds in China due to H20 export restrictions and tariffs, but argued that most sell-side models already exclude that revenue.\nAny unexpected shipments to the region could therefore provide upside to current estimates. He also noted that Nvidia’s gross margins should reach the mid-70% range by late calendar 2025, supported by the mix shift to Blackwell products and ongoing efficiency gains.\nThe analyst underscored that Nvidia’s roadmap beyond Blackwell, including its Rubin platform, further strengthens visibility into calendar 2026 and positions the company for sustained leadership in AI infrastructure.\nNVDA Price Action: Nvidia stock is trading higher by 0.92% to $182.11 at last check Monday.\nRead Next:\nPhoto via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47275078/deepseek-unveils-upgrade-of-flagship-ai-model-with-support-for-chinese-chips-as-beijing-races-to-cut-reliance-on-nvidia-us-tech?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
      "text": "On Thursday, Chinese AI startup DeepSeek released an upgraded version of its flagship V3 model, touting support for domestic chips as China accelerates efforts to reduce dependence on U.S. companies like Nvidia Corporation NVDA.\nDeepSeek's New V3.1 With Domestic Chip Compatibility\nDeepSeek said its V3.1 model upgrade features faster processing and a new UE8M0 FP8 precision format optimized for \"soon-to-be-released next-generation domestic chips,\" reported Reuters.\nThe company did not disclose which manufacturers or chip models would be supported.\nFP8, or 8-bit floating point, enables AI models to run more efficiently by using less memory and delivering quicker performance.\nDeepSeek described the V3.1 update as incorporating a hybrid inference structure, allowing it to toggle between reasoning and non-reasoning modes.\nA new \"deep thinking\" button has been added to its app and web platform, now running the upgraded model.\nDeepSeek also said it will adjust pricing for developers using its API — which integrates its models into third-party applications — starting Sept. 6.\nPast Struggles With Huawei Hardware\nEarlier this month, it was reported that DeepSeek delayed its new R2 model launch due to persistent technical problems with Huawei Technologies's Ascend processors. The startup was forced to fall back on Nvidia chips for training, while relying on Huawei hardware only for inference tasks.\nDeepSeek's Growing Impact On Global AI\nDeepSeek first made headlines in January when its R1 model triggered a $600 billion sell-off in Nvidia's market value. Founder Liang Wenfeng has since pushed for aggressive model updates, including the V3 release in March and the R1 update in May.\nNvidia acknowledged DeepSeek's early success, saying the startup's work demonstrated how models can scale using widely available compute while remaining compliant with U.S. export controls.\nChina's Broader Push For Tech Independence\nThe latest development comes as Beijing pushes for domestic chip adoption. Earlier this week, it was reported that Nvidia has reportedly instructed suppliers to pause production of its H20 AI chip for China, amid pressure from Beijing regulators.\nRead Next:\nPhoto: mundissima on Shutterstock.com\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47274541/nvidia-suspends-china-focused-h20-chip-as-beijing-pushes-for-domestic-alternatives-analysts-warn-of-weaker-q3-outlook-report?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
      "text": "Nvidia Corporation NVDA has reportedly ordered suppliers to halt work on its H20 artificial intelligence chip for China, as regulators in Beijing push local firms toward domestic alternatives and Wall Street analysts caution that ongoing uncertainty could weigh on the company's next quarter outlook.\nNvidia Pulls Back On H20 Production\nNvidia told suppliers, including Arizona-based Amkor Technology AMKR and South Korea's Samsung Electronics Co. SSNLF, to suspend work on the H20 chip, reported Reuters (via The Information).\nAmkor provides advanced packaging for the chip, while Samsung supplies high-bandwidth memory.\nNvidia declined to address the specific report but told Benzinga in an emailed statement, \"We constantly manage our supply chain to address market conditions.\"\nThe company also reiterated that the H20 is not a military product and added, \"NVIDIA does not have ‘backdoors’ in our chips that would give anyone a remote way to access or control them. The market can use the H20 with confidence.”\nBeijing Pressures Companies To Shift To Local Chips\nThe suspension comes after Chinese regulators, including the Cyberspace Administration of China, reportedly summoned internet firms such as Tencent Holdings TCEHY and ByteDance over their H20 chip purchases.\nOfficials expressed concerns about information risks and have been urging companies to adopt domestic processors from Huawei Technologies and Cambricon.\nSome firms have started using Huawei's Ascend chips for inference tasks, though many still depend on Nvidia for training more complex AI models. Reports suggest startups like DeepSeek have struggled with delays when relying solely on local alternatives.\nUS Remarks Spark Diplomatic Fallout\nThe regulatory push intensified after U.S. Commerce Secretary Howard Lutnick told CNBC, \"We don't sell them our best stuff, not our second-best stuff, not even our third-best … the thinking is to sell the Chinese enough that their developers get addicted to the American technology stack.\"\nChinese officials reportedly considered the remarks \"insulting\" and moved quickly to curb Nvidia's sales.\nAnalysts See Risk To Q3 Outlook\nKeyBanc Capital Markets warned that Nvidia may guide below Wall Street expectations for the third quarter, citing uncertainties in China.\nThe brokerage estimated that excluding China-related revenue could reduce sales by $2 billion to $3 billion. Still, analysts pointed to strong demand elsewhere, noting GPU supply grew 40% in the second quarter and is projected to rise another 20% in the third with the rollout of Nvidia's Blackwell B200 chips.\nChina represented about 13% of Nvidia's fiscal 2024 revenue, making it a critical but increasingly volatile market.\nPrice Movement: Nvidia shares fell 0.24% in Thursday's regular session and slipped an additional 0.10% in after-hours trading, finishing at $174.80, according to Benzinga Pro.\nBenzinga's Edge Stock Rankings indicate that NVDA maintains a robust upward price trend across short, medium and long-term timeframes. Further performance details are available here.\nRead Next:\nPhoto: Hepha1st0s On Shutterstock.com\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/tech/25/08/47204794/nvidia-prepares-new-china-specific-ai-chip-to-defend-market-share?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47278905",
      "text": "- Nvidia readies Blackwell-based B30A and RTX6000D chips for China to skirt U.S. curbs and defend its 13% revenue share.\n- Analysts split: Bernstein sees shrinking China share, while Needham projects $20B sales by 2028 on Blackwell demand.\n- See what to trade after Powell’s next speech and how to time the market’s reaction. Details here →\nNvidia NVDA is pressing ahead with a China strategy that balances U.S. export restrictions with the need to defend market share in one of its most important regions.\nThe company is developing a new AI chip, tentatively called the B30A, built on its latest Blackwell architecture, Reuters reported on Tuesday.\nAccording to people briefed on the matter, the B30A will use a single-die design, delivering about half the raw computing power of the company’s flagship dual-die B300 accelerator, but more potent than the H20 model Nvidia is currently allowed to sell in China.\nAlso Read: Beijing Asks Alibaba, ByteDance Why They Need Nvidia H20 Chips Instead Of Local Alternatives\nThe chip will include high-bandwidth memory and NVLink connectivity, both of which appear in the H20, a Hopper-based processor customized for the Chinese market.\nNvidia hopes to ship samples to Chinese customers for testing by September.\nChina accounted for 13% of Nvidia’s revenue in fiscal 2024. After an abrupt ban in April, Nvidia only regained permission to sell H20 in July.\nLast week, President Donald Trump signaled that his administration might allow Nvidia to sell scaled-down versions of its most advanced chips in China with 30% to 50% reductions in computing power.\nNVIDIA’s stock gained 36% year-to-date as Big Tech giants like Microsoft MSFT and Alphabet GOOGL keep splurging on their AI ambitions, fueling demand for Nvidia processors.\nNvidia and rival Advanced Micro Devices AMD have already agreed to a deal requiring them to hand over 15% of revenue from advanced chip sales in China to the U.S. government.\nIn parallel, Nvidia is preparing to roll out another China-specific processor, the RTX6000D, which is also based on Blackwell but tuned for AI inference.\nThis chip will feature conventional GDDR memory and bandwidth capped at 1,398 GB/s, just under the 1.4 TB/s limit imposed by new U.S. rules. The RTX6000D will also be priced below the H20 and is scheduled for initial deliveries in September.\nAnalysts remain divided on Nvidia’s outlook in China. Bernstein warned that U.S. export controls and the rise of local players like Huawei could shrink Nvidia’s market share from 66% in 2024 to 54% in 2025, with China’s AI chip localization ratio climbing to 55% by 2027.\nIn contrast, Needham’s N. Quinn Bolton struck a bullish tone, projecting $3 billion in quarterly H20 shipments with near-100% margins on written-down inventory and forecasting $20 billion in China data center sales by fiscal 2028, supported by strong demand for upcoming Blackwell GPU variants.\nPrice Action: NVDA stock is trading higher by 0.33% to $182.61 premarket at last check Tuesday.\nRead Next:\nImage by El editorial via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "Nvidia has paused work on its H20 AI chip for China amid increasing regulatory pressure from Beijing, which is pushing local firms to adopt domestic alternatives. This comes as Chinese AI startup DeepSeek launched its V3.1 model optimized for local processors, highlighting the growing competition for Nvidia in the Chinese market. Analysts warn that the halt could impact Nvidia's revenue, with estimates suggesting a potential $2 billion to $3 billion reduction in quarterly sales due to lost China-related revenue.",
  "argos_id": "HGJQ6ZL1W"
}