{
  "url": "https://www.thestreet.com/crypto/markets/analyst-boosts-stocks-target-by-50",
  "authorsByline": "Anand Sinha",
  "articleId": "56321fc202664aa8adfe76c7a1585018",
  "source": {
    "domain": "thestreet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.thestreet.com/.image/t_share/MTk4NTA5NjczMDEyODY0NDUx/jim-cramer-how-robinhood-turned-etrade-into-a-dinosaur.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T13:16:04+00:00",
  "addDate": "2025-08-22T13:26:43.084321+00:00",
  "refreshDate": "2025-08-22T13:26:43.084323+00:00",
  "score": 1.0,
  "title": "Analyst boosts rallying crypto stock's target by 50%",
  "description": "Robinhood Markets offers a suite of trading products, including crypto offerings.",
  "content": "Analysts at the brokerage firm Bernstein have raised the price target for Robinhood Markets (Nasdaq: HOOD) by more than 50%.\n\nBernstein analysts, led by Gautam Chhugani, raised the price target from $105 to $160 and shared an \"Outperform\" rating for the equity and crypto trading exchange.\n\nRobinhood's crypto trading volume on the app growing 110% month-over-month (MoM) to reach $16.8 billion in July, as well as robust equities and options trading activity, are among the factors the analysts mentioned for their bullish outlook on the stock.\n\nIn addition, Robinhood's acquisition of Bitstamp to boost its institutional user base and the launch of tokenized stocks in Europe are also among the factors Bernstein analysts mentioned in their note.\n\nBernstein expects Robinhood's diversified business model to help grow its earnings per share (EPS) by 53% per year on average through 2027.\n\nNotably, Robinhood announced the launch of pro and college football prediction markets in partnership with Kalshi on Aug. 19.\n\nThe prediction markets are currently available across the U.S. through a Commodity Futures Trading Commission (CFTC)-regulated exchange and accessible on Robinhood's derivatives accounts.\n\n“Football is far and away the most popular sport in America,” said JB Mackenzie, VP & GM of Futures and International at Robinhood. “Adding pro and college football to our prediction markets hub is a no-brainer for us as we aim to make Robinhood a one-stop shop for all your investing and trading needs.”\n\nThe HOOD stock closed at $106.30 on Aug. 21, up 1.88% in a month.",
  "medium": "Article",
  "links": [
    "https://www.thestreet.com/crypto/author/anand-sinha",
    "https://www.thestreet.com/crypto/press-releases/metawin-announces-metawin-create-free-ai-tools-for-all-metawinners-nft-holders",
    "https://www.thestreet.com/crypto/author/chainwire",
    "https://www.thestreet.com/crypto/markets/robinhood-stuns-wall-street-with-shocking-revenue-hike",
    "https://newsroom.aboutrobinhood.com/pro-and-college-football-prediction-markets/",
    "https://investors.robinhood.com/news-releases/news-release-details/robinhood-markets-inc-reports-july-2025-operating-data",
    "https://www.thestreet.com/crypto/press-releases/mexc-rises-to-top-2-crypto-exchange-capturing-8-6-market-share-in-spot-trading",
    "https://roundtable.rtb.io/RTBHOME/community/tech/which-exchange-has-a-better-user-experience",
    "https://www.thestreet.com/crypto/markets/analyst-boosts-stocks-target-by-50",
    "https://www.thestreet.com/crypto/markets/hot-tech-stock-nears-all-time-high-after-fresh-controversy"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Robinhood Markets",
      "weight": 0.10612109
    },
    {
      "name": "Robinhood",
      "weight": 0.10350428
    },
    {
      "name": "Bernstein analysts",
      "weight": 0.09750522
    },
    {
      "name": "tokenized stocks",
      "weight": 0.082371205
    },
    {
      "name": "Commodity Futures Trading Commission",
      "weight": 0.08045394
    },
    {
      "name": "Analyst",
      "weight": 0.075956136
    },
    {
      "name": "Analysts",
      "weight": 0.075956136
    },
    {
      "name": "Robinhoods crypto trading volume",
      "weight": 0.07360925
    },
    {
      "name": "pro and college football prediction markets",
      "weight": 0.07159926
    },
    {
      "name": "Bernstein",
      "weight": 0.0701879
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Cryptocurrency"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9951171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.900390625
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.8037109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.59765625
    }
  ],
  "sentiment": {
    "positive": 0.78631467,
    "negative": 0.03204566,
    "neutral": 0.1816397
  },
  "summary": "Analysts at the brokerage firm Bernstein have raised the price target for Robinhood Markets (Nasdaq: HOOD) from $105 to $160. The analysts cited rising crypto trading volume, robust equities and options trading activity, and the acquisition of Bitstamp as reasons for their positive outlook. They also highlighted the company's diversified business model and potential growth potential.",
  "shortSummary": "BernBristol analysts have raised Robinhood Markets' price target by 50% to $160, citing strong crypto trading volume, acquisitions, and new football prediction markets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4189b2e2036f493e805eea145b8e389e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://newsroom.aboutrobinhood.com/pro-and-college-football-prediction-markets/",
      "text": "Robinhood Launches Pro and College Football Prediction Markets\nSince first launching prediction markets at the end of last year there have been more than 2 billion contracts traded on Robinhood\nToday, Robinhood Derivatives, LLC (RHD) announced the launch of pro and college football prediction markets directly within the Robinhood app. Available through the Prediction Markets Hub, customers can now trade on the outcomes of the most popular pro and college football games, including all regular season pro matchups, and all college Power 4 schools and independents.\n“Football is far and away the most popular sport in America,” said JB Mackenzie, VP & GM of Futures and International at Robinhood. “Adding pro and college football to our prediction markets hub is a no-brainer for us as we aim to make Robinhood a one-stop shop for all your investing and trading needs.”\nPro and college football prediction markets are rolling out now and will be available to all eligible customers in the coming days. At launch we’re offering contracts for the first two weeks of the pro and college seasons, and we plan to add weekly matchups as the season progresses (for example, week 3 games will launch after week 1 concludes).\nUnlike sports betting, where the firm sets a line, event contracts leverage the power and rigor of financial market structure and are offered in a marketplace where buyers and sellers interact to set the price. Customers can access the contracts in real time and manage risk by adjusting–or exiting–their positions up to and throughout a game before a contract expires.\nWe believe in the power of prediction markets and think they play an important role at the intersection of trading, news, information, economics, politics, culture, and sports. We currently offer contracts across crypto, economics, financials, sports, culture, and more, with others being added regularly. Ultimately, our goal is to enable anyone, anywhere, to trade, invest or hold any financial asset and conduct any financial transaction through Robinhood.\nPrediction markets are offered by Robinhood Derivatives and are currently available across the US through a CFTC regulated exchange.\nFor more information you can visit our Help Center or read our recent policy paper on our position and support for this emerging asset class.\nDisclosures:\nRestrictions and eligibility requirements apply. Futures, options on futures and cleared swaps trading involves significant risk and is not appropriate for everyone. Please carefully consider if it’s appropriate for you in light of your personal financial circumstances.\nWe expect pro and college football prediction markets on Robinhood to be tradeable daily from 8:00am ET until 3:00am ET.\nTo be eligible, customers must apply and be approved for a Robinhood Derivatives account (or already have an existing Robinhood Derivatives account). Additional trading prohibitions apply for these contracts. For pro and college football prediction markets, please see Appendix B of the trading prohibitions for these contracts).\nRead the Event Contracts Risk Disclosure for more information about the risks associated with event contracts.\nPro and college football event contracts are offered by Robinhood Derivatives, LLC through KalshiEX LLC. Robinhood Derivatives, LLC is a registered futures commission merchant with the Commodity Futures Trading Commission (CFTC) and Member of National Futures Association (NFA) (NFA ID 0424278). As a registered futures commission merchant, Robinhood Derivatives, LLC, does not make markets in any futures or event contracts.\nPro and college football prediction markets are not endorsed by any professional or collegiate athletic association, or professional or collegiate football team that is part of any professional or collegiate football league, or any other company, agency, or government entity. The use of the term “pro and college football prediction markets” and the use of any professional or collegiate team names or abbreviations or colors does not indicate an endorsement of this product.\n4757264"
    }
  ],
  "argos_summary": "Bernstein analysts have raised the price target for Robinhood Markets from $105 to $160, citing a 110% month-over-month increase in crypto trading volume and strong equities trading. The firm's bullish outlook is also supported by Robinhood's acquisition of Bitstamp and the launch of tokenized stocks in Europe. Additionally, Robinhood has introduced pro and college football prediction markets, aiming to enhance its platform as a comprehensive trading hub.",
  "argos_id": "KG6I1KTXK"
}