{
  "url": "https://www.morningstar.com/news/pr-newswire/20250822ph56940/oshaughnessy-ventures-backs-22-innovators-with-220000-in-grant-funding",
  "authorsByline": "",
  "articleId": "3e54d2dcba1e4120a33ab8bed1511972",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T07:32:00-05:00",
  "addDate": "2025-08-22T12:57:44.515405+00:00",
  "refreshDate": "2025-08-22T12:57:44.515407+00:00",
  "score": 1.0,
  "title": "O'Shaughnessy Ventures Backs 22 Innovators With $220,000 in Grant Funding",
  "description": "",
  "content": "$10,000 grants will advance projects across technology, science, the arts and social innovation\n\n\n\nGREENWICH, Conn., Aug. 22, 2025 /PRNewswire/ -- O'Shaughnessy Ventures LLC (OSV), an investment firm that empowers creators, has awarded 22 O'Shaughnessy Grants totaling $220,000 to creators, builders and researchers pursuing breakthrough projects in technology, science, the arts and social innovation.\n\nLaunched in 2023, the O'Shaughnessy Grants Program provides $10,000 awards to ambitious individuals tackling complex challenges across diverse fields. This year's cohort spans four continents and includes projects ranging from genetically engineered, designable flowers to autonomous spacecraft built to seed life throughout the universe. The grantees also include:\n• Paul \"Benbrick\" Carter (London, England). Peabody Award-winning producer. Carter is creating an audio series that blends orchestral composition, immersive sound design, AI experiments and narrative storytelling.\n• Addy Cha (Florida, USA). Founder of the research institute Ekkolápto and researcher at Florida Atlantic University's Machine Perception and Cognitive Robotics Laboratory. Cha is developing noninvasive communication systems to enable efficient human-animal communication.\n• Alfaxad Eyembe (Kyoto, Japan). Founder of the AI research lab Nadhari. Eyembe is advancing frontier AI applications in sub-Saharan Africa, including by building comprehensive Swahili datasets.\n• Miyoba Hamuhuma (Chipata, Zambia). CEO of the nonprofit organization Enlight Abilities. Hamuhuma is expanding mainstream school enrollment for children with disabilities in Zambia.\n• Daniel Van Zant (Florida, USA). Doctoral candidate in computational neuroscience at Florida Atlantic University. Van Zant is developing an AI co-pilot that generates hallucination-free, well-cited responses to natural language queries.\n• Jose Luis Sabau (Mexico City, Mexico). Writer and journalist. Sabau is launching Perpetuo, a magazine that aims to feature stories from leading Spanish-language writers.\n\nThe complete list of 2025 grant recipients and their projects is available in the OSV newsletter.\n\n\"Our goal with the Grants Program is simple: to give extraordinary people the resources and support they need to take their projects to the next level,\" said Jim O'Shaughnessy, founder and CEO of OSV. \"We're excited to help bring their ambitious visions to life.\"\n\nAbout the O'Shaughnessy Fellowships and Grants Program\n\nLaunched in 2023, the O'Shaughnessy Fellowships and Grants program discovers and empowers the world's boldest creatives, builders and researchers. Fellows receive $100,000, while grantees receive $10,000. Both groups gain access to OSV's network of founders, investors and experts.\n\nOSV has awarded 12 fellowships and 22 grants in 2025. More information about previous fellows and grantees is available at OSV's website.\n\nApplications for the fellowships and grants are now closed and will reopen on Jan. 1, 2026. Individuals interested in learning more can do so via OSV's website.\n\nOSV is a creative investment firm that empowers creators to bring their ideas to life. Founded by Jim O'Shaughnessy, a pioneer in quantitative investing, founder of O'Shaughnessy Asset Management, and author of five books, OSV aims to provide financial support and to partner in growing the next life-changing creative ideas.\n\nOSV combines Jim's deeply rooted interest in all things art, science, investing and technology with his long-held desire to establish scenarios designed to help promising creators and their inspiring ideas succeed, regardless of age, location, job history or level of education. For more information, visit OSV's website.",
  "medium": "Article",
  "links": [
    "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=1302336964&u=https%3A%2F%2Fwww.ekkolapto.org%2F&a=Ekkol%C3%A1pto",
    "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=3779178698&u=https%3A%2F%2Fwww.osv.llc%2F&a=website",
    "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=3458382621&u=https%3A%2F%2Fwww.nadhari.ai%2F&a=Nadhari",
    "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=40798299&u=https%3A%2F%2Fnewsletter.osv.llc%2Fp%2F6c5e9230-3aa7-40ff-8def-c69a2614ac3f%3FpostPreview%3Dpaid%26updated%3D2025-08-13T00%253A32%253A15.912Z%26audience%3Deveryone%26free_preview%3Dfalse%26freemail%3Dtrue&a=OSV+newsletter",
    "https://www.prnewswire.com/news-releases/oshaughnessy-ventures-backs-22-innovators-with-220-000-in-grant-funding-302536265.html",
    "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=1858252848&u=https%3A%2F%2Fwww.benbrick.co.uk%2F&a=Benbrick",
    "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=790616550&u=https%3A%2F%2Fwww.facebook.com%2FInclusive.EA%2F&a=Enlight+Abilities"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "OSV",
      "weight": 0.07288805
    },
    {
      "name": "OShaughnessy Grants",
      "weight": 0.07224891
    },
    {
      "name": "Jim OShaughnessy",
      "weight": 0.07009789
    },
    {
      "name": "OShaughnessy Ventures",
      "weight": 0.064545095
    },
    {
      "name": "OShaughnessy Ventures LLC",
      "weight": 0.063266926
    },
    {
      "name": "Florida Atlantic University",
      "weight": 0.063041784
    },
    {
      "name": "OShaughnessy Asset Management",
      "weight": 0.06295482
    },
    {
      "name": "breakthrough projects",
      "weight": 0.06151364
    },
    {
      "name": "projects",
      "weight": 0.05899242
    },
    {
      "name": "frontier AI applications",
      "weight": 0.05711893
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.8857421875
    },
    {
      "name": "/News/Technology News",
      "score": 0.6455078125
    },
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.43994140625
    },
    {
      "name": "/Science/Engineering & Technology/Other",
      "score": 0.358642578125
    }
  ],
  "sentiment": {
    "positive": 0.7110558,
    "negative": 0.027169704,
    "neutral": 0.26177445
  },
  "summary": "O'Shaughnessy Ventures LLC (OSV), an investment firm that empowers creators, has awarded 22 grants totalling $220,000 to individuals involved in technology, science, the arts, and social innovation. The grants will advance projects across four continents. The recipients include Paul \"Benbrick\" Carter (London, England), Addy Cha (Florida, USA), Alfaxad Eyembe (Kyoto, Japan), Miyoba Hamuhuma (Chipata, Zambia), and Jose Luis Sabau (Mexico City, Mexico). Both groups gain access to OSV's network of founders, investors and experts. The grantees are part of the O'Shaugnessy Grants Program, which provides $10,000 awards to individuals tackling complex challenges across diverse fields.",
  "shortSummary": "O'Shaughnessy Ventures LLC (OSV) has awarded 22 innovative innovators with $220,000 in grants to support them in their groundbreaking projects across diverse fields.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "99a7c34fa295495b920a89b825775f74",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.prnewswire.com/news-releases/oshaughnessy-ventures-backs-22-innovators-with-220-000-in-grant-funding-302536265.html",
      "text": "$10,000 grants will advance projects across technology, science, the arts and social innovation\nGREENWICH, Conn., Aug. 22, 2025 /PRNewswire/ -- O'Shaughnessy Ventures LLC (OSV), an investment firm that empowers creators, has awarded 22 O'Shaughnessy Grants totaling $220,000 to creators, builders and researchers pursuing breakthrough projects in technology, science, the arts and social innovation.\nLaunched in 2023, the O'Shaughnessy Grants Program provides $10,000 awards to ambitious individuals tackling complex challenges across diverse fields. This year's cohort spans four continents and includes projects ranging from genetically engineered, designable flowers to autonomous spacecraft built to seed life throughout the universe. The grantees also include:\n- Paul \"Benbrick\" Carter (London, England). Peabody Award-winning producer. Carter is creating an audio series that blends orchestral composition, immersive sound design, AI experiments and narrative storytelling.\n- Addy Cha (Florida, USA). Founder of the research institute Ekkolápto and researcher at Florida Atlantic University's Machine Perception and Cognitive Robotics Laboratory. Cha is developing noninvasive communication systems to enable efficient human-animal communication.\n- Alfaxad Eyembe (Kyoto, Japan). Founder of the AI research lab Nadhari. Eyembe is advancing frontier AI applications in sub-Saharan Africa, including by building comprehensive Swahili datasets.\n- Miyoba Hamuhuma (Chipata, Zambia). CEO of the nonprofit organization Enlight Abilities. Hamuhuma is expanding mainstream school enrollment for children with disabilities in Zambia.\n- Daniel Van Zant (Florida, USA). Doctoral candidate in computational neuroscience at Florida Atlantic University. Van Zant is developing an AI co-pilot that generates hallucination-free, well-cited responses to natural language queries.\n- Jose Luis Sabau (Mexico City, Mexico). Writer and journalist. Sabau is launching Perpetuo, a magazine that aims to feature stories from leading Spanish-language writers.\nThe complete list of 2025 grant recipients and their projects is available in the OSV newsletter.\n\"Our goal with the Grants Program is simple: to give extraordinary people the resources and support they need to take their projects to the next level,\" said Jim O'Shaughnessy, founder and CEO of OSV. \"We're excited to help bring their ambitious visions to life.\"\nAbout the O'Shaughnessy Fellowships and Grants Program\nLaunched in 2023, the O'Shaughnessy Fellowships and Grants program discovers and empowers the world's boldest creatives, builders and researchers. Fellows receive $100,000, while grantees receive $10,000. Both groups gain access to OSV's network of founders, investors and experts.\nOSV has awarded 12 fellowships and 22 grants in 2025. More information about previous fellows and grantees is available at OSV's website.\nApplications for the fellowships and grants are now closed and will reopen on Jan. 1, 2026. Individuals interested in learning more can do so via OSV's website.\nAbout O'Shaughnessy Ventures\nOSV is a creative investment firm that empowers creators to bring their ideas to life. Founded by Jim O'Shaughnessy, a pioneer in quantitative investing, founder of O'Shaughnessy Asset Management, and author of five books, OSV aims to provide financial support and to partner in growing the next life-changing creative ideas.\nOSV combines Jim's deeply rooted interest in all things art, science, investing and technology with his long-held desire to establish scenarios designed to help promising creators and their inspiring ideas succeed, regardless of age, location, job history or level of education. For more information, visit OSV's website.\nMedia Contact:\nEna Gong\nO'Shaughnessy Ventures LLC\n(917) 355-7420\n[email protected]\nSOURCE O'Shaughnessy Ventures\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=3779178698&u=https%3A%2F%2Fwww.osv.llc%2F&a=website",
      "text": "O'Shaughnessy Ventures\nWe back tomorrow's companies & creators before the world knows their names. Whether you’re coding, filming, writing or building, we’re here to provide the resources, support and connections you need.\nLeads OSV, a family office investment and holding company. Former CEO and Founder of O’Shaughnessy Asset Management. Author of five books, including the New York Times bestseller What Works on Wall Street. Host of the Infinite Loops podcast.\nChief of Staff at OSV, helps lead early stage company and media investing across all OSV verticals. Formerly an investor at a venture fund, ex-investment banking in tech& media, and ex-Navy.\nLeads the development and execution of OSV’s strategic vision. Identifies and evaluates new investment opportunities and supports portfolio companies with operational and financial guidance.\nSoftware & Hardware engineer, AI/ML & security researcher, visual artist.\nLeads Infinite Books, publishing a wide range of fiction and nonfiction works that stand the test of time. Author of multiple books, including the bestselling The Founders: The Story of PayPal and the Entrepreneurs Who Shaped Silicon Valley.\nLeads Infinite Media, OSV’s win-win engine of discovery, curation, and creation. Former full-time investor and editor-in-chief of an online media startup. Writes the Liberty’s Highlights newsletter.\nShreyas Doshi has led & scaled products at Stripe, Twitter, Google, Yahoo, EDS over his 20+ year career as an engineer, product manager (PM), and PM leader.\nJesse Livermore is the pseudonym of a trader, investor and financial content creator who worked with Jim as a research partner at OSAM.\nJeremiah Lowin is the Founder & CEO of Prefect, a leading data engineering company. He's also an advisor to Spotify, FabFitFun, & Compass Coffee.\nLegendary vice chairman of the Ogilvy & Mather Group and author of the bestseller \"Alchemy\", named \"Best Books of the Year for Entrepreneurs\" by Entrepreneur magazine. The Times (London) hailed him as \"The don of modern advertising.\nDr. David is a United States Naval Academy graduate, former two-sport NCAA Division 1 athlete, applied mathematician, cryptologist, cyber security specialist, and robotic general surgeon all achieved before the age of 35!\nAnna not only believes that \"The Good Internet\" exists, she's creating it with her incredible 'salons' where people come together to discuss a wide variety of topics."
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=1858252848&u=https%3A%2F%2Fwww.benbrick.co.uk%2F&a=Benbrick",
      "text": "Benbrick is a Peabody Award Winning, multi-million selling songwriter, composer, and producer.\nHis work ranges from the heartbreaking Sakura Nagashi from Japanese Record Award winning Fantôme, to his stirring and ethereal scores and genre-bending production for George The Poet’s multi award-winning Have You Heard George’s Podcast?\nIn 2024 Benbrick composed the original music idents and station sound for BBC Radio 3 Unwind with the BBC CO at Maida Vale.\nThe Peabody Award Winning Have You Heard George’s Podcast?\nIn 2018 Benbrick started working with spoken word artist George The Poet; composing the original score, and producing what would become Have You Heard George’s Podcast? After releasing 8 episodes in Chapter One, the podcast was described as “a story that could change the world” by BBC Radio 4. The podcast won 5 Gold British Podcast Awards including the Podcast of the Year award, it received press in The New York Times, The Guardian, The Times, Financial Times, and GQ.\nFor the release of Chapter Two the pair announced they were joining BBC Sounds. This partnership would lead to a live BBC Radio Theatre show with music composed by Benbrick and performed by the BBC Concert Orchestra.\nThe pair ended the year in Uganda creating George’s guest segment on the long running Radio 4 Today Programme. In 2020 #HYHGP won Best Podcast at the NME Awards, Podcast of the Year at the Broadcast Press Guild awards, as well as the prestigious Peabody Award.\nFor Chapter Three we had the chance to spend three days at the legendary Abbey Road studios with the BBC Concert Orchestra recording my original score.\nWe celebrated the release of the third season with a sold out live show at the Barbican, and a nomination for the 2021 Rose d’Or for Audio Entertainment.\nFollowing the release Benbrick wrote an article for the BBC about the process of producing a podcast during a pandemic, and took part in a live streamed BBC Academy event about his work.\n“Benbrick is among the most imaginative and forward-thinking producers in audio right now.”\nFinancial Times on Futile Attempts.\nSOUND DESIGN SERIES\nSongwriting. The search to explain complex human emotions through music.\nBenbrick is a multi-platinum selling songwriter and producer. His collaboration with Utada Hikaru sold 500k copies and was included on her subsequent record Fantôme which went on to sell a further 1m copies, and win the Japanese Record Award for Album of the Year. Benbrick wrote Gasoline with Troye Sivan from his TRXYE EP which reached #1 in 66 countries on iTunes, and hit #5 on the US Billboard 200.\nBenbrick has released two EP’s. Closer | Closure and 陰り! (Eclipse).\nBenbrick’s debut artist EP Closer | Closure is a heartbreakingly honest and modern take on the break up record with sparse but dynamic production framed by haunting vocals and intense lyrics. It was synced on various US TV shows. Benbrick’s second EP 陰り! (Eclipse) was created with support from decentralised media project Valu, with cover art created by illustrator Amidst Silence.\nMusic for visuals.\nBenbrick composed Sakura Nagashi for the end credits of the Japanese Academy Award winning movie Evangelion 3. ヱヴァンゲリヲン新劇場版：Q is one of the top 25 highest-grossing anime films worldwide.\nBenbrick was also additional composer on #1 German box office movie Welcome to Germany, and has had music synced in adverts and TV shows including work for McClaren, and worldwide adverts for P&G.\nAfter hearing his original music interwoven with scenes from TV show Derek; Ricky Gervais called Benbrick “a future genius” and his music “stunningly beautiful”. This led to Benbrick composing for Ricky’s Tiger Time charity advert.\nThis is “Have You Heard George’s Podcast?,” a genre-defying piece of audio that pushes the limits of what a podcast can be.\nSome episodes sound like surreal Alice in Wonderland excursions into the neural pathways of his brain. They are funny, poignant, ambitiously metaphorical, endlessly surprising — and this description […] does not even begin to do them justice.\nBlows through the medium’s newly established boundaries, offering an experience as innovative as it is undefinable.\nThe intense, layered soundscaping – by production supremo Benbrick, using more than 4,000 audio tracks – is dazzling, driving the plot forward\nBenbrick is among the most imaginative and forward-thinking producers in audio right now.\nIf you’re interested in sound, you should check it out: its aural soundscape is amazing, as you’d expect from a show produced by Benbrick.\nContact me.\nFind me on social media using the links below."
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4493557-1&h=3458382621&u=https%3A%2F%2Fwww.nadhari.ai%2F&a=Nadhari",
      "text": "Nadhari is an artificial intelligence research and product lab. Our mission is to advance frontier AI research and applications in Sub-Saharan Africa (and beyond).\nAfrica is lagging behind in the AI race. We lack the infrastructure and capital needed to reach the frontier.\nThe good news is that knowledge is not scarce, and we have the technical talent to push us through.\nThis is our only bet.\nWe are going to achieve our mission by:\n- Conducting and open-sourcing frontier AI research on current and future architectures.\n- Building and deploying products that apply this research at scale.\nWe aim to unlock a tremendous amount of value across the continent through intelligence augmentation.\nThis is an exciting challenge and opportunity.\nIt’s an honor to play a part in building an abundant world.\nAlfaxad Eyembe\nMay 12, 2025"
    }
  ],
  "argos_summary": "O'Shaughnessy Ventures LLC has awarded 22 grants totaling $220,000 to creators and researchers through its O'Shaughnessy Grants Program, which supports innovative projects in technology, science, the arts, and social innovation. The 2025 recipients include a diverse group from four continents, working on projects such as AI-driven communication systems and autonomous spacecraft. The program, launched in 2023, aims to empower ambitious individuals by providing financial support and access to a network of experts.",
  "argos_id": "LS05RIV3Y"
}