{
  "url": "https://www.investing.com/news/company-news/ppl-declares-quarterly-dividend-of-02725-per-share-93CH-4206939",
  "authorsByline": "",
  "articleId": "f18a3ca6582c4e7ba41d11dfe69fa052",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T13:15:43+00:00",
  "addDate": "2025-08-22T13:27:10.308240+00:00",
  "refreshDate": "2025-08-22T13:27:10.308246+00:00",
  "score": 1.0,
  "title": "PPL declares quarterly dividend of $0.2725 per share By Investing",
  "description": "PPL declares quarterly dividend of $0.2725 per share",
  "content": "ALLENTOWN - PPL Corporation (NYSE:PPL) announced Friday that its board of directors has declared a quarterly dividend of $0.2725 per share on its common stock. The utility giant, currently trading near its 52-week high at $36.72, has maintained an impressive track record of 55 consecutive years of dividend payments, according to InvestingPro data.\n\nThe dividend will be payable on October 1, 2025, to shareholders of record as of September 10, 2025, according to a press release statement from the company. The current dividend yield stands at 2.97%, reflecting the company’s commitment to shareholder returns.\n\nPPL Corporation, headquartered in Allentown, Pennsylvania, is a utility company that provides electricity and natural gas services to more than 3.6 million customers in the United States.\n\nThe company maintains its regular quarterly dividend payment schedule, which provides income to its shareholders. This declaration represents a continuation of PPL’s established dividend policy.\n\nPPL Corporation operates regulated utilities focused on electricity and natural gas distribution services across its service territories.\n\nIn other recent news, PPL Corporation disclosed its financial results for the second quarter of 2025. The company reported earnings per share (EPS) of $0.32, which did not meet the analyst forecast of $0.38, resulting in a 15.79% negative surprise. However, PPL Corporation exceeded revenue expectations, reporting $2.03 billion compared to the anticipated $1.99 billion, marking a 2.01% positive surprise. Additionally, PPL Corporation has entered into forward contracts to sell approximately 27.4 million shares of its common stock, aiming to raise around $984 million. These contracts were executed through an at-the-market equity distribution program, with settlement dates extending to 2026 and 2027. Furthermore, Louisville Gas and Electric Company and Kentucky Utilities Company, both subsidiaries of PPL Corporation, issued $700 million each in First Mortgage Bonds. These bonds carry an interest rate of 5.850% and mature in 2055, secured by liens on substantial real and tangible personal property in Kentucky.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/pro/PPL"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PPL Corporation",
      "weight": 0.11092262
    },
    {
      "name": "quarterly dividend",
      "weight": 0.09892515
    },
    {
      "name": "dividend payments",
      "weight": 0.09501208
    },
    {
      "name": "PPL",
      "weight": 0.08844342
    },
    {
      "name": "Kentucky Utilities Company",
      "weight": 0.068800926
    },
    {
      "name": "share",
      "weight": 0.067799196
    },
    {
      "name": "PPL’s established dividend policy",
      "weight": 0.06755466
    },
    {
      "name": "regulated utilities",
      "weight": 0.06588893
    },
    {
      "name": "its regular quarterly dividend payment schedule",
      "weight": 0.06463682
    },
    {
      "name": "electricity and natural gas distribution services",
      "weight": 0.060840197
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97412109375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.939453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.92578125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.438720703125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.43017578125
    }
  ],
  "sentiment": {
    "positive": 0.3732847,
    "negative": 0.04374155,
    "neutral": 0.5829737
  },
  "summary": "PPL Corporation (PPL) has announced a quarterly dividend of $0.2725 per share on its common stock, marking a 55 consecutive year of dividend payments. The dividend will be paid to shareholders of record as of September 10, 2025. The company's current dividend yield stands at 2.97%. PPL Corporation, which provides electricity and natural gas services to over 3.6 million customers in the United States, exceeded revenue expectations for Q2 2025, reaching $2.03 billion compared to the anticipated $1.99 billion. The utility company also entered into forward contracts to sell approximately 27.4 million shares of its commonstock to raise around $984 million.",
  "shortSummary": "PPL Corporation declared a quarterly $0.2725 dividend, maintaining its 55-year track record, while reporting better-than-expected quarterly earnings and sales.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "005807d3d5bc4b62919d8b99fec618df",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "PPL Corporation has declared a quarterly dividend of $0.2725 per share, continuing its 55-year streak of dividend payments, with a current yield of 2.97%. The dividend will be payable on October 1, 2025, to shareholders of record as of September 10, 2025. In its recent financial results, PPL reported an EPS of $0.32, below the expected $0.38, but exceeded revenue expectations with $2.03 billion. Additionally, the company plans to raise approximately $984 million through forward contracts for common stock sales and its subsidiaries issued $700 million in bonds.",
  "argos_id": "MO5KYIB8Y"
}