{
  "url": "https://appleinsider.com/articles/25/08/22/inside-ios-26-genmoji-tapbacks-smarter-ai-deeper-customization",
  "authorsByline": "Andrew Orr",
  "articleId": "4259264b22d148a184305d872c5774b5",
  "source": {
    "domain": "appleinsider.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Cupertino",
      "coordinates": {
        "lat": 37.3228934,
        "lon": -122.0322895
      }
    }
  },
  "imageUrl": "https://photos5.appleinsider.com/gallery/64465-134315-Genmoji-xl.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T11:36:00+00:00",
  "addDate": "2025-08-22T11:44:14.681362+00:00",
  "refreshDate": "2025-08-22T11:44:14.681364+00:00",
  "score": 1.0,
  "title": "Inside iOS 26 Genmoji: Tapbacks, smarter AI & deeper customization",
  "description": "Apple is improving Genmoji in iOS 26 with better prompts, expanded customization, and tighter integration with your favorite apps.",
  "content": "Apple is improving Genmoji in iOS 26 with better prompts, expanded customization, and tighter integration with your favorite apps.\n\nGenmoji first appeared in iOS 18.2 as part of Apple Intelligence. It lets iPhone users create their own emoji-style stickers using short text descriptions or a mix of emoji.\n\nThe stickers look like emoji, but they're actually images generated on the device using Apple's AI model. The new update adds more flexibility.\n\nYou can now blend multiple ideas, describe emotional expressions, and build Genmoji based on people in your photo library. The iOS 26 update also makes it easier to use Genmoji in Messages, Notes, and other apps that support the keyboard.\n\nWhat Genmoji are and how they work\n\nGenmoji aren't part of the standard emoji set. Instead, each one is a custom image that behaves like a sticker. They're designed to fill the gaps where regular emoji fall short.\n\nTo create one, tap the Genmoji icon in the emoji keyboard. Type a phrase like \"giraffe on a unicycle,\" or select emoji and themes from the suggestion bar.\n\nThe system will quickly generate a few options, and you can swipe through them to pick the best fit. You combine up to six concepts in a single prompt.\n\nYou can mix emoji, words, themes, or even other Genmoji. The interface also shows suggestions for expressions, accessories, and settings to help shape your idea.\n\nIf you type the name of someone in your photo library, you can build a Genmoji that includes them in a specific scene, like \"Jordan hiking on a mountain.\"\n\nThe latest version of Genmoji introduces a range of new tools designed to enhance its expressiveness and utility. One feature is the ability to create custom expressions.\n\nUsers can guide the system in depicting a person's emotions by using prompts such as \"smiling,\" \"shocked,\" or \"sleepy,\" allowing for a personalized emotional representation.\n\nThe system now supports more detailed appearance descriptions. Users can specify physical traits like curly hair, glasses, or hats, which helps in creating Genmoji that are more accurate and reflective of the desired look.\n\nThe AI behind Genmoji has also been improved to deliver smarter results. It now produces higher-quality images and offers better matches to user prompts.\n\nIf the initial version doesn't meet expectations, users can swipe through alternative options without needing to rewrite their prompt. Furthermore, Genmoji now supports Tapback reactions in Messages.\n\nTapback reactions allow users to replace the default heart or thumbs-up with their own custom sticker, adding a personal touch to their interactions. Overall, these enhancements make Genmoji a more versatile and engaging tool for users.\n\nWhere you can use Genmoji\n\nYou don't have to stay in Messages to use Genmoji. Since the feature lives in the emoji keyboard, you can access it in any app that supports typing. That includes Mail, Notes, WhatsApp, and most social media apps.\n\nGenmoji are sent as images, so they'll show up properly even for people using older devices or platforms without Genmoji support.\n\nApple also added Genmoji to Image Playground, a separate creative app introduced with Apple Intelligence. Inside the Playground, you can generate emoji-style images alongside sketches, animations, and illustrations.\n\nGenmoji are fun to create and use\n\nStandard emoji are popular but limited. They can't always capture specific situations or feelings, and new emoji are slow to roll out. Genmoji gives users a fast, personal way to create visual language that fits the moment.\n\nThe feature runs entirely on-device, using Apple's AI model. Prompts never leave your phone, and no data is sent to the cloud.\n\nApple labels Genmoji as a beta feature in iOS 26, and some results may be hit or miss. But the system is fast, fun, and surprisingly flexible.",
  "medium": "Article",
  "links": [
    "https://appleinsider.com/inside/apple-intelligence",
    "https://appleinsider.com/inside/ios-26",
    "https://photos5.appleinsider.com/gallery/64465-134316-IMG_0354-3-xl.jpg",
    "https://photos5.appleinsider.com/gallery/64465-134317-IMG_0354-xl.jpg"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Genmoji",
      "weight": 0.10520593
    },
    {
      "name": "Genmoji support",
      "weight": 0.10155723
    },
    {
      "name": "new emoji",
      "weight": 0.09215946
    },
    {
      "name": "user prompts",
      "weight": 0.086853884
    },
    {
      "name": "regular emoji",
      "weight": 0.08603163
    },
    {
      "name": "emoji",
      "weight": 0.08546115
    },
    {
      "name": "iPhone users",
      "weight": 0.07048121
    },
    {
      "name": "Users",
      "weight": 0.06996829
    },
    {
      "name": "users",
      "weight": 0.06996829
    },
    {
      "name": "better prompts",
      "weight": 0.06852054
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.91748046875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8974609375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.72265625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.52587890625
    }
  ],
  "sentiment": {
    "positive": 0.3410202,
    "negative": 0.11136367,
    "neutral": 0.5476161
  },
  "summary": "Apple is enhancing its Genmoji feature in iOS 26 with better prompts, expanded customization, and tighter integration with other apps. The update adds more flexibility to blend multiple ideas, describe emotional expressions, and build Genmojons based on people in your photo library. The system now supports more detailed appearance descriptions and can now create custom expressions based on specific person's appearance. The AI behind Genmoja has also been improved to deliver smarter results and matches better matches to user prompts. The feature now runs entirely on-device and runs without data being sent to the cloud.",
  "shortSummary": "Apple's iOS 26 features enhanced Genmoji functionality with enhanced AI, expanded customization, and integration into popular apps, enhancing user engagement and functionality.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e2cac7e1ed1144359b5e20e57df585df",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Apple is enhancing Genmoji in iOS 26, allowing users to create custom emoji-style stickers with improved prompts, expanded customization options, and better integration with apps like Messages and Notes. Users can now blend multiple concepts, describe emotions, and include people from their photo library in their creations. The update also introduces features like custom expressions and detailed appearance descriptions, making Genmoji a more versatile tool for personal expression.",
  "argos_id": "NJVYODKLV"
}