{
  "url": "https://www.investing.com/news/company-news/airnet-technology-announces-180-million-registered-direct-offering-93CH-4206731",
  "authorsByline": "",
  "articleId": "75685b37a72845bbb2f97aa9ae9870ad",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T12:05:16+00:00",
  "addDate": "2025-08-22T12:13:09.581359+00:00",
  "refreshDate": "2025-08-22T12:13:09.581361+00:00",
  "score": 1.0,
  "title": "AirNet Technology announces $180 million registered direct offering By Investing",
  "description": "AirNet Technology announces $180 million registered direct offering",
  "content": "BEIJING - AirNet Technology Inc. (NASDAQ:ANTE), currently valued at $10.75 million in market capitalization, announced Friday it has entered into a definitive agreement with investors for a registered direct offering expected to raise approximately $180 million in gross proceeds. The stock has experienced significant volatility, dropping 18.5% in the past week despite a remarkable 193% gain over the last six months.\n\nThe offering consists of 80,826,225 ordinary shares and accompanying warrants to purchase an equal number of shares at a combined purchase price of $2.227 per ordinary share and warrant. The warrants will be immediately exercisable at $3.3405 per share and expire five years from issuance. According to InvestingPro analysis, the company currently shows signs of financial stress with a current ratio of 0.33, indicating short-term obligations exceed liquid assets.\n\nThe transaction is expected to close around August 27, 2025, subject to customary closing conditions. AirNet plans to use the net proceeds for general corporate and working capital purposes.\n\nThe securities are being offered pursuant to an effective shelf registration statement on Form F-3 filed with the U.S. Securities and Exchange Commission on May 10, 2024, and declared effective on May 31, 2024.\n\nThis announcement is based on a press release statement from the company. The offering represents a significant capital raise for AirNet, which is listed on the Nasdaq exchange.\n\nIn other recent news, AirNet Technology Inc. has announced several significant developments. The company has filed materials related to an upcoming extraordinary shareholder meeting, although the specific date and agenda items have not been disclosed. Additionally, AirNet Technology has appointed Vikram Seth as Fractional Chief Investment Officer to lead its strategic investments in Web3 and cryptocurrency initiatives. Seth will oversee the company’s digital asset treasury and execute investment strategies. Furthermore, Professor Yu Xiong has been named Chief Research and Innovation Advisor to guide AirNet’s transformation toward Web3 and cryptocurrency efforts. The company has also regained compliance with Nasdaq’s minimum bid price requirement, maintaining a closing bid price of $1.00 or higher for ten consecutive business days. These recent developments highlight AirNet Technology’s strategic focus on digital assets and compliance with market regulations.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/pro/ANTE"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AirNet Technology Inc.",
      "weight": 0.095448405
    },
    {
      "name": "AirNet Technology",
      "weight": 0.09527022
    },
    {
      "name": "AirNet",
      "weight": 0.078893095
    },
    {
      "name": "ordinary share",
      "weight": 0.06806498
    },
    {
      "name": "digital assets",
      "weight": 0.06736956
    },
    {
      "name": "Fractional Chief Investment Officer",
      "weight": 0.062880866
    },
    {
      "name": "several significant developments",
      "weight": 0.061525635
    },
    {
      "name": "significant volatility",
      "weight": 0.06124908
    },
    {
      "name": "AirNet Technology’s strategic focus",
      "weight": 0.05940852
    },
    {
      "name": "liquid assets",
      "weight": 0.058635097
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9931640625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9912109375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98828125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.337890625
    }
  ],
  "sentiment": {
    "positive": 0.11203182,
    "negative": 0.43943164,
    "neutral": 0.44853646
  },
  "summary": "AirNet Technology Inc. (NASDAQ:ANTE), currently valued at $10.75 million in market capitalization, has announced a registered direct offering to raise approximately $180 million in gross proceeds. The offering consists of 80,826,225 ordinary shares and accompanying warrants to purchase an equal number of shares at a combined purchase price of $2.227 per ordinary share and warrant. The transaction is expected to close around August 27, 2025. The company plans to use the net proceeds for general corporate and working capital purposes. Other notable developments include the appointment of Vikram Seth as Fractional Chief Investment Officer to lead its strategic investments in Web3 and cryptocurrency initiatives.",
  "shortSummary": "AirNet Technology Inc. is raising $180 million through a registered direct offering, with significant developments including appointing a top investment officer and resuming operations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "41fe51d6370e43d2bb339c3f9c14ee43",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "AirNet Technology Inc. has announced a definitive agreement for a registered direct offering expected to raise approximately $180 million, despite recent stock volatility. The offering includes 80,826,225 ordinary shares and warrants, with proceeds aimed at general corporate purposes. The company has also made strategic appointments to enhance its focus on Web3 and cryptocurrency initiatives, while maintaining compliance with Nasdaq's listing requirements.",
  "argos_id": "NSUEKXGYE"
}