{
  "url": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-white-house-adviser-navarro-expects-50-india-tariff-200619285.html",
  "authorsByline": "Yahoo Finance",
  "articleId": "8a1d3508a5fa4d9e9a1b378a9cc96708",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/p_VK7PYDbL.geP650Yv2NA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/24d38ac0-7f50-11f0-b6fb-59fd41002cc6",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T12:25:21+00:00",
  "addDate": "2025-08-22T12:33:54.131874+00:00",
  "refreshDate": "2025-08-22T12:33:54.131876+00:00",
  "score": 1.0,
  "title": "Trump tariffs live updates: White House adviser Navarro expects 50% India tariff",
  "description": "Yahoo Finance is chronicling the latest news and updates on Trump's tariffs.",
  "content": "White House trade adviser Peter Navarro again criticized India for its ongoing purchases of Russian oil and said he anticipates the planned 50% punitive tariffs on Indian imports will take effect next week.\n\n“I see that taking place,” Navarro told reporters in front of the White House when asked about the tariffs on India that are set to double on Aug. 27. “India doesn’t appear to want to recognize its role in the bloodshed. It simply doesn’t. It’s cozying up to Xi Jinping, is what it’s doing.”\n\nA Chinese official voiced support for India regarding US tariffs on its exports, highlighting growing cooperation between the two Asian neighbors.\n\n“The United States has imposed tariffs of up to 50% on India, and it has even threatened for more. China firmly opposes this,” said China’s ambassador to India, Xu Feihong.\n\nOn Thursday, the US and the EU established a written framework for the trade deal agreed to on July 27. The terms include a 15% US tariff on most EU imports: These include autos, pharmaceutical goods, semiconductors, and lumber — but not wine and spirits.\n\nThe two sides also outlined the EU's promise to remove tariffs on US industrial goods and give better access to US seafood and agricultural products.\n\nOn Wednesday, US Treasury Secretary Scott Bessent said the US is content with its current tariff setup with China, signaling the Trump administration wants stability ahead of the November trade truce deadline.\n\nIn a Fox News interview, Bessent said the status quo is \"working pretty well\" and called China the biggest source of tariff revenue.\n\nBessent went on to add in a further interview with CNBC that he expects tariff revenues under President Trump to exceed his earlier $300 billion estimate, with the money going to pay down the federal debt rather than rebate checks for Americans.\n\nEarlier this month, Trump unveiled \"reciprocal\" tariffs on dozens of US trade partners (which you can see in the graphic below).\n\nThe biggest negotiations to watch in the coming months are Canada, Mexico, and China.\n\nRead more: What Trump's tariffs mean for the economy and your wallet\n\nHere are the latest updates as the policy reverberates around the world.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/news/southwire-praises-copper-tariffs-says-213913976.html",
    "https://finance.yahoo.com/news/live/earnings-live-gm-stock-sinks-on-tariff-hit-coca-cola-to-launch-cane-sugar-soda-143736342.html?guccounter=1",
    "https://policy.trade.ec.europa.eu/news/joint-statement-united-states-european-union-framework-agreement-reciprocal-fair-and-balanced-trade-2025-08-21_en",
    "https://finance.yahoo.com/news/china-firmly-stands-india-trump-004736424.html",
    "https://finance.yahoo.com/quote/TGT",
    "https://finance.yahoo.com/quote/005930.KS",
    "https://www.yahoo.com/news/articles/eu-says-draft-joint-statement-111641797.html",
    "https://finance.yahoo.com/news/bessent-says-us-tariff-revenues-174752674.html",
    "https://finance.yahoo.com/news/why-trump-tariff-inflation-is-arriving-slowly-202437568.html",
    "https://finance.yahoo.com/news/nvidia-asks-suppliers-halt-h20-005428505.html",
    "https://finance.yahoo.com/news/beijing-turns-against-nvidia-ai-001506966.html",
    "https://finance.yahoo.com/author/rick-newman/",
    "https://finance.yahoo.com/quote/AMKR",
    "https://finance.yahoo.com/news/economic-impact-us-tariffs-key-131342925.html",
    "https://finance.yahoo.com/news/china-snaps-russian-oil-indian-073304518.html",
    "https://finance.yahoo.com/author/anjalee-khemlani",
    "https://finance.yahoo.com/personal-finance/taxes/article/what-is-a-tariff-194059448.html",
    "https://finance.yahoo.com/news/tariffs-giving-parents-back-school-090042190.html",
    "https://finance.yahoo.com/news/chinas-rare-earth-magnet-exports-024956367.html",
    "https://finance.yahoo.com/author/brian-sozzi/",
    "https://finance.yahoo.com/news/us-eu-lock-trade-deal-110344336.html",
    "https://finance.yahoo.com/quote/NVDA",
    "https://finance.yahoo.com/news/eu-us-trade-deal-does-123710228.html",
    "https://finance.yahoo.com/news/japan-exports-fall-most-four-004934430.html",
    "https://finance.yahoo.com/news/korea-early-export-lifted-chips-023337179.html",
    "https://finance.yahoo.com/quote/WMT",
    "https://finance.yahoo.com/news/us-eu-trade-deal-impacts-on-pharma-industry-more-manageable-than-expected-153242223.html",
    "http://finance.yahoo.com/news/eu-us-trade-deal-does-123710228.html",
    "https://finance.yahoo.com/news/estee-lauder-forecasts-annual-profit-100555312.html",
    "https://finance.yahoo.com/news/navarro-slams-india-over-russian-073021815.html",
    "https://finance.yahoo.com/quote/688256.SS",
    "https://finance.yahoo.com/news/sony-hikes-playstation-5-prices-161831105.html",
    "https://finance.yahoo.com/news/johnson-johnson-invest-2-billion-091136627.html",
    "https://finance.yahoo.com/news/trumps-sweeping-tariffs-take-effect-in-another-dramatic-reshaping-of-the-us-trade-landscape-040101506.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US tariffs",
      "weight": 0.1282659
    },
    {
      "name": "Trump tariffs live updates",
      "weight": 0.10827869
    },
    {
      "name": "tariff revenue",
      "weight": 0.10577515
    },
    {
      "name": "tariff revenues",
      "weight": 0.10577515
    },
    {
      "name": "tariffs",
      "weight": 0.10381246
    },
    {
      "name": "US trade partners",
      "weight": 0.1004774
    },
    {
      "name": "US industrial goods",
      "weight": 0.09379605
    },
    {
      "name": "US Treasury Secretary Scott Bessent",
      "weight": 0.08986015
    },
    {
      "name": "US seafood",
      "weight": 0.08954789
    },
    {
      "name": "US",
      "weight": 0.087929696
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9716796875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.931640625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9140625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.8798828125
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.7509765625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.48583984375
    },
    {
      "name": "/News/World News",
      "score": 0.393798828125
    }
  ],
  "sentiment": {
    "positive": 0.14427452,
    "negative": 0.50776494,
    "neutral": 0.3479605
  },
  "summary": "White House trade adviser, Peter Navarro, has predicted that the planned 50% punitive tariffs on Indian imports will take effect next week. This follows criticism of India's ongoing purchases of Russian oil and support for India in relation to US tariffs on its exports. The US and the EU have established a framework for a trade deal that includes a 15% US tariff on most EU imports, removing tariffs on US industrial goods and giving better access to US seafood and agricultural products. US Treasury Secretary Scott Bessent also stated that the US is content with its current tariff setup with China, indicating the administration wants stability ahead of the November trade truce.",
  "shortSummary": "White House adviser Peter Navarro expects 50% tariffs on India, amid ongoing tensions and trade talks between the US, EU, and China.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "66d0bbf6cc6640469ec7991e7ef40af2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/us-eu-trade-deal-impacts-on-pharma-industry-more-manageable-than-expected-153242223.html",
      "text": "A 15% import tariff on pharmaceutical goods from the European Union to the US is going to have a lesser impact on the pharmaceutical industry than Wall Street feared.\nBig pharmaceutical stocks like Pfizer (PFE), Eli Lilly (LLY), and Johnson & Johnson (JNJ) rose slightly, by about 1%, in trading Thursday after the trade deal was announced, putting to rest concerns of tariffs threatened as high as 200% previously by President Trump.\n\"The two regions have established a 15% tariff cap on imported drugs from EU to the US. This is being viewed by most as both manageable and below the 20%+ rate many expected,\" wrote Mizuho's healthcare expert Jared Holz in a note to clients Thursday.\nThe deal outlined by the US and EU has multiple parts that impact the pharmaceutical industry, with some clarity still needed.\nThe first is levying either the 15% tariff or the Most Favored Nation (MFN) pricing, whichever is higher, on pharma drugs manufactured in the EU. This puts more emphasis on President Trump's efforts to equalize US drug costs to the lower prices seen in the EU and other developed nations and also impacts a smaller portion of products, as pharma executives have emphasized that most of the branded drugs sold in the US are made in the US. But questions remain on whether the finalize products, or some components, will be taxed.\n\"The United States commits to apply the higher of either the US MFN tariff rate or a tariff rate of 15 percent, comprised of the MFN tariff and a reciprocal tariff, on originating goods of the European Union,\" according to the White House statement.\nThe second part of the deal is that, as of Sept. 1, the US will enforce MFN pricing on generics and \"chemical precursors.\" The latter refers to active pharmaceutical ingredients, which are the key chemical compounds in any drug. They are cheaper to mass-produce overseas, largely in Asia or Ireland.\nExperts say that prices for generics, which account for a majority of prescriptions filled in the US, are already low.\n\"The administration is, for the time being, focusing Most Favored Nations pricing on generic products — hoping to peg US prices to that of other countries. Given the already lower cost of generic medicines and net price paid domestically, see the financial ramifications here as more limited than not. Have to look deeper at what precise drugs will be subject to this regulation but for now, not a strategy we see as stifling the industry/major players,\" Mizuho's Holz said.\nIts why big generics players, like Teva (TEVA), saw their stocks also rise on the news — up more than 4% Thursday. UBS analyst Ashwani Verma called the trade deal a positive for drugmakers in a note to clients Thursday."
    },
    {
      "url": "https://finance.yahoo.com/news/chinas-rare-earth-magnet-exports-024956367.html",
      "text": "By Amy Lv and Lewis Jackson\nBEIJING (Reuters) -China's exports of rare earth magnets recovered to hit a six-month high in July, showing trade flows of the critical minerals key to electric vehicles have returned to levels seen before Beijing imposed export curbs.\nExports from the world's largest rare earth magnet supplier rose nearly 75% from June to hit the highest for a single month since January at 5,577 metric tons last month, data from the General Administration of Customs showed on Wednesday.\nThe July volume, which was in line with analysts' expectations, was also 5.7% higher than 5,278 tons shipped in the same month last year.\nThe continued recovery in exports came after Beijing agreed to a series of deals with the United States and Europe to increase shipments and ease the export control imposed in April in retaliation for U.S. tariffs.\nShipments declined sharply in April and May due to lengthy approval processes for securing export licences, upending global supply chains and forcing some automakers outside China to halt some production due to a rare earths shortage.\nBy country, Germany remained the No.1 export destination with a volume of 1,116 tons, up 46% from the prior month.\nOutbound shipments to the United States last month also jumped by 75.5% from the month before to 619 tons, 4.8% higher than the same month in 2024.\nIn the first seven months of this year, China's exports of rare earth magnets totaled 27,897 tons, with the annual fall narrowing to 15% from 18.9% for the first half.\n(Reporting by Amy Lv and Lewis Jackson; Editing by Himani Sarkar and Sonali Paul)"
    },
    {
      "url": "https://finance.yahoo.com/quote/AMKR",
      "text": "Amkor Technology, Inc. (AMKR)\n- Previous Close\n23.76 - Open\n23.79 - Bid 23.92 x 2300\n- Ask 24.16 x 2300\n- Day's Range\n23.77 - 24.15 - 52 Week Range\n14.03 - 33.85 - Volume\n1,544,686 - Avg. Volume\n1,996,982 - Market Cap (intraday)\n5.944B - Beta (5Y Monthly) 1.86\n- PE Ratio (TTM)\n19.71 - EPS (TTM)\n1.22 - Earnings Date Jul 28, 2025\n- Forward Dividend & Yield 0.33 (1.39%)\n- Ex-Dividend Date Sep 3, 2025\n- 1y Target Est\n24.38\nAmkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, and the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, system-level and final test, and drop shipment services; flip chip scale package products for smartphones, tablets, and other mobile consumer electronic devices; flip chip stacked chip scale packages that are used to stack memory digital baseband, and as applications processors in mobile devices; flip-chip ball grid array packages for various networking, storage, computing, automotive, and consumer applications; and memory products for system memory or platform data storage. The company provides wafer-level CSP packages for power management, transceivers, sensors, wireless charging, codecs, radar, and specialty silicon; wafer-level fan-out packages used in power management, transceivers, radar, and specialty silicon; silicon wafer integrated fan-out technology that replaces a laminate substrate with a thinner structure; leadframe packages for electronic devices and mixed-signal applications; and substrate-based wirebond packages used to connect a die to a substrate. In addition, it offers micro-electro-mechanical systems packages that are miniaturized mechanical and electromechanical devices; and advanced system-in-package modules used in radio frequency and front end modules, basebands, connectivity, fingerprint sensors, display and touch screen drivers, sensors and MEMS, and NAND memory and solid-state drives. Further, the company provides wafer, package, and system level test services, as well as burn-in test and test development services. It serves integrated device manufacturers, fabless semiconductor companies, original equipment manufacturers, and contract foundries. Amkor Technology, Inc. was founded in 1968 and is headquartered in Tempe, Arizona.\namkor.com28,300\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nSemiconductor Equipment & Materials\nIndustry\nRecent News: AMKR\nView MorePerformance Overview: AMKR\nTrailing total returns as of 8/18/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: AMKR\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: AMKR\nView MoreValuation Measures\nMarket Cap\n5.87B\nEnterprise Value\n5.53B\nTrailing P/E\n19.48\nForward P/E\n23.42\nPEG Ratio (5yr expected)\n--\nPrice/Sales (ttm)\n0.93\nPrice/Book (mrq)\n1.40\nEnterprise Value/Revenue\n0.87\nEnterprise Value/EBITDA\n5.19\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n4.80%\nReturn on Assets (ttm)\n3.49%\nReturn on Equity (ttm)\n7.34%\nRevenue (ttm)\n6.32B\nNet Income Avi to Common (ttm)\n303.76M\nDiluted EPS (ttm)\n1.22\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n2.04B\nTotal Debt/Equity (mrq)\n42.84%\nLevered Free Cash Flow (ttm)\n344.29M\nResearch Analysis: AMKR\nView MoreResearch Reports: AMKR\nView MoreRaising target price to $26.00\nAMKOR TECHNOLOGY INC has an Investment Rating of HOLD; a target price of $26.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Low.\nRatingPrice TargetDaily – Vickers Top Buyers & Sellers for 08/06/2025\nThe Vickers Top Buyers & Sellers is a daily report that identifies the five companies the largest insider purchase transactions based on the dollar value of the transactions as well as the five companies the largest insider sales transactions based on the dollar value of the transactions.\nLowering target price to $23.00\nAMKOR TECHNOLOGY INC has an Investment Rating of HOLD; a target price of $23.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium.\nRatingPrice TargetRaising target price to $26.00\nAMKOR TECHNOLOGY INC has an Investment Rating of HOLD; a target price of $26.000000; an Industry Subrating of High; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium.\nRatingPrice Target"
    },
    {
      "url": "https://finance.yahoo.com/news/why-trump-tariff-inflation-is-arriving-slowly-202437568.html",
      "text": "The Trump tariffs present something of a mystery. Trump's new import taxes raise the cost of many imported products by nearly 20%, on average. Yet price changes at the wholesale and retail level are nowhere near that magnitude. The higher cost of tariffs appears to be hiding deep inside global supply chains.\nOne new clue helps explain why Trump's new consumption taxes aren't fully hitting consumers just yet. Analysis by Capital Economics finds that the actual tariff rate paid on imports in June was just 9%. At the time, analysts estimated the average tariff rate to be around 15%. It turned out to be lower in reality because many US importers shifted their mix and source of imports to minimize the cost of the tariffs.\nResearch outfits such as the Yale Budget Lab, along with many private firms, have been trying to estimate average tariff rates at every step of Trump's convoluted trade war. That data helps economists estimate the effect of tariffs on the economy, while investors try to suss out which firms and sectors will be helped or hurt by the new taxes.\nEstimates of the average tariff rate have changed many times during the past six months as Trump has threatened new tariffs, imposed some, delayed others, announced trade agreements, and changed his mind. The average tariff was about 2.5% when Trump took office. It went as high as 28% in April and May, according to the Yale Budget Lab. Since then, it has dropped to around 19%.\nBut those estimates rely on assumptions about what US firms will continue to import and from where. The actual June data shows that US importers were craftier than expected. \"The composition of imports has shifted compared to 2024, with a higher proportion coming from countries with relatively low tariff rates,\" Capital Economics found.\nThe June data, for instance, shows that fewer imports came from China, which faced a 40% tariff rate. More imports came from Vietnam, Taiwan, and India, which faced lower rates at the time. That pushed the actual tariff rate lower than if import shares by country had stayed the same.\nUS businesses also shifted the kind of stuff they brought into the country. Imports of steel and aluminum — generally subject to a new 25% tariff — fell as a portion of all imported products. But there was an increase in electronics exempt from tariffs.\nA third factor keeping the tariff rate fairly low was more \"compliant\" trade with Canada and Mexico than expected. That means there was more trade in goods that meet domestic-content requirements and are therefore exempt from the new Trump tariffs.\nThe June trend probably reflects the delayed onset of tariff inflation, rather than the total avoidance of it. Importers have been ducking and weaving as circumstances allow, but they can't do that forever. They can stock inventories with cheaper low-tariff goods while running down stockpiles of costlier high-tariff goods — for a while. But at some point, demand will require them to replenish all inventories, regardless of the tariffs.\nPlus, Trump is wise to the transshipment of goods from a high-tariff country to the US via a low-tariff country, and some of his trade rules specifically target that. Imports from Vietnam, for instance, face a 20% tariff, but it's 40% if those products really come from China or some other country and just make a stop in Vietnam on their way to the US.\nEven with lower-than-expected tariff rates — for now — tariff inflation is beginning to materialize. Monthly tariff revenue collected by the government has jumped from about $8 billion per month before Trump to about $30 billion now. That tax revenue comes from US businesses that have to pay the tariffs when they take possession of imported goods. It's real money that real Americans are forking over.\nWholesale prices in July jumped by the most in three years, confirming that importers are now paying more for goods. During the second quarter earnings season, dozens of big companies, including Apple (AAPL), Ford (F), General Motors (GM), Johnson & Johnson (JNJ), Kimberly-Clark (KMB), and Procter & Gamble (PG), said tariffs are denting profit margins.\nCiti estimates that, for now, companies are absorbing most of the cost of tariffs through lower margins and supply chain workarounds. But the pain will eventually flow through to consumers.\n\"US firms appear to be absorbing 60%-70% of the tariffs,\" Citi researchers said in an August 20 analysis. \"However, we doubt that this will prove sustainable. We expect that firms will increasingly seek to pass the tariffs through to their foreign suppliers and US customers.\"\nTrump's trade deals will eventually yield a much clearer picture. The past several months have been a hodgepodge of on-and-off tariffs that have dramatically distorted trade flows. But a year from now, say, there will likely be across-the-board tariffs on most imports that range from 15% to 40%, plus product-specific tariffs on certain product categories that leave nowhere to hide. If you haven't noticed tariff inflation yet, you will soon.\nRick Newman is a senior columnist for Yahoo Finance. Follow him on Bluesky and X: @rickjnewman."
    },
    {
      "url": "https://finance.yahoo.com/news/china-firmly-stands-india-trump-004736424.html",
      "text": "(Bloomberg) -- A Chinese official expressed solidarity with India against US tariffs on Indian exports, the latest sign of warming ties between the two Asian rivals.\n“The United States has imposed tariffs of up to 50% on India and it has even threatened for more. China firmly opposes this,” China’s ambassador to India, Xu Feihong, said Thursday. “China will firmly stand with India to uphold the multilateral trading system, with the World Trade Organization at its core.”\nMost Read from Bloomberg\n-\nWhy New York City Has a Fleet of New EVs From a Dead Carmaker\n-\nNeom’s Desert Ski Resort Strains Saudi Prince’s $1.5 Trillion Plan\n-\nTrump Takes Second Swing at Cutting Housing Assistance for Immigrants\n-\nChicago Schools Seeks $1 Billion of Short-Term Debt as Cash Gone\nXu’s comments come as Beijing and New Delhi take steps to recalibrate their ties against the backdrop of their strained relations with the Trump administration. The two neighbors this week agreed to explore demarcating their disputed border as Chinese Foreign Minister Wang Yi visited India on his first trip in three years.\nXu was speaking at a panel event in New Delhi about the upcoming summit of the Shanghai Cooperation Organization, taking place later this month in the Chinese city of Tianjin. Indian Prime Minister Narendra Modi is expected to meet with Chinese President Xi Jinping then, marking his first trip to the country in seven years.\nXu criticized Washington for using tariffs as “a bargaining chip to demand exorbitant prices from various countries” despite benefiting from free trade.\n“In the face of such acts, silence or compromise only emboldens the bully,” he said in his address to the event.\nHe added that countries of the Global South were “highly concerned” about how the two Asian nations could work together and “take the lead to help developing countries overcome difficulties.”\nXu reiterated his remarks in a post on X, where he expressed his appreciation to people “who have long cared for and supported China-India relations.”\n--With assistance from Jon Herskovitz.\nMost Read from Bloomberg Businessweek\n-\nForeigners Are Buying US Homes Again While Americans Get Sidelined\n-\nVolkswagen EVs Outsell Tesla in Europe a Decade After Dieselgate\n-\nWhat Declining Cardboard Box Sales Tell Us About the US Economy\n-\nStaff Cuts and Turmoil Hit the CFTC While the Crypto It Oversees Booms\n©2025 Bloomberg L.P."
    },
    {
      "url": "https://policy.trade.ec.europa.eu/news/joint-statement-united-states-european-union-framework-agreement-reciprocal-fair-and-balanced-trade-2025-08-21_en",
      "text": "This Framework Agreement represents a concrete demonstration of our commitment to fair, balanced, and mutually beneficial trade and investment. This Framework Agreement will put our trade and investment relationship – one of the largest in the world – on a solid footing and will reinvigorate our economies’ reindustrialisation. It reflects acknowledgement by the European Union of the concerns of the United States and our joint determination to resolve our trade imbalances and unleash the full potential of our combined economic power. The United States and the European Union intend this Framework Agreement to be a first step in a process that can be further expanded over time to cover additional areas and continue to improve market access and increase their trade and investment relationship.\nThe key terms include:\n- The European Union intends to eliminate tariffs on all US industrial goods and to provide preferential market access for a wide range of US seafood and agricultural goods, including tree nuts, dairy products, fresh and processed fruits and vegetables, processed foods, planting seeds, soybean oil, and pork and bison meat. The European Union will immediately take the necessary steps to extend the Joint Statement of the United States and the European Union on a Tariff Agreement announced on 21 August 2020, with respect to lobster (that expired 31 July 2025), coupled with an expanded product scope to include processed lobster.\n- The United States commits to apply the higher of either the US Most Favored Nation (MFN) tariff rate or a tariff rate of 15%, comprised of the MFN tariff and a reciprocal tariff, on originating goods of the European Union. Additionally, effective as of 1 September 2025, the United States commits to apply only the MFN tariff to the following products of the European Union: unavailable natural resources (including cork), all aircraft and aircraft parts, generic pharmaceuticals and their ingredients and chemical precursors. The United States and the European Union agree to consider other sectors and products that are important for their economies and value chains for inclusion in the list of products for which only the MFN tariffs would apply.\n- The United States intends to promptly ensure that the tariff rate, comprised of the MFN tariff and the tariff imposed pursuant to Section 232 of the Trade Expansion Act of 1962, applied to originating goods of the European Union subject to Section 232 actions on pharmaceuticals, semiconductors, and lumber does not exceed 15%. When the European Union formally introduces the necessary legislative proposal to enact the tariff reductions set forth in Section 1 of this Framework Agreement, the United States will reduce tariffs on automobiles and automobile parts originating from the European Union subject to Section 232 tariffs as follows: No Section 232 automobile or automobile parts tariffs will apply to covered European Union goods with an MFN tariff of 15% or higher; and for covered goods with an MFN rate lower than 15%, a combined rate of 15%, comprised of the MFN tariff and Section 232 automobile tariffs, will be applied. These tariff reductions are expected to be effective from the first day of the same month in which the European Union’s legislative proposal is introduced. The United States expects the European Union’s legislative proposals will be consistent with this Framework Agreement and enacted by the necessary legislatures. All modifications to US Section 232 tariffs will be executed in a manner that reinforces and is consistent with US national security interests. With respect to steel, aluminium, and their derivative products, the European Union and the United States intend to consider the possibility to cooperate on ring-fencing their respective domestic markets from overcapacity, while ensuring secure supply chains between each other, including through tariff-rate quota solutions.\n- The United States and the European Union will negotiate rules of origin that ensure that the benefits of the Agreement on Reciprocal Trade accrue predominately to the United States and the European Union.\n- The United States and the European Union commit to cooperate on ensuring secure, reliable, and diversified energy supplies, including by addressing non-tariff barriers that might restrict bilateral energy trade. As part of this effort, the European Union intends to procure US liquified natural gas, oil, and nuclear energy products with an expected offtake valued at $750 billion through 2028. In addition, the European Union intends to purchase at least $40 billion worth of US AI chips for its computing centres. The European Union further plans to work with the United States to adopt and maintain technology security requirements in line with those of the United States. in a concerted effort to avoid technology leakage to destinations of concern. The United States will endeavour to facilitate such exports once such requirements are in place.\n- The United States and the European Union share one of the world’s largest economic relationships, supported by mutual investment stocks exceeding $5 trillion, and intend to promote and facilitate mutual investments on both sides of the Atlantic. In this context, European companies are expected to invest an additional $600 billion across strategic sectors in the United States through 2028. This investment reflects the European Union’s strong commitment to the transatlantic partnership and its recognition of the United States as the most secure and innovative destination for foreign investment.\n- The European Union plans to substantially increase procurement of military and defence equipment from the United States, with the support and facilitation of the US government. This commitment reflects a shared strategic priority to deepen transatlantic defence industrial cooperation, strengthen NATO interoperability, and ensure that European allies are equipped with the most advanced and reliable defence technologies available.\n- The United States and the European Union commit to work together to reduce or eliminate non-tariff barriers. With respect to automobiles, the United States and the European Union intend to accept and provide mutual recognition to each other’s standards. Cooperation on standards plays a crucial role in enhancing the transatlantic marketplace. The European Union and United States commit to enhance opportunities for technical cooperation between EU- and US-domiciled standards development organisations with the objective of identifying and developing standards for the transatlantic marketplace in key sectors of mutual interest. The United States and the European Union commit to facilitate conformity assessments to cover additional industrial sectors.\n- Recognising the importance of continued engagement to resolve longstanding concerns, the European Union and the United States commit to work together to address non-tariff barriers affecting trade in food and agricultural products, including streamlining requirements for sanitary certificates for pork and dairy products.\n- Recognising that production of the relevant commodities within the territory of the United States poses negligible risk to global deforestation, the European Union commits to work to address the concerns of US producers and exporters regarding the EU Deforestation Regulation, with a view to avoiding undue impact on US-EU trade.\n- Taking note of the US concerns related to treatment of US small and medium-sized businesses under the Carbon Border Adjustment Mechanism (CBAM), the European Commission, in addition to the recently agreed increase of the de minimis exception, commits to work to provide additional flexibilities in the CBAM implementation.\n- The European Union commits to undertake efforts to ensure that the Corporate Sustainability Due Diligence Directive (CSDDD) and the Corporate Sustainability Reporting Directive (CSRD) do not pose undue restrictions on transatlantic trade. In the context of CSDDD, this includes undertaking efforts to reduce administrative burden on businesses, including small- and medium-sized enterprises, and to propose changes to the requirement for a harmonised civil liability regime for due diligence failures and to climate-transition-related obligations. The European Union commits to work to address US concerns regarding the imposition of CSDDD requirements on companies of non-EU countries with relevant high-quality regulations.\n- The European Union reaffirms that US conformity assessment bodies can be designated as Notified Bodies in accordance with the Sectoral Annex for Telecommunications Equipment to the Agreement on Mutual Recognition Between the European Community and the United States (1998) to carry out the tasks in relation to all essential requirements, including cybersecurity, in the Radio Equipment Directive 2014/53/EU. In addition, the United States and the European Union will commit to negotiate a mutual recognition agreement on cybersecurity.\n- The European Union and the United States commit to strengthen cooperation and action related to the imposition of export restrictions on critical mineral and other similar resources by third countries.\n- The United States and the European Union commit to discuss high-standard commitments related to intellectual property rights protection and enforcement.\n- The European Union and the United States commit to work together to ensure strong protection of internationally recognised labour rights, including with regard to the elimination of forced labour in supply chains.\n- The United States and the European Union commit to address unjustified digital trade barriers. In that respect, the European Union confirms that it will not adopt or maintain network usage fees. The United States and the European Union will not impose customs duties on electronic transmissions. The United States and the European Union intend to continue to support the multilateral moratorium on customs duties on electronic transmissions at the World Trade Organization and seek the adoption of a permanent multilateral commitment.\n- The European Union intends to consult with the United States and US traders on digitalisation of trade procedures and implementation of the legislation currently proposed on EU Customs Reform.\n- The United States and the European Union agree to strengthen economic security alignment to enhance supply chain resilience and innovation by taking complementary actions to address non-market policies of third parties as well as cooperating on inbound and outbound investment reviews and export controls, as well as duty evasion. This includes addressing non-market practices, unfair competition, and lack of reciprocity in public procurement with respect to third countries. The United States and the European Union will cooperate on further implementation measures.\nThe United States and the European Union, in line with their relevant internal procedures, will promptly document the Agreement on Reciprocal, Fair, and Balanced Trade to implement this Framework Agreement.\nDetails\n- Publication date\n- 21 August 2025\n- Author\n- Directorate-General for Trade and Economic Security\n- Location\n- Brussels\n- Country or region\n- United States\n- Trade topics\n- Negotiations and agreements"
    },
    {
      "url": "https://finance.yahoo.com/news/us-eu-lock-trade-deal-110344336.html",
      "text": "WASHINGTON/BRUSSELS (Reuters) -The European Union will work to ensure lower U.S. tariffs on its car exports are applied retroactively to August 1, the bloc's trade chief said on Thursday, as the transatlantic partners set out details of a framework trade deal struck in July.\nIn a 3-1/2-page joint statement, the two sides spelled out that 15% U.S. tariffs would apply to most EU imports and listed the commitments made, including the EU's pledge to eliminate tariffs on U.S. industrial goods and to give preferential market access for a wide range of U.S. seafood and agricultural goods.\nWashington will take steps to reduce the current 27.5% U.S. tariffs on cars and car parts, a huge burden for European carmakers, once Brussels introduces the legislation needed to enact promised tariff cuts on U.S. goods, it said.\nThe statement said U.S. tariff relief on autos and auto parts would kick in on the first day of the month in which the EU introduced the legislation.\nEU trade commissioner Maros Sefcovic said it was the European Commission's \"firm intention\" to make proposals by the end of this month, meaning the U.S. car tariff reduction would apply from August 1.\nA senior Trump administration official, speaking on condition of anonymity, said European carmakers could see relief from the current U.S. tariffs within \"hopefully weeks.\"\n\"As soon as they're able to introduce that legislation - and I don't mean pass it and fully implement it, but really introduce it - then we will be in a position to provide that relief. And I will say that both sides are very interested in moving quickly,\" they said.\nU.S. President Donald Trump and European Commission President Ursula von der Leyen announced the deal on July 27 at Trump's luxury golf course in Turnberry, Scotland after months of negotiations.\nThe two leaders met again this week as part of negotiations aimed at ending Russia's war in Ukraine, with both lauding their trade framework deal as an historic accomplishment.\nThe joint statement said the deal could be expanded over time to cover additional areas and further improve market access.\nPOSSIBLE TEMPLATE\nThe joint statement was \"a play to hold each other accountable\" and ensure that both sides carried out the pledges announced last month, the U.S. official said.\nRyan Majerus, a former U.S. Commerce Department official now with the King and Spalding law firm, said the statement \"could serve as a conceptual model for what we will eventually see with Japan and South Korea.\"\nThe two major U.S. trading partners negotiated similar reductions in Trump's automotive tariffs but are also waiting for them to be implemented.\nThe EU and U.S. said they intended to accept and provide mutual recognition to each others' automotive safety and other standards, but industry officials said this language was more vague than initially announced.\nLIMITED EXEMPTIONS\nThe joint statement noted that the U.S. agreed to apply only pre-existing Most Favored Nation tariffs of below 15% from September 1 on EU aircraft and parts, generic pharmaceuticals and ingredients, chemical precursors and unavailable natural resources, including cork.\nThis exemption did not apply to wine or spirits, a key EU demand, but the two sides agreed to consider other sectors and products for inclusions.\n\"So these doors are not closed forever,\" Sefcovic said, while acknowledging that securing an exemption for alcoholic drinks would not be easy.\nSpiritsEUROPE trade group Director General Herve Dumesny urged \"both sides to remain at the negotiating table and deliver a swift, full return to zero-for-zero\" tariffs on spirits.\nPURCHASE, INVESTMENT PLANS\nThe U.S.-EU statement reiterated the EU's intention to procure $750 billion in American liquefied natural gas, oil and nuclear energy products, plus an additional $40 billion worth of U.S.-made artificial intelligence chips.\nIt also repeated the intention for EU companies to invest an additional $600 billion across U.S. strategic sectors through 2028.\nBoth sides committed to address \"unjustified digital trade barriers,\" the statement said, and the EU agreed not to adopt network usage fees.\nThey also agreed to negotiate rules of origin to ensure that the agreement's benefits accrued to both trading partners.\nThe statement also left unchanged the 50% U.S. national security tariff on EU-produced steel, aluminum and goods made with the metals, which were expanded this week to hundreds of additional products.\n\"There will be no exemptions, no exclusions for steel and aluminum tariffs,\" Trump trade adviser Peter Navarro told reporters at the White House, due to what he said were past exclusion abuses.\nBut the joint statement left the door open to a future tariff rate quota for the EU as the two sides discuss \"ring-fencing\" their domestic markets from overcapacity, a reference to Chinese production.\nNavarro called the Trump administration's agreement with the EU a \"magnificent achievement\" for both sides of the Atlantic that U.S. courts should not criticize.\nA federal appeals court is expected to rule any day on a legal challenge that could strike down a significant portion of Trump's tariffs, those invoked under the International Emergency Economic Powers Act.\n(Reporting by Andrea Shalal, David Lawder and Philip Blenkinsop; Additional reporting by Ryan Patrick Jones; Editing by Kate Mayberry and Joe Bavier)"
    },
    {
      "url": "https://finance.yahoo.com/news/tariffs-giving-parents-back-school-090042190.html",
      "text": "Lisa Ward was startled at the prices on sneakers when she recently went back-to-school shopping for her twin boys.\n“All of them were at least $10 or $20 more than last year. That pissed me off, but I didn’t have a choice,” said Ward, a finance professional who lives outside of Atlanta.\nAfter buying two pairs of sneakers for each of her growing 15-year-old boys, Ward was suddenly out $300.\n“People are starting to realize how expensive stuff is. Before, the school would say, ‘You have the wrong calculator.’ Now, they’re saying, ‘Bring whatever you’ve got,’” Ward said, referring to math class.\nOnline prices on apparel and accessories like shoes, bags and belts surged 9% year-over-year in July, according to data from marketing platform Klaviyo shared first with CNN.\nKlaviyo, a publicly traded customer relationship management firm that examines billions of dollars of transactions each year, found that average order values have increased on nearly two out of three apparel sites (or 64%) this back-to-school season.\nNot only are prices higher this time, but there are fewer deals. Discounts are four percentage points lower than last year, according to Klaviyo, which lists more than 170,000 brands as clients.\n‘Lagging impacts of tariffs’\nJake Cohen, head of industry and insights at Klaviyo, told CNN the higher prices are an obvious consequence of the trade war.\n“Tariffs have driven prices up. Brands are trying to create margin. The simplest way to do that is to raise prices,” Cohen said.\nThe Klaviyo executive noted that many articles of clothing and accessories are made outside the United States, leaving them exposed to the Trump administration’s tariff strategy. President Donald Trump has increased tariff rates on imported goods to levels unseen in nearly a century.\n“The lagging impacts of tariffs are coming in,” Cohen said. “Raising prices is not a strategy brands implement often – unless they need to.”\nThe Klaviyo findings – a 9% increase in year-over-year prices on apparel and accessories – are far higher than the official statistics from the Bureau of Labor Statistics.\nOverall, prices increased by a more modest 2.7% year-over-year in July, according to the Consumer Price Index compiled by the BLS. Apparel prices were little changed overall (-0.2% in July), though some items including boys’ apparel (1.9%) and footwear (0.9%) did go up.\nKlaviyo said that discrepancy could relate to the fact that its data is more heavily weighted towards e-commerce than the BLS, which is more focused on store prices.\nHowever, monthly producer prices surged in July by the most in three years. Prices on apparel wholesaling climbed 5%, while the apparel, jewelry, footwear and accessories retailing category spiked 8%.\nAlberto Cavallo, a professor at Harvard Business School, told CNN that 9% “doesn’t sound outrageous” based on his research into how tariffs are impacting prices.\nCavallo’s research has found that as of August 8, imported goods cost 5% more and domestic goods cost 3% more than pre-tariff trends predicted.\nPrice hikes for furniture, clothes and appliances\nSome back-to-school items for college students moving into dorms and off-campus apartments are also getting more expensive.\nFurniture is 5% above the pre-tariff trend. And the Harvard researchers found that prices for “other articles of clothing and clothing accessories” have jumped by 10% overall, including 12% for imports.\n“Although tariffs are often expected to produce a one-time jump in price levels,” Cavallo said, “our research shows that firms rarely pass through the full cost immediately. Instead, they raise prices gradually, especially when there is uncertainty around how long the tariffs will last or how broad they will be.”\nThose higher prices are forcing some Americans to alter their buying habits.\nAlmost one in three (30%) back-to-school shoppers say they’re changing the way they shop due to inflation, according to a Bankrate survey conducted in June of US adults who had already or who planned to back-to-school shop.\nThat’s down from 41% in 2022 but in line with 32% last year prior to the presidential election.\nWard, the Georgia mother of twin boys, said she has tried to save by opting for used clothes and getting a better sense of what school supplies they already have on hand.\n“I think the higher prices are due to tariffs and just greed, to be honest. This is an opportunity for everyone to jack up their prices,” Ward said. “I just wish the prices would come down and make it easier for parents. You want to do right by the kids, but there’s only so much you can do.”\nIn a statement, White House spokesman Kush Desai said real wages have increased, inflation has cooled and prices for everyday essentials like gasoline and eggs have declined since Trump took office.\n“As the Administration’s pro-growth policies of tariffs, deregulation, and The One Big Beautiful Bill’s tax cuts take effect and trillions in investments continue pouring into our economy, Americans can rest assured that the best is yet to come as we transition to a new golden age of American Greatness,” Desai said.\n61% disapprove of tariff hikes\nTrump’s aggressive trade agenda is unpopular, according to polls.\nA 61% majority of Americans disapprove of the tariff hikes on imports, while 38% approve, according to a Pew Research poll released last week and conducted prior to tariff hikes that kicked in on August 7.\nThat same Pew poll found that more than twice as many Americans say tariffs will have mostly negative effects on the United States in the coming years (55%) than those who see mostly positive effects (26%).\nSam, a Georgia father who didn’t wish to share his last name, said he noticed higher prices “across the board” when shopping for appliances and other items his kids need to go back to college.\n“Prices have definitely increased. Most people are not prepared because wages aren’t moving up fast enough,” he said. “The consequences of the election, for many people, are becoming clearer and clearer.”\nFor more CNN news and newsletters create an account at CNN.com"
    },
    {
      "url": "https://finance.yahoo.com/news/china-snaps-russian-oil-indian-073304518.html",
      "text": "Chinese refineries have placed new orders for Russian crude that will be shipped from ports that typically supply India, as demand from the South Asian country for Moscow’s crude slips following US President Trump’s tariffs.\nAt least 15 cargoes of Russian oil have been secured by Chinese refineries for October and November delivery, analysts said.\nChina and India emerged as the top buyers of Russian oil following Moscow’s 2022 invasion of Ukraine, which prompted Western countries to shun its exports.\nTrump in July threatened to impose secondary tariffs on goods from countries importing Russian oil to pressure Moscow to end the war in Ukraine.\nEarlier this month, he announced an additional 25% tariff on Indian exports to the US, on top of another 25% levy, for its Russian oil and gas imports. That led to the country sharply cutting down on its purchases.\nAs of last week, China’s state-owned and large private refiners had purchased around 13 cargoes of western Russian crude for October delivery and at least two cargoes for November, said Muyu Xu, senior crude oil analyst at Kpler, which tracks commodities and shipping data.\nThe 15 cargoes of oil, each typically ranging from 700,000 to 1 million barrels, will be loaded from Russia’s Arctic and Black Sea ports – supplies that usually go to India instead of China, given its distance, Xu said.\nReuters reported earlier this week that China had secured 15 Russian cargoes for the same period, citing analysts.\nXu said the buying reflected an “opportunistic” move, with the price of Russian oil remaining at least $3 per barrel cheaper than Middle Eastern alternatives.\n“As for whether China will continue buying, I personally believe that right now is still a very good opportunity, because over in India, Trump is still pressing hard on them,” she said.\nOn Friday, following his landmark meeting with Russian President Vladimir Putin, Trump told Fox News that he was not immediately considering retaliatory tariffs on China over its purchase of Russian oil, but suggested he may do so “in two weeks or three weeks.”\n“Taking advantage of this opportunity while prices are low, I think more refineries will probably consider buying more, within a week or two,” Xu said, referring to Chinese refiners.\nLast year, India imported $53 billion worth of petroleum and crude oils from Russia, according to data aggregated by the United Nations. Before the recent cuts, Russian supplies accounted for 36% of Indian market, making the country its largest source of crude, according to Vortexa, an energy data firm."
    },
    {
      "url": "https://finance.yahoo.com/quote/NVDA",
      "text": "NVIDIA Corporation (NVDA)\n- Previous Close\n175.40 - Open\n174.83 - Bid 174.80 x 500\n- Ask 175.06 x 500\n- Day's Range\n173.81 - 176.90 - 52 Week Range\n86.62 - 184.48 - Volume\n135,452,544 - Avg. Volume\n179,996,637 - Market Cap (intraday)\n4.267T - Beta (5Y Monthly) 2.14\n- PE Ratio (TTM)\n56.45 - EPS (TTM)\n3.10 - Earnings Date Aug 27, 2025\n- Forward Dividend & Yield 0.04 (0.02%)\n- Ex-Dividend Date Jun 11, 2025\n- 1y Target Est\n191.88\nNVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment includes its Data Centre accelerated computing platforms and artificial intelligence solutions and software; networking; automotive platforms and autonomous and electric vehicle solutions; Jetson for robotics and other embedded platforms; and DGX Cloud computing services. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating industrial AI and digital twin applications. It also customized agentic solutions designed in collaboration with NVIDIA to accelerate enterprise AI adoption. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.\nwww.nvidia.comRecent News: NVDA\nView MoreRelated Videos: NVDA\nPerformance Overview: NVDA\nTrailing total returns as of 8/21/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: NVDA\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: NVDA\nView MoreValuation Measures\nMarket Cap\n4.27T\nEnterprise Value\n4.22T\nTrailing P/E\n56.45\nForward P/E\n39.06\nPEG Ratio (5yr expected)\n1.69\nPrice/Sales (ttm)\n29.14\nPrice/Book (mrq)\n50.90\nEnterprise Value/Revenue\n28.45\nEnterprise Value/EBITDA\n46.44\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n51.69%\nReturn on Assets (ttm)\n53.24%\nReturn on Equity (ttm)\n115.46%\nRevenue (ttm)\n148.51B\nNet Income Avi to Common (ttm)\n76.77B\nDiluted EPS (ttm)\n3.10\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n53.69B\nTotal Debt/Equity (mrq)\n12.27%\nLevered Free Cash Flow (ttm)\n55.44B\nResearch Analysis: NVDA\nView MoreResearch Reports: NVDA\nView MoreArgus Quick Note: Weekly Stock List for 08/18/2025: 13Fs Show Big Guns Buying Big Tech\nLarge institutional investors are buying tech companies. The stock market volatility during 2Q gave institutional investors a chance to buy dips and pick up some tech names at better prices. Taking a look at 13F filings of well-known institutional portfolios, we see that the big guns were busy picking up some new companies and/or adding to existing positions. Buying was across a variety of sectors, but tech names stand out. Vickers Stock Research, a subsidiary of Argus Research Group, analyzes insider trading and institutional stock ownership. Form 13-Fs, which institutions must file to report their holdings, are due 45 days after the end of calendar quarters and have come in for 2Q25. We review 13Fs of major institutional investors, including activists, to see what they are buying and to look for trends. Based on data from Vickers, here are select purchases made in 2Q by some high-profile money managers. The ratings listed are from Argus Research.\nNvidia: Maintaining Fair Value as US Will Get a Piece of the Action in AI Chips Sold Into China\nNvidia is a leading developer of graphics processing units. Traditionally, GPUs were used to enhance the experience on computing platforms, most notably in gaming applications on PCs. GPU use cases have since emerged as important semiconductors used in artificial intelligence. Nvidia not only offers AI GPUs, but also a software platform, Cuda, used for AI model development and training. Nvidia is also expanding its data center networking solutions, helping to tie GPUs together to handle complex workloads.\nRatingPrice TargetMorningstar | A Weekly Summary of Stock Ideas and Developments in the Companies We Cover\nIn this edition, who does 'anti-involution' benefit in greater China markets?; powering tomorrow's data centers critical; and innovations benefit 'forgotten' tricuspid valve; and BASF, Publicis, and Charles Schwab.\nMorningstar | A Weekly Summary of Stock Ideas and Developments in the Companies We Cover\nIn this edition, who does 'anti-involution' benefit in greater China markets?; powering tomorrow's data centers critical; and innovations benefit 'forgotten' tricuspid valve; and BASF, Publicis, and Charles Schwab.\nTop Analysts: NVDA\nView MoreOverall Score\nDiscover which analysts rank highest for NVDA overall weighted by direction, price target, and price movement.\nLearn MoreDirection Score\nDiscover which analysts rank highest on predicting the directional movement of NVDA.\nLearn MorePrice Score\nDiscover which analysts rank highest on predicting the price target of NVDA.\nLearn More"
    },
    {
      "url": "https://finance.yahoo.com/news/southwire-praises-copper-tariffs-says-213913976.html",
      "text": "(Bloomberg) -- One of the largest makers of copper wire and cable in the US is applauding the Trump administration for adding import tariffs on aluminum and copper derivative products, saying the move will help American manufacturers.\nWithout the duties, domestic manufacturers would be “significantly disadvantaged” to foreign suppliers, Southwire Co. Chief Executive Officer Rich Stinson said on the company’s website.\nMost Read from Bloomberg\n-\nWhy New York City Has a Fleet of New EVs From a Dead Carmaker\n-\nTrump Takes Second Swing at Cutting Housing Assistance for Immigrants\n-\nChicago Schools Seeks $1 Billion of Short-Term Debt as Cash Gone\n-\nNeom’s Desert Ski Resort Strains Saudi Prince’s $1.5 Trillion Plan\n“It is important to us that any tariffs provide a level playing field in the marketplace and minimize any possible negative impact to our business,” Stinson said.\nThe rare public comment from the closely held company, based in Georgia, comes after US President Donald Trump last month imposed a 50% duty on semi-finished copper imports valued at more than $15 billion. Trump also ordered officials to come up with a plan to impose tariffs on an array of other copper-intensive goods.\nMost Read from Bloomberg Businessweek\n-\nForeigners Are Buying US Homes Again While Americans Get Sidelined\n-\nWhat Declining Cardboard Box Sales Tell Us About the US Economy\n-\nWomen’s Earnings Never Really Recover After They Have Children\n-\nAmericans Are Getting Priced Out of Homeownership at Record Rates\n©2025 Bloomberg L.P."
    },
    {
      "url": "https://finance.yahoo.com/personal-finance/taxes/article/what-is-a-tariff-194059448.html",
      "text": "Some advertisements and offers on this page are from advertisers who pay us. That may influence which products we write about, but it does not affect what we write about them. Here's an explanation of how we make money and our Advertiser Disclosure.\nTariffs may seem like a topic that only matters to economic policy wonks. But these import taxes affect you more than you think, even if you’re not directly cutting the check.\nSince taking office in his second term, President Trump has imposed steep new tariffs on nearly all products imported into the U.S., ending decades of free trade policy and setting markets on a rocky course throughout 2025. Trump has made exceptions for certain products and set and extended dealmaking deadlines as his administration negotiates trade agreements with other countries.\nThis embedded content is not available in your region.\nTrump says his tariffs will rebalance international trade in favor of U.S. producers and manufacturers.\nWe’ll walk you through how tariffs work and what they mean for you and your wallet.\nWho really pays for tariffs?\nTrump has said that tariffs “are paid mostly by China,” rather than by Americans. But that’s not how tariffs work.\nThe company importing the goods — not the exporting company or country — directly pays the tariff. The duty is collected when the goods clear customs at the importing country’s port of entry.\n“When you’re a [company] importing a good from another country, you’re effectively buying that good in that country,” said Michael Coon, an associate professor at the University of Tampa who studies international economics. “So you’re paying whatever price they’re charging in that country. Then it’s your responsibility to get the goods into your country. If you want to get the goods into your country, then you have to pay the import tariffs.”\nRead more: 5 ways to tariff-proof your finances\nSo let’s say the U.S. levied a new tariff on laptops from China, and Amazon imports Chinese laptops. A broker representing Amazon would most likely pay the tax to the U.S. Customs and Border Protection Service when the goods enter the country.\nBut businesses almost always pass additional costs on to consumers. That means you, the customer buying the laptop, would typically end up paying the tariff, even if you don't know it. The cost would get passed down to you in the form of a higher price.\nSoon after Trump enacted tariffs on Canadian goods, Canadian energy company Irving Oil sent a letter to its customers in New England that their heating bills would reflect the increased cost.\nMany retailers and trade groups opposed Trump's original tariffs on Chinese goods, saying they’d need to raise prices due to the extra cost. The Footwear Distributors & Retailers of America, a trade group that represents the U.S. footwear industry, estimated that an additional 15% tariff on imported shoes from China would increase the price of a $49.99 canvas sneaker to $60.98, while the price of a typical hunting boot would jump from $190 to $231.03.\nTariffs are often levied in hopes that consumers will substitute domestic products for foreign-made goods. However, a country imposing the tariffs may lack the infrastructure, natural resources, or cheap labor to produce comparable goods at the same cost, so buying local is often more expensive.\n“Either we pay the higher price on the Chinese goods with the tariffs, or we pay the higher price to U.S. companies,” Coon said.\nDo tariffs protect jobs?\nThe effect of tariffs on jobs is also hotly debated. Tariffs Trump introduced during his first term on steel and aluminum were politically popular. They prompted a few shuttered steel plants to reopen and were credited with creating several thousand jobs in the metals industry.\nBut the negative effects of tariffs can also spill over to employment. Sectors like agriculture, for example, were hard-hit by tariffs China imposed in response to U.S. tariffs during Trump's first term. For example, soybean exports dropped 63% in the first 10 months of 2018, while exports fell by 20%, according to the Congressional Research Service. The agricultural sector likely experienced some job losses as a result, some economists say. When tariffs are imposed on materials like steel and aluminum, industries that use those materials — like the manufacturing sector — face higher costs, which can negatively impact employment.\nThe jobs that are saved from tariffs often come at a high cost. The Peterson Institute for International Economics found that every job in the steel industry saved by the 2018-19 tariffs cost American consumers and businesses $900,000.\nDo tariffs affect inflation?\nTariffs can lead to higher prices, but the effect on inflation tends to be relatively minor.\n“Tariffs affect very specific sectors of the economy, and inflation is looking at the economy as a whole,” Coon said. “The price of a few goods going up is not inflation.”\nTrump’s original tariffs were in effect well before shock waves from the COVID-19 pandemic caused inflation to soar. The Economic Policy Institute estimated in January 2022 — a time when inflation was still skyrocketing — that removing the tariffs would have offset no more than 7.2% of the run-up in consumer prices.\nRead more: What is inflation, and how does it affect you?\nWhat Trump is doing and promising in his second term\nDuring the presidential campaign, Trump’s platform included a call to “stop outsourcing and turn the United States into a manufacturing superpower,” and provide large tax cuts for American workers. Trump suggested that tax cuts could be funded by a 60% increase in tariffs on Chinese goods and a 10% hike on other trade partners. In a meeting with congressional Republicans, he even reportedly suggested eliminating the income tax and replacing it with higher tariffs.\nOnce in office, Trump moved quickly on tariffs but at more tempered levels. Weeks into his new term, he announced tariffs to take effect beginning Feb. 4 — 25% on imports from Canada and Mexico and 10% on imports from China. Duties on oil imports from Canada would be lower at 10%.\nBut hours before the Canada and Mexico tariffs were set to take effect, Trump spoke to leaders of both countries and agreed to a one-month pause in exchange for pledges to enhance security at the southern and northern borders. Trump has cited the inflow of illegal drugs as part of his justification for imposing steep tariffs on longtime allies and trading partners.\nAs the March 4 deadline approached, Trump declared there was \"no room left\" to negotiate. At 12:01 a.m., the additional 10% levy on Chinese goods, as well as the tariffs on Canada and Mexico, went into effect. All three countries quickly responded with retaliatory tariffs of their own.\nBut the biggest bombshell was Trump's April 2 announcement of reciprocal tariffs, which are meant to make up for the tariffs and other barriers that countries impose on U.S. goods.\n“Reciprocal, that means they do it to us, we do it to them,” Trump said in his announcement.\nTrump called for a universal 10% tariff on countries around the world, plus reciprocal tariffs of up to nearly 50% on dozens of trading partners. Canada and Mexico, two of the U.S.'s biggest trading partners, were not affected by the new measures. But they remain subject to tariffs of up to 25% with some products exempted. Chinese goods face a 30% levy.\nWhile exempting some products from tariffs, Trump has also singled out others for high duties including copper and pharmaceuticals.\nTrump ultimately imposed a 90-day pause on the sweeping duties to hammer out further deals and calm markets. As that July deadline approached, he pushed it out another month. Only July 8 and 9, he released nearly two dozen letters to trade partners, including a threat of a 50% tariff on Brazil.\nTariff FAQs\nWhat is a simple definition of a tariff?\nA tariff is a tax levied on goods imported from a foreign country that’s often used to protect domestic industries and jobs.\nWhat are the different types of tariffs?\nThere are several different types of tariffs, but the most common are ad valorem and specific tariffs. An ad valorem tariff is a tax that’s levied as a percentage of the imported product’s value. The 25% tariff imposed on steel in 2018, along with many imported Chinese goods, is an example of an ad valorem tariff. A specific tariff is a flat tax charged on each imported good (e.g., $1,000 per vehicle or $50 per mobile device).\nWhy and how are tariffs used?\nHere are a few key reasons countries impose tariffs:\nProtecting local jobs and industries: For developed nations, tariffs — also known as customs duties or import duties — tend to be protectionist. That is, they’re intended to give a price advantage to domestic goods, shielding a country’s businesses and workers from cheaper foreign competition. The idea is that if foreign materials and products are more expensive, you’ll buy more domestic goods. For example, Congress passed a sweeping range of tariff hikes, some as high as 60%, after the stock market crash of 1929 under the Smoot-Hawley Tariff Act to protect the farming industry.\nRevenue generation: Like any other taxes, tariffs also provide income for the government that levies them. In fact, tariffs were the primary source of revenue for the U.S. government during its early days until the federal income tax was established in the early 20th century. Today, tariffs are a minuscule source of income for many developed countries. Poorer countries often have far higher tariff rates than wealthier countries because their governments depend on them for revenue.\nNational security: A government may implement tariffs to avoid relying too heavily on different countries for goods deemed critical to security, like military supplies. Trump cited national security concerns when he hiked tariffs on steel and aluminum because both are used for weaponry and military equipment. Though Congress is typically tasked with levying tariffs and taxes, the president has the authority to enact them unilaterally in the name of defense.\nInfluence other countries’ practices: The World Trade Organization (WTO) largely supports free trade policies, but it allows countries to enact trade barriers like tariffs in response to human rights concerns.\nTariffs can also be used to discourage certain trade practices like “dumping,” which is when companies export products to another country and sell them at artificially low prices to gain a competitive advantage. Former President Joe Biden, who kept most of Trump's early tariffs in place, accused China of dumping practices when he introduced new tariffs on about $18 billion worth of Chinese goods — including a 100% increase on electric vehicles (EVs) and a 50% increase on semiconductors. Biden said in an interview with Yahoo Finance in 2024 that China was “not making any money off them. They’re doing it to put other people out of business.”\nRetaliation: Sometimes, when one country imposes a tariff on another country's goods, the exporting country responds with retaliatory tariffs of its own. The Smoot-Hawley Act sparked a trade war as European nations passed retaliatory tariffs, and historians often blame the Smoot-Hawley tariffs for prolonging the Great Depression.\nMore recently, the U.S. tariffs Trump levied on Chinese goods were met with retaliatory tariffs. In April 2018, the Chinese government introduced tariffs of 15% and 25% on 94 food and agricultural products from the U.S. Meanwhile, China dropped its average tariff rate on imported goods from other countries between early 2018 and 2022. In the current unfolding trade war, Mexico and Canada have both vowed retaliatory tariffs, while China has appealed to the WTO."
    },
    {
      "url": "https://finance.yahoo.com/news/estee-lauder-forecasts-annual-profit-100555312.html",
      "text": "By Anuja Bharat Mistry, Anshi Sancheti and Samantha Marshak\n(Reuters) -Estee Lauder said on Wednesday it would cut inventory and promotions to help mitigate rising costs, after the luxury cosmetic maker warned that a $100 million hit from tariffs would weigh on its annual profit forecast. The company's shares fell about 4% in afternoon trading after Estee Lauder also forecast annual profit below estimates.\nHigher costs related to the Trump administration's unpredictable trade policies have dampened consumer spending, hurting businesses, especially higher-end brands like Estee Lauder and Tapestry as the luxury sector struggles with sagging demand.\n\"This highlights broader pressures on the beauty industry since even those companies that don't rely on imports of finished goods still have to source the bulk of their ingredients, packaging, and other materials from overseas suppliers,\" said Sky Canaves, analyst with eMarketer.\nTo reduce the impact of US-China tit-for-tat tariffs on its margins, the company said in May it would sell fewer cosmetics in China that were sourced from its U.S. factories. For China sales, Estee would rely more on cosmetics made in its factories in Japan and Europe.\nThe company sources roughly 25% of its products sold in China and the EMEA regions from U.S. manufacturing plants.\nEstee Lauder's organic net sales for the fourth quarter fell 13%, after rising 8% a year ago, hurt by softness in the skincare and makeup segments. Estee is also grappling with weakness in the U.S. and China markets as well as in the large European markets of France and Germany.\nTravel retail sales continue to be muted, accounting for two-thirds of the 8% sales decline in the fourth quarter, though plans are in place to expand the company's duty-free presence in the Americas, according to chief financial officer Akhil Shrivastava.\nTo boost earnings, Estee Lauder has also accelerated new launches in categories including skincare, introduced new luxury price tiers, increased investment, and cut costs under new CEO Stephane de La Faverie, who took up the role earlier this year.\nThe company reported a wider quarterly loss of $546 million, up from $284 million a year ago, partly due to impairment charges tied to brand performance at Too Faced and skincare brand Dr.Jart+.\nOn an adjusted basis, it earned 9 cents per share, in line with estimates.\nIt sees full-year adjusted earnings per share to be in the range of $1.90 to $2.10, compared with analysts' estimates of $2.21, according to data compiled by LSEG."
    },
    {
      "url": "https://finance.yahoo.com/news/korea-early-export-lifted-chips-023337179.html",
      "text": "(Bloomberg) -- South Korea’s early exports data showed exports held up in August so far, powered by a surge in semiconductor shipments that helped offset pressure from sweeping US tariffs.\nThe value of shipments increased 7.6% from a year earlier in the first 20 days of August, according to data released Thursday by the customs office. That compared with a 5.8% increase in the full month of July. Imports edged up 0.4%, resulting in a trade surplus of $833 million. Working-day adjusted exports also climbed 7.6% for the first 20 days of the month.\nMost Read from Bloomberg\n-\nWhy New York City Has a Fleet of New EVs From a Dead Carmaker\n-\nTrump Takes Second Swing at Cutting Housing Assistance for Immigrants\n-\nChicago Schools Seeks $1 Billion of Short-Term Debt as Cash Gone\n-\nNeom’s Desert Ski Resort Strains Saudi Prince’s $1.5 Trillion Plan\n“Exports through the first 20 days of August came in stronger than expected, driven by a surge in semiconductor shipments,” said Bloomberg economist Hyosung Kwon. “Strong global demand for AI-related computer chips lifted overall exports, while car shipments also jumped — probably supported by an expected decrease in US tariffs on Korean cars to 15%.”\nThe latest data come after a last-minute trade deal that capped US tariffs on imports of Korean goods at 15% — a higher rate than the 10% implemented from April, but below the 25% level that President Donald Trump had threatened to impose.\nManufacturers, including Samsung Electronics Co., have benefited from Trump’s decision to put smartphones, laptops and other consumer technology products on an exclusion list. Supply-chain relationships with companies such as Apple Inc. have also helped.\nSouth Korea’s shipments of semiconductors increased almost 30% from a year earlier in the first 20 days of August, the customs office data showed, with such devices accounting for nearly 25% of total exports. Meanwhile, auto exports climbed 22% during the same period.\nStill, exports face risks ahead. The front-loading impact is expected to fade now that a trade deal has been reached, and Trump has threatened to impose new tariffs on semiconductors this month.\nAuto exports also face uncertainty, as the 25% US tariff on Korean cars remains in place until Trump signs an executive order to align it with the 15% universal rate. Written documentation on the trade deals agreed to with Japan and South Korea is “weeks away,” US Commerce Secretary Howard Lutnick said Tuesday in an interview with CNBC. Trump has also threatened to add chip tariffs by the end of August."
    },
    {
      "url": "https://finance.yahoo.com/news/navarro-slams-india-over-russian-073021815.html",
      "text": "(Bloomberg) -- White House trade adviser Peter Navarro blasted India for continuing to buy Russian oil and said he expects punitive tariffs of 50% on imports from the South Asian nation to kick in as planned next week.\n“I see that taking place,” Navarro told reporters in front of the White House when asked about the tariffs on India that are set to double on Aug. 27. “India doesn’t appear to want to recognize its role in the bloodshed. It simply doesn’t. It’s cozying up to Xi Jinping, is what it’s doing.”\nMost Read from Bloomberg\n-\nWhy New York City Has a Fleet of New EVs From a Dead Carmaker\n-\nNeom’s Desert Ski Resort Strains Saudi Prince’s $1.5 Trillion Plan\n-\nTrump Takes Second Swing at Cutting Housing Assistance for Immigrants\n-\nChicago Schools Seeks $1 Billion of Short-Term Debt as Cash Gone\nThe fresh salvo is the latest from the trade hawk and comes after India has signaled it’ll keep buying Russian oil, a step that would preserve a vital market for Moscow. Stung by the steep 50% levy, Prime Minister Narendra Modi’s government has reiterated its long-standing friendship with Russia and moved to ease tensions with regional rival China in recent days.\nIndia has ramped up oil imports from Russia since the full-scale invasion of Ukraine began in 2022, when Group of Seven nations imposed a $60-per-barrel price cap on Moscow’s crude that aimed to limit the Kremlin’s energy revenue. The Trump administration sees those purchases as helping fund Russia’s war, with 50% tariffs on Indian goods set to be among the highest on any country’s products.\n“They don’t need the oil. It’s a refining profit sharing scheme. It’s a laundromat for the Kremlin. That’s the reality of that,” Navarro said. “Look, Modi is a great leader. But please, please India, like, look at what is, what your role here is in the global economy and good here. It’s like, what you’re doing right now is not creating peace, it’s perpetuating the war.”\nOil advanced in a choppy session after the comments.\nIndia accounts for 37% of Russia’s oil exports, according to Moscow-based Kasatkin Consulting.\nIndia’s External Affairs Minister Subrahmanyam Jaishankar said in Moscow on Thursday that his government is “perplexed” by the US threats and criticism of the purchases of Russian crude. “We are a country where actually the Americans said for the last few years that we should do everything to stabilize the world energy markets, including buying oil from Russia.”\nTrump has already signed the executive order specifying that tariff increases on India would take effect at 50% at 12:01 a.m. Washington time on Aug. 27."
    },
    {
      "url": "https://finance.yahoo.com/news/live/earnings-live-gm-stock-sinks-on-tariff-hit-coca-cola-to-launch-cane-sugar-soda-143736342.html?guccounter=1",
      "text": "Second quarter earnings season is winding down, and with most of the reports in, the results have been mostly positive.\nOver 92% of S&P 500 index companies have reported results, and as of Aug. 18, analysts expected S&P 500 companies to report an 11% jump in earnings per share during the second quarter.\nCompanies had lower expectations to clear coming into the quarter — analysts expected S&P 500 earnings to rise 5% in Q2, the slowest pace of earnings growth since Q4 2023 — amid President Trump's tariffs, stocks' lofty valuations, and uncertainty about the health of the US economy.\nOther major companies reporting this week include BJ’s Wholesale (BJ), TJX Companies (TJX), Ross Stores (ROST), Estée Lauder (EL), Intuit (INTU), Zoom Communications (ZM), Workday (WDAY), Xpeng (XPEV), Medtronic (MDT), La-Z-Boy (LZB), Toll Brothers (TOL), Palo Alto Networks (PANW), and Blink Charging (BLNK).\nLast week, results came in for Applied Materials (AMAT), Circle (CRCL), Lenovo (0992.HK), AMC (AMC), Cava (CAVA), Cisco (CSCO), CoreWeave (CRWV), Deere (DE), On (ONON), and Oklo (OKLO).\nHere are the latest updates from corporate America.\nLIVE271 updates\nFeatured\nGrace O'Donnell\nZoom stock pops as CEO attributes earnings beat to AI\nZoom stock (ZM) popped 5% on Thursday afternoon after the company reported a huge earnings beat.\nZoom posted earnings per share of $1.16, compared to Wall Street analyst estimates for $0.72, per S&P Global Market Intelligence. That represents 66% annual earnings growth.\nThe company's founder and CEO, Eric Yuan, noted that the strong quarter comes as artificial intelligence reshapes the way people are working. The company highlighted its paid add-on for custom AI agents that help with meeting prep and call summaries as drivers.\nRevenue rose 5% to $1.2 billion, bolstered by 7% growth in Enterprise revenue. The company's monthly churn rate remained flat year over year at 2.9%.\nZoom also raised its full-year revenue outlook and free cash flow guidance, which is now expected to be in the range of $1.74 billion to $1.78 billion.\nFor the full 2026 fiscal year, total revenue is expected to be between $4.825 billion and $4.835 billion while diluted EPS is expected to be between $5.81 and $5.84.\nGrace O'Donnell\nRoss Stores tops quarterly profit estimates as shoppers seek discount apparel\nBJ's Wholesale Club stock falls as fuel prices weigh on sales\nFuel prices weighed on BJ's Wholesale Club (BJ) sales in the second quarter, the company reported Friday.\nOverall comparable club sales decreased by 0.3% year over year, while comparable sales excluding gasoline increased by 2.3% annually.\nThe company reported earnings per share of $1.14, topping Wall Street's estimates for earnings of $1.09 per share. Revenue of $5.38 billion in the quarter disappointed expectations for $5.48 billion, according to S&P Global Market Intelligence\nBJ's reiterated its full-year revenue guidance and narrowed the range for its earnings outlook. For fiscal 2025, BJ's sees comparable club sales minus gasoline increasing 2% to 3.5% year-over-year. Adjusted EPS is expected to range from $4.20 to $4.35 instead of $4.10 to $4.30 previously forecast.\nGrace O'Donnell\nWorkday to acquire AI company Paradox, stock falls\nWorkday (WDAY) stock slipped more than 3% in after-hours trading following the company's announcement that it would acquire Paradox for an undisclosed amount. Paradox is an AI company that uses AI chatbots to simplify the job application process.\nWorkday also reported second quarter results that beat expectations. Subscription revenue increased 14%, lifting overall revenue to $2.35 billion in the second quarter. Wall Street was looking for revenue of $2.34 billion.\nDiluted earnings per share of $2.21 beat estimates of $2.12 per share.\n\"Our second quarter results reflect the strength of our platform and our continued progress across several of our growth initiatives,\" CFO Zane Rowe said. \"Following our first half momentum — and also incorporating the acquisition of Paradox — we are increasing our fiscal 2026 subscription revenue guidance to $8.815 billion, representing growth of 14%, and increasing our fiscal 2026 non-GAAP operating margin guidance to approximately 29%.\"\nShares of Intuit (INTU), the company behind tax-preparation and finance software TurboTax, Credit Karma, and QuickBooks, fell 5% after hours after the company forecast fiscal first quarter revenue growth below analyst estimates.\nReuters reports:\nIntuit's board also approved a new $3.2 billion share buyback plan, raising its total repurchase authorization to $5.3 billion.\nWalmart (WMT) and Target (TGT) often get compared, especially when they report earnings back-to-back. But the most recent results from the big box stores highlight how the two couldn't be more different.\nYahoo Finance's Brian Sozzi dived into the two retailers' quarters:\nWalmart CEO: Tariff impact has been 'gradual,' but we expect costs to increase\nWalmart (WMT) reassured investors that it's continuing to gain market share and generate healthy sales growth.\nBut even though executives said the company didn't see any \"dramatic shifts\" with consumer behavior last quarter, they did communicate that keeping costs low could become a greater challenge in the second half of the year as tariff-related price increases work their way through inventory.\n\"With regards to our US pricing decisions, given tariff-related cost pressures, we're doing what we said we would do: We're keeping our prices as low as we can for as long as we can,\" Walmart CEO Doug McMillon said on Walmart's earnings call.\n\"The way things have played out so far, the impact of tariffs has been gradual enough that any behavioral adjustments by the customer have been somewhat muted,\" McMillon continued. \"But as we replenish inventory at post-tariff price levels, we've continued to see our costs increase each week, which we expect will continue into the third and fourth quarters.\"\nWalmart earnings expected to show US sales growth continued in Q2 as consumers seek value\nWalmart (WMT) will report quarterly results Thursday morning before the bell, following on the heels of Target (TGT) earnings Wednesday, which sent shares of the retailer 6% lower.\nBut Walmart is expected to highlight another robust quarter, Yahoo Finance's Brooke DiPalma writes, as consumers search for value amid tariff-related uncertainty.\nBrooke previews what to look for in Walmart's earnings:\nTJX Companies shares rise after earnings beat and raise\nTJ Maxx parent TJX Companies (TJX) beat sales and profit estimates for the second quarter and raised its annual profit forecast, boosting shares in premarket trading.\nLowe's stock rises after same-store sales return to growth\nLowe's (LOW) stock popped in premarket trading on Wednesday after the home improvement retailer reported a return to same-store sales growth, earnings beat, and raised its guidance.\nTarget beat low earnings expectations as sales continue to fall\nTarget (TGT) released its second quarter results on Wednesday. The results are not as bad as the first quarter but declining sales has the retail giant in a bit of a bind. Shares in target fell 8% before the bell\nYahoo Finance's executive editor Brian Sozzi looks at the latest from Target and whether it will ever find its place in this new economic environment.\nEstee Lauder forecasts annual profit below estimates as tariffs hit\nEstee Lauder (EL) stock fell 8% before the bell on Wednesday after the beauty group forecast annual profit below Wall Street estimates, as it grapples with persistent weakness in the US and China markets and tariff uncertainty.\nToll Brothers beats on earnings, but new orders decline 4%\nToll Brothers (TOL) reported another double beat in its fiscal third quarter, but a slowdown in new orders weighed on the stock, which drifted 1.6% lower after hours.\nThe homebuilder posted diluted earnings per share of $3.73 on home sale revenue of $2.88 billion. Wall Street analysts were expecting earnings per share of $3.64 on revenue of $2.85 billion.\nAfter a sluggish spring season in the housing market, there have been signs of a resurgence, with housing starts jumping in July. But mortgage rates that have barely budged, ongoing economic uncertainty, and affordability challenges for buyers continue to weigh on the sector.\nFor the quarter, Toll Brothers noted it had 2,388 units under signed contract, a 4% decline from a year ago. Analysts had expected orders growth.\n\"The average sales price of new contracts was $1.0 million, up 4.5% year-over-year,\" CEO Douglas Yearley said in the earnings release. \"Contract dollars were flat despite a 4% decline in units. While affordability pressures and uncertain economic conditions persist, we are pleased with the resilience of our luxury business and more affluent customer base.\"\nGrace O'Donnell\nLa-Z-Boy stock drops on soft earnings and guidance\nLa-Z-Boy stock (LZB) dropped 16% in after-hours trading after the company missed earnings estimates and navigated \"soft industry demand.\"\nOverall, comparable sales dropped 1% to $492 million from a year ago. Sales in the furniture retailer's wholesale segment increased 1%, and retail sales rose 5%, but they were offset by weakness in the Joybird brand, which saw sales decline 14%.\nLa-Z-Boy reported diluted earnings per share of $0.44, compared to $0.61 per share a year ago. The Street was looking for earnings of $0.52 per share.\nLa-Z-Boy's guidance also came in lighter than expected. It expects sales in the range of $510 million to $530 million in the fiscal second quarter. Wall Street was looking for $532 million, according to S&P Global Market Intelligence.\nMedtronic appoints 2 new board members, posts Q1 beat\nIrish medical device maker Medtronic (MDT) reported better-than-expected earnings for its fiscal first quarter on Monday.\nBut the bigger story was the company's announcement that it would add two new directors to its board after activist investor Elliott Investment Management became one of its largest shareholders. Veteran med-tech executives John Groetelaars and Bill Jellison were appointed, the company said.\nMedtronic stock dropped over 3% in premarket trading.\nFor the quarter, the company posted adjusted earnings of $1.26 per share, beating analysts’ estimates for $1.23, according to S&P Global Market Intelligence. Revenue came in at $8.6 billion, above Wall Street’s forecast of $8.4 billion.\nChina's Xpeng expects quarterly revenue to double on strong demand for its EVs\nChinese electric vehicle maker Xpeng (XPEV) on Tuesday forecast third-quarter revenue would double. The company is betting on surging deliveries of its cars despite challenging economic conditions.\nThe group's stock rose 0.6% in premarket trading on Tuesday."
    },
    {
      "url": "http://finance.yahoo.com/news/eu-us-trade-deal-does-123710228.html",
      "text": "BRUSSELS (Reuters) -The European Commission will keep pressing for a preferential tariff for wine and spirits exports to the U.S. that would spare the sector the 15% rate applied on most items under the EU-U.S. trade deal, the EU's trade commissioner said on Thursday.\n\"This one we didn't get in. But I can tell you that there is clear commitment from the European Commission to put it on the table,\" Maros Sefcovic said when asked if a preferential rate for the sector had been secured.\nSefcovic spoke after the European Union and the U.S. detailed commitments made in the deal reached last month, which includes a 15% U.S. tariff on most imports from the bloc, including autos, pharmaceuticals, semiconductors and lumber.\nThe same rate also applies to EU wine and spirits exports, despite industry efforts to get a lower, or even zero rate.\nThat means U.S. buyers of French Champagne, Irish whiskey and Italian Prosecco could face significant price rises, with the tariffs impacting some $10 billion worth of alcoholic beverage imports each year, analysts say.\nBrands affected include Diageo's Guinness beer and Pernod Ricard's Jameson Irish whiskey.\nThe Distilled Spirits Council of the United States, an industry group representing spirits producers and marketers, has called for permanent zero tariffs by both sides and expressed disappointment that no preferential rate had been agreed.\n\"Without a permanent return to zero-for-zero tariffs on spirits, American distillers do not have the certainty to plan for future export and job growth without the fear of retaliatory tariffs returning,\" it said.\nIt added that it was \"determined to continue engaging with the Trump administration to urge for additional negotiations\".\nThat message was echoed by Herve Dumesny, director general of European industry group spiritsEUROPE.\n\"We urge both sides to remain at the negotiating table and deliver a swift, full return to zero-for-zero,\" Dumesny said.\n\"This means reaffirming the support for our sector across the Atlantic by removing U.S. tariffs on EU spirits and lifting any suspended EU retaliatory measures on U.S. products.\"\nThe lack of a preferential deal for European alcoholic drinks in the trade agreement announced on Thursday is \"a huge disappointment,\" Gabriel Picard, president of France's federation of wines and spirits exporters FEVS, told Reuters.\nHe estimated the tax, along with unfavourable exchange rates, could reduce annual sales for the French industry by around 1 billion euros."
    },
    {
      "url": "https://finance.yahoo.com/quote/TGT",
      "text": "Target Corporation (TGT)\n- Previous Close\n98.69 - Open\n98.49 - Bid --\n- Ask --\n- Day's Range\n96.13 - 98.50 - 52 Week Range\n87.35 - 161.84 - Volume\n10,676,008 - Avg. Volume\n6,392,703 - Market Cap (intraday)\n44.104B - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n11.31 - EPS (TTM)\n8.58 - Earnings Date Nov 19, 2025\n- Forward Dividend & Yield 4.50 (4.56%)\n- Ex-Dividend Date Aug 13, 2025\n- 1y Target Est\n102.74\nTarget Corporation operates as a general merchandise retailer in the United States. The company offers apparel for women, men, young adults, kids, toddlers, and babies, as well as jewelry, accessories, and shoes; and beauty products, such as skin and bath care, cosmetics, hair care, oral care, deodorant, and shaving products. It also provides food and beverage products comprising dry and perishable grocery, including snacks, candy, beverages, deli, bakery, meat, produce, and food service; electronics which includes video games and consoles, toys, sporting goods, entertainment, and luggage; bed and bath, home décor, school/office supplies, storage, small appliances, kitchenware, greeting cards, party supplies, furniture, lighting, home improvement, and seasonal merchandise; and household essentials, such as household cleaning, paper products, over-the-counter healthcare, vitamins and supplements, baby gear, and pet supplies. In addition, the company sells merchandise through periodic design and creative partnerships, and shop-in-shop experience; and in-store amenities. It sells its products through its stores; and digital channels, including Target.com. Target Corporation was incorporated in 1902 and is headquartered in Minneapolis, Minnesota.\ntarget.com440,000\nFull Time Employees\nFebruary 01\nFiscal Year Ends\nSector\nIndustry\nRecent News: TGT\nView MoreRelated Videos: TGT\nPerformance Overview: TGT\nTrailing total returns as of 8/21/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: TGT\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: TGT\nView MoreValuation Measures\nMarket Cap\n44.84B\nEnterprise Value\n60.47B\nTrailing P/E\n11.50\nForward P/E\n13.57\nPEG Ratio (5yr expected)\n2.36\nPrice/Sales (ttm)\n0.43\nPrice/Book (mrq)\n2.91\nEnterprise Value/Revenue\n0.57\nEnterprise Value/EBITDA\n7.03\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n3.72%\nReturn on Assets (ttm)\n6.15%\nReturn on Equity (ttm)\n26.32%\nRevenue (ttm)\n105.64B\nNet Income Avi to Common (ttm)\n3.93B\nDiluted EPS (ttm)\n8.58\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n4.34B\nTotal Debt/Equity (mrq)\n129.51%\nLevered Free Cash Flow (ttm)\n2.99B\nResearch Analysis: TGT\nView MoreResearch Reports: TGT\nView MoreTarget Earnings: Fiddelke to Take the Helm, as Competitive and Macro Angst Persist; Shares a Deal\nTarget serves as the nation’s seventh-largest retailer, with its strategy predicated on delivering a gratifying in-store shopping experience and a wide product assortment of trendy apparel, home goods, and household essentials at competitive prices. Target’s upscale and stylish image began to carry national merit in the 1990s—a decade in which the brand saw its top line grow threefold to almost $30 billion—and has since cemented itself as a leading US retailer. Today, Target operates over 1,900 stores in the United States, generates over $100 billion in sales, and fulfills over 2 billion customer orders annually. The firm’s vast footprint is concentrated in urban and suburban markets as the firm seeks to appeal to a more affluent consumer base.\nRatingPrice TargetGDP is Growing Again, 2Q Up 3.0%\nAccording to the advance estimate from the Bureau of Economic Analysis, U.S. Gross Domestic Product (GDP) rose in the second quarter at an annualized rate of 3.0%. That's above the 2.4% consensus and a rebound from the 0.5% decline in the fourth quarter. Our forecast was for an increase of 1.8%. Imports decreased 30.3% as trade normalized after the first quarter's 51.6% jump in goods purchases (in advance of the expected imposition of tariffs). Net exports of goods and services, aka the trade balance, raised 2Q GDP by 4.99 percentage points, reversing a 4.61-point drag in 1Q. Companies appear to be using the stockpiles built in 1Q. Inventories cut 3.17 points from GDP after adding 2.59 points in 1Q. Spending by consumers rose 1.4%, an improvement from the 0.5% increase in 1Q. Private investment declined 15.6%, led by a 10.3% decline in nonresidential structures. Consumer spending on goods rose 2.2%. Within goods, durables were up 3.7%, after a 3.7% decline in 1Q. Nondurables were up 1.3%. The huge services category was up 1.1% after an increase of just 0.6% in 1Q. That is a little softer than we would like. This steady category added 0.53 points of growth. Government consumption and investment rose 0.4%. The federal government was down 3.7%, with national defense up 2.2%. Nondefense was down a big 11.3%, State and local government was up 3.0%. Growth in real final sales to private domestic purchasers, which exclude net exports, inventory investment, and government spending, rose 1.2 % -- slower than 1.9% in 1Q. The GDP report also contains data on inflation, which slowed in 2Q. The PCE Price Index increased 2.1% in the second quarter, compared with an increase of 3.7 in the first quarter. Excluding food and energy, the index increased 2.5%, compared with an increase of 3.5% in the previous quarter. After the report, futures on the S&P 500 were little changed. The yield on the 10-year Treasury note was up two basis points to 4.36%. Based on futures trading, the probability that the Fed will keep policy steady this afternoon remained at 98%. Expectations for a September cut declined slightly, to 62% from 64%.\nThe Argus Min Vol Model Portfolio\nUncertainty over President Trump's new tariff policies almost knocked stocks into a bear market earlier this year. While growth stocks suffered the most, value stocks also declined. Even bond prices were lower amid the confusion. Stocks have since recovered and the bull market that began in 2022 remains intact. But inflation is still an issue and the trade war may still be in play. Is a recession in the offing? With all the puts and takes, and ups and downs, is it time for investors to cash in their chips? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.\nThe Argus Min Vol Model Portfolio\nUncertainty over President Trump's new tariff policies almost knocked stocks into a bear market earlier this year. While growth stocks suffered the most, value stocks also declined. Even bond prices were lower amid the confusion. Stocks have since recovered and the bull market that began in 2022 remains intact. But inflation is still an issue and the trade war may still be in play. Is a recession in the offing? With all the puts and takes, and ups and downs, is it time for investors to cash in their chips? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods."
    },
    {
      "url": "https://finance.yahoo.com/news/sony-hikes-playstation-5-prices-161831105.html",
      "text": "(Reuters) -Sony (SONY) will raise prices of its PlayStation 5 consoles in the United States by around $50 from Thursday, as the Japanese conglomerate navigates a slow recovery in the videogame market while U.S. tariffs threaten to raise costs.\nAll three PlayStation 5 consoles will see a similar price hike, with the most expensive PS5 Pro version expected to cost $749.99, the company said in a blog post on Wednesday.\nThe price changes come after U.S. President Donald Trump announced sweeping tariffs on imports from global manufacturing hubs such as China and Japan, leading to fears of supply chain disruptions and high material costs.\nSony had raised prices of its consoles in various European markets in April. Rival Xbox also hiked sticker prices of its consoles and accessories in the U.S., Europe, Australia and the UK a month later.\nConsoles were expected to be a major driver of videogame market growth this year due to the launch of premium titles such as Take-Two Interactive's \"Grand Theft Auto VI\" and Nintendo's Switch 2.\nBut console price hikes and the delay of highly-anticipated \"GTA VI\" to next year have cast some doubt on the pace of growth in the industry.\nOn Wednesday, Sony said there are no price changes for other markets and prices of PlayStation 5 accessories remain unchanged.\n(Reporting by Zaheer Kachwala in Bengaluru; Editing by Leroy Leo)"
    },
    {
      "url": "https://finance.yahoo.com/news/bessent-says-us-tariff-revenues-174752674.html",
      "text": "By Andrea Shalal\nWASHINGTON (Reuters) -U.S. Treasury Secretary Scott Bessent said he expects a big jump in revenues from sweeping tariffs imposed by President Donald Trump, and said the money would be used first to start paying down the federal debt, not to give rebate checks to Americans.\nBessent, speaking in an interview on CNBC's \"Squawk Box,\" said he expected to substantially revise upward his earlier estimate of $300 billion in revenues from the tariffs, but declined to be more specific.\nBessent said he had not spoken with Trump about the idea of using funds from the tariffs to create a dividend for Americans, but stressed that both of them were \"laser-focused\" on paying down the debt.\n\"I've been saying that tariff revenue could be $300 billion this year. I'm going to have to revise that up substantially,\" Bessent said. \"We're going to bring down the deficit to GDP. We'll start paying down the debt, and then at that point that can be used as an offset to the American people.\"\nThe U.S. economy could return to the \"good, low-inflationary growth\" of the 1990s, Bessent said, but he blamed higher interest rates for problems plaguing some pockets of the economy, singling out housing and lower-income households with high credit card debt.\nA cut in the Federal Reserve's key interest rate - which Trump has continually pressed for - could help facilitate a boom or pickup in home building, which would help keep prices down in one to two years, he said.\nThe U.S. Census Bureau on Tuesday reported a small increase in groundbreaking for single-family homes and permits for future construction in July, even as high mortgage rates and economic uncertainty continued to hamper home purchases.\nTrump's wide-ranging import tariffs have kept the Federal Reserve from lowering interest rates this year, with most central bank policymakers wary of easing borrowing costs until they have more confidence the levies will not rekindle inflation, which has yet to return to the Fed's 2% target.\nRecent indications of softening in the job market, however, have largely convinced investors that the Fed will cut rates by a quarter of a percentage point when it meets in mid-September. That expectation has helped bring down mortgage rates in recent weeks.\nBessent has previously said a 50-basis-point cut in rates was warranted.\n(Reporting by Andrea ShalalEditing by Mark Potter and Leslie Adler)"
    },
    {
      "url": "https://finance.yahoo.com/news/japan-exports-fall-most-four-004934430.html",
      "text": "(Bloomberg) -- Japan’s exports sustained their steepest drop in more than four years as US tariffs continued to weigh on global commerce, clouding the outlook for economic growth at a time when personal spending remains unsteady.\nExports fell 2.6% in value in July from a year earlier, sliding more than the median forecast of a 2.1% decline, the Ministry of Finance reported Wednesday. The downturn, led by cars, auto parts and steel, was the biggest since February 2021. Export volumes rose by 1.2%, suggesting exporters are continuing to absorb US tariff costs by cutting selling prices to preserve market share.\nMost Read from Bloomberg\n-\nWhy New York City Has a Fleet of New EVs From a Dead Carmaker\n-\nChicago Schools Seeks $1 Billion of Short-Term Debt as Cash Gone\n-\nTrump Takes Second Swing at Cutting Housing Assistance for Immigrants\n-\nA Photographer’s Pipe Dream: Capturing New York’s Vast Water System\n-\nA London Apartment Tower With Echoes of Victorian Rail and Ancient Rome\nImports decreased 7.5% as inbound shipments of crude oil, coal and liquefied natural gas all shrank by double digits, but the trade balance still flipped to a deficit of ¥117.5 billion.\nThe latest slide in exports may strengthen concerns over whether Japan’s economy can continue to expand as US President Donald Trump’s tariffs weigh on global trade. While the economy has so far managed to eke out growth in the last five quarters despite weakness in domestic consumption, further drops in exports could drag the economy into reverse.\nContinued falls in exports may also encourage Bank of Japan Governor Kazuo Ueda to adopt a cautious stance. The ability of the economy to show resilience in the face of the US duties is a factor in the calculus for the BOJ as it considers the best timing for its next interest rate hike. The BOJ is expected to stand pat when it next sets policy on Sept. 19.\n“Car shipments to the US have started to decline in volume, suggesting that the impact of tariffs is finally starting to show,” said Taro Saito, head of economic research at NLI Research Institute. “In the US, prices of Japanese exports began rising around June or July, so we’re now seeing the effects of Japanese goods gradually losing their price competitiveness.”\nThe report showed that exports to the US dropped by 10.1% last month from a year earlier, with the value of shipments of vehicles and auto parts plunging 28.4% and 17.4%, respectively. In terms of volume, exports of vehicles to the US fell by 3.2%, a clear indication that carmakers are absorbing a portion of the tariffs to support sales."
    },
    {
      "url": "https://finance.yahoo.com/news/eu-us-trade-deal-does-123710228.html",
      "text": "BRUSSELS (Reuters) -The European Commission will keep pressing for a preferential tariff for wine and spirits exports to the U.S. that would spare the sector the 15% rate applied on most items under the EU-U.S. trade deal, the EU's trade commissioner said on Thursday.\n\"This one we didn't get in. But I can tell you that there is clear commitment from the European Commission to put it on the table,\" Maros Sefcovic said when asked if a preferential rate for the sector had been secured.\nSefcovic spoke after the European Union and the U.S. detailed commitments made in the deal reached last month, which includes a 15% U.S. tariff on most imports from the bloc, including autos, pharmaceuticals, semiconductors and lumber.\nThe same rate also applies to EU wine and spirits exports, despite industry efforts to get a lower, or even zero rate.\nThat means U.S. buyers of French Champagne, Irish whiskey and Italian Prosecco could face significant price rises, with the tariffs impacting some $10 billion worth of alcoholic beverage imports each year, analysts say.\nBrands affected include Diageo's Guinness beer and Pernod Ricard's Jameson Irish whiskey.\nThe Distilled Spirits Council of the United States, an industry group representing spirits producers and marketers, has called for permanent zero tariffs by both sides and expressed disappointment that no preferential rate had been agreed.\n\"Without a permanent return to zero-for-zero tariffs on spirits, American distillers do not have the certainty to plan for future export and job growth without the fear of retaliatory tariffs returning,\" it said.\nIt added that it was \"determined to continue engaging with the Trump administration to urge for additional negotiations\".\nThat message was echoed by Herve Dumesny, director general of European industry group spiritsEUROPE.\n\"We urge both sides to remain at the negotiating table and deliver a swift, full return to zero-for-zero,\" Dumesny said.\n\"This means reaffirming the support for our sector across the Atlantic by removing U.S. tariffs on EU spirits and lifting any suspended EU retaliatory measures on U.S. products.\"\nThe lack of a preferential deal for European alcoholic drinks in the trade agreement announced on Thursday is \"a huge disappointment,\" Gabriel Picard, president of France's federation of wines and spirits exporters FEVS, told Reuters.\nHe estimated the tax, along with unfavourable exchange rates, could reduce annual sales for the French industry by around 1 billion euros."
    },
    {
      "url": "https://finance.yahoo.com/news/johnson-johnson-invest-2-billion-091136627.html",
      "text": "(Corrects paragraph 4 to say the unit is called Fujifilm Biotechnologies, not Fujifilm Diosynth Biotechnologies)\n(Reuters) -Johnson & Johnson said on Thursday it would invest $2 billion in North Carolina as it aims to expand its U.S. manufacturing presence amid looming drug import duties proposed by President Donald Trump's administration.\nMajor drugmakers, including Eli Lilly and AstraZeneca, have also committed to shell out billions of dollars to scale up their U.S. footprint in response to Trump's efforts, including tariff threats.\nEarlier this month, Trump said he plans to impose phased-in tariffs for the pharmaceutical sector, which could start small and eventually rise to 250%.\nJ&J said on Thursday it has reached a 10-year agreement with Tokyo-based contract drug developer Fujifilm Biotechnologies for its more than 160,000-square-foot manufacturing facility in Holly Springs, North Carolina, which would create about 120 new jobs.\nFujifilm in April had signed a more than $3 billion deal with Regeneron to manufacture and supply drug products for the U.S.-based company at its North Carolina facility for a span of 10 years.\nJ&J would also announce plans for additional manufacturing facilities in the U.S. and the expansion of current U.S. sites in the coming months.\nThe healthcare conglomerate had said in March it would raise U.S. investments by 25% to more than $55 billion over the next four years, including a separate plant in Wilson, North Carolina.\n(Reporting by Mariam Sunny in Bengaluru; Editing by Rashmi Aich and Shilpi Majumdar)"
    },
    {
      "url": "https://finance.yahoo.com/author/brian-sozzi/",
      "text": "Brian Sozzi\nBrian Sozzi is Yahoo Finance's Executive Editor. He hosts executive interviews on Yahoo Finance Live, Yahoo Finance's 'Lead This Way' digital series and at major conferences such as the World Economic Forum in Davos and the Milken conference. He is also the host for the Opening Bid podcast and leads direction for Yahoo Finance's annual 'Invest' conference. Sozzi was previously the Executive Editor of publicly traded financial media company TheStreet. He led editorial direction for multimedia publications TheStreet, The Deal, several subscription news and data services, video and the company's conference business. He was a member of TheStreet's executive management team and reported directly to the founder, CEO and chairman. Sozzi began his career on Wall Street as a sell-side stock analyst covering retailers, banks and numerous other sectors. He won the 2011 FT | StarMine Analyst Award for No. 3 Earnings Estimator in the Textiles Apparel and Luxury Goods Industry."
    },
    {
      "url": "https://finance.yahoo.com/quote/WMT",
      "text": "Walmart Inc. (WMT)\n- Previous Close\n102.57 - Open\n99.41 - Bid 97.53 x 500\n- Ask 98.13 x 1000\n- Day's Range\n96.95 - 99.45 - 52 Week Range\n75.01 - 105.30 - Volume\n51,615,727 - Avg. Volume\n16,059,627 - Market Cap (intraday)\n781.762B - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n36.97 - EPS (TTM)\n2.65 - Earnings Date Nov 20, 2025\n- Forward Dividend & Yield 0.94 (0.96%)\n- Ex-Dividend Date Dec 12, 2025\n- 1y Target Est\n111.86\nWalmart Inc. engages in the operation of retail and wholesale stores and clubs, eCommerce websites, and mobile applications worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; and ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites. The company also offers grocery items, including dry grocery, snacks, dairy, meat, produce, deli and bakery, frozen foods, alcoholic and nonalcoholic beverages, as well as consumables, such as health and beauty aids, pet supplies, household chemicals, paper goods, and baby products; and fuel and other categories. In addition, it is involved in the provision of health and wellness products covering pharmacy, optical and hearing services, over-the-counter drugs, and protein and nutrition products; and home, hardlines, and seasonal items, including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, and mattresses. Further, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Additionally, it operates digital payment platforms; offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access; and markets lines of merchandise under private and licensed brands. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.\ncorporate.walmart.com2,100,000\nFull Time Employees\nJanuary 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: WMT\nView MoreRelated Videos: WMT\nPerformance Overview: WMT\nTrailing total returns as of 8/21/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: WMT\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: WMT\nView MoreValuation Measures\nMarket Cap\n781.76B\nEnterprise Value\n837.34B\nTrailing P/E\n36.97\nForward P/E\n37.45\nPEG Ratio (5yr expected)\n3.74\nPrice/Sales (ttm)\n1.14\nPrice/Book (mrq)\n8.68\nEnterprise Value/Revenue\n1.21\nEnterprise Value/EBITDA\n18.77\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n3.08%\nReturn on Assets (ttm)\n6.88%\nReturn on Equity (ttm)\n23.38%\nRevenue (ttm)\n693.15B\nNet Income Avi to Common (ttm)\n21.34B\nDiluted EPS (ttm)\n2.65\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n9.43B\nTotal Debt/Equity (mrq)\n67.12%\nLevered Free Cash Flow (ttm)\n8.03B\nResearch Analysis: WMT\nView MoreResearch Reports: WMT\nView MoreWalmart Earnings: Sales Soar While Profits Sputter; Shares Far From a Bargain\nWalmart is a leading retailer in the United States, with its strategy predicated on superior operating efficiency and offering the lowest priced goods to consumers to drive robust store traffic and product turnover. Walmart augmented its low-price business strategy by offering a convenient one-stop shopping destination with the opening of its first supercenter in 1988. Today, Walmart operates over 4,600 stores in the United States (5,200 including Sam’s Club) and over 10,000 locations globally. Walmart generated over $460 billion in domestic namesake sales in fiscal 2025, with Sam’s Club contributing another $90 billion to the company's top line. Internationally, Walmart generated $120 billion in sales. The retailer serves around 270 million customers globally each week.\nRatingPrice TargetThe Argus Min Vol Model Portfolio\nUncertainty over President Trump's new tariff policies almost knocked stocks into a bear market earlier this year. While growth stocks suffered the most, value stocks also declined. Even bond prices were lower amid the confusion. Stocks have since recovered and the bull market that began in 2022 remains intact. But inflation is still an issue and the trade war may still be in play. Is a recession in the offing? With all the puts and takes, and ups and downs, is it time for investors to cash in their chips? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.\nThe Argus Min Vol Model Portfolio\nUncertainty over President Trump's new tariff policies almost knocked stocks into a bear market earlier this year. While growth stocks suffered the most, value stocks also declined. Even bond prices were lower amid the confusion. Stocks have since recovered and the bull market that began in 2022 remains intact. But inflation is still an issue and the trade war may still be in play. Is a recession in the offing? With all the puts and takes, and ups and downs, is it time for investors to cash in their chips? Argus believes that Min Vol is an all-weather strategy that is timely in any investing climate. Academic literature and, more to the point, returns history, indicate that Min Vol can deliver market-matching returns on an absolute basis and superior returns on a risk-adjusted basis over various time periods.\nArgus Quick Note: Weekly Stock List for 07/21/2025: Dividend Growers\nDividend income is often overlooked amid gyrations in the stock market. Consider that in 2024, market bulls were boasting about 24%-plus S&P 500 returns. Few were focused on the broad market index's 1.2% dividend yield. But dividends are an important element of return, and 2025 is bearing that out. Through May, the S&P 500 was up a thin 1.1%; without dividends, there was essentially no returns at all. Indeed, dividend income accounted for 42% of the total return of the S&P 500 between 1930 and 2012, according to Hartford Funds. And that's just the average. In some of those decades, dividends accounted for more than 50% of total returns and even 100% of returns. More recently, dividends have accounted for a smaller portion of returns, at around 15%-20%. Not for nothing, in 2022, dividend payments softened the blow when most market indices turned bearish as the Federal Reserve hiked interest rates. We saw that pattern in 2018 as well. Not all dividends are created equal, though, and it is important to understand the difference between the two main investment categories: high-yield stocks and dividend-growth stocks. High-yield stocks typically have dividends that pay out in the 5%-8% range. Though the income appears attractive, the share prices of high-yield stocks may be at risk. Indeed, if interest rates drift higher, risk-averse equity investors could be drawn to the relative safety of bonds and may sell their high-yield stocks. In addition, it is worth noting that a yield in the 7%-10% range could signal a company is struggling and the dividend is in jeopardy. Former blue-chip companies such as 3M, General Electric, Boeing, and Kraft Heinz cut their high dividends in the past few years. Lastly, high dividend payouts likely constitute a high percentage of the cash a company earns, leaving little behind for management to deploy into value-enhancing activities. Dividend-growth stocks typically have lower yields, often in the 1.0%-2.5% range. But the lower-yielding dividends are not likely to be a huge component of cash flow, opening up other value-additive options for deploying to cash management teams -- such as share buybacks, M&A, the repayment of debt, or reinvestment in the core business. Further, while the yields are not as high, management teams may be more likely to boost the payouts over time, as earnings grow. Below is a list of the Argus BUY-rated stocks that were recently added to our Dividend Growth Model Portfolio.\nTop Analysts: WMT\nView MoreOverall Score\nDiscover which analysts rank highest for WMT overall weighted by direction, price target, and price movement.\nLearn MoreDirection Score\nDiscover which analysts rank highest on predicting the directional movement of WMT.\nLearn MorePrice Score\nDiscover which analysts rank highest on predicting the price target of WMT.\nLearn More"
    },
    {
      "url": "https://finance.yahoo.com/news/nvidia-asks-suppliers-halt-h20-005428505.html",
      "text": "(Bloomberg) -- Nvidia Corp. has instructed component suppliers including Samsung Electronics Co. and Amkor Technology Inc. to stop production related to the H20 AI chip, the Information reported, citing unidentified sources.\nNvidia issued those orders this week after Beijing urged local companies to avoid using the H20, the Information said, referring to a chip designed specifically for the Chinese market. The US company’s shares slid about 1.3% in US pre-market trading.\nMost Read from Bloomberg\n-\nWhy New York City Has a Fleet of New EVs From a Dead Carmaker\n-\nNeom’s Desert Ski Resort Strains Saudi Prince’s $1.5 Trillion Plan\n-\nTrump Takes Second Swing at Cutting Housing Assistance for Immigrants\n-\nChicago Schools Seeks $1 Billion of Short-Term Debt as Cash Gone\nA production suspension would raise questions about fundamental demand for the H20, a less-powerful version of Nvidia’s cutting-edge AI accelerators that competes with similarly capable chips from the likes of Huawei Technologies Co. and Cambricon Technologies Corp. The latter company’s shares soared as much as 20% Friday, leading a rally in fellow Chinese chip stocks.\nNvidia and Advanced Micro Devices Inc. both recently secured Washington’s approval to resume lower-end AI chip sales to China, on the controversial and legally questionable condition that they give the US government a 15% cut of the related revenue. But their Chinese customers are under pressure to adopt homegrown chips instead — part of a broader objective to build a world-class domestic industry and wean the country off US technology.\nIn past weeks, Chinese authorities have sent notices to a range of firms discouraging use of the less-advanced semiconductors, Bloomberg News has reported. That followed warnings about alleged security risks in the H20, after Washington officials said they were considering ways to equip chips with better location-tracking capabilities.\nThe scrutiny coincides with the growing capabilities of homegrown alternatives to Nvidia designed by Huawei and its peers. On Thursday, Chinese AI phenomenon DeepSeek said its latest AI model was customized to work with next-generation Chinese-made AI chips, without elaborating.\nChief Executive Officer Jensen Huang on Friday said he was surprised when Beijing expressed those concerns and was now addressing that in talks with the authorities. But he reiterated that the H20 houses no such security backdoors. Huang, who was in Taiwan to discuss his upcoming Rubin chip with Taiwan Semiconductor Manufacturing Co., said Nvidia’s also in talks with Washington about a potential follow-up to the H20 for China, though that depended on the Trump administration."
    },
    {
      "url": "https://finance.yahoo.com/news/economic-impact-us-tariffs-key-131342925.html",
      "text": "By Davide Barbuscia\nNEW YORK (Reuters) -S&P Global Ratings' decision to affirm its U.S. credit rating factored in tariff revenues, but questions remain on the economic outcome of U.S. trade policies that could influence the country's rating in the next few years, the primary analyst on the U.S. said.\nS&P on Monday affirmed its \"AA+\" credit rating for the world's number one economy, saying the revenue from President Donald Trump's tariffs had the potential to offset the fiscal hit from his massive tax-cut and spending bill. S&P, which became the first ratings agency to cut the pristine U.S. government rating in 2011, said the outlook on the U.S. rating remains stable.\nLisa Schineller, primary U.S. analyst at S&P Global Ratings, said execution and effects of trade and budget policies will be decisive for future ratings.\n\"The outcomes of how you execute the budgetary legislation, how the tariff revenue comes, their combined impact on growth and investment that leads to either better or worse or similar fiscal out-turns, that's our focus,\" she told Reuters in an interview.\nNonpartisan analysts have said that the bill Trump signed into law last month could add $3.3 trillion to the nation's debt over the next decade. Republicans have argued that extending and adding to tax cuts implemented during Trump's first term in 2017 and meant to expire in 2025, will not drive the debt higher.\nSchineller said S&P's forecast horizon when assessing the U.S. creditworthiness was about three, four years.\nWhile she did not expect the tax and spending bill as such to lower the U.S. budget deficit, she said tariff revenues expected over that horizon would offset - to a certain extent - the deficit-widening impact of the budget legislation.\n\"It is a potentially important offset,\" Schineller said.\nThe Budget Lab at Yale, a non-partisan policy research center, estimates the average effective tariff rate has shot up to 18.6% now from 2.4% in early January.\n\"It's that large of a change that we feel that will bring in important revenue,\" said Schineller.\nThe U.S. reported a $21 billion jump in customs duty collections from tariffs in July, but the government budget deficit still grew nearly 20% during that month to $291 billion. The U.S. national debt surged above a record $37 trillion last week.\nRatings agency Moody's in May downgraded the U.S. sovereign credit by one notch, citing rising debt levels and stripping the country of its last triple-A top rating.\nThat followed a 2023 downgrade by rival Fitch, which pointed to expected fiscal deterioration and repeated down-to-the-wire debt ceiling negotiations."
    },
    {
      "url": "https://finance.yahoo.com/news/trumps-sweeping-tariffs-take-effect-in-another-dramatic-reshaping-of-the-us-trade-landscape-040101506.html",
      "text": "New sweeping \"reciprocal\" tariffs are now in force as the White House implemented a recent executive action that will see importers paying between 10% and 50% in the coming months as they bring in a variety of goods to the US from around the globe.\nTrump took to social media at the overnight deadline to tout, \"IT’S MIDNIGHT!!! BILLIONS OF DOLLARS IN TARIFFS ARE NOW FLOWING INTO THE UNITED STATES OF AMERICA!\"\nDozens of countries — including top trading partners like the European Union, South Korea, and Japan — now face a key new rate of 15%.\nOthers are facing \"bespoke\" rates. Those at the higher end of the spectrum have found themselves at odds with President Trump.\nThe latest complete tally, according to recent calculations from the Yale Budget Lab, is that the US overall average effective tariff rate will jump to 18.3% as these \"reciprocal\" tariffs take effect.\nRead more: What Trump's tariffs mean for the economy and your wallet\nIt's yet another uptick from Trump in his trade wars, with plenty more promised in the weeks ahead.\nTrump even suggested late Wednesday afternoon he is looking to impose a tariff of approximately 100% on \"all chips and semiconductors coming into the United States\" but with an escape hatch for companies that offer even \"a commitment to build inside the United States.\"\nTrump's focus on tariffs hasn't slowed even after months of fears that these new duties will spur at least temporary inflation.\nThe many moves have pushed the Federal Reserve to hold interest rates steady — much to Trump's unhappiness — with Chair Jerome Powell recently noting \"higher tariffs have begun to show through more clearly to prices of some goods.\"\nBut rates continue to rise, with countries now facing higher tariffs, including Brazil, which saw 50% duties go into effect Wednesday, and India, which now faces 25% duties but could see rates double in about three weeks' time over its consumption of Russian oil.\nGoods from almost two dozen nations, from Bangladesh to South Africa, now face higher rates, with shippers there now set to pay 20% or higher.\nMeanwhile, a major surprise in recent days has been Switzerland, which now faces 39% duties. That's after a last-minute trip from the Swiss president, which appears not to have borne immediate fruit in getting an exemption for her country.\nCanada, Mexico, and China are not seeing their rates change this week as all three nations already face headline tariffs of 25% or higher — and all are on different negotiating schedules."
    }
  ],
  "argos_summary": "White House trade adviser Peter Navarro criticized India for its continued purchases of Russian oil and announced that punitive tariffs on Indian imports are expected to double to 50% next week. In response, a Chinese official expressed support for India, highlighting growing cooperation between the two nations amid U.S. tariff threats. Meanwhile, the U.S. and EU established a trade framework that includes a 15% tariff on most EU imports, while U.S. Treasury Secretary Scott Bessent projected significant tariff revenue, which he indicated would be used to pay down federal debt.",
  "argos_id": "P55MBWM3N"
}