{
  "url": "https://www.nytimes.com/athletic/6569145/2025/08/22/man-city-team-news-rodri-foden/",
  "authorsByline": "Colin Millar",
  "articleId": "ad487364c3b94227b267be5e931c73a8",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/22074825/GettyImages-2230759640-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T11:53:45+00:00",
  "addDate": "2025-08-22T12:01:59.619091+00:00",
  "refreshDate": "2025-08-22T12:01:59.619093+00:00",
  "score": 1.0,
  "title": "Manchester City’s Rodri, Phil Foden available for Tottenham game – Pep Guardiola",
  "description": "Both players missed City's opening-weekend victory at Wolves with Rodri returning to availability ahead of schedule.",
  "content": "Pep Guardiola has confirmed Rodri and Phil Foden are both fit to feature for Manchester City against Tottenham Hotspur this weekend.\n\nBoth players missed City’s opening-weekend 4-0 victory at Wolverhampton Wanderers and Guardiola said earlier this month he did not expect Spain international Rodri to return to fitness until after the September international break.\n\nRodri, who missed the majority of last season after suffering an ACL injury, picked up what Guardiola described as a “big” groin injury in City’s last-16 defeat to Al-Hilal in the United States on July 1.\n\n“Rodri and Phil were out the last game but due to lack of training and rhythm,” Guardiola told his pre-match press conference.\n\n“They did not travel (for the pre-season friendly against) Palermo and the other guys were all pre-season doing that. But they were not ready for 90 minutes against Wolves, but they will be ready now.”\n\nGuardiola added that Savinho, Mateo Kovacic, Josko Gvardiol, and Marcus Bettinelli were all ruled out of the game for City.\n\nThe fixture at home to Spurs was City’s heaviest defeat last season as they lost by four goals.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6543734/2025/08/09/rodri-fitness-pep-guardiola-manchester-city/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last season",
      "weight": 0.11178292
    },
    {
      "name": "Manchester City",
      "weight": 0.11172442
    },
    {
      "name": "Pep Guardiola",
      "weight": 0.10752733
    },
    {
      "name": "City",
      "weight": 0.103900164
    },
    {
      "name": "Guardiola",
      "weight": 0.101815574
    },
    {
      "name": "Spain international Rodri",
      "weight": 0.10010113
    },
    {
      "name": "Phil Foden",
      "weight": 0.09212307
    },
    {
      "name": "Tottenham game",
      "weight": 0.09088454
    },
    {
      "name": "Rodri",
      "weight": 0.08986561
    },
    {
      "name": "Manchester City’s Rodri",
      "weight": 0.0760124
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98291015625
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97412109375
    }
  ],
  "sentiment": {
    "positive": 0.09241042,
    "negative": 0.5660824,
    "neutral": 0.34150717
  },
  "summary": "Manchester City's manager, Pep Guardiola, has confirmed that Rodri and Phil Foden are both fit to play for the upcoming game against Tottenham Hotspur. The two players had been sidelined from the previous game due to a groin injury, which Guardiola described as a significant issue. He also revealed that Savinho, Mateo Kovacic, and and Cole were all ruled out of the game.",
  "shortSummary": "Pep Guardiola confirmed that Rodri and Phil Foden are fit to play in Manchester City’s match against Tottenham, despite ongoing injury concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b8c4e436da4341ae97991beecb6df3f9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6543734/2025/08/09/rodri-fitness-pep-guardiola-manchester-city/",
      "text": "Manchester City head coach Pep Guardiola says he does not expect Rodri to be fully fit until after the September international break due to “a big injury” at the Club World Cup.\nRodri, who missed the majority of last season after suffering an ACL injury, picked up a groin injury in City’s last-16 defeat to Al-Hilal in the United States on July 1.\nAdvertisement\nHe has not travelled to Italy for their pre-season friendly against Palermo on Saturday.\nGuardiola hopes the Ballon d’Or holder can play some part in City’s first three league matches of the campaign – against Wolverhampton Wanderers, Tottenham Hotspur and Brighton & Hove Albion – but does not expect the 29-year-old at his best until after next month’s internationals.\nCity face rivals Manchester United and Arsenal in consecutive games following the hiatus.\n“Rodri is getting better but he had a big injury in the last game against Al Hilal. He has trained better in the last few days, hopefully after the international break is when he will be really fit,” Guardiola told a press conference on Friday, in quotes carried by The Manchester Evening News.\n“Hopefully in these (opening) games he can play some minutes but what is important is he doesn’t have pain because we don’t want this Rodri coming back injured.\n“We try desperately to avoid that. He has been training the last two sessions with us and that’s good.”\nRodri suffered an ACL injury in City’s 2-2 draw with Arsenal in September 2024 and did not return to action until their penultimate league game of last season, against Bournemouth in May.\nCity were top of last season’s fledging Premier League table when Rodri was injured but, without him, the defending champions won just once in 13 games between October 30 and Boxing Day, eventually finishing third – 13 points behind title-winners Liverpool.\n(Photo: Michael Regan/Getty Images)"
    }
  ],
  "argos_summary": "Pep Guardiola has confirmed that Rodri and Phil Foden are fit to play for Manchester City against Tottenham Hotspur after missing the opening match due to lack of training. Rodri, who suffered a significant groin injury during a match against Al-Hilal, is expected to gradually regain fitness but may not be at his best until after the September international break. Meanwhile, several other players, including Savinho and Mateo Kovacic, will miss the game.",
  "argos_id": "QLN6FC794"
}