{
  "url": "https://www.investing.com/news/company-news/bhp-files-2025-annual-report-with-sec-93CH-4206694",
  "authorsByline": "",
  "articleId": "c737e87a18fb4ef99e1ffbbf2c640dce",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T11:54:42+00:00",
  "addDate": "2025-08-22T12:01:59.620115+00:00",
  "refreshDate": "2025-08-22T12:01:59.620116+00:00",
  "score": 1.0,
  "title": "BHP files 2025 annual report with SEC By Investing",
  "description": "BHP files 2025 annual report with SEC",
  "content": "MELBOURNE - giant BHP Group (NYSE: ) Limited announced on Friday it has filed its 2025 US Annual Report (Form 20-F) with the United States Securities and Exchange Commission.\n\nThe company noted in a press release that the Form 20-F was prepared in accordance with SEC requirements and not for reporting under the Australasian Code for Reporting of Exploration Results, Mineral Resources and Ore Reserves (JORC Code, 2012 Edition).\n\nBHP has submitted the report to the UK’s Financial Conduct Authority National Storage Mechanism, where it will be available for inspection. The document can also be accessed through BHP’s website or the SEC’s website.\n\nAmerican Depositary Receipt holders can request a hard copy of the company’s complete audited financial statements at no cost by contacting Citibank Shareholder Services.\n\nThe filing represents a routine annual disclosure requirement for BHP, which maintains listings on multiple global exchanges. The company, headquartered in Australia, is one of the world’s largest mining corporations with operations spanning multiple continents.\n\nNo specific financial highlights or operational updates were included in the announcement about the filing.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/equities/bhp-billiton-ltd-nyse-exch",
    "https://www.investing.com/indices/mining"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "BHP Group",
      "weight": 0.095079295
    },
    {
      "name": "BHP",
      "weight": 0.088712044
    },
    {
      "name": "SEC requirements",
      "weight": 0.08551295
    },
    {
      "name": "JORC Code",
      "weight": 0.07374223
    },
    {
      "name": "American Depositary Receipt holders",
      "weight": 0.0731648
    },
    {
      "name": "Financial Conduct Authority",
      "weight": 0.0730193
    },
    {
      "name": "multiple global exchanges",
      "weight": 0.07052615
    },
    {
      "name": "operational updates",
      "weight": 0.067436606
    },
    {
      "name": "multiple continents",
      "weight": 0.06613342
    },
    {
      "name": "Citibank Shareholder Services",
      "weight": 0.06556515
    }
  ],
  "topics": [
    {
      "name": "SEC"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9921875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.990234375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.955078125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.7626953125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.70751953125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.376953125
    }
  ],
  "sentiment": {
    "positive": 0.18426245,
    "negative": 0.0655506,
    "neutral": 0.7501869
  },
  "summary": "BHP Group (NYSE: ) Limited has filed its 2025 US Annual Report (Form 20-F) with the United States Securities and Exchange Commission (SEC) and will be available for inspection in the UK's Financial Conduct Authority National Storage Mechanism. The filing is part of a routine annual disclosure requirement for the company, which maintains listings on multiple global exchanges.",
  "shortSummary": "BHP Group has filed its 2025 US Annual Report with the SEC, focusing on compliance with regulatory requirements and operational readiness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "233c969937494050884f3d6079cad97c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.investing.com/indices/mining",
      "text": "Risk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks.\nBefore deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed.\nFusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily provided by any market or exchange, but may be provided by market makers, and so prices may not be accurate and may differ from the actual price at any given market, meaning prices are indicative and not appropriate for trading purposes. Fusion Media and any provider of the data contained in this website will not accept liability for any loss or damage as a result of your trading, or your reliance on the information contained within this website.\nIt is prohibited to use, store, reproduce, display, modify, transmit or distribute the data contained in this website without the explicit prior written permission of Fusion Media and/or the data provider. All intellectual property rights are reserved by the providers and/or the exchange providing the data contained in this website.\nFusion Media may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers.\n© 2007-2025 - Fusion Media Limited. All Rights Reserved."
    }
  ],
  "argos_summary": "BHP Group Limited has filed its 2025 US Annual Report (Form 20-F) with the SEC, complying with regulatory requirements. The report is available for inspection through the UK’s Financial Conduct Authority and on BHP’s website. This filing is part of BHP's routine annual disclosure process, and no specific financial or operational updates were provided in the announcement.",
  "argos_id": "QLRGERM10"
}