{
  "url": "https://www.forbes.com/sites/zakdoffman/2025/08/22/change-your-paypal-password-now-if-its-on-this-list/",
  "authorsByline": "Zak Doffman",
  "articleId": "653ef1d8f877441da92598a1fc00d38b",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68a311dc38cdd62c9b8ed25d/0x0.jpg?format=jpg&crop=3381,1901,x916,y1115,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T11:24:26+00:00",
  "addDate": "2025-08-22T11:37:13.217429+00:00",
  "refreshDate": "2025-08-22T11:37:13.217430+00:00",
  "score": 1.0,
  "title": "Change Your PayPal Password Now If It’s On This List",
  "description": "PayPal accounts are now at risk — what to know.",
  "content": "A cybercriminal is now selling millions of PayPal usernames and passwords on an online forum, data PayPal told me comes from a 2022 breach. Unsurprisingly, this has triggered headline warnings (1,2) that will alarm millions of users.\n\nThe dataset being sold is not as large or as new as advertised — there are not 16 million passwords and it’s not a “massive 2025 PayPal breach.” But it does expose the extent of passwords that are weak and those that are reused across multiple platforms.\n\nYou can’t check whether your password is listed in this sale without buying the data for $750, and you certainly don’t want to do that. But if you haven’t changed yours in a while, it’s safest to assume it is and change it now anyway.\n\nYou should also ensure that you have enabled 2-Step Verification on your account. Use an authenticator app instead of SMS, which is inherently weak. If your device allows it, add a passkey which links your account sign-in to your device’s security.\n\nFinally, whether it’s an existing or a changed password, you should check it against the list of those that are easily hacked — either because they’re too weak or because they’re too obvious. Even if you’re not using a password manager to select strong, unique passwords, it’s critical you get them right.\n\nWhen it comes to passwords that are too weak, you should check the annual list from Hive Systems. This sets out why character length and a mix of upper and lowercase letters, numbers and symbols is so critical. It’s an easy-to-follow set of rules.\n\nThe other list is also updated annually. This one comes from NordPass and covers the “top 200 most common passwords.” There’s a little of everything here. Numbers, sports teams, pop groups, qwerty variants and kids names. All are to be avoided.\n\nThere’s a similar list available from CyberGhost, which groups awful passwords by theme rather than popularity. Given that “81% of all data security breaches are caused by weak passwords,” it’s worth a few minutes of your time to check the lists.\n\nGiven that most users do not use two-factor-authentication or regularly update passwords, it’s critical that you get this right. While the revitalized PayPal breach is in the headlines, you can start there. But do the same for all your accounts, especially banking and other finance platforms as well as email and cloud data storage.",
  "medium": "Article",
  "links": [
    "https://www.hivesystems.com/password-table",
    "https://www.forbes.com/sites/zakdoffman/2025/06/23/google-confirms-most-users-must-upgrade-gmail-and-other-accounts/",
    "https://www.tomsguide.com/computing/online-security/over-16-million-paypal-accounts-exposed-on-a-hacking-forum-including-passwords",
    "https://nordpass.com/most-common-passwords-list/",
    "https://www.forbes.com/sites/zakdoffman/2025/08/18/massive-2025-paypal-breach-change-your-password-now/",
    "https://www.pcworld.com/article/2883726/15-8-million-paypal-accounts-at-risk-after-stolen-passwords-put-up-for-sale.html",
    "https://www.cyberghostvpn.com/privacyhub/the-worst-passwords-in-the-last-decade/",
    "https://www.forbes.com/sites/zakdoffman/2025/08/21/google-soundly-beaten-by-new-ai-attacks-change-your-browser/",
    "https://www.documentcloud.org/documents/23578067-paypal-notice/",
    "https://www.forbes.com/sites/zakdoffman/2025/08/22/microsofts-free-upgrade-offer-for-millions-of-iphone-users/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "weak passwords",
      "weight": 0.12803426
    },
    {
      "name": "awful passwords",
      "weight": 0.11494059
    },
    {
      "name": "passwords",
      "weight": 0.11420478
    },
    {
      "name": "PayPal usernames",
      "weight": 0.077318706
    },
    {
      "name": "cloud data storage",
      "weight": 0.07645822
    },
    {
      "name": "data",
      "weight": 0.07193273
    },
    {
      "name": "PayPal",
      "weight": 0.07093539
    },
    {
      "name": "other finance platforms",
      "weight": 0.07071893
    },
    {
      "name": "Your PayPal Password",
      "weight": 0.06722083
    },
    {
      "name": "strong, unique passwords",
      "weight": 0.06513314
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.84912109375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.52978515625
    },
    {
      "name": "/News/Technology News",
      "score": 0.51806640625
    },
    {
      "name": "/Shopping/Consumer Resources/Identity Theft Protection",
      "score": 0.44140625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Other",
      "score": 0.436767578125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.321533203125
    }
  ],
  "sentiment": {
    "positive": 0.07560579,
    "negative": 0.56911784,
    "neutral": 0.35527638
  },
  "summary": "A cybercriminal is selling millions of PayPal usernames and passwords on an online forum, according to PayPal. The sale, which is not as large or new as advertised, exposes the extent of passwords that are weak and reused across multiple platforms. If you haven't changed your password in a while, it's safest to assume it is and change it now. Additionally, ensure that you have enabled 2-Step Verification on your account and use an authenticator app instead of SMS. Check out an annual list from Hive Systems for weak passwords, which includes an easy-to-follow set of rules for character length and a mix of upper and lowercase letters, numbers and symbols.",
  "shortSummary": "A cybercriminal is selling millions of PayPal usernames and passwords, urging users to change quickly and ensure 2-Step Verification is available.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5601b1189bd94cc593b027d1235974a8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pcworld.com/article/2883726/15-8-million-paypal-accounts-at-risk-after-stolen-passwords-put-up-for-sale.html",
      "text": "A hacker going by the name Chucky_BF has allegedly stolen details for 15.8 million PayPal accounts and is selling them on an internet forum at a bargain price of just $750 USD. The treasure trove of data, which is being stored in a TXT file, is said to be 1.1 GB in size. However, the authenticity of the PayPal data has not yet been confirmed.\nYou can see a screenshot of the offer in this social media post . According to the hacker, the PayPal passwords are available in plain text and the email addresses of these PayPal accounts originate from Gmail, Yahoo!, Hotmail, and various country-specific domains.\nHow the stolen PayPal data was acquired\nAs of this writing, the hacker hasn’t said where the data came from or how much of it is still up to date.\nIn this social media post, well-known security expert Troy Hunt suspects that the hacker didn’t steal the data directly from PayPal’s servers since PayPal doesn’t store passwords in plaintext. Most likely they were taken from users, perhaps via infostealer malware.\nAccording to security site Hackread, which checked some of the data, there are some test accounts and fake accounts interspersed among the PayPal accounts, but many are genuine.\nLooking at the PayPal Newsroom, the company has not yet issued a statement about this as of this writing.\nHere’s what you should do now\nIf you have a PayPal account, you should immediately go check your transaction history and account settings for any suspicious activity. You should also change your PayPal password ASAP—and if you use the same password for other accounts, you should change those account passwords as well. Consider your password compromised.\nFurther reading: Careful! That PayPal email could be a phishing scam\nThis article originally appeared on our sister publication PC-WELT and was translated and localized from German."
    },
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2025/08/18/massive-2025-paypal-breach-change-your-password-now/",
      "text": "A cybercriminal is offering to sell 16 million PayPal user names and passwords on a cybercrime forum, claiming a “massive 2025 PayPal breach.\" The company says there has been no new breach and this data comes instead from a security incident in 2022.\nChucky_BF claims the dataset exposes “15.8M credential pairs in plaintext,” with “raw email: password:url entries across global domains.” But the price is just $750, which would seem to support the company’s rebuttal to these new claims, and suggests a much smaller volume of actual user data is included.\nAccording to HackRead, which first reported the sale, the samples “show Gmail addresses paired with passwords and linked directly to PayPal’s login pages, while another features a user account appearing in both web and mobile formats, showing that the same account details were found in different versions of PayPal’s services.”\nThis is likely “a mix of real accounts and test or fake ones, which is often the case with stolen databases.” The dataset includes plenty of reused passwords, which is a wider risk for those using the same email and passwords across multiple accounts.\nThere’s now so much data out there, that separating new from rehashed takes time, as we saw with the infamous 16 billion record new data breach that never was. What is undeniable, though, is that your passwords and email addresses are guaranteed to have leaked or breached or been stolen somewhere, and they will now be for sale.\nEven though PayPal says this data breach is not new, given how rarely users change passwords and how often they reuse them across accounts, it remains a serious threat.\nWhether new or a rehashed existing data breach, the advice is always the same. You should access your PayPal account settings, go to Security, and ensure your password is strong and unique, you enable 2FA using an authenticator app, and that you add a passkey to your account. All that takes under 2 minutes.\nThat way you can read the procession of “massive” data breach headlines without worrying about your devices, your money or your identity. Conversely, if you still have accounts protected by nothing but passwords and SMS codes, you need to act now.\nAs for this breach, HackRead says “if the claims are accurate, this would represent one of the larger PayPal-focused leaks of recent years, with millions of users across Gmail, Yahoo, Hotmail, and country-specific domains implicated.”\nPayPal says that’s not the case."
    },
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2025/08/22/microsofts-free-upgrade-offer-for-millions-of-iphone-users/",
      "text": "Microsoft has something shiny and new for Apple’s iPhone users — but this free upgrade comes with a warning. As the company rushes to AI-everything on Windows PCs, it turns out that smartphones are not immune. Copilot is now taking over.\nMicrosoft confirmed to Windows Latest that the app that was once the simple Office 365 is being upgraded to Microsoft 365 Copilot. But in doing so it loses the ability to edit Word, PowerPoint or Excel files. Instead you get an AI-fueled viewer and Copilot to summarize your files and answer your questions. But not to edit your documents.\nAssuming you still want to edit files, you’ll need to install the standalone Word, Excel and PowerPoint apps, there will no longer be an all-in-one option.\nIf Windows Latest is anything to go by, the there could be a user backlash coming, as one app becomes four and the easy access of the past disappears.\n“It really makes me wonder how Microsoft can consistently come up with stupid ideas. This move turns the Microsoft 365 iPhone app into a Copilot-powered viewer only. You must open Word, Excel, or PowerPoint for even small edits. It also breaks simple flows, and it’s definitely going to confuse people about where to chat and where to edit.”\nThere is another security and privacy issue though. iPhone users will soon find themselves with a heady mix of Siri (via Apple), ChatGPT (via Siri), Gemini (via Google). MetaAI (via WhatsApp) and Copilot (via Microsoft). All on one device. Add in a new AI browser and any other chatbot or AI assistant and we’re out on thin ice.\nI suspect if you ask 100 iPhone users what the privacy and security policies are across this mixed bag of apps, you’ll get 100 different answers. In reality, no one knows. And while Apple invested heavily in its Private Cloud Compute to secure its badged AI queries, none of these other platforms use the same secure enclave.\nAs new AI engines are stitched into our most-used apps, just as with Gemini upgrades to Gmail, AI becomes less of an option and more of a mandatory feature upgrade. Yes, this latest move is another free AI upgrade, but how much is too much?\nThis change starts rolling out to iPhone on September 15. “I wouldn’t be surprised if the same change also rolls out to Android in the next few weeks,” Windows Latest says."
    },
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2025/06/23/google-confirms-most-users-must-upgrade-gmail-and-other-accounts/",
      "text": "Republished on June 23 with an update on the new “record breaking” password leak, and a critical password reset warning for all Google users.\nGoogle has confirmed another atack on Gmail users this week. Yet again, its own infrastructure has been exploited to compromise user accounts. And yet again, it comes with another warning for users to upgrade their accounts — this is now a must.\nEarlier this month, I covered Google’s warning that most of its users still only use basic password security and are wide open to data breaches and attacks. “We want to move beyond passwords altogether,\" Google said, pushing users to replace them.\nPasskeys, it says, \"are phishing-resistant and can log you in simply with the method you use to unlock your device (like your fingerprint or face ID) — no password required.” Put simply, this links account security to hardware security, and means there are no passwords to steal or two-factor authentication (2FA) codes to bypass or intercept.\nWhile that is critical for Gmail users, it’s actually much wider. Google reached out to me after that article, to emphasize that the benefits are more significant for users: Adding a passkey to a Google account protects all the services and accounts that can be accessed by that sign in. Conversely, not doing so leaves all those other accounts at risk.\nEven if most user accounts were secured by passwords and 2FA codes, there would still be a push to passkeys. And while Google, Microsoft and others make 2FA mandatory, the reality is that there’s still a risk that codes can be shared even if they can’t be stolen. That was the crux of the latest Gmail attack, tricking users into sharing codes.\nThe raft of headlines around a Cybernews report into a new 16 billion record data breach should focus minds, even if it’s “not a new data breach,” per Bleeping Computer “the websites involved were not recently compromised to steal these credentials.”\nMashable agrees. “Some commentators were quick to call it the largest password leak in history, and in terms of raw records exposed, that’s mostly, technically true. However, these records did not come from a single breach — or even a new breach. Instead, they came from many smaller ones,\" with “the end result more a ‘greatest hits’ rather than a new, noteworthy hack.” Albeit that doesn’t change the fact the data is out there.\nKaspersky says “the journalists haven’t provided any evidence of existence of this database. Therefore, neither Kaspersky’s experts nor anyone else has managed to analyze it. Therefore, we cannot say whether yours – or anyone else’s – data is in there.”\nCybernews has now responded to the viral media response to its article, including the clarifications. “We didn’t expect the hype when we were writing the article. Data breaches and even the biggest-ever data leaks, unfortunately, have become somewhat mundane, and people don’t seem to care that much.”\nThe team also says “we’re not exaggerating this — if anything, we aren’t doing enough as journalists and users to hold those companies accountable by putting them in the spotlight.” And that’s unarguably right. These are still leaked passwords.\n“If your passwords ever get leaked,” Cybernews says in an update to its article, “the damage can go way beyond just one account. Hackers can use that info to mess with your life in all kinds of ways. In the worst cases, they can even take over your digital identity. Once someone gets into your email, for example, they can reset passwords for other accounts and gain access to pretty much everything.”\nAnd that’s exactly why Google says its users should upgrade the security of their accounts. Protecting Gmail also protects everything your Gmail account opens up.\nBut the onus is on users to change account security. We’re some way off mandatory passkeys, albeit that needs to come just as mandatory 2FA is now more common. That said, Google’s latest survey paints a bleak picture. Although “60% of U.S. consumers say they “use strong, unique passwords,” less than 50% “enable 2FA.”\nThe truth is that the only form of simple 2FA is SMS codes, which are sent quickly without having to exit the app or click or tap. They even autofill and often auto-delete. But SMS is woefully insecure, it’s the worst possible 2FA option. And anything else — authenticator apps, physical keys, even trusted device or app sign-ins — is more painful.\nPasskeys are the opposite. They’re even easier than passwords and SMS 2FA. The code (which you never see) combines your login ID, password and 2FA into a simple sign-in process authenticated by your device security — ideally biometrics. And because there is no code you can see or copy, you can’t share the passkey even if you want to. Even if any of the underlying code is stolen, it only works on your actual device.\nGoogle is right — this is about much more than Gmail, even if those email account attacks generate headline after headline. While there are some misgivings about the dominance and data overreach in big tech using its span of control to sign you into multiple services, even those they don’t own or control, it is more secure.\nAs Kaspersky suggests, “let’s set skepticism aside. Yes, we don’t reliably know what exactly this leak is, or whose data is in it. But that doesn’t mean you should do nothing. The first and best recommendation is to change your passwords,” which is an obvious immediate step. But it doesn’t solve the problem.\n“Use passkeys wherever possible,” Kaspersky also advises. “This is the modern passwordless method of logging into accounts, which is already supported by Google, iCloud, Microsoft, Meta and others.”\nGoogle tells its users that “when you pair the ease and safety of passkeys with your Google Account, you can then use Sign in with Google to log in to your favorite websites and apps — limiting the number of accounts you have to maintain.”\nIn the meantime, Google and Apple users in particular — but others as well — will need to watch for inevitable texts and emails warning that passwords have been stolen and need to be reset, citing news of this record data breach. Those messages will include links to reset passwords or numbers to call account helplines.\nAny such messages are malicious fakes and should be deleted right away. Google will never reach out to its account holders in this way, and any such outreach is an attack. The company has asked me to “please reiterate to your readers that Google will not contact you to reset your password or troubleshoot account issues.”\nThe FBI warns the same: “Legitimate customer, security, or tech support companies will not initiate unsolicited contact with individuals.\"\nIf you receive any form of password reset message, you must access your account in the normal way. If there’s an issue you’ll be directed to a password reset option. Never do this by way of a link, unless you personally requested a password reset using a normal channel and a reset link is then sent to your email or phone number.\nMeanwhile, regardless of the provenance of this latest breach news, Cybernews is right when it says “the collection of datasets shows the scale of the problem — billions and billions of passwords and trillions of records, including very private medical, location, and financial data, spill online every day.”"
    },
    {
      "url": "https://www.hivesystems.com/password-table",
      "text": "Get our 2025 Update to the Hive Systems Password Table.\nSee why millions trust the original viral Password Table - and learn how fast your password could be cracked.\nEvery year, we publish the most widely referenced visual in cybersecurity awareness: the Hive Systems Password Table as seen in Forbes, CNBC, the front page of Reddit, and cited by Krebs on Security. Whether you’re training employees, updating your password policy, or just want to see if your own password would survive the hour, this table shows the reality.\nWhat’s inside\nA visual table showing time-to-crack estimates for passwords of various lengths and character sets\nUpdated for 2025 using modern GPU-based cracking benchmarks\nHigh-resolution formats for printing, training, or sharing\nMultiple languages including French, Italian, Dutch, Spanish.\nNeed another translation? Contact us!\nWho it’s for\nIT and cybersecurity teams running awareness campaigns\nHR and training leaders updating policies or onboarding materials\nIndividuals who want to check the strength of their own password\nMedia, educators, and influencers looking for a compelling visual backed by data\nWhy it matters\nPassword reuse, short character lengths, and weak complexity remain some of the easiest ways attackers gain access to systems. The 2025 Hive Systems Password Table is a proven tool to communicate risk clearly and spark action.\nUse it to change habits, strengthen defenses, and support better security hygiene across your team or organization.\nGet the 2025 Hive Systems Password Table\nEnter your information to download the latest version of the Password Table. It’s one of our most requested resources - for good reason.\nCan I share/use this table?\nYes - and we encourage it!\nWe create and share our research to spread cybersecurity awareness far and wide. You’re free to share or repost the Password Table in its original form, even for publishing purposes.\nPlease remember to credit Hive Systems and link back to www.hivesystems.com/password whenever possible.\n(Note: Use of our materials does not imply endorsement by Hive Systems.)\nSign up once and unlock all our resources.\nBy registering, you agree to the processing of your personal data by Hive Systems as described in the Privacy Policy.\nTrusted by cybersecurity professionals and organizations worldwide, including:\nCalTech\nMoody’s\nHIPAA Journal\nNewsweek\n…and many more!"
    },
    {
      "url": "https://www.tomsguide.com/computing/online-security/over-16-million-paypal-accounts-exposed-on-a-hacking-forum-including-passwords",
      "text": "16 million PayPal accounts exposed on the dark web — emails, passwords and more for sale\nThe hacker has claimed they have PayPal emails, plaintext passwords and more for sale on the dark web\nEditor's Note: PayPal has reached out to Tom's Guide about this stolen data, confirming there wasn't a breach and that the exposed information is related to a security incident from back in 2022. Original story follows below:\nA post on a well-known hacking forum has claimed to have a dataset of millions of PayPal account credentials including login emails and plaintext passwords. As reported by Cybernews, the author of the post claims the stolen data was taken from May 2025 and includes 15.8 million login emails, passwords, associated URLs and variants from accounts worldwide.\nHaving emails and passwords available online for anyone to access puts PayPal users at an obvious risk – even though many users already have multi-factor authentication enabled. The exposure of associated URLs means that attackers can also be pointed at other services that are linked to the information that has been leaked. Likewise, the leak has been set up in such a way as to allow them to easily leverage the exposed data for other malicious behavior, like automated credential stuffing attacks.\nThere are few additional details about the leak at this time. The hackers responsible say that the leak includes thousands of strong and unique password strings but many may be reused which would make the amount of useful data smaller. In fact, the amount that this stolen data is being sold for to other hackers on the dark web would indicate that this is the case. Additionally, researchers have pointed out that if the stolen data was quite recent, much of it would have already been exploited by now.\nPayPal has not yet made a public comment about the forum post claims as of yet, and no one has been able to verify the post’s claims either given the small size of the data sample provided. The hackers may have obtained this data through info-stealing malware, given the way that the stolen data has been structured (URL, login, password).\nInfostealers are often installed after users click on a malicious link or attachment that has malware embedded in it, then it works quietly in the background to funnel stolen information back to the attackers. Some infostealers can hide themselves or delete themselves after they’ve taken passwords, browser data or payment information and they’re available to buy or rent on the dark web for any platform. This is reason enough to have the best antivirus software installed on your devices and kept up to date. It’s also important to follow good security practices, have browser features enabled to protect you online and make full use of the extra included in many antivirus suites like a VPN or firewall.\nHow to stay safe\nPayPal users who are concerned that their data may have been exposed should start by changing their password – and if you made the mistake of using that password anywhere else, change it there too. If you're not already using one of the best password managers to protect your passwords online, start now.\nGet instant access to breaking news, the hottest reviews, great deals and helpful tips.\nIf you suspect your personal information may have been exposed online you should be using of the best identity theft protection services. It can alert you when it finds your information, help you recover money lost to any fraud and assist you in putting the pieces back together if there's any issues related to identity theft.\nIt's always helpful to also have the best antivirus software installed on your devices and kept up to date. It’s also important to follow good security practices, have browser features enabled to protect you online and make full use of the extra included in many antivirus suites like a VPN or firewall.\nFollow Tom's Guide on Google News to get our up-to-date news, how-tos, and reviews in your feeds. Make sure to click the Follow button.\nMore from Tom's Guide\n- I’m a security editor, and this is the antivirus I would buy with my own money\n- FBI issues warning to all smartphone users — a dangerous new scam could be at your door\n- AT&T could pay $7,500 to customers in data breach settlement — how to get yours\nAmber Bouman is the senior security editor at Tom's Guide where she writes about antivirus software, home security, identity theft and more. She has long had an interest in personal security, both online and off, and also has an appreciation for martial arts and edged weapons. With over two decades of experience working in tech journalism, Amber has written for a number of publications including PC World, Maximum PC, Tech Hive, and Engadget covering everything from smartphones to smart breast pumps.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://nordpass.com/most-common-passwords-list/",
      "text": "Top 200\nMost Common Passwords\nIt’s our sixth year—this time, in collaboration with NordStellar—analyzing people’s password habits, and guess what? They're still really bad.\nAnd we're not just talking about personal passwords here. This time, we also put together a list of the most common corporate passwords to see how they compare to those used in everyday life.\nSo, check out all the dishonorable winners on both lists and learn what the latest trends are.\nResearch breakdown\nMethodology\nTogether with NordStellar, we reviewed and analyzed a 2.5TB database extracted from various publicly available sources, including those on the dark web. No personal data was acquired or purchased to conduct this study.\n44 countries\nWe organized the data into different categories to help us analyze it by country of origin. That said, we focused only on the statistical information, so no personal data from internet users was included in this research.\nPersonal and corporate\nWe analyzed passwords stolen by malware or exposed in data leaks. In most cases, they were leaked with email addresses, allowing us to distinguish between corporate and personal credentials by domain name.\nFindings\nMake your passwords tough to break\nDiscover how NordPass can help you create strong passwords on the spot to prevent unauthorized access.\nMost popular corporate passwords\nTake a quick look below and you’ll see that the most common passwords people use at work aren’t all that different from the ones they use in their personal lives. It just goes to show that, at the end of the day, people are people – no matter where they are or what they’re up to, they share the same poor password habits.\nFindings\nInteresting findings\nIs it time to say goodbye to passwords?\nPasskeys are the answer\nBacked by the FIDO Alliance, passkeys are the modern solution to the password problem. At NordPass, we're one of the early adopters of passkey technology, allowing our users to enjoy a secure and smooth passwordless online experience.\nFundamentals of password safety\nCreate strong passwords\nYour password should be at least 20 characters long and include a mix of uppercase and lowercase letters, numbers, and special symbols. Steer clear of easily guessable information like birthdays, names, or common words.\nReview your passwords\nMake sure to regularly check the health of your passwords. Identify any weak, old, or reused ones, and upgrade them to new, complex passwords for a safer online experience.\nNever reuse passwords\nYou should not use the same password for multiple sites or services. If one account is compromised, other accounts could be at risk.\nUse a password manager\nGenerate, store, and manage all your passwords with NordPass to ensure they’re well protected, difficult to crack, and easily available when you need them.\nGet in touch\nIf you’d like more information about the most common password lists or want to set up an interview, contact us at [email protected] and we will get back to you shortly."
    },
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2025/08/21/google-soundly-beaten-by-new-ai-attacks-change-your-browser/",
      "text": "The internet is not a safe space and it’s about to get worse. A new “attack surface is far wider than anything we’ve faced before,” with “hidden risks” that “compromise millions of users simultaneously.” And Google’s defenses are “unfortunately insufficient.”\nThat’s the warning from Guardio, which has set out to understand just how exposed we are by new AI browsing tools and the extent to which they put us all at risk. The results are alarming. It is “a perfect trust chain gone rogue,” the team says, and you need to shore up your personal defenses before it’s too late.\nWhile “AI Browsers promise a future where Agentic AI works for you, fully automating online tasks from shopping to handling emails.” this convenience \"comes with a cost.\" The team set up three tests: instructing AI to find and buy a product online, allowing AI to open a banking sign-in page, and a new spin on the viral ClickFix attack.\nIn each case, the AI agent put its human at risk — and these attacks are not sophisticated. Almost all humans would have detected these threats. And that’s the key message here — AI is too easily fooled, and this attack surface is so new, that more sophisticated adversaries are only just getting started.\n“AI Browsers are no longer a concept,\" Guardio says. \"Microsoft has Copilot built into Edge. OpenAI is experimenting with a sandboxed browser in ‘agent mode’. And Perplexity’s Comet fully embraces the idea of a browser that browses for you. Searching, reading, shopping, clicking. It’s not just assisting us, but increasingly replacing us.\"\nIn the first test, a fake Walmart online store was spun up. “The site had everything: a clean design, realistic product listings, and a checkout flow good enough to pass a casual glance.” Within the AI browser “the page loads without issue and isn’t blocked by Google Safe Browsing, even though GSB is active in this Chromium-based browser.”\nThe AI agent was told to buy an Apple Watch and it did exactly that. “It found the Apple Watch, added it to the cart, and, without asking for confirmation, autofilled our saved address and credit card details.” Seconds later “the purchase was complete.\" There is no watch, of course, just opportunistic scammers “already spending their money.”\nThe test didn’t always succeed, sometimes the AI was not fooled — but it was fooled plenty of times. “And when security depends on chance, it’s not security.”\nIn the second test, the AI browser was directed by a phishing email to a fake Wells Fargo sign-in page. “There was no URL check, no pre-navigation warning, just a direct pass to the attacker’s page. Once the fake Wells Fargo login loaded, the browser treated it as legitimate. It prompted the user to enter credentials, even helping fill in the form.”\nThe third test expanded on the new prompt injection threat, with these hidden behind a typical ClickFix popup, in this case a Captcha, but one with hidden instructions for the AI agent to ignore what was visible to the human and run a different script instead.\n“We don’t try to glitch the model into obedience,” Guardio says. “Instead, we mislead it using techniques borrowed from the human social engineering playbook — appealing directly to its core design goal: to help its human quickly, completely, and without hesitation. We just provide it with the best (manipulating) methods to do so.”\nGuardio warns that “in the AI-vs-AI era, scammers don’t need to trick millions of different people; they only need to break one AI model. Once they succeed, the same exploit can be scaled endlessly. And because they have access to the same models, they can “train” their malicious AI against the victim’s AI until the scam works flawlessly.”\nThis works because “security is often an afterthought or delegated entirely to existing tools like Google Safe Browsing, which is, unfortunately, insufficient.” Even the fake Wells Fargo sign-in page, which was “active in the wild for several days,” was “still unflagged by Google Safe Browsing.”\nThe advice is simple. If you use an AI agent and give it free rein, then change your browser settings to apply Enhanced Protection. If this isn’t available, change your browser. You also need to be careful with browser-based password managers, saved credit card details and autofill. If you allow your AI agent to tap into your security credentials and your financial information, then you’re out on thin ice.\nIn a world where Google controls the internet, directing us and our AI agents to the websites we visit, then Google’s defenses protect the internet. If they don’t work, then the internet doesn’t work. A rethink is required before it’s too late.\nI have reached out to Google for any comments on this new report."
    }
  ],
  "argos_summary": "A hacker is selling a dataset of PayPal usernames and passwords, claiming to have obtained them from a 2022 breach, although PayPal denies any recent breach. The dataset, which includes 15.8 million credentials, is being sold for $750 and may contain many reused passwords, posing a significant risk to users. Security experts recommend that PayPal users change their passwords, enable two-factor authentication, and avoid using weak or common passwords to protect their accounts.",
  "argos_id": "R9MSRWRCG"
}