{
  "url": "https://www.nytimes.com/2025/08/22/nyregion/south-bronx-park-expressway.html",
  "authorsByline": "Ginia Bellafante",
  "articleId": "add5237f60854c679e65381be57d0e36",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/22/multimedia/22Big-05-kclm/22Big-05-kclm-facebookJumbo.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T07:00:18.134000+00:00",
  "addDate": "2025-08-22T07:03:18.189401+00:00",
  "refreshDate": "2025-08-22T07:03:18.189402+00:00",
  "score": 1.0,
  "title": "Robert Moses Tore the South Bronx in Half. Is It About to Happen Again?",
  "description": "It took decades for the Bronx to recover after the Cross Bronx Expressway was built. With years of repairs on the horizon, some residents worry about new trauma.",
  "content": "When Edmundo Martinez was growing up in the South Bronx in the 1980s, his default playground was a patch of land adjacent to the Bronx River, the 23-mile waterway that had passed the previous 140 years morphing into an emblem of urbanization’s darker turns. By the 1840s, the rise of industrialization had made it a dumping ground for grain and paper mills. More than a century later, it had become a repository for old tires, abandoned cars, refrigerators, the detritus of the narcotics trade and the city’s broader decline.\n\n“You hear over and over that it was an open sewer,” Nilka Martell, chairwoman of the Bronx River Alliance, said. “But it really was an open sewer.” Now the river and park are quietly lovely, the result of extensive environmental remediation.\n\nThe land surrounding the river had once belonged to William Waldorf Astor, but by the time Mr. Martinez and his friends were throwing a football around, it was public property, loftily named Sheridan Fields, full of brown grass and concrete. “We had a three-quarter-mile walk to get to a bad park along an expressway,” he told me. Letting children play there made parents nervous, but where else were they to go?",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Martinez",
      "weight": 0.07697741
    },
    {
      "name": "William Waldorf Astor",
      "weight": 0.07665812
    },
    {
      "name": "old tires",
      "weight": 0.07160115
    },
    {
      "name": "Sheridan Fields",
      "weight": 0.071425535
    },
    {
      "name": "abandoned cars",
      "weight": 0.070311315
    },
    {
      "name": "Edmundo Martinez",
      "weight": 0.070196144
    },
    {
      "name": "extensive environmental remediation",
      "weight": 0.06964755
    },
    {
      "name": "public property",
      "weight": 0.069498405
    },
    {
      "name": "Nilka Martell",
      "weight": 0.066269025
    },
    {
      "name": "brown grass",
      "weight": 0.06491915
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.6640625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Historical Sites & Buildings",
      "score": 0.436767578125
    },
    {
      "name": "/News/Local News",
      "score": 0.40087890625
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.347412109375
    }
  ],
  "sentiment": {
    "positive": 0.104197286,
    "negative": 0.53880435,
    "neutral": 0.3569984
  },
  "summary": "The South Bronx has been transformed into an open sewer for over a century, with the land once owned by William Waldorf Astor and the city's decline. The transformation of this area is the result of extensive environmental remediation. The landscape is now a beautiful landscape and landscape.",
  "shortSummary": "The South Bronx was transformed into a disused industrial park by Robert Moses, leading to widespread urban decline, prompting concerns about the long-term health of the area.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e526dafc4ff94d319f0a9027001ac307",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Edmundo Martinez grew up in the South Bronx during the 1980s, where he played near the Bronx River, a waterway that had suffered from severe pollution and neglect due to industrialization and urban decline. Once described as an 'open sewer,' the river and its surroundings have undergone significant environmental remediation, transforming into a more pleasant area. The land, previously owned by William Waldorf Astor, became public property, but during Martinez's childhood, it was a neglected park that posed safety concerns for children.",
  "argos_id": "RFNR95ALD"
}