{
  "url": "https://finance.yahoo.com/news/why-wall-street-bearish-krispy-121100270.html",
  "authorsByline": "Anders Bylund, The Motley Fool",
  "articleId": "bd02c0d8f46a42fabeca80bc027441b7",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/k1CfRxXnAW9wWDrgjGj9Gw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/motleyfool.com/7ed54d5ebb18154b9f49abf845422878",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T12:11:00+00:00",
  "addDate": "2025-08-22T12:40:51.191887+00:00",
  "refreshDate": "2025-08-22T12:40:51.191889+00:00",
  "score": 1.0,
  "title": "Why Is Wall Street So Bearish on Krispy Kreme? There's 1 Key Reason.",
  "description": "What looked like a game-changing partnership in 2022 turned out to be a costly mistake in 2025.",
  "content": "• Krispy Kreme's stock is down 73% from its annual highs, now trading at a bargain-bin valuation.\n• A promising McDonald's delivery deal turned out to be much too expensive on a nationwide scale.\n• 10 stocks we like better than Krispy Kreme ›\n\nDoughnut vendor Krispy Kreme (NASDAQ: DNUT) used to be hot. Now it's a cautionary tale. As of Aug. 20, the stock has dropped 73% from its yearly peak. It trades at 0.4 times trailing sales and 0.9 times the company's book value.\n\nThese ratios are typical of companies in deep financial trouble. But how did Krispy Kreme get to this desperate situation?\n\nIt turns out that a potentially awesome partnership backfired. Even the final act of shutting down that deal left Krispy Kreme scrambling to fight the massive infrastructure costs that came along with it. At this point, Krispy Kreme investors might wish the company had never agreed to that costly McDonald's (NYSE: MCD) contract.\n\nWhat happened to the McDonald's deal?\n\nKrispy Kreme started shipping doughnuts to McDonald's restaurants in October, 2022. The limited test run in Louisville, Kentucky, saw decent results, inspiring a larger-scale implementation in 2024.\n\nBut the nationwide rollout was never completed, as Krispy Kreme pulled the plug on this project in the second quarter of 2025. Management noted that the doughnut delivery program was too expensive on a networkwide scale. Furthermore, it will take several quarters to unwind the attempts to build an effective production and delivery network in support of the McDonald's deal.\n\nAs a result, Krispy Kreme is reviewing its entire logistics setup in search of more cost-effective solutions. The company is ending hundreds of underperforming delivery contracts, though more than half of the shuttered deals will be replaced with higher-volume routes by the end of 2025.\n\nThat may sound like an empty promise, but the partners for these new routes include giant household names such as Walmart, Costco, and Kroger. As long as Krispy Kreme can focus these operations on the most profitable delivery routes, the company might be poised for a long-term turnaround.\n\nBut that's a pretty speculative forecast. For now, Krispy Kreme investors are simply disappointed in the failed McDonald's experiment and its financial aftermath.\n\nShould you buy stock in Krispy Kreme right now?\n\nBefore you buy stock in Krispy Kreme, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Krispy Kreme wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.",
  "medium": "Article",
  "links": [
    "https://www.fool.com/investing/2022/10/19/krispy-kreme-donuts-at-your-local-mcdonalds/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=937257a3-6261-4a37-bffa-c7745b7145a2",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=b7396819-2ee4-4840-b8ec-88ae6ccdfa59&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001138%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18006&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=937257a3-6261-4a37-bffa-c7745b7145a2",
    "https://www.fool.com/terms/p/price-to-book-ratio/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=937257a3-6261-4a37-bffa-c7745b7145a2",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=3eb12033-bc08-4b6f-ad59-c23cf2562b1f&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670"
  ],
  "labels": [
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Krispy Kreme",
      "weight": 0.13565908
    },
    {
      "name": "Krispy Kreme investors",
      "weight": 0.13170522
    },
    {
      "name": "Doughnut vendor Krispy Kreme",
      "weight": 0.124316156
    },
    {
      "name": "Krispy Kremes stock",
      "weight": 0.081189774
    },
    {
      "name": "underperforming delivery contracts",
      "weight": 0.08004367
    },
    {
      "name": "Krispy Kremes",
      "weight": 0.071944095
    },
    {
      "name": "companies",
      "weight": 0.0717544
    },
    {
      "name": "McDonald",
      "weight": 0.07089234
    },
    {
      "name": "stock",
      "weight": 0.06730784
    },
    {
      "name": "giant household names",
      "weight": 0.058943547
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98291015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94287109375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.8857421875
    }
  ],
  "sentiment": {
    "positive": 0.026613818,
    "negative": 0.8600723,
    "neutral": 0.11331382
  },
  "summary": "Krispy Kreme's stock has dropped 73% from its annual peak and trading at a bargain-bin valuation of 0.4 times trailing sales and 0.9 times the company's book value. The company's failed McDonald's delivery program was too expensive on a networkwide scale and it will take several quarters to unwind the attempts to build an effective production and delivery network in support of the McDonald's deal. As a result, Krispy Kremet is reviewing its logistics setup in search of more cost-effective solutions and is replacing hundreds of underperforming delivery contracts with higher-volume routes. The Motley Fool Stock Advisor has identified the 10 best stocks for investors to buy now.",
  "shortSummary": "Krispy Kreme's stock has plummeted 73% due to a costly McDonald's delivery deal, resulting in a significant turnaround plan and ongoing operational changes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "af76d2da61c84dc8b4ff0752c8a84a61",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/terms/p/price-to-book-ratio/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=937257a3-6261-4a37-bffa-c7745b7145a2",
      "text": "You can calculate the price-to-book, or P/B, ratio by dividing a company's stock price by its book value per share, which is defined as its total assets minus any liabilities. This can be useful when you're conducting a thorough analysis of a stock.\nWhy use the price-to-book ratio?\nWhy use the price-to-book ratio?\nIn a nutshell, a lower price-to-book ratio could indicate that a stock is undervalued. When you're comparing two stocks with similar growth and profitability, P/B can be useful for determining which is the best value at a given moment.\nThe lower a company's price-to-book ratio is, the better a value it generally is. This can be especially true if a stock's book value is less than one, meaning that it trades for less than the value of its assets. Buying a company's stock for less than book value can create a \"margin of safety\" for value investors. However, a very low P/B ratio can also be a sign of trouble at a company, so it should be used as part of a thorough stock analysis.\nLike the price-to-sales ratio, the price-to-book ratio can be a particularly useful metric for a company with inconsistent or negative earnings; other common metrics like the price-to-earnings ratio aren't as meaningful in these situations. For example, many bank stocks have extremely inconsistent earnings, so the P/B ratio can give a clearer picture of the relative value of these companies.\nHow to calculate price-to-book value\nHow to calculate price-to-book value\nBook value is equal to a company's current market value divided by the \"book value\" of all of its shares. To determine a company's book value, you'll need to look at its balance sheet. Also known as shareholder's equity or stockholder's equity, this amount is equal to the company's assets minus its liabilities.\nExample\nLet's calculate the P/B ratio for Company X, which has:\n- Total assets of $3 billion\n- Total liabilities of $2 billion\n- 100 million outstanding shares\n- A current share price of $15\nWe start by calculating Company X's book value, by subtracting $2 billion (liabilities) from $3 billion (assets) to get a book value of $1 billion. Dividing that $1 billion by the 100 million outstanding shares gives us a per-share book value of $10. Finally, we divide the current share price of $15 by that $10 to reach a price-to-book multiple of 1.5.\nBook Value\nA word of caution\nA word of caution\nPrice to book is useful only for evaluating certain types of businesses. If most of a business's assets are intangible -- as is the case with many technology companies -- its price to book may be unhelpfully high. Software giant Microsoft, for example, trades for more than 10 times its book value. On the other hand, price to book can be useful for capital-intensive businesses like banks.\nA P/B ratio analysis doesn't tell us much all by itself. To get a more complete picture of a company's valuation, you should use it in combination with profitability metrics such as return on equity (ROE). For example, for the last five years, Bank of America's price-to-book multiple has been lower than JP Morgan Chase's. However, that doesn't necessarily mean that Bank of America is \"cheaper.\" In fact, JP Morgan's ROE has been consistently higher than Bank of America's.\nWhile price to book can be a useful metric to have in your toolbox, it's only part of the puzzle when it comes to evaluating which stocks are undervalued."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=3eb12033-bc08-4b6f-ad59-c23cf2562b1f&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
      "text": "5 Years From Now, You'll Probably Wish You Grabbed These Stocks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to find out how to get access to these stocks.\nReturns are updated during market hours. The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=b7396819-2ee4-4840-b8ec-88ae6ccdfa59&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001138%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18006&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=937257a3-6261-4a37-bffa-c7745b7145a2",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/investing/2022/10/19/krispy-kreme-donuts-at-your-local-mcdonalds/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=937257a3-6261-4a37-bffa-c7745b7145a2",
      "text": "Fast-food giant McDonald's (MCD 0.02%) is trying a new idea to overcome the sluggish sales and falling profits of recent quarters. In a partnership with Krispy Kreme (DNUT -1.00%), Mickey D's will resell a small selection of freshly baked donuts in a handful of stores.\nKrispy Kreme donuts at your local McDonald's\nFrom Wednesday, Oct. 26, nine McDonald's locations in greater Louisville, Kentucky will have three popular flavors delivered from local Krispy Kreme bakeries.\nThe test involves original glazed, chocolate iced, and raspberry-filled donuts, sold individually and in six-packs. The baked goods will be delivered daily from nearby Krispy Kreme bakeries, some of which are stand-alone facilities and others located inside the brand's donut shops.\nThe normal McDonald's menu in America doesn't list any donuts these days. For now, cinnamon rolls and apple fritters are as close as you'll get to a donut experience under the Golden Arches.\nThe company has occasionally offered its own donut-style pastries in the past, though. Glazed pull-apart donuts have made the rounds more than once, and I grew up with access to chocolate-glazed McDonuts (yes, that's the actual product name) at Swedish restaurants in the 1990s. Those are still a thing in 2022, as McDonald's continues to mold local menus to local tastes around the world.\nNice idea, but it's all in the delivery\nBut distributing Krispy Kreme donuts this way is a new idea, and McDonald's is excited to see how this menu expansion might work on American soil. I'm intrigued by the details of this market experiment, which seems to strike an effective balance between the needs of each partner.\nFirst, the chosen test market in Louisville sits right between McDonald's and Krispy Kreme's headquarters in Illinois and North Carolina, respectively. The exact location isn't terribly important, but it's almost as if the companies are meeting in the middle, as explicitly as possible.\nGreater Louisville has about 30 McDonald's locations and the test incorporates about one-third of them. This limited scope gives McDonald's a natural control group of donut-less locations serving roughly the same target market. It's a win for the scientific method.\nAs the smaller partner, Krispy Kreme only has four storefronts in Louisville. However, that number doesn't tell the whole story. The company already distributes its goods to lots of third-party stores. The delivered fresh daily (DFD) program reached more than 5,500 domestic so-called DFD doors in the second quarter, up from 5,200 in the previous report and 5,070 a year earlier.\nNine more delivery points to McDonald's locations won't stress this battle-tested system, but it's a different story if this experiment uncovers a profitable partnership opportunity. A nationwide rollout could add 13,000 DFD doors overnight, more than tripling Krispy Kreme's market reach in a hurry. Hooking up with a much larger distribution partner like McDonald's on a massive scale would be a real stress test, and also a big win for Krispy Kreme.\nWill this test make a difference?\nInvestors should let McDonald's and Krispy Kreme run the test and count those chickens when they're properly hatched, of course. I imagine that the launch will bring long lines to participating McDonald's locations at first, but the menu expansion will be successful only if that increased traffic hangs around for a long time. The only way to really know how sticky this boost might be among fickle consumer tastes is to run the trial.\nThis partnership could be a game-changer for Krispy Kreme if all goes well. However, the company is already posting healthy top-line growth and improving bottom-line results. McDonald's, on the other hand, is experiencing revenue shrinkage and falling earnings for the first time in two years.\nSo this experiment is important to both partners, but for very different reasons. McDonald's should be more interested in a quick fix to recent weaknesses here. At the other side of the table, Krispy Kreme is kicking the tires of a potentially massive business booster, but this company isn't desperate for an instant win."
    }
  ],
  "argos_summary": "Krispy Kreme's stock has plummeted 73% from its annual highs, largely due to the failure of a costly partnership with McDonald's that was intended to expand doughnut delivery. The company has since pulled the plug on the nationwide rollout of this program, citing high infrastructure costs, and is now reevaluating its logistics to focus on more profitable delivery routes. While there is potential for a turnaround with new partnerships, investor sentiment remains cautious following the disappointing McDonald's experiment.",
  "argos_id": "RNFI7J8QE"
}