{
  "url": "https://www.investing.com/news/analyst-ratings/artivion-stock-price-target-raised-to-50-from-45-at-needham-93CH-4206677",
  "authorsByline": "",
  "articleId": "c5c275aeb055429db5d2fb1ec1eed789",
  "source": {
    "domain": "investing.com",
    "location": {
      "country": "il",
      "county": "Tel Aviv Subdistrict",
      "city": "Tel Aviv-Yafo",
      "coordinates": {
        "lat": 32.0852997,
        "lon": 34.7818064
      }
    }
  },
  "imageUrl": "https://i-invdn-com.investing.com/news/World_News_10_800x533_L_1420026292.jpg",
  "country": "tr",
  "language": "en",
  "pubDate": "2025-08-22T11:47:21+00:00",
  "addDate": "2025-08-22T12:16:56.664824+00:00",
  "refreshDate": "2025-08-22T12:16:56.664827+00:00",
  "score": 1.0,
  "title": "Artivion stock price target raised to $50 from $45 at Needham By Investing",
  "description": "Artivion stock price target raised to $50 from $45 at Needham",
  "content": "Investing.com - Needham has raised its price target on Artivion Inc. (NYSE: ) to $50.00 from $45.00 while maintaining a Buy rating on the stock. The company’s shares have shown remarkable strength, delivering a 69% return over the past year and currently trading near its 52-week high of $43.97. According to InvestingPro data, analysts maintain a bullish consensus on AORT, with multiple upward earnings revisions for the upcoming period.\n\nThe price target increase follows positive developments with Endospan’s NEXUS stent graft system, which Artivion has a distribution agreement for since 2019. The agreement includes an option for Artivion to purchase Endospan, a private company.\n\nEndospan’s NEXUS, an endovascular aortic arch repair system currently available outside the United States, recently showed positive 30-day results in its TRIOMPHE pivotal trial, which is intended to support FDA approval.\n\nEndospan plans to submit its PMA to the FDA after 12-month data from the trial becomes available, putting the product on track for potential FDA approval in late 2026.\n\nNeedham expects that if NEXUS receives FDA approval and Artivion acquires Endospan, the U.S. launch would be accretive to Artivion’s revenue growth, which factored into the firm’s decision to raise its price target.\n\nIn other recent news, Artivion Inc. reported strong second-quarter performance with revenues reaching $113 million, surpassing consensus estimates of $108 million. This represents a significant year-over-year growth of approximately 14% to 15.3%, driven by the successful launch of its AMDS stent and stent-graft products in the United States. The company also reported adjusted EBITDA of $24.8 million, exceeding both Canaccord’s projection and the consensus estimate. Following these results, multiple analyst firms have adjusted their price targets for Artivion. Stifel raised its price target to $40, while Needham increased it to $45, and Canaccord adjusted it to $41, all maintaining a Buy rating. Oppenheimer also revised its target to $40, maintaining an Outperform rating. These adjustments reflect the analysts’ positive outlook on Artivion’s growth trajectory. Additionally, Artivion has increased its 2025 revenue and EBITDA guidance, further reinforcing investor confidence in the company’s future performance.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.",
  "medium": "Article",
  "links": [
    "https://www.investing.com/pro/AORT",
    "https://www.investing.com/equities/cryolife-inc"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Artivion stock price target",
      "weight": 0.11409282
    },
    {
      "name": "Artivion Inc.",
      "weight": 0.09845495
    },
    {
      "name": "Artivion",
      "weight": 0.09255137
    },
    {
      "name": "potential FDA approval",
      "weight": 0.078684695
    },
    {
      "name": "multiple analyst firms",
      "weight": 0.07834624
    },
    {
      "name": "FDA approval",
      "weight": 0.07791813
    },
    {
      "name": "multiple upward earnings revisions",
      "weight": 0.06844764
    },
    {
      "name": "Endospan",
      "weight": 0.067327134
    },
    {
      "name": "positive developments",
      "weight": 0.06576311
    },
    {
      "name": "FDA",
      "weight": 0.06423771
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.970703125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.794921875
    }
  ],
  "sentiment": {
    "positive": 0.8400512,
    "negative": 0.033737805,
    "neutral": 0.12621099
  },
  "summary": "Needham has raised its price target on Artivion Inc. (NYSE: ) to $50.00 from $45.00, following positive developments with Endospan's NEXUS stent graft system. The company's shares have risen by 69% over the past year and is currently trading near its 52-week high of $43.97. Needham expects that if NEXIS receives FDA approval and Artiviopisis acquires Endovations, the U.S. launch of NEXUK would be positively accretive to the company's revenue growth. Other recent news includes strong Q2 revenues reaching $113 million, surpassing consensus estimates of $108 million, and increased EBITDA guidance.",
  "shortSummary": "Needham has raised Artivion's price to $50.00 amid positive developments with NEXUS and increased earnings forecasts for AORT.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ce46e955851a4abfbda44ea8d950f35e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Needham has raised its price target on Artivion Inc. to $50.00 from $45.00, maintaining a Buy rating, as the company has shown a 69% return over the past year and is trading near its 52-week high. The increase follows positive developments with Endospan’s NEXUS stent graft system, which is on track for potential FDA approval by late 2026. Artivion's strong second-quarter performance, with revenues surpassing estimates and significant year-over-year growth, has led multiple analysts to adjust their price targets upward, reflecting a positive outlook on the company's growth trajectory.",
  "argos_id": "T34B7L67Y"
}