{
  "url": "https://finance.yahoo.com/news/ariel-small-cap-value-added-120839155.html",
  "authorsByline": "Soumya Eswaran",
  "articleId": "92eb9ae937e7479ab0da562aa948beed",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/insidermonkey.com/5e2b4e3740ee108b83be58d8e761e4f7",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T12:08:39+00:00",
  "addDate": "2025-08-22T12:13:33.616202+00:00",
  "refreshDate": "2025-08-22T12:13:33.616204+00:00",
  "score": 1.0,
  "title": "Ariel Small Cap Value Added Zebra Technologies (ZBRA) to Its Portfolio in Q2",
  "description": "Ariel Investments, an investment management company, released its “Ariel Small Cap Value Strategy” second-quarter 2025 investor letter. A copy of the letter can be downloaded here. The second quarter witnessed extreme volatility. Stocks declined sharply after the “Liberation Day” tariff announcement and staged a remarkable recovery as the administration initiated a 90-day pause. In the […]",
  "content": "Ariel Investments, an investment management company, released its “Ariel Small Cap Value Strategy” second-quarter 2025 investor letter. A copy of the letter can be downloaded here. The second quarter witnessed extreme volatility. Stocks declined sharply after the “Liberation Day” tariff announcement and staged a remarkable recovery as the administration initiated a 90-day pause. In the quarter, Ariel Small Cap Value Tax-Exempt Composite appreciated +7.72% gross of fees (+7.58% net of fees) against this backdrop, compared to +4.97% and +8.50% returns of the Russell 2000 Value Index and the Russell 2000 Index, respectively. In addition, you can check the fund’s top 5 holdings to determine its best picks for 2025.\n\nIn its second-quarter 2025 investor letter, the Ariel Small Cap Value Strategy highlighted stocks such as Zebra Technologies Corporation (NASDAQ:ZBRA). Zebra Technologies Corporation (NASDAQ:ZBRA) offers enterprise asset intelligence solutions in the automatic identification and data capture solutions industry. The one-month return of Zebra Technologies Corporation (NASDAQ:ZBRA) was -7.47%, and its shares lost 9.83% of their value over the last 52 weeks. On August 21, 2025, Zebra Technologies Corporation (NASDAQ:ZBRA) stock closed at $308.51 per share, with a market capitalization of $15.686 billion.\n\nAriel Small Cap Value Strategy stated the following regarding Zebra Technologies Corporation (NASDAQ:ZBRA) in its second quarter 2025 investor letter:\n\nAlso in the quarter, we bought shares of bar-code manufacturer, Zebra Technologies Corporation (NASDAQ:ZBRA), which is held in other Ariel portfolios. ZBRA’s brand strength, distribution network and commitment to innovation enable it to take share, earn industry-leading profitability and penetrate new markets. A recent pullback in the stock price provided an attractive entry point. Shares have come under pressure due to investor concerns around supply chain disruptions and tariffs. At current the valuation, we think the market is underappreciating ZBRA’s alignment with the global effort to improve supply chain efficiency. At the same time, the company is leveraging the wide moat in its core business to expand into faster growing markets including warehouse robotics and machine vision. Meanwhile ZBRA continues to deliver prodigious free cash flow which we believe will continue to be deployed towards both growth and share repurchases.\n\nZebra Technologies Corporation (NASDAQ:ZBRA) is not on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 53 hedge fund portfolios held Zebra Technologies Corporation (NASDAQ:ZBRA) at the end of the second quarter, which was 48 in the previous quarter. For the second quarter, Zebra Technologies Corporation (NASDAQ:ZBRA) reported sales of $1.3 billion, a 6% increase compared to the prior year. While we acknowledge the potential of Zebra Technologies Corporation (NASDAQ:ZBRA) as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.",
  "medium": "Article",
  "links": [
    "https://www.insidermonkey.com/blog/zebra-technologies-corporation-nasdaqzbra-q2-2025-earnings-call-transcript-1584638/",
    "https://finance.yahoo.com/quote/ZBRA",
    "https://www.insidermonkey.com/blog/30-most-popular-stocks-among-hedge-funds-2024-q3-1415561/",
    "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
    "https://www.insidermonkey.com/hedge-fund/ariel-investments/34/",
    "https://www.insidermonkey.com/blog/ariel-investments-small-cap-value-strategys-q2-2025-investor-letter-1595481/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Zebra Technologies Corporation",
      "weight": 0.11347708
    },
    {
      "name": "Zebra Technologies",
      "weight": 0.10137829
    },
    {
      "name": "ZBRA",
      "weight": 0.0915894
    },
    {
      "name": "Ariel Small Cap Value Strategy",
      "weight": 0.08965376
    },
    {
      "name": "Ariel Small Cap Value",
      "weight": 0.08935208
    },
    {
      "name": "certain AI stocks",
      "weight": 0.08243691
    },
    {
      "name": "NASDAQ",
      "weight": 0.076693036
    },
    {
      "name": "Stocks",
      "weight": 0.07615081
    },
    {
      "name": "stocks",
      "weight": 0.07615081
    },
    {
      "name": "share repurchases",
      "weight": 0.06503489
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9970703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.990234375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.97412109375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.85400390625
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.65869140625
    }
  ],
  "sentiment": {
    "positive": 0.2077417,
    "negative": 0.49925974,
    "neutral": 0.29299852
  },
  "summary": "Ariel Investments, an investment management company, has added shares of Zebra Technologies Corporation (ZBRA) to its portfolio in its second-quarter 2025 investor letter. The company highlighted the company's strengths and commitment to innovation, including enterprise asset intelligence solutions in the automatic identification and data capture solutions industry. Despite this volatility, Ariel Small Cap Value Tax-Exempt Composite appreciated +7.72% gross of fees and 7.58% net of fees in the same period, compared to the Russell 2000 Value Index and the Russell 200 Index. ZBRA's shares lost 9.83% of their value over the last 52 weeks. However, the company reported sales of $1.3 billion in Q2, a 6% increase compared to Q1 the previous year.",
  "shortSummary": "Ariel Investments added Zebra Technologies Corporation to its portfolio in Q2, highlighting its potential for significant upside potential due to market volatility and potential for AI stocks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "dd53481d1a4043e2b013f3f80ba5df41",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.insidermonkey.com/hedge-fund/ariel-investments/34/",
      "text": "Established in 1983 by John W. Rogers, Jr., who currently serves as the chairman and Co-CEO, Ariel Investments has been led by President Mellody Hobson since May 2000. In July 2019, Hobson assumed the role of Co-CEO alongside Rogers. The company, comprised of 107 employees, boasts an ownership structure where both the workforce and the board collectively own 95% of the firm. As of January 31, 2021, Ariel manages $15 billion in assets. Positioning itself as a minority-owned investment company, Ariel proudly asserts its status as the largest minority-owned investment firm in the industry.\nJohn W. Rogers Jr. holds the positions of chairman, chief executive officer, and chief investment officer at Ariel Investments, a firm he established in 1983 in Chicago. The company provides no-load mutual funds for individual investors and manages separately managed accounts for institutions and high-net-worth individuals. Central to the firm's approach is a disciplined strategy rooted in patience, a principle that continues to guide its operations. John's fascination with investing began at the age of 12 when his father opted for stocks instead of traditional toys for birthdays and Christmas. This interest deepened during his time at Princeton, where, in addition to tracking stocks, he played basketball under the mentorship of Hall of Fame coach Pete Carril. Serving as captain of Princeton's varsity basketball team during his senior year, John absorbed valuable lessons in teamwork that significantly influenced his perspectives on entrepreneurship and investment. On the other hand, in her role as Co-CEO, Mellody Hobson oversees management, strategic planning, and growth across all facets of Ariel Investments, excluding research and portfolio management. Additionally, she assumes the position of Chairman of the Board for Ariel's publicly traded mutual funds. Before stepping into the Co-CEO role, Mellody dedicated nearly two decades to serving as Ariel's President, having been with the firm since earning her AB from Princeton University’s School of International Relations and Public Policy. Mellody holds the position of Chairman of the Board at Starbucks Corporation and serves as a director of JPMorgan Chase. She previously held the Chairman role at DreamWorks Animation, contributing to the company’s successful sale. Mellody has been a longstanding board member of the Estée Lauder Companies and actively engages in various philanthropic initiatives.\nHighlighting a selection of its managed funds, Ariel showcases impressive returns since inception. The Small Cap Value Fund boasts an 11.19% return, while the Small Cap Value Concentrated Fund demonstrates a remarkable 15.24% return. Additionally, the Ariel Small/Mid Cap Value Fund yields an 8.22% return, the Ariel Mid Cap Value Fund secures a solid 10.07% return, and the Ariel Focused Value Fund delivers a commendable 6.13% return over the same period."
    },
    {
      "url": "https://finance.yahoo.com/quote/ZBRA",
      "text": "Zebra Technologies Corporation (ZBRA)\n- Previous Close\n304.74 - Open\n304.27 - Bid 307.72 x 200\n- Ask 309.43 x 100\n- Day's Range\n302.71 - 309.98 - 52 Week Range\n205.73 - 427.76 - Volume\n365,349 - Avg. Volume\n519,732 - Market Cap (intraday)\n15.686B - Beta (5Y Monthly) 1.75\n- PE Ratio (TTM)\n29.16 - EPS (TTM)\n10.58 - Earnings Date Oct 28, 2025\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n364.67\nZebra Technologies Corporation, together with its subsidiaries, provides enterprise asset intelligence solutions in the automatic identification and data capture solutions industry worldwide. It operates in two segments, Asset Intelligence & Tracking, and Enterprise Visibility & Mobility. The company designs, manufactures, and sells printers that produce labels, wristbands, tickets, receipts, and plastic cards; dye-sublimination thermal card printers that produce images, which are used for personal identification, access control, and financial transactions; radio frequency identification device (RFID) printers that encode data into passive RFID transponders; accessories and options for printers, including carrying cases, vehicle mounts, and battery chargers; stock and customized thermal labels, wristbands, receipts, ribbons, plastic cards, and RFID tags for printers; and electronic sensors and temperature-monitoring labels. It also provides various maintenance, technical support, repair, and managed and professional services; fixed readers, RFID enabled mobile computers, and RFID sleds; tags, sensors, exciters, middleware software, and application software; and physical inventory management solutions, and rugged and enterprise-grade mobile computing products and accessories, as well as real-time location systems and services. In addition, the company offers barcode scanners and imagers, RFID readers, industrial machine vision cameras, and fixed industrial scanners; workforce management, workflow execution and task management, and prescriptive analytics, as well as communications and collaboration solutions; and cloud-based software subscriptions, retail, and robotics automation solutions. The company serves retail and e-commerce, manufacturing, transportation and logistics, healthcare, public sector, and other industries through direct sales force and network of channel partners. The company was founded in 1969 and is headquartered in Lincolnshire, Illinois.\nwww.zebra.com9,900\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: ZBRA\nView MorePerformance Overview: ZBRA\nTrailing total returns as of 8/21/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: ZBRA\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: ZBRA\nView MoreValuation Measures\nMarket Cap\n15.69B\nEnterprise Value\n17.17B\nTrailing P/E\n29.13\nForward P/E\n20.12\nPEG Ratio (5yr expected)\n1.20\nPrice/Sales (ttm)\n3.08\nPrice/Book (mrq)\n4.34\nEnterprise Value/Revenue\n3.31\nEnterprise Value/EBITDA\n17.72\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n10.56%\nReturn on Assets (ttm)\n6.55%\nReturn on Equity (ttm)\n15.87%\nRevenue (ttm)\n5.19B\nNet Income Avi to Common (ttm)\n548M\nDiluted EPS (ttm)\n10.58\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n872M\nTotal Debt/Equity (mrq)\n65.25%\nLevered Free Cash Flow (ttm)\n885.37M\nResearch Analysis: ZBRA\nView MoreResearch Reports: ZBRA\nView MoreLowering target price to $328.00\nZEBRA TECHNOLOGIES CORP-CL A has an Investment Rating of HOLD; a target price of $328.000000; an Industry Subrating of Medium; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium.\nRatingPrice TargetRaising target price to $345.00\nZEBRA TECHNOLOGIES CORP-CL A has an Investment Rating of HOLD; a target price of $345.000000; an Industry Subrating of Medium; a Management Subrating of Medium; a Safety Subrating of Medium; a Financial Strength Subrating of Medium; a Growth Subrating of Medium; and a Value Subrating of Medium.\nRatingPrice TargetZebra Earnings: Market Selloff Creates Opportunity After Good Quarter and Prudent Elo Acquisition\nZebra Technologies is a leading provider of automatic identification and data capture technology to enterprises. Its solutions include barcode printers and scanners, mobile computers, and workflow optimization software. The firm primarily serves the retail, transportation logistics, manufacturing, and healthcare markets, designing custom solutions to improve efficiency at its customers.\nRatingPrice TargetMorningstar | A Weekly Summary of Stock Ideas and Developments in the Companies We Cover\nIn this edition, a deep dive into China real estate; Eli Lilly's earnings earn some wariness; Apple tries to keep tariffs at bay another day; and Zebra Technologies, The Trade Desk, and Swire Pacific."
    },
    {
      "url": "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
      "text": "There’s a once-in-a-generation convergence happening right now. Three unstoppable megatrends are reshaping the global economy—and one under-the-radar stock is perfectly positioned to profit from all of them.\nThis isn’t a flashy AI stock or a speculative play. It’s the infrastructure backbone of the future—and it’s trading at a bargain.\nLet me explain.\nTrend #1: The AI Arms Race\nArtificial intelligence is the most transformational force since the steam engine—and it’s just getting started.\nBut behind every ChatGPT prompt and robotic breakthrough is something few investors are thinking about:\nPower. Lots of it.\nWall Street is pouring hundreds of billions into artificial intelligence—training smarter chatbots, automating industries, and building the digital future. But there’s one urgent question few are asking:\nWhere will all of that energy come from?\nEven Sam Altman, the founder of OpenAI, issued a stark warning: “AI depends on an energy breakthrough.”\nElon Musk was even more blunt:\n“AI will run out of electricity by next year.”\nAs the world chases faster, smarter machines, a hidden crisis is emerging behind the scenes. Power grids are strained. Electricity prices are rising. Utilities are scrambling to expand capacity.\nAnd that’s where the real opportunity lies…\nOne little-known company—almost entirely overlooked by most AI investors—could be the ultimate backdoor play. It’s not a chipmaker. It’s not a cloud platform. But it might be the most important AI stock in the US.\nAs demand from AI data centers explodes, this company is gearing up to profit from the most valuable commodity in the digital age: electricity.\nThe “Toll Booth” Operator of the AI Energy Boom\n- It owns critical nuclear energy infrastructure assets, positioning it at the heart of America’s next-generation power strategy.\n- It’s one of the only global companies capable of executing large-scale, complex EPC (engineering, procurement, and construction) projects across oil, gas, renewable fuels, and industrial infrastructure.\n- It plays a pivotal role in U.S. LNG exportation—a sector about to explode under President Trump’s renewed “America First” energy doctrine.\nWhile investors pile into chip stocks with sky-high valuations, this company is quietly supplying the electricity that makes AI possible. No matter who wins the AI race—Microsoft, Google, Amazon, Meta—this company gets paid.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #2: Trump’s Tariff Strategy Could Trigger a U.S. LNG Export Boom\nDonald Trump has made one thing clear: he’s coming back to renegotiate global trade—on America’s terms.\nHis top priority? Narrowing the U.S. trade deficit. And this time, he’s not just targeting Chinese imports—he’s taking aim at every trade partner who’s been running a surplus at America’s expense.\nTrump’s team is already working behind the scenes to revise trade deals with Japan, Europe, and South Korea. And while the media focuses on tariffs and quotas, savvy investors are watching where the real money will flow:\nInto American LNG.\nHere’s why: The U.S. is sitting on a massive glut of natural gas—thanks to the shale boom. Domestic prices are near historic lows, while Europe and parts of Asia are paying 3–5x more for the same fuel. It’s the perfect imbalance.\nAnd Trump knows it.\nThat’s why he’s pressuring our trading partners to buy American energy as part of future trade agreements. It’s a simple way to cut the trade deficit without slapping tariffs on U.S. consumers.\nThat sets the stage for a massive wave of U.S. LNG exports, backed by political momentum and international demand.\nNow here’s where our stock comes in…\nOur stock is a tollbooth operator in this booming sector. This company builds the infrastructure that makes LNG exports possible—the pipelines, terminals, and systems that physically move U.S. gas to global buyers.\nIf Trump succeeds in tying LNG purchases to trade deals—and all signs suggest he will—this company will be printing money on every contract signed. The more the world buys American gas, the more this company earns.\nAnd this isn’t some hypothetical “if.” The groundwork is already being laid:\n- Europe is scrambling to replace Russian gas permanently.\n- Japan is actively sourcing non-Chinese, non-Russian LNG.\n- India and South Korea are deepening energy ties with the U.S.\n- New terminals are being planned and permitted in anticipation of the coming surge.\nTrump’s tariff threats may dominate the headlines—but his behind-the-scenes LNG diplomacy could be the real financial windfall for U.S. energy companies.\nAnd our pick is sitting in the perfect spot to benefit.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #3: The Great Onshoring Boom—And the $9 Billion Clue in Indiana\nFor decades, America offshored its industrial base. Now, that trend is reversing—and fast.\nFrom semiconductors to pharmaceuticals, manufacturing is coming back to U.S. soil. Rising geopolitical tensions, Trump-era tariffs, and global supply chain shocks have forced companies to rethink their entire operating models. The result? A tidal wave of onshoring—and our stock is riding it like a pro.\nJust look at what’s happening in Lebanon, Indiana.\nPharma giant Eli Lilly is investing $9 billion into two state-of-the-art manufacturing facilities at the LEAP Lebanon Innovation and Research District. This is one of the largest life sciences manufacturing investments in U.S. history—and it’s not a one-off.\nOur company—a global leader in engineering, procurement, and construction management (EPCM)—has already been awarded a $3.2 billion contract for this project. That’s not a preliminary deal. This is full notice to proceed. Shovels are in the ground. Steel is going up. Money is already flowing.\nAnd this is just the beginning.\nThe Lilly project is a bellwether for what’s coming: dozens of similar large-scale facilities across the country, spanning sectors from biotech to clean energy to advanced manufacturing. Each one will require complex infrastructure, deep engineering know-how, and flawless execution.\nThat’s exactly what our company delivers.\nThis isn’t speculative future revenue. This is high-margin, long-duration, politically supported work—backed by blue-chip clients and megatrends. And as more companies race to bring operations home, our stock is in the pole position to win contract after contract.\nn fact, you can think of it this way:\nWherever America rebuilds its industrial backbone, this company gets paid.\nIt’s not just an AI play. It’s not just an energy play. It’s also the ultimate onshoring pick-and-shovel stock—a contractor to the next American manufacturing supercycle.\nAnd while Wall Street focuses on headlines, smart investors are loading up on the company quietly collecting billion-dollar checks behind the scenes.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nBuilt for the Future: Zero Debt, Cash to Deploy, and AI in Its Sights\nWhile most energy and utility firms are buried under mountains of debt and coughing up hefty interest payments just to appease bondholders…\nThis company is completely debt-free.\nIn fact, it’s sitting on a war chest of cash—equal to nearly one-third of its entire market cap.\nIt also owns a huge equity stake in another red-hot AI play, giving investors indirect exposure to multiple AI growth engines without paying a premium.\nAnd here’s what the smart money has started whispering…\nThe Hedge Fund Secret That’s Starting to Leak Out\nThis stock is so off-the-radar, so absurdly undervalued, that some of the most secretive hedge fund managers in the world have begun pitching it at closed-door investment summits.\nThey’re sharing it quietly, away from the cameras, to rooms full of ultra-wealthy clients.\nWhy? Because excluding cash and investments, this company is trading at less than 7 times earnings.\nAnd that’s for a business tied to:\n- The AI infrastructure supercycle\n- The onshoring boom driven by Trump-era tariffs\n- A surge in U.S. LNG exports\n- And a unique footprint in nuclear energy—the future of clean, reliable power\nYou simply won’t find another AI and energy stock this cheap… with this much upside.\nThis isn’t a hype stock. It’s not riding on hope.\nIt’s delivering real cash flows, owns critical infrastructure, and holds stakes in other major growth stories.\nThis is your chance to get in before the rockets take off!\nThe Reveal: Our Top Short-Term Stock Pick for 2025\nThis is the moment when most newsletters put up a paywall and ask you to spend $99.99 to find out the name of the stock.\nBut we’re not doing that today.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nAt Insider Monkey, we believe in earning your trust first—by delivering real value, upfront. We’re confident that once you see the quality of our research and the strength of our ideas, you’ll want to subscribe on your own terms.\nSo here it is—our top short-term stock pick of 2025:\n👉 Fluor Corporation (Ticker: FLR)\nWhen we published our premium report at the end of April, FLR was trading around $35 per share. Based on everything we’ve laid out—from the AI infrastructure boom to the LNG export surge and the American manufacturing revival—we believe FLR is poised to double over the next 12 to 24 months.\nAnd this isn’t just a recommendation—it’s a conviction.\nI personally took a double-sized position in my own portfolio. That’s how strongly I believe in Fluor’s upside.\nThis is our free gift to you.\nWe want you to profit from it—and see firsthand the power of aligning your investments with long-term megatrends.\nIf you’re interested in going even deeper…\nIf you’d like to access our #1 long-term AI stock pick—one that we believe has 10,000% upside potential over the next decade—click here to learn more.\nWe’ve shown you what we can do.\nNow imagine what you’ll unlock as a premium subscriber."
    },
    {
      "url": "https://www.insidermonkey.com/blog/30-most-popular-stocks-among-hedge-funds-2024-q3-1415561/",
      "text": "Artificial intelligence is the greatest investment opportunity of our lifetime. The time to invest in groundbreaking AI is now, and this stock is a steal!\nAI is eating the world—and the machines behind it are ravenous.\nEach ChatGPT query, each model update, each robotic breakthrough consumes massive amounts of energy. In fact, AI is already pushing global power grids to the brink.\nWall Street is pouring hundreds of billions into artificial intelligence—training smarter chatbots, automating industries, and building the digital future. But there’s one urgent question few are asking:\nWhere will all of that energy come from?\nAI is the most electricity-hungry technology ever invented. Each data center powering large language models like ChatGPT consumes as much energy as a small city. And it’s about to get worse.\nEven Sam Altman, the founder of OpenAI, issued a stark warning:\n“The future of AI depends on an energy breakthrough.”\nElon Musk was even more blunt:\n“AI will run out of electricity by next year.”\nAs the world chases faster, smarter machines, a hidden crisis is emerging behind the scenes. Power grids are strained. Electricity prices are rising. Utilities are scrambling to expand capacity.\nAnd that’s where the real opportunity lies…\nOne little-known company—almost entirely overlooked by most AI investors—could be the ultimate backdoor play. It’s not a chipmaker. It’s not a cloud platform. But it might be the most important AI stock in the US owns critical energy infrastructure assets positioned to feed the coming AI energy spike.\nAs demand from AI data centers explodes, this company is gearing up to profit from the most valuable commodity in the digital age: electricity.\nThe “Toll Booth” Operator of the AI Energy Boom\n- It owns critical nuclear energy infrastructure assets, positioning it at the heart of America’s next-generation power strategy.\n- It’s one of the only global companies capable of executing large-scale, complex EPC (engineering, procurement, and construction) projects across oil, gas, renewable fuels, and industrial infrastructure.\n- It plays a pivotal role in U.S. LNG exportation—a sector about to explode under President Trump’s renewed “America First” energy doctrine.\nTrump has made it clear: Europe and U.S. allies must buy American LNG.\nAnd our company sits in the toll booth—collecting fees on every drop exported.\nBut that’s not all…\nAs Trump’s proposed tariffs push American manufacturers to bring their operations back home, this company will be first in line to rebuild, retrofit, and reengineer those facilities.\nAI. Energy. Tariffs. Onshoring. This One Company Ties It All Together.\nWhile the world is distracted by flashy AI tickers, a few smart investors are quietly scooping up shares of the one company powering it all from behind the scenes.\nAI needs energy. Energy needs infrastructure.\nAnd infrastructure needs a builder with experience, scale, and execution.\nThis company has its finger in every pie—and Wall Street is just starting to notice.\nWall Street is noticing this company also because it is quietly riding all of these tailwinds—without the sky-high valuation.\nWhile most energy and utility firms are buried under mountains of debt and coughing up hefty interest payments just to appease bondholders…\nThis company is completely debt-free.\nIn fact, it’s sitting on a war chest of cash—equal to nearly one-third of its entire market cap.\nIt also owns a huge equity stake in another red-hot AI play, giving investors indirect exposure to multiple AI growth engines without paying a premium.\nAnd here’s what the smart money has started whispering…\nThe Hedge Fund Secret That’s Starting to Leak Out\nThis stock is so off-the-radar, so absurdly undervalued, that some of the most secretive hedge fund managers in the world have begun pitching it at closed-door investment summits.\nThey’re sharing it quietly, away from the cameras, to rooms full of ultra-wealthy clients.\nWhy? Because excluding cash and investments, this company is trading at less than 7 times earnings.\nAnd that’s for a business tied to:\n- The AI infrastructure supercycle\n- The onshoring boom driven by Trump-era tariffs\n- A surge in U.S. LNG exports\n- And a unique footprint in nuclear energy—the future of clean, reliable power\nYou simply won’t find another AI and energy stock this cheap… with this much upside.\nThis isn’t a hype stock. It’s not riding on hope.\nIt’s delivering real cash flows, owns critical infrastructure, and holds stakes in other major growth stories.\nThis is your chance to get in before the rockets take off!\nDisruption is the New Name of the Game: Let’s face it, complacency breeds stagnation.\nAI is the ultimate disruptor, and it’s shaking the foundations of traditional industries.\nThe companies that embrace AI will thrive, while the dinosaurs clinging to outdated methods will be left in the dust.\nAs an investor, you want to be on the side of the winners, and AI is the winning ticket.\nThe Talent Pool is Overflowing: The world’s brightest minds are flocking to AI.\nFrom computer scientists to mathematicians, the next generation of innovators is pouring its energy into this field.\nThis influx of talent guarantees a constant stream of groundbreaking ideas and rapid advancements.\nBy investing in AI, you’re essentially backing the future.\nThe future is powered by artificial intelligence, and the time to invest is NOW.\nDon’t be a spectator in this technological revolution.\nDive into the AI gold rush and watch your portfolio soar alongside the brightest minds of our generation.\nThis isn’t just about making money – it’s about being part of the future.\nSo, buckle up and get ready for the ride of your investment life!\nAct Now and Unlock a Potential 100+% Return within 12 to 24 months.\nWe’re now offering month-to-month subscriptions with no commitments.\nFor a ridiculously low price of just $9.99 per month, you can unlock our in-depth investment research and exclusive insights – that’s less than a single fast food meal!\nHere’s why this is a deal you can’t afford to pass up:\n- Access to our Detailed Report on our AI, Tariffs, and Nuclear Energy Stock with 100+% potential upside within 12 to 24 months\n- BONUS REPORT on our #1 AI-Robotics Stock with 10000% upside potential: Our in-depth report dives deep into our #1 AI/robotics stock’s groundbreaking technology and massive growth potential.\n- One New Issue of Our Premium Readership Newsletter: You will also receive one new issue per month and at least one new stock pick per month from our monthly newsletter’s portfolio over the next 12 months. These stocks are handpicked by our research director, Dr. Inan Dogan.\n- One free upcoming issue of our 70+ page Quarterly Newsletter: A value of $149\n- Bonus Content: Premium access to members-only fund manager video interviews\n- Ad-Free Browsing: Enjoy a month of investment research free from distracting banner and pop-up ads, allowing you to focus on uncovering the next big opportunity.\n- Lifetime Price Guarantee: Your renewal rate will always remain the same as long as your subscription is active.\n- 30-Day Money-Back Guarantee: If you’re not absolutely satisfied with our service, we’ll provide a full refund within 30 days, no questions asked.\nSpace is Limited! Only 1000 spots are available for this exclusive offer. Don’t let this chance slip away – subscribe to our Premium Readership Newsletter today and unlock the potential for a life-changing investment.\nHere’s what to do next:\n1. Head over to our website and subscribe to our Premium Readership Newsletter for just $9.99.\n2. Enjoy a month of ad-free browsing, exclusive access to our in-depth report on the Trump tariff and nuclear energy company as well as the revolutionary AI-robotics company, and the upcoming issues of our Premium Readership Newsletter.\n3. Sit back, relax, and know that you’re backed by our ironclad 30-day money-back guarantee.\nDon’t miss out on this incredible opportunity! Subscribe now and take control of your AI investment future!\nNo worries about auto-renewals! Our 30-Day Money-Back Guarantee applies whether you’re joining us for the first time or renewing your subscription a month later!"
    },
    {
      "url": "https://www.insidermonkey.com/blog/zebra-technologies-corporation-nasdaqzbra-q2-2025-earnings-call-transcript-1584638/",
      "text": "Zebra Technologies Corporation (NASDAQ:ZBRA) Q2 2025 Earnings Call Transcript August 5, 2025\nZebra Technologies Corporation misses on earnings expectations. Reported EPS is $ EPS, expectations were $3.31.\nOperator: Good day, and welcome to the Zebra Second Quarter 2025 earnings conference call. [Operator Instructions] Please note this event is being recorded. I would now like to turn the conference over to Mike Steele, Vice President, Investor Relations. Please go ahead.\nMichael A. Steele: Good morning, and welcome to Zebra’s Second Quarter Earnings Conference Call. This presentation is being simulcast on our website at investors.zebra.com and will be archived there for at least 1 year. Our forward-looking statements are based on current expectations and assumptions and are subject to risks and uncertainties. Actual results could differ materially and we refer you to the factors discussed in our SEC filings. During this call, we will reference non-GAAP financial measures as we describe our business performance. You can find reconciliations at the end of this slide presentation and in today’s earnings press release. Throughout this presentation, unless otherwise indicated, our references to sales performance are year-on-year on a constant currency basis and exclude results from recently acquired businesses for 12 months.\nThis presentation will include prepared remarks from Bill Burns, our Chief Executive Officer; and Nathan Winters, our Chief Financial Officer. Bill will begin with a discussion of our second quarter results. Nathan will then provide additional detail and discuss our revised outlook. Bill will continue with progress on advancing our strategic priorities, including the pending acquisition of Elo Touch Solution we announced this morning. Following the prepared remarks, Bill and Nathan will take your questions. Now let’s turn to Slide 4, as I hand it over to Bill.\nWilliam J. Burns: Thank you, Mike. Good morning, and thank you for joining us. In addition to our second quarter highlights and financial results, we will discuss this morning’s announcement of the exciting milestone in our journey to enhance the connected frontline experience to our acquisition of Elo. We will also review our increase full year outlook. Before we get into the details of the quarter, let me spend a moment on the acquisition that drives profitable growth and elevates our market leadership. Elo Solutions engage consumers, enhance self-service and deliver automation across a wide range of end markets. This combination strengthens Zebra’s portfolio of solutions, enables us to advance our strategic priorities. Now turning to our Q2 results.\nOur team executed well in the second quarter, delivering results exceeding our outlook, with solid demand across the business and lower-than-expected U.S. import tariffs. For the quarter, we realized sales of $1.3 billion, a greater than 6% increase compared to the prior year, an adjusted EBITDA margin of 20.6%, a 10 basis point improvement and non-GAAP diluted earnings per share to $3.61 which was 14% higher than the prior year. We realized strong growth in our North America, Latin America and Asia Pacific regions and had relative outperformance in mobile computing, scanning, and RFID. Transportation & Logistics, along with Retail & E-commerce were our highest growth vertical end markets, with health care cycling a strong compare and manufacturing continuing to lag.\nAs we enter the third quarter, demand has been resilient. However, we remain cautious as our customers navigate through uncertain trade policy. Additionally, we expect the recently passed tax legislation to be constructive for some of our U.S. customers, although it is too early to assess the impact on demand. I will now turn the call over to Nathan to review our Q2 financial results, tariff considerations and outlook.\nNathan Andrew Winters: Thank you, Bill. Let’s start with the P&L on Slide 6. In Q2, total company sales grew by more than 6%, reflecting recovery in demand across our major product categories. Our services and software recurring revenue business grew slightly in the quarter. We had similar growth rates in both of our financial segments. We realized strong sales growth across most of our regions. In North America, sales grew 8% with double-digit growth in mobile computing and RFID. Asia Pacific sales increased 20%, led by Australia, New Zealand and India. Sales grew 11% in Latin America, with growth across the region. In EMEA, we cycled strong comparisons, particularly in mobile computing with a sales decline of 1%. Adjusted gross margin declined 70 basis points to 47.9%, primarily due to higher U.S. import tariffs than last year.\nAdjusted operating expenses as a percent of sales improved by 80 basis points. This resulted in second quarter adjusted EBITDA margin of 20.6%, a 10 basis point increase versus the prior year. Non-GAAP diluted earnings per share were $3.61, a 14% year-over-year increase and above the high end of our outlook. Turning now to the balance sheet and cash flow on Slide 7. Year-to-date, we generated $288 million of free cash flow. We have been deploying capital consistent with our allocation priorities. We repurchased $250 million of stock year-to-date, and our recent $62 million acquisition of Photoneo as well as this morning’s acquisition announcement, support our continued efforts to scale in adjacent markets. Our balance sheet is in excellent shape, with $872 million of cash at the end of Q2, a modest 1.2x net debt to adjusted EBITDA leverage ratio and $1.5 billion of credit capacity, providing ample flexibility to fund the $1.3 billion pending acquisition of Elo later this year.\nDue to the global nature of our supply chain, like many other electronic manufacturing companies, we are subject to U.S. import tariffs. On Slide 8, we provide an update on the anticipated impact from tariffs on our products imported to the United States and our efforts to mitigate them. For the full year 2025, we are now assuming approximately $30 million of gross profit impact after mitigation, with a $10 million net impact in the third quarter, following a $12 million impact in the first half of the year. Our forecast assumes the current effective rates remain in place, including the electronics and USMCA exemptions. This implies a $40 million annualized gross profit impact which is less than half of our previous expectation, primarily due to a lower rate on China imports.\nOur mitigating actions to date have included shifting additional production out of China and approximately $40 million of annualized pricing adjustments. North America imports from China are now expected to represent 20% of the mix by year-end. We will continue to evaluate additional opportunities to mitigate U.S. import tariffs as we monitor global trade policy development. These potential actions include additional shifting of global production, product portfolio optimization and price adjustments. Let’s now turn to our outlook. We entered the third quarter with a backlog and pipeline to support our sales guide of between 2% and 6% growth, with a 30 basis point favorable impact from the acquisition of Photoneo and a neutral impact from FX.\nOur third quarter adjusted EBITDA margin is expected to be approximately 21%, which assumes a $10 million net impact from U.S. import tariffs and non-GAAP diluted earnings per share is expected to be in the range of $3.60 to $3.80. We are raising our full year sales growth guidance range by a full point which is now expected to be between 5% and 7%, including approximately 50 basis points of combined favorability from FX and the Photoneo acquisition. We are now expecting a $30 million gross profit impact from tariffs, net of mitigations for the full year, which is $40 million favorable to our prior guidance. We are also raising our full year adjusted EBITDA margin by a full point to between 21% and 22% and increasing our non-GAAP diluted earnings per share to a range of $15.25 to $15.75.\nAdditionally, we are raising our free cash flow guide for the year to at least $800 million, which reflects the anticipated benefit of recently enacted U.S. tax legislation and implies free cash flow conversion of approximately 100%. We continue to work on further optimizing our working capital levels, balanced with our supply chain resiliency initiatives. Please reference additional modeling assumptions shown on Slide 9. With that, I will turn the call back to Bill.\nWilliam J. Burns: Thank you, Nathan. Zebra remains well positioned to benefit from secular trends to digitize and automate workflows with our portfolio of innovative solutions, including purpose-built hardware, software and services. Our solutions intelligently connect people, assets and data to help our customers make business critical decision. As you will seen on Slide 11. Zebra Solution enable our customers across the broad range of end markets to drive revenue, boost productivity and efficiency and optimize the front line, delivering improved service to their customers, shoppers and patients. The challenges of an on-demand economy. E-commerce growth, evolving regulations and labor constraints require increased adoption of automation.\nHere are some of the recent examples of customers transforming their workflows at various stages of their automation journey. An athletic retailer in the United Kingdom recently launched the initial phase of their RFID journey to improve inventory accuracy by equipping their store associates with Zebra mobile RFID solution. This strategic investment enables better supply chain visibility given that the majority of their vendors now RFID tag at the point of manufacturer. We continue to see strong interest from customers in leveraging RFID across the supply chain. A North American logistics company is focused on moving freight more effectively by equipping their drivers and crossed-out workers with Zebra mobile computing solutions to collaborate seamlessly across their operations.\nAdditionally, a large North American food distributor recently began a technology upgrade of their Zebra mobile computers, tablets and mobile printers to improve the efficiency and productivity of their distribution centers. Our market-leading portfolio solution enhances their receiving, restocking and cold chain operation. These are a few of the many examples that demonstrate how customers rely on us to navigate their technology journey leveraging our commitment to innovation and workflow expertise. Innovation remains central to our industry leadership, and we have consistently reinvested approximately 10% of our sales in the research and development to advance our portfolio of solutions. We augment our organic efforts with strategic acquisitions that advance our vision as evidenced by the recent acquisition of Photoneo, which expanded our 3D machine vision solution as well as the pending acquisition of Elo.\nTurning to Slide 12. The acquisition of Elo will enable us to expand our portfolio of solutions to help customers transform their frontline operations by digitizing and automating workflows. Elo is a leading provider of point-of-sale solution, kiosks, interactive displays and touchscreen solutions with a 50-year track record of innovation in more than 400 patents operating in an $8 billion market. The company generates approximately $400 million of annual revenues with a similar sales growth and EBITDA margin profile to Zebra. Elo also has a similar go-to-market approach to Zebra, offering a wide range of industry tailored solutions that modernize point of sale, streamline self-service and payment experiences, automated kitchen industrial workflows and optimize production and process management.\nOur leadership in hardware, software and services for the frontline worker will be augmented by Elo’s consumer-facing offerings to deliver a unified connected frontline experience. Together, we will pursue attractive market and geographic expansion opportunities while delivering a comprehensive software differentiated portfolio that enables customers to better address emerging use cases. The continued growth of retail media networks and the deployment of AI-based agents on the front line are examples of new opportunities that Zebra and Elo can pursue together. The Elo acquisition is expected to be immediately accretive to earnings once the transaction closes and we expect to generate an incremental $25 million of annual EBITDA synergies by year 3.\nIn closing, our confidence in sustainable long-term growth is underpinned by several key themes that drive demand for our solutions, including labor and resource constraints, track and trace requirements, increased consumer expectations, advancements in artificial intelligence and the need for real-time supply chain visibility. As we move forward, we remain focused on advancing our industry leadership where innovative solutions that digitize and automate our customers’ workflows, serving our customers well and driving profitable growth. We are well positioned to expand our addressable market as we add complementary solutions to our portfolio that elevate our capabilities to serve our customers. I will now hand the call back to the Mike.\nMichael A. Steele: Thanks, Bill. We’ll now open the call to Q&A. [Operator Instructions].\nQ&A Session\nFollow Zebra Technologies Corp (NASDAQ:ZBRA)\nFollow Zebra Technologies Corp (NASDAQ:ZBRA)\nOperator: [Operator Instructions] Our first question comes from Joe Giordano with TD Cowen.\nJoseph Craig Giordano: Maybe I’ll start on the acquisition. Can you kind of tell me how do these — how does that technology kind of tie in with yours? Like where are they doing things that you couldn’t do on your own? What’s the customer overlap kind of look like in terms of leveraging that?\nWilliam J. Burns: Yes, sure, Joe. I got it. I would say, overall, first of all, we’re really excited about the acquisition. It really represents the next step, and we see as our journey to have a leading portfolio of solutions that digitize and automate the front line of business where we’ve been focused for certainly some time. And I think that what Elo brings us is a market-leading portfolio of self-service and customer-facing solutions that really expands our addressable market by about $8 billion. So think of more customer-facing use cases. Overall, their focus is that on areas like point-of-sale, self-serve kiosks, interactive touchscreen displays, automation in the industrial place, and I think overall, what we bring them is that we bring our complementary solutions to what they do in things like point of sale and others.\nOur global reach allows us to expand their offerings beyond their strength in North America and what they have in EMEA today and smaller in Asia Pacific, but really take them to a global scale and reach across our go-to-market. And then overall, our extensive service capabilities, our deep customer relationships, there are customer overlaps, especially in places like retail, but there’s strengths that they have in things like quick-serve restaurants where we’re not as strong, but are putting in emerging solutions like RFID into quick serve today, but it gives us more of an offering there. So quick-serve restaurants is an example. We believe our strength in health care would help them. So there’s vertical markets and geographical expansion that would bring to their portfolio overall that would allow them to expand.\nSo think of it as more customer-facing, more self-service, more automation and more fixed than mobile, and that adds significantly to our broad-based portfolio today.\nJoseph Craig Giordano: That’s great. Maybe you guys have done a nice job of kind of withholding judgment on the second half in terms of volumes until you see what’s going on with your typical seasonal flows. You don’t want to commit to them until you have them in firm backlog. Now as we sit here in August, we see the guide, but like how are you feeling about the ability of your customers to kind of release budgets and kind of move forward with things? Like what do you think is kind of inherent in your guide now in the second half?\nWilliam J. Burns: Yes. Joe, I’d say that demand has remained resilient through the first half despite the uncertainty around global trade policy and that customers have generally maintained their capital spending levels and moved ahead with the projects that they had planned for the year. So we’re seeing that, and we’re happy with where things are out from a customer perspective. Some have spread some of the spending out over multiple quarters, really a combination of managing their CapEx, but probably a bit of uncertainty as well. We’ve seen that from a increased — we’ve increased our outlook for the full year really based on the strong second quarter results and then the backlog and pipeline that we see going into the second half that supports second half growth overall.\nAnd I’d say that — all that said, our customers still remain a bit cautious. They’re still — while there’s been more clarity, they’re still navigating the uncertain trade policies, but clarity has been certainly helping. And there’s certainly some uncertainty around macro and geopolitical. So I would say that overall, the — there are some positives, too. Things like the U.S. tax legislation could be a benefit to us, but it’s too early to tell. So we think overall that our guide for the full year, while we’re increasing it, makes a lot of sense, and it’s pretty balanced to what we’re seeing from a positive certainly from customers continue to move ahead, but also a little — a bit of uncertainty still out there overall. So we think our guide is pretty balanced for second half.\nOperator: Our next question comes from Damian Karas with UBS.\nDamian Mark Karas: Congrats on the deal.\nWilliam J. Burns: Thanks Damian, appreciate it.\nDamian Mark Karas: Just a follow-up question on Elo. Could you talk about how their business cyclicality has compared with Zebra historically? And I think you’re moving into a little bit more of a competitive space compared to your core mobility solutions. So could you just maybe talk a little bit about Elo’s market share and how that has progressed over time?\nWilliam J. Burns: Yes. I’d say overall that the Elo portfolio would be a bit different in the demand cycle than us, where we typically see a fair amount of year-end spending by our customers. They don’t see quite that much. It’s more balanced throughout the year. So I think that you’ll see us that kind of spread some of our year out ultimately and not put as much in the fourth quarter from a cyclicality perspective, I think that’s positive. I would say, yes, there’s different competitors in the space as they have a broad portfolio of solutions across point-of-sale and kiosks, interactive displays, there are different competitors than we face today in the market. It’s a fairly fragmented market and their strength is really strong in North America overall, I would say, as one of the market leaders, both in North America.\nEMEA and Asia Pac, I would say that there’s additional opportunities where they’ve got good share, we think ultimately, there’s an opportunity to gain more share there by leveraging Zebra’s relationship and our global reach. As the size company they are, you ultimately make decisions on where you’re going to go next geography-wise. And us having a presence around the world will help us expand their product lines around the world. So different competitors, yes, — some of the same channel partners. So some of the same distributors and value-added resellers that we leverage around the globe are the same. Some of the customers are the same, but many are different as well, and we’re excited to enter markets as well that they’ve got strength in that we don’t today.\nSo we see revenue synergies as well as cost synergies as we talked about in the release, and we’re excited about working together as they really give us more of a consumer-facing offering to add to our portfolio.\nDamian Mark Karas: That’s helpful. And Bill, I think you mentioned the one big beautiful bill legislation, and that should have a positive impact on North America. Just curious, is that kind of Zebra’s internal assessment? Or are you maybe hearing that in your dialogue with customers, they’re becoming increasingly positive and maybe even you’re seeing that reflected in your funnel activity in North America?\nNathan Andrew Winters: Damian, I can jump in and address that. I think we’re not hearing it directly from our customers. I think like many, including ourselves, you’re digesting it and understanding what is the impact from a cash perspective, particularly around the R&D deductibility in year 1 as well as the ability to deduct the first year or 100% of the capital expenditure in year 1. So my guess is like us assessing what that means for your business and that ultimately then turns into how do you want to allocate that capital that could lead to more capital purchases in the back half of the year, but we’re not hearing it directly from customers, just more noting that, that is an opportunity as we go through the back half, but I think it’s going to take some time for folks to understand it, make sure they then allocate where they want to put the capital and understand when you receive the cash back in terms of less future payments here in the back half of the year or what it might mean even as you go into ’26 in terms of capital that might be available to spend.\nOperator: Our next question comes from Tommy Moll with Stephens.\nThomas Allen Moll: Bill, I think I heard you use the term balanced for the approach to your second half outlook. And I wanted to follow on that and ask what you’re assuming on large deal conversion. Maybe just related to what you saw in the second quarter as well would be helpful?\nWilliam J. Burns: Yes. I’d say that from a second half year kind of fourth quarter perspective as it relates to kind of year-end spending, I would say that the year overall is playing out better than we expected and that we saw strong growth in the first half and strong results, as you saw in second quarter, which allows us to increase our outlook. And we had easier compares in the first half, a bit tougher compares in second half. So you’re kind of playing out as we expected. I would say that as we look to fourth quarter that overall that we factored in some year-end spending about the same levels as we had last year because while we don’t have visibility yet to it, it’s too early for that. We know there will be some. As we just talked about, things like the U.S. legislation around the big beautiful bill could help with CapEx spending year-end.\nAnd certainly, as customers have remained cautious through the year, we could see additional year-end spending, but we factored some in, which is we think is prudent even though we don’t have quite the visibility today. And that’s why we’re saying it’s our outlook, I would use the word balanced, as you said, really with the opportunities we see, a bit of uncertainty out there, but clarity coming through on tariffs. And then we haven’t talked about it yet, but we’re seeing some softness in Europe, certainly a mixed result across Europe. And I would say that’s kind of weighing in as well. So we’re trying to find the right balance of second half and the guide for Q3, we feel good about and less certainty around Q4, but we feel good that customers will spend some year-end money.\nIf they’re being conservative, maybe there’s some upside to that. There are some things out there like the U.S. legislation. We see — like to see Europe be a bit stronger as we’re seeing softness there, but it’s been a mixed across the region. That’s why I used the word balance.\nThomas Allen Moll: And then on Elo, you’ve mentioned a couple of times that there’s a big market you can go after now that’s more consumer-facing. And I’m interested to get a little more of the strategy there. It’s — I don’t know if it’s an entirely new direction for Zebra, but it’s a slightly different emphasis than what you’ve discussed historically. So are there some things changing in that market that draw you to it? Or what’s some of the thinking behind the scenes here?\nWilliam J. Burns: Yes. So maybe the easiest example is when we’ve talked about kind of the modern store from a Zebra perspective, really powered by AI and the idea that we think of engaged associates in a retail store and then we think of inventory accuracy. And the last is kind of customer consumer-facing for the retailer. This adds to that element of solutions. And today, our mobile devices, for instance, are used for payment. Our mobile devices are used in Europe extensively. We’re the market leader in things like self-scan. But ultimately, the buying experience also includes self-serve checkout, kiosks and quick-serve restaurants. There’s a move to serve customers not just through mobility, tablets and mobile devices with payment on them, but also in fixed touchscreens and in payment and point of sale that includes in the Elo case, things like compute and your touchscreen displays and payment, all driven or focused on customer and self-service.\nSo there’s also an element within the — in retail, and I’ll stick with retail for a minute, but it applies to multiple other verticals is this idea of media networks within the store. So screens and touchscreens and displays ultimately that are driven by Android today as well. So both a combination of Windows and Android, but Android is becoming more prevalent to drive those technologies and the platform we used around mobile computing, customers have said to us, you’d like to see that same Android platform used across our fixed screen technology and touchscreens in the store that we use in your mobile devices. And they’ve actually represented some of this to us saying it’d be interesting if you could pull those two together. So think of places where we work together would be point of sale.\nTheir offerings would include self-service kiosks, which would marry with things like mobile device checkout or self-scanning. And then we think of new areas. So as we go to — at the HIMSS show for health care, while we’re talking about mobility and health care, there clearly is an element around kiosk and self-serve within health care. When we’re talking about quick-serve restaurants, our relationships most recently have been advanced technologies around RFID and tracking food into quick-serve restaurants. They’re controlling both the customer interface, but also the production of food and others inside the kitchen. So think of process management inside quick-serve restaurants. So it’s closely adjacent to what we do in manufacturing. We talk about tablets on the production floor, but there’s also fixed screen elements to that and touch screens associated with the manufacturing process and process management, so automation.\nSo we see it as another step to not only addressing the consumer, but addressing automation in a different way beyond mobility. And the two are coming together with operating systems such as Android. So that’s why we see overlapping customers, overlapping markets and places where we can take their solutions globally.\nOperator: Our next question comes from Andrew Buscaglia with BNP Paribas.\nAndrew Edouard Buscaglia: I wanted to ask on just to gauge how you’re viewing tariffs from here. Obviously, saw some de-escalation intra-quarter in China. But there are still — there is still uncertainty with how this plays out. So I’m wondering, maybe number one, are you concerned or have you contemplated or what are you seeing in terms of the potential exemptions picking and/or going away? And then any other, I don’t know, further tariff escalations you’re aware of that you’re monitoring? And what can you do to offset those?\nNathan Andrew Winters: Yes, Andrew, I’d say — and Bill mentioned this earlier, obviously, progress has been made since our last update. But as you noted, it remains a dynamic environment. And I think we’re looking at it is it’s probably going to remain a dynamic environment for a period of time. So it’s just one of those where we continuously work with our trade and industry partners to understand what they’re hearing, what they’re seeing, how are others reacting so that we can get as much intelligence as possible. And we have a dedicated team that wakes up every day keeping a pulse on where things are at and as news breaks, making sure we have a position to react. But also, as we said, to some extent, we want to play our game in terms of continuing to have a diversified supply base that is both — can react to tariffs, but also just have broader sustainable supply chain, right?\nSo that and resilient supply chain. So we’re managing — we have a playbook that the team is executing to that has a bunch of different options available to us that we can execute here, particularly as we get more clarity as we go through the balance of the year. So I’d say as it relates to exemptions or other changes in rates, we don’t know anything else that you don’t see in the news or that’s not breaking. So we — again, we’re — I think we just — we look at that as what are the options available from pricing to other geographical moves, but ultimately, making sure we have a resilient and sustainable supply chain for years to come, and that’s where we stay focused.\nAndrew Edouard Buscaglia: Okay. Fair enough. And then I want to get your take on competition and your potential for market share gains. You’re seeing one of your biggest competitor across many different business lines somewhat get deemphasized by its parent company. So I’m wondering, do you see a pathway for more share gains going forward? And what’s your take on what’s going on competitively?\nWilliam J. Burns: Yes. I would say that not much different overall, quite honestly, except for the announcement that you mentioned with our competitor. I think that our strong customer relationships, the vertical market expertise we have, the breadth and depth of our portfolio, our commitment to our customers and continuing to invest in innovation along with them, expanding the portfolio, I think from the acquisition perspective, clearly, it elevates our strategic position with our customer to be doing more business with them in areas that they’re focused like self-serve and others. So we saw this with the Enterprise acquisition. The more business we do together and the more vision we paint with our customers about what the future of retail looks like, what the future of P&L looks like, what the future of manufacturing looks like and have a breadth and depth of the portfolio that expands our relationships, and that’s one of the reasons we like this acquisition, allows us to continue to remain relevant, important and add to the future direction of our customers in a voice that ultimately they rely on as a trusted partner.\nSo we feel pretty good about where we’re at competitively. The portfolio is as strong as it’s ever been. We continue to add to the portfolio, new areas such as wearables, right, will play a role not only today, but they’ll play a role in AI in the future. If you look what’s being set out there around what the future AI device looks like. It’s likely a mobile device augmented with something that’s wearable. So we’ve got new wearable offerings for both retail and health care. We continue to expand the portfolio with next- generation devices across T&L as we see the refreshes coming up over the next couple of years. We’re really focused on that. We recently won a postal opportunity, large postal opportunity in Australia, which again speaks to our strength in postal and having the right device in T&L as these refreshes come up.\nSo we feel good competitively ultimately, and what happens with our competitor happens. So that’s going to take some time to play out, and we’ll continue to play our game, and we feel good about where we’re at.\nOperator: Our next question comes from Jim Ricchiuti with Needham & Company.\nJames Andrew Ricchiuti: You noted some softness in Europe. I’m wondering what changes have you seen in the various subsectors of the market more broadly, whether any changes in the overall retail, retail automation, e-commerce, logistics areas versus, say, 3 months ago?\nWilliam J. Burns: Yes. I would say that when we look at Q2, certainly strong growth across North America, Asia Pac and Latin America. So geography- wise, strong growth with EMEA certainly being more challenged or softness. The strength globally on a global basis, I would say T&L and retail and e-commerce continue to be strengths for us. Health care in North America cycling some strong compares in mobile computing. And I would say, while growing mid-single digits, manufacturing is slower than the other and certainly transportation, logistics and retail. When I look at the regions, I would say, as you asked specifically about EMEA, I would say that cycling strong prior year compares in mobile computing. So that’s clearly a factor.\nBut I think overall, we’re seeing kind of mixed performance across EMEA. So strength in places like Northern Europe and particularly in T&L, but we’re seeing softness in auto manufacturing. Some of the retail sectors in France is a good example where we’re seeing a bit of bit challenging. Some of the run rate, we think, really driven by some of the concerns around kind of geopolitical and tariff and others. So some run rate challenge in EMEA. So overall, I would say we’d like to see EMEA, the softness in EMEA kind of abate and get a bit stronger. That’s happened throughout the year. So we started okay, but we’ve seen more of that kind of EMEA degrade through second quarter. North America, strong really around mobile computing, data capture, RFID, so broad portfolio set.\nAsia Pacific strengthened. We talked about Australia and New Zealand, India, some new applications around RFID and places like India around transportation, such as rail. So we’re excited about that as RFID continues to play an important role in the portfolio. So I’d say the one softness point is EMEA, and it’s evolved probably in second quarter, we’re starting to see and we began to see it. And we’re paying close attention to it. We’re a lot — staying a lot close to our customers and making sure that as they begin to spend, we’re there with them.\nJames Andrew Ricchiuti: Got it. Just congratulations, by the way, on the Elo announcement is, curious, the way they go to market, are they working with similar channel partners that you work with? Or is this a different channel versus some of your products?\nWilliam J. Burns: Yes, very similar from a channel perspective and go-to-market, meaning that they work closely with the end customer as we do and then fulfill through value-added distributors and in distribution, 2-tier distribution in the marketplace that they ultimately serve. They sell direct as well. So really very much on top of what we do today. Their largest distributor in North America is our largest distributor in North America. So in that case, right on top of each other. So I think that very similar go-to-market approaches that they have today. Now in places, they’ve got different relationships, meaning things like strength in quick-serve restaurants or different places with the fragmentation of health care, they may be in different customers than we are and have strong strength in those areas, but we’re looking forward to leveraging the customer base on both sides.\nOperator: Our next question comes from Brad Hewitt with Wolfe Research.\nBradley Thomas Hewitt: So it looks like your net leverage will be around 2 turns pro forma for the Elo deal. So as we think about capital allocation going forward, should we assume the focus is more on bolt-on deals and perhaps modest buybacks in the near term until pro forma leverage comes down a little bit?\nWilliam J. Burns: I’d say that, look, I think that our capital allocation in general hasn’t changed in the idea that we focus first on organic growth in the areas in which that we invest in our portfolio, and we believe there’s continued opportunities across the portfolio. M&A, we view as strategic adjacencies to what we do, and we continue to be very selective in that asset, something smaller in Photoneo, we closed and now something a bit larger certainly in Elo. We’re excited about both in much different sizes, but both in areas in which we see as strategic and closely adjacent to what we do. We’ll continue to be inquisitive out there and continue to look for strategic M&A. But we want to get through this one first and get it integrated and brought into Zebra, and that’s our near-term focus.\nAs you’ve seen, we’ve returned $250 million in capital to shareholders as well. So I think we’re trying to find the right balance between M&A, the things that are strategic for us, what’s available in the market, how do we add to things like machine vision and also in this case, what we see as an important extension of what we do today on the front line of business with Elo. And we’ll continue to look out there, but I think that the focus in the short term is going to be really integrating the Elo team.\nBradley Thomas Hewitt: Okay. That’s helpful. And then you mentioned in the release the 5% to 7% revenue growth algorithm going forward for Elo. I guess curious what has been the historical organic growth profile of the business, particularly from 2019 through 2024. And then how would you describe the potential scope of revenue synergies? And is that incremental to the 5% to 7%? Or is that already embedded there?\nNathan Andrew Winters: Brad, I think very similar. If you look back over the last several years, very similar to our performance in terms of — if you overlap the revenue growth of consistent growth going pre-pandemic, kind of a lot of ups and downs as you went through COVID, coming out of COVID, as you saw a lot of investment around their technology, the supply chain challenges that the industry went through and then the recovery. So I’d say if you bump it up to our long-term growth, it kind of overlaps pretty nicely.\nUnidentified Company Representative: Look like us.\nNathan Andrew Winters: It looks a lot like us. Maybe a few of the years are a little bit different. So yes, so I think that’s what we’ve seen long term with a lot of puts and takes, particularly around COVID and the supply chain challenges coming out of that. Yes. And if you look — as part of the revenue synergies, I’d say maybe just take a step back on the total $25 million, we’re highly confident in achieving those. There’s multiple levers, and we expect a steady ramp of those over the next few years. So maybe on the cost side, things you would expect around real estate portfolio where we have overlapping sites, consulting services and things like that as well as leveraging our supply base to drive efficiencies across our supply base will be areas of focus.\nAnd then on go-to-market, as Bill mentioned, it’s really around, I’d say, international developed markets where we have a strong presence, the infrastructure, the channel setup, and Elo has a limited presence in some of those markets, but we think a great opportunity to, again, leverage our presence and infrastructure to grow. And then as Bill mentioned, cross-selling opportunities are significant for both sides. So again, I think the $25 million, while we have kind of a bottoms-up more holistically on the cost side, we do think there’s synergies that could get us to that — to your point on that top end of that 5% to 7% as we move forward.\nOperator: Our next question comes from Piyush Avasthy with Citi.\nPiyush Avasthy: Just thinking from the perspective of your raised sales growth guidance of 5% to 7% for ’25, is there any incremental color you can provide us on trends that you’re seeing across the expansionary and adjacencies verticals? If you could break out how machine vision, mobile robots, RFID are performing, that would be helpful.\nWilliam J. Burns: I would say that the — overall, I would say, from a vertical perspective, across the different vertical markets overall, I would say retail and e-commerce, clearly a strength, as I mentioned earlier, with certainly continued strong demand, both in mobility, so mobile devices and RFID technology inside retail. I would say that T&L recovery certainly is overall kind of more normalized business across T&L. I mentioned postal win earlier that really fits in transportation logistics for us and some new opportunities in things like railway. Manufacturing, I would say, some new areas were adjacencies that we’re focused on things like machine vision inside manufacturing with the idea of inspection and the other area of machine vision would fall back to T&L.\nSo we’re seeing a continued focus on our team. While we’re seeing still challenging in manufacturing and things like EV and others, I would say that the machine vision plays an important role there. So strength across the core portfolio in the areas in which we do business today and then RFID, machine vision and others opportunities across the different vertical markets.\nPiyush Avasthy: Helpful. And I think you touched on replacement cycle. Like have you at least started to have discussions with your customers regarding their refresh plans? And if you have that visibility in 2026, like help us understand what that could mean for your 5% to 7% organic sales growth framework?\nWilliam J. Burns: Yes. I think everybody is on a different journey of a refresh cycle within their environment. We’ve seen the postal win is an example of a refresh of that postal carrier in Australia that, again, speaks to the fact that we continue to win in the marketplace. And over time, there’ll be additional refreshes. Everybody is on a different schedule, both retail, T&L and others. And over the next several years, we clearly have seen through COVID and today, the number of mobile devices in the marketplace has increased, and that eventually will continue to be upgraded and increased along with this concept of device for all, right, putting more devices in the hands of more associates inside the frontline workers, whatever that’s T&L or manufacturing or retail or health care, we’re seeing that move.\nSo even the refreshes include even more devices over time. We’re not guiding to ’26 at the moment, but over the next several years, we see that there’ll be an accelerated refresh cycle, whether that begins in ’26 and moves into ’27, ’28, we just don’t know yet. But we are tracking our customers and making sure that we’re staying close to them so that when they are ready, as in this coastal example that we’re there for them.\nOperator: Our next question comes from Keith Housum with Northcoast Research.\nKeith Michael Housum: Congratulations on the quarter and the acquisition. Bill, thinking about the Elo acquisition, is the makeup of their revenue, is it primarily hardware? Or is there other sources of revenue that you guys will be acquiring?\nWilliam J. Burns: Yes. I mean I would say that their strength in the software is certainly around the OS and what they’re doing in two areas. One would be the move, as I said before, to Android that ties into touchscreens and displays and others for control and be able to use the Android OS. So there’s hardware and software associated with their control of those devices. Point of sale, they also have the compute associated with point of sale. So the point-of-sale terminals are also a combination of hardware and OS and software associated with that. So like Zebra, the predominant sales mechanism is through hardware, but tremendous value in the software side of what they do today within their environment.\nKeith Michael Housum: Great. Is there a particular like competitive mode that Elo has versus other competitors in the space that you may have looked at?\nWilliam J. Burns: Yes. I would say the breadth and depth of the portfolio, like us, the relationships they have with their customers to really understand the places in which they serve their customers today. I think that is probably one of the biggest strengths, the technology as well. So they clearly are the leader in touchscreen displays and others. They have been doing this for about 50 years, significant patent protection around it, and that’s a strength they have as well. So customers clearly recognize them as one of the leaders within this market, and they remain focused on it. While others are moving away from this market, they remain focused. And I think that, that matters. We talked about what’s happening on our competitor on the mobile device side. I think we’ve seen others kind of exit this market, and it creates an opportunity for them, now us.\nOperator: Our next question comes from Rob Mason with Baird.\nRobert W. Mason: Maybe just one more question on Elo, Bill. As you think about — this is largely complementary. I know you’ve introduced some kiosks recently. They do have some mobile computing products, I guess, as well. But as you think about this, is part of the strategy to keep the Elo brand? Or does this give you additional ability to tier your product — any of your products?\nWilliam J. Burns: Yes. I would say that the overlap is relatively small. I mean, as you said, we’ve recently announced the kiosk. We’ve been happy with the success in the market, but it’s a whole lot different to have a single kiosk offering and have a portfolio, as we know, right? And it’s the same on their side, their mobile device has been focused more on payment, which, by the way, is one of their strengths that we expect to continue to leverage on the mobile device side of things. So their mobile device has been used more in the payment applications. And again, small levels of revenue compared to the portfolio that we have. So the overlap is very minimal overall, and we see that being kind of a strength of the acquisition.\nThe fact that little overlap, ultimately, strength in customers, go-to-market and others is what we saw with the Enterprise acquisition and the idea that we believe we can accelerate in the market from a revenue perspective by not having a lot of debate about which product, which area to go focus on or overlapping products or different go-to-market motions, all that helps you be successful from an acquisition perspective. We’ve also worked with them for some time. So we’ve — they’ve been an OEM customer of ours. We know the team there well for many years. We have like cultures, right, product portfolios that ultimately are high quality, respected in the market as being high- quality hardware and software. I think that helps as well, certainly with us having conviction.\nAnd certainly, when customers are saying to us, “Hey, it would be great the two of you could get together, that also helps.\nRobert W. Mason: Yes. Makes a lot of sense. Nathan, real quick, just your third quarter EBITDA margin guidance is a little bit down year-over-year. But if I adjust for the tariff impact that you’ve outlined, it kind of equates to about a 30% incremental margin year-over-year. As you think about tariffs, hopefully, we get to some normalized place with pricing and mitigation, et cetera. Are there any other — besides tariffs, are there any other major kind of puts and takes on the margins right now, FX or anything else that you would call out?\nNathan Andrew Winters: No. As you said, the 30% incrementals, excluding tariffs is about what you’d expect and we’ve historically delivered. So I think we’ve largely worked through over the last year’s supply chain challenges and everything else so that I think we’re back to where — as we grow, we can drive great leverage on top of our supply base as well as our fixed infrastructure. So to your point, outside of FX in the short term is actually a bit of a headwind at the bottom line just because of the — from a cost standpoint, it’s a pretty big impact on OpEx. And just with the hedges we have in place, you’re not seeing the full kind of revenue upside that you would expect where the rates are, especially the euro is at today, but those will come through as we roll through the hedges we have in place.\nSo it’s FX in the short term is a bit of a headwind in EBITDA, but that will — if rates stay where they’re at, that will turn into a tailwind as we get into Q4 and the early part of next year, just again, as our forward rates mature. So no, I think those are the key dynamics. And for us, it’s really again how do you drive the incremental volume and leverage our scale to drive that margin expansion.\nOperator: Our next question comes from Meta Marshall with Morgan Stanley.\nMeta A. Marshall: A couple of questions for me. One, in the past couple of quarters, you had mentioned that you didn’t expect customers to necessarily — that they would absorb the price, but maybe adjust the volumes. I just wanted to see, as you guys have been putting in price increases for tariffs or contemplating them, does that expectation still stand where you would expect kind of volume to offset kind of price increases? And then the second question, just on Elo, any 10% customers or kind of customer concentration on their part to be mindful of?\nNathan Andrew Winters: I mean I’ll take the first one. On the price increase, I’d say it’s — we’re seeing two dynamics. I’d say on the — where we’ve raised it on some of the transactional business, we’ve seen pretty good flow-through, maybe a little bit of impact on volume, but I’d say volumes have held up pretty well on the run rate business where we’ve increased price. You will notice that we took down the amount of price we expected from the raise in April between our last guide today, and that’s primarily in mobile computing, where we’re realizing a bit less than what we had anticipated, and that’s primarily because of the electronics exemption. So for us and our competitors that have the electronics exemption, you’re not paying the higher tariff.\nOur customers know we’re not paying the higher tariffs. So you’re not seeing a market price increase, and it’s remained obviously a competitive market. So — but that’s one where we’ve maintained the higher list price. We’re managing that through concessions. The teams are still driving it because obviously, we still have more to go to fully mitigate the impact of tariffs. But I think we’re again, outside of mobile computing, we’re seeing pretty much how we expected, which is a bit of volume trade-off, but the pricing is coming through in large part.\nWilliam J. Burns: I think from an Elo perspective, diverse customer base. So I think that similar to Zebra overall, their largest customer would be distribution, right, as you see with us. But from an end customer perspective, certainly larger customers that you’d expect in retail and quick serve and others are larger customers for them, but no 10% concentration and overall pretty diverse customer mix across retail, quick-serve restaurants, hospitality, health care, industrial applications in the markets they serve overall. But some higher concentrated customers just as we see with Zebra, larger customers buy more from us.\nOperator: Our next question comes from Ken Newman with KeyBanc Capital Markets.\nKen Newman: Maybe first, Nathan, just going back on the $40 million of annualized price that you expect to realize this year. Is there a way to just talk about how much pricing you were able to drive in 2Q, just given that I think the headwinds you were expecting last quarter were a lot higher. I just didn’t know if maybe we saw a potential opportunity for better price cost than you were expecting and if we should expect that to kind of normalize out in the back half?\nNathan Andrew Winters: Yes. So it was a little less than $10 million of price gain in the second quarter. So again, a bit less than we had anticipated, but for the same reasons I mentioned on the full year dynamic where, again, with we had raised the prices across the Board in anticipation to give ourselves the ability to react quickly. And I think we still have that optionality, particularly on things like mobile computing, where we saw a higher list price and we can manage and again, that price differentiation through concessions and approvals. So that’s where we just have extra eyes and making sure we’re making those right decisions on a deal-by-deal basis. So look, I think similar to what we said last time, I’d like to see a bit more stability and see if the rates kind of hold here through the next month or 2 and then obviously come back with a plan with the goal is to fully mitigate as we — at some point in 2026.\nI think we’re a lot closer to getting that certainty, but we’d like to see maybe how the next couple of weeks play out. And if anything changes from the rates by country or the electronics exemption or what happens from a semiconductor. So still a lot at play that we’re monitoring. But once we have that clarity, again, like I mentioned last time, the goal is to fully mitigate through all the levers that we have available.\nKen Newman: Got it. Okay. And for the follow-up, Bill, anything of note as we think about Elo’s supply chain? Just any idea or color on how much of their manufacturing is international and then how to think about potential tariff exposure there?\nWilliam J. Burns: Nathan, do you want to take it?\nNathan Andrew Winters: Yes, I can take that. I think it’s very similar to our supply chain. The one difference, they do own a manufacturing facility in China that does a lot of their primary production for touchscreens, touch panel modules as well as their monitors. And we actually think it’s a great opportunity for leveraging their expertise in that market, the local knowledge they have around the supply base for areas like our tablet. So we’re excited to see what opportunities are there by leveraging that facility that’s really world-class. And then similar to us, they use contract manufacturers for final assembly across Southeast Asia. So they have a plan in place, very similar to ours, which is to mitigate tariffs by year-end through price increases they did in the early part of second quarter as well as production moves that they are currently executing on.\nSo we spent a lot of time with the team understanding their plans. But I’d say at a macro view, very similar supply chain with the use of contract manufacturers across Southeast Asia. The one difference being an owned facility in China, which is — that holds some key technology and something we’re excited to learn of how we can further leverage across our portfolio.\nOperator: Our last question comes from Brian Drab with William Blair.\nBrian Paul Drab: Sorry, I had to join late. Did you say if gross margin up or down sequentially in the third quarter, second half? Any specifics around trajectory for gross margin?\nNathan Andrew Winters: Yes. So gross margin for the third quarter operationally is, I’d say, relatively flat, both in terms of implied as well as — so again, the tariff impact is fairly similar between Q2 and Q3. Mix isn’t — volume is pretty similar, mix is pretty similar. So I’d say similar expectations as we go from Q2 to Q3 on a gross margin basis.\nBrian Paul Drab: Okay. And then just on government and health care, can you comment on those end markets? I know you said health care tough comps in the second quarter, but second half, what are you seeing in those end markets? And that’s it for me.\nWilliam J. Burns: Yes. Thanks. I think we feel good about health care overall. I think the cycling year-on-year compares of mobile computing, still clearly an opportunity for us. I mean some would say that the barcode literally is the unsung hero of that makes health care work, right? Think of all the track and trace, the idea of identifying patients, specimens, the information input into electronical medical records that we take for granted here in the U.S., but it still has extensive growth around the world is no one — not many countries around the world have quite the extensive use of electronic medical records that we have in the U.S. I think things like clinical mobility playing a role. The Elo acquisition plays a role in self-service and health care.\nSo we feel good about the health care market. We have some new devices out, wearable device in the idea of voice devices for health care that we’re excited about that we released at the HIMSS show earlier this year. Government continues to be a focus for us around things like inventory, large RFID win earlier this year around tracking inventory within government opportunities around inventory tracking. So we feel good about that. Public safety in Europe, we see as an opportunity. We have some new devices we’re releasing as public safety is moving in Europe to more 5G type networks, right, and specialized networks and moving off of specialized networks to more 5G type networks, and we’ve got some new devices to meet the needs of European customers inside public safety.\nSo government, smallest vertical overall, but an opportunity for us, especially as public safety evolves in Europe and as inventory becomes more important. Health care has been our fastest-growing vertical. It just so happens that tough compares this quarter, but we feel good about that market.\nOperator: This concludes our question-and-answer session. I would like to turn the conference back over to Bill Burns for any closing remarks.\nWilliam J. Burns: I’d like to thank our employees and partners for their support as we delivered strong Q2 results. Certainly look forward to welcoming the Elo team as the acquisition closes. Have a great day, everyone.\nOperator: The conference has now concluded. Thank you for attending today’s presentation. You may now disconnect."
    },
    {
      "url": "https://www.insidermonkey.com/blog/ariel-investments-small-cap-value-strategys-q2-2025-investor-letter-1595481/",
      "text": "Artificial intelligence is the greatest investment opportunity of our lifetime. The time to invest in groundbreaking AI is now, and this stock is a steal!\nAI is eating the world—and the machines behind it are ravenous.\nEach ChatGPT query, each model update, each robotic breakthrough consumes massive amounts of energy. In fact, AI is already pushing global power grids to the brink.\nWall Street is pouring hundreds of billions into artificial intelligence—training smarter chatbots, automating industries, and building the digital future. But there’s one urgent question few are asking:\nWhere will all of that energy come from?\nAI is the most electricity-hungry technology ever invented. Each data center powering large language models like ChatGPT consumes as much energy as a small city. And it’s about to get worse.\nEven Sam Altman, the founder of OpenAI, issued a stark warning:\n“The future of AI depends on an energy breakthrough.”\nElon Musk was even more blunt:\n“AI will run out of electricity by next year.”\nAs the world chases faster, smarter machines, a hidden crisis is emerging behind the scenes. Power grids are strained. Electricity prices are rising. Utilities are scrambling to expand capacity.\nAnd that’s where the real opportunity lies…\nOne little-known company—almost entirely overlooked by most AI investors—could be the ultimate backdoor play. It’s not a chipmaker. It’s not a cloud platform. But it might be the most important AI stock in the US owns critical energy infrastructure assets positioned to feed the coming AI energy spike.\nAs demand from AI data centers explodes, this company is gearing up to profit from the most valuable commodity in the digital age: electricity.\nThe “Toll Booth” Operator of the AI Energy Boom\n- It owns critical nuclear energy infrastructure assets, positioning it at the heart of America’s next-generation power strategy.\n- It’s one of the only global companies capable of executing large-scale, complex EPC (engineering, procurement, and construction) projects across oil, gas, renewable fuels, and industrial infrastructure.\n- It plays a pivotal role in U.S. LNG exportation—a sector about to explode under President Trump’s renewed “America First” energy doctrine.\nTrump has made it clear: Europe and U.S. allies must buy American LNG.\nAnd our company sits in the toll booth—collecting fees on every drop exported.\nBut that’s not all…\nAs Trump’s proposed tariffs push American manufacturers to bring their operations back home, this company will be first in line to rebuild, retrofit, and reengineer those facilities.\nAI. Energy. Tariffs. Onshoring. This One Company Ties It All Together.\nWhile the world is distracted by flashy AI tickers, a few smart investors are quietly scooping up shares of the one company powering it all from behind the scenes.\nAI needs energy. Energy needs infrastructure.\nAnd infrastructure needs a builder with experience, scale, and execution.\nThis company has its finger in every pie—and Wall Street is just starting to notice.\nWall Street is noticing this company also because it is quietly riding all of these tailwinds—without the sky-high valuation.\nWhile most energy and utility firms are buried under mountains of debt and coughing up hefty interest payments just to appease bondholders…\nThis company is completely debt-free.\nIn fact, it’s sitting on a war chest of cash—equal to nearly one-third of its entire market cap.\nIt also owns a huge equity stake in another red-hot AI play, giving investors indirect exposure to multiple AI growth engines without paying a premium.\nAnd here’s what the smart money has started whispering…\nThe Hedge Fund Secret That’s Starting to Leak Out\nThis stock is so off-the-radar, so absurdly undervalued, that some of the most secretive hedge fund managers in the world have begun pitching it at closed-door investment summits.\nThey’re sharing it quietly, away from the cameras, to rooms full of ultra-wealthy clients.\nWhy? Because excluding cash and investments, this company is trading at less than 7 times earnings.\nAnd that’s for a business tied to:\n- The AI infrastructure supercycle\n- The onshoring boom driven by Trump-era tariffs\n- A surge in U.S. LNG exports\n- And a unique footprint in nuclear energy—the future of clean, reliable power\nYou simply won’t find another AI and energy stock this cheap… with this much upside.\nThis isn’t a hype stock. It’s not riding on hope.\nIt’s delivering real cash flows, owns critical infrastructure, and holds stakes in other major growth stories.\nThis is your chance to get in before the rockets take off!\nDisruption is the New Name of the Game: Let’s face it, complacency breeds stagnation.\nAI is the ultimate disruptor, and it’s shaking the foundations of traditional industries.\nThe companies that embrace AI will thrive, while the dinosaurs clinging to outdated methods will be left in the dust.\nAs an investor, you want to be on the side of the winners, and AI is the winning ticket.\nThe Talent Pool is Overflowing: The world’s brightest minds are flocking to AI.\nFrom computer scientists to mathematicians, the next generation of innovators is pouring its energy into this field.\nThis influx of talent guarantees a constant stream of groundbreaking ideas and rapid advancements.\nBy investing in AI, you’re essentially backing the future.\nThe future is powered by artificial intelligence, and the time to invest is NOW.\nDon’t be a spectator in this technological revolution.\nDive into the AI gold rush and watch your portfolio soar alongside the brightest minds of our generation.\nThis isn’t just about making money – it’s about being part of the future.\nSo, buckle up and get ready for the ride of your investment life!\nAct Now and Unlock a Potential 100+% Return within 12 to 24 months.\nWe’re now offering month-to-month subscriptions with no commitments.\nFor a ridiculously low price of just $9.99 per month, you can unlock our in-depth investment research and exclusive insights – that’s less than a single fast food meal!\nHere’s why this is a deal you can’t afford to pass up:\n- Access to our Detailed Report on our AI, Tariffs, and Nuclear Energy Stock with 100+% potential upside within 12 to 24 months\n- BONUS REPORT on our #1 AI-Robotics Stock with 10000% upside potential: Our in-depth report dives deep into our #1 AI/robotics stock’s groundbreaking technology and massive growth potential.\n- One New Issue of Our Premium Readership Newsletter: You will also receive one new issue per month and at least one new stock pick per month from our monthly newsletter’s portfolio over the next 12 months. These stocks are handpicked by our research director, Dr. Inan Dogan.\n- One free upcoming issue of our 70+ page Quarterly Newsletter: A value of $149\n- Bonus Content: Premium access to members-only fund manager video interviews\n- Ad-Free Browsing: Enjoy a month of investment research free from distracting banner and pop-up ads, allowing you to focus on uncovering the next big opportunity.\n- Lifetime Price Guarantee: Your renewal rate will always remain the same as long as your subscription is active.\n- 30-Day Money-Back Guarantee: If you’re not absolutely satisfied with our service, we’ll provide a full refund within 30 days, no questions asked.\nSpace is Limited! Only 1000 spots are available for this exclusive offer. Don’t let this chance slip away – subscribe to our Premium Readership Newsletter today and unlock the potential for a life-changing investment.\nHere’s what to do next:\n1. Head over to our website and subscribe to our Premium Readership Newsletter for just $9.99.\n2. Enjoy a month of ad-free browsing, exclusive access to our in-depth report on the Trump tariff and nuclear energy company as well as the revolutionary AI-robotics company, and the upcoming issues of our Premium Readership Newsletter.\n3. Sit back, relax, and know that you’re backed by our ironclad 30-day money-back guarantee.\nDon’t miss out on this incredible opportunity! Subscribe now and take control of your AI investment future!\nNo worries about auto-renewals! Our 30-Day Money-Back Guarantee applies whether you’re joining us for the first time or renewing your subscription a month later!"
    }
  ],
  "argos_summary": "Ariel Investments' second-quarter 2025 investor letter highlights the performance of its Small Cap Value Strategy amidst market volatility, with a gross return of +7.72%. The letter discusses Zebra Technologies Corporation (NASDAQ:ZBRA), noting its recent stock decline and potential for growth due to its strong brand and innovative capabilities in supply chain efficiency. The firm also emphasizes its strategic acquisitions and the importance of AI and energy infrastructure in future investments.",
  "argos_id": "V1WIB0QSK"
}