{
  "url": "https://www.androidauthority.com/pixel-screenshot-editing-android-16-qpr2-beta-1-3590223/",
  "authorsByline": "Adamya Sharma",
  "articleId": "fd6df21b0f48460eac50d804351f40a1",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2024/08/Google-Pixel-9-app-drawer-with-new-Screenshots-Pixel-Studio-and-Weather-apps.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T05:30:17+00:00",
  "addDate": "2025-08-22T05:35:24.850653+00:00",
  "refreshDate": "2025-08-22T05:35:24.850655+00:00",
  "score": 1.0,
  "title": "Google is supercharging screenshot editing on your Pixel with Android 16 QPR2 Beta 1",
  "description": "Google has introduced a new Pixel Studio-powered screenshot editing experience on Pixel phones running Android 16 QPR2 Beta 1.",
  "content": "Google has rolled out a more advanced screenshot editing experience on Pixel phones running Android 16 QPR2 Beta 1. Now, when you edit a screenshot, it opens directly in the Pixel Studio app, which offers a wider range of editing tools compared to the standard screenshot editor in Google Photos, including AI-powered editing.\n\nThe feature was first spotted by Telegram user Omar Tosca, who also shared a demo video of how it works with us (see above). Once you capture a screenshot, tapping the edit button launches Pixel Studio instead of the usual editor. From there, you can crop the image, highlight specific areas, or even select a portion of the screenshot for AI-assisted edits. Once an area in the screenshot is selected, you can simply describe the change you want, and the AI applies it. In Tosca’s video, for example, asking the AI to change colors worked instantly. However, the AI erased all the text from the chat screenshot and turned it into a random block of colors. The option currently appears with a “preview” label, which might explain why it worked the way it did.\n\nBeyond AI editing, Pixel Studio also lets you add captions to your screenshots, draw with a pen, create stickers, highlight content using a resizable highlighter, and more.\n\nIt’s worth noting that you’ll need version 2.0.001.793728176.12-release of the Pixel Studio app for this to work. When we tested it on Android 16 QPR2 Beta 1 with an older Pixel Studio version, screenshots defaulted to the standard editor instead of Pixel Studio. It’s also worth noting that the video above was recorded on a Pixel 9 Pro running the new QPR.",
  "medium": "Article",
  "links": [
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://www.androidauthority.com/news/",
    "https://www.androidauthority.com/tag/google-pixel/",
    "https://www.androidauthority.com/android-16-qpr2-beta-1-features-3586944/",
    "https://www.androidauthority.com/tag/authority-insights/",
    "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
    "https://www.androidauthority.com/tag/android-16/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "screenshot editing",
      "weight": 0.13218038
    },
    {
      "name": "Pixel Studio",
      "weight": 0.13004582
    },
    {
      "name": "AI editing",
      "weight": 0.113662206
    },
    {
      "name": "screenshots",
      "weight": 0.11348845
    },
    {
      "name": "Pixel phones",
      "weight": 0.10922589
    },
    {
      "name": "Pixel",
      "weight": 0.107742265
    },
    {
      "name": "editing tools",
      "weight": 0.08778067
    },
    {
      "name": "Telegram user Omar Tosca",
      "weight": 0.08252952
    },
    {
      "name": "an older Pixel Studio version",
      "weight": 0.078493126
    },
    {
      "name": "the Pixel Studio app",
      "weight": 0.07569818
    }
  ],
  "topics": [
    {
      "name": "Android"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.916015625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.84814453125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.66259765625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.416259765625
    }
  ],
  "sentiment": {
    "positive": 0.23043182,
    "negative": 0.19244194,
    "neutral": 0.57712626
  },
  "summary": "Google has introduced a more advanced screenshot editing experience on its Pixel phones, running Android 16 QPR2 Beta 1. When you edit a screenshot, it opens directly in the Pixel Studio app, which offers a wide range of editing tools, including AI-powered editing. The feature was first spotted by Telegram user Omar Tosca and was demonstrated in a demo video. It requires version 2.0.09.",
  "shortSummary": "Google has launched a more advanced screenshot editing tool in Android 16 QPR2, allowing users to select specific areas and create captions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a3d941bc43b845978752e7d1540f8658",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/tag/android-16/",
      "text": "Pages tagged:\nAndroid 16\nGoogle is supercharging screenshot editing on your Pixel with Android 16 QPR2 Beta 1\nScreenshots now open up in Pixel Studio for editing, unlocking a wider range of options, including AI-powered editing tools.\nAdamya Sharma2 hours ago\n0\nMatt Horne10 hours ago\n0\nNew Android parental controls make it easier to manage kids’ devices your way\nAndroid 16: Confirmed features, codename, leaks, release date, and everything else we know so far\nAamir Siddiqui17 hours ago\n0\nIn the works since Android 14, Android Canary finally offers upgraded screenshots\nHadlee Simons18 hours ago\n0\nPixel's new Welcome screen looks awfully familiar if you’ve used an iPhone\nAamir Siddiqui23 hours ago\n0\nHere's all the new features for Pixels in Android 16 QPR2 Beta 1\nMishaal RahmanAugust 20, 2025\n0\nGoogle's not done yet, with a new Android Canary release arriving for testers\nStephen SchenckAugust 20, 2025\n0\nGoogle is expanding a key anti-theft feature to make your apps more secure\nMishaal RahmanAugust 20, 2025\n0\nAndroid will finally fix your messy home screen by forcing apps to use themed icons\nStephen SchenckAugust 20, 2025\n0\nLock screen widgets are finally live on Pixel phones in Android 16 QPR2\nMishaal RahmanAugust 20, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/android-16-qpr2-beta-1-features-3586944/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nHere's all the new features for Pixels in Android 16 QPR2 Beta 1\nAugust 20, 2025\nGoogle released the first beta of Android 16’s second quarterly platform release today. We installed Android 16 QPR2 Beta 1 to find out what’s new, so read on if you’re trying to decide whether it’s worth installing on your own device or you simply want to know what’s coming in the future!\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more.\nFor this release, Google has blessedly offered a list of changes, giving us some ideas of where to start looking for these hot new features. Here’s what the company says to expect in QPR2 Beta 1:\n- UI, System Experience, and Accessibility\n- Expanded Dark Theme\n- Auto-Themed App Icons\n- Interactive Chooser Sessions\n- Smoother Android Migrations\n- PDF Document Annotation and Editing\n- Display Topology API\n- Device-aware ViewConfiguration\n- Granular Haptic Feedback Control\n- Quick Settings Tile Categories\n- Media & Audio\n- IAMF Decoding Support\n- Personal Audio Sharing in Output Switcher\n- New AAudio APIs\n- HDR/SDR Brightness Slider\n- Connectivity\n- Companion Device Management Enhancements\n- MediaRouter Network Privacy Improvements\n- Privacy & Security\n- Secure Lock Device\n- Phone Theft Protection Toggle\n- Developer Productivity\n- Widget Engagement Metrics\n- Early Warnings for 16KB Page Size Compatibility\n- Enhanced Profiling\n- More Robust Multi-Display Testing\nWe’re starting to dig in even deeper ourselves, and will be regularly updating this post with our discoveries.\nForced themed icons\nGoogle introduced a Themed Icon feature in Android 13 that allows the system to tint app icons using your wallpaper’s dominant color. The only problem is that developers needed to support this feature by providing monochromatic version of their apps’ icons. Many developers did not do this, resulting in messy home screens with inconsistent app icons.\nFortunately, Google says that Android 16 QPR2 can “automatically generate a themed icon for your app if you don’t provide a dedicated one.” The OS will apply a “color filtering algorithm to your existing launcher icon to render it in a monochrome style, allowing it to integrate with the user’s chosen theme.” Indeed, after installing QPR2 Beta 1 on my Pixel, we noticed that all app icons were now themed regardless of whether a monochromatic icon was supplied.\nYou can read more about this feature in our dedicated coverage.\nLock screen widget support for phones\nAndroid 16 QPR2 Beta 1 also brings lock screen widget support to phones, after debuting on tablets last year with Android 15 QPR1. For more details on this new feature, as well as a hands-on demo showing it off, check out our dedicated piece.\nIdentity Check expanded to more apps\nGoogle is bringing a major upgrade to Android’s Identity Check feature in Android 16 QPR2. The anti-theft feature will now protect more of your apps. When Identity Check is turned on in Android 16 QPR2, apps will no longer be allowed to accept your screen lock credentials (PIN, pattern, or password) when invoking biometric prompt. For more details, check out this article that goes in-depth on Android’s Identity Check expansion.\nExpanded dark theme\nGoogle mentioned in its blog post that Android 16 QPR2 adds a new “expanded option under dark theme” that allows the system to “intelligently invert the UI of apps that appear light despite users having selected the dark theme.” We’ve been tracking this feature for a while and actually saw it go live already in the July 2025 Android Canary release, but Google is making it official today and announcing its release in Android 16 QPR2.\nThe expanded dark theme is aimed at creating a “more consistent user experience for users who have low vision, photosensitivity, or simply those who prefer a dark system-wide appearance.” When enabled, the system uses apps’ isLightTheme attribute to determine whether to apply inversion. “If your app inherits from one of the standard DayNight themes, this is done automatically for you, otherwise make sure to declare isLightTheme=”false” in your dark theme to ensure your app is not inadvertently inverted.”\nGoogle says that sStandard Android Views, Composables, and WebViews will be inverted, while custom rendering engines like Flutter will not.” Furthermore, the system will also automatically darken your app’s splash screen and adjust the status bar color for contrast. This is intended only as an accessibility feature, hence Google recommends developers implement a native dark theme if they haven’t already.\nSDR/HDR brightness slider\nUnder Settings > Display & touch in Android 16 QPR2 Beta 1, there’s a new “enhanced HDR brightness” page, which actually went live in the first Android Canary release last month. On this page, you can control the (perceived) brightness of HDR content or stop the screen from becoming brighter entirely when HDR content is present. If you hate HDR flashbangs at night while scrolling Instagram or other social media, this feature is for you.\nGraphical apps support in the Linux Terminal\nIn Android 16 QPR2 Beta 1, the Linux Terminal app has added a “Display” activity that pipes display output from the underlying Linux VM to the Android host. This enables you to run full desktop Linux apps on your Android device. As we demonstrated earlier, you can run graphical Linux apps like GIMP, LibreOffice, Chromium, and more thanks to this new capability. You can even install a full desktop environment like XFCE and run apps that way. Check out our hands-on piece for a full tutorial on how to set this up.\nSecure Lock Device\nAndroid 16 QPR2 introduces a new “system-level security state” called “Secure Lock Device.” When Secure Lock Device is enabled (which can happen remotely via Find Hub), Google says that “the device locks immediately and requires the primary PIN, pattern, or password to unlock, heightening security.” Furthermore, “notifications and quick affordances on the lock screen will be hidden, and biometric unlock may be temporarily disabled.”\nAccording to my own sources, Secure Lock Device will also block lock screen widgets and the digital assistant from being accessed.\nPhone Theft Protection toggle\nAs we previously reported, Google will soon add a toggle in Android 16 QPR2 that lets you disable Failed Authentication Lock. The company says that “a user-facing toggle is being added to Theft Protection Settings, allowing users to enable or disable the ‘Failed Authentication Lock’ security feature (introduced in Android 15) that automatically locks down your device after multiple failed login attempts.”\nThis toggle is not yet live in Android 16 QPR2 Beta 1.\n90:10 split screen ratio\nAndroid 16 QPR2 Beta 1 brings the long-awaited 90:10 split screen ratio, which is heavily inspired by (but not directly based on) OPPO’s Boundless View (also known as Open Canvas on OnePlus devices). Again, this is another one of those features that first went live in the Android Canary release, so we’re not too surprised to see it here. Still, it’s good to know that this feature is planned for launch in QPR2.\nThis article will be updated as we find new features. Check back later for more information!\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/tag/google-pixel/",
      "text": "Pages tagged:\nGoogle Pixel\nSome Pixel owners are getting a more powerful At A Glance widget\nSports and finance cards are showing up in the At A Glance widget for Pixel phones.\nHadlee Simons43 minutes ago\n0\nAdamya Sharma2 hours ago\n0\nGoogle is supercharging screenshot editing on your Pixel with Android 16 QPR2 Beta 1\nGoogle just gave your Pixel a new hub for everything, with one big catch\nAdamya Sharma4 hours ago\n0\nAndroid 17: Leaked features, codename, release date, and everything else we know so far\nAamir Siddiqui16 hours ago\n0\nDon't panic: Losing SIM cards on the Pixel 10 is actually a good thing\nJoe Maring21 hours ago\n0\nGoogle's silence on the Pixel 10 GPU is concerning for gamers\nHadlee Simons21 hours ago\n0\nPre-ordering the Pixel 10 or Pixel Watch 4? Read this before checking out\nJoe Maring22 hours ago\n0\nThe Pixel 10 series brings even more panorama mode upgrades\nHadlee Simons22 hours ago\n0\nPixel's new Welcome screen looks awfully familiar if you’ve used an iPhone\nAamir Siddiqui23 hours ago\n0\nThe first Pixel 10 Pro Res Zoom samples show up online, and they're pretty bad\nHadlee Simons24 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/tag/authority-insights/",
      "text": "Pages tagged:\nAuthority Insights\nGoogle is supercharging screenshot editing on your Pixel with Android 16 QPR2 Beta 1\nScreenshots now open up in Pixel Studio for editing, unlocking a wider range of options, including AI-powered editing tools.\nAdamya Sharma2 hours ago\n0\nMatt Horne14 hours ago\n0\nGoogle is testing more nuanced punctuation options in Gboard (APK teardown)\nCan't recall that café from Tuesday? Google Maps has a new feature to jog your memory (APK teardown)\nRyan McNeal16 hours ago\n0\nOne UI 8 could let you silence the most annoying system indicator (APK teardown)\nMatt Horne16 hours ago\n0\nThis upcoming Google Maps feature could be a game-changer for group planning (APK teardown)\nAamir Siddiqui17 hours ago\n0\nIn the works since Android 14, Android Canary finally offers upgraded screenshots\nHadlee Simons18 hours ago\n0\nHere's how Google Photo's new Tinder-like swiping feature works (APK teardown)\nTushar Mehta21 hours ago\n0\nPixel's new Welcome screen looks awfully familiar if you’ve used an iPhone\nAamir Siddiqui23 hours ago\n0\nHere's all the new features for Pixels in Android 16 QPR2 Beta 1\nMishaal RahmanAugust 20, 2025\n0\nSwitching from iPhone to Pixel 10? It'll soon be easier to transfer your eSIM (APK teardown)\nTushar MehtaAugust 20, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nWant more Android Authority? How to set us as your preferred source in Google Search\nAugust 12, 2025\nSince 2007, Android Authority has strived to bring all of our readers the very best coverage of Android and the mobile tech world. And even after 18+ years as a proudly independent media outlet, we’re as driven as we’ve ever been to bring you all the latest exclusive reports, app teardowns, leaks, hands-on reviews, experience-based features, lab testing, and other expert analysis.\nOf course, how we’ve been able to get that coverage to you has changed in countless ways during that time, be it via our website, YouTube channel, social media, or new projects like Authority Insights, which combines our elite reporting with a podcast and a newsletter, as well as our brand new YouTube channel from Android Authority‘s Pixel guy, C. Scott Brown.\nWe want to continue to bring you the very best Android and mobile tech coverage, and you can help us do that.\nWe know and deeply appreciate that so many of you repeatedly visit our website and other channels to constantly see what we’ve been working on, often every day. Every one of those clicks or interactions helps us remain independent and every bit as innovative and ambitious as we’ve been since day one.\nSo, if you want to see even more of our content, guarantee you don’t miss anything from us, or just want to continue to support our mission, we’d like to ask you a big favor and set Android Authority as a preferred source in Google Search. It only takes a few seconds, it doesn’t cost you anything, and it will help us continue to bring you the best possible content for the next decade and beyond.\nThis feature is currently only available in the US and India, but we’ll let you know when other regions are included in this new feature. For those who already have it, here’s how to do it:\nHow to set Android Authority as a preferred source\nMethod 1:\n- Head to this link and you can add us directly to your list of preferred sources.\nMethod 2:\n- Search for a topic that’s in the news and find the “Top stories” header. If you don’t see this, you might need to input a different query. “Galaxy S26 Pro” worked for us at the time of writing.\n- Click on the icon on the right of the “Top stories” header. That’s the icon with the stacked squares and a star on top.\n- Search for “Android Authority” and select it to set it as a preferred source. You can add other websites at this stage, too — support your favorite publications!\n- Refresh your search results to see more from your favorite sites.\nOnce again, a big thank you to all our readers, viewers, and followers — your passion for Android and tech is what pushes us forward. We hope you’ll add us as a preferred source (and please feel free to encourage any other tech enthusiasts you know to do the same!), but even if you don’t, we’re grateful for every one of you that supports our work in any way possible. And as ever, if you have any feedback for us, please drop an email to contact@androidauthority.com.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nYouTube's new integration lets you discover live concerts nearby, with a sweet Premium perk\nRolling out first on YouTube, this new feature will make it much easier to discover concert dates for your favorite artists.\nAdamya Sharma\nSome Pixel owners are getting a more powerful At A Glance widget\nHadlee Simons49 minutes ago\n0\nGoogle is supercharging screenshot editing on your Pixel with Android 16 QPR2 Beta 1\nAdamya Sharma2 hours ago\n0\nGoogle just gave your Pixel a new hub for everything, with one big catch\nAdamya Sharma4 hours ago\n0\nGoogle's mysterious new smart speaker could offer spatial surround sound\nThat mysterious smart speaker in Google's video is real and some of its details have leaked.\nRyan McNeal\nNew Android parental controls make it easier to manage kids’ devices your way\nMatt Horne10 hours ago\n0\nGoogle killed this feature so the Pixel 10 could have Qi2 wireless charging\nRyan McNeal12 hours ago\n0\nDon't hold your breath for a new Pixel Tablet\nStephen Schenck12 hours ago\n0\nOur latest\nYouTube Music at 10 wants to make fandom more interactive\nMatt Horne12 hours ago\n0\nGoogle just made it a whole lot easier to access Password Manager\nRyan McNeal14 hours ago\n0\nGoogle is testing more nuanced punctuation options in Gboard (APK teardown)\nMatt Horne14 hours ago\n0\nJamboard escapes the Google graveyard with a new lease on life from LineageOS\nStephen Schenck15 hours ago\n0\nCan't recall that café from Tuesday? Google Maps has a new feature to jog your memory (APK teardown)\nRyan McNeal16 hours ago\n0\nOne UI 8 could let you silence the most annoying system indicator (APK teardown)\nMatt Horne16 hours ago\n0\nDeal: Remember, the Samsung Galaxy Z Fold 7 is still $300 off\nEdgar Cervantes16 hours ago\n0\nThe Pixel 10 Pro's new always-on display finally shows your full wallpaper\nMishaal Rahman17 hours ago\n0\nThis upcoming Google Maps feature could be a game-changer for group planning (APK teardown)\nAamir Siddiqui17 hours ago\n0\nDon't pay full price for the XM6! The Sony WH-1000XM5 are $126 off!\nEdgar Cervantes17 hours ago\n0\nGoogle Search can now present real-time table booking results, but only if you pay up for AI\nTushar Mehta17 hours ago\n0\nSamsung Galaxy S25 Edge price drops further, saving you $270\nEdgar Cervantes18 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    }
  ],
  "argos_summary": "Google has introduced an enhanced screenshot editing feature for Pixel phones with the Android 16 QPR2 Beta 1, allowing users to edit screenshots directly in the Pixel Studio app. This new app offers advanced editing tools, including AI-powered options that enable users to describe changes they want to make, although initial tests showed some limitations. Additionally, Pixel Studio provides various editing functionalities such as cropping, highlighting, and adding captions.",
  "argos_id": "X7GNNSDLK"
}