{
  "url": "https://finance.yahoo.com/news/talking-employer-breastfeeding-121600351.html",
  "authorsByline": "PR Newswire",
  "articleId": "862468d55701447bad98dca26b027ac6",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/ddffc6c918665a41ab8012ee01db439a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T12:16:00+00:00",
  "addDate": "2025-08-22T12:27:27.830273+00:00",
  "refreshDate": "2025-08-22T12:27:27.830275+00:00",
  "score": 1.0,
  "title": "Talking to Your Employer About Breastfeeding at Work",
  "description": "As millions of parents across the country prepare for the chaos of back-to-school season, one question continues to loom for many new mothers returning to work: Where will I pump?",
  "content": "NEW YORK, Aug. 22, 2025 /PRNewswire/ -- As millions of parents across the country prepare for the chaos of back-to-school season, one question continues to loom for many new mothers returning to work: Where will I pump?\n\nIn 2025, working moms are still navigating serious challenges, from limited paid leave to a lack of practical support like lactation spaces, mental health resources, and flexible scheduling. That's why Mediaplanet launched the Empowering Working Moms campaign — a national initiative featured in USA TODAY and online — to elevate the voices of mothers, employers, and advocates working to build more supportive and equitable workplaces.\n\nA key partner in that mission is Nessel, a women-led company designing workplace lactation solutions that make compliance effortless and culture change possible. Through products like ready-to-install lactation pods and lactation stations, Nessel helps employers turn legal requirements into real support by creating spaces that signal dignity, care, and flexibility.\n\nWhile the 2022 PUMP Act gives most employees the right to a private, non-bathroom space to express breastmilk, starting the conversation about pumping at work can still feel awkward or intimidating. Nessel believes it shouldn't be and that every parent deserves to feel seen, supported, and empowered.\n\nIf you're wondering how to talk to your employer about breastfeeding at work, here are a few ways to start the conversation:\n• Know your rights: Under the PUMP Act, employers with 50+ employees must provide a private lactation space and reasonable pumping breaks.\n• Be clear and confident: Share how often you need to pump, how long it will take, and what type of space or storage is required.\n• Reinforce your commitment: Make it known this isn't about stepping away from responsibilities — it's about integrating your needs into your workflow.\n• Offer solutions: If no lactation space exists, suggest proven options like Nessel's lactation pods and lactation stations.\n• Keep it ongoing: Your needs may change, and that's okay. Continue the conversation as needed.\n\nFrom built-in sinks and fridges to soundproofing and ergonomic seating, Nessel's thoughtful design ensures pumping parents can do so comfortably and without disruption while helping companies boost retention, reduce absenteeism, and foster a culture of care.\n\nTo learn more about workplace lactation solutions, visit www.nessel.com.\n\nTo explore the full Empowering Working Moms campaign — featuring stories, expert insights, and solutions from Allyson Felix, SHRM, U.S. Breastfeeding Committee and more — visit: futureofbusinessandtech.com/working-moms.",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/2746504/Mediaplanet_breastfeeding_campaign.html",
    "https://c212.net/c/link/?t=0&l=en&o=4484272-1&h=2379064863&u=http%3A%2F%2Fwww.nessel.com%2F&a=www.nessel.com",
    "https://c212.net/c/link/?t=0&l=en&o=4484272-1&h=2549550665&u=https%3A%2F%2Fwww.usbreastfeeding.org%2Fthe-pump-act-explained.html&a=2022+PUMP+Act"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "lactation spaces",
      "weight": 0.110163026
    },
    {
      "name": "workplace lactation solutions",
      "weight": 0.09964423
    },
    {
      "name": "lactation stations",
      "weight": 0.0890973
    },
    {
      "name": "space",
      "weight": 0.079333484
    },
    {
      "name": "spaces",
      "weight": 0.079333484
    },
    {
      "name": "pumping parents",
      "weight": 0.07636616
    },
    {
      "name": "Empowering Working Moms",
      "weight": 0.07633985
    },
    {
      "name": "Working Moms",
      "weight": 0.068329506
    },
    {
      "name": "Nessel",
      "weight": 0.067207456
    },
    {
      "name": "employers",
      "weight": 0.06675688
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.76708984375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.75732421875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.6025390625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.51513671875
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.334716796875
    }
  ],
  "sentiment": {
    "positive": 0.31527728,
    "negative": 0.22962233,
    "neutral": 0.45510036
  },
  "summary": "The Empowering Working Moms campaign has been launched by Mediaplanet to raise awareness about breastfeeding at work. The campaign includes a national initiative featuring women-led companies Nessel and Natus. Nessel designs workplace lactation solutions that make compliance effortless and culture change possible. While the 2022 PUMP Act allows employees to express breastmilk privately, starting the conversation about pumping at work can still feel awkward or intimidating. Natus's solutions include lactation pods and lactation stations designed to provide comfort and flexibility for pumping.",
  "shortSummary": "The Empowering Working Moms campaign aims to empower and support working mothers by providing workplace lactation spaces and flexible scheduling options, with Nessel's innovative solutions enhancing compliance and culture.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "61003f50a8af4cc7b502742d94c7f32a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4484272-1&h=2379064863&u=http%3A%2F%2Fwww.nessel.com%2F&a=www.nessel.com",
      "text": "Everything you need for the perfect lactation space.\nNessel makes furniture for lactation and wellness rooms, including lactation stations, lactation pods, and portable sinks.\nMeet federal and state regulations with our beautifully designed furniture.\nModern design\nmeets health.\nNessel is innovative design built to support physical and mental health. We make furniture that creates sanitary and supportive wellness and lactation rooms anywhere.\nLactation Stations\nInstantly transform any room into a clean and comfortable space for pumping employees.\nLactation PODs\nNo room? No problem. Nessel lactation PODs offer privacy anywhere, anytime.\nHandwashing Stations\nPortable sinks with touchless faucets enhance cleanliness everywhere. Multiple size options.\nConsulting & Custom\nConsulting services and custom design tailored to meet your strategy and design needs.\nConsulting Services & Custom Design\nWe’re proud to work with these organizations.\nWe work with great organizations.\nWhy is creating lactation space important?\n3x\nFor every $1 spent on corporate lactation programs, companies make back $3 in cost savings. Creating safe and sanitary lactation space is not just good, it’s good business.\n1.5\nProductivity while pumping matters. Did you know that breastfeeding employees pump an average of 3x per day for 30 minutes each session. That’s 1.5 hours during an 8 hour workday.\nPUMP\nDid you know that the PUMP Act, which expands legislation protecting nursing workers, went into effect on April 28, 2023. Are you prepared? Learn more\nWe love to delight our clients.\nSee what our clients are saying!\n“Easy delivery and beautiful product.”\nGuardant Health\n\"Nessel is very easy to set it up, use it and very comfortable.\"\nExos Financial\n\"Some of the best customer service.\"\nNew York State Union Teachers\n\"Excellent service and product!\"\nClarity Surgical and Weightloss Solutions\n\"Very convenient and useful during these times!\"\nNewark Public Schools\n\"Great portable sinks!! Very attractive and easy to use.\"\nNational Cathedral School\n\"The portable sink was an added value. It allowed the hand washing to be done in the classroom or outside where no wash facilities were located.\"\nChildren's Day School\n\"Professional accommodating service. Excellent product. On time delivery. And the Moms LOVE it!!!!\"\nDesign Milagros\nHow to comply with\nThe PUMP Act:\nWhen The PUMP Act went into effect on April 28, employers with over 50 employees are now legally required to provide:\n- A private space, not a bathroom\n- Space that is free from intrusion\n- Reasonable break time to express breast milk\n- Learn more on how to comply with the law\nHealthy lactation space matters now more than ever.\nNo construction, no plumbers. It’s easy. We’re the health-based furniture manufacturers who have figured out the details, and all you need to use our products is a power outlet.\nNessel stations include self-contained plumbing and thoughtful, ergonomic design.\nBe up-and-running in minutes with our fully assembled shipment."
    }
  ],
  "argos_summary": "As back-to-school season approaches, new mothers returning to work face challenges such as limited lactation spaces and support. The Empowering Working Moms campaign, launched by Mediaplanet, aims to address these issues by promoting workplace lactation solutions, particularly through Nessel's innovative products like lactation pods and stations. The campaign emphasizes the importance of understanding rights under the PUMP Act, which mandates private lactation spaces for employees, and encourages ongoing conversations between mothers and employers to create supportive work environments.",
  "argos_id": "Y3GO4JDT9"
}