{
  "url": "https://www.techradar.com/home/home-security/swanns-new-subscription-free-home-security-camera-stays-charged-with-just-45-minutes-of-sunlight-per-day",
  "authorsByline": "Cat Ellis",
  "articleId": "a7e2e1a0589c4890a464fba0fbd214a0",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/DRV2iN7JEH2xkPb8RbY9n6.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T11:28:21+00:00",
  "addDate": "2025-08-22T11:37:00.026050+00:00",
  "refreshDate": "2025-08-22T11:37:00.026053+00:00",
  "score": 1.0,
  "title": "Swann's new subscription-free home security camera stays charged with just 45 minutes of sunlight per day",
  "description": "No more replacing batteries or paying monthly fees",
  "content": "• The EVO Wireless Solar can be powered by 45 minutes of sunlight per day\n• The camera also has 16GB local storage, so you don't need a subscription\n\nSwann, the company behind some of the best home security cameras we've tested here at TechRadar, has launched a new compact outdoor camera that you'll never need to take down for recharging, and which doesn't require a subscription plan to save and review your video footage.\n\nThe Swann EVO Wireless Solar is a compact weather-resistant camera (much smaller than the all-seeing Swann MaxRanger4K Solar), and can run all day with just 45 minutes of sunlight exposure, giving you plenty of flexibility as to where you mount it.\n\nThe camera comes with a 16GB SD card, so you can save your footage locally and keep full control over it. If you do decide that you want to keep clips in the cloud, the free Swann Secure plan gives you 1-7 days of cloud recording for a single camera.\n\nThe EVO Wireless Solar records at 2K with a 120-degree field of view, and offers infrared night vision for spotlight-free recording after dark. There's two-way audio as well, letting you speak to visitors and warn off potential intruders.\n\nThe Swann EVO Wireless Solar has a list price of $129.99 / £99.99 / AU$179.95, and is available to buy direct from Swann.\n\nFor comparison, the Ring Outdoor Camera Plus Battery is $79.99 / £79.99 / AU$179, but lacks solar charging, and requires a Ring Home plan if you want to store your recordings. For more details of what you get with Ring Home, see our guide do I need a Ring subscription.\n\nThe price difference between the wireless Swann and Ring cameras disappears immediately if you want solar charging, since Ring's solar panels start at $39.99 / £39.99 / AU$59 each.\n\nWe're hoping to test the Swann EVO Wireless Solar soon, to see how it compares with other wireless cams in its price bracket and above.\n\nYou might also like\n• How to install a smart lock in six simple steps\n• Roku's new wireless security cameras will guard your home for up to two years on a single charge\n• Eufy's new smart lock reads the veins in your palm for touchless entry – even if your hands are dirty",
  "medium": "Article",
  "links": [
    "https://www.techradar.com/news/best-home-security-camera",
    "https://www.techradar.com/seasonal-sales/swann-doorbell-pre-prime-day-deal",
    "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3311890142616781183&xs=1&url=https%3A%2F%2Fwww.swann.com&sref=https%3A%2F%2Fwww.techradar.com%2Fhome%2Fhome-security%2Fswanns-new-subscription-free-home-security-camera-stays-charged-with-just-45-minutes-of-sunlight-per-day",
    "https://www.techradar.com/home/home-security/eufy-familock-s3-max-launch",
    "https://www.techradar.com/home/home-security/how-to-install-a-smart-lock",
    "https://www.techradar.com/home/home-security/maxranger4k-solar-review",
    "https://www.techradar.com/home/smart-home/do-i-need-a-ring-subscription-heres-what-to-consider",
    "https://www.techradar.com/home/home-security/im-a-smart-home-tech-reviewer-and-these-are-the-top-3-subscription-free-home-security-cameras-i-recommend",
    "https://www.techradar.com/home/home-security/rokus-new-wireless-security-cameras-will-guard-your-home-for-up-to-two-years-on-a-single-charge",
    "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5327010872913343297&xs=1&url=https%3A%2F%2Fuk.swann.com%2Fsecure-plans%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fhome%2Fhome-security%2Fswanns-new-subscription-free-home-security-camera-stays-charged-with-just-45-minutes-of-sunlight-per-day",
    "https://www.techradar.com/home/smart-home/i-test-smart-home-tech-for-a-living-and-these-are-the-top-3-subscription-free-video-doorbells-i-recommend"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "EVO Wireless Solar",
      "weight": 0.10274841
    },
    {
      "name": "Swann",
      "weight": 0.08721438
    },
    {
      "name": "Ring Home",
      "weight": 0.086274266
    },
    {
      "name": "MaxRanger4K Solar",
      "weight": 0.081425376
    },
    {
      "name": "Ring",
      "weight": 0.07608189
    },
    {
      "name": "The Swann EVO Wireless Solar",
      "weight": 0.075143375
    },
    {
      "name": "the Swann EVO Wireless Solar",
      "weight": 0.075143375
    },
    {
      "name": "Swanns new subscription-free home security camera",
      "weight": 0.07022517
    },
    {
      "name": "Rokus new wireless security cameras",
      "weight": 0.06966557
    },
    {
      "name": "cloud recording",
      "weight": 0.06772747
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.435302734375
    },
    {
      "name": "/News/Technology News",
      "score": 0.416015625
    }
  ],
  "sentiment": {
    "positive": 0.3115228,
    "negative": 0.082848184,
    "neutral": 0.605629
  },
  "summary": "Swann, the company behind some of the best home security cameras, has launched a subscription-free outdoor camera, the Swann EVO Wireless Solar. The camera can stay charged with 45 minutes of sunlight per day and has 16GB local storage. It records at 2K with a 120-degree field of view and offers infrared night vision for spotlight-free recording after dark. The device also features two-way audio to communicate with visitors and potential intruders. The price difference between the two companies is negligible if you want solar charging, as solar panels start at $39.99 / £39.",
  "shortSummary": "Swann's EVO Wireless Solar, powered by 45 minutes of sunlight, offers compact weather-resistant cameras with 16GB local storage, and includes solar charging and full control.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "542828769833478c9a0e500ea81d95d8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techradar.com/home/smart-home/do-i-need-a-ring-subscription-heres-what-to-consider",
      "text": "Do I need a Ring subscription? Here's what to consider\nIn October 2024, Ring Protect subscription plans were renamed Ring Home. The company also renamed its subscription tiers, added a new tier for users in the UK, and added several new features to its two top tiers. This article has been updated to reflect those changes.\nIt's been a year since Ring announced its last price hike, which was its second 40% increase over the span of two years. We think it's unlikely, especially given the negative user response, that the prices will increase in the next six months; but after that, it's anyone's guess. A combination of increased competition, challenging market conditions, and a plateauing user base likely informed Amazon's decision to hike the price of Ring's subscription plan in the first place, and it's not like things have improved, so if the price is right, sign up for a year-long membership to secure it.\n- Josephine Watson, Managing Editor of Lifestyle\nSo you've chosen a Ring security camera or one of the best video doorbells to protect your home. Now you've got another choice to make: whether or not to sign up for the optional Ring subscription, which brings a number of additional features for a monthly fee.\nThe subscription is now called Ring Home, but was known as Ring Protect until October 2024. The price stayed the same immediately after the rebrand, but Ring had already increased its individual device pricing by 43% earlier in the year. You'll find more details below.\nThat means it's even more important to figure out whether or not a Ring Home subscription is right for you. Read on to find out exactly how much you're going to have to pay each month, what Ring's competitors are charging, and whether it's worth the cost.\nDoes Ring work without a subscription?\nYes, your Ring camera or doorbell will work without a Ring Home subscription – though you won't get all of the features that come with being a subscriber.\nIf you don't want to pay up, then your Ring device will still happily alert you about any activity that happens in front of your camera or video doorbell. You'll also be able to get a live feed from the camera or doorbell through the mobile app, whether it's when you've had an alert on your device, or any other time. This is the core functionality that's included as standard, and which doesn't need any extra payment.\nThe big difference comes with video recording. If you don't have a subscription, your video clips aren't stored anywhere. You can't go back and view your camera feed from last week, for example, and if you miss a notification from your video doorbell then you can't then go back several hours later and see footage from what you missed.\nHow much is a Ring subscription?\nThere are three Ring Home tiers to choose from. The cheapest, Ring Home Basic, is $4.99 / £4.99 / AU$4.95 per month or $49.99 / £49.99 / AU$49.95 per year (essentially giving you two months free) – a hike of 43% from what it cost prior to March 2024.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nRing Home Standard is for multiple cameras and doorbells, as opposed to the Basic plan which is just for a single device. Right now, Ring Home Standard will cost you $10 / £8 / AU$15 a month or $100 / £80 / AU$150 a year. This tier also gives you Extended Live View, which lets you watch footage from your camera for 30 minutes at a time, and the ability to receive doorbell interactions as calls to your phone, making it easier to speak to visitors when you're away from home.\nIf you're in the US or UK, you can subscribe to Ring Home Premium, which includes everything in Home Standard and adds 24/7 professional monitoring for your alarms. Essentially, your alerts go to Ring as well as you, and either you or the Ring team can request an emergency response to an incident.\nRing Home Premium also offers 24/7 recording for eligible wired cameras, which even captures things happening outside the motion capture zone, and Continuous Live View, which allows you to watch your camera feed for as long as you like, provided the camera has 24/7 recording enabled.\nRing Home Premium costs $19.99 / £15.99 a month or $200 / £159.99 a year. There are currently no details about when it will be available in Australia, or how much it will cost there.\nWhat happens if I don't subscribe to Ring Home?\nIf you don't subscribe to Ring Home, your camera or doorbell won't suddenly become useless: you'll still get alerts when something happens, and you'll still be able to view a live video feed at any time. You'll also be able to use two-way audio – to talk to a delivery driver at the door, for example.\nWhat the Ring Home Basic (for a single device) and Ring Home Standard (for multiple devices) plans add are extended video storage facilities, so you can go back and look at older footage and alerts. You also get smarter alerts, so your cameras can recognize the difference between people, packages, and anything else that might be passing.\nIt's worth bearing in mind that new Ring cameras and doorbells usually come with a 30-day free trial of the Ring Home service. If you're wondering why you're getting an extended video history without having paid any money, that's probably why – when the free trial ends, you'll be left with just the basic functionality.\nHow long are Ring videos saved without a subscription?\nOne of your biggest concerns if you're not paying for a Ring Home subscription is likely to be the status of your videos. This is the crux of the free plan vs paid plan debate: if you're a paid up subscriber, then your recorded videos (as triggered by motion sensing) are all available from the cloud for 30 days.\nYou can actually adjust this to suit yourself: you can dial down the storage time to one day, or all the way up to 180 days (if you're in the UK – the US and Australia limit is 30 days). If you need videos for longer than the limit you've set, you can download them to a local device from the cloud.\nWithout a subscription, there's no saving of videos at all: you can't go back and look at older alerts, and you can't record footage from the live view either (if you need evidence of something happening on your property). All you can do is look at the live video feed as it's coming through your cameras or doorbells.\nIs it worth paying for a Ring subscription?\nSo, is it worth paying for a Ring Home subscription? That's the million dollar question – or rather the $4.99 / £4.99 / $4.95 per month question. Ultimately it's down to how much you're willing to spend, and how useful you find video storage: it's probably more important to you if you're not always able to check your phone right away, for instance.\nWe should also point out that several other security camera and doorbell companies charge for similar subscriptions too: Google Nest Aware plans start at $8 / £6 / AU$12 per month or $80 / £60 / AU$120 per year, while Arlo Secure will set you back from $7.99 / £4.49 / AU$7.99 per month (if you're in the UK, you can also pay £44.90 per year).\nThere are also security cameras and video doorbells that don't need a subscription, and which can store video locally – see the Eufy range of products for one example. You might want to compare these other products and their subscription plans (or lack of them) before deciding whether or not to pay for a Ring subscription.\nYou might also like\nDave is a freelance tech journalist who has been writing about gadgets, apps and the web for more than two decades. Based out of Stockport, England, on TechRadar you'll find him covering news, features and reviews, particularly for phones, tablets and wearables. Working to ensure our breaking news coverage is the best in the business over weekends, David also has bylines at Gizmodo, T3, PopSci and a few other places besides, as well as being many years editing the likes of PC Explorer and The Hardware Handbook.\n- Josephine WatsonManaging Editor, Lifestyle"
    },
    {
      "url": "https://www.techradar.com/news/best-home-security-camera",
      "text": "The best home security cameras 2025: indoor, outdoor, and subscription-free cams\nWe've tested stacks of security cameras in real-world conditions to bring you this guide to the very best\nWith one of the best home security cameras installed, you can rest easy knowing that your property and family are secure. Whether you live in a rented apartment or a spacious house, there are indoor and outdoor cameras to keep it covered.\nWe test scores of home security cameras here at TechRadar, from big brands like Ring and Arlo, through to smaller companies that are just starting out and have some innovative ideas. We install each camera in our own homes and put it through its paces in real world conditions, capturing footage in different lighting conditions, using the mobile app to assess the quality of footage, and checking how well it connects to the rest of our smart home devices.\nWe'll also let you know about any potential drawbacks, such as whether the camera requires a subscription to unlock certain features, or to store footage in the cloud.\nFor example, if you have a Ring security camera, you'll need a Ring Home subscription (starting at $4.99 / £4.99 / AU$4.95 per month) for features like online storage and access to 180 days of event history. If you have a Google Nest camera, you'll need to pay $8 / £6 / AU$12 per month for Nest Aware membership to check historic events. In both cases, 24/7 recording requires a premium subscription plan.\nThe quick list\nBelow is our quick guide to the best home security cameras around. Use it to narrow down your options, then either hop down to the more in-depth entry, or head straight to a retailer to buy.\nBest all-round\nBest home security camera overall\nThis smart little security camera offers a fantastic field of view thanks to its 360-degree rotation and 169-degree tilt. You'll need a Ring Home subscription to make the most of its features, but its affordable price tag and ease of use make this our number one home security camera right now. Just bear in mind that it doesn't offer motion-tracking (even though it looks like it should). If that's what you need, take a look at the IMOU Rex 3D.\nAffordable security\nBest budget security camera\nSecurity doesn't have to be expensive. During our tests, this affordable indoor camera impressed us with its crisp 1080p footage, and options for local and cloud storage. It has a compact design too, and can be mounted on a wall or used free-standing if you don't want to start drilling holes. We also like the fact that it can store footage locally if you have a Sync Module 2, though other features require a subscription, and it doesn't have the privacy cover you'd find on Ring's video doorbells.\nInfrared night vision\nBest security camera with night vision\nThis compact, affordable indoor camera uses infrared to record footage in low light conditions, and you can set its motion sensor to only activate after dark, making it ideal for use for home security, or to help you watch over your child at night. We found it very easy to set up, too, though as with most home security cameras, you'll need to pay a subscription free to store footage in the cloud, and unlock some of the AI based features (such as pet identification).\nOutdoor security system\nBest security camera for outside\nGreat home security doesn't have to be expensive, as this tough little outdoor camera proves. Compact, easy to install, and simple to use, the Blink Outdoor 4 is a great choice if you're looking for your first outdoor security camera. Some features are restricted to subscribers, but the essentials are free. We were particularly impressed by its two-year battery life, which means you can essentially set it and forget it, with no cables required. It's even better value when bought in a multi-pack.\nNo subscription necessary\nBest security camera with local storage\nThis affordable camera has a MicroSD card slot to store your footage, so there's no need to pay extra for a subscription unless you want AI features like person-detection. It's weather-resistant so you can use it indoors or out, though in our tests footage was clearest when recorded at close range, so we preferred using it inside. We found that its sound detection wasn't always reliable either, even in quiet environments, so if that's important to you then you may be better off with a camera from Ring or IMOU.\nGreat for apartments\nBest security camera for renters\nThe WiZ Indoor Camera doesn't require a monthly subscription, can be used freestanding so there's no need to drill into your walls, and lets you see a live feed from your phone. It doesn't have the premium feeling of more expensive cameras, and its field of view is relatively narrow compared to cams from some of the big brands like Ring, but if you want something for your rented apartment, it's ideal.\nSolar-powered\nThe best solar home security camera\nThis is a serious home security system. It's a serious investment, but you're getting 4K footage, 64GB local storage, and solar charging that can eliminate the need for frequent charging (depending on the settings you choose). We found it better quality and more reliable than cheaper alternatives, and with no subscription necessary, the price difference starts to even out over time.\nThe best home security cameras 2025\nWhy you can trust TechRadar\nThe best home security camera overall\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want a good view: With 360-degree rotation and 169-degree tilt, this little camera lets you see much more of your room than most home security cameras.\n✅ You own other Ring products: This camera will work seamlessly with your other devices, and your existing Ring Home subscription.\n❌ You want motion tracking: Somewhat surprisingly considering its range of movement, motion tracking isn't available here/\n❌ You don't have a handy power socket: This is a wired camera, so unlike some others, you'll need a power socket within reach.\nRing's latest home security camera is also its best to date, with an impressive feature set and affordable price tag that make it our number one choice. You'll need a Ring Home subscription to get the most out of it - see our guide do I need a Ring subscription for full details - but it's one of the more affordable plans around and will also unlock the full features of any other Ring devices in your home (the company is known for making some of the best video doorbells).\nVideo is crisp and clear, with footage sent live to your phone or available for up to 180 days online (provided you're a Ring Home subscriber), with motion detection and alerts to let you know if someone enters its field of view. There's also a siren to scare off intruders, which our reviewer Cesci Angell said \"was easily enabled by pushing a button on the app via the device's home screen; this caused the camera to make a loud security alarm sound, which I imagine could be capable of scaring off an unwanted guest.\"\nAs the name suggests, this little camera's standout feature is its ability to rotate 360 degrees and tilt 169 degrees, which gives you excellent visibility around your room, though it's a little surprising that there's no motion tracking - the camera seems like it would be ideally suited to this. Perhaps something to look forward to in the next model.\nRead our full Ring Pan-Tilt Indoor Cam review\nAttribute | Notes | Score |\n|---|---|---|\nValue | The Pan-Tilt Indoor Cam is a reasonable price for the features and picture quality, however, the paywall that restricts access to recordings is unfortunate. | 4.5/5 |\nDesign | The camera’s ability to pan and tilt is convenient but it seems Ring missed a trick with the lack of motion-tracking. | 4/5 |\nPerformance | The picture and audio quality were good, and the camera handled motion well, but the Color Night Vision proved a little underwhelming. | 4.5/5 |\nThe best budget home security camera\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You have an Amazon Echo Show: The Blink Mini works seamlessly with Alexa devices, and the Echo Show lets you see live footage with a simple command.\n✅ You're not worried about storage: Storing video requires an additional module, but that's not a problem if you only want live feeds.\n❌ You want person detection: You'll need a more advanced camera for this.\n❌ You want to go wireless: If you need a battery-powered camera, take a look at the Blink Outdoor instead.\nOne of the most affordable home security cameras on the market, the Blink Mini may be compact, but it certainly packs a punch. The full HD footage it records during the day and at night is clear, and we found the camera simple to set up and easy to control using the app.\nIt offers both cloud and local storage, although you'll need to purchase an additional sync module if you want to use local storage, as unlike the Blink Indoor and the Blink Outdoor, this isn't included. There's a free cloud storage trial bundled with the camera, but you'll need to pay a fee if you want to continue with that option.\nThe Blink Mini lacks person detection, something the only slightly more expensive Ring Indoor Cam (above) offers, but for those that want a device with a small footprint, you'll be hard pushed to do better than the Blink Mini.\nRead our full Blink Mini review\nAttribute | Notes | Score |\n|---|---|---|\nValue | Affordably priced for the camera itself, but to get the most out of it you'll need either a Blink subscription or a Blink Sync Module 2 as well. | 3.5/5 |\nDesign | Not striking to look at, but inoffensive and discreet. It's not battery-powered, so its long power cable is very useful. | 4.5/5 |\nPerformance | Crisp Full HD video, clear night vision, and excellent motion sensitivity. Where it struggles is video storage, as mentioned above. | 4/5 |\nThe best home security camera with night vision\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You own a pet: This camera can detect and differentiate between animals and people.\n✅ You want two-way audio: The IMOU Rex lets you chat with guests and pets when you're away from home.\n❌ You value simplicity: If you don't need the IMOU Rex's more advanced features, you can save money by opting for the Blink Mini instead.\n❌ You need an outdoor camera: The Blink Outdoor is a small, weather-resistant alternative.\nLooking for an indoor security camera that can capture footage after dark? The IMOU Rex 3D is an excellent option. Some other cameras claim to record at night, but do so by activating a bright light when motion is detected. The Rex 3D uses infrared to record in low light without disturbing anyone, making it useful for keeping tabs on your home, or watching over your kids.\nWe found the pan-and-tilt camera easy to set up, and its 3m long power cord gives you plenty of options when deciding where to position it. The picture quality was excellent too (night and day), though in our experience the motion detection was a little over-sensitive, and was often triggered accidentally until we turned it down.\nOne feature we particularly appreciated was its HDR (high dynamic range) capability, which allows it to capture detail that would normally be lost in bright light or shadow. Need to position it near a window, or in a gloomy corner? No problem.\nRead our full IMOU Rex 3D review\nAttribute | Notes | Score |\n|---|---|---|\nValue | Extremely good value for money considering all the features the camera offers. However, if you subscribe to the IMOU Protect Plus subscription plan, it does start to get quite expensive. | 5/5 |\nDesign | Considering it’s a rotating pan and tilt camera, it’s a neat and compact design about the size and shape of a softball. Plus it can be mounted on the ceiling, which is useful. | 4.5/5 |\nPerformance | Offers a stable connection and high-quality 1080p resolution. The only downside is that it’s not always accurate for pet detection and the motion sensor is very sensitive. | 4.5/5 |\nThe best home security camera for outside\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want a camera with local storage: The Sync Module 2 lets you connect your own storage media so you don't have to rely on a cloud subscription service.\n✅ You want to minimize hassle: With easy setup and battery life of up to two years, this little camera is a piece of cake to use.\n❌ You want to upgrade a robust home security system: This is very much an entry-level camera, and isn't compatible with devices outside the Blink ecosystem.\n❌ You want the crispest footage: The Blink 4's 1080p video occasionally looks blurry or grainy in suboptimal lighting conditions.\nLooking for an entry-level outdoor home security camera? The Blink Outdoor 4 is the one for you. This super affordable little camera (available individually, or in packs containing up to eight) is a piece of cake to set up and use thanks to its fully wireless design and incredible two-year battery life. Just position them wherever you like, and you're good to go.\nThe 1080p video quality isn't the highest, but it proved fine for most purposes during our tests. Motion detection is reliable and we were impressed by how easy it is to set up motion detection zones in the Blink mobile app.\nA paid subscription plan isn't essential to use the Blink Outdoor 4, and you can save footage locally using the Sync Module 2, which is included with the camera, and your own external storage. That's an impressive feature for such an affordably-priced device. Subscribers benefit from extras such as unlimited 60-day cloud storage and photo capture, but it's definitely nice to have rather than mandatory.\nIf you already have an outdoor camera system and want to upgrade it to something more sophisticated, take a look at the Arlo Ultra 2. It's one of the most expensive outdoor cameras we've tested at TechRadar, but its reliability and the fidelity of its footage are hard to beat.\nRead our full Blink Outdoor 4 review\nAttribute | Notes | Score |\n|---|---|---|\nValue | Offering a decent set of features at a considerably low price, the Blink Outdoor 4 is a value winner. | 4/5 |\nDesign | Contained in a square shell and powered by two AA batteries, the Outdoor 4 can be placed almost anywhere in a home without looking out of place. | 4/5 |\nPerformance | As a budget-oriented security camera, the Blink Outdoor 4 doesn’t boast brilliant recording quality or high-end features. It does, however, have a huge battery life, which we love. | 3.5/5 |\nThe best home security camera with local storage\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You need 24/7 recording: With 32GB local storage, the Wyze Cam v3 can record continuously for days.\n✅ You want discreet night recording: Most cameras rely on spotlights to capture footage after dark, but not this one.\n❌ You want super clear footage: The picture quality from the Wyze Cam v3 is only average. If you want more clarity, look for a 2k or even 4k camera instead.\n❌ You need flexibility with positioning: This camera's power lead is only 6ft long, which limits your options\nIf you're looking for an indoor/outdoor home security camera on a budget, you'll be hard pushed to do better than the Wyze Cam v3. This full HD camera records clear footage during the day and at night and comes with free cloud storage for up to 14 days and a Micro SD card slot for local storage, making it a more than worthy competitor to other budget cameras.\nIt's one of the few outdoor home security cameras with an integrated stand, so it doesn't have to be mounted to a wall, although it can be if you'd prefer. That said, it requires a power outlet rather than a rechargeable battery, which may limit outdoor use depending on your setup.\nIf you're not willing to pay for a monthly subscription, you'll miss out on person detection, but on test we found it works perfectly well subscription-free.\nRead our full Wyze Cam v3 review\nAttribute | Notes | Score |\n|---|---|---|\nValue | One of the most affordable home security cameras around. Cloud storage requires a subscription, but this is also cheap at $2 a month or $20 a year. | 5/5 |\nDesign | Not a very attractive camera, but it offers IP65 water and dust resistance, and has an SD card slot so you can store your videos locally subscription-free. It lacks a privacy shutter. | 4.5/5 |\nPerformance | Full HD footage is good enough to let you recognize people you know, but at a distance subjects tend to look blurry and oversaturated. A subscription unlocks 'Wyze AI events', which is mostly reliable. | 4/5 |\nThe best home security camera for renters\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You don't want to make holes in your walls: This camera can be used free-standing so you won't damage your landlord's property.\n✅ You don't want to pay a subscription: A monthly plan is available for some advanced features, but it's not essential.\n❌ You value style: This isn't the best looking home security camera around, focusing on function over form.\n❌ You want the best quality footage: The WiZ Indoor Camera has a relatively narrow field of view, which is fine for small rooms but not ideal for large spaces.\nThe WiZ Indoor Camera is the company’s first foray into home security, and it's particularly well suited to renters and folks living in apartments.\nIt can be used free-standing, so there's no need to drill holes in your landlord's walls, and thanks to its SD card slot you don’t need to tie yourself into a long subscription to store footage. You also have a lot of customization available without making additional paymentes, though a subscription will offer 30 days of cloud storage, activity zones, and manual recording.\nThe WiZ Indoor Camera also comes with some other interesting features including SpaceSense, which works in conjunction with other WiZ lights to detect motion wherever you have the camera set up. Lastly, this security camera is compatible with Matter, Alexa, Google, SmartThings, and IFTTT so you should be able to pair it with just about any smart ecosystem.\nRead our full WiZ Indoor Camera review\nAttribute | Notes | Score |\n|---|---|---|\nValue | It's pretty affordable as a device, which is great, but so much of the real meat is behind a subscription that will rack up the price over time. | 4/5 |\nDesign | The new base plate and privacy cover are really nice additions, thought it would be nice to see a little more finesse in the finish. | 4.5/5 |\nPerformance | While it doesn't 'wow' us at this price, the specs and performance of the Ring Indoor Cam (Gen 2) are consistent and reliable. Plus, the app experience is decent. | 4/5 |\nThe best solar home security camera\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You need surveillance for a larger space: With a 250m range, the MaxRanger4K Solar is well suited for homes that have generous outdoor spaces that you want to keep an eye on.\n✅ You want a wireless solution: If your home gets enough sunlight, your MaxRanger4K Solar cameras won't need to be charged frequently. With the right settings and frequency of alerts, you might never need to recharge the cameras.\n❌ You live somewhere that never sees the sun: Solar panels are awesome, but if you don’t get much sunlight at home then a wired security solution will likely be much more reliable.\n❌ Every view includes a busy street: A busy street means a lot of alerts, which will run down the camera's battery. Detection sensitivity and other settings can reduce the strain, although this means you’ll capture fewer clips, which could impact security.\nWe reckon you get what you pay for with this high-end security system. Cameras are available to buy separately, but only as add-ons – in order to use them you'll need to buy a bundle of at least two, which will also include the central hub that provides Wi-Fi connectivity and 64GB of expandable storage for your videos.\nThere is a subscription available if you want extra features like package detection, but our reviewer used the MaxRanger4K Solar quite happily without it, safe in the knowledge that his clips never left his home. Over time, not paying a monthly fee to keep your videos will help make the initial cost of this camera system easier to handle.\nThe 4K footage is crisp and clear, and we were impressed how well the camera's TrueDetect sensor was able to differentiate between people, vehicles, and other disturbances, and label them in videos.\nThere's a pair of spotlights and a siren for added security as well, though we found we had to be careful when configuring each camera's sensitivity settings. Set them too high and the camera will be triggered too easily, which will drain its battery rapidly even if it's positioned in direct sun. Spend some time settings things up though, and you' might never have to worry about charging your cameras again.\nRead our full Swann MaxRanger4K Solar review\nAttribute | Notes | Score |\n|---|---|---|\nValue | You really do get what you pay for, and while the MaxRanger4K cameras are pricey, I’ve found they’re better quality and more reliable than cheaper alternatives. | 4/5 |\nDesign | It’s hard to find fault with the design of these cameras. They boast a suite of protection features, a relatively sturdy design, and a solar panel that helps to extend their battery life. | 5/5 |\nPerformance | Generally the MaxRanger4K does a good job of capturing fairly high-quality footage. However, it can run out of charge if you leave it at too high a sensitivity. If you live near a busy-ish street or somewhere where there is plenty of activity, you may need to play with the settings. | 4/5 |\nWe've also tested\nWe're constantly testing new home security cameras at TechRadar. Here are some of the ones that didn't make it into our top seven.\nArlo Essential Indoor Camera\nThis camera offers excellent video quality, but despite its name, it has a premium price tag that makes it harder to recommend than the other devices in this guide - especially when you factor in the cost of a subscription.\nRead our full Arlo Essential Indoor Camera review\nRing Floodlight Cam Wired Pro\nA heavy-duty external security camera, the Ring Floodlight Cam Wired Pro has two 1,000 lumen spotlights and a siren, but will be overkill for most home owners and requires existing wiring for installation.\nRead our full Ring Floodlight Cam Wired Pro review\nBlink Outdoor\nA good outdoor security camera with much better battery life than most, and impressive motion detection, but not as robust as we'd like. Its glossy surface scratches easily, which is a shame.\nRead our full Blink Outdoor review\nPsync Camera Genie S\nAI is this camera's main selling point, allowing it to tell you what it can see - in theory at least. Its image quality is very good, but during our testing the AI-generated descriptions were hit-and-miss, with the software 'hallucinating' people and objects that weren't there.\nRead our full Psync Camera Genie S review\nHow to choose the best home security camera for you\nStart by determining whether you need a home security camera that is weatherproof and can be used outside or if you are looking for a smart security camera you can place inside your home.\nYou'll also need to consider how the camera is powered. Some need to be connected to mains power, which may mean you need to employ a professional to install it, whereas others are battery-powered. Look for home security cameras with swappable batteries, so you can purchase additional batteries and ensure the camera isn't out of action for several hours when the battery needs recharging.\nThe quality of the video the home security camera records is also essential. Many home security cameras record in Full HD, although some record in a higher resolution of 2k and 4k. While Full HD is sufficient for most homes, if you plan to mount the camera up high, its field of view covers a wide area. Higher resolution cameras will mean you can zoom into the footage and still pick out precise details such as car number plates.\nMost home security cameras record footage in color during the day, although it's in black and white at night. Some come with an LED that can be triggered when motion is detected to ensure footage recorded at night is in color and as a way to scare off any would-be intruders. In addition, some home security cameras have built-in alarms triggered manually from the app or automatically when motion is detected to help deter intruders.\nMany manufacturers now integrate with either Alexa and / or Google Assistant and Apple HomeKit. Ring, for example, only work with Alexa whereas Arlo work with Alexa, Google Assistant and HomeKit. This feature is useful if you want to speak with whoever is stood on your driveway (for example), without you having the select the notification on your phone. It's also another way to sync up with the other smart home devices in your ecosystem.\nFinally, consider how video the camera captures is stored - does it require a subscription to save video in the cloud so it can go back and be reviewed after it has happened? Again, remember to factor in this cost. Some cameras offer local storage, so you don't have any ongoing costs associated with the camera, either in the form of memory built into the camera itself or the ability to add a micro SD card to the camera or base station.\nWe've also got guides for how to secure your smart home and how to set up your smart home for further tips and tricks.\nHow we test home security cameras\nTo ensure the home security cameras we’ve reviewed can be fairly compared, we’ve tested and analysed several crucial features covering style, performance, and practicalities.\nWe rated each camera on the quality of the footage it records during the day and in the dark, how clear the two-way talk features are, and the settings to arm and disarm the camera. In addition, for each model, we wanted to know how easy the setup and installation were, as well as how efficient the cameras were at delivering motion notifications and whether AI features were designed to identify if the activity has been created by a person, animal, vehicle, or another source, were accurate.\nWhere relevant, we compared the battery life of each model, and for cameras with lights and/or sirens, we also compared the brightness and loudness to see if they were sufficient. We also assessed each model for its durability and design, looking to see if it comes with handy mounting plates and the ability to adjust the camera angle to suit your home.\nHome security cameras FAQs\nWhat is a home security camera?\nAll home security cameras offers a level of surveillance to your property whether you are at home, or away. Smart home security cameras specifically work with an app that displays live and recorded footage, along with some other fancy features that enable you to engage with the person (or animal) inside and outside of the house.\nThe price difference is generally down to the quality of these features; you'll pay more to receive 4K footage, than full HD footage for example. You'll also pay more for color night vision, facial recognition, and enhanced app features.\nCan a home security camera save you money on insurance?\nPossibly, though it depends on your insurer and the security system that you have fitted. According to price comparison site GoCompare, \"Making your home more secure could help to reduce your home insurance premiums,\" though not all insurers will offer such deals, and they might only give discounts for certain approved security systems. Check with your insurer for details.\nWhat type of home security camera do you need?\nThe two types of home security cameras are those for outdoor or indoor use. Indoor cameras tend to be cheaper than outdoor cameras because they aren't geared for outdoor weather conditions, and they won't have the longer battery-life that comes with battery-powered outdoor cameras.\nWithin those two types of security cameras are wired and battery-powered cameras. Wired security cameras would be best installed by a certified engineer, but you won't need to worry about recharging the batteries which can be a bit of a nuisance.\nDo home security cameras need to be plugged in?\nNot all models need to be plugged in when powering the best home security cameras. While there are plenty of mains-powered home security cameras on the market, suitable for indoors and outside, if you don't have access to a power socket where you want to install your home security camera, then fear not - there are many models that a rechargeable battery can power.\nHow long the battery lasts between charges will depend on how often the camera detects and records motion and how often the app is used to view the camera's live feed, but you can expect anywhere between one month and one year. Some home security cameras have swappable batteries, while others need to be removed completely to be recharged.\nIt's also worth noting that some home security cameras that offer a choice of power method may only provide certain features, such as activity zones, when used on mains power.\nWhat's the difference between home security cameras and surveillance cameras?\nRegarding securing your home, there are two options on the market; home security and surveillance cameras, also known as CCTV. So exactly how do they two differ?\nSurveillance cameras have been around for decades, and see cameras are installed, usually on the property's exterior, although they can also be positioned inside. The cameras are connected to a central recorder by cables, and if you want to review the video, you'll need to connect the main recorder to a TV or monitor.\nSurveillance cameras are generally more expensive than home security cameras. Usually, they require professional installation, but they ensure footage is captured without interference or the risk of a wireless connection failing or a camera battery running out. They also record everything and are only limited by the size of the central recorder, which is considerably larger than the capacity of a MicroSD card or the amount of secure online storage offered by home security cameras.\nHowever, home security cameras are more affordable than CCTV and far easier to install. The footage is either stored on a MicroSD card inserted into the camera or base station - if the camera requires one - or in a secure area online, and you can review it from your smartphone or tablet, which means you don't need to find room for the central recorder and screen. However, most home security cameras don't record continuously, and if the internet connection drops, some cameras won't be able to record. Find out more about CCTV vs. smart home security cameras in our article.\nWhich security cameras work without a monthly fee?\nBecause many of the best home security cameras require a subscription fee to access all of the features, you should be careful not to purchase a device that doesn't do what you need it to without extra cost if you're not prepared to pay. Many cameras do, however, work brilliantly out of the box.\nIt's worth pointing out that almost all security cameras will work to a large extent without purchasing a subscription. Still, it's important to do your homework if there are particular features you want or need.\neufy - to get cloud storage for your cameras, eufy charges a small fee per camera for the basic service or a reduced rate per month for up to 10 cameras. You can save by paying for a whole year upfront. Find out more about eufy's subscription plans.\nArlo - similarly, Arlo charges for cloud storage, additional notifications, package detection, the 'call a friend' service, and theft replacement. Your camera also won't be able to tell the difference between a person, vehicle, or animal without forking out a little more per month. Find out more about Arlo's subscription plans.\nGoogle - Nest Aware is Google's subscription plan, which gets you continuous video recording (rather than just the edited highlights), additional smart alerts, 30-60 day history, and support for everything from smart speakers to doorbells. Find out more about Google's subscription plans.\nSwann - Swann's subscription offers 60 days of rolling storage on both the cloud and locally, TrueDetect (the ability to differentiate between packages, pets, and vehicles), lock screen alerts, an extended warranty, and a replacement policy in case of theft. Find out more about Swann's subscription plans.\nRing - Ring offers the longest video history in exchange for its subscription fee, giving you up to 180-days for all its doorbells and security cameras. You also get an extended warranty, cellular backup, person alerts, and assisted monitoring. Find out more about Ring's subscription plans.\nFor more on how to keep home security costs down, take a look at our guide to creating a security system on a budget.\nCan wireless security cameras work without the internet?\nHome security cameras are often called wireless security cameras. Does that mean they require an internet connection to work? In most cases, they do. Unlike CCTV, which requires cables to be laid around your home, wireless security cameras need internet access so they can send a notification to your smartphone when motion is detected, as well as let you view a live feed from the camera no matter where you are.\nWhile some home security cameras record footage to a MicroSD card inserted into the camera, others store it in a secure area online - something they can't do if they don't have a Wi-Fi or wired internet connection. However, some models, including the Google Nest Cam (battery), will store footage locally for a short period if the internet connection drops, transferring the videos to the cloud storage space when the Wi-Fi is reinstated.\nDo home security cameras invade privacy?\nHome security cameras are designed to capture what's going on in and around your property. In some cases, the ideal mounting position means that as well as your property falling within the camera's field of view, you may also capture the road, pavement, a neighbor's driveway, front door, windows, or even their backyard, for example.\nThe same privacy rules regarding CCTV apply to home security cameras. So, you should be taking adequate steps to protect the privacy of those around you, such as your neighbors.\nIf you find sections of their property fall within the field of view of your home security camera, re-position the camera so this is no longer the case. If that's not possible, activate any features the camera offers to block out sensitive areas while monitoring your driveway or back garden.\nWe'd recommend telling your neighbors about your security cameras while showing them precisely what is and isn't being monitored and recorded by the camera. Also, consider placing the signs and stickers that often come with security cameras in your window to make passers-by aware that they might be monitored or recorded. Finally, find out more in-depth on this subject by reading do home security cameras invade your privacy?\n- You've reached the end of the page. Jump back to the top ^\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nCat is TechRadar's Homes Editor specializing in kitchen appliances and smart home technology. She's been a tech journalist for 15 years, having worked on print magazines including PC Plus and PC Format, and is a Speciality Coffee Association (SCA) certified barista. Whether you want to invest in some smart lights or pick up a new espresso machine, she's the right person to help.\n- Josephine WatsonManaging Editor, Lifestyle"
    },
    {
      "url": "https://www.techradar.com/home/home-security/maxranger4k-solar-review",
      "text": "TechRadar Verdict\nWith the MaxRanger4K Solar camera, you get what you pay for. It’s pricey, but has proved a great, reliable home security option for me – once I'd figured out the sensitivity settings, that is.\nPros\n- +\nSolar powered\n- +\n4K video quality\n- +\nNo necessary subscription fees\nCons\n- -\nCan be too sensitive\n- -\nPricey\n- -\nWould benefit from deeper security customization options\nWhy you can trust TechRadar\nMaxRanger4K Solar: One-minute review\nThe MaxRanger4K Solar is the ideal smart security camera for homes with large areas to monitor.\nThanks to the hub’s 250m range, and the solar panels that help extend the battery life of the cameras, it’s easy to set up and maintain a security camera view of your home space.\nThe MaxRanger4K's rugged IP66 design means it should withstand dust and rainstorms, plus it's built-in lights and sirens act as less subtle alerts to any would-be intruders that they’re being caught in 4K.\nThe less tech savvy will appreciate the simplicity of the app and camera installation process. All the instructions arrive in the box and were so easy to follow that I had my cameras up and recording in no time at all.\nThere are some drawbacks, however. While a single MaxRanger4K Solar camera costs $129.99 / £199.99 / AU$399.95, add in the cost of the hub, and the cheapest starting price becomes $399.99 / £499.99 / AU$949.95 for a bundle of two cameras.\nNevertheless, on the plus side, there’s no premium subscription option that locks away essential features – only a few added benefits that I've happily managed without. In addition, I’ve found the included 64GB of local storage more than sufficient for most needs, so you won’t miss cloud storage.\nBesides cost, something else to be aware of are the camera's sensitivity settings. If set to high and positioned to watch over a \"high traffic\" area, you might find the cameras run out of charge in a matter of weeks. Some trial and error will be required to find the balance of settings that cater to your security needs while allowing your cameras to chug along without frequent charging.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nOverall, however, I’ve been mightily impressed by the MaxRanger4 camera system. It’s certainly been more reliable than my cheaper cameras.\nMaxRanger4K Solar: Price and Availability\nA MaxRanger4K Solar camera costs $129.99 / £199.99 / AU$399.95. However, as mentioned, it requires a hub to come, which is only available with bundles of two, three, or four cameras.\nBundles will set you back $399.99 / £499.99 / AU$949.95 , £649.99 / AU$1,329.95, and $599.99 / £799.99 / AU$1,699.95 respectively. At the time of writing, Swann’s US web store doesn’t appear to offer the three-camera bundle.\nThese prices place the MaxRanger4K in the more premium tier of home security systems. However, savings arrive over time from the fact that you won't be paying out for a premium subscription.\nThere is a Swann Secure+ paid option for benefits that include an extended warranty, priority support, some cloud storage, and alerts to further differentiate between cars, people, pets, and package deliveries.\nIt sounds useful, however during my testing I didn't ever feel the need to subscribe, and remained a free user the entire time – something I can't say for some other home security tech I've tested. My Blink cameras, for example, can be used without paying for a subscripotion, but it's certainly a lot smoother to use the Blink cameras if you do pay.\n- Value score: 4/5\nMaxRanger4K Solar: Design & Performance\nEach camera is outfitted with an array of tools to make it a home security champion.\nThe 4K image sensor, with its wide 105-degree viewing angle, not only allows you to record what’s happening in a large space, but also to go back and make out details should you need to. It records in color night vision, too, allowing you to view footage in greater detail should the need arise.\nIn addition, the True Detect sensor uses heat and motion to determine the difference between people, vehicles, and other disturbances. Looking through my own recordings, the camera did a very good job of automatically labelling each activation appropriately.\nPlus there’s a microphone, too, so you can pick up audio to add further context to your clips. It isn't perfect, but it can pick up bits of conversations if folk are close to the cameras – a few of my clips have been orchestrated by birdsong, which made flicking through them a delight!\nIf the MaxRanger4K Solar does detect something, you can rely on its built-in siren and speaker to scare off any would-be intruders by playing a loud noise or literally shouting at them through your phone. A pair of spotlights bring clarity to your late-night motion detections.\nHaving said that, I've actually turned these features off through the app (more on that in a moment), as they can prove an annoyance to neighbors.\nLastly, this camera is designed to function through rain and shine. With its IP66 water- and dust-proof rating, it should continue performing even through torrential rain, while its built-in solar panel will keep your MaxRanger4K Solar charged up.\nThe caveat to that perpetual solar power is obviously how frequently your camera activates, and how often the sun makes an appearance. I have one camera that records just my garden, and another that's pointed onto the street where I park my car. The garden camera triggers far less frequently and hence its battery has lasted quite well.\nMeanwhile, the street-view camera triggers more frequently, catching every car that drives past. I had set it up in a darker month and initially hadn't tweaked the default detection settings; it ran out of charge after just a few weeks.\nI’ve since recharged it, tuned down its sensitivity settings, and am finding it's lasting much longer – especially now, in the sunnier months.\nThe final part of your MaxRanger4K Solar system is its hub. This box sits in your home and is the device with which your cameras communicate. It can connect to cameras up to 250m away from it.\nIt comes with 64GB of storage (which is expandable) for recordings, and it even has a built-in battery, so even if you lose power for a while, it can continue recording for up to five hours.\n- Design score: 5/5\n- Performance score: 4/5\nMaxRanger4K Solar: Software\nTo manage your security camera system you use the Swann Security app on your phone – a one-stop shop from where you can adjust your MaxRanger4K Solar's settings, and any other Swann home security tech you rely on.\nWorking through the various tabs from left to right, the first three are fairly straightforward. Activities shows you the frequency of alerts throughout the day and over the past week; Playback is for your day-by-day collection of recorded clips; and Live View lets you see the current view from your cameras.,\nThen there’s Modes. Here you can manually adjust your recording settings between Home, Night and Away options, which you can customize to suit how you want your camera system to function under different circumstances.\nHaving the ability to alter when the features such as the siren and lights came on based on the setting would have been welcome, but you can just change which cameras are active and their sensitivity. You can choose one setting at a time or set up schedules that automatically adjust the mode based on the time of day.\nFinally, the Devices tab allows you to adjust your camera settings, detection zones (so a camera will only record if it detects something in specific parts of its view), alarm settings (whether the siren and lights turn on or not) and the time zone of the camera, so your recordings can be logged correctly.\nYou can also manage how your recordings are stored from the app. I’ve set up my camera to automatically delete recordings that are over 30 days old, but you can set a different interval – either one, three, seven, 14, or 90 days – or have it automatically overwrite older clips when your storage fills up.\nOverall, the app is super intuitive, and setting everything up through it proved simple using the instructions in the box.\n- Software score: 4/5\nShould you buy the Swann MaxRanger4K Solar?\nAttribute | Notes | Score |\n|---|---|---|\nValue | You really do get what you pay for, and while the MaxRanger4K cameras are pricey, I’ve found they’re better quality and more reliable than cheaper alternatives. | 4/5 |\nDesign | It’s hard to find fault with the design of these cameras. They boast a suite of protection features, a relatively sturdy design, and a solar panel that helps to extend their battery life. | 5/5 |\nPerformance | Generally the MaxRanger4K does a good job of capturing fairly high-quality footage. However, it can run out of charge if you leave it at too high a sensitivity. If you live near a busy-ish street or somewhere where there is plenty of activity, you may need to play with the settings. | 4/5 |\nSoftware | The Swann Security app is clean and intuitive. I just wish the Modes options delivered more control over how I want the cameras to function at different times of the day. | 4/5 |\nBuy it if…\nYou need surveillance for a larger space\nWith a 250m range, the MaxRanger4K Solar is well suited for homes that have generous outdoor spaces that you want to keep an eye on.\nYou want a wireless solution you won’t need to replace all the time\nIf your home gets enough sunlight, your MaxRanger4K Solar cameras won't need to be charged frequently. With the right settings and frequency of alerts, you might never need to recharge the cameras.\nYou hate additional fees\nUnlike some brands, Swann's premium subscription doesn't feel necessary – I've easily made do without paying anything extra.\nDon’t buy it if…\nYou live somewhere that never sees the sun\nSolar panels are awesome, but if you don’t get much sunlight at home then a wired security solution will likely be much more reliable.\nEvery view includes a busy street\nIf your camera can see a busy street then you'll likely get a lot of alerts – and it will run out of charge quickly, even if you get plenty of sun. Detection sensitivity and other settings can help reduce the strain, although this means you’ll capture fewer clips – which could impact security.\nYou want something cheap\nSwann’s security system may come without extra fees, but it isn’t super-cheap up front. It's a great performer, but if you’re after an affordable option, this isn’t it.\nAlso consider\nBlink Outdoor 4\nIf you're after a more entry-level outdoor security camera then this could be the best pick for you. It's not the most robust or crisp option on the market, however.\nRead our full Blink Outdoor 4 review\nRing Pan-Tilt Indoor Cam\nIf you're after an indoor camera instead of an outdoor unit, this could be a solid option – although it does lock some tools behind a paywall.\nRead our full Ring Pan-Tilt Indoor Cam review\nHow I tested the MaxRanger4K Solar security camera\nTo understand how effective the MaxRanger4K Solar camera system is, I had it installed on my home for a couple of months – to get a sense of both its recording abilities and if its sun-powered battery held up.\nI tested each of the different security settings, although, to avoid annoying the neighbors, I didn’t keep settings such as the alarm or light on regularly. I also made sure to check back over captured footage, but you’ll notice I haven’t included any of the outside world in this review – primarily because I don’t want to dox myself, as I live within sight of a few notable features of my town.\nWhile the box includes everything you need to affix the Swann cameras into place, I rent my home so I had to purchase a couple of fixtures that allow me to set up the cameras to drain pipes, so as not cause any damage. These worked effectively enough – I haven’t had either camera fall during testing.\nFirst reviewed June 2025\nHamish is a Senior Staff Writer for TechRadar and you’ll see his name appearing on articles across nearly every topic on the site from smart home deals to speaker reviews to graphics card news and everything in between. He uses his broad range of knowledge to help explain the latest gadgets and if they’re a must-buy or a fad fueled by hype. Though his specialty is writing about everything going on in the world of virtual reality and augmented reality.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/home/smart-home/i-test-smart-home-tech-for-a-living-and-these-are-the-top-3-subscription-free-video-doorbells-i-recommend",
      "text": "I test smart home tech for a living, and these are the top 3 subscription-free video doorbells I recommend\nVideo doorbells are a great way to boost your home security and help avoid missing deliveries, but there's often a catch. Although the doorbell itself might be cheap, many manufacturers lock the most advanced features (such as package detection) behind a subscription paywall. Want to save your videos and check them later? You might have to pay for that as well.\nThat's why I've put together this list of three top-notch video doorbells that give you full access to everything without locking you into a monthly payment plan.\nYou'll notice that there are no Ring devices here. That's because, although you can answer a Ring doorbell and see a live video feed without a subscription, your recordings won't be stored anywhere, so if you miss a visitor, you can't check who it was later. Features like package-detection are behind a paywall, too, as is the ability to go back and check old alerts. Take a look at our full guide to Ring subscriptions for more details.\nOne subscription-free doorbell that didn't quite get a place in this guide is the Doro Hemma, which is designed with senior users in mind, but would also be a great choice for anyone who wants to keep things simple. It only missed out here due to its lack of integration with other smart home systems, but if you want a video doorbell and nothing else, it's well worth investigating. Take a look at our full Doro Hemma review for full details.\nPhilips 7000 Series Video Doorbell\nThe Philips 7000 Series currently holds the number one spot in my roundup of the best video doorbells, beating the competition thanks to its impressive video quality with great viewing angles, and generous 8GB onboard storage.\nIt boasts dual cameras to give a clear view of both visitors and any packages they may leave on your doorstep. Its 2K resolution will be ample for most homes (4K doorbells are now widely available, but usually burdened by subscription fees), and during our tests, we were thoroughly impressed by how sensitive it was to motion. In terms of responsiveness, it was up there with the best home security cameras. Night vision is crisp as well (the doorbell is equipped with infrared sensors).\nWe found installation refreshingly straightforward, with a choice of mounting plates so you can choose one to suit your home, and it can be used with existing doorbell wiring or wireless from a rechargeable battery.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe 7000 Series isn't the cheapest video doorbell around, but its price is competitive considering how much you're getting. It's around the same as the Ring Video Doorbell 2, which requires a membership to save and review video footage.\nThe only other drawback for us was a slight lag we noticed during two-way talk with visitors. Otherwise, the 7000 Series is hard to beat.\nRead our full Philips 7000 Series Video Doorbell review\nEufy Video Doorbell Dual\nAnother twin-camera video doorbell, this smart-looking model from Eufy is an excellent option if you're looking for a subscription-free video doorbell on a budget. Although its list price is about the same as the Philips 7000 Series above, it's often available at a steep discount, making it an exceptional value.\nLike the 7000 Series, the Video Doorbell Dual records video at 2K, which is just fine for us, and is loaded with advanced features like package detection and the ability to play pre-recorded voice messages, all with no membership necessary.\nIt has an infra-red sensor that detects body heat from visitors, while radar motion-detection scans for movement. Better yet, its software includes AI person-recognition, and during our tests, it was able to accurately identify and label visitors in our video clips. We didn't receive any false positives, and the detailed app notifications meant we could tell who was calling at a glance, without even picking up our phone.\nAll your footage is stored locally on the HomeBase 2 (bundled with the doorbell), which provides 16GB for your clips. You can buy cloud storage, too, if you really want to, but there's no compelling reason to. When you can keep control over your own videos and access them for free, why do anything else?\nWe didn't love having to take the doorbell down to charge it (there's no swappable power pack), but it can be connected to existing doorbell wiring if you'd rather not run it from its battery.\nRead our full Eufy Video Doorbell Dual review\nEZVIZ EP3x Pro Doorbell\nThe EP3x Pro is the cheapest video doorbell in this guide, with a list price of just $149.99 / £129.99 (about AU$220). You don't get as much local storage for your videos, but 32GB with no subscription fee is nothing to be sniffed at.\nVideo doorbells are usually pretty straightforward to install, but we found the EZVIZ app particularly intuitive, and had the EP3x Pro up and running in just a couple of minutes. It makes checking your video clips especially easy as well, showing you a handy list of callers who have visited over the last 30 days, so you can easily see if you missed a delivery and when.\nAgain, there are two cameras (one for faces and one for packages), and footage is recorded at 2K. Rather than an infrared camera, the EP3x Pro uses bright LEDs to help record visitors after dark. It's not discreet, but it means you get full color recording at night, which makes identifying callers easier.\nOne of this doorbell's standout features is its ability to run from a solar charger, which drastically increases its battery life compared with conventional wireless doorbells. You can basically set it and forget it, which we love, and if anyone tries to pry it off the wall, they'll trigger the anti-tamper alarm.\nWe sometimes experienced a short delay between a visitor pressing the button and us receiving a notification on our phone, but that was the only setback. Once we were connected, two-way talk worked flawlessly without lag.\nAgain, you can get extra cloud storage if you really want it (EZVIZ offers a service called CloudPlay), but frankly, there's plenty of space on the doorbell, and no other features are behind a paywall, so there's no need.\nRead our full EZVIZ EP3x Pro Doorbell review\nYou might also like\n- The Swann MaxRanger4K solar-powered camera has kept my home feeling safer without forcing me to buy a subscription\n- Unbelievably, this smart lock was my easiest smart-home installation ever – they should all work like this\n- Roku's new wireless security cameras will guard your home for up to two years on a single charge\nCat is TechRadar's Homes Editor specializing in kitchen appliances and smart home technology. She's been a tech journalist for 15 years, having worked on print magazines including PC Plus and PC Format, and is a Speciality Coffee Association (SCA) certified barista. Whether you want to invest in some smart lights or pick up a new espresso machine, she's the right person to help.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/home/home-security/im-a-smart-home-tech-reviewer-and-these-are-the-top-3-subscription-free-home-security-cameras-i-recommend",
      "text": "I'm a smart home tech reviewer, and these are the top 3 subscription-free home security cameras I recommend\nThe best home security cameras have come a long way, with resolutions up to 4K, extra-long battery life, and smart object identification and tracking now all commonplace.\nHowever, things aren't always as simple as plugging in your camera and downloading the app. To unlock all of its features, you'll likely need to sign up for a subscription plan as well, with monthly or annual payments that can quickly exceed the price of the hardware. Suddenly that budget camera doesn't look like quite such good value.\nIt doesn't have to be that way though. We've tested over 60 home security cameras here at TechRadar, and as the resident smart home expert, I've picked out three of the very best options that work perfectly with no extra fees. Forget paying to save your videos in the cloud, too – all these cams offer local storage so your footage is always in your control, plus smart features like person-detection and even AI-powered identification.\nSwann MaxRanger4K Solar\nWe tested this serious outdoor security camera just a few weeks ago, and it left us thoroughly impressed. It's designed to be used outdoors, with a tough weather-resistant chassis, and it captures super-crisp 4K footage with a wide 105-degree viewing angle to help cover your whole yard.\nThat's not all – each camera also has a sensor that uses heat and motion to identify people, vehicles, and other disturbances, and label them accordingly. It's the kind of feature you'd usually only get with a paid security plan, but it's bundled in here, and in our tests it worked very well, accurately identifying triggers for us.\nThe app lets you tweak camera settings too, including its sensitivity, which is a handy way to extend its battery life. Each cam has a solar panel that allows it to last months between charges, but you'll need to spend some time optimizing settings for maximum effect. The more frequently recording is triggered, the faster the battery will drain.\nThe cameras are sold in packs of two or three, bundled with a base station that provides 64GB local storage for your videos, and is expandable with an SD card if you need even more room. If you have a particularly large home, you can pick up extra cameras to extend coverage over a wider area.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nSwann does offer a home security plan with features like priority customer support, but it's definitely not essential and we didn't feel we missed anything by not having it. The initial price isn't cheap, but skipping the subscription makes it a lot more palatable.\nRead our full Swann MaxRanger4K Solar review\nReolink Altas PT Ultra\nThe Reolink Altas PT Ultra earned four stars in our review thanks to its crisp video recordings, pan-and-tilt functionality to cover an extra-wide area, and local storage for your video. Although it's somewhat bulky, it looks smart and didn't worry our neighbors unnecessarily (always a plus).\nThe camera can automatically track subjects such as people and animals, or you can pan and tilt it manually using the app if there's something you particularly want to keep an eye on. There's also a pre-record option, similar to the one you'd get with a dash cam, which captures footage continuously in the background and saves the 10 seconds that were recorded before a trigger event.\nFootage is super clear during the day, but we found that the Altas PT Ultra really excels at night. Most home security cameras produce pretty shoddy monochrome video after dark, but Reolink's ColorX technology produces impressive color footage without a spotlight.\nStoring your videos in the cloud costs extra, but there's no need when you can save them to an SD card, or to an encrypted Reolink Home Hub. The Home Hub comes with 64GB storage that's expandable with up to two 512GB SD cards, which should be more than enough.\nRead our full Reolink Altas PT Ultra review\neufyCam 3 S330\nEufy makes some of my favorite smart home devices, and the eufyCam 3 S330 is among the best. Some home security cameras can bombard you with alerts, but this one is different, using AI-powered facial recognition to identify familiar people and either notify you when they arrive, or ignore them and only alert you when a stranger appears on your property. It's the kind of feature that would normally come with a hefty subscription fee, but here it's included in the base price of the camera.\nEufy has only been in the home security business for a few years (it's better known for its robot vacuums), but it's really nailing it. This camera has a slightly wider field of view than the Swann model above (135 degrees), and picture quality was excellent. The camera's software even managed to identify the faces of people reflected in windows, which took us by surprise.\nUnlike Eufy's smaller cameras (such as the eufyCam 2 Pro), the eurfyCam 3 S330 has a solar panel that means you can pretty much fit and forget it. During our testing period we didn't need to recharge it at all, though your results will depend on the settings you choose. As with any camera, the more often it's triggered, the more juice it will use.\nThe camera connects to Eufy's HomeBase hub, which comes with 16GB storage, but can be expanded to a huge 16TB with no monthly fees. It's not the cheapest security system, but you're getting a lot for the initial cost.\nRead our full eufyCam 3 S330 review\nYou might also like\nCat is TechRadar's Homes Editor specializing in kitchen appliances and smart home technology. She's been a tech journalist for 15 years, having worked on print magazines including PC Plus and PC Format, and is a Speciality Coffee Association (SCA) certified barista. Whether you want to invest in some smart lights or pick up a new espresso machine, she's the right person to help.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/seasonal-sales/swann-doorbell-pre-prime-day-deal",
      "text": "Forget Ring – our favorite AI-powered video doorbell is half price ahead of Prime Day, and it doesn't need a subscription\nIf you're looking for a new video doorbell, we've got the deal for you. The Swann Buddy4K is now just $99.99 at Amazon (was $199.99) – an epic 50% price cut ahead of Amazon Prime Day. When we reviewed it, we were wowed by its \"superb video quality\" and excellent software, which earned it a place in our roundup of the best video doorbells.\n• See all of today's best Amazon deals\nRing doorbells are excellent, but they all have one disadvantage: you need to pay a monthly subscription fee to store your videos in the cloud. That's not the case with the Swann Buddy4K, which lets you keep your footage on an SD card instead.\nYou can choose to pay for cloud-based storage if you want, but it's not essential. Storing your video locally means you can check through it any time without making extra payments for the privilege, to. It's a great way to save money and, with this early Amazon Prime Day deal, the Buddy4K is even better value.\nEarly Prime Day deal: Swann Buddy4K\nWe were thoroughly impressed by this wireless doorbell's video quality when we tested it. It's easily one of the best we've reviewed this year and, with 50% off in Amazon's early Prime Day sale, it's even easier to recommend. it comes bundled with an extra chime so you can hear and speak to visitors from anywhere in the house, too.\nThis isn't just a video doorbell, either. The Swann Buddy4K is also a fully-fledged home security camera with features like motion detection, and the ability to differentiate between subjects such as people, pets, cars, and packages.\n\"It’s possible to store videos by type – particularly handy if you want to find out when a parcel was left on the doorstep,\" said our reviewer Chris Price. \"Alternatively, you can store videos in chronological order on the built-in MicroSD card.\"\nThe doorbell's AI assistant (which generates custom voice responses for visitors so you don't have to speak to them) was still in beta when we reviewed it but, even without this, it's an excellent device that comes highly recommended to help secure your home. See our full Swann Buddy4K review for more details.\nMore early Prime Day smart home deals\nWe gave the Echo Dot (5th Gen) a solid 4 stars because of its simplicity, and this early Prime Day deal means that you can save an additional $20 on what's already an affordable Echo smart speaker. It's fluctuating price history means that it's not easy to tell which direction it will sway come Prime Day, so it's best to watch out for this one.\nAmazon's best-selling Echo Show 5 is on sale for only $59.99 in today's early sale. The 2023 Echo Show 5 features a compact 5.5-inch display but packs impressive sound with deeper bass and clearer vocals. With Amazon Alexa, you can listen to podcasts, movies, music, and more.\nThis might be the best early Prime Day deal: Amazon's latest tablet, the Fire HD 10, is down to a new record-low price, and I don't imagine it will drop further on Prime Day itself. It features a large, bright 10-inch Full HD display, 3GB of RAM, and an octa-core processor for enhanced performance. The tablet also works with Amazon Alexa and provides an impressive 12 hours of battery life.\nAmazon's early Prime Day sale - quick links\n- Amazon Prime membership: free 30-day trial\n- Amazon Devices: 50% off TVs, Echo & Fire Sticks\n- Apple: AirPods + iPads from $99\n- Back to school: deals from $5.99\n- Beauty: 80% off toothbrushes & skincare\n- Headphones: $120 off Bose, Apple & Sony\n- Health: electric toothbrushes from $24.99\n- Kitchen: 54% off Ninja, Nespresso & Keurig\n- Laptops: record-low prices from $175\n- Tablets: iPads and Samsung from $54.99\n- Toys: 40% off Lego, scooters & Toniebox\n- TVs: cheap TVs from $59.99\n- Vacuums: Shark, Bissell & Dyson from $49.99\nAdd a review Hawk widget for the product that you're writing about\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nCat is TechRadar's Homes Editor specializing in kitchen appliances and smart home technology. She's been a tech journalist for 15 years, having worked on print magazines including PC Plus and PC Format, and is a Speciality Coffee Association (SCA) certified barista. Whether you want to invest in some smart lights or pick up a new espresso machine, she's the right person to help.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5327010872913343297&xs=1&url=https%3A%2F%2Fuk.swann.com%2Fsecure-plans%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fhome%2Fhome-security%2Fswanns-new-subscription-free-home-security-camera-stays-charged-with-just-45-minutes-of-sunlight-per-day",
      "text": "Every Step of the Way\nWe know that finding the right security solution and staying secure can be stressful, but Swann's here to make life easier.\nMembers Receive More\nDepending on the Swann product you select, here are the additional services that will help keep you safe.\nKnow What's Happening Faster\nStay alert to what's happening with smart notifications of the activity you care about, including detection of packages, vehicles, and pets.\nSee Visual Evidence Sooner\nSee and respond faster with images included in alerts, allowing you to see what's happening and take action sooner.\nBe Treated Like a VIP\nExperience priority customer service 24/7 when you call or email Swann for help, saving you time and hassles.\nYou're Covered When it Matters Most\nDepending on the Swann product you select, here are the additional services that will help keep you safe.\nInsurance for Extra Protection\nEnjoy added security that if your device is stolen, and you have a valid police report, we will replace it free of charge. Register a claim here.\nWarranty Cover for Life\nYour products are now covered for even longer, with extended warranty for the life of your membership.\nKeep Recordings Longer\nPeace of mind knowing your video clips with audio are stored securely in the cloud for 60 days rolling, ready to be accessed if needed.\nSwann Lets You Stay Ahead\nDepending on the Swann product you select, here are the additional services that will help keep you safe.\nLet Us Save You Time\nGet an in-depth understanding of what’s happening with 30 days of video event history grouped by activity type.\n90 Days Free & Freedom to Move\nPlans based on how many devices you own and how long you want to commit for. The first 90 days are free and there’s no lock-in contracts.\nCut the Everyday Cost of Security\nReceive exclusive offers, promotions, and discounts tailored to your security needs on Swann.com.\nMonthly & annual subscription plans available\nChoose a Plan That's Right for You\nExtra\n£4.99/month, £49.99/year\nFor a single camera or recorder kit.\n- Extra alerts\n- Rich notifications\n- Extra cloud recording\n- Lifetime warranty\n- Insurance coverage\n- Priority customer support\n- Event history summaries\n- Special offers\n- Lifetime warranty\n- Insurance coverage\n- Priority customer support\n- Event History Summaries\n- Special offers\nUnlimited\n£11.99/month, £119.99/year\nFor all devices in your home or business.\n- Extra alerts\n- Rich notifications\n- Extra cloud recording\n- Lifetime warranty\n- Insurance coverage\n- Priority customer support\n- Event history summaries\n- Special offers\n- Lifetime warranty\n- Insurance coverage\n- Priority customer support\n- Event History Summaries\n- Special offers\nActiveResponse\n£4.99/month, £49.99/year\nAdditional services for your personal safety alarm(s): Add Up to 5 Contacts to Be Notified Immediately, Test Mode for All Contacts, Find My Keys Feature.\n- Add Up to 5 Contacts to Be Notified Immediately\n- Test Mode for All Contacts\n- Find My Keys Feature\nCHOOSE YOUR PLAN\nExplore subscription features\n| Feature | Free | Extra | Unlimited |\n|---|---|---|---|\n| Number of cameras supported | 1 | 1 | Unlimited |\n| Number of days free cloud recording | 1-7 | 60 | 60 |\n| People, pet, car & package alerts* | - | ||\n| Rich notifications with tap actions* | - | ||\n| Extended warranty | 24 months | Lifetime | Lifetime |\n| Swann device insurance | - | - | |\n| Exclusive offers | - | - |\n* Wireless and Wi-Fi Devices only. Wired systems do not support cloud storage. Local storage is depending on hard drive or MicroSD capacity.\nBecoming a Member is Easy\nNew to Swann?\nMembership offers many additional security features to support Swann products.\nAlready a Swann customer?\nIf you use the Swann Security app, membership adds even more value & security. For more see the Secure+ Plans menu in the Swann Security app.\nFrequently asked questions\nFind more answers in our Support Centre\n- What are Swann's Secure+ Member Plans?\nAn option for you as a Swann customer, to have additional services for extra peace of mind and greater security at your home property. - How do I access the Secure+ Member Plans?\nYou can join in the Swann Security app by selecting ‘Secure+ Plans’ in the main menu. - Can anyone subscribe?\nYes. As long as you are using the Swann Security app. - What devices are compatible?\nAny Swann products (both Wi-Fi and wired) using the Swann Security app ecosystem are eligible. - What does Swann consider to be a ‘device’?\nWireless and powered Wi-Fi cameras and complete wired systems are considered devices. - Are all Wi-Fi cameras using the Swann Security app compatible with Secure+ Member Plans?\nYes. All Swann products using the Swann Security app are compatible. Swann’s Tracker Camera can connect to Secure+ but, unlike other Wi-Fi Cameras, is not compatible with the full suite of services. - Are all wired systems using Swann Security compatible with Service Plans?\nYes. Both Swann’s DVR and NVR systems. However, wired systems are not eligible for all the same services as Wi-Fi Cameras. See more details on this web page. - What payment options are available to me?\nYou can pay monthly or annually. - What countries can I subscribe from?\nSecure+ Member Plans are available globally but options and inclusions may vary. - Is Face Recognition included in Secure+ Member Plans?\nNo. Face Recognition (identifying specific people of interest) is not currently included as part of the member plans on any of the included products. Some Swann Wireless devices and high-end NVR recording systems include Face Recognition as a free service. - How do I subscribe or become a member?\nLog in to the Swann Security app using your username and password then, follow the prompts for Secure+ Member Plans, selecting the plan and features you would like. - What do I need prior to subscribing?\nA Swann Security account and iTunes account (for iOS devices) or Google Play account (for Android devices). - Can I vary my mix of Secure+ Member Plans?\nNo. You may only apply a single Secure+ Member Plan to an account. - Are subscriptions transferrable between devices?\nNo. Subscriptions are applied are not transferable between multiple devices. - How does Swann know which devices I have subscribed?\nEach of your devices is linked to your Swann Security account, which captures the subscription plan you have chosen for that device. - Do members get a free trial period?\nMembers get a free trial with ‘Extra’ & ‘Unlimited’ plans when they first subscribe. - What if I’m not satisfied with my Secure+ Member Plan?\nYou can cancel any time. If you cancel during your trial period you will not be charged. - Do members have to put their credit card details in at the time of subscribing?\nNo. Secure+ Member Plans are processed via your iTunes (for iOS devices) or Google Play (for Android devices) account. - Where can I learn more about Swann's Secure+ Member plans?\nOnline on this page https://us.swann.com/swann-security-subscription-terms\n- What does Swann consider to be a ‘device’?\nWireless and powered Wi-Fi cameras and complete wired systems are considered devices. - What payment options are available to me?\nYou can pay on a monthly or annual basis. There is a discount if you pay annually. - What countries can I subscribe from?\nSecure+ Member Plans are available globally. - Do the prices include tax?\nYes, as per the way Swann normally treats pricing in your market ie for sales tax, VAT, GST etc. - What if my credit card expires?\nIt’s up to you to update your Apple iTunes or Google Play account with your new card’s details. - Can I pay via iTunes or Google Play?\nYes. You can subscribe in app using either iTunes (for iOS devices) or Google Play (for Android devices). - Why would I choose an annual payment plan?\nAnnual members pay a discounted rate for their subscription. - Can I cancel my subscription at any time?\nYes.\n- What is Cloud Recording?\nMost Swann Wireless and Powered Wi-Fi Cameras store video clips in the secure cloud for a rolling 1-7 days. You can access those clips at any time for viewing and/or downloading. - How is Cloud Recording different if I subscribe to a Secure+ Member Plan?\nMembers get to store more clips for longer in the cloud. You will enjoy 60 days rolling of clips and still images (depending on your device) saved to Swann’s secure cloud instead of the usual 1-7 days rolling cloud storage. - How are the days of rolling cloud storage calculated & what’s 'fair use'?\nSwann Wireless and Powered Wi-Fi cameras are not designed for continuous recording. They are intended to specifically record true motion around the camera with minimal false triggers. 60 days is calculated based on 'fair use' of up to 200 clips of 10-60 seconds duration each day and camera. - What if I exceed the ‘fair use’ terms?\nSwann Wireless and Powered Wi-Fi cameras are not designed for continuous recording. They are intended to specifically record true motion around the camera with minimal false triggers. If you exceed the fair use quantity for the upload of clips you may experience delays in uploading or downloading clips. Furthermore, where Swann deems this use to be excessive, it may, at its option, reduce the camera sensitivity so that each camera is recording fewer false events. - What is device backup?\nSome Swann Wireless and Powered Wi-Fi Cameras are able to backup clips onto the camera for a limited time where a network connection has become interrupted. Once the network is restored, the clips stored on the camera are uploaded to the cloud and can be accessed like other clips. - How long can a camera record as a local backup?\nCameras have very limited local storage. Depending on the clip duration and frequency, typically up to 2 days of local backup is available. - How do I access local backup?\nLocal backup cannot be directly accessed. The idea is that the camera provides this service while its network connection is interrupted. Without a network connection, the camera cannot be accessed. However, once the network is restored all backed up clips are uploaded to the cloud and can be accessed using the Swann Security app ‘Playback’ section. - Are all Swann devices compatible with the Cloud service?\nNo. It is only included in Secure+ plans for wireless and powered Wi-Fi devices. It is not compatible with wired systems, although some wired systems have the ability to save to Dropbox or network as part of their free offering. The Tracker Security Camera is not compatible with cloud recording nor Secure+ Member Plans - How do I access clips saved to the cloud?\nVia the Swann Security app on your mobile device you can retrieve clips stored in the cloud by day and hour. - Are clips any length?\nClips are only as long as your device will allow, typically that is no longer than 60 seconds per clip.\n- What are Smart Analytics and Alerts?\nYour Swann Wireless Camera or Wi-Fi Camera can sense the heat and movement of humans, vehicles and pets to send an alert or notification to your mobile device. - Will Face Recognition be included as part of subscription on all devices?\nNo. Face Recognition is coming soon for subscription on powered Wi-Fi devices. It is included free already on wireless devices and some wired systems (such as Professional Series NVRs). - Are all Swann devices compatible with Smart Analytics and Alerts?\nNo. Only powered Wi-Fi and wireless devices are compatible with these alerts for subscription. However, wired systems are also able to receive some alerts as standard due to their cameras’ True Detect heat and motion sensing. - Will I receive alerts automatically if I subscribe?\nYou will need to configure your phone to receive notifications for the Swann Security app in the Settings menu of your phone. The number of alerts depends on the activity detected and the sensitivity settings you choose within the app. - What types of alerts will I be able to receive?\nIn addition to the free alerts that come as standard, Secure+ members with a connected Wi-Fi camera can receive Human, Package, Vehicle and Pet Detection alerts. - Can I vary the sensitivity of what triggers a smart alert?\nYes. Within the app’s settings menu per device. - Will the camera be triggered by my pet or a small animal like a mouse?\nNo. You can vary the sensitivity of the activity detection. - Does my camera recognize license plates?\nNo. Vehicle recognition is based around an algorithm around the shape of the vehicle. - How does package detection work?\nPackage detection uses an algorithm to detect the shape of packages/parcels/envelopes and people to alert you when an item has been moved to or from your premises.\n- What are rich notifications?\nRich notifications are a notification or alert to your mobile device with a thumbnail image attached for quick and easy identification. - What’s the advantage of a rich notification?\nWith an image attached you can quickly discern what’s happening and what action you want to take. - Can rich notifications and Smart Alerts appear over my phone’s lock screen?\nYes. It’s a good way to know what’s happening even when your phone is off or ‘locked’ as the notifications can appear accompanied by a sound to alert you to important activity. You can vary this in your phone’s settings menu. - Are all Swann devices compatible with Rich Notifications?\nNo. It is only included in subscription for wireless and powered Wi-Fi devices. It is not compatible with wired systems. - Will I receive rich notifications automatically if I subscribe?\nYou will need to configure your phone to receive notifications for the Swann Security app in the Settings menu of your phone. The number of alerts depends on the activity detected and the sensitivity settings you choose within the app.\n- Are all Swann devices compatible with Extended Warranty via Secure+ Member Plans?\nYes. If your product meets the conditions for Extended Warranty, including that you commence your membership within 6 months of the date of purchasing the device (wireless, powered Wi-Fi Camera or wired system) or devices you are subscribing for. If the device is not subscribed to a Secure+ Member Plans within 6 months of purchase, Extended Warranty will not apply and only the standard 12 month warranty (from the date of purchase) applies. - How does subscription affect Swann’s standard manufacturer’s warranty?\nSwann offers a 12 month’s manufacturer’s warranty on all devices and complies with all statutory and legal requirements in relation to warranty in your region. Swann extends its warranty to 36 months with an active membership / subscription. The period of 36 months for Extended Warranty begins from the purchase date, NOT the date of membership / subscription commencement. - What happens if I stop being a member?\nThe extended warranty period is only valid while you are a member. If you discontinue your subscription, you can no longer claim an extended warranty. - Is there a process for warranty claims?\nYes. As outlined on Swann.com, extended warranties are handled as part of Swann’s standard warranty claim process. You need to retain a copy of your proof of purchase to make a warranty claim. - What do I do to claim extended warranty?\nIf you are a member of a Secure+ Member Plan for the device in question, you fill in the online form to claim. You must be able to show fair use as outlined in Swann’s terms of service and have proof of purchase. Your inquiry is then forwarded to Swann’s warranty department in your region who process the claim according to the agreed warranty process for that region.\n- Are all Swann devices compatible with Insurance Claims?\nYes. If you are a member and you are able to satisfy the conditions for Insurance Claims including a valid police report, Swann will replace that device with an equivalent one, free of charge. - What if one camera from my wired system is stolen?\nSwann will endeavor to replace that one camera, not the whole system. - How do I make an insurance claim?\nYou must be a current member of a Secure+ Member Plan, then fill in the online form to claim. The inquiry is forwarded to the warranty department in your region who processes the claim according to Swann’s insurance claim process. - Does insurance cover other incidents, such as fire, other damage, wear and tear?\nNo. Insurance is there for when members have their device stolen and can prove that with a valid police report. - What if I don’t have a valid police report?\nSwann will not be able to replace your device. You may still have coverage under your standard home and contents insurance policy if you have one.\n- Are all Swann devices compatible with Special Offers on Swann.com?\nYes. If you are a member to one of Swann’s Secure+ Member Plans and are located in the USA, UK or Australia, you are able to take advantage of exclusive offers, discounts and special deals. - Why is this service only available in the USA, UK and Australia?\nIt is tied to the ecommerce stores on Swann.com and only those countries have a Swann Store. - I don’t live in the USA, UK and Australia can I get special offers on Swann.com?\nNo. Unfortunately we cannot support you with special offers at this time. - What if another country added ecommerce?\nYes. That could change things but for now it is only available in the USA, UK and Australia. - As a member, how will I know what the offers are?\nOnce you have activated your subscription Swann will communicate special offers to you via email. - Will these discounts and offers be available to non-members?\nNot normally. Most offers, deals and discounts will be exclusive to members of the Secure+ Member Plans. - Will these discounts and offers be in addition to other offers on Swann.com?\nIt depends. Some offers will be able to be combined with advertised offers on Swann.com and some others may be considered a one-off or separate. - Will there be discounts and offers on other websites?\nThat is a possibility as we develop our service offering. Our goal is to ensure our members are always looked after with the best deals and extra peace of mind.\nNotes\n- Swann reserves the right to adjust pricing with prior notice to members. Should any changes occur, Swann will ensure members are informed in advance along with clear and valid reasons for the adjustment.\n- Receive a Free 90-Day trial intro offer when you sign up for to use Secure+ Member Plans. Applies to Extra & Unlimited plans only.\n- Special Offers on Swann.com available to customers in USA, UK & Australia only.\n- Insurance claims require a valid police report.To make a claim using Secure+ Insurance Protection please complete the form located here.\n- The Extended Warranty period begins from the product purchase date, not the date of membership commencement. Additional terms & conditions apply.\n- Video verification available in the Pro Video tier of Secure+ Member Plans only. Pro tier includes monitoring of indoor devices only.\nSubscribing to Swann Secure+ Member Plans is bound by our privacy policy and terms of service here."
    },
    {
      "url": "https://www.techradar.com/home/home-security/eufy-familock-s3-max-launch",
      "text": "Eufy's new smart lock reads the veins in your palm for touchless entry – even if your hands are dirty\n- The Eufy FamiLock S3 Max has contactless entry via palm recognition\n- It doubles as a video doorbell with 2K footage and AI intruder detection\n- Footage can be stored either locally, or in the cloud with a subscription\nEufy – the company behind some of the best video doorbells we've tested here at TechRadar – has released a new smart lock with palm recognition for touch-free entry. The Eufy FamiLock S3 Max, which launched today, also has an external camera that offers wide-angle 2K video, plus built-in AI to alert you when a visitor approaches your door – welcome or not.\nEufy was one of the first companies to launch a smart lock with palm-recognition (the other big name being Philips with its 5000 Series Video Palm Recognition Smart Lock), and it has several advantages over fingerprint scanners, which are a more common option for keyless entry.\nPalm recognition works by detecting the unique pattern of blood vessels in your hand, and comparing this with a database of authorized images. In the case of the FamiLock S3 Max, this data is stored locally to protect it from potential security breaches. This means it can be opened without physical contact, and its accuracy isn't affected by skin conditions, sweat, or dirt.\nPalm recognition also uses more data points than a fingerprint sensor or facial recognition, making it more accurate and much harder to deceive.\nWho's there?\nThe FamiLock S3 Max also functions as a video doorbell, so there's no need for two separate devices. It has a 2K camera and a 140-degree field of vision both vertically and horizonally (the same as higher-end Ring video doorbells), giving you a head-to-toe view of visitors, plus packages left on your doorstep.\nYou'll receive an alert on your phone when someone rings, and the lock's software includes person-detection that can let you know if someone is loitering on your property.\nVideo footage can be saved in the cloud with a paid-for subscription, or locally with a Eufy HomeBase 3 encrypted external hard drive.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nWe're currently testing the Eufy FamiLock S3 Max to see how it compares with the best smart locks from other brands, and will bring you a full review very soon. It's available to buy now direct from Eufy and from Amazon for $399.99 (about £300 / AU$630).\nYou might also like\nCat is TechRadar's Homes Editor specializing in kitchen appliances and smart home technology. She's been a tech journalist for 15 years, having worked on print magazines including PC Plus and PC Format, and is a Speciality Coffee Association (SCA) certified barista. Whether you want to invest in some smart lights or pick up a new espresso machine, she's the right person to help.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Swann has introduced the EVO Wireless Solar, a compact outdoor security camera that operates on just 45 minutes of sunlight per day and features 16GB of local storage, eliminating the need for a subscription. It records in 2K resolution with a 120-degree field of view and includes infrared night vision and two-way audio. Priced at $129.99, it offers a cost-effective alternative to competitors like Ring, which require subscriptions for video storage.",
  "argos_id": "Z7XJK05PW"
}