{
  "type": "add_article",
  "timestamp": "2025-08-31T08:54:49",
  "processed": false,
  "inputs": {
    "source_article_id": "0CPCO1X78",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: equities; Apple iPhone 17 launch on September 9, 2025, could lift S&P 500 through earnings expectations and investor sentiment.",
      "existing_ids": [
        "spx"
      ],
      "new_names": []
    },
    "category": {
      "type": "company_update",
      "motivation": "The article reports a product launch by Apple, which is a company update."
    },
    "impact": {
      "priority": "hidden",
      "motivation": "The article concerns a company event with no direct mapping to a canonical macro handle and no macro catalyst."
    },
    "time_frame": {
      "temporal_horizon": "current",
      "motivation": "The article reports an upcoming product launch event with immediate market impact on Apple and related consumer electronics."
    },
    "article_node": {
      "id": "0CPCO1X78",
      "title": "iPhone 17 release is rumored for September: Here's what to know ahead of Apple's fall event",
      "summary": "Apple is set to unveil its iPhone 17 lineup on September 9, with rumors of an ultra‑thin iPhone 17 Air, an all‑aluminum chassis for the Pro models, and a $50 price hike to offset tariffs. Leaks suggest the Air will feature a single‑lens camera, a 2.8‑kWh battery, and a titanium frame, while the Pro models may switch from titanium to aluminum and include a full‑width camera island. The event will also likely showcase new Apple Watch models, AirPods Pro 3, and iOS 26, which introduces a Liquid Glass design and AI‑driven features such as live translation and Visual Intelligence. Analysts expect the launch to drive a modest bump in iPhone pricing and could influence secondary‑market demand for older models. The rumors are supported by MacRumors, Bloomberg, and various leakers, with a confirmed event date from German carriers.",
      "source": "https://www.engadget.com/mobile/smartphones/iphone-17-release-is-rumored-for-september-heres-what-to-know-ahead-of-apples-fall-event-153024327.html",
      "published_at": "2025-08-15T18:05:35+00:00",
      "vector_id": null,
      "type": "company_update",
      "temporal_horizon": "current",
      "priority": "hidden",
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 1,
      "successful": 1
    }
  },
  "id": "0CPCO1X78"
}