{
  "type": "add_article",
  "timestamp": "2025-08-31T21:55:22",
  "processed": false,
  "inputs": {
    "source_article_id": "CBY3K497X",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: equities; Boeing's jet engine output measurement informs aircraft performance metrics.",
      "existing_ids": [
        "ba"
      ],
      "new_names": []
    },
    "category": {
      "type": "other",
      "motivation": "The article discusses jet engine technology, which does not fit any of the specified categories such as macro events, earnings, regulation, policy statements, central bank actions, economic data releases, geopolitical events, company updates, or market commentary."
    },
    "impact": {
      "priority": 1,
      "motivation": "Unable to determine relevance due to missing node context; the article discusses jet engine technology which may have limited direct impact on typical macro or market nodes."
    },
    "time_frame": {
      "temporal_horizon": "fundamental",
      "motivation": "The article discusses long-term structural drivers relevant to this node."
    },
    "article_node": {
      "id": "CBY3K497X",
      "title": "How Jet Engine Output Is Measured (No, It's Not By Horsepower)",
      "summary": "Jet engines, introduced in the 1930s, revolutionized air travel by enabling higher speeds, greater altitudes, and larger cargo capacities compared to propeller engines. Their thrust, measured in engine pressure ratio, is generated by converting fuel energy into mechanical energy that drives fan blades. Thrust depends on mass flow rate and velocity difference, and is tested in specialized test cells. Efficiency is affected by altitude and airspeed, with a peak around Mach 3 before diminishing at higher speeds.",
      "source": "https://www.slashgear.com/1951613/how-jet-engine-output-is-measured-no-it-doesnt-use-horsepower/",
      "published_at": "2025-08-31T18:35:00+00:00",
      "vector_id": null,
      "type": "other",
      "temporal_horizon": "fundamental",
      "priority": 1,
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 1,
      "successful": 1
    }
  },
  "id": "CBY3K497X"
}