{
  "type": "add_article",
  "timestamp": "2025-09-03T12:45:39",
  "processed": false,
  "inputs": {
    "source_article_id": "RXQP819RS",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: rates; Export controls on semiconductor manufacturing tighten supply‑chain risk premium, likely pushing US Treasury yields higher and strengthening the dollar. FX; US‑China tensions may lift the DXY.",
      "existing_ids": [
        "fed_policy",
        "us_inflation",
        "us_core_pce",
        "ust10y",
        "dxy"
      ],
      "new_names": []
    },
    "category": {
      "type": "regulation",
      "motivation": "The article reports the U.S. Commerce Department revoking export waivers for semiconductor equipment, a regulatory change affecting the semiconductor supply chain."
    },
    "impact": {
      "priority": "hidden",
      "motivation": "No node was provided to assess impact against, so relevance cannot be determined."
    },
    "time_frame": {
      "temporal_horizon": "fundamental",
      "motivation": "The article reports a policy shift that fundamentally changes the export control environment for semiconductor equipment, altering the structural supply chain dynamics."
    },
    "article_node": {
      "id": "RXQP819RS",
      "title": "US to Revoke China Waivers for South Korean Chip Firms",
      "summary": "The U.S. Commerce Department announced it will revoke the waivers that allowed Samsung Electronics and SK Hynix to ship chip equipment from China without a license, tightening export controls on semiconductor manufacturing. The move comes amid broader U.S. efforts to curb China’s chip supply chain and is expected to impact the global semiconductor market. Meanwhile, Dell and Marvell shares fell after earnings disappointments, and U.S. regulators are advancing a crypto‑friendly agenda, with the SEC Commissioner outlining new blockchain initiatives.",
      "source": "https://www.bloomberg.com/news/videos/2025-08-29/bloomberg-tech-8-29-2025-video",
      "published_at": "2025-08-29T20:38:54.938000+00:00",
      "vector_id": null,
      "type": "regulation",
      "temporal_horizon": "fundamental",
      "priority": "hidden",
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 5,
      "successful": 5
    }
  },
  "id": "RXQP819RS"
}