{
  "type": "add_article",
  "timestamp": "2025-09-02T10:24:52",
  "processed": false,
  "inputs": {
    "source_article_id": "S9KMMAORW",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: equity; high dividend REITs and pharma stocks are sensitive to rising rates and inflation, influencing equity valuations and dividend sustainability.",
      "existing_ids": [
        "fed_policy",
        "us_inflation",
        "ust10y",
        "spx"
      ],
      "new_names": []
    },
    "category": {
      "type": "market_commentary",
      "motivation": "The article provides market analysis and opinion on high‑yield dividend stocks as attractive investments in a high‑interest environment."
    },
    "impact": {
      "priority": "hidden",
      "motivation": "The article discusses specific high‑yield dividend stocks, but without a specified node, we cannot determine relevance to any canonical handle."
    },
    "time_frame": {
      "temporal_horizon": "fundamental",
      "motivation": "The article focuses on long‑term dividend growth and structural factors such as high‑interest environments that shape the sustainability of dividend yields, rather than short‑term price movements."
    },
    "article_node": {
      "id": "S9KMMAORW",
      "title": "3 High-Yield Dividend Stocks You Can Buy in September and Hold Forever",
      "summary": "The article highlights three high‑yield dividend stocks—Realty Income (REIT), Healthpeak Properties, and Pfizer—that offer yields above 5% and have a track record of dividend growth. Realty Income, despite a 22% decline from its 2022 peak, continues to raise dividends and maintains a 5.5% yield, while Healthpeak’s merger with Physicians Realty has lowered its payout but the stock price drop has increased its 6.8% yield. Pfizer, though its share price has fallen, has increased its payout for 16 consecutive years, making it a compelling long‑term dividend play. The piece positions these stocks as attractive options for investors seeking stable, growing income streams in a challenging high‑interest environment.",
      "source": "https://finance.yahoo.com/news/3-high-yield-dividend-stocks-072100143.html?_guc_consent_skip=1756799299",
      "published_at": "2025-09-02T07:21:00+00:00",
      "vector_id": null,
      "type": "market_commentary",
      "temporal_horizon": "fundamental",
      "priority": "hidden",
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 4,
      "successful": 4
    }
  },
  "id": "S9KMMAORW"
}