{
  "url": "https://www.seattletimes.com/business/pro-dei-organizers-fired-up-to-maintain-target-boycott-as-promises-go-unfulfilled/",
  "authorsByline": "TERRY TANG",
  "articleId": "fed61d9f2e8b4a3383e232aff51f27e2",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/08/urnpublicidap.org7996ce3fbf7f0cc9207472bc7a227cd6Target_Boycott_39924.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T11:58:21-07:00",
  "addDate": "2025-08-27T19:08:18.160821+00:00",
  "refreshDate": "2025-08-27T19:08:18.160823+00:00",
  "score": 1.0,
  "title": "Pro-DEI organizers fired up to maintain Target boycott as promises go unfulfilled",
  "description": "When Target announced its current chief executive officer was stepping down, organizers of a months-long consumer boycott took it as a hopeful sign and stressed that their actions will continue as long as promises go unfulfilled.",
  "content": "Organizers of a Target boycott that began in January are pointing to their tactics as a hopeful sign that actions against corporate retailers can still make a deep impact.\n\nWhen Target announced its current chief executive officer will be stepping down in February 2026 and an insider was taking the helm, those organizers saw it as a move in the right direction and stress more than ever that boycotts will continue as long as previous promises made to the public go unfulfilled.\n\n“It’s been now nearly 200 days and what all the statistics and economics are showing that since that boycott was announced on that Monday — every single week since then — Target foot traffic in nearly 2,000 stores has declined sharply and continues to decline,” said organizer Jaylani Hussein, at a news conference of the National Target Boycott movement outside Target’s Minneapolis headquarters late last week.\n\nBoycott organizers in Minnesota were among some of the first to galvanize when Target opted in January to follow other companies like Amazon and Walmart and forego diversity, equity and inclusion initiatives. High-profile civil rights activists like the Rev. Al Sharpton and the Rev. Jamal Bryant also made similar calls for what they deemed a betrayal of previous DEI promises.\n\nSocial justice advocates say this shows boycotting is a key tactic not to be taken for granted.\n\nRetail analysts say it’s difficult to gauge the exact impact of the boycott, since Target has faced a slump the last few years and a leadership change was in the cards. Still, groups like Washington-based DC Boycott Target Coalition insist falling foot traffic is “due in no small part” to a boycott that spans coast to coast.\n\n“The leadership change doesn’t mean anything without a culture change,” the group said in a statement, vowing to continue pressuring Target until the corporation sees its diversity goals as “more important than bowing to an administration that is filled with racism, failure and hatred.”\n\nOpponents began the national boycott in February, during Black History Month. Their strategy left some Black-owned brands with merchandise on Target shelves conflicted or scrambling.\n\nBy April, Sharpton actually met with Target’s CEO Brian Cornell, who had been at the helm for 11 years. But, nothing concrete came of it.\n\nCornell’s departure from the role had been in the works for several years.\n\nIn September 2022, the board extended Cornell’s contract for three more years and eliminated a policy requiring its chief executives to retire at age 65. When Target’s chief operating officer Michael Fiddelke takes over, Cornell will transition to be executive chair of the board.\n\nIn a call with reporters, Fiddelke attributed the sales malaise to many issues like focusing too much on basics and not enough trendy items, particularly in home goods.\n\nStacey Widlitz, president of investment research firm SW Retail Advisors, said she believes that Target’s sales malaise has more to do with its operational issues — messy stores and poorly stocked shelves — not from its pullback from DEI initiatives.\n\nUnraveling them did not affect Target “exponentially compared to somebody else,” she said. “The consumer has a very short memory. If you have great, compelling product at value prices, they’ll forgive you.”\n\nThe number of Americans who say they regularly shop at Target has gone down 19% since 2021, according to Consumer Edge. The number of Americans who say they do not shop at Target has risen 17%.\n\nThe same analysis also looked at trends along party lines. Since last year, the number of regular Target shoppers who identify as Democrat has declined 13%. Inversely, the number of Republican customers has risen 13%. It’s not clear if that is due to Target’s $1 million donation to Trump’s inauguration or some other factors.\n\nThe strategy of racial justice boycotts stretches back over 160 years, from Reconstruction era “Buy Black” campaigns stressing the Black American economic influence to the Montgomery Bus Boycott of the Civil Rights Movement. There have been more modern campaigns like the NAACP’s 15-year economic boycott of the state of South Carolina over its display of the confederate battle flag widely regarded as a symbol of hatred and slavery. The civil rights group ended its boycott in 2015 after the state removed the flag from its statehouse grounds, following the massacre of nine Black parishioners at a historic African Methodist Episcopal church in Charleston.\n\nSome Black creators on the social media platform TikTok rejoiced on the platform at the CEO leaving and credited the boycotts. Others cautioned that Cornell was essentially promoted but that the boycott is still needed.\n\nBlack Americans’ buying power has climbed over the last 25 years and is now an estimated $2.1 trillion annually, according to Nielsen research.\n\nPart of the reason organizers say they have zeroed in on Target is because the company had heavily touted a commitment to DEI back in 2020 after protests erupted across the nation over the murder of George Floyd. That year, Target announced it would increase representation of Black staff by 20% over three years and invest $10 million in social justice organizations. In 2021, the company pledged to dedicate more than $2 billion toward Black-owned businesses before the end of 2025.\n\nIn January, however, Target said it would conclude the hiring and advancement goals it had set.\n\nFor boycott organizers, a reversal of those decisions is the only way to rectify the situation.\n\n“We’re expecting that Target is making good on the promises that it made. Otherwise there’s no point of discussion regarding calling off this boycott,” said Nekima Levy Armstrong, a civil rights attorney and past president of the Minneapolis chapter of the NAACP. “We’re asking people to join us, get involved and hold Target accountable for its actions.”\n\nAP Retail Writer Anne D’Innocenzio in New York contributed to this report.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Target boycott",
      "weight": 0.113476805
    },
    {
      "name": "Target",
      "weight": 0.09458479
    },
    {
      "name": "Target shelves",
      "weight": 0.093953185
    },
    {
      "name": "Target foot traffic",
      "weight": 0.09012294
    },
    {
      "name": "regular Target shoppers",
      "weight": 0.0865284
    },
    {
      "name": "DC Boycott Target Coalition",
      "weight": 0.08596093
    },
    {
      "name": "Boycott organizers",
      "weight": 0.08467615
    },
    {
      "name": "boycott organizers",
      "weight": 0.08467615
    },
    {
      "name": "boycotts",
      "weight": 0.07443336
    },
    {
      "name": "racial justice boycotts",
      "weight": 0.07209837
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96240234375
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.41015625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.382568359375
    },
    {
      "name": "/News/Other",
      "score": 0.360595703125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.354736328125
    }
  ],
  "sentiment": {
    "positive": 0.03302371,
    "negative": 0.82871985,
    "neutral": 0.13825649
  },
  "summary": "Organizers of the Target boycott, which began in January, are maintaining their stance against corporate retailers as promises regarding diversity, equity and inclusion initiatives have not been met with unfulfilled. Since the boycott began, foot traffic in nearly 2,000 stores has declined sharply and continues to decline, according to organizer Jaylani Hussein. Retail analysts have suggested that Target's sales malaise is more likely to blame for its operational issues, not from its pullback from DEI initiatives. The number of Americans who regularly shop at Target has dropped by 19% since 2021, while the number of non-US shoppers has risen by 17%. The boycott has been praised by social media platform TikTok and some argue that it is still needed for a change in leadership.",
  "shortSummary": "Organizeers of the Target boycott are committed to continuing their actions despite the company’s recent leadership changes and declining foot traffic, highlighting ongoing calls for continued boycotts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8eb45ef367f24d45b4027a8cc1980939",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Target’s ongoing boycott, sparked by the retailer’s decision to abandon diversity, equity and inclusion goals, has coincided with a decline in foot traffic across nearly 2,000 stores and a shift in consumer sentiment, with fewer Americans shopping there and a rise in non‑shoppers. Activists, including Rev. Al Sharpton and civil‑rights leaders, view the CEO transition to Michael Fiddelke as a potential turning point but insist that leadership changes must be matched by a cultural shift toward DEI commitments. Retail analysts attribute sales woes to operational issues, yet boycott organizers argue that the pullback from DEI initiatives is a key driver of the downturn, urging Target to honor its earlier pledges to Black staff and businesses. The movement highlights the enduring power of racial justice boycotts to influence corporate behavior and consumer loyalty. ",
  "argos_id": "5FXNOT2YQ"
}