{
  "url": "https://finance.yahoo.com/news/target-stock-rises-ceo-plots-195115092.html",
  "authorsByline": "Undercovered Deep Insights",
  "articleId": "0d0d57146259412e8d21b2f8704ca87b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/us.finance.gurufocus/8d5d0e6f4d2152b294b55d99b8e8d2ba",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T19:51:15+00:00",
  "addDate": "2025-08-27T19:59:50.703453+00:00",
  "refreshDate": "2025-08-27T19:59:50.703456+00:00",
  "score": 1.0,
  "title": "Target Stock Rises as New CEO Plots Fulfillment Reset",
  "description": "Stores set to play bigger role as Fiddelke steps in",
  "content": "This article first appeared on GuruFocus.\n\nTarget (NYSE:TGT) got a modest lift in trading Wednesday after signaling it will rethink how stores handle fulfillment, a move aimed at giving the struggling retailer some fresh momentum. The shift comes as Michael Fiddelke prepares to take over as CEO on Feb. 1, 2026.\n• Take a short quiz to get matched with a financial advisor who understands your goals - no pressure, just real support.\n\nTarget recently tested a built to fulfill strategy in Chicago, where select stores were given extra space to pack online orders while managing lighter foot traffic. Some outlets, however, will scale back their pack stations to focus squarely on in-store shoppers. With 96% of Target's merchandise already flowing through its physical stores, warehouses remain a small piece of the puzzle.\n\nFor Fiddelke, the strategy debate is only the start of a long to-do list. Retail voices like Jeff Macke are calling for a little kick in the ass to get Target back to basicscleaner stores, sharper grocery marketing, and stronger product availability. Investors will be watching closely to see if new leadership can turn fresh ideas into a meaningful comeback.",
  "medium": "Article",
  "links": [
    "https://www.gurufocus.com/news/3082557/target-stock-rises-as-new-ceo-plots-fulfillment-reset?utm_source=yahoo_finance&utm_medium=syndication&utm_campaign=headlines&r=caf6fe0e0db70d936033da5461e60141",
    "https://www.tipranks.com/news/a-little-kick-in-the-ass-target-stock-nysetgt-gains-as-target-reconsiders-fulfillment-strategy",
    "https://www.gurufocus.com/id/TGT?r=caf6fe0e0db70d936033da5461e60141&utm_source=yahoo_finance&utm_medium=syndication&utm_campaign=headlines&utm_content=target_stock_rises_as_new_ceo_plots_fulfillment_reset&utm_term=TGT",
    "https://quiz.moneypickle.com/?partnerid=gurufocus"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "basicscleaner stores",
      "weight": 0.10265735
    },
    {
      "name": "select stores",
      "weight": 0.10257761
    },
    {
      "name": "store",
      "weight": 0.09806969
    },
    {
      "name": "stores",
      "weight": 0.09806969
    },
    {
      "name": "Target Stock",
      "weight": 0.08401418
    },
    {
      "name": "Target",
      "weight": 0.079295695
    },
    {
      "name": "new leadership",
      "weight": 0.078891024
    },
    {
      "name": "sharper grocery marketing",
      "weight": 0.0736091
    },
    {
      "name": "fresh ideas",
      "weight": 0.07355562
    },
    {
      "name": "Michael Fiddelke",
      "weight": 0.073402315
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9912109375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9140625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.873046875
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.7578125
    }
  ],
  "sentiment": {
    "positive": 0.4467994,
    "negative": 0.14018038,
    "neutral": 0.41302022
  },
  "summary": "The announcement of a new strategy for the struggling retailer, Target, led to a surge in trading as it considers reviving its business. The retailer recently tested a built to fulfill strategy in Chicago where stores were given extra space to pack online orders while reducing foot traffic. The move is seen as a significant step forward for the company, with some outlets expected to shift their focus towards in-store shoppers.",
  "shortSummary": "Target's stock rose slightly as new CEO Michael Fiddelke announced a shift towards focusing on in-store delivery, aiming to revive the company's fortunes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4bd993d41ef84b11b18e0d3678a345e0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.tipranks.com/news/a-little-kick-in-the-ass-target-stock-nysetgt-gains-as-target-reconsiders-fulfillment-strategy",
      "text": "Retail giant Target (TGT) may be having some problems right now, but never let it be said that it is not trying to recover and keep itself alive and relevant. A replacement CEO will likely be some help, and Target is also looking to shake up the in-store experience for customers by reconsidering fulfillment strategies. Investors got behind the effort, and sent Target shares up modestly in Wednesday afternoon’s trading.\nElevate Your Investing Strategy:\n- Take advantage of TipRanks Premium at 50% off! Unlock powerful investing tools, advanced data, and expert analyst insights to help you invest with confidence.\nTarget recently ran some tests in Chicago to see which stores should be used to fulfill online orders. Part of a “built to fulfill” strategy, these locations have a little extra space devoted to packing orders for shipment. These stores are also said to have somewhat more modest foot traffic—called “…a manageable level of in-store business…”—that allows for order packing and shipment without getting in the way.\nSome stores will actually be called upon to shut down their “pack stations,” as they are known, and instead focus on in-store fulfillment. With Target stores actually handling 96% of total merchandise sales, warehouses are a “…marginal share of its total sales,” reports note.\nFiddelke’s To-Do List\nThe announcement was made official, and Michael Fiddelke is set to take over as Target’s CEO. But what should he do when he gets formally installed on February 1, 2026? Some already have an idea of how this new CEO can hit the ground running.\nFiddelke has some plans of his own, but one plan from retail expert Jeff Macke called for “…a little kick in the ass,” and a return to basics like keeping the stores clean. Other potential plans called for aggressive marketing that called attention to grocery prices, as well as augmentation of product availability in the grocery section. More stock and more kinds of stock were also called for.\nIs Target Stock a Good Buy?\nTurning to Wall Street, analysts have a Moderate Buy consensus rating on TGT stock based on nine Buys, 12 Holds and four Sells assigned in the past three months, as indicated by the graphic below. After a 38.73% loss in its share price over the past year, the average TGT price target of $105.91 per share implies 9.04% upside potential."
    }
  ],
  "argos_summary": "Target's shares rose modestly after announcing a shift in fulfillment strategy and naming Michael Fiddelke as CEO effective Feb. 1, 2026. The retailer is testing a \"built‑to‑fulfill\" model in select Chicago stores, adding packing space for online orders while some stores will reduce pack stations to focus on in‑store shoppers, reflecting that 96% of sales come from physical stores. Retail experts call for a return to basics—cleaner stores, stronger grocery marketing, and better product availability—to help Target rebound. Investors view the changes cautiously, with a moderate buy consensus and modest upside potential after a significant year‑long decline.",
  "argos_id": "9NAMZEFYC"
}