{
  "url": "https://mashable.com/review/pixel-10-pro",
  "authorsByline": "",
  "articleId": "c1c4e8fb5c9c41e5a31b94c0aa2459ab",
  "source": {
    "domain": "mashable.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://helios-i.mashable.com/imagery/reviews/03wUovQaFKQ36Abe1cvqjED/hero-image.fill.size_1200x675.v1756320366.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T19:22:46+00:00",
  "addDate": "2025-08-27T19:40:03.089466+00:00",
  "refreshDate": "2025-08-27T19:40:03.089468+00:00",
  "score": 1.0,
  "title": "Pixel 10 Pro review: An impressive camera makes up for some notable flaws",
  "description": "As promised, the Pixel 10 Pro has an impressive camera, as long as the sun is out.",
  "content": "Google's annual refresh of its Pixel line is always a treat. The Pixel hardware is lovely, and the visor on the back is quickly becoming an iconic look. (For Star Trek fans, it's giving major Geordi LaForge vibes.) The software offers one of my favorite user interfaces in the Android world, and it comes with a ton of goodies to play with besides. Anecdotally, I have seen more and more Pixel phones out \"in the wild\" in 2025, and not just among my fellow tech-nerd friends. The market share isn't there yet, but it's certainly climbing.\n\nThis year's Pixel 10 Pro refresh doesn't have as much new as previous years, and not all of the new features are necessarily welcome. Google made some choices with this phone that aren't landing for me, and that is not a reference to having Jimmy Fallon host the Made by Google event.\n\nOverall, this has been a really fun phone to play with, largely because of the aforementioned camera bump on the back. Google promised the new flagship Pixel would land with the world's best-ever phone camera, and so far, it's living up to the hype. I've been using the Pixel 10 Pro for just under a week, and these are my initial thoughts. There's a lot to love in this phone (and the closely related Pixel 10 Pro XL), so let's get to it.\n\nPixel 10 Pro specs and design: Same old, same old\n\nFirst, let's take a peek under the hood:\n\nIn terms of its aesthetics, Google clearly didn't want to alter the instantly recognizable look of the Pixel line. The phone has the exact dimensions as its predecessor. On top of that, the Pixel 10 and Pixel 10 Pro are so similar looking that I accidentally grabbed the Pixel 10 on my way to do some camera testing, and didn't notice until I'd been driving for 30 minutes.\n\nI get it — that's a me problem.\n\nThe Google-engineered Tensor G5 processor, built on a 3nm process, brings the Pixel in line with other modern flagships. The phone has a plentiful 16GB of RAM, but Google sent me the 128GB version, which is already 56 percent used up — not great! We're well past the time when 256GB should be the standard, especially on a flagship. At least Google makes it easy to upload to its cloud storage.\n\nThe battery is up just a hair over last year's Pro model by 3 percent. But the biggest upgrade to the battery has little to do with the actual battery. All phones in the Pixel 10 series now come with wireless Qi2 charging enabled — magnets and all. That's right, Pixelsnap charging accessories are here. This is great news for me — I am a MagSafe addict.\n\nThis is arguably the first mainstream phone with built-in magnet support. Frankly, it's about time.\n\nFor Android-heads, the Pixel software is among the best, if not the best. It's clean and has fun interactions throughout the operating system. Two new AI features that Google is touting are the Daily Hub and Magic Cue, though they represent both good news and bad news. Both are driven by Google's onboard AI.\n\nThe good news is the daily hub, which gives you a sort of summary of your upcoming day at the top of your Google Discover feed. Tap on it, and you get a summary of what's going on based on your calendar, email, and other tastes. The top gives you upcoming events and reminders, while the bottom feeds you YouTube recommendations, because of course it does. How good they'll be probably depends on how much you use the platform.\n\nMeanwhile, on the other side, Magic Cue — in theory — can help you manage information from various sources, so when you need to recall that information, it'll serve it up to you. The most common way this can happen will be in the Messages app. Someone asks you for someone else's phone number, and Magic Cue will grab the contact information and feed you an autocompleted field with that info — at least, in theory.\n\nMagic Cue is based on several apps all working together to give you this info, and on my review unit, I didn't have all the necessary software I needed. After working with Google for a bit, I got part of the way there.\n\nIn the scenario I described above — asking for someone's number — Magic Cue worked. It gave me an autocomplete suggestion with the person's phone number. Super! When I was asked what time my flight was, Magic Cue opened a button to jump to my calendar, which is also nice, but the whole point of Magic Cue was to give you the information without jumping between apps. Finally, I was asked what my Global Entry number is, which is a pinned note in Google Keep (which is supposed to be a supported app), and I wasn't given any information at all.\n\nI also tried calling United Airlines, and I was served up a travel voucher that United Airlines sent me from my last flight. It's nice that it connected those dots, but honestly, if I'm calling United Airlines, and I'm flying tonight on United Airlines, wouldn't my itinerary be more helpful?\n\nSo, Magic Cue seems to be halfway there, which is arguably better than a certain other company's track record rolling out AI features, but that's a different matter entirely. It's also fair to mention that Magic Cue can take some time to curate the proper information, so I think the fairest criticism I can make is that it's not quite done cooking, but as with any software, that can change fast.\n\nHistorically speaking, Google Tensor processors have not been the best on the market. Like Samsung Exynos processors (Google collaborated with Samsung on Tensor processors from the beginning), they suffered in comparison to Apple and Qualcomm Snapdragon processors. I also noted the performance gap between Exynos and Snapdragon processors when I reviewed the latest a few weeks ago. That being said, while the processor isn't the fastest out there, it's plenty fast to open apps, switch between them, and power onboard AI features like live language translation.\n\nI played a few games on the Pixel 10 Pro, the heaviest of which was Asphalt Legends. After a 20-minute gaming session, the phone showed no lag, nor did it heat up too much. That's an improvement over past Pixels I've reviewed, and I'm happy about it.\n\nAnecdotally, I can say that the battery life seems to be fine. (As a smartphone reviewer, my usage isn't exactly typical.) Beyond the times when I was testing the cameras to their limits, I still had 30-40 percent left in the tank at the end of the day. Bottom line, unless you're a heavy gamer or taking high-def videos, you should be fine.\n\nI already tested the camera set extensively when I compared it with the Samsung Galaxy S25 Ultra. Here's the headline: The Pixel 10 Pro main camera lives up to the hype, and Google set the hype bar extra high this year. On balance, the Pixel 10 Pro beats out the S25 Ultra.\n\nThe 100x Super Res zoom in particular is eye-popping. Other aspects, like portrait mode, are a bit clunky, but overall, you'll struggle to take a bad photo during the day with this smartphone.\n\nAt night, it's a different story. The main camera is OK, taking very acceptable photos at night with some amount of grain in the darker areas and blown-out highlights from light sources, but if you stray from that main camera to the ultrawide or telephoto lenses, or if your subjects are living (and therefore moving, even minimally), your photos fall apart quickly.\n\nVideo is a similar story, unfortunately. The exception to that rule comes from the Night Sight video mode. This is not a new concept this year — Night Sight Video Boost, which launched on the Pixel Pro 8, can do a lot of heavy lifting to clean things up in such a situation. There's still a good bit of grain, but the shudder and shake from footsteps is cleaned up considerably. I still wouldn't shoot — to imagine a completely random scenario not at all based on real events — a music video with it, but a fun night out with friends could work.\n\nThis is pretty disappointing, to be perfectly frank. Considering how good the cameras are during the day, to see this much drop off by night is surprising. Google has built its Pixel brand on being great at photos, and this isn't it.\n\nOverall, this is an excellent phone with a few notable flaws. I haven't even addressed the fact that Pixels went to eSIM only in this review, which is at best inconvenient (as evidenced by the 30-minute hold required with T-Mobile's customer service to activate it), and at worst, consumer-hostile. eSIMs won't adversely affect the average consumer's life, but they're heckin' annoying for phone reviewers and anyone else who switches phones more than once per year.\n\nNighttime photography is also very disappointing, though daytime performance (and Super Res Zoom) almost entirely makes up for it. Beyond those two drawbacks, though, this phone is quite good and a worthy upgrade.\n\nThe hardware is on point, though the color selection could be better and brighter. The software is great as is, and if Magic Cue can start to deliver what it promises, that could range from neat to game-changing. Right now, it's more toward the \"neat\" side. The only thing stopping me from using this phone full-time is the fact that it doesn't fold, but that will change in October when the Pixel 10 Pro Fold lands, and I am here for it.",
  "medium": "Article",
  "links": [
    "https://mashable.com/article/google-pixel-10-pro-xl-announced",
    "https://mashable.com/article/made-by-google-pixel-10-series-ai-features",
    "https://mashable.com/article/made-by-google-2025-pixel-10-event-everything-announced",
    "https://mashable.com/category/google",
    "https://zdcs.link/aeb5lW?pageview_type=Standard&template=review&module=shop-card&element=offer&item=title&element_label=Google%20Pixel%2010%20Pro%20with%20%24200%20Amazon%20Gift%20Card&object_type=review&object_uuid=03wUovQaFKQ36Abe1cvqjED&short_url=aeb5lW&u=https%3A%2F%2Fmashable.com%2Freview%2Fpixel-10-pro",
    "https://mashable.com/article/pixel-snap-charging-accessories-google-how-to-buy",
    "https://zdcs.link/aeb5lW?pageview_type=Standard&template=review&module=shop-card&element=offer&item=image&element_label=image&object_type=review&object_uuid=03wUovQaFKQ36Abe1cvqjED&short_url=aeb5lW&u=https%3A%2F%2Fmashable.com%2Freview%2Fpixel-10-pro",
    "https://mashable.com/article/qi22-wireless-chargers-iphone",
    "https://mashable.com/article/google-pixel-10-pro-fold-announced-made-by-google-2025",
    "https://zdcs.link/QP8nXo?pageview_type=Standard&template=review&module=shop-card&element=offer&item=title&element_label=Google%20Pixel%2010%20Pro%2C%20Unlocked%2C%20128GB&object_type=review&object_uuid=03wUovQaFKQ36Abe1cvqjED&short_url=QP8nXo&u=https%3A%2F%2Fmashable.com%2Freview%2Fpixel-10-pro",
    "https://zdcs.link/QP8nXo?pageview_type=Standard&template=review&module=shop-card&element=offer&item=image&element_label=image&object_type=review&object_uuid=03wUovQaFKQ36Abe1cvqjED&short_url=QP8nXo&u=https%3A%2F%2Fmashable.com%2Freview%2Fpixel-10-pro",
    "https://zdcs.link/QP8nXo?pageview_type=Standard&template=review&module=shop-card&element=offer&item=buy-button&element_label=Get%20Deal&object_type=review&object_uuid=03wUovQaFKQ36Abe1cvqjED&short_url=QP8nXo&u=https%3A%2F%2Fmashable.com%2Freview%2Fpixel-10-pro",
    "https://mashable.com/article/google-pixel-10-pro-vs-samsung-galaxy-s25-ultra",
    "https://zdcs.link/aeb5lW?pageview_type=Standard&template=review&module=shop-card&element=offer&item=buy-button&element_label=Get%20Deal&object_type=review&object_uuid=03wUovQaFKQ36Abe1cvqjED&short_url=aeb5lW&u=https%3A%2F%2Fmashable.com%2Freview%2Fpixel-10-pro",
    "https://mashable.com/article/5-best-smartphones-2025-so-far",
    "https://mashable.com/review/samsung-galaxy-z-flip-7",
    "https://mashable.com/category/gadgets",
    "https://mashable.com/article/google-pixel-10-magnets-qi2",
    "https://mashable.com/article/google-pixel-10-camera-review-s25-ultra-comparison",
    "https://mashable.com/article/how-to-watch-made-by-google-2025-livestream-pixel-10"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Pixel",
      "weight": 0.07599716
    },
    {
      "name": "Google Tensor processors",
      "weight": 0.07321563
    },
    {
      "name": "Magic Cue",
      "weight": 0.07109993
    },
    {
      "name": "phone reviewers",
      "weight": 0.06832875
    },
    {
      "name": "phones",
      "weight": 0.06800998
    },
    {
      "name": "Google",
      "weight": 0.06369181
    },
    {
      "name": "Google Keep",
      "weight": 0.06324145
    },
    {
      "name": "Google Discover",
      "weight": 0.06241407
    },
    {
      "name": "Pro",
      "weight": 0.059287477
    },
    {
      "name": "more and more Pixel phones",
      "weight": 0.05461179
    }
  ],
  "topics": [
    {
      "name": "Reviews"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.84765625
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.7666015625
    },
    {
      "name": "/News/Technology News",
      "score": 0.76025390625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.70361328125
    }
  ],
  "sentiment": {
    "positive": 0.4565205,
    "negative": 0.13991238,
    "neutral": 0.40356705
  },
  "summary": "Google's Pixel 10 Pro has been reviewed for the first time, largely due to its iconic visor on the back. The phone's features include a 16GB 128GB version, which is already 56 percent used. The battery is up by 3 percent, but it is easy to upload to Google's cloud storage. Other notable features include wireless Qi2 charging, and a new AI feature called Magic Cue, which can help users manage information from various sources. Despite some criticism, the Pixel software is among the best, if not the best. All phones in the Pixel 10 series now come with wireless charging enabled. This is the first mainstream phone with built-in magnet support.",
  "shortSummary": "Google's Pixel 10 Pro offers excellent hardware and excellent software, but some flaws and features may hinder its market appeal.\"",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "47179b3c00eb4de0ac009116810c3e1e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://mashable.com/review/samsung-galaxy-z-flip-7",
      "text": "The Samsung Galaxy Z Flip7 is a story of something old, something new, something borrowed, and something blue. The blue part is easy — my review sample, provided by Samsung, is the Blue Shadow colorway. The highlight of the phone is definitely the \"something new.\" Samsung massively updated its pocket-sized foldable phone with a huge cover screen. At 4.1 inches, it's the largest external display on a flip-style phone to date.\n\"Something borrowed\" comes in the form of the Exynos processor that lives inside the phone. Past versions of Galaxy Z Flips in international markets have been powered by Exynos silicon in the past, but U.S. phones have typically had Snapdragon hardware from Qualcomm, which we strongly prefer. The \"borrowed label\" is my hope that Samsung will go back to Snapdragon hardware in the future — more on that later.\nFinally, \"Something old\" — one of my biggest frustrations with the phone, which is a little bit better this year (but honestly not that much better than the Galaxy Z Flip 6). It has to do with the way apps appear on the external display (what Samsung calls the Cover Screen) and Samsung's refusal to treat that beautiful canvas like a proper screen. It's a little maddening, though it didn't stop me from having fun with the phone.\nShortly after Samsung unveiled the Z Flip 7 (and its incredibly thin older sibling, the excellent Galaxy Z Fold 7) this July, I hit the road to sunny (and devastatingly hot) St. Louis, home of the Gateway Arch, Six Flags, and Meremec caverns. Over the course of five days, I put this \"AI Flip Phone\" through the ringer for my Galaxy Z Flip 7 review.\nThe Galaxy Z Flip 7 is the Flex you think it is\nBefore I dive into the hardware, I need to discuss the highlight. Samsung — finally — responded to market pressure in the U.S. (and abroad) by bringing a large Cover Screen display to its flip phone, and thank goodness. The previous two generations also had larger screens, but they had odd notches in them to accommodate the camera modules, while everyone else was just cutting the display around the cameras.\nOne of the first things you should do when you get this phone is enable apps to run on this display. The problem is, it takes 13 steps to do it, and unless you're a geek (which, admittedly, if you're reading this review, you might be), most people won't bother. That's fair, but you'll be going into this fight with one hand tied behind your back.\nThe 4.1-inch AMOLED screen is large, gorgeous, and should absolutely be used to the fullest. Like the main display, it has 2,600 nits of peak brightness and a 120 Hz refresh rate. Not all apps can handle the Cover Screen (confusingly, Samsung also refers to this screen as the Flex display and/or FlexWindow), but many of them will. The good news: once you do those 13 steps, you're done fiddling with settings. You can simply add the apps that you want. The bad news: Samsung doesn't really want you to do it at all. You might be wondering what I mean by that.\nA hobbled experience\nIf Samsung wanted you to run apps on your home screen, it wouldn't require you to go into the Labs section of your settings and install a separate app from the Galaxy store to do it. It wouldn't force you to use the Samsung keyboard on the Flex display, with its lack of voice typing, regardless of which keyboard is your default keyboard (Gboard FTW). Plus, if I had to see \"open your phone to continue\" one more time, I was ready to throw the phone out the window while riding in a car through central Illinois.\nEverything from adding apps to the launcher to setting up widgets, to reordering widgets, all has to be done with the phone open, for some reason. It makes me sad.\nOnce you work around those picadillos and get down to business, the cover screen itself is lovely. Most apps work well on there, including Gemini and Gemini Live, which is a fun way to work with Google's AI. The display also goes right up to the edge of the phone.\nThe rest of the hardware\nSamsung built a really solid phone here, and it's great to use. The casing is armor aluminum, and the hinge has been redesigned this year, slimming down the phone just a bit. The hardware is more squared off than Motorola's Razr, which can make one-handed opening a little harder. But it's tight and functional. When you close the phone, you will do so with one of the most satisfying \"Thwaps\" you've ever heard. Speaking of which, it makes hanging up on people way more satisfying than it already was.\nThe buttons on the side of the phone aren't raised by much, which can make it hard to locate them without looking. I often missed the fingerprint sensor in the power button because I had trouble finding it. But the rest of the hardware is absolutely solid. The 6.9-inch AMOLED main screen is also larger than previous generations at 6.9 inches. The screen has the same teardrop shape closing that minimizes the crease, which you can see but won't care about.\nThe phone is powered by a 4,300 mAh battery that's just 100 mAh smaller than its larger sibling, the Samsung Galaxy Z Fold 7. As such, it can easily last all day, especially if you perform most tasks on the cover screen. I noticed the phone tended to run hot, but only when I was already outside baking in a water park or at the St. Louis Zoo, so I suspect the weather was just as likely at fault as the phone itself.\nThe software on the inside\nHaving talked about the software on the cover screen, the software when open is… basically the same as any other Samsung phone. OneUI 8.0 is built onto Android 16, making these phones the first to ship with Android's latest operating system. That's no surprise — Google and Samsung have been joined at the hip for a while now. OneUI 7 was a divisive operating system because a lot of Samsung users liked how their phones worked before it rolled out (my wife among them).\nPersonally, I loved OneUI 7.0 because it brought back the vertical scrolling app drawer and the Pill, which apes Apple's Dynamic Island in a lot of great ways. OneUI 8 adds all those benefits and takes things a step further, bringing 90:10 multitasking to the phones. What that means is you can run two apps, one on top and one underneath, but you can move the separator so you only see 10 percent of one of the apps. Tap that 10 percent and the app pops up to become the 90 percent, and vice versa. It works better on the Galaxy Z Fold 7, but it's also quite nice on the Flip 7.\nWhen you half-fold the Flip, you activate Flex Mode, which lets you make the most of the foldable design. In Flex Mode, the app lives in the top half of the screen, and the bottom half becomes a sort of control panel in supported apps. In YouTube, for example, the bottom half gets a play bar and play controls, which is pretty neat.\nI also love that Dex is available on the Flip7. Samsung Dex basically turns your phone into a CPU when you connect a monitor, mouse, and keyboard to it. It gives you a windows interface similar to Windows. I spent some time with Dex on my trip to St Louis, but most of the time I'm using Dex is on long-haul flights, getting some work done with a set of Xreal One glasses. Now that is a rollicking good time, and I'm happy Samsung's smaller foldable has that capability.\nWe have to talk about the AI\nThe Flip 7 has a lot of the same AI tricks as other Samsung phones, including camera tricks and AI photo editing, such as moving subjects around or using generative AI to fill in the background. Two notable improvements include Gemini on the Flex screen, including Gemini Live. That's a nice bonus. Gemini Live also works with the external camera (when the phone is open, to be clear) to become multimodal. At the St. Louis Zoo, I could point the camera at an animal and ask what I was looking at, and in every case, it was correct, which was surprising, to be perfectly honest.\nWhat was a little annoying was how chatty Gemini Live would get. \"That's an Asian Elephant! You can tell by the size of the ears. Would you like to know more about the Asian elephant? Do you have any questions about it? Please for the love of all things holy talk to me!\" That's not an exact quote, but you get the point.\nThe other AI features, like Samsung's Now bar, also appear on the Flex screen, even if the Now Brief is still less than good. It still returns news stories that aren't relevant to me. It kept me up to date with the weather even as I traveled, so that was nice, but I still don't have much use for it.\nBattery life and performance\nThe Samsung Galaxy Z Flip 7 comes with an Exynos 2500 processor built on a 3nm process, similar to flagship processors from Qualcomm and Mediatek. This is Samsung's homegrown silicon. What's odd this year is that all Flip 7s will be sporting the Exynos processor. In the past, Z Flip phones sold overseas had Exynos while the U.S. versions had Snapdragon processors. Because of this, we know that Snapdragon usually outperforms Exynos. This year, we can't make that comparison, but it's fair to say history is not on Samsung's side.\nGeekbench is a benchmark tool you can use to get an idea of how a processor performs. Geekbench returns scores of 2,354/7,340 single/multi-core scores on the Flip 7. For context, the Snapdragon 8 Elite in the Samsung Galaxy Z Fold 7 returns a 2,430/8,823 score, so it doesn't exactly blow it out of the water. Day to day, the only real stutters I noted were in the camera software occasionally, and sometimes when running multiple windows in Dex. They were minor hiccups, but still noteworthy.\nAs for battery life, despite spending all day, most days out and about, away from Wi-Fi and in hot temperatures besides, the phone never died before bedtime. I wouldn't call this a multi-day phone, but it's very not bad, and you'll get a lot more mileage out of it if you use the cover screen as often as possible.\nCameras are as good as your lighting\nThere are three cameras on this phone, but you'll only really ever need to use two of them.\n50MP main camera with 2x zoom\n10MP main screen camera\n12MP ultra-wide camera\nTo be honest, I didn't find much use for the 10MP selfie camera.\nOne of the key benefits to using a flip-style foldable phone is the ability to turn the Cover Screen into a preview window for taking selfies. The hinge is very rigid, so you can even use the phone as its own tripod and use gesture controls to take photos and videos. I took a bunch of fun selfies at the St. Louis Arch, Meremec caverns, and all points in between using that flex hinge, and I got some great shots. You can also hold the camera half open at a 90-degree angle for a camcorder grip if you're nostalgic (a feature you'll also find in the Motorola Razr Ultra).\nThe results you get will be highly dependent on your lighting conditions. For example, at Six Flags during the day, my shots were brilliant. Meremec Caverns and the St. Louis aquarium were both a bit hit or miss. I would recommend that if you're in low-light conditions, take a lot of shots (to increase your odds of getting a good one) and make sure your subjects are as still as possible. Photos of stalactites are going to be very good. Photos of the people standing in front of them, not so much.\nThe camera software offers shots of up to 10x, but you will never want to go that high. In my experience, the 4x zoom is usable; at 10x you lose all depth and texture. The shots might be OK for social media, but in general, you'll want to avoid those. As often as not, they're not good.\nI also saw a surprising amount of grain in a lot of my lower-light shots. Samsung is usually pretty good at cleaning those things up in low light, but even some of the daytime shots, particularly ultrawide and macroshots, ended up grainy in darker areas.\nShooting video is much the same, though less forgiving. Low-light video is not terrible with the main camera, but don't move or walk while shooting. The judder gets pretty bad when you start walking. Good shots are possible in the dark, but that's more the exception than the rule.\nOverall, this is a pretty good camera setup that does very well in the day, and even when the sun is starting to go down. Find yourself in a cave — as one does — and your results will fall into the range of \"mixed bag\" down to \"dumpster fire.\"\nSo, is the Samsung Galaxy Z Flip 7 worth it?\nFlip phones are really fun. I love using them, especially when taking selfies with the main camera. You can do that with the Fold 7, but holding that phone open is awkward. Holding a tiny little pocket square in your hand is so much easier and a much better experience. For $1,099, I think you will like this phone, too. Plus, it's cheaper than its primary competition, the Motorola Razr Ultra, which has a comparable camera and a higher price tag.\nThere are some corners cut here. The Exynos processor is not bad (Motorola's flagship foldable has a Snapdragon processor), but not the best you can buy. I can't hate on Samsung's cover screen software too much because it's a curated experience that Samsung wants you to have, and it really only makes me sad because I'm a nerd. The cameras are very good for this category, though it wouldn't hurt Samsung to take some notes from overseas competitors.\nSo, should you buy the Z Flip 7? Again, if you're a fan of the form factor, this is the most compelling foldable on offer here in the United States. If you're already looking at something like the Samsung Galaxy S25 Plus, this one folds in half for only $100 more. I like what Samsung has finally done here, catching up to its contemporaries and restarting a competition war in which the consumer will ultimately win.\nWhere to buy the Galaxy Z Flip 7\nYou can buy the Z Flip 7 at Samsung, Amazon, and Best Buy (or just about any place that sells phones) for $1,099.99.\nAt Samsung Galaxy Unpacked, Samsung also debuted a mid-range version of the F Flip 7, following Motorola's lead. The Galaxy Z Flip 7 FE offers most of the same features for $899.99."
    },
    {
      "url": "https://mashable.com/category/google",
      "text": "What is Google? Let me Google that for you. Google is a technology company that was founded in 1998 by Larry Page and Sergey Brin. It was started as a search engine that ranked results based on the websites' relevance to the search query. Searching for something on Google became so ubiquitous that \"google\" is now listed as a verb in the dictionary. In addition to its search engine, Google products include, advertising through Google Ads, Gmail and Google drive cloud computing, and consumer products like the Google Pixel smartphone, Chromebook laptop, and Nest smart home system. Google, as well as other major tech companies like Facebook and Amazon have been criticized for violating antitrust laws and inhibiting business competition. Through its cloud services, search engine data, and consumer products, that all collect personal information, Google has also been the subject of privacy concerns. Today, Google is one of the biggest and most powerful tech companies in the world."
    },
    {
      "url": "https://mashable.com/article/pixel-snap-charging-accessories-google-how-to-buy",
      "text": "Google announces Pixelsnap magnetic charging accessories, its answer to Apple MagSafe\nGoogle held a celeb-studded Made By Google event on Wednesday and there was lots of news. But one new line of products could change how you charge your Pixel phone forever.\nAlongside the Pixel 10 smartphones and Pixel Watch 4, Google dropped its new Pixelsnap products, which incorporate magnets to hold and prop up your phone. The line represents Google's answer to Apple's popular MagSafe charging. That means you can just slap your phone on a charger and feel confident it'll stay upright and charging. Speaking from MagSafe experience, it can prove to be a game-changer, especially for watching videos or making video calls without a stand.\nGoogle isn't just copying MagSafe, however. The new Pixel 10 smartphones incorporate magnets into their design to make them compatible with the new Qi2 wireless charging standard, which uses magnets to properly align phones and wireless chargers.\nDuring the Made by Google event, Google launched a Pixelsnap charger, a charger/stand bundle, and PopSocket-esque ring stand. All three are available for pre-order and will be released on Aug. 28.\nA world of possibilities just opened for Pixel users everywhere. Keep an eye out for all the new magnet-based accessories coming your way.\nTim Marcin is an Associate Editor on the culture team at Mashable, where he mostly digs into the weird parts of the internet. You'll also see some coverage of memes, tech, sports, trends, and the occasional hot take. You can find him on Bluesky (sometimes), Instagram (infrequently), or eating Buffalo wings (as often as possible)."
    },
    {
      "url": "https://mashable.com/article/5-best-smartphones-2025-so-far",
      "text": "The 5 best smartphones of 2025 so far\nJoin Mashable as we look back at the viral moments, breakout movies, memes, dating trends, tech buzz, scientific breakthroughs, and more that have defined 2025 — so far!\nEveryone knows the most exciting smartphones launch in the back half of the calendar. Samsung's foldables, Google's latest Pixels, and of course the iPhone 17 are all tipped to come out after June, if rumors are to be believed. Having said that, we can still celebrate the phones that have already come out in 2025. Why not? There are no laws against it.\nWhile it's true that this list will focus mostly on non-flagship models, that doesn't mean they aren't worthy of praise. So far, 2025 has brought us plenty of interesting smartphones at compelling prices, as well as a couple of bona fide flagships that are worth your attention.\nSo, here are the best smartphones from the first half of 2025. To be clear, this list is not ranked in any particular order. These are just five good phones, folks.\nGoogle Pixel 9a\nGoogle's Pixel A-series of budget phones with flagship-like specs has always provided great value. The 2025 variant is no different.\nThe Pixel 9a is a lot like previous A-series Pixel phones in that it's very similar to the base Pixel 9, but with a few little compromises here and there to get the price down to a downright agreeable $499. You get a spiffy 6.3-inch display with a 120Hz refresh rate, a large 5,100mAh battery, and Google's latest Tensor G4 processor for that price. Sure, you lose a bit of RAM and storage capacity by going with Pixel 9a, but those are small potatoes compared to the ways in which Pixel 9a is similar to Pixel 9, but for less money.\nGoogle also unveiled a new Pixel design with the 9a, which dropped the horizontal camera bar that had adorned Pixel phones for the past several years. Sure, it looks a bit more generic than before, but it also lies flatter on a table than before, too. Between all of that and traditionally solid cameras courtesy of Google, the Pixel 9a might be the best overall value on this list.\nSamsung Galaxy S25 Ultra\nFull disclosure: I didn't love the Samsung Galaxy S25 Ultra when I reviewed it earlier this year.\nThat has less to do with the phone itself and more to do with the increasing creep of AI features into all of our devices, though. The S25 Ultra is not very different from the S24 Ultra in terms of hardware; you get the same display, storage, and RAM specs from the previous model, for the same starting price of $1,299. Some additional AI features were meant to be the main selling point for S25 Ultra, which just isn't that compelling to me, personally, but YMMV.\nHowever, the Snapdragon 8 Elite for Galaxy processor inside the S25 Ultra is top-of-the-line stuff, providing the phone with excellent all-around performance. It's got a big, sturdy battery, a slightly bigger display than the S24 Ultra, and new rounded corners that make it feel much better in the hand. While I wouldn't recommend upgrading to an S25 Ultra if you already have an S24 Ultra, those with older Samsung handsets who are looking for the best of the best should really look into it. It's a good phone, if not a mindblowing one.\nSamsung Galaxy S25 Edge\nThe other Samsung device on this list also fits under the \"good and cool, but not mindblowing\" umbrella.\nSamsung's Galaxy S25 Edge has a lot in common with the S25 Ultra. It uses the same processor, its display has the same resolution and refresh rate (although it's 2/10 of an inch smaller), and even the RAM is the same. You get access to all of the same AI features and even the same 200MP wide lens on the rear for photography.\nSo, why are these two different phones? Simple: The S25 Edge is way thinner. Coming in at just 5.8mm of thickness, it's the thinnest phone Samsung sells right now, and is substantially more svelte than the 8.2mm S25 Ultra. Put simply, the S25 Edge looks and feels cool in the hands because of how thin it is. There isn't a bigger selling point than that, honestly. It feels futuristic in a way nothing else on this list does.\nOnePlus 13\nThe last flagship phone on this list is the OnePlus 13, which comes from a Chinese brand that may not be as well-known in the U.S. as Google, Samsung, and Apple. But that doesn't mean it should be that way.\nOnePlus 13 carries on the tradition of previous OnePlus phones in that it offers flagship specs and features for less than $1,000. At $899, it's a good deal cheaper than an S25 Ultra, but the two phones are actually pretty comparable. OnePlus's handset includes a similar Snapdragon 8 Elite processor, 12GB of RAM, and a massive 6,000mAh battery that keeps it alive for longer than 24 hours of normal use. Even our intensive battery testing got a clean 24 hours of screen time out of the OnePlus 13. It has plenty of endurance.\nA trio of 50MP cameras on the back and some requisite AI features make the OnePlus 13 a very solid value for those who want flagship performance, but don't have more than $1,000 to burn on a phone.\niPhone 16e\nSpeaking of great battery life, let's talk about the iPhone 16e.\nNominally Apple's answer to the Pixel 9a (in that it's basically an iPhone 16 with some corners cut to bring the price down to $599), the iPhone 16e is an upgrade over Apple's previous iPhone SE budget line. You get the swanky new A18 Bionic from the iPhone 16, as well as 128GB of starting storage and full support for Apple Intelligence features. The 6.1-inch OLED display is more than good enough for a phone of its price, though it is limited to 60Hz.\nWhere it really shines, though, is in longevity. Our reviewer was able to get two days of solid use out of a full charge, which is incredible for any phone, much less a budget model. Those looking for a meat-and-potatoes iPhone that will get years of software updates should look no further.\nHonorable Mention: Motorola Razr Ultra\nAs one of the only new foldable phones released in 2025, we can't ignore the Motorola Razr Ultra, especially the version with a slick wood finish. (Well, we could, but we chose not to.) The flagship version of Motorola's foldable phone series has its fans and critics, and it's only been out for a couple months. We're still in the process of testing this phone, and we're not ready to render a full verdict quite yet. Though, if you want a foldable, we recommend waiting, as Samsung is expected to launch its new Z Fold 7 and Z Flip 7 phones in the coming weeks.\nAlex Perry is a tech reporter at Mashable who primarily covers video games and consumer tech. Alex has spent most of the last decade reviewing games, smartphones, headphones, and laptops, and he doesn’t plan on stopping anytime soon. He is also a Pisces, a cat lover, and a Kansas City sports fan. Alex can be found on Bluesky at yelix.bsky.social."
    },
    {
      "url": "https://mashable.com/article/how-to-watch-made-by-google-2025-livestream-pixel-10",
      "text": "How to watch the Made by Google event and Pixel 10 launch on Aug. 20\nIf you're at all interested in what Google has in store for its Pixel 10 lineup, you're not going to want to miss the annual Made by Google livestream event at 1 p.m. EST on Wednesday, Aug. 20.\nThere have been plenty of leaks ahead of this event, including loads of Pixel 10 specs, the Pixel 10 Pro Fold, the Pixel Watch 4, Pixel buds, and more. We'll be covering the event live, and you can watch as Google unveils all the new Pixel devices (and hopefully some surprises as well).\nThere are plenty of ways to watch the big event, including a live feed from CNET, but if you want it straight from the source, head to Made by Google's YouTube channel to watch the show.\nIt already has a trailer set up, and, if you're as eager as we are, you can turn a notification on so your YouTube account will make sure you know when the show goes live on August 20 at 1 p.m. ET.\nLast year, Google announced the Pixel 9 (which came in a glorious bubblegum pink), the Pixel 9 Pro, the Pixel 9 Pro XL, the Pixel 9 Pro Fold (Mashable tech reporter Alex Perry's favorite foldable yet), the Pixel Watch 3, and a ton of AI features, like an AI-powered Pixel weather app, Made you look, Add Me, and Pixel Screenshots all at the Made by Google event.\nChristianna Silva is a senior culture reporter covering social platforms and the creator economy, with a focus on the intersection of social media, politics, and the economic systems that govern us. Since joining Mashable in 2021, they have reported extensively on meme creators, content moderation, and the nature of online creation under capitalism.\nBefore joining Mashable, they worked as an editor at NPR and MTV News, a reporter at Teen Vogue and VICE News, and as a stablehand at a mini-horse farm. You can follow her on Bluesky @christiannaj.bsky.social and Instagram @christianna_j."
    },
    {
      "url": "https://mashable.com/category/gadgets",
      "text": "More Gadgets\nThe top 10 products Mashable readers bought in July 2025\n'Twas a month filled with DJI drones and Apple purchases.\nSonos Roam speakers are overheating and melting their charging ports\nThe company says it is taking steps to address the issue which has impacted several speakers.\nBy Amanda Yeo\nScore a stunning 50-inch QLED Fire TV for just $229.99 — save $100 at Best Buy\nExperience premium colour, cinematic sound, and smooth gaming without breaking your budget.\nBy Ben Williams\nGrab a 4-pack of Tile Mate Bluetooth trackers in fun colors for under $60\nThese babies are great for both Apple and Android users.\nBack to School: College students love the Woozoo fan, and it's on sale for $39\nI got this fan with a recommendation from my college-aged cousins.\nAll the Pixel 10 rumors and leaks to date: Pricing, colors, and specs reportedly leaked\nLately, the Pixel 10 has been leaking like a faucet.\nChristmas in July: The most gift-worthy gadgets of the year so far\nIf you have your eyes on these gadgets, there's still time to get on the nice list for Christmas 2025.\nGive your living room a more polished look with this customizable TV skirt\nHide cords and clutter.\nDJI is bringing its e-bikes to the U.S. market with a jaw-dropping price tag\nThe drone company debuted its e-bike range in the United States.\nSkechers can't decide if its AirTag sneakers are for tracking shoes or tracking kids\nThe Find My Skechers line is out now.\nNuu N10 smartphone review: A $100 Android phone can’t be this good...can it?\nWho says you have to spend $1,000 on a new cell phone? This budget Android begs to differ.\nLong-term review: I used my Beats Pill speaker for 1 year and still think it's an underrated gem\nNew sound architecture, same gorgeous appearance.\nThis SSD is smaller than a grape and adds 256GB of storage to your phone\nPlus, everything is secured with your fingerprint.\nMagnets could be coming to the Pixel 10 and other Android phones\nThe new Qi2 wireless charging standard could change Android smartphones.\nThe best Samsung deals to shop this week: Galaxy Watch 8, Z Flip7, and more\nNew Galaxy devices just dropped and you can already score a deal.\n75+ birthday gifts to add to your wish list\nWe answer the age-old question: \"What do I want for my birthday?\"\nMy favorite travel companion is the Anker Nano 3-in-1 power bank\nI'll never forget my charger at home again.\nThe popular Amazon Fire TV Stick 4K is back under $25\nPack it on your next vacation for easy access to your favorite shows.\nWhat is Bee, the always-listening AI wearable acquired by Amazon?\nAmazon makes a bet on the AI wearable market.\nBy Alex Perry\nLeaked video purports to show new Lenovo Legion Go 2 handheld with OLED display\nIt's got better controllers and an OLED screen.\nBy Alex Perry\nTikTok's favorite mics are hardly ever in stock — now you can get the DJI Mic 2 bundle for $100 off\nHurry to score this deal at Woot.\nShred your personal data with this $30 tool\nIt’s like it never even happened.\nIt’s a Chromebook. It’s a tablet. It’s only $169.99.\nThis is not a drill.\nDJI wireless mics are so popular on TikTok they keep selling out. Here's how to find them in stock.\nEven Chit, TikTok's brightest star of the moment, uses them."
    },
    {
      "url": "https://mashable.com/article/google-pixel-10-camera-review-s25-ultra-comparison",
      "text": "Google says the Pixel 10 Pro has world's best phone camera. I tested it against the S25 Ultra and found a clear winner.\nAt the recent Made by Google event, Google made a bold promise: the new flagship Pixel 10 Pro has the best phone camera in the world.\nNow that the phone is in my hands, I wanted to put that \"world's best\" promise to the test by comparing it to the Samsung Galaxy S25 Ultra, the previous title holder. In terms of megapixels, Samsung's flagship has a giant head start with a 200MP main camera, while the Pixel 10 Pro has a 50MP main camera that's more in line with the iPhone 16 Pro Max's 48MP camera.\nBut camera quality isn't all about the megapixel count. Google said the Pixel 10 Pro would also have a 100x zoom, superior nighttime photography, and an AI \"Camera Coach\" feature, for training the boyfriends of the world to take a good couple's photo (Google's words, not mine).\nI wanted to put the Pixel 10 Pro and Galaxy S25 Ultra cameras head-to-head to see which one came out on top. You can judge the results for yourself with samples from the more than 500 photos and videos I shot with the two phones.\nDon’t miss out on our latest stories: Add Mashable as a trusted news source in Google.\nPixel 10 Pro vs. Galaxy S25 Ultra cameras: Comparing the hardware\nBoth phones bring similar hardware to the mix, but there are a few notable differences.\nThe Pixel 10 Pro has:\n50MP main lens\n48MP 5x telephoto lens\n48MP ultrawide lens\n42MP selfie camera\nMeanwhile, the Samsung Galaxy S25 Ultra has:\n200 MP main lens\n10MP 3x telephoto lens\n50MP 5x telephoto lens\n50MP ultrawide lens\nOn paper, it would seem like the Samsung phone has the Pixel beaten hands down, but that's not what the results say.\nI need to mention one pretty huge caveat: a true comparison is only possible because I'm looking at the photos on a Monoprice 32-inch monitor at 100% zoom. On a phone screen or Instagram feed, the photos from both phones look amazing. It's only when you really dig in that you start to see little differences.\nComparing the main cameras\nBoth phones have really great main cameras with excellent color reproduction and clarity. I think the 200-megapixel lens on the Samsung S25 Ultra does a better job of capturing the whole scene with clarity in the foreground and the background. The Pixel 10 Pro captures the texture of the trees better but loses a bit of clarity on the roller coaster in the background. Meanwhile, the Pixel captures the stars on the flag more distinctly — they are stars, while the Samsung loses some detail and makes them look more like circles. However, overall, Samsung captured the waving flags just a bit sharper than Google's phone.\nFor all these comparisons, I've put the Pixel 10 Pro photos on the left and the S25 Ultra photos on the right.\nUltrawide cameras\nThe ultrawide cameras on both phones lose a lot of detail, but that's normal for an ultrawide camera. Textures get mutilated and grain starts to seep in. I've never seen an ultrawide camera that didn't do that. The ultrawide camera of the Pixel 10 Pro captures a bit more of the scene, which is what an ultrawide is supposed to do after all, so I have to give it the nod.\nTelephoto 5x\nBoth phones come equipped with a 5x periscope telephoto lens. Both of these cameras are excellent at capturing images at 5x optical zoom, which, as a father, I value far more than ultrawide. Overall, I think Samsung's photo was more color realistic, while Google's seemed to punch up the bright colors to make them pop more. It's a matter of taste, but given the two, I'd probably prefer the pop of the Pixel 10 Pro, and not just for the alliteration. Both lenses caught really great detail, as this floral background could be challenging for a lesser lens.\nTesting the 100x zoom\nNow we get to the big kahuna. Samsung has been bragging about its 100x zoom for years now, while Google only recently got into that game.\nFamously, Samsung Galaxy S Ultra phones are known for their photos of the moon. Unfortunately, during my testing period, the moon stayed below the horizon for the most part. So, I had to stick with terrestrial objects. First, I grabbed a photo from a sign for a ride from about 150 feet away.\nYou can see how far away I was in the first photo. Then just to be sure, I walked over and took a photo of the actual sign to show you what it should look like up close:\nFrom there, I zoomed in and let the phones do their work. You can see the results for yourself:\nIt's widely known by now that super zoom smartphone photos depend on AI technology to enhance photos and fill in gaps. And neither of these photos is very good. The Samsung Galaxy S25 Ultra's photo is very blurry and blotchy, while the Pixel photo looks more like a painting or crayon drawing. Neither captures the sign perfectly, but if you made me choose, I'd go with the Pixel 10 Pro's rendition over Samsung's, though Samsung got closer to the actual colors of the sign.\nThe next one I tried was of a pair of insects, let's say, hugging, on a flower about 10 feet away. In this case, the Pixel beat out the Samsung, and it's not even close. While the Samsung photo looks OK on the phone screen, it doesn't survive a closer inspection on a 32-inch screen. The Pixel's photo is a lot sharper with more detail.\nIn short, if you're looking for the smartphone with the best 100x zoom, it's now the Pixel 10 Pro.\nWhat about portrait mode?\nPortrait mode is especially tough on a phone because it tries to replicate a phenomenon that comes naturally to a larger lens — bokeh. It's the blurring of a background while the subject of a photo remains tack sharp and clear. For this one, I borrowed my wife because she's cute and I can afford her modeling rates.\nPortrait mode is especially tough when there are stray hairs around a subject's head, and while my wife's perfectly coiffed hairdo is beyond reproach, there are still a few hairs that escaped her attention. Samsung handled these with much more aplomb than the Pixel. The Pixel makes it look like my wife was photoshopped into the photo — it's good, but it's almost too good. There are a few identifiable stray hairs, but they are cropped and blurred with the background.\nOn a phone screen, it looks fine, but blow up the photo and you'll see the truth. The way Samsung worked with those hairs is much closer to the physics that guide a camera lens.\nCamera coach\nThe Pixel 10 Pro has one last trick up its sleeve — a new AI tool called Camera Coach. This photography feature (which works in the cloud, not on device) can instruct you on how to take a great photo based on what your camera sees.\nWhen you aim your camera, there's a camera with a star icon in the upper right corner. Tap that, and the camera will take in the scene. From there, it will suggest a few shots you can take. Once you select one, it will generate steps to help you capture the shot, such as \"Step closer to the subject\" or \"Try increasing the exposure on the shot.\"\nHere is a shot I took of a big checkerboard at a nearby restaurant (my wife's \"fee\" for helping).\nThere are two things to know about this procedure. First, it takes a bit of time. It'll take about 15 seconds or so to generate the shot previews and then another few seconds to generate the steps. That's a long time to keep a living subject standing there and smiling, as my family will attest to.\nThe second caveat: the camera never actually tells you when you've completed a step. Intuitively, you would expect a camera to see that you've moved closer and then move to the next step. That's not what happens here. In fact, you can advance steps without following the directions. It's more like a camera suggestion-giver than a camera coach, but a software update could fix this.\nFor now, the Pixel 10 Pro has the edge.\nOverall, the Pixel 10 Pro and the Samsung Galaxy S25 Ultra both have ridiculously impressive camera arrays. In general, I preferred the output of the Pixel 10 Pro, but most of what I preferred was software and post-processing-related, so it's subjective, and it's entirely fixable \"in post,\" as the pros say.\nOverall, I'm impressed with what's possible with 100x zoom, but you'll get mixed results. Fortunately, the hits are much more frequent than the misses, and that's exciting. I'm all about that zoom. I'm not saying this tech is ready to capture your kids' recitals from the back of the room — you still need to depend on a proper camera for that, but as they say, the best camera is the one you have on you, and these cameras impressed me in every way.\nHow I tested these phone cameras\nSummer is lovely, and one of my favorite things to do during the summer (even its waning days) is to head to my local amusement park, Six Flags Great America in Gurnee, Illinois. Home to a number of huge and amazing roller coasters, it's a great place to just strap yourself to a chair and get thrown off a cliff.\nIt's also a great place to check out cameras. Great America is full of lovely scenery and bright colors, great for testing out all aspects of a great smartphone camera. But any camera can be great when the lighting is good, so after the sun went down, I typically test things out at Streamwood's village hall, which has a number of lovely low-light testing scenarios I can take advantage of.\nAdam Doud is a freelance journalist, product reviewer, and editor based in Chicago, Illinois. Adam has bylines at a number of different tech publications and hosts the Benefit of the Doud podcast. He uses both iOS and Android (a six-month rotation for each), and he's regularly testing tablets, smartphones, and laptops."
    },
    {
      "url": "https://zdcs.link/aeb5lW?pageview_type=Standard&template=review&module=shop-card&element=offer&item=title&element_label=Google%20Pixel%2010%20Pro%20with%20%24200%20Amazon%20Gift%20Card&object_type=review&object_uuid=03wUovQaFKQ36Abe1cvqjED&short_url=aeb5lW&u=https%3A%2F%2Fmashable.com%2Freview%2Fpixel-10-pro",
      "text": "Currently unavailable. We don't know when or if this item will be back in stock.\nBrief content visible, double tap to read full content.\nFull content visible, double tap to read brief content.\nColor: Obsidian\nMake a Color selection\nSee available options\nSize: 128GB\nMake a Size selection\n1TB\n128GB\n256GB\n512GB\nStyle: Pixel 10 Pro (Phone + $200 Gift Card)\nMake a Style selection\nPixel 10 Pro XL (Phone + $200 Gift Card)\nPixel 10 Pro XL (Phone Only)\nPixel 10 Pro (Phone Only)\nPixel 10 Pro (Phone + $200 Gift Card)\nOrder the new Google Pixel 10 Pro and get an Amazon Gift Card. Valid 8/20/2025 until 9/4/2025 at 11:59pm PT, while supplies last and subject to availability\nReturn of Pixel 10 Pro without gift card results in a charge. Offer cannot be combined, is non-transferable and not valid for cash or cash equivalent\nIf a qualifying item in your order is returned, you'll be reimbursed for what you return, minus the value of the gift card\nTaxes and other surcharges apply. Restocking fee and other charges may apply. Terms subject to change\nGoogle Pixel 10 Pro is the ultimate Pixel experience, featuring advanced AI with Gemini, unbelievable camera quality, impeccable design, 6.3-inch Super Actua display, and the next-gen Google Tensor G5 chip[1]\nUnlocked Android phone gives you the flexibility to change carriers and choose your own data plan[2]; it works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers"
    },
    {
      "url": "https://mashable.com/article/google-pixel-10-pro-vs-samsung-galaxy-s25-ultra",
      "text": "Flagship fight: Google Pixel 10 Pro vs. Samsung Galaxy S25 Ultra\nIn the market for a new, premium Android smartphone? Luckily, there are some heavy-hitting options for you.\nNamely, the Google Pixel 10 Pro and the Samsung Galaxy S25 Ultra. The former just hit the scene thanks to the big Made by Google event, while the latter's been on store shelves since January. Rather than sitting here and establishing more context, though, let's just jump right into the comparison so you can figure out which flagship appeals to you more.\nGoogle vs. Samsung: The Pixel 10 Pro has the better price\nMany of the differences between these two phones will come down to personal preference and will contain a decent amount of nuance. Price is not one of them.\nThe Google Pixel 10 Pro starts at $999 while the Samsung Galaxy S25 Ultra starts at $1,299. Perhaps the rest of this article will help you understand why Samsung's handset is more expensive, but the fact of the matter is that going with Google will save a bit of money.\nDesign: Neither phone is winning design awards\nUltimately, these are both smartphones, meaning they both look like smartphones. There's only so much that can be done within that framework, in terms of physical design. That said, both Samsung and Google have their own unique design languages that are worth talking about here.\nThe Galaxy S25 Ultra made a huge improvement over its predecessor by including rounded edges on the phone's frame, though they are notably still more angular than the Pixel 10 Pro. The arrangement of the rear camera modules accounts for the biggest design change between these two phones, of course. Samsung lets its triple-lens array float freely without any kind of housing or camera bump, instead opting to just let the three lenses sit on top of one another. Google, on the other hand, still uses the same horizontal camera bar for its three lenses, which makes the phone look kinda like Cyclops from X-Men.\nSamsung will pretty much always \"win\" when it comes to color options, too, just because it usually offers a lot more to choose from. The Galaxy S25 comes in seven colors: Titanium Jadegreen, Titanium Jetblack, Titanium Pinkgold, Titanium Black, Titanium Gray, Titanium Silverblue, and Titanium Whitesilver. It should be noted that the first three colors in that list are only available online.\nMeanwhile, the Pixel 10 Pro comes in four hues: Moonstone, Jade, Porcelain, and Obsidian.\nWhich flagship has better specs? Samsung.\nPhones are for using and not for looking at, so let's talk specs. Here are the basic specs for the Pixel 10 Pro:\n6.3-inch display with 1280x2856 resolution and 1-120Hz adaptive refresh rate\nGoogle Tensor G5 chip\n16GB RAM\n128GB/256GB/512GB/1TB storage\n4,870mAh battery\nAnd here are the equivalent specs for Galaxy S25 Ultra:\n6.9-inch display with 3120x1440 resolution\nSnapdragon 8 Elite for Galaxy chip\n12GB RAM\n256GB/512GB/1TB storage\n5,000mAh battery\nThere are obviously a few things to discuss here. The S25 Ultra is a much bigger phone than the Pixel 10 Pro, with a higher resolution display and a bigger battery. It's actually closer to the $1,199 Pixel 10 Pro XL in these respects, perhaps making that phone a more directly comparable device. Having said that, it's a clear advantage for Google that a smaller, cheaper version of its Pro phone exists at all.\nThat allows Google to offer a 128GB storage option for those who want it, but it also means the display and battery are smaller. Life is all about compromises. Interestingly, Google's phone has more RAM, regardless of size. There are no benchmarks out there yet for the Tensor G5 chip, though if previous years are any indication, it will probably not score as well as the Snapdragon 8 Elite chip. That doesn't mean the Pixel 10 Pro will have markedly worse performance, though. In my experience, they're usually pretty comparable.\nSamsung actually has one major advantage in this department: an included stylus. The S Pen accessory comes with the S25 Ultra, and the phone has a built-in slot for it. You may or may not be the type of person who wants to use a stylus, but that's objectively added value over the Pixel 10 Pro.\nGoogle has the edge on AI features\nNow that we're a few years into the whole \"every phone has AI features\" trend, the differences between devices are starting to get a little more blurry. Both of these handsets are marketed as \"AI smartphones.\"\nTo succinctly sum up these two phones in particular, the Pixel 10 Pro's biggest new AI features are meant to play catch-up with Samsung and other competitors. That's not hard for Google, which has a full suite of AI tools powered by Gemini. And since the Pixel 10 Pro comes with a free year of Google AI Pro (if you purchase at the Pixel store, at least), Google may have the edge.\nNamely, the Pixel 10 Pro has live language translation during phone calls, theoretically enabling seamless vocal communication across language barriers (we're still testing the Pixel 10 series). The Galaxy S25 Ultra could already do this in January, though Google samples your voice for a more natural conversation and performs the translation on your device for privacy. Google also added Daily Hub, a new one-stop-shop for your daily schedule, weather forecast, to-do list, and relevant news. Samsung, believe it or not, also had that earlier this year.\nGoogle does have some advantages in terms of AI photo editing. Pixel 10 Pro can edit photos based on text prompts, in case your ability to describe things is stronger than your editing finger. Camera Coach is also an intriguing new feature that can potentially teach you how to properly compose photos. Aside from that, many of the AI editing features across both of these phones are pretty similar.\nWe also have to mention Google's new Magic Cue tool. It's an AI assistant that finds information from apps like Gmail, Calendar, Screenshots, and Messages so it can automatically make recommendations. Texting someone about a dinner reservation? Magic Cue will pull up the booking and add a link to the text for you.\nPixel 10 Pro vs. Galaxy S25 Ultra: Which phone has the best camera?\nWhich flagship is better for photography? We can't render a verdict just yet.\nAt Made by Google, the company claimed the Pixel 10 Pro has the best camera on any phone in the world. While the S25 Ultra offers a way higher megapixel count on its main rear camera, the Pixel 10 Pro supposedly closes the gap with strong AI zoom, high-quality nighttime photography, and motion stabilization for video.\nThe Pixel 10 Pro's camera specs are as follows:\nRear cameras: 50MP wide, 48MP ultrawide, 48MP telephoto with 5x optical zoom\nFront camera: 42MP\nAnd here's what you get with Galaxy S25 Ultra:\nRear cameras: 200MP wide, 50MP ultrawide, 50MP telephoto with 5x optical zoom\nFront camera: 12MP\nIt's also worth mentioning that both phones now offer up to 100x digital zoom, though it remains to be seen how well it works on Pixel 10 Pro. On Galaxy S25 Ultra, it's pretty obvious that the phone is doing some digital trickery to fill in the blanks.\nRegardless, 200MP vs. 50MP for the main rear lens is a pretty stark difference, although we need to do detailed testing to see if it manifests in a meaningful way. The Pixel 10 Pro might make up for that with a 42MP selfie cam, depending on how much you like taking selfies.\nAt the end of the day, you're probably going to be able to take pretty good pictures of your pets and/or meals for Instagram, no matter which phone you choose.\nAlex Perry is a tech reporter at Mashable who primarily covers video games and consumer tech. Alex has spent most of the last decade reviewing games, smartphones, headphones, and laptops, and he doesn’t plan on stopping anytime soon. He is also a Pisces, a cat lover, and a Kansas City sports fan. Alex can be found on Bluesky at yelix.bsky.social."
    },
    {
      "url": "https://mashable.com/article/qi22-wireless-chargers-iphone",
      "text": "New, faster Qi2.2 wireless chargers for iPhones are coming. Here's what you need to know.\niPhone users rejoice. Faster wireless chargers are coming for iPhones.\nYesterday, Chinese electronics company Ugreen announced a Qi2.2 wireless charging power bank arriving soon. Quickly following suit, other Qi2.2 products were certified by the Wireless Power Consortium, all from different manufacturers.\nHere's what you need to know.\nWhat is Qi2.2?\nQi2.2 is the latest version of the wireless charging standard, improving on previous standards. The new Qi2.2 standard boosts power to 25W, or 25 watts of power. Ugreen's MagFlow Magnetic Power Bank is the first wireless charger to receive the Qi2.2 certification.\nThis Tweet is currently unavailable. It might be loading or has been removed.\nQi2, the previous version, supported the iPhone 15 and 16 since launch, and iPhone 13 and iPhone 14 since iOS 17.2. However, Qi2 only supported 15W charging speeds. The iPhone 16 already supports 25W charging, the fastest wireless charging rate, with Apple's MagSafe charger announced at the phone's launch last year.\nAs we reported at the time, the entire iPhone 16 series is \"capable of 45W charging over USB-C\" and \"MagSafe wireless charging up to 25W with a 30W adapter or higher, as well as Qi2 wireless charging up to 15W.\" With Qi2.2, third-party chargers will now be capable of 25W wireless charging.\nQi2.2 chargers utilize magnetic alignment to reduce power loss and improve charging efficiency, according to the WPC.\nWhich other wireless chargers are available?\nThe Wireless Power Consortium certified eight more products with Qi2.2 charging speeds. The consortium announced version 2.2 in April 2025 and certified products with the latest standard on July 15.\nBaseus received a Qi2.2 certification for one power bank and, according to The Verge, has another on the way. Belkin announced that several Qi2.2 products will roll out in the next few months. Anker, Aukey, Scosche, ODMs CVSMicro, and BH EVS are also set to release their own versions, too.\nApple is reportedly working on a new MagSafe charger with Qi2.2 compatibility, according to a leak last month.\nWhen can you buy these chargers?\nWhile several announcements are yet to come, some of these faster chargers are available. Aukey has a 2-1 charging stand available for preorder now, priced at $60.29. Ugreen's product is announced, but the price is yet to be revealed."
    },
    {
      "url": "https://mashable.com/article/google-pixel-10-magnets-qi2",
      "text": "Magnets could be coming to the Pixel 10 and other Android phones\nTech companies tend to make their devices lighter and thinner with each new generation, but the upcoming Pixel 10 smartphones from Google seem ready to buck that trend.\nDetails on the next-gen Pixel phones have been leaking like a faucet (catch up on the latest Pixel 10 rumors) ahead of their August launch, and now Android Headlines is reporting that the Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and Pixel 10 Pro Fold will likely be slightly heavier than their predecessors. And except for the Pro XL model, all these devices could also be thicker. The differences in thickness and weight are expected to be small — about 1 mm and 1 to 11 grams, respectively.\nRumor has it there's a simple reason why Google is adding weight for the new Pixel smartphones — magnets.\nAs Mashable has reported, the Wireless Power Consortium released new standards for Qi2.2 wireless charging. To make these next-gen wireless chargers more efficient, Qi2 devices utilize magnetic alignment to reduce power loss. For iPhone users, Apple MagSafe technology provides a ready solution. Since the iPhone 12, new Apple smartphones have already featured a ring of magnets around the wireless charger. Now, the Android world seems poised to follow Apple's lead. Frankly, we're surprised it hasn't happened sooner.\nHence, the rumors that the new Pixel 10 smartphones will come with built-in magnets to support wireless charging.\nIf this rumor bears out, then we expect other smartphone manufacturers to follow suit. The first Qi2 wireless chargers were announced earlier this month, with companies like Belkin and Ugreen set to release faster and more efficient charging products in the months ahead. The Qi2 standard also allows for 25W wireless charging, which will let users juice up their phones more quickly.\nOf course, we're speculating, and Google could instead release cases with magnets. 9To5Google has reported on a rumored Pixelsnap series of charging accessories that would mimic Apple's MagSafe products.\nNotably, mobile nerds like us have already declared 2025 the year of the ultra-thin phone, and Samsung's new Z Fold 7 is significantly thinner than the Z Fold 6. So, if Google is moving in the opposite direction, we expect they have a good reason why. We don't have to wait long to find out, as the new Pixel 10 phones will be officially unveiled at the Made by Google event on Aug. 20.\nAnd, hey, who doesn't love magnets?\nTimothy Beck Werth is the Tech Editor at Mashable, where he leads coverage and assignments for the Tech and Shopping verticals. Tim has over 15 years of experience as a journalist and editor, and he has particular experience covering and testing consumer technology, smart home gadgets, and men’s grooming and style products. Previously, he was the Managing Editor and then Site Director of SPY.com, a men's product review and lifestyle website. As a writer for GQ, he covered everything from bull-riding competitions to the best Legos for adults, and he’s also contributed to publications such as The Daily Beast, Gear Patrol, and The Awl.\nTim studied print journalism at the University of Southern California. He currently splits his time between Brooklyn, NY and Charleston, SC. He's currently working on his second novel, a science-fiction book."
    },
    {
      "url": "https://mashable.com/article/made-by-google-pixel-10-series-ai-features",
      "text": "Google brings live translation for phone calls and tons more AI to Pixel 10 series\nThe Google Pixel 10 series is officially out and, to no one's surprise, numerous AI features are packed into the new phones.\nThe event took a very different approach from previous keynotes, by bringing on a whole lot of star power to explain how people can use AI features on their Pixel devices in everyday life. Usefulness was definitely the theme of this year's Made By Google event.\nRick Osterloh, senior VP of devices and services, described today's offerings as \"personal intelligence,\" referring to the ways Google's various AI features cater to users' individual lives. Osterloh also mentioned an \"agentic universal AI assistant\" coming later this year, so stay tuned for news on AI features designed to be more proactive and do tasks on your behalf.\nWith the help of Jimmy Fallon, podcast mogul Alex Cooper, YouTube star Karen Polinesia, and others, Google showed off some sleek demos of the Pixel 10 series' AI features. Here's a roundup of the major features announced today.\nVoice translate\nOne of the more exciting live demos was the Google Pixel 10's new Voice Translate feature, which translates conversations in real-time. Fallon and Polinesia held a live conversation where Fallon spoke in English and Polinesia spoke in Spanish, and the Pixel 10 translated the conversation, matching their voices and tones.\nThis is similar to a live translation in the Meet feature Google launched at I/O last spring. However, while that feature required a Google AI Premium subscription, Voice Translate is freely available on Pixel 10 phones thanks to a combination of AI models powered by the Tensor G5 chip. This also means translations are processed on device, keeping your conversations private.\nMagic Cue\nThink of Magic Cue as an AI assistant that proactively finds information you might need to look up. It works across apps like Gmail, Calendar, Screenshots, and Messages to suggest relevant information. The live demo showed how a question about where to meet for dinner pulled up information about a preexisting dinner reservation in Fallon's calendar and recommended the message to send. This also worked with flight info and photos.\nWe anticipate that some users might find these \"helpful\" suggestions a little too invasive, so Google says you can turn Magic Cue off and control what apps it has access to.\nAI features for the Google Pixel 10 camera\nFor those who strive to be more creative, why not outsource all the creativity to your phone? That was definitely the message Google sent when demo-ing new AI features for the Pixel 10 series camera.\nAsk Gemini for photo editing help: With Cooper's help, Google showed how you can edit photos by typing directions in Gemini, like fix the lighting or the framing and voila, a perfect photo every time.\nCamera Coach: If you're trying to take the perfect shot, but don't know where to start, Google also introduced something called Camera Coach. You could experiment with different angles, lighting, and frames yourself to develop your own personal photography style, or you could let Camera Coach tell you what to do. With this setting, Camera Coach guides you with different shot options and then gives you step-by-step instructions on how to achieve that shot.\nPixel Journal\nThis one wasn't announced during the live event, but it's sure to be polarizing. Pixel Journal is a journaling app, like the one Apple introduced a few years ago, but with an AI boost. The app uses \"on-device AI to give you writing prompts that help you process your thoughts, and it offers insights into your patterns and progress over time,\" said the announcement. So if you're struggling to share your thoughts, just ask AI to write them for you.\nWe can imagine how this could be helpful for people trying to get started with journaling, but it also seems a little dystopian to have AI do it on your behalf. Isn't the point of journaling about learning to articulate your feelings? It's unclear exactly how involved Google's AI gets in your journaling practice, so we're definitely keeping an eye on this one.\nAsk AI to take a Message\nGoogle has continued to build on call screening features for the Pixel, and now that comes with asking AI to take a message. The feature, aptly named Take a Message, will transcribe any voicemails from missed calls and provide any next steps from the message.\nGoogle AI Pro subscription\nIf you buy a Pixel 10 Pro, Pro XL, or 10 Pro Fold, Google will give you a full year of its AI subscription, Google AI Pro. Google's lower tier subscription normally costs $20 a month and gets you more premium access to Google's various AI tools. This includes access to more advanced Gemini models, Google's AI filmmaking tool Flow, its podcast-style teaching tool Notebook LM, Gemini Gmail, Docs, other Google apps, and more.\nTopics Artificial Intelligence Google\nCecily is a tech reporter at Mashable who covers AI, Apple, and emerging tech trends. Before getting her master's degree at Columbia Journalism School, she spent several years working with startups and social impact businesses for Unreasonable Group and B Lab. Before that, she co-founded a startup consulting business for emerging entrepreneurial hubs in South America, Europe, and Asia. You can find her on X at @cecily_mauran."
    },
    {
      "url": "https://mashable.com/article/google-pixel-10-pro-fold-announced-made-by-google-2025",
      "text": "Google's newest foldable phone is finally here: See the Pixel 10 Pro Fold up close\nAt its Made by Google event on Wednesday, Google officially revealed the Pixel 10 Pro Fold. The follow-up to last year's excellent Pixel 9 Pro Fold isn't a huge, revolutionary jump, but the incremental changes Google did make are pretty important for fans of foldable phones. Case in point: This is the first foldable phone with an IP68 water and dust protection rating.\nThe device starts at $1,799 and arrives on Oct. 9, a bit later than the other new Pixel 10 phones. It also comes in just two colors, Moonstone and Jade. We recently got the chance to get an up-close look at the new Google foldable, and we've got all the details.\nGoogle Pixel 10 Pro Fold: Specs\nHere are the relevant specs for Pixel 10 Pro Fold:\n6.4-inch external display with 1080x2364 resolution and 60-120Hz adaptive refresh rate\n8-inch internal display with 2076x2152 resolution and 1-120Hz adaptive refresh rate\n3,000 nits of peak brightness on both displays\n5,015mAh battery (30+ hours of expected battery life)\n16GB RAM\n256GB/512GB/1TB storage\nGoogle Tensor G5 chip\nThere are a few differences from last year's model that are worth noting. The external display is a tenth of an inch bigger, but more importantly, it has a smaller bezel this time. Brightness peaked at 2,700 nits last year, so the Pixel 10 Pro Fold should be better equipped to deal with sunlight. You'll also get a newer Tensor G5 chip for improved performance, as well as a significantly larger battery that should be more durable than the Pixel 9 Pro Fold's battery was.\nGoogle Pixel 10 Pro Fold: Cameras\nAnd here are the camera specs:\nThree rear cameras: 48MP wide, 10.5MP ultrawide, 10.8MP telephoto\nFront and inner selfie cameras: 10MP\nYou'll also get a trio of rear camera lenses, as usual, but they don't appear to be horribly different (if at all) from the Pixel 9 Pro Fold's camera array, at least according to the spec sheet. It seems like the Pixel 10 Pro will be the one to get if you're really into photography, at any rate.\nWhat else is new?\nAside from the battery and display upgrades, Google has a few other things to look forward to. For starters, Google says it upgraded the hinge this year, and it promising 10 years of folding out of this phone. Beyond that, it has an IP68 water and dust protection rating, which is very good for a foldable.\nQi2 wireless charging is new here and will appeal to plenty of folks. Pixel 10 Pro Fold also has access to the same new AI features as the other Pixel 10 phones, including Daily Hub, a new one-stop-shop for your daily schedule, the weather, and any news you might want to read before you head out for the day. Also on the software side is Instant View, which lets you preview photos you've taken before taking them while the phone is unfolded.\nHow to pre-order the Pixel 10 Pro Fold\nIt's worth reiterating that the Pixel 10 Pro Fold will launch later than the other Pixel 10 devices, on Oct. 9. That said, you can pre-order it via the Google Store and Amazon now.\nTopics Google\nAlex Perry is a tech reporter at Mashable who primarily covers video games and consumer tech. Alex has spent most of the last decade reviewing games, smartphones, headphones, and laptops, and he doesn’t plan on stopping anytime soon. He is also a Pisces, a cat lover, and a Kansas City sports fan. Alex can be found on Bluesky at yelix.bsky.social."
    },
    {
      "url": "https://mashable.com/article/made-by-google-2025-pixel-10-event-everything-announced",
      "text": "Everything announced at Made by Google, including Pixel 10, Pixel Watch 4, and Pixel Buds 2a\nMaybe to avoid the jargon-heavy format of last year, Google decided to flip the script at its annual Made by Google showcase.\nInstead of the usual California stage presentation with slides and specs, this year’s event went full late-night. Hosted in New York, it played out like a special, offbeat episode of The Tonight Show, with Jimmy Fallon chatting alongside celebrities and Google execs about the new Pixel lineup and smart devices. Think less keynote, more variety show — though the hardware news was still the real star of the night.\nIt wasn’t all hardware either. Google spent just as much time hyping up its Gemini AI integrations, which now thread across every new Pixel device. From smarter camera tools to real-time translation and live call assistance, AI is still at the forefront of Google's smartphone ambitions.\nSo whether you’re here for the new phones, curious about Google’s foldable ambitions, or wondering if the Watch 4 is worth upgrading, we’ve pulled together everything announced at the event.\nPixel 10 Lineup announced\nThe standard Pixel 10 is the most approachable entry in Google’s 2025 lineup, but don’t mistake it for a stripped-down device. It’s powered by the new Tensor G5 chip, giving it the same AI-first smarts as its bigger siblings, including Gemini Live and enhanced on-device translation.\nThe 6.3-inch display is brighter and smoother than last year’s Pixel 9, and the upgraded dual-camera system now comes with better low-light performance and smarter computational photography powered by Google’s machine learning.\nPixel 10 Pro unveiled, including specs, price\nThe Pixel 10 Pro steps things up with a brighter 6.3-inch OLED display, upgraded materials, and Google’s best-in-class triple-lens camera system. You’re getting the wide, ultra-wide, and a new 5x telephoto lens that makes the Pro stand out as Google’s photography champ.\nPowered by the same Tensor G5, it heavily leverages Google’s new AI integrations, from Gemini Live to context-aware camera suggestions that can instantly edit or enhance your shots. It’s not just about photos; the Pro is optimized for multitasking, AI-driven productivity, and more advanced gaming thanks to the boosted GPU performance.\nIf the Pixel 10 is the everyday phone, the Pixel 10 Pro is the all-rounder for those who want Google’s AI vision in its best form without going foldable.\nPixel 10 Pro XL packs an impressive display\nSitting at the very top of the lineup, the Pixel 10 Pro XL is the most “no compromise” Pixel Google has ever built. Its massive 6.8-inch QHD+ display is the brightest and sharpest in the series, making it perfect for streaming, gaming, and multitasking.\nIt packs the same Tensor G5 and AI-first experience as the rest of the lineup but with more RAM, bigger battery life, and exclusive camera features like higher-resolution zoom and advanced video stabilization. Google is clearly pitching the Pro XL at power users who want the absolute best Pixel experience without stepping into foldable territory.\nThe Pixel 10 Pro starts at $999, and the Pixel 10 Pro XL, now with 256 GB base storage, starts at $1199. They’re available on Aug. 28 in Obsidian, Moonstone, Porcelain, and Jade.\nPixel 10 Pro Fold specs, price, release date revealed\nGoogle’s foldable flagship is back in the spotlight with the new Pixel Pro Fold, which doubles down on durability and versatility. The device packs the same Tensor G5 chip as the rest of the Pixel 10 lineup, giving it the power for multitasking and on-device AI smarts that really take advantage of the foldable form factor. Unfold the Pro Fold, and you’re greeted by an 8-inch OLED inner display designed for fluid split-screen app use, while the 6.4-inch cover display now matches the Pro line’s silky 120Hz refresh rate. Google also says its the first foldable with a waterproof rating.\nOn the camera side, the Fold inherits the Pixel 10 Pro’s triple-lens setup with a 5x telephoto, a rarity among foldables. This ensures it isn’t just a productivity powerhouse but a mobile photography champ, too. Starting at $1,799, it’s Google’s most ambitious hardware yet.\nUnlike the others, though, this one launches on Oct. 9.\nPixel Watch 4 is bigger, brighter, and faster\nGoogle officially unveiled the Pixel Watch 4, the company's latest entry in its steadily refined smartwatch line. The new model doesn’t reinvent the wheel, but it does polish nearly every corner: a 10 percent larger, practically edgeless display that’s now 50 percent brighter (peaking at 3,000 nits) and running on a livelier Android 16 UI, faster charging that hits 50 percent in just 15 minutes, and longer battery life.\nOn the health and fitness side, Google has integrated deeper AI-powered insights with Fitbit, more accurate heart rate monitoring, improved sleep tracking, and, notably, upgraded GPS precision for runners and cyclists. While the hardware refinements are welcome, some of the fun is purely cosmetic: the Watch 4 also arrives in fresh new colorways, making it a more stylish companion for both workouts and everyday wear.\nPixel Buds 2a aims to be feature-rich and affordable\nGoogle’s A-series Pixel Buds have long been the go-to for anyone wanting quality earbuds without breaking the bank, and now the Pixel Buds 2a are here to raise the bar. The new buds pack in all the essentials — lightweight comfort, upgraded Active Noise Cancellation, crisp and balanced audio, and all-day battery life with a charging case.\nInside, the new Tensor A1 chip powers it all, delivering audio that’s crisper, richer, and more detailed while making calls sound clearer than ever. Google says it processes sound 90 times faster than the speed of audio itself, adapting in real-time to your environment to cancel out unwanted noise. If you’re into hands-free smarts, there’s also Gemini Live baked right in for instant voice assistance.\nAt $129.99, the Pixel Buds 2a are still in the sweet spot for affordability, and you’ll be able to snag them in two stylish finishes: Hazel or Iris.\nGemini AI integration continues expansion\nGoogle spent a good chunk of stage time pushing its real moonshot: turning Gemini into a truly agentic, universal AI assistant. The company says it wants Gemini to not just answer questions but anticipate needs, pulling info from your calendar, messages, and apps to act more like a digital co-pilot than a chatbot.\nSenior Vice President, Platforms & Devices, Rick Osterloh, said that the plan is to release Agentic Gemini later this year. For now, though, those who buy a Pixel 10 Pro or XL can get a full year of Google AI Plus on the house.\nMagic Cue seeks to streamline daily life\nOne of the interesting agentic upgrades to Gemini on Pixel is Magic Cue, a Gemini-powered feature that promises to do the digital legwork for you. Instead of digging through your apps, Magic Cue figures out what you’re trying to do and pulls the right info straight to the surface. Ask a friend when their flight lands, and your Pixel can quietly grab the booking details from your calendar; try to remember a photo, and it can surface it without the endless scrolling.\nIt all runs on-device for privacy, and Google promotes it as being for mundane stuff — like serving up the phone number for that restaurant you need to call without making you dive into Google Search.\nCamera Coach will help you get the best photo\nGoogle is also baking more AI directly into the camera app with a new Camera Coach feature. Think of it as a Gemini-powered photo assistant: you can ask it to tweak a shot after the fact — like fixing the lighting with a simple prompt — or use it in the moment to actually guide your hand.\nCamera Coach can walk you through step-by-step instructions inside the camera app to help you line up the best possible photo and train your partner or friends to take that perfect Instagram photo.\nTopics Apps & Software Google Smartwatches\nChance Townsend is the General Assignments Editor at Mashable, covering tech, video games, dating apps, digital culture, and whatever else comes his way. He has a Master's in Journalism from the University of North Texas and is a proud orange cat father. His writing has also appeared in PC Mag and Mother Jones.\nIn his free time, he cooks, loves to sleep, and greatly enjoys Detroit sports. If you have any tips or want to talk shop about the Lions, you can reach out to him on Bluesky @offbrandchance.bsky.social or by email at [email protected]."
    },
    {
      "url": "https://mashable.com/article/google-pixel-10-pro-xl-announced",
      "text": "Google's Pixel 10 Pro & Pro XL are here with 100x zoom and live translation\nGoogle's pro-grade Pixel 10 is ready for its time in the spotlight.\nAt its Made by Google event on Wednesday, Google will officially reveal the Pixel 10 Pro and Pro XL phones. Like the rest of the Pixel 10 lineup, many of the upgrades this year are pretty incremental, but that doesn't mean some of them won't be extremely meaningful. Pixel 10 Pro starts at $999, and the Pro XL, which is essentially the same phone with a bigger display and battery, starts at $1,199.\nWe recently got the chance to preview the new Pixel 10 series, and we'll be publishing an in-depth review in the days ahead. While the Pixel 10 Pro does deliver improvements over last year's Pixel 9 Pro, they're definitely incremental improvements. We'll reserve judgment on whether it's worth the upgrade until we've finished testing the new Pixel 10 series, but until then, you can check out the specifications and decide for yourself.\nPixel 10 Pro and Pro XL: Specifications\nBoth the Pixel 10 Pro and Pro XL come in four colors: Moonstone, Jade, Porcelain, and Obsidian. They come with considerable RAM and storage upgrades over the base Pixel 10, though they have the same processor.\nHere are the relevant specs for Pixel 10 Pro:\n6.3-inch display with 1280x2856 resolution and 1-120Hz adaptive refresh rate\n3,300 nits peak brightness\n16GB RAM\n128GB/256GB/512GB/1TB storage\nGoogle Tensor G5 chipset\n4,870mAh battery\nRear cameras: 50MP wide, 48MP ultrawide, 48MP telephoto\nFront camera: 42MP\nMost of the Pixel 10 Pro XL's specs are exactly the same, with an obvious difference being a 6.8-inch display instead of 6.3 inches. Pro XL also has a very beefy 5,200mAh battery inside it, though Google is promising more than 30 hours of battery life on both devices. As with all other Pixel 10 phones, both of these handsets also support Qi2 wireless charging. One other minor thing to note is that the Pro XL's base storage is 256GB this year, so there isn't a 128GB option anymore.\nThe Pixel 10 Pro: What about the cameras?\nThe cameras this year haven't undergone huge (or any) changes in terms of megapixel counts, but one big thing Google did is increase Super Res Zoom capabilities from 30x all the way to 100x. We'll see how that works in practice, but given the excellent telephoto zoom quality on previous Pixel phones, this is potentially very exciting. The newer and bigger batteries are also a big plus, considering the fact that battery life was a common complaint with previous Pixel phones.\nIf you're interested in shooting 8K video, you'll need to purchase either the Pro or Pro XL, as the base model Pixel 10 doesn't have this capability.\nPixel 10 Pro: What else is new?\nBesides the 100x zoom, the biggest changes of note are the Qi2 wireless charging capabilities and new AI features powered by Google Gemini.\nGoogle has also provided a smattering of new AI features to all of the Pixel 10 phones, including live translation during phone calls and a new \"Magic Cue\" feature that can do context-sensitive things like bring up your flight info while you call the airline. Daily Hub also provides a new, well, hub for all the information you might need in a day, including the weather forecast and your schedule. This seems very similar to the Now Brief feature from recent Samsung phones, so Google is keeping up with the Joneses here, so to speak.\nPixel 10 Pro and Pro XL: Release date and preorder\nGoogle Pixel 10 Pro ($999) and Pro XL ($1,199) launch on Aug. 28 and are available for preorder now.\nTopics Google\nAlex Perry is a tech reporter at Mashable who primarily covers video games and consumer tech. Alex has spent most of the last decade reviewing games, smartphones, headphones, and laptops, and he doesn’t plan on stopping anytime soon. He is also a Pisces, a cat lover, and a Kansas City sports fan. Alex can be found on Bluesky at yelix.bsky.social."
    }
  ],
  "argos_summary": "Google’s Pixel 10 Pro refresh keeps the familiar design but ups the Tensor G5 chip, 16 GB RAM, and a 100‑x zoom camera that outperforms the Samsung Galaxy S25 Ultra in daylight yet struggles at night. It adds Qi2 magnetic charging and new AI tools such as Magic Cue, Daily Hub, and Camera Coach, though Magic Cue is still a work in progress. Battery life is solid for typical use, and the phone remains under $1,000, making it a compelling upgrade for Android users. The review also notes the upcoming Pixel 10 Pro Fold and compares the Pixel lineup to Samsung’s foldables, highlighting the broader competitive landscape in 2025.",
  "argos_id": "9O7H73GPX"
}