{
  "url": "https://www.engadget.com/gaming/bioshock-creator-ken-levines-judas-game-still-exists-now-has-key-art-201635885.html",
  "authorsByline": "Anna Washenko",
  "articleId": "0bf7e9dd161849db91b7a57cd0a2eeab",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/CubhRNHelehJ8X9hS8xqow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/91224480-8380-11f0-bbde-65a97ad121d0",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-27T20:16:35+00:00",
  "addDate": "2025-08-27T20:26:05.654685+00:00",
  "refreshDate": "2025-08-27T20:26:05.654687+00:00",
  "score": 1.0,
  "title": "BioShock creator Ken Levine's Judas game still exists, now has key art",
  "description": "Ghost Story Games has gone pretty quiet since announcing the project in late 2022.",
  "content": "Remember Judas? No, not the biblical figure and not the Lady Gaga bop, this Judas is a project from Ghost Story Games. If you don't remember, it's the game that was reportedly in \" \" before it was even . The team, led by BioShock creator Ken Levine, had gone pretty quiet for a few years after releasing the debut trailer, but today teased a look at some key art and mechanics for the game.\n\nThe BioShock lineage is clear from the handful of visuals we've seen so far, but instead of a linear binary of which NPCs and actions are good versus bad, Judas aims to place the moral compass more firmly in the player's hands. There are a trio of major characters, dubbed the Big 3 in today's , who will be drawn to the player based on what you do in-game. If one of the main NPCs gets ignored for too long, they'll become the game's villain. This unlocks new sets of powers and abilities for them that could also influence your gameplay options.\n\nFor instance, there are Rent-A-Deputy stations where the player can temporarily access a weirdly wiggly ally to help them in fights. However, if you've alienated Tom, the old-school sheriff character, Rent-A-Deputies will attack you instead.\n\nThe emphasis here seems to be on building relationships with the Big 3, and the gist seems to be that at some point, you'll have to decide which one will be your real enemy. Unsurprisingly, the team has no release date to share yet. Maybe in another couple of years…",
  "medium": "Article",
  "links": [
    "https://www.engadget.com/ken-levine-judas-trailer-the-game-awards-ghost-story-games-015100018.html",
    "https://www.youtube.com/watch?v=wagn8Wrmzuc",
    "https://blog.playstation.com/2025/08/27/judas-ken-levine-details-how-player-actions-determine-who-becomes-the-villain/",
    "https://www.bloomberg.com/news/articles/2022-01-03/bioshock-creator-s-next-game-and-its-narrative-legos-in-turmoil"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "BioShock creator Ken Levine",
      "weight": 0.09764625
    },
    {
      "name": "Ken Levine",
      "weight": 0.08262521
    },
    {
      "name": "Judas",
      "weight": 0.08259884
    },
    {
      "name": "BioShock creator Ken Levines Judas game",
      "weight": 0.08146335
    },
    {
      "name": "major characters",
      "weight": 0.07591517
    },
    {
      "name": "game",
      "weight": 0.073254146
    },
    {
      "name": "key art",
      "weight": 0.071767874
    },
    {
      "name": "Lady Gaga",
      "weight": 0.0659911
    },
    {
      "name": "new sets",
      "weight": 0.06598515
    },
    {
      "name": "today",
      "weight": 0.0651803
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.98291015625
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.8330078125
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.71728515625
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.68603515625
    },
    {
      "name": "/Games/Computer & Video Games/Shooter Games",
      "score": 0.398681640625
    },
    {
      "name": "/Games/Computer & Video Games/Massively Multiplayer Games",
      "score": 0.370361328125
    }
  ],
  "sentiment": {
    "positive": 0.17627157,
    "negative": 0.37830386,
    "neutral": 0.44542453
  },
  "summary": "The project from Ghost Story Games, led by BioShock creator Ken Levine, has been teased with key art and mechanics for the upcoming game. The game aims to place the moral compass firmly in the player's hands and focuses on building relationships with key characters, who will become the game's main antagonists if one of them is ignored for too long. The release date for the game is yet to be announced.",
  "shortSummary": "The Judas game, a new title from Ghost Story Games, focuses on relationships and moral compass, with distinct gameplay elements like dialogue and power sharing, but has yet to be revealed.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b74359bfec1e41c9908aae25c1b59263",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://blog.playstation.com/2025/08/27/judas-ken-levine-details-how-player-actions-determine-who-becomes-the-villain/",
      "text": "Ghost Story Games shares what they’ve been working on in Judas and reveals the key art.\nWe know, we know… we’ve been silent for a while. It takes a lot of time and energy to make marketing materials like trailers, and we’re trying to focus all our efforts on finishing Judas.\nBut we also miss the days of having a more direct relationship with you, the gamer, so we thought, “Why not start releasing some dev logs?”\nThrough these, we hope to communicate more frequently to update you with new details of what we are working on, without spoiling too much of what Judas has in store. The goal is to keep this pretty lo-fi, meaning more frequent updates than before, but not necessarily always with fancy trailers and super polished final imagery. (Though there will be more of those as well!)\nWant to Rent-A-Deputy?\nFeature update: Villainy\nWe’ve just finished a major milestone: Villainy. Villainy is a central feature of Judas. When you play BioShock or BioShock Infinite, the villain is always going to be the villain. Fontaine, Comstock — they’re always going to be the bad guys. In Judas, your actions will attract members of the Big 3 to you as friends. But ignore one of them enough, and they become the villain. From there, they will get access to a new suite of powers to subvert your actions and goals. The clips below demonstrate just a little bit of the feature.\nThis is just one example of how the Big 3 can retaliate. The more dangerous and character-specific stuff will be kept a secret, for now.\nEventually, you’ll have to make decisions about who you’re going to focus your energy on… and who you’ll wind up alienating.\nBut… be careful not to rent one when Tom is pissed off.\nA focus on character\nOne of my personal favorites of all time is Middle Earth: Shadow of Mordor because of the emergent gameplay made possible by their Nemesis System. The system allows you to develop small relationships with multiple orcs. However, their goals were a little different than ours, because there are so many different orcs and they don’t have time to develop them into characters.\nIn Judas, you’re going to get to know these characters intimately. We want losing one of them to feel like losing a friend. We want to play with that dynamic, and we want that choice to be super hard. The Big 3 are all going to be competing for your favor and attention. They can bribe you, save you in battle, talk shit about the other characters, and share with you their darkest secrets. But eventually, you’ve got to decide who you trust and who you don’t.\nIn BioShock Infinite, there was a lot of energy invested into developing your relationship with Elizabeth. By the end of the game, you knew everything about her, her abilities, her hopes and dreams.\nBut the truth is she knew almost nothing about you, the gamer playing Booker. In Judas, the Big 3 observe you as you play, and they have feelings not only about how you approach combat, hacking, and crafting, but most importantly your interactions with the other two characters.\nAs part of the Villainy Milestone, we also completed the biggest Judas playtest yet, where new players experienced this feature firsthand. Every time we test, we learn so much, and we love having that level of knowledge when working on the game. The testers shared tons of valuable feedback on the weight of decisions and how it impacted outcomes, their interest in learning more about character motivations, and how moments where the Big 3 helped — or turned on them — changed their future decisions.\nNew Key Art\nAnother thing we’re excited to be able to share is… this:\nWe’re really happy to finally show this off. I have always personally been a huge fan of Drew Struzan’s work and that era of movie posters. The style is great at presenting films that have a big cast, like Star Wars. And Judas has a big cast. Outside of the lead roles, there’s likely going to be more than one hundred speaking parts… If you look closely, there’s probably some details you might be curious about. Let’s just say there’s some stuff in this game that we’re not going to talk about right now, but everything here is relevant.\nThere’s one thing we’re sure you all want to know: when is Judas coming out?!?!\nWhile we wish we could give you an exact date today, we’re not quite ready to finalize that. As you know, release dates have a way of slipping by, and we’d like to avoid having to change the date after we announce it. But we know Judas is not really a game until the players get their hands on it, and that’s a day everyone on the team is working toward.\nJoin the Conversation\nAdd a CommentBut don't be a jerk!\n5 Comments\nLoading More Comments"
    },
    {
      "url": "https://www.engadget.com/ken-levine-judas-trailer-the-game-awards-ghost-story-games-015100018.html",
      "text": "'Judas' is the first project from BioShock creator Ken Levine's Ghost Story Games\nIt's definitely not a BioShock game, though.\nGhost Story Games has revealed its first title nearly six years after BioShock creator Ken Levine founded the studio. A trailer for Judas debuted at The Game Awards and while it's not an actual BioShock game, it draws from that series' art style. It's also a first-person shooter in which it looks like you can wield elemental powers.\nYou play as the titular Judas, a \"mysterious and troubled\" character who is stuck on a starship that's falling apart. According to a description on the game's Steam page, \"your only hope for survival is to make or break alliances with your worst enemies.\"\nBloomberg reported earlier this year that the game had been stuck in development hell for several years amid multiple reboots and Levine changing the direction of the project multiple times. But Levine suggested back in 2015 that his next game would be a sci-fi first-person shooter, and Judas at least fits that bill. There's no release window as yet, but it's coming to PS5, Xbox Series X/S and PC.\nMeanwhile, there is a BioShock game in development at a separate Take-Two studio. But this is not that. Judas is definitely not a BioShock game."
    }
  ],
  "argos_summary": "Ghost Story Games, led by BioShock creator Ken Levine, has unveiled new key art and gameplay details for its upcoming first‑person shooter Judas, which builds on the BioShock aesthetic but focuses on player‑driven morality. The game centers on three major NPCs—the \"Big 3\"—whose relationships with the player can shift from allies to villains, unlocking new powers and altering gameplay. Features such as Rent‑A‑Deputy stations and a \"Villainy\" milestone emphasize emergent, character‑driven choices, while the team continues to refine the title without a confirmed release date.",
  "argos_id": "ACP5BTTXY"
}