{
  "url": "https://www.latimes.com/sports/story/2025-08-27/tom-brady-nfl-rules-restrictions-fox-broadcaster-minority-owner-raiders",
  "authorsByline": "By Chuck SchilkenStaff Writer  Follow",
  "articleId": "4aad4ac2be3848b58b164ab12c63c0e9",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/2d94d26/2147483647/strip/true/crop/6508x3417+0+461/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F58%2Fed%2Fd2cf6f6d4b9fb445747f9148b543%2Fsaints-buccaneers-football-64369.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T19:01:52.010000+00:00",
  "addDate": "2025-08-27T19:05:51.711793+00:00",
  "refreshDate": "2025-08-27T19:05:51.711795+00:00",
  "score": 1.0,
  "title": "NFL relaxes some restrictions for Tom Brady as a broadcaster/team owner",
  "description": "Fox Sports analyst Tom Brady will be allowed to attend team production meetings this season even though he's a Raiders minority owner. Other restrictions remain.",
  "content": "Former NFL quarterback Tom Brady makes an appearance on the field before a game between the Saints and Buccaneers last season.\n\nTom Brady will have fewer NFL-imposed restrictions on him this season as he enters his second year as an analyst on games broadcast on Fox.\n\nThe restrictions were placed on the legendary quarterback last August when his purchase of a 10% stake in the Las Vegas Raiders was pending approval from the league owners. Brady’s minority stake was approved in October.\n\nOne of the so-called Brady Rules enacted by the NFL prohibited the rookie broadcaster from attending production meetings where the Fox crew meets with coaches and players ahead of that week’s game.\n\nThat retriction has been lifted, NFL spokesman Brian McCarthy confirmed to The Times on Wednesday morning.\n\nThere is one caveat, however — Brady must attend those meetings remotely. He is still prohibited from going to a team facility for practices or production meetings, McCarthy said.\n\nBrady is allowed to interview players off site, as he did on occassion last year, McCarthy said.\n\nLike last year, Brady can’t “egregiously criticize officials,” said McCarthy, who added there were no issues along those lines in 2024.\n\nBrady, a seven-time Super Bowl champion with the New England Patriots and Tampa Bay Buccaneers, was allowed by the league to attend the production meetings ahead of Super Bowl LIX in February.\n\nThe Athletic was first to report the loosening of the restrictions on Brady.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/sports/live/super-bowl-chiefs-eagles-live-updates-score-start-time-watch-stream-odds#p=tom-brady-played-in-10-super-bowls-the-road-to-first-one-as-a-broadcaster-has-been-challenging",
    "https://www.nytimes.com/athletic/6577539/2025/08/27/tom-brady-rules-fox-nfl-2025/",
    "https://www.latimes.com/sports/highschool/story/2025-08-25/bishop-montgomery-forfeits-football-game-to-no-1-mater-dei",
    "https://www.latimes.com/sports/story/2024-04-12/tom-brady-comeback-raiders-patriots-49ers-fox",
    "https://www.latimes.com/sports/story/2024-09-09/tom-brady-scott-hanson-apology-fox-broadcast-debut",
    "https://www.latimes.com/sports/story/2025-08-26/most-shocking-nfl-jobless-players-after-roster-cuts-especially-quarterbacks",
    "https://www.latimes.com/sports/dodgers/story/2025-08-27/dodgers-reds-shaikin",
    "https://www.latimes.com/sports/dodgers/story/2025-08-26/dodgers-reds-clayton-kershaw",
    "https://www.latimes.com/sports",
    "https://www.latimes.com/sports/story/2025-02-05/tom-brady-raiders-fox-broadcasting-conflict-of-interest-super-bowl",
    "https://www.latimes.com/sports/story/2024-10-16/tom-brady-fox-broadcast-restrictions-raiders-owner"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Former NFL quarterback Tom Brady",
      "weight": 0.12865384
    },
    {
      "name": "Tom Brady",
      "weight": 0.12610342
    },
    {
      "name": "Brady Rules",
      "weight": 0.11323213
    },
    {
      "name": "Brady",
      "weight": 0.11206454
    },
    {
      "name": "NFL spokesman Brian McCarthy",
      "weight": 0.106830426
    },
    {
      "name": "production meetings",
      "weight": 0.09977908
    },
    {
      "name": "last year",
      "weight": 0.09844772
    },
    {
      "name": "last season",
      "weight": 0.09411244
    },
    {
      "name": "last August",
      "weight": 0.08692075
    },
    {
      "name": "Brian McCarthy",
      "weight": 0.08586167
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    },
    {
      "name": "Sports Figures"
    },
    {
      "name": "Media"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97509765625
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.97412109375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.487548828125
    }
  ],
  "sentiment": {
    "positive": 0.048525568,
    "negative": 0.64894795,
    "neutral": 0.3025265
  },
  "summary": "The NFL has removed some restrictions on Tom Brady, who is now an analyst for Fox games and a team owner, from one of the \"Brady Rules\" which restricts him from attending production meetings. However, he must attend these meetings remotely and is prohibited from visiting a team facility for practices or production meetings, as well as criticism of officials. The changes were made after Brady's purchase of a 10% stake in the Las Vegas Raiders was approved.",
  "shortSummary": "The NFL has lifted restrictions on Tom Brady as a broadcaster, but still allows him to attend production meetings.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c08ebcaf1e484561860ac7f29045edce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/sports/story/2024-10-16/tom-brady-fox-broadcast-restrictions-raiders-owner",
      "text": "- Share via\nViewers may never know whether Tom Brady is a transcendent football analyst or an unlistenable bore because he’s chosen to handcuff himself by becoming a part owner of the Las Vegas Raiders.\nThe NFL placed restrictions on Brady in August when his purchase of a 10% stake in the Raiders was pending approval. League owners unanimously approved the deal Tuesday, meaning the limitations on what he can say and how he can go about his job as a Fox broadcaster remain in place as long as he is a franchise co-owner.\nAnd the restrictions are onerous. Brady can’t criticize other teams or game officials and he can’t attend broadcast production meetings that serve as the primary means of preparing for games. He also isn’t allowed in the facilities of any team besides the Raiders except in stadiums when he’s calling a game, and he can’t watch practices.\nNo obstacle was too great for Brady as a player. He is unquestionably the best quarterback of all time, playing 23 seasons through age 45 and winning a record seven Super Bowls. He holds the all-time records for most passes (12,050), completions (7,753), yards (89,214) and touchdowns (649).\nSeven-time Super Bowl champ Tom Brady says he’s not opposed to an NFL return under certain circumstances. Can he play and still be a Raiders owner?\nBrady leveraged his on-field excellence, good looks and boyish charm to land a 10-year, $375-million contract as a color commentator for Fox without a single day of experience. Early reviews have been mixed, with his debut effort widely panned but improvement each week noted.\nHow can he possibly get better? How can he be honest? The restrictions are the same for all owners, an attempt to ensure they don’t favor their team or gain inside information about opposing franchises. Commentators are supposed to be neutral, unbiased and unafraid to tell it like they see it.\nHow Brady navigates his commentary while unable to criticize anyone or even prepare sufficiently will be interesting. It doesn’t seem like he’s sweating it so far.\n“I’m tired from the buildup,” Brady said while yawning on his “Last Week with Tom” YouTube series after his debut calling the Dallas Cowboys’ game at the Cleveland Browns on Sept. 8. “A lot of emotional energy and not quite knowing how things are gonna go. Certainly, a lot of fun. Definitely things to clean up. So, it’s all a learning process.”\nIn his regular-season debut as a Fox broadcaster, Tom Brady sometimes showed about as much excitement in his delivery as former coach Bill Belichick in postgame news conferences.\nHe’s gotten comfortable enough in six weeks to throw lighthearted shade at Hall of Fame quarterback Peyton Manning during Brady’s call of the Detroit Lions and Cowboys on Sunday, downplaying Manning’s record 55 touchdown passes in 2013 by saying many were the result of pick plays.\n“Over the years, they’ve gotten really tight on calling those pick plays. Any remote contact was a flag,” Brady said after the Lions had a touchdown taken away for offensive pass interference on an illegal pick. “I saw Peyton Manning when he threw 55 touchdowns — there were more pick plays in that offense than in the history of NFL football. Since then, they’ve been cracking down. Believe me, I tried to use them all the time, too.”\nBrady’s 10% ownership of the Raiders falls short of the 30% threshold for being considered a majority owner, meaning that decision-making power remains with Mark Davis, who owns about 60% of the franchise. But a league source told Vincent Bonsignore of the Las Vegas Review-Journal that Brady is expected to have a strong voice, further muddying his Sunday gig with Fox.\n“It doesn’t matter what percentage he owns, it’s the percentage that the owner entrusts him to advise and help make football decisions,” the source said. “And I think Mark will give him a long leash with that.”\nTom Brady might be the GOAT on the football field, but ex-NFL players explain troubles that arise once a player becomes a television critic for games.\nFor his part, Brady is thrilled that he was approved as an owner.\n“I’m incredibly humbled and excited to have been unanimously approved as an owner of the Las Vegas Raiders,” he posted on X. “Throughout my NFL career, I’ve learned that at its core, football is a game of teamwork, resilience, and a relentless pursuit of excellence. The Raiders franchise, and the city of Las Vegas embody these same values, and I’m honored to become part of that story.\n“I’m eager to contribute to the organization in any way I can, honoring the Raiders’ rich tradition while finding every possible opportunity to improve our offering to fans... and most important, WIN football games.”"
    },
    {
      "url": "https://www.latimes.com/sports/dodgers/story/2025-08-26/dodgers-reds-clayton-kershaw",
      "text": "Clayton Kershaw is masterful again in Dodgers’ win over Reds\n- Share via\nThe Dodgers might be sprinting toward the finish line this year, trying to edge out the San Diego Padres in a tight National League West race.\nBut on Tuesday night, in a win that kept them one game up in the standings with 29 to play, they made a 6-3 win over the Cincinnati Reds feel more like a nice, leisurely stroll.\nClayton Kershaw continued his renaissance season, pitching five innings of one-run ball to earn a fifth consecutive victory (his longest such streak since the end of the 2022 season). The offense steadily wore the Reds’ pitching staff down, answering a first-inning Cincinnati run with one of their own before taking the lead for good in the fourth.\nIt all added up to a third straight win for the Dodgers (76-57), and helped them hold serve on a night the Padres beat the Mariners in Seattle (despite blowing an early five-run lead).\n“It’s been really fun to watch our guys play at the level that they’re capable of,” manager Dave Roberts said. “I like how we’re playing. I like where we’re at right now.”\nKershaw provided the bedrock for Tuesday’s victory.\nThe left-hander was pitching on four days’ rest for the third time this season (more than anyone else on the team), so that Shohei Ohtani could be lined up to start ahead of an off day on Wednesday. His already diminished fastball was playing down, averaging only 88 mph. And early on, the Reds (68-65) tagged him with a quick run, after Spencer Steer led off with a double and later scored on Miguel Andújar’s groundout.\n“It wasn’t a great night, stuff-wise,” Kershaw said. “Didn’t have a lot of life on the fastball, or really anything.”\nAnd yet, starting with that Andújar grounder, Kershaw retired the last 14 batters he faced. Six came via strikeout, marking his second-highest strikeout total this season. And of balls put in play, only four were “hard hit” (with an exit velocity greater than 95 mph). Not one left the bat at more than 100 mph.\nMajor League Baseball announced its 2026 schedule on Tuesday and for the first time since 2023, the Dodgers have a more typical start to the season.\nIt was the latest example of the 37-year-old left-hander’s newfound recipe for success: Hitting both sides of the plate with his fastball, leaning heavily on a slider that generated five whiffs and four outs, and mixing in his trademark curveball and newfangled splitter to keep an entirely right-handed Reds lineup off-balance in a 72-pitch outing.\n“We kind of flipped the script and just started throwing kind of a lot of different stuff, trying to be creative, keep them off balance,” Kershaw said, while giving credit to catcher Will Smith’s pitch-calling behind the plate.\n“I’ve seen growth in that sense,” Roberts added. “Just in the last couple years, he’s been more open to doing different things. And I commend him for that. I think in that fourth inning [when Kershaw retired the side with two strikeouts], you could see — it didn’t matter what Will was putting down, he felt like he could throw anything. And that’s something that was really rare and really cool to see.”\nGiven the low pitch count, Kershaw might have been able to go past the fifth. He and Roberts appeared to have a brief conversation in the dugout before shaking hands, a sign his night was over. But between his quick (by modern-day standards, at least) four-day turnaround, and the team’s careful management of his workload overall this season, Kershaw’s five innings were plenty.\n“I think that he’s smart enough to understand how many bullets he has,” Roberts said.\nOn the season, Kershaw is 9-2 with a 3.06 ERA, third-best among Dodgers starters this year. He also finishes August with a 1.88 ERA in five starts, third-best among National League starters for the month.\n“It was a good August,” Kershaw said. “Fun to be a part of it this time of year.”\nWhile Kershaw cruised, the Dodgers’ offense also found a groove.\nThey erased the early 1-0 deficit in the bottom of the first, when Mookie Betts walked, Freddie Freeman doubled and Betts scored on a throwing error by Reds left fielder Austin Hays.\nThey took a 2-1 lead in the fourth, after a leadoff double from Teoscar Hernández, an infield single from Michael Conforto on a scorching comebacker that ripped the glove right off the hand of Reds pitcher Nick Martinez, and a sacrifice fly from Kiké Hernández, who returned to the lineup for the first time since early July after being out with an elbow injury.\nThen, in the sixth, they broke the game open with a four-run rally.\nThe best center fielders in Dodgers history comes down to three names: Duke Snider, Willie Davis and Pete Reiser. Who did the fans choose?\nSmith turned around a center-cut fastball for an opposite-field, leadoff home run, a positive sign for the slumping catcher who entered the night with a .150 batting average in August and only one long ball in his previous 25 games.\nMiguel Rojas came off the bench for a two-run double later in the inning, smoking a flyball to deep center that got Noelvi Marte, who was making his first career MLB start in the middle of the outfield, turned around at the warning track.\nOhtani followed that with an RBI single to right, helping him break a one-for-16 skid.\nThe only bad news for the Dodgers on Tuesday came pregame, when left-handed reliever Alex Vesia was placed on the injured list with a right oblique strain. Vesia described the injury as mild and was hopeful of returning once his 15-day IL stint was complete.\nBut even without him, the Dodgers’ bullpen largely coasted in relief of Kershaw. Blake Treinen and Tanner Scott, both having recently returned from the IL, pitched scoreless innings in the eighth and ninth. Scott earned his first save since returning. And though Hays hit a two-run home run in the seventh off Ben Casparius, it did little to make Tuesday feel like anything more than a late-season cakewalk — even amid a mad dash down the season’s closing stretch.\nRoki Sasaki’s latest rehab start\nIn triple-A Oklahoma City, rookie pitcher Roki Sasaki made the third start of his minor-league rehab stint, giving up three runs in 3 ⅔ innings on five hits, two walks and four strikeouts. The most encouraging takeaway from the outing was Sasaki’s fastball velocity, which averaged 96 mph for a second straight outing and topped out at 98.8 mph — the hardest he has thrown in his recovery from a shoulder injury. Sasaki is expected to make at least one more rehab start before being ready to be activated."
    },
    {
      "url": "https://www.latimes.com/sports/story/2024-04-12/tom-brady-comeback-raiders-patriots-49ers-fox",
      "text": "Can Tom Brady unretire and be a Raiders owner? He’s ‘not opposed’ to playing, even for another team\n- Share via\nTom Brady is retired from the NFL and has been for more than a year.\nHe’s moved on to other endeavors, like his Fox Sports broadcasting gig starting this fall and a bid to become a minority owner in the Las Vegas Raiders.\nThe seven-tme Super Bowl champion reaffirmed his status as a retired NFL player twice during an appearance on an episode of the “Deep Cuts With VicBlend” podcast that dropped this week.\nFirst, about 54 minutes into the episode, Brady stated: “My career and all that, that’s a thing of the past in my mind. I was a gladiator out there, and now my time’s moved on.”\nSounds straightforward enough.\nLater, Blend stated to the former quarterback for the New England Patriots and Tampa Bay Buccaneers, “You’re 100% retired.”\nWhen Tom Brady retires to the TV booth, the former NFL quarterback will need to criticize players while facing criticism from viewers.\nBrady responded with a firm, “Yes.”\nOK, great, that’s a wrap. Oh wait, there’s more to this conversation.\nBlend: “Let’s say, one day there’s a situation. Right? Maybe it’s the 49ers. Maybe, you know, heading to the playoffs, offense is great —”\nBrady: “Patriots, could be Raiders, could be — you never know.”\nWait, what?\nBlend: “God forbid somebody goes down. Would you pick up that phone?”\nThis is where the 46-year-old Brady gently reminds his host of what he said literally less than 20 seconds earlier.\nRight?\nRIGHT???\nSeven-time Super Bowl champion Tom Brady went on record yet again Thursday to insist he’s not planning on making an NFL comeback.\nNope.\nBrady: “I’m not opposed to it. I don’t know if they’re gonna let me if I become an owner of an NFL team. But I don’t know if — I don’t know. I’m always gonna be in good shape, always be able to throw the ball. So, to come in for a little bit, like [Michael Jordan] coming back? I don’t know if they’d let me, but I wouldn’t be opposed to it.”\nSigh.\nThis shouldn’t be a surprise from a guy who first announced his retirement on Feb. 1, 2022, only to unretire six weeks later and play another year before hanging it up again exactly a year after he did so the first time.\nBrady reached an agreement to join the Raiders ownership group last May (the deal is still pending approval from the NFL). Naturally, many people immediately wondered if Brady might be angling to become an owner-player. The NFL didn’t immediately respond to The Times’ questions for this story, but last year the league told multiple media outlets that 24 of the NFL’s 32 team owners would need to vote in approval of such a move.\nSo if enough of those guys aren’t opposed to the idea and Brady isn’t, then, yeah, it sounds like something that could happen.\nOh, and by the way, Fox Sports also did not immediately respond to questions for this story — they may have been too busy checking the fine print of Brady’s contract."
    },
    {
      "url": "https://www.latimes.com/sports/dodgers/story/2025-08-27/dodgers-reds-shaikin",
      "text": "- Share via\nIn a city where craft beer is everywhere, a golden brew holds a special place in the hearts of San Diegans. Within the name of the beer is a tribute to a beloved local hero.\nIt’s called .394 Pale Ale.\nIn 1994, Tony Gwynn batted .394, a career high good for one of his eight National League batting titles. It’s the highest batting average in the NL during the past 95 years. If you know, you know.\n“In San Diego, people know what .394 is,” said Kristen Ballinger, marketing director for AleSmith, the brewer. “If it wasn’t a strike-shortened season, it would have been .400.”\nBecause of the rules on plate appearances, Will Smith could fall just short of the number needed to win the batting title.\nThree decades later, the magic of a batting title or a .400 season has virtually disappeared from the major leagues.\nAnd a traditional standard of excellence now is an endangered species: the .300 batting average, a popular and easily understood statistic that has been devalued and rendered borderline worthless by baseball’s analytical revolution.\nIn a previous generation, this development would be almost scandalous: With one month left in the regular season, the NL has one .300 hitter.\nOne.\nHe is the Dodgers’ Freddie Freeman, who has nine .300 seasons to his credit. He batted .200 in June and .253 in July, and here he is leading the league at .302.\n“You hit .330, you hit .325 and you never win,” Freeman said. “To be grinding this year and leading is kind of a weird thing.\n“For you to be talking to me about a batting title at the end of August, it means I’ve had a pretty good year. I think I’m OK with that.”\nFreeman thought back to Monday night, when the visiting Cincinnati Reds went to the bullpen in the seventh inning of a game they trailed by six runs. The new pitcher: not a mopup man with a mid-80s fastball, but a second-year reliever with a 100 mph fastball.\n“I don’t think you can really talk about the art of hitting .300. The pitching is just too good. It’s hard to combat,” Freeman said.\n“My whole goal every year is to hit .300. It’s getting harder and harder. I’m just trying to adjust with the league.”\nAfter watching his World Series home run swing incorporated into a Coldplay meme video, Freddie Freeman helps lift the Dodgers to a 5-0 win over Tampa Bay Rays.\nOnly one player has won a batting championship with a lower average than Freeman’s .302: Carl Yastrzemski of the Boston Red Sox, who won the American League by hitting .301 in 1968.\nThat was the Year of the Pitcher. Bob Gibson of the St. Louis Cardinals put up a 1.12 earned-run average, one of seven pitchers to finish with an ERA under 2.00. Offense was in such short supply that, after the season, baseball lowered the pitcher’s mound from 15 inches to 10.\nThe major league batting average was .237 that season, with teams scoring 3.4 runs per game. This season: .246, with 4.4 runs per game.\nBut batting average is nonetheless depressed by the emphasis on home runs and on getting on base, and by the deluge of strikeouts triggered by pitchers throwing harder than ever.\n“And how many times do you see balls hit up the middle and they’re outs, even [with baseball] regulating the shift?” Reds manager Terry Francona said. “Guys hit a nice one-hopper up the middle, and they’re out.\n“Hitters don’t know — a lot of them — how to go the other way to combat that. So that takes away a lot of hits.”\nDodgers manager Dave Roberts conceded that so many pitchers throwing so hard challenges batters, especially as they hear that on-base percentage is widely considered more important than batting average.\nThe Dodgers’ left-hander limits the Reds to one run in five innings and strikes out six as Dodgers win third in a row.\n“I honestly think hitting is as hard as it’s ever been,” Roberts said. “You don’t see the same guys as much.\n“But also, yeah, batting average isn’t valued as much — until you get to the postseason. Then you want guys that can get hits and drive in runs, right?”\nSo much of baseball’s charm is statistics that can be passed down among generations, in the only major sport popular in the United States for more than a century. Babe Ruth, meet Shohei Ohtani.\nNo one writes an ode to a high OPS. The .300 hitter is going the way of the complete game. The Dodgers have no complete games this season.\nRoberts lives in the San Diego area. He has not tried a .394 Pale Ale.\n“I’m more of a lager guy,” he said.\nBut baseball should listen up to what he says about .394.\n“Right now,” he said, “I would say less than 5% of active players know what that means.”"
    },
    {
      "url": "https://www.latimes.com/sports/story/2025-02-05/tom-brady-raiders-fox-broadcasting-conflict-of-interest-super-bowl",
      "text": "- Share via\nTom Brady is widely acknowledged as the greatest quarterback of all time. His knack for performing in the clutch and winning Super Bowls is unparalleled.\nHis current juggling act might be every bit as difficult.\nBrady made his NFL broadcasting debut as an analyst for Fox in September after signing a 10-year, $375-million contract despite being a novice in the booth.\nA month later the NFL approved his purchase of a minority ownership stake in the Las Vegas Raiders.\nThe apparent conflict of interest was negotiated, with Brady forbidden from attending production meetings ahead of the games he called and from attending NFL practices for teams other than the Raiders.\nThe seven-time Super Bowl champion addressed it Wednesday during a news conference.\nGreg Olsen won’t be a part of Fox’s Super Bowl LIX broadcast after losing the lead analyst role to Tom Brady. He says his ‘goal is to call top games’ again.\nOf broadcasting, he said, “I understand I am a long way away from being a finished product, but I really enjoy the opportunity.”\nOf team ownership, he said, “The best part for me is I love football so much and the fact that I get to be involved with it for the rest of my life and showcase this great game, not just as a broadcaster, but in a limited partner role with an organization.”\nBoth roles already have been marked by achievement. He’s barreled ahead of the excellent color commentator Greg Olsen, who was benched by Fox in favor of Brady to serve as analyst during Super Bowl LIX in New Orleans on Sunday.\nBrady’s work with the Raiders hasn’t taken a backseat, despite his protest that “My ownership interests is just much more of a long-term, kind of behind the scenes-type role.”\nThe franchise made a splashy hire in veteran coach Pete Carroll, poached respected executive Mark Thewes from the division rival Denver Broncos as senior vice president of football operations and reeled in Chip Kelly from Ohio State as offensive coordinator.\n“I am there to support the team and leadership and the overall vision of success,” Brady said. “It is something I hope a lot of other players get the opportunity to do. I want the game to continue to grow and continue to improve and get better. Whatever role I can play in that, I am really excited to do that.”\nTom Brady calls NFL games on Fox, but as part owner of the Raiders, he can’t criticize other teams or game officials, or attend broadcast production meetings to prepare for games.\nNFL commissioner Roger Goodell told reporters Monday that Brady checked in with league officials periodically during the season to get feedback on how he and the league were handling the perceived conflict of interest. Goodell relaxed the rule prohibiting Brady from participating in production meetings for the Super Bowl. He’s been allowed to attend meetings with the Kansas City Chiefs and Philadelphia Eagles, although he’s still barred from watching practices.\nAlthough his knowledge of the game is unquestioned, Brady has been criticized for not being tough enough on players who make mistakes. He said he’s thinking more about viewers than players.\n“You don’t want to go on air and be overly critical because it’s not fun for the viewer,” he said. “I don’t think to take a negative critique is the way I view the game. We’re viewing athletes at the highest level of what they do. You’re never really insulting the player. You’re insulting the play or the decision. I have tremendous amount of respect for anybody that suits up in uniform and goes out there to play because they’re putting a lot on the line.\n“At the same time, there are things I have been critical of that I’m not afraid to kind of speak my honest opinion about as soon as I see it. I want to be very fair. I want to be very transparent. I have a great commitment to integrity. I take that very seriously in this role.”\nIn his regular-season debut as a Fox broadcaster, Tom Brady sometimes showed about as much excitement in his delivery as former coach Bill Belichick in postgame news conferences.\nAs for preparing for the Super Bowl, Brady said Fox already shot his interview with Patrick Mahomes that will air during the pregame show. Brady emphasizes that any accolades the Chiefs quarterback gets are well deserved.\n“I said to him, ‘Look, there is nobody that would be more happy for you than me if you go out and you do something that no other team in history has ever done and no other quarterback’s ever done,’” said Brady, who made a record 10 Super Bowl appearances, including beating Mahomes and the Chiefs in Super Bowl LV following the 2020 season. “Because I love seeing other people achieve great things. Anything that Patrick is doing I don’t believe will ever detract from what I accomplished in my career.”\nNow Brady has dual careers that he’s trying to make sure don’t become dueling careers.\n“Part of the experience of life is challenging yourself and getting outside your comfort zone to experience new things,” he said, “where it can be more of a transformational experience for you.”"
    },
    {
      "url": "https://www.latimes.com/sports/story/2025-08-26/most-shocking-nfl-jobless-players-after-roster-cuts-especially-quarterbacks",
      "text": "- Share via\nThis was far more than a trim. NFL teams had to shear an enormous number of players from rosters Tuesday, dropping from as many as 90 players to 53 by 1 p.m. PDT.\nThe league’s tallest player and heaviest player both were cut. A former Rams star running back is out of a job. So is a star receiver. And so is one of Deion Sanders’ sons, but not the one so many folks seem to love to despise.\nGoodbye as well to a covey of quarterbacks, several of whom didn’t impress despite getting ample opportunities with most starters sitting out the entire preseason.\nMany players rendered jobless will be re-signed to practice squads that can be formed as early as Wednesday morning. But even they must endure one sleepless night contemplating unemployment.\nRams coach Sean McVay offered a health update on quarterback Matthew Stafford and left tackle Alaric Jackson following the team’s workout Monday.\nWho was cut? Let’s start with notable quarterbacks:\nDorian Thompson-Robinson, Eagles: The former UCLA star was acquired by Philadelphia in March and stood a solid chance to back up Jalen Hurts after competing with Tanner McKee and Kyle McCord. However, Sam Howell was acquired from Minnesota a few days ago, and Thompson-Robinson is job hunting.\nDresser Winn, Rams: Despite completing 15 of 23 passes for 191 yards and a touchdown in the Rams’ preseason finale win over Cleveland, Winn was waived when it became apparent that Stetson Bennett and Jimmy Garoppolo will back up Matthew Stafford.\nDJ Uiagalelei, Chargers: The former St. John Bosco High star was beat out as Justin Herbert’s backup by Trey Lance and Taylor Heinicke.\nTyler Huntley, Browns: Signed as insurance after Kenny Pickett was injured, Huntley couldn’t crack a crowded quarterback room that includes veteran Joe Flacco and rookies Dillon Gabriel and Shedeur Sanders.\nSam Hartman, Commanders: Signed as an undrafted free agent a year ago, Hartman competed with veterans Marcus Mariota and Josh Johnson for the backup spot behind Jayden Daniels.\nLogan Woodside, Steelers: Another victim of a crowded roster, Woodside lasted less than a month with Pittsburgh, who will go with Mason Rudolph, Will Howard and Skylar Thompson behind Aaron Rodgers.\nBailey Zappe, Chiefs: In his second stint in Kansas City, the veteran of nine NFL starts lost out to Gardner Minshew and Chris Oladokun as reserves behind Patrick Mahomes.\nNCAA rules that Michigan engaged in a scouting scheme, but it did not impose a postseason ban. Jim Harbaugh is effectively banned from collegiate ranks until 2038.\nBrett Rypien, Vikings: Minnesota remade the backup situation to J.J. McCarthy by signing Carson Wentz, trading Sam Howell and cutting Rypien while undrafted rookie Max Brosmer was impressive during training camp.\nTommy DeVito, Giants: New York added Russell Wilson, Jameis Winston and Jaxson Dart during the offseason, leaving no room for DeVito, who started eight games the last two seasons.\nHendon Hooker, Lions: The 2023 third-round pick didn’t perform well in the preseason, losing a chance to back up Jared Goff to journeyman Kyle Allen.\nKyle Trask, Buccaneers: A veteran of four years after Tampa Bay drafted him in the 2021 second round, Trask was overtaken by veteran Teddy Bridgewater to back up Baker Mayfield.\nJake Haener, Saints: New Orleans still hasn’t named a starter, yet this 2023 third-round pick is out of the mix despite appearing in eight games last season.\nDesmond Ridder, Bengals: A third-round pick of the Atlanta Falcons in 2022, Ridder has made 18 starts but won’t back up Joe Burrow in Cincinnati.\nThe Fox Sports hairstylist who alleged that Skip Bayless offered her $1.5 million for sex asked the court to dismiss her lawsuit. Joy Taylor and Charlie Dixon also are defendants.\nOther notable offensive players cut\nCam Akers, RB, Saints: Akers helped the Rams win Super Bowl LVI then complained his way out of L.A. wanting a larger role. Now he’s out of a job after rushing for all of 16 yards in eight carries this preseason with New Orleans.\nClyde Edwards-Helaire, RB, Saints: Akers isn’t the only Super Bowl-winning running back cut by New Orleans. Edwards-Helaire played in two Super Bowls with Kansas City, winning one, and also was an NCAA national champion with Louisiana State, but Alvin Kamara and Kendre Miller will carry the ball for the Saints.\nRobert Woods, WR, Steelers: The former USC and Rams star with 683 career NFL catches had a poor offseason in Pittsburgh after a largely unproductive 2024 season with Houston.\nHunter Renfrow, WR, Panthers: The former Clemson star didn’t play last season because of ulcerative colitis and there was hope the former Pro Bowl receiver would come back strong with his hometown team.\nMarquez Valdes-Scantling, WR, Seahawks: The hope in Seattle was that the veteran with two Super Bowl rings in Kansas City would replace the traded DK Metcalf, but was outplayed in the preseason by fifth-round rookie Tory Horton.\nMichael Gallup, WR, Commanders: After spending a year in retirement, Gallup, 29, attempted a comeback but couldn’t crack the roster.\nTodd Marinovich, the test-tube quarterback with a domineering father whose promising football career was cut short by addiction, discusses his memoir.\nDustin Hopkins, PK, Browns: The 10-year NFL veteran has made 84% of his career field-goal attempts yet made only 18 of 27 last season in Cleveland. After missing PAT attempts in two preseason games, the Browns opted to go with rookie Andre Szmyt.\nKenyon Green, G, Eagles: The 2022 first-round pick of the Texans was cut despite an injury to left guard Landon Dickerson. In three years with Houston, Green started 23 games.\nDan Skipper, OT, Lions: The tallest active NFL player at 6-foot-10, Skipper spent part of seven seasons with Detroit, playing both tackle positions and occasionally lining up as an eligible receiver. Could be picked up by the Bears.\nTrent Brown, OT, Texans: The one-time left tackle with the Super Bowl-winning Patriots and highest-paid offensive lineman in the league has been slowed by injuries in recent years.\nNotable defensive players cut\nDesmond Watson, DT, Buccaneers: Watson became the heaviest player in NFL history at 449 pounds when he signed with Tampa Bay this offseason. Yet the undrafted free agent was held out of practice and games until he lost weight, and time ran out.\nBishop Montgomery pulls out of a scheduled Friday game against the Monarchs after problems in Hawaii.\nShilo Sanders, S, Buccaneers: Sanders was ejected from Tampa Bay’s preseason game Saturday for throwing a punch at Buffalo tight end Zach Davidson, who was blocking him. The undrafted free agent son of Deion Sanders was a longshot to make the team even before the punch, and now he’s jobless.\nMike Edwards, S, Chiefs: The two-time Super Bowl champion — LV with the Buccaneers and LVIII with the Chiefs — came back to Kansas City this offseason but couldn’t make the team.\nIsaiah Simmons, LB, Packers: The No. 8 overall pick by Arizona in 2020, Simmons played the last two seasons with the Giants after three with the Cardinals. It appears not to have worked out in Green Bay.\nClelin Ferrell, DE, Commanders: Another former first-round pick without a job, Ferrell spent four years with the Raiders — who made him the fourth overall pick in 2019 — and one with the 49ers before playing 2024 in Washington.\nMike Hilton, CB, Dolphins: Even though Miami has question marks in the secondary, the nine-year veteran was surpassed by rookie fifth-round pick Jason Marshall Jr. and the acquisition of Rasul Douglas.\nJalen Mills, CB, Texans: The versatile defensive back has played in 115 games over the last nine seasons for the Eagles, Patriots and Jets, but the Texans couldn’t find a spot for him."
    },
    {
      "url": "https://www.latimes.com/sports/live/super-bowl-chiefs-eagles-live-updates-score-start-time-watch-stream-odds#p=tom-brady-played-in-10-super-bowls-the-road-to-first-one-as-a-broadcaster-has-been-challenging",
      "text": "- Share via\nJalen Hurts and Eagles get their Super Bowl revenge in complete victory\nNEW ORLEANS — This time they left no room for a comeback.\nThe Philadelphia Eagles waited two years to avenge a Super Bowl defeat by the Kansas City Chiefs.\nOn Sunday, there was no way they were going to let Patrick Mahomes and the two-time defending champion Chiefs do it again.\nDynasty?\nThe Eagles derailed it by dominating the Chiefs in a 40-22 victory before 65,719 in Super Bowl LIX at the Superdome.\n“The message was that we can’t rewrite history or do nothing about the past,” receiver A.J. Brown said, “but we can make it even. The guys came with that mindset, and didn’t let up.”\n- Share via\nSuper Bowl MVP Jalen Hurts excited about what comes next in his football journey\nNEW ORLEANS — As he stood on a stage shaped like the NFL shield surrounded by falling green, white and silver confetti, Jalen Hurts smiled and licked his lips in humble satisfaction. The Eagles quarterback’s long-awaited moment in the spotlight was delayed, but not denied.\nHurts was named Super Bowl LIX most valuable player after he threw for 221 yards and two touchdowns while completing 17 of 22 passes in the Eagles’ 40-22 rout over the Kansas City Chiefs. He added a Super Bowl quarterback record 72 yards rushing with a touchdown.\nThe Eagles’ quarterback was every bit as magnificent as he was three years ago against the Chiefs when he threw for 304 yards and one touchdown on 27-of-38 passing and rushed for 70 more yards with three touchdowns.\n- Share via\nEagles turn doubters into believers after thwarting Chiefs’ Super Bowl three-peat\nNEW ORLEANS — The Kansas City Chiefs wanted a three-peat in the worst way.\nThey were half-right.\nAlthough they didn’t get an unprecedented third consecutive Lombardi Trophy, they got the “worst way” part down pat.\nSeven years after reaching the NFL mountaintop with a down-to-the-wire win, the Philadelphia Eagles left no room for doubt Sunday, bringing Broad Street to Bourbon Street with a 40-22 Super Bowl victory over the two-time defending NFL champions.\n- Share via\nWhen and where will Super Bowl LX be played in 2026?\nSuper Bowl LIX may have just ended Sunday with the Philadelphia Eagles beating the Kansas City Chiefs 40-22, but that doesn’t mean it’s too early to start thinking ahead to next year.\nHere’s everything we know about the next NFL championship game:\nWhen is Super Bowl LX?\nFeb. 8, 2026.\nWhere will Super Bowl LX be played?\nLevi’s Stadium in Santa Clara, home field of the San Francisco 49ers. It will be the second Super Bowl at that location, following the Denver Broncos’ 24-10 win over the Carolina Panthers in Super Bowl 50 following the 2015 season, and the third in the Bay Area, after Stanford Stadium hosted Super Bowl XIX (49ers 38, Miami Dolphins 16) following the 1984 season.\n- Share via\nHow many Super Bowls have the Philadelphia Eagles won?\nIt took the Philadelphia Eagles 52 years to win their first Super Bowl.\nIt didn’t take them nearly as long to win their second, although it did take two tries.\nSeven years after the organization’s first Super Bowl championship, the Eagles beat the Kansas City Chiefs in Super Bowl LIX 40-22 on Sunday at the Superdome in New Orleans. It was their second win in five Super Bowl appearances.\n- Share via\nEagles defeat Chiefs 40-22 in Super Bowl LIX\n🏈 Eagles 40, Chiefs 22 — FINAL\nJalen Hurts and the Philadelphia Eagles thwarted the Kansas City Chiefs’ quest to become the first team to win three consecutive Super Bowl titles in a victory at Super Bowl LIX in New Orleans.\nHurts completed 17 of 22 passes for 221 yards, with two touchdowns and an interception. The Eagles quarterback also rushed for 72 yards and a touchdown in 11 carries.\nWith the game out of reach of a Chiefs comeback, Kenny Pickett finished the game at quarterback for the Eagles. Eagles coach Nick Sirianni also got a Gatorade shower in the final minutes.\nXavier Worthy caught a 50-yard touchdown pass from Mahomes with 1:48 left in the fourth quarter. DeAndre Hopkins converted on a two-point conversions pass, but it was too little, too late for the Chiefs.\nCheck out the game summary from the Eagles’ win.\n- Share via\nChiefs find the end zone late in the fourth quarter\n🏈 Eagles 40, Chiefs 14 — 2:54 left in the fourth quarter\nPatrick Mahomes connected on a seven-yard touchdown pass to DeAndre Hopkins to cap a 12-play, 75-yard drive. The Chiefs converted on the two-point attempt, with Mahomes finding Justin Watson.\nUnfortunately, it’s too little, too late for Mahomes and the Chiefs.\n- Share via\nMilton Williams recovers Patrick Mahomes fumble off strip sack\n🏈 Eagles 40, Chiefs 6 — 8:01 left in the fourth quarter\nJake Elliott kicked his fourth field goal of the game, putting a 50-yard attempt through the uprights to extend the Eagles’ already sizable lead.\nThe field goal came after Eagles defensive tackle Milton Williams strip sacked Patrick Mahomes and recovered the fumble, giving Philadelphia the ball at the Kansas City 33 (Williams was called for a 15-yard unsportsmanlike conduct penalty after the play).\nMahomes has been sacked six times.\n- Share via\nEagles take 37-6 lead in on Jake Elliott field goal\n🏈 Eagles 37, Chiefs 6 — 9:56 left in the fourth quarter\nJake Elliott kicked a 48-yard field goal to make it four possession game with under 10 minutes left. Elliott has kicked three field goals today.\nJalen Hurts continues to have a standout game for Philadelphia. He fueled the 10-play, 40-yard drive with a 17-yard scramble and an 11-yard pass to Saquon Barkley.\nChiefs defensive tackle Chris Jones is doubtful to return after sustaining a knee injury.\n- Share via\nChiefs finally find the end zone on Xavier Worthy TD catch\n🏈 Eagles 34, Chiefs 6 — 34 seconds left in the third quarter\nThe Chiefs finally got on the scoreboard with Patrick Mahomes connecting on a 24-yard touchdown pass to Xavier Worthy. Their ensuing attempt at two points, however, came up short when Mahomes failed to connect with Travis Kelce.\nThe five-play drive only took 2:06 off the clock, but the Chiefs are clearing running out of time.\n- Share via\nPhiladelphia’s DeVonta Smith scores on 46-yard touchdown pass\n🏈 Eagles 34, Chiefs 0 — 2:03 left in the third quarter\nPhiladelphia wide receiver DeVonta Smith caught a spectacular 46-yard touchdown pass from Jalen Hurts another Eagles touchdown straight off a Chiefs turnover on downs.\nSmith broke away from Chiefs cornerback Jaylen Watson and managed to haul in the pass and hang on while being tackled by Watson in the end zone.\n- Share via\nEagles defense continues to frustrate Patrick Mahomes and Chiefs\n🏈 Eagles 27, Chiefs 0 — 2:47 left in the third quarter\nThe Philadelphia defense continues to frustrate Patrick Mahomes and the Chiefs.\nEagles cornerback Avonte Maddox broke up a pass intended for Chiefs receiver DeAndre Hopkins on fourth-and-five to bring another Kansas City possession to a grinding halt.\nThe Chiefs have just three first downs and 65 total yards. The Eagles took over at the Kansas City 46.\n- Share via\nA grinning Kendrick Lamar brings ‘Not Like Us’ to the Super Bowl halftime show\nThe smile — mirthful, mischievous, utterly without mercy — was when you knew: Kendrick Lamar was enjoying this.\nAs the headlining act of the halftime show at Sunday’s Super Bowl LIX, the 37-year-old Compton-born rapper spent the first 10 of his 13 minutes on the field of New Orleans’ Caesars Superdome pretending that he wasn’t going to perform “Not Like Us,” the knockout blow from his beef with Drake last year that brought this most proudly cerebral of hip-hop stars to new heights of pop renown.\nHe played other songs — songs about love and family and a yearning for authenticity — before “Not Like Us.” He enlisted the actor Samuel L. Jackson as a red-white-and-blue-clad Uncle Sam figure warning him against being “too loud, too reckless, too ghetto.” He admitted, “I wanna perform their favorite song, but you know they love to sue,” which was reasonable enough: Although “Not Like Us” topped Billboard’s Hot 100 and last week won Grammy Awards for record and song of the year — a first for a diss track in which the disser describes the dissee as a pedophile — it also spawned an unprecedented federal lawsuit in which Drake accuses both his and Lamar’s record label of defamation.\n- Share via\nJake Elliott field goal gives Eagles a 27-0 lead late in third quarter\n🏈 Eagles 27, Chiefs 0 — 5:18 left in the third quarter\nPhiladelphia continued to pile on, with Jake Elliott kicking a 29-yard field goal to cap a 12-play, 69-yard drive.\nJalen Hurts picked up a pair of first downs on runs of 16 and 14 runs, and Saquon Barkley caught a 22-yard pass to set up the field goal.\nChiefs defensive tackle Chris Jones sustained an apparent leg injury during the Eagles’ drive and was being examined by trainers on the sideline.\n- Share via\nPatrick Mahomes and Chiefs go nowhere on first possession of second half\n🏈 Eagles 24, Chiefs 0 — 12:00 left in the third quarter\nOn the opening possession of the second half, the Chiefs went nowhere. Philadelphia’s Jordan Davis and Josh Sweat sacked Chiefs quarterback Patrick Mahomes on back-to-back plays, leading to Kansas City’s sixth punt.\nThe Eagles have sacked Mahomes five times today.\n- Share via\nWhat is the largest Super Bowl halftime deficit a team has overcome?\nThe Philadelphia Eagles lead the Kansas City Chiefs 24-0 midway through Super Bowl LIX.\nIf Patrick Mahomes is somehow able to lead the Chiefs to victory, it will be the biggest halftime deficit to be overcome in Super Bowl history, breaking a record set eight years ago.\nThe Atlanta Falcons led the New England Patriots 21-3 at halftime during Super Bowl LI in 2017. No team had ever erased a double-digit halftime deficit to win the Super Bowl.\n- Share via\nEagles dominate first half to take a 24-0 lead over Chiefs at halftime\n🏈 Eagles 24, Chiefs 0 — HALFTIME\nIt was all Eagles in the first half as they capitalized on two Kansas City turnovers and a stifling pass rush to dominate Patrick Mahomes and the Chiefs.\nThe Eagles sacked Mahomes three times and Cooper DeJean returned a Mahomes interception 38 yards for a touchdown. Another Mahomes interception led to a Eagles touchdown two plays later.\nMahomes completed just six of 14 passes for 33 yards for a Chiefs team that was held to just one first down and 23 total yards. It hasn’t been all Mahomes’ fault — dropped passes also took a big toll.\nEagles quarterback Jalen Hurts completed 11 of 15 passes for 123 yards, with a touchdown and an interception. Philadelphia dominated time of possession (19:59 to 10:01).\nThe Chiefs have had success stopping the Eagles’ run game, holding Saquon Barkley to 31 yards on 12 carries.\nWill we see an epic Chiefs comeback in the second half or will the Eagles go on to win their second title of the Super Bowl era?\n- Share via\nPatrick Mahomes throws another interception, leading to Eagles touchdown\n🏈 Eagles 24, Chiefs 0 — 1:35 left in the second quarter\nA.J. Brown scored on a 12-yard touchdown pass from Jalen Hurts two plays after another Eagles interception to give Philadelphia a commanding lead.\nLinebacker Zack Baun intercepted a first-down pass from Kansas City quarterback Patrick Mahomes to give the Eagles the ball at the Chiefs’ 14.\nMahomes has completed just five of 11 passes for 24 yards and has thrown interceptions on back-to-back passes. Kansas City has just 14 total yards (the Eagles have 177).\n- Share via\nChiefs and Eagles each benefit from controversial calls by officials early in Super Bowl LIX\nA popular conspiracy theory has taken root among many non-Kansas City Chiefs football fans this postseason that the NFL and its officials are in cahoots to insure the two-time defending Super Bowl champions become the first three-time defending champions.\nA controversial call that ended the first series of Super Bowl LIX between the Chiefs and Philadelphia Eagles won’t do anything to quell those theories.\nFacing fourth and two from the 50 yard-line, Eagles quarterback Jalen Hurts appeared to connect with receiver A.J. Brown deep down the right sideline to the Chiefs 18. But Brown was flagged for offensive pass interference after his hand made contact with the facemask of Kansas City defender Trent McDuffie.\n- Share via\nCooper DeJean scores on interception return to extend Eagles’ lead\n🏈 Eagles 17, Chiefs 0 — 7:03 left in the second quarter\nEagles cornerback Cooper DeJean scored on a 38-yard interception return, avoiding multiple tackles just outside the end zone to extend Philadelphia’s lead in the second quarter.\nAfter Kansas City quarterback Patrick Mahomes was sacked on back-to-back plays by Josh Sweat and Jalyx Hunt, he tried to find DeAndre Hopkins in the middle of the field about 15 yards out, but DeJean read the play perfectly.\nThe Eagles have held the Chiefs to 20 total offensive yards so far.\n- Share via\nEagles extend their lead on Jake Elliott field goal\n🏈 Eagles 10, Chiefs 0 — 8:38 left in the second quarter\nJake Elliott kicked a 48-yard field goal to extend Philadelphia’s lead and cap a seven-play, 27-yard drive.\nA.J. Brown caught a 22-yard pass from Jalen Hurts to move the Eagles into field-goal range.\nThe Eagles have dominated time of possession so far (16:24 to Kansas City’s 4:58). The Chiefs have just one first down and the Eagles have 10.\nHurts has completed nine of 11 passes for 104 yards and has rushed for 21 yards and a touchdown in six carries.\n- Share via\nEagles drive thwarted by Bryan Cook interception\n🏈 Eagles 7, Chiefs 0 — 13:43 left in the second quarter\nChiefs safety Bryan Cook intercepted an underthrown pass from Jalen Hurts just outside the end zone to squander a chance for Philadelphia to extend its lead.\nThe pass was intended for A.J. Brown, and Cook made a perfect read and break on the ball after Hurts threw under pressure.\nThe Chiefs took over at their two-yard line, but went three-and-out. Patrick Mahomes has completed five of nine passes for 24 yards and Kareem Hunt has just one yard on two carries.\n- Share via\nEagles take early lead on ‘tush-push’ touchdown\n🏈 Eagles 7, Chiefs 0 — 6:15 left in the first quarter\nPhiladelphia quarterback Jalen Hurts scored on a one-yard keeper also known to the world as a “Brotherly Shove” to give the Eagles an early lead.\nThe touchdown was set up by a 27-yard catch from Jahan Dotson, who broke away from coverage and fell just short of the end zone. The catch was initially ruled a touchdown before overturned on review.\nA 20-yard reception by Dallas Goedert and a 15-yard unnecessary roughness penalty on Trent McDuffie for 15 yards fueled the seven-play, 69-yard drive.\nHurts has completed four of four passes for 51 yards and Saquon Barkley has 13 yards in six carries.\nNo one does the quarterback sneak, or so-called “tush push,” better than the Eagles, so the Chiefs defense’s only answer is to avoid short-yardage situations.\n- Share via\nEagles’ first possession sputters after pass-interference penalty\n🏈 Chiefs 0, Eagles 0 — 9:41 left in the first quarter\nThe Eagles’ first possession sputtered at midfield after wide receiver A.J. Brown was called for offensive pass interference following a 32-yard reception off a fourth-and-two play.\nFox color commentator Tom Brady didn’t agree with the penalty, and the call drew plenty of boos from the fans in the Superdome.\nThe Chiefs didn’t have much luck on offense, either. After Patrick Mahomes completed an 11-yard pass to JuJu Smith-Schuster, the Chiefs punted four plays later.\n- Share via\nWhat happens if Super Bowl LIX goes into overtime?\nThe final quarter of the AFC divisional round playoff game between the Buffalo Bills and Kansas City Chiefs on Jan. 23, 2022, could not have been more exciting.\nThree lead changes.\nFive scoring drives.\nA 36-36 tie at the end of regulation.\nThe overtime period, however, could not have been more disappointing.\nOne coin toss.\n- Share via\nChiefs win coin toss and will kick off to open game\nThe Chiefs called tails — and the coin flip was tails. They elected to defer to receive until the second half and will kick off to open the game.\n- Share via\nHas any NFL team won the Super Bowl three years in a row?\nPatrick Mahomes and the Kansas City Chiefs have a chance to make Super Bowl history Sunday.\nNine teams have won back-to-back Super Bowl titles, but no team has won three in a row. In fact, when the Chiefs face the Philadelphia Eagles at Super Bowl LIX in New Orleans, the two-time defending champions will be the first team in position to pull off such a feat.\n- Share via\nFor Super Bowl broadcasters, game ‘boards’ are an indispensable booth secret\nNEW ORLEANS — The story of Super Bowl LIX is in the cards.\nAnd by cards, think of a large sheet of heavy-stock paper loaded with information — player names, numbers, statistics and sometimes annotated trivia — always within reach of the broadcasters calling the game.\nThey’re called “boards” and they’re usually created from scratch by the play-by-play announcers and color analysts in the days leading up to a game, a meticulously organized study sheet that provides a commentator with detailed information in a pinch.\nFox is broadcasting Sunday’s game between the Philadelphia Eagles and Kansas City Chiefs, and although the network will offer every conceivable camera angle, not one of the more than 100 million viewers will get a clear glimpse of the boards used in the booth by Kevin Burkhardt and Tom Brady.\n- Share via\nSoCal’s Trent McDuffie, JuJu Smith-Schuster back in Super Bowl spotlight with Chiefs\nNEW ORLEANS — When Trent McDuffie positioned himself near the line of scrimmage on a season-defining fourth and five, Jason Negro had an idea of what his former star could do. It’s what the St. John Bosco alumnus has done for years.\nMake the play.\nMcDuffie’s red No. 22 jersey flashed in the backfield on a perfectly timed blitz in the AFC championship game to send the Kansas City Chiefs to their third consecutive Super Bowl. Any nerves Negro felt from watching one of his former players faded instantly, replaced by euphoria.\n- Share via\nIs Jason Kelce rooting for his old Eagles team or brother Travis’ Chiefs in Super Bowl LIX?\nJason Kelce would seem to have a dilemma going into Super Bowl LIX with this year’s game featuring his favorite team facing his favorite player.\nThe NFC will be represented by the Philadelphia Eagles, the team for which Kelce played all 13 of his NFL seasons before retiring last offseason to become an ESPN analyst.\nThe AFC will be represented by the Kansas City Chiefs, the team for which Kelce’s brother and podcast co-host, Travis Kelce, has played for the last 12 years.\nSo what’s a Philadelphia legend who is very close with one of Kansas City’s biggest stars to do?\n- Share via\nCooper Manning recalls his last Super Bowl funny moment in New Orleans\nNEW ORLEANS — The Mannings are the first family of football, especially in this town, and this week has been a big one for Cooper Manning, whose younger brothers Peyton and Eli were star quarterbacks in the NFL.\n- Share via\nCooper Manning talks about his last Super Bowl experience in New Orleans in 2013.\nNot only did the boys grow up in New Orleans — where their dad, Archie, was quarterback of the Saints — but Cooper got his formal start in comedy here. That was back in 2013, when the city was playing host to the Super Bowl between Baltimore and San Francisco.\nThat’s when the Dan Patrick Show armed the irreverent Cooper with a microphone and camera crew and had him interview football fans in the French Quarter. The “Manning on the Street” segment was a hit, with Cooper completely at ease with improvisational comedy.\n“Doing impulsive, on-camera stunts was always in my comfort zone,” said Manning, 50, who parlayed that experience into “The Cooper Manning Hour (minus 58 minutes)” on Fox’s NFL pregame show.\nAll three Manning boys were devoted connoisseurs of 1980s comedies — “Stripes,” “Vacation,” “Caddyshack” — and likewise huge fans of David Letterman. In fact, it was Cooper who coached Peyton before his first appearance on “Late Night with David Letterman.”\n“I had him ready,” Cooper said. “Peyton killed it with Dave. He and Dave became close forever.”\nCooper, whose day job in hotel and real-estate development keeps him plenty busy, now has a serious rooting interest in football, even though both of his brothers are retired. His son, Arch, is the new starting quarterback at the University of Texas.\n“I probably get a little antisocial as the game kicks in,” he said. “I get a little nervous and I’m not really in the mood to jibber-jabber an hour before kickoff. I don’t know how I’ll be. I’m hoping I can be cool and balanced.”\nIt is, after all, no laughing matter.\n- Share via\nInactives for Chiefs vs. Eagles in Super Bowl LIX\nHere are the players who will not be suiting up for the Chiefs and Eagles in Super Bowl LIX:\n- Share via\nEagles’ Jalen Hurts hears more about adversity than his ability to pile up wins\nNEW ORLEANS — In his four seasons as the Philadelphia Eagles’ starting quarterback, Jalen Hurts led his team to four playoff appearances and two Super Bowls.\nAnd he’s done it playing under three offensive coordinators.\nIn a league in which coaches and players endlessly preach about the value of consistency and continuity, Hurts has flourished in the sport’s most important position despite near annual changes.\n“Everyone desires that continuity because that consistency definitely does breed something,” Hurts said Wednesday as he continued preparations for Sunday’s Super Bowl against the Kansas City Chiefs. “But there’s also something in having the mentality of turning these situations into a positive. And learning as much as I can, taking in as much knowledge as I can, to be the best player I can be and ultimately lead the team to success.”\n- Share via\nThe Chiefs embrace their role as the most-hated team before Super Bowl\nNEW ORLEANS — Trent McDuffie can’t remember the year. All he remembers of his first Super Bowl memory was cheering against the New England Patriots.\nSo when the Patriots lost to the New York Giants, McDuffie relentlessly teased his younger brother, who was rooting for New England. From hoping to see the fall of one football dynasty, the Kansas City Chiefs cornerback is now in position to keep another one going.\nAlmost two decades after the Patriots established themselves as the dominant NFL force, the Chiefs have become the league’s new evil empire, taking the most-hated torch from the Patriots while trying to accomplish something even the NFL’s greatest dynasty never did.\n- Share via\nWhy the Chiefs-Eagles Super Bowl rematch could deliver a ratings record for Fox\nThe Kansas City Chiefs are the new team you love to hate, and that could be fuel for another Super Bowl ratings record.\nThe defending champions inspire the kind of resentment once reserved for the Dallas Cowboys, from conspiracy theory memes of quarterback Patrick Mahomes exchanging gifts with the referees to online conservatives complaining about screen time given to Travis Kelce’s girlfriend, Taylor Swift.\nBut emotion drives viewership and could be the ingredient that gives Fox a huge Nielsen number Sunday when the Chiefs try for an unprecedented third consecutive championship against the Philadelphia Eagles at the Superdome in New Orleans.\n- Share via\nPlaschke: Super Bowl sucker no more. Eagles will derail Chiefs three-peat in a beatdown\nI’ve long sought a truth as pretty as a Patrick Mahomes scramble.\nI’ve instead continually stumbled into a reality as nasty as the tush push.\nFor exactly a quarter of a century, I’ve grasped and groveled and guessed.\nFor nearly that entire time, I’ve gagged.\nIn New Orleans on Sunday it’s Super Bowl LIX between the Kansas City Chiefs and Philadelphia Eagles.\nThat means it’s time for Super Bowl Prediction Column XXVI, written by the worst Super Bowl predictor in America, this wrong-way hack stumbling through the last quarter-century embarrassing supporters naive enough to back me and richly rewarding those with enough common sense to bet against me.\n- Share via\nTom Brady played in 10 Super Bowls. The road to first one as a broadcaster has been challenging\nTom Brady is widely acknowledged as the greatest quarterback of all time. His knack for performing in the clutch and winning Super Bowls is unparalleled.\nHis current juggling act might be every bit as difficult.\nBrady made his NFL broadcasting debut as an analyst for Fox in September after signing a 10-year, $375-million contract despite being a novice in the booth.\nA month later the NFL approved his purchase of a minority ownership stake in the Las Vegas Raiders.\n- Share via\nA Chiefs bar in Eagles country? Not all Philly faithful are seeing red\nIt’s a tiny corner bar in a gritty South Philadelphia neighborhood, a hangout no bigger than the row houses that surround it. A group of maybe 30 locals, some friends for 50 years, gather at Big Charlie’s Saloon every fall Sunday, filling the place to the brim.\nSometimes you wanna go\nWhere everybody loves your team\nImagine, a Kansas City Chiefs bar in the City of Brotherly Love, where authorities have to grease the light poles to keep jubilant Eagles fans from climbing them — and even that doesn’t work. Yet, even with Philadelphia squaring off against Kansas City in Super Bowl LIX in New Orleans, the patrons of Big Charlie’s still belly up to the bar in the belly of the beast.\n- Share via\nOffenses fear Chiefs’ Chris Jones; Eagles’ Jalen Carter could disrupt Super Bowl plans\nNEW ORLEANS — Chris Jones marveled at the sight.\nThree years ago, in the final minute of Super Bowl LVI, Rams defensive lineman Aaron Donald burst off the line of scrimmage on fourth down, wrapped up Cincinnati Bengals quarterback Joe Burrow and took him to the ground. Burrow narrowly avoided a sack by flipping an incomplete pass.\nThe play clinched the Rams’ Super Bowl LVI victory.\n“Doing it on the biggest stage — that speaks volumes,” said Jones, the Kansas City Chiefs’ three-time All-Pro defensive lineman. “That was major.”\n- Share via\nSuper Bowl LIX security concerns? New Orleans visitors will be with ‘a sea of blue’\nNEW ORLEANS — Police cars are lined up in the narrow streets. Officers toting large firearms stand at alert. Barriers block many entrances to Bourbon Street.\nBehind two squad cars parked horizontally in front of a large truck that blocks the entrance to New Orleans’ most famous street, a memorial greets visitors. Flowers, candles, notes and 14 white crosses with blue hearts — one for each of the victims of a Jan. 1 terrorist attack, carried out by an attacker who allegedly was inspired by the Islamic State and drove a truck through people walking the busy street.\nThe tragic incident has come back into focus one month later as security is ratcheting back up with New Orleans hosting Super Bowl LIX on Sunday.\nWith an estimated 100,000 visitors expected to flock to the city, organizers “have no specific credible threats to this event,” Department of Homeland Security Secretary Kristi Noem said Monday at a news conference.\n- Share via\nDick Vermeil, who coached Eagles and Chiefs, says Super Bowl LIX will be one for ages\nDick Vermeil loves being Switzerland.\nHe’s got good friends with the Philadelphia Eagles and good friends with the Kansas City Chiefs — he represented both franchises — but the Hall of Fame coach now revels that now he can “embrace neutrality.”\nThe Chiefs and Eagles are headed to Super Bowl LIX in New Orleans, and, as was the case when the teams squared off on the NFL’s biggest stage two years ago, he can be the innocent bystander.\n“I have compassion for both teams because I know people in both organizations,” said Vermeil, 88, who coached the Eagles from 1976 though ’82, and the Chiefs from 2001 through ’05. He won a Super Bowl as coach of the St. Louis Rams.\n- Share via\nWhen ‘tush-push’ comes to shove, Eagles are the best so Chiefs aim to avoid play\nNEW ORLEANS — Line up, push and pray.\nWhen it comes to stopping the Philadelphia Eagles’ punishing quarterback sneak — dubbed “the tush push” for the unique way players line up behind quarterback Jalen Hurts to push him forward — the Kansas City Chiefs acknowledge they’re not sure if they have the answers entering Super Bowl LIX on Sunday.\n“It just comes down to sheer will,” Chiefs defensive coordinator Steve Spagnuolo said. “They’ve found a way to out-will people on that particular play.”\nIt resembles a rugby-like scrum when Hurts goes under center and teammates position themselves behind either hip. Lunging forward in a mass of humanity that could reach more than 3,000 pounds, the Eagles have dominated short-yardage situations and goal-line opportunities since they debuted the play in 2022 behind then-center Jason Kelce.\n- Share via\nNick Sirianni’s experiences at Mount Union helped him climb mountaintop with Eagles\nBest call in the NFC championship game?\nIt didn’t happen on the field.\nNo, it was when coach Nick Sirianni was driving home after his Philadelphia Eagles beat Washington to reach the Super Bowl for the second time in three seasons.\nSirianni dialed his college coach from University of Mount Union to bask in the excitement of the moment and invite him to Super Bowl LIX.\nLarry Kehres, who retired in 2012 with a winning percentage of .929 — the highest in college football history — opted to watch from the comfort of home in Alliance, Ohio. He’s getting older, and he and his wife don’t travel as much as when they did so for games, coaching conventions and the like.\n- Share via\nGreg Olsen isn’t calling Super Bowl for Fox. Tom Brady is — and Olsen says ‘it sucks’\nGreg Olsen was a key part of the second-most-watched TV broadcast of all time.\nOn Feb. 12, 2023, more than 115 million people tuned in to Super Bowl LVII to see the Kansas City Chiefs defeat the Philadelphia Eagles 38-35. The game was broadcast on Fox, with Kevin Burkhardt handling the play-by-play duties and Olsen providing color commentary.\nNext month could provide an encore of sorts. Super Bowl LIX is back on Fox. The Eagles and Chiefs are back as the competitors. Burkhardt will be back in the broadcast booth, and Olsen ... well, he won’t be back.\n- Share via\nFans say the games are rigged for the Chiefs. Are the officials on Kansas City’s side?\nThe NFL playoffs are rigged. The referees favor the Kansas City Chiefs. It’s all a conspiracy to hand those Reid-revering, Mahomes-adoring, Kelce-and-Swift-lovin’ cultists a third consecutive Super Bowl championship.\nFor these charges to stick, however, evidence and motive need to be established. Let’s start with evidence.\n—A ruling that Chiefs receiver Xavier Worthy made a catch deep in Bills’ territory on a third-and-five desperation pass from Patrick Mahomes with 3:13 remaining in the first half. Replays indicated the ball struck the ground and could have been called incomplete. Kansas City promptly scored a touchdown.\n- Share via\nKareem Hunt says this isn’t first time Chiefs coach Andy Reid gave him a second chance\nNEW ORLEANS — Andy Reid likes to joke that the Kansas City Chiefs plucked Kareem Hunt “off the couch.” To the Chiefs running back, however, his coach’s description of how Hunt re-joined the team that drafted him is not just funny hyperbole.\n“It is the truth,” Hunt said Tuesday.\nAfter he worked out at his former high school and used the sauna at a local YMCA to stay in shape for the NFL, the 29-year-old Hunt signed with the Chiefs following an injury suffered by Isiah Pacheco. Hunt has a team-best 836 yards rushing, including the postseason.\n- Share via\nCommentary: Sure, a Chiefs Super Bowl three-peat would be unprecedented, but don’t forget Packers\nWe need the Super Bowl for more than multimillion-dollar TV ads and sexy extravaganza halftime shows. We also need it to happily prod us into mindless discussions about semi-meaningless things.\nSo, let’s take a look at this NFL three-peat thing.\nAs the Kansas City Chiefs closed their recent semifinal victory, the discussion in the network broadcast booth turned to the Chiefs’ opportunity to win their third straight Super Bowl. That three-peat was labeled “unprecedented,” and thousands of Green Bay Packers fans, when they heard that, sat straight up in their easy chairs.\nThe word “unprecedented” is actually accurate, but dependent on semantics. It is unprecedented for the official Super Bowl but there are asterisks.\n- Share via\nKen Norton Jr. is lone player to three-peat at Super Bowl. Will Patrick Mahomes, Travis Kelce join him?\nHow is it that Ken Norton Jr. has skin in Super Bowl LIX? The former UCLA and NFL Hall of Fame linebacker and longtime NFL and college assistant coach has zero ties to the Kansas City Chiefs or Philadelphia Eagles.\nBut Norton holds the distinction of being the only NFL player to win three consecutive Super Bowls, starring for the Dallas Cowboys in 1993 and 1994 thumpings of the Buffalo Bills and for the San Francisco 49ers in their one-sided win over the San Diego Chargers in 1995.\nThe Chiefs are attempting to become the first team to win three Super Bowls in a row after defeating the Eagles in 2023 and the 49ers last year. So any Chiefs player on the roster for a third consecutive season would tie Norton’s record with a victory Sunday in New Orleans.\n- Share via\nSuper Bowl XVIII hero Marcus Allen recognizes something super in Eagles’ Saquon Barkley\nNEW ORLEANS — Marcus Allen never flinched.\nEarly in Super Bowl XVIII in 1984, the Los Angeles Raiders running back fumbled against the Washington Redskins. Allen watched as the ball rolled away from him, seemingly in slow motion, until a teammate recovered it.\nAllen returned to the huddle unfazed.\n“Most guys would be in a full panic,” Allen said in a phone interview. “I didn’t even blink. ... It’s almost metaphysical to describe. I was so locked in. I was so fifth-dimension.”\n- Share via\nLIX facts you need to know about the X Super Bowls staged in New Orleans\nNEW ORLEANS — As the Kansas City Chiefs and Philadelphia Eagles prepare this week for Super Bowl LIX, the NFL will be reconnecting with an old friend.\nHola, NOLA.\nNew Orleans will play host to its 11th Super Bowl, matching South Florida for the most.\n“Every other city hosting the game wanted what New Orleans has, and that’s an it place,” said Jim Steeg, who served as the NFL’s senior vice president of special events for 26 years. “Everything’s walkable, and you’ve got Bourbon Street. Nobody else has that.”\n- Share via\nSuper Bowl three-peat? Chiefs trying to make history alongside Lakers\nTracy Wolfson stood next to Patrick Mahomes during an interview that’s become an annual tradition.\n“We meet again,” the CBS sideline reporter told the star quarterback after the Kansas City Chiefs advanced to their fifth Super Bowl in the last six seasons.\nAfter defeating the Buffalo Bills in the AFC championship game, the Chiefs are trying to return to another familiar mountaintop. The first NFL team to repeat as Super Bowl champion since the 2004 New England Patriots is one win from becoming the first team to win three consecutive Super Bowls. A win over the Philadelphia Eagles on Feb. 9 would make the Chiefs the first NHL, NBA, NFL or MLB team to “three-peat” since the Lakers did it from 2000 to 2002.\n- Share via\nSuper Bowl LIX matchups, analysis and prediction\nNEW ORLEANS — Los Angeles Times NFL writer Sam Farmer breaks down the Super Bowl LIX matchup between the Philadelphia Eagles and the two-time defending champion Kansas City Chiefs. Kickoff is scheduled for 3:30 p.m. PST Sunday and will be televised by Fox (Channel 11 in the Los Angeles area) and streamed by Tubi:\nChiefs pass offense vs. Eagles pass defense\nProtection is a problem for Kansas City. Patrick Mahomes was sacked more this year than any other quarterback. He started getting the ball out quicker toward the end of the season but he isn’t turning over the ball. He hasn’t been intercepted since the Buffalo game in mid-November. The Eagles can cover anyone. The cornerback tandem of Quinyon Mitchell and Darius Slay is smothering. Covering Travis Kelce will be a big challenge, but Cooper DeJean is a remarkable rookie. The ability of Mahomes to extend plays and improvise is what scares defenses. He and Kelce have a seemingly telepathic connection. EDGE: Eagles\n- Share via\nSuper Bowl LIX: Start time, how to watch, location and betting odds\nThe conference championship games are over and the countdown to Super Bowl LIX begins.\nSuper Bowl LIX will be played at 3:30 p.m. PST on Sunday. It will take place at Caesars Superdome in New Orleans, the home of the Saints.\nHere’s everything you need to know about the game, including start time, TV channel, how to stream, betting odds and more."
    },
    {
      "url": "https://www.latimes.com/sports/story/2024-09-09/tom-brady-scott-hanson-apology-fox-broadcast-debut",
      "text": "NFL Network host apologizes after criticizing Tom Brady’s broadcasting debut: ‘I am rooting you on’\n- Share via\nTom Brady seemed a bit nervous.\nThat’s right. The man who won seven Super Bowls, earned three league MVP awards and set numerous quarterbacking records during a 23-year NFL career — not to mention sat there and withstood hours of raunchy barbs at his expense during a recent Netflix roast — didn’t completely kill it during his regular-season debut as a color commentator for Fox.\nWorking with play-by-play announcer Kevin Burkhardt during the Dallas Cowboys-Cleveland Browns Week 1 matchup Sunday, Brady displayed the kind of football knowledge one would expect from the player largely regarded as the sport’s GOAT.\nBut one game into his 10-year, $375-million contract with Fox, Brady is being criticized for a delivery that seemed somewhat robotic and showing a level of emotion that resembled that shown by former New England Patriots coach Bill Belichick during postgame news conferences.\nTom Brady was a good sport during his Netflix celebrity roast, but did not appreciate Jeff Ross’ joke that referenced Robert Kraft and a massage.\nJust before halftime, for example, Dallas kicker Brandon Aubrey lined up to attempt a 71-yard field goal, after having a record-tying 66-yarder negated by a delay-of-game penalty. While Burkhardt marveled at the idea of even attempting a kick from such a distance, Brady commented on how the Cowboys need to be prepared in case the kick comes up short and, after the Browns called time out, that “maybe everyone’s gonna rethink this one.”\nThe clip was shown on NFL Network’s “NFL RedZone,” with host Scott Hanson calling out Brady for his apparent lack of enthusiasm.\n“Oh, come on,” Hanson said. “Brady’s gotta get more excited than that in the booth.”\nOn Monday morning, Hanson reposted a clip of his comment, along with an apology to Brady.\n“This was unfair & inconsiderate by me,” Hanson wrote. “Yes, I was saying it tongue in cheek — but I didn’t calculate how it may come across. @TomBrady, I apologize. I promise I am rooting you on in this new venture!”\nSeven-time Super Bowl champ Tom Brady says he’s not opposed to an NFL return under certain circumstances. Can he play and still be a Raiders owner?\nBrady took the criticism in stride.\n“This rookie appreciates you @scotthanson!” Brady wrote on X later in the day. “No apology necessary my man, life is too short to not have fun!”\nHe added: “We’re officially on 70 yarder watch and I’m gonna spike my headset when it happens.”\nIncidentally, Brady’s on-air analysis of the situation was correct. Dallas actually did rethink the field-goal attempt and instead ended the half with a Dak Prescott pass attempt to the end zone that fell incomplete.\nAnother awkward moment occurred on camera, when Brady’s attempt at a fist bump with Mike Pereira wasn’t noticed for several seconds by the rules analyst. “Oh, don’t leave me hanging,” joked Brady, who was eventually bumped back by Pereira.\nThe ring Kevin Hart gave Tom Brady at his Netflix roast was made by Jason of Beverly Hills. It has nearly 400 diamonds, rubies and sapphires and is worth $40,000.\nTo be fair, Brady didn’t have a lot to work with during his regular-season debut as an NFL announcer. The game itself was a dud, with the Cowboys winning in blowout fashion.\nBrady did have his moments, like when he made an apparent reference to Belichick in saying, “I played for a coach that didn’t mind cussing his players out,” then explained why he thought that wasn’t such a bad thing.\n“If you want to be a great player, you want to be pushed, you want to be challenged, you want to be criticized,” Brady said.\nHe added: “I was the beneficiary of a lot of that hard coaching. ... Discipline and accountability are mainstays in any successful organization, and I have no problem with any coaches that feel like they need to tell their player the truth, ’cause you just don’t get a lot of truth all the time as an NFL player.”"
    },
    {
      "url": "https://www.latimes.com/sports/highschool/story/2025-08-25/bishop-montgomery-forfeits-football-game-to-no-1-mater-dei",
      "text": "Bishop Montgomery forfeits football game to No. 1 Mater Dei\n- Share via\nBishop Montgomery told officials at Mater Dei on Monday that it will not be able to play its scheduled football game Friday at Santa Ana Stadium, thus forfeiting to the No. 1-ranked Monarchs.\nNumerous Bishop Montgomery players are subject to possible one-game suspensions for leaving the bench with 24 seconds left on Saturday in Honolulu during a 24-17 loss to St. Louis, another Catholic school.\nThe Southern Section assigned its South Bay officials unit on Monday to review video to determine which Bishop Montgomery players had left the bench, which would be a violation of CIF rules.\nIt has been a rough start for Bishop Montgomery, which already had five players declared ineligible by the Southern Section after a violation of bylaw 202, which involves providing false information after transferring.\nMater Dei opened its season Saturday with a victory in Florida and will move to 2-0 on the season. Bishop Montgomery drops to 0-2."
    },
    {
      "url": "https://www.nytimes.com/athletic/6577539/2025/08/27/tom-brady-rules-fox-nfl-2025/",
      "text": "The “Brady Rules” are basically done.\nThe NFL will allow Tom Brady, Fox Sports’ top TV game analyst and Las Vegas Raiders minority owner, to take part in production meetings with coaches and teams this season, sources briefed on the decision told The Athletic.\nIn Brady’s rookie broadcasting year, he was banned from these information-gathering sessions for nearly the whole season. The rules were in place due to his ownership stake. The NFL relented for the Super Bowl.\nAdvertisement\nBrady’s play-by-play partner, Kevin Burkhardt, and other crew members would inform Brady of what was said in the meetings. The sessions, with coaches and players, can reveal nuggets that can be used during the broadcast. They take place over Zoom and/or in person.\nBrady is still expected to be barred from team practices, as he was last year.\nFox Sports and the NFL declined to comment.\nDuring February’s Super Bowl, which Brady broadcast for Fox, the NFL suspended the Brady Rules for the game between the Philadelphia Eagles and the Kansas City Chiefs. Chiefs owner Clark Hunt was instrumental in originally advocating for the regulations against an owner from a rival AFC West team.\nBrady, 48, is entering the second season of his 10-year, $375 million contract. He will debut this year on Sept. 7, for Fox’s 1 p.m. ET game between the New York Giants and Washington Commanders.\nBrady will not call the Super Bowl this season, as NBC has the game. He and the top crew will be on the late Sunday afternoon games, Thanksgiving and the playoffs, including the NFC Championship Game. His first spotlight late afternoon game is Week 2, as Fox has the Super Bowl rematch between the Chiefs and Eagles.\n(Photo: Mitchell Leff / Getty Images)"
    }
  ],
  "argos_summary": "Tom Brady, now a Fox Sports analyst and minority owner of the Las Vegas Raiders, has had his NFL-imposed restrictions eased for the 2024 season: he may attend production meetings with coaches and teams remotely, though he still cannot visit team facilities or criticize officials. The league lifted the ban that prevented him from joining in-person pregame prep, but he remains barred from practices and must keep commentary neutral. Brady’s dual roles as broadcaster and owner highlight the NFL’s attempt to balance insider knowledge with impartiality, while his broadcasting debut has drawn mixed reviews. The article also briefly touches on unrelated sports news, including a Dodgers win and various Super Bowl details, but focuses primarily on Brady’s new broadcasting permissions and ownership status.",
  "argos_id": "C9GJBXUSN"
}