{
  "url": "https://www.howtogeek.com/how-i-made-macos-tahoe-look-like-a-heavily-customized-linux-distro/",
  "authorsByline": "Tim Brookes",
  "articleId": "51462d7dcbd940db9b58ae4eaadb7fc0",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/08/macos-tahoe-looking-good-in-black.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T19:30:17+00:00",
  "addDate": "2025-08-27T19:35:05.855342+00:00",
  "refreshDate": "2025-08-27T19:35:05.855344+00:00",
  "score": 1.0,
  "title": "How I Made macOS Tahoe Look Like a Heavily-Customized Linux Distro",
  "description": "macOS now comes in any color you want (almost).",
  "content": "Apple made a lot of fuss about its Liquid Glass design overhaul at WWDC 2025, with the new visual style set to debut on all of its operating systems in the fall. One thing that’s striking about the upcoming macOS release is how different the OS can look from Apple’s past releases with the right settings.\n\nThe overhaul has been compared to Linux desktop environments like GNOME, so let’s take a look at how good (or bad) we can get things looking.\n\nmacOS 26 Already Looks Pretty Different\n\nThe most striking difference when you first boot up macOS 26 Tahoe is the inclusion of glass, everywhere. The effect appears in the dock and its icons, on the background of windows like Finder, and in the right-click context menu wherever you invoke it. This is a departure from the slightly frosted style Apple has been using for a few years now.\n\nOn top of this, the edges of everything have been aggressively rounded. While this isn’t typical of Linux window managers like GNOME or KDE in their default state, it is something that users who are heavily into customizing their desktop can apply with extensions like Rounded Window Corners fairly easily. On the Mac, there’s no slider to toggle how round things get.\n\nThe UI has been given a facelift in general, though many apps are functionally identical. Safari’s search and URL bar is a bit bigger, with no option to toggle between “Compact” and regular views anymore. Mainstays like Notes, TextEdit, and Terminal look very familiar, but some apps like Apple Music have received some much-needed attention.\n\nSpotlight now has a few extra buttons for accessing your apps, Shortcuts workflows, and clipboard history, plus a new bouncy animation. The menu bar at the top of the screen seems slightly smaller, and no longer divorced from the rest of your desktop with a frosted panel (just your wallpaper background). This makes the desktop feel a bit roomier, which is nice.\n\nAlso new is one change that’s generated a fair bit of controversy: a rounded mouse cursor. You can use the new glassy sliders under System Settings > Accessibility > Display to make it absolutely massive, but there’s no going back to the angular mouse. It’s a surprisingly noticeable change.\n\nAll of these changes apply to both dark and light mode, though the Liquid Glass effects are arguably more visible in dark mode since it feels more pronounced. The bottom line here is that simply by installing the macOS 26 Tahoe beta (in a virtual machine), I’ve managed to make macOS look different. But you can go further.\n\nIn iOS 18, Apple made it possible to tint icons or pick to display dark mode icons permanently. In macOS 26, the company has done the same for objects across the operating system, including folders, apps, and desktop widgets. There’s also a new clear appearance, which plays up the Liquid Glass aesthetic.\n\nYou can choose between these under System Settings > Appearance, where you can also pick light and dark options for these elements (separately from light and dark mode, which can still be toggled in Control Center), plus automatic switching between the two. By far the most alien of the lot is “Tinted,” which then invites you to pick an “Icon, widget, and folder color” from a list of presets.\n\nYou can also pick the “Choose Color” option, then use the Color Picker to select any color on your desktop. This works great if you pick an accent color from your desktop, which causes all customizable elements to fall in line.\n\nHere’s a shot of the default macOS Tahoe dynamic wallpaper, in dark mode, with a color hand-picked from a light purple accent within the wallpaper:\n\nAnd here’s a shot taken in light mode, with a light green accent instead:\n\nThe colorization and clear effect, combined with your choice of wallpaper, can really make macOS Tahoe look drastically different from past versions of Apple’s operating system.\n\nIt’s also easy to customize individual folders with similar options, which ignores the other rules we’ve mentioned above. To do this, simply right-click on a folder and choose “Customize Folder” from the context menu.\n\nWhen you tag a folder, it’s tinted by default, but you can turn this off under Finder > Settings > Tags if you want. You can’t add custom hues here; you can only add colors based on Apple’s presets. It’s a great way to make a folder stand out, as long as your chosen color complements your existing theme.\n\nJust remember that you’re applying tags here, not just making the folder look different. If you are already highly dependent on a system of tags, you’ll want to be mindful that you don’t mess it all up by getting carried away with colors. On top of this, you can apply a custom graphic or an emoji to your folder to further make it your own.\n\nDo More With the Menu Bar\n\nIn macOS 26 Tahoe, the menu bar is more customizable than it was before. You can now add a huge range of controls via the controls in System Settings > Menu Bar. Click “Add Controls” to access a huge range of built-in shortcuts, which can be added to both Control Center and the menu bar itself. This means you can do things like add a Voice Memos button to the area next to the clock, which starts recording as soon as you click it.\n\nThe result is a menu bar and Control Center that looks different from any that have come before it. Some of these are a bit of a let-down, since they are only app shortcuts rather than extensions. You can’t add a stopwatch control that starts counting in the menu bar, for example, the icon just opens the Clock app.\n\nInvert or Tint That New Pointer\n\nSo what about that new rounded pointer that drew the ire of so many commenters? Personally, I think it looks better if you invert it so that the bulk of the pointer is white with a black outline. I’m not sure why, but it just seems to fit both a light and dark theme better this way.\n\nHead to System Settings > Accessibility > Display and swap the outline and fill colors around, and tell me that doesn’t look better. Alternatively, you could match the fill color with the highlight accent color you picked when setting up your macOS appearance.\n\nThis is something you’ve always been able to do; I’ve just never felt the need to do so before.\n\nDoes It Look Good?\n\nThere’s no single look for macOS 26 Tahoe, so whether it looks good largely depends on how you set it up. It all comes down to personal taste, except for some of the bigger changes that Apple has foisted upon its users.\n\nAfter playing around extensively, there's a lot to like here if you're going for a specific look, and Tahoe lets you do things that have never been possible before. Dark themes in particular can be particularly beautiful, like this effort I was particularly proud of:\n\nThe rounded corners will take a bit of getting used to, and they don’t feel like the most efficient use of space. The Liquid Glass splashes are just fine, but the new look isn’t going to revolutionize the way that you interact with your Mac. A smaller menu bar and more customization options are welcome changes that make a positive impact, in my opinion.\n\nThere are some missteps too, like a new Finder icon that I can’t help but think looks like the wide Linus meme and some inconsistency in design, like not changing the copy pointer to match the new style (even though there are new resize and text cursor pointers).\n\nWhether you decide to turn your desktop into a sterile glass cube or tint everything baby pink is up to you. It’s nice to have options, but they don’t necessarily all look good. Perhaps most important is a lesson that we learned last year from iOS 18: don’t pick aesthetics over usability. Color can be so important for helping you navigate your desktop, particularly when it comes to quickly spotting app icons or widgets.\n• Powered by an impressive M4 chip, the redesigned Mac Mini starts with 16GB RAM, 256GB SSD, a 10-core CPU, and a 10-core GPU.\n• The MacBook Air with the M4 chip is Apple's most powerful yet, with amazing battery life and buttery-smooth performance in a thin and light profile.\n\nmacOS 26 Tahoe will be released sometime in the fall, so you don’t need to wait long to get your hands on the final release. Alternatively, if you’re a GNOME user who wants to make your Linux desktop look like macOS 26, you’re in luck.",
  "medium": "Article",
  "links": [
    "https://tenor.com/view/linus-tech-tips-meme-ltt-gif-25046110",
    "https://unsplash.com/photos/black-and-gray-wooden-door-nJtIB8dnG0Q",
    "https://www.amazon.com/dp/B0DZD9S5GC/?tag=hotoge-20&ascsubtag=UUhtgUeUpU2016038&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Fhow-i-made-macos-tahoe-look-like-a-heavily-customized-linux-distro%2F&asc_campaign=Feed",
    "https://www.reddit.com/r/unixporn/comments/1lfbac5/gnome_macos_tahoe_v020/",
    "https://www.howtogeek.com/file-tagging-is-the-best-mac-finder-feature-youre-not-using-but-should/",
    "https://www.amazon.com/dp/B0DLBTPDCS?tag=hotoge-20&ascsubtag=UUhtgUeUpU2016038&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Fhow-i-made-macos-tahoe-look-like-a-heavily-customized-linux-distro%2F&asc_campaign=Feed",
    "https://www.howtogeek.com/ways-to-change-how-your-iphone-looks-in-ios-18/",
    "https://github.com/yilozt/rounded-window-corners",
    "https://www.apple.com/shop/buy-mac/mac-mini/apple-m4-chip-with-10-core-cpu-and-10-core-gpu-16gb-memory-256gb"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "macOS Tahoe",
      "weight": 0.07647809
    },
    {
      "name": "folder color",
      "weight": 0.07292995
    },
    {
      "name": "dark mode icons",
      "weight": 0.06787641
    },
    {
      "name": "app icons",
      "weight": 0.06338913
    },
    {
      "name": "macOS",
      "weight": 0.060884822
    },
    {
      "name": "Linux desktop environments",
      "weight": 0.060698386
    },
    {
      "name": "light mode",
      "weight": 0.060603842
    },
    {
      "name": "fill colors",
      "weight": 0.060491107
    },
    {
      "name": "dark mode",
      "weight": 0.060354624
    },
    {
      "name": "desktop widgets",
      "weight": 0.0597901
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.7939453125
    },
    {
      "name": "/News/Technology News",
      "score": 0.68359375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.51220703125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.430908203125
    }
  ],
  "sentiment": {
    "positive": 0.2679374,
    "negative": 0.24774866,
    "neutral": 0.48431394
  },
  "summary": "Apple's upcoming Mac operating system, macOS 26 Tahoe, has been introduced with a Liquid Glass design overhaul, set to debut on all operating systems in the fall. The most noticeable change is the inclusion of glass everywhere in the dock and its icons, on the background of windows like Finder, and in the right-click context menu. This is a departure from the frosted style Apple has been using for a few years. The edges of everything have been rounded, something that users can easily customize with extensions like Rounded Window Corners. The UI has been given a major overhaul, including a larger search and URL bar for Safari, a smaller menu bar for Spotlight, and a new clear appearance for Apple Music. The changes apply to both dark and light mode, though the Liquid Glass effects are more noticeable in dark mode. It is also easy to add custom colors based on Apple’s presets.",
  "shortSummary": "Apple’s upcoming macOS 26 update features a Liquid Glass design, enhanced icons, and a rounded mouse cursor, making it more user-friendly and functional.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "01727d834bca4dceb869f735e6480e0d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://tenor.com/view/linus-tech-tips-meme-ltt-gif-25046110",
      "text": "We've updated our\nTerms of Service\nand\nPrivacy Policy\n. By continuing you agree to Tenor's\nTerms of Service\nand\nPrivacy Policy\n.\nTenor.com has been translated based on your browser's language setting. If you want to change the language, click\nhere\n.\nCreate\nSIGN IN\nProducts\nGIF Keyboard\nAndroid\nContent Partners\nExplore\nLanguage\nReaction GIFs\nExplore GIFs\nCompany\nAbout\nPress\nBlog\nFAQ\nTerms and Privacy\nWebsite Licenses\nContact Us\nAPI\nTenor GIF API\nGIF API Documentation\nUnity AR SDK\nLinus Tech Tips Meme Ltt Meme\n● SD GIF\n● HD GIF\nCAPTION\nM\nMarkuss2108\nShare to iMessage.\nShare to Facebook.\nShare to Twitter.\nShare to Reddit.\nShare to Pinterest.\nShare to Tumblr.\nCopy link to clipboard.\nCopy embed to clipboard.\nReport\nLinus Tech Tips Meme\nltt\nShare URL\nEmbed\nDetails\nContent Description: a close up of a man 's face with a very large chin .\nFile Size: 70KB\nDimensions: 498x280\nCreated: 3/4/2022, 8:38:43 PM\nRelated GIFs\n#linus\n#rip\n#fortune-cookie\n#linus\n#aethoran\n#Linus-Tech-Tips\n#linus\n#linus\n#ltt\n#Linus-Tech-Tips\n#linus\n#Linus-Tech-Tips\n#meme\n#dell\n#what\n#confusion\n#reaction\n#linus\n#meme\n#linus-oof-tips\n#oof"
    },
    {
      "url": "https://github.com/yilozt/rounded-window-corners",
      "text": "- Works with Gnome 40+\n- Custom border radius and clip paddings for windows\n- Black list for applications which draw window decoration itself\n- Custom shadow for rounded corners windows\n- Skip libadwaita / libhandy application\n- Superelliptical shape for rounded corners, thanks to @YuraIz\n- A simple reset preferences dialog\n-\nCompiz alike magic lamp effect\nHide shadow when magic lamp effect running. Need to restart (disable then enable) this extension when Compiz alike magic lamp effect enabled.\n- The rounded corners effect for window is base on this shader from mutter project\n- The TypeScript support for GJS is power by gi.ts\nInstall extensions from here.\nIt will install extensions to ~/.local/share/gnome-shell/extensions\n,\nneed to install yarn\n, Node.js and gettext\ngit clone https://github.com/yilozt/rounded-window-corners\ncd rounded-window-corners\nyarn install && yarn ext:install\nIn NixOS, you can use nix-shell\nto enter a development shell before\nrun yarn install\n.\nYou may need to install those packages when building this extensions. Feel free to open issues if you got error.\nsudo pacman -S nodejs yarn gettext # Arch Linux\nsudo apt install nodejs yarnpkg gettext # Ubuntu\nsudo dnf install nodejs yarnpkg gettext gettext-devel # Fedora\nDownload extensions pack from Releases Page, or download git version from\nGithub Actions. After download extensions pack, you need use\ngnome-extensions\nto install it, then restart gnome-shell to enable this\nextensions.\ngnome-extensions install rounded-window-corners@yilozt.shell-extension.zip\nYou can help translate this extensions by using Weblate, or update po files then open a pull request.\nTo add new translations for extensions, you can add .po\nfiles in po\ndirectory via msginit\n, then use your favorite text editor to edit it.\ncd po && msginit # Add po file for new translations\nYou can run yarn ext:install\nor yarn dev\nto install extensions with with\nnew translations. In XOrg sessions, just press Alt + F2 -> r\nto restart\ngnome-session then preview the result. In Wayland session, have to logout\nsession then login again to reload extensions.\nyarn dev\nwill watch changes of .po\nfiles, once you have update translations,\nit will compile and install extensions automatically.\nyarn build\nBuild and install extensions when files in src\nfolder changed.\nyarn dev\nNeed to install Vagrant\nand\nVirtual Box. This command will setup a virtual machine that enable log of\nextensions in terminal.\nyarn vm"
    },
    {
      "url": "https://www.reddit.com/r/unixporn/comments/1lfbac5/gnome_macos_tahoe_v020/",
      "text": "Submit screenshots of all your *NIX desktops, themes, and nifty configurations, or submit anything else that will make ricers happy. Maybe a server running on an Amiga, or a Thinkpad signed by Bjarne Stroustrup? Show the world how pretty your computer can be!\n[GNOME] macOS Tahoe v0.2.0\nIt’s been exactly one week since I released the first version of my macOS Tahoe-inspired theme, which customised only the App Launcher and Top Bar.\nSince then, I’ve spent the week studying macOS design principles and reworking the GTK side to replicate the glassy, liquid‑like Tahoe appearance more accurately. You can check out the latest v0.2.0 on my GitHub!\nHowever, layers of math and different filters must be applied to replicate macOS Tahoe truly. Here's why:\n-\nThe colour of elements on the page bleeds onto the edges of Liquid-Glass elements.\n-\nThe shape and size of the element define how much the elements behind the glass should refract. For significant elements, the blur and the thickness are greater, and hence, the aspects behind it are refracted more. Meanwhile, with smaller components, the blur is less, the thickness is less, and thus, it acts like one by refracting the aspects behind it less.\nThe problem with GTK is that it doesn't support backdrop filters, which are essential for a few filters that we require to replicate liquid glass closely. Due to this, I had to rely on the box-shadow property and the Blur My Shell extension.\nThanks to this theme, it acted as a base theme, and it was easy for me to develop the macOS Tahoe-like theme (latest version) on top of it!\nWhat's next?\n-\nRice GNOME Shell (Top-Bar, Lock Screen and Overview)\n-\nCraft Tahoe icons!\n-\nContinue refining translucency layers and gradients.\nAny support, like opening an issue, submitting pull requests, or crafting Tahoe icons, is much appreciated, and I look forward to your positive response! Hope ya'll enjoy this theme as much as I do! :D"
    },
    {
      "url": "https://www.howtogeek.com/file-tagging-is-the-best-mac-finder-feature-youre-not-using-but-should/",
      "text": "Summary\n- Tags in Finder on Mac help organize and prioritize files efficiently.\n- Tags can be utilized for projects, tracking progress, and task prioritization.\n- Simplify Mac maintenance by using tags for archiving, reviewing, and organizing files.\nIf you're not already using file tagging in Finder on your Mac, you're missing out. What at first seems like a simple system for color-coding files can be an incredibly useful tool when used in the right way.\nWhat Are Tags in macOS?\nIn their simplest form, tags are a way of color-coding your Mac files. This gives you a simple visual indicator for files that you can use to help you prioritize what to work on and which projects your files relate to, or any other use that you can think of.\nTagging files on your Mac is simple to do. You can quickly assign color tags from the context menu when you right-click a file or add your own bespoke tags with an additional click. You can also add tags via the Preview pane in Finder.\nThere are many ways to use tagged files once you've created them. You can search for files with specific tags or add tags to the sidebar to instantly access all files with that tag. You can even use tags as a filter in smart folders to extract exactly the files that you want.\nIf you've never got into the habit of tagging files, it's definitely something to give a try. There are plenty of ways that using tags can make your life a lot easier.\nUsing Tags for Projects\nIf you use your Mac for work purposes, using tags to help organize your project files can be really useful. The simplest way to do so is to create a new tag for each project that you're working on. That way you can easily find all the files for a specific project by searching for that tag or by pinning that tag to the sidebar.\nTags can be even more powerful if you split projects up into smaller subprojects. Since you can add multiple tags to the same file, each file in your project can include the main project tag as well as having a second subproject tag that will differ from file to file. If you need to find all the files for a project you can, but if you only need files for a specific subproject, you can find those too.\nYou can break subprojects down even further with a third tag, and so on, using as many tags as you wish. The key is consistency. Find a system that works for you and stick to it.\nTracking Progress With Tags\nWhether it's for work or just the admin of daily life, it can be hard to keep track of what you need to do, what you're working on right now, and what you've already done. That's where tags can help.\nThree simple tags can make a huge difference. Creating a \"To-Do\" tag means you can quickly tag any files that need to be worked on. An \"In Progress\" tag is for those tasks that you're in the middle of, but which you still haven't completed.\nRound things off with a \"Completed\" tag, and your files can pass through each stage as you create them, work on them, and finish them. Seeing your \"To-Do\" list get smaller and your \"Completed\" list get bigger can be incredibly satisfying, and the \"In Progress\" files ensure that you don't keep starting lots of different tasks before you finish the ones you're still working on.\nUsing Tags to Prioritize Tasks\nTracking progress with tags is all very well and good, but if you have multiple projects on the go at once, it can be hard to keep track of which tasks need doing and when. Prioritizing tasks isn't always easy, and it can mean falling behind because you're working on tasks that aren't that important and ignoring ones that are.\nA simple way to keep on top of what needs to be done and when is to use tags to prioritize tasks. Give high-priority tasks a red tag, medium-priority tags a yellow tag, and low-priority tasks a green tag. It's then easy to see at a glance whether a file needs to be worked on imminently or if it's something that you can leave until other tasks have been completed.\nIf the traffic light system isn't granular enough for your needs, you can make your own tags to get as detailed as you want. You can even use multiple tags, such as a \"High Priority\" tag combined with \"Complete Today\" and \"Complete This Week\" tags that help you narrow down which of your high-priority tasks need doing first.\nSimplifying Mac Maintenance With Tags\nJust like your home, your computer will benefit from a good spring clean every now and then. It's all too easy for your Mac to get filled up with junk that you really don't need, or for important files that could be archived to get lost among the mess. The trouble is that sorting through your Mac can be a tedious and time-consuming task.\nUsing tags can help. For example, if you download a bunch of installers for various apps, but aren't going to install them all yet, you can tag them with a \"Temporary\" tag. That way, even if you forget to delete the installer after you've used it, when it comes time to spring clean your Mac, you can use the tag to locate all the files that you need to get rid of.\nIf you're not sure if a file is one you need to keep or can be deleted, you can create a \"Review\" tag for it. That way, when you're cleaning up your Mac, you can find all the files that you need to make a decision on. Those that you don't want can be removed, and those that you want to keep can have the \"Review\" tag removed or replaced with something else.\nAn \"Archive\" tag can be useful, too. Rather than archiving files each time you find one you want to save elsewhere, tag them with \"Archive\" and you can then archive them all in bulk when you have the time.\nUsing Tags With Smart Folders\nUsing multiple tags for each file means you can choose how wide or narrow to cast your net when searching for files. For example, searching for a project tag will bring up all the files from that project, but searching for a subproject tag will only bring up a subset of those files.\nIf your tags are used across projects, however, then things get a little more complicated. You might have a \"High Priority\" tag that you used in all of your projects. What if you only want to see high-priority tasks from a specific project?\nThis is where smart folders can help. You can set up smart folders with multiple criteria, ensuring you only see the files that you want. For example, you can create a smart folder that searches for files that are tagged with both a specific project name tag and a high priority tag, to see all the files that you need to focus on for a specific project. You can even do things like find all the media files associated with a specific tag.\nIf you find yourself repeatedly making the same searches for combinations of tags, then creating Smart Folders and pinning them to the Finder sidebar can save you a lot of time.\nIf you're not already using tags in Finder on Mac, you may be surprised just how useful they can be. Decide on a system that works for you and use tags to become a lot more efficient. You'll never want to go back!"
    },
    {
      "url": "https://www.howtogeek.com/ways-to-change-how-your-iphone-looks-in-ios-18/",
      "text": "Quick Links\niOS 18 is the most personalized version of Apple’s iPhone operating system ever, with brand new ways to customize the UI to your liking. Here are all the new ways you can make your iPhone stand out from the crowd.\n1 Dark and Tinted Home Screen Icons\nApple made a big deal about a more customizable home screen in its WWDC 2024 presentation, which will delight iPhone owners who are yearning for a particular look. Home screen icons can now conform to light and dark modes, with an automatic toggle to switch between the two.\nYou can also choose to tint your icons to perfectly match your wallpaper (or even your case). You’ll find these options by tapping and holding an icon on the home screen, then choosing “Edit Home Screen.”\nIn the top-left corner of the screen, tap “Edit” followed by “Customize” to reveal the new overlay.\nHere you have quite a few options available to you. You can choose between “Light” and “Dark” icons which work for most icons but you might find a few third-party apps don’t support dark mode. Choose “Automatic” and iOS will switch at dawn and dusk for you.\nYou can also pick “Tinted” and then nominate a color. Since iOS colorizes your icons, all icons will be affected (regardless of whether they have been updated to support the functionality). Use the first slider to pick a color and the second to lighten or darken the tint.\nUse the color picker pipette icon in the top-right corner of the overlay to choose a specific hue from your wallpaper. This is ideal if you have a theme that you want to follow.\nLastly, you can also tap the “Sun” icon in the top-left corner of the overlay to lighten or dim the background. This will effectively force light or dark mode on your home screen background (but it won’t affect the wallpaper on your lock screen). Use this to set interesting combinations of light, dark, or tinted icons with a light or dark background.\n2 Icon-Only Home Screens\nYou can also choose to use larger home screen icons from the same overlay. Tap and hold an app, hit “Edit Home Screen” then tap “Edit” in the top-left corner followed by “Customize.”\nNow tap “Large” to switch to large mode icons, and watch the app names disappear. This is a unique look that takes some time to get used to but may be of use to some.\nYou can always drag down on the home screen to reveal Spotlight search and start typing an app name in the event that you forget exactly what the app icon looks like.\n3 Place Apps and Widgets Anywhere\nIn iOS 18, Apple has gotten rid of previous restrictions that forced you to place apps in a logical tiling order. This means you can place apps anywhere on the home screen grid, and the same goes for widgets.\nCustomizing your home screen layout works exactly as it did before: tap and hold an app icon, then choose “Edit Home Screen” and your apps should start jiggling. From here you can drag apps and widgets into place. Add new widgets using the Edit > Add Widget or add apps by dragging from over from the App Library.\nSome widgets can be dragged using the “handle” in the bottom-right corner to make them larger and smaller (try it with the Photos widget, as an example). You can even create minimal home screens with just a few apps on them, or arrange your apps and widgets so that you can fully enjoy your wallpaper even on the home screen.\n4 Customize the Control Center\nThe Control Center, accessible by swiping down from the top-right corner of the screen, has seen the most radical redesign of iOS 18. It’s now fully customizable, with controls scattered across multiple screens that are accessible with a swipe.\nTap the “+” plus icon on the top-left corner of the screen to start customizing Control Center. You can freely move objects around, delete them with the “-“ minus button, and resize elements using the “handle” in the bottom-right corner of an element.\nAt the bottom of the screen, you can tap “Add a Control” to add a huge number of controls, including those from third-party apps. Create a new page of controls by swiping down to the very last page and adding something. Delete pages you don’t want by removing all of the widgets from them.\nThere’s a lot here, and a lot of functionality has been retained from iOS 17 (including “hidden” controls for things like the flashlight and display brightness).\n5 Replace Lock Screen Shortcuts\nIn addition to the Control Center, you can now replace the flashlight and Camera app shortcuts on your lock screen. To do this, bring up the lock screen then tap and hold in a blank space. You should see the lock screen gallery appear.\nTap “Customize” then tap on “Lock Screen” and look at the bottom of the page.\nTap the “-“ minus button next to a control to remove it. Leaving a control off hides it altogether. You can now tap the “+” plus button to add another control from the gallery.\nIf you prefer to use a third-party camera app, you can replace the default iOS Camera shortcut with that instead. Swiping left on the lock screen will still open Apple’s default Camera app. This is a nice way to get access to multiple ways of shooting photos and videos.\n6 Change Layout in Photos and Fitness\nCustomization in iOS 18 runs deeper than the lock and home screen or Control Center. The Photos app has been overhauled, with the tabbed interface removed in favor of a single-screen design. The jury’s still out on how useful this change is, but the ability to customize the app can make a big difference.\nLaunch Photos and scroll right down to the bottom of the page, then tap “Customize & Reorder” to make changes. Tap the blue checks to toggle sections on and off, and use the “hamburger” icons to the right of an item to drag it into a new position.\nYou can also tap “Modify” in the “Pinned Collections” carousel to modify what you see here.\nThe Fitness app gets similar treatment, launch it and then (on the Summary tab) scroll down and tap “Edit Summary then use the “+ Add” button to add sections, drag sections around, or use the “-“ minus button to get rid of anything you don’t want to see.\nYou can also still customize Apple Health to highlight the metrics you really care about, just launch the app and tap “Edit” next to the “Pinned” section to decide what appears when you first open the app.\n7 A New Dynamic iOS 18 Wallpaper\nLast but not least, there’s a new dynamic iOS 18 wallpaper to choose from. You can access this via the lock screen gallery or under Settings > Wallpaper using the “Add Wallpaper” button.\nYou’ll find the wallpaper under the “iOS 18” section and you can choose from a “Dynamic” version which cycles colors throughout the day, or opt for a specific combination of colors by swiping left and right until you find one you like. The wallpaper featured heavily in Apple’s early iOS 18 marketing.\nThere are also light, dark, and automatic toggles.\nThese changes build on improvements Apple has made to iOS over the past few years, including the introduction of the lock screen gallery, lock screen widgets, and the ability to link Focus modes to lock screens.\nAlternatively, if you want your iPhone to always feel fresh, consider cycling your iOS wallpaper automatically."
    }
  ],
  "argos_summary": "Apple’s macOS 26 Tahoe introduces a sweeping Liquid Glass redesign with glassy windows, aggressively rounded corners, and a new, more integrated menu bar. Users can deeply customize appearance—tinting icons, widgets, folders, and even the cursor—via System Settings, and add controls to the menu bar and Control Center. The article also highlights a GNOME theme that emulates Tahoe’s look and touches on iOS 18’s expanded home‑screen and control‑center customization, but the core focus remains on macOS 26’s visual overhaul and personalization options.",
  "argos_id": "E5ZDKKE74"
}