{
  "url": "https://gizmodo.com/the-dark-crystal-is-returning-to-theaters-which-isnt-the-dark-crystal-news-we-were-hoping-for-2000649035",
  "authorsByline": "Germain Lussier",
  "articleId": "2be0d4e8b96d41c8bea5fc3f7995a10e",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/Dark-Crystal-poster-crop-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T18:45:31+00:00",
  "addDate": "2025-08-27T19:00:57.251280+00:00",
  "refreshDate": "2025-08-27T19:00:57.251281+00:00",
  "score": 1.0,
  "title": "'The Dark Crystal' Is Returning to Theaters, Which Isn't 'The Dark Crystal' News We Were Hoping For",
  "description": "Fathom is bringing the 1982 Jim Henson production back to theaters this October.",
  "content": "Fathom Entertainment is celebrating 70 years of the Jim Henson Company by bringing its cult 1982 film, The Dark Crystal, back to theaters on October 12-13. This is, undoubtedly, good news. Dark Crystal rules. And yet that we could have good Dark Crystal news in the year 2025 and it not be about the incredible Netflix prequel series, The Dark Crystal: Age of Resistance, does make it slightly bittersweet.\n\nThe Dark Crystal: Age of Resistance was released on Netflix back in 2019, and we think it was and remains one of the greatest fantasy adventures in history. The show took everything you knew and loved about the original movie and dialed it to 11, giving audiences a sweeping, epic story on the scale of Lord of the Rings. Unfortunately, the year was 2019, and there was more than a little competition for the eyes of that kind of audience. Though the filmmakers planned on multiple seasons, they never happened, and Netflix pulled the plug in 2020.\n\nWhy mention this in a news piece about The Dark Crystal returning to theaters? Well, because it offers the tiniest glimmer of hope. Like a single Gelfling with a chance to destroy the Skeksis, this is an opportunity to show the world that Thra is worth revisiting. And, while we are 99.9% sure it would never happen, there is probably a teeny, tiny chance that a strong showing from these screenings could spark something in Netflix to revisit its iconic, underappreciated series.\n\nOkay, we know. We’re being wildly optimistic. Best to focus just on what is happening, and that’s the re-release, which will include a new, exclusive intro from Brian Henson. “The magic of Jim Henson and The Dark Crystal has long been a hit with Fathom Entertainment audiences,” Ray Nutt, Chief Executive Officer, Fathom Entertainment, said in a press release. “We are honored to bring back this cinematic fantasy masterpiece and honor The Jim Henson Company in this, its 70th year of making fantasy magic for audiences of all ages.” Fantasy magic that also includes an even better Dark Crystal show.\n\nTickets for The Dark Crystal re-release on October 12-13 are on sale now on Fathom’s website.",
  "medium": "Article",
  "links": [
    "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
    "https://gizmodo.com/dark-crystal-age-of-resistance-has-been-canceled-by-ne-1845132612",
    "https://www.fathomentertainment.com/releases/the-dark-crystal-2025/",
    "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
    "https://gizmodo.com/reminder-the-dark-crystal-age-of-resistance-is-a-stone-cold-masterpiece-2000574613",
    "https://gizmodo.com/the-12-best-and-4-worst-movie-moments-of-2019-1840349157",
    "https://gizmodo.com/io9-roundtable-the-beautiful-and-terrifying-the-dark-c-1837850236",
    "https://gizmodo.com/everything-you-need-to-know-before-watching-the-dark-cr-1837172422",
    "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
    "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
    "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Dark Crystal",
      "weight": 0.12995955
    },
    {
      "name": "good Dark Crystal news",
      "weight": 0.12393888
    },
    {
      "name": "Fathom Entertainment audiences",
      "weight": 0.09980039
    },
    {
      "name": "Fathom Entertainment",
      "weight": 0.0854628
    },
    {
      "name": "Jim Henson",
      "weight": 0.08264444
    },
    {
      "name": "Fantasy magic",
      "weight": 0.080835916
    },
    {
      "name": "fantasy magic",
      "weight": 0.080835916
    },
    {
      "name": "Netflix",
      "weight": 0.07693382
    },
    {
      "name": "The Dark Crystal re",
      "weight": 0.075573385
    },
    {
      "name": "audience",
      "weight": 0.07115673
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.9716796875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.8291015625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.642578125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.63623046875
    },
    {
      "name": "/Arts & Entertainment/Movies/Action & Adventure Films",
      "score": 0.52490234375
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.461181640625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.421630859375
    }
  ],
  "sentiment": {
    "positive": 0.7201723,
    "negative": 0.063050985,
    "neutral": 0.21677673
  },
  "summary": "Fathom Entertainment is returning its 1982 cult film, The Dark Crystal, to theaters on October 12-13. This is good news for Fathom Entertainment, which is celebrating 70 years of the Jim Henson Company. However, the release may not be the same as the release of the Netflix prequel series, TheDark Crystal: Age of Resistance, which was released on Netflix in 2019 but was cancelled in 2020. The re-release will include an exclusive intro from Jim Hensen and tickets are on sale now for the event.",
  "shortSummary": "Fathom Entertainment will re-release The Dark Crystal in theaters on October 12-13, marking its 70th anniversary, but with mixed reactions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7d7c1e3c0dda4a48b22a9879716ce267",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://gizmodo.com/io9-roundtable-the-beautiful-and-terrifying-the-dark-c-1837850236",
      "text": "Netflix’s The Dark Crystal: Age of Resistance has arrived, and people have been raving about this groundbreaking series—both for its technical prowess and the powerful fantasy story. This includes io9’s own James Whitbrook and Beth Elderkin, who decided to dig into everything they loved about the series so far and where they hope things go from here, should the show get another season (knock on crystal).\nBeth Elderkin: Another world, another time, in the age of wonder…we watched a kickass television show. James, you and I have been privately getting psyched about The Dark Crystal: Age of Resistance for weeks now, but now we’re talking about it for real. How are you feeling after finally finishing the first season?\nJames Whitbrook: Well, after the wild wait of seeing the first five episodes in advance, I only really had half the season to binge this past weekend—but it just made the wait all that more worth it, because I loved it to pieces. It’s such a…fun is perhaps not the most apt word to describe Age of Resistance, but it soothed my soul.\nhttps://gizmodo.com/the-dark-crystal-age-of-resistance-is-the-groundbreaki-1837447298\nBeth: I was fortunate that I got to watch the full season before writing my review, which isn’t something that always happens. Of course, since no one else at io9 had yet, that made me downright antsy, so eager to dive into every facet of this beautiful 10-episode debut season. I practically devoured this show, like a gluttonous Skeksis, bones and all. Which is amazing, considering I knew very little about The Dark Crystal as a franchise before prepping for the new series. I didn’t grow up with the movie at all, watched it for the first time a few months ago. What was your history with The Dark Crystal before coming into the prequel show?\nJames: I loved puppet shows growing up as a child, everything from the Muppet movies to proper old school Gerry Anderson Supermarionation shows like Thunderbirds and Captain Scarlet, so The Dark Crystal was part of all that, too. Except, unlike all those other puppet shows, it was the one that just FREAKED ME THE HELL OUT. I think I was maybe 5-ish years old when I’d first seen it, which is both the perfect time to have seen it and also the worst! I love the movie, but it’d had been a while since I’d seen it, so I rewatched it waiting for the new show. I really thought it held up, despite it being a very measured film, paced in a way that’s very unfamiliar to the movies of today—I’m interested to see what you thought of it as a first-time viewer!\nBeth: So, I enjoyed the film, but more for what wasn’t there than what was. The film itself is beautiful, but a little outdated. However, I was intrigued by the larger mystery of Aughra, the Gelfling, and the big wide world of Thra. What happened to the Gelfling? Why were the UrSkeks separated? Why was Aughra missing an eye? All of these questions, and a lot more, were brought to life in the expanded lore. I’m not much of an Expanded Universe person, but I found myself digging into this world and falling in love with all of its promise. Which made the show feel all-the-sweeter, because of how it honored the canon and vision.\nhttps://gizmodo.com/everything-you-need-to-know-before-watching-the-dark-cr-1837172422\nFor those who haven’t watched yet (why haven’t you watched yet?!), The Dark Crystal: Age of Resistance—which takes place “some time” before the events of the film—centers around three young Gelfling who uncover a shocking secret that the Skeksis are draining Gelfling for their life essence. They find the courage to rise up against them, inspiring their friends and family to do the same. One thing I loved about the show was the time it took to bring our heroes together, giving each of them a few episodes to develop their own personalities and stories. Which one of the three protagonists stood out to you the most?\nJames: Ugh, this is so hard—it’s twee to say, but I genuinely loved all of their journeys, and especially that the series took the time to delve into their individual arcs instead of just smooshing them all together and keeping them that way for much of the show. Push comes to shove, it’s probably a toss-up between Brea and Deet. Brea’s familial drama and her bond with her sisters I thought was beautifully done, and then Deet was just so charming from the get-go, and her story becomes the real dark, bittersweet undercurrent of the season in a way that really intrigued me. But I liked Rian and Hup a lot too! I do wish there was more time with Hup though, he sort of disappears for a bit in the back half. He’s so goofy and fun.\nBeth: Hup is too precious for this world, but not too precious for this show. I wanted more of Hup too. I loved both Brea and Deet…albeit for different reasons. I loved Deet for her earnestness and charm—and also Nathalie Emmanuel’s sweet performance—which made her sacrifice all-the-more heartbreaking. But I feel like Brea had a resolve in her character that the others did not. I think it came from climbing out the shadow of her family’s expectations and forging her own path. Sad to say, I think more needs to be done with Rian. He’s a fine character, and Taron Egerton is trying his hardest, but he’s just not clicking for me yet. Right now, he feels a bit too generic.\nJames: I think it’s because Rian had to bear the load of being the more atypical protagonist—he has to find the sword, fight the fights, be the leader of the resistance, and all that. I think now that they’ve established all that, and they’ve also set out the relationship between him and Deet, he can get a bit of a meatier arc if (or rather hopefully, when) the show gets a second season.\nBeth: Yeah, the showrunners indicated that Brea’s going to be the voice of the resistance, which gives Rian space to find his own voice. Speaking of Brea and her family, I really want to talk about Seladon. I found that character arc to be fascinating, and way deeper and more thoughtful than you’d think would come out of a show like this.\nJames: God, what a journey you go on with her! You hate her, you love her, you feel so sorry for Seladon. It would’ve been so easy for her heel turn to be just that, but to redeem her the way the series does not only felt very timely—in that it is a story arc that’s about making the choice to side with your own oppressor—it felt earned. I was totally expecting the easy way out that Seladon’s journey would be that she sides with the Skeksis and they immediately just bump her off, and her punishment for betraying her people was death. But instead making her live with that decision, and process it as she realizes just how cruel and awful the Skeksis are, and it becoming the strength she needs to side with her sister and the Resistance in the last battle, was extremely well done.\nBeth: When she donned the finery of the Skeksis, modeling herself in their image, I was speechless. The whole thing about the Skeksis is that their bodies are frail, so they adorn themselves in layers of finery and puffed-up armor to make themselves look bigger and more intimidating. Their biggest form of humiliation—since they’re not supposed to kill each other—is to be stripped of their clothing, left weak and exposed. She was scared of being exposed too, but for different reasons than the Skeksis. When they stripped her of her finery, all she was left with was her mistakes.\nJames: Actually, can we pause and just say how good that costume was as a look for Seladon though. The blues! The crown! Fabulous.\nBeth: Oh yeah, Seladon needs to design the looks for the resistance. She knows her stuff.\nhttps://gizmodo.com/the-dark-crystal-age-of-resistance-is-about-climate-ch-1837718902\nJames: But on that point, I’m so glad you said that, because the thing I loved the most was that the deep blue dress underneath it all is what she remains in for the rest of the season after the Skeksis rip the finery off of it—it’s symbolic that she’s changed in some way, she doesn’t go back to those Vapra colours of cool blues and greys. She remains hardened by what she goes through and realizes, but the artifice, all that extra detail, has just been cast away from it. It was a beautiful bit of costume detailing that added to her story.\nBeth: I’m looking forward to seeing how Brea and Seladon’s relationship is handled in the (hopeful) second season.\nOkay, before we get into the technical feats of this show, and oh boy, there are some feats, I do want to chat about the Skeksis for a second…and their performances. I was blown away. Simon Pegg, Awkwafina, Jason Isaacs! The actors were committed to making these Skeksis distinct and terrifying… and in a way where you could actually understand them this time. If I was a kid watching these things, I would’ve hid under the bed by episode three…or whenever they do that creepy thing to The Scientist and take away his eye. Good lord.\nJames: I’m gonna say it, because I can’t not say it…\nbut mmmmmmMMMMMMMMMMMMmmmmmmmmmmmmmm\nBeth: Yes!\nJames: That sound! It’s just perfectly haunting and alien and cruel in a way that sums up the Skeksis so well—Simon Pegg does such a great job of emulating the original voice actor, Barry Dennen, for it.\nBeth: Pegg killed it as The Chamberlain. I know you watched the behind-the-scenes documentary too—which, side note, it’s required viewing—but watching him perform those scenes was inspiring. Any other Skeksis faves?\nJames: Oh, Mark Hamill as The Scientist is definitely the other stand out. But they’re all so good overall! I really appreciated that the show just sort of reveled in how excessive and gross the Skeksis have become even at this point—like, their hedonism by the time of the movie isn’t just something that’s been expounded by their (at that point) victory over the Gelfling, it’s just something that’s always been there, exacerbated by The Darkening.\nBeth: And they even expand into the loner Skeksis, who interact with their vices in other ways. Like the Hunter…and one of my favorites, the Heretic. Played by Andy Samberg, who was channeling some Frank Oz vibes with his performance. Actually, the Heretic is a great segue into talking about the technical feats of this show, because there’s that beautiful exposition scene told as a puppet show within a puppet show.\nWhat were your overall thoughts on the technical achievements of the show? Any favorites? Anything that simply blew you away? For me, it’s Lore the Rock Creature, plain and simple.\nJames: Once again, this is like, the Sophie’s Choice of Age of Resistance. There’s just so many mind-blowing moments with the puppetry going on in this series that you can’t help but be baffled. Lore definitely stands out and like you said, the puppet show-within-a-puppet show. But honestly, the thing that surprised me the most watching the documentary afterward was that at least some of the Arathim were practical puppets. When the trailers were being released I thought they’d all be CG, and were honestly the most jarring aspect of everything they were showing off. But not only did they work in the show, they did such a good job between blending the puppet work and the CG work that I was genuinely astounded by the reveal they had some of them be puppets.\nALSO: Podling butts. That whole sequence with Brea having to work with the order of lesser service to clean dirty podlings had me in stitches.\nBeth: I was just so impressed with how much love you could see went into the work being crafted. When I first interviewed the show creators, they said how, early in the development process, the Jim Henson Company told them how excited they were that the show was going to be announced…because the moment they did, they wouldn’t have to scout for people. The talent was going to come to them. And it did. Some of the best and brightest folks in their fields came together for this project, and the proof is there on the screen. You also have to give all the props to director Louis Letterier, who found a way to frame and film puppets that’s so revolutionary it might become a new industry standard.\nJames: Maybe it’s just because of the way puppets are, and the way they have to navigate these sets, built several feet up off of the ground to hide the puppeteers underneath, but there was an intimacy to the way the show is shot that made you not just appreciate the artistry on hand—because it’s so up close and in your face—but made it feel that much more real. It was an interesting contrast to the movie, which is just jam-packed with sweeping, wide shots of Kira and Jen and the mystics and whatnot traversing Thra. While that was about a lens for the world of Thra itself, the way Age of Resistance is framed focuses it so tightly on the characters that populate it in a way that felt like a very deliberate point of comparison.\nI will say, if I had one tiny critique, I’d hope a potential future season, which will no doubt be filled with more fighting now that the resistance has truly been formed, is that there’s a little less shaky-cam in the action sequences. I get why it’s done—you have to hide a little bit that these puppets are clashing swords with each other in a way that doesn’t necessarily look like the most lavish fight scene in the world. You’re not gonna get the Daredevil hallway fight with a puppet (although I’d not be surprised to see this immensely talented team prove me 100 percent wrong!). But the shaky-cam got so severe at points it felt less more like it was conveying a hectic feeling and more like obfuscating the puppetry. That’s the closest I honestly have of a critique of the show, frankly. The bits where I couldn’t see the puppets as well! Give me more lavish close-ups of latex fantasy creatures!!!\nhttps://gizmodo.com/the-dark-crystal-age-of-resistances-creators-and-write-1837404160\nBeth: That is going to be a challenge moving forward. As the resistance grows, so will the number of characters…and therefore, the number of puppets. And the type of conflict they’re engaged in. The scale is only going to increase from here on out—and if I have a worry about it getting another season, it’s that it’s already too big an endeavor for Netflix to agree to again. That said, I really want it to get another season…and given the glowing response, I feel it’s possible. Where do you want to see the series go in the sophomore season? What stories are you most most looking forward to growing?\nJames: If Netflix don’t give us more Gelfling goodness, well, then I need a dual glaive of my own to lead a resistance against them!\nI think going forward beyond the actual resisting itself, I’m most interested in seeing two things: I want to see what they have planned for Hup because I think keeping him entwined with the Heretic and the Archer for the back half of the season was intentionally intriguing. And I want to see Deet’s descent with the darkening explored because we get those very cool flash-forwards of her sitting on the throne in the castle, and Rian seemingly doing what Jen does at the climax of the movie, and I want to see all that unfold for myself. I don’t think there’s a less in this instance: it was all so well done here that I just…want more. Give me more, please.\nBeth: I feel like some pieces are being laid out, giving hope that the situation in the movie was not the entire story and that some Gelfling survived the coming genocide. For example, the alliance with the Arathim that have reclaimed the caves of Grot, or the fact that one Gelfling clan lives beyond the sands that they make sure to point out cannot be crossed. How would the Garthim reach them all? If the series does, in a sense, reinterpret or “ret-con” the movie to have some Gelfling survive, how would you feel about that?\nhttps://gizmodo.com/a-spoiler-filled-chat-with-dark-crystal-age-of-resista-1837707946\nJames: I think I’d be fine with that, honestly. Not only does it give them more avenues to explore should there ever be more Dark Crystal beyond this (well, in the medium of TV or film, there’s already been more thanks to the books and comics!), but I don’t think having more survivors beyond Jen and Kira takes away from the desolation of the movie, or even the hopeful tone of this series—if anything, it gives them the chance to embolden that hope, if there’s still some Gelfling out there after everything Jen and Kira ultimately go through. Thra’s a big place, after all!\nBeth: Yeah, and incest (between Jen and Kira’s possible kids) is so not cool.\nJames: Very glad we could clear that up. Gelfling incest: Bad. Dark Crystal: Age of Resistance: Good! Probably my favorite TV series of the year, frankly.\nBeth: Same. I didn’t expect to love this show as much as I did or fall in love with the wider world it encompasses. I even talked with my dad about the show yesterday, and he is not a fantasy guy. I’m so happy the show has been so well received, and that a lot of people are coming together to celebrate a great piece of art. One that I honestly think will have just as much an impact as the original movie, if not more so.\n“mmmmMMMMMmmmmm. Chamberlain love praise. Eat it up with spoon.”\nFor more, make sure you’re following us on our new Instagram @io9dotcom."
    },
    {
      "url": "https://gizmodo.com/everything-you-need-to-know-before-watching-the-dark-cr-1837172422",
      "text": "Another world, another time, in the age of wonder. The Dark Crystal finally returns with a prequel series, The Dark Crystal: Age of Resistance. The Jim Henson Company has been cautious about expanding the lore of ‘80s classic The Dark Crystal, only authorizing a couple of books, some graphic novels, and a canceled manga. But those few pieces, along with the film, tell a deep and complex saga.\nThe Dark Crystal is a fantasy story about Jen, a Gelfling who’s tasked with restoring balance to the world of Thra by repairing the titular Dark Crystal, which had lost a shard a thousand years ago. During his quest, he comes across the only other surviving Gelfling, a young female named Kira, and together they fight the evil Skeksis and save the world. It was a sweet story set in a rich and detailed world and featured some of the greatest puppetry feats in film history.\nFinding myself curious about the larger world of Thra before diving into Age of Resistance, I pored over some of the expanded lore (except for The World of the Dark Crystal, as it’s out-of-print and come on guys I’m not made of money that’s what the encyclopedia is for). What I found was a deep and beautiful world that most of us don’t realize exists, because all we know is that one movie that came out when we were kids. The Dark Crystal universe is full of amazing myths, powerful legends, and of course Fizzgig, the fuzzy lovable icons of love.\nhttps://gizmodo.com/dark-crystal-age-of-resistance-shared-a-behind-the-sce-1836362148\nI’ve pared it down to some of the most interesting facts and mythology of Thra, to help get you ready for Age of Resistance (feel free to comment with your favorite details). This includes the surprising importance of Aughra, how the Skeksis and urRu came to be, and whether that weird rock child will matter in the new show. Spoilers: probably not.\n[Editor’s Note: If you’ve only seen the 1982 film, a lot of this information will be new to you! – Jill P]\nThra\nThra is the world where The Dark Crystal is set (it was originally called Mithra, but Henson shortened it after learning that was the name of the Iranian god of light). It’s described as a lush and diverse world, designed to exist in perfect balance because of the crystal. There are no other known planets in Thra’s solar system, although there are countless universes (and crystals) outside of it.\nIn the mythology of Thra, the world started with a song—the idea being that the word “universe” means uni (one) and verse (song)—which started a fire that created the three suns Thra rotates around: the Great Sun, the Rose Sun, and the Dying Sun. From there came a single planet, with a powerful crystal at the center of it, deep underground. The crystal was the heart of Thra and the source of all life, and every living thing was connected to it.\nAughra\nIn The Dark Crystal, Aughra is presented as a Yoda-type figure who lives in isolation and gives Jen the help and motivation he needs to complete his quest. But Jen not recognizing her name in The Dark Crystal is kind of tragic because there is so much more to the character of Aughra, who is returning for Age of Resistance. In short: Aughra is Thra’s closest thing to a god.\nThe graphic novels describe her as the Great Mother. The planet and its crystal created her out of a tree thousands of years ago to bring knowledge, language, and understanding to the many races of Thra. Aughra was revered, though not worshipped. Just like Adam in the Bible, she traveled the world revealing the names of every rock, tree, and creature that inhabited it. She took a special liking to the Gelfling, and taught them how to farm, hunt, and build a society, as well as more complex subjects like the nature of death. In exchange, the Gelfling taught Aughra how to dreamfast (which I’ll explain in a bit).\nAfter completing her journey across Thra, Aughra chose to focus on astronomy. She would spend time crafting detailed planetary trajectories to predict future events. For 1,000 years, everything was in balance. This time was known as the Age of Innocence.\nGelfling\nThe Gelfling are Thra’s version of humans, and they are the most advanced beings on the planet—although there are other intelligent beings native to the world with their own languages and societies, like the Podling. Gelfling are described as kind, non-violent, and pretty naïve, as they tend to be too trusting of others and hand over power accordingly. This comes into play with how they come to trust and even revere the urSkeks, and later the Skeksis.\nThe Gelfling society is matriarchal, with each clan being ruled by a female leader called a Maudra. During the 1,000-year Age of Harmony, which happened between the first and second Great Conjunction (more on that in a bit), there were many different clans. By the time of The Dark Crystal: Age of Resistance, the Gelfling had seven under the rulership of the All-Maudra, who was chosen by the Skeksis. Before the events of the movie, the Skeksis had killed nearly all the Gelfling, save for Jen and Kira.\nhttps://gizmodo.com/taron-egerton-lisa-henson-on-finding-hope-in-the-melan-1836558654\nThere are two things that make Gelfling distinct. First is that females have wings and the ability to fly, while males do not. It’s not clear when or how Gelfling women got wings, although there is a legend that Aughra gifted the first pair to a young woman who sought her aid. The other is their ability to dreamfast, which is the act of sharing memories and dreams through touching hands. It’s believed this was connected to a larger dream world they shared with each other and Aughra.\nSkeksis and urRu\nOne-thousand years before the events of The Dark Crystal, a mysterious group of people called the urSkeks were split apart when the crystal lost its shard and turned dark. This was called the Great Division and set in motion the millennia-long Age of Division.\nThis event turned the 18 ukSkeks into two races: the wise and gentle Urru, and the terrible Skeksis. This represented their good and evil natures splitting apart, with parallels to the id and super-ego. The races remained spiritually connected, as they were two parts of the same whole, and the injury or death of one creature instantly affected its counterpart. At the time of The Dark Crystal, there were only 10 beings left on each side.\nThe Skeksis serve as the main villains of the film, having taken control of the crystal and established themselves as rulers of Thra. They look like a mix between vultures and crocodiles and were designed to represent the Seven Deadly Sins. Their bodies are small and frail, so to make themselves look bigger they adorn themselves with extravagant furs, feathers, and other finery. Their headpieces are usually made from the bones or body parts of creatures, to show their dominance and cruelty.\nhttps://gizmodo.com/the-new-dark-crystal-trailer-is-somehow-even-more-gorge-1837204098\nThe Skeksis used the Dark Crystal’s powers to keep themselves young but eventually, it stopped working. So, they turned to sacrificing creatures like the Gelfling and Podling to the crystal, using it to steal their life essence. Around 200 years before the events of the film, the Skeksis learned of a prophecy that a Gelfling would reunite the shard and save the world. Desperate to hold onto power, they created the crab-like creatures called Garthim and started the Garthim War, which killed almost all the Gelfling and decimated their society.\nThe urRu lived in seclusion and awaited the day they could reunite their bodies with the Skeksis and become whole beings once again, which happens at the end of the film.\nThe urSkeks and Raunip\nOkay, so this last entry is where things get complicated, as it’s unclear how much of this history will come into play in Age of Resistance. But I’m going to give it to you anyway—not only because knowledge doesn’t hurt but also because it’s weird as hell.\nSo, Aughra had a rock son who was basically Jesus.\nThe graphic novel series The Dark Crystal: Creation Myths—by Brian Holguin, Brian Froud, Alex Sheikman, and Lizzy John at Boom Studios—is told from the perspective of Raunip, Aughra’s son, who was formed from an alien material that fell from the sky. This happened right around the time of the first Great Conjunction (a total eclipse), about 2,000 years before the events of the film, which saw the arrival of the urSkeks. That’s right: The urSkeks were aliens.\nSpecifically, the urSkeks were hyper-intelligent beings whose people held an advance knowledge of Thra’s crystal and all the other crystals throughout the known universe. These 18 urSkeks had been kicked out of their society for “heresy” and chose to settle on Thra, as it was a primitive planet they thought they could improve…getting them back into the good graces of their own homeworld. Side note: Their arrival caused Aughra to lose one of her eyes, as she was blinded by the crystal’s power they wielded.\nThe urSkeks served as guardians of the crystal for 1,000 years, during the Age of Harmony. During that time, they gave Aughra the observatory she could use to explore the cosmos, which led her to ignore the needs of Thra for decades at a time. The urSkeks also helped the Gelfling advance their society and culture. In return, the Gelfling grew to revere the urSkeks, with some of them worshipping them as proto-gods. This kind of explains why the Gelfling trusted the Skeksis against better judgment, as they were used to following the ukSkeks.\nHowever, there was one person who had a big problem with the urSkeks: Raunip. You see, he had the ability to see a side of the urSkeks that no one else could—they had a divided nature they were having trouble controlling—and he was the one who learned of their banishment. He tried to convince the Gelfling to reject them as outsiders who were trying to change their way of life, even going so far as to pelt one of them with rocks.\nIn response, the urSkeks announced they were ready to go home during the next Great Conjuncture. Sadly, they failed. One of the urSkeks had darkness in their heart, leading the crystal to reject all of them. This is the moment the crystal shattered, the world fell out of balance, and the urSkeks were divided into two races. Both Raunip and Aughra witnessed this and saw firsthand how evil the Skeksis were when they savagely killed an urRu and seized control of the crystal.\nThe pair spent decades underground trying to find the lost shard amid a pile of crystals, to return to a world that had largely forgotten about them. Aughra ended up losing some of her memory, hence why she didn’t warn the Gelfling about the evils of the Skeksis. Raunip ended up leaving everything behind to help some of Thra’s displaced creatures find a new home. It’s unclear if he’ll be part of Age of Resistance.\nIt’s been decades since The Dark Crystal first came out, but in some ways, it feels like this world is just beginning. There are so many places for this story to go just based on all the fantastic places it’s been. I don’t know about you, but I’m looking forward to seeing the next chapter in the history of Thra.\nThe Dark Crystal: Age of Resistance arrives on Netflix August 30.\nFor more, make sure you’re following us on our new Instagram @io9dotcom."
    },
    {
      "url": "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
      "text": "The DC Extended Universe is finally giving Marvel a run for its money—something that’s bound to increase now that James Gunn is running the show. The DCEU’s myriad projects stretch far beyond superhero mainstays Batman, Superman, and the Justice League, promising to include new and interesting takes on DC Comics’ enormous stable of characters.\nWhat follows is an up-to-date list of everything DCEU-related that’s on the way: DC movies heading to theaters, as well as DC streaming movies and shows coming to Max.\nLast updated 8/23/2023.\nWhat’s the next DC Movie?\nAquaman and the Lost Kingdom\nRelease date: December 20 (in theaters)\nDirector James Wan returns for the next adventure following Arthur Curry (Jason Momoa) as the newly crowned King of Atlantis. Now in his new role, Arthur will explore more of the world under the sea while also dealing with new threats from Black Manta (Yahya Abdul-Mateen II) and others. Like Shazam 2, Aquaman 2 has endured its share of release-date changes, with its new Christmas 2023 date designed to give Wan and company ample time to complete all the necessary special effects.\nUpcoming DC Movie Release Dates\nJoker: Folie à Deux\nRelease date: October 4, 2024 (in theaters)\nTodd Phillips never saw his Joker movie as anything but a singular film. But over a billion dollars at the box office and an Oscar for Best Actor (for star Joaquin Phoenix) obviously changed things. We have a few nuggets of info so far: the title is Joker: Folie à Deux(French for “shared madness”), Phoenix is returning and will co-star with Lady Gaga (who’s playing Harley Quinn), Zazie Beetz is probably returning as Arthur Fleck’s neighbor, and… it’s likely going to be a musical? Filming wrapped in early April 2023.\nThe Batman 2\nRelease date: 2025 (in theaters)\nHot off the success of Matt Reeves’ long-awaitedThe Batman, everyone involved made it clear that wasn’t a one-and-done. Robert Pattinson’s Batman will be back. Will he face off with the Joker? It’s possible but not definitive. You’d imagine the Penguin and Catwoman could be back too. We don’t know much yet about this one, but we do know it won’t be arriving until 2025.\nCurrent DC Shows\nDoom Patrol Season 4, Part 2\nRelease date: TBD 2023 (on Max)\nThe fourth and final season of Doom Patrol—starring Brendan Fraser, Matt Bomer, Diane Guerrero, April Bowlby, Joivan Wade, Timothy Dalton, Skye Roberts, and Michelle Gomez—already aired its first batch of episodes; the remaining six will return later this year.\nUpcoming DC Movies and Shows Without Release Dates\nThe Penguin\nRelease date: Unknown (on Max)\nYou saw him in The Batman and now, Colin Farrell’s Penguin is getting his own Max series. As of April 2023, the show is in production, with a cast that also includes Cristin Milioti, Rhenzy Feliz, Michael Kelly, Shohreh Aghdashloo, and Deirdre O’Connell, with Clancy Brown and Michael Zegen recurring.\nPeacemaker Season 2\nRelease date: Unknown (on Max)\nFrom the instant that opening credits scene rolled for the first time, DC fans and non-fans alike fell in love with Peacemaker. Well, he’s coming back, still played by John Cena and still from the twisted mind of James Gunn. There’s no word on when it’ll happen but we’re guessing 2024.\nSuperman: Legacy\nRelease date: July 11, 2025\nJames Gunn will write and direct this Superman movie, which is touted as not being an origin story. Casting announcements started with Clark Kent/Superman and Lois Lane, who’ll be played by David Corenswet and Rachel Brosnahan. We also know Isabela Merced will play Hawkgirl, Edi Gathegi is Mister Terrific, and Nathan Fillion is a Green Lantern (Guy Gardner), as well as Anthony Carrigan as Metamorpho.\nMore Upcoming DC Movies and Shows Announced for the Gunn/Safran Era\nThe shake-up at DC Studios got a huge zap of energy at the end of January, when James Gunn and Peter Safran announced their massive slate of planned projects. Little is known about most of these projects so far in terms of cast and crew and even release dates—but we do have a few tidbits for each.\nCreature Commandos (An animated Max show) – A seven-episode animated series written by James Gunn himself. It stars Indira Varma (Obi-Wan Kenobi, Game of Thrones) as the Bride, who’s the lead character, and Marvel veteran Frank Grillo as Rick Flagg Sr.—father of Rick Flagg, played by Joel Kinnaman in The Suicide Squad. The rest of the cast includes David Harbour (Stranger Things) as Eric Frankenstein, Sean Gunn (Guardians of the Galaxy Vol. 3) as G.I. Robot, Zoe Chao (The Afterparty) as Nina Mazursky, Alan Tudyk (Star Wars: Rogue One) as Dr. Phosphorus, Maria Bakalova (Guardians of the Galaxy Vol. 3) as new character Princess Ilana Rostovic, and Peacemaker’s Steve Agee and Sean Gunn returning as John Economos and Weasel, respectively.\nWaller (A live-action Max show) – Viola Davis will reprise her Suicide Squad character; the story will bring back characters from the Peacemaker show and tell a story with events set between Peacemaker seasons one and two.\nLanterns (A live-action Max show) – Set on Earth, this mystery series will follow Hal Jordan and John Stewart doing their thing as DC’s “super cops.”\nThe Authority (Theatrical film) – The Wildstorm superhero characters will make their big-screen debut in a film co-written by Gunn.\nParadise Lost (A live-action Max show) – How did Wonder Woman’s world, Themyscira, come to be? Find out in this Game of Thrones-ish tale set before her birth.\nThe Brave and the Bold (Theatrical film) – Based on the acclaimed Grant Morrison comic run, this will explore the story of Batman’s son, Damien Wayne, and will feature “other members of the extended Bat-family.”\nBooster Gold (A live-action Max show) – The “loser from the future” superhero character gets his own series.\nSupergirl: Woman of Tomorrow (Theatrical film) – Based on Tom King’s comics run, this movie will explore how Supergirl is different from Superman. It’s not yet certain if Sasha Calle, who plays Supergirl in The Flash, will reprise the role here.\nSwamp Thing (Theatrical film) – The character’s “dark origins” will be the focus of this one. DC does horror! Rumored but not yet confirmed to be directing, James Mangold (Indiana Jones 5) told Collider that he’s slated to write the script.\nUpcoming DC Movies and Shows That Were Once in Development, But Whose Fate Is Unclear in the Gunn/Safran Era\nTa-Nehisi Coates and J.J. Abrams’ Superman movie\nRelease date: Unknown (in theaters)\nThe news of Superman: Legacy cast uncertainty on this project from writer Ta-Nehisi Coates and producer J.J. Abrams. There hadn’t been an update on this one in a while, but in late April, James Gunn himself told io9 that the two films don’t necessarily cancel each other out: “That’s an exciting movie … if it comes in and it’s great … and if the timing is right, that could absolutely happen. That’s totally unrelated. It would be an Elseworlds tale like Joker.”\nMichael B. Jordan Superman Series\nRelease date: Unknown (for Max)\nMichael B. Jordan was once developing a Superman take for Max as a limited series that would feature Val-Zod as opposed to Clark Kent. Again, there hasn’t been an update in a while.\nStatic Shock\nRelease date: Unknown\nPart of the relaunch of the Milestone comic brand is this adaptation produced by, once again, Michael B. Jordan. A writer was hired back in 2021 to come up with a script and we haven’t heard much since.\nJustice League Dark\nRelease date: Unknown (for Max)\nJ.J. Abrams was among the people involved with bringing this evil super-team to life and while there hasn’t been a ton of movement on the project of late, it’s been around long enough that we’d imagine it happens eventually.\nMetal Men\nRelease date: Unknown\nOne of the more recent pre-Gunn/Safran DC films to go into development, this is this tale of six beings based on various powerful metals. It’s from directors Ron Clements and John Musker (Aladdin, The Little Mermaid, and Moana), so if it happens, it’ll have an incredible pedigree.\nZatanna\nRelease date: Unknown\nLast year, Emerald Fennell won an Oscar for writing Promising Young Woman. She followed that up landing the job to write this DC superhero flick about the young magician. Like most of the films in this section, there hasn’t been movement in a while.\nHourman\nRelease date: Unknown\nYes, the hero who takes a drug that makes him a hero for an hour was, back in 2021, rumored to be in development. Whether or not that’s still the case is unknown but we figured it was worth noting.\nUntitled Arkham Show\nRelease date: Unknown (on Max)\nIn addition to The Penguin, Matt Reeves has said he plans to expand the world of The Batman into Max shows. At one point, a series about Gotham PD was in the works, but now he says it might be more about the inner workings at Arkham Asylum. On October 25, The Staircase’s Antonio Campos came aboard as a writer—the third to hold that position on the potential series so far—and may direct and serve as showrunner if the show happens, according to a report in Variety.\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://www.fathomentertainment.com/releases/the-dark-crystal-2025/",
      "text": "The Dark Crystal\nAnother world, another time… in the age of Wonder. From genius filmmaker Jim Henson comes The Dark Crystal, a masterful live-action fantasy starring some of the most imaginative creatures ever put on film. Many years ago, the mysterious Crystal was cracked and an age of chaos began, led by the evil race of Skeksis who rule over the land of Thra. Meanwhile, raised in solitude by a gentle race of creatures called the Mystics, the Gelfling orphan Jen is sent on a quest to find the missing shard that will heal the Crystal and restore balance to the universe. This special screening is part of The Jim Henson Company’s 70th anniversary celebration and features an introduction from Brian Henson, Jim Henson’s son and Chairman of the Board of The Jim Henson Company."
    },
    {
      "url": "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
      "text": "At a Glance:\nDoctor Who ended the eras of both Chris Chibnall as series showrunner and Jodie Whittaker as the 13th Doctor in 2022 with “The Power of the Doctor,” bringing to a close a three-season, three-special run.\nWhittaker’s replacement is returning star David Tennant. He will play the official 14th incarnation of the Doctor under returning showrunner Russell T. Davies, who revived Doctor Who in 2005 and managed the series until 2009.\nTennant will appear in three specials in November 2023 to coincide with the 60th anniversary of Doctor Who on November 23.\nHe’ll be joined by returning characters Donna Noble and Wilfred Mott, who were played by Catherine Tate and Bernard Cribbins in season four of Doctor Who. Neil Patrick Harris will play a new villain, while Heartstopper’s Yasmin Finney will play a character named Rose.\nTennant will be succeeded by Sex Education’s Ncuti Gatwa as the 15th Doctor. His announcement in May 2022 makes him the first Black male actor to play the character on-screen.\nGatwa will star in Doctor Who’s 14th season, set to air some time in 2024.\nMillie Gibson will co-star as the 15th Doctor’s companion.\nGame of Thrones star Indira Varma will play a mysterious character known as “the Duchess.”\nDoctor Who’s beloved tradition of doing a Christmas Special—no more New Year’s Day Specials, in other words—will return in 2023, with another confirmed for 2024.\nComedian Sooz Kempner will star in Doom’s Day, a new transmedia Doctor Who campaign tied into the anniversary. She’ll play Doom, the titular intergalactic assassin, who has found herself hunted by Death itself—and must use a purloined vortex manipulator with a day’s worth of time-jumping charge to find the Doctor and save herself.\nThis post was last updated 5/30/23.\nWhat’s Been Going on in Doctor Who?\nThree Doctor Who specials aired out the last days of Jodie Whittaker’s time as the Doctor in 2022. “Eve of the Daleks” saw the Doctor and her companions Dan (introduced in the prior 13th season, known as Doctor Who: Flux) and Yaz facing the titular iconic monsters in a time loop paradox. “Legend of the Sea Devils” revived the classic ‘70s monsters for a new adventure, while “Power of the Doctor” saw the 13th Doctor face off against the Master in an adventure that ultimately saw her mortally wounded, returning her companions to contemporary Earth while she regenerated into a new body.\nWhy Is David Tennant the Doctor Again? Is David Tennant Playing the 10th Doctor?\nWhittaker regenerated not into previously announced new Doctor Ncuti Gatwa, but David Tennant, who played the official 10th incarnation of the Time Lord from Christmas 2005 to New Year’s Day 2010, before reprising the role for Doctor Who’s 50th anniversary special, “The Day of the Doctor,” in 2013.\nWhile this marks his first return on-screen in the series since then, Tennant will not be playing the 10th Doctor, but the official 14th incarnation—and the character will be aware that they are both using a familiar form and are a new entity. Aside from the fact that Tennant is arguably the most popular actor to take on the role, so bringing him back for the 60th anniversary makes sense, there’s plenty of reasons Doctor Who can come up with as to why the Doctor’s regenerative process decided to re-use an old identity, more of which you can read about here.\nWhen Will Doctor Who Return in 2023?\nDoctor Who will return for three special episodes in November 2023, set to air in celebration of the series’ 60th anniversary.\nWhat Is Doctor Who’s 60th Anniversary Special About?\nAside from Tennant returning as the Doctor, he’ll be joined by former companions Donna Noble and Wilfred Mott, played by Catherine Tate and Bernard Cribbins (the actor’s last role prior to his passing in July 2022) in Doctor Who’s fourth season. Donna exited the series as a regular character after an adventure lead to her needing to have her memory wiped by the 10th Doctor, forgetting her time alongside him lest her mind face grievous harm, so just how Donna will play into the the story remains to be seen.\nThe Doctor and Donna will face a mysterious new adversary, played by Neil Patrick Harris, and will be joined in the specials by Yasmin Finney as a new character named Rose. How Finney’s Rose might connect to the other famous Rose of Doctor Who, Billie Piper’s Rose Tyler, also remains to be seen.\nIs There a Trailer for Doctor Who’s 60th Anniversary?\nThe first premiered at the end of “The Power of the Doctor,” and you can watch it above. The second premiered in December and you can watch it here:\nWhen Will Ncuti Gatwa Become the Doctor?\nGatwa is briefly seen in the trailer for Doctor Who’s 60th anniversary, so will presumably follow the long tradition of new Doctors appearing in the final moments of their predecessor’s last episodes to become the 15th Doctor. The BBC has announced that Gatwa will appear as the Doctor first “over the festive season” in 2023, before he takes over full-time in a new season of the show after that.\nIs There a Doctor Who Season 14 Release Date?\nThere’s no current release date for season 14 of Doctor Who, but it is expected to be broadcast some time in 2024.\nWhere Is Doctor Who Streaming in the U.S. and UK?\nCurrently, the first 13 seasons of the revived Doctor Who are streaming on the BBC iPlayer in the UK; in the U.S., the revived series streams exclusively on HBO Max. In both countries, episodes from the classic era of the show are available through Britbox.\nThis will change in 2023, at least in the U.S. The BBC and Disney have announced that as part of a new deal, Doctor Who will stream exclusively worldwide on Disney+, except for in the UK and Ireland, where it will still stream on the BBC iPlayer and BBC One. It’s currently unknown if this will affect Doctor Who’s place on BBC America, where it currently airs in the U.S..\nDoes Disney Co-Own Doctor Who Now?\nA report in the wake of the BBC/Disney announcement from British paper the Telegraph alleged that the deal will also see Disney contribute finances to help create the show, and while the series’ creative team will still hold control of the series primarily, the deal will allow Disney some level of say in the creative decisions for the series—as well as allowing access to talent or “cinematic production moments” previously inaccessible due to the BBC’s budget for the show.\nNone of this has been confirmed by the BBC, however. The announcement strictly focused on Disney’s acquisition of Doctor Who’s streaming rights, and did not mention any co-owning. The new era of the series will be made for the BBC by Bad Wolf Studios, created by former Doctor Who producer Julie Gardner and former BBC Controller of Fiction Jane Tranter—which is now owned by Sony Pictures Television, after the studio took a majority stake in Bad Wolf in December 2021. The series was previously made by BBC Studios directly.\nIn January, Davies did say that Doctor Who is now working with a bigger budget, telling GQ that Disney’s involvement came about as part of “the BBC’s notion to go for a streamer to invest in the show worldwide … We’re not on the budget level with Star Wars and the Marvel shows, [but] it’s better than it was … We’re not allowed to talk about budget… but it’s more than I’ve ever had to work with.”\nWant more io9 news? Check out when to expect the latest Marvel,\nStar Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about James Cameron’s Avatar: The Way of Water."
    },
    {
      "url": "https://gizmodo.com/reminder-the-dark-crystal-age-of-resistance-is-a-stone-cold-masterpiece-2000574613",
      "text": "The Dark Crystal: Age of Resistance is one of the greatest fantasy adventures of all time. An absolute masterpiece. We say that full well knowing that, these days, hyperbole is way too common. Words meant for maximum impact get thrown around much too easily. But, in this case, we mean it exactly as it’s intended. “All time.” “Masterpiece.” We are so emphatic about it, in fact, that we’re making the statement now, just randomly. Not on an anniversary. Not for any real reason. Just today, right now, because we recently rewatched the series on a whim and its magic infected us with the deep need to praise it from the mountaintops once again.\nReleased by Netflix in 2019, Age of Resistance is a 10-episode prequel series to the Jim Henson/Frank Oz 1982 film, The Dark Crystal. That film wasn’t a big hit when it was released but in the decades that followed gained a large fan following. Enough of a following that a team of obvious superfans (such as showrunners Jeffrey Addiss and Will Matthews as well as director Louis Letterier) were able to mine bits and pieces from the lore of the original film and expand it into a story that’s richer, more exciting, and more beautiful than the film in every single instance. It was made in conjunction with the Jim Henson Company and uses some of the most incredible puppetry the world has ever seen. We here at io9 praised it to the skies when it was released, named it our favorite television show of the year, and also had the unfortunate job of breaking the news of it not returning for a second season.\nThe first season is set hundreds of years before the events of the movie, focusing on the inhabitants of the planet Thra finding out that their rulers, the Skeksis, are pure evil. Lead by a ragtag group of Gelfling from various tribes, the beings of Thra band together, rise up, and start the titular “Age of Resistance” against the Skeksis. Within that overarching story, you get everything you want from an epic story like this. Every character is multifaceted. The action is rousing and important. And seemingly every choice, from the sets to the music to the camerawork, all come together to create an incredible, sweeping, emotional journey filled with wow moments.\nAll of which is hugely bolstered by its medium. At each turn, the puppetry in Age of Resistance adds an undeniable, tangible quality that blankets everything with glorious artistry. Forty years removed from the work of the already impressive original, here there are more creatures with more details and, most importantly, more evocative expressions. Much like you’d expect from a great actor, you can see every nuance in the performance of each puppet. Subtle changes to their faces. Their arms. All of which are given life by—again without hyperbole—one of the greatest voice casts ever assembled\nSeriously—we’re just going to list the names, and you will be amazed: Taron Egerton, Anya Taylor-Joy, Nathalie Emmanuel, Simon Pegg, Mark Hamill, Jason Isaacs, Benedict Wong, Gugu Mbatha-Raw, Andy Samberg, Helena Bonham Carter, Harris Dickinson, Hannah John-Kamen, Keegan-Michael Key, Ralph Ineson, Awkwafina, Eddie Izzard, Toby Jones, Lena Headey, Alicia Vikander, Natalie Dormer, Mark Strong, Theo James, Bill Hader, and Sigourney Weaver, to name quite a few. So yeah, an impressive list. And, while each of those names is pretty big on its own, they’re all given equal credit for the characters along with the puppet performers, which is very cool. Names like Henson icons Dave Chapman, Kevin Clash, Louise Gold, Alice Dinnean, and many others.\nThe problem with all this is the same thing great animation runs into. Because of the medium, many people choose to ignore the show or dismiss it as made for kids. Age of Resistance is okay for some kids but it’s also very, very dark. The main crux of the show is that the Skeksis decide to drain the essence of the Gelfling in order to stay alive. So we see multiple scenes of characters having the literal life sucked out of them before exploding. There are also horrific deaths, disgusting violence, and lots of very messed-up psychological warfare. None of which you’d expect if you made assumptions based on the medium. In fact, this puppet show is probably more adult than most of the live-action shows put on television week to week.\nIt’s certainly darker than something like Peter Jackson’s Lord of the Rings films, a series that’s probably considered the gold standard for modern fantasy on film. And yet, Age of Resistance is seemingly as impressive, if not more so, on almost every level. The depth of storytelling, the care of worldbuilding, the level of craft put into the filmmaking, etc. It also, like the Lord of the Rings, makes its source material better. Where Lord of the Rings was an epic sequel to The Hobbit, expanding and enriching that already beloved story, Age of Resistance vastly improves onThe Dark Crystal, adding layers upon layers of subtext and meaning.\nThe only bad thing about Age of Resistance is that it was a show clearly meant to run longer than one season. The existing season has a very satisfying ending with the creatures of Thra, lead by the Gelfling, finding the key to defeating the Skeksis and healing Thra. When things pick up at the beginning of the film though, hundreds of years later, all the Gelfling in the world have been wiped out and the key has been lost. Which is a very depressing thought considering the show ends with seven kingdoms of Gelfling teaming up to take back their world. Clearly, not only aren’t they successful, they’re presumably victims of genocide. What happened? We’ll, unfortunately, never know.\nOr will we? When io9 spoke to executive producer Javier Grillo-Marxuach and others in 2019 he said “We have built our narrative very much with an endpoint that addresses the fate of the Gelfling in the film, why the film is the way it is, and what has happened to them. But, again, to get too deep into it would be to spoil our future plans. If we don’t get a second season I’ll tell you everything.” Hey Javier, we’re still waiting!\nBecause, as we know, there isn’t going to be a second season of Age of Resistance. Netflix decided to only do one season of this gem because it was certainly very expensive and not enough people watched. Which is a shame because, if you didn’t see it, you’re truly missing out. Right now, you’re paying for and not watching a true all-time classic. A series made with such passion and care that it gets better and better the more you think about it. A show that deserves to be held up with all your favorite epic franchises: Star Wars, Star Trek, Lord of the Rings, Planet of the Apes, Alien, Game of Thrones, all of it. And yes, it’s so good that we’re telling you this on a random week six years after release. It’s one of the best things the Jim Henson Company has ever done, it’s one of the best things Netflix has ever done, and one of the best things you’ll ever do is watch it, whether you’ve seen it before or not.\nThe Dark Crystal: Age of Resistance is, thankfully, still on Netflix. Watch it here. You will not be disappointed.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/dark-crystal-age-of-resistance-has-been-canceled-by-ne-1845132612",
      "text": "The story of Thra on Netflix is over. io9 has exclusively confirmed the streaming service has chosen not to renew The Dark Crystal: Age of Resistance, meaning the series has come to an end after only one season.\nOver a year after the series first debuted on the streaming service, the Jim Henson Company CEO and executive producer Lisa Henson and Netflix shared with io9 that there will not be another season of Age of Resistance, the groundbreaking series based on Jim Henson’s fantasy film. In a statement, Henson thanked fans for their support and said they’re looking for other ways to continue the story.\n“We can confirm that there will not be an additional season of The Dark Crystal: Age of Resistance. We know fans are eager to learn how this chapter of The Dark Crystal saga concludes and we’ll look for ways to tell that story in the future. Our company has a legacy of creating rich and complex worlds that require technical innovation, artistic excellence, and masterful storytelling. Our history also includes productions that are enduring, often finding and growing their audience over time and proving again and again that fantasy and science fiction genres reflect eternal messages and truths that are always relevant. We are so grateful to Netflix for trusting us to realize this ambitious series; we are deeply proud of our work on Age of Resistance, and the acclaim it has received from fans, critics and our peers, most recently receiving an Emmy for Outstanding Children’s Program.”\nhttps://gizmodo.com/a-spoiler-filled-chat-with-dark-crystal-age-of-resista-1837707946\nNetflix also released a statement to io9, congratulating the series on its Emmy win and thanking the folks behind the scenes for creating the show:\n“We are grateful to the master artists at the Jim Henson Company for bringing The Dark Crystal: Age of Resistance to life for fans around the world. We’re thankful to the executive producers Lisa Henson and Halle Stanford, and Louis Leterrier, who also directed all episodes, as well as the writers, cast and crew for their outstanding work and thrilled they were recognized with the Emmy this weekend.”\nThe Dark Crystal: Age of Experience debuted on Netflix in August 2019. Directed by Louis Leterrier, the series boasted a star-studded cast and industry-changing puppetry technology—as showcased in Netflix’s behind-the-scenes documentary, The Crystal Calls. The first season ended on a cliffhanger, with the crystal shard being discovered and the clans of Thra finally uniting against the Skeksis. The showrunners previously told io9 they pitched the entire story to Netflix and know how they want it to end, but 13 months later the show’s future was still up in the air.\nNetflix is no stranger to canceling shows, but the network is normally pretty quick to let us know whether or not a series has a future on its platform. While looking at 12 sci-fi, fantasy, horror, and comic book series that Netflix declined to renew over the past two years, I found that, on average, they were canceled within one to six months of their final season’s debut. Some of them, like Jessica Jones and Chilling Adventures of Sabrina, were told they were canceled before their final seasons aired. The longest delay was Mystery Science Theater 3000, which was canceled just over one year after “The Gauntlet” episodes debuted.\nhttps://gizmodo.com/dark-crystal-age-of-resistances-puppets-were-saved-fro-1840860444\nIt’s unclear why exactly the series wasn’t renewed, but some have speculated on the delay and related issues. Reported behind-the-scenes drama indicates that the series was considered a miss for the streaming platform, with a source telling the Hollywood Reporter earlier this month that Age of Resistance’s failure was one of the reasons Netflix recently pushed out longtime executive Cindy Holland, who helped bring the series to life. The series was referred to as an “expensive disappointment,” per the unnamed source. We asked Henson and Netflix for comment on these claims, but they did not issue a response.\nWhile speaking to executive producer Javier Grillo-Marxuach earlier this year about Cowboy Bebop, we also discussed Age of Resistance. He noted how the show was not only expensive to make, it boasted the longest shoot length in Netflix history. He told us, “This is not a show where you have a franchise that you can say, ‘Okay, we’ll hire a bunch of new writers to look at the first season.’ This is a dynastic labor of artisanal love. To get it right, you need everybody. You need the Hensons, you need the Frouds. You need a certain amount of commitment financially and in terms of time. And it’s hard to get right. Out of everything that I’ve worked on, this would be probably the hardest one to get right. And the conditions have to come together for it to be exactly what it needs to be.”\nTo that end, some of the key team members behind Age of Resistance have already moved onto other Netflix projects like director Louis Letterier who is in line to direct Bright 2, the sequel to the modern fantasy film written by accused sexual predator Max Landis. Meanwhile, Lisa Henson is keeping busy with Guillermo del Toro’s Pinocchio adaptation, and Grillo-Marxuach is working as a writer on Netflix’s Cowboy Bebop.\nThis year’s Emmys weren’t a slam dunk for nerdy television shows—with the exception of HBO’s Watchmen (which made comic book history by winning Best Limited Series), The Mandalorian, Rick and Morty—but the critically acclaimed prequel to Jim Henson’s fantasy epic did, as Henson’s statement noted, win a Creative Arts Emmy for Best Children’s Program.\nThe first and only season of The Dark Crystal: Age of Resistance is currently on Netflix. There are also several books and graphic novels that have come out that expand the world of Thra, however, none of them have told the still-unfinished story of Age of Resistance yet.\nhttps://gizmodo.com/an-ancient-dark-crystal-mystic-comes-to-life-for-the-fi-1844079269\nFor more, make sure you’re following us on our Instagram @io9dotcom."
    },
    {
      "url": "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
      "text": "“Star Wars! Nothing but Star Wars! Give me those Star Wars! Don’t let them end…” Just as Bill Murray said it in 1978, we’re still saying it today. Star Wars is everywhere these days, with multiple movies and TV shows in the works from Disney and Lucasfilm. This article will give you the most up-to-date Star Wars release dates so you know exactly when every new Star Wars movie or Disney+ show will arrive.\nWhat are the next three movies? What TV shows are coming up? Have any TV shows or movies been canceled? What are people saying about what’s next? We’ve got you covered on all things in a galaxy far, far away.\nThis post was last updated on 9/13/2023.\nWhat’s the next Star Wars movie?\nSharmeen Obaid-Chioy’s New Jedi Order Film Film\nRelease Date: TBD, but May 26, 2026, December 18, 2026 or December 17, 2027 (In Theaters)\nAt Star Wars Celebration 2023 in London, Lucasfilm announced that three Star Wars movies are now in the works.\nJames Mangold (Indiana Jones 5) will direct a film 25,000 years before any known Star Wars timeline about the first Jedi to use the Force.\nDave Filoni will direct a film that’s kind of the Star Wars Disney+ Avengers, telling the story of a climactic event meeting the stories of The Book of Boba Fett, The Mandalorian, Ahsoka and more in the time between Return of the Jedi and The Force Awakens.\nAnd Sharmeen Obaid-Chioy will direct a film set 15 years after the events of The Rise of Skywalker following Rey (Daisy Ridley) as she creates a New Jedi Order.\nThis last one, we think, is the film that Damon Lindelof (Lost, The Leftovers, Watchmen) was co-writingwith Justin Britt-Gibson before departing the project. Steven Knight is now reportedly writing.\nA week after the news of these films first broke, it began to seem like the Rey project by Obaid-Chioy could be the first one out of the gate. However, in June, Disney shuffled its release schedule and moved its December 2025 Star Wars movie to May 2026, and added a third Star Wars movie to the schedule in December 2026. So maybe these three movies are on those dates. We’ll see.\nUpcoming Star Wars release dates\nThese shows and movies have all been officially announced and are in various stages of production, even if we don’t know when they will definitely come out.\nStar Wars: Ahsoka\nRelease Date: Now Playing (On Disney+)\nThe first full live-action Ahsoka Tano show from co-creator Dave Filoni is finally here. Rosario Dawson is, of course, returning. And our first look at footage confirmed that actress Natasha Liu Bordizzo has been cast as Sabine Wren; more recently, Eman Esfandi was confirmed as Ezra Bridger. At Star Wars Celebration this year we learned Mary Elizabeth Winstead is playing Hera Syndulla, Lars Mikkelsenis playing Grand Admiral Thrawn and Wes Chatham is his right-hand man.\nWhat does that all mean? Well, in the first teaser trailer, you can see she’ll make good onthe Star Wars Rebels finale and go after Thrawn. And what about the fact she knows Luke Skywalker now? And how does Ray Stevenson’s lightsaber-wielding character fit in?\nThe show is now airing on Disney+ and here you can read our weekly recaps:\nEpisode 1, “Master and Apprentice: and Episode 2, “Toil and Trouble”\nEpisode 6, premiering September 19\nEpisode 7, premiering September 26\nEpisode 7, premiering October 3\nStar Wars: Skeleton Crew\nRelease Date: 2023 (On Disney+)\nCreated by Spider-Man Homecoming/Far From Home/No Way Home director Jon Watts along with writer Chris Ford, this mystery Star Wars show is now currently in development. The title for the show was released during the Star Wars Celebration, and was previously internally referred as “Grammar Radio.” Celebration also revealed its headlining star, Jude Law.\nSet after the events of Return of the Jedi, Skeleton Crew is described as an adventure in the mold of Amblin adventures of the 1980s. The show will be about seeing the galaxy through the eyes of children (but it is not a kids show), and will follow a group of children who get lost in the galaxy and try to find their way home. Jon Watts explained that the series will take place during the same time period as the upcoming Ahsoka series and The Mandalorian.\nFilming on the series began in 2022 and ended in early 2023. And though not much is know about what happens on the show,it has been revealed that The Daniels, the Oscar-winning directors of Everything Everywhere All At Once, directed an episode. Ditto David Lowery, who did the film The Green Knight. Read more about the show here.\nio9 saw the first footage at Star Wars Celebration 2023 and you can read about it here. Three of the main stars of the show are played by Ravi Cabot-Conyers, Kyriana Kratter, and Robert Timothy Smit. Rumors suggest it could debut in November or December 2023.\nStar Wars: The Acolyte\nRelease Date: 2024 (On Disney+)\nRussian Doll co-creator Leslye Headland will be the first person to bring the excellent High Republic timeline into live-action with this show, long rumored to star Amandla Stenberg before an actual confirmation finally arrived at San Diego Comic-Con 2022—one of few Star Wars bits of news to emerge from the convention.\nIn an interview in 2022, Headland revealed the show would be about 100 years before the events of The Phantom Menace. “A lot of those characters haven’t even been born yet,” she said. “We’re taking a look at the political and personal and spiritual things that came up in a time period that we don’t know much about. My question when watching The Phantom Menace was always like, ‘Well, how did things get to this point?’ How did we get to a point where a Sith lord can infiltrate the Senate and none of the Jedi pick up on it? Like, what went wrong? What are the scenarios that led us to this moment?”\nIn an interview released later, Headland spoke about her goals for the series. For Headland, above all else The Acolyte is a mystery, and that mystery is figuring out what is going on in this peak period. It was also suggested that The Acolyte will bring more elements from the Expanded Universe to canon, but what parts that will be incorporated will remain to be seen.\nIn September 2022, both Jodie Turner-Smith and Squid Game’s Emmy-winning Lee Jung-Jae joined the cast, with an official announcement in November adding Carrie-Anne Moss, Manny Jacinto, and others to the roster. The first image, which you see above, was released in November and you can read about the first footage here, which was shown at Star Wars Celebration 2023.\nAnd no, despite what bullcrap rumors you may have been reading online, the show has not been canceled.\nAndor: Season 2\nRelease Date: August 2024 (On Disney+)\nSeason one of Tony Gilroy’s Rogue One prequel starring Diego Luna showed an excitingly different side of Star Wars. Season two will reportedly be spread across the four years leading up to Rogue One, with four episodes covering each year in Cassian Andor’s life until that fateful point. Filming began in late 2022.\nAt Star Wars Celebration 2023, Gilroy announced the show should be out in August 2024 and showed fans the first footage from the season. Read about it here. Plus, the final episodes of the season/series will take place just days before Rogue One, leading right into that story.\nOne minor hiccup though, due to the Writer’s Guild strike, showrunner and head writer Tony Gilroy left his duties show in May 2023. He’s unlikely to return until the Writer’s Strike is over, which could cause a delay.\nStar Wars: A Droid Story\nRelease Date: TBD (On Disney+)\nLucasfilm Animation is teaming up with Industrial Light and Magic for this streaming show that will “introduce us to a new hero, guided by legendary duo R2-D2 and C-3PO.” We don’t know anything beyond that and there hasn’t been a significant update in years, which could be a good thing or bad thing.\nStar Wars: Lando\nRelease Date: TBD (On Disney+)\nWay back in December 2020, Disney announced a bunch of Star Wars TV shows. Among them was a Lando show which, at the time, was going to be made by Dear White People creator Justin Simien. After that, things went quiet for about three years. Then,in an April 2023 article, Donald Glover hinted that he’s still interested and it’s still possible in the works. A May 2023 interview with Lucasfilm president Kathleen Kennedy confirmed it’s still in the works.\nThe first significant update in almost three years came in July when news broke that Simien has been off the project since he started working on Haunted Mansion, and not only is Donald Glover going to star in the series, he’s co-writing it with his brother Stephen.\nUntitled Taika Waititi Star Wars Movie\nRelease Date: TBD\nIn May 2020, news broke that Oscar-winning director of Thor: Ragnarok would be helming and co-writing along with Krysty Wilson-Cairns. “Taika’s approach to Star Wars will be fresh, unexpected, and … unique,” Lucasfilm president Kathleen Kennedy said. “His enormous talent and sense of humor will ensure that audiences are in for an unforgettable ride.”\nThere was a time when this was likely to be the next Star Wars film but, after Star Wars Celebration 2023, it seems like it’s now on the back burner. That was confirmed by Lucasfilm president Kathleen Kennedy who said the Oscar-winner is still working on the film, it’s just going slowly.\nIn the past, Waititi has discussed some broad ideas of what he wants to do with his upcoming film. Read those below.\nTaika Waititi Doesn’t Want Star Wars to Rely on Legacies\nAre You as Confused About Taika Waititi’s Star WarsMovie as We Are?\nUntitled Dave Filoni Star Wars Movie\nRelease Date: TBD\nWe mentioned this one above but, at some point, Dave Filoni will be directing a film that is meant to be a climactic event wrapping up stories that have begun on shows he’s involved with such as The Mandalorian, Ahsoka, The Book of Boba Fett, Skeleton Crew and others.\nUntitled James Mangold Star Wars Movie\nRelease Date: TBD\nThis was one of the three films announced at Star Wars Celebration but, like Filoni’s, isn’t likely to be next. This one is set 25,000 years before the original trilogy and tells the story of the first person to use the Force.\n“For me, it’s about, I want to be part of the saga, but I also don’t want to be holding so much lore in the air that you can hardly tell a story,” Mangold told io9 when asked about this film. “And what I really wanted to do…was just can we make a kind of the Ten Commandments of the Force, you know? A kind of origin story of how the Force came to be known, understood, wielded, and harnessed.” We love this idea so much we even wrote about it.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Haven’t Been Officially Announced, But We Think Are Still Happening\nThe Mandalorian Season 4\nRelease Date: TBD\nWith The Mandalorian Season 3 now in the books, all eyes look ahead to season 4. However, the season has not yet been officially announced. Unofficially though, series creator Jon Favreau said he’s already written a fourth season which he probably wouldn’t have done just for fun. It’s coming. It’s just a matter of when, especially with writers and actors on strike.\nThe Book of Boba Fett Season 2\nRelease Date: TBD (On Disney+)\nThe Book of Boba Fett season one ended with the implication that we’d see more of these character in the future. But alas, there has been no official announcement… yet. Dive into the making-of season one while we wait and ponder the words of executive producer Robert Rodriguez who said he knows when the character is coming back, but he can’t say when.\nUntitled Shawn Levy Movie\nRelease Date: TBD\nShawn Levy, the prolific director and producer behind Stranger Things, Night at the Museum, and Free Guy is gearing up to develop a film in a galaxy far far away. He’ll focus on that after completing Deadpool 3, which stars Ryan Reynolds and Hugh Jackman.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Probably NOT Going To Happen\nStar Wars: Rangers of the New Republic\nOriginally announced alongside shows like Obi-Wan Kenobi, Ahsoka, and Andor, Rangers of the New Republic was rumored to be Cara Dune’s show which would tie into The Mandalorian and Book of Boba Fett. However, with actress Gina Carano no longer a part of Star Wars, word on the street is this will no longer be happening. Nothing is official though.\nUntitled Rian Johnson Trilogy\nLet’s be honest. Do we think this is happening anymore? Probably not. Rian Johnson has moved on to other things. But, until we hear otherwise (and no one is officially saying), we’d be remiss if we didn’t mention that before the divisive release of The Last Jedi, Lucasfilm officially said Johnson would make his very own trilogy. It hasn’t officially been canceled yet but, in a new interview, Lucasfilm president Kathleen Kennedy suggested that it’s been placed on the back burner as Johnson does other things. With Johnson’s next film, Glass Onion, set for release in late 2022 though, he’s been quoted saying he still hopes these movies happen. So do we.\nStar Wars: Rogue Squadron\nFor several years, Wonder Woman director Patty Jenkins’ film about pilots in the Star Wars universe has been earmarked as the next film. Well, that’s no longer the case. After months of rumors suggesting it might move off its 2023 release date, Disney officially took it off the schedule. On December 13 2022, Jenkins said the movie is still in “active development” but recent news suggests it’s dead. Lucasfilm president Kathleen Kennedy disagrees, saying in May 2023 it’s still on the books.\nUntitled Kevin Feige Movie\nMarvel Studios President Kevin Feige is best known for helping create the Marvel Cinematic Universe. But as much as he loves Marvel, he loves Star Wars even more. And so it was exciting to hear that he was producing a Star Wars movie and even recruited Loki and Doctor Strange in the Multiverse of Madness writer Michael Waldron to help him. Feige doesn’t like to even acknowledge this project though and in a 2022 interview, Lucasfilm president Kathleen Kennedy also tiptoed around the project’s existence. Then, a few weeks before Star Wars Celebration 2023, we learned the project is likely dead.\nFor more, check out io9’s list of every canceled (or re-worked) Disney Star Wars project.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/the-12-best-and-4-worst-movie-moments-of-2019-1840349157",
      "text": "So many great (and occasionally terrible) movies came out this year (more on them as a whole later this week), but within the genre films of 2019, there were individual moments that delighted or disappointed us. Allow us to share them with you.\nObviously, there’s going to be spoilers in this piece, so be warned: if you’ve not seen (deep breath!) Hobbs & Shaw, Us, Avengers: Endgame, Godzilla: King of the Monsters, Captain Marvel, Glass, Ad Astra, Spider-Man: Far From Home, Terminator: Dark Fate, X-Men: Dark Phoenix, Detective Pikachu, Joker, Midsommar, Ready or Not, or Zombieland: Double Tap yet…turn around now.\nBest\nCaptain Marvel, Goose vomits up the tesseract\nThough we knew there was going to be a ginger cat in Captain Marvel, and Disney was all about that marketing, we weren’t sure just how big a role Goose would play. Turns out, pretty big! Not only did Goose help save the day by scaring off some bad guys with his Flerken-tentacled mouth, he swallowed that all-powerful Tesseract for safekeeping. But what goes down must come up, and come up it did…all over Nick Fury’s desk in the post-credit scene of the film. Look. Any cat owner will tell you…vomit is just an unfortunate part of the furry package, so when we saw that trademark heaving start, we knew exactly what was about to happen. And it was glorious.\nAvengers: Endgame, Captain America gets Thor’s hammer\nAvengers: Endgame is basically “Epic Payoff: The Movie.” So much of what’s great about it is because of things set up in films of the past. Like, for example, the moment in 2015’s Avengers: Age of Ultron when Steve Rogers almost moves Thor’s hammer and Thor reacts with shock. Fast-forward four years and, just as Thanos is about to kill Thor, that same hammer hits Thanos in the back. “But wait, Thor’s on the ground, who could have thrown it?” Boom. Steve freaking Rogers, that’s who. “I knew it,” Thor shouts as every audience who saw the film exploded out of their seats. It’s a moment so filled with excitement and so reliant on patience that its emotional reward is just off the charts.\nAvengers: Endgame, when Ant-Man turns into a baby\nYou might have your own powerful feelings about the best moment in Endgame: Captain America’s trip to the hardware store, Captain Marvel’s trip through a space ship, that Thor reaction above, or just Iron Man doing some clutch finger-snapping. But another big moment that stood out to us was when Ant-Man goes into the quantum tunnel and a god damn baby comes out.\nEndgame was a funny film in a way these big-budget superhero films rarely are. The jokes came fast and furious, and while some didn’t land (that whole ripping on Back to the Future bit was a travesty), when they did land it punctuated the growing dread of the story, releasing all the tension and letting you guffaw at a tiny child in a giant suit. You could remember Endgame for all the deaths (or the paltry roles of the female cast), but we’ll also remember just how much fun it was, and few moments nailed that as well as that dang baby.\nhttps://gizmodo.com/all-of-the-coolest-trivia-revealed-on-the-avengers-end-1837006830\nSpider-Man: Far From Home, J. Jonah Jameson is back\nThe first of Far From Home’s post-credits scenes represents an incredibly bold new problem for Peter Parker: Mysterio, playing one last deception on the world from beyond the grave, posthumously released edited footage to frame Spider-Man as the villain behind the drone and elemental attacks occurring across the world over the movie. On top of that, he adds the killer reveal of publicly outing Peter Parker as the boy behind Spidey’s mask.\nBut it’s not this earth-shattering twist that had fans, like Peter himself, screaming out a hearty WTF in the theater. It was how that footage was disseminated: a brand new, Infowars-ian take on the Daily Bugle, an internet news channel run by none other than the infamous J. Jonah Jameson. And not just any JJ. Arguably, to many, the live-action JJ: J.K. Simmons, reprising his beloved role from the Sam Raimi Spider-Man trilogy, returned to bring the tempestuous journalist to life in the MCU, and now Spidey has one of his most stalwart thorns in his side to deal with once more. We wouldn’t want it any other way, Parker luck be damned.\nhttps://gizmodo.com/how-mysterios-mystery-was-crafted-in-spider-man-far-fr-1835955980\nSpider-Man: Far From Home, Mysterio’s House of Mirrors\nWhile Far From Home gets by on some of its more shocking reveals and its wider connections to the aftermath of Avengers: Endgame, one of its most jaw-dropping moments isn’t really a major twist or big reference to the grand Marvel continuity. Mysterio, having had his duplicity exposed by Peter and MJ, traps the young hero in Berlin, turning his hologram-projecting drones on Peter to create a nightmarish display of trickery that flings Peter through a visually stunning house of horrors.\nFrom being trapped in a snow globe made out of Mysterio’s own fishbowl helmet, to being chased by a zombified Tony Stark, to a Last Jedi-esque row of Peter reflections, it’s the moment the film finally truly revels in Mysterio’s status as a master of illusions and deception—and makes a power often just treated as a gimmicky joke feel as horrifying as it is gorgeous.\nMidsommar, the grand catharsis\nMidsommar is filled with shocking moments, from the first-act family tragedy that destroys the life of main character Dani (Florence Pugh), to the gruesome ritual suicide she witnesses while on vacation in a seemingly idyllic Swedish village. But Midsommar writer-director Ari Aster isn’t in the business of freaking out his characters (and by extension, the audience) with cheap jump scares; he’s more of an architect of dread, and he knows how to stick the finish.\nHis previous film, Hereditary, ended with a grim reveal that implied more nightmares to come. Midsommar also ends with a horrific reveal, but it gives way to an incredible moment of catharsis that’s dangerously close to being upbeat, as we watch Dani—who’s agreed to allow her fuckboi boyfriend to be stitched inside a bear corpse and then burned alive as a human sacrifice—witness her boyfriend’s fiery final moments. As the villagers around her pantomime shrieks of agony (just another macabre eccentricity of a culture that embraces both murder and empathy), Dani—whose status as the newly-crowned May Queen means she’s cocooned in an almost comically voluminous blanket of brilliant flowers—also howls in anguish…until suddenly, a weight is lifted. She’s free. She’s finally free, and though it’s been a hell of a road to get there, she’s finally feeling inner peace. It’s the best “happy” horror movie ending since Thomasin floated off with Satan at the end of The Witch.\nTerminator: Dark Fate, the chain fight\nThe latest installment to the Terminator franchise sadly did not do well at the box office. Even though we enjoyed this one thoroughly and it was coming at the story with fresh eyes, we can’t blame audiences for their fatigue. That said, Tim Miller’s action set pieces were extremely fun to watch and one stood above the rest. In the third act of the film, our heroes are gathered to take on the Rev-9 and Mackenzie Davis’ Grace did so with pep. Considering all the fire-power they’d already tried to throw at the Terminator, a giant chain seemed considerably low-tech for the job at hand, but it worked wonders and Davis swung that thing around beautifully.\nGodzilla: King of the Monsters, Mothra’s sacrifice and the final Godzilla/Ghidorah battle\nKing of the Monsters is a gloriously dumb movie filled with gloriously dumb humans doing things you really shouldn’t care about between the things you should care about: giant monsters smashing the bejesus out of each other. There’s a lot of that in the film, but the absolute best of it is saved for the climactic battle in Boston. After Millie Bobbie Brown’s Madison summons all the film’s Kaiju to the evacuated city with her mother’s Kaiju-call device (for…reasons), Godzilla, Mothra, Rodan, and Ghidorah go into battle with each other in a doubles scrap for the ages.\nIt is absolutely everything you’d want out of a modern-day action sequence with these iconic creatures. Godzilla and Ghidorah get to just throw themselves at each other, two giant slabs of monstrous muscle and energy blasts smashing together. Mothra and Rodan knock each other out, only for Mothra to use her dying throes to not just save Godzilla from certain death with a suicidal charge against Ghidorah–but to transfer her energy to him to transform the king of all Kaiju into the legendary Burning Godzilla, a fanservice-laden tribute to the iconic power-up from Godzilla vs Destoroyah. It’s big, it’s bold, it is more than worth the price of your ticket. It’s your just desserts for sitting through all the dumb human stuff, and it is pure, monster-driven joy.\nZombieland: Double Tap, the doppelgangers\nZombieland: Double Tap was a mostly forgettable affair, but one scene rises above all the rest. It’s when Tallahassee and Columbus (Woody Harrelson and Jesse Eisenberg) encounter two new characters named Albuquerque and Flagstaff, played by Luke Wilson and Thomas Middleditch. Very quickly, everyone is confused because they’re so damned similar, which is explored for humor, in the nerdy conversations between Eisenberg and Middleditch’s characters, or tension, as per the interactions of Harrelson and Wilson’s characters. Eventually, it all erupts into an epic one-shot take of the four men fighting each other, resulting in the deaths of the two doppelgangers. The scene is everything that’s great about Zombieland: self-awareness, hilarious banter, and violent action.\nhttps://gizmodo.com/the-zombieland-double-tap-credit-scene-was-originally-1839228255\nUs, the mirror\nSpeaking of doppelgangers—there are hints throughout Us that something is off with Adelaide (Lupita Nyong’o), and a huge tease near the beginning as to what that is. But writer-director Jordan Peele waits until the very end to show his cards; it’s not until Addie and her family have defeated their sinister doppelgangers and are fleeing the epicenter of “tethered” rebellion in beachy Santa Cruz that we learn what’s really been going on the entire time.\nIn a flashback, Addie recalls the fateful night she first encountered her double, Red, in a boardwalk funhouse mirror—and we suddenly realize that was the moment Red grabbed Addie and forced her to change places. The Addie we’ve been following the entire time is really Red, a “tethered” clone who was able to fake her way through life in the above-ground world, becoming a seemingly normal woman with a career and a family of her own. Even if you sort of suspected the reveal was coming, the tense way it all unfolded had a way of making you want to re-watch the film instantly to catch all the hidden clues—and it also added even more layers to Nyong’o’s masterful dual performance.\nReady or Not, gooey deaths\nThis year had quite a few sharply written films about how gross rich people are. Ready or Not explored their grossness in the most graphic way possible, killing off maids and butlers as a rich family hunts their newest member so they can preserve their pact with the devil and maintain their wealth and status.\nAt the end of the film, with a couple of good guys (and a whole lot of bad guys) dead on the floor, the heroine is at an impasse with the surviving family members. It’s sunrise and somehow everyone is alive, leading you to think that maybe the whole movie has been founded on a fake prophecy and no one had to die. Then evil rich people start popping like gore-filled balloons. Knowing the prophecy was real, and having all the bad guys go in a quick round of bloody booms is cathartic after all the tension and torture. Sometimes the rich and evil really do get what the deserve.\nAd Astra, the space baboon\nAd Astra is full of unexpected moments but none are as shocking as the space baboon. You read that right. At one point in the film, Brad Pitt and his crew find a seemingly abandoned ship. He boards it and all the people are dead. As he explores how that could have happened an evil, bloodthirsty baboon appears and engages the hero in a shocking, visceral fight. If you’ve never seen Brad Pitt fight a baboon in zero gravity space suits, you haven’t lived.\nWorst\nGlass, David Dunn dies\nIt’s bad enough that Glass was such a bore. To add insult to injury, David Dunn dies in a puddle. Look, we get it. His weakness is water. And he’d been beat up and doused in the stuff. So, in theory, him drowning in a puddle of water makes sense. But it’s just so goddamn deflating to see your hero die so unceremoniously. Was that the point? A kind of reality check? Probably. But who cares? It was still stupid as hell.\nDark Phoenix, Mystique’s death\nThe Dark Phoenix saga has always been a story about the X-Men being pushed to their physical and emotional limits in their most pressing time of need as one of their own turns to the darkest of dark sides. More than that, though, the Dark Phoenix’s arrival into the X-Men’s lives was meant to signify that they were ready to deal with bigger, badder, more cosmic adversaries in Fox’s cinematic universe. But when the famed entity actually showed up on the big screen this time around, it seemingly came willing and ready to reflect and emphasize all of the studio’s narrative failings, like the unceremonious death that it gave Mystique.\nWe all know that Fox put its money on Jennifer Lawrence being the next big thing—so much so that audiences would flock to the theaters to see her in literally anything, but Fox’s bet never really paid off and JLaw was trapped in a franchise she neither liked not had any appreciation for. Dark Phoenix set the actress free of her obligations to the studio, but not before giving her one of the most unceremonious deaths in Hollywood history that was somehow very much on brand for the films, but also deeply offensive to audiences.\nHobbs & Shaw/Detective Pikachu, Ryan Reynolds cameos\nWe love Ryan Reynolds. He’s likable, funny, talented—how could anyone not like him? The answer, it turns out, is to shove him into movies where he’s not needed. That happened twice in 2019. In Hobbs & Shaw, he basically plays Deadpool without the suit and is in the film solely to set up a sequel. His presence totally changes the tone of the movie. In Detective Pikachu he voices the main character…that’s not the problem. The problem is the end of the film when he shows up as the other character’s father. Having his voice in the movie is one thing. Having his physical presence just kind of steals the spotlight away from Justice Smith, who otherwise did a very good job in the film. Basically, if you’re going to cast Ryan Reynolds for a cameo, try not to make him stand out, okay?\nhttps://gizmodo.com/to-all-the-thomas-waynes-weve-seen-before-1828656000\nJoker, Batman’s origin…AGAIN\nThere are a vast number of things to dislike about Joker as a film, but nothing about it is quite as horrible as the moment that it takes to retell Batman’s origin story—a story we’ve all seen more times than any person should ever have to. It’s not that Batman’s origins can’t be explored on the big screen, it’s just that the murder of the Wayne family (like the death of Spider-Man’s Uncle Ben) is something we’ve all seen so many times that if you’re going to do it, you have to do it well and it really needs to serve some sort of important function to the story. Here, it didn’t.\nAvengers: Endgame, race to the death\nWhile overall a smash success, Avengers: Endgame did have some weak points. One of the more controversial moments came when Hawkeye and Black Widow battled to the death….for the right to die. Though the battle for the Soul Stone put the depth of Natasha and Clint’s friendship on full display, some fans found the race off the cliff on Vormir to be silly, rather than gut-wrenching.\nUpdate: We, uh, forgot to paste in the last worst moment, now making five altogether. We’re…really tired.\nFor more, make sure you’re following us on our Instagram @io9dotcom."
    },
    {
      "url": "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
      "text": "Trying to keep track of what’s coming in the realm of Star Trek feels like trying to stop a tribble from procreating. Before even more new series are announced, here’s our guide of when to expect all the new Star Trek shows, as well as returning familiar favorites, and what else is in the works right now. Engage!\nThis post was last updated 7/14/23.\nCurrently Airing: Star Trek: Strange New Worlds Season 2\nThe Enterprise is back after a successful first season, and this time Captain Kirk will be along for the ride with another appearance by Paul Wesley after his surprise finale role in season one. Not much else is known about the season so far, other than one episode will see the show crossover with Star Trek: Lower Decks in a live-action/animated hybrid directed by The Next Generation’s Jonathan Frakes. The show has also been renewed for a third season.\nSeason two recaps:\n“Tomorrow and Tomorrow and Tomorrow”\n“Charades”\nUpcoming: Star Trek: Lower Decks Season 4\nThe third season of the animated series following the misfit crew of the USS Cerritos—and in particular its cadre of ensigns, Mariner (Tawny Newsome), Boimler (Jack Quaid), Tendi (Noël Wells), and Rutherford (Eugene Cordero)—once again followed our heroic ensigns and the remaining bridge officers aboard the Cerritos. Season four will be arriving in late summer. The show has also been renewed for a fifth season.\nUpcoming: Star Trek: Discovery Season 5\nExpected in early 2024, Discovery’s fifth season will be 10 episodes long, down from the 13 of prior seasons. In the wake of season four‘s climax earlier this year, Michael Burnham (Sonequa Martin-Green) led her crew in a desperate attempt to save the galaxy from a mysterious anomaly created by an extra-galactic race, ensuring peace and stability for the Federation once more… for now. As her romantic partner Book (David Ajala) pays time for his own role in a campaign to surreptitiously destroy that anomaly, we’re not sure what awaits Burnham and Discovery’s crew just yet, but given this show, we’re sure it’ll be very, very dramatic.\nIn Flux: Star Trek: Prodigy Season 2\nThe animated series aimed at younger Trek fans (and Janeway fans!) and kids at heart can be found on both Nickelodeon and Paramount+. The first season was divided into two parts, with part two wrapping up at the end of 2022; after Paramount+ announced it would not move forward with the show’s already greenlit season two, it was removed from the service. (A home release of the complete first season is still possible; the first 10 episodes are still available for purchase.) Fans are still waiting to hear if Prodigy season two will surface on a different outlet.\nUpcoming: Starfleet Academy\nIt’s really happening! After a long tease, filming on this series will begin in 2024. Here’s the official announcement from co-showrunners and executive producers Alex Kurtzman and Noga Landau:\n“Admission is now open to Starfleet Academy! Explore the galaxy! Captain your destiny! For the first time in over a century, our campus will be re-opened to admit individuals a minimum of 16 Earth years (or species equivalent) who dream of exceeding their physical, mental and spiritual limits, who value friendship, camaraderie, honor and devotion to a cause greater than themselves. The coursework will be rigorous, the instructors among the brightest lights in their respective fields, and those accepted will live and study side-by-side with the most diverse population of students ever admitted. Today we encourage all who share our dreams, goals and values to join a new generation of visionary cadets as they take their first steps toward creating a bright future for us all. Apply today! Ex Astris, Scientia!”\nUpcoming (movie): Star Trek: Section 31\nAnnounced as a TV series back in 2019 as a spinoff for fan-favorite Discovery guest star Michelle Yeoh, this plunge into the seediest side of Starfleet—the shadowy spy organization Section 31 first introduced in Deep Space Nine—is now planned as a Paramount+ film.\nNewly minted Oscar winner Yeoh will return as former emperor of the Mirror Universe’s Terran Empire, Phillipa Georgiou, now turned into a kinder, but still kickass person by her time with Michael Burnham. “I’m beyond thrilled to return to my Star Trek family and to the role I’ve loved for so long,” Yeoh said in a statement. “Section 31 has been near and dear to my heart since I began the journey of playing Philippa all the way back when this new golden age of Star Trek launched. To see her finally get her moment is a dream come true in a year that’s shown me the incredible power of never giving up on your dreams. We can’t wait to share what’s in store for you, and until then: live long and prosper (unless Emperor Georgiou decrees otherwise)!”\nWritten by Craig Sweeny and directed by Olatunde Osunsanmi, Star Trek: Section 31 will start production later this year, and eventually come to Paramount+.\nWhere Can I Stream Classic Star Trek Shows?\nThat’s all the new bits of Star Trek coming. But what about the old Star Trek? In the U.S. at least, the vast majority of classic Star Trek shows are available exclusively to stream on Paramount+ (albeit not without issues), although some holdouts remain on other streaming services. Here’s a full list of classic Star Trek shows and where to stream them, as well as links to our recommended episode guides for every series!\nStar Trek: The Original Series (Paramount+)\nStar Trek: The Animated Series (Paramount+)\nStar Trek: The Next Generation (Paramount+, Netflix)\nStar Trek: Deep Space Nine (Paramount+, Netflix)\nStar Trek: Voyager (Paramount+)\nStar Trek: Enterprise (Paramount+)\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
      "text": "There’s now over 30 feature films in addition to eight Disney+ shows in 15 years in the Marvel Cinematic Universe. 2023 got off to a promising start here’s what’s coming next from the MCU. In short: a lot, we began Phase Five with Ant-Man and the Wasp: Quantumania followed by Guardians of the Galaxy: Volume 3, Secret Invasion and by the fall we’ve got The Marvels on the horizon along with season 2 of Loki.\nHere’s the latest news for Marvel theatrical release dates and Marvel TV release dates on Disney+—which the studio can often tweak or reschedule—so we get it, keeping track of when your favorite superheroes are returning or making their debuts can be challenging. Don’t worry, to help you stay on top of things, we’re compiling all the current MCU release dates; when specific titles have been announced but still not officially scheduled, we’ll put them in order when we think they’re most likely to show up.\n(Last updated 6/16/23)\nWhat’s the next Marvel movie?\nThe Marvels\nRelease date: November 10 (In theaters)\nThe sequel to Captain Marvel will pull together three of the MCU’s most powerful women: Brie Larsen’s titular Captain, Ms. Marvel’s Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau. Nia DaCosta (who most recently helmed the revival of Candyman) is directing the film.\nIn the finale of Ms. Marvel season one, Carol Danvers showed up in Kamala Khan’s bedroom, marking the first real tease of the film. The film release date change came with a poster. Most recently the teaser trailer dropped and here’s our breakdown of everything we saw.\nUpcoming Marvel Cinematic Universe Release Dates\nSecret Invasion\nRelease date: June 21 (On Disney+)\nThis series picks up storylines from both Captain Marvel and Spider-Man: Far From Home to explain the decades-long Skrull invasion of Earth. Samuel L. Jackson and Ben Mendelsohn will star withEmilia Clarke taking on the role of Talos’ grown daughter who has joined a rebellious splinter cell of Skrulls. Martin Freeman has also confirmed he will be appearing in Secret Invasion.\nThe Disney+ blurb of the series describes the series as a “crossover event series showcasing a faction of shape-shifting Skrulls who have been infiltrating Earth for years.” A trailer was released at D23.\nLoki Season 2\nRelease date: Fall 2023 (On Disney+)\nThe smash hit series about Tom Hiddleston’s antihero will return soon for more variant shenanigans across the multiverse. Hiddleston confirmed “the whole cast” of Loki’s first season will return for season two on an episode of Jimmy Kimmel Live. In December, we got a very, very brief tease of season two.\nEcho\nRelease date: November 29, 2023 (On Disney+)\nThis spinoff from the Hawkeye series will follow Echo, a deaf martial artist, as played by actress Alaqua Cox. Devery Jacobs (Reservation Dogs) co-stars. Echo officially began filming on May 24, according to a tweet by series creator Marion Dayre. According to James Clement on an episode of the Weekly Planet podcast, both Vincent D’Onofrio and Charlie Cox are set to return for the Echo series at Disney+.\nThe series was recently announced along with Ironheart, Agatha Coven of Chaos and What If season 2 as potentially moving to 2024.\nX-Men ‘97\nRelease date: Fall 2023 (On Disney+)\nThe X-Men are coming to the MCU… kinda. X-Men ‘97 is a revival of the classic ‘90s animated show, bringing back the same style, stories and yes, theme song, of the iconic series. (See more: X-Men ‘97 Looks Like a Nostalgic Blast From the Past)\nIronheart\nRelease date: 2024 (On Disney+)\nWith Tony Stark gone, the MCU needs a new super-genius inventor. Enter teenage prodigy Riri Williams (played by Dominique Thorne), who creates a brand new, ultra-advanced armored suit. Other cast members include Anthony Ramos (In the Heights) as the villain the Hood and Lyric Ross (This Is Us). Chinaka Hodge (TNT’s Snowpiercer) is attached as the head writer, and Black Panther director Ryan Coogler is an executive producer alongside Marvel’s Kevin Feige and others. Manny Montana (Good Girls) has joined the cast of Marvel’s Ironheart in an undisclosed role as well as Han Solo himself, Alden Ehrenreich.\nAgatha: Coven of Chaos\nRelease date: Winter 2024 (On Disney+)\nThis spinoff from WandaVision will star Kathryn Hahn as her fan-favorite character Agatha Harkness. Joe Locke (Heartstopper) and Aubrey Plaza (Hahn’s Parks and Recreation co-star, among her other many credits) are also in the cast, as is Patti LuPone. (A second WandaVision spin-off, this one focusing on Paul Bettany’s Vision, is also reportedly in the works.)\nCaptain America: Brave New World\nRelease date: August 26, 2024 (in Theaters)\nWe’ve got a new Captain America, so it was inevitable that we’d be getting a new Cap movie. Anthony Mackie will appear in the title role. Harrison Ford was announced to take over the role of General Thaddeus Ross and will make his debut in this release.\nDaredevil: Born Again\nRelease date: Spring 2024 (On Disney+)\nCharlie Cox and Vincent D’Onofrio will return as Daredevil and Kingpin for an 18-episode Disney+ series. Jon Bernthal has signed on to reprise his role as the Punisher. Things remain uncertain for Foggy and Karen.\nThunderbolts\nRelease date: December 20, 2024 (In theaters)\nMarvel Studios is readying a movie based on the comic Thunderbolts and director Jake Schreier has been tapped to bring it to life. This film marks the end of Phase Five of the Marvel Cinematic Universe. Steven Yeun (Nope) signed on for an undisclosed role\nBlade\nRelease date: February 14, 2025 (In theaters)\nDisney hasn’t revealed much about this reboot of the franchise that features a badass vampire-hunter who is also a vampire, but we know that it stars two-time Academy Award winner Mahershala Ali, who also played Cornell “Cottonmouth” Stokes in Netflix Marvel series Luke Cage. We also know Blade appeared (or at least his voice did) in the end credits of The Eternals. After losing director Bassam Tariq, who would have been the first U.S.-Pakistani person to helm a Marvel Studios film, Blade was put on pause, and its release date was shifted. But now it has a new director in place: Lovecraft Country’s Yann Demange, as well as a writer in Michael Starrbury, so the September 2024 date looks ever more likely.\nDeadpool 3\nRelease date: May 3, 2024 (In Theaters)\nRyan Reynolds’ “merc with the mouth” is set to appear in Disney’s first R-rated film following the company’s completed acquisition of Fox assets. Oh, and did you happen to hear that Hugh Jackman’s Wolverine is also appearing in this one? Unless you are cut off from all social media, you no doubt caught that announcement.\nDeadpool 3 writers Rhett Reese and Paul Wenick spoke with Den of Geek about how Deadpool’s move to the MCU will not affect the feel of the movie. Or, in Wernick’s words: “Deadpool’s gonna be Deadpool.” Reese also said that Disney has been more than willing to ensuring the franchise keeps its core identity. Shawn Levy (Free Guy) is directing.\nFantastic Four\nRelease date: May 2, 2025 (In theaters)\nPhase Six of the Marvel Cinematic Universe, kicks off with the MCU debut of Marvel’s most famous family. Jon Watts was scheduled to directbut he is no longer doing that—Matt Shakaman of WandaVision is now in the chair—and though we saw John Krasinski as Mr. Fantastic in Doctor Strange in the Multiverse of Madness, there’s no guarantee he returns.\nAvengers: The Kang Dynasty\nRelease date: May 1, 2026 (In theaters)\nSince neither Phase Four or Phase Five ended with Avengers movies, Phase Six will end with two, back to back. The first is The Kang Dynasty, a title which heavily suggests that Kang (Jonathan Majors) will play a major role. Destin Daniel Cretton (Shang-Chi) will direct.\nAvengers: Secret Wars\nRelease date: May 7, 2027 (In theaters)\nIt all comes down to this. Phase Six, and the whole Phase 4-6 arc of the Multiverse Saga, ends with Secret Wars. We don’t know anything about the plot other than the comics that the title is based on; Marvel veteran Michael Waldron (Loki, Doctor Strange in the Multiverse of Madness) is writing the script.\nArmor Wars\nRelease date: Unknown (In theaters)\nThis project—originally slated for a Disney+ series, but now getting the feature film treatment—will follow James Rhodes (Don Cheadle) as he tracks down stolen tech that allows criminals to replicate Iron Man technology.\nAlso: Marvel slotted several other projects for Phase Six that take place alongside Fantastic Four and the Avengers films. There are two in fall 2024, two in winter 2024, one in winter 2025, two in spring 2025 and two in summer 2025. Some of those are probably…\nUnscheduled But Probably Still Happening Shows & Movies\nMoon Knight Season 2\nRelease date: Unknown (On Disney+)\nMoon Knight himself, Oscar Isaac, was recently spotted in Egypt and teased that a second season of his show could be on the way. Marvel and Disney have yet to confirm.\nMarvel Zombies\nRelease date: Unknown (On Disney+)\nThis new animated show is loosely spun out from a breakout episode of What If? that saw MCU heroes battling a zombie apocalypse.\nSpider-Man: Freshman Year\nRelease date: Unknown (On Disney+)\nDisney says this new animated series follows Peter Parker “on his way to becoming Spider-Man in the MCU, with a journey unlike we’ve ever seen and a style that celebrates the character’s early comic book roots.”\nWhat if…? Season 2\nRelease date: Unknown (On Disney+)\nThe speculative animated series and its omnipresent narrator the Watcher will return with an all-new season. The show’s creators say next season will focus on new stories, new heroes, and “lots of fun.” Though the trailer still hasn’t been released, the Marvel Animation Panel at San Diego Comic Con revealed some Phase 4 characters that will be in the show.\nUntitled Wakanda Series\nRelease date: Unknown (On Disney+)\nNot much is known yet about this show set in Black Panther’s home country.\nUntitled Shang-Chi sequel\nRelease date: Unknown (In theaters)\nShang-Chi’s debut movie was compelling, exciting and fun. It also made a ton of money, so a sequel is inevitable. That the film’s director is making Avengers: The Kang Dynasty does throw it into limbo a bit.\nUntitled Wonder Man series\nRelease date: Unknown (On Disney+)\nMarvel Studios has announced that it’s moving ahead with a Wonder Man series. Shang-Chi and the Legend of the Ten Rings director Destin Daniel Cretton is attached to helm and Brooklyn 99 writer Andrew Guest (who also produced Hawkeye) is on board to showrun the series. On October 31, the title star was announced: genre favorite Yayha Abdul-Mateen II.\nUntitled mutants movie\nRelease date: Unknown (In theaters)\nNow that Disney owns the old Fox assets that included all the “mutant” Marvel superheroes, you can very likely count on characters like the X-Men making an MCU debut.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    }
  ],
  "argos_summary": "Fathom Entertainment is celebrating the Jim Henson Company’s 70th anniversary by re‑releasing the 1982 cult classic The Dark Crystal in theaters on October 12‑13, complete with a new intro from Brian Henson. The article contrasts this nostalgic event with the 2019 Netflix prequel series The Dark Crystal: Age of Resistance, which was praised for its ambitious puppetry and world‑building but was cancelled after one season due to high costs and limited viewership. It notes that the series’ Emmy win and fan enthusiasm may keep the franchise alive, while the film’s return could spark renewed interest in the broader Dark Crystal mythos. The piece also touches on the broader context of fantasy media, including other franchise releases and industry trends, but focuses primarily on the legacy and future prospects of the Dark Crystal universe.",
  "argos_id": "GB03FU7RZ"
}