{
  "url": "https://www.miamiherald.com/news/nation-world/national/article311873340.html",
  "authorsByline": "TJ Macias",
  "articleId": "8bbc837cdaf948f5b40692c91662aa27",
  "source": {
    "domain": "miamiherald.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.star-telegram.com/public/latest-news/l1pbz6/picture311875154/alternates/FREE_1140/IMG_543_fitted%20(1).jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T15:41:09-04:00",
  "addDate": "2025-08-27T19:51:01.063501+00:00",
  "refreshDate": "2025-08-27T19:51:01.063503+00:00",
  "score": 1.0,
  "title": "Cuddly dog that’s nearly blind needs new home after owner died. Meet Sassy",
  "description": "“She enjoys being talked to and perks up at voices she recognizes,” the Missouri shelter says.",
  "content": "A snuggly dog is in need of a warm lap to crawl into in Springfield after her own person died.\n\nSassy, a spritely senior pup who is looking for a second chance in her golden years, has been getting oodles of love at the Humane Society of Southwest Missouri but she’s on the hunt for a more permanent place, the shelter says.\n\n“Meet Sassy, a 10 year old Terrier mix looking for a calm and quiet home where she can thrive. She joined our shelter due to her previous owner sadly passing away. This little lady has some special needs - she is diabetic and hard of seeing, but that doesn’t stop her from being a loving and loyal companion,” the shelter said in an Aug. 26 Facebook post.\n\n“Our goal is to find her a forever home where she’ll be cherished and lovingly cared for day in and day out. With her age and reduced vision, we believe a home without energetic dogs and young children would be best for her.”\n\nEven though she’s partially blind, that doesn’t hold her back from wanting affection.\n\n“Sassy has the most loving heart and absolutely loves head scratches and being cuddled. She enjoys being talked to and perks up at voices she recognizes. You’ll often find her burrowed into blankets or snuggled up in a ball, and she loves nap time. She is house-trained, and when her paws touch the grass outside, she knows exactly what to do!” the shelter said.\n\nShe also has some special needs, which shouldn’t be an issue for people savvy with dogs’ medical needs, or those willing to learn.\n\n“Sassy also knows the routine with her diabetes and just needs an adopter experienced with insulin/blood sugar checks or one willing to learn,” the shelter said.\n\nTo learn more, visit Sassy’s pet profile or the shelter’s website.",
  "medium": "Article",
  "links": [
    "https://www.miamiherald.com/profile/241457351",
    "https://www.miamiherald.com/news/nation-world/national/article311869365.html#storylink=readmore_inline",
    "https://www.swh.org/",
    "https://www.miamiherald.com/news/nation-world/national",
    "https://twitter.com/TayloredSiren",
    "https://www.petplace.com/pet-adoption/dogs/25049881/PP602",
    "https://www.facebook.com/humanesocietyofsouthwestmissouri/posts/pfbid0CgPwSgUJrQuw2U7befJxxdFB3wPJr1BQi8Kj4z5B2YmvXsHkn9HjpekBD8orRoyTl"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new home",
      "weight": 0.08409364
    },
    {
      "name": "energetic dogs",
      "weight": 0.083156645
    },
    {
      "name": "Cuddly dog",
      "weight": 0.077873036
    },
    {
      "name": "Sassy",
      "weight": 0.07594622
    },
    {
      "name": "need",
      "weight": 0.0740396
    },
    {
      "name": "Southwest Missouri",
      "weight": 0.05850718
    },
    {
      "name": "dogs’ medical needs",
      "weight": 0.05830969
    },
    {
      "name": "reduced vision",
      "weight": 0.054683488
    },
    {
      "name": "head scratches",
      "weight": 0.05398824
    },
    {
      "name": "young children",
      "weight": 0.053476408
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.81005859375
    },
    {
      "name": "/Pets & Animals/Animal Products & Services/Animal Welfare",
      "score": 0.72802734375
    },
    {
      "name": "/Pets & Animals/Pets/Dogs",
      "score": 0.69970703125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.5595703125
    }
  ],
  "sentiment": {
    "positive": 0.22829717,
    "negative": 0.31620687,
    "neutral": 0.45549598
  },
  "summary": "Sassy, a 10-year-old Terrier mix, is seeking a new home after her previous owner died. The Humane Society of Southwest Missouri is looking for a permanent home and believes a home without energetic dogs and young children would be beneficial for her. Despite being partially blind, Sassy remains a loyal companion and enjoys being cuddled and being talked to. She is house-trained and knows the routine with her diabetes.",
  "shortSummary": "A 10-year-old Terrier mix called Sassy is seeking a new home after her owner died, needing support and understanding from potential adopters.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "aee0efd8b6584e4e8d73051c87bc8117",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.swh.org/",
      "text": "|\nWe operate the largest No Kill shelter in Southwest Missouri.\nThe Humane Society of Southwest Missouri is an independent, 501(c)3 non-profit organization licensed by the Missouri Department of Agriculture. Funding for the organization comes from private donations. We do not receive any funding from the Humane Society of the United States, Humane Society of Missouri, SPCA, or any government agencies. Our Mission The mission of the Humane Society of Southwest Missouri is to aid in the alleviation of distress and suffering of animals by operating a shelter for animals in need of care, placing animals in suitable homes, and offering educational programs that promote animal welfare. Our Mailing and Physical Address 3161 W. Norton Road Springfield, Missouri 65803 Adoption Hours Monday-Saturday: 12–6pm Sunday: 12–5pm |\n|\nTimes are tough and not likely to get easier anytime soon. Expenses are up, adoptions are down, and we're inundated with sick and injured animals but continue to do everything we can. We often ask for help, but opportunities like this are rare! Our amazing donors, John and Mary Cooper, have decided to match all donations made through August 31st dollar for dollar up to $15,000! That would mean a whopping $30,000 for our shelter animals if we can achieve our goal of raising $15,000 in donations!\nSo, if you've been thinking about donating, now's the time to make your gift go twice as far. We need your help in order to make our goal! For mail-in donations, please make checks payable to Humane Society of Southwest Missouri and write $ for $ in the memo line.\nHumane Society of Southwest Missouri 3161 W. Norton Road Springfield, MO 65803 |\n|\nMusicians for Mutts: Saturday, September 6 from 1-9pm at Archie's Lounge\nJoin us on September 6 for a day packed with live music, delicious food, exciting raffles, and, most importantly, supporting a great cause! Enjoy amazing performances by several local bands both inside and outside throughout the day, as well as tasty eats and drinks to keep you fueled while you enjoy the music and fun. If you're an animal lover and a music lover, this is an event you won't want to miss! |\n|\nLow-Cost Vaccination & Microchip Clinic: Saturday, September 20, from 9am-1pm at the Humane Society\nWe're hosting our monthly low-cost vaccination and microchip clinic Saturday, September 20, starting at 9am! If your pet is in need of a vaccine or microchip, we encourage you to stop in. We accept walk-ins only, so no appointment is needed! Spots are limited to 80 people, and each individual can bring up to 3 pets with them. It's first come, first served! This event will take place at our shelter located at 3161 W. Norton Road, Springfield, MO. |\n|\nWag N' Walk Fundraiser: Saturday, September 27 starting at 9:30am\nJoin us for a tail-waggin' good time at our first-ever dog walk fundraiser! Enjoy a beautiful morning filled with furry friends, fresh air, and fundraising fun at the scenic Rutledge-Wilson Farm Park. Whether your pup loves to strut their stuff or prefers a slower, sniff-filled stroll, this walk is for animal lovers of all ages and energy levels. Choose your own pace on a scenic walk up to 3 miles. After your walk, stick around to enjoy:\nAll proceeds benefit our shelter – giving pets the second chances they deserve. Register early to guarantee your spot. Every step supports shelter pets! Register to walk or for a sponsorship by clicking the button below or at wagnwalk.givesmart.com. |\n|\nBusiness Hours\nAdoption Center\n|\nLocation\n3161 W. Norton Road, Springfield, Missouri 65803 |"
    }
  ],
  "argos_summary": "Sassy, a 10‑year‑old terrier mix who is diabetic and partially blind, is looking for a calm, quiet forever home after her previous owner passed away. The Humane Society of Southwest Missouri, a no‑kill shelter in Springfield, Missouri, is promoting her adoption and highlighting her loving nature, house training, and need for an experienced caregiver. The shelter also shares fundraising efforts, including a donation match campaign and upcoming community events to support its mission and animal care programs.",
  "argos_id": "KRR2YNJYX"
}