{
  "url": "https://www.cnet.com/tech/taylor-swift-is-engaged-her-post-smashed-an-instagram-record-is-number-eight-on-most-liked-non-soccer-list/",
  "authorsByline": "Gael Cooper",
  "articleId": "d283df52282b46ce85f786dc28c0c41b",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/43db830cd32ec3dc5b2136ca1143b3126207c0bf/hub/2025/08/26/7947b163-8113-485b-82e5-416bf12fab3c/taylor-travis-pic-2.png?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T18:41:00+00:00",
  "addDate": "2025-08-27T18:58:59.547393+00:00",
  "refreshDate": "2025-08-27T18:58:59.547396+00:00",
  "score": 1.0,
  "title": "Taylor Swift Is Engaged. Her Post Is Climbing Instagram's Most-Liked List",
  "description": "The post is now at No. 8 for non-soccer related posts, with 30 million likes.  Plus: Memes, and details on her dress, his sweater and that ring.",
  "content": "Nobody is shaking this off: Pop superstar Taylor Swift and Kansas City Chiefs tight end Travis Kelce announced their engagement on Instagram on Tuesday, and the likes exploded like pyrotechnics at a concert. The post broke Instagram's record for reposts, even though, to be fair, reposting just started on Instagram in August. Still, the post hit 1 million reposts in less than 6 hours and earned 14 million likes in just the first hour.\n\nBy Wednesday, it had topped 30 million likes, vaulting it to number eight on Instagram's list of top non-soccer posts.\n\n\"Your English teacher and your gym teacher are getting married,\" Swift and Kelce wrote on an Instagram post showing multiple photos of the proposal. In the first photo, Kelce is kneeling in front of Swift in a breathtaking floral garden. The second photo shows them standing and holding one another. The next is her hand with an enormous diamond engagement ring, followed by two more of the couple embracing.\n\nThe post also features a dynamite emoji and the audio of Swift's 2024 song So High School. The snippet cuts off with the lyrics, \"Are you gonna marry, kiss, or kill me?\" (Let's hope it's the first or second option.)\n\nInstagram post is already climbing into the millions\n\nAs you might expect, the Instagram post delivering the engagement news shot into the stratosphere as soon as it was posted. A representative for Instagram confirmed to CNET that Swift and Kelce's engagement announcement earned over 14 million likes and 452,000 reposts in just over an hour.\n\nThat's a huge audience, but it will be interesting to see how high up Swift and Kelce's engagement news post lands on Instagram's all-time most popular list.\n\nRight now, the most popular post ever on Instagram is from 2022, when soccer star Lionel Messi posted an image of himself hoisting the just-won World Cup. That post has more than 74 million likes. (Swifties, keep it going if you want to send the Swift-Kelce post to the top.)\n\nThe Instagram representative didn't immediately comment on whether Swift and Kelce's post is climbing at the same pace as Messi's. Messi also has the third-most popular post, again showing him and the World Cup trophy, this time snuggled up in bed together.\n\nBut it's not just soccer photos that top the Instagram most-viewed-ever list. The second most-liked post of all time is a photo of a plain, ordinary egg, posted to the social network back in 2019 as part of someone's experiment to see if such a mundane image could go hugely viral. I interviewed the person behind Eugene the Egg back in 2019 and am shocked to see it's still in the No. 2 spot six years later, with more than 60 million likes.\n\nAs of Wednesday afternoon, the post had reached 30 million likes, and was sitting at number eight on Instagram's list of top posts that aren't soccer-related. If it can garner 900,000 more likes, it can jump into seventh place, passing a reel of a smiley baby.\n\nDetails on the ring and outfits\n\nAccording to The New York Post, Swift is wearing a blue silk-blend Polo Ralph Lauren dress in the photo, and Kelce is wearing a navy cable-knit Polo Ralph Lauren sweater. The Post also reports that Swift's new engagement ring is \"an old mine brilliant-cut diamond in a gold bezel setting, which was designed by Kelce himself with the help of Kindred Lubeck of Artifex Fine Jewelry.\"\n\nOld mine refers to a historic diamond cut popular from the early 18th century to the late 19th century. Such diamonds are square with rounded corners and have 58 facets, making them anything but a \"paper ring.\"\n\nThe Post delved into everything else Swift had on, including her cognac-colored Louis Vuitton sandals, $18,000 diamond-studded Cartier Santos Demoiselle watch and her \"TNT\" friendship bracelet by Wove, which was a Christmas gift from her new fiancé.\n\nTo no one's shock, the $400 dress Swift is wearing is selling out fast. Just imagine the excitement when the wedding details start trickling out, and Swift begins to \"pick out a white dress,\" as Juliet does in Swift's hit song Love Story.\n\nUntil we have more information about the upcoming wedding, fans will have to content themselves by creating and sharing memes because, well, it's 2025, and that's part of how we communicate these days.\n\nThe Instagram account belonging to the Prince and Princess of Wales even liked the post. (No surprise, really, they hung out when Swift played London.)\n\nEven coffee giant Starbucks got into the act, making a joke about pumpkin spice lattes and posting, \"Are we supposed to keep posting about PSL like nothing happened?\" The company also noted in the post's comments that \"the long list of Starbucks lovers just got a +1.\" (\"Starbucks lovers\" is a sly reference to a lyric in Swift's 2014 song Blank Space. Swift actually sings, \"got a long list of ex-lovers,\" but almost anyone with working ears mishears it as something like, \"all the lonely Starbucks lovers.\")\n\nOne meme post on X showed Paul Revere's famed ride, captioned \"me telling everyone I know that Taylor Swift got engaged.\"\n\nOne Bluesky user wrote, \"Very interesting that Taylor Swift got engaged mere months after I did. Get your own thing.\"\n\nAnother joked, \"Can't believe that on July 8th, 2023, @likethe309, Travis Kelce and I all walked into Arrowhead Stadium to attend the Eras Tour and now one of us is marrying Taylor Swift.\"\n\nMatt Ufford warned the billionaire bride-to-be and her millionaire NFL star husband to count their pennies, writing, \"a word of warning to Taylor Swift and Travis Kelce: weddings can get EXPENSIVE, fast, be sure to leave enough in the account for your monthly expenses.\"\n\nThere were football jokes, of course.\n\nThe Detroit Free Press sought a local connection, using the headline, \"Tight end for Detroit Lions' Week 6 opponent gets engaged to Taylor Swift.\"\n\nOne person questioned the caption about an English teacher marrying a gym teacher, asking, \"Why does Taylor Swift think she's an English teacher and not a music teacher?\"\n\nWe're pretty sure this person really does know who Swift is, but their post was funny anyway. It reads, \"Okay, I'll bite: who's Taylor Swift? What's so great about him?\"\n\nThe two 35-year-old celebrities have been dating for two years. It's a love story, and Taylor just said yes.",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/p/CmYyND_OYMl/",
    "https://www.cnet.com/news/social-media/instagram-adds-new-features-including-reposts-and-maps/",
    "https://www.instagram.com/p/CmUv48DLvxd/",
    "https://www.cnet.com/culture/eugene-the-egg-instagrams-most-liked-photo-its-been-incredible/",
    "https://shop.getbezel.com/watches/cartier/santos-demoiselle-quartz-small-yellow-gold-diamond-set-silvered-roman-bracelet/ref-wf9001y7/listing/id-172244",
    "https://pagesix.com/2025/08/26/celebrity-news/taylor-swift-and-travis-kelce-engaged-after-2-years-of-dating/",
    "https://us.louisvuitton.com/eng-us/products/lv-isola-sandal-nvprod4940127v/1ACIOY",
    "https://pagesix.com/2024/02/02/style/taylor-swift-travis-kelce-tnt-bracelets-sparked-mad-dash-during-christmas-rush-we-delivered/",
    "https://www.vrai.com/journal/post/old-mine-cut?srsltid=AfmBOop0Q3mH81ihIyIp6qqMQMvC0YOk1QSsJ-xhd82oSU6m_65wVhS5",
    "https://pagesix.com/2025/08/26/style/taylor-swift-got-engaged-to-travis-kelce-in-this-ralph-lauren-dress/",
    "https://x.com/Siobachka/status/1960389888366219708",
    "https://www.instagram.com/p/DN071FR3vnm/?igsh=MzRlODBiNWFlZA%3D%3D",
    "https://www.youtube.com/watch?v=8zdg-pDF10g",
    "https://www.freep.com/story/sports/nfl/lions/2025/08/26/taylor-swift-engaged-travis-kelce/85834347007/",
    "https://www.cnet.com/tech/home-entertainment/taylor-swifts-best-lyrics-from-the-tortured-poets-department-to-debut/",
    "https://www.instagram.com/reel/C8CvU4ktJoj/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taylor Swift",
      "weight": 0.10720708
    },
    {
      "name": "Swift",
      "weight": 0.09691365
    },
    {
      "name": "Instagram post",
      "weight": 0.09532135
    },
    {
      "name": "Pop superstar Taylor Swift",
      "weight": 0.0941573
    },
    {
      "name": "top posts",
      "weight": 0.077849746
    },
    {
      "name": "Travis Kelce",
      "weight": 0.07105601
    },
    {
      "name": "top non-soccer posts",
      "weight": 0.06776929
    },
    {
      "name": "Instagram",
      "weight": 0.06541236
    },
    {
      "name": "Kelce",
      "weight": 0.06519322
    },
    {
      "name": "Kansas City Chiefs tight end Travis Kelce",
      "weight": 0.062441733
    }
  ],
  "topics": [
    {
      "name": "Social Media"
    },
    {
      "name": "Soccer"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Entertainment"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98828125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.8037109375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.603515625
    }
  ],
  "sentiment": {
    "positive": 0.38939413,
    "negative": 0.16000222,
    "neutral": 0.45060366
  },
  "summary": "Taylor Swift and Travis Kelce announced their engagement on Instagram, where the post broke Instagram's record for reposts. The post, which included multiple photos of the proposal, earned 14 million likes in just the first hour and topped 30 million likes, making it number eight on Instagram's top non-soccer post. The most popular post ever on Instagram is from 2022, with over 74 million likes. As of Wednesday afternoon, the post had reached 30 million views and was sitting at number eight. If it can garner 900,000 more likes, it could move into seventh place. The engagement ring is reportedly designed by Kelce himself and is an old mine brilliant-cut diamond.",
  "shortSummary": "Taylor Swift's Instagram engagement post, featuring a diamond ring designed by Travis Kelce, has become the most-liked post of all time.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1e1d6dfff57140e7a9f6aa316a8e1ed6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/culture/eugene-the-egg-instagrams-most-liked-photo-its-been-incredible/",
      "text": "So it's 2019, and everything is backwards. The government's shut down. Britain's breaking up with Europe. A plain ordinary egg is now the most-liked photo ever posted to Instagram , and that egg just emailed me.\nThe egg photo was posted on Jan. 4, and as of Jan. 15, it has more than 42 million likes. The account, titled world_record_egg, has 6.3 million followers. But so far, no one has been able to crack the identity of the person behind the account.\nBut I can tell you the egg has a name and is egg-ceptionally thankful for all the attention.\n\"Eugene the Egg is so appreciative of the amazing support, it has been incredible,\" the person behind the Instagram account told me in an email.\nWhen asked about the account's merchandise offerings -- currently, two shirts that say \"I LIKED THE EGG\" -- the response was, \"We're dropping a new design every day, and giving 10 percent of that to a chosen charity.\"\nAn Instagram personality who goes by Supreme Patty and has 6.2 million followers was rumored to be behind the egg. TMZ quoted a reported friend of Supreme Patty saying he was responsible, but the egg account later posted to TMZ via Instagram Stories that \"we're still anonymous. Fake news.\"\nThe egg confirmed this to me, writing, \"We deny that we are Supreme Patty,\" but would offer no more details about his or her identity.\nAccording to the UK Telegraph, the poster of the egg image lives in London, and took inspiration from a list of record-setting Instagram posts from 2018.\n\"I thought it would be an interesting experiment to try and beat the record with something as basic as possible,\" the egg poster told the Telegraph, \"which led to me deciding on the egg.\"\nAs for Supreme Patty, although he may not be the person behind the egg, he's having fun with it, and is now urging followers to help break the record for most shrimp emoji Instagram comments on an egg-related post of his own.\nHe also posted video of himself apparently getting a tattoo of the egg. \"You're so gonna regret that wtf,\" wrote Instagram user joonerboi.\nTurns out there are many famous pop-culture eggs out there.\nGeorge R.R. Martin, author of the books that inspired HBO's hit Game of Thrones, got in on the egg-ceptional mockery by tweeting a photo of one of the famous dragon eggs from the show, with the words, \"I, too, have a famous egg...\"\nOr course, someone had to turn it into a \"Where's the Winds of Winter?\" demand.\nTurns out Martin's not alone in his egg yolking. Harry Potter fans point out that their book and movie series also has a prominent egg. Retrieving the magical golden egg was part of the Triwizard Tournament detailed in Harry Potter and the Goblet of Fire.\nBut eggs aren't for everyone. Wrote Christine Sydelko on Twitter, \"I'm unfollowing everyone who liked that egg photo.\"\nNASA turns 60: The space agency has taken humanity farther than anyone else, and it has plans to go further.\nTaking It to Extremes: Mix insane situations -- erupting volcanoes, nuclear meltdowns, 30-foot waves -- with everyday tech. Here's what happens."
    },
    {
      "url": "https://www.vrai.com/journal/post/old-mine-cut?srsltid=AfmBOop0Q3mH81ihIyIp6qqMQMvC0YOk1QSsJ-xhd82oSU6m_65wVhS5",
      "text": "Impeccable origin\nOld Mine Cut: A Guide to a Storied Diamond Shape\nThe Old Mine Cut is a historic diamond cut that was the most common diamond cut from the early 18th century to the late 19th century, which corresponds to the Georgian and Victorian era. During the height of the popularity of this engagement ring cut, diamonds were cut by hand and their measurements were eyeballed.\nOld Mine Cut diamonds are square shaped with rounded corners and have 58 facets. However, no two Old Mine Cut diamonds are alike. You can recognize one by its small table, larger culet, and high crown.\nOld Mine cuts have grown in popularity over the years, and are now highly sought-after following Taylor Swift’s engagement to Travis Kelce. Swift’s engagement ring features an 8-carat bezel-set Old Mine cut diamond.\nExplore VRAI's full inventory of lab-grown diamond shapes to learn more about each diamond cut.\nHow Do I Identify an Old Mine Cut Diamond?\nOld Mine Cut diamonds have 58 facets, just like the modern-day Round Brilliant Cut, but the proportions largely differ from the ones sported in modern-era cuts. Compared to Round Brilliant diamonds, their table is smaller, their crown higher and their culet larger. In addition, their shape is more square than round.\nDiamond cutters fashioned Old Mine diamonds by following the shape of the diamond’s octahedral crystal. Because these diamonds predated modern technology, they were all cut by hand, so they lack a standardized and unified look and can be slightly asymmetrical.\nBest Settings for Old Mine Diamond Engagement Rings\nOld Mine diamonds work with engagement ring settings that emphasize their fire and their vintage-inspired feel.\nThe Flat Edge Bezel\nFor a bold, modern look — and a nod to Taylor Swift’s famous Old Mine cut engagement ring — choose a sleek Flat Edge Bezel. A flat, tapered band enhances its structured look, while the bezel and cathedral bridge invite light to flow through in this design.\nThe Signature Bezel\nWanting to recreate Taylor Swift’s Old Mind cut engagement ring in a more traditional style? Choose the Signature Bezel for a vintage-inspired design that will highlight the center stone to perfection.\nThe Three Stone\nA Three Stone setting with Baguette side stones frames the Old Mine Cut’s unique faceting in an elegant way. Choose this for a thoroughly vintage-inspired feel.\nThe Floating Split Band\nThis style is reminiscent of designs popular in the Georgian and Victorian era, so it naturally suits an Old Mine Cut diamond. Select this style for a timeless ring with a twist.\nThe Classic Two Tone\nThe Classic Two Tone setting is vintage-inspired too as having prongs and shank in different colors was typical of 19th and early 20th century jewelry design.\nOld Mine Cut Detail\nHistory of the Old Mine Cut Diamond\nThe term Old Mine cut was first used in the late 1800s despite the cut’s actual popularity starting in the early 1700s. It has also been called the “Old Miners Cut” and the “Miners Cut”. At the time,Old Mine specifically identified any colorless or near colorless diamonds hailing from Indian and Brazilian mines, as opposed to the newly discovered mines in Africa, whose production and output was gaining more and more prominence.\nSubsequently, it came to indicate any diamond in that cut that had a high color grade, regardless of provenance, and eventually, it defined all diamonds that had a square-ish shape, a high crown, a small table, and a large culet.\nNotable Diamond: The Grand Mazarin Diamond\nThe Grand Mazarin is a diamond with 17 crown and 17 pavilion facets that became its own cut. The shape, however, contains some visual similarities to what would then become the Old Mine diamond.\nCardinal Mazarin was the Chief Minister of France from 1642 to 1661 and was the de facto ruler when king Louis XIV was still a child. He accumulated a substantial diamond collection: he financed the trips to India of Jean-Baptiste Tavernier, a pioneer of the diamond trade. He bequeathed 18 diamond jewels to the Crown of France. Among these is the Grand Mazarin diamond, a 19.07-carat pink diamond.\nIt was extracted at Golconda. This part of the Indian plateau of Deccan is where some of the most visually remarkable diamonds were unearthed. These include the Koh-I-Noor, the Regent, the Wittelsbach-Graff.\nThe Peruzzi Diamond\nThe Peruzzi diamond is a diamond that then set the standard for its own cut–the Peruzzi cut, and was created in the 17th century in Venice by Vincenzo Peruzzi. The Peruzzi diamond is credited for being the first diamond consisting of 57 facets, a table, and a culet. It is a square-ish diamond with a small rectangular notch in the top left or right corner. Note that one of the corners has a small cut-out, which ensures that if the diamond falls on its corner, it won't break easily. Given its square-ish shape and the numbers of facets, it can be considered a precursor to the Old Mine diamond.\nWhat Is the Difference Between Old European and Old Mine Diamond?\nIt’s easy to confuse the Old Mine Cut with the Old European diamond. The easiest way to tell them apart is to compare their two diagrams. In the case of the Old Mine cut, it has a square-ish shape, a small table but large diamond-shaped facets on the crown, and large facets on the pavilion coupled with a large culet.\nThe Old European cut is round in shape, and its facets (including the culet) are smaller and more symmetrical than the one found in the Old Mine diamonds.\nBoth shapes have a greater total depth compared to modern Round Brilliant diamonds.\nHow Does an Old Mine Cut Diamond Compare to Modern Shapes?\nThe Old Mine Cut is a historical cut that was the basis of the Cushion cut due to its rounded corners and square-ish shape. It bears some similarities with the Round Brilliant Cut too, even though the Old Mine cut is square-ish in shape rather than round.\nOld Mine Cut vs Round Brilliant Diamond\nThe Round and the Old Mine Cut diamond share the same number of facets (57-58) and have a similar faceting pattern, as both are considered Brilliant cutsen. That’s where the similarities end. The Old Mine diamond has a square shape, the Round Brilliant is round and symmetrical. The Old Mine Cut has a much higher crown and a deeper pavilion compared to the Round Brilliant cut. The proportions and depth of the Old Mine cut were optimized for the diamond to shimmer under candlelight, while the facets of the Round diamond were designed for maximum scintillation under electric light. In addition, the facets are larger, and rougher-cut than the ones in modern Round Brilliant diamonds, which creates more fire and more noticeable flashes of rainbow-colored brilliance.\nOld Mine Cut: the Antique Cushion Cut\nThe Cushion Cut is considered the contemporary version of the Old Mine Cut. They share the square-ish shape and the brilliant-cut facets. “Cushions are the modern diamond with the most variance in their faceting pattern, which harkens back to both Old European and Old Mine Cut since those were cut individually by hand and could vary drastically from stone to stone and cutter to cutter,” says Grace Taylor, VRAI’s Senior Director of Sales and Customer Experience.\nOld Mine Cut Diamonds and the 4Cs\nOld Mine cuts have larger facets that maximize fire, similar to the modern Cushion diamond. The large facets of this diamond shape, however, make both inclusions and colors more visible especially at higher carat weights. “Old Mine Cuts are going to be less brilliant than modern diamonds because of the chunkier facets and higher crowns,” warns Grace Taylor. “They work particularly well in warmer colors, because antique Old Mine Cuts just tended to have more visible warmth and we now associate that with vintage charm.”\nBy today’s standards diamonds might have a lower cut grade but that’s not a defect of the stone itself. Old Mine diamonds were hand-cut and polished prior to the invention of refined mechanical tools, so they have a hand-cut feel that may look less precise and sharp than what we’re used to in contemporary stone cutting.\nAre there lab-grown Old Mine Cut diamonds?\nLab grown diamonds cut in the Old Mine shape are quite hard to find, even though a thorough search can yield some results. They’re often called “Old Mine Cushion” or “Antique Cushion” cut. In the case of VRAI created diamonds, Taylor recommends the Elongated Cushion shape. Each Elongated Cushion has different proportions and length-to-width ratios, coupled with the intense fire cast by the larger facets. All of these characteristics reproduce the hand-cut feel of Old Mine diamonds.\nWhat Is a VRAI Created Diamond?\nA VRAI created diamond is a lab grown diamond created in a zero-emissions foundry then cut and polished by master craftspeople. This means all VRAI created diamonds result from no mining, no human toll, no emissions. VRAI’s lab created diamonds are chemically, physically, and optically identical to mined diamonds. This means you can get more carats for less.\nHow To Have A VRAI Created Diamond Cut for You™\nWith VRAI’s Cut for You™ offering, you can have your very own center stone cut and polished to your exact specifications. Whether you’re looking for a more timeless Cushion, a trending Elongated Cushion, or even a Moval — the perfect blend of a Marquise and Oval — at the center of your engagement ring, VRAI can create the unique Old Mine cut you’re looking for in the carat weight of your choice.\nCreate Your Dream Ring With VRAI\nHave you been drawn to the romance of an Old Mine cut for years, or are you new to the style thanks to Taylor Swift’s engagement ring from Travis Kelce? Regardless of what’s caught your attention, make this style your own with help from our diamond experts. Book an appointment for personalized guidance, custom options, and more to make your dream ring a reality."
    },
    {
      "url": "https://pagesix.com/2024/02/02/style/taylor-swift-travis-kelce-tnt-bracelets-sparked-mad-dash-during-christmas-rush-we-delivered/",
      "text": "Taylor Swift and Travis Kelce’s ‘TNT’ bracelets sparked mad dash during ‘Christmas rush’: ‘We delivered’\nThey made the friendship bracelets; now, they’re taking the moment and tasting it.\nWove CEO Simone Kendle tells Page Six Style that Travis Kelce placed a special order for a duo of matching “TNT” bracelets for himself and girlfriend Taylor Swift “a few days before Christmas,” and that her company worked around the clock to make magic happen.\n“We created what usually takes three weeks — a couple of bracelets — in a matter of three days, and during the Christmas rush,” Kendle says. “Our team was all over the place trying to make it happen. But we did — we delivered.”\nThat hustle paid off; about a month later, Swift embraced Kelce on camera after the Kansas City Chiefs beat the Baltimore Ravens to advance to the Super Bowl, giving the whole world a glimpse at her bespoke bauble.\n“I think it’s a nod to them,” Wove’s lead jewelry consultant, Kendall Junck, tells us of the three letters Kelce chose to add to both bracelets, quipping, “They’re such a dynamite couple.”\nRelated Video\nAll the details on Taylor Swift's look from the Chiefs vs. Ravens playoff game\nCrafted from 14-karat yellow gold and studded with around 4.5 carats of lab-grown diamonds, Swift’s bracelet retails for $6,360 and is part of Wove’s collaboration with Michelle Wie West. And from the moment it launched, the pro golfer hoped to somehow get the piece onto the Grammy winner’s wrist.\n“We were launching the Michelle Wie West collection back in November. Michelle and I were talking about the bracelet, and we were seeing it in person for the first time together, and she was just like, ‘Oh my gosh, what if we could get Taylor to have this bracelet? Because I’m friends with Travis,'” Kendle recalls.\n“And so she reached out to Travis, showed him that, hey, look, we have this really cool bracelet, and he said he would give it to her.”\nWhile the actual order didn’t come until right before the holidays, it’s fitting that Kelce would pick a personalized friendship bracelet as a way to express his love; after all, the NFL great famously tried (and failed) to give Swift a version beaded with his phone number during her Eras Tour stop in Kansas City in July.\n“And now, they’re together and [wearing] diamond bracelets made with the same beads,” Junck says. “It truly is full circle.”\nAdding to the “iconic” factor of the moment, she notes, is the fact that Swift helped inspire the design even before Kelce came calling.\n“Our inspo board was all different photos of bracelets I swapped on the subway to and from the Pittsburgh show, bracelets that [Michelle and her] daughter have made for fun at home. The friendship bracelet idea was very much inspired by the Eras Tour and by Taylor. So I think that’s why it was such a great match for Travis,” Junck explains.\nIt’s also proven to be a great match for many other Swifties; in a matter of just a few days, her bracelet has become Wove’s “full-blown hero product,” per Kendle.\n“It has been incredible. Our followers have since doubled on our social platforms. We saw a 5,000 percent increase in website traffic. Sales are well into the six figures on this collection alone, and it’s growing daily. We’re super grateful for this moment,” she tells us.\nOn Thursday night, Wove even dropped a “more accessible” version of the design with a sterling silver paper clip-style chain, which starts at $290.\n“Our site was about to crash,” Kendle says of the ensuing demand for the lower-priced piece, a departure from the diamond dazzlers for which Wove is known. “Our real bread and butter has always been engagement rings!”\nSpeaking of which, should Kelce commission a custom sparkler from the company before popping the question, Junck has some ideas about what she’d create.\n“I could see her being a yellow gold girl, so probably something yellow gold. One hundred percent something bespoke; she’s not getting just the simple solitaire … I could see her [going for] something more vintage-inspired, maybe Art Deco-y. Some ornate details on the piece, but nothing gaudy. And there are so many different eras you could go off of.”\nKendle notes that Wove often makes engagement rings with “hidden stones,” suggesting, “She could have little gemstones for every era, in different colors.”\nAdds Junck, “Something in there, secret and hidden — whether it’s an engraving or secret stones — would be a really sweet idea, because no photo would be able to get that. It’d be just for her.”\nFor more Page Six Style ..\n- See the best celebrity looks of the week in our new series, “Instantly Iconic Style”\n- Browse the best fashion and beauty products, according to celebs\n- Shop our exclusive merch\nUltimately, the jewelers are just overjoyed to have created a special moment for “one of the most iconic couples of our generation,” as Kendle puts it.\n“Taylor and Travis are probably the most humble, normal celebrities out there … he just happens to be one of the greatest football players, and her one of the greatest singers. I think it’s just such an American hero story, and we’re so happy to be a part of it.”"
    },
    {
      "url": "https://pagesix.com/2025/08/26/celebrity-news/taylor-swift-and-travis-kelce-engaged-after-2-years-of-dating/",
      "text": "Taylor Swift and Travis Kelce engaged after 2 years of dating\nIt’s a love story, baby, she said, “Yes.”\nTaylor Swift and Travis Kelce are engaged after two years of dating, the couple confirmed via Instagram Tuesday.\n“Your English teacher and your gym teacher are getting married 🧨,” they captioned several photos from the dreamy proposal.\nThe Kansas City Chiefs tight end, 35, was photographed getting down on one knee in a beautiful garden and presenting Swift, also 35, with an engagement ring.\nThe “Love Story” singer’s sparkler featured an old mine brilliant-cut diamond in a gold bezel setting, which was designed by Kelce himself with the help of Kindred Lubeck of Artifex Fine Jewelry.\nSwift appeared over the moon as she hugged and kissed her new fiancé before the pair posed for photos in celebration of their milestone moment.\nFor the proposal, Kelce made sure to coordinate their outfits as Swift wore a blue Polo Ralph Lauren dress while he rocked a navy cableknit sweater by the same label.\nThey announced their engagement two weeks after the singer sat down for her first-ever podcast interview on his “New Heights” show, where she also announced her 12th album, “The Life of a Showgirl,” which will debut on Oct. 3.\nHowever, Page Six confirmed that Kelce popped the question “a couple of weeks ago.”\nThe twosome began dating in the summer of 2023, and since then, fans have been predicting a possible engagement.\nIn August 2024, NFL insider Adam Schefter went viral for suggesting the pair were headed for the altar during a fun segment on “NFL Live.”\nDuring the episode, Laura Rutledge discussed Kelce’s decision to become part-owner of a 3-year-old racehorse named after the singer, which she teased as a “big purchase.”\n“No, not an engagement ring, but it was Swift-adjacent,” Rutledge said. “The Chiefs’ tight end [purchased] a racehorse named — wait for it — Swift Delivery.”\nHowever, Schefter was quick to jump in, asking why Rutledge believed Kelce hadn’t already bought a ring and how she “had that information” — which she remained tight-lipped about.\nA few weeks earlier, an insider told Page Six that Kelce had a plan in place to get on bended knee and that an engagement was “happening soon.”\nThe update came days after Morgan Wallen concertgoers overheard the wife of a top Chiefs exec discussing the pair’s plan to get married.\nWe also reported in that Kelce had already asked Taylor’s father, Scott Swift, for her hand in marriage.\n“Scott has been asked for his blessing and has wholeheartedly given it, and Travis has been talking to friends about a ring,” a source close to Kelce told us at the time.\nThe following year, Swift ignited new engagement rumors when her hand appeared blurred in photos from the Eras Tour wrap party and later covered her fingers in leather gloves for an NFL game.\nIn May, the Daily Mail reported that the next step in their romance would be a “front and center … conversation” once Kelce wraps up his football career.\nPrior to the pair’s high-profile connection, the “Anti-Hero” singer had a short-lived fling with The 1975 frontman, Matty Healy.\nFollow Page Six’s Taylor Swift live updates for the latest news, photos, fan theories and more\nThe former couple’s romance began in May 2023 and — despite fizzling out a month later — fans believe it inspired a large chunk of her songs on “The Tortured Poet’s Department.”\nAnother portion of the album seemingly detailed her breakup from Joe Alwyn, whom she split from in 2023 after more than six years together.\nThe “Fortnight” singer began dating Kelce just a few months after calling it quits with Alwyn — and is believed to have written “So High School” and “The Alchemy” about her athlete beau.\nKelce, who was also coming off a breakup with longtime girlfriend Kayla Nicole when he met Swift, famously tried and failed to give the pop star his number at an Eras Tour show.\nDespite Swift declining to meet Kelce backstage in July 2023, they subsequently connected and the rest is history.\nThis story was featured on a recent episode of Page Six Radio, a daily morning show serving up the hottest celebrity headlines, exclusives, and behind-the-scenes buzz. Catch Danny, Evan and Ian chat with celebrity guests every weekday on SiriusXM from 8 a.m. to 10 a.m. ET on Stars Ch. 109.\nSiriusXM service required. See Offer Details."
    },
    {
      "url": "https://pagesix.com/2025/08/26/style/taylor-swift-got-engaged-to-travis-kelce-in-this-ralph-lauren-dress/",
      "text": "Taylor Swift got engaged in this Polo Ralph Lauren dress — and it’s selling out fast\nIt’s a love story, baby just say yes (to the dress).\nTaylor Swift and Travis Kelce announced their engagement on Tuesday, posting photos of the gorgeous garden where the football star popped the question.\nAnd while Page Six Style can confirm her old mine brilliant-cut engagement ring is a custom design by Kindred Lubeck of Artifex Fin Jewelry, the silk-blend Polo Ralph Lauren Striped Dress she wore for the big day is actually available to shop.\nPolo Ralph Lauren Striped Dress\nThough it’s already selling out swiftly in select sizes, it’s miraculously still in stock at several major retailers (for now).\nShop similar styles\nShould you miss out on the exact design, we also found several likeminded striped styles from the brand, like the 50%-off Lauren Ralph Lauren Stripe Linen Dress and the Polo Ralph Lauren Striped Cotton Paneled Shirtdress.\nThe engaged couple is already in sync sartorially, as Kelce wore a cable-knit polo from Ralph Lauren to get down on one knee.\nFor her part, Swift completed her look with her go-to diamond-encrusted Panthère de Cartier watch — worth a whopping $32,000 — and a pair of brown Louis Vuitton sandals.\nAnd while it’s unclear which lipstick she was wearing, the cinnamon tone looks strikingly similar to Nars Morroco — a warm hue her makeup artist, Lorrie Turk, once confirmed she’s previously worn.\nNars Lipstick in Morocco\nThough unconfirmed, fans also speculated Swift was wearing Nars while announcing her new album, “The Life of a Showgirl,” on Kelce’s “New Heights” podcast.\nWith today’s news, it seems she’ll soon be trading the album’s signature orange hue for bridal white.\nWhy Trust Page Six Style Shopping\nThis article was written by Hannah Southwick, Commerce Writer/Reporter for Page Six Style. Hannah spies deals on actually affordable celebrity-worn styles, puts Hollywood’s favorite labels to the test and finds the beauty products that keep stars red carpet-ready. She consults stylists and industry pros — including celebs themselves — for firsthand product recommendations, trend predictions and more. In addition to writing for Page Six since 2020, her work has been featured in USA Today and Parade."
    },
    {
      "url": "https://www.cnet.com/tech/home-entertainment/taylor-swifts-best-lyrics-from-the-tortured-poets-department-to-debut/",
      "text": "Taylor Swift's vast musical catalog has something for just about everyone, from fans of bops (Alexa, play 1989) to those who enjoy heart-wrenching ballads (See: Folklore, Evermore and The Tortured Poets Department). Every time Swift releases an album, fans know we're in for a rollercoaster ride of powerful emotion, strong storytelling and revealing personal narrative.\nOn the heels of her latest album release, The Tortured Poets Department, we Swifties have been busy decoding and absorbing lyrics from a whopping 31 songs poignantly chronicling heartbreak, grief, love and trauma. In addition to new album drops, fans now also look forward to rereleases of the singer-songwriter's first six albums, which include never-before-released \"From the Vault\" songs.\nSee also: The Complete Guide to Taylor Swift's New 'Tortured Poets' Double Album, by Fans for Fans\nHere are some of my all-time favorite lyrics Swift has written. This doesn't include every great line she's ever penned (otherwise this list would be much, much longer). Rather, they're lyrics I've often reflected on and discussed with fellow fans, and have found deep personal meaning in.\nThe tearjerkers\n\"You can plan for a change in the weather and time, but I never planned on you changing your mind.\" (Last Kiss)\n-- A poetic way of describing unforeseen heartbreak.\n\"You call me up again just to break me like a promise, so casually cruel in the name of being honest.\" (All Too Well)\n-- I could quote this entire song because it's a lyrical masterpiece. But I'm trying to be selective.\n\"And you say I abandoned the ship, but I was going down with it, my white knuckle dying grip, holding tight to your quiet resentment.\" (So Long, London)\n-- At a certain point, you've just got to let go.\n\"You know there's many different ways that you can kill the one you love, the slowest way is never loving them enough.\" (High Infidelity)\n-- Emotional pain can be the most lethal.\n\"You kept me like a secret, but I kept you like an oath.\" (All Too Well, 10 Minute Version)\n-- This line succinctly illustrates the very different way two people can view the same relationship: One as something sacred and cherished, the other as something to keep hidden and downplay. That distinction can make all the difference.\n\"If I'm dead to you why are you at the wake, cursing my name, wishing I stayed?\" (My Tears Ricochet)\n-- Chilling, haunting lyrics. It's what Swift does best.\n\"And now that I'm grown, I'm scared of ghosts, memories feel like weapons.\" (Would've, Could've, Should've)\n-- There are some moments that will always haunt you, no matter how much time passes.\n\"I was so ahead of the curve, the curve became a sphere. Fell behind all my classmates and I ended up here.\" (This is Me Trying)\n-- This is a relatable sentiment for anyone who has high ambitions but feels like they just can't make them a reality, or who finds themselves drawing comparisons to others.\n\"What we thought was for all time was momentary, still alive, killing time at the cemetery, never quite buried.\" (Loml)\n-- Some things, you expect to live forever.\n\"You come away with a great little story of a mess of a dreamer with the nerve to adore you.\" (Cold As You)\n-- From the earliest days of her career, Miss Swift knew how to nail a tearjerker.\n\"Criticize the way you fly when you're soaring through the sky, shoot you down and then they sigh and say, \"She looks like she's been through it.\" (Nothing New)\n-- This From the Vault track from Red is a chilling look into the anxiety Swift felt at this point in her career, and feels like an ominous foreshadowing of the media target she'd truly become in the coming years.\n\"I rewind thе tape but all it does is pause on thе very moment all was lost.\" (Evermore)\n-- It can be difficult to overcome the moment everything fell apart and we find ourselves replaying that pain over and over, rather than seeing the bigger picture and the light at the end of the tunnel.\n\"There'll be happiness after you, but there was happiness because of you. Both of these things can be true.\" (Happiness)\n-- A truly accurate characterization of both the optimism and struggle of getting over someone.\n\"You taught me about your past thinking your future was me.\" (All Too Well)\n-- OK sorry, I couldn't help it -- one more from All Too Well. This is one of my all-time favorite lyrics. In just a few words, it sums up the fallen dreams of doomed love.\n\"Wasn't it beautiful running wild 'til you fell asleep, before the monsters caught up to you?\" (Innocent)\n-- A tragic ode to innocence and youth.\n\"Who could ever leave me, darling, but who could stay?\" (Archer)\n-- Swift poignantly depicts the dichotomy between feeling worthy of love and questioning that very right.\n\"You kicked out the stage lights, but you're still performing.\" (The Smallest Man Who Ever Lived)\n-- Even after the \"show\" is over, some people may not demonstrate who they really are.\n\"You had a speech, you're speechless. Love slipped beyond your reaches.\" (Champagne Problems)\n-- Oh, how quickly things can change and render our dreams useless.\n\"You're not my homeland anymore, so what am I defending now?\" (Exile)\n-- Cold, sharp lyrics to convey the struggle of coping with detrimental loss.\n\"I don't like that falling feels like flying 'til the bone crush.\" (Gold Rush)\n-- How does one come up with a line this poetic?\n\"You swore that you loved me but where were the clues? I died on the altar waiting for the proof.\" (So Long, London)\n-- All talk and no action.\n\"Just because you're clean don't mean you don't miss it.\" (Clean)\n-- Truer words on lost love have never been spoken.\n\"Time is taking its sweet time erasing you, and you've got your demons and darling, they all look like me.\" (Sad Beautiful Tragic)\n-- Moving on and forgetting isn't always easy.\n\"I guess it's true that love was all you wanted, 'cause you're giving it away like it's extra change. Hoping it will end up in his pocket, but he leaves you out like a penny in the rain, oh, 'cause it's not his price to pay.\" (Tied Together With a Smile)\n-- Symbolism is something Swift has always done quite well.\n\"Take the words for what they are: a dwindling, mercurial high; a drug that only worked the first few hundred times.\" (Illicit Affairs)\n-- Ah, the fleeting, deceptive nature of ephemeral love.\n\"It turns out freedom ain't nothin' but missing you.\" (Back to December)\n-- This is a deep, personal admission of making a grave mistake, which is never easy to own up to.\n\"If I can't relate to you anymore, then who am I related to?\" (Coney Island)\n-- It can be all too easy to become so consumed in a relationship that you feel lost when it ends.\n\"A greater woman has faith, but even statues crumble if they're made to wait.\" (The Prophecy)\n-- Patience can take its toll on anyone.\n\"Please don't ever become a stranger whose laugh I could recognize anywhere.\" (New Year's Day)\n-- This level of specificity is a vivid illustration of just how much she fears losing the love of her life.\n\"I hate to make this all about me, but who am I supposed to talk to? What am I supposed to do if there's no you?\" (Soon You'll Get Better)\n-- There's a reason this song gets Swift choked up.\n\"Old habits die screaming.\" (The Black Dog)\nIt's not so easy to move on.\n\"Only 20 minutes to sleep, but you dream of some epiphany.\" (Epiphany)\n-- This song, a moving tribute to health care workers during the pandemic, never fails to give me goosebumps.\n\"The old widow goes to the stone every day. But I don't, I just sit here and wait, grieving for the living.\" (Ivy)\n-- Loss comes in all forms.\nLove's a game, wanna play?\n\"'Cause you know I love the players and you love the game.\" (Blank Space)\n-- It takes two to tango.\n\"You paint me a blue sky and go back and turn it to rain. And I lived in your chess game, but you changed the rules every day.\" (Dear John)\n-- Swift always does an incredible job of conveying the game-like nature of love. These lyrics are particularly heart-rending.\n\"You did a number on me, but honestly, baby, who's counting?\" (So it Goes...)\n-- I love when she gets all poetic like this.\n\"We never painted by the numbers, baby, but we were making it count.\" (The 1)\n-- Another fun instance of word play.\n\"It's poker, you can't see it in my face, but I'm about to play my ace.\" (New Romantics)\n-- Brilliantly clever.\n\"We are alone with our changing minds, we fall in love 'til it hurts or bleeds or fades in time.\" (State of Grace)\n-- That's pretty much how it goes.\n\"I love you, it's ruining my life.\" (Fortnight)\n-- Sometimes (unrequited) love can be quite an inconvenience.\n\"I love you, ain't that the worst thing you ever heard?\" (Cruel Summer)\n-- This epic track is filled with punchy lyrics, but this one takes the cake.\n\"Spinning like a girl in a brand new dress, we had this big wide city all to ourselves. We blocked the noise with the sound of, 'I need you,' And for the first time I had something to lose.\" (Holy Ground)\n-- The underlying fear of impending loss here is so tragically brilliant.\n\"Love is a ruthless game unless you play it good and right.\" (State of Grace)\n-- Another solid example of relating love to a game.\n\"There's no morning glory, it was war, it wasn't fair.\" (The Great War)\n-- There's nothing quite like the relief of calling a truce in a battle no one was going to win.\n\"Remind myself the more I gave, you'd want me less.\" (Now That We Don't Talk)\n-- Oh, that strange, inverse dynamic.\n\"I walked out, I said, I'm setting you free. But the monsters turned out to be just trees.\" (Out of the Woods)\n-- The illusion of fear is a tricky one to overcome.\n\"All we are is skin and bone trained to get along, forever going with the flow, but you're friction.\" (Treacherous)\n-- Swift poetically describes falling for someone she knows she shouldn't.\n\"Fighting with a true love is boxing with no gloves, chemistry 'til it blows up, 'til there's no us.\" (Afterglow)\n-- Here, Swift paints a clear picture of the fact that hurting someone you love will harm both parties.\n\"I broke my own heart 'cause you were too polite to do it.\" (Suburban Legends)\n-- Ah, that painful waiting game.\n\"You drew stars around my scars, but now I'm bleeding.\" (Cardigan)\n-- Healing isn't always permanent.\n\"So you were never a saint and I've loved in shades of wrong. We learn to live with the pain, mosaic broken hearts.\" (State of Grace)\n-- Love isn't always picturesque, but it can still be beautiful. (Yes, I realize I've now quoted State of Grace three times but I can't help it.)\n\"Remember when I pulled up and said, 'Get in the car,' and then canceled my plans just in case you'd call, back when I was living for the hope of it all.\" (August)\n-- Many of us felt personally attacked by these lyrics about holding onto love that was never really ours.\n\"But I've seen this episode and still loved the show.\" (The Tortured Poets Department)\n-- That potentially slippery slope of allowing a (recurring) character flaw slide because you like the bigger picture.\n\"I broke his heart 'cause he was nice.\" (Midnight Rain)\n-- Welp, some actions just can't be justified.\n\"Life was a willow and it bent right to your wind, but I come back stronger than a '90s trend.\" (Willow)\n-- Taylor Swift, queen of the punchy metaphor.\n\"I'm a mess, but I'm the mess that you wanted.\" (Dancing With Our Hands Tied)\n-- This is what you signed up for.\nHaters gonna hate\n\"If a man talks shit then I owe him nothing.\" (I Did Something Bad)\n-- Preach.\n\"I could build a castle out of all the bricks they threw at me.\" (New Romantics)\n-- And they've thrown a lot of bricks.\n\"My castle crumbled overnight, I brought a knife to a gun fight, they took the crown but it's alright.\" (Call it What You Want)\n-- That castle she mentioned in New Romantics apparently wasn't built to last. But she has what she needs in the love of her life, no matter what everyone else is saying about her or doing, and that's true strength.\n\"I bury hatchets but I keep maps of where I put 'em.\" (End Game)\n-- Forgive, but don't forget.\n\"Band-aids don't fix bullet holes.\" (Bad Blood)\n-- Keep your fake apologies.\n\"Boys will be boys, then where are the wise men?\" (Miss Americana & the Heartbreak Prince)\n-- I wish I knew.\n\"I had a marvelous time ruining everything.\" (The Last Great American Dynasty)\n-- There's a high likelihood you've either made this your Instagram caption or thought about it.\n\"I'm so sick of running as fast as I can, wondering if I'd get there quicker if I was a man.\" (The Man)\n-- Same girl, same.\n\"I bet you couldn't believe when you realized I'm harder to forget than I was to leave.\" (I Bet You Think About Me)\n-- Through the pain, Swift penned this song with all the right levels of sass.\n\"A red rose grew up out of ice frozen ground, with no one around to tweet it.\" (The Lakes)\n-- This is such vibrant imagery of regrowth following hostility, away from prying eyes and skeptics.\nLife lessons\n\"Never be so politе you forget your power. Nevеr wield such power you forget to be polite.\" (Marjorie)\n-- These are words to live by.\n\"Your nemeses will defeat themselves before you get the chance to swing.\" (Long Story Short)\n-- Don't get too caught up in the little things.\n\"Everything you lose is a step you take.\" (You're On Your Own, Kid)\n-- An important reminder for when you've lost something you thought you couldn't live without. That push could be the thing that lands you exactly where you need to be.\n\"Love's never lost when perspective is earned.\" (Peter)\n-- Sometimes, you've gained something greater than what you've lost.\n\"Nothing safe is worth the drive.\" (Treacherous)\n-- Indeed.\n\"When you're young, you just run, but you come back to what you need.\" (This Love)\n-- Finding truth and purpose is everything, and it'll all come in time.\n\"Time, mystical time, cutting me open, then healing me fine.\" (Invisible String)\n-- Time really does heal all wounds, even the deepest ones. A grown-up Swift now knows that.\n\"Now I know why all the trees change in the fall, I know you were on my side even when I was wrong.\" (The Best Day)\n-- This line (and entire song, which is a heartwarming tribute to her mom) always makes me cry. It's a touching description of unconditional love.\n\"Don't you worry your pretty little mind, people throw rocks at things that shine.\" (Ours)\n-- Always deflecting the haters in the most poetic way.\nNow I see daylight\n\"I don't wanna look at anything else now that I saw you. I don't wanna think of anything else now that I thought of you.\" (Daylight)\n-- That feeling of finding what you've been looking for is everything.\n\"All these people think love's for show, but I would die for you in secret.\" (Peace)\n-- A nod to the critics who say her relationships are simply for publicity, and an intimate declaration of genuine love.\n\"We bless the rains on Cornelia Street, memorize the creaks in the floor.\" (Cornelia Street)\n-- Beautiful detail is Swift's forte. This track is filled with them.\n\"I've never seen someone lit from within, blurring out my periphery.\" (Snow On The Beach)\n-- I love this imagery of someone being a pure source of light that illuminates your world.\n\"All my walls stood tall, painted blue, but I'll take 'em down, take 'em down, and open up the door for you.\" (Everything Has Changed)\n-- This vibrantly depicts the beauty and struggle of letting your guard down.\n\"I'm only up when you're not down, don't wanna fly if you're still on the ground.\" (I'm Only Me When I'm With You)\n-- The truest allegiance.\n\"My heart's been borrowed and yours has been blue, all's well that ends well to end up with you.\" (Lover)\n-- Pure poetry.\n\"Is this the end of all the endings?\" (King of My Heart)\n-- Finally, an optimistic outlook on a relationship that appears to be going well.\n\"He's got my past frozen behind glass, but I've got me.\" (It's Time to Go)\n-- The future is in no one's hands but her own."
    },
    {
      "url": "https://www.cnet.com/news/social-media/instagram-adds-new-features-including-reposts-and-maps/",
      "text": "Instagram has launched new features aimed at further connecting users with their online contacts, the company announced Wednesday. One involves sharing public feed posts and reels, another shares locations with others on an Instagram map, and a new Friends tab shows what content your contacts have liked or commented on.\nFor reposts, you'll be able to share public reels and feed posts from other users. The original poster will be credited and those reshares will appear in the sharer's profile in a new tab. Posts and reels will now include a reshare icon when they're available to share.\nInstagram says creators will be able to reach more people since those posts will be recommended to others' followers.\nYou have to enable the new map feature to start sharing your last active location. You can set who can see your location and can also choose not to share your location when you're in specific places, or have your location available to specific users.\nLocation sharing can be disabled at any time, Instagram says. Reels, posts and stories can be viewed through the map.\nAlso, a new Friends tab at the top of Reels shows public content from contacts. This feature has been available previously, but is now being expanded globally.\nYou can opt out of having your content displayed in the tab with options to hide likes, comments and reposts. You can also mute likes, comments and reposts from accounts you follow."
    },
    {
      "url": "https://www.freep.com/story/sports/nfl/lions/2025/08/26/taylor-swift-engaged-travis-kelce/85834347007/",
      "text": "Tight end for Detroit Lions' Week 6 opponent gets engaged to Taylor Swift\nKansas City Chiefs tight end Travis Kelce may not be married by the time the Detroit Lions visit the Chiefs for a Week 6 matchup on Oct. 10, but Taylor Swift will still have a ring to show off.\nAs posted on her Instagram page on Tuesday, Aug. 26, Swift and Kelce are engaged to be married after two years of dating.\n\"Your English teacher and your gym teacher are getting married,\" the post reads. It's been 'liked' more than 7 million times just minutes after it posted.\nThe bestselling pop star's connection to the Lions extends beyond her football-playing fiancé.\nIn a recently-posted episode of New Heights, the football-centric podcast hosted by Kelce and his brother Jason, Swift explained how her previous understanding of football involved Lions' quarterback Jared Goff and Buffalo Bills' quarterback Josh Allen facing off against each other during the same play.\nThe unexpected shoutout brought a lot of attention on Goff, who said he had a \"crazy couple of hours\" with his phone blowing up after the episode dropped.\nThe Lions have the third-hardest schedule among NFL teams in 2025, according to NFL analyst Warren Sharp, and their Week 6 trip to Kansas City is a big reason why. And though it might end up being one of the season's most-watched matchups, it may have a lot more to do with Swift than what the Lions bring to the table.\nYou can reach Christian at cromo@freepress.com"
    }
  ],
  "argos_summary": "Taylor Swift and Kansas City Chiefs tight end Travis Kelce announced their engagement on Instagram, sparking a record‑breaking response with over 14 million likes and 452,000 reposts in the first hour and reaching 30 million likes by Wednesday. The post featured photos of Kelce’s proposal, Swift’s Polo Ralph Lauren dress, and an Old Mine cut diamond ring designed by Kelce with Artifex Fine Jewelry. Fans and brands—including the Prince and Princess of Wales, Starbucks, and Wove—reacted with memes, comments, and product tie‑ins, while the engagement has fueled speculation about a future wedding and increased interest in Swift’s fashion choices. The article also notes Instagram’s new repost, map, and Friends tab features, and briefly mentions other media coverage of the couple’s romance and the broader cultural impact of their announcement.",
  "argos_id": "O0K404YZ5"
}