{
  "url": "https://www.zdnet.com/article/these-headphones-give-the-wh-1000xm6-a-run-for-their-money-and-theyre-also-made-by-sony/",
  "authorsByline": "Kyle Kucharski",
  "articleId": "26222ed64a674bc0bbed6b3d1824e7af",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/31178a333ceb92d331b50119cb7af709d7a002e6/2025/08/19/08c3e47b-e76f-4d49-8dc0-cc3750ffcb72/img-3456.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T19:25:00+00:00",
  "addDate": "2025-08-27T19:29:55.319033+00:00",
  "refreshDate": "2025-08-27T19:29:55.319035+00:00",
  "score": 1.0,
  "title": "These headphones give the WH-1000XM6 a run for their money - and they're also made by Sony",
  "description": "Sony's new InZone H9 II gaming headphones deliver impressive spatial audio and ANC, but one feature in particular makes them appeal to anyone.",
  "content": "Follow ZDNET: Add us as a preferred source on Google.\n\nSony recently released its latest pair of premium gaming headphones, the InZone H9 II, a follow-up to its previous high-end gaming headset, the InZone H9 with improved spatial sound, a detachable mic, and a redesigned headband that's substantially more premium.\n\nWe reviewed the H9 back in 2022, so it's definitely time for an upgrade to Sony's high-end gaming line. Sony engineers worked with e-sports organization Fnatic to develop the H9 II, resulting in a handful of quality-of-life features that gamers will appreciate. This includes button placement, fit, and my personal favorite feature -- the detachable mic.\n\nAlso: The best headphones and earbuds of 2025\n\nThe H9 II takes a precise approach to audio, with 360 spatial sound that communicates subtle effects like footsteps behind you and directional movement, for some pretty impressive immersion.\n\nThe 30mm drivers here are the same as Sony's WH-1000XM6 headphones, so you're getting rich audio as a baseline, with some EQ presets designed specifically for effects you'll encounter in FPSs, like footsteps, gunshots, and directional sound effects.\n\nNotably, however, they're smaller than the 40mm drivers in the H9, supporting Sony's goal here in allowing for clearer, more detailed sound. We're talking rustling leaves, gentle breezes, and of course, gunfire with precise locationality.\n\nEnvironment plays a big role in how well you can hear all of these things, of course. You can't exactly hear the footsteps of the player stalking behind you with barking dogs in the background. Luckily, the headphones' noise canceling works very well, reinforced by the gentle, but complete, seal offered by the earpads.\n\nNoise cancellation can be toggled with the button on the left between ambient, ANC on, or off. While on, it succeeds at blocking out your environment to dramatic effect.\n\nThere's other ways to play, though, as any gamer can attest to. Personally, I swap between gaming with ANC on, to swapping to ambient mode and keeping the game's audio to my external speakers. That way, I can relegate voice comms to the headset.\n\nLuckily, you don't need to do a whole lot of tinkering to get good performance out of these headphones. Their lightweight fit and balanced sound profile makes for solid performance straight out of the box, with additional EQ adjustments acting as a bonus.\n\nAlso: I wore the best headphones from Sony, Bose, Apple, and Sonos: Here's how the AirPods Max wins\n\nI tried the H9 II in a variety of games, and found the headphones' spatial sound to be very nice. Sound effects that are far off are well telegraphed, with subtle directional effects that, as designed, are even more noticeable in quiet environments with less audio clutter.\n\nIn terms of comfort, lightweight is the key word here, as the whole headset weighs about 273 grams (0.6 pounds) with a comfortable fit that's both sealed off but comfortable enough to wear for extended sessions.\n\nThe adjustable headband on the H9 II is made with a braided cloth material that's exceedingly light yet sturdy. The engineering here is a massive improvement over the previous model's thick and clunky padded headband.\n\nThe headset connects via a USB-C dongle that utilizes a 2.4GHz connection and LE Audio and Bluetooth for multi-point connectivity, while all of the most common settings are accessible via physical buttons on the headphones. This includes the mic mute, ANC on or off, game/chat mode, and the Bluetooth pairing button.\n\nAlso: Should you buy a handheld PC? This Lenovo model running SteamOS made my decision easy\n\nThe mute button is especially handy, as it's a toggle switch that's extended when muted, and flush with the headphones when open. Located on the top of the left ear, it gives you one-handed access to quickly mute or speak. If you're ever unsure, there's a red LED at the tip that lights up when you're muted.\n\nThe power button is on the front of the right side -- a harder to reach spot designed to avoid the accidental tap, but the ANC/Bluetooth buttons are easily mixed up. Looking at the headset for labels may or may not be of help, as the print above the buttons (on the headset with the black colorway) is so tiny and so dark, I had to put my iPhone's flashlight on it to see.\n\nThis leads me to my other complaint about the headset: the black matte texture is an absolute fingerprint magnet. I've been using these headphones for a week, and they look like I've had them for far longer than that. Granted, wiping them down with a cloth solves this problem, but I definitely would have opted for a different color or finish.\n\nThe H9 II is also quite good as an all-around pair of headphones away from the console. With the detachable mic, they become regular headphones with sound quality you'd expect from a mid- to upper-tier pair of headphones. In fact, they're louder than my everyday carry pair of JBLs and actually feel great at the gym (yes, I went running with them, and they felt great).\n\nAlso: I wore the best headphones from Sony, Bose, Apple, and Sonos: Here's how the AirPods Max wins\n\nThe headset's support for multi-point connectivity is a nice plus that allows for connection with multiple devices at the same time. This means when you're deep in the game, you can still hear incoming calls or texts through the headset, preventing important missed calls because you were too busy exploding spaceships.\n\nTaking calls with the headset is also a surprisingly good user experience. The sound quality is good, and callers said my voice came through loud and clear.\n\nSo, let's talk battery life. Sony advertises an average of 30 hours of battery life, which is actually less than the 32 average on the H9 but still good for a gaming headset. During my testing, I found that you'll get quite a bit less than this if you use the ANC.\n\nAlso: This MSI handheld could replace my gaming laptop, and not just for its more portable design\n\nThat being said, the headset charges fast. Sony says that five minutes of charge time will give you up to three hours of use, which equates to roughly 30% battery in less than 10 minutes. Once you're around 20% juice, the headphones will notify you with a \"Battery low\" notification.\n\nLuckily, the USB-C to USB-A cord that comes with the headphones is extra long, so if you do need to plug in during a gaming session, it's hardly an issue.\n\nThe Sony InZone H9 II are a great pair of gaming headphones, and I'd recommend them to anyone who appreciates refined, precise audio effects just as much as booming explosions and gunfire. The 360-degree spatial sound is very immersive, especially for FPS games, and the directional effects really do come alive.\n\nHowever, the headphones' lightweight form and propensity to be a fingerprint magnet don't do much to exude a \"premium\" aesthetic. Luckily, the white colorway eliminates this problem, but then, white tech is its own challenge in longevity. These are gaming headphones, after all, but for the retail price of $349, these details matter.\n\nAll in all, the audio wins out, especially since you can detach the mic and have a banger pair of headphones for everyday use.",
  "medium": "Article",
  "links": [
    "https://fnatic.com/",
    "https://assoc-redirect.amazon.com/g/r/https://www.amazon.com/dp/B0FJ2WXDRY?tag=cnet-api-20&linkCode=ogi&th=1&psc=1",
    "https://www.zdnet.com/home-and-office/home-entertainment/should-you-buy-a-handheld-pc-this-lenovo-model-running-steamos-made-my-decision-easy/",
    "https://www.zdnet.com/article/this-200-android-phone-with-a-paper-like-display-made-my-pixel-look-overbearing/",
    "https://www.zdnet.com/article/best-headphones/",
    "https://www.zdnet.com/home-and-office/home-entertainment/sony-inzone-h9-review-the-xm5-of-gaming-headphones/",
    "https://www.zdnet.com/article/i-replaced-my-samsung-oled-tv-with-this-sony-mini-led-model-for-a-week-and-didnt-regret-it/",
    "https://www.amazon.com/dp/B0FJ2WXDRY?tag=zdnet-buy-button-20",
    "https://www.zdnet.com/article/finally-an-ultraportable-windows-laptop-id-use-at-the-office-even-though-its-for-gamers/",
    "https://www.zdnet.com/home-and-office/home-entertainment/this-msi-handheld-could-replace-my-gaming-laptop-and-not-just-for-its-more-portable-design/",
    "https://www.zdnet.com/article/i-wore-the-best-headphones-from-sony-bose-apple-and-sonos-heres-how-the-airpods-max-wins/",
    "https://www.zdnet.com/article/i-fell-in-love-with-a-2000-mirrorless-camera-that-puts-design-and-simplicity-over-everything-else/",
    "https://cc.zdnet.com/v1/otc/00hQi47eqnEWQ6T9d4QLBUc?element=BODY&element_label=Add+us+as+a+preferred+Google+source&module=LINK&object_type=text-link&object_uuid=5e5d2e64-4b30-43e6-8555-26eac7e449f3&position=1&template=article&track_code=__COM_CLICK_ID__&url=https%3A%2F%2Fwww.google.com%2Fpreferences%2Fsource%3Fq%3Dzdnet.com&view_instance_uuid=379e95d2-6b56-476b-a90b-043a8dd63bd3"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "gaming headphones",
      "weight": 0.08841148
    },
    {
      "name": "premium gaming headphones",
      "weight": 0.0833752
    },
    {
      "name": "headphones",
      "weight": 0.07741513
    },
    {
      "name": "regular headphones",
      "weight": 0.07570361
    },
    {
      "name": "directional sound effects",
      "weight": 0.0712594
    },
    {
      "name": "Sound effects",
      "weight": 0.06843311
    },
    {
      "name": "sound quality",
      "weight": 0.060333457
    },
    {
      "name": "improved spatial sound",
      "weight": 0.060045004
    },
    {
      "name": "subtle directional effects",
      "weight": 0.058015447
    },
    {
      "name": "H9",
      "weight": 0.056448527
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.94482421875
    }
  ],
  "sentiment": {
    "positive": 0.46369755,
    "negative": 0.08687131,
    "neutral": 0.44943106
  },
  "summary": "Sony has released its latest premium gaming headphones, the InZone H9 II, a follow-up to its previous high-end gaming headset. The headphones have improved spatial sound, a detachable mic, and a redesigned headband. Sony engineers collaborated with e-sports organization, Fnatic, to develop these headphones. They also included a number of quality-of-life features such as noise canceling and touch-control buttons. The 30mm drivers in the H9 are the same as Sony's WH-1000XM6 and support Sony's goal in allowing for clearer, more detailed sound. Despite some compromises on audio quality, these headphones are generally well-received for their lightweight fit and balanced sound profile. They can be toggled between ambient, ANC on, or off, game/chat mode, and Bluetooth pairing.",
  "shortSummary": "Sony's InZone H9 II offers a lightweight, premium gaming headset with improved spatial sound, comfortable fit, and features like a detachable mic.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8fc162f9724d4c85a534de73d22a5182",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.zdnet.com/article/this-200-android-phone-with-a-paper-like-display-made-my-pixel-look-overbearing/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis $200 Android phone with a paper-like display made my Pixel look overbearing\nTCL 60 XE Nxtpaper 5G\nZDNET's key takeaways\n- TCL's 60 XE Nxtpaper 5G is on sale on Amazon for $222.\n- It has a unique display, and a feature set that promotes minimalism and digital well-being.\n- I just wish the camera system and general performance were better.\nBeing glued to your smartphone's screen all day can do a number on your eyes, and I definitely can feel it. TCL's Nxtpaper technology offers a paper-like screen that's made for tired eyes like mine. The TCL 60 XE Nxtpaper 5G is the company's affordable attempt at relieving some of the stress that comes from modern smartphone screens.\nAlso: Changing this Android setting instantly doubled my phone speed (Samsung and Google models included)\nIt's a unique trick for a very inexpensive smartphone that needs to be seen to be understood. While far from perfect, and definitely a device built to a price, it brings a differentiator that will matter for some users looking to give their eyes a rest while they scroll or read.\nA unique multi-faceted display\nThe display is what immediately sets the 60XE apart. TCL's Nxtpaper 3.0 matte coating gives the glass an undeniably unique finish that I quite like. On-screen content looks a bit like E-ink depending on the mode the phone is in, but underneath that hazy layer is a standard 1080p, 120Hz LCD panel.\nThe coating addresses a slew of common downsides of modern displays. It reduces blue light, cuts reflections to nearly nothing, and even eliminates most fingerprints. There's also a nice texture that feels a bit like paper, which is a nice departure from a sea of glossy, reflective displays.\nBeneath the power and volume buttons is a physical Nxtpaper Key, a plastic switch that feels a bit cheaper than I'd like. Flipping the switch offers up a menu of distinct modes that change how the display operates.\nTCL clearly wants users to notice and appreciate this feature because every toggle results in a five-second full-screen animation complete with an obnoxious serenade. I made sure to set my volume to mute so I could avoid the theatrical effect.\nEach mode provides its own twist on usability and comfort. Color Paper Mode, my favorite, mutes the colors while retaining a standard Android interface that's easier on the eyes for all-day use. I even enjoyed watching YouTube videos in this mode, though everything feels a bit flatter than my eyes are used to.\nInk Paper Mode goes one step further, stripping color from icons and text for a no-frills grayscale approach, while still delivering the full unencumbered Android experience. Max Ink Mode is the most dramatic change, stripping all color while also limiting apps to a small subset of essentials and suspending certain background processes.\nAlso: iOS 26 envy? 5 iPhone features you can already use on your Android (Samsung included)\nThe result is an ultra-minimal, battery-saving mode that can last more than a week on a single charge. I enjoyed this mode for reading ebooks and could see it as a great solution for users looking to cut back on smartphone use entirely.\nThe display does come with a major caveat. On the brightest days, the matte finish would all but wash out on-screen content, often making it unusable in direct sunlight. If you spend time outside reading or working, you'll be looking for shade like I was.\nPerformance and battery\nPerformance is modest but serviceable, with a MediaTek Dimensity 6100+ processor inside paired with 8GB of RAM. In use, this is not a phone for hardcore users who push their devices to the limit. I noticed many actions have a slight delay attached to them. Launching the camera often takes a few seconds to negotiate.\nGeneral tasks like web browsing, email, and messaging are responsive enough to keep me happy, but things never felt snappy.\nOn the software front, the 60 XE runs Android 15, with a promise from TCL of just one upgrade to Android 16 and two years of security patches. As someone who always decries the poor state of Android OS update promises, this is a weak point, and TCL needs to step up its game. Anyone hoping to get long-term value should consider other options.\nAlso: I spent a week in New York City with the Samsung Z Fold 7 - and it spoiled me the entire time\nI found battery life to be a highlight, which isn't that surprising given the 5,010mAh battery hidden inside. I routinely made it through the day with around 20-30% capacity to spare at bedtime. Wired charging tops out at a slow 18 watts, so quick daytime top-ups will take some time, but it's fine for plugging in overnight.\nFor the truly battery paranoid, there's the Max Ink Mode that considerably jumps battery life to more than a week if you are willing to cut down on much of what the phone is capable of.\nStay for the display, but not the camera\nThe plastic marble-like backplate surrounds a large circular camera array that's hard to miss and perhaps even more premium-looking than its price point. One pet peeve of mine is an off-center camera module, and this phone has a notable wobble when placed on a tabletop as a result.\nThe camera system itself is one area where the low-end cutbacks really show. The main sensor does its best outdoors in very bright conditions and needs a lot of light to help shots taken indoors. The camera performance is mediocre with soft output that lacks punch and definition most of the time.\nLow-light conditions easily demonstrate the camera system's baseline capability, and the ultrawide lens often results in grainy images. The 32MP front camera works, but that's about it. Let's just say that this is not the phone for the discerning camera buff.\nZDNET's buying advice\nWhat the TCL 60 XE Nxtpaper 5G offers is a key standout feature: a unique matte display. At $250, the 60XE offers something that you really can't find anywhere else, in this price category and beyond, and the benefits of that might matter a lot for certain users. For everyone else, consider phones like the CMF Phone 2 Pro, which offers better imaging, better speed, and its signature modular design approach.\nFollow my latest tech reviews and projects across social media. You'll find me on YouTube at YouTube.com/@JasonHowell, on X (formerly Twitter) at @JasonHowell, and on Instagram at Instagram.com/thatjasonhowell."
    },
    {
      "url": "https://www.zdnet.com/article/finally-an-ultraportable-windows-laptop-id-use-at-the-office-even-though-its-for-gamers/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nFinally, an ultraportable Windows laptop I'd use at the office (even though it's for gamers)\nMSI Stealth 16 AI\nZDNET's key takeaways\n- The MSI Stealth 16 AI is on sale at Best Buy for $2,030.\n- It's a gaming laptop with powerful hardware and a vibrant OLED display that's ideal for both gaming and graphic design.\n- However, like its predecessor, it has a hungry battery and runs hot.\nThe 2025 MSI Stealth 16 is the latest entry in the tech company's sleek gaming laptop series. I'm pretty familiar with the Stealth line, having reviewed several models in the past. This version doesn't reinvent the wheel. In fact, it shares many similarities with its predecessor, the Stealth A16 AI+, to its benefit and to a fault.\nAlso: The best laptops for graphic designers: Expert tested\nFirst off: on the surface, I genuinely can't tell the difference between this model and the previous generation. The Stealth 16 measures 14\"x 10.22\"x 0.85\" inches -- the exact same dimensions as the A16. It even weighs the same at 4.63 pounds.\nWhat's funny is I used to think that was really heavy, but after carrying around chunky laptops, MSI's device feels lightweight. Even with the power adapter, I didn't mind carrying it around town. By the way, I factor that adapter into the overall weight because you will need it on hand. More on that later.\nBringing back the classics\nA few other great design elements make their triumphant return. Going down the list, you have a full-size gaming keyboard. Each button has a 1.5mm travel distance, ensuring a comfortable typing feel. Six surround sound speakers are located at either end below the keyboard for immersive audio.\nOne of my favorite moments testing this laptop came from listening to \"Doomsday\" by MF Doom. The lyrical flow from Doom sounded crystal clear and powerful through the laptop's speakers, filling my entire room with his supervillainy.\nAbove the keyboard is the 16-inch OLED display. At QuadHD+ (2,560 x 1,600 pixels) resolution, it's not quite 4K, but it's close enough -- the screen still delivers impressive visual output. Colors are vibrant, the high resolution delivers detailed images, and the 240Hz refresh rate ensures smooth on-screen motion.\nPower boost\nOne of my favorite things about MSI laptops is how easy it is to tweak their performance. On many Windows 11 laptops, all you can really do is change the Power mode in the Settings, but MSI Center, its internal settings program is actually pretty robust. Here, you can adjust the computer's output on the fly. For example, enabling Extreme Performance and Discrete Graphics Mode delivers the best hardware results.\nAlso: I tested Dell's XPS successor, and it beat my $3,000 Windows laptop in almost every way\nInside my review unit was an Intel Core Ultra 9 285H, an Nvidia GeForce RTX 5070 graphics card, and 32GB of RAM. It's a pretty good configuration, if I say so myself, and it shows in the performance numbers.\nBelow is a list comparing MSI's Stealth 16 with its predecessor, the Stealth A16 AI Plus, and the Dell Premium 16. You'll notice that the newer model has better raw processing and rendering power than the others, indicating it excels at handling heavy workloads and rendering complex 3D graphics.\nThere is a bit of a gap between the Stealth 16 and the A16 on PCMark 10, suggesting that the older model has better general performance; it's able to hop between web pages and apps without much issue. However, I didn't experience any slowdown. This laptop ran great everywhere.\nPCMark 10 | Geekbench 6 | Cinebench 2024 | Cinebench R23 | |\nMSI Stealth 16 AI | 7,693 | 15,883 | 1,129 | 21,656 |\nMSI Stealth A16 AI+ | 7,913 | 14,196 | N/A | 18,336 |\nDell Premium 16 | 6,865 | 14,763 | 726 | 17,522 |\nHaving Dell's machine may seem random, but you need to understand that the Stealth 16 isn't just a solid gaming computer. It's also a powerful graphic design laptop, too. For testing, I installed Blender, a free 3D creation app, and edited images on Pixlr. I'm not much of an artist, but I did manage to create and render simple scenes starring Blender's complex monkey model.\nI had a similar experience with Pixlr, as I was able to edit 4K photographs without any major hiccups. The entire process went smoothly. MSI's laptop is a powerhouse in almost every sense of the word.\nAlso: I switched to the Dell 14 Premium for a week, and it makes even the XPS feel outdated\nAs powerful as the laptop may be, it has its limits. I ran multiple 4K YouTube livestreams as part of my usual 50-tab Chrome browser test. Everything ran fine when there were only three livestreams, although once I hit six, I noticed a slowdown. Livestreams were slow to load. It took a few seconds before the Stealth 16 could play the video as normal.\nStaying cool\nHeavy workloads do cause the Stealth 16 to heat up a bit, but high temperatures were never an issue. Heat vents are strategically placed above the keyboard, on the side of the laptop, and on the bottom, so your hands are never at risk of touching a hot keyboard. In fact, the keys stayed nice and cool the entire time. Unfortunately, this means you can't place the computer on your lap; otherwise, your legs will be blasted by hot air.\nThis ability to stay cool under duress is thanks to the Cooler Boost 5 cooling system, which consists of two large fans and five heat pipes directing hot air out through the vents. This system is also on the vastly more powerful MSI Raider 18 HX.\nUnsurprisingly, MSI's Stealth 16 is not designed to be away from its charger for long. You can push its endurance by enabling ECO-Silent and Integrated Graphics Mode in the MSI Center app, and Best Power Efficiency in Windows, but even then, it will last around six hours on a single charge, depending on what you're doing.\nLike many gaming laptops with this kind of hardware, it may have power, but it lacks in stamina. For that reason, I'd suggest this for users who don't need an all-day battery kind of laptop, but are fine with a few hour stints throughout the day.\nZDNET's buying advice\nThe MSI Stealth 16 AI is on sale at Best Buy for $2,030, which is a good price for a laptop with this kind of hardware. I recommend this device to anyone looking for an affordable gaming laptop that can also be used as a work machine. If you like this laptop but want to save some cash, its predecessor, the Stealth A16 AI+, is very similar and still relevant in 2025, retailing for $1,800.\nIf you want a more powerful graphic design computer, I suggest the Alienware 18 Area-51. It is a much more powerful gaming laptop that leaves every laptop I mentioned so far in the dust. I think it's one of the best for the year. It is, however, very expensive; my review unit cost $3,200."
    },
    {
      "url": "https://www.zdnet.com/article/i-wore-the-best-headphones-from-sony-bose-apple-and-sonos-heres-how-the-airpods-max-wins/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI wore the best headphones from Sony, Bose, Apple, and Sonos: Here's how the AirPods Max wins\nIn the past few years, Bose, Sony, Sonos, and Beats have released premium headphones to compete with each other and Apple's AirPods Max.\nI've worn all of the AirPods Max's top competitors, and they each excel in different categories. But for an older dog in this fight, the AirPods Max are still kicking. Since their 2020 release (and 2024 re-release), the Max haven't received many significant software or hardware updates, aside from new colors, a USB-C port, and support for lossless audio via USB-C.\nAlso: The 12 best headphones of 2025\nSo, five years later, set on the backdrop of a potential successor this fall, are the AirPods Max still worth buying? After testing the best headphones on the market, here's my buying advice.\nThe good: design, device interoperability, and great sound\nOne thing is indisputable: the AirPods Max are a beautiful pair of headphones. They are simple, sleek, and often imitated -- yet never replicated. The stainless steel accents give it an elevated look, no logos or branding make them appear sophisticated, and the Digital Crown successfully replaces multiple buttons that can be confused with one another.\nAlso: Here's how a free software upgrade made the Sonos Ace worth their price tag\nIn the design category, the Sonos Ace are the Max's closest rival. They're also defined by clean lines, a simple design, metallic accents, and removable magnetic ear pads, but have thinner earcups and a lighter build. The Ace feature their own take on the Digital Crown with a similarly functioning Content Key, but placed in an easier-to-reach spot on the ear cup.\nBose's QuietComfort Ultra sport aluminum yokes for enhanced durability, but most of the headphone is made of plastic. Similarly, Sony's XM6 is built with mostly plastic -- albeit with materials that are highly sustainable.\nFor Apple users, the AirPods Max are the definitive over-ear headphones option, thanks to their automatic pairing with your iPhone, iPad, Mac, or Apple TV. Jason Hiner, ZDNET's editor-in-chief, is an avid Apple user, and the AirPods Max are his premium headphones of choice. Aside from automatic device switching, Hiner's favorite thing about the Max is their noise cancellation and audio quality chops.\n\"For [noise cancellation and audio quality], the AirPods Max are in the same league as the best headphones on the market, including the ones from Sony, Bose, and Sennheiser. I can hear details in music and movies using the AirPods Max that I simply can't hear with AirPods Pro or other earbuds,\" he says.\nEven as they near their fifth birthday, the AirPods Max still sound incredible by today's standards. Apple's Personalized Spatial Audio works beautifully, creating a wider soundstage that doesn't sound too computerized. In the spatial audio department, the Sonos Ace and Beats Studio Pro are fierce competitors, providing a similar spatial listening experience.\nAlso: Why these headphones are still the best from Bose - even though they're a year old\nThe AirPods Max have great noise-canceling abilities, owing to their performance with eight microphones for active noise cancellation (ANC). The Sonos Ace perform just as well as the Max in canceling environmental noise, but Bose's QuietComfort Ultra and Sony's WH-1000XM6 are the kings of ANC.\nHowever, even five years later, the AirPods Max still have a leg up on all of their competitors' Transparency Modes. Apple's Transparency Mode is the clearest, most transparent, and most natural-sounding.\nThe mesh ear pads of the Apple headphones, while different from those of other brands, have also held up well. They're firm without being hard, providing a tight yet comfortable seal around your ears for immersion. The lack of polyurethane leather on the ear pads simultaneously adds to their expense and user experience.\nAlso: I replaced my Bose UltraComfort headphones for the Sony XM6 - here's how it went\nMy colleague, Kerry Wan, ZDNET's managing editor, says the Max's mesh ear pads are one of the best things about them. \"I've found the AirPods Max's mesh-style ear cushions to relieve pressure and sweat build-up better than the waxy, silicone-based covers found on competing headphones,\" he says.\nAnd I have to agree; the mesh pads feel better against my skin and manage heat buildup better. But with great power comes great responsibility. The mesh pads absorb sweat, oils, and odors instead of keeping them on the surface like the competitors' ear pads. Thus, you can either throw them in the wash every once in a while or spend the money to replace them.\nThe bad: Software, all things battery life, and an ode to comfort\nI still respect Apple's H1 audio processor, but it's clear that it can't keep up with the industry's more advanced software features. That's why AirPods Max users look longingly out the window when AirPods Pro 2 users get all of the cool software updates every September.\nZDNET's Jason Hiner loves many things about the AirPods Max, but he acknowledges their steep price tag and antiquated H1 audio chip are major pitfalls. Apple's H2 chip, found in the AirPods Pro 2, is the company's most advanced audio chip and offers users better audio quality, more stable connections, and stronger noise cancellation. The H2 chip's omission in the AirPods Max, even in the 2024 rereleased model, is a pain point for Hiner.\nAlso: Sony WH-1000XM6 vs. Bose QuietComfort Ultra: How to choose the best noise-canceling headphone\n\"For Apple to not put its latest audio technology into its highest-end headphones -- especially at such a premium price -- is disappointing,\" he says.\nThese days, adaptive noise cancellation is all the rage. Headphone processors are intelligent enough to listen to your environment's noise levels and employ the appropriate amount of noise cancellation. This feature can preserve battery life, help with situational awareness, and generally be more convenient than manually switching ANC modes.\nI often rag on the Bose QuietComfort Ultra's short 24-hour battery life, but Apple's is shorter at 20 hours. The AirPods Max have poor endurance compared to their competitors, with the Sonos Ace and Sony XM6 testing for around 30 hours with ANC on.\nMy advice is that you shouldn't buy the AirPods Max if you don't have at least one Apple product, and I often attribute that to paying for features you can't use, like Find My and Personalized Spatial Audio.\nAdditionally, without a companion app, software updates are wrapped into iOS updates, making it impossible to update your AirPods without an iPhone, iPad, or Mac. ZDNET's Kerry Wan is mainly an Android user, though he shamelessly admits to keeping an iPhone around to update the headphones and test the latest features. That's obviously not the case for most users.\nAlso: Five iOS 26 features I already can't live without - and how to access them\nAnother unsurprising caveat is that the AirPods Max are a hefty pair of headphones. They're heavier than all of their challengers, and their thin mesh headband doesn't act as enough of a counterweight for the heavy earcups when I wear them for long periods. The Sonos Ace and Bose QuietComfort Ultra have plushy earcups and sturdier headbands, and they're better suited for long-term wear when I travel or work at my desk.\nZDNET's buying advice\nAs the AirPods Max prepare to celebrate their fifth anniversary, it's impressive that they're still in the premium headphone conversation; that's a testament to their performance and future proofing. I have more good than bad things to say about them, but I don't think they're for everyone, not even for every Apple fan.\nIf you never stray from the iOS ecosystem and prioritize design, great sound, and good noise cancellation, the AirPods Max will serve you well. Just be sure to buy them on sale; it happens often.\nIf you value an AirPods Max-inspired design, comfort, sound, and full compatibility with iOS and Android, consider the Sonos Ace. If comfort and noise cancellation are at the top of your list, try the Bose QC Ultra. If impeccable sound, industry-leading noise cancellation are your must-haves, go with the Sony XM6.\nAnd if you want headphones with a simple, clean design that offers aspects of Apple's user interface and supports native Android features, the Beats Studio Pro are for you."
    },
    {
      "url": "https://www.zdnet.com/article/best-headphones/",
      "text": "I've tried dozens of headphones and hand-picked the best ones for 2025\nWhy you can trust ZDNET\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest headphone deals of the week\n- $250 (save $101)\n- $278 (save $70)\n- $300 (save $80)\nA good pair of headphones can be your best friend, but choosing the right pair is highly dependent on your needs. Whether you want over-ear, noise-canceling headphones or open-ear earbuds that can go with you from the office to your evening run, we've tested products from brands like Apple, Sony, Bose, and Beats to help you find the best ones.\nGet more in-depth ZDNET tech coverage: Add us as a preferred Google source on Chrome and Chromium browsers.\nWhat are the best headphones right now?\nAfter extensively testing all of the top headphones available today, the best everyday headphones are the Sony WH-1000XM6 for their impressive sound profile. Additionally, they overtook the Bose QuietComfort Ultra for the best noise-canceling headphones on the market. Still, the Bose QuietComfort Ultra have impressive noise-canceling, cloud-like comfort, and a sporty and casual design.\nSonos' Ace headphones are better than ever, thanks to a recent software overhaul, and Google's Pixel Buds Pro 2 and Apple's AirPods Pro 2 are still the best premium options for Android and iOS users, respectively.\nThe best headphones of 2025\nWhy we like them: Sony reclaimed the noise-canceling throne with the XM6, delivering the best noise cancellation on the market. The XM6 debuted with an even more practical design, more advanced software features, and support for the LC3 Bluetooth codec, which is compatible with newer Samsung and Google Pixel phones.\nReview: Sony WH-1000XM6\nSony's signature sound profile consists of few peaks in higher frequencies and a slight emphasis on the bass, delivering an enjoyable listening experience. The XM6 also feature Sony's 360 Spatial Sound technology, the company's take on spatial audio. Previously, Sony reserved this feature for select music streaming services, but now users can enable it freely.\nWho these are for: The XM6 are ideal for people who value sound and noise cancellation over style. Sony's headphones are wonderfully practical for commuting, traveling, and effectively blocking external noise. If you're looking for everyday headphones that sound great, offer intuitive features, and provide the best noise cancellation, the XM6 are for you.\nWho should look elsewhere: The XM6 are all about practicality, favoring sound, software features, and noise cancellation over style. Although the XM6 have a nondescript and uniform design, they lack any flash accents or elevated style points. If you prefer headphones that make more of a fashion statement, consider the AirPods Max or Sonos Ace.\nSony WH-1000XM6 tech specs: Form factor: Over-ear | Bluetooth: Yes (5.3) | Battery life: 40 hours (ANC off) | Driver size: 30mm dynamic | Noise cancellation: Yes | Wired option(s): 3.5mm headphone jack\nWhy we like them: Bose's latest flagship headphones are defined by their effective noise cancellation, immense comfort, and laid-back, casual design. These headphones have 10 microphones to aid in noise cancellation and sport plushy, perforated vegan leather earpads for maximum comfort and breathability.\nAlso: Why these Bose headphones are still my favorite - even though they're a year old\nBose's Immersive Audio feature allows these headphones to encode audio from any device in spatial audio, and the companion app offers options to customize noise cancellation and audio modes. Thanks to their highly effective noise-canceling properties, customization options, and versatility, the QC Ultra make the perfect premium headphones for everyday use.\nWho these are for: These headphones excel for desk workers, commuters, frequently flyers, and mobile YouTube video watchers. Their foldable design makes it easy to stuff them in your bag, and their noise cancellation performance provide a buffer from airport, office, and environmental chatter.\nWho should look elsewhere: If you're prone to forgetting to charge your headphones throughout the week, the QC Ultra are sure to disappoint with their relatively short 24-hour battery life, which gets shorter with noise cancellation and Immersive Audio enabled.\nThose who value style over functionality may find the QC Ultra's design lackluster and too casual, instead of elevated and sleek. Although the QC Ultra features higher-quality build materials like a soft matte coating and aluminum yokes, they don't look as sleek as Apple's AirPods Max or Sonos' Ace. Still, if your aesthetic is sportier and more casual, the QC Ultra will suit your style.\nBose recently increased the QC Ultra's retail price from $429 to $449, making them the same price as the Sony XM6. However, the QC Ultra are an older model and are often on sale for as low as $349.\nBose QuietComfort Ultra tech specs: Form factor: Over-ear | Bluetooth: Yes (5.3) | Battery life: 24 hours (ANC off) | Driver size: 35mm dynamic | Noise cancellation: Yes | Wired option(s): 3.5mm headphone jack\nWhy we like them: The Google Pixel Buds Pro 2 proved to be the most versatile, feature-packed, and practical premium earbuds for Android users. So much so, we awarded them with a ZDNET Editors' Choice award for providing premium features to a host of Android devices and major improvements to comfort, fit, and design compared to their predecessors.\nReview: Google Pixel Buds Pro 2\nMost Android users can download the Google Pixel Buds app to access features like Gemini integration, Find My Earbuds, translation services, hearing health assistance, and adaptive noise cancellation. The Pixel Buds Pro 2's compatibility transcends device brand, allowing Google Pixel, Samsung Galaxy, Nothing Phone users, and more to use the earbuds' best qualities.\nWho these are for: Android users in search of premium earbuds for everyday use will find these buds most useful. They are an auditory companion to your Android smartphone, perfect for hands-free calling, scheduling events on Google Calendar, and step-by-step Google Maps directions, and versatile enough to accompany you everywhere.\nThese earbuds provide enough noise cancellation for daily commutes, strong durability for sweaty after-work workouts, and 30 hours of total listening time to stick by you all week. If you have a Pixel phone, Chromebook, Galaxy Tab, or a tech arsenal full of Android and Chrome devices, the Pixel Buds Pro 2 are for you.\nWho should look elsewhere: Like AirPods, which are strictly compatible with Apple devices, the Pixel Buds Pro 2 are designed for Android users. The Pixel Buds app is the hub for accessing all of the earbuds' features, and the app is not available on iOS. Apple users searching for premium earbuds made for iOS should consider the AirPods Pro 2.\nGoogle Pixel Buds Pro 2 tech specs: Form factor: In-ear | Bluetooth: Yes (5.4) | Battery life: 8 hours and an additional 30 hours with charging case (ANC on) | IP rating: IP54 (sweatproof) | Driver size: 11mm dynamic | Noise cancellation: Yes | Charging option(s): USB-C, wireless\nWhy we like them: The Sonos Ace provide the vibrant, dynamic sound Sonos lovers adore in a portable, stylish pair of premium consumer headphones. The Ace have a sleek design with soft matte coated ear cups, memory foam earpads, and metallic accents for an elevated look.\nAlso: Here's how a free software upgrade made the Sonos Ace worth their price tag\nThese headphones feature Dolby Atmos spatial audio, noise cancellation, transparency mode, Bluetooth multipoint, and compatibility with Sonos' soundbars. TV Audio Swap allows users to privately watch TV since the Ace and Sonos soundbar share the same home Wi-Fi network.\nWho these are for: The Sonos Ace are a solid premium headphone option for people looking for headphones that sound great and have an ultramodern look. People who frequently watch TV shows or YouTube videos on a mobile device would appreciate the Ace's well-balanced sound that's perfect for dialogue.\nIf you have Sonos soundbars, the TV Audio Swap feature is a game-changer. It allows you to stream compatible content in Dolby Atmos and impeccable clarity without disturbing sleeping kids, your partner, or neighbors during late-night viewing or afternoon nap time.\nWho should look elsewhere: If strong noise cancellation is your priority, you'll want to consider other options, like the Bose QuietComfort Ultra. The Ace are Sonos' first headphones, and the company needs to refine their noise-canceling abilities.\nI recommend these headphones the most to people who will frequently use the TV Audio Swap feature, as you can find headphones with better noise cancellation and more software features for less money.\nSonos Ace tech specs: Form factor: Over-ear | Bluetooth: Yes (5.4) | Battery life: 30 hours (ANC on) | Driver size: 40mm dynamic | Noise cancellation: Yes | Wired option(s): USB-C\nWhy we like them: Shokz's latest true wireless open earbuds offer an exceptional open-ear listening experience, defined by great sound, an elevated design, and a lengthy battery life. These earbuds debuted with new features like a multifunction button, four more hours of playtime than the previous generation, upgraded water resistance, and enhanced audio technology.\nReview: Shokz OpenFit 2\nThese earbuds are highly comfortable, as their soft coating doesn't pressure the bony part behind your ears; it's easy to put them on and forget you're wearing them. The updated design also makes them more stylish, phasing out previous generations' highly sporty look. The OpenFit 2 have an IP55 rating, making them durable enough for sweaty workouts and runs in light rain. Also, their improved Bluetooth 5.4 connectivity ensures stable connections and efficient power consumption.\nWho they're for: Although the OpenFit 2 excel in active scenarios like running or hiking, their design is elevated enough to act as casual open-ear earbuds. I recommend them most to people with active lifestyles searching for a casual open-ear earbud they can take from the office to their evening jog.\nWho should look elsewhere: You shouldn't expect the OpenFit 2 to perform in noisy environments like a crowded gym, a busy train, or a grocery store. You'll hear too much of your surroundings and not enough of your music. If you want earbuds that can handle sweaty workouts but have noise cancellation and transparency mode options, consider the AirPods pro 2 for iOS or the Google Pixel Buds Pro 2 for Android.\nShokz OpenFit 2 tech specs: Form factor: Open-ear | Bluetooth: Yes (5.4) | Battery life: 11 hours and an additional 37 hours with charging case | IP rating: IP55 (sweatproof) | Charging option(s): USB-C\nWhy we like them: The AirPods Pro 2 are Apple's most advanced earbuds, offering users advanced noise cancellation, hearing health features, integration with Siri, and compatibility with all your Apple devices. These earbuds sound great and get the job done, making them a wonderful auditory companion for iOS users on the go.\nAlso: I've used my AirPods Pro 2 since they first launched. Here's my buying advice for 2025\nWho these are for: The AirPods Pro 2 are best suited for Apple users, especially those with iPhones. They're great earbuds for iOS users who want a small, pocketable pair of earbuds to take while traveling, commuting, and living everyday life.\nIf you want the latest and greatest AirPods, you may want to wait for the AirPods Pro 3 since these earbuds are due for a refresh within the next year. However, the AirPods Pro 2 have plenty of useful features, and you can often find them as low as $189 during seasonal sales.\nWho should look elsewhere: Like all of Apple's headphones, the Pro 2 are not suitable for Android users. If you pair these earbuds with a non-Apple device, you'll miss out on key features like spatial audio, adaptive noise cancellation, conversation awareness, and a hearing aid feature, all of which are reserved for iOS. So, if you're an Android user and want premium earbuds, consider the Pixel Buds Pro 2 instead.\nAirPods Pro 2 tech specs: Form factor: In-ear | Bluetooth: Yes (5.3) | Battery life: 6 hours and an additional 30 hours with charging case | IP rating: IP54 (sweatproof) | Driver size: 11mm dynamic | Noise cancellation: Yes | Charging option(s): USB-C, wireless\nWhy we like them: Focal's Azurys are the company's entry-level headphones, offering consumers a more affordable price point to enjoy the high-end brand's acclaimed audio technology. These headphones are beautifully made, incorporating high-quality materials and audio components like memory foam, genuine leather, and aluminum and magnesium drivers.\nReview: Focal Azurys\nThe Azurys have a 26-ohm impedance, meaning your smartphone or laptop has enough power for these headphones, making them incredibly easy to drive. They sound, feel, and look wonderful, and are a great option for hi-fi beginners.\nWho these are for: The Azurys are Focal's entry-level hi-fi headphones, characterized by a closed-back design and low impedance. Their closed-back design decreases sound leakage, and their lower impedance makes them easier to use with portable devices. If you want to dip your toes into the high-end headphones pool, the Azurys are a great place to start.\nWho should look elsewhere: If you want headphones that look, sound, and feel expensive, the Azurys are it. However, these headphones are wired-only, lack any software features, and are not highly portable. Focal's Bathys are a high-end option for folks desiring wireless, noise-canceling headphones.\nFocal Azurys tech specs: Form factor: Over-ear | Bluetooth: N/A | Battery life: N/A| Driver size: 40mm dynamic | Noise cancellation: N/A | Wired option(s): 3.5mm headphone jack\nWhy we like them: Bose's midrange earbuds debuted with a new, rounded form factor, great sound, strong noise cancellation, and a comfortable fit. Bose released these midrange earbuds with a new app made specifically for Bose earbuds, offering users more control and personalization. Like most of Bose's personal audio products, the noise-canceling is the best feature.\nReview: Bose QuietComfort Earbuds\nThe QuietComfort Earbuds offer Bose's best-in-class noise cancellation, adjustable EQ settings, voice assistant features, Bluetooth multipoint connectivity, and eight hours of continuous listening time. If you want earbuds that aren't confined to a specific operating system, these are a great option.\nWho these are for: The QuietComfort Earbuds excel for people who want strong noise cancellation and don't like traditional bud-and-stem earbuds. These earbuds work well with all of your Bluetooth-enabled devices and feature an easily pocketable design for portability, making them well-suited for people on the go.\nWho should look elsewhere: If you want more advanced earbuds, the QuietComfort Earbuds may be too simple for you. They lack spatial audio, audio calibration for enhanced acoustics, and adjustable noise cancellation. If you have more premium Bose earbuds in mind, consider the Bose QuietComfort Ultra earbuds.\nBose QuietComfort Earbuds tech specs: Form factor: In-ear | Bluetooth: Yes (5.3) | Battery life: 8 hours and an additional 30 hours with charging case | IP rating: IPX4 (sweatproof) | Noise cancellation: Yes | Charging option(s): USB-C, wireless\nWhy we like them: Sony's Ult Wear are the company's best take on midrange headphones. They debuted with new Ult Power Sound bass technology, a sleeker design, and improved noise cancellation. The Ult Power feature boosts your bass at the press of a button, delivering. significant bump without greatly degrading your audio.\nReview: Sony Ult Wear\nThe Ult Wear promise 30 hours of playtime, feature Bluetooth multipoint connectivity, and sport a light fit for comfortable long-term wear.\nWho these are for: The Ult Wear are a solid option for people who want Sony headphones but want a pair less expensive than the XM6 and more capable than the more affordable WH-CH720N. The Ult Wear are squarely in the middle of Sony's headphones lineup -- a true pair of midrange cans.\nWho should look elsewhere: If you want the best of what Sony has to offer, the Ult Wear aren't it. Their noise-canceling capabilities aren't as strong as the XM5 or XM6, and their audio technology and software features aren't as advanced.\nSony Ult Wear tech specs: Form factor: Over-ear | Bluetooth: Yes (5.2) | Battery life: 40 hours (ANC off) | Driver size: 40mm dynamic | Noise cancellation: Yes | Wired option(s): 3.5mm headphone jack, USB-C\nWhy we like them: Beats' releases in the last two years are defined by less flashy branding and loud colorways, native compatibility with both iOS and Android, and a generally more elevated user experience. The Studio Pro are stylish, functional, and comfortable. They debuted with a list of upgrades, like USB-C charging and audio, spatial audio, and Find My compatibility. Additionally, their new audio tuning means less emphasis on the bass (still more than other headphones), allowing for a more neutral and enjoyable listening experience.\nReview: Beats Studio Pro\nBoth iOS and Android users can enjoy native compatibility with the Studio Pro, and Beats fitted these headphones with USB-C audio compatibility. If you plug into the Studio Pro, you can unlock lossless audio playback and Entertainment and Conversation audio modes.\nWho these are for: The Studio Pro are Beats' premium headphones, making them a solid option for Beats fans whose Studio 3 headphones need an upgrade. Also, the Studio Pro's compatibility with both iOS and Android makes them well-suited for people with a mixed device ecosystem.\nTheir 40 hours of promised playback are an attractive metric for commuting, traveling, and desk-working.\nWho should look elsewhere: If you want headphones that look and sound great, the Studio Pro are a great choice. However, their noise-canceling abilities aren't the best, and if that's at the top of your list, consider the Bose QuietComfort Ultra or Sony XM6.\nBeats Studio Pro tech specs: Form factor: Over-ear | Bluetooth: Yes (Beats Class 1 wireless) | Battery life: 40 hours (ANC off) | Driver size: 40mm dynamic | Noise cancellation: Yes | Wired option(s): USB-C, 3.5mm headphone jack\nWhy we like them: Samsung's latest premium earbuds debuted with a new bud-and-stem form factor, a host of AI-powered software features, Find My support, Bluetooth multipoint connectivity, and adaptive noise cancellation. The Galaxy Buds Pro 3 have a dynamic and exciting sound profile, showing Samsung prioritized sound as much as software features.\nReview: Samsung Galaxy Buds 3 Pro\nSamsung ditched the rounded bud design from previous generations, and, traditionally, bud-and-stem designs allow for more real estate for microphone placement. As a result, the Buds 3 Pro have amazing call clarity, harnessing AI to quieten external noises and amplify the caller's voice.\nWho these are for: The Galaxy Buds 3 Pro's highlighted features, including a live translation feature, are powered by Galaxy AI. The most impressive AI features are only compatible with select Galaxy devices, but Android users can toggle audio features via the Galaxy Wearable app.\nIf your tech arsenal consists mostly of Galaxy devices, like the Galaxy S25, Tab S10, or Book5 Pro, the Buds 3 Pro are the perfect premium earbuds to complement your devices. These earbuds offer more compatibility with other Android devices, too, but Galaxy devices will work the best.\nWho should look elsewhere: If your device ecosystem mostly belongs to Apple, you shouldn't purchase the Galaxy Buds 3 Pro. You'll miss out on exclusive features that make these earbuds great. If you have Android devices but don't foresee much use for the premium features, consider the Galaxy Buds FE.\nSamsung Galaxy Buds 3 Pro tech specs: Form factor: In-ear | Bluetooth: Yes (5.4) | Battery life: 7 hours and an additional 30 hours with charging case | IP rating: IP57 (water and sweat-resistant) | Noise cancellation: Yes | Charging option(s): USB-C, wireless\nWhy we like them: A reliable pair of headphones that can live inside your work or school bag is a must-have, and the JBL Live 770NC are exactly that. These headphones are the latest upper-mid-range headphones from JBL and include a laundry list of premium software features like wear detection, spatial audio, adaptive noise-canceling, and more.\nReview: JBL Live 770NC\nThe Live 770NC feature an unassuming and simple design, a sturdy build, all-day comfort, and 60+ hours of playtime, making them a great option for travelers and commuters who don't have time to remember to charge their headphones.\nWho these are for: The Live 770NC are a great option for people who want headphones that offer lots of bang for their buck. These headphones are loaded with software features, sound good enough, have adequate noise cancellation, and a sturdy build for rattling around in your bag.\nWho should look elsewhere: These headphones may have a lot going for them, but they don't do anything exceptionally well. Their sound is average, and their noise cancellation is decent. If you want headphones that perform at a higher caliber (you'll pay for it), you should look elsewhere.\nThe Live 770NC's design and build materials are more premium than competitors at this price point, as JBL fitted the 770NC with big, plushy ear cups and a headband covered in soft fabric. When I tested the 770NC, I wore them for about five hours before I experienced any head or ear fatigue.\nJBL Live 770NC tech specs: Form factor: Over-ear | Bluetooth: Yes (5.3) | Battery life: 60+ hours (ANC off) | Driver size: 40mm dynamic | Noise cancellation: Yes | Wired option(s): 3.5mm headphone jack\nWhat are the best headphones?\nThe best headphones for you are the ones that best serve their intended purpose. If you're looking for headphones to take on your daily commute without needing to charge them frequently, consider the JBL Live 770NC. If you like to listen to music and watch TV with high-quality and immersive audio, consider the Sonos Ace. If durability during exercising is at the forefront of your mind, then the Shokz OpenFit 2 will best fit you, and if noise-cancelation is your top priority, the Sony XM6 are best.\n| Headphones | Price | Battery life | Bluetooth version |\n| Sony WH-1000XM6 | $430 | 40 hours (ANC off) | 5.3 |\n| Bose QuietComfort Ultra | $449 | 24 hours (ANC off) | 5.3 |\n| Google Pixel Buds Pro 2 | $189 | 12 hours (ANC off) and additional 30 hours with charging case | 5.4 |\n| Sonos Ace | $299 | 40 hours (ANC off) | 5.4 |\n| Shokz OpenFit 2 | $180 | 11 hours and additional 37 hours with charging case | 5.4 |\n| AirPods Pro 2 | $170 | 6 hours (ANC off) and additional 24 hours with charging case | 5.3 |\n| Focal Azurys | $550 | N/A | N/A |\n| Bose QuietComfort Earbuds | $179 | 8 hours (ANC off) and additional 24 hours with charging case | 5.3 |\n| Sony Ult Wear | $150 | 40 hours (ANC off) | 5.2 |\n| Beats Studio Pro | $180 | 40 hours (ANC off) | 5.3 |\n| Samsung Galaxy Buds 3 Pro | $190 | 7 hours (ANC off) and additional 23 hours with charging case | 5.4 |\n| JBL Live 770NC | $150 | 60+ hours (ANC off) | 5.3 |\nPrices reflect the manufacturer's recommended price. However, most of these headphones are often on sale at select retailers.\nWhich headphones are right for you?\nWhile all of these headphones are excellent picks, the choice ultimately depends on how much battery life you prefer, whether strong noise cancellation is important to you, your use cases, and how much you're willing to spend.\n| Choose these headphones | If you want... |\n| Sony WH-1000XM6 | The best noise cancellation on the market, along with a simple and everyday design and tons of software features. |\n| Bose QuietComfort Ultra | The best headphones Bose has to offer. Exceptional noise-canceling technology, all-day comfort, and a stylish design define these headphones. |\n| Google Pixel Buds Pro 2 | A pair of premium earbuds that act as a complementary gadget to your Android devices. |\n| Sonos Ace | A pair of premium and highly-capable headphones that integrate with your Sonos soundbars and deliver Sonos' renowned sound. |\n| Shokz OpenFit 2 | A pair of stylish open-ear earbuds that sound great and stay on during intense outdoor workouts. |\n| AirPods Pro 2 | Apple's most advanced earbuds, offering great sound, noise cancellation, and integration with your Apple devices. |\n| Focal Azurys | A pair of entry-level high-end headphones that sound, look, and feel great. |\n| Bose QuietComfort Earbuds | Middle-of-the-line earbuds from Bose that offer everything great about the brand without the higher price tag. |\n| Sony Ult Wear | Midrange headphones from Sony that sport a quality build, lots of bass, and adequate noise cancellation. |\n| Beats Studio Pro | Premium Beats headphones that offer seamless integration with some native iOS and Android features. |\n| Samsung Galaxy Buds 3 Pro | Premium earbuds packed with AI-powered features to go with your other Galaxy devices. |\n| JBL Live 770NC | Headphones that you can wear every day of the week without needing to remember to charge them. |\nFactors to consider when choosing a pair of headphones\nThere's no perfect pair of headphones that receives 10s all-around. Some are better at noise cancellation, while others sound better or have more stylistic flair. The headphones your best friend loves and recommends you try might be the worst headphones you've ever worn, which is why it's essential to consider these factors before you buy:\n- Battery life: Nothing is worse than throwing on your headphones and seeing they're on 5% battery. If you often forget to charge your headphones, you'll want a pair with an extensive battery life. So, the Bose QuietComfort Ultra might not be your best option, but the JBL Live 770NC could work better for you.\n- Use cases: There are many types of headphones, so you must ensure you're buying the right kind that matches your specific use cases. Perhaps your friend recommended the Sonos Ace headphones for their great sound, but you expected stronger noise-canceling -- a feature you anticipated, especially for the amount of money you spent. If you want headphones for commuting, make sure the headphones you're eyeing are suitable for that. If you prefer to wear headphones in more active scenarios, consider earbuds instead of over-ear headphones.\n- Lifestyle headphones vs. audio-focused headphones: Headphones fall into two categories. Lifestyle (consumer) headphones are the headphones you see from brands like Bose, Apple, and Sony. However, brands like Sony and Sennheiser manufacture both lifestyle and audio-focused headphones. Lifestyle headphones can accompany you on your daily commute, to the office, and to the gym -- all on the same day. On the other hand, audio-focused headphones, like the Focal Azurys, may lack the comfort, noise-canceling tech, and portability that lifestyle headphones possess since their primary use case is to examine audio critically.\n- Operating system: Some headphones and earbuds are meant to work best with devices within that manufacturer's device ecosystem. Apple's AirPods Pro 2, Samsung's Galaxy Buds 3 Pro, and Google's Pixel Buds Pro 2 are examples. If you have mostly Apple devices, AirPods may be your best option. If you have a mixed-device ecosystem, consider headphones from Bose, Sony, or JBL.\nHow we test headphones\nThe ZDNET team spends weeks with a pair of headphones to give you an informed opinion before you make a purchase. Here are the benchmarks we use to test headphones.\n- Comfort and design: We wear headphones for hours at a time to determine how long we can wear them before they become uncomfortable. We also test headphones across all budgets, meaning we test headphones made from inexpensive and more expensive materials to test durability.\n- Noise cancellation: We wear noise-canceling headphones in various environments to test how well the technology performs in quieter and louder settings.\n- Sound quality: Sound quality and sound profiles are highly subjective, as some people prefer heavier bass, while others prefer more pronounced treble. To give you the best idea about a pair of headphones' sound profile, we listen to them with different audio modes enabled. We also listen to headphones on various devices, like iPhones, Macs, Windows computers, tablets, and TVs, to listen for sound distinctions.\n- Battery life: In rare cases, battery life deviates from a manufacturer's claim, and battery life varies depending on how you use a pair of headphones. To ensure a pair of headphones offers as much battery as advertised, we integrate the review unit into our daily lives by listening to music, taking calls, and enabling features like spatial audio.\n- Use cases: No pair of headphones is a one-size-fits-all affair. Usually, headphones have a specific use case, whether for critical listening, watching TV, exercising, or canceling environmental noises. To determine which group of consumers will benefit the most from a pair of headphones, we test headphones in various use cases to specify their purpose.\nLatest headphones news and tips\n- In June, Sonos released a comprehensive software update for the Sonos Ace including improved noise-canceling performance and TruePlay.\n- Are your AirPods constantly slipping out of your ears? We found some inexpensive products that could help.\n- Bose announced the second generation of its flagship QuietComfort Ultra Earbuds.\n- Still contemplating if AirPods Max are worth the money? Check out our buying advice.\nFAQs on headphonesHeadphones FAQs\nHow do I choose the right headphones?\nBefore you buy a pair of headphones, you should consider a few things besides price. A pair of headphones' form factor, connectivity, and features are equally important. Here are some other things to consider before making a purchase.\n- Earbuds or headphones? Earbuds are smaller, more portable, and often protected against sweat and exposure to rain, but they have a shorter battery life. Headphones are larger and sometimes less portable but typically offer more immersive audio and noise-canceling experiences.\n- Wired or wireless (Bluetooth)?: I recommend wired headphones for people who want to occasionally listen to music critically. Over a wired connection, you can access high-resolution music playback. If that doesn't matter to you and you'd rather have portable and wire-free headphones, you want wireless headphones. Fortunately, many consumer headphones can be wired or wireless, and many wireless headphones in this list can achieve high-resolution audio playback via a wired connection.\nAre the Sony XM6 better than the Sony XM5?\nThe Sony XM5 and XM6 are both great headphones. Both provide listeners with expertly tuned sound, impressive noise cancellation, and an unassuming design fit for the everyday person. However, the XM6 excel in noise cancellation, and they sport a foldable design, making them more portable.\nNow that the XM6 have arrived, you can find the XM5 at lower prices, making them a better option for budget-focused buyers.\nSony or Bose: Which brand is best for you?\nBoth Sony and Bose make some of the best consumer headphones on the market. Both companies champion years of innovation and research, but each company's headphones' strengths shine in different categories. Sony is better for producing reliable headphones with a nondescript design, while Bose's headphones are more comfortable and integrate with the company's other consumer audio products.\n- You should choose Sony's XM6 headphones if you want reliable, everyday headphones with a premium and durable build, rich sound, effective noise cancellation, and a lengthy battery life. Sony's flagship headphones promise 40 hours of listening time, 16 more than the QC Ultra.\n- You should choose the Bose QC Ultra headphones if you want more comfortable headphones with a more intense focus on design elements. Bose's premium headphones are often rereleased in seasonal colors and feature metal accents and stylish branding.\nShould I buy on-ear or over-ear headphones?\nI prefer over-ear headphones over on-ear headphones. On-ear headphones, like the Beats Solo 4, sit on your ears, while over-ear headphones, like the AirPods Max, cover your entire ear. Over-ear headphones create a better seal between your ears and the outside world, allowing for increased noise-canceling performance and a more immersive audio experience.\nHowever, you may like on-ear headphones if you want headphones with a more compact shape. If you don't like noise-canceling or prefer to hear your surroundings better, you should consider on-ear headphones.\nHow long do headphones last?\nA solid pair of headphones should last you five years, if not more. You can get great mileage on your headphones by taking care of them. To make the most of yours, here are some tips I use myself:\n- Avoid exposing your over-ear headphones to excessive moisture or rain; do not submerge them in water. I don't recommend working out in over-ear headphones because sweat can degrade the ear pad materials. However, if you work out in your over-ear headphones, wipe the ear pads with a cloth after your workout to remove sweat. Or, you can purchase sweat covers for your ear pads. Earbuds and bone conduction headphones are better equipped for exposure to sweat and rain.\n- Store your headphones in their case when not in use for long periods. Most headphones come with a protective hardshell carrying case or pouch. The case protects your headphones from dust, moisture, scratches, or scrapes.\n- Never spray your headphones or earbuds with chemicals or solvents.\n- Regularly check your headphones' companion app for software updates. Many headphones receive about five years of software updates, and keeping your headphones updated ensures optimal performance.\nFAQs on headphonesHeadphones FAQs\nHow do I choose the right headphones?\nBefore you buy a pair of headphones, you should consider a few things besides price. A pair of headphones' form factor, connectivity, and features are equally important. Here are some other things to consider before making a purchase.\n- Earbuds or headphones? Earbuds are smaller, more portable, and often protected against sweat and exposure to rain, but they have a shorter battery life. Headphones are larger and sometimes less portable but typically offer more immersive audio and noise-canceling experiences.\n- Wired or wireless (Bluetooth)?: I recommend wired headphones for people who want to occasionally listen to music critically. Over a wired connection, you can access high-resolution music playback. If that doesn't matter to you and you'd rather have portable and wire-free headphones, you want wireless headphones. Fortunately, many consumer headphones can be wired or wireless, and many wireless headphones in this list can achieve high-resolution audio playback via a wired connection.\nAre the Sony XM6 better than the Sony XM5?\nThe Sony XM5 and XM6 are both great headphones. Both provide listeners with expertly tuned sound, impressive noise cancellation, and an unassuming design fit for the everyday person. However, the XM6 excel in noise cancellation, and they sport a foldable design, making them more portable.\nNow that the XM6 have arrived, you can find the XM5 at lower prices, making them a better option for budget-focused buyers.\nSony or Bose: Which brand is best for you?\nBoth Sony and Bose make some of the best consumer headphones on the market. Both companies champion years of innovation and research, but each company's headphones' strengths shine in different categories. Sony is better for producing reliable headphones with a nondescript design, while Bose's headphones are more comfortable and integrate with the company's other consumer audio products.\n- You should choose Sony's XM6 headphones if you want reliable, everyday headphones with a premium and durable build, rich sound, effective noise cancellation, and a lengthy battery life. Sony's flagship headphones promise 40 hours of listening time, 16 more than the QC Ultra.\n- You should choose the Bose QC Ultra headphones if you want more comfortable headphones with a more intense focus on design elements. Bose's premium headphones are often rereleased in seasonal colors and feature metal accents and stylish branding.\nShould I buy on-ear or over-ear headphones?\nI prefer over-ear headphones over on-ear headphones. On-ear headphones, like the Beats Solo 4, sit on your ears, while over-ear headphones, like the AirPods Max, cover your entire ear. Over-ear headphones create a better seal between your ears and the outside world, allowing for increased noise-canceling performance and a more immersive audio experience.\nHowever, you may like on-ear headphones if you want headphones with a more compact shape. If you don't like noise-canceling or prefer to hear your surroundings better, you should consider on-ear headphones.\nHow long do headphones last?\nA solid pair of headphones should last you five years, if not more. You can get great mileage on your headphones by taking care of them. To make the most of yours, here are some tips I use myself:\n- Avoid exposing your over-ear headphones to excessive moisture or rain; do not submerge them in water. I don't recommend working out in over-ear headphones because sweat can degrade the ear pad materials. However, if you work out in your over-ear headphones, wipe the ear pads with a cloth after your workout to remove sweat. Or, you can purchase sweat covers for your ear pads. Earbuds and bone conduction headphones are better equipped for exposure to sweat and rain.\n- Store your headphones in their case when not in use for long periods. Most headphones come with a protective hardshell carrying case or pouch. The case protects your headphones from dust, moisture, scratches, or scrapes.\n- Never spray your headphones or earbuds with chemicals or solvents.\n- Regularly check your headphones' companion app for software updates. Many headphones receive about five years of software updates, and keeping your headphones updated ensures optimal performance.\nLatest updates\n- May 2025: Replaced the Bose QuietComfort Ultra with the Sony WH-1000XM6 headphones for \"best headphones for everyday use.\"\n- June 2025: Verified our recommendations are still available for purchase; the price of the Bose QuietComfort and QuietComfort Ultra headphones has increased due to recent tariffs.\n- July 2025: Updated the Sonos Ace's entry to include a one-year analysis article instead of the original review published during their June 2024 release.\n- August 2025: Verified our recommendations are still available for purchase, added the \"headphones news and tips,\" and \"latest updates\" subheads.\nAre there alternative headphones worth considering?\nWhile the options listed above should get you pretty far, you might still be interested in alternative options. Here are a few of our other high-rated recommendations to consider.\nThese Bowers and Wilkins headphones may be midrange, but they offer exceptional sound, style, battery life, and comfort. They're similarly priced to the Sony XM6 and Bose QuietComfort Ultra, but have lesser noise-canceling abilities. However, the Px7 S3 outdo both Bose and Sony in the style and sound categories.\nThe Soundcore Space One Pro headphones are a solid budget option. They have a 40-hour battery life, decent noise-canceling capabilities, and great sound. We recommend these headphones to people looking for a budget option that can keep up with their commuting, working, or traveling headphone needs.\nThese midrange Bose headphones provide everything there is to love about Bose -- all-day comfort, great sound, and exceptional noise cancellation -- without anything extra. The QuietComfort Headphones offer users a simple and reliable headphone experience. At full price, the QuietComfort Headphones' price is inflated, but during major sales, they're worth the money."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/home-entertainment/should-you-buy-a-handheld-pc-this-lenovo-model-running-steamos-made-my-decision-easy/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nIs Lenovo's new SteamOS handheld worth the hype? I tested it, here's my verdict\nLenovo Legion Go S (SteamOS)\nZDNET's key takeaways\n- The Legion Go S running SteamOS is on sale for $600.\n- This version trims the fat and delivers a streamlined gaming experience via a vibrant 8-inch screen.\n- The simpler OS means less features than the Windows model.\nFollow ZDNET: Add us as a preferred source on Google.\nNo, you're not seeing double. This is the second review I've done for Lenovo's Legion Go S. However, this one is special because it doesn't run Windows 11 -- it runs SteamOS. That single change in the operating system elevates the Legion Go S from a \"just okay\" gaming handheld to a great one -- rivaling the Steam Deck itself.\nBefore I break down the handheld, I should explain Steam OS to those who don't know, as the software is at the center of what makes this new model so good.\nAlso: Sony's newest headphones are for WH-1000XM6 fans who love to game - and I can attest to that\nSteamOS is a lightweight operating system originally exclusive to the Steam Deck. It delivers a user-friendly interface that isn't bloated with unwanted apps, and more importantly, it's designed specifically for gaming.\nIt's this streamlined OS is a big reason why the Steam Deck has been so popular -- it's no fuss, no muss. Back in January, Valve (the developer of Steam) announced it would begin licensing the operating system to third-party companies, with Lenovo being the first (and at the time of this writing, only) partner.\nA familiar design\nDesign-wise, it's identical to the earlier model with the only discernable difference being the color. It is now in Nebula purple instead of Glacier White. The device itself is just as comfortable in my hands and doesn't feel bulky. Textured grips on the side stop slipping, hall-effect analog sticks maintain accuracy and prevent drifting, and the switches on the back affect the travel distance for the rear triggers.\nAlso: Why I still recommend this 2024 Dell laptop for work and productivity - even though it's for gamers\nHowever, the touchpad under the right analog stick has lost its purpose. In the previous model, it was used to control the cursor for various purposes, like navigating a web browser. But, this device doesn't support any browser or apps for that matter -- it's just Steam.\nThe touchpad can be used in games as another button or to help aim weapons, although performing the latter doesn't feel great. It's so small that it's difficult to get precise movements. Most of the time, I ended up aiming my character in a completely different direction when I meant to shoot the enemy in front of me.\nGaming on the go\nYour gaming experience on the Legion Go S depends on the titles you play. As cool as this handheld may be, it is still just a handheld, not some ultra-powerful desktop. Underneath the hood is an AMD Ryzen Z2 Go processor, an AMD Radeon GPU, and 16GB of RAM. This configuration is much happier tackling lightweight games like \"Hades\" or \"Stardew Valley\". Titles like those run at a consistently smooth 120Hz. It's like art.\nAAA games like Monster Hunter Wilds have a harder time running on the Legion Go S. Graphics are blurry, and performance slows down when there's a lot on screen. That sounds like a knock against the device, but the Steam Deck also struggles with the same. It's the nature of the tech, and the fact that it can even run these titles at all is commendable in its own right.\nLuckily, you can tweak the hardware's performance on the fly. Pressing the button at the upper right corner of the screen launches the settings menu. Then, just click the lightning bolt icon to open the Performance page where you can tweak the game's performance to best suit your needs.\nIf you don't want to spend half an hour adjusting the settings like I did, you can just activate a title's default profile. This feature is my absolute favorite. It automatically applies a game's performance profile according to what Steam has for it, taking all of the guesswork out.\nBattery life isn't great. While \"Monster Hunter\", the Legion Go S ran for about an hour and 15 minutes before I had to grab the charger. However, on lighter games like \"Hades 2\", that time went up to two hours.\nLenovo Legion Go S vs Steam Deck\nWith the release of the SteamOS Legion Go S, I consider the previous Windows model obsolete. This version is the only one you should care about, and it serves as a great alternative to the OLED Steam Deck. Now the question is, what should you get: the Legion Go S or the Steam Deck?\nIt's close, but I like the Legion Go S more because of its touchscreen. Lenovo's device has an 8-inch LCD that runs at a 120Hz refresh rate, while Valve's Steam Deck has a 7.4-inch OLED touchscreen that runs at 90Hz max. I value higher refresh rates because they ensure smoother animations and faster response times, which can mean the difference between winning and losing.\nOn the other hand, the Steam Deck's OLED screen does mean its color output is more impressive.\nAlso: How much RAM does your PC really need in 2025? I did the math for Windows and Mac users\nThere are other deciding factors to consider. The Steam Deck's OLED display delivers a more vibrant color palette, and Valve's device is lighter at 1.4 pounds, while the Legion Go S clocks in at 1.62 pounds. Also, the Steam Deck has significantly larger touchpads underneath the Deck's analog sticks, which make controlling first-person shooters easier.\nZDNET's buying advice\nLenovo's Legion Go S is on sale for $600 at Best Buy right now, which is a competitive price. I had a blast with this product, and it's a device I would absolutely get for myself, especially on sale. However, if you value more vibrant colors and bigger trackpads, get the Steam Deck, which retails for $549."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/home-entertainment/sony-inzone-h9-review-the-xm5-of-gaming-headphones/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nSony INZONE H9 review: The XM5 of gaming headphones\nSony INZONE H9\npros and cons\n- Spatial sound is precise and gives a competitive advantage\n- Lightweight and comfortable design\n- Digital noise canceling is satisfyingly effective\n- INZONE Hub software is rich in settings\n- Plastic frame feels cheap\n- Earpads are not the most sweat-resistant\n- Mic quality is mid-tier\n- No wired option\nIn the electronics industry, we often see manufacturers branch into new markets by leveraging their existing products and tech. Samsung's done it with the Odyssey line. LG's done it with UltraGear. And now, it's Sony's turn. Sort of.\nWhile the gaming sector isn't uncharted territory for the PlayStation maker -- and Sony has released a number of gaming monitors that we'd love to forget -- the company's new arm, dubbed INZONE, ushers in a new class of hardware dedicated to PC and PS5 users.\nFirst to release under the INZONE namesake is a trio of headphones: H3, H7, and H9. Priced at $99, $229, and $299 respectively, the three headsets marry the best features of Sony's top-selling WH1000-XM5 with aesthetics that PlayStation users will feel at home with.\nI spent the past two weeks testing the highest-end model, INZONE H9, putting it through rounds of first-person shooters (FPS) like Counter-Strike: Global Offensive, third-person shooters like Fortnite, and other genres that include NBA 2K22, Fall Guys, and League of Legends. Here's how the new Sony headphones fared.\nSpecifications\nH9 | H7 | H3 | |\nNoise-canceling | Digital and ambient sound | N/a | N/a |\nHeadband material | Soft fit leather | Plastic | Plastic |\nBattery life | 32 hours | 40 hours | Wired |\nConnection | Wireless (2.4GHz) or Bluetooth | Wireless (2.4GHz) or Bluetooth | Wired USB |\nCompatibility | PC and PlayStation 5 (PS5) | PC and PS5 | PC and PS5 |\nPrice |\nDesign\nAt first glance, the H9 looks like a fancier, beefier version of another Sony headset, the PlayStation PULSE 3D. From the two-tone finish to the frosted white shell that surrounds the sides and top of the headband, the new INZONE headphones look new but feel familiar. All three models are only available in this classic Sony white, which plays well in any PS5 setup. I don't fault Sony for sticking with the one colorway, especially for its first product under the INZONE brand.\nTake a closer look at the H9 headphones and you'll also notice some design elements from Sony's WH-1000XM5. From the 10-click slider for height adjustment to the soft fit leather that dresses the earcups, Sony has taken what's worked in the mass market and applied it to the H9. (Note that the soft-fit leather material is only available on the H9 model. The H7 and H3 use a blend of PU leather and plastic instead.) When not in use, the headphones can rotate inwards and be laid face-down, just like the XM5.\nHowever, I've found myself laying the headphones face-up more often than not. Unfortunately, there are no holes or perforations on the earcup cushions, so they're not as breathable as a standard mesh material. That means that with just an hour of gameplay, there's a noticeable amount of sweat and moisture that needs to be wiped off the soft-touch fabric. I can't even imagine what longer gaming sessions entail.\nOver-ear headphones are the antithesis of glasses-wearers due to their encapsulating nature and pressure that pushes against the head. Add on the number of hours that gamers spend online and you have a recipe for headaches (and a stylish dent in your hair). Sony alleviates the side pressure issue by prioritizing the headband support more than how tight-fit the earcups are. The headband, which features a flexible strip of black leather, does an effective job of being a counterweight to the rather large earcups. As someone who wears glasses, I can attest to how comfortable and cloud-like the headphones feel.\nMore: Sony leaps into PC gaming hardware with new INZONE line of monitors and headsets\nLike the XM5, the H9's shell is built with a lightweight plastic that, while sustainable, lacks the premium essence of a $299 headset. It's natural for us to associate weight with value (think gold bars), but the choice of material here is questionable. Had I not known the price of the H9, I would've estimated it to be between $100-$150 by the hand feel alone.\nPerhaps what's more important is how durable the H9 is. I don't expect the headphones to show much wear or tear after two weeks of use and that's certainly been the case. The white finish makes scratches, if any, unnoticeable, and the ear cup cushions remain springy. These headphones are not certified for dust or water resistance though, so I would stay cautious of leaving drinks nearby.\nMore: Sony WH-1000XM5 brings more comfort and better ANC\nOn the bottom of the headphones, you'll find the power button, Bluetooth pairing button, \"NC/AMB\" toggle, \"Game/Chat\" toggle, USB-C port, and volume rocker. An LED charging indicator sits beside the USB-C, given that's the ports only function. The H9 can pair to a PC or PS5 via the included 2.4GHz USB dongle or Bluetooth, but there is no wired option.\nLastly, a boom mic that stems from the left earcup completes the gaming headset requirements for the H9. It's not detachable but is malleable enough to twist, rotate, and flex to your ideal microphone position. Sony also added a clicking mechanism to the mic so that when you lift it back up, your audio output switches to mute. As for the input quality, there's definitely something left to be desired. On either connection channel, my voice sounded raspy and lacking in clarity. The H9's microphone isn't the worst that I've tested but falls behind the likes of the Corsair Virtuoso and Audio-Technica ATH-G1.\nPerformance\nThe best way for me to describe the sound quality of the H9 headphones is rich and multi-dimensional. I was surprised to find the default sound profile of the H9 to be adequate and balanced just right. But if you're more in favor of a bass-heavy sound or want to emphasize the higher frequencies, Sony's companion software, INZONE Hub, lets you tweak the equalizer settings of the headphones. More on the app later.\nSpatial Sound\nA key selling point of all three INZONE headsets is Spatial Sound, Sony's interpretation of surround sound. For music listening and watching movies, Spatial Sound matches the audio to where subjects are positioned and the direction they're headed. (Imagine hearing a car zipping from your right headphone to the left.) This feature isn't new by any means, but it's one of the most realistic and accurate audio-tracking technology that I've listened to in a while -- and is fully realized when you start gaming.\nSony says that the INZONE H9 works best with FPS games like Counter-Strike: Global Offensive, so that's where I headed first in my testing. In the game, maps like Inferno and Mirage have plenty of obstacles and houses, meaning spatial awareness plays a significant role in surviving. With Spatial Sound turned on, the direction of gunshots and footsteps became so easy to distinguish that I felt like I was cheating.\nThe same mechanic was demonstrated when I played Fortnite, a cross-platform battle royale that emphasizes knowing where your enemies are and catching them when they're most vulnerable. Between listening to footsteps to chests being opened, the H9's Spatial Sound made a Fortnite amateur such as myself feel confident enough to strike the unsuspecting. That said, while Sony recommends the H9 for FPS titles, I'd highly suggest third-person shooters as well, as the 360-degree camera panning adds another dimension to the audio tracking.\nMore: Best gaming headsets\nNoise canceling\nAnother feature that Sony touts is Digital Noise Canceling, which is exclusive to the highest-end INZONE model. While I don't have the WH-1000XM5 to compare with, Sony says that the H9 uses the same noise-canceling technology that's on the fifth-generation headset.\nFrom listening, the H9 certainly does an effective job at blocking out ambient noise and keeping you focused on in-game audio. There's only one level to the noise cancellation which, in my home office, managed to cover up the sound of my air conditioner, the reverberant barks of my neighbor's dogs, and the occasional plane that lifts off from the airport miles away.\nWhat's particularly impressive to me is how the white noise -- generally used to counteract inbound soundwaves -- is hardly noticeable. On cheaper noise-canceling headphones, you'll hear a hissing sound when there's no audio playing. That's fortunately not been the case with the H9.\nReversely, the INZONE H9 also has an Ambient Sound feature that amplifies external noise, while keeping your in-game audio intact. This is especially useful if a family or friend is calling you while you're gaming, or you just want to stay aware of what's happening around you. During my in-person briefing for the H9, a Sony representative spoke to me about its various features while I tested the headset. To my surprise, I was able to comprehend what the product person was saying without missing out on the gameplay.\nMore: Best noise-canceling headphones\nConnection features\nBouncing between the 2.4GHz and Bluetooth connections, there wasn't any noticeable delay or problems with latency, which is great for a wireless-only headset. In fact, Sony encourages pairing the H9 to both the USB dongle and Bluetooth simultaneously; using one channel for game sound and the other for voice chat.\nIf you're pairing the H9 to a PlayStation 5, you'll even gain support for Tempest 3D Audiotech and on-screen indicators for volume and battery levels, mic status, and game/chat balance. Note that the overlays are only available for the H9 and H7 models.\nSoftware\nBeyond the scope of physical settings buttons, the H9 can be modified via Sony's INZONE Hub. As companion apps should, the program allows you to fine-tune the equalizer settings of the headset, its noise-canceling modes and strength, volume levels for the master channel and game/chat channel, and more. The Spatial Sound setting is turned off by default, so make sure you toggle it to get the immersive gaming experience that I praised earlier.\nINZONE Hub is delightfully exhaustive, with additional settings for app sync and Sony's 360 Spatial Sound Personalizer. The latter of which is an app that lets you capture images of your ears so that the H9 headset can adjust its sound profile to your shape. It's a magical service that makes the INZONE experience all the more user-focused. The only issue that I had with the 360 Spatial Sound Personalizer was how it paired seamlessly with my Android device, but took multiple attempts on an iPhone. That seems to be a reoccurring issue based on other users' reviews.\nBattery\nThe INZONE H9 is rated for 32 hours of battery life, which is on par with the 30-hour range of competing gaming headsets. After using the headphones for two weeks -- hovering between noise-canceling and Ambient Sound for two hours a day -- INZONE Hub estimates that I have 1/5 of the battery left. That's sufficient enough for an ANC headset. My only complaint is that there's no way to see the actual battery percentage, not even in the software.\nBottom line\nThere's a lot to like about the INZONE H9, including its sound performance, clean design, and software support. It helps immensely that Sony carried over key features from its WH1000-XM line, including the same noise-canceling tech that earned the XM5 a top spot on ZDNet's headset rankings.\nIs this the perfect gaming headset? Almost. I'd love to see Sony implement some form of vibrational feedback in the INZONE H9, much like Razer's HyperSense technology on its high-end headphones. That, paired with the PS5's DualSense controller would make the H9 the undisputed accessory to buy for PlayStation owners.\nAlternatives to consider\nThe Sony INZONE H9 is priced to compete, which means there are plenty of formidable alternatives that you may also want to consider:\nIf you're seeking a flagship gaming headset that supports a wired connection, check out the HyperX Cloud Alpha S. Currently sitting atop ZDNet's best gaming headset list, the Cloud Alpha S delivers a surround sound experience that rivals that of the Sony INZONE H9.\nLike the Sony, the SteelSeries Arctis Nova Pro is a wireless gaming headset that comes with dual connectivity, fully customizable audio, and noise cancelation. It's also built with a steel frame finish that gives it a more premium feel.\nBefore there was INZONE, there was the Pulse 3D, a wireless headset dedicated to PlayStation 5 users. The headset is significantly cheaper at $99, supports Sony Tempest 3D, and sports a design that is arguably cleaner than the H9."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/home-entertainment/this-msi-handheld-could-replace-my-gaming-laptop-and-not-just-for-its-more-portable-design/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis MSI handheld could replace my gaming laptop, and not just for its more portable design\nWhen it launched in 2017, the Nintendo Switch had a massive impact on the gaming industry. It showed the world that it was possible to bring AAA gaming to handheld devices, and since then, we've seen other companies follow suit with their own portable consoles. MSI was one of them, but it had a rocky start. The Claw A1M saw mixed reviews upon its release, with ZDNET's Taylor Clemons criticizing its battery life and graphics capabilities.\nAlso: Snag the HP Victus 15 laptop for nearly 75% off thanks to this Walmart deal\nThe good news is that it seems MSI took the feedback seriously when developing its new model, the Claw 8 AI+. This handheld addresses many of the issues that plagued the previous generation, but it's not quite perfect. Let's take a look.\nAn updated (and unique) design\nMSI made several interesting decisions when upgrading the console's design. It's similar in size to the Steam Deck, measuring 11.77 x 4.96 x 0.94 inches, but it's also heavier at 1.75 pounds. Because of this bulk, traveling with the handheld can be tricky, and users with small hands might find it difficult to hold. I, however, found the Claw 8 to be quite comfortable.\nThere is one area where MSI's handheld beats the Steam Deck hands-down: the display. It houses an eight-inch FHD+ (1,920 x 1,200 pixels) touchscreen running at a 120Hz refresh rate. Everything on this display looks great, and I enjoyed the smooth on-screen animations.\nMany gaming consoles opt for an all-black color scheme, but the Claw 8 AI+ stands out by implementing \"Sandstone\" on the face plate, creating a two-tone look. It gives the device a unique look among a sea of similar-looking hardware. But I found the \"metallic beige\" a strange choice; it clashes with the RGB lights.\nAlso: I recommend this Windows laptop to creatives and professionals - even if it's meant for gamers\nMSI made other external adjustments, as well. It boasts a \"Cooler Boost HyperFlow\" system to keep internal temperatures low. Cool air is directed to vital areas, while warm air is expelled through the top vents. I highly appreciate the hall-effect analog sticks. These ensure the controls perform well and maintain accuracy without the potential risk of stick drift. Around the back are a couple of extra buttons that can be hotkeyed to specific actions.\nGaming performance: on-point\nSpeaking of performance, MSI's Claw 8 AI+ did very well in my tests. Under the hood of my review unit was an Intel Core Ultra 7 258B processor, an integrated Intel Arc 140 V graphics card, and 32GB of RAM.\nI played old and recent games, and nearly every title ran great. There weren't any frame rate drops, stuttering, or exceptionally long load times -- except for one. I encountered all of those problems in \"Final Fantasy 7 Rebirth\". To be fair, that game, when it was first released, was unoptimized. It didn't run very well and the Claw 8 AI+ wan't the only handheld having a tough time supporting it at the time. Rest assured that, apart from the occasional outlier, most games will perform fine on MSI's device.\nAlso: This 8-inch gaming tablet is the ultimate plane entertainment device (and on sale)\nOn the top of the gadget are a pair of USB-C ports that can be used to connect the Claw 8 to an external monitor, opening up additional usability scenarios. For one, the Intel hardware on board allows for a laptop-like experience.\nIt performs decently in this regard; I encountered no significant slowdown while running 40 browser tabs and multitasking with several apps. But without a dedicated GPU, MSI's machine falls short of your average gaming PC. If I had to quantify it, this handheld performs similarly to a low-cost gaming PC like Lenovo's LOQ Tower 17IRR9.\nVideo games may be fine, but Windows 11 is another story. It seems the OS wasn't meant to be condensed to fit onto a gaming handheld because I ran into bugs. One time, after updating the software, the in-game controls were disabled. I couldn't move my characters, only the cursor. Fortunately, a quick reboot solved the problem. Further optimization with Windows will hopefully improve the experience.\nTo end on a high note, I want to shout out Claw 8's solid runtime. The company claims you can game on its handheld for four hours straight before needing a recharge. I actually managed to get the battery to last 4.5 hours. For the continuous video playback test, the console ran for nearly 13 hours straight before tapping out. That's some of the longest run times for any handheld we've tested.\nZDNET's buying advice\nThe MSI Claw 8 AI+ is available for preorder right now. It has actually already launched, but according to a company representative, preorder demand was so high that the developer paused it. At $999, this handheld is more expensive than even the OLED Steam Deck, but given its top-notch performance, battery life, and eight-inch display, the MSI Claw 8 makes itself worth the price."
    },
    {
      "url": "https://www.zdnet.com/article/i-replaced-my-samsung-oled-tv-with-this-sony-mini-led-model-for-a-week-and-didnt-regret-it/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI replaced my Samsung OLED TV with this Sony Mini LED model for a week - and didn't regret it\nSony Bravia 5 TV (98-inch)\nZDNET's key takeaways\n- Enhanced color, contrast, and clarity make this TV live up to its hype.\n- It handily delivers upscaled HDR content and high-speed footage.\n- A soundbar will complement its size, and its off-angle viewing can be less than perfect.\nBest test deals of the week\nSony recently sent us the 2025 Bravia 5 TV, this one with a 98-inch screen and weighing in at 158 pounds. It goes without saying that this TV is a beast -- an expensive one. And the Bravia 5 is not even considered the company's flagship model (you can look to the Bravia 8 II and Bravia 9 for that). But this TV is impressive, and after testing it for a week, I'll explain why.\nAlso: You should turn off this default TV setting ASAP - and why even experts recommend it\nThe Bravia 5 is a Google TV, so setting up the UI was fairly easy using the remote and the Google Home app on my phone. But be prepared for a series of screens requiring you to check boxes for privacy disclaimers. The era of streaming content has become very complicated.\nOtherwise, the interface is intuitive, offering quick access to a vast selection of streaming services, apps, and voice control capabilities via Google Assistant. The personalization features are also a plus for helping you discover new content.\nThis behemoth of a display comes with a relatively small remote control. It's slender and lightweight, and if you have fat fingers like me, you might accidentally press enter when you meant to press a navigation button.\nAlso: Your TV's USB port has an underrated feature that can revitalize an old system for free\nI appreciate the downsizing of remotes across most brands these days. Yet despite all the streamlining, Sony (and most others) insist on including dedicated app buttons. You know, for Netflix, YouTube, Disney+, and whatever other platforms the manufacturer contracts with. These buttons take up a lot of real estate and make the remote seem almost \"disposable\" because brands get bought, sold, and sometimes change names.\nFor example, I have a Roku TV with a Vudu button. Who or what is Vudu? That platform still exists, but it's now known as Fandango Media (a joint venture between NBC Universal and Warner Bros.).\nI don't mean to make an example of Sony; its engineers are simply abiding by the current trend. Yet, I haven't met anyone who says they use these dedicated app buttons. When you have a smartly designed home screen, you don't need them.\nThat is one of my two peevish critiques of the Sony Bravia 5. Second is the fact that this remote is not backlit. Come on, Sony. If I'm buying a $6,000 TV, I envision a home cinema experience in the dark (just like in a movie theatre). This means I don't want to turn on my phone to aim a light source at the \"magic wand\" just so I can pause the thing when my DoorDash order arrives. To me, backlighting on remotes seems like a simple ask for anything above a budget model television.\nApologies for my digressionary rant on remote control design. Despite these minor gripes, it became clear to me that the Bravia 5 has plenty to shout about.\nAlso: The next big HDMI leap has arrived - how the 2.2 standard is shaking things up\nFor one thing, Sony's prowess in display technology is impressive. Its proprietary Cognitive Processor XR upscales images beautifully, ensuring motion is slippery smooth with minimal blur. From fast-paced action scenes in the 2023 Mission: Impossible rendition to 2025 NBA highlights, the Bravia 5 delivered 4K resolution with exceptional clarity, vibrant colors, and impressive contrast. HDR content truly pops, showcasing deep blacks and brilliant highlights.\nWhile 4K content looks phenomenal, lower-resolution content (like older cable broadcasts) tends to reveal imperfections more noticeably on such a large screen, even with the XR processor's excellent upscaling.\nThe Sony Bravia 5 can display up to a 120Hz refresh rate with VRR and ALLM enabled, which means the TV dynamically adjusts to match the frame rate of the content being displayed. This is especially good news for gamers. With those kinds of specs, playing Fortnite on a display of this size is an electrifying experience. The Bravia 5 showed no sign of screen tearing, with exquisitely responsive gameplay.\nAlso: The best Sony TVs of 2025: Expert tested and reviewed\nAlready impressed by the images on this behemoth TV, I ran a few tests at the lab for dirty screen effect, burn-in, and blooming. I clocked no degradation, even close to the edges. The color test was consistent; the subtitle test yielded no visible blooming, and the scrolling text motion was liquid.\nHaving said that, viewing the Bravia 5 from side angles was not the best. It's fair to assume that, with the same build and technology in a smaller Bravia 5, this would also be the case. With a 98-inch screen, though, you probably won't get many complaints from someone sitting on the far edge of your couch. And while Sony TVs generally handle reflections well, a screen this large can still be susceptible to glare in brightly lit rooms, so strategic placement and light control are important factors. (You might consider getting some blackout curtains.)\nAlso: I changed 12 settings on my Apple TV to instantly improve the performance\nThis Mini LED TV bears a peak brightness of around 800 nits. That isn't eye-popping OLED-level brightness, but in a dark room, you might want to lower the brightness on a Bravia 5 to prevent eye strain. Trust me, the TV is plenty bright, and it can accommodate seating from any conceivable home theater.\nWhat about sound? The Sony Bravia 5 uses Sony's Acoustic Multi-Audio system, and it's worth some praise. It combines two down-firing X-Balanced speakers for bass and midrange with a pair of Sound Positioning tweeters on the top corners of the back panel to handle mids and highs. The result is a well-balanced listening experience, with clear dialogue and vocals complemented by ambient effects that fill the space nicely.\nFor the ultimate audio experience, though, the Sony Bravia 5 could use a companion soundbar to round things out. Again, if you're investing this much in a giant screen, then your budget might not be too far stretched to install a comprehensive surround sound system as well.\nAlso: This is the soundbar I recommend for deeply immersive audio - and now it's $300 off\nThe Bravia 5 has an impressive array of connectivity options, including Wi-Fi 6E and Bluetooth 5.3 on the wireless side, and several physical ports. I really like how Sony included an infographic panel (of sorts) right next to each port to make it clear which cables go where. It comes with four HDMI ports -- one of them eARC (for that soundbar you should buy), another being 4K at 120Hz (for your online gaming needs).\nZDNET's buying advice\nThe 98-inch Sony Bravia 5 is a formidable piece of home entertainment technology. Its stunning picture quality, immersive scale, and excellent smart features make it a dream display for any cinephile or gaming enthusiast.\nGrand proportions notwithstanding, Sony's quality will shine through on any smaller-sized Bravia 5 screen. This one runs for about $5,999, whereas you can get an 85-inch Bravia 5 for less than half that price or a 75-inch for one-third the cost.\nEven if it's not about the money, not every home can accommodate a colossal 98-inch panel. So, if your home's parameters aren't suitable for something this big, you'll arguably be getting a better value by downsizing a step or two on screen size.\nIf you have the budget and space, the Bravia 5 delivers on its promise of a magnificent viewing experience. And if you're seeking the ultimate home cinema experience, pair this TV with a high-end soundbar to match the visual grandeur with equally powerful and nuanced audio.\nHow we test TVs\nWhile testing and researching the TVs featured on this list, I and other ZDNET experts kept these criteria in mind:\n- Price: Not all budgets are created equal. And if you're working with a limited budget, that shouldn't mean you have to settle for a sub-par TV.\n- Screen size: The most important factor to consider, after price, when shopping for a new TV is whether or not it will fit into your space.\n- Picture and audio quality: A new TV doesn't mean much, even if it costs an arm and a leg, if it doesn't provide a great picture and clear audio. The best TVs we test have often been ensured to support various HDR codecs, including HDR10+ and Dolby Vision, as well as enhanced audio software like Dolby Atmos, Dolby Digital Plus, and object-tracking sound.\nFor a more detailed look, check out our extensive TV testing methodology."
    },
    {
      "url": "https://www.zdnet.com/article/i-fell-in-love-with-a-2000-mirrorless-camera-that-puts-design-and-simplicity-over-everything-else/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI fell in love with a $2,000 mirrorless camera that puts design and simplicity over everything else\nSigma BF\nZDNET's key takeaways\n- Sigma's BF is a $2,200, 35mm full-frame, mirrorless digital camera that radically changes the mode of operation by replacing the gaggle of buttons with an elegant click-wheel.\n- It's a great first camera but also has tons of pro features\n- A future upgrade to a higher-resolution 60-megapixel sensor would be a welcome enhancement.\nTaking pictures with a digital camera hasn't changed much in thirty years. The electronics have improved, but the basic act of operating a digital camera has remained mostly the same. Cameras are a gaggle of buttons that are a cryptic arrangement to anyone but the initiated.\nThe real innovation in the picture-taking experience has been the smartphone, which has made picture-taking an always-available tool for documenting everything with relative ease.\nThere is still an audience, however, for innovation beyond what smartphones offer. Young consumers keep buying digital cameras, and a new generation is always interested to learn more about photography as an art.\nAlso: The best vlogging cameras of 2025: Expert tested and reviewed\nInto the void steps lens and camera maker Sigma Corp., based in Kanagawa, Japan, just outside Tokyo. The company this spring introduced a radical redesign of the digital camera's basic mode of use.\nThe Sigma BF, as it's called, reduces the mass of buttons to a small set of touch-sensitive controls. All the functions of digital photography are still there to be experimented with and exploited -- shutter speed, lens aperture, or \"f-stop,\" and \"ISO,\" the level of light that can be recovered from a scene -- but they are under your command in a radically simplified user interface.\nI've been testing the BF for some weeks now, and I'm smitten with the changes. The hardware's design is beautiful, and the new user interface is very thoughtful. The name \"BF\" stands for \"beautiful foolishness,\" and you could say this kind of redesign is crazy, but I love it.\nA camera for a new age of photographers\nSigma, a sixty-three-year-old company, makes most of its money from lenses for all camera brands. As a result, its cameras have tended to be somewhat experimental, never selling in the same volume as Sony, Canon, or Nikon. That means that the company takes chances. Often, the results are wild and beautiful.\nThe BF is really meant for a new age of prosumers who want to up their game in photography. At a retail price of $2,199, the price is not insignificant, but it is on the low end for what you'd pay for a very good 35mm digital camera these days. Lenses, which have to be bought separately, run from about $600 for a fixed focal length \"prime\" lens to $1,300 or more for zoom lenses. The BF uses what's called an \"L-mount,\" which means you're not limited to Sigma's lenses; it's also compatible with lenses from Leica, Panasonic, Samyang, and Sirui.\nAlso: Eufy's latest security camera has AI-powered color night vision - and no monthly fees\nThe premise of stepping up your game from the smartphone camera is pretty simple, to my mind: You will never, ever, get as good a picture with any smartphone camera as you will with a camera that has a real lens. The lens is the key. The optics are just so superior to the optics on a smartphone.\nI tested the BF with a 50mm prime lens from Sigma, the same kind I already use for most of my photography.\nNo matter what you are photographing, there are immediate benefits to using a real camera versus a smartphone camera.\nOne benefit is the detail you get. Here's a picture of a butterfly landing on some vegetation in a vivarium. When cropping the image to see the butterfly up close, you'll get a level of detail that is clean rather than the murky detail you get even with a smartphone's optical zoom:\n(None of these photos have been edited. They are all straight out of the camera. In some cases, the file size has been compressed to accommodate the publishing system.)\nNot only detail but also control of the depth of field via the aperture dial on the lens provides control over the selective blurring of objects, the \"bokeh.\"\nSmartphones will give you fake bokeh that is generated in software rather than the actual bending of the light via the lens elements. Rarely will fake bokeh give you a really complex, thrilling effect where both foreground and background elements are selectively blurred, leading to a more sophisticated image, such as this cypress I snapped in New York's Central Park:\nAnd even when fake bokeh works, I don't think you'll achieve the almost holographic, floating beauty you get with a real lens while preserving all the detail of the foreground subject, as with this thistle:\nThe second advantage is that a real lens will give you more real proportions than a smartphone lens that has a lot of barrel distortion. Like a building architectural shot or this bank vault:\nYou can get a nice, crisp skyline shot at twilight as the light changes:\nA swing to simplicity\nWhere the BF departs from other cameras is in the simplicity of design and user interface.\nThe hardware is, very simply, a solid shell milled from a block of aluminum and then filled with electronics. It's a gorgeous manufactured object with a super solid feel. (Sigma cameras always feel super solid, but this is on a new level.)\nThe BF's body is one of the lightest full-frame mirrorless cameras on the market, at just under a pound, compared to devices such as the Sony a7 IV, which weighs nearly a pound and a half.\nFor non-camera users, the weight of any real camera is something of a surprise compared to a smartphone such as an Apple iPhone Pro, which weighs half a pound. Holding 15 ounces worth of an unfamiliar object prompted some people to whom I handed the BF to remark, \"It's so heavy!\"\nAlso: First look at iPhone 17 Pro? Public images seemingly confirm big design and camera changes\nThe total weight of the camera is the combination of the 15 ounces and the 12 ounces of the 50mm Sigma lens. That kind of heft is typical of full-frame lenses because they have a lot of glass inside them. (And this particular Sigma lens is not very heavy as 50-millimeter lenses go.)\nThe real adjustment for a novice photographer is getting used to the balance of weight between camera and lens versus carrying a slab of a smartphone with uniform weight distribution.\nThe camera comes in two finishes, a striking silver color and a deep black. I chose to try the black as I like to use the camera often in discreet settings such as a jazz club, so I wanted something less flashy than the silver.\nThe sensor is a full-frame, 35mm Sony chip with just under 25 megapixels, less than the 60 megapixels in some 35mm cameras. Despite a lower pixel count, I found the sensor produced rich detail, certainly enough for Instagram pictures and possibly good enough for wall-sized prints depending on the exposure. Sony is a very reliable name for sensors, so it makes sense for Sigma to go with the market leader.\nImages are stored in the internal 230-gigabyte flash memory, which I found to be more than enough for my purposes. I usually offloaded the pictures onto my iPad or MacBook after each photo-taking session via USB-C and then cleared the BF's memory.\nAlso: Why the best fix for headless server frustration might be a little box named Comet\nOn the software side, the radical simplification of the user interface is striking -- it's even something of a revelation.\nI've been a user of Sigma cameras for over a decade, my main camera these days being the Sigma fp-L, a 60-megapixel model introduced a couple of years ago. I love that camera, but I would be very happy to see the changes in the BF user interface become standard on Sigma cameras going forward.\nThe main innovation is removing a lot of shooting information from the LCD screen. Instead of seeing the aperture or shutter speed and other settings constantly on the display, each setting on the BF occupies a separate, tiny LCD -- it's called a \"status monitor\" though I tend to think of it as simply a \"mini-LCD\" -- to the right of the main display.\nA click wheel just below the mini-LCD, formally called the \"dial pad,\" reminiscent of the first Apple iPod's click wheel, lets you rotate through the values of shutter speed, etc. The changing values are displayed on the mini-LCD as you do so, and you click the center button of the click wheel to select the setting you want.\nThere's also a touch-sensitive playback button, so you can peek at what you just snapped with a soft touch, and a touch-sensitive menu button, which is a quick way to peek at the camera's settings. And a power button at the bottom of all this, of course.\nThe effect is that the main display screen is a pristine window into what you're capturing in the real world, while the mini-LCD and the click-wheel are your controls. It's a nice division that elegantly separates the gaze from the adjustments.\nThe main LCD is a 2.1 megapixel model and is terrifically responsive for things such as selecting the focus area by tapping with your finger, or using pinch and swipe when looking through the photos you've taken.\nAlso: Stanford's holographic AI glasses are coming for your clunky VR headset\nIf you half-press the shutter button, the display momentarily shows the key settings before you fully commit to the shutter release. If you press on the center button of the click-wheel, or dial pad, extra settings come up for the function that's in focus, such as shutter speed.\nStreet photography delight\nThe BF's light weight and simplified user interface made for nice street photography, one of my favorite pastimes.\nI tended to carry the camera at my waist in one hand, holding onto the lens, sometimes with the camera body flipped upside-down, with my pinky finger on the shutter button. That way, I achieved a kind of nonchalant pose that did not draw attention to my picture-taking.\nAlso: I used Google's photo-to-video AI tool on my selfie - and it made me do the tango\nSometimes, I looked at the LCD to see what I was snapping, but oftentimes, I just took a picture in the general direction to see what chance would produce.\nThe autofocus function of the BF was super fast, notably faster than the response time of the fp-L, probably because of the BF's lower-megapixel-count sensor. That made for excellent motion capture, such as this basketball game:\nOne of the BF's shortcomings is having an electronic shutter: Instead of mechanical blades opening and closing, the sensor chip controls in software when the exposure happens. The common knock against an electronic shutter is that it can lead to blurring of fast motion. In the case of the basketball game, in late afternoon daylight, I saw no issue.\nAnother potential drawback is that indoors, in artificial light, the electronic shutter can produce dark bands across the image if the shutter speed is too fast. That can require you to take the picture at a slower shutter speed. In practice, I found it not to be much of a problem.\nImproved electronics\nIn addition to autofocus speed, Sigma has done a very good job with the BF's low-light support, which was already quite good on the fp-L.\nOne of my favorite low-light picture tests is a diorama in the North American mammals hall of the American Museum of Natural History in Manhattan. This is one of the darkest exhibits in the museum, and it's challenging to photograph if you don't have the camera resting on a tripod to allow for a long exposure.\nAlso: Why ads are coming to your favorite AI bots and you've only got yourself to blame\nTwo taxidermy wolves run on a painted landscape of the Michigan countryside. To the naked eye, the diorama is very, very dark because it is meant to suggest nighttime on the prairie. Here's what it typically looks like, taken with minimal low-light support by the BF:\nMost museum visitors who view the diorama turn on their smartphone camera's flash to take a souvenir shot. But, to my mind, flooding the scene with flash spoils the effect.\nInstead, I cranked up the BF to its highest ISO setting, 102,400 -- fairly high up there for any digital camera. The result is that the wolves emerge in beautiful detail from the darkness -- not as sharp or clean as if the scene were well-lighted, but that's the point:\nIn practice, the BF does a very nice job in darkly lit spaces where you might actually want a picture, such as a jazz club.\nWhen set on a tripod with professional lighting and a backdrop, the BF is also excellent for formal portraits, far better than what you'll get using a smartphone camera for your headshots.\nEven without using a macro lens, the 50mm will allow you to get pretty good closeup shots of something like your favorite toy, from a minimum distance of 18 inches, which you can then crop and still have lots of vivid detail.\nOf course, you could also add a macro lens to the BF and get even closer.\nA gentle introduction to pro features\nSigma has simplified some of the functions for newbies so that the same technical effects are present but in a more inviting fashion. For example, on the Sigma fp-L, a separate button is for \"tone control\" that lets you adjust the light across the scene by degrees for shadows and highlights to make a scene have more or less contrast.\nOn the BF, there's no button for tone control, but when selecting colors with the click-wheel, you can bump up or down values of \"highlight,\" \"shadow,\" and \"fade,\" to alter the degrees of lights and darks. That works in both still images and videos.\nAlso: What Zuckerberg's 'personal superintelligence' sales pitch leaves out\nThere's also an option called \"look effect,\" where you can dial up or down how vivid or how flat a given color filter is, which is a nice, obvious way to understand making your pictures or videos more striking or more sedate.\nIn practice, the BF does a great job with tone and exposure on automatic. A street scene at sunset, for example, nicely balances the vivid highlights of the sky with the street detail without blown highlights or detail lost in the shadows.\nWhen you review photos, the main LCD display gives you all the information on the tone adjustments you made, which is helpful for determining what works and what doesn't.\nSome things that are typically buried in sub-menus on digital cameras are brought forward in the BF's UI.\nSo, for example, when filming a movie, you have the option to turn on \"constant AF,\" which does a better job of grabbing hold of a new subject entering the frame. That is now an option from the click-wheel rather than being buried as a sub-menu option.\nOf course, there are trade-offs to simplicity. Other functions that were accessed directly via dedicated buttons on digital cameras become things you have to hunt for.\nFor example, auto-exposure lock forces the camera to keep the amount of light in the scene the same as you move it, rather than altering the exposure. This allows you to find the right balance of light and dark and hold onto it while you shift your focus.\nAlso: The 10 apps I can't live or work without - on Windows, Mac, and mobile\nOn the fp-L, auto-exposure lock has its own button. In the BF, you have to move the click wheel to the exposure section of the menus and then turn on auto-exposure lock by tapping on the icon. This extra step is fine if you don't use auto-exposure lock much.\nAnother example is a feature of most digital cameras called fill light, the ability to lighten up dark parts of a picture. On most cameras, you have an option to turn on the fill light while you're taking pictures. On the BF, fill light is something you adjust after the fact by editing the DNG, \"digital negative,\" or \"RAW,\" image in the camera.\nSigma's suggestion overall is to use color and filter adjustments to achieve a similar effect to fill light. In other words, the user interface consolidates traditional operations such as fill light and auto-exposure lock into a simpler set of choices that can be more centrally manipulated.\nAnd some things are just different. On the fp-L, and most cameras, when recording a video, you can take a still image as you're recording. On the BF, if you want a still image as well, you do it when replaying the video, by selecting \"save as JPEG.\"\nHow it performs with video\nSpeaking of video, I found the results were very satisfying. You can take 6K video (6,016 x 3,384) that looks great even without electronic stabilization turned on.\nI took this shot of a woman having her personal photo shoot in front of the Plaza Hotel. Although it's jerky and not cinematic, it was a wonderful spontaneous moment in great quality:\nWhen you turn on the electronic stabilization feature, video is reduced from 6K to \"ultra-high-def\" (3,840 x 2,160) because the camera needs to crop each frame to line up frames and make the shakiness disappear.\nIn a low-light setting, such as this video at Small's jazz club in Greenwich Village, I thought it produced a wonderful-looking film without a tripod.\nHere's where we see an example of the click-wheel at its best. I had the fun of rotating through the different color filters to change up the color from moment to moment while filming, something I would never do when color choices are a single button.\nAlthough my use of the feature is rather gimmicky here, I can see all kinds of possibilities with the click wheel, enabling new ways of controlling the camera during filming.\nLike all cameras, the sound you record with the built-in microphone video is never as good as if you had a dedicated mic attached, especially for something like music. But I thought the result here was very good in a space with challenging acoustics.\nAlso: This hidden Pixel camera setting gave my photos the pop they've been missing\nEven in low light, using the camera hand-held, you can get a nice video like this one taken in a darkened tango hall. In a dark place like a dance hall, with swaying bodies moving to and fro, with the camera in your hand and no stabilization turned on, it can be challenging to capture motion in a way that's satisfying. I love what the BF did with the color and the lights in this scene while managing to shift autofocus from one couple to the next:\nBattery life\nBattery life was fine for my purposes. I got as much as six hours of shooting on a single charge, including intermittent shooting and periods of intense activity. That meant in some cases over 500 exposures in DNG+JPEG format. That's better than the official specification by Sigma for approximately 260 images on a charge. Of course, your results may vary.\nIn my experience, plugging the BF into an iPad via USB-C for forty minutes will charge the camera from zero back to a third of its battery life. You can also bring along a spare battery and swap it in via the latched compartment on the bottom of the BF.\nZDNET's buying advice\nThe complaints I've seen about the Sigma BF from seasoned photographers seem to be mostly about the reduction of controls to the click wheel and the mini-LCD. Consolidating controls in that way, they argue, robs the pro photographer of their muscle memory. Some pros also wish the touch screen did more to control the functions rather than just serving as a very good display.\nAlso: I tried Google's new agentic IDE, and it blows away the popular VS Code - here's how\nIn essence, pros have a hard time adjusting to a radically simplified UI. It's a fair point of view, but this is something of a Steve Jobs moment. You have to break a few eggs to make an omelette, and you may have to break habits to reinvent how photography is done.\nI think the BF is a terrific option for a beginning photographer or even an experienced pro. The touch-screen display is intuitive in a smartphone age, the electronics are just as fast as you'd expect based on smartphone picture-taking, and the output is very Instagram-worthy.\nAnd your envious friends will immediately want to know, What is that wild-looking camera you've got?"
    }
  ],
  "argos_summary": "Sony’s new InZone H9 II delivers upgraded 360‑degree spatial audio, a detachable mic, and a lighter, more premium headband, using 30 mm drivers from the WH‑1000XM6 and offering solid ANC for FPS games. The review highlights Sony’s collaboration with Fnatic, quality‑of‑life features, quick charging, and the headset’s versatility as both a gaming and everyday pair, but notes a fingerprint‑prone black finish and reduced battery life when ANC is on. Overall, the H9 II excels in audio precision and comfort, though its premium price and design quirks may deter some buyers.",
  "argos_id": "QAXD0SSGD"
}