{
  "url": "https://www.cleveland.com/entertainment/2025/08/kid-cudi-taking-over-house-of-blues-cleveland-for-special-album-release-show.html",
  "authorsByline": "Malcolm Abram | mabram@cleveland.com, mabram, Malcolm Abram",
  "articleId": "9948faa863314d57b8f5786147dcace7",
  "source": {
    "domain": "cleveland.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Cuyahoga County",
      "city": "Cleveland",
      "coordinates": {
        "lat": 41.4996574,
        "lon": -81.6936772
      }
    }
  },
  "imageUrl": "https://www.cleveland.com/resizer/v2/UPFF6Y6CT5DWLP5732HTX3EVIY.jpg?auth=b4c0e6446ec15b9b1e3762211ad240f169b2dec6e11eb25c71cb348fe5ce0cd2&width=1280&quality=90",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T19:28:55.182000+00:00",
  "addDate": "2025-08-27T19:41:04.935138+00:00",
  "refreshDate": "2025-08-27T19:41:04.935139+00:00",
  "score": 1.0,
  "title": "Kid Cudi taking over House of Blues Cleveland for special album release show",
  "description": "Cleveland rapper will perform and record a short film for his new album track \"Mr. Miracle\" at the hometown show.",
  "content": "Cleveland native, rapper-actor Kid Cudi will perform a special concert and short film taping at the House of Blues Cleveland on Sunday, August 31. Here, Kid Cudi performs live on stage during Rock en Seine music festival at Domaine National de Saint-Cloud on August 21, 2025 in Paris, France. (Photo by Kristy Sparow/Getty Images For ABA) Getty Images\n\nCLEVELAND, Ohio - Cleveland rapper Kid Cudi will be hosting a special homecoming album release show at 7 p.m. at the House of Blues Cleveland on Sunday, August 31. Tickets for the Kid Cudi performance, which will also includes a chance for concert-goers to be part of the filming of his upcoming short film ”Mr. Miracle,” sold out in minutes at houseofblues.com/cleveland.\n\nThe song “Mr. Miracle” is a melodic guitar-driven, alt-rock tune from Cudi’s eclectic 11th studio album “Free,” released on Friday, August 22.\n\nBut there is still a glimmer of hope for fans who missed the show announcement. Kid Cudi a.k.a Scott Mescudi, who grew up in Shaker Heights and Solon is using Ticketmaster’s Face Value Exchange program which only allows current ticketholders to resell their tickets at the original face value. So, non-ticket-holding fans can to hope that some ticket holders will have to resell their tickets online before Sunday evening.",
  "medium": "Article",
  "links": [
    "https://www.kidcudi.com/",
    "https://www.houseofblues.com/cleveland/EventDetail?tmeventid=vv1AAZkG_GkdHoStc&offerid=0",
    "https://help.ticketmaster.com/hc/en-us/articles/9781464415249-How-does-Ticketmaster-s-Face-Value-Exchange-work"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kid Cudi",
      "weight": 0.11924378
    },
    {
      "name": "special album release show",
      "weight": 0.10097555
    },
    {
      "name": "Cudi",
      "weight": 0.09681476
    },
    {
      "name": "short film taping",
      "weight": 0.08099571
    },
    {
      "name": "Cleveland",
      "weight": 0.078941904
    },
    {
      "name": "Tickets",
      "weight": 0.07885761
    },
    {
      "name": "Mr. Miracle",
      "weight": 0.07824953
    },
    {
      "name": "Getty Images",
      "weight": 0.0740333
    },
    {
      "name": "Cudi’s eclectic 11th studio album",
      "weight": 0.071394555
    },
    {
      "name": "the Kid Cudi performance",
      "weight": 0.06840212
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.95361328125
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.86328125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Urban & Hip-Hop",
      "score": 0.43212890625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.320556640625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.311279296875
    }
  ],
  "sentiment": {
    "positive": 0.36506146,
    "negative": 0.09396177,
    "neutral": 0.5409767
  },
  "summary": "Cleveland native, Kid C.\n will host a special album release show at the House of Blues Cleveland on August 31. The event also includes a chance for fans to participate in the filming of his upcoming short film, \"Mr.\n\". Tickets for the event sold out within minutes. However, there is hope for non-ticket holders to resell their tickets at the original face value through the Face Value Exchange program.",
  "shortSummary": "Rapper Kid Cudi will perform a special concert at the House of Blues Cleveland on August 31, promoting his upcoming short film \"Mr. Christ Christ\" (Racist)",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c107c0f5086d4fda92d9dbf78e1cc42e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://help.ticketmaster.com/hc/en-us/articles/9781464415249-How-does-Ticketmaster-s-Face-Value-Exchange-work",
      "text": "Ticketmaster’s Face Value Ticket Exchange allows fans to sell their tickets to other fans at face value. It’s free to use for sellers.\n- Sign into your Ticketmaster Account.\n- Find your order in My Tickets.\n- Select the Sell button.\n- Choose to list one or all your tickets for the price you paid.\n- Tell us how you'd like to get paid. Follow the prompts and enter a payout method. Visit our help page How and when do I get paid for tickets I sell? to learn more.\n- Review your listing and you're all set.\nWe'll deposit your payout typically within 7 days after the event.\nIn order to resell tickets for events in the U.S., you must have a U.S. bank account. In addition, your Tax Seller Details, which may include a Social Security Number (SSN) or an Individual Taxpayer Identification Number (ITIN), must be validated before we can pay you. You can fill out your Seller Tax Details in this form. Visit our help page 1099-K Form: Answers to Some Common Questions for more information.\nDo I have to list all my tickets for sale on the Exchange or can I list just one?\nYou have the flexibility to list one or all of your tickets. When you list your tickets on Ticketmaster you can choose which seats you’d like to sell.\nI bought a ticket on another site. Can I sell my ticket on Ticketmaster?\nFace Value Exchange tickets that are in your Ticketmaster account can be sold on Ticketmaster to another fan for the original price paid. Tickets purchased on another site that have not been transferred to your Ticketmaster account can't be resold.\nI bought a resale ticket and now I can’t go. Can I list it for sale again?\nYes, if you purchased your resale ticket on Ticketmaster you can sell that ticket to another fan for the same price you paid.\nIs there a deadline to list my tickets for sale on the Face Value Exchange?\nTickets may be listed up until one hour after the event start time. However, the sooner you can list your tickets, the better opportunity for them to be purchased by another fan. Once it’s been an hour since the event started, any tickets that have not sold will be placed back into your account and will be available for you to use.\nIf I changed my mind, can I remove my listing?\nYes, as long as your tickets haven’t been sold, you can remove your listing at any time. You can manage your listing from the Listings page.\nHow do I remove my listing?\n-\n1. Sign into your Ticketmaster Account.\n2. Tap Sell.\n3. Select Tickets I’m Selling.\n4. Tap Remove Listing.\n5. Confirm that you want to remove your listing and it will be taken down shortly. -\n1. Sign into your Ticketmaster Account.\n2. Select My Listings under the My Tickets section.\n3. Select your order.\n4. Click the Remove Listing button to the right of the listing you want to remove.\n5. Confirm that you want to remove your listing and it will be taken down shortly.\nWho determines how much I can sell my tickets for on the Face Value Exchange?\nIf you want to sell your tickets and the tour is using Face Value Exchange, the listing price is automatically set at the total price you paid. This includes the face value price set by the artist, plus any applicable fees and taxes.\nWhy can’t I change the price of my ticket when I list it for sale?\nFace Value Exchange was developed to provide artists with a way to minimize scalping and get tickets to fans at the price they set. To respect the artist’s decision, tickets may only be listed at the total price paid. This includes the face value price set by the artist, plus any applicable fees and taxes.\nDo I get to pick who I sell my tickets to?\nYou can choose to share your listing with friends or on social media with a secure personal link. Your listing will also be available for fans on our resale marketplace.\nWhat happens if my tickets don’t sell?\nYour tickets will remain available for purchase until one hour after the start of the event. Once that time has passed, any tickets that have not sold will be placed back into your account and will be available for you to use..\nHow and when do I get paid after selling my tickets on the Exchange?\nWhen your tickets sell, you’ll get paid through your selected method of payment typically within 7 business days after the event, provided we have all the necessary information. When your tickets sell, we’ll automatically notify you.\nTo ensure there’s no delay in receiving your payment, be sure to follow these steps:\n- Make sure your account is up to date with a valid method of payment and a valid card on file to refund the buyer in case the event is postponed or canceled. If you're adding a new bank account, visit our help page How do I verify the two Ticketmaster deposits to get paid by direct deposit? for step-by-step instructions on completing the process.\n- Submit your Seller Tax Details.\n- If you’re getting paid by direct deposit into your bank account and this is your first time using that account, for your security you’ll have to verify two small deposits.\nAfter completing these steps, you’ll be paid typically within 5–7 business days.\nHow do I know if I'm purchasing tickets on the Face Value Exchange?\nWhen you land on the event page for a show that's using Face Value Exchange, an info box will appear that notifies you that you're purchasing Face Value Exchange tickets.\nI don't see any tickets available for purchase on the Face Value Exchange. What should I do?\nIt’s likely that other fans will only list their tickets once they are absolutely certain of a scheduling conflict, or last-minute issue preventing them from attending their event. We suggest checking back often — you never know when more tickets might pop up."
    },
    {
      "url": "https://www.houseofblues.com/cleveland/EventDetail?tmeventid=vv1AAZkG_GkdHoStc&offerid=0",
      "text": "Kid Cudi\nAge Restrictions:\nAdmission Type:\nVenue & Event Info:\nThere is a 4 ticket limit on this event. Doors open at 7pm. Music begins at 8pm. This is an all ages event. No Resale Over Face Value: Kid Cudi is using Ticketmaster''s Face Value Exchange to help fans get tickets at the original price. Tickets can only be resold on Ticketmaster at face value. States Blocking Artist Resale Terms: New York, Illinois, Colorado, Virginia, Utah and Connecticut have state laws that prevent resale restrictions. In those states, Ticketmaster will still honor Kid Cudi''s terms by keeping resale prices at face value on its site.\nFor the latest safety guidelines, please review our enhanced venue protocols at www.houseofblues.com/cleveland/faq.\nNOTE OUR BAG POLICY:\nOnly the following bags are allowed:\n- Bags up to 12\"x6\"x12\" are allowed in the venue.\n- All bags will be searched prior to entry.\n- Bags that are not clear will be subject to additional search.\nMake it a Complete Night Out! Enjoy House of Blues & all it has to offer!\nBring the whole family & join us at the Restaurant & Bar for your official pre-show fuel. Reservations are encouraged. Book your tables here!\nLooking for a more elevated experience? Guests 21+ are invited to join us in the Foundation Room before the show for the finest in food & craft cocktails. On most nights, keep the party going after the show, and experience the after-hours experience at the Foundation Room. Click here for more information & to RSVP your spot!\nPass the Line:\nSpecial Offers:\nVIP:\nFoundation Room:\nRestaurant:\nParking:"
    }
  ],
  "argos_summary": "Kid Cudi, a Cleveland native, will host a homecoming album release show and short‑film taping at the House of Blues Cleveland on Sunday, August 31. The event, featuring the new track “Mr. Miracle” from his 11th studio album “Free,” sold out minutes after tickets went on sale. Fans who missed the original sale can try to buy tickets through Ticketmaster’s Face‑Value Exchange, which allows current holders to resell at the original price. The venue’s policies include a 4‑ticket limit, all‑ages admission, and a bag‑size restriction, while the show’s pre‑ and post‑event experiences are promoted via the House of Blues restaurant and Foundation Room.",
  "argos_id": "VPQL0FDZC"
}