{
  "url": "https://www.ajc.com/politics/2025/08/democrats-strong-showing-in-state-senate-race-raises-gop-concerns/",
  "authorsByline": "",
  "articleId": "e5917ad647714546952f010012f8fbb9",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/NAZO7XPIZ5A5JJSWGNYHB6ILOE.jpg?auth=c0fe46150cba32a71f53037d6b7d178695e848ba8b7979b242dd0ad2635d4121&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T10:52:02+00:00",
  "addDate": "2025-08-27T10:59:23.700902+00:00",
  "refreshDate": "2025-08-27T10:59:23.700904+00:00",
  "score": 1.0,
  "title": "Democrat’s strong showing in state Senate race raises GOP concerns",
  "description": "Debra Shigley outperformed the 2024 Democratic candidate by 10 percentage points. She'll face a Republican in a Sept. 23 runoff election.",
  "content": "Democrat Debra Shigley’s surge to the top in Tuesday’s special state Senate election has alarmed some senior GOP officials as the attorney and former journalist captured roughly 40% of the vote in a district that has overwhelmingly supported President Donald Trump.\n\nShigley was easily the top vote-getter in the seven-candidate scramble, securing a spot in the Sept. 23 runoff election that both parties see as a midterm showcase. She’ll likely face Republican Jason Dickerson, who had a small lead for second place in the jumbled field, the AJC’s Michelle Baruchman reports.\n\nIt was an eye-opening result in a district spanning parts of north Fulton and Cherokee counties that was drawn to be safely Republican. Senior GOP officials were prepared for Shigley to make the runoff, but some were worried by her surge to the top of the pack.\n\nShigley outperformed the 2024 Democratic candidate by 10 percentage points — just months after Republican former state Sen. Brandon Beach carried the district with 70% of the vote to win another term.\n\nHis decision to step down to join Trump’s administration triggered the low turnout contest, which both parties see as an early test of the president’s popularity and future get-out-the-vote efforts.\n\nNow party leaders are preparing major mobilization efforts. Georgia GOP Chair Josh McKoon said he’s working with local activists to “make sure our voters turn out in force.” Democrats are eyeing a statement win that could boost momentum headed into next year’s midterms.\n\nShigley lost last year to state Rep. Jan Jones, the No. 2 Republican in the Georgia House, by more than 23 percentage points. For this year’s campaign, she focused on bolstering health care and opposing GOP-led efforts to expand school vouchers and advance Trump-aligned policies.\n\n“People are fed up. They are frustrated with the chaos and the status quo,” Shigley said last night.\n\nDemocratic Party of Georgia Chair Charlie Bailey put it more bluntly: “There’s nothing like elections to tell us what voters think.”\n\nGood morning! We’re 69 days away from elections for city offices and seats on the Public Service Commission.\n\nHere are three other things to know for today:\n\nU.S. Rep. Rick Allen dismissed concerns that Georgia’s rural hospitals would be hurt by cuts in President Donald Trump’s tax and spending law, saying the impact would be limited only to states that chose to expand their Medicaid programs under the federal Affordable Care Act.\n\n“Not in Georgia,” the Augusta Republican said in response to a question from Savannah TV station WTOC about the bill’s impact. “No, Georgia didn’t expand Medicaid. He’s dead wrong there. It’s only in expansion states.”\n\nBut that’s not true, according to multiple analyses of the bill. Spending cuts will impact Georgia differently than most other states, but they will be significant, the AJC’s Ariel Hart reports.\n\nGeorgia won’t lose much money from Medicaid work requirements. But Georgia hospitals will see less money than they would have from Medicaid over time. A Medicaid funding stream for many Georgia hospitals called “state directed payments” is scheduled to tighten.\n\nPlus, Georgia has a hefty population of people on subsidized insurance plans sold on the state’s Affordable Care Act marketplace. More than 100,000 of them are expected to go uninsured as a result of the law. In total, the health research group KFF estimates about 150,000 Georgians could lose coverage, mostly low-income workers.\n\nState lawmakers today will hold their first hearing examining how to help the growing population of people who are caregivers for aging family members.\n\nThe issue is personal for Senate Minority Leader Harold Jones II, whose father had a stroke in 2019. That’s when Jones said he, his mother and his sister became his caregivers.\n\n“There’s a lot of red tape that you have to go through to get a lot of services,” Jones told the AJC’s Maya T. Prabhu. “They’re there, but you have to go through different things.”\n\nWhile today’s meeting is in Augusta, the remaining meetings will be held in Atlanta, Jones said.\n\nHe hopes the committee finds ways to help families care for their elderly relatives, whether it be cash payments or allowing employees to legally request more flexible work schedules. The U.S. Census Bureau estimates that more than 20% of Georgia’s population will be 60 or older by 2030, an increase of almost 34% from 2012.\n\nSenior Judge David Emerson is holding an emergency hearing today following up on his order directing the Fulton County Commission to appoint two Republicans to the local election board.\n\nRepublicans have asked Emerson to hold the commissioners in contempt for voting against the appointments. The consequences will be at Emerson’s discretion. But if he were to find the commissioners in contempt, he could fine them or even put them in jail — an outcome that would reverberate across the state’s political world.\n\nIt’s a big moment for Emerson, who spent more than three decades as a Superior Court judge in Douglas County. He stepped down in 2021. He’s now a senior judge, giving him authority to preside over cases all over the state whenever a local judge has a conflict.\n\nEmerson was in the news back in 2017 when attorney Ashleigh Merchant accused him of speaking to her in a condescending way in court. Merchant would later be famous for revealing Fulton County District Attorney Fani Willis’ relationship with the special prosecutor in the 2020 election interference case.\n\nIn 2022, Emerson ruled Shelia Edwards — then a Democratic candidate for the Public Service Commission — could stay on the ballot despite not living in the district she wanted to represent. That election ultimately didn’t happen after another judge ruled the commission’s at-large elections violated federal law.\n\nNearly 14% of active registered voters cast ballots in Tuesday’s special Senate election spanning portions of Cherokee and Fulton counties.\n\nSpecial elections are notorious for their low voter turnout. But participation in Tuesday’s election outperformed the statewide Public Service Commission primaries from earlier this year.\n\nVoter turnout in the June 17 statewide primaries was just 2.8%. Voters in state Senate District 21 beat that number in early voting alone as 8% of voters cast ballots ahead of Tuesday’s contest.\n\nTurnout was so low in June that multiple county election officials considered consolidating polling places during the runoff election so they wouldn’t have to waste money staffing locations with hardly any voters.\n\nThe turnout was low, in part, because it was a special election for a position most voters don’t understand. A state Senate seat is more accessible to voters. And Tuesday’s race featured seven candidates, all of whom were spending money to turn out voters in a smaller district.\n\nToday on the “Politically Georgia” podcast Georgia State law professor Anthony Michael Kreis explains why President Donald Trump’s decision to activate the National Guard in Washington has raised constitutional concerns. Also, AJC business editor J. Scott Trubey and Ife Finch Floyd, director of economic justice at the Georgia Budget and Policy Institute discuss troubling unemployment trends for Black women.\n\nYou can listen and subscribe to Politically Georgia for free at Apple Podcasts, Spotify or wherever you get your podcasts.\n\nHave a question or comment for the show? Email us at politicallygeorgia@ajc.com or give us a call at 770-810-5297 and you could be featured on a future episode.\n\nU.S. Rep. Sanford Bishop is hosting an event in Columbus today to identify ways to support military families.\n\nThey have invited members of the public to attend the daylong event that will include breakout sessions, panel discussions and a resource fair.\n\nWarren served “with humility, integrity, and an unwavering focus on doing what was right for our citizens,” the commission said in a statement.\n\nIn a social media post, Attorney General Chris Carr called Warren “a true servant leader who impacted the lives of those around him.”\n\nWant a birthday shoutout in the Politically Georgia newsletter? There’s a form for that. Click here to submit the shoutouts. It’s not just birthdays. We’re also interested in new jobs, engagements, birth announcements, etc.\n\nBefore you go\n\nAfter facing accusations it had gone “woke,” Cracker Barrel announced that it is ditching its new logo after just one week and reverting back to the old one.\n\nThat’ll do it for us today. As always, you can send your best scoops, gossip and insider info to greg.bluestein@ajc.com, tia.mitchell@ajc.com, patricia.murphy@ajc.com and adam.beam@ajc.com.",
  "medium": "Article",
  "links": [
    "https://www.ajc.com/news/2025/08/nbcuniversal-wants-to-change-georgia-law-to-escape-500k-judgment/",
    "https://www.ajc.com/politics/2025/08/fulton-county-commissioners-in-court-over-gop-seats-on-election-board/",
    "https://www.ajc.com/news/business/judge-upholds-eligibility-of-democratic-psc-candidate-shelia-edwards/EJI4EW3D4JEIDGE5G6FYU52S5Y/",
    "https://www.ajc.com/politics/georgia-legislative-navigator/#members/851",
    "https://dhs.georgia.gov/spotlight/2022-05-23/older-georgians-can-remain-independent-and-age-their-way",
    "https://www.facebook.com/GeorgiaAttorneyGeneral/posts/bo-was-a-dear-friend-for-many-years-and-a-true-servant-leader-who-impacted-the-l/1154437649839978",
    "https://www.ajc.com/politics/2025/08/candidates-head-for-a-runoff-in-north-metro-state-senate-race/",
    "https://www.ajc.com/news/2025/08/fulton-sheriff-people-will-continue-to-die-if-city-ends-jail-lease/",
    "https://www.ajc.com/politics/2025/08/black-womens-unemployment-is-rising-nationwide-what-about-in-georgia/",
    "https://www.ajc.com/politics/attorney-who-sought-to-remove-fulton-da-i-had-no-choice-but-to-act/Z6WX52GJXVCMPFTWV7XLL77AQI/",
    "https://open.spotify.com/show/5QJDuWYyrPkTE8MjaiWLrQ",
    "https://www.ajc.com/politics/georgia-legislative-navigator/#members/142",
    "https://www.ajc.com/politics/2025/08/jones-tries-to-straddle-trump-loyalty-and-broad-appeal-in-georgia-governors-launch/",
    "https://www.legis.ga.gov/schedule/senate/AQIARgAAA6nWrITxUepClGGA2bgmimX9GGA2by4HAGeQLC1kSDdIixjC7EHFmfIAAAJaYgAAAJVi9mcGGA2b4qFNnaWZAgEUQssAAACUWYcxAAAALgAAA6nWrITxUepClGGA2bgmimX9GGA2by4BAGeQLC1kSDdIixjC7EHFmfIAAAJaYgAAAA%3D%3D",
    "https://www.ajc.com/politics/georgia-legislative-navigator/#members/840",
    "https://apnews.com/article/cracker-barrel-logo-trump-8b496da282deef3d8d0618c3f9f4db46",
    "https://bishop.house.gov/CMFC-2025summit",
    "https://podcasts.apple.com/us/podcast/politically-georgia/id1356662668",
    "https://www.ajc.com/politics/2025/08/fulton-commissioners-defy-court-order-reject-gop-election-board-nominees/",
    "https://news.monroelocal.org/breaking-walton-county-boc-district-1-commissioner-bo-warren-passes-away/",
    "https://forms.office.com/r/huf0eFxbWq",
    "https://sos.ga.gov/page/election-data-hub-turnout",
    "https://www.ajc.com/news/health-news/thousands-of-georgians-could-lose-health-insurance-if-gop-house-bill-passes/UKNZ5AENOJGH7LPGCO3DO4BCZQ/",
    "https://www.ajc.com/politics/2025/06/a-big-election-with-a-tiny-turnout-few-voters-show-up-for-georgia-psc-primary/",
    "https://www.ajc.com/blog/legal/court-rules-against-law-firm-courtroom-recordings-dispute/fv3cu7Ax9qHqxyCkQ09wHL/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "state Senate District",
      "weight": 0.06694722
    },
    {
      "name": "state Senate race",
      "weight": 0.06627344
    },
    {
      "name": "Georgia hospitals",
      "weight": 0.06621313
    },
    {
      "name": "Politically Georgia",
      "weight": 0.06614618
    },
    {
      "name": "Special elections",
      "weight": 0.06550985
    },
    {
      "name": "state Rep. Jan Jones",
      "weight": 0.06401035
    },
    {
      "name": "Georgia",
      "weight": 0.063823685
    },
    {
      "name": "many Georgia hospitals",
      "weight": 0.06314126
    },
    {
      "name": "Georgia State",
      "weight": 0.06292333
    },
    {
      "name": "Georgia GOP Chair Josh McKoon",
      "weight": 0.061160866
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    },
    {
      "name": "GOP"
    },
    {
      "name": "DNC"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.990234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9892578125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.97509765625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.88037109375
    },
    {
      "name": "/News/Local News",
      "score": 0.35107421875
    }
  ],
  "sentiment": {
    "positive": 0.07248196,
    "negative": 0.7453874,
    "neutral": 0.18213066
  },
  "summary": "Democrat Debra Shigley's strong showing in a special state Senate election has raised concerns among senior GOP officials in the Georgia House. Shigly captured roughly 40% of the vote, securing a spot in the Sept. 23 runoff election that both parties see as a midterm showcase. The result was an eye-opening result in a district that has traditionally supported President Donald Trump. Despite this, Democrats are hoping this win could boost their momentum ahead of the midterms. U.S. Rep. Rick Allen dismissed concerns that Georgia’s rural hospitals would be negatively impacted by cuts in the tax and spending law, stating that the impact would be limited to states that expanded Medicaid under the federal Affordable Care Act. Georgia lawmakers are also set to hear about how to help the growing population of people who are caregivers for aging family members.",
  "shortSummary": "Democrat Debra Shigley's strong showing in a Georgia state Senate race raises concerns from Republican officials about Medicaid budget cuts and potential impact on rural hospitals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7b6828fbb61d4b6a930d8fba60bbfdf0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://bishop.house.gov/CMFC-2025summit",
      "text": "Congressional Military Family Caucus - 2025 Summit\nThe Congressional Military Family Caucus recognizes that when a service member joins the military, it is not a job - it is a family commitment to our country. Each year, the caucus hosts an annual summit to address the challenges faced by America's military families.\nThis year's event will take place on Wednesday, August 27, 2025.\nThis webpage includes information useful to military families and will be updated with information related to the event.\n- Event Program\n- Photos from the Event\n- Explore Resources for Military Families\n- Learn More About & Contact the Congressional Military Family Caucus\nVisit the Congressional Military Family Caucus homepage, https://bishop.house.gov/CongressionalMilitaryFamilyCaucus.\nEvent Program\nThe event will feature subject area experts, military family members as well as organizations, and legislative leaders. The following are the scheduled panels and panelists.\n2025 Military Family Summit Program PDF\ninformation about speakers, panel topics, and the event schedule\nPhotos from the Event\nFollowing the event, we will provide links to photos from the Congressional Military Family Caucus 2025 Summit.\nResources for Military Family\nNeed a little help navigating through the adoption process? Want to better understand your wounded warrior benefits? Is it time to explore adult disability care for your parents? Military OneSource provides support from professionally trained consultants by phone on a broad range of issues for service members, their families and survivors. Eligible members can receive an unlimited number of specialty consultations. Below are links to some of the programs and resources available to military families.\n- Education & Child Care\n- Are you looking for educational resources as a service member, as a military spouse, or for children of military families? Then start here to explore education and employment resources available for these groups.\n- Military OneSource has a great introductory webpage to the many child care related resources and programs available to military families. And when you think \"child care\" it is more than just young children. The webpage includes resources for the full range of youth from the relatively new born through teenagers. Some programs to highlight include...\n- ... child care programs for children as well as DOD-approved child care options as young as 6 weeks to 5 years of age, and...\n- connecting military families with their installation's youth centers and activities.\n- Spouse Employment & Financial Readiness\n- The Military OneSource Spouse Career Center offers free, comprehensive coaching services to all eligible military spouses. Career coaches offer specialty consultations six days a week. Several, specialized coaching packages are available to help you succeed in your chosen career path. Through this website you will find resources for education and careers opportunities as well as tools to assist with job searches, and the Career Advancement Account Scholarship Program.\n- The Career Advancement Account Scholarship Program is a workforce development program that provides up to $4,000 in financial assistance to eligible military spouses for the pursuit or maintenance (including continuing education courses) of a license, certification, or associate's degree necessary to gain employment in an occupation or career field.\n- Managing money and legal affairs are part of mission readiness. Military OneSource provides strategies on consolidating and paying down debt, saving for retirement or college and creating a plan that will lead to financial security. Link to installation legal services that protect you and your family from mishaps, and discover how Military OneSource MilTax free tax filing services can make quick work out of tax return preparation and filing. Set financial goals for your future by tapping into the information and resources available through Military OneSource.\n- Healthcare, Mental Health, and EFMP\n- Check out this introductory webpage by Military OneSource to learn more about the healthcare benefits and resources available to military families.\n- You can also create a customized checklist to stay organized and ensure you have access to the latest information and resources for families with special needs by visiting the EFMP & Me webpage through Military OneSource.\n- And remember, healthcare is not just about taking care of problems. Proactively building up positive health — both physical and mental — are important. Just as physical fitness is a central part of military life, good mental health is as important for your well-being, and military and family readiness. Mental health challenges and issues shouldn't be ignored or hidden. There are lots of resources available to help anyone who is struggling with mental health challenges to feel better. Find out what mental health resources and benefits are available to you.\n- Food Insecurity\n- Unfortunately, food insecurity impacts Americans from many walks of life, including our military families. Frequent moves, spousal unemployment, and lack of access to affordable child care are just a few of the many challenges faced by military families that, while not directly dealing with food, can strain their ability to put food on the table. There are many food assistance programs available to assist and this webpage provides an overview of them.\n- Housing\n- Moving is common in the military. Whether you're relocating to another state or country, there's a pattern to making your new nest – finding a home, packing, moving your stuff and sorting out other logistics. As a service member, you're given various Department of Defense allowances to help offset the costs of housing and moving.\nAbout the Congressional Military Family Caucus\nThe Congressional Military Family Caucus seeks to raise awareness about and improve U.S. military's family resources. Specifically, the Congressional Military Family Caucus focuses on issues such as education, childcare, healthcare, spousal employment, and the effects of multiple deployments. The Caucus seeks to educate Members of the United States Congress and their staff about the challenges facing our nation's military families in order to develop federal policies that better support our nation's military families.\nThe bipartisan Congressional Military Family Caucus was founded in 2009 by Representatives Sanford D. Bishop, Jr. (D-GA-02) and former Congresswoman Cathy McMorris Rodgers (R-WA). Congressman Bishop now co-chairs the caucus with Congresswoman Jen A. Kiggans (R-VA-02).\nIf you would like more information about the caucus, please call either (202) 225-3631 (Rep. Bishop) or (202) 225-4215 (Rep. Kiggans).\nYou can visit the Congressional Military Family Caucus Facebook Page at https://www.facebook.com/militaryfamilycaucus/."
    },
    {
      "url": "https://apnews.com/article/cracker-barrel-logo-trump-8b496da282deef3d8d0618c3f9f4db46",
      "text": "Cracker Barrel is keeping its old-time logo after new design elicited an uproar\nCracker Barrel is keeping its old-time logo after new design elicited an uproar\nCracker Barrel said late Tuesday it’s returning to its old logo after critics — including President Donald Trump — protested the company’s plan to modernize.\nIn a post on its website, Cracker Barrel said it will retain its old logo, which features an older man in overalls sitting next to a barrel and the words “Old Country Store.”\n“We thank our guests for sharing your voices and love for Cracker Barrel,” the company said in a statement. “Our new logo is going away and our ‘Old Timer’ will remain.”\nThe tempest over the logo began last week, when the company announced plans for a simplified design featuring only the company’s name. Lebanon, Tennessee-based Cracker Barrel, which has 660 restaurants in 43 states, made the change as part of a wider plan to modernize its restaurants and appeal to younger customers.\nThe chain’s sales have been slipping as it faces growing competition from breakfast chains and others. In its 2024 fiscal year, Cracker Barrel’s same-store sales, or sales at locations open at least a year, dropped 0.1% despite a 4.9% increase in menu prices. Same-store retail sales at its shops fell 5.5%.\nBut many protested the change. On Monday, Cracker Barrel put out an apologetic statement, saying it “could have done a better job sharing who we are and who we’ll always be.”\nAt that point, Cracker Barrel didn’t say it would change the logo, but said it would listen to its customers and keep many of the things they have come to love about the restaurant, like the rocking chairs on its front porches. The company said it would continue to honor Uncle Herschel — the older man in its logo, who represents the uncle of Cracker Barrel’s founder — on its menu and on items sold in its stores.\nBut the controversy continued. On Tuesday morning, Trump said via Truth Social that Cracker Barrel “should go back to the old logo, admit a mistake based on customer response (the ultimate Poll), and manage the company better than ever before.” Cracker Barrel’s shares rose after more than a week of declines.\nBy Tuesday evening, Cracker Barrel had made its decision and scrapped the new logo.\n“At Cracker Barrel, it’s always been – and always will be – about serving up delicious food, warm welcomes, and the kind of country hospitality that feels like family,” the company said. “As a proud American institution, our 70,000 hardworking employees look forward to welcoming you to our table soon.”\nTrump was among those celebrating the move.\n“Good luck into the future. Make lots of money and, most importantly, make your customers happy again!” Trump said via Truth Social."
    },
    {
      "url": "https://dhs.georgia.gov/spotlight/2022-05-23/older-georgians-can-remain-independent-and-age-their-way",
      "text": "May 23, 2022\nOlder Georgians can remain independent and age their way\nOlder Georgians play a vital role in their communities. They are mentors, economic contributors, caretakers and volunteers. The U.S. Census Bureau estimates that more than 20% of Georgia’s population will be 60 or older by the year 2030, an increase of almost 34% from 2012. With this large increase in seniors to the population, their wants and needs are of vital concern. No senior wants to be reliant on others to fulfill their daily needs in their homes. The Division of Aging Services and the 12 Area Agencies on Aging provide resources to help seniors remain independent in their communities for as long as possible.\nThis Older Americans Month, DHS is highlighting the resources available to help Georgia seniors and their caregivers remain independent. Resources like assistive technology, home services, like home-delivered and community-based meals, and home modification and repair may be available.\nTo learn about home and community-based services like food delivery, congregate meals at senior centers and caregiver resources, please visit Home & Community Based Services | Division of Aging Services | Georgia Department of Human Services. The Georgia Aging and Disability Resource Connection can direct you to resources available in your area. Visit Georgia ADRC or call 1-866-552-4464.\nThe Division of Aging Services works with Georgia Tech’s Tools For Life, the Northwest Georgia Center for Independent Living and Friends of Disabled Adults and Children to help Georgia’s older adults and adults with disabilities maintain independent, healthy lives."
    },
    {
      "url": "https://podcasts.apple.com/us/podcast/politically-georgia/id1356662668",
      "text": "Politically Georgia\nGet real, fact-based news on the new Politically Georgia podcast from The Atlanta Journal-Constitution. The podcast is hosted by Georgia’s best political team with Greg Bluestein, Patricia Murphy and Tia Mitchell from Washington. Our journalists provide in-depth reporting and analysis from the nation’s political battleground state. Call in with your questions on the Politically Georgia Podcast Hotline at (770)-810-5297, and our hosts will answer them on future episodes. Learn more on the AJC Politically Georgia Podcast page.\nTrailer\nAbout\nGet real, fact-based news on the new Politically Georgia podcast from The Atlanta Journal-Constitution. The podcast is hosted by Georgia’s best political team with Greg Bluestein, Patricia Murphy and Tia Mitchell from Washington. Our journalists provide in-depth reporting and analysis from the nation’s political battleground state.\nCall in with your questions on the Politically Georgia Podcast Hotline at (770)-810-5297, and our hosts will answer them on future episodes. Learn more on the AJC Politically Georgia Podcast page.\nInformation\n- Channel\n- CreatorThe Atlanta Journal-Constitution\n- Years Active2018 - 2025\n- Episodes869\n- RatingClean\n- Copyright© 2021 The Atlanta Journal-Constitution. All Rights Reserved.\n- Show Website"
    }
  ],
  "argos_summary": "In a special election for Georgia State Senate District 21, Democrat Debra Shigley topped a seven‑candidate field with about 40% of the vote, a surprising result in a district that has historically favored Republicans and President Trump. Shigley’s lead has prompted GOP leaders to launch a vigorous turnout effort for the September 23 runoff against Republican Jason Dickerson, while Democrats view the win as a potential boost heading into the midterms. The election saw low turnout—just 14% of registered voters—yet outperformed earlier statewide primaries, underscoring the importance of mobilization in special contests. Other stories in the article touch on Medicaid cuts under the Trump administration, a hearing on eldercare support, a judge’s emergency ruling over election board appointments, and the controversy over Cracker Barrel’s logo change.",
  "argos_id": "VQIV999I0"
}