{
  "url": "https://www.morningstar.com/news/marketwatch/20250827204/medicare-advantage-brokers-could-now-focus-more-on-making-money-and-on-commercials-than-on-your-healthcare",
  "authorsByline": "",
  "articleId": "8cf402f5f5cc472080bb82e002774ebd",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T14:20:00-05:00",
  "addDate": "2025-08-27T19:53:58.241115+00:00",
  "refreshDate": "2025-08-27T19:53:58.241116+00:00",
  "score": 1.0,
  "title": "Medicare Advantage brokers could now focus more on making money and on commercials than on your healthcare",
  "description": "",
  "content": "The court said an attempt to curtail payments for brokers was an overreach by the Centers for Medicare & Medicaid Services\n\nIn 2024, 32.8 million people were enrolled in a Medicare Advantage plan, accounting for 54% of the eligible Medicare population, according to KFF.\n\nYour Medicare Advantage broker may be more focused on making money than on your best interest as a result of a recent ruling by a Texas judge allowing Medicare Advantage brokers to reap payments that might otherwise be spent on healthcare services.\n\nChief Judge Reed O'Connor of U.S. District Court for the Northern District of Texas ruled that the Centers for Medicare & Medicaid Services exceeded its statutory authority and was \"arbitrary [and] capricious\" in trying to cap administrative payments and prohibit certain incentive contracts between Medicare Advantage plans and third-party marketing organizations. Medicare Advantage is the private health-insurance version of traditional Medicare, which is run by the federal government.\n\nThe CMS rule, which was issued in April 2024 but never implemented, had sought to classify administrative payments to agents and brokers as compensation and cap them at a fixed fee of $100, rather than allowing them to be paid at fair market value.\n\nTwo industry trade groups - Americans for Beneficiary Choice and the Council for Medicare Choice - filed lawsuits against the Department of Health and Human Services and CMS challenging the new rules.\n\nO'Connor ruled that the CMS rules were an overreach of the agency's authority under the Administrative Procedure Act.\n\n\"CMS may only regulate how compensation is used, not engage in ratemaking,\" the judge wrote in his ruling.\n\nThe price cap paid to agents and brokers for new Medicare Advantage enrollees was $611 in 2024. Medicare Advantage companies can also reimburse third-party firms for administrative services - which is what CMS was trying to cap.\n\n\"The amount that plans are willing to pay brokers is an indicator of the major role brokers play,\" said Matthew Fiedler, a senior fellow in economic studies at the Center on Health Policy at the Brookings Institution. \"Rolling it back could have mattered quite a bit. We would see a pretty big change in the market. We'd see fewer commercials. If plans aren't spending money on broker fees, they could be spending that money on healthcare services.\"\n\nRead: Medicare Advantage's 'secretive maze' of costly marketing and incentives needs an overhaul, Senate report says\n\nIn 2024, 32.8 million people were enrolled in a Medicare Advantage plan, accounting for 54% of the eligible Medicare population, according to KFF. Medicare Advantage has been generally lucrative for the companies that provide it, but it costs the government more than traditional Medicare. Medicare Advantage costs the government and taxpayers an extra 22% per enrollee, or approximately an additional $83 billion a year, according to the Medicare Payment Advisory Commission.\n\nCMS declined to comment on the litigation. The agency has until Oct. 17 to file an appeal.\n\n\"These Biden-era reforms were well intentioned but hastily drafted and did not address the more important underlying issue - that brokers are not currently required to take a fiduciary approach that prioritizes consumers' needs over brokers' financial incentives,\" said Cobi Blumenfeld-Gantz, chief executive and co-founder of Chapter, a Medicare adviser that helps match consumers with healthcare plans.\n\n\"Brokers should be required to be fiduciaries for consumers and search all types of Medicare plans when making coverage recommendations,\" Blumenfeld-Ganz said.\n\nThe judge, however, did uphold a provision that prevents third-party marketing firms from distributing personal beneficiary data such as names, addresses and phone numbers to other marketing organizations without consent.\n\n\"This is critical to protect consumers from unwanted Medicare spam,\" Blumenfeld-Gantz said.\n\nThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Medicare Advantage brokers",
      "weight": 0.12869956
    },
    {
      "name": "Medicare Advantage plans",
      "weight": 0.12211921
    },
    {
      "name": "Medicare Advantage",
      "weight": 0.12095834
    },
    {
      "name": "Medicare Advantage companies",
      "weight": 0.11508323
    },
    {
      "name": "Medicare plans",
      "weight": 0.11204745
    },
    {
      "name": "new Medicare Advantage enrollees",
      "weight": 0.109325275
    },
    {
      "name": "Medicare Choice",
      "weight": 0.103580154
    },
    {
      "name": "Medicare",
      "weight": 0.10343892
    },
    {
      "name": "traditional Medicare",
      "weight": 0.10293423
    },
    {
      "name": "unwanted Medicare spam",
      "weight": 0.09617537
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Insurance/Health Insurance",
      "score": 0.86767578125
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.84619140625
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.459716796875
    }
  ],
  "sentiment": {
    "positive": 0.054480456,
    "negative": 0.686115,
    "neutral": 0.2594046
  },
  "summary": "A Texas judge has ruled that the Centers for Medicare & Medicaid Services (CMS) exceeded its statutory authority by attempting to cap administrative payments to brokers and prohibit certain incentive contracts between Medicare Advantage plans and third-party marketing organizations. The ruling allows Medicare Advantage brokers to reap payments that might otherwise be used for healthcare services. The price cap for new Medicare Advantage enrollees was $611 in 2024. Two industry trade groups - Americans for Beneficiary Choice and the Council for Medicare Choice - filed lawsuits against the Department of Health and Human Services and CMS challenging the new rules. The judge upheld a provision that prevents third-partied marketing firms from distributing personal beneficiary data to other marketing organizations without consent.",
  "shortSummary": "A Texas judge ruled that CMS overreached in its power to limit brokers' payments, allowing brokers to focus on profits over healthcare services.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0c5a15a4504e4849be669b870907af81",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A Texas federal judge ruled that the Centers for Medicare & Medicaid Services exceeded its authority by attempting to cap administrative payments to Medicare Advantage brokers, deeming the rule arbitrary and capricious. The judge upheld a provision that protects consumer data from being shared without consent but left the broker payment structure intact, noting that brokers play a major role in the market. The decision follows lawsuits from industry groups and comes amid concerns that broker incentives may prioritize profit over patient care, with calls for fiduciary standards. Medicare Advantage remains a significant portion of Medicare enrollment, costing the government substantially more per enrollee than traditional Medicare.",
  "argos_id": "XJM062RTM"
}