{
  "url": "https://finance.yahoo.com/news/c-o-r-r-e-192800567.html",
  "authorsByline": "PR Newswire",
  "articleId": "b0ab5cc0e61e4b0f9d7bfc9d75189255",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/9420e11e72682869d7051b5e83f664ba",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T19:28:00+00:00",
  "addDate": "2025-08-27T19:41:52.440243+00:00",
  "refreshDate": "2025-08-27T19:41:52.440245+00:00",
  "score": 1.0,
  "title": "/C O R R E C T I O N -- The Galien Foundation/",
  "description": "The Galien Foundation, the premier global institution dedicated to honoring innovators in life sciences, today announced the 2025 Prix Galien USA Award nominees for \"Best Digital Health Solution,\" \"Best Medical Technology,\" \"Incubators, Accelerators and Equity,\" and \"Best Startup.\" Winners will be announced during the Prix Galien USA Awards Ceremony on October 30, 2025, at the American Museum of Natural History in New York City.",
  "content": "In the news release, The Galien Foundation Announces 2025 Prix Galien USA Nominees for \"Best Digital Health Solution,\" \"Best Medical Technology,\" \"Incubators, Accelerators and Equity,\" and \"Best Startup\", issued 13-Aug-2025 by The Galien Foundation over PR Newswire, we are advised by the company that a final sentence has been added with a link to the 3rd paragraph. Company name change to \"Future Doctor Inc\" to \"Future Doctor Limited\" and \"Otsuka Precision Health\" to \"Otsuka Precision Health, Inc.\" and a registar mark to \"Rejoyn\". Dr. Mikael Dolsten title change to inlcude \"Former\". The complete, corrected release follows:\n\nThe Galien Foundation Announces 2025 Prix Galien USA Nominees for \"Best Digital Health Solution,\" \"Best Medical Technology,\" \"Incubators, Accelerators and Equity,\" and \"Best Startup\"\n\nNEW YORK, Aug. 13, 2025 /PRNewswire/ -- The Galien Foundation, the premier global institution dedicated to honoring innovators in life sciences, today announced the 2025 Prix Galien USA Award nominees for \"Best Digital Health Solution,\" \"Best Medical Technology,\" \"Incubators, Accelerators and Equity,\" and \"Best Startup.\" Winners will be announced during the Prix Galien USA Awards Ceremony on October 30, 2025, at the American Museum of Natural History in New York City.\n\n\"As Jury Chair, I am honored to recognize these exceptional nominees who exemplify the transformative power of innovation in medical technology, digital health, and entrepreneurship,\" said Kenneth C. Frazier, Chair of the Jury, Prix Galien USA Awards Committee. \"Their groundbreaking work represents the future of healthcare and our shared commitment to improving lives through scientific excellence.\"\n\nThe 2025 Prix Galien USA nominees include products from the following categories: \"Best Digital Health Solution\" – 25 nominees; \"Best Medical Technology\" – 25 nominees; \"Best Incubators, Accelerators and Equity\" - 12 nominees, and \"Best Startup\" - 53 nominees. To explore this year's nominees in all award categories, please click here.\n\nTo qualify, each candidate must be U.S. Food and Drug Administration (FDA) approved for marketing within the last five years and demonstrate tremendous potential to improve human health. Sales data are not considered by the nominating committee in their award nominee selection, only science and health impact.",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/2749810/5458539/The_Galien_Foundation__logo.html",
    "https://c212.net/c/link/?t=0&l=en&o=4487695-1&h=1410070105&u=https%3A%2F%2Finfogram.com%2F1tv9rkoepo2v7paz99gv0ezvdpi21py90yv&a=click+here"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Prix Galien USA",
      "weight": 0.114801936
    },
    {
      "name": "Prix Galien USA Award",
      "weight": 0.1092392
    },
    {
      "name": "Prix Galien USA Awards Committee",
      "weight": 0.106020994
    },
    {
      "name": "Best Digital Health Solution",
      "weight": 0.09506894
    },
    {
      "name": "Best Medical Technology",
      "weight": 0.088171594
    },
    {
      "name": "2025 Prix Galien USA Nominees",
      "weight": 0.08002554
    },
    {
      "name": "Best Startup",
      "weight": 0.07824522
    },
    {
      "name": "/C O R R E C T I O N",
      "weight": 0.076353125
    },
    {
      "name": "Otsuka Precision Health",
      "weight": 0.07515057
    },
    {
      "name": "the Prix Galien USA Awards Ceremony",
      "weight": 0.07287119
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.984375
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.69189453125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.384765625
    },
    {
      "name": "/Health/Medical Facilities & Services/Hospitals & Treatment Centers",
      "score": 0.373291015625
    },
    {
      "name": "/News/Health News",
      "score": 0.327880859375
    }
  ],
  "sentiment": {
    "positive": 0.4846365,
    "negative": 0.06363258,
    "neutral": 0.45173088
  },
  "summary": "The Galien Foundation has announced its 2025 Prix Galien USA Award nominees for \"Best Digital Health Solution,\" \"Best Medical Technology,\" \"Incubators, Accelerators and Equity,\" and \"Best Startup\". The winners will be announced at the Prix Galienne USA Awards Ceremony on October 30, 2025. The nominees must be U.S. Food and Drug Administration approved for marketing within the last five years and demonstrate significant potential to improve human health.",
  "shortSummary": "The Galien Foundation announced 2025 Prix Galien USA Award nominees for Best Digital Health Solution, Best Medical Technology, and Best Startup, with winners announced on October 30.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d706bd376e2248b0b94fadd2d0add87d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Galien Foundation announced the 2025 Prix Galien USA nominees for Best Digital Health Solution, Best Medical Technology, Incubators, Accelerators and Equity, and Best Startup, with winners to be announced on Oct. 30, 2025 at the American Museum of Natural History. The nomination list features 25 entries each for Digital Health and Medical Technology, 12 for Incubators, Accelerators and Equity, and 53 for Startup, and all candidates must be FDA‑approved within the past five years, with no sales data considered. The release also notes corrections to company names and a new link to the nominees’ page.",
  "argos_id": "ZEYNCNU49"
}