{
  "url": "https://www.ibtimes.com/gunman-still-large-after-australian-police-killings-3781829",
  "authorsByline": "AFP News",
  "articleId": "977ba091e4594796b36cb09268a26285",
  "source": {
    "domain": "ibtimes.com",
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://d.ibtimes.com/en/full/4618262/gunman-accused-killing-two-policemen-fled-densely-forested-austalian-bushland.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T02:06:20-04:00",
  "addDate": "2025-08-28T06:30:18.455229+00:00",
  "refreshDate": "2025-08-28T06:30:18.455231+00:00",
  "score": 1.0,
  "title": "Gunman Still At Large After Australian Police Killings",
  "description": "Australian police said Thursday they will not rest until they catch a 56-year-old gunman who fled into the bush two days earlier after allegedly killing two officers.",
  "content": "Australian police said Thursday they will not rest until they catch a 56-year-old gunman who fled into the bush two days earlier after allegedly killing two officers.\n\nDetectives said they were speaking to the man's partner and searching rugged, forested terrain near the small town of Porepunkah, in the northeast of Victoria state.\n\nThe suspect, identified by police as Dezi Freeman, escaped on foot after opening fire when a team of 10 police arrived at his property on Tuesday, allegedly killing two policemen and wounding a third.\n\nPolice say the man -- described by local media as a radicalised conspiracy theorist -- is heavily armed, has bush survival skills and knows the area well.\n\n\"We will not rest until we apprehend the offender,\" said Russell Barrett, Victoria police deputy commissioner for regional operations.\n\nPolice were in contact with the man's partner, had searched a number of properties, and believed he was still in the area, Barrett said.\n\nBut \"we've had no confirmed sightings\", he told a news conference.\n\nAnyone harbouring the man would be prosecuted for committing a criminal offence, Barrett warned.\n\nPolice said they were moving carefully through the bush, and warned people not to travel into the surrounding alpine area to go skiing.\n\n\"It is really difficult terrain. It is complex terrain,\" Victoria police superintendent Brett Kahan said.\n\nPolice say the shooting happened in a matter of minutes when they descended on the man's property on Tuesday morning to execute a search warrant.\n\nPolice fired at the suspect but apparently did not wound him, they said.\n\nThe shootout resulted in the deaths of 59-year-old detective Neal Thompson and 35-year-old senior constable Vadim De Waart.\n\nPolice say the wounded officer has undergone surgery and is expected to recover.\n\nAustralia's The Age newspaper said Freeman was a self-professed \"sovereign citizen\", referring to a movement that falsely believes it is not subject to laws passed by the government.\n\nPolice have not commented on those reports.\n\nWhile fighting a speeding penalty in a Melbourne court, Freeman referred to police as \"frigging Nazis\", \"Gestapo\", and \"terrorist thugs\", according to a copy of the judge's ruling last year.\n\nDeadly shootings are relatively rare in Australia, and police fatalities even rarer.\n\nThe latest deaths listed in a national memorial to fallen police showed three officers were killed on duty in separate incidents in 2023, including one by gunshot.\n\nIn December 2022, four police arrived at a tree-lined property near small Queensland town of Wieambilla and came under fire from the family living there.\n\nSix people were killed in that incident, including two police officers. Police later blamed the family's fundamentalist Christian beliefs for what was termed a terrorist attack.\n\nA ban on automatic and semi-automatic weapons has been in place in Australia since a 1996 mass shooting in Port Arthur, Tasmania, in which a lone gunman killed 35 people.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Victoria police deputy commissioner",
      "weight": 0.08998524
    },
    {
      "name": "Australian police",
      "weight": 0.08983359
    },
    {
      "name": "fallen police",
      "weight": 0.08928832
    },
    {
      "name": "police",
      "weight": 0.08843219
    },
    {
      "name": "police fatalities",
      "weight": 0.0868654
    },
    {
      "name": "Victoria police superintendent Brett Kahan",
      "weight": 0.08565277
    },
    {
      "name": "Australian Police Killings",
      "weight": 0.07105806
    },
    {
      "name": "Police",
      "weight": 0.06933973
    },
    {
      "name": "small Queensland town",
      "weight": 0.062152386
    },
    {
      "name": "last year",
      "weight": 0.061239973
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.98193359375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.97314453125
    },
    {
      "name": "/News/Other",
      "score": 0.96533203125
    },
    {
      "name": "/News/Local News",
      "score": 0.96533203125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.888671875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.73046875
    }
  ],
  "sentiment": {
    "positive": 0.049749095,
    "negative": 0.7228934,
    "neutral": 0.22735749
  },
  "summary": "Australian police have identified Dezi Freeman, a 56-year-old radicalised conspiracy theorist, as the suspected gunman who allegedly killed two police officers and wounded a third. The suspect fled into the bush after opening fire when a team of 10 police arrived at his property in Victoria state. Police are currently searching rugged terrain near Porepunkah, where they believe Freeman is heavily armed and has bush survival skills. The wounded officer is expected to recover. Police have warned that anyone harbouring the man will be prosecuted for committing a criminal offence.",
  "shortSummary": "Australian police are hunting for a 56-year-old gunman who killed two policemen in a shootout in Porepunkah, near Melbourne.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c173fc5312c144f396664aca980f8bf3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Australian police are actively searching for 56‑year‑old Dezi Freeman, who fled into the bush after allegedly killing two officers and wounding a third during a shootout at his property near Porepunkah. Freeman, described as a radicalised conspiracy theorist and self‑proclaimed sovereign citizen, is heavily armed and familiar with the terrain. Police have spoken to his partner, searched multiple properties, and warned that anyone harbouring him will be prosecuted. The incident, one of the rare deadly shootings involving police in Australia, has drawn comparisons to past attacks and highlighted the country’s strict gun laws.",
  "argos_id": "1GH4DEVJ3"
}