{
  "url": "https://finance.yahoo.com/news/aegons-ams-agn-five-earnings-105200630.html?.tsrc=rss",
  "authorsByline": "Simply Wall St",
  "articleId": "289a110423d941a1a267eb04d15145fd",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/simply_wall_st__316/f99e03d6864d27459bdfbebc0a8e18a3",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T10:52:00+00:00",
  "addDate": "2025-08-28T11:43:08.500731+00:00",
  "refreshDate": "2025-08-28T11:43:08.500733+00:00",
  "score": 1.0,
  "title": "Aegon's (AMS:AGN) five-year earnings growth trails the stellar shareholder returns",
  "description": "The most you can lose on any stock (assuming you don't use leverage) is 100% of your money. But on the bright side, you...",
  "content": "The most you can lose on any stock (assuming you don't use leverage) is 100% of your money. But on the bright side, you can make far more than 100% on a really good stock. For example, the Aegon Ltd. (AMS:AGN) share price has soared 194% in the last half decade. Most would be very happy with that. It's also up 8.9% in about a month. This could be related to the recent financial results that were recently released - you could check the most recent data by reading our company report.\n\nOn the back of a solid 7-day performance, let's check what role the company's fundamentals have played in driving long term shareholder returns.\n\nTrump has pledged to \"unleash\" American oil and gas and these 15 US stocks have developments that are poised to benefit.\n\nWhile the efficient markets hypothesis continues to be taught by some, it has been proven that markets are over-reactive dynamic systems, and investors are not always rational. By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\n\nDuring the five years of share price growth, Aegon moved from a loss to profitability. That kind of transition can be an inflection point that justifies a strong share price gain, just as we have seen here.\n\nYou can see how EPS has changed over time in the image below (click on the chart to see the exact values).\n\nWe know that Aegon has improved its bottom line over the last three years, but what does the future have in store? If you are thinking of buying or selling Aegon stock, you should check out this FREE detailed report on its balance sheet.\n\nWhen looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return. The TSR is a return calculation that accounts for the value of cash dividends (assuming that any dividend received was reinvested) and the calculated value of any discounted capital raisings and spin-offs. It's fair to say that the TSR gives a more complete picture for stocks that pay a dividend. In the case of Aegon, it has a TSR of 269% for the last 5 years. That exceeds its share price return that we previously mentioned. The dividends paid by the company have thusly boosted the total shareholder return.\n\nIt's nice to see that Aegon shareholders have received a total shareholder return of 30% over the last year. Of course, that includes the dividend. However, that falls short of the 30% TSR per annum it has made for shareholders, each year, over five years. I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too. Consider for instance, the ever-present spectre of investment risk. We've identified 1 warning sign with Aegon , and understanding them should be part of your investment process.",
  "medium": "Article",
  "links": [
    "https://simplywall.st/company/id/A4BAC98A-89AC-4670-84B9-FE4F9F81A7A6/past?blueprint=4022300&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
    "https://simplywall.st/company/id/A4BAC98A-89AC-4670-84B9-FE4F9F81A7A6/health?blueprint=4022300&utm_medium=finance_user&utm_campaign=integrated-pitch&utm_source=yahoo",
    "https://au.finance.yahoo.com/quote/AGN.AS",
    "https://simplywall.st/company/id/A4BAC98A-89AC-4670-84B9-FE4F9F81A7A6?blueprint=4022300&utm_medium=finance_user&utm_campaign=integrated-pitch&utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/434423/us-midstream-oil-and-gas-pipeline-operators/global?blueprint=4022300&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=us-oil-gas-pipeline-operators"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "share price return",
      "weight": 0.11374326
    },
    {
      "name": "Aegon shareholders",
      "weight": 0.102470234
    },
    {
      "name": "share price",
      "weight": 0.10197045
    },
    {
      "name": "share price growth",
      "weight": 0.10143634
    },
    {
      "name": "Aegon stock",
      "weight": 0.101155475
    },
    {
      "name": "total shareholder return",
      "weight": 0.09854088
    },
    {
      "name": "share price changes",
      "weight": 0.09822103
    },
    {
      "name": "long term shareholder returns",
      "weight": 0.0971828
    },
    {
      "name": "investment returns",
      "weight": 0.084641874
    },
    {
      "name": "Aegon Ltd.",
      "weight": 0.08302485
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97802734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.97509765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96142578125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.67333984375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.30859375
    }
  ],
  "sentiment": {
    "positive": 0.4944308,
    "negative": 0.10123754,
    "neutral": 0.40433156
  },
  "summary": "Aegon Ltd. (AMS:AGN) share price has risen by 194% in the last half decade and its shares have risen by 8.9% in about a month. However, the company's five-year earnings growth has lagged behind the stellar shareholder returns. This is due to the recent financial results and the shift from a loss to profitability can be seen as an inflection point that justifies a strong share price gain. The difference between total shareholder return (TSR) and share price return is important to consider as a comprehensive assessment of the long-term investment returns made for stocks that pay a dividend. The dividends paid by the company have boosted the total shareholder returns, contributing to a 30% total return over the last year.",
  "shortSummary": "Aegon's five-year earnings growth lags behind shareholder returns, with strong dividends and potential for future growth despite improved financial performance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9a443da293a74d65ab6e596832c9f219",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://simplywall.st/discover/investing-ideas/434423/us-midstream-oil-and-gas-pipeline-operators/global?blueprint=4022300&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=us-oil-gas-pipeline-operators",
      "text": "Results\n22\nMidstream oil and gas companies, specifically pipeline operators, are well-positioned to benefit from Trump’s executive orders on fossil fuels enacted in early 2025. – – These policies aim to accelerate infrastructure development by streamlining environmental reviews and permitting processes, such as those under the National Environmental Policy Act (NEPA). The declaration of a \"national energy emergency\" further empowers these companies by prioritizing pipeline and storage projects to support increased production from newly accessible federal lands and waters. – – The push to \"unleash American energy\" also amplifies demand for midstream services as upstream production ramps up, particularly in regions like Alaska and offshore areas reopened for drilling. Pipelines and storage facilities will be critical to moving larger volumes of oil and gas efficiently, especially with the renewed emphasis on LNG exports to meet global demand.\n22 companies\nChevron\nMarket Cap: US$319.3b\nThrough its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally.\nCVX\nUS$159.24\n7D\n3.9%\n1Y\n9.1%\nWilliams Companies\nMarket Cap: US$69.8b\nOperates as an energy infrastructure company primarily in the United States.\nWMB\nUS$57.49\n7D\n0.5%\n1Y\n28.0%\nKinder Morgan\nMarket Cap: US$59.6b\nOperates as an energy infrastructure company primarily in North America.\nKMI\nUS$26.83\n7D\n0.04%\n1Y\n25.3%\nMarathon Petroleum\nMarket Cap: US$54.1b\nOperates as an integrated downstream energy company in the United States.\nMPC\nUS$177.89\n7D\n7.9%\n1Y\n4.0%\nCheniere Energy\nMarket Cap: US$53.1b\nAn energy infrastructure company, primarily engages in the liquefied natural gas (LNG) related businesses in the United States.\nLNG\nUS$241.60\n7D\n0.4%\n1Y\n31.4%\nONEOK\nMarket Cap: US$47.3b\nOperates as a midstream service provider of gathering, processing, fractionation, transportation, storage, and marine export services in the United States.\nOKE\nUS$75.08\n7D\n1.4%\n1Y\n-16.7%\nDT Midstream\nMarket Cap: US$10.4b\nProvides integrated natural gas services in the United States.\nDTM\nUS$101.81\n7D\n-0.7%\n1Y\n33.1%\nHess Midstream\nMarket Cap: US$8.7b\nOwns, operates, develops, and acquires midstream assets and provide fee-based services to Hess and third-party customers in the United States.\nHESM\nUS$41.42\n7D\n0.2%\n1Y\n13.3%\nAntero Midstream\nMarket Cap: US$8.5b\nOwns, operates, and develops midstream energy assets in the Appalachian Basin.\nAM\nUS$17.71\n7D\n1.3%\n1Y\n21.5%\nKinetik Holdings\nMarket Cap: US$6.8b\nThrough its subsidiaries, operates as a midstream company in the Texas Delaware Basin.\nKNTK\nUS$41.89\n7D\n5.2%\n1Y\n-6.1%\nPBF Energy\nMarket Cap: US$3.1b\nThrough its subsidiaries, engages in refining and supplying petroleum products.\nPBF\nUS$26.36\n7D\n18.8%\n1Y\n-21.0%\nRattler Midstream\nMarket Cap: US$2.2b\nRattler Midstream LP owns, operates, develops, and acquires midstream and energy-related infrastructure assets in the Midland and Delaware Basins of the Permian Basin.\nRTLR\nUS$15.22\n7D\n3.5%\n1Y\n45.0%\nPar Pacific Holdings\nMarket Cap: US$1.7b\nOperates as an energy company in the United States.\nPARR\nUS$34.17\n7D\n13.4%\n1Y\n55.0%\nDelek US Holdings\nMarket Cap: US$1.5b\nEngages in the integrated downstream energy business in the United States.\nDK\nUS$27.02\n7D\n9.0%\n1Y\n37.2%\nClean Energy Fuels\nMarket Cap: US$578.9m\nOffers natural gas as alternative fuels for vehicle fleets and related fueling solutions in the United States and Canada.\nCLNE\nUS$2.64\n7D\n10.0%\n1Y\n-15.7%\nOPAL Fuels\nMarket Cap: US$410.9m\nEngages in the production and distribution of renewable natural gas (RNG) for use as a vehicle fuel for heavy and medium-duty trucking fleets throughout the United States.\nOPAL\nUS$2.31\n7D\n0.9%\n1Y\n-35.1%\nSummit Midstream\nMarket Cap: US$254.0m\nFocuses on owning, developing, and operating midstream energy infrastructure assets primarily shale formations in the continental United States.\nSMC\nUS$20.51\n7D\n6.3%\n1Y\n-43.7%\nGranite Falls Energy\nMarket Cap: US$91.1m\nEngages in the production and sale of ethanol and its co-products in the continental United States.\nGFGY\nUS$2,975.00\n7D\n0%\n1Y\nn/a\nStabilis Solutions\nMarket Cap: US$77.7m\nAn energy transition company, provides turnkey clean energy production, storage, transportation, and fueling solutions primarily using liquefied natural gas (LNG) to various end markets in North America.\nSLNG\nUS$4.07\n7D\n-3.3%\n1Y\n1.2%\nVivakor\nMarket Cap: US$35.3m\nOperates, acquires, and develops technologies and assets in the oil and gas industry in the United States and Kuwait.\nVIVK\nUS$0.70\n7D\n-16.9%\n1Y\n-64.4%\nMirage Energy\nMarket Cap: US$789.2k\nThrough its subsidiaries, focuses on developing an integrated pipeline and natural gas storage facility in Mexico and the United States.\nMRGE\nUS$0.0015\n7D\n-40.0%\n1Y\n-79.2%\nEnergtek\nMarket Cap: US$51.4k\nProvides natural gas delivery solutions based on mobile pipe-less technologies and products.\nEGTK\nUS$0.0001\n7D\n0%\n1Y\nn/a"
    },
    {
      "url": "https://simplywall.st/company/id/A4BAC98A-89AC-4670-84B9-FE4F9F81A7A6/health?blueprint=4022300&utm_medium=finance_user&utm_campaign=integrated-pitch&utm_source=yahoo",
      "text": "Aegon Balance Sheet Health\nFinancial Health criteria checks 3/6\nAegon has a total shareholder equity of €9.4B and total debt of €4.3B, which brings its debt-to-equity ratio to 45.5%. Its total assets and total liabilities are €310.6B and €301.2B respectively. Aegon's EBIT is €1.1B making its interest coverage ratio 3.2. It has cash and short-term investments of €3.2B.\nKey information\n45.46%\nDebt to equity ratio\n€4.27b\nDebt\n| Interest coverage ratio | 3.2x |\n| Cash | €3.20b |\n| Equity | €9.39b |\n| Total liabilities | €301.25b |\n| Total assets | €310.64b |\nRecent financial health updates\nNo updates\nRecent updates\nFinancial Position Analysis\nShort Term Liabilities: AGN's short term assets (€18.2B) exceed its short term liabilities (€203.0M).\nLong Term Liabilities: AGN's short term assets (€18.2B) do not cover its long term liabilities (€301.0B).\nDebt to Equity History and Analysis\nDebt Level: AGN's net debt to equity ratio (11.4%) is considered satisfactory.\nReducing Debt: AGN's debt to equity ratio has increased from 43.8% to 45.5% over the past 5 years.\nDebt Coverage: AGN's operating cash flow is negative, therefore debt is not well covered.\nInterest Coverage: AGN's interest payments on its debt are well covered by EBIT (3.2x coverage).\nBalance Sheet\nDiscover healthy companies\nCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/27 08:16 |\n| End of Day Share Price | 2025/08/27 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nAegon Ltd. is covered by 46 analysts. 7 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Cor Kluis | ABN AMRO Bank N.V. |\n| Maria del Paz Ojeda Fernandez | Ahorro Corporación |\n| Claudia Gaspari | Barclays |"
    },
    {
      "url": "https://simplywall.st/company/id/A4BAC98A-89AC-4670-84B9-FE4F9F81A7A6?blueprint=4022300&utm_medium=finance_user&utm_campaign=integrated-pitch&utm_source=yahoo",
      "text": "Aegon (AGN) Stock Overview\nProvides insurance, pensions, retirement, and asset management services in the Americas, the Netherlands, the United Kingdom, and internationally. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 5/6 |\n| Future Growth | 1/6 |\n| Past Performance | 3/6 |\n| Financial Health | 3/6 |\n| Dividends | 4/6 |\nAGN Community Fair Values\nSee what 36 others think this stock is worth. Follow their fair value or set your own to get alerts.\nAegon Ltd. Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | €6.77 |\n| 52 Week High | €6.99 |\n| 52 Week Low | €4.79 |\n| Beta | 0.90 |\n| 1 Month Change | 8.88% |\n| 3 Month Change | 8.15% |\n| 1 Year Change | 22.03% |\n| 3 Year Change | 51.52% |\n| 5 Year Change | 194.48% |\n| Change since IPO | -2.89% |\nRecent News & Updates\nRecent updates\nShareholder Returns\n| AGN | NL Insurance | NL Market | |\n|---|---|---|---|\n| 7D | 5.2% | -2.8% | 0.1% |\n| 1Y | 22.0% | 26.9% | -0.6% |\nReturn vs Industry: AGN underperformed the Dutch Insurance industry which returned 28.3% over the past year.\nReturn vs Market: AGN exceeded the Dutch Market which returned -0% over the past year.\nPrice Volatility\n| AGN volatility | |\n|---|---|\n| AGN Average Weekly Movement | 3.6% |\n| Insurance Industry Average Movement | 2.8% |\n| Market Average Movement | 4.1% |\n| 10% most volatile stocks in NL Market | 7.5% |\n| 10% least volatile stocks in NL Market | 2.2% |\nStable Share Price: AGN has not had significant price volatility in the past 3 months compared to the Dutch market.\nVolatility Over Time: AGN's weekly volatility (4%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 1844 | 15,500 | E. Friese | www.aegon.com |\nAegon Ltd. provides insurance, pensions, retirement, and asset management services in the Americas, the Netherlands, the United Kingdom, and internationally. It offers life, accident, property and casualty, and health insurance; annuities, retirement plans, mutual funds, and stable value solutions; commercial and residential mortgage loans; digital saving services; retail and institutional investment management solutions; and investment vehicles. The company provides its products under the Transamerica and World Financial Group brands.\nAegon Ltd. Fundamentals Summary\n| AGN fundamental statistics | |\n|---|---|\n| Market cap | €10.61b |\n| Earnings (TTM) | €1.27b |\n| Revenue (TTM) | €13.07b |\nIs AGN overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| AGN income statement (TTM) | |\n|---|---|\n| Revenue | €13.07b |\n| Cost of Revenue | €7.01b |\n| Gross Profit | €6.05b |\n| Other Expenses | €4.79b |\n| Earnings | €1.27b |\nLast Reported Earnings\nJun 30, 2025\nNext Earnings Date\nNov 22, 2025\n| Earnings per share (EPS) | 0.81 |\n| Gross Margin | 46.33% |\n| Net Profit Margin | 9.70% |\n| Debt/Equity Ratio | 45.5% |\nHow did AGN perform over the long term?\nSee historical performance and comparisonDividends\nDoes AGN pay a reliable dividends?\nSee AGN dividend history and benchmarks| Aegon dividend dates | |\n|---|---|\n| Ex Dividend Date | Sep 03 2025 |\n| Dividend Pay Date | Sep 25 2025 |\n| Days until Ex dividend | 6 days |\n| Days until Dividend pay date | 28 days |\nDoes AGN pay a reliable dividends?\nSee AGN dividend history and benchmarksCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/27 08:16 |\n| End of Day Share Price | 2025/08/27 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nAegon Ltd. is covered by 46 analysts. 7 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Cor Kluis | ABN AMRO Bank N.V. |\n| Maria del Paz Ojeda Fernandez | Ahorro Corporación |\n| Claudia Gaspari | Barclays |"
    },
    {
      "url": "https://simplywall.st/company/id/A4BAC98A-89AC-4670-84B9-FE4F9F81A7A6/past?blueprint=4022300&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
      "text": "Aegon Past Earnings Performance\nPast criteria checks 3/6\nAegon has been growing earnings at an average annual rate of 2.9%, while the Insurance industry saw earnings growing at 9.3% annually. Revenues have been declining at an average rate of 34.2% per year. Aegon's return on equity is 14.3%, and it has net margins of 9.7%.\nKey information\n2.90%\nEarnings growth rate\n8.63%\nEPS growth rate\n| Insurance Industry Growth | 7.60% |\n| Revenue growth rate | -34.18% |\n| Return on equity | 14.34% |\n| Net Margin | 9.70% |\n| Next Earnings Update | 22 Nov 2025 |\nRecent past performance updates\nRecent updates\nRevenue & Expenses Breakdown\nHow Aegon makes and spends money. Based on latest reported earnings, on an LTM basis.\nEarnings and Revenue History\n| Date | Revenue | Earnings | G+A Expenses | R&D Expenses |\n|---|---|---|---|---|\n| 30 Jun 25 | 13,066 | 1,267 | 563 | 0 |\n| 31 Mar 25 | 12,953 | 939 | 592 | 0 |\n| 31 Dec 24 | 12,839 | 611 | 620 | 0 |\n| 30 Sep 24 | 12,760 | 227 | 621 | 0 |\n| 30 Jun 24 | 12,706 | -158 | 621 | 0 |\n| 31 Mar 24 | 12,842 | -184 | 613 | 0 |\n| 31 Dec 23 | 12,978 | -210 | 604 | 0 |\n| 30 Sep 23 | 19,995 | 201 | 243 | 0 |\n| 30 Jun 23 | 13,783 | 31 | 624 | 0 |\n| 31 Mar 23 | 14,022 | 56 | 480 | 0 |\n| 31 Dec 22 | 14,287 | 690 | 637 | 0 |\n| 30 Sep 22 | 17,061 | 172 | 2,173 | 0 |\n| 30 Jun 22 | 27,274 | 295 | 2,140 | 0 |\n| 31 Mar 22 | 41,264 | 1,170 | 2,617 | 0 |\n| 31 Dec 21 | 46,504 | 980 | 2,805 | 0 |\n| 30 Sep 21 | 58,320 | 1,369 | 3,539 | 0 |\n| 30 Jun 21 | 64,932 | 1,036 | 3,517 | 0 |\n| 31 Mar 21 | 78,531 | -879 | 3,557 | 0 |\n| 31 Dec 20 | 40,653 | -670 | 2,877 | 0 |\n| 30 Sep 20 | 35,886 | 207 | 2,826 | 0 |\n| 30 Jun 20 | 34,302 | 1,069 | 3,646 | 0 |\n| 31 Mar 20 | 23,234 | 2,282 | 3,668 | 0 |\n| 31 Dec 19 | 64,775 | 1,436 | 3,686 | 0 |\n| 30 Sep 19 | 52,726 | 779 | 3,627 | 0 |\n| 30 Jun 19 | 40,950 | 419 | 3,567 | 0 |\n| 31 Mar 19 | 29,469 | 508 | 3,553 | 0 |\n| 01 Jan 19 | 18,038 | 593 | 3,538 | 0 |\n| 30 Sep 18 | 30,287 | 1,549 | 4,273 | 0 |\n| 30 Jun 18 | 42,502 | 1,924 | 3,548 | 0 |\n| 31 Mar 18 | 46,895 | 2,210 | 3,593 | 0 |\n| 01 Jan 18 | 53,867 | 2,338 | 3,658 | 0 |\n| 30 Sep 17 | 50,416 | 1,894 | 3,535 | 0 |\n| 30 Jun 17 | 54,981 | 1,742 | 3,564 | 0 |\n| 31 Mar 17 | 54,321 | 539 | 3,554 | 0 |\n| 31 Dec 16 | 49,791 | 304 | 3,560 | 0 |\n| 30 Sep 16 | 54,006 | -812 | 3,569 | 0 |\n| 30 Jun 16 | 37,527 | -1,706 | 3,588 | 0 |\n| 31 Mar 16 | 26,083 | -715 | 3,592 | 0 |\n| 31 Dec 15 | 34,642 | -571 | 3,558 | 0 |\n| 30 Sep 15 | 34,142 | -102 | 3,397 | 0 |\n| 30 Jun 15 | 42,275 | 501 | 3,337 | 0 |\n| 31 Mar 15 | 52,232 | 519 | 3,281 | 0 |\n| 01 Jan 15 | 43,225 | 613 | 3,194 | 0 |\n| 30 Sep 14 | 40,444 | 776 | 3,111 | 0 |\nQuality Earnings: AGN has high quality earnings.\nGrowing Profit Margin: AGN became profitable in the past.\nFree Cash Flow vs Earnings Analysis\nPast Earnings Growth Analysis\nEarnings Trend: AGN's earnings have grown by 2.9% per year over the past 5 years.\nAccelerating Growth: AGN has become profitable in the last year, making the earnings growth rate difficult to compare to its 5-year average.\nEarnings vs Industry: AGN has become profitable in the last year, making it difficult to compare its past year earnings growth to the Insurance industry (11%).\nReturn on Equity\nHigh ROE: AGN's Return on Equity (14.3%) is considered low.\nReturn on Assets\nReturn on Capital Employed\nDiscover strong past performing companies\nCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/27 08:16 |\n| End of Day Share Price | 2025/08/27 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nAegon Ltd. is covered by 46 analysts. 7 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Cor Kluis | ABN AMRO Bank N.V. |\n| Maria del Paz Ojeda Fernandez | Ahorro Corporación |\n| Claudia Gaspari | Barclays |"
    }
  ],
  "argos_summary": "Aegon Ltd. has delivered a 194% share‑price increase over the past five years, with a total shareholder return of 269% that is largely driven by dividends. The company has transitioned from loss to profitability, with earnings growing at about 2.9% annually, but its revenue has declined sharply at roughly 34% per year. Financially, Aegon maintains a debt‑to‑equity ratio of 45.5% and an interest coverage of 3.2x, while its free cash flow remains modest. Despite solid dividend payouts and a strong TSR, the firm’s earnings growth lags the broader insurance industry and its revenue trend signals potential challenges ahead.",
  "argos_id": "8MW3NH9GU"
}