{
  "url": "https://www.foxnews.com/us/kansas-city-police-officer-killed-fleeing-suspect-while-deploying-stop-sticks-end-pursuit",
  "authorsByline": "Elizabeth Pritchett",
  "articleId": "5ce7f6fe032c4c678125eec6d3fff5bd",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/hunter-simoncic-police-photo-and-vehicle.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T03:55:44-04:00",
  "addDate": "2025-08-28T08:05:25.389649+00:00",
  "refreshDate": "2025-08-28T08:05:25.389651+00:00",
  "score": 1.0,
  "title": "Kansas City police officer killed by fleeing suspect while deploying stop sticks to end pursuit",
  "description": "A Kansas City Kansas police officer died on Tuesday after a driver fleeing law enforcement hit him with a truck while he was deploying stop sticks.",
  "content": "Kansas City is mourning the loss of a police officer after he was fatally struck by a driver fleeing law enforcement while attempting to deploy stop sticks.\n\nThe Kansas City Police Department in Kansas identified the slain officer as 26-year-old Hunter Simoncic. The young officer graduated from the department's academy in 2023.\n\nSimoncic was struck early Tuesday morning while deploying stop sticks on State Avenue in an effort to stop a driver who was fleeing law enforcement, according to the Kansas Bureau of Investigation.\n\nDennis Mitchell III, 31, is accused of hitting Simoncic and is charged with capital murder, fleeing or attempting to elude a police officer, criminal possession of a weapon and two counts of theft, according to Wyandotte County District Attorney Mark Dupree on Wednesday.\n\nMAUI OFFICER KILLED IN LINE OF DUTY, POLICE CHIEF CALLS HER ‘THE FINEST OF US’\n\nThe incident began at around 12:30 a.m. Tuesday when Kansas City officers responded to reports of shots fired on Everett Avenue, according to the department.\n\nOfficers arrived at the location at 12:40 a.m. to find an unconscious man, later identified as Mitchell, in the driver's seat of a truck. He woke up when they approached him and fled the scene, sparking a pursuit.\n\nMitchell abandoned the truck he was driving for another truck and continued fleeing, KBI said.\n\nWhile police continued pursuing Mitchell, Simoncic and another KCKPD officer exited their vehicle to stage stop sticks. When Mitchell got close to that location, he allegedly drove toward Simoncic, hit him with the second truck and drove off.\n\nSimoncic was taken to the University of Kansas Medical Center, where he was pronounced dead.\n\nUTAH POLICE OFFICERS KILLED DURING DOMESTIC DISTURBANCE RESPONSE WERE HUSBANDS, FATHERS: 'DEFINITELY HEROES'\n\nAfter allegedly hitting the officer, Mitchell wrecked at around 12:55 a.m. on Kaw Drive. He was taken into custody and transported to the same hospital as Simoncic for treatment. He was released not long after and taken to the Wyandotte County Jail.\n\nPolice said they later learned both trucks Mitchell drove Tuesday night had been reported stolen.\n\nThe department said in a Facebook post that Simoncic's death brings a \"profound sense of loss and pain.\"\n\nBefore joining KCKPD, Simoncic worked as a shift supervisor at the Southeast Kansas Regional Juvenile Detention Center, according to the department. He also held a bachelor's degree in sociology and a master's degree in forensic science.\n\nHe was also a volunteer at Benjamin Banneker Elementary School and read to children on a weekly basis through a program known as Lead to Read KC.\n\n\"While he grew up in a small town in southeast Kansas, he chose to serve our community because, in his words, ‘I want to take what I have learned in life to make positive changes in a community I believe truly deserves it.’ Let that sink in,\" the department wrote.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSimoncic's death comes just weeks after Elijah Ming, a deputy in Kansas City, was shot and killed in the line of duty.\n\n\"God speed Hunter. You and Elijah rest easy, we will take it from here,\" KCKPD wrote on Facebook.\n\nHis funeral is scheduled for Wednesday, Sept. 3.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/us/utah-police-officers-killed-during-domestic-disturbance-response-were-husbands-fathers-definitely-heroes",
    "https://foxnews.com/download",
    "https://www.foxnews.com/category/us/crime/robbery-theft",
    "https://www.foxnews.com/video/6376198003112",
    "https://www.foxnews.com/category/crime",
    "https://www.foxnews.com/category/us/us-regions/midwest/kansas",
    "https://www.foxnews.com/us/maui-officer-killed-line-duty-police-chief-calls-her-the-finest-us",
    "https://www.foxnews.com/category/us/crime/police-and-law-enforcement"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kansas City police officer",
      "weight": 0.11432669
    },
    {
      "name": "Kansas City officers",
      "weight": 0.112281285
    },
    {
      "name": "UTAH POLICE OFFICERS",
      "weight": 0.09368692
    },
    {
      "name": "Kansas City",
      "weight": 0.09068842
    },
    {
      "name": "Officers",
      "weight": 0.086931065
    },
    {
      "name": "MAUI OFFICER",
      "weight": 0.084847674
    },
    {
      "name": "Hunter Simoncic",
      "weight": 0.08324254
    },
    {
      "name": "southeast Kansas",
      "weight": 0.08238459
    },
    {
      "name": "Simoncic",
      "weight": 0.08081561
    },
    {
      "name": "Kansas",
      "weight": 0.08043444
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9951171875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.984375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.9677734375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.90380859375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.873046875
    },
    {
      "name": "/News/Other",
      "score": 0.8291015625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.82373046875
    }
  ],
  "sentiment": {
    "positive": 0.055625215,
    "negative": 0.71086895,
    "neutral": 0.2335058
  },
  "summary": "The Kansas City Police Department has identified 26-year-old officer Hunter Simoncic as the officer who was fatally struck by a driver fleeing law enforcement while attempting to deploy stop sticks. The incident occurred early Tuesday morning in Kansas City. Dennis Mitchell III, 31, is charged with capital murder, fleeing or attempting to elude a police officer, criminal possession of a weapon, and theft. Simonic was hit while he was deploying stop sticks on State Avenue in an effort to stop Mitchell who was fleeing law Enforcement. Mitchell allegedly abandoned his truck for another and continued to flee, but eventually wrecked his vehicle and was taken into custody. Prior to the incident, Simoncick worked as a shift supervisor at the Southeast Kansas Regional Juvenile Detention Center and a volunteer at an elementary school. His funeral is scheduled for Wednesday, September 3.",
  "shortSummary": "A 26-year-old police officer was killed by a fleeing suspect while deploying stop sticks in Kansas City, prompting a murder investigation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1aa79ea8fa9040cea714f54e987283d3",
  "places": [
    {
      "osmId": "13415842",
      "road": "State Avenue",
      "suburb": "Kensington",
      "city": "Kansas City",
      "county": "Wyandotte County",
      "state": "Kansas",
      "postcode": "66102",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.1167596,
        "lon": -94.6746355
      }
    },
    {
      "osmId": "13404549",
      "road": "Everett Avenue",
      "suburb": "Westheight",
      "city": "Kansas City",
      "county": "Wyandotte County",
      "state": "Kansas",
      "postcode": "66102",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.1197694,
        "lon": -94.6634807
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/crime",
      "text": "J.B. Pritzker 25 mins ago Pritzker says 'action will be met with a response' after Trump threatens to send National Guard to Chicago Illinois Gov. JB Pritzker said the state \"will not stand idly by\" if President Donald Trump follows through with his threat to deploy the National Guard to Chicago.\nVIDEO 1 hour ago CNN anchor’s remarks over military's role in crime crackdown ripped ‘Fox News @ Night’ discusses the media blaming the Trump administration for school shootings, the role of the National Guard in the crime crackdown and a Vanity Fair editor slamming a potential first lady Melania Trump cover.\nVIDEO 2 hours ago Minneapolis Catholic school shooting was '100%' domestic terrorism: Israeli special ops veteran 'Fox News @ Night' panelists analyze the Minnesota Catholic school shooting and the investigation into the attack.\nVIDEO 4 hours ago Video shows Minneapolis-area home of Catholic school shooter Robin Westman Video captured outside the Richfield, Minn., residence of Robin Westman shows where the gunman lived before opening fire at the Annunciation Catholic School, killing 2 children and wounding 17 others. (Matthew Symons for Fox News Digital)\nVIDEO 4 hours ago Union Station takeover is 'long overdue,' Byron Donalds says Florida gubernatorial candidate Rep. Byron Donalds, R-Fla., weighs in on the Trump administration's takeover of Union Station and the Minnesota Catholic school shooting on 'The Ingraham Angle.'\nCrime 6 hours ago DC man accused of hurling sandwich at federal officer escapes indictment Former DOJ employee Sean Dunn avoided indictment after allegedly throwing a Subway sandwich at a federal officer during a Washington D.C. street confrontation.\nVIDEO 7 hours ago This is how Chicago residents really feel about Trump potentially sending in the National Guard Fox News senior correspondent Mike Tobin reports on where Chicago residents and leaders stand on the city possibly receiving help from the National Guard to crack down on crime on 'Special Report.'\nVIDEO 7 hours ago Pope Leo XIV sends condolences to the Catholic community after tragedy in Minneapolis Fox News correspondent Jonathan Hunt has the latest on the Minneapolis Catholic church shooting on 'Special Report.'\nVIDEO 8 hours ago Minneapolis church shooter had an official name change Fox News correspondent CB Cotton has the latest on the tragedy that killed two children and injured 17 on 'The Five.'\nVIDEO 9 hours ago Minneapolis mayor speaks following Catholic church shooting Minneapolis Mayor Jacob Frey provides an update on the deadly event."
    },
    {
      "url": "https://www.foxnews.com/us/maui-officer-killed-line-duty-police-chief-calls-her-the-finest-us",
      "text": "A Maui police officer was shot and killed Friday while responding to reports of a person firing a rifle in the area of the old sugar mill, according to police and reports.\nThe officer, who has not been identified, was fatally struck in Paia, located on the northern coast of the island of Maui, Hawaii, the Maui Police Department said in a statement.\nThe suspect, who also has not been named, has been taken into custody.\nNYPD OFFICERS LINE STREETS TO HONOR COLLEAGUE KILLED IN PARK AVE SHOOTING\n\"The Maui Police Department is deeply saddened to confirm that earlier this evening, one of our officers was fatally injured in an officer-involved shooting,\" the brief statement reads.\n\"This is a tragic loss for our department and our community. Out of respect for the officer’s family and loved ones, we are not releasing further details at this time. Additional information will be shared as it becomes available. We ask for the community’s patience and support as we work through this difficult time together.\"\nMaui Police Chief John Pelletier told Hawaii News Now that officers responded to an illegal shooting call in the area of the old sugar mill when they encountered the suspect who was firing what police believe to be a rifle.\nOHIO POLICE IDENTIFY OFFICER KILLED BY NOW-DEAD GUNMAN DURING AMBUSH SHOOTING\n\"Our officer suffered a round in her chest area. Officers returned fire. The subject was shot in the lower hip area and is in custody,\" Pelletier said.\nPelletier called the officer a true hero of the community and within the profession.\nCLICK HERE TO GET THE FOX NEWS APP\n\"She was the finest of us, and we are grateful for her,\" he said. \"This is an absolute tragedy. This is a dark day in the history of the Maui Police Department and our community.\"\n\"It’s something that none of us ever expect will happen, although we prepare for it, and it’s just absolutely horrible,\" he said.\nFox News Digital has reached out to Maui police for additional information."
    },
    {
      "url": "https://www.foxnews.com/category/us/crime/police-and-law-enforcement",
      "text": "Minnesota 1 hour ago Who is Robin Westman, suspect in Annunciation Catholic School shooting in Minneapolis? Federal and state authorities are investigating a mass shooting at Annunciation Catholic School in Minneapolis that left at least two children dead.\nVIDEO 1 hour ago Retired NYPD lieutenant reveals what is 'very telling' about Minneapolis church shooter Retired NYPD lieutenant Joe Cardinale and former FBI special agent Nicole Parker analyze what is 'very telling' about the suspect who opened fire at a Catholic school church in Minneapolis on 'America Reports.'\nVIDEO 2 hours ago Sheriff blasts illegal migrant for smiling in arrest photo Polk County Sheriff Grady Judd discusses the arrest of an illegal migrant for allegedly attacking an ICE agent in Florida on ‘America’s Newsroom.’\nVIDEO 2 hours ago Minneapolis mayor condemns 'evil' church school shooting Minneapolis Mayor Jacob Frey condemned the mass shooting attack at Annunciation Catholic School Wednesday, calling the attack horrific and “evil.\" (WCCO via NNS)\nVIDEO 2 hours ago Nearby resident recounts hearing rapid gunfire during church school shooting in Minneapolis Nearby residents recount the moment a mass shooting occurred at the Annunciation Catholic School in Minneapolis on Aug. 27, 2025. (APTN)\nVIDEO 2 hours ago Church school gunman committed 'deliberate act of violence,' Minneapolis police chief says Police Chief Brian O’Hara gave an update on the shooting that left two children dead, 17 injured at Annunciation Catholic School on Wednesday. (WCCO via NNS)\nVIDEO 2 hours ago Minneapolis mayor condemns 'evil' church school shooting Minneapolis Mayor Jacob Frey condemned the mass shooting attack at Annunciation Catholic School Wednesday, calling the attack horrific and “evil.\" (WCCO via NNS)\nVIDEO 3 hours ago Sheriff blasts illegal migrant for smiling in arrest photo Polk County Sheriff Grady Judd discusses the arrest of an illegal migrant for allegedly attacking an ICE agent in Florida on ‘America’s Newsroom.’\nVIDEO 3 hours ago Minneapolis Catholic school shooting leaves at least two children dead, 17 injured Minneapolis Mayor Jacob Frey and Minneapolis Police Chief Brian O’Hara give an update on the shooting at Annunciation Catholic School.\nMaryland 3 hours ago Maryland mother killed when 4 teens in stolen car slam into her and her child A 30-year-old mother died in a Maryland crash involving a stolen car driven by juveniles, with four suspects aged 14-17 now in police custody.\nVIDEO 3 hours ago Four teens in police custody following deadly crash that claimed life of Maryland mother One mother was killed, one child was hurt and four juveniles are in custody following the crash on Aug. 26, 2025, police explained on the scene. (Credit: WTTG)\nVIDEO 4 hours ago Police respond to shooting reports at Minneapolis Catholic school A shooting was reported Wednesday at the Annunciation Catholic School in Minneapolis, Minnesota, according to state Gov. Tim Walz. (KMSP)\nImmigration 6 hours ago Bodycam video shows illegal immigrant truck driver speaking limited English with New Mexico officer New bodycam footage shows illegal immigrant Harjinder Singh struggling with English after being pulled over for speeding in New Mexico: a detail that has since become a major talking point.\nVIDEO 8 hours ago Bodycam video shows illegal immigrant truck driver Harjinder Singh traffic stop with New Mexico trooper Newly released bodycam video shows illegal immigrant truck driver Harjinder Singh being pulled over in a traffic stop with a New Mexico trooper in July. (Credit: @NewMexicoStatePolice via YouTube)\nCrime 9 hours ago Crime-ridden blue cities struggle to combat shrinking police forces as feds step in to clean up chaos Police departments are struggling to recover from a mass 2020 officer exodus as recruitment remains difficult, a Fraternal Order of Police leader says.\nAbortion 15 hours ago Illinois man accused of drugging girlfriend with abortion pills to cause miscarriage An Illinois man was arrested after he allegedly drugged his pregnant girlfriend with abortion-inducing pills, causing her to lose her baby through a miscarriage, according to police.\nVIDEO 16 hours ago We need to take another look at how American citizens are treated: Illinois senate candidate A 'Fox News @ Night' panel reacts to a Chicago resident speaking out about violent crime, a report of recent fatal crashes linked to illegal immigrants, a DNC speaker downplaying migrant crime and a carjacking suspect speaking about his arrest.\nVIDEO 18 hours ago Sean Hannity: The Left wants no part of the effort to make our country safe and secure Fox News host Sean Hannity tears into Democrats proving to be on the 'wrong side' of crime plaguing American cities on 'Hannity.'\nVIDEO 19 hours ago Democrats need to meet Trump halfway on the crime issue, Kevin Walling says The 'Special Report' all star panel tackles President Donald Trump's crime crackdown, the president's Cabinet meeting and more.\nIllegal Immigrants 19 hours ago Illegal alien flashes beaming smile in arrest photo after allegedly battering a federal officer Denis Corea Miranda, an illegal alien from Nicaragua, smiled after being arrested. He allegedly battered a federal agent because he was determined not to be deported.\nCrime 20 hours ago Cincinnati police union unanimously votes no confidence in mayor Aftab Pureval amid viral beatdown fallout Police union condemns Cincinnati Mayor Aftab Pureval for a delay in responding to the viral July 26 and ordering charges against a White victim.\nVIDEO 21 hours ago Over 1,000 arrests in DC since Trump's crime crackdown Fox News correspondent Alexis McAdams reports on the latest efforts to clean up the capital on 'Special Report.'\nVIDEO 21 hours ago Chicago Mayor Johnson poses question to Trump, says he is not calling for 'occupation' of city Fox News senior correspondent Mike Tobin has the latest on what Chicago Mayor Brandon Johnson is asking the federal government amid President Donald Trump's crime crackdown on 'The Story.'\nVIDEO 22 hours ago Outside of these two crimes, there's a lot of 'wiggle room' for stats, public safety researcher reveals Manhattan Institute fellow Rafael Mangual breaks down the 'incentives' for manipulating crime statistics as the Trump administration alleges Washington, D.C.'s, numbers are fudged on 'The Will Cain Show.'\nVIDEO 22 hours ago Chicago officials don't want help from Trump because they're 'benefitting from the chaos,' says Chicago resident ChicagoRED founder Patricia 'P-Rae' Easley stresses that Chicago does need President Donald Trump's help to clean up the crime problem in the city on 'America Reports.'\nVIDEO 1 day ago Hear Kilmar Abrego Garcia's 2-word message in video posted by DHS Kilmar Abrego Garcia was arrested by ICE on Aug. 25, 2025. (@DHSgov via X)\nVIDEO 1 day ago Carjacking suspect calls out soft-on-crime policies during arrest: 'DC jail has to release me' Fox News’ Alexis McAdams shares details from her ride-along with the U.S. Marshals Service in Washington, D.C., as the Trump administration continues its federal takeover of the nation’s capital.\nDrugs 1 day ago Florida sheriff shows off $50K chain snatched from alleged drug dealer implicated in overdose death Polk County Sheriff Grady Judd announced the takedown of a drug-trafficking gang by donning the leader’s gold chain and bracelet during a press conference.\nVIDEO 1 day ago Kennedy: This order on flag burning is more about the surrounding crime Fox News contributor Tyrus and the 'Gutfeld!' panelists discuss President Donald Trump's latest executive orders.\nVIDEO 1 day ago Trump trades jabs with Chicago mayor, Illinois gov over crime crackdown Fox News senior White House correspondent Peter Doocy breaks down President Donald Trump's latest executive orders and his crackdown on crime as he eyes additional cities on 'Special Report.'"
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/midwest/kansas",
      "text": "Police and Law Enforcement 1 hour ago Kansas City police officer killed by fleeing suspect while deploying stop sticks to end pursuit A Kansas City Kansas police officer died on Tuesday after a driver fleeing law enforcement hit him with a truck while he was deploying stop sticks.\nViruses 6 days ago Kansas tracks 5 serious West Nile virus cases as mosquito season peaks across the state Kansas health officials monitor 6 West Nile virus cases, with 5 classified as serious neuroinvasive infections in north-central and south-central regions.\nChina July 28 China’s climate lawfare should come under Bondi’s microscope, Kansas AG says Kansas Attorney General Kris Kobach is asking the Department of Justice to investigate the funding sources behind an \"environmental lawfare campaign.\"\nKansas July 27 Kansas deputy fatally shot by suspect barricaded in house: sheriff A 34-year-old Kansas deputy was shot and killed by a suspect who barricaded himself in a home, with the Kansas Bureau of Investigation now investigating.\nKansas July 21 Red state Senate president joins field of Republicans hoping to wrest governorship from Democratic control Kansas state Senate President Ty Masterson jumped into the field of Republican gubernatorial candidates hoping to become the next governor of the state\nMedia July 11 PBS station singles out GOP senators in contentious public broadcasting funding battle Republican officials criticized PBS Kansas for running an ad asking viewers to contact senators about preserving funding, as the Senate prepares to vote on public media funds.\nUS June 11 Kansas substitute teacher, 39, had sex with 2 students during boozy mid-week encounters, prosecutors say A Kansas substitute teacher appeared in court Monday to face charges accusing her of having sex with two students during an alcohol-fueled incident earlier this year.\nKansas May 31 Lawsuit filed against Kansas law nullifying end-of-life choices for pregnant women Two physicians and three women are suing to block a Kansas law that invalidates medical decisions pregnant women can make about end-of-life treatment.\nKansas May 17 Minor's lawsuits against adult sites show new state law is working as intended to protect kids: state AG A minor child and the child's mother have filed four lawsuits in Kansas, targeting pornographic sites for lacking adequate age-verification measures.\nKansas May 6 Kansas man allegedly stole rare, historic 800-pound cannon from park for drug money: report Newly released court documents detail that a Kansas man stole a rare, historic, 800 pound cannon from a park for drug money he owed and \"believed his life was in danger.\"\nMissouri April 15 Chiefs parade-goer who sued over social media claims is dead: attorney Denton Loudermill Jr., who was falsely implicated in social media posts following the shooting at the Kansas City Chiefs' victory rally last year, has died.\nKansas April 9 Kansas 9-year-old caught driving parents' truck to school after missing bus: police Police in Kansas said a young boy was apprehended after he reportedly took his parents truck on a three-mile drive to school after he missed the bus ride.\nKansas April 7 Kansas Catholic priest was shot 'intentionally and with premeditation,' prosecutor alleges The murder of Kansas Catholic priest Arul Carasala at his church’s rectory was carried out \"intentionally and with premeditation,\" a prosecutor said.\nRoman Catholic April 5 Kansas Catholic priest dies after being shot at his church's rectory, leaving parish in 'state of shock' A Catholic priest died in Kansas after being shot at his church’s rectory in an incident a fellow pastor said has left his parish in a \"state of shock.\"\nReligious Controversies March 29 Satanic leader arrested after Black Mass, scuffle at Kansas Statehouse: 'A despicable act' A leader of a \"nondenominational Satanic church\" in Kansas and three others were arrested after a fight broke out between Satanists and Christians at the Kansas Statehouse in Topeka.\nCrime March 27 Kansas babysitter finds 'monster' under child's bed, man charged with aggravated kidnapping: police Officials in Kansas said a man was arrested after he hid underneath a child's bed on Monday. The child told the babysitter there was a \"monster\" under the bed.\nKansas March 27 Kansas babysitter comes face to face with real life 'monster' under the bed A Kansas babysitter found a troubling surprise when she came face to face with a \"monster\" under the bed when attempting to calm down a child she was watching.\nInfectious Disease March 26 Kansas announces measles outbreak with 10 cases reported The Kansas Department of Health and Environment has confirmed 10 cases of measles in three counties as outbreaks across the U.S. continue to spread in unvaccinated kids.\nMissing Persons March 24 Kansas trooper rescues kidnapped 6-year-old girl, takes 2 men into custody during traffic stop A kidnapped 6-year-old girl, who with the suspect on the run for over a month, was rescued after a trooper pulled over an SUV for a traffic violation.\nFirst Amendment March 21 Satanic group defies Kansas officials, plans 'black mass' at state Capitol Kansas lawmakers have taken steps to stymie a satanist demonstration at the state capitol, arguing the event is aimed at denigrating Christians and alleging the group's leader admitted to stealing a consecrated host to be used during his 'black mass' event.\nVandalism March 17 ‘Face of evil’: Catholic Church named after St. Patrick vandalized with Satanic message Authorities are investigating a possible hate crime after a Catholic Church named after St. Patrick was discovered with \"extensive vandalism,\" including a Satanic message in Wichita, Kansas.\nWeather March 15 Tornado threat moves south after central states hit by massive storm The threat of tornadoes moved east into the Mississippi Valley and the south on Saturday, just a day after a massive storm in several central states.\nCrime March 5 Two charged in Kansas City Chiefs fans' deaths 14 months after bodies found frozen in backyard Two men have been arrested in connection to the deaths of three Kansas City Chiefs fans who were found frozen in the backyard of a Kansas City, Missouri, area home back in January 2024.\nKansas February 16 Wife convicted of murdering Army soldier husband at home on military base A federal jury convicted a Kansas woman for shooting and killing her Army soldier husband in February 2024 at their home at Fort Riley.\nPolitics February 7 Heartland lawmakers seek to fix 'fundamental' roadblock for farm kids seeking student aid Sens. Joni Ernst, R-Iowa, and Michael Bennet, D-Colo., along with Rep. Tracey Mann, R-Kan, are sponsoring a bill to adjust the Free Application for Federal Student Aid qualification requirements to halt an unfair disadvantage for farm families.\nWashington DC February 4 DC plane crash timeline: Midair collision involves 67 passengers, crew members, soldiers A timeline of the Washington, D.C., plane crash on Jan. 29 details the moments before and after an American Airlines passenger flight and Army helicopter collided over the Potomac.\nMILITARY January 31 DC plane crash: Military aircraft collisions raise questions about training and equipment, expert says U.S. military helicopter crashes like the one that took down a commercial American Airlines flight on Wednesday night are rare but have increased since 2024.\nUS January 31 Howard University professor among victims in midair collision A Howard University professor and former Miss Kansas contestant known for her “bright smile\" and “zest for life\" was among the victims in Wednesday’s midair collision between an Army helicopter and an American Airlines plane near Reagan National Airport.\nHouse Of Representatives Politics January 30 'We're the gold standard': GOP lawmaker calls for congressional hearing over DC plane crash Rep. Troy Nehls spoke with Fox News Digital about what he's learning about the fatal collision between a military helicopter and a small passenger jet.\nHouse of Representatives January 30 Kansas lawmakers vow to find answers after Wichita plane crash in DC House and Senate lawmakers from Kansas released a bipartisan statement on the tragic American Airlines crash Wednesday night in Washington, D.C."
    },
    {
      "url": "https://www.foxnews.com/category/us/crime/robbery-theft",
      "text": "VIDEO 5 days ago NYC Mayor Eric Adams, NYPD commissioner, hold press briefing after officer shot Mayor Eric Adams and Commissioner Jessica Tisch detailed the Queens shooting that left an NYPD officer wounded, saying suspect Kevin Dubuisson should never have been free after repeated violent arrests.\nVIDEO 6 days ago Sean Hannity: Trump's crime crackdown is yielding MASSIVE results Fox News host Sean Hannity touts the 'massive results' of President Donald Trump's crackdown on violent crime on 'Hannity.'\nBryan Kohberger August 19 Bryan Kohberger flexed like 'American Psycho' and spent Christmas night reading about serial killers Bryan Kohberger's phone revealed narcissistic selfies and Christmas night research on serial killers after murdering four Idaho students, digital forensics experts say\nWashington August 18 Seattle police chief was reportedly having lunch as $2M jewelry store robbery happened just yards away Seattle Police Chief Shon Barnes was reportedly eating lunch yards away when masked robbers stole $2 million in diamonds and Rolex watches from a West Seattle jewelry store.\nCrime August 18 Cincinnati felon with 22 prior arrests indicted for allegedly snatching victim's chain during viral beatdown Cincinnati beatdown suspect Gregory Wright faces new charges in viral assault case after 22 prior arrests, including drug trafficking and gun violations\nVIDEO August 17 Surveillance video captures $2 million robbery of Seattle jewelry store ‘Fox Report’ anchor Jon Scott discusses a viral incident at a Seattle store where robbers appeared to grab $2 million in jewelry.\nRobbery - Theft August 16 Masked robbers pull off brazen midday heist at Seattle jewelry store in under two minutes A brazen midday robbery at a West Seattle jewelry store was captured on surveillance video as thieves stole luxury watches, gold and a $125,000 emerald necklace\nVIDEO August 16 Thieves steal $2 million in jewelry in Seattle smash-and-grab Four masked robbers made off with millions in jewelry in a West Seattle store robbery that tool less than two minutes on Thursday. (Menashe & Sons Jewelers)\nVIDEO August 14 Bryan Kohberger 'relentlessly taunted' by inmates, says criminal defense attorney Criminal defense attorney Donna Rotunno analyzes the death of designer Martha Nolan-O'Slatarra, reports of Bryan Kohberger being taunted in jail, and the arrest of four suspects in the robbery at Brad Pitt’s home on 'America's Newsroom.'\nCrime August 13 Cincinnati viral beating suspect hit with federal gun charge Federal grand jury indicts Cincinnati beating suspect for illegal firearm possession after July incident left mother with brain damage and injured five others\nVIDEO August 13 Burglars tunnel into Starbucks bathroom in overnight heist Deputies say suspects burrowed through a bathroom wall from a vacant shop next door in an Aug. 8 break-in. (Credit: Kitsap County Sheriff’s Office via Facebook)\nRobbery - Theft August 12 Brad Pitt’s LA home burglary leads to 4 arrests in ongoing police investigation Authorities capture four suspects after burglars broke into what is believed to be Brad Pitt's North Edgemont Street property through front window, ransacking the home\nVIDEO August 12 National Guard will get the 'worst of the worst' off DC streets: Chris Swecker Former FBI assistant director Chris Swecker and former Assistant District Attorney Phil Holloway discuss President Donald Trump's crackdown on crime on 'The Faulkner Focus.'\nVIDEO August 12 DC Police Union agrees with Trump: 'Crime is out of control' D.C. Police Union Chairman Greggory Pemberton explains how data is manipulated to make it appear that crime in the capital city is going down on 'Varney & Co.'\nVIDEO August 11 Washington, DC is more dangerous than the capitals of many third-world countries, senator says Sen. Tom Cotton, R-Ark., discusses how President Donald Trump can bring crime under control in Washington, D.C. on 'America's Newsroom.'\nLos Angeles August 11 Suspects lead police on wild chase through LA while carjacking multiple vehicles, including big rig A pair of suspects led police on a wild chase through Los Angeles Sunday night as they carjacked multiple vehicles – including a big rig – on live TV before officers lost sight of them.\nVIDEO August 6 DETAILS: 'Big Balls,' ex-DOGE staffer, brutally attacked in DC 'Outnumbered' discusses President Donald Trump's threat to federalize Washington, D.C. after a former DOGE staffer was attacked by a gang.\nTravel August 5 Tourists face dangerous 'crush-and-grab' pickpocket schemes in major city The U.S. Embassy and the Reddit community both provide pickpocket prevention strategies for Paris tourists, covering subway safety, street scams and high-risk tourist locations.\nVIDEO July 30 'Horrific': Robbers ambush NYC jewelry influencer 'The Watch King' 'The Watch King' Moshe Haimoff joins 'Fox & Friends First' to share his experience being robbed in front of his house.\nMassachusetts July 29 Massachusetts police arrest six women in alleged multi-state burglary gang, 3 taken into ICE custody Massachusetts police arrest six Maryland women after home break-in and dramatic chase, with suspects allegedly connected to organized interstate crimes.\nVIDEO July 19 Suspect in killing, burglary of American Idol executive could face up to life in prison Fox News contributor and former DC homicide detective Ted Williams discusses the American Idol executive murder case, the Bryan Kohberger case and more on ‘Fox News Live.’\nArizona Diamondbacks July 17 Diamondbacks star Ketel Marte's home targeted during All-Star Game in 'high-dollar' burglary, police say Police in Arizona are investigating after they say the home of Diamondbacks star Ketel Marte was burglarized while he was at the All-Star Game in Georgia Tuesday.\nFOOD July 6 Man buys locked mini-fridge after food thefts, gets called 'weird and selfish' by co-workers An office worker's solution to lunch theft - a locked mini-fridge under his desk - sparked workplace drama, with one of the co-workers calling it \"weird and selfish.\"\nTech July 3 ATM jugging scam on the rise as thieves target victims Protect yourself from jugging, the rising crime by which thieves monitor ATM users and follow them to steal cash, with six practical safety tips to stay alert and secure.\nLos Angeles July 1 California police nab 7 foreign nationals in jewelry store heist, 1 suspect still loose Seven men arrested while attempting to break into a jewelry store, part of a group police believe committed similar heists in their countries of origin.\nCrime June 20 Police sound alarm on dangerous 'jugging' robbery trend sweeping across America Police warn about \"jugging,\" a crime where thieves monitor banks and ATMs, then rob victims who withdraw large sums of money, with cases spreading from Texas to South Carolina.\nFlorida June 19 Cocky fugitive's social media challenge to sheriff backfires in spectacular fashion Wanted man Aaron Johnson captured after challenging Polk County Sheriff's Office on Facebook, bragging he couldn't be caught despite multiple felony warrants.\nColorado June 18 Thousands of Nintendo Switch 2 consoles stolen in $1.4M cargo heist A $1.4 million heist of Nintendo Switch 2 consoles occurred in Colorado just days after worldwide release, with 2,810 units stolen from a semitruck.\nLos Angeles June 17 Over 100 looters ransack AutoZone in possible LA street takeover A mob broke into and looted an Autozone store in Los Angeles on Monday, marking the second time this location was targeted in a possible street takeover.\nVIDEO June 17 Massive mob leaves Los Angeles Autozone store ransacked, destroyed An Autozone store in South Los Angeles was broken into and looted by a massive crowd Monday morning, marking the second time in nearly one year the location was targeted in a possible street takeover. (KTTV)"
    },
    {
      "url": "https://www.foxnews.com/us/utah-police-officers-killed-during-domestic-disturbance-response-were-husbands-fathers-definitely-heroes",
      "text": "Two Utah police officers who were killed in a shooting while responding to a domestic disturbance call on Sunday night have been identified.\nSgt. Lee Sorensen, 56, and Officer Eric Estrada, 31, of the Tremonton Garland Police Department were both killed at a home in a Tremonton neighborhood, the department said.\n\"These officers are definitely heroes,\" Police Chief Chad Reyes in neighboring Brigham City, which is the agency leading the investigation, said at a news conference Monday morning.\nPolice received multiple 911 hang-up calls around 9:30 p.m. from a home in Tremonton. One Tremonton Garland officer arrived first and began speaking to someone at the home when an armed man came out with a gun, authorities said.\nKANSAS DEPUTY FATALLY SHOT BY SUSPECT BARRICADED IN HOUSE: SHERIFF\nThe man opened fire on the officer, striking and killing him. A second Tremonton Garland officer who rushed to help the first officer \"was immediately fired upon by the same male suspect\" and was killed, the Brigham City Police Department said in a news release.\nSorensen served in law enforcement for 17 years, 16 of which were in the Garland Police Department. He has received multiple honors for his distinguished service and impact, and was recently promoted to sergeant, with a swearing-in ceremony planned for Friday.\nHe is survived by his wife, Lanette, and their children.\nEstrada began his law enforcement career in 2017, serving with the Logan Police Department before joining the Box Elder County Sheriff’s Office. He joined the Tremonton Police Department earlier this year.\nPolice described Estrada as \"a dedicated father and husband, deeply loving and cherishing his family.\" The news release said \"he loved interacting with people and engaging with the community\" while on patrol.\nSOUTH CAROLINA DEPUTY SHOT AND KILLED IN AMBUSH, SHERIFF SAYS\nThe 31-year-old officer is survived by his wife, Brittney, and their two children, Cienna and Luka.\nA deputy from the Box Elder County Sheriff's Office also responded and was fired upon while still inside his vehicle with his service dog. The wounded deputy was released from the hospital Monday, and the dog was hospitalized in fair condition, police said.\nAfter the officers were shot, bystanders persuaded the man to put down his weapon, police said. Up to 50 officers from multiple agencies responded. SWAT teams arrived to clear the home and verify that there was no further threat, police said.\nThe male suspect surrendered to authorities and was taken into custody. He was charged with aggravated murder, police said.\nAuthorities did not immediately release the name of the suspect.\nCLICK HERE TO GET THE FOX NEWS APP\nUtah Gov. Spencer Cox called the shooting \"a terrible and tragic night.\" He wrote in a post online that the state will mourn the loss \"of these courageous law enforcement officers\" and ordered flags to be flown at half-staff in their honor.\nThe Associated Press contributed to this report."
    }
  ],
  "argos_summary": "Kansas City police officer 26‑year‑old Hunter Simoncic was fatally struck by a truck driven by 31‑year‑old Dennis Mitchell III while Simoncic was deploying stop sticks to end a pursuit. Mitchell, who abandoned a stolen truck and fled after an earlier shooting incident, was arrested and charged with capital murder, fleeing or attempting to elude a police officer, criminal possession of a weapon and two counts of theft. Simoncic, a 2023 academy graduate with a sociology bachelor's and forensic science master's, had also worked as a juvenile detention center supervisor and volunteered reading to children. The department mourned his loss and announced a funeral for September 3. The incident underscores the dangers officers face during routine traffic stops and pursuit terminations.",
  "argos_id": "8UB74OPU5"
}