{
  "url": "https://www.morningstar.com/news/business-wire/20250827052506/syngenta-group-reports-h1-2025-earnings",
  "authorsByline": "",
  "articleId": "25e614daaf604c769250777850b72068",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T01:00:00-05:00",
  "addDate": "2025-08-28T06:29:22.183747+00:00",
  "refreshDate": "2025-08-28T06:29:22.183748+00:00",
  "score": 1.0,
  "title": "Syngenta Group Reports H1 2025 Earnings",
  "description": "",
  "content": "• EBITDA margin recovery thanks to continued focus on enhancing productivity, cost management and operational efficiency\n• Sustained demand for new crop protection technologies and biological products as crop protection market recovery continues\n• Syngenta will continue to invest in innovation; in total, globally over 800 product approvals in H1 for crop protection business\n\nSyngenta Group today announced financial results for the first half and the second quarter ended June 30, 2025. Sales for the first half of 2025 were $14.5 billion, reaching the prior year period’s level and up 2% at constant exchange rates (CER).\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20250827052506/en/\n\nEBITDA for the first half of the year was $2.5 billion, 24% higher (+29% at CER) year-on-year. The Group’s EBITDA margin for the first half of 2025 was 17.5%, up 3.4 percentage points compared to 14.1% in H1 2024.\n\nSales for the second quarter 2025 were $7.2 billion, flat versus the prior year (+1% at CER). On a consolidated basis, sales of all business units were adversely impacted by currency in the first six months. EBITDA for the second quarter 2025 was 32% higher than the prior year (+34% at CER) at $1.1 billion.\n\nThe Group’s strategic emphasis on investments in R&D and innovation, combined with disciplined cost management, enhanced productivity, and operational efficiency continued to deliver tangible results. These efforts are reflected in the strong EBITDA margin recovery in the first six months of the year and underscores the Group’s commitment to driving sustainable, long-term profitability. Cash flow remained solid and continued its positive development.\n\nSyngenta Group benefited from the flexibility of its manufacturing processes, leveraging a global production network for its products. This approach enables ongoing supply chain optimization in response to changing market conditions and tariff developments, which are not expected to materially impact business performance in 2025.\n\nWith signs of further market stabilization in crop protection and a lower 2024 baseline, Syngenta Group expects stable sales and margins in the second half of the year.\n\nSales for Syngenta Crop Protection were 3% higher at $6.4 billion (+7% CER) in the first half of 2025. The business continued its momentum from Q1 with sales above last year for Q2.\n\nIn the first half of 2025, Biologicals and a return to normal stock levels drove sales performance in Europe (+5%), while favorable pricing for new product introductions and higher volumes contributed to 9% growth in Asia, the Middle East & Africa (excluding China). China continued to perform strongly, achieving 9% year-on-year growth in the first half (flat in Q2) with increases across all blockbuster technologies and biologicals. In the first six months, sales in North America were 10% higher (mainly driven by a change in sales phasing closer to consumption, with flat sales in Q2); sales declined across both Latin America and Brazil, by 14% and 5% respectively.\n\nSyngenta secured over 800 product approvals in H1 including major successes in Brazil with the registration of TYMIRIUM® technology and three other active ingredients for the region. India saw a record of 10 registrations, among them VANIVA™, based on TYMIRIUM® technology, for use on tomato, cucumber, okra and banana crops.\n\nIndia is also the first country to launch ALTESSIA®, a key herbicide for use in rice fields where one spray allows farmers to overcome multiple challenges at once, including tough weeds and crop safety concerns. SIMODIS®, featuring PLINAZOLIN® technology, registered in Thailand for vegetables.\n\nBiologicals continued to see steady growth in the first six months of 2025 compared to the previous year. Demand for biocontrols, biostimulants and nutrient efficiency products was strong in all regions. Syngenta Biologicals entered into several strategic collaborations to accelerate product development. These initiatives address critical crop challenges at every stage of the growing cycle, delivering biological solutions to farmers worldwide.\n\nIn early 2025, Syngenta concluded the integration of Novartis’ Strains and Natural Products Collection, the repository of natural compounds and genetic strains for agricultural use. The transaction also covers integrated capabilities in bioengineering, data science, fermentation, downstream processing, as well as analytics. These additions will further accelerate the development of biologicals, complementing the farmer’s toolbox. In 2025, Syngenta officially opened a 22,000 m² biologicals facility in Orangeburg, South Carolina, in the United States, which is purpose-built to produce 16,000 tons of biostimulants annually. This new manufacturing facility complements Syngenta’s existing global network of biologicals manufacturing facilities in Brazil, Italy, India and Norway.\n\nSeeds sales were $2.4 billion in the first half of 2025, up 2% year-on-year (+3% CER).\n\nFirst half field crops sales in China and Brazil continued to deliver strong growth with 14% and 10%, respectively. Asia, Middle East & Africa increased 1%. Sales in North America were 1% lower (+6% for Q2), Latin America sales were down 5% (+36% for Q2), and Europe was down7% (+5% for Q2). Sales of Vegetable Seeds increased by 5 percent and sales of Flowers were 2 percent lower.\n\nIn the reporting period, field testing began for a proprietary, next-generation soybean herbicide tolerance trait stack, bringing significant differentiation and value to farmers. China introduced the AGRISURE VIPTERA® trait brand, further pursuing GM commercialization providing farmers with more effective solutions. Brazil expanded its portfolio offerings in both soybean and corn in preparation for planting. In Asia, Indonesia strengthened its biotech corn portfolio in the tropical irrigated segment while India gained corn market share by further integrating physical and digital farmer touchpoints. Vietnam launched a new hybrid rice product expected to achieve 2.5x growth in its second year. North America delivered significant profit growth through operational efficiencies; sunflower seasonal volumes increased in a flat European market; and in Latin America, Syngenta Group anticipates record-breaking sunflower acreage, positioning the company to capitalize on its leadership in the region.\n\nSyngenta Vegetable Seeds opened a new state-of-the-art Seed Health Lab in the Netherlands, further bolstering its global quality control capabilities to provide growers with the highest quality seed products. It also signed an innovative commercial collaboration with Azura Group, the largest tomato grower in North Africa, bringing R&D closer to the grower in collecting data on experimental vegetable varieties through sensors in Azura's greenhouses while allowing them to identify varieties they would like to grow.\n\nSyngenta Group China achieved sales of $4.9 billion in the first half of 2025, 5% lower year-on-year due to continued strategic exits from lower margin businesses (-4% CER). The Seeds, Crop Protection and Fertilizer businesses registered strong volume growth driven by the introduction of new products, which offset pricing pressures.\n\nSales of Seeds grew 15%. Crop Nutrition sales grew 6%, sales of Branded Formulation were also 6% higher, demonstrating the success of Syngenta’s innovations in the Chinese market. Yangnong Chemical sales were 8% higher. Grain trading business sales were 54% lower, largely due to the continued strategic reduction of this business.\n\nSyngenta Group China successfully secured national certification for twelve new GM corn varieties and continued transforming its Modern Agriculture Platform (MAP) while strengthening its portfolio through an increased focus on large-scale farming services. Syngenta Group China successfully launched an artificial intelligence-driven offering “iMAP” to farmers.\n\nADAMA sales were at $2.1 billion in the first half of 2025, reaching the same level as the prior year period (+1% CER) in a stabilizing market environment for suppliers of post-patent active ingredients. ADAMA’s profitability continued to improve under its ongoing business and transformation “Fight Forward” plan. In the second quarter 2025, ADAMA returned to year-on-year revenue growth for the first time since Q3 2022, while also achieving a fifth consecutive quarter of year-on-year EBITDA growth.\n\nIn the first six months of the year, ADAMA grew sales in North America by 19% thanks to strong business momentum across the region. Sales in Europe, Africa and the Middle East were 4% lower; Latin America were 9% lower; Asia Pacific (excluding China) were 19% lower in line with the strategy to reduce the commodity business and increase quality of business. Sales in China were 12% higher.\n\nAs part of the “Fight Forward” plan, ADAMA is focused on improving its overall portfolio mix, particularly by targeting the Value Innovation segment, with the intent of improving value delivered to all stakeholders. Recent launches of differentiated products include Brevis™ SC, a fruit thinner for managing flowering and fruiting in pome fruits such as apples and pears, and Temper™ More, a herbicide developed with ADAMA’s SESGAMA™ technology, both in the USA. Upturn®, a blend of Fomesafen and Propaquizafop offering broad-spectrum control of hard-to-kill weeds, was officially launched in India following its soft introduction in 2024. And Jumbo®, a herbicide combining Sulfentrazone and Tebuthiuron, offering broad-spectrum, high-efficiency weed control in sugarcane, was launched in Brazil.\n\nFor further information, see the reporting of financial results for ADAMA Ltd. (SHE: 000553), Sinofert Holdings (SEHK: 0297), Winall Hi-tech Seed (SHE: 300087), Yangnong Chemical (SHA: 600486) and Syngenta AG.\n\nUnless otherwise mentioned, comparisons are to the same period in 2024. Certain amounts, including components of change (%), may not add up due to rounding. The results presented in this release are unaudited and a consolidation of the business units in the Syngenta Group which includes Syngenta AG, Syngenta Group China, ADAMA Ltd., Sinofert Holdings, Winall Hi-tech Seed and Yangnong Chemical. As a change to previous reporting, Syngenta Group China now excludes Adama China results to reflect revised management structures, with prior year figures restated accordingly to reflect this change.\n\nResults in this report from one period to another period are, where appropriate, compared using constant exchange rates (CER). To present that information, current period results for entities reporting in currencies other than US dollars are converted into US dollars at the prior period's exchange rates, rather than at the exchange rates for the current year. The CER presentation indicates the business performance before taking into account currency exchange fluctuations.\n\nEBITDA is a non-GAAP measure and EBITDA as defined by Syngenta Group may not be comparable to similarly described measures at other companies. Syngenta Group has defined EBITDA as earnings before interest, tax, non-controlling interests, depreciation, amortization, restructuring and impairment. Information concerning EBITDA has been included as it is used by management and by investors as a supplementary measure of operating performance. Syngenta Group excludes restructuring and impairment from EBITDA to focus on results excluding items affecting comparability from one period to the next.\n\nEBITDA as used in this press release excludes one-time events; other documents may treat this as an underlying or adjusted EBITDA. EBITDA excludes other one-off or non-cash/non-operational items that do not impact the ongoing performance of the business, as well as the impact of a time-bound Group launch long-term incentive scheme for leadership.\n\nWhen referred to as such, “the Group” implies Syngenta Group.\n\nSyngenta Group is one of the world’s biggest agricultural innovation companies, employing over 56,000 people in more than 90 countries. Syngenta Group is focused on developing technologies and farming practices that empower farmers, so they can make the transformation required to feed the world’s population while preserving our planet. Syngenta Group’s bold scientific discoveries deliver better benefits for farmers and society on a bigger scale than ever before. Guided by its Sustainability Priorities, Syngenta Group supports farmers to grow healthier plants in healthier soil with a higher yield. Syngenta Group, which is registered in Shanghai, China, and has its management headquarters in Switzerland, draws strength from its four business units: Syngenta Crop Protection, headquartered in Switzerland; Syngenta Seeds, headquartered in the United States; ADAMA®, headquartered in Israel; and Syngenta Group China.\n\nTo find out more about how our innovation is empowering farmers around the world, read our articles on the Stories section of our Syngenta Group website.\n\nFor Syngenta Group photos and videos, please visit the Syngenta Group Media Library.\n\nData protection is important to us. You are receiving this publication on the legal basis of Article 6 para 1 lit. f GDPR (“legitimate interest”). However, if you do not wish to receive further information about Syngenta Group, just send us a brief informal message and we will no longer process your details for this purpose. You can also find further details in our privacy statement.\n\nThis document may contain forward-looking statements, which can be identified by terminology such as “expect,” “would,” “will,” “potential,” “plans,” “prospects,” “estimated,” “aiming,” “on track” and similar expressions. Such statements may be subject to risks and uncertainties that could cause the actual results to differ materially from these statements. For Syngenta Group, such risks and uncertainties include risks relating to legal proceedings, regulatory approvals, new product development, increasing competition, customer credit risk, general economic and market conditions, compliance and remediation, intellectual property rights, implementation of organizational changes, impairment of intangible assets, consumer perceptions of genetically modified crops and organisms or crop protection chemicals, climatic variations, fluctuations in exchange rates and/or grain prices, single source supply arrangements, political uncertainty, natural disasters, and breaches of data security or other disruptions of information technology. Syngenta Group assumes no obligation to update forward-looking statements to reflect actual results, changed assumptions or other factors.\n\n®/™ are Trademarks of companies belonging to the Syngenta Group.",
  "medium": "Article",
  "links": [
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.syngentagroup.com&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=privacy+statement&index=9&md5=0f68db7ec5d2fc68c4b49dd29ff9efce",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.syngentagroup.com%2Fen%2Fmedia%2Fmedia-library&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=Syngenta+Group+Media+Library&index=8&md5=9206922c1d651896e24c554aaa99d83b",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.syngentagroup.com%2Fen&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=Syngenta+Group&index=1&md5=3aedd2c3ad6eb05a18c84fa96bec488f",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.syngenta.com&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=Syngenta+Crop+Protection&index=3&md5=230eacfe34ce69be05b60f2c71c084ba",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.syngenta.com%2Fen%2Fseeds&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=Syngenta+Seeds&index=4&md5=a91f95e83f284c89cf8a9031de008bf7",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.syngentagroup.com%2Fsustainability%2Fstories&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=Syngenta+Group&index=7&md5=f022b202c311698cccd6db53d28845b5",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.syngentagroup.cn%2F&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=Syngenta+Group+China&index=6&md5=a3487ccb6cc18728e780529c43c98ecf",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.syngentagroup.com%2Fsustainability&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=Sustainability+Priorities&index=2&md5=b5ff0592028a8f957ec52afd1cad03e3",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.adama.com%2Fen&esheet=54314046&newsitemid=20250827052506&lan=en-US&anchor=ADAMA%26%23174%3B&index=5&md5=9f13d4f3363b7d6d0219d9aa28498b3b",
    "https://www.businesswire.com/news/home/20250827052506/en/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Syngenta Group China",
      "weight": 0.08740344
    },
    {
      "name": "Syngenta Group",
      "weight": 0.08628079
    },
    {
      "name": "Syngenta Group photos",
      "weight": 0.080186784
    },
    {
      "name": "Syngenta Seeds",
      "weight": 0.06694625
    },
    {
      "name": "Syngenta",
      "weight": 0.06652479
    },
    {
      "name": "First half field crops sales",
      "weight": 0.06585386
    },
    {
      "name": "Syngenta Biologicals",
      "weight": 0.06559772
    },
    {
      "name": "Syngenta AG",
      "weight": 0.06435476
    },
    {
      "name": "Syngenta Crop Protection",
      "weight": 0.063575305
    },
    {
      "name": "Syngenta Vegetable Seeds",
      "weight": 0.06321172
    }
  ],
  "topics": [
    {
      "name": "Environment-ESG"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.916015625
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.91015625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9052734375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.591796875
    }
  ],
  "sentiment": {
    "positive": 0.9109078,
    "negative": 0.023299363,
    "neutral": 0.065792896
  },
  "summary": "Syngenta Group has reported its financial results for the first half and second quarter of 2025, with sales reaching $14.5 billion and up 2% at constant exchange rates (CER). The company continued to focus on enhancing productivity, cost management, and operational efficiency, amidst continued demand for new crop protection technologies and biological products. The Group's EBITDA margin was 17.5%, up 3.4 percentage points compared to 14.1% in H1 2024. Sales for Syngenta Crop Protection were 3% higher at $6.4 billion in the same period. The company also secured over 800 product approvals in the H1, including major successes in Brazil with the registration of TYMIRIUM® technology and three active ingredients for the region.",
  "shortSummary": "Syngenta Group reported strong EBITDA margins and increased crop protection sales, driven by increased demand for new crop protection technologies and biologicals, with continued investment in innovation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "61527b4ef14c4b308693a9d1a97ab9c3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Syngenta Group reported first‑half 2025 sales of $14.5 billion, flat at constant exchange rates, and an EBITDA of $2.5 billion, a 24 % YoY increase and a margin of 17.5 % up 3.4 pp from 2024. Crop protection sales rose 3 % to $6.4 billion, driven by strong demand for new chemical and biological products, while seeds and biologicals also grew, supported by over 800 product approvals worldwide. The company highlighted continued investment in R&D, cost discipline, and a flexible global manufacturing network, and opened a new 22,000 m² biologicals facility in South Carolina to boost biostimulant production. Regional performance varied, with China and Brazil showing double‑digit growth, North America and Latin America mixed results, and the group expecting stable sales and margins in the second half as crop protection markets stabilize.",
  "argos_id": "CGSVV1ML9"
}