{
  "url": "https://www.reuters.com/pt/negocio/Y4MBPX6KNZNOFJYRFDV6WLQVHQ-2025-08-28/",
  "authorsByline": "Reuters",
  "articleId": "675df96d8574434e9915aaf9cf4038c6",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/466BJJQ7PVGY5O53NZ3KL65MHM.png?auth=b9c3bf166c40a6778eb5672993fde7c30a15f48329026674eff92afd8da1d0ca&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "pt",
  "pubDate": "2025-08-28T09:41:09.527000+00:00",
  "addDate": "2025-08-28T09:47:44.076440+00:00",
  "refreshDate": "2025-08-28T09:47:44.076441+00:00",
  "score": 1.0,
  "title": "Nvidia continua crescendo, mas incerteza na China atrapalha perspectivas",
  "description": "As ações da Nvidia caíram na quarta-feira, à medida que o destino de seus negócios na China ficava incerto, envolvido na guerra comercial entre Washington e Pequim.",
  "content": "27 Ago (Reuters) - As ações da Nvidia (NVDA.O) caíram na quarta-feira, à medida que o destino de seus negócios na China ficava incerto, envolvido na guerra comercial entre Washington e Pequim.\n\nO presidente-executivo Jensen Huang espera obter permissão para reiniciar a venda de chips da Nvidia para a China, depois de fechar um acordo com o presidente dos EUA, Donald Trump, para pagar comissões ao governo dos EUA. No entanto, sem regras formais em vigor nos EUA e com dúvidas sobre se os reguladores chineses irão desencorajar a compra de chips da Nvidia, a empresa líder no mercado de inteligência artificial excluiu as vendas potenciais para a China da previsão para o trimestre atual.\n\nCom isso, restou apenas uma perspectiva pouco animadora que, embora ainda seja enorme em termos absolutos em dólares e ligeiramente acima das estimativas dos analistas, decepcionou os investidores acostumados a resultados expressivos e fez com que as ações caíssem 3,2% nas negociações após o fechamento do pregão. A queda das ações cortou cerca de US$110 bilhões da capitalização de mercado de US$4,4 trilhões da Nvidia.\n\n\"O maior gargalo da Nvidia não é o silício, é a diplomacia\", disse Michael Ashley Schulman, diretor de investimentos da Running Point Capital.\n\nA fabricante de chips espera uma receita de US$54 bilhões, mais ou menos 2%, no terceiro trimestre, em comparação com a estimativa média dos analistas de US$53,14 bilhões, de acordo com dados compilados pela LSEG.\n\nA Nvidia também disse que não incluiu nenhuma remessa de chips H20 para a China em suas estimativas, apesar de ter recebido no início deste mês algumas licenças para vendê-los. Se as questões geopolíticas diminuírem e a empresa receber mais pedidos, a Nvidia disse que poderia adicionar de US$2 bilhões a US$5 bilhões em receita de chips H20 no terceiro trimestre.\n\nEmbora a previsão da Nvidia tenha sido um pouco mais moderada do que o esperado, quaisquer vendas para a China no próximo trimestre seriam adicionadas à perspectiva, disse Ben Bajarin, presidente-executivo da empresa de consultoria em tecnologia Creative Strategies.\n\nAinda assim, a demanda aumentou para os chips avançados da Nvidia que podem processar rapidamente as grandes quantidades de dados usados por aplicativos de IA generativa, à medida que as empresas correm umas contra as outras para dominar a nova tecnologia.\n\nA Nvidia também disse que havia autorizado um adicional de US$60 bilhões em recompras de ações.\n\n(Reportagem de Arsheeya Bajwa em Bengaluru; Max A. Cherney e Stephen Nellis em San Francisco e Suzanne McGee em Providence, Rhode Island)\n\n((Tradução Redação Barcelona))\n\nREUTERS MS",
  "medium": "Article",
  "links": [
    "https://www.reuters.com/markets/companies/NVDA.O",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nvidia chips",
      "weight": 0.11418748
    },
    {
      "name": "advanced Nvidia chips",
      "weight": 0.10884047
    },
    {
      "name": "Nvidia",
      "weight": 0.09633579
    },
    {
      "name": "H20 chips",
      "weight": 0.081422426
    },
    {
      "name": "China",
      "weight": 0.078965195
    },
    {
      "name": "US President Donald Trump",
      "weight": 0.07204508
    },
    {
      "name": "analysts estimates",
      "weight": 0.06882035
    },
    {
      "name": "US",
      "weight": 0.064235754
    },
    {
      "name": "next quarter",
      "weight": 0.061328832
    },
    {
      "name": "Max A. Cherney",
      "weight": 0.061277285
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Technology News",
      "score": 0.9248046875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.919921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.53662109375
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.41552734375
    }
  ],
  "sentiment": {
    "positive": 0.06305191,
    "negative": 0.7726435,
    "neutral": 0.1643046
  },
  "summary": "",
  "shortSummary": "",
  "translation": "27 Aug (Reuters) - Nvidia's actions (NVDA.O) fell on Wednesday, as the destination of their businesses in China was uncertain, involved in the Washington and Beijing trade war.\n\nCEO Jensen Huang hopes to obtain permission to restart Nvidia's chip to sell to China after closing an agreement with US President Donald Trump to pay commissions to the US government. However, without formal rules in force in the US and with doubt whether Chinese regulators will discourage the purchase of Nvidia chips, the leading company in the artificial intelligence market has excluded potential sales to China from forecasting for the current quarter.\n\nAs a result, there was only a little encouraging perspective that, although still absolute in dollars and slightly above analysts estimates, disappointed investors accustomed to significant results and caused the shares to fall 3.2% in negotiations after the close of the trading session. The drop in shares cut about $ 110 billion from Nvidia's US $ 4.4 trillion market capitalization.\n\n\"Nvidia's biggest bottleneck is not silicon, it's diplomacy,\" said Michael Ashley Schulman, director of investment at Running Point Capital.\n\nThe chip manufacturer expects a revenue of $ 54 billion, about 2%, in the third quarter, compared to the average estimate of $ 53.14 billion analysts, according to data compiled by LSEG.\n\nNvidia also said it did not include any H20 chip shipments to China in its estimates, although it received some licenses earlier this month to sell them. If geopolitical issues decrease and the company receive more orders, Nvidia said it could add from $ 2 billion to $ 5 billion in revenue of H20 chips in the third quarter.\n\nAlthough Nvidia's forecast was a little more moderate than expected, any sales to China next quarter would be added to the perspective, said Ben Bajarin, chief executive of the technology consulting firm Creative Strategies.\n\nStill, demand has increased to advanced Nvidia chips that can rapidly process large amounts of data used by Generative AI applications as companies run against each other to master the new technology.\n\nNvidia also said it had authorized an additional $ 60 billion in stock repurchase.\n\n(Report by Arsheeya Bajwa in Bengaluru; Max A. Cherney and Stephen Nellis in San Francisco and Suzanne McGee in Providence, Rhode Island)\n\n((Barcelona Writing Translation))\n\nReuters MS",
  "translatedTitle": "Nvidia continues to grow, but uncertainty in China hinders perspectives",
  "translatedDescription": "Nvidia's actions fell on Wednesday as the destination of her business in China was uncertain, involved in the Washington and Beijing trade war.",
  "translatedSummary": "Nvidia's shares fell due to uncertainty over the future of their businesses in China due to the ongoing Washington and Beijing trade war. The company's CEO, Jensen Huang, hopes to obtain permission to restart selling its chip to China after securing an agreement with US President Donald Trump to pay commissions to the US government. However, without formal rules in place in the US and uncertainty over Chinese regulators' approval, Nvidia has excluded potential sales to China from its current forecast for the current quarter. Despite this, the company expects a revenue of $ 54 billion, about 2%, in the third quarter, compared to the average estimate of $ 53.14 billion analysts. The drop in shares led to a 3.2% drop in the shares, cutting about $ 110 billion from Nvidia's $ 4.4 trillion market capitalization.",
  "reprint": false,
  "reprintGroupId": "8641ee34945e4a21b8cd348203767d1d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "Nvidia shares fell 3.2% as uncertainty over China sales weighed on the company’s outlook. CEO Jensen Huang hopes to resume chip sales to China after a deal with President Trump, but U.S. and Chinese regulators have yet to formalize rules, so Nvidia excluded potential China revenue from its Q3 guidance. The company still expects about $54 billion in Q3 revenue, slightly above analysts’ $53.1 billion estimate, and could add $2–5 billion if China sales resume. Nvidia also announced a $60 billion share‑repurchase program.",
  "argos_id": "DRW2E1P5J"
}