{
  "url": "https://www.gamesradar.com/entertainment/drama-shows/the-last-of-us-star-bella-ramsey-fires-back-at-season-2s-critics-you-dont-have-to-watch-it/",
  "authorsByline": "Bradley Russell",
  "articleId": "eb76bc9cfc2242299342fa893a9dff5e",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/Qq7hr8GukEaf8eAGc5iSx3-1280-80.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T09:49:34+00:00",
  "addDate": "2025-08-28T09:56:10.396858+00:00",
  "refreshDate": "2025-08-28T09:56:10.396860+00:00",
  "score": 1.0,
  "title": "The Last of Us star Bella Ramsey fires back at season 2's critics: \"You don't have to watch it\"",
  "description": "The Ellie actor speaks out against The Last of Us criticism",
  "content": "The Last of Us star Bella Ramsey has responded to some of the second season's most vocal critics.\n\n\"I try to steer clear as much as I [can], to be honest,\" Ramsey told The Awardist podcast of the vociferous response to parts of The Last of Us season 2.\n\n\"You don't have to watch it. If you hate it that much, the game exists. You can just play the game again. If you do want to watch it, hope you enjoy it.\"\n\nCo-creator Craig Mazin is riding solo on The Last of Us season 3 after the departures of both co-creator Neil Druckmann and producer/writer Halley Gross to focus on future Naughty Dog projects. On The Awardist, Ramsey also added that Druckmann will be \"greatly missed.\"\n\n\"It’s been a creative dream to work with Neil and bring an adaptation of his brilliant work to life on HBO. I couldn’t have asked for a more generous creative partner,\" Mazin said in a statement.\n\nMazin – who previously gave an update on writing the third season in an interview with GamesRadar+ – has now seemingly cracked the season length. In short, it will be longer than the second season's seven episodes.\n\n\"I will say that season 3 will be longer than season 2. Season 3 will be more on par with season 1. More bang for the buck,\" Mazin told The Hollywood Reporter.\n\nHBO TV chief Casey Bloys has also suggested that The Last of Us could wrap up its story with either two more seasons or \"one long season.\"\n\nFor more, jump into our guide to the new TV shows coming your way in 2025 and beyond. Then, discover all the upcoming PS5 games on the horizon – including Naughty Dog's Intergalactic: The Heretic Project.",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/entertainment/drama-shows/the-last-of-us-season-3-may-or-may-not-be-the-end-as-the-horror-show-could-wrap-up-with-two-more-seasons-or-one-more-long-season-says-hbo-boss/",
    "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-season-3-release-date-plot-cast-news/",
    "https://www.gamesradar.com/upcoming-ps5-games/",
    "https://open.spotify.com/episode/6pdBtYGyS44Tvv0Xy46HXn?si=GFjFHzagTEyemekWd6-kYQ&context=spotify%3Ashow%3A5LNWH6XcLLGLMDbFQDoh1O&nd=1&dlsi=e2b98ddb78a64df8",
    "https://www.hollywoodreporter.com/tv/tv-features/last-of-us-showrunner-craig-mazin-writing-directing-season-3-1236342633/",
    "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-showrunner-craig-mazin-says-season-3-will-be-longer-than-season-2-but-will-be-more-on-par-with-season-1-more-bang-for-your-buck/",
    "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-showrunner-craig-mazin-shares-statement-after-creator-neil-druckmann-steps-away-from-the-hbo-series-promises-to-deliver-the-show-our-audience-has-come-to-expect/",
    "https://www.gamesradar.com/entertainment/drama-shows/the-last-of-us-co-creator-hasnt-started-writing-season-3-but-is-champing-at-the-bit-to-get-back-to-the-keyboard/",
    "https://www.gamesradar.com/new-tv-shows/",
    "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-tv-show-creator-confirms-kaitlyn-devers-abby-will-lead-season-3-i-was-sure-hbo-wouldnt-let-us-do-this/",
    "https://www.gamesradar.com/tag/naughty-dog/",
    "https://www.gamesradar.com/games/adventure/intergalactic-the-heretic-prophet-guide/",
    "https://www.gamesradar.com/games/action/naughty-dog-boss-neil-druckmann-is-leaving-hbos-the-last-of-us-season-3-to-turn-his-complete-focus-to-intergalactic-the-heretic-prophet-and-the-studios-future-projects/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Season",
      "weight": 0.11424293
    },
    {
      "name": "season",
      "weight": 0.11424293
    },
    {
      "name": "Co-creator Craig Mazin",
      "weight": 0.098591834
    },
    {
      "name": "Bella Ramsey",
      "weight": 0.09190109
    },
    {
      "name": "future Naughty Dog projects",
      "weight": 0.08896733
    },
    {
      "name": "Naughty Dog",
      "weight": 0.08711835
    },
    {
      "name": "Craig Mazin",
      "weight": 0.08680273
    },
    {
      "name": "Mazin",
      "weight": 0.08106171
    },
    {
      "name": "Neil Druckmann",
      "weight": 0.08073254
    },
    {
      "name": "Us",
      "weight": 0.08049707
    }
  ],
  "topics": [
    {
      "name": "TV"
    },
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.986328125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.931640625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.91943359375
    }
  ],
  "sentiment": {
    "positive": 0.15376592,
    "negative": 0.44190526,
    "neutral": 0.40432876
  },
  "summary": "The Last of Us star Bella Ramsey has defended the second season's critics, stating that \"you don't have to watch it.\" Co-creator Craig Mazin is currently working on season 3 after the departure of Neil Druckmann and Halley Gross to focus on future Naughty Dog projects. Despite this, Ramsey expressed her wish for viewers to enjoy the game and said that it was a creative dream to work with Druckman and to bring an adaptation of his work to life on HBO. HBO TV chief Casey Bloys has suggested that The Last Of Us could end with either two more seasons or \"one long season.\"",
  "shortSummary": "Bella Ramsey defends The Last of Us season 2, emphasizing that if you hate it, \"you can play the game again.\"",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5a00918c30db40c08b32aabdef475973",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/games/action/naughty-dog-boss-neil-druckmann-is-leaving-hbos-the-last-of-us-season-3-to-turn-his-complete-focus-to-intergalactic-the-heretic-prophet-and-the-studios-future-projects/",
      "text": "Naughty Dog boss Neil Druckmann is leaving HBO's The Last of Us season 3 to turn his \"complete focus\" to Intergalactic: The Heretic Prophet and the studio's \"future projects\"\n\"Now is the right time for me to transition my complete focus to Naughty Dog and its future projects\"\nNeil Druckmann, the studio head of The Last of Us developer Naughty Dog, has announced he's stepping down on his leadership role in the game's HBO adaptation. Instead, he's pointing his \"complete focus\" toward Intergalactic: The Heretic Prophet and other video game projects.\nThis leaves Craig Mazin as The Last of Us TV show's sole showrunner. Mazin told GamesRadar+ in April that he hadn't begun writing The Last of Us season 3, suggesting the next season of the show will play out entirely without Druckmann's input.\n\"I've made the difficult decision to step away from my creative involvement in The Last of Us on HBO,\" Druckmann said in a message shared to social media. \"With work completed on season 2 and before any meaningful work starts on season 3, now is the right time for me to transition my complete focus to Naughty Dog and its future projects, including writing and directing our exciting next game, Intergalactic: The Heretic Prophet, along with my responsibilities as Studio Head and Head of Creative.\"\nCo-running a popular HBO show and directing a AAA video game feels like kinds of things that are difficult to do all at once, though the news is sure to cause speculation given the somewhat tepid response to the recent second season of the show. Details on The Last of Us season 3 are sparse, but the show is expected to run for at least two more seasons.\n\"Co-creating the show has been a career highlight,\" Druckmann concluded. \"It's been an honor to work alongside Craig Mazin to executive produce, direct and write on the last two seasons. I'm deeply thankful for the thoughtful approach and dedication the talented cast and crew took to adapting The Last of Us Part I and the continued adaptation of The Last of Us Part II.\"\nDustin Bailey joined the GamesRadar team as a Staff Writer in May 2022, and is currently based in Missouri. He's been covering games (with occasional dalliances in the worlds of anime and pro wrestling) since 2015, first as a freelancer, then as a news writer at PCGamesN for nearly five years. His love for games was sparked somewhere between Metal Gear Solid 2 and Knights of the Old Republic, and these days you can usually find him splitting his entertainment time between retro gaming, the latest big action-adventure title, or a long haul in American Truck Simulator.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/adventure/intergalactic-the-heretic-prophet-guide/",
      "text": "Intergalactic: The Heretic Prophet – Everything we know about the new Naughty Dog game\nAll the latest Intergalactic news and updates from the developer of The Last of Us\nIntergalactic: The Prophet is a new sci-fi action- adventure game from The Last of Us developer, Naughty Dog. Officially revealed during the Game Award 2024 showcase, which introduced us to protagonist bounty hunter, Jordan A Mun (played by Tati Gabrielle, who starred as Nora in The Last of Us season 2), the new IP promises to bring us the studios \"wildest, most creative story\" and \"deepest gameplay\" yet.\nFollowing the initial reveal trailer, we've gotten to learn a little more about the project, and as it's coming from a studio that's behind some of the best game stories around, it's already shaping up to be one of the most intriguing and exciting new games in the pipeline.\nCurrently set to arrive as a PlayStation exclusive and in development since 2020, we've brought together everything we know about this upcoming PS5 game, from details about the cast, to interviews with studio lead Neil Druckmann, and more. So, read on below to find an overview on all things Intergalactic: The Heretic Prophet.\nIntergalactic: The Heretic Prophet release date is unknown\nNeither Naughty Dog nor PlayStation Studios has revealed the Intergalactic: The Heretic Prophet release date or release window. That's likely because it is years away from production.\nThe studio has confirmed that development started on Intergalactic back in 2020. While it is true that the team typically takes around four years between projects, it's likely that the COVID-19 pandemic has created an elongated production pipeline, which is likely one reason we've seen so many remasters and remakes from the studio of late. Don't expect Intergalactic: The Heretic Prophet to be a new game for 2025.\nIntergalactic: The Heretic Prophet platforms\nIntergalactic: The Heretic Prophet is coming to PS5. Developer Naughty Dog is part of the PlayStation Studios group who sets its sights on building expansive PS5 exclusives.\nWhile it is true that select PlayStation titles have come to PC (including Naughty Dog's most recent releases and remasters of The Last of Us Part 1 and Part 2), they typically arrive years after making their debut on PlayStation platforms. There was no mention of it just yet.\nWeekly digests, tales from the communities you love, and more\nStill, you should also expect some pretty sweet PS5 Pro support, given that Naughty Dog is typically a brand leader for benchmark-setting at Sony Interactive Entertainment.\nIntergalactic: The Heretic Prophet trailer\nThe Intergalactic: The Heretic Prophet trailer runs for four minutes and 33 seconds, and truly sets the scene for the upcoming IP. The teaser opens with an alien language from the planet Sempiria that is translated to reveal the harrowing words: \"The suffering of generations must be endured to achieve our divine end,\" talk about ominous.\nThe trailer then cuts to our protagonist, the bounty hunter Jordan's ship. It turns out that Jordan is on her way to that planet we mentioned earlier, Sempiria, and that said planet also has rumors and dark stories surrounding it. The clip above is stunning, showing us realistic visuals of machinery and beautiful shots of space. It also even gives us a quick look at Jordan facing a robot boss with a great red sword as well.\nEverything about the new game looks phenomenal, and we can't wait to see more gameplay reveals and teasers as we head further into 2025.\nIntergalactic: The Heretic Prophet gameplay\nNaughty Dog is yet to go into detail on the Intergalactic: The Heretic Prophet gameplay experience, so all we really have is word from studio head Neil Druckmann. He says that Intergalactic: The Heretic Prophet \"is shaping up to be our wildest, most creative story yet,\" teasing that the third-person adventure will be set on the planet of Sempiria – \"a distant planet whose communication with the outside universe went dark hundreds of years ago. In fact, anyone who's flown to it hoping to unravel its mysterious past was never heard from again.\"\nHe went on to say that Intergalactic will contain \"the deepest gameplay in Naughty Dog's history, taking our learnings from our previous franchises and pushing them beyond anything we've ever done before.\"\nBen Hanson, formerly of Game Informer, also teased that the upcoming game will be focused on the concept of \"player freedom\" during a MinnMax video about Intergalactic. Elden Ring is supposedly a massive inspiration for that concept when it comes to this game, too. This is seemingly backed by a 2023 interview with Druckmann (via journalist Gene Park).\n\"Some of the best storytelling is in gameplay and moving around the space and understanding a history of the space by just looking at it and examining it. To me, that's some of the best joy I get out of games that trust their audience to figure things out. That's the stuff I'm really intrigued by going forward,\" Druckman explains regarding his thoughts on Elden Ring.\nNow, we aren't saying that Intergalactic: The Heretic Prophet will be an Elden Ring clone. However, it's interesting to know that it's gameplay may be inspired by FromSoftware's mechanics involving interacting with environments and how the games' history is communicated to players.\nIntergalactic: The Heretic Prophet story\nNaughty Dog is keeping the Intergalactic: The Heretic Prophet story under wraps, but there is some information that we've been able to glean by studying that stunning reveal trailer. The game is set to introduce a new protagonist, Jordan A. Mun, a bounty hunter who finds themselves stranded on Sempiria – a dangerous planet that claims the lives of all who enter its orbit.\nDrawing on the stranded aspect, Druckmann says Intergalactic Heretic Prophet will not only explore faith and religion, but it will also be about being lonely as you find yourself isolated on the planet.\n\"I really wanted to make a game about faith and religion,\" Druckmann says, \"but also about just being lonely. So many of the previous games we've done – there's always, like, an ally, with you. I really want you to be lost in a place where you're really confused about what happened here.\"\nJordan is heading to the surface to claim a bounty on Colin Graves, a member of a notorious intergalactic criminal outfit called the Five Aces who terrorized the Bluestar Systems before mysteriously disappearing. It's clear from the reveal that Jordan is hunting these MIA criminals, but whether it's to lay claim to the missing loot or for more personal reasons remains to be seen.\nIntergalactic: The Heretic Prophet cast\nSome of the Intergalactic: The Heretic Prophet cast have been revealed so far, but a few roles still remain a mystery.\nThe title role of protagonist Jordan A. Mun is played by Tati Gabrielle, who appeared in the first season of The Last of Us as Nora Harris, and played a part in the Uncharted movie adaptation as Jo Braddock.\nTony Dolton, who Neil Druckmann said he \"immediately\" cast for a role in the upcoming sci-fi adventure following his appearance in the Last of Us tv show, is also set to appear, but we don't yet know what role he'll be playing.\nWe also know that prolific actor Troy Baker (who's had parts in the Last of Us game as Joel as well as Death Stranding and the follow-up Death Stranding 2) is also attached to the project, but we likewise are still awaiting more information about his part.\nEternals actor Kumail Nanjiani is also set to play the role of Colin Graves, who's a member of an intergalactic criminal outfit.\nIntergalactic: The Heretic Prophet development\nIntergalactic: The Heretic Prophet is in development at Naughty Dog, the studio responsible for some of the best PS5 games (and The Last of Us and Uncharted franchises). Studio head and game director Neil Druckmann says that the team has \"been working on this brand-new adventure since 2020\", meaning that development will have commenced as production on The Last of Us 2 concluded.\nGiven the success of the HBO Last of Us adaptation, there had been some speculation that Naughty Dog would dive straight back into that world for its next project. Still, it's great to see the studio shift gears into a new IP – its first since it unleashed Joel and Ellie on an unsuspecting world a decade ago.\nHowever, it's also worth noting that the development on the game is taking time, and is still in the early stages, as ideas are still being formed and changed. In fact, Neil Druckmann recently revealed during an episode of Sony's Creator to Creator video series that the team\" still have a ways to go.\"\n\"Again, these things are so complex and big, and there's so many people involved. It's like, I still don't know exactly what this thing is going to look like at the end,\" he continued. \"I have a theory, I have an idea, but it's still evolving and changing as we're making it.\"\nHopefully, we will see progress speed up after the release of HBO's The Last of Us season 2, which comes out on April 13, 2025. Stay tuned for updates!\nWhile we wait for more info on Naughty Dog's new venture, why not dive into one of the best sci-fi games.\nJosh West is the Editor-in-Chief of GamesRadar+. He has over 15 years experience in online and print journalism, and holds a BA (Hons) in Journalism and Feature Writing. Prior to starting his current position, Josh has served as GR+'s Features Editor and Deputy Editor of games™ magazine, and has freelanced for numerous publications including 3D Artist, Edge magazine, iCreate, Metal Hammer, Play, Retro Gamer, and SFX. Additionally, he has appeared on the BBC and ITV to provide expert comment, written for Scholastic books, edited a book for Hachette, and worked as the Assistant Producer of the Future Games Show. In his spare time, Josh likes to play bass guitar and video games. Years ago, he was in a few movies and TV shows that you've definitely seen but will never be able to spot him in.\n- Emma-Jane BettsManaging Editor, Evergreens\n- Heather WaldSenior staff writer\n- Jasmine Gould-WilsonStaff Writer, GamesRadar+\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/upcoming-ps5-games/",
      "text": "Upcoming PS5 games: New PS5 games for 2025 and beyond\nWith so many upcoming PS5 games to keep track of in August and beyond, this list does the remembering for you\nThere are so many upcoming PS5 games headed our way, with some big releases fast approaching as we make our way through August. Not only do we have the likes of a Metal Gear Solid 3 remake, to a newly released remaster of the original Gears of War, which is on Sony's console for the first time, but there's also been a slew of new announcements from Gamescom Opening Night Live 2025 to mark our calendars with as well.\nFrom Resident Evil 9 to Silksong, the Gamescom 2025 schedule is also just the cherry on top of a great year filled with exciting new games and shiny PS5 exclusives. We've still got the highly anticipated sequel to Ghost of Tsushima on the way, tons of big third-party games that are set to land on the console, and some exciting upcoming indie games. In short, there's sure to be something here for you to add to your wishlist, and hopefully, this guide will keep you on track with all your future purchases.\nBelow, you'll find a helpful roundup of all of the biggest upcoming PS5 games on the way in release date order, along with future games that have launch windows. We keep this page regularly updated, so be sure to bookmark it and check in regularly as well!\nUpcoming PS5 games to watch out for\n2025\nMetal Gear Solid 3: Snake Eater Remake\nDeveloper: In-house\nPublisher: Konami\nRelease date: August 28, 2025\nIt's been almost 20 years since the release of Metal Gear Solid 3: Snake Eater and its legend has only spiraled out of control in that time. Thankfully, Konami is working to introduce one of the best PS2 games to a whole new generation of players with a Metal Gear Solid 3 remake for PS5. While we're yet to get any concrete details apart from trailers on the expected changes or a look at any real-time gameplay, we are keen to see what steps Konami will take to modernize this exceptionally important (and extraordinary) stealth-action game.\nShinobi: Art of Vengeance\nDeveloper: SEGA\nPublisher: SEGA\nRelease date: August 28, 2025\nOne of the most surprising and exciting new PS5 games announced during the February State of Play showcase was the upcoming 2D action platformer, Shinobi: Art of Vengeance. Created by the team behind Streets of Rage 4, Shinobi: Art of Vengeance is packed with style. From the clips and trailers we've seen so far, there's stunning art, and snappy gameplay, that every Hollow Knight fan will enjoy. You'll get to play the role of the ninja Shinobi Joe Musashi who, after finding is home destroyed, embarks on a quest for vengeance. With multiple environments and puzzles to solve along the way, Shinobi: Art of Vengeance has plenty to offer to keep you busy this August.\nWeekly digests, tales from the communities you love, and more\nLost Soul Aside\nDeveloper: Ultizero Games\nPublisher: Sony\nRelease date: August 29, 2025\nLost Soul Aside is a new, original action RPG from Shanghai-based studio Ultizero that sees you take on the role of protagonist Kaser as he sets out to find his sister, whose soul has been taken by beings known as the Voidrax. With big bosses to face and plenty of enemies to tackle with its action-oriented combat system complete with combos, Lost Soul Aside promises to test your reflexes!\nHirogami\nDeveloper: Bandai Namco Studios Singapore\nPublisher: Bandai Namco Entertainment\nRelease date: September 3, 2025\nHirogami is a stunning new PS5 game on the way in 2025, and it's one of the most unique and strangely peaceful adventure experiences yet. Exploring a vast, paper-folded world as protagonist Hiro, you'll be able to turn into various new creations – like foxes or frogs, for example – to help navigate your surroundings. Hirogami looks bursting with colorful vistas, intricate traversal puzzles, and plenty of hostile enemies as Hiro fights back against \"deadly digital invaders\", according to the game's Steam page, and we only have to wait a few months for its September release.\nDemonschool\nDeveloper: Necrosoft Games\nPublisher: Ysbryd Games\nRelease date: September 3, 2025\nDemonschool is an upcoming RPG that has the makings to be a breakout success when it releases in September. In this game, you play as Fay, who must battle through school life as well as slay monsters, once a nightmarish alternate reality keeps seeping into her own. From clips and teasers, this new PS5 game looks very stylish, combining turn-based combat mechanics with some quirky characters to drive its narrative.\nHollow Knight: Silksong\nDeveloper: Team Cherry\nPublisher: Team Cherry\nRelease date: September 4, 2025\nIt's been a long time coming, but Hollow Knight: Silksong is finally heading to the PS5 this year. In the sequel to one of the best metroidvania games ever made, you'll take on the role of Hornet, the princess-protector of Hallownest. Platform your way through a stunning cartoon world as you dodge attacks and slay enemies along the way. We've had a chance to play the game already in our Silksong hands-on during Gamescom 2025, and trust us, it was worth waiting for!\nHell is Us\nDeveloper: Rogue Factor\nPublisher: Nacon\nRelease date: September 4, 2025\nHell is Us is an upcoming adventure game set in a war torn country that also happens to be packed with supernatural creatures. Exploration is at the heart of the new PS5 game, but there is also plenty of combat on offer to keep action fans entertained as well. We're super intrigued about the world on display in Hell is Us. It looks pretty original, and we are curious about the underlying story behind the setting, and faceless white monsters. Hopefully, we hear more news on Hell is Us soon!\nEverybody's Golf: Hot Shots\nDeveloper: HYDE, Inc.\nPublisher: Bandai Namco Entertainment Inc.\nRelease date: September 4, 2025\nGolfing makes for some of the best sports games around, so of course, we are excited about Everybody's Golf: Hot Shots. Aim, time your shots right, and watch as golf balls fly after your club hits them with a satisfying \"clunk\". This upcoming PS5 game is also one that offers both solo and multiplayer options, allowing up to four players on local co-op as well as online options. Personally, we're intrigued about the Challenge Mode feature, where you’ll work through the ranks and face off during different rounds.\nCronos: The New Dawn\nDeveloper: Bloober Team\nPublisher: Bloober Team SA\nRelease date: September 5, 2025\nCronos: The New Dawn is an upcoming horror game that will be hitting the PS5 sometime in 2025. Revealed during Summer Game Fest 2025, this sci-fi survival horror looks to be what happens if Outlast and Dead Space 2 had a baby as you navigate a terrifying world with mutated \"orphans\" ready to kill you at the drop of a hat. Survive the nightmare, stop more destruction, and put on your big boy pants for this new thrill ride.\nDaemon X Machina: Titanic Scion\nDeveloper: Marvelous Inc.\nPublisher: Marvelous Europe Limited\nRelease date: September 5, 2025\nDaemon X Machina was first released back in 2019, and now, years later, we are finally getting a sequel with the upcoming PS5 game, Daemon X Machina: Titanic Scion. In a sci-fi world gripped by war, it's up to you and your customized Arsenal to blast and destroy everyone in your way. With mechs for days and plenty of explosions in the trailer for Daemon X Machina: Titanic Scion, this new PS5 game seems to be a must-play for any anime and action fans. Hopefully, we will learn more details closer to its September release date as well!\nBorderlands 4\nDeveloper: Gearbox Software\nPublisher: 2K Games\nRelease date: September 12, 2025\nGamescom 2024 shocked the world when it announced that Borderlands 4 is on its way. That's right, we are getting another sci-fi looter shooter, and we couldn't be happier. The upcoming game will see us exploring new alien worlds, as we say goodbye to Pandora for now. With new lands to uncover, treasure to claim, and enemies to shoot in the head, Borderlands 4 promises to be one of the most exciting new PS5 games heading our way in September 2025.\nLego Voyagers\nDeveloper: Light Brick Studio\nPublisher: Annapurna Interactive\nRelease date: September 15, 2025\nLego Builder's Journey might be one of the best Lego games you didn't play, which is why it's great to see the devs get the chance to build on the concept of puzzley, semi-realistic Lego action. Lego Voyagers centers on two tiny single square bricks – the really narrow ones – with a single eye sticker each. They roll and click around diorama-style areas that have all the sheen you'd expect from real-life Lego bricks. To progress, they'll need to put their heads together to build paths forward, and sometimes literally as they connect to the same objects, and you have to collaborate to get the results you need. It's a great new PS5 game to keep track of!\nTowa and the Guardians of the Sacred Tree\nDeveloper: Brownies inc.\nPublisher: Bandai Namco\nRelease date: September 18, 2025\nLove a good Roguelite? How about one seeped in mythology with an anime art style. In this upcoming PS5 game you play as Towa and the Guardians as you discover different lands and push back against the villain Magatsu's evil influence. The overall goal is to save Shinju Village, and from clips that we've seen already the journey to achieve peace looks stunning. Each guardian also has its own abilities and set of swords, promising some fun combat choices as well as tons of replay ability. This is definitely a sleeper September hit if you ask us.\nDying Light: The Beast\nDeveloper: Techland\nPublisher: Techland\nRelease date: September 19, 2025\nKyle Crane is making a comeback in the new game Dying Light: The Beast. Revealed during Gamescom 2024, this is the first new entry in the iconic horror franchise since 2022's Dying Light 2. It originally started as a DLC for said game before morphing into a standalone title. From the game's trailer, we know that players will control a super-powered Crane (who has been infected with zombie DNA) as he sets out on a quest for revenge. This upcoming horror game, will be heading our way in September!\nBaby Steps\nDeveloper: Gabe Cuzzillo, Maxi Boch, Bennett Foddy\nPublisher: Devolver Digital\nRelease date: September 23, 2025\nIn our Baby Steps preview, we mention how out of all the upcoming PS5 games heading our way this year, this one is probably the title that'll make you break out in a smile. Here you play as 35-year-old Nate, a loser in a sweat-stained onesie, who is tasked with a massive challenge: getting off the couch and stepping outside his home. The new game is a self-described \"walking simulator\" that looks like it'll be both a challenge and hilarious. We can't wait to see more of this one for sure.\nSonic Racing CrossWorlds\nDeveloper: Sega\nPublisher: Sega\nRelease date: September 25, 2025\nSonic Racing CrossWorlds is a new racing game from Sega that is set to let you speed around in a different way. Yes, instead of zipping around as the fast hedgehog, you'll be hitting the roads in the Sonic universe as a roster of different iconic characters. We've only gotten a brief teaser so far, but CrossWorlds promises to \"transport racing fans into a new dimension\".\nSilent Hill f\nDeveloper: NeoBards Entertainment Ltd.\nPublisher: Konami\nRelease date: September 25, 2025\nThe first Silent Hill game that isn't set in the US, Silent Hill f, is set to usher in a new dawn for Konami's iconic horror series. In this upcoming PS5 game, you'll take on the role of Shimizu Hinako (a regular high school girl) who finds her hometown covered in a mysterious fog. Soon, your surroundings will turn into the stuff of nightmares, and you'll have to face monsters lurking in the shadows. Silent Hill f looks fantastic, from what we've seen already, and is one of the most exciting games on the docket for horror fans for sure!\nEA Sports FC 26\nDeveloper: EA Canada\nPublisher: EA\nRelease date: September 26, 2025\nWhen we talk about the contenders for the best sports game of 2025, EA Sports FC 26 is high on the list. Not only is it the latest outing in EA's football franchise, but it's also coming with many improvements to the formula that fans know and love. Build your dream squad for new Live Events and Tournament modes or dive into the newly revamped Manager Career. The game is set to launch in September, and we'll be grabbing a copy as soon as we can.\nPac-Man World 2 Re-Pac\nDeveloper: NOW PRODUCTION Co., Ltd.\nPublisher: Bandai Namco\nRelease date: September 26, 2025\nA remake of the classic 2002 game, Pac-Man World 2, is coming to the PS5 this September. So get ready to step into a colourful 3D adventure as the iconic character! Pacland is in danger after those pesky ghosts have stolen the golden fruit, and it's up to our yellow circle-faced hero to retrieve them and save the day. Platform, explore, and meet a variety of cute characters on the way. The game was announced during a recent Nintendo Direct live stream and looks gorgeous. Definitely one to keep\nNBA BOUNCE\nDeveloper: Outright Games\nPublisher: Outright Games\nRelease date: September 26, 2025\nOn the same day that we are getting EA Sports FC 26, a very cute-looking new basketball game is also heading to the PS5 for fans who prefer the court over the pitch. In this upcoming PS5 game, you'll get to choose from 30 NBA teams and win in order to go from rookie to pro. Unlock special jerseys, sneakers, and more, and grab a buddy if you want to experience the new game's co-op features as well.\nFinal Fantasy Tactics: The Ivalice Chronicles\nDeveloper: Creative Studio III\nPublisher: Square Enix\nRelease date: September 30, 2025\nWhat's a JRPG without a tactical off-shoot? Final Fantasy Tactics: The Ivalice Chronicles is coming to PS5 later in 2025, offering both the 1997 classic and a refreshed Enhanced version. Those who opt for the shiny new edition will enjoy a litany of modern touches to optimize the experience, from improved graphics to fully-voiced gameplay and more, while the classic one stays true to its late-90s roots. Pre-orders are available right now, meaning it's the perfect time for FF fans to plan ahead this summer.\nLego Party\nDeveloper: SMG Studio\nPublisher: Fictions\nRelease date: September 30, 2025\nWe love a good party game, so seeing an upcoming Lego title that let's you and three other friends play a bunch of fun and colorful mini games sounds right up our street. In Lego Party you can expect to play a ton of Challenge Zones and 60 minigames as you try to gather as many golden bricks as you can. Each level also looks to be packed with funny easter eggs and that classic Lego humor. So, if you wanted a Mario Party experience that is available across all platforms, then this is the game for you.\nGhost of Yotei\nDeveloper: Sucker Punch\nPublisher: Sony\nRelease date: October 2, 2025\nThat's right, we are finally getting a Ghost of Tsushima 2 with the upcoming PS5 game Ghost of Yotei. Set over 300 years after the events of Ghost of Tsushima in 1603, the new title will see a fresh protagonist taking the spotlight as we set out to explore a brand new region of Japan. Thanks to a recent trailer, we now know that the game is launching in early October and that it will be a PS5 exclusive – sorry to all you PC players!\nDigimon Story Time Stranger\nDeveloper: Media. Vision Inc.\nPublisher: Bandai Namco\nRelease date: October 3, 2025\nIf you're getting restless waiting for a new Pokemon game from Nintendo, then Digimon Story Time Stranger is here to help. The upcoming PS5 game is the latest entry in the classic monster-taming series and will throw you into a story that spans the human world and the Digital World. You'll have to engage in turn-based combat and complete quests to uncover the mysteries of the world's collapse here. While we don't have a solid release date for Digimon Story Time Stranger just yet, we do know that it will be heading our way sometime this year.\nBattlefield 6\nDeveloper: Battlefield Studios\nPublisher: EA\nRelease date: October 10, 2025\nIt's been years of waiting, but we are getting the official follow-up to Battlefield 5 later this year! That means if you are a fan of the best FPS games, your time has come. We recently got a Battlefield 6 release date that confirms the previous leaks online, suggesting that it could be launching on October 10. That means it's only weeks away, folks!\nDreams of Another\nDeveloper: Q-Games Ltd.\nPublisher: Q-Games Ltd.\nRelease date: October 10, 2025\nIf we could describe Dream of Another in one word it would be \"trippy\". In this upcoming PS5 game you'll follow the Man in Pajamas and the Wandering Soldier as you explore their imagination. It's a third person shooter where you're bullets not only destroy but they also create as you piece together stories in a strange world. Dreams of Another looks to be one of the most unique games coming out this year and we're very intrigued to see what the story is.\nLittle Nightmares 3\nDeveloper: Supermassive Games\nPublisher: Bandai Namco\nRelease date: October 10, 2025\nLittle Nightmares 3 is heading our way just in time for the spooky season! Set to release on October 10, this creepy co-op adventure has you and your player-two take on the role of two small children (Low and Alone) as they must platform and puzzle-solve their way out of the nightmarish realm known as The Nowhere. However, much like the previous games in the series, you won't be able to try and explore at your own leisure. There are plenty of threats and monsters who are more than happy to chase you. Be prepared to think and react quickly!\nBall x Pit\nDeveloper: Kenny Sun\nPublisher: Devolver Digital\nRelease date: October 15, 2025\nIf you loved Vampire Survivors, then the upcoming survival roguelike, Ball x Pit, has to be on your radar. In this upcoming PS5 game, you have to fight hordes of enemies with ricocheting balls in order to gather resources that'll assist you in some classic base-building action. Rebuild the fallen Ballbylon, recruit new heroes, and unlock powerful ball combinations as you fight to expand your homestead as well as survive the countless foes hammering away at your doorstep.\nNinja Gaiden 4\nDeveloper: PlatinumGames Inc. / Team NINJA\nPublisher: Xbox Game Studios\nRelease date: October 21, 2025\nAs part of more Xbox games making their way to the PS5, Ninja Gaiden 4 has been announced and will be heading our way in October this year. If you are unfamiliar with the Ninja Gaiden series, these are the games to play if you are after a ninja hack-and-slash experience, and it's been years since we last saw a new game from the universe. In Ninja Gaiden 4, you'll get to play both the legendary Ryu Hayabusa and the new protagonist Yakumo. From what we've seen, the upcoming PS5 game looks bonkers in the best possible way, with tons of environments and enemies to encounter. We may just have one of the best action games of 2025 here, folks!\nJurassic World Evolution 3\nDeveloper: Frontier Developments\nPublisher: Frontier Developments\nRelease date: October 21, 2025\nLife, uh, found a way – at least, found a way to allow you to finally add a litter of dino babies to your park in this latest iteration of the charming-yet-deadly park manager that puts us into the mind of the Hammond-like figures who mucked everything all up thinking 'well maybe it will work for us'. And for the most part, it does! All manner of dinos are available, and yes, unique features can be carried over from generation to generation. Favorite characters also return, including Doctor Ian Malcolm (still portrayed by Jeff Goldblum). Enhancements abound as well, revolving around making dinos act more naturally in their habitats. Honesty, Jurassic World Evolution 3 looks like a hoot!\nVampire: The Masquerade – Bloodlines 2\nDeveloper: The Chinese Room\nPublisher: Paradox Interactive\nRelease date: October 21, 2025\nLooking for a game with a bit of extra bite? Vampire: The Masquerade - Bloodlines 2 puts you in the seedy underbelly of Seattle, which should suit you just fine as a vampire ready to test out your new fangs. Turned as an act of vampire terrorism during the 'Mass Embrace', you'll soon get caught up in vampire faction politics, where you're still just trying to deal with your new way of life. This is an RPG at its core, too, filled with player choices, a strong narrative, and branching dialogue options.\nMoonlighter 2: The Endless Vault\nDeveloper: Digital Sun\nPublisher: 11 bit studios\nRelease date: October 23, 2025\nIf you love cute RPGs then you're probably just as excited as we are that Moonlighter 2: The Endless Vault will be heading to PS5 later this year. The upcoming game is a sequel to the 2018 action role-playing Moonlighter, and sees you having to run your own little shop. However, in order to get things to sell you'll need to brave dangerous levels, weaving in roguelike mechanics to your otherwise cozy RPG life. There are new shops, a new town, and new biomes to explore, making it a perfect game for new and seasoned fans of Moonlight alike to pick up.\nOnce Upon a KATAMARI\nDeveloper: RENGAME\nPublisher: Bandai Namco\nRelease date: October 23, 2025\nOnce Upon a KATAMARI was officially revealed during a recent Nintendo Direct livestream and was also confirmed to be an upcoming PS5 game, much to all our collective glee. This is honestly one of the most anticipated games of October on my personal list. Roll your planet ball through different periods of history, collecting and expanding your rolling sphere with every artefact collected. There's a new soundtrack, four player co-op, and some shiny new customization options too. Basically, it's a winner all around and I'll be unreachable for a few days once it comes out.\nTormented Souls 2\nDeveloper: Dual Effect\nPublisher: PQube\nRelease date: October 23, 2025\nThe first Tormented Souls came out in 2021 and now (after being delayed for a year) its sequel is coming to the PS5. Tormented Souls 2 follows Caroline Walker as she travels to the remote town of Villa Hess and a mysterious clinic in southern Chile in an effort to help her sister Anna. However, things turn out to be pretty sinister and players will be thrown into some tense survival horror gameplay from the jump. We love a good horror game, and Tormented Souls 2 seems to be the perfect title to kick off the Halloween season this year.\nThe Outer Worlds 2\nDeveloper: Obsidian Entertainment\nPublisher: Xbox Game Studios\nRelease date: October 29, 2025\nThe Outer Worlds 2 is set to bring us to Arcadia where we can expect fresh adventures with in a new colony that's said to be home of \"skip drive technology.\" With a debut trailer showing off the same signature sense of humor from the first game, the upcoming sci-fi adventure will once again let us shape our own journey and character, and engage with a new cast of companions who all have their dreams to fulfil - whether or not you want to help them is up to you.\nArc Raiders\nDeveloper: Embark Studios\nPublisher: Embark Studios\nRelease date: October 30, 2025\nIt's been years coming, but Arc Raiders finally has a release date – October 30 – to look forward to. The extraction shooter recently opened its doors for a second test, and has been steadily building momentum since – because, spoiler alert, it seems really good. Arc Raiders is currently the eighth most wishlisted game on Steam, and with just a few months to go until its long-awaited PS5 launch, it really does feel like if anything can crack the highly competitive shooter genre, it's going to be Embark Studios.\nMina The Hollower\nDeveloper: Yacht Club Games\nPublisher: Yacht Club Games\nRelease date: October 31, 2025\nThe developer of Shovel Knight returns with this upcoming PS game, and once again, they can't resist striking the earth! Yet what Shovel Knight did for 2D side-on platformers, Mina the Hollower, centering on a whip-wielding rodent, does for top-down Game Boy-style adventures like The Legend of Zelda: Link's Awakening. Playing with conventions, the gameplay changes up now and then to have some more action-heavy set-pieces. But for the most part, Mina will be questing whip in hand through dungeon environments. The big twist, of course, is her abilities as Hollower – she can burrow into the ground to pop up elsewhere!\nCairn\nDeveloper: The Game Bakers\nPublisher: The Game Bakers\nRelease date: November 5, 2025\nSpeaking of high, climbing adventure, Cairn finally has a release date of November 5. This has been one to watch since The Game Bakers – the developer behind Furi – revealed it last year. When we last caught up with the studio in January, Cairn was described as \"our most challenging production in terms of development complexity,\" – and if you've got an issue with heights, it might be just as tough to play.\nInazuma Eleven: Victory Road\nDeveloper: LEVEL5 Inc.\nPublisher: LEVEL5 Inc.\nRelease date: November 13, 2025\nAlthough this upcoming RPG and sports game was initially scheduled to be with us in August, we're still super excited to get our hands on this one despite the delays. Inazuma Eleven: Victory Road is LEVEL5 Inc.'s next entry to the famed football RPG that will have you taking on the role of a high school student named Destin Billows. Play matches while you also work through a story that looks right of an anime. From trailers, the game looks amazing and seems like it'll make you feel like the star in your very own shonen series.\nCall of Duty: Black Ops 7\nDeveloper: Treyarch / Raven Software\nPublisher: Activision\nRelease date: November 14, 2025\nCall of Duty: Black Ops 7 is set to bring us into the 2035 with cutting-edge, futuristic technology. With a core campaign that will be playable solo or in co-op and a multiplayer experience that will introduce new maps and the return of the Zombie mode, the return of Black Ops looks set to dive in a world affected by conflict and explore psychological warfare following the events of Black Ops 2 and Black Ops 6.\nOctopath Traveler 0\nDeveloper: Square Enix, DOKIDOKI GROOVE WORKS\nPublisher: Square Enix\nRelease date: December 4, 2025\nFans of JRPGs rejoice because we are getting a Octopath Traveler prequel at the end of the year. Octopath Traveler 0 is an upcoming PS5 game that's set years before the first game in the series and will have you playing as your own customizable character instead of a premade one seen in the franchises previous outings. You can choose to recruit a party from a pool of 30 characters and must work to rebuild your home village. The Octopath Traveler 0 looks very charming but we are still waiting for more gameplay details on this one.\nTBC 2025\nCode Violet\nDeveloper: TeamKill Media\nPublisher: TeamKill Media LLC\nRelease date: TBC 2025\nIf you love keeping track of upcoming horror games, then the PS5 exclusive Code Violet has to be on your radar. Scheduled to release sometime this year, Code Violet is a third-person action horror title that follows the story of Violet Sinclair (a woman forced into the 25th Century to take part in expanding the human colony known as Aion) as she works to uncover the mysteries of the Aion Bioengineering Complex. The story is truly an existential nightmare from everything we hear, and personally, we can't wait to see what creatures and terrors await us when this one launches.\nMarathon\nDeveloper: Bungie\nPublisher: SIE\nRelease date: TBC 2025\nA classic shooter is getting more than a fresh lick of paint in Bungie's high-octane remake of Marathon. The announcement trailer seen during the PlayStation Showcase 2023 is peppered with nods to the arcade stylings of the 1994 original, this time in sleek, hyper-pigmented 4K graphics to introduce Marathon to a new generation. And with more gameplay shown since, it's good to see Bungie giving some love to other IPs aside from Destiny 2 and Halo.\nMixtape\nDeveloper: Beethoven and Dinosaur\nPublisher: Annapurna Interactive\nRelease date: TBC 2025\nMixtape looks like the kind of game that makes you all shades of nostalgic. Inspired by coming-of-age movies and set against a backdrop of endless, lazy summers, this upcoming PS5 game has you \"re-living the teenage riot before school's out forever\". It's due out later in 2025, and even without a firm release date, I'm already getting a little bit teary eyed thinking about Annapurna's latest.\nDarwin's Paradox\nDeveloper: ZDT Studios\nPublisher: Konami\nRelease date: TBC 2025\nDarwin's Paradox see's you take on the role of a blue octopus who gets pulled out of the sea and throw into an adventure full of mystery and danger in a questionable food factory. Set to make the most of the DualSense controller, the PS5 launch will feature sound effects from the controller for squeaking rats and alarms, and haptic feedback on the triggers when you're firing out ink. Yes, since the protagonist Darwin is an octopus, you can put all your tentacle skills to good use, from climbing, to cloaking yourself in ink, and more.\nEverywhere\nDeveloper: In-house\nPublisher: Build a Rocket Boy\nRelease date: TBC 2025\nEverywhere is the new upcoming \"multi-world\" game first revealed at Gamescom Opening Night Live. Developed by Build a Rocket Boy with former Rockstar president Leslie Benzie on the project, we got a very early look at the project, which, according to the official site, \"seamlessly blends gameplay, adventure, creativity and discovery in an all-new multi-world gaming experience\", that's claims to redefine \"how players connect with one another and with the digital world around them.\" Since the initial reveal was shrouded in mystery, no platforms were announced, but we assume it's set to come to PS5.\nHela\nDeveloper: Windup\nPublisher: Knights Peak\nRelease date: TBC 2025\nHela is a new 3D adventure from a team of developers that previously brought us Unravel. Set in a beautiful nature world inspired by Scandinavian landscapes, you take on the role of a mouse who's the little familiar of a witch in need of aid. As you set out into the big wide world, you'll gather ingredients and brew magical potions to help her. With puzzles to solve and a beautiful setting to explore, you can go on a journey in split-screen co-op with a pal, or in online multiplayer.\nJudas\nDeveloper: Ghost Story Games\nPublisher: Ghost Story Games\nRelease date: TBC 2025\nBioShock creator Ken Levine has finally revealed his new project - Judas. With seriously strong BioShock vibes, Judas is a single-player narrative title where you must try to escape a disintegrating starship. You must survive by either making or breaking alliances with the other people on the ship, your so-called worst enemies. You're playing as the titular Judas, who is described as \"mysterious and troubled\", and seemingly has powers in her left hand that she can switch out - again very Bioshock in space vibes all round.\nLittle Devil Inside\nDeveloper: Neostream Interactive\nPublisher: Neostream Interactive\nRelease date: TBC 2025\nLittle Devil Inside first began life on Kickstarter back in 2015. Fast forward five years later, and we see a debut trailer during the PS5 reveal stream with the news that it will be a timed exclusive. As an RPG with survival elements, Little Devil Inside is set in the \"Victorian-like\" era in a semi-open world. The trailer showed off a whole host of monsters and also gave us brief glimpses of some of the combat elements and features. It was easily one of the biggest surprises of the recent showcase.\nNo Rest for the Wicked\nDeveloper: Moon Studios\nPublisher: Private Division\nRelease date: TBC 2025\nNo Rest for the Wicked from Ori and the Blind Forest and Will of the Wisps developer Moon Studios is a new action RPG set in the year 841. You take on the role of a Cerim, who's a member of a group of mystical holy warriors with unique powers that have sword to fight back and defeat the Pestilence - a plague that has returned after 1000 years and is now spreading across the lands. The diablo-esque experience features different character builds to play around with, along with an online co-op mode that will allow you to play with up to three friends.\nMortal Kombat Legacy Kollection\nDeveloper: Digital Eclipse\nPublisher: Atari\nRelease date: TBC 2025\nA restoration of Mortal Kombat's earliest days, Mortal Kombat Legacy edition bundles together the fighting game series' launches between 1992 and 2003. That includes the first four Mortal Kombat games along with the GBA's Mortal Kombat Advance, Deadly Alliance, and Tournament Edition. With more games yet to be announced and rollback netcode confirmed (yay!), the fighting game community is eating good this year.\n2026\nHigh on Life 2\nDeveloper: Squanch Games, Inc.\nPublisher: Squanch Games, Inc.\nRelease date: February 13, 2026\nGet ready to laugh as well as get your gun out once again because we finally have a release date for High on Life 2. The first game won fans over with its colorful world and humorous cast of talking guns, and its follow-up was just as personality-filled. From trailers, there are new skateboards, brand new world designs, and plenty of fun-looking single-player gameplay. We'll be keeping an eye on this one for sure.\nResident Evil Requiem\nDeveloper: Capcom\nPublisher: Capcom\nRelease date: February 27, 2026\nAfter not one but two teases at Summer Game Fest 2025, Resident Evil 9 – which finally has a name, Resident Evil Requiem – was revealed at the end of the showcase. While we'll be returning to Raccoon City, it looks thoroughly destroyed from the last time we were there: a giant crater dominates its horizon, while the city's iconic police station lies in ruins. The protagonist seems to be FBI agent Grace Ashcroft, whose past is tied heavily to the Remnant Hotel – perhaps a little too heavily, given we soon see her tied to a gurney and seemingly fighting for her life to escape. But the most exciting news of all is that Resident Evil Requiem will be launching on February 27, 2026, meaning there's not long to wait at all.\nTides of Tomorrow\nDeveloper: DigixArt\nPublisher: Deep Silver\nRelease date: Feb 24, 2026\nThe next game from Road 96 developer DigixArt, Tides of Tomorrow, is a choose-your-own-adventure-style adventure with a twist. Rather than leaving players to deal with their own decisions (see: terrible mistakes), Tides of Tomorrow syncs you up with other players – be they pals or streamers – and changes your story based on who you choose to follow. It's an interesting premise, so anyone looking for something genuinely fresh in the multiplayer scene should keep an eye out for more on this.\nGTA 6\nDeveloper: In-hoise\nPublisher: Rockstar Games\nRelease date: May 26, 2026\nRockstar Games has confirmed that GTA 6 is coming to PS5 in 2025. The new Grand Theft Auto game is going to take us back to Vice City, albeit now in the present day. While the studio is yet to show off any gameplay, we do know that it'll be a crime thriller starring a new protagonist named Lucia – a criminal who is trying rehabilitate after a prison state, and survive the chaos of the sunshine state. Clear your schedules, because GTA 6 is going to be the biggest new game of 2025.\nTBC 2026\nHell Let Loose: Vietnam\nDeveloper: Expression Games\nPublisher: Team17\nRelease date: TBC 2026\nGet ready for shootouts, jungle warfare, and the smell of Napalm in the morning because a new Vietnam War game is coming to the PS5. Hell Let Loose was one of the best tactical first-person shooter games of 2021, so of course, we are buzzing for Hell Let Loose: Vietnam, which is set to release sometime in 2026. Engage in expansive 50v50 player battles, immerse yourself in one of the most interesting conflicts in history, and take in the stunning scenery while you are at it as well. Apocalypse Now is one of my all-time favorite movies, so this new game is definitely calling out to me.\nHalloween: The Game\nDeveloper: IllFonic\nPublisher: IllFonic Publishing\nRelease date: TBC 2026\nOk, so IllFonic has had a few bumps in the past when it comes to horror games (cough, Friday the 13th: The Game, cough), but we are still pretty excited about their take on one of the best slashers of all time. In Halloween: The Game, you'll get to play either as the masked Killer Michael Myers or as the Hero of Haddonfield, depending on the mode you pick. There is a single-player option as well as multiplayer features, so you can choose how you'd best like to experience the events of the iconic 1978 movie. We're curious to see if IllFonic will be able to pull off a Halloween game that stands the test of time. Fingers crossed, we horror hounds won't be disappointed.\nLego Batman: The Legacy of the Dark Knight\nDeveloper: TT Games\nPublisher: Warner Bros. Games\nRelease date: TBC 2026\nAfter the huge success of recent Lego Star Wars, we are getting a new Lego game, this time adapting the iconic DC trilogy, Christopher Nolan's Batman movies. You'll be able to relive all the movies in the trilogy, from Bruce Wayne's first outing to his final hurrah with Bane. Revealed during Gamescom 2025, the trailer for the new game is filled with easter eggs, humour, and for the first time…difficultly modes. Film fans, this is one you won't want to miss. Gotham is also an open-world map (count us in).\nCrimson Desert\nDeveloper: Pearl Abyss\nPublisher: Pearl Abyss\nRelease date: TBC 2026\nFrom the developers of Black Desert Online, Crimson Desert is an upcoming open world game that is packed with medieval action. Set on the war-torn continent of Pywel, players will take on the mercenary Macduff as they explore various settlements, take down massive bosses, and encounter mythical beasts on their journey. All the trailers and teasers that we've seen for Crimson Desert look fantastic, and we can't wait to get our hands on it.\nInZOI\nDeveloper: InZOI Studio\nPublisher: Krafton\nRelease date: TBC 2026\nThe Sims-like life sim InZOI is officially coming to Sony's console in \"the first half of 2026\", but we're still awaiting confirmation on a concrete release date. Originally launching on PC in March 2025, the game is set to be fully optimized for console, with reworked controls for PS5. With realistic graphics brought to life on Unreal Engine 5, InZOI lets you create your own characters and explore your own stories as you also shape the world around them.\nMonster Hunter Stories 3: Twisted Reflection\nDeveloper: Capcom\nPublisher: Capcom\nRelease date: TBC 2026\nFollowing the massive success of Monster Hunter Wilds in early 2025, we are now also getting the next entry in the Monster Hunter Stories series sometime in 2026. Revealed during the July Nintendo Direct livestream, Monster Hunter Stories 3: Twisted Reflection will be taking players on a single player story centred around a kingdom that appears to be caught up in some kind of war. You play as an heir and must explore the world, tame monsters and eliminate all the threats that stand before you.\nThe Adventures of Elliot: The Millennium Tales\nDeveloper: Team Asano\nPublisher: Square Enix\nRelease date: TBC 2026\nIf you want a break from turn-based RPGs but are still after the same art style seen in the likes of Octopath Traveler, Square Enix has a new action RPG on the way with The Adventures of Elliot: The Millennium Tales. The upcoming PS5 game will have you taking on the role of Elliot and his trusty fairy sidekick as you are tasked with exploring a mysterious set of ruins that's been found in the wilds. The combat looks very fun from what we've seen from the trailer already, so we have high hopes that this will be a 2026 standout.\nDirective 8020\nDeveloper: Supermassive Games\nPublisher: Supermassive Games\nRelease date: TBC 2026\nUntil Dawn, The Dark Pictures Anthology, and The Quarry developer Supermassive Games has another horror game in the works. However, this time we'll be flung into a sci-fi nightmare with a story reminiscent of classic horror movies like The Thing and Alien. In this new PS5 game, a crew wakes up from Stasis unexpectedly, only to find that their ship has been invaded by a dangerous alien that can mimic its prey. Like all other Supermassive Games experiences, the main objective is survival here, and we can't wait to see more of the title's gameplay. Originally, the game was set to release in October 2025; however, it's now been pushed to 2026. We're still waiting on a new release date, so keep your eyes peeled on this page!\nThe Blood of Dawnwalker\nDeveloper: Rebel Wolves\nPublisher: Bandai Namco Entertainment\nRelease date: TBC 2026\nDeveloped by Rebel Wolves, a new studio founded by The Witcher 3: Wild Hunt director Konrad Tomaszkiewicz, The Blood of Dawnwalker is a goth gamer's dream. It's a moody vampire RPG where you'll have to race against the clock and the sweet allure of power in order to save your family within the game's 30-day and 30-night timeframe. So far, we've only seen a cinematic trailer and a small glimpse of gameplay for this title, but everything looks fantastic so far. Fingers crossed that we have a new hit on our hands!\nJohn Carpenter's Toxic Commando\nDeveloper: In-house\nPublisher: Saber Interactive\nRelease date: TBC 2026\nIf gunning down zombies in a game co-created by a horror icon sounds like your idea of a party, boy, does John Carpenter's Toxic Commando have a surprise for you. We first caught wind of it at Summer Game Fest 2023, and the announcement trailer is suitably chaotic. From the spray of bullets raining down on legions of the undead to a decidedly out-of-tune rendition of You Give Love a Bad Name underscoring it all, this is one horde FPS game worth keeping an eye on as we await a more concrete release date.\nDenshattack!\nDeveloper: Undercoders\nPublisher: Fireshine Games\nRelease date: TBC 2026\nEver been addicted to Subway Surfers? Well, what if you could control the trains instead of avoid being hit by them? Denshattack! Is an upcoming 3D platformer where you'll have to control a cartoony, gravity-defying train as you race through levels. Face off against rivals, make allies, battle bosses, aim for high scores, and so much more with this wild but wholly unique upcoming indie game.\nPlanet of Lana 2: Children of the Leaf\nDeveloper: Wishfully\nPublisher: Thunderful Publishing\nRelease date: TBC 2026\nWishfully is set to bring us a sequel to its atmospheric cinematic adventure that released back in 2023 (check out our Planet of Lana review for more on that) with Planet of Lana 2: Children of the Leaf. With the planet not saved from strange robots that invaded the world, we'll be reuniting with protagonist Lana and her little cat-like companion Mui as they set out to uncover the world's mysterious past. From venturing through ruins to solving puzzles, and much more, the sequel promises to more challenges and a longer, deeper story.\nMortal Shell 2\nDeveloper: Cold Symmetry\nPublisher: Playstack\nRelease date: TBC 2026\nThe first Mortal Shell was pretty gnarly and goopy, a unique take on the soulslike genre that was all about butting heads with strange foes by using equally as strange powers – including hardening – switching powers to match the threat. Mortal Shell 2 dares to ask: what if things were even more metal? And there were guns? With an introductory metal song by Ben Sahar, performed by Behemoth, this is like they injected Doom straight into the original game, all flames and fury as you tear about the oddest beasts you could imagine.\nBeast of Reincarnation\nDeveloper: Game Freak\nPublisher: Fictions\nRelease date: TBC 2026\nFrom the minds that brought us Pokémon, this new PS5 game will have us chasing a very different kind of monster. In Beast of Reincarnation, you'll play as Emma the Sealer in the year 4026. You must pursue the titular beast, which seems to be causing nature to run rampant in ways that are somewhat destructive. The game was revealed during the Xbox Games Showcase at Summer Game Fest 2025 and looks visually breathtaking. With clashing blades, a wolf companion, and a stunning world to explore, there's a lot to look forward to here.\nCode Vein 2\nDeveloper: Bandai Namco Entertainment\nPublisher: Bandai Namco Entertainment\nRelease date: TBC 2026\nThought Bloodborne was the only soulslike to load up on vampires and weird blood powers? Think again. The underrated Code Vein took a weightier, meatier, and distinctly gothic anime approach to the format. This direct sequel from Bandai Namco dials things up by adding timey elements to the mix, and even more over-the-top powers. Crunchy, weighty attacks that see your main characters transform mid-combat seem to be taking cues from the Scarlet Nexus – their more recent release – so we can expect Code Vein 2 to embrace quicker, more combo-heavy brawls while evolving the unique tone of the original.\nEnd of Abyss\nDeveloper: Section 9\nPublisher: Epic Games\nRelease date: TBC 2026\nSection 9 is bringing a spooky new isometric shooter in 2026. With goopy monsters serving a taste of The Last of Us alongside some creepy-cute animations circa Little Nightmares, End of Abyss looks like a survival horror nightmare with a sci-fi kick. The story is a little hazy at this stage aside from featuring a lot of bullets, gore, and deep space horror, but judging from the reveal trailer, this will be one for the classic survival horror fans to dig their teeth into.\nOnimusha: Way of the Sword\nDeveloper: Capcom\nPublisher: Capcom\nRelease date: TBC 2026\nIt's been years since we've had a brand new Onimusha that isn't a remaster or a VR outing. So, you can imagine our excitement when Onimusha: Way of the Sword was announced during the 2024 Game Awards. Set to release sometime in 2026, Onimusha: Way of the Sword follows the story of a samurai who wields a mysterious artifact known as the Oni Gauntlet. It's up to you to use this strange object to defeat monsters from another world called Genma. The cation will be set in Edo-era Kyoto and promises to sport plenty of dark fantasy elements. So far, the trailer looks incredible. We can't wait to learn more about this one in the future!\nSaros\nDeveloper: Housemarque\nPublisher: Sony Interactive Entertainment\nRelease date: TBC 2026\nReturnal developer Housemarque returns with a new PS5 game, Saros. To clarify, this isn't a sequel to Returnal. However, it does \"build on Returnal's award-winning third-person action,\" according to the game’s creative director, Gregory Louden. From the cinematic trailer that we've seen so far, Saros will follow Arjun Devraj (portrayed by Rahul Kohli), who is forced to relive the last days of a planet he is continuously fighting for his life. The game is set to release sometime in 2026, and to be honest, it looks fantastic. We'll be keeping a close eye on this one, folks!\nStarseeker: Astroneer Expeditions\nDeveloper: System Era Softworks\nPublisher: Devolver Digital\nRelease date: TBC 2026\nOk, let's get this out of the way first, Starseeker: Astroneer Expeditions is not Astroneer 2 or a sequel of any kind. Instead, this upcoming PS5 game is a new entry in the series set in the Astroneer universe. Players will have to work together here to complete planet-wide objectives across tons of different star systems. Embark on expeditions, discover vibrant worlds and their features, face dangerous creatures, and see how your ever-evolving space station changes with each upgrade. Starseeker: Astroneer Expeditions currently has no release date, but we do know that it has its sights set on a 2026 launch.\nMARVEL 1943: Rise of Hydra\nDeveloper: Skydance New Media\nPublisher: Plaion\nRelease date: TBC 2026\nOut of all the upcoming Marvel games on the horizon, we are most excited about MARVEL 1943: Rise of Hydra. So far, we've only seen a cinematic story trailer for this new PS5 game, showing off Black Panther and Captain America facing each other in a war-torn occupied Paris during WW2. The teaser is thrilling, so already we are hooked! While we are still waiting for a firm release date on this one, we do know that it's set to come out sometime in 2026. So, stay tuned for updates!\nPragmata\nDeveloper: Capcom\nPublisher: Capcom\nRelease date: TBC 2026\nCapcom revealed a mysterious new game called Pragmata that leaves more questions than it answers, but certainly piqued a lot of interest when it was added to the upcoming PS5 games list. Described as a \"thought-provoking game\", the trailer shows someone in what looks like a space suit in a futuristic setting, where they encounter a young girl called Diana and a holo-cat. While it's only coming in 2026, we're certainly eager to learn more about this rather enigmatic adventure.\nNioh 3\nDeveloper: Team Ninja\nPublisher: Koei Tecmo\nRelease date: TBC 2026\nWith Nioh 2, Team Ninja really left their own mark on the soulslike genre – combining tricky clashes with powerful yokai with the ability to turn the tides with your own demonic powers. Nioh 3, however, looks to be going beyond a straight sequel, embracing the improvements Team Ninja made to their own formula with Wo Long: Fallen Dynasty, which imagined a supernatural world set in Chinese history that was their own riff on what FromSoftware accomplished with Sekiro. Here, it comes full circle, as Nioh 3 incorporating the greater mobility and exploration introduced in Wo Long into the world of Nioh 3.\n007 First Light\nDeveloper: IO Interactive\nPublisher: IO Interactive\nRelease date: TBC 2026\nIO Interactive is gearing up to tell the origin story for James Bond in a brand new game originally titled Project 007 before getting the fresh name of 007 First Light. Although details are scarce, we recently got a new trailer during the last State of Play showcase that showed off some gameplay. We also know is that it's going to be an entirely original James Bond story - so not tied to the novels or films. Hakan Abrak, CEO of IO says that it is \"the most ambitious game in the history of our studio\". Exciting times ahead.\nMarvel: TOKON Fighting Souls\nDeveloper: Arc System Works\nPublisher: Sony Interactive Entertainment\nRelease date: TBC 2026\nHere's a State of Play reveal that nobody had on the cards: Arc System Works (Guilty Gear, Double Dragon) has unveiled Marvel: TOKON Fighting Souls, a 4v4 tag team fighting game set in the Marvel universe. Though there's no exact release date beyond 2026, we've already seen that the likes of Spider-Man, Doom, Ghost Rider, Storm, Captain America, and Iron Man will all be playable. It's hard to understate how big a collaboration this is, so fans of the best fighting games should absolutely keep their eyes peeled for more news on this ahead of it launching on PC and PS5.\nBloodstained: The Scarlet Engagement\nDeveloper: ArtPlay\nPublisher: 505 Games\nRelease date: TBC 2026\nCastlevania fans, this one's for you. Featuring all the 3D side-scrolling hack-n'-slash action you could wish for, Bloodstained: The Scarlet Engagement is an upcoming PS5 game on the way in 2026. It's already looking like everything a self respecting Victorian gothic fan could ask for: winding stone castles, dramatic flowing capes, a lady in a fancy hat sitting atop a pile of human skulls… honestly, the cool Soulsy combat is almost a mere bonus to the sheer spooky vibes the reveal trailer gives off. We'd expect nothing less from developer ArtPlay, so the new Bloodstained game is definitely one to keep an eye on in the coming months.\nSea of Remnants\nDeveloper: Joker Studio\nPublisher: NetEase Games\nRelease date: TBC 2026\nAny game introduced with its own folk song gets a pass in our books, and that goes double when pirates are involved. An adventure RPG set on the high seas, Sea of Remnants has opened pre-registration. Beyond that, we haven't heard too much about what's in store beyond ship-based battles and some sort of slot machine-wielding crab. Hopefully that last one's explained sooner rather than later, eh?\nRomeo is a Dead Man\nDeveloper: Grasshopper Manufacture\nPublisher: Grasshopper Manufacture\nRelease date: TBC 2026\nRevealed with a stylishly animated trailer, lashings of ultra violence, and a truly devil-may-care attitude, it could only be a new game from Grasshopper Manufacturer. Romeo is a Dead Man is the latest creation from Suda51, complete with hand-drawn animations, zombies, gore, and plenty of (bitten) tongue-in-cheek humor to boot. Our FBI-investigator protagonist Romeo Stargazer is as outrageous as his name in both manner and mayhem, tearing through zomboid enemies in the reveal trailer for a chaotic taste of the carnage in store.\nBlighted\nDeveloper: Drinkbox Studios\nPublisher: Drinkbox Studios\nRelease date: TBC 2026\nDescribed as a \"psychedelic western nightmare\", this Metroidvania comes from the steady hands at Drinkbox Studios – responsible for the likes of Guacamelee and Nobody Saves the World. The colorful, crunchy action takes place in a sort of isometric perspective, which reminds us of the likes of Hades. Here, however, you can play through your adventure either solo or with 3-players, making this a more sociable experience – if this is anything like the co-op fun that was in Guacamelee 2, we're in for a riotous time.\nInfinitesimals\nDeveloper: Cubit Studios\nPublisher: Epic Games Publishing\nRelease date: TBC 2026\nYou might be small, but you are at least mighty – the threats you're facing… rather mundane? When your spaceship crashes on a strange planet, you have to contend with the wildlife and strange structures that resemble a somewhat futuristic Earth. Think if Pikmin were a shooter and looked way more realistic. With your fellow alien squad scattered to the winds, it's up to brave the blades of grass and insects in your way to get them back, and find out what happened to the colony you were sent to join up with.\nTBC\nEuro Truck Simulator 2\nDeveloper: SCS Software\nPublisher: SCS Software\nRelease date: TBC\nFor too long, PC players have had one of the best simulator games all to themselves, well, no more! Euro Truck Simulator 2 (as well as American Truck Simulator) is finally coming to consoles. Travel across Europe as a new trucker with a ton of deliveries to get through as you grow your truck empire. Explore 60 real-life cities, build up your own fleet of drivers, and customize your vehicles to your heart's content. Euro Truck Simulator 2 is still one of the best PC games you can play right now, and we can't wait until a PS5 release date gets announced.\nPersona 4 Revival\nDeveloper: Atlus\nPublisher: Sega\nRelease date: TBC\nAfter years of rumors and wishful thinking, Inaba is looking particularly luscious in our first look at the Persona 4 remake. Revealed during Summer Game Fest 2025, Persona 4 Revival will be giving one of the best Persona games a modern makeover for the PS5 as we follow the high schooler Yu Narukami in a high-stakes murder mystery. From the trailer, we've seen that all the original aspects that we loved about the JRPG are still seemingly in tack. However, we assume that we'll soon hear news on some tweaks and changes once a release date gets announced as well.\nGood Boy\nDeveloper: Observer Interactive\nPublisher: Team 17\nRelease date: TBC\nIf you are a fan of the Disney Movie WALL-E then Good Boy will likely become top of your PS5 Wishlist. In this adorable creature collector and exploration game you control a LAIKA Space Rover. Capture and research alien creatures, complete your Rover quests, form bonds, and discover all the secrets hiding on the planet Terra II. The trailer for this upcoming indie almost gave me a cuteness overload, so I'll definitely be picking this one up personally as well as soon as release date is announced.\nAphelion\nDeveloper: DON'T NOD\nPublisher: DON'T NOD\nRelease date: TBC\nDevelopers of Life is Strange are diving into a brand new sci-fi story with the new PS5 game, Aphelion. Made in collaboration with the European Space Agency, Aphelion tells the story of a character crash landing on a strange and hostile planet, on a mission to find someone named \"Thomas\". However, don't expect a walk in the park for this journey as Aphelion is deadly and you’ll be engaging in plenty of \"tense stealth gameplay\". Currently we're still waiting for a release date for this one, so stay tuned!\nSuper Meat Boy 3D\nDeveloper: Team Meat\nPublisher: Headup\nRelease date: TBC\nSuper Meat Boy is getting a fancy new 3D makeover in the upcoming PS5 game, Super Meat Boy 3D, after years of delighting us all with his 2D outings. On a mission to save his girlfriend, you'll have to guide Meat Boy through some of the most brutal and scream inducing platformer levels you'll ever face. But hey, who said love was easy, right? Currently we are still waiting on a release date for this one, however, we can all rest easy knowing that it'll be a bloody, delightful affair once it does launch.\nAtomic Heart 2\nDeveloper: Mundfish\nPublisher: Mundfish\nRelease date: TBC\nLook: managing to work the phrase \"Atomic Heart 2\" into your Atomic Heart 2 reveal trailer is a feat that's worth acknowledging. Soundtrack it to Don't Stop Me Now, and you've already got a tone that's sillier than even the first game. We've got no release window for this upcoming PS5 game, but given the trailer's only just confirming it's in development, it could be a while before we get our hands on Atomic Heart 2.\nThe Cube\nDeveloper: Mundfish\nPublisher: Mundfish\nRelease date: TBC\nAs if Atomic Heart 2's reveal at Summer Game Fest 2025 wasn't enough, Mundfish also revealed The Cube – an MMO RPG set in the same universe as Atomic Heart. The premise is as simple as it is weird: a gigantic floating cube has appeared in the sky, and scientists are racing to uncover a reality-changing equation that's hidden within. The catch? There's all sorts of sentient life on its surface, and the cube itself – so big it has its own biomes – is constantly rotating. Multiplayer shooters are hard to crack, but this one really does sound as interesting as it does strange.\nChrono Odyssey\nDeveloper: Chrono Studio\nPublisher: Kakao Games\nRelease date: TBC\nWith enough Soulslike energy and grimdark fantasy vibes to give Malenia a heartattack, Chrono Odyssey is an upcoming action-MMORPG set in a \"seamlessly designed open world\". Team up with your friends (or total strangers) to explore every inch, defeating all manner of hulking, brutish monsters in your path using time-bending powers to even the score. Freezing foes in place, levitating them… you decide.\nAssassin's Creed Hexe\nDeveloper: Ubisoft Montreal\nPublisher: Ubisoft\nRelease date: TBC\nUbisoft Montreal – the birthplace of Assassin's Creed – is working on a very different type of entry to the series. Following the release of Assassin's Creed Valhalla in 2020, the studio has been quietly working on Assassin's Creed Codename Hexe under the leadership of Watch Dogs Legion's creative director Clint Hocking. While it's thought to be in early development, an early tease suggests a far darker setting that could revolve around Europe's bloody 16th century witch trials. Sadly, there's a good chance we'll be waiting until 2025 and beyond for this one.\nCities Skylines 2\nDeveloper: Colossal Order\nPublisher: Paradox\nRelease date: TBC\nCities Skylines 2 is finally coming to console after its PC launch last year, and is the long-awaited sequel to one of the most popular city builders of all time. It's bringing with it enhanced features like better road tools, public and cargo transportation, traffic AI, massive 150 tile maps per unique city, and a cinematic camera. We'll also be able to get much closer to the action than ever before, with the opportunity to follow individual citizens from birth to death in your city.\nDune Awakening\nDeveloper: Funcom\nPublisher: Funcom\nRelease date: TBC (PC release June 10, 2025)\nFuncom is bringing us a new survival open-world MMO set in the vast landscape of the classic sci-fi setting Arrakis. Dune: Awakening is said to blend the survival game genre with a multiplayer experience as you try to live in the harsh landscapes of the planet. You'll be building shelters to weather sandstorms, looking after your stillsuit, and trying to brave the deep desertland. It'll be interesting to see how the famous setting serves as a home for an MMO experience. During Gamescom 2024, it was announced that the game is set to release in Early Access for PC players in 2025. However, we are still waiting on a PS5 release window.\nElder Scrolls 6\nDeveloper: Bethesda Game Studios\nPublisher: Bethesda\nRelease date: TBC\nAh, the Elder Scrolls 6. The 37-second trailer that blew the world's mind at E3 2018. The game that we know nothing about beyond this same trailer, that is in development somewhere within Bethesda Game Studios along with Starfield. Because it is so far away from release, you can bet your bottom coin that it's going to appear - at some point - on the PS5 (although hopefully not whatever the PS6 could be).\nFairgames\nDeveloper: Haven Studios\nPublisher: SIE\nRelease date: TBC\nHaven Studios was acquired by Sony Interactive Entertainment in 2022, becoming part of the PlayStation Studios family to help lead the PS5's expanding live service initiative. The studio's debut is Fairgames, an all-new co-op experience where you'll team up with friends to go up against the corporate overloads squeezing the life out of the world. A report surfaced in 2025 that studio lead Jade Raymond had parted ways with the project, and we're still awaiting a further update on the new multiplayer experience.\nIntergalactic: The Heretic Prophet\nDeveloper: Naughty Dog\nPublisher: SIE\nRelease date: TBC\nIntergalactic: The Heretic Prophet is the new game from Last of Us and Uncharted developer Naughty Dog. Currently in development for PS5, the project has been in the works since 2020 and will see us take on the role of new protagonist Jordan A. Mun, a bounty hunter who ends up stranded on a distant planet that's said to have lost communication with the outside universe hundreds of years ago.\nLight No Fire\nDeveloper: Hello Games\nPublisher: Hello Games\nRelease date: TBC\nNo Man's Sky developer Hello Games is bringing us a new experience with Light No Fire - a survival sandbox adventure you can play with others. Set on an open-world fantasy planet that's described as being the same size as the Earth, you'll be given the freedom to explore its diverse biomes as you try to unravel its lore and mysteries. With building and survival aspects, we also saw in the reveal trailer that you can fly through the vistas on the back of a dragon, climb mountains, and even set sail across the oceans.\nMarvel's Wolverine\nDeveloper: Insomniac\nPublisher: Sony Interactive Entertainment\nRelease date: TBC\nUndoubtedly one of the biggest surprises of the PlayStation September 2021 showcase came in the shape of those famous adamantium claws belonging to none other than Wolverine. Yes, a new standalone Marvel's Wolverine game is currently in development. While we're light on details for the moment, we do know Brian Horton is Wolverine's creative director, and Cameron Christian is the game director. Horton was creative director on Spider-Man Miles Morales and has also worked on games such as Tomb Raider and Rise of the Tomb Raider.\nNew Mass Effect\nDeveloper: BioWare\nPublisher: EA\nRelease date: TBC\nIt might be quite a way off release, but that isn't going to stop us being ridiculously overexcited for a brand new Mass Effect game - aka Mass Effect 5. Seemingly picking up after the events of Mass Effect 3, we'll be seeing some old faces return and some plot lines picked back up. Of course, the big question of whether Shepard will return remains, but we're ready for everything.\nNew Virtua Fighter Project\nDeveloper: Rya Ga Gotoku Studio\nPublisher: Sega\nRelease date: TBC\nVery little is known about the new Virtua Fighter Project currently in the works, but the the brief teaser trailer showed off a powerful figure in a hat who punched another man through a wall. Said to be a completely new project in the Virtua Fighter series, it's certainly one to watch out for.\nOkami sequel\nDeveloper: Capcom\nPublisher: Capcom\nRelease date: TBC\nA sequel to the beloved painterly adventure Okami is currently in the works from Capcom and game director Hideki Kamiya. With a brief teaser trailer show so far, we've only gotten of glimpse of the follow-up so far, but it looks set to bring us to another gorgeous world in the same signature style, with the promise of a heartwarming story in the same vein as the original as we once again take on the role of Amaterasu.\nPhantom Blade 0\nDeveloper: Cruel Man Studio\nPublisher: S-Game\nRelease date: TBC\nIf you're a fan of samurai swashbuckling and moody feudal Japan as a setting, Phantom Blade 0 seems to be promising us both. The third person action title is yet to have a confirmed release date, but from what we've seen at the PlayStation Showcase 2023, your character has \"66 days to live\". What will he do with it? \"Get my heart back,\" he responds. We don't know much else just yet, but its brooding color scheme and fast-paced melee combat seem like a dynamic blend of Gungrave GORE aesthetics with Ghost of Tsushima action, and we're already here for it.\nStar Wars: Knights of the Old Republic Remake\nDeveloper: Aspyr\nPublisher: Sony Interactive Entertainment and Lucasfilms Games\nRelease date: TBC\nAfter many rumors began circulating, the latest Sony showcase confirmed that a remaster of BioWare's beloved Star Wars: Knights of the Old Republic is on the way, and the upcoming Star Wars game is coming to PS5. Aspyr and Sony Interactive Entertainment are working with Lucasfilm Games to rebuild the classic adventure, which promises to bring KOTOR to a new generation with \"modern tech, features, visuals, and more, while maintaining the integrity of the story and characters\" so many have come to love.\nThick as Thieves\nDeveloper: OtherSide Entertainment\nPublisher: Megabit Publishing\nRelease date: TBC\nWhat happens when several thieves, each with their own special set of talents gets put on the same heist. Well, you can find out the answer to that question with the upcoming PvPvE game, Thick as Thieves. Outwit and act fast to steal treasure before any other players can get their hands on it. However, be warned, it isn't easy rising through the ranks in a 1910s metropolis that is filled with shadows and magic. Thick as Thieves looks to be tons of fun and an exciting spin to typical stealth based gameplay. Currently, we're still waiting for a release date for it, so stay tuned for updates.\nLumines Arise\nDeveloper: Enhance, Monstars\nPublisher: TBC\nRelease date: TBC\nWhere do you go from a game as sublime as Tetris Effect? Switch gears, and apply the same Enhance transcendental puzzling action to another franchise entirely with Lumines Arise. Promising to take us away to yet another synesthetic sensory wonderland, reviving the PSP classic Lumines: Puzzle Fusion from Q Entertainment. Like Tetris, it's all about falling blocks, except here you have to nudge them into 2x2 grids and match colors to get them to pop. The must-have portable puzzler drew comparisons to Tetris with its original release, so it's the perfect successor for the Tetris Effect developers to have some more fun.\nILL\nDeveloper: Team Cloud\nPublisher: Mundfish Powerhouse\nRelease date: TBC\nPerhaps the gnarliest game of Summer Game Fest 2025, Ill has resurfaced after several years of cooking from developer Team Cloud. It comes with good news for horror fans: it looks gnarlier than ever, with its creature design leaning into body horror with zombified babies and – for lack of a better term – inside-out people. There was also a huge emphasis on reactivity to gunshots – shoot a humanoid in the leg, and it stumbles down for an execution. This has been on indie horror fans' radars for years, but fingers crossed it's inching toward a release date now that it's under the wing of Atomic Heart developer Mundfish's new creative label.\nFor more future releases coming to other platforms, head over to our lists for all the upcoming PC games, upcoming Switch 2 games, and upcoming Switch games.\nSam Loveridge is the Brand Director and former Global Editor-in-Chief of GamesRadar. She joined the team in August 2017. Sam came to GamesRadar after working at TrustedReviews, Digital Spy, and Fandom, following the completion of an MA in Journalism. In her time, she's also had appearances on The Guardian, BBC, and more. Her experience has seen her cover console and PC games, along with gaming hardware, for a decade, and for GamesRadar, she's in charge of the site's overall direction, managing the team, and making sure it's the best it can be. Her gaming passions lie with weird simulation games, big open-world RPGs, and beautifully crafted indies. She plays across all platforms, and specializes in titles like Pokemon, Assassin's Creed, The Sims, and more. Basically, she loves all games that aren't sports or fighting titles! In her spare time, Sam likes to live like Stardew Valley by cooking and baking, growing vegetables, and enjoying life in the countryside.\n- Josh WestEditor-in-Chief, GamesRadar+\n- Heather WaldSenior staff writer\n- Rollin BishopUS Managing Editor\n- Jasmine Gould-WilsonStaff Writer, GamesRadar+\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-season-3-release-date-plot-cast-news/",
      "text": "The Last of Us season 3 release date speculation, cast, plot, and more news\nYour guide to everything we know so far about The Last of Us season 3\nThe Last of Us season 3 is in the works, but it might be a while until we get to see it. The HBO Max show is not one to rush things, particularly now that showrunner Neil Druckmann has left the series to focus on other projects. We can expect things to be pretty different when we return to Seattle, and here we've gathered everything we know so far.\nBased on Naughty Dog's popular games, The Last of Us has to deal with plenty of fans' expectations, and work to surprise even those who know what's next in the story. In the upcoming season, Kaitlyn Dever's Abby will step into focus while Bella Ramsey's Ellie takes a backseat for now, and that's only one of the many details that will be key for the future of the show. After the shocking The Last of Us season 2 ending, we can't wait to see what's in store for the characters.\nCelebrating one of the most exciting upcoming TV shows, we've put together a guide with everything you need to know about The Last of Us season 3 release date window, confirmed cast, plot details, and the timeline of the game. Be warned, though: there are spoilers for The Last of Us season 2 below, as well as spoilers for The Last of Us Part 2, so make sure you're caught up before you read any further.\nThe Last of Us season 3 release date speculation\nThe release date for The Last of Us season 3 has not been announced yet, but we can expect a 2027 release, according to HBO boss Casey Bloys.\n\"The series is definitely planned for 2027,\" said Bloys in July 2025. \"Craig [Mazin] is still working it out whether it will be two more seasons or one more long season. It hasn't been decided yet, and I'm following Craig's lead on that.\"\nA few weeks later, on August 19, Craig Mazin said he is still writing the scripts. \"This is kind of my favorite time. It’s very quiet. It’s just sitting here with my wonderful ergonomic keyboard and clacking away. The pages are happening,\" he told The Hollywood Reporter.\nMazin also revealed season 3 will be longer than season 2. \"We're kind of fiddling around with that – it's a little bit of a trade secret at the moment. But I will say that season three will be longer than season two. Season three will be more on par with season one. More bang for the buck,\" he explained.\nBringing all the latest movie news, features, and reviews to your inbox\nThe Last of Us season 1 aired in 2023 and The Last of Us season 2 premiered in 2025, so we expected a two-year wait for season 3.\nCo-showrunner and head writer Craig Mazin told GamesRadar+ in April that they had not yet begun writing season 3 at that point. Now that season 2 has ended, it's likely that work will begin fairly soon, and we'll have a better idea as time goes on.\nThe Last of Us season 3 plot *SPOILERS*\nThe Last of Us season 3 will continue to adapt The Last of Us Part 2, which follows Ellie as she sets out for revenge against Abby, who brutally murders Joel after it's revealed that the surgeon Joel killed at the end of season 1 was actually Abby's father. And not only that, he was also the only living doctor who was capable of making a cure for the Cordyceps virus. At the end of The Last of Us season 2, Ellie manages to kill all of Abby's friends before she and Abby have their first confrontation, which ends with Jesse's death. Abby then shoots Ellie before we cut to Abby waking up in The Stadium (WLF headquarters) with on-screen text that reads, \"Seattle Day One.\"\nCatherine O'Hara recently confirmed that season 3 will, in fact, center on Abby's story - which isn't a shock to anyone who has played Part 2. To explain, The Last of Us Part 2 is told from Ellie and Abby's points of view, with the player controlling both characters. The timeline in the game is then split in two: Ellie's perspective: Jackson, Seattle Day One, Seattle Day Two, Seattle Day Three; Abby's perspective: Seattle Day One, Seattle Day Two, Seattle Day Three; and The Farm/Santa Barbara.\nThe switch to Abby's perspective shows us what she was doing during those three days that Elie and Dina were hunting her down, and gives us some backstory that makes us reluctantly sympathetic for her and her reasons for killing Joel. Day Three takes us back to the The Last of Us season 2 finale, but from Abby's perspective - the player hunts Ellie down, rather than hide from Abby.\nDuring The Farm part of the game, we see Ellie's life with Dina and their baby. Their peaceful life is interrupted when Tommy pops up and tells Ellie that he's tracked Abby's whereabouts to Santa Barbara - and that she should absolutely go and kill her (which does seem a little out of pocket for TV show Tommy). Ellie does leave for Santa Barbara, which is where Abby and Ellie's final showdown takes place. The game ends from Ellie's perspective.\nThat being said, we can speculate that The Last of Us season 3 will start with Abby's Seattle Day One, Two, and Three - and potentially end there. Because a season 4 has been planned (though not yet renewed), it's possible that the fourth season will center on The Farm and Santa Barbara, saving Abby and Ellie's final confrontation until then (especially with what O'Hara said about season 3 focusing mainly on Abby's story). It's worth noting that season 2 does change the narrative quite a bit, what with telling us within just the first few minutes of the season that Abby plans to kill Joel - rather than keep her reasoning something of a mystery until we play through her perspective.\nBecause of this, we can expect many more narrative changes as well as a crop of new characters. It's possible that showrunners and writers Craig Mazin and Neil Druckmann decided to save Lev and Yara, two members of Abby's crew who become essential to Ellie's story, for season 3 so as not to muddle or complicate the main plot.\nThe Last of Us season 3 cast\nThough her friends are dead, season 3 will show us what Abby was doing in Seattle while Ellie and Dina were hunting her down. Because of this, Abby's crew will return - though we're not sure if Lev and Yara, two members of the WLF who become an important part of Ellie's life and story, will appear. Bella Ramsey and Isabela Merced will no doubt return, as well as Jeffrey Wright's terrifying Isaac, who has more or less been made a larger antagonist in the show than he was in the game (and we're not complaining). We can also only speculate that deceased characters like Jesse and Joel will appear in flashbacks.\nIt's also worth noting that Catherine O'Hara said she \"definitely\" wouldn't be appearing in season 3, because of its central focus on Abby.\nNeil Druckmann (creator of The Last of Us video game franchise) even confirmed more of a focus on Abby at a FYC event, suggesting that Dever would step in as lead in The Last of Us season 3. We also most likely won't be heading back to Jackson in season 3, though Tommy and Maria do appear in The Farm portion of the game (which we may or may not see in season 3, but are much more likely to see in season 4).\nHowever, Druckmann (creator of The Last of Us video game franchise) will not be returning as co-showrunner and head writer, with screenwriter Halley Gross (who co-wrote The Last of Us Part 2 with Druckmann) exiting the show as well. Craig Mazin will remain showrunner for season 3. Druckmann is leaving to focus on his new video game, Intergalactic: The Heretic Prophet. He will likely remain an executive producer on The Last of Us TV show.\nBrand new characters created specifically for the show are also likely to appear (and the Seraphites will make a return, given that they are the main enemy of the WLF). Based on what we know so far, we've compiled a speculative cast list below.\n- Bella Ramsey as Ellie\n- Kaitlyn Dever as Abby\n- Pedro Pascal as Joel\n- Gabriel Luna as Tommy\n- Rutina Wesley as Maria\n- Isabela Merced as Dina\n- Jeffrey Wright as Isaac\n- Spencer Lord as Owen\n- Tati Gabrielle as Nora\n- Danny Ramirez as Manny\n- Ariela Barer as Mel\n- Alanna Ubach as Hanrahan\n- Ben Ahlers as Burton\nIs there a The Last of Us season 3 trailer?\nThere is no trailer for The Last of Us season 3, as writing or filming has not yet begun. Because we can speculate that the season will air in 2027, we can most likely expect a trailer around then, if not in late 2026.\nIs The Last of Us season 3 the final season?\nAs Mazin and Druckmann have said time and time again (including to GamesRadar+ directly), it looks like they plan to stretch The Last of Us Part 2 over at least two more seasons. After the official season 3 renewal, Mazin told Collider: \"There’s no way to complete this narrative in a third season. Hopefully, we’ll earn our keep enough to come back and finish it in a fourth. That’s the most likely outcome.\"\nHBO boss Casey Bloys, however, said in July 2025 that Mazin is now considering the possibility of only one more season: \"Craig is still working it out whether it will be two more seasons or one more long season. It hasn’t been decided yet, and I’m following Craig’s lead on that.\"\nSeason 3, adapting the same timeline as the video game, will focus on Kaitlyn Dever's Abby, and show us where she was when Ellie and Dina took off for Seattle, leading us back up to the events of the season 2 finale. However, if season 3 is once again only seven episodes, we can speculate that season 4 will give us the final showdown between Ellie and Abby that happens at the very end of the game.\nThe Last of Us seasons 1 and 2 are streaming now on HBO Max in the US and NOW in the UK. For more, check out our The Last of Us season 2 review.\nLauren Milici is a Senior Entertainment Writer for GamesRadar+ based in New York City. She previously reported on breaking news for The Independent's Indy100 and created TV and film listicles for Ranker. Her work has been published in Fandom, Nerdist, Paste Magazine, Vulture, PopSugar, Fangoria, and more.\n- Mireia MullorContributing Writer\n- Bradley Russell\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/drama-shows/the-last-of-us-season-3-may-or-may-not-be-the-end-as-the-horror-show-could-wrap-up-with-two-more-seasons-or-one-more-long-season-says-hbo-boss/",
      "text": "The Last of Us season 3 may or may not be the end, as the horror show could wrap up with \"two more seasons or one more long season,\" says HBO boss\nThe Last of Us season 3 could be the final season\nThe Last of Us continues to follow the path laid out by Naughty Dog's The Last of Us Part 2, but co-creator Craig Mazin is apparently still undecided on whether the HBO series will wrap up next season or not.\nIn an interview with Variety, HBO boss Casey Bloys addressed the future of The Last of Us, which has undergone some creative shake-ups in recent weeks – as well as nailing down a release window for The Last of Us season 3.\n\"The series is definitely planned for 2027. Craig is still working it out whether it will be two more seasons or one more long season,\" Bloys said. \"It hasn’t been decided yet, and I’m following Craig’s lead on that.\"\nPreviously, Mazin told GamesRadar+ in mid-April that he would \"take a few weeks\" before heading back to writing.\n\"Then if there's one thing I know about myself, I will be absolutely champing at the bit to get back to the keyboard,\" Mazin said.\nNow, though, Mazin is without a couple of his key collaborators. Both co-creator Neil Druckmann and writer/producer Halley Gross have stepped back from the HBO series to focus on their day jobs at Naughty Dog, particularly with the arrival of Intergalactic: The Heretic Prophet.\n\"I've made the difficult decision to step away from my creative involvement in The Last of Us on HBO,\" Druckmann said in a message shared on social media, while also describing his time on the show as an \"honor\" and a \"career highlight.\"\n\"With work completed on season 2 and before any meaningful work starts on season 3, now is the right time for me to transition my complete focus to Naughty Dog and its future projects, including writing and directing our exciting next game, Intergalactic: The Heretic Prophet, along with my responsibilities as Studio Head and Head of Creative.\"\nFor more, discover the new PS5 games and new TV shows currently in the works.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.hollywoodreporter.com/tv/tv-features/last-of-us-showrunner-craig-mazin-writing-directing-season-3-1236342633/",
      "text": "Craig Mazin will be The Last of Us season three’s lone writer after co-creator Neil Druckmann and co-writer Halley Gross announced they were stepping away from the series. (Druckmann co-developed the original Last of Us game and directed The Last of Us: Part II, which he co-wrote with Gross.) Emmy-winning writer-director Mazin (Chernobyl), who this year is nominated for outstanding drama series, spoke to THR about how the HBO thriller focusing on the survivors of a mass fungal infection that collapses modern-day society has helped level up the art of game-to-small-screen adaptations and whether he’s already busy writing the third season.\nRelated Stories\nVideo game adaptations are nothing new, but a TV spinoff earning Emmys is. Has The Last of Us proved that video game adaptations can hold their own?\nYeah. I think that in the wake of The Last of Us, a ton of video game projects got greenlit. Fallout was already happening, and that was fantastic in its first season, and I’m really looking forward to the second season. There’s just this incredible wave coming. Like anything, when people first said, “Hey, let’s start adapting books into movies or television shows,” some of them are going to be great, some of them will stumble. But the idea that the industry has woken up to how rich some of that storytelling is and how wonderful it is to adapt is fantastic.\nWhere are you with writing season three?\nThis is kind of my favorite time. It’s very quiet. It’s just sitting here with my wonderful ergonomic keyboard and clacking away. The pages are happening, and I get to be a monk for a while, which I love, and I just write. It’s the purest form of what I do. And then in just a couple of months or so, that happy time will start to be less quiet because we begin a very long prep period while I’m still writing, and then we begin to shoot while I’m still writing. In seasons one and two, I finished writing about six weeks before we started shooting the last episode. I don’t necessarily recommend this method other than to say this works for me, but it is insane.\nNow that Neil is stepping away to focus on Intergalactic: The Heretic Prophet, will the writing process change?\nI don’t think it is, in the sense that I was pretty much a monk just writing in a room by myself for most of the time regardless. And I’ve gotten so much out of talking with them over the course of seasons one and two. When we made season two, we really were thinking about what comes after because you can’t really tell half of that story without thinking about what the whole story should be. So we really did get that work in. Neil’s always had a full-time job running Naughty Dog, so it’s always been me up in Canada [where the production is], and, ultimately, things are pretty much going to proceed as usual.\nWhat were the most challenging scenes to shoot, logistics- and VFX-wise?\nEpisode two, the attack on Jackson, Wyoming, was an enormous undertaking for everybody. It was hard to write, it was hard to plan, it was hard to shoot. The prosthetics, the stunts and then the visual effects afterward were just massive. So we had [VFX houses] Weta and DNEG and about five other companies all working together to create all of the moments, and that was insane.\nThere were nine episodes in the first season but only seven in this one, and yet the pacing feels so different. Despite the fact that everything takes place in a span of three days, the attack on Jackson feels like it was ages ago. How does it compare to the game?\nThe attack on Jackson is not in the video game, so that’s new to our show. It’s one of those surprises that people who played the game would be like, “Oh!” But, yeah, the characters have gone through quite a bit, but the way we use time, it’s almost like so much of season two is really about three days, and I love being able to focus in on a period of time.\nThe Last of Us subreddit is quite a busy place. How closely do you keep track of the chatter and are there responses that surprise you?\nI don’t look at them, so I don’t know. Problem solved! I don’t go on Reddit. I mean, I’m always playing video games; I’m playing The Elder Scrolls IV: Oblivion Remastered right now. Sometimes I’ll go on Reddit when I’m like, “What is the best bow for an archer build?” That’s about as much Redditing as I do.\nWhat lessons did you learn from Chernobyl that you brought with you to The Last of Us?\nFor starters, I learned how much attention to detail matters. [What] we showed in Chernobyl was really born out of a desire to be as respectful as possible to the culture. We were telling a story that impacted people who are still alive, who lost people.\nI just had a sense that stories that have been told in the West about the Soviet Union were not accurate, and why not go for as real, real, real as you can? That approach to being as grounded as we can, especially in a genre story where there are monsters, is something that I brought forward. The style of shooting is something I pulled through — and I say it every time — but everything I ever learned about directing, I learned by watching Johan Renck direct Chernobyl. I really internalized the way that he used multiple cameras as an artistic choice, as opposed to just [shoot] faster.\nThe other thing that I learned from Chernobyl was how important it was for the people who were at the creative helm to pay as much attention to visual effects as they do to anything else that you don’t. In your mind, you think, “I’ll just send this away, it’ll come back, I’ll put it in the show.” It doesn’t work like that at all. It is almost like doing takes with an actor: “Great, now let’s try this. Great, let’s try this.” And then, “Ah, there it is.” And that process of working through visual effects is exhausting and exhaustive for everybody, but I think what we end up getting is pretty remarkable, and it makes the show better. I just believe that visual effects are beyond integral to the success of a show like ours.\nBefore Chernobyl, you worked on The Hangover films. How much are you itching to get back to comedy?\nNot strong itches. I mean, I spent a long time doing comedy, and even though I’ve been doing drama — it’s been about five, six years. Prior to that, it was like 25 years of comedy. Look, I think I’ve told all the jokes. I think my comedy is used up. I like having moments. I like having moments inside of drama. And I love working with comedic actors in dramatic roles because we can find comedy in there. So you do a scene where you’ve got Catherine O’Hara and she has this very heavy scene with therapy and all the rest, but still we find the funny in it because, of course, we do. But going back to pure comedy, I think probably, no, I don’t think so.\nDo you envision directing the first episode of TLOU season three as you’ve done with the first two seasons?\nYeah. Honestly, I’d love to direct more, but the problem is just logistics. I like to direct the first episode because you can prep the whole season. There are a lot of characters that get cast and there are a lot of decisions that get made about environments, so you can sort of prep a lot of the season by prepping and directing the first episode. As we’re going along, you have to prep the other episodes. We have directors alternating, and I’m on set doing — I don’t know what you’d call it — “showrunner QC” sounds insulting to our directors, who are amazing. But [I’m] just making sure everything is fitting together tonally. So it’s hard for me to then go prep something while I’m also still writing, but we’ll see if I can get away with [directing] more than one.\nAre more people lining up for roles now that The Last of Us has more Emmy nods?\nIt’s not quite like people knocking on your door as much as I think after season one. There may have been actors who were unaware of the video game or the show, but what they were aware of was that we were filling up those guest actor Emmy categories pretty extensively. We had fewer actual guest actors in season two, but we’ve still got Jeffrey Wright, Joey Pantoliano, Kaitlyn Dever and Catherine O’Hara, [who] all got nominated [for best guest acting in a drama series]. So when we pull people in, I think at least in the community, there’s an understanding they’re going to get something juicy to do. They’re not glorified day players. We try and create these little tiny, impactful stories with really, really good actors. So as we head into season three, I hope that we’ll see a couple of more fascinating additions like that.\nFor me, it’s so much fun to [say], “Hey, let’s just get Melanie Lynskey, why don’t we?” And to discover brilliant new talent, Keivonn Montreal Woodard, who had never acted before, and there he is getting an Emmy nomination for season one — that was just incredible. And Storm Reid won — obviously, she wasn’t new, but it was giving actors these interesting things to do that maybe they don’t normally get to do. Nick Offerman, who also won, normally doesn’t get to play that guy. And I love doing that.\nWho’s on your wish list for actors to write for?\nMy wishlist is Meryl Streep. I’ve always had [her] on my wishlist since I started in this business. I’ve never worked with her, but I met her when I was at the Golden Globes and I ran into somebody who was there with her. We were talking, and he was like, “Do you want to meet Meryl? She’s just around the corner. She’s going to walk over.” And I was like, “I would love to meet Meryl Streep. Yes!”\nSo she comes over and he [introduces us]. And I shook her hand and I went, “Pffff. You know!” [Raises hands] And she was like, “Yeah, I know.” I wanted to say, “Oh my God! I love you in this [and] this!” But I just figured, everyone always says that. I’m just going to package it into just, “Insert here, me just freaking out.” And she was really nice and seemed to accept that I was freaking out. So anyway, I short-handed it to, “You know!”\nI have not spoken to Meryl Streep, I have not written anything for her — yet — but one day, one day!\nYou just announced you and podcast co-host John August are releasing a book based on ScriptNotes. Will Neil and Halley ever join the pod guests?\nNeil and I have done at this point, 16 podcasts for the show and Halley’s been on, so that’s sort of that. ScriptNotes, the show has been going on forever. It was just hardcore screenwriting nerds, and it sort of expanded a bit. And we’ll get pitches from publicity people like, “Hey, would you like this person or this person?” But John and I have always felt we will bring guests on the show, but mostly we’re just keeping it a non-guest show so that it doesn’t turn into a talk show.\nYou got a tattoo of Ellie’s switchblade to commemorate The Last of Us’ success. Any plans to get any more show-inspired ink?\nI don’t have a specific plan, but I’m thinking maybe when it’s over. The other possibility is that I go for a tattoo-per-show method, so I only have the one. I may say, “OK, this is my Last of Us tattoo, now let’s see what comes next, and maybe that’ll be the next one,” but no plans yet. “No ragrets!”\nSince the second season only covered the first half of the second video game, what will the pacing and episode count be like for this next installment and beyond?\nWe’re kind of fiddling around with that — it’s a little bit of a trade secret at the moment. But I will say that season three will be longer than season two. Season three will be more on par with season one. More bang for the buck.\nThis story first appeared in an August stand-alone issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-showrunner-craig-mazin-shares-statement-after-creator-neil-druckmann-steps-away-from-the-hbo-series-promises-to-deliver-the-show-our-audience-has-come-to-expect/",
      "text": "The Last of Us showrunner Craig Mazin shares statement after creator Neil Druckmann steps away from the HBO series, promises to \"deliver the show our audience has come to expect\"\nThe show is set to return for a third season\nThe Last of Us showrunner Craig Mazin has released a hopeful statement following Neil Druckmann's departure from the series.\n\"It’s been a creative dream to work with Neil and bring an adaptation of his brilliant work to life on HBO. I couldn’t have asked for a more generous creative partner,\" Mazin said in a statement (via Deadline). \"As a true fan of Naughty Dog and Neil’s work in video games, I’m beyond excited to play his next game. While he focuses on that, I’ll continue to work with our brilliant cast and crew to deliver the show our audience has come to expect. We are so grateful to Neil and Halley Gross for entrusting the incredible story of The Last of Us Part II to us, and we’re just as grateful to the millions of people around the world who tune in.”\nIt was announced yesterday that Neil Druckmann, creator of The Last of Us video games and co-showrunner of the TV show, was stepping down from the latter in order to focus on his new game, Intergalactic: The Heretic Prophet. Druckmann wrote and directed several episodes of the show's first two seasons, but will not be directly involved with season 3 (or the rumored fourth season).\nThe TV series, which stars Pedro Pascal and Bella Ramsey, has been a massive hit since its inception, with the first season earning several Golden Globe and Primetime Emmy nominations. The Last of Us season 2 adapts The Last of Us Part 2, but only focuses on one chunk of the lengthy game, with the rest being told over a confirmed third season and a likely fourth season. Druckmann co-wrote the game with Halley Gross, who served as an executive producer on the show, and co-wrote one of season 2's best episodes. Gross, too, announced yesterday that she is stepping away from the series to pursue other opportunities.\n“I've decided to take a step back from my day-to-day work to focus on what comes next,\" she wrote on Instagram. \"Working alongside Neil, Craig, HBO and this remarkable cast and crew has been life changing,” she wrote. “The stories we told – about love, loss and what it means to be human in a terrifying world – are exactly why I love this franchise.\"\nThe Last of Us is streaming now on HBO Max. For more, check out our list of the best new TV shows coming your way in 2025 and beyond, or, read our The Last of Us season 2 review.\nLauren Milici is a Senior Entertainment Writer for GamesRadar+ based in New York City. She previously reported on breaking news for The Independent's Indy100 and created TV and film listicles for Ranker. Her work has been published in Fandom, Nerdist, Paste Magazine, Vulture, PopSugar, Fangoria, and more.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-showrunner-craig-mazin-says-season-3-will-be-longer-than-season-2-but-will-be-more-on-par-with-season-1-more-bang-for-your-buck/",
      "text": "The Last of Us showrunner Craig Mazin says season 3 will be \"longer than season 2,\" but will be \"more on par\" with season 1: \"More bang for your buck\"\nThe third season will center primarily on Kaitlyn Dever's Abby\nThe Last of Us showrunner Craig Mazin says season 3 will be, unsurprisingly, longer than season 2...but that it'll be a bit more like season 1.\n\"We're kind of fiddling around with that...it's a little bit of a trade secret at the moment,\" Craig Mazin told The Hollywood Reporter, when asked what the structure and episode count would be like for season 3. \"But I will say that season 3 will be longer than season 2. Season three will be more on par with season 1. More bang for the buck.\"\nThis makes perfect sense, given the length of The Last of Us Part 2, which takes around 42 hours of gameplay to hit 100% completion. The game is split into three parts: Seattle Day One from Ellie's perspective, Seattle Day Two in which the player is forced to play the game from Abby's perspective, and The Farm, which switches back to Ellie's perspective.\nThe Last of Us season 2, consisting of just seven episodes, focused on Ellie and Dina as they journeyed to Seattle to hunt down Abby, and ended on a cliffhanger with Abby waking up and onscreen text that read, \"Seattle Day One.\" Season 3 will focus on Kaitlyn Dever's Abby, and show us what she was up to during those three days that Ellie and Dina were looking for her. A fourth season is also highly likely, and will probably adapt The Farm section of the game.\nThe Last of Us is streaming now on HBO Max. For more, check out our list of the best new TV shows coming your way in 2025 and beyond, or, read our The Last of Us season 2 review.\nLauren Milici is a Senior Entertainment Writer for GamesRadar+ based in New York City. She previously reported on breaking news for The Independent's Indy100 and created TV and film listicles for Ranker. Her work has been published in Fandom, Nerdist, Paste Magazine, Vulture, PopSugar, Fangoria, and more.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/drama-shows/the-last-of-us-co-creator-hasnt-started-writing-season-3-but-is-champing-at-the-bit-to-get-back-to-the-keyboard/",
      "text": "The Last of Us co-creator hasn't started writing season 3 but is \"champing at the bit to get back to the keyboard\"\nExclusive: Craig Mazin provides an update on season 2's post-production and where season 3 is at\nThe Last of Us has already been renewed for a third season – but co-creator Craig Mazin hasn't found the time to put pen to paper on the next instalment just yet.\n\"I'm a bit tired,\" Mazin jokes during an interview with GamesRadar+. \"I've been going seven days a week now for a couple of months to finish mixing and there's still some visual effects that I have to approve over the course of the next few days for the final episode. So, I haven't properly finished the second season.\"\nThose raising their eyebrows at The Last of Us not having everything locked in ahead of its second season premiere can rest easy, however. Mazin – who also acts as showrunner alongside Neil Druckmann – says they are \"99% of the way there.\"\n\"Obviously, we were very gratified by the critical response. Thank god it's been good and, even more so, the renewal we got from HBO means [there's] this enormous faith in it, and it means the audience doesn't have to worry about it being canceled. They can watch season two in peace knowing there will be a season three. But I'll take a few weeks. Then if there's one thing I know about myself, I will be absolutely champing at the bit to get back to the keyboard.\"\nThe Last of Us, starring Pedro Pascal and Bella Ramsey, debuted back in 2023. The Last of Us season 2, which adapts part of 2020's The Last of Us Part 2, is set to hit our screens on April 13 on HBO in the US and April 14 on Sky and NOW TV in the UK.\nFor more, check out the upcoming PS5 games just over the horizon.\nBringing all the latest movie news, features, and reviews to your inbox\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/sci-fi-shows/the-last-of-us-tv-show-creator-confirms-kaitlyn-devers-abby-will-lead-season-3-i-was-sure-hbo-wouldnt-let-us-do-this/",
      "text": "The Last of Us TV show creator confirms Kaitlyn Dever's Abby will lead season 3: \"I was sure [HBO] wouldn't let us do this\"\nThe Last of Us season 2 ended on a cliffhanger\nNeil Druckmann has confirmed that Kaitlyn Dever will be the main star of The Last of Us season 3 – which we kind of knew already.\nWarning: spoilers for The Last of Us season 2 episode 7 below!\n\"I think it was good to go on that journey to end up at HBO, end up at a place that leaned into those controversial decisions, I guess,\" Druckmann said at an Emmys FYC event (via The Hollywood Reporter). \"But the decisions are just what the story required, and even now, it’s like I can’t believe that they let us structure the series in this way. Meaning like we just ended season two, and season three is going to be starring – spoiler alert – Kaitlyn.\"\nFans of The Last of Us Part 2 video game knew this was an inevitability, given that the game forces the player to control both Ellie and Abby. Season 2 covered the first part of Part 2, which is the journey to Seattle from Ellie's perspective. In the final moments of the finale, Abby wakes up elsewhere, and the onscreen text says, \"Seattle Day One.\" This means we'll be seeing the same three days Ellie and Dina spent hunting down Abby, but from Abby's perspective.\nContinued Druckmann: \"I was sure that they wouldn't let us do this when we started adapting this, but they've leaned into what makes, I believe, the story special. And allowed us not only the time but the creative freedom to be able to take these swings, and I think the audience really appreciates that.\"\nA fourth season is being planned, and will likely cover the third part of Part 2, which features the ultimate showdown between Abby and Ellie.\nThe Last of Us season 2 is streaming now on HBO Max in the US, and on Sky and NOW in the UK. For more, check out our The Last of Us season 2 review.\nBringing all the latest movie news, features, and reviews to your inbox\nLauren Milici is a Senior Entertainment Writer for GamesRadar+ based in New York City. She previously reported on breaking news for The Independent's Indy100 and created TV and film listicles for Ranker. Her work has been published in Fandom, Nerdist, Paste Magazine, Vulture, PopSugar, Fangoria, and more.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/tag/naughty-dog/",
      "text": "Naughty Dog\nLatest about Naughty Dog\nIntergalactic: The Heretic Prophet – Everything we know about the new Naughty Dog game\nBy Josh West last updated\nGuide All the latest Intergalactic news and updates from the developer of The Last of Us\nFormer The Last of Us artist says \"ultra realism slows everything down\" when it comes to game development, and \"chasing\" it has \"negatively affected many\"\nBy Scott McCrae published\nNews Makes sense when you look at how long Naughty Dog games are taking\nCrash Bandicoot co-creator says the remake \"got almost everything right, except the most important 30 milliseconds,\" and that's why it \"feels worse than the 1996 original\"\nBy Issy van der Velde published\nNews There is a big difference\nThe Last of Us Part 2 is fast becoming Sony's Skyrim: Naughty Dog has come up with yet another excuse to revisit it – a \"chronological experience\" update that rearranges the story\nBy Jordan Gerblick published\nnews You can dress up Joel as Nathan Drake from Uncharted if you play The Last of Us 2's new story mode\nThe 10 best zombie games that will munch your brain\nBy Connor Sheridan last updated\nBest List The best zombie games will leave you craving more (also, brains)\n25 best adventure games to get swept up in right now\nBy Hannah Ryan last updated\nBest List Explore the best adventure games to play in 2025 if you're craving a whole new world at your fingertips\nIntergalactic: The Heretic Prophet apparently has \"RPG progression systems,\" which could be as simple as The Last of Us' supplements or usher in a whole new era\nBy Issy van der Velde published\nnews It's a vague term, so the possibilities are endless\nHorizon and The Last of Us 2 star says there's a risk game devs will say \"let's just have AI\" do voices for NPCs and minor characters: \"We're gonna be losing out on our next generation of great performers\"\nBy Jordan Gerblick published\nnews Aloy actor Ashly Burch says \"I am afraid of some developers trying to use AI to replace performers in roles that I cut my teeth on coming up\"\nWeekly digests, tales from the communities you love, and more"
    },
    {
      "url": "https://www.gamesradar.com/new-tv-shows/",
      "text": "The best new TV shows coming your way in 2025\nFrom Slow Horses to Gen V, these are the best new TV shows still to come this year\nWhen it comes to picking the best new TV shows of 2025, it's tough because there are just so many great options. This year has already seen a slew of hits from multiple streaming services, such as Squid Game season 3 and, most recently, Alien: Earth and Peacemaker season 2. However, despite being over halfway through 2025, there's still plenty more for us to look forward to.\nAugust has been a strong month for TV, giving us some of the most anticipated new DC shows and horror outings of the year. However, looking further ahead, we also have Wednesday season 2 part 2, some more superhero action with a The Boys spin-off, and even the adorable return of one of the best Netflix shows Pokemon Concierge. Basically, there's something for every kind of TV fan still on the streaming horizon, no matter what genre is your go-to choice. There's a lot to get through, but we've decided to highlight our personal top picks still to come.\nSo what are you waiting for? Scroll on down for our handy guide on all the best new TV shows releasing in 2025 on the best streaming services out there, from Netflix and HBO Max, to Apple TV Plus. These shows are in order of release date, too, to make your watchlist a little easier to organize. Happy binge-watching!\nPeacemaker season 2\nRelease date: Out now!\nAvailable on: HBO Max\nJohn Cena returns as Peacemaker (after his Superman cameo) in season 2 of the hit DC show, which has now started to release weekly episodes. The new season is officially part of the new DCU Chapter One: Gods and Monsters, too, and (as we point out in our Peacemaker season 2 review) does a great job at explaining how the character's new DCU place fits despite its previous DCEU status. The series will be running through until October, and you can find out more on when to catch the next episode with our Peacemaker season 2 release schedule guide.\nThe Terminal List: Dark Wolf\nRelease date: August 27, 2025\nAvailable on: Prime Video\nDark Wolf is a new spin-off of Prime Video action thriller The Terminal List. The prequel follows the origin story of Taylor Kitsch's Chief Special Warfare Operator Ben Edwards as he's discharged from the Navy SEALS and forced to join the clandestine side of CIA Special Operations. Chris Pratt also returns as Lieutenant Commander James Reece, and Luke Hemsworth and The Umbrella Academy's Tom Hopper are new additions to the cast.\nBringing all the latest movie news, features, and reviews to your inbox\nWednesday season 2 part 2\nRelease date: Part 2 drops on September 3, 2025\nAvailable on: Netflix\nJenna Ortega made her return as our favorite homicidal maniac in Wednesday season 2 part 1 in August. However, her sophomore year is far from over, as after coming face to face with the Hyde once again (read our Wednesday season 2 part 1 ending explained for more on that), Wednesday looks to have her work cut out for her in season 2 part 2. As Wednesday further investigates what the Avian was really up to, the next part will hopefully answer some of our burning questions, like where is Ophelia, and when will Joker: Folie à Deux star Lady Gaga, whose role is still a mystery, appear in the series.\nPokemon Concierge season 2\nRelease date: September 4, 2025\nAvailable on: Netflix\nThe adorable Pokemon stop-motion series returns to Netflix with a long-awaited second season as new Pokemon Resort employee Haru settles into her role and encounters new challenges – and guests. These include Sealeo, Shinx, Corphish, and Arcanine, as well as her ex-boyfriend…\nOnly Murders in the Building Season 5\nRelease date: September 9, 2025\nAvailable on: Hulu/Disney Plus\nOnly Murders in the Building is one of the best shows on Hulu, so we're delighted to see that we are officially getting a season 5 in just a few days! Starring Steve Martin, Martin Short, and Selena Gomez as our favorite true crime trio, this new season will pick up where season 4's cliffhanger ended. Basically, last season ended with Lester (Teddy Coluca) found dead, so expect a new mystery to unfold soon!\nThe Walking Dead: Daryl Dixon season 3\nRelease date: September 12, 2025\nAvailable on: AMC Plus\nCarol and Daryl swap France for Spain in the third season of The Walking Dead spin-off The Walking Dead: Daryl Dixon. Not so much a European jolly over the summer, but more of a desperate attempt to get back home to the States, the new installment is sure to see everyone's favorite apocalypse survivors face off against decomposing nasties and still-living baddies.\nGen V season 2\nRelease date: September 17, 2025\nAvailable on: Prime Video\nGen V season 2 is bringing us back to Godolkin University, and we can't wait to see what's next. Season 1 ended with the main characters trapped in the lab, and we know that what happened in The Boys season 4 (you know, Homelander taking over the Oval Office) will directly affect Gen V's timeline. This means that the new episodes won't see the Supe students doing much studying, for better or worse. The new season will introduce a mysterious new Dean who preaches a curriculum that promises to make students more powerful than ever, while Marie, Jordan, and Emma deal with months of trauma and loss. The spin-off show is coming back this year ahead of The Boys season 5, so make sure you tune in for the action.\nSlow Horses season 5\nRelease date: September 24, 2025\nAvailable on: Apple TV Plus\nGary Oldman and his team of MI5 rejects are coming back this year for Slow Horses season 5, which has confirmed its release date for September. We can't think of a better way to go back to school, honestly, as we get ready for more unexpected plot twists and espionage action. Based on Mick Herron's book London Rules, the new episodes of the fan-favorite Apple TV Plus show will see everyone feeling suspicious of Roddy Ho's new girlfriend, which will only be the start of a series of bizarre events happening across London. The Slow Horses will have to try to work out how everything is connected.\nChad Powers\nRelease date: September 30, 2025\nAvailable on: Hulu\nHit Man and Twisters star Glen Powell returns to the small screen with new Hulu comedy series Chad Powers. Powell stars as a disgraced college football quarterback, Russ Holliday, who disguises himself as the affable Chad Powers to join a struggling team to reboot his career. The show was co-created by Powell and Avengers: Doomsday screenwriter Michael Waldron.\nMarvel Zombies\nRelease date: October 3, 2025\nAvailable on: Disney Plus\nGet ready to usher in the spooky season with one of our most anticipated upcoming Marvel shows of the year, Marvel Zombies. We first saw the undead superheroes appear on an episode of What If...? years ago, showing us an alternate timeline where Earth's mightiest heroes (and villains) have been turned into zombies. During the series' four episodes, we'll see a group of survivors have to travel and survive on their quest to find a cure. Sign us up!\nStar Wars: Visions season 3\nRelease date: October 29, 2025\nAvailable on: Disney Plus\nOver two years after the last installment, animated anthology series Star Wars: Visions is back for a third season. Consisting of nine new episodes, three of these are sequels to season 1 episodes (The Duel, The Village Bride, and The Ninth Jedi, specifically). This time around, new animation studios enlisted behind the scenes include Polygon Pictures, who recently worked on Your Friendly Neighborhood Spider-Man, and Wit Studio, who also make Spy x Family.\nThe Diplomat season 3\nRelease date: Fall 2025\nAvailable on: Netflix\nKeri Russell returns as Kate Wyler, the US ambassador to the UK, in the third season of Netflix's hit political thriller The Diplomat. Along with returning cast members Rory Kinnear, Rufus Sewell, and Allison Janney, The West Wing's Bradley Whitford joins the cast for the new installment. \"Season 3 flips the chessboard,\" creator Debora Cahn previously told Tudum. \"In season 3, Kate lives the particular nightmare that is getting what you want.\"\nStranger Things season 5\nRelease date: November 26 (Part 1), December 25 (Part 2), December 31 (Part 3)\nAvailable on: Netflix\nStranger Things season 5 is the final installment in the hit Netflix show, which means it's not one to miss. So far, the plot is shrouded in mystery, but we're expecting an emotional send-off for the Hawkins cohort. \"We know what the ending is,\" Matt Duffer previously said during an interview with our sister publication SFX. \"It's conceivable that it changes, but I think it's unlikely because it's one of those endings that just feels, and has always felt, right. It also feels sort of inevitable. Then when you come up with it, you're like, 'Oh yeah, well, that is absolutely what it has to be.'\"\nPercy Jackson and the Olympians season 2\nRelease date: December 10, 2025\nAvailable on: Disney Plus\nPercy Jackson and the Olympians, one of Disney Plus' biggest original shows ever, finally returns for season 2 this December. Based on the series of YA books by Rick Riordan, the show follows the adventures of Percy, a tweenage demigod and the son of Poseidon, and his best friends Annabeth and Grover. After season 1's mishaps, Percy and pals return to Camp Half Blood one year later only to find more trouble waiting for them: they're under threat from Kronos, and Percy must venture into the Sea of Monsters to find the Golden Fleece to save them.\nWonder Man\nRelease date: December 2025\nAvailable on: Disney Plus\nYahya Abdul-Mateen II stars in this new Marvel show as Wonder Man, which was first announced back in 2022. The show follows Simon Williams, a superpowered actor and stuntman, who finds himself up for the role of a lifetime: the lead in a superhero TV show. Shang-Chi and the Legend of the Ten Rings director Destin Daniel Cretton and Hawkeye's Andrew Guest are on board as showrunners, and Ben Kingsley returns as Trevor Slattery.\nIt: Welcome to Derry\nRelease date: TBC 2025\nAvailable on: Max\nThis show is set to explore the origins of Pennywise, focused on the Hanlon family (Mike Hanlon is one of the kids in the Losers Club). \"It's so rich with characters and events, we thought we would do justice to the book and the fans by going back into this world,\" Andy and Barbara Muschietti told EW of the show. \"Specifically, we are telling the stories of the interludes, writings by Mike Hanlon based on his investigation that includes interviews he conducts with the older people in the town. In Welcome to Derry, we touch on the usual themes that were talked about in the movie – friendship, loss, the power of unified belief – but this story also focuses on the use of fear as a weapon, which is one of the things that is also relevant to our times.\"\nFor more on new releases, check out our lists of the most exciting movie release dates to look out for and upcoming DC movies and shows.\nI’m the Deputy Entertainment Editor here at GamesRadar+, covering TV and film for the Total Film and SFX sections online. I previously worked as a Senior Showbiz Reporter and SEO TV reporter at Express Online for three years. I've also written for The Resident magazines and Amateur Photographer, before specializing in entertainment.\n- Megan GarsideEditorial Associate, GamesRadar+\n- Mireia MullorContributing Writer\n- Emily GarbuttEntertainment Writer\n- Bradley Russell\n- Amy West\n- Molly EdwardsDeputy Entertainment Editor\n- Lauren MiliciSenior Entertainment Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Bella Ramsey deflects criticism of The Last of Us season 2, while co‑creator Craig Mazin confirms he will run season 3 alone after Neil Druckmann and Halley Gross depart to focus on Naughty Dog’s new game, Intergalactic: The Heretic Prophet. Mazin says season 3 will be longer than season 2 and more comparable to season 1, with a primary focus on Abby’s perspective. HBO’s Casey Bloys hints the series could end with either two more seasons or a single extended season, and the show’s future remains tied to the creative team’s decisions as they adapt the game’s remaining story.",
  "argos_id": "EAJLYR9K4"
}