{
  "url": "https://www.cnn.com/2025/08/28/us/5-things-to-know-for-august-28-cdc-minneapolis-school-shooting-ukraine-israel-hamas-war-sex-education",
  "authorsByline": "",
  "articleId": "a93dda2cc6e74ee0888166b69b4a66ca",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2222107417.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T10:34:18.657000+00:00",
  "addDate": "2025-08-28T10:43:08.253842+00:00",
  "refreshDate": "2025-08-28T10:43:08.253845+00:00",
  "score": 1.0,
  "title": "5 things to know for August 28: CDC, Minneapolis school shooting, Ukraine, Israel-Hamas war, Sex education",
  "description": "CNN’s 5 Things AM brings you the news you need to know every morning.",
  "content": "There are only two northern white rhinos left on Earth. Due to the constant threat of poachers, they are protected 24/7 by armed guards. Now, a new documentary chronicles the fight to save these creatures from extinction.\n\nHere’s what else you need to know to get up to speed and on with your day.\n\nThe CDC has been left leaderless after Director Dr. Susan Monarez was ousted by the White House on Wednesday. Although she had only been working at the CDC since July 31, Monarez was “not aligned with the President’s agenda of Making America Healthy Again,” a White House spokesperson said in a statement. According to people familiar with the situation, Monarez recently clashed with HHS Secretary Robert F. Kennedy Jr. and his team over vaccine policies and personnel matters. Following her departure, three other high-level veteran agency officials resigned. “When CDC Director Susan Monarez refused to rubber-stamp unscientific, reckless directives and fire dedicated health experts, she chose protecting the public over serving a political agenda,” Monarez’s attorneys said in a statement. Morale was already low at the agency due to mass layoffs in the spring and a deadly shooting at the CDC headquarters in Atlanta earlier this month.\n\nInvestigators are working to understand what may have motivated a shooter to open fire on the Annunciation Catholic Church and School in Minneapolis on Wednesday, killing two children. Three elderly parishioners and 14 other children were wounded in the attack. The shooter, who had no prior criminal history and died of a self-inflicted wound, posted a “manifesto” online that authorities are reviewing. According to a CNN analysis, it was the 44th school shooting in the US this year. After visiting the scene, Minneapolis Mayor Jacob Frey issued a call to action. “This has happened in other countries and guess what, they do something about it. We gotta do something about it here,” he told CNN’s Erin Burnett. Frey’s message was echoed by Annunciation principal Matthew DeBoer: “We as a community have a responsibility to make sure that no child, no parent, no teacher ever has to experience what we’ve experienced today — ever again.” Several Democratic leaders have also renewed calls to address gun violence.\n\nRussia’s latest attack on Kyiv overnight killed at least 15 people, including four children, and wounded dozens of others. There may be additional victims trapped under the rubble; some 500 rescuers and 1,000 police officers have been tasked with searching multiple locations for survivors. The missile and drone strike is the latest in a series of assaults Russia has conducted on Ukraine and comes just over two weeks after President Donald Trump held talks with Russian President Vladimir Putin in Alaska. That summit was followed by planning for a bilateral meeting between Putin and Ukrainian President Volodymyr Zelensky, but that has not taken place, and diplomatic efforts to end the war seem to have stalled. “These Russian missiles and attack drones today are a clear response to everyone in the world who, for weeks and months, has been calling for a ceasefire and for real diplomacy,” Zelensky said on X.\n\nThere appears to be a major disconnect happening in Israel between many of its citizens and the country’s leadership. As hundreds of thousands of demonstrators take to the streets, demanding a ceasefire and the return of the hostages held by Hamas, Prime Minister Benjamin Netanyahu has been speaking about “the unity of the people” and proclaiming that Israel is on “the path to victory” as it moves to escalate the 22-month war in Gaza. In response to the rallies, Netanyahu and his allies have denounced the protesters — including the families of the hostages — and accused them of aiding Hamas. Israel is facing international condemnation as well for its assault on the biggest hospital in southern Gaza, a back-to-back attack that killed at least 22 people. New video obtained by CNN provided more details about the bombing, including the fact that there was a third strike.\n\nThe Trump administration is threatening to pull millions in federal funding from sex education programs for merely mentioning gender identity or transgender people. A division of the Department of Health and Human Services told 40 states, five territories and the District of Columbia that they “are now on notice.” “Federal funds will not be used to poison the minds of the next generation or advance dangerous ideological agendas,” Acting Assistant HHS Secretary Andrew Gradison said. Although the federal government had already approved the curriculum before the funds were granted to the states or territories, the Administration for Children and Families later identified program materials that it said fell “outside of the scope” of the State Personal Responsibility Education Program. The affected states and territories have 60 days to remove the inclusive language.\n\nOne of them even belonged to royalty.\n\nSuch observations could shed light on one of the most mysterious cosmic phenomena ever studied.\n\nMIT researchers are buzzing about new robot\n\nThe machine weighs less than a paperclip, can fly 6.5 feet per second and may someday work on other planets.\n\nYet a recent study showed 26% of men under the age of 45 are participating in it.\n\nGreen it like you mean it\n\nSimple changes can make a profound difference in creating a sustainable college campus. Here are five to try.\n\n6 in 10\n\nThat’s how many teachers used an AI tool for work in the 2024-2025 school year, according to a study from the Walton Family Foundation and Gallup.\n\nMalick is a coordinator at a “school for husbands” in Senegal. The UN-backed initiative helps respected male community members learn about “positive masculinity” in health and social issues and promote it in their communities.\n\n🌤️ Check your local forecast to see what you can expect.\n\nHowever, the building-sized object’s revised trajectory is drawing attention to another possible target.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/2025/08/28/world/video/gaza-double-tap-attack-israel-hancocks-digvid",
    "https://www.cnn.com/2025/08/27/middleeast/netanyahu-israel-protests-gaza-analysis-intl",
    "https://www.cnn.com/2025/08/27/politics/democrats-gun-control-minneapolis",
    "https://www.cnn.com/",
    "https://www.cnn.com/2025/08/28/politics/rfk-susan-monarez-cdc-director-ousted-vaccines-analysis",
    "https://www.cnn.com/2025/08/27/health/college-students-practice-sustainability-wellness",
    "https://www.cnn.com/2025/08/28/us/annunciation-catholic-school-shooting-minneapolis",
    "https://www.cnn.com/2025/08/27/health/trump-sex-ed-programs-transgender-people",
    "https://www.cnn.com/2025/08/24/science/video/lunaer-asteroid-2024-yr4-collision-moon-digvid",
    "https://www.cnn.com/2025/08/27/health/cdc-director-monarez",
    "https://www.cnn.com/2025/08/27/europe/france-skulls-king-toera-madagascar-intl-scli",
    "https://www.cnn.com/us/live-news/minneapolis-annunciation-catholic-school-shooting-08-28-25",
    "https://www.cnn.com/2025/08/26/science/brightest-fast-radio-burst",
    "https://www.cnn.com/2025/08/23/business/sports-gambling-risk-young-men",
    "https://www.cnn.com/2025/08/26/tech/openai-classroom-software-students",
    "https://www.cnn.com/science/mit-insect-robots-mars-hnk-spc",
    "https://www.cnn.com/follow",
    "https://www.cnn.com/2025/08/28/europe/ukraine-russia-kyiv-attack-hnk-intl",
    "https://www.cnn.com/2025/08/19/africa/senegal-school-husband-childbirth-hiv-latam-intl",
    "https://www.cnn.com/science/northern-white-rhinos-national-geographic-documentary-c2e-hnk-spc",
    "https://www.cnn.com/weather",
    "https://www.cnn.com/specials/5-things?source=5_things_article"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "CDC Director Susan Monarez",
      "weight": 0.057977475
    },
    {
      "name": "Minneapolis school shooting",
      "weight": 0.057217773
    },
    {
      "name": "Director Dr. Susan Monarez",
      "weight": 0.051650394
    },
    {
      "name": "Susan Monarez",
      "weight": 0.05079086
    },
    {
      "name": "Ukrainian President Volodymyr Zelensky",
      "weight": 0.04813174
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.047716588
    },
    {
      "name": "Minneapolis Mayor Jacob Frey",
      "weight": 0.04670531
    },
    {
      "name": "President Donald Trump",
      "weight": 0.046233576
    },
    {
      "name": "HHS Secretary Robert F. Kennedy Jr.",
      "weight": 0.04562452
    },
    {
      "name": "Monarez",
      "weight": 0.04552892
    }
  ],
  "topics": [
    {
      "name": "CDC"
    },
    {
      "name": "US Politics"
    },
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Health"
    },
    {
      "name": "Politics"
    },
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.95947265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.95263671875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.767578125
    }
  ],
  "sentiment": {
    "positive": 0.034550868,
    "negative": 0.8436564,
    "neutral": 0.121792704
  },
  "summary": "The CDC has been left leaderless after Director Susan Monarez was ousted by the White House. Monarez reportedly aligned with President Barack Obama's agenda of Making America Healthy Again and clashed with HHS Secretary Robert F. Kennedy Jr. over vaccine policies and personnel matters. Three other high-level veteran agency officials resigned following Monarez's departure. The Minneapolis school shooting left two children dead and 14 others wounded, marking the 44th school shooting in the US this year. Russia's latest missile and drone strike on Ukraine killed at least 15 people, including four children, and wounded dozens of others. The Trump administration is threatening to pull millions from federal funding for sex education programs in 40 states and five districts. Israel is facing international condemnation for its assault on the largest hospital in southern Gaza.",
  "shortSummary": "A deadly Minneapolis school shooting, the CDC leadership departure, Russia's deadly attack on Ukraine, Israel-Hamas war, and changes in federal funding and sex education policies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "330f620c1552495db5481890871dc9ad",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2025/08/27/health/cdc-director-monarez",
      "text": "Dr. Susan Monarez, who was sworn in as director of the US Centers for Disease Control and Prevention on July 31, has been removed from the position, the White House said Wednesday.\nHer departure was quickly followed by the resignation of several high-level veteran agency officials, leaving the CDC leaderless at a perilous time.\nMorale, which was already low after deep staff cuts this spring, plummeted after a gunman opened fire on the agency’s main campus in Atlanta on August 8, pocking the buildings with hundreds of bullet holes and killing DeKalb County Police Officer David Rose. Shortly afterward, a further 600 employees got official termination notices.\n“Susan Monarez is not aligned with the President’s agenda of Making America Healthy Again,” White House spokesperson Kush Desai said in a statement. “Since Susan Monarez refused to resign despite informing HHS leadership of her intent to do so, the White House has terminated Monarez from her position with the CDC.”\nMonarez’s attorneys, Mark Zaid and Abbe Lowell, said they rejected the notification their client had received.\n“Our client was notified tonight by White House staff in the personnel office that she was fired. As a presidential appointee, senate confirmed officer, only the president himself can fire her,” Zaid and Lowell said in a statement. “For this reason, we reject notification Dr. Monarez has received as legally deficient and she remains as CDC Director. We have notified the White House Counsel of our position.”\nIn a statement earlier Wednesday, the attorneys disputed the White House’s version of events and said, “As a person of integrity and devoted to science, she will not resign.”\nThe US Department of Health and Human Services said in a post on X on Wednesday, “Susan Monarez is no longer director of the Centers for Disease Control and Prevention. We thank her for her dedicated service to the American people. [HHS Secretary Robert F. Kennedy Jr.] has full confidence in his team at @CDCgov who will continue to be vigilant in protecting Americans against infectious diseases at home and abroad.”\nHHS has not named an acting director to lead the CDC.\nThe ouster was first reported by the Washington Post.\nOther high-level leaders depart\nShortly after Monarez’s departure was confirmed Wednesday, three other top CDC officials also announced that they were leaving. Dr. Debra Houry, the agency’s chief medical officer and deputy director of programs and science; Dr. Demetre Daskalakis, director of the National Center for Immunization and Respiratory Diseases; and Dr. Dan Jernigan, director of the National Center for Emerging and Zoonotic Infectious Diseases, were agency veterans whom staffers said were well-liked and trusted.\n“For the good of the nation and the world, the science at CDC should never be censored or subject to political pauses and interpretations,” Houry wrote in a resignation email to staff that was shared with CNN.\n“Vaccines save lives – this is an indisputable, well-established scientific fact,” she said. “Informed consent and shared decision-making must focus not only on the risks, but also on the true lifesaving benefits that vaccines provide to individuals and communities.”\nWhile it is important to question and analyze research, “this must be done by experts with the right skills and experience, without bias, and considering the full weight of scientific evidence,” she wrote.\nHoury then said that misinformation has already cost lives, citing the record high number of measles cases in the US this year.\nDaskalakis shared his resignation email to Houry in a post on X.\n“It is untenable to serve in an organization that is not afforded the opportunity to discuss decisions of scientific and public health importance released under the moniker of CDC,” he wrote. “The lack of communication by HHS and other CDC political leadership that culminates in social media posts announcing major policy changes without prior notice demonstrate a disregard of normal communication channels and common sense. Having to retrofit analyses and policy actions to match inadequately thought-out announcements in poorly scripted videos or page long X posts should not be how organizations responsible for the health of people should function.”\nDr. Jennifer Layden, director of the Office of Public Health Data, Surveillance, and Technology, also left the CDC on Wednesday, according to a source familiar with the situation who asked not to be named because they weren’t authorized to share the information.\n“Our agency is crumbling,” said a source within the CDC who is not allowed to speak to the news media and did not want to be identified for fear of retribution. “All of our top people who kept us protected … from the new administration. From twisting science for their agenda. Science is data and facts. We’re simple people that way … we trust numbers and facts.\n“The bullet holes aren’t even repaired on our buildings.”\nClashes with Kennedy\nMonarez’s ouster followed days of internal pressure led by Kennedy’s deputy chief of staff and close confidante, Stefanie Spear, according to two people familiar with the situation. It also came soon after Kennedy summoned Monarez to Washington and demanded that she fire Houry, Jernigan and Daskalakis, according to two people familiar with the matter. Monarez refused, angering Kennedy and triggering his move to remove her.\nMonarez also clashed with Kennedy and his team over vaccine policies, including an impending announcement that could draw links between immunizations and autism, according to a person familiar with the situation.\nKennedy suggested in a Tuesday meeting of President Donald Trump’s Cabinet that HHS would reveal research in September showing that “certain interventions now are clearly, almost certainly, causing autism.” Trump responded that “there has to be something artificially causing this, meaning, a drug or something.”\nThe CDC is readying to announce a new slate of appointees to its Advisory Committee on Immunization Practices in the coming weeks, according to a source who spoke on condition of anonymity. Kennedy dissolved the panel of independent vaccine advisers in June and days later named eight new members, many of whom have cast doubt on the safety of vaccines and public policy around vaccination. One member later dropped out during the required financial review.\nAttorneys Zaid and Lowell said in their statement that “Secretary Kennedy and HHS have set their sights on weaponizing public health for political gain and putting millions of American lives at risk.”\n“When CDC Director Susan Monarez refused to rubber-stamp unscientific, reckless directives and fire dedicated health experts, she chose protecting the public over serving a political agenda. For that, she has been targeted,” they wrote. “This is not about one official. It is about the systematic dismantling of public health institutions, the silencing of experts, and the dangerous politicization of science.”\nUS Sen. Patty Murray, a Washington Democrat and a senior member of the Senate Health, Education, Labor and Pensions Committee, called for Kennedy’s own ouster on Wednesday.\n“Susan Monarez’s willingness to stand up for science and protect the integrity of the CDC is commendable and deeply important – however, it only further underscores the reality at HHS: Director Monarez is not the problem, RFK Jr. is. If there are any adults left in the White House, it’s well past time they face reality and fire RFK Jr.,” she said in a statement. “He is a dangerous man who is determined to abuse his authority to act on truly terrifying conspiracy theories and disinformation – leaving us unprepared for the next deadly pandemic and snuffing out potential cures while he’s at it.”\nMonarez was President Donald Trump’s second pick to lead the CDC; the nomination of Dr. Dave Weldon was withdrawn in March after White House officials privately voiced concerns about his comments expressing skepticism about vaccines.\nShe was the first CDC director to be confirmed by the Senate, and her tenure was the shortest of any in the agency’s history.\nMonarez was principal deputy director and acting director at the CDC from January to March. She has a Ph.D. in microbiology and immunology but is not a medical doctor, making her the first CDC director since the 1950s not to have a clinical background.\nMonarez’s tenure in government spans Republican and Democratic administrations. Before coming to the CDC, she was deputy director for the Advance Research Projects Agency for Health, or ARPA-H, and was founding director of the Center for Innovation at the Health Resources and Services Administration. She held other leadership positions at the Department of Homeland Security and the Biomedical Advanced Research and Development Authority.\nIn a news release the day of her swearing-in, Kennedy said that Monarez had “unimpeachable scientific credentials” and that he had full confidence in her ability to restore Americans’ trust in the agency.\n“It is a great honor to join Secretary Kennedy and his HHS leadership team,” Monarez said in the news release. “I consider it a privilege to work alongside the public servants at CDC. Together we will strengthen and modernize the nation’s public health preparedness and response through science and innovation. We will work every day at CDC to Make America Healthy Again.”\nThe public health world was stunned by Wednesday’s shakeup.\n“For 80 years, CDC has been a beacon of health protection for the United States and the world,” former agency Director Dr. Tom Frieden said in a post on LinkedIn. “That beacon is now in grave danger of being extinguished, endangering all of our health. Eroding health protection capacity at the top further undermines trust at a time when it is most needed.”\nJennifer Nuzzo, director of the Pandemic Center at Brown University’s School of Public Health, told CNN that “if these reports are true, the firing of Susan Monarez represents a very dangerous turn for American health.\n“It is essential that the director of CDC yielded to evidence and not political whims and disinformation. If the CDC director was fired because she would not embrace Secretary Kennedy’s lies about vaccines, then we have entered a truly dangerous time for US health and security,” she said. “Continuing to dismantle our evidence-based public health system exposes America to dangerous threats, including the possibility of a biological attack. Our adversaries are watching.”\nFormer CDC Principal Deputy Director Dr. Nirav Shah told CNN on Wednesday that Monarez’s ouster “is another example of the chaotic leadership we’ve seen under Secretary Kennedy, and in times of increasing public health threats, stable leadership matters.”\n“The instability we’re seeing at CDC will not help making Americans healthy again.”\nCNN’s Michelle Krupa contributed to this report."
    },
    {
      "url": "https://www.cnn.com/science/northern-white-rhinos-national-geographic-documentary-c2e-hnk-spc",
      "text": "EDITOR’S NOTE: Call to Earth is a CNN editorial series committed to reporting on the environmental challenges facing our planet, together with the solutions. Rolex’s Perpetual Planet Initiative has partnered with CNN to drive awareness and education around key sustainability issues and to inspire positive action.\nAt a nature reserve in central Kenya, the last two northern white rhinos in existence live under the 24/7 protection of armed guards.\nThe subspecies has been driven to near extinction by decades of poaching and civil war in its range of central Africa.\nA new documentary, “The Last Rhinos: A New Hope,” which premiered on National Geographic on August 24, and is now streaming on Disney+ and Hulu, chronicles the fight to save the northern white.\nThe film opens with the last, ragged breaths of a male rhino named Sudan. In 2018, the animal was euthanized at the age of 45 due to poor health, leaving the now 36-year-old female Najin and her 25-year-old daughter Fatu as the last members of their subspecies on Earth.\nOver 40-some minutes, photographer Ami Vitale, who has been documenting the rhinos since 2009, highlights their plight, the scientists who have dedicated their lives to trying to revive the subspecies, and the caretakers that spend more time with the animals than their own families.\nThe high-stakes process to save them includes in vitro fertilization (IVF) combining sperm collected from males before they died, and oocytes, egg cells, collected from Fatu. Najin is no longer healthy enough to provide eggs to the program.\nThis year, BioRescue, a consortium working to save the rhinos, has performed three oocyte collections from Fatu. In total, the team has produced 38 northern white rhino embryos.\nNeither Najin nor Fatu can carry babies for various health reasons, so the team is using closely related southern white rhinos as surrogates. “None of this has ever been done before,” says Vitale, in the movie. “It’s a scientific first.”\nThe film also sheds light on some of the project’s triumphs and heartbreaks. In late 2023, a 13-year-old southern white rhino named Curra died from a bacterial infection. A postmortem investigation found a 70-day-northern-white-fetus in her womb – the world’s first IVF rhino pregnancy.\n“It perfectly captures the pressure that we work under,” says Jan Stejskal, the main coordinator of BioRescue and the director of communication and international projects at Safari Park Dvůr Králové in the Czech Republic.\nHe adds that it’s difficult to convey some elements of the effort, like how much collaboration is required.\nToday, there are five surviving rhino species across Africa and Asia. Only about 17,000 southern white rhinos remain, mostly in South Africa, and they’re classified as “near threatened” by the International Union for Conservation of Nature.\nOthers face worse prospects. In Indonesia, for example, there are about 50 living Javan rhinos, according to the International Rhino Foundation. The hairy, two-horned Sumatran rhino isn’t faring better, with less than 50 individuals in the wild.\nStejskal says the IVF project could prove valuable for working with other species in the future.\nBut there are immense challenges in carrying out a complicated medical process in creatures that weigh thousands of pounds – including getting the dosage of anesthesia right when collecting eggs and making sure the scientists don’t get hurt.\nStejskal adds that the thawing of an embryo needs to be timed to match when the female rhino can be sedated for implantation. “Sometimes the animal is sedated in seven minutes,” he says, “sometimes it takes 47 minutes.”\nNo northern white rhino embryos have yet developed into a successful full-term pregnancy. Still, Stejskal says that he is hopeful that will happen in the foreseeable future.\nIn the meantime, he hopes the documentary helps raise awareness of the advancing reproductive technology getting closer to becoming a reality. “We have to try to involve these approaches into wider conservation efforts,” he says.\nBut he’s careful to add that advancing technology should not be used as an excuse to continue depleting nature.\nAnna Tunkova contributed to this story."
    },
    {
      "url": "https://www.cnn.com/us/live-news/minneapolis-annunciation-catholic-school-shooting-08-28-25",
      "text": "What we're covering\n• Minneapolis is in mourning after a shooter fired on praying students through the windows of a church yesterday, killing two children. Seventeen others were wounded, most of them are children who were marking the first week of classes at Annunciation Catholic School. It’s unclear when classes will resume.\n• The shooter, now dead, was identified as 23-year-old Robin Westman. Westman shared a “manifesto” on social media that is being investigated, police said. The shooter graduated from the school in 2017.\n• The attack is the latest in a string of deadly shootings in Minnesota. It is also the 44th school shooting in the US this year, according to a CNN analysis. It has prompted some Democrats to renew calls for gun control.\nWatch: Here’s what you need to know about the Minneapolis shooting\nHere’s what you need to know about the shooting at a Minneapolis Catholic school Mass on Wednesday that left two children dead and 17 people wounded.\nWatch the full report for details:\nPrayer services and news conference set for today\nAs investigators in Minneapolis continue to comb through evidence in Wednesday’s shooting at Annunciation Catholic School and school officials weigh how to move forward, there are several opportunities Thursday for community members to come together.\n- Noon CT: A prayer service of peace and healing will be held at the Cathedral of St. Paul.\n- 1 p.m. CT: A news conference will be held at Minneapolis City Hall. Minnesota lawmakers, gun violence prevention advocates and clergy members are expected to attend.\n- 5:30 p.m. CT: An interfaith service will be held at the Basilica of St. Mary in Minneapolis.\nHere are some of the heroes who helped during the Minneapolis shooting\nYesterday’s shooting at a Minneapolis Catholic school Mass terrified the community, but people still acted bravely to protect each other.\nHere are some of the ways in which people helped others during the crisis:\nAdults and children protected others: Teachers and older children helped shield others as bullets zipped through the air, preventing the situation from becoming “significantly worse,” Annunciation Catholic School principal Matt DeBoer. A fifth grader at the school, Weston Halsne, said his friend shielded him from gunfire. His friend was wounded and taken to the hospital, he said. Minneapolis Mayor Jacob Frey expressed gratitude for school staff, who he said “threw their bodies on top of children” to protect them.\nNeighbor ran to help: Pat Scallen, who lives down the street from the church, ran the second he heard gunfire. When he got there, the shots had stopped, but three children came out of the church, two of them badly wounded, he recounted. Scallen helped comfort the kids while they waited for an ambulance. “I felt it was important to calm them down and let them know that someone was with them and help was on the way,” he said.\nOfficer cared for student shot in the stomach: A 13-year-old boy shot in the stomach was helped by a police officer who “rendered aid, hugged him, reassured him, and prayed with him before getting into the ambulance,” his mother Danielle Gunter said. The 13-year-old was taken to the hospital and is out of surgery, Gunter said.\nBeat officer went after shooter: An officer responding to the shooting left the church to chase after the suspect, parent Shea McAdaragh recounted. The officer had “no special equipment, no special helmet or anything and he just immediately ran toward the direction of the shooter,” he said. McAdaragh was sitting with his second-grade son, who was not wounded.\nFather whose daughter witnessed shooting says she does not feel safe after attack\nChef Vincent Francoual told CNN’s Laura Coates his daughter, who was in Mass at Annunciation Catholic School, is traumatized after surviving the deadly shooting.\nNo timetable for school to resume as investigators comb shooting scene\nIt’s unclear when classes will resume at Annunciation Catholic School after the deadly shooting attack during students’ first week of class.\nPrincipal Matthew DeBoer and Pastor Dennis Zehren mourned the loss of two “beloved students” killed in Wednesday’s attack and called for prayers in an update to the school and Annunciation Church community. The message said the school and church were working with “a myriad of professional agencies” and that it would take time for the community to get back on its feet.\nSchool officials will also announce available support services in coming days, according to the message, which stressed unity as students, parishoners and their families endure “an impossible situation together.”\nMinneapolis is mourning two children shot dead alongside their classmates at church. Here's what we know\nYesterday, a shooter opened fire through the stained-glass windows of a Minneapolis church, where children were attending a Mass to mark the first week of class at Annunciation Catholic School.\nThe shooter killed two children, aged 8 and 10 years old, and wounded 17 others – including 14 kids and three parishioners in their 80s. All of the wounded are expected to survive, officials said.\nMinnesota Gov. Tim Walz and other leaders encouraged people to move beyond platitudes toward action to curb gun violence in America, a call echoed by Minneapolis’ mayor.\nThe attack adds to a string of deadly shootings in Minnesota and was the fourth in 24 hours. It is also the 44th school shooting in the US this year, and has prompted some Democrats to renew calls for gun control.\nHere’s the latest from Minneapolis:\n- The shooting: As people were filing into church, a shooter dressed in black approached the outside of the sanctuary and shot through the windows toward children in the pews. The shooter had placed wooden two-by-fours through the door handles of two exits of the church. Police said locked doors during Mass may have hampered the attack.\n- The victims: Fifth grader Weston Halsne said his friend, who shielded him from gunfire, was wounded in the back as they hid under the pews. Children also described helping others take cover, as they had practiced during training drills, police said. Minnesota Sen. Amy Klobuchar said the daughter of one of her former employees watched her friends get shot.\n- The shooter: 23-year-old Robin Westman died of a self-inflicted gunshot wound behind the church after the shooting, officials said. The shooter graduated from Annunciation in 2017, and Westman’s mother worked at the school from 2016 to 2021. Five years ago, the shooter’s name was changed from Robert to Robin because Westman identified as female, a judge wrote. Westman’s uncle is Bob Heleringer, a former Kentucky lawmaker, who called the attack “an unspeakable tragedy.”\n- The weapons: Westman was armed with a legally and recently purchased rifle, shotgun and pistol. Authorities believe all three weapons were fired. In Minnesota, a permit is needed to purchase firearms and also to carry them in public.\n- The investigation: Westman had no prior criminal history and police believe the shooter acted alone. The FBI said the agency was investigating the attack as “an act of domestic terrorism and hate crimes targeting Catholics,” and police are investigating a “manifesto” Westman shared on YouTube. Read more about the manifesto here.\nMayor calls for Minneapolis to become \"a city united in action\" to stop gun violence\nMinneapolis Mayor Jacob Frey is urging his city’s residents to take action against gun violence after yesterday’s deadly shooting at Annunciation Catholic Church, telling attendees at a candlelight vigil last night that “while thoughts and prayers are great, they are not adequate.”\nThe Democratic mayor echoed lawmakers in his party who have renewed calls for stronger gun control measures after the attack.\n“What we know is that far too often people are robbed of (their kids’) childhood because of this senseless gun violence,” Frey said."
    },
    {
      "url": "https://www.cnn.com/2025/08/27/health/trump-sex-ed-programs-transgender-people",
      "text": "A division of the US Department of Health and Human Services told 40 states, five territories and the District of Columbia on Tuesday that they “are now on notice”: Some federally funded sex ed programs need to remove any mention of gender identity or transgender people, even in passing, or risk losing potentially millions of dollars\nThe letter from the Trump administration says the programs need to remove “gender ideology content” from sex ed materials paid for through the State Personal Responsibility Education Program, which was created by the Affordable Care Act.\n“Accountability is coming,” Acting Assistant HHS Secretary Andrew Gradison said in a news release Tuesday. “Federal funds will not be used to poison the minds of the next generation or advance dangerous ideological agendas.”\nBegun in 2010, PREP’s ultimate goal is to prevent pregnancy and sexually transmitted infections, according to the US Family and Youth Services Bureau, an office of the Administration for Children & Families within HHS. Programs are meant to target groups including homeless youth, kids in foster care, people living in rural areas or areas with high teen birth rates, and young people who identify as being from “minority groups (including sexual minorities).”\nIndividual program details vary by state, but to get funding through the Personal Responsibility Education Program, they must design curricula that teach young people about abstinence and contraception.\nThe federal government had already approved the curriculum and program language before the funds were granted to the states or territories. But in April, ahead of a “medical accuracy review,” the letters said, the Administration for Children and Families identified program materials that “fall outside of the scope” of PREP: Most of the programs mention gender identity or transgender people in some fashion. According to the new letter, even a mere mention puts federal funds at risk.\nIn Alabama, for example, the administration pointed to three examples in which “subjects and language are outside the scope of the authorizing statute and all references to it must be removed.”\nTwo of Alabama’s “Making Proud Choices!” facilitator curricula instruct the teacher to explain why some people use pronouns that don’t align with their appearance.\nWhen people introduce themselves and share their pronouns, the facilitator is instructed to explain, it “is a way of creating a safe space for transgender or gender nonconforming youth.”\n“The simple act of requesting pronouns sends the message that transgender and gender nonconforming youth are welcome and respected in the group,” the curricula say.\nThe Trump administration also says that the curricula’s “Respect Diversity” section needs to change. That section explains that people have different family backgrounds and come from different racial and cultural groups and different living situations.\n“Some may identify as gay, lesbian, bisexual or straight. Some may identify as male, female or transgender. All of these differences make us unique. Regardless of how you see yourself, your background, previous relationships or experience, each of you has a place in this group. This will be (a) safe place for everyone,” the Alabama program says.\nMaking such a sex ed program inclusive of transgender people is, the administration’s letter says, “irrelevant to teaching abstinence and contraception and unrelated to any of the adult preparation subjects.” The letter further states that “gender ideology is outside the scope” of such programs and that any expenditure associated with it is not “allowable, reasonable, or allocable.”\nAlabama’s Department of Health told CNN that it got the information from HHS on Tuesday morning. “At this time, no educational programs using any of this curriculum are being conducted or planned in the state of Alabama,” the agency said in a statement. “ADPH will continue to promptly review any information received from the federal level and make adjustments as advised.”\nThe states and territories were given 60 days to remove inclusive language or face the suspension or termination of the federal award.\nNew York stands to lose the most money – more than $6 million – if it does not comply with the Trump administration demands. Pennsylvania gets more than $4.6 million in PREP funding, Georgia gets more than $4.5 million, Ohio gets more than $4.2 million, and Alabama would be at risk of losing more than $2 million if it doesn’t comply with the changes laid out in the new letter.\nThe administration separately terminated California’s grant, worth about $12.3 million, last week after HHS said the state “failed to meet its demand to remove gender ideology from all its education materials.”\nA spokesperson for the New York State Department of Health said in a statement that it has “received the letter and is reviewing the information” and that the department’s mission remains the same. “We will continue to promote and protect health and well-being for all, building on a foundation of health equity.”\nA spokesperson for the Georgia Department of Human Services said in an email, “We are reviewing and will immediately instruct the PREP contractors to update the curricula and materials to ensure full compliance as we remove sections required under the prior administration.”\nOnly 2.8 million people ages 13 and older identify as transgender in the United States, according to the Williams Institute, but the Trump administration has prioritized limiting the community’s rights and even denying its existence.\nFederal initiatives have included removing trans people from hate crime surveys, kicking them out of the military and removing any mention of trans people on government websites.\nRemoving transgender people from sex ed programs will be damaging, said Debra Hauser, president of Advocates for Youth, a nonprofit that creates programs to educate young people about their sexual health, who has designed sex ed programs and national standards for decades.\n“For young people – any young people – to feel engaged and for them to learn from a program like this, they need to feel reflected and included and affirmed,” Hauser said. “That’s super important for helping young people to actually not just delay sexual initiation and adolescent pregnancy but to also thrive and become sexually healthy adults.”\nHauser notes that the American Medical Association, the American Academy of Pediatrics and the American Psychological Association all support educating young people about gender identity. Eliminating even the smallest mention of transgender people in these programs is “unconscionable,” she said.\n“This is not a decision based on science, this is really about politics, this is about their ideology. It’s not what young people need” Hauser said. “That’s what’s so frustrating and so unconscionable, to take a group of young people that are some of our most vulnerable and to further demonize them, and to get that message from the federal government, it’s absolutely outrageous, and it leaves me speechless.”"
    },
    {
      "url": "https://www.cnn.com/2025/08/27/health/college-students-practice-sustainability-wellness",
      "text": "If you told me four years ago that I’d be living a sustainable life, I wouldn’t have known what that meant.\nWith the planet getting warmer and more people viewing global warming as a serious threat, there is no better time to act than now. At least, that’s the message we keep getting.\nBut as an incoming college student, what can you do?\nFor the past four years, I’ve been living on a green campus surrounded by recycling and composting cans and “what to do” signage. But it can still be hard to navigate all the guidance, especially coming from a household that didn’t know much about sustainable living.\nI turned to my university’s top sustainability official, who told me that taking steps to go green doesn’t have to be difficult.\nSimple changes can make a profound difference in creating a sustainable campus, and now that students are going back to school, it’s a great time to think about what you can do, said Ciannat Howett, Emory University’s vice president of resilience, sustainability and economic inclusion.\nThe impact of a college campus “is very much like a small city,” Howett said. “It’s energy, water, waste, transportation, food, the built environment — but what we’re doing is bringing together the research, the teaching and the operational part to create … a living laboratory sort of experience (on campus). And that’s not unique to Emory. Other campuses are doing it as well.”\nTo make our world greener, here are five easy things you can do to start living sustainably in college — or really, anywhere.\n1. Choose a reusable bottle\nPlastics make up at least 232 million tons of planet-warming emissions, so switching to a refillable, reusable water bottle or tumbler is an easy way to do your part in reducing waste.\n“(It is) a great way to eliminate single-use plastic and is a really smart conservation measure,” Howett said. Not only does it save students money, but keeping hydrated is a healthy lifestyle choice.\nMost college campuses, including Emory and Pennsylvania State University, also have water refill stations in every building to encourage students to bring their own bottles.\nWorried you’ll forget in the morning? “Go ahead the night before and put in the refillable water bottle and the refillable coffee mug in your backpack pockets, and then you’ll have it for the day,” Howett said.\n2. Stick to a ‘green’ dorm theme\nStudents can do a lot to conserve energy in their residence hall or dorm room, Howett said.\nThis can be as simple as turning off the lights when you leave, limiting the number of electronics you bring to campus, and decorating with posters instead of Christmas or fairy lights.\n“Just minimizing that plug load makes a big difference for us in terms of saving energy,” she added.\nYou don’t have to give up your electronics entirely — which is also unreasonable given how schools work now — but you can maximize energy saving by using devices that are Energy Star certified.\n“Energy Star is a program through the United States Environmental Protection Agency that certifies appliances and electronics to be the most energy saving, and they do that for computers — it’s called EPEAT — and then Energy Star for other appliances like refrigerators, so that all of that goes to really saving energy just in your residence hall,” Howett said.\n3. Plan your commute\nA sustainable commute to, from or on campus is also important. “That could mean bringing a bike from home or renting a bike while you’re on campus, getting familiar with the campus shuttle schedule and the local public transportation schedule,” Howett said.\nTaking public transportation, such as buses or campus shuttles, reduces carbon emissions by 45% and decreases the amount of vehicles on the road.\nShuttles can also run on cleaner, green forms of energy. Emory’s shuttles have been running on biodiesel fuel since 2006, and the campus has conserved fuel energy by recycling old cooking oil used in the dining halls.\n“Many colleges don’t allow first-year students to bring a car to campus,” Howett said. “Right out of the gate, many first-years start learning that kind of sustainability practice, which when they leave our campus gates, they may continue wherever they move to.”\n4. Get your steps in\nAnother tip that’s both healthy and conserving is taking the stairs rather than the elevator, Howett said. “You save energy, and you get your steps in.”\nElevators contribute to 27.18 kilograms (almost 60 pounds) of carbon emissions per year and affect energy conservation at every stage, starting from the time they’re manufactured through the time they are demolished. As many residence halls and academic buildings have elevators, it’s important to practice these conscious acts of sustainability.\n“Students collectively make a big impact in terms of the amount of waste they generate,” so these smaller acts of sustainability add up, Howett said.\nAnd research has shown that walking has health benefits, like reducing the risk of premature mortality and cancer, so you can improve your health as well as the planet.\n5. Eat ‘green’\nThe idea of reducing or cutting out meat can scare a lot of people, but it’s not as difficult as you might think.\n“(E)at meals that are locally or sustainably sourced, and generally, if you eat more plants than meat, you’re making a more sustainable choice because the production of meat is so carbon-intensive,” Howett said.\nYou can eat the Mediterranean way or try dishes from countries that have low rates of meat consumption, like India, Indonesia, Ethiopia and Nigeria.\nIf that’s still intimidating, an easy way to lean into a green diet is to gradually substitute beef with high-protein vegetarian foods, like beans or quinoa.\nMaking this swap also has health benefits, as eating more fruits and vegetables can reduce the risk of kidney and heart disease.\nYou probably already do some of these things, which means you’re already living somewhat of a green life. But by adding even one of these practices to your day-to-day routine, you can affect meaningful change.\nSign up for CNN’s Life, But Greener newsletter. Our limited newsletter series guides you on how to minimize your personal role in the climate crisis — and reduce your eco-anxiety."
    },
    {
      "url": "https://www.cnn.com/2025/08/26/science/brightest-fast-radio-burst",
      "text": "Astronomers have spotted the brightest fast radio burst yet coming from a nearby galaxy. Observations of this phenomenon, a powerful flash of radio waves that lasts only about a millisecond, could shed light on one of the most mysterious cosmic phenomena ever studied.\nFast radio bursts, or FRBs, were first discovered in 2007, but their exact sources remain unknown. Since their identification, astronomers have been tracing the bursts’ origin in the hopes of gathering clues about what unleashes them and sends them across the cosmos.\nAstronomers observed FRB 20250316A, nicknamed “RBFLOAT” for “Radio Brightest FLash Of All Time,” on March 16.\nThe signal was traced to the galaxy NGC 4141 about 130 million light-years away from Earth. The details of the detection, made with the FRB-hunting Canadian Hydrogen Intensity Mapping Experiment, or CHIME, and its newly operational, smaller array of telescopes, called Outriggers, were published Thursday in The Astrophysical Journal Letters.\n“With the CHIME Outriggers, we are finally catching these fleeting cosmic signals in the act — narrowing down their locations not only to individual galaxies, but even to specific stellar environments,” said lead study author Amanda Cook, a Banting postdoctoral fellow at the Trottier Space Institute and Physics Department at McGill University, in a statement.\nAfter the burst was detected, scientists used the James Webb Space Telescope to zoom in on where it originated. The observations add evidence to a leading theory that magnetars, or the highly magnetized remnants of dead stars, could be a source of fast radio bursts. A study about Webb’s follow-up observations was also published on Thursday in The Astrophysical Journal Letters.\n“This was a unique opportunity to quickly turn JWST’s powerful infrared eye on the location of an FRB for the first time,” said Peter Blanchard, lead author of the Webb study and research associate in the Harvard College Observatory at the Center for Astrophysics | Harvard & Smithsonian, in a statement. “And we were rewarded with an exciting result — we see a faint source of infrared light very close to where the radio burst occurred. This could be the first object linked to an FRB that anyone has found in another galaxy.”\nThe new insights from both studies could also be used to help astronomers solve another key mystery surrounding fast radio bursts by determining whether they have a repetitive pattern, like a cosmic heartbeat, or whether there are different flavors of radio bursts that release a singular bombastic signal before falling silent.\nA CHIME in the nick of time\nThe CHIME radio telescope near Penticton, British Columbia, at the Dominion Radio Astrophysical Observatory, has enabled astronomers for the past seven years to spot thousands of fast radio bursts when they arrive at Earth after traveling across the cosmos.\nWork was completed earlier this year to get Outriggers up and running at sites in British Columbia, West Virginia and California with the goal of tracing fast radio bursts to their specific locations with enhanced precision. The Outriggers combine pinpointing capabilities with a large field of view, said Wen-fai Fong, coauthor on the CHIME study and associate professor of physics and astronomy at Northwestern University’s Weinberg College of Arts and Sciences.\nAstronomers had their chance to test the array’s “game-changing” capabilities in March, just a couple of months after the Outriggers came online, Fong said.\nThe RBFLOAT released as much energy as the sun produced in four days — but in less than a second.\nThe Outrigger telescopes enabled the team to pinpoint the fast radio burst’s point of origin to a region measuring about 45 light-years across, an area smaller than a cluster of stars. The precision of the location is like spotting a quarter from about 100 kilometers (62 miles) away, Cook said.\nPrior to the Outrigger telescopes’ capability to triangulate a fast radio burst to its source, “it was like talking to someone on the phone and not knowing what city or state they were calling from,” said study coauthor Bryan Gaensler, dean of the University of California, Santa Cruz science division.\n“Now we know not only their exact address, but which room of their house they’re standing in while they’re on the call.”\nZooming in on a galactic arm\nFollow-up observations made with the 6.5-meter MMT telescope in Arizona and the Keck II telescope’s Cosmic Web Imager in Hawaii revealed that RBFLOAT came from the spiral arm of a galaxy, which is full of star-forming regions. But it originated near, and not inside, a star-forming region.\nSome previous fast radio bursts appear to have come from magnetars, or highly magnetized rotating neutron stars that release radio waves. Scientists have long hypothesized that neutron stars, ultradense core remnants left behind after massive stars explode, might be the origin of fast radio bursts.\nMagnetars typically form when gravity triggers a gigantic star to collapse on itself. And star-forming regions are where young magnetars can be found.\nThe fact that the burst was traced to a region outside a star-forming clump could suggest that the “magnetar was kicked from its birth site or that it was born right at the FRB site and away from the clump’s center,” said study coauthor Yuxin (Vic) Dong, graduate student and National Science Foundation Graduate Research Fellow in the department of physics and astronomy at Northwestern University.\nWebb’s powerful gaze\nBlanchard’s team used the Webb telescope to search for a signal in infrared light that may have originated at the same cosmic location as RBFLOAT.\nWebb’s data revealed an object, named NIR-1, which could be a massive star or a red giant — a sun-like star at the end of its life that has brightened significantly. Neither star is considered a candidate for the direct cause of a fast radio burst. But an unseen companion like a neutron star could be siphoning material away from the larger star — and that may have been enough to release a burst of radio waves, Blanchard said.\nIt’s also possible that the infrared light that Webb detected was a reflection of a flare caused by the same object that released the radio burst, such as a magnetar.\n“Whether or not the association with the star is real, we’ve learned a lot about the burst’s origin,” Blanchard said. “If a double star system isn’t the answer, our work hints that an isolated magnetar caused the FRB.”\nTo repeat or not to repeat\nStudying the immediate surroundings where both repeating and non-repeating fast radio bursts occur can help astronomers determine what causes the signals to repeat in the first place, Fong said.\nWhile many fast radio bursts are known to repeat pulsations over several months, the RBFLOAT did not release any repeat signals in the hundreds of hours after it was initially observed.\nRBFLOAT is the first non-repeating burst to be localized to such precision, said Sunil Simha, coauthor on the CHIME study and a Brinson postdoctoral fellow at Northwestern University’s Center for Interdisciplinary Exploration and Research in Astrophysics and the University of Chicago’s Astronomy and Astrophysics Department.\n“Since this represents the first non-repeating FRB with its local environment fully mapped out, it remains to be seen if others will follow suit, or if this was an oddball,” Fong said.\nThe results of both studies provide insight into the question of whether all fast radio bursts eventually repeat, said Liam Connor, assistant professor of astronomy at Harvard University. Connor has studied the phenomenon before but was not involved in either study.\n“Before detecting FRB 20250316A, CHIME had been unknowingly monitoring the source every day for seven years, because CHIME sees the whole Northern Sky once per day,” Connor wrote in an email. “Somehow, zero bursts were detected in thousands of transits, until one of the brightest events of all time suddenly went off. If all FRBs are repeaters, then clearly some are extremely sporadic and unpredictable.”\nPreviously, cataclysmic theories, like the collision of massive objects, have been ruled out for repeating fast radio bursts since the source would be destroyed while producing the first burst, Dong said.\n“We can reopen the door to those more explosive theories for RBFLOAT and its kin,” she said.\nSimha wants to build a database that shows where fast radio bursts have originated, which could reveal what may be responsible for creating them — and if they are all created equally. More data could show if there are multiple ways to produce fast radio bursts, Blanchard said.\nThe CHIME telescope and its Outriggers continue monitoring the sky to see whether other non-repeating fast radio bursts release another signal. The telescope array is anticipated to help localize hundreds of fast radio bursts a year. And the team will continue to monitor RBFLOAT in case it has another outburst.\n“Alternatively, maybe we never detect another burst from this source, and start to see additional seemingly one-off bursts, potentially in similar environments,” Cook wrote in an email. “Then we’re trying to solve the mysteries of the origins of at least two different populations. In either case, we are really excited to uncover the mysteries the universe has in store for us.”\nSign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more."
    },
    {
      "url": "https://www.cnn.com/2025/08/28/world/video/gaza-double-tap-attack-israel-hancocks-digvid",
      "text": "New video reveals third strike in deadly ‘double-tap’ attack on Gaza hospital\nIsrael has faced global condemnation for back-to-back strikes on the biggest hospital in southern Gaza this week, which killed at least 22 people, including health workers, emergency response crews and five journalists. New video obtained by CNN reveals that there is a third strike. CNN's Paula Hancocks reports.\n03:35\n- Source:\nCNN\nWorld News\n17 videos\nNew video reveals third strike in deadly ‘double-tap’ attack on Gaza hospital\nWhat would happen to Tokyo if Mount Fuji erupted?\nTyphoon Kajiki forces mass evacuation in Vietnam, shuts China’s Sanya\nVideo shows a large plume of fire and smoke in an Israeli strike on Yemen\nNorth Korea admits its troops died in Russia's war\nPanic in Milan airport as man sets fire to check-in desk\nThis hotel has the ‘biggest mattress in the Indian Ocean’\nSee how a whole church was moved across a city in Sweden\nMexican brothers arrested, one tased by federal agents\nChina closely watching efforts to end the war in Ukraine\nBody language expert breaks down Trump-Putin meeting\nUkrainian soldiers and civilians reunite with loved ones in prisoner exchange\nVideo shows hurricane hunters flying through Erin\nHear why Zakaria calls Trump-Putin summit ‘cringeworthy’\n'Trump did not lose, but Putin clearly won': Bolton reacts to Alaska summit\nPutin makes confused expression as journalists ask about Ukraine\nTrump and Putin land in Alaska for historic summit"
    },
    {
      "url": "https://www.cnn.com/2025/08/19/africa/senegal-school-husband-childbirth-hiv-latam-intl",
      "text": "On a recent evening in Senegal‘s capital of Dakar, an imam named Ibrahima Diane explained to a group of men why they should be more involved in household chores.\n“The Prophet himself says a man who does not help support his wife and children is not a good Muslim,” the 53-year-old said, as he described bathing his baby and helping his wife with other duties.\nSome of the 14 men chuckled, not quite sold. Others applauded.\nDiane was taking part in a “school for husbands,” a United Nations-backed initiative where respected male community members learn about “positive masculinity” in health and social issues and promote them in their communities.\nIn Senegal, as in many other West African countries with large rural or conservative populations, men often have the final say in major household decisions, including ones related to health.\nWomen may need their permission for life-changing decisions on accessing family planning or other reproductive health services, along with hospital deliveries or prenatal care.\nFollowing his sessions at the school for husbands, Diane regularly holds sermons during Friday prayers where he discusses issues around gender and reproductive health, from gender-based violence to fighting stigma around HIV.\n“Many women appreciate my sermons,” he said. “They say their husbands’ behavior changed since they attended them.” He said some men have told him the sermons inspired them to become more caring husbands and fathers.\nHabib Diallo, a 60-year-old former army commando, said attending the sermons and discussions with the imam taught him about the risks of home births.\n“When my son’s wife was pregnant, I encouraged him to take her to the hospital for the delivery,” Diallo said. “At first, he was hesitant. He worried about the cost and didn’t trust the hospital. But when I explained how much safer it would be for both his wife and the baby, he agreed.”\nNo more barking orders\nThe program launched in Senegal in 2011 but in recent years has caught the attention of the Ministry of Women, Family, Gender and Child Protection, which sees it an effective strategy to combat maternal and infant mortality.\n“Without men’s involvement, attitudes around maternal health won’t change,” said 54-year-old Aida Diouf, a female health worker who collaborates with the program. Many husbands prefer their wives not be treated by male health workers, she said.\nThe classes for husbands follow similar efforts in other African countries, particularly Niger, Togo, and Burkina Faso, where the United Nations Population Fund says it improved women’s access to reproductive health services by increasing male involvement, growing the use of contraceptives by both men and women and expanding access to prenatal care and skilled birth attendants.\nDiscussions for men also have focused on girls’ rights, equality and the harmful effects of female genital mutilation.\nThe program now operates over 20 schools in Senegal, and over 300 men have been trained.\nIn some communities, men who once enforced patriarchal norms now promote gender equality, which has led to a reduction in the number of forced marriages and more acceptance of family planning, according to Senegal’s ministry of gender.\nMen join the groups after being recruited based on trust, leadership and commitment. Candidates must be married, respected locally and supportive of women’s health and rights.\nAfter training, the men act as peer educators, visiting homes and hosting informal talks.\n“My husband used to not do much around the house, just bark orders. Now he actually cooks and helps out with daily tasks,” said Khary Ndeye, 52.\nStill too many dying in childbirth\nWhile maternal and infant deaths in Senegal have declined over the past decade, experts say it still has a long way to go. It recorded 237 maternal deaths for every 100,000 live births in 2023, while 21 newborns out of every 1,000 died within their first month. The U.N. globally wants to reduce maternal deaths to 70 deaths per 100,000 live births and newborn deaths to under 12 per 1,000 by 2030.\nOne key problem was that many women have been giving birth at home, said El Hadj Malick, one of the Senegal program’s coordinators.\n“By educating men about the importance of supporting their wives during pregnancy, taking them to the hospital and helping with domestic work at home, you’re protecting people’s health,” Malick said.\nHe said he still experiences difficulty changing mindsets on some issues.\n“When we just talk to them about gender, there is sometimes tension because it’s seen as something abstract or even foreign,” Malick said. Some men mistakenly believe such talk will promote LGBTQ+ issues, which remain largely taboo in much of West Africa.\n“But when we focus on women’s right to be healthy, it puts a human face on the concept and its becomes universal,” Malick said."
    },
    {
      "url": "https://www.cnn.com/2025/08/28/us/annunciation-catholic-school-shooting-minneapolis",
      "text": "An inscription above the doors of the Church of Annunciation in south Minneapolis proclaims its sanctuary to be “the House of God and the gate of Heaven.”\nBut on Wednesday, the sense of tranquility that parishioners and students have long found in the heart of the church and Catholic school was literally shattered when a shooter opened fire through its stained-glass windows.\nWeston Halsne, 10, told reporters he was sitting two seats away from the windows that surround the sanctuary celebrating the start-of-school Mass, when shots began.\n“It was like right beside me … I think I got gunpowder on my neck,” he said. “The first one, I was like, ‘What is that?’ and then I heard it again and I just ran under the pew.”\nThe fifth grader said he covered his head as his friend dove on top of him.\n“(He) saved me though because he laid on top of me, but he got hit,” Weston said, adding the boy was hit in the back.\n“He’s really brave, and I hope he’s good in the hospital.”\nAt least two children have been killed and 17 others – including 14 kids and 3 parishioners in their 80s – were injured during what police have described as a “deliberate act of violence.”\nThe shooter, who died of a self-inflicted gunshot wound, had lawfully purchased the weapons “recently” and did not appear to have a criminal history, authorities have said.\n‘Can you just please just hold my hand?’\nPatrick Scallen still lives in the house he grew up in, about a block away from Annunciation. He attended the school as a child – just as his father did before him – and he told CNN he’s proud of the century-old church and school’s legacy in the community.\nJust this morning, Scallen said he saw a family of kids who go to the school.\n“I thought to myself in that moment, ‘What a wonderful thing Annunciation is,’” he said.\nScallen was working at his desk later in the morning, when he heard what sounded like gunshots. He took off running toward the school.\n“It was eerily quiet when I got to the church,” he said. “There was a (gun) magazine on the sidewalk … and then people were starting to pour out.”\nImmediately, Scallen said, he saw three children who were “obviously hurt.” A bullet had grazed one girl on the forehead, he said. Another girl had been shot in the neck.\n“Can you just please hold my hand?” one of the girls asked, Scallen told CNN.\nAlthough they were alert and talking, he said he tried to offer the kids any comfort and reassurances that he could until the EMTs arrived.\n“I just kept telling them, ‘I’m going to call your Mom and Dad, I’m going to let them know. You’re going to be OK,” he said.\nAs they tried to process what they’d witnessed, Scallen said the kids began asking him questions: “Why did this happen? How could this happen?”\nHe, like so many of us, did not have answers.\nAn act of cruelty ‘beyond comprehension’\nChurch bells rang out mournfully in the distance as Minneapolis Police Chief Brian O’Hara described the “unthinkable tragedy” at a news conference later that morning.\nThe shooting began just before 8:30 a.m., O’Hara said, minutes into a worship service to mark the first week of school.\nSuspect Robin Westman, 23, graduated from Annunciation Catholic’s grade school in 2017, according to a yearbook obtained by CNN.\n“The gunman approached on the side of the building and began firing a rifle through the church windows towards the children sitting in the pews at the Mass,” O’Hara said.\nThe shooter was armed with a rifle, a shotgun and a pistol, O’Hara said, later adding that authorities believe all three weapons were fired.\nAlthough the investigation is ongoing, O’Hara said most of the shooting appeared to have taken place from outside of the building and some of the doors to the church had been barricaded with two-by-fours from the outside.\n“The sheer cruelty and cowardice of firing into a church full of children is absolutely incomprehensible,” O’Hara said. Children, ages 8 and 10, were “killed where they sat in the pews.”\n“This deliberate act of violence is just a sign of cruelty that is beyond comprehension,” he said.\nFrantic parents raced toward the reunification site and tearfully clung to their children as they escorted them off the school grounds. The shooting comes after a wave of active shooter hoaxes across the country brought panic to the start of the school year.\nAfter arriving on the scene, Minneapolis Mayor Jacob Frey ran toward the sanctuary and was later seen clasping his hands outside on the church steps.\n“It was the first week of school – they were in a church,” Frey said Wednesday morning.\n“These are kids that should be learning with their friends. They should be playing on the playground. They should be able to go to school or church in peace without the fear or risk of violence.”\nBeyond ‘thoughts and prayers’\nAnnunciation began the school year this week with the theme “A future filled with hope.”\nIt is a reference to a Bible verse in which God says: “For I know full well the plans I have for you, plans for your welfare and not for your misfortune, plans that will offer you a future filled with hope.”\n“There’s nothing about today that can fill us with hope,” Annunciation principal Matthew DeBoer said at a news conference Wednesday afternoon. “We as a community have a responsibility to make sure that no child, no parent, no teacher ever has to experience what we’ve experienced today – ever again.\n“There’s an African proverb that says, ‘When you pray, move your feet.’ So I beg you,” he said, his voice breaking, “I ask you to please pray, but don’t stop with your words.”\nMinnesota Gov. Tim Walz also encouraged the community – and the nation – to move beyond platitudes toward action to curb gun violence in America.\n“It’s Minnesota’s day today,” he said. “I ask the rest of folks around the country who are watching, keep us in your thoughts and prayers, but also keep us in the thoughts for action, keep us in the ideas that we can work together.”\nIn a video posted to the church’s Facebook page, Father Brian Park explains the symbolism of the stained-glass tableau that spills light into the sanctuary.\nPart of the scene, he says, depicts the Biblical Adam hiding his face in shame at the “fall of humanity,” which Catholics believe ushered in a period of suffering and death.\nBut the Annunciation – the church’s namesake – celebrates the moment the Virgin Mary was told she would become the mother of Jesus. For Catholics, Park says, it symbolizes that “the Lord is with you.”\nThe Virgin Mary now gazes down from the stained-glass window at the senseless carnage wrought by man as Annunciation becomes yet another school torn apart by the all-too-common tragedy of gun violence in America.\n“Don’t just say this is about ‘thoughts and prayers’ right now,” Frey, who was visibly emotional, said Wednesday morning.\n“These kids were literally praying.”\nCorrection: An earlier version of this story misstated the number of people injured in the shooting. At least 17 people were wounded.\nCNN’s Dakin Andone, John Miller, Mark Morales and Holmes Lybrand contributed to this report."
    },
    {
      "url": "https://www.cnn.com/2025/08/27/middleeast/netanyahu-israel-protests-gaza-analysis-intl",
      "text": "Worlds away from the public outrage and cries of protest echoing through Tel Aviv’s packed streets on Tuesday evening, Prime Minister Benjamin Netanyahu beamed from the podium in Jerusalem, his words greeted with laughter and applause.\nThe contrast was unmistakable.\nIn Tel Aviv, tens of thousands of protesters demanded a ceasefire and the return of the hostages held in Gaza. In Jerusalem, Netanyahu spoke of “the unity of the people.”\nOn the streets, mothers and fathers of hostages cried for their release, begging the government to take the ceasefire deal on the table. But at a posh restaurant outside the Old City of Jerusalem, Netanyahu promised Israel was on “the path to victory” with a plan to widen the 22-month war in the battered enclave.\nProtesters spoke of a country that needs to heal. Netanyahu celebrated the expansion of Jewish settlements in the occupied West Bank.\nThey called for accountability. He spoke of “a bright future ahead.”\nThe juxtaposition reflects the general attitude of Netanyahu and his government toward the broad Israeli consensus demanding an end to the war and the return of the remaining hostages: indifference and detachment.\nNearly two years into the war in Gaza, polls have repeatedly shown a clear majority of Israelis favoring any sort of deal that would bring the remaining 50 hostages home and end the fighting. Week after week, tens of thousands of protestors gather at Tel Aviv’s Hostages Square and at major intersections nationwide to support the families of the hostages and their struggle to secure the release of loved ones captured by Hamas on October 7, 2023.\nFollowing Netanyahu’s decision to escalate the war with a massive takeover of Gaza City, protests have intensified, drawing hundreds of thousands into the streets.\nThe scale of public mobilization and participation is difficult to ignore. On August 17, the hostages’ families spearheaded an unprecedented grassroots strike that organizers say drew nearly 500,000 people. That’s equivalent to 17 million in the United States.\nAnd they keep coming out week after week.\nOn Tuesday, as part of an ongoing effort to pressure the government, the hostages’ families launched another day of protest which, according to organizers, assembled some 300,000 demonstrators in Tel Aviv for the concluding evening rally. “Enough!” shouted Sylvia Cunio, mother of the hostage brothers David and Ariel Cunio.\nSolidarity is the driving force energizing the masses, says Haim Rubinstein, strategic consultant and one of the founders of the Hostages Families’ Forum.\n“People come to the rallies to tell the families: This battle is not only yours, it’s every Israeli’s battle, over the character and spirit of the country, over the value of mutual responsibility upon (which) Israel was founded, Rubinstein said.”\n“Israelis understand we are now at a decisive juncture – conquering Gaza or releasing the hostages. They come here to tell the government (to) end the war and bring our brothers and sisters back home.”\nProtests ‘aiding Hamas’\nNetanyahu appears unmoved by the groundswell of public pressure as he pushes forward with plans for a massive assault on Gaza City, disregarding the hostage families’ fears that the offensive could endanger their loved ones, 20 of whom are still believed to be alive. Moreover, he and his allies have slammed the protests, accusing them of aiding Hamas.\n“Those who call for ending the war are pushing off the hostages’ release and guaranteeing the horrors of the massacre will return,” Netanyahu said last week, after the first day of mass protests.\nThe government’s apparent disconnect from the street doesn’t seem to deter the demonstrators. It is an essential part of what spurs them on.\n“We come, first and foremost, to support the families and to shout about what is happening in our country,” Batya Aviram, one of the protestors, told CNN. “It gives me a chance to meet with amazing empathetic people who care and are willing to act so that Israel stays a sane country.”\nShe notes the messaging the demonstrations sends to the world: “We come so that people outside, in the world, see and hear us, so they know that the people of Israel are not their leadership, and know to distinguish between us and our government,”\nAttention span war\nThe latest protests have already achieved tactical victories in the attention span war , bringing the hostage families’ struggle back to the top of the news agenda. The families vow to continue ramping up pressure as they believe it is the only way to force Netanyahu – and the White House – to move toward a deal.\n“We are the water drops that wear down the stone, and something will eventually happen because we’re fighting for our future,” said Yael Adar, mother of deceased hostage Tamir Adar. “If we didn’t believe we could make a difference, we wouldn’t be here. This is the only way to bring them back home”.\nDespite Netanyahu’s hardline and dismissive comments, apparent diplomatic openings emerged last week. After weeks of stalemate, Hamas accepted the latest Qatari- and Egyptian-mediated ceasefire proposal. However, over a week has passed since then, and Israel has yet to respond.\nThe prime minister’s priorities became starkly evident on Tuesday when he convened the security cabinet for the first time since the Gaza City operation was approved, and since Hamas accepted the new truce proposal.\nThe meeting coincided with mass protests in Tel Aviv. Butit was cut short due to Netanyahu’s scheduled celebration with the leadership of Jewish settlers in the West Bank. As protesters hit the streets, Netanyahu went out to dinner."
    },
    {
      "url": "https://www.cnn.com/2025/08/26/tech/openai-classroom-software-students",
      "text": "Ludrick Cooper, an eighth-grade teacher in South Carolina, didn’t always like the idea of using artificial intelligence – in the classroom or otherwise. But he eventually came around.\n“This is the new encyclopedia,” said Cooper, who loved reading encyclopedias growing up.\nCooper is just one of many teachers now incorporating AI into lesson plans, another sign that AI-powered tools are becoming more commonplace in the classroom even as the technology’s advantages and risks are still developing.\nSix in 10 teachers said they used an AI tool for work in the 2024-2025 school year, according to a study from the Walton Family Foundation and Gallup.\nOn Tuesday, First Lady Melania Trump announced the Presidential AI Challenge, a push to encourage students in grades K-12 use AI to “address community challenges.” Just last month, OpenAI launched a “study mode” for ChatGPT and announced a partnership with Instructure, whose learning platform is used by millions of students. OpenAI, Microsoft and Anthropic also teamed up with the national and New York American Federation of Teachers unions to invest approximately $23 million for AI training for 400,000 K-12th grade teachers.\nAI can offer benefits to education, like more engaging lessons or easier access to information. However, some experts worry about the risks, like making cheating easier, widening education inequalities or worsening students’ mental health.\n“AI is a little bit like fire. When cavemen first discovered fire, a lot of people said, ‘Ooh, look what it can do,’” Sarah Howorth, an associate professor of special education at the University of Maine, told CNN. “And other people are like, ‘Ah, it could kill us.’ You know, it’s the same with AI.”\nAI in the classroom\nInstructure, the company behind learning platform Canvas, is collaborating with Open AI on a new tool called the “LLM-Enabled Assignment” which allows teachers to create customized, interactive AI-powered lessons while tracking student progress.\nLLM is short for “large language model,” the underlying technology behind ChatGPT and other chatbots. With the tool, teachers can instruct the AI to create a “persona” that can be incorporated into a lesson plan by typing in a prompt. For example, a history teacher could tell the AI to take on the role of a president, politician or other historical figure.\nMelissa Loble, Instructure’s chief academic officer, told CNN the partnership underscores “that people want to learn differently and engage in learning differently.”\nLike Kayla Jefferson, a New York City high school social studies teacher who says she uses AI to keep students engaged, help them learn from each other and strengthen their global literacy skills.\nOne of her assignment’s involves summarizing and reflecting on a news article using the AI-powered Padlet bulletin board, where the students can engage with each other’s posts, Jefferson told CNN.\nMany AI-powered tools can also aid in accessibility, Howorth said, such as talk-to-text and text-to-speech tools that help those with visual impairments or dyslexia.\nHowever, Matthew Rascoff, the vice provost for digital education at Stanford, said that AI companies need to develop more technology that fosters learning as a social exercise, rather than the current model in which AI tools tend to help one person at a time.\nTools that promote social learning – learning as a group, for example – develop collaboration skills that kids can then use in their own communities.\n“Great classrooms create a sense of mutual responsibility for everybody’s learning,” Rascoff explained.\nAI brings certain risks\nIntegrating AI technology and education comes with certain risks.\nThe New York City Public Department of Education (NYC DOE) initially banned ChatGPT on district-issued devices and networks over concerns students could use the tech to cheat.\nThe city later reversed course after then-NYC DOE Chancellor David Banks said ChatGPT had initially “caught NYC schools off guard.” Instructure said its LLM-Assignment pushes back on students asking for answers, describing the tool as a “guided experience that keeps students accountable and learning authentically.”\nCheating isn’t the only risk – AI’s effects on mental health are still poorly understood, including in children.\nOne mother, for example, alleged startup Character.AI was responsible for her 14-year-old son’s suicide; she and other families have sued the company.\nAn Instructure spokesperson said the technology in Canvas will be used in a “controlled environment,” with safeguards managed by the institution to make sure conversations stay relevant to the coursework.\nAnd while some AI tools are helpful for people with different needs, the technology still doesn’t have solutions for certain disabilities.\nTalk-to-text features, for example, can still get tripped up by people with stutters or accents, Howorth said.\nPoorer school districts could also struggle to access the latest AI technology, widening the gap with areas that are better-off, Robin Lake, director of Arizona State University’s Center on Reinventing Public Education, told CNN.\nIn two rounds of a nationwide survey of school districts, the center found disparities in which districts were providing AI training for teachers, Lake said. High poverty districts reported lower numbers.\n“We should be doing things to make sure that more disadvantaged schools and school districts students are getting access to the advantages of AI,” she said. “More advantaged kids tend to have better access to tools and opportunities and great instruction.”\nSome urban and rural school districts reported that they’re overwhelmed with current needs, which makes it hard to think about future tools like AI, she added.\nEven when AI is available, not all educators are convinced it belongs in a classroom.\nLauren Monaco, a New York City pre-K and kindergarten teacher with more than 20 years of experience, described AI as a crutch that keeps people from learning for themselves.\nUnlike using AI, teaching involves more than “just a transactional information input-output” and takes personal analysis that computers can’t do, Monaco told CNN.\n“Our profession has been under attack,” Monaco said. “I just want to keep asking the question: Who benefits from this?”\nBut ASU’s Lake said there’s another factor – AI is already being used in the workforce.\n“What are students going to need to be successful in an AI economy once they get out there?” she said. “That’s another issue that educators should be grappling with.”\nThis story has been updated with additional information."
    },
    {
      "url": "https://www.cnn.com/2025/08/23/business/sports-gambling-risk-young-men",
      "text": "EDITOR’S NOTE: CNN’s Nick Watt explores the booming sports gambling industry in America in a new episode of “The Whole Story with Anderson Cooper” airing at 10pm on Sunday, August 24.\nWhen Ethan lost $11,000 on a single hockey game this past March, it was the last straw.\nEthan, who declined to share his last name out of fear of losing his job, bet “the spread’” on a Hurricanes-Flames hockey game. That means a team doesn’t just need to win – they must win by more than a certain number of points. The Hurricanes did come out on top – but by only one point, not the two-plus Ethan needed.\nEthan, 27, broke down and cried in front of his girlfriend. He couldn’t do it anymore.\nWhat started as a casual hobby in college with his fraternity brothers had somehow escalated into a severe, years-long gambling addiction. And Ethan wanted out.\nAlthough his story is extreme, Ethan is an example of an increasingly concerning trend.\nA recent national survey of registered voters in the US conducted by Fairleigh Dickinson University found a quarter of men under 30 bet on sports online — and 10% of men ages 18-30 have a gambling problem, compared to just 3% of the overall population.\nIn that survey, 68% of people who bet on sports online reported at least one gambling behavior that’s considered harmful, such as borrowing money to gamble or saying the gambling has caused financial or emotional problems.\nDr. Timothy Fong, a UCLA psychiatry professor who is board-certified in addiction psychiatry, told CNN’s Nick Watt young people are particularly vulnerable to sports betting because their frontal lobes cannot yet handle impulsivity and risk-taking. Watt explores further on “The Whole Story with Anderson Cooper” airing at 10pm on Sunday, August 24.\n“We know that the younger you start betting on sports, that leads to a higher likelihood of developing a gambling problem when they’re older,” Fong said.\nThat’s what happened to Ethan.\n‘Anxious frenzy’\nWhen Ethan was in college, sports gambling wasn’t yet legal, so he and his fraternity brothers used illegal sites to place bets.\nIn 2018, the Supreme Court ruled that states should decide whether to legalize sports betting. That marked a turning point for the industry, and it’s now legal in 38 states and Washington, D.C.\nSuddenly, Ethan and others like him had access to several legal apps. That quickly escalated his addiction: He quit his near-six-figure sales job last August, determined to make sports betting his full-time gig.\nLast September, he was doing what he did every morning, drinking coffee with his girlfriend and reviewing daily game predictions. This time he came across a sports betting influencer who boasted about winning game after game – and though Ethan didn’t usually fall for this type of content, he was intrigued by what seemed like hard proof. The influencer advertised his picks for five games that day.\n“I bet $2,000 on each game and I lost every single one,” Ethan tells CNN.\nEthan spiraled into an “anxious frenzy.” The next day he placed a risky $10,000 bet on a Chicago Bears game and tried to hide the paralyzing fear from his girlfriend. Ethan managed to win $20,000 and get out of the red. He was relieved—and back in the game. The next few months were a blur of ups and downs, wins and losses.\nSlowly, he realized he couldn’t even enjoy the wins amid all the anxiety.\nThe $11,000 loss on the Hurricanes-Flames hockey game in March was the end. He chose to officially “self-exclude” — banning himself from all sports betting through the apps, meaning he wouldn’t be able to log back in.\nShifting industry\nTwenty years ago, the word “gambling” called to mind slot machines in Las Vegas and poker tables in Atlantic City: mostly older people, and maybe the occasional bachelorette party, playing in person.\nNow, online gambling and sports betting have expanded that definition significantly. While casinos still represent most of the gambling industry’s profits, sports betting is exploding quickly: Revenue in that sector reached $13.7 billion in 2024, a 25% increase in just a year, according to the American Gaming Association.\nMuch of this activity happens on sports betting apps. FanDuel’s site says the app has 12 million registered users, while Draft Kings confirmed to CNN they have 10 million users.\nBetting has also become deeply intertwined with the leagues themselves, with advertisements during games and sports announcers discussing different odds. Fanduel’s website boasts partnerships with most of the major American professional leagues and several teams.\nThe shift to app betting brings a shift toward younger bettors. FanDuel and DraftKings declined to share the age breakdown of their users, but several polls indicate a younger demographic of bettors.\nThe Fairleigh Dickinson study showed online sports betting is concentrated among young men: Only 10% of the voters they surveyed overall bet on sports or racing online in the last year. But for men under 45, that figure jumps to 26%.\nFor some of those young men, wider economic trends come into play.\nTheir betting spirals into an addiction in part because they feel they can’t buy homes or pay off student loans with their current salaries, says Jonathan D. Cohen, Ph.D, author of “Losing Big: America’s Reckless Bet on Sports Gambling.”\n“This is why you see all these people betting on these crazy (situations),” Cohen said. “They don’t care about having $10,000. They’d rather have a distant chance at $100,000.”\nIt’s not clear whether sports betting has infected a new generation with a gambling problem, as the data available typically come from self-reported surveys like FDU’s. Gamblers Anonymous also doesn’t track members’ information for privacy reasons, but the group says it has seen an increase in younger addicts.\n“We saw a big push. A lot of young people come in… it’s a much higher number than in the past,” according to the public relations chair of Gamblers Anonymous, who prefers not to use their name as the group’s leadership is made up of members.\nOne method of measuring addiction is data on self-exclusion: how many people ban themselves from gambling, like Ethan. In Pennsylvania, one of the few states to keep public comprehensive data on the program, only 6% of the people who self-excluded from all gambling in 2015 were ages 21-34 — a decade later, that figure is now 28%.\nJoe Maloney, a spokesperson for the American Gaming Association, doesn’t believe self-exclusion necessarily indicates addiction. It may simply mean a bettor wants to take a break.\nHe also cited a recent survey from the National Council on Problem Gambling that showed problematic gambling hasn’t increased much since the Supreme Court decision, and that the number of people betting on sports also remained similar, regardless of its legal status.\nA social thing\nKevin Vo, now 25, had never gambled before placing his first bet on basketball games through FanDuel three years ago. He had just secured his first job, in finance, and he had some money to play with.\n“I honestly fell into the peer pressure of my friends: like, literally all of them posting their parlays (on social media),” Vo said.\nA parlay combines two or more individual bets into one, and all conditions must be met for the bettor to win money — a high-risk, high-reward strategy Vo found compelling.\nLike Ethan, he watched games with friends who had all bet on the outcome and participated in group chats dedicated solely to the bets of the day. Vo’s casual pastime escalated in a matter of months.\n“Every single day I would have a parlay,” Vo tells CNN.\nVo originally bet only on sports he knew well, but as he got deeper into the betting apps, he began putting money on options he knew nothing about. At one point he dove into Polish basketball, betting on games he couldn’t even watch.\n“I was down a couple grand at one point. I was able to make it back. And then that all kind of fell down,” Vo said.\nVo spent months up and down with his wins and losses – and finally walked away when he was down only a few thousand and had just moved into his own apartment.\nIn an email to CNN, FanDuel outlined several ways it acts to prevent harmful gambling: the ability to set deposit limits and alerts, sending users a monthly statement with their financial status in the app, a review system triggered by activity like too many hours spent on the site or attempting to come back from big losses, and self-exclusion programs that include the offer of a free mental health assessment.\n“We work to identify signs of harm and engage with the user to prevent that harm from happening,” said Cory Fox, FanDuel’s Senior Vice President of Public Policy and Sustainability.\nDraftKings has similar safety measures in place, and it invites users to set limits with a pop-up page immediately when creating an account.\n“These resources are introduced at sign-up and reinforced throughout the customer journey,” Lori Kalani, DraftKings Chief Responsible Gaming Officer, said in an email to CNN. “It’s more fun when it’s for fun—and that’s the experience we aim to deliver.”\n‘Plastered in your face’\nFanDuel, too, told CNN it views sports betting as a form of entertainment.\n“We want our customers to think of their time and budgets on our platform the same way they might think about going to see a movie,” said Fox at FanDuel.\nBut at least some bettors try to leverage it into income — like Colby Aaron Wells, now 33, who began sports betting in Tennessee nearly a decade ago to make extra money. (The state legalized certain daily fantasy sports contests on apps in 2016.)\nHe said he was “working his butt off” at a landscaping job at the time, and he thought he could make a little extra money to pay the bills.\nIn Wells’ years of app betting, including after sports betting was legalized more widely, there were months when he did win thousands of dollars. Twice, the app company BetMGM even comped him free rooms in Las Vegas for betting so much.\nBut there were also many losses. Wells says he could have bought and paid off a house in Tennessee with the amount of money he lost, and he has since quit playing altogether. BetMGM declined CNN’s request for comment.\nAll three young men interviewed for this story believed they had a competitive edge because of their knowledge of different sports, viewing it differently from a slot machine or lottery ticket.\nAnd though they’ve stopped gambling, they say the incessant advertising for sports betting is difficult to avoid. They see promotions like “bet $5 and get $150,” and they know just how easy it is to get sucked in.\n“The amount of advertisements and commercials you see everywhere,” said Vo, “it’s literally plastered in your face.”"
    },
    {
      "url": "https://www.cnn.com/2025/08/28/europe/ukraine-russia-kyiv-attack-hnk-intl",
      "text": "Kyiv was struck by a “massive attack” from Russia overnight with drones and missiles killing at least 15 people, including four children, according to officials.\nAmong those killed are children aged 2, 17 and 14, according to Tymur Tkachenko, head of the Kyiv City Military Administration. At least 10 children were also injured, he said.\nUkraine’s Air Force said that the Kremlin unleashed 629 air attack weapons on the country overnight, comprising 598 drones and 31 missiles.\nRussia’s defense ministry said it struck “military-industrial complex enterprises and military air bases in Ukraine” using “high-precision weapons.”\nMeanwhile, Ukrainian President Volodymyr Zelensky called the assault a “horrific and deliberate killing of civilians” in a post on X.\n“These Russian missiles and attack drones today are a clear response to everyone in the world who, for weeks and months, has been calling for a ceasefire and for real diplomacy,” he said in an earlier post.\nUkrainian authorities said some 500 rescuers and 1,000 police officers were responding to incidents in multiple locations, including a building of the European Union mission to Ukraine.\nEuropean Commission President Ursula von der Leyen said that she was “outraged” by the attack, calling it “another grim reminder of what is at stake.”\n“It shows that the Kremlin will stop at nothing to terrorize Ukraine, blindly killing civilians, men, women and children, and even targeting the European Union,” she said.\nVon der Leyen said that the EU is “keeping maximum pressure on Russia,” including by tightening its sanctions regime.\nThe bloc is summoning the Russian envoy in Brussels in response to the attack, the EU’s top diplomat Kaja Kallas said.\nA British Council building in Kyiv was also damaged by the strikes, according to UK Prime Minister Keir Starmer, who said that Russian President Vladimir Putin is “killing children and civilians, and sabotaging hopes of peace.”\nUkrainian Foreign Minister Andrii Sybiha accused Russia of targeting diplomats “in direct breach of the Vienna convention” and called for “worldwide condemnation” in a statement on X.\nThe bureau of Radio Liberty, a network funded by the US government, was also impacted in the strike, according to the organization. No staff members were hurt, but windows and equipment were damaged, it said.\nResidents endured an air raid alert lasting more than nine hours overnight, according to interior minister Ihor Klymenko.\n‘I looked up – the roof was gone’\nVitaliy Protsiuk, a resident of Kyiv, told CNN that his wife has been missing since the attack.\nThe couple were getting ready to go to their building’s bomb shelter when there was an “explosion,” Protsiuk said.\n“I was buried,” he continued. “When I came out, everything was covered in dust and smoke. I looked up – the roof was gone, and the floors from the fourth to the first were completely destroyed.\n“As of now, my wife hasn’t been found. Her phone doesn’t respond. She’s not listed anywhere. I don’t know… we’re still searching,” Protsiuk added.\nAgency pictures showed locals flocking once more to subway stations where many spent the night. Residents were advised to “stay in shelters” during the strikes and the all-clear was announced shortly before 7am local time.\nThe major attack on Ukraine’s capital comes just over two weeks after US President Donald Trump held face to face talks with Putin, seeking to secure and end the war.\nBut momentum around peace talks has stalled, with no sign that a bilateral meeting the White House has pushed between Zelensky and Putin will take place.\nOn Wednesday, Andriy Yermak, the head of Zelensky’s office, and Rustem Umerov, the secretary of Ukraine’s National Security and Defense Council, met with Saudi Arabia’s defense minister to discuss an end to the war.\nA delegation from Ukraine is also set to meet US officials in New York on Friday, according to Zelensky.\nMeanwhile, Putin is set to travel to China next week to attend a massive military parade. Other guests will include North Korean leader Kim Jong Un, as well as Russia-friendly European leaders such as Aleksandar Vucic of Serbia and Slovakia’s Robert Fico.\nThe attack on Kyiv is the latest in a series of assaults across Ukraine this week, as Kremlin troops intensify their offensive amid stalled diplomatic efforts to end the war.\nUkrainian open-source researchers confirmed on Tuesday that Russian troops had captured two villages in Ukraine’s southeastern Dnipropetrovsk region.\nRussian forces now occupy the villages of Zaporizke and Novoheorhiivka, according to DeepState, a group tracking battlefield developments.\nUkraine’s outmanned and outgunned military has struggled to fend off grinding Russian advances in much of the east as Moscow increases pressure on Kyiv to give up territory in any peace negotiations.\n“Russia chooses ballistics instead of the negotiating table,” Zelensky wrote in his message on X after the latest overnight attacks. “It chooses to continue killing instead of ending the war. And this means that Russia still does not fear the consequences.”\nIn his analysis of Russia’s latest strikes on Kyiv, Tkachenko said the Kremlin has a typical “signature” which involves “combined attacks from different directions” and targeting “ordinary residential buildings.”\nDecoy missiles were used as false targets to confuse Ukrainian defense systems, the military chief added.\nSeveral high-rise residential buildings were damaged, as well as a kindergarten, private housing, non-residential blocks, offices, transport infrastructure and dozens of cars, officials said.\n“In total, the number of damaged facilities in Kyiv will again reach hundreds, with thousands of broken windows, and a shopping center in the city center was damaged,” Tkachenko added.\nUkraine’s State Emergency Service sent aircraft to help extinguish fires across the city with the affected neighborhoods including Darnytskyi, Desnianskyi, Dniprovskyi, Holosiivskyi, Obolonskyi, Solomianskyi and Shevchenkivskyi, which is home to several cultural and religious landmarks.\nCNN’s Anna Chernova and James Frater contributed to this report."
    },
    {
      "url": "https://www.cnn.com/2025/08/27/politics/democrats-gun-control-minneapolis",
      "text": "Jacob Frey clasped his hands together as he sat on the steps of the Catholic church where hours earlier a shooter opened fire on young children gathered in the pews inside.\n“Don’t just say, this is about thoughts and prayers right now. These kids were literally praying,” the Minneapolis mayor said at a press conference on the scene on Wednesday. “They should be able to go to school or church in peace without the fear or risk of violence, and their parents should have the same kind of assurance.”\n“These are the sort of basic assurances that every family should have, every step of the day, regardless of where they are in our country,” he added.\nFrey’s plea was echoed by several Democratic leaders in Minnesota who renewed calls to address gun violence in the wake of the shooting at Annunciation Catholic Church and School. They argued the horrific scene – a shooter opening fire through a stained glass window as students celebrated their first week of school with worship – should prompt people to demand action.\n“It’s my strongest desire that no state, no community, no school, ever experiences a day like this,” said Minnesota Gov. Tim Walz. “Keep us in your thoughts and prayers, but also keep us in the thoughts for action. Keep us in the ideas that we can work together.”\nRep. Ilhan Omar of Minneapolis accused elected leaders of being “more concerned with appeasing the gun lobby than keeping our children safe.”\nAnd Minnesota Sen. Amy Klobuchar told CNN’s Dana Bash, “If a bunch of kids praying in church and shot down through the windows of that church and and locked into that by a madman isn’t enough to make people move, I just don’t know what is anymore.”\nBut their calls for greater action may soon meet political reality. In the immediate aftermath of Wednesday’s shooting, Republican leaders in Congress have shown no signs of opening a push for new gun measures next week when lawmakers return from their August recess.\n“Our prayers are with the victims, their families, and first responders on the scene,” Minnesota Rep. Tom Emmer, who serves as majority whip in the US House, wrote on X.\nHouse Speaker Mike Johnson said the country was “heartbroken over the tragic violence,” adding, “Our prayers are with the children, families, civilians, law enforcement, and all those impacted by this evil attack.”\nCongress last passed gun safety legislation in 2022 following the massacre at Robb Elementary School in Uvalde, Texas. The bipartisan gun safety law, which surged millions of dollars to mental health and school safety programs and changed the process for when individuals ages 18 to 21 go to purchase a firearm, was the first meaningful gun measure enacted in decades.\nWhile the investigation into the shooting remains underway, law enforcement officials said the 23-year-old shooter legally purchased the weapons used in the attack, which included a rifle, shotgun and pistol. The shooter killed two children, ages 8 and 10. Fourteen students, all between the ages of six and 15, and three adults were injured.\nKlobuchar said lawmakers could do more to strengthen background checks and address assault weapons, but she also acknowledged any legislative pushes would require additional buy-in.\nThe US House last voted to ban assault-style weapons in 2022, when the chamber was controlled by Democrats, even though the bill would not clear a Republican filibuster in the Senate.\n“There’s one thing we can do to make this better and stop the angry rhetoric. Start working on solutions that we know have worked in other countries or could work here and it’s not just one size fits all,” Klobuchar said. “But we’ve got to be willing to do it, and especially my colleagues who’ve been afraid to do it.”\nAnother deadly shooting in the state\nThe church and school shooting bookended a summer of tragedy in Minnesota.\nTwo months earlier, former state Rep. Melissa Hortman was assassinated at her home along with her husband. State Sen. John Hoffman and his wife were targeted in a shooting that same night but survived.\nThe acts of political violence sent shockwaves through Minnesota and its political community. Walz, who eulogized Hortman at her funeral and served as a pallbearer, seemed to reference the June shooting when he spoke at a press conference in Minneapolis on Wednesday.\n“There’s a lot of cameras here and unfortunately we’ve been through these types of things,” he said. “They will be gone some point, but what happened here today will not be gone. Minnesotans will not step away. We’ll stand with this community.”\nThe Hortmans’ family said Wednesday the Catholic school shooting was a “senseless act of violence” and called on elected officials to act on “common-sense measures.”\n“Mark and Melissa believed that children should be able to gather in schools safely, that communities should be able to worship in peace, and that families should be safe in their homes,” the family said in a statement. “We hope this tragedy spurs elected officials to take action towards common-sense measures on access to high-powered weapons so that no one else must suffer.”\nThe June attacks were top of mind for Democrats this week, when the national party gathered in Minneapolis for its summer meeting. During the meeting’s opening session, Walz, Klobuchar, DNC chair Ken Martin and Minnesota Attorney General Keith Ellison all reflected on Hortman’s legacy.\n“We have not moved on from it,” Walz told Democrats Monday. “We are forever changed by it. But we are a hearty people … and we’ve seen these things happen. But I think the thing I’m most proud of is that legacy that Melissa Hortman leaves was one about improving lives.”\nShortly after Frey addressed a DNC committee Wednesday morning, Martin announced that the shooting had occurred and urged anyone with medical training to help if they could.\nThe meeting’s closing session, which was scheduled to last three hours, ended after less than 12 minutes. Martin, a native of Minnesota, began the shortened session by saying Democrats were heartbroken.\n“This is a tragic day for our city, and a tragic day for Minnesotans, on the heels of a tragic year, where we already lost our friends Melissa and Mark Hortman, and it’s unacceptable,” Martin said. “It’s just far too common place. Folks, we need your prayers, we need your faith, and we need leadership to stop this evil.”\nAfter a short prayer, the committee voted to unanimously approve the reports from all committees and adjourn early.\nThis story has been updated with additional details."
    },
    {
      "url": "https://www.cnn.com/2025/08/28/politics/rfk-susan-monarez-cdc-director-ousted-vaccines-analysis",
      "text": "Politically engineered chaos is destabilizing the top of America’s vital public health institutions, as Health and Human Services Secretary Robert F. Kennedy Jr.’s tenure challenges the historic role of government in widening access to vaccines.\nThe ouster Wednesday of Dr. Susan Monarez as director of the US Centers for Disease Control and Prevention — less than a month after she was sworn in — deepened concerns about the role of Kennedy, who has a history of vaccine skepticism. It will fuel fresh concerns the Trump administration is politicizing medicine, rejecting science and creating new risks to public health.\nSeveral other top CDC officials also announced they were quitting Wednesday, sending shock waves through an agency long regarded as the global gold standard that has been seriously diminished by the Trump administration.\nTop health experts described the loss of senior staffers as “reckless,” a “disaster,” and ruinous to evidence-based public health policy — leaving the country more vulnerable.\nCNN reported that Monarez’s firing comes after days of pressure from Kennedy’s deputy chief of staff and confidante Stefanie Spear, according to two people familiar with the situation. Monarez also clashed with Kennedy and his team over vaccine policies, including an impending announcement that could draw links between immunizations and autism, a person familiar with the situation told CNN.\nThe latest drama at the CDC follows an attack by a gunman on the agency’s headquarters in Atlanta earlier this month, which killed a police officer. The horror further fractured morale at an agency devastated by mass layoffs by RFK Jr.’s Department of Health and Human Services.\nCombined with vast changes to health guidance and policy being pushed through by the Trump administration, and huge cuts to federal health funding at elite research universities that have forged lifesaving breakthroughs, the latest shocks are plunging American public health into deep uncertainty.\nThe administration has also made massive reductions to US-funded health programs worldwide, including with the demolition of the US Agency for International Development, tarnishing the country’s reputation as a global health superpower.\nAll of this raises the risk that an administration devoted to “Making America Healthy Again” could end up complicit in many unnecessary deaths in years to come.\n‘Destructive chaos’ and an ‘absolute disaster’ for public health\nRFK Jr.’s nomination as Health and Human Services secretary owes much to the synergy between his past vaccine skepticism and the distrust of public health agencies among Trump’s conservative base that ballooned during the Covid-19 pandemic.\nHis tenure is already precipitating transformations in top health agencies that would take many years to reverse under future administrations.\n“Ousting the first Senate-confirmed CDC director weeks into the start of her tenure makes absolutely no sense and underscores the destructive chaos at RFK Jr.’s Department of Health and Human Services,” said Dr. Robert Steinbrook, health research group director at Public Citizen, a nonprofit consumer advocacy organization.\n“To make matters even worse, there are reports of additional resignations of critical high-ranking CDC staff,” Steinbrook said. “The CDC is being decapitated. This is an absolute disaster for public health.”\nDr. Tina Tan, the president of the Infectious Diseases Society of America, warned that politically motivated attacks on the country’s public health system must end.\n“The mass resignations of CDC expert leaders present a clear and present danger to Americans of all ages and leave our nation extremely vulnerable to a wide range of public health threats from outbreaks to bioterror attacks,” Tan said. “As we near respiratory virus season, it is imperative that our country have expert public health leadership for effective surveillance, communications and responses.”\nTam added, “The administration’s current trajectory for destroying the public health system is reckless and cannot continue.”\nMonarez’s lawyers said in a statement that “Secretary Kennedy and HHS have set their sights on weaponizing public health for political gain and putting millions of American lives at risk.” They also made clear that she had not resigned nor received notice of her dismissal from the White House as of late Wednesday.\nThe White House responded with a statement explicitly firing Monarez. “As her attorney’s statement makes abundantly clear, Susan Monarez is not aligned with the President’s agenda of Making America Healthy Again. Since Susan Monarez refused to resign despite informing HHS leadership of her intent to do so, the White House has terminated Monarez from her position with the CDC,” White House spokesperson Kush Desai said on Wednesday night.\nThe fact that Monarez has been ousted just weeks after she was confirmed by the Senate underscores the administration’s contempt for the legislative branch and its constitutional oversight role at a time when Trump is dismantling constraints on presidential power every day.\nMonarez, a longtime government scientist, wasn’t even the president’s first choice to run the CDC. His initial pick, Dr. Dave Weldon, a former Florida lawmaker, was withdrawn in March amid concerns in the White House about his public comments expressing skepticism about vaccines.\nNews of Monarez’s departure broke after Kennedy announced changes that will narrow access to Covid-19 vaccines. He celebrated the move, on X, claiming that emergency use authorizations had been used by the Biden administration to justify “broad mandates” on the population. His comment underscored how the lingering politics of the pandemic are a motivating force for Trump’s presidency.\nThe FDA approved updated vaccines for Covid-19 but constrained criteria for their use. The dose is permitted for adults 65 and older and younger people at higher risk from Covid-19. At a time when Covid-19 cases are spiking, it is now likely to become harder for the general population and especially younger children to get the vaccines.\nThis decision comes a few weeks after Kennedy announced that the government would terminate investments in 22 mRNA vaccine projects, claiming that they “fail to protect effectively against upper respiratory infections like Covid and flu.” This is despite the role of such vaccines in preventing severe disease and ending the Covid-19 pandemic. Such inoculations can be developed quickly and produced at a massive scare during an emergency and were demonstrated to be safe.\nKennedy has also fired the entire 17-member panel of outside vaccine experts who sit on the CDC’s Advisory Committee on Immunization Practices that reviews vaccine data and replaced them with his own selections, some of whom have expressed anti-vaccine views in the past.\nSenators had hoped Monarez would be a brake on RFK Jr.\nMany observers expected divisions between RFK Jr. and Monarez to emerge — but perhaps not quite so soon.\nDuring her confirmation hearing in June, Monarez described vaccines as “lifesaving” and pledged to prioritize vaccine availability. She said that she had no prejudices against the mRNA platform. And she said she had seen no “causal” link between vaccines and autism.\nKennedy’s boss, President Donald Trump, claimed Tuesday that his first-term Operation Warp Speed, which helped push out mRNA Covid vaccines, was “one of the greatest achievements ever in politics.” But Trump is also leery of highlighting the vaccines since the Republican Party’s base is laced with vaccine skepticism and hostility toward US health institutions that developed it.\nAt the same Cabinet meeting, Kennedy promised announcements in September and mentioned “certain interventions now that are clearly, almost certainly causing autism.” Trump replied that “there has to be something artificially causing this, meaning a drug or something.” The CDC has previously published several studies looking at a possible link between vaccines and vaccine ingredients and autism. None has found any evidence to suggest that vaccines increase the risk of autism or other neurodevelopmental disorders.\nKennedy’s moves on vaccines in recent months and his comments on autism are heightening anxiety among his critics that vital public health decisions are now being overly influenced by political goals.\nIt was clear during Monarez’s confirmation hearing that some senators on both sides of the political aisle were hoping that she would emerge as a constraint on Kennedy, who once described the Covid-19 inoculations as “the deadliest vaccine ever made.” Several senators extracted promises from Monarez to follow science. But Virginia Democratic Sen. Tim Kaine said that while he had no concerns about her qualifications, he had questions about “your willingness to follow through on your values.”\nIn the event, Monarez’s lawyers said Wednesday that she “refused to rubber-stamp unscientific, reckless directives and fire dedicated health experts, (and) she chose protecting the public over serving a political agenda.”\nIn his own confirmation hearing earlier this year, Kennedy repeatedly denied he was anti-vaccine — even though his denials contradicted on-the-record comments he’d made in the past.\nWhile his record on vaccines at HHS appears to be validating the fears of many Democrats who voted against him — and some Republicans who trusted his undertakings — his views on other issues enjoy more support. Kennedy’s warnings that unhealthy food and lifestyles are making many people sick are based in fact. But his recent implications that some conditions are purely the result of lifestyle and that some victims of Covid-19 might have died because of other health conditions have been disputed by numerous health experts.\nFollowing Kennedy’s purges at HHS, CDC and other agencies, such views will get less pushback.\nAnd with Monarez’s departure, RFK’s control over the government’s public health infrastructure — and by extension, the treatment and health-care options of tens of millions of Americans — is more unchallenged than ever."
    },
    {
      "url": "https://www.cnn.com/science/mit-insect-robots-mars-hnk-spc",
      "text": "A bee-like robot currently under development at the Massachusetts Institute of Technology (MIT) is part of a new generation of bots inspired by creepy crawlies.\nThe machine, which weighs less than a paperclip, can flap its wings up to 400 times a second and has achieved a maximum speed of two meters (6.5 feet) per second. It can also flip and hover.\n“We’re just trying to mimic these amazing maneuvers that bumblebees can achieve,” says Yi-Hsuan “Nemo” Hsiao, a fourth-year PhD student who is working on the robots.\nResearchers hope that it could someday help with tasks like artificial pollination, maybe even on other planets.\n“If you’re going to grow something on Mars, you probably don’t want to bring a lot of natural insects to do the pollination,” says Hsiao. “That’s where our robot could potentially come into play,” he adds.\nKevin Chen, an associate professor at MIT and the principal investigator at its Soft and Micro Robotics Lab adds that the team doesn’t want to replace bees, but put the robots to work in scenarios where the insects can’t.\nThey could be used in warehouse farms with rows of crops stacked high and ultraviolet lighting, he says: “It’s very difficult for bees to survive in that environment.”\nAcross the world, technologists are taking lessons from nature to create robots that might perform better at complex tasks or in difficult environments than traditional technology.\nAt Yale University, researchers developed a gecko-inspired robot that can amputate its own limbs – a capability that could be helpful in search and rescue missions in dangerous rubble, according to its creators.\nAnd researchers at South Korea’s Chung-Ang University recently unveiled a soft robot that can bend and crawl like a caterpillar.\n“Millions of years of evolution has helped to give (insects and animals) the best solution, especially for any type of locomotion,” says Hsiao, who writes the algorithms that tells the bee robots how to move.\nThe robot bee flies using soft artificial muscles that elongate and contract to flap the wing, developed by PhD candidate Suhan Kim. The robot’s laser-cut wings, and its tiny internal mechanisms, similar in size to watch components, are also made in-house.\nThe team is also working on a grasshopper-like robot. The machine, smaller than a human thumb, can hop 20 centimeters (almost 8 inches) into the air and take on terrains ranging from grass to ice to a leaf. Hsiao says that the jumping robot is more energy efficient than a flying robot.\nThe small size of the bee and grasshopper-like robots means they could be useful for search and rescue missions or exploring places like the inside of a pipeline or a turbine engine.\nHsiao says the next step in taking the technology into the real world is to add sensors that can feed information to the robots, and batteries to power them. The machines currently rely on a wire to power them. “It’s very difficult to put a small energy source onboard tiny robots,” adds Chen.\nThe ability to deploy a fully autonomous robot in the field could be 20 to 30 years away, he estimates.\nBut studying insects’ natural abilities will give his team a jumpstart. “They have evolved for millions of years” says Chen. “There’s a lot to be learned from insect motion, behavior and structure.”"
    },
    {
      "url": "https://www.cnn.com/weather",
      "text": "-\nIt could be a La Niña winter. Here’s what your region might see\n-\nHaboob slams Phoenix with a towering wall of dust, causing damage, airport delays and power outages\n-\nFirefighters gain ground on Oregon blaze as flames so far spare California wineries\n-\n• Video 0:51Video Massive dust wall sweeps through Arizona 0:51\n-\nFall-like weather is coming. Will it last?\n-\nHurricane Erin moves away from the East Coast, but it remains a coastal threat\n-\n• Live Updates Live UpdatesLive Updates Hurricane Erin pounds the North Carolina coast as it moves away\nAd Feedback\nLatest Video\n-\nVideo Hurricane Erin seen from space heading near East Coast 0:44Aug 20, 2025\n-\nVideo Video shows hurricane hunters flying through Erin 0:37Aug 17, 2025\n-\nVideo First major hurricane of the season intensifies to Category 5 0:48Aug 16, 2025\n-\nVideo CNN meteorologist breaks down ‘extreme’ rapid intensification of Hurricane Erin 1:35Aug 16, 2025\n-\nVideo See the latest forecast for Hurricane Erin 1:02Aug 15, 2025\nAd Feedback\nMore Weather News\n-\n• Video 4:34Video Anderson revisits horrific memory covering Hurricane Katrina 20 years ago 4:34\n-\n• Video 1:12Video What does La Niña mean for winter around the country? 1:12\n-\n• Video 0:30Video Massive dust storm engulfs Phoenix airport 0:30\n-\n• Video 0:51Video Massive dust wall sweeps through Arizona 0:51\n-\nTrump admin strips ocean and air pollution monitoring from next-gen weather satellites\n-\n• Video 0:44Video Hurricane Erin seen from space heading near East Coast 0:44\n-\n• Video 0:44Video Hurricane Erin seen from space heading near East Coast 0:44\n-\nHurricane Erin threatens dangerous surf for much of the East Coast as a new tropical system brews in its wake\n-\n• Video 1:07Video More tropical systems brew behind Erin 1:07\n-\nTropical storm watch issued for North Carolina coast, as Hurricane Erin brings life-threatening rip currents to Outer Banks\n-\n• Video 1:17Video Erin to churn up East coast after exploding in size 1:17\n-\nHurricane Erin is one of the fastest rapidly intensifying storms in Atlantic history\n-\n• Video 0:37Video Video shows hurricane hunters flying through Erin 0:37\n-\n• Video 0:37Video Hurricane hunters fly into eye of Hurricane Erin 0:37\n-\nHurricane Erin is one of the fastest rapidly intensifying storms in Atlantic history\n-\n• Video 0:48Video First major hurricane of the season intensifies to Category 5 0:48\nAd Feedback"
    },
    {
      "url": "https://www.cnn.com/2025/08/27/europe/france-skulls-king-toera-madagascar-intl-scli",
      "text": "France has returned three skulls to Madagascar more than a century after they were taken, including one believed to be that of a 19th-century Malagasy king who was beheaded by French troops.\nThe repatriation of the skulls to the island nation off the southeastern coast of Africa marks the first time France has implemented a 2023 law enabling the return of human remains to a country for funeral purposes.\nFrance conquered the kingdoms of the Sakalava people in western Madagascar in the 1890s and integrated the Sakalava into a newly formed French colony.\nOne of the three Sakalava skulls returned to Madagascar, which gained independence from France in 1960, is presumed to be that of King Toera, the French Ministry of Culture said in a statement Tuesday. He was executed by French troops in 1897.\nThe other two skulls belonged to two generals who fought with the king, Madagascar’s Ministry of Communications and Culture said in a statement Tuesday announcing the return of the “heroes.”\nThe skulls had been kept in collections held by France’s National Museum of Natural History until they were formally handed over at a ceremony at the culture ministry on Tuesday.\n“I welcome the return of these three skulls, including that of King Toera of the Sakalava people, an origin shared by nearly a third of the Malagasy population,” Fetra Rakotondrasoava, permanent secretary of Madagascar’s Ministry of Culture, who co-chaired the Malagasy-French Committee of Researchers working on the identification of the skulls, told CNN on Wednesday.\n“This is not only the repatriation of human remains, but the return of a part of our history and memory,” he said, adding: “We will now be able to honor these remains as they should be. This moment carries significance for the Malagasy people and for all nations engaged in the restitution of their heritage.”\nMadagascar’s Communication and Culture Minister, Volamiranty Donna Mara, said at the ceremony that the human remains, including that of “our great, indeed very great, King Toera,” are “not mere objects in a collection” but the link, “invisible and indelible, which binds our present to our past.”\n“Their absence, for more than a century, 128 years, has been an open wound at the heart of the Great Island (Madagascar), and especially for the Sakalava community of Menabe,” she continued.\nMadagascar’s culture ministry said the skulls will be reburied in Menabe, in the west of the island.\nSpeaking at the handover, French Culture Minister Rachida Dati said the ceremony “marks a historic event between France and Madagascar.”\nShe added that the joint Scientific Committee, established in October to examine Madagascar’s request for restitution, “has once again enabled us to appreciate the significance of the figure of King Toera, for your fellow citizens as a whole and for the Sakalava people in particular: for their identity, their dignity, their self-awareness, and the bond they wish to forge between past and future.”\nIn 2017, French President Emmanuel Macron said in a speech in Burkina Faso that “within the next five years, I want to see the conditions put in place so as to allow for the temporary or definitive restitution of African cultural heritage to Africa.”\nHe then commissioned a report released in 2018 that recommended that thousands of African artifacts looted during the colonial era be pulled out of French museums and returned to the continent.\nA similar push for restitution is being made in the United Kingdom, where lawmakers and campaigners released a report in March calling for an end to the display of human remains in museums and the sale of human body parts in auction houses."
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Ad Feedback\nMore top stories\n-\nDrainage crews stayed to protect New Orleans during Katrina. What they’d face was unimaginable\n-\nVideo People send over 2.5 billion messages to ChatGPT every day. Yes, that affects the planet 3:19\n-\nJapan releases AI-generated Mount Fuji eruption video to encourage Tokyo residents to be prepared\n-\nRussian and Chinese submarines conduct first-ever joint patrol in Pacific\n-\nJudges retire to consider verdict in trial of Hong Kong pro-democracy firebrand Jimmy Lai\n-\nAmerican Bitcoin, backed by Trump sons, aims to start trading in September\nCelebrities & entertainment\nAd Feedback\nAd Feedback\nCRIME & INVESTIGATIONS\nAd Feedback\nAd Feedback\nMore from CNN\n-\nWrestler ‘conscious and able to talk’ after being beaten by son of ex-UFC champion\n-\nDOGE put Americans’ Social Security records at risk, whistleblower says\n-\nAnalysis Trump’s new ‘dictator’ comment betrays his trick for expanding his power\n-\nWho is Lisa Cook, the first Fed governor a president has ever tried to fire?\n-\nCanceled wind project puts thousands of jobs at risk\n-\nAustralia expels Iranian ambassador after spy agency finds Iran directed antisemitic attacks on its soil\n-\nType 2 diabetes prevented with adherence to Mediterranean diet and exercise, study finds"
    },
    {
      "url": "https://www.cnn.com/specials/5-things?source=5_things_article",
      "text": "latest newsletters\n-\n5 things to know for August 28: CDC, Minneapolis school shooting, Ukraine, Israel-Hamas war, Sex education\n-\nHorrific school shooting, La Niña odds, gas station tonic: Catch up on the day’s stories\n-\n5 things to know for August 27: India tariffs, Package deliveries, Social Security, FEMA, Revolution wind project\n-\nActive shooter hoaxes, flesh-eating parasite, having good-enough sex: Catch up on the day’s stories\n-\n5 things to know for August 26: Federal Reserve, Trump vs. Pritzker, Flag burning, FEMA, Haboob\n-\nStruggling subways, in-flight fires, insights from Burning Man: Catch up on the day’s stories\n-\n5 things to know for August 25: Crime crackdown, Immigration, Typhoon Kajiki, Wildfires, Mississippi\n-\n5 things to know for August 22: Immigration, DC, Gerrymandering, Suicide hotline, Satellites\n-\nTarget’s brand crisis, a new Disney, hidden moon discovery: Catch up on the day’s stories\n-\n5 things to know for August 21: Hurricane Erin, HHS, Tulsi Gabbard, Texas floods, DC\n-\n‘Good moral character,’ too many tourists, the latest K-pop hit: Catch up on the day’s stories\n-\n5 things to know for August 20: Smithsonian, Immigration, DC, Texas redistricting, Covid-19\n-\nSummer ‘warming hole,’ elaborate diamond heist, futuristic furniture: Catch up on the day’s stories\n-\n5 things to know for August 19: Ukraine, Mail-in ballots, Texas legislature, Hurricane Erin, Immigration\n-\nA daring prison escape, crypto boom, huge Powerball jackpot: Catch up on the day’s stories\n-\n5 things to know for August 18: Ukraine, Israel-Hamas war, DC, Hurricane Erin, Pollution\n-\n5 things to know for August 15: DC, Alaska summit, Gerrymandering, ERs, Homelessness\n-\nTrump and Epstein’s relationship, blood pressure guidelines, college hookup culture: Catch up on the day’s stories\n-\n5 things to know for August 14: Alaska summit, ICE, Zelle, Infowars, Air Canada\n-\nClimate satellites under fire, Amazon’s new offering, how to survive AI: Catch up on the day’s stories"
    },
    {
      "url": "https://www.cnn.com/follow",
      "text": "Close icon\nUS\nWorld\nPolitics\nBusiness\nHealth\nEntertainment\nUnderscored\nStyle\nTravel\nSports\nScience\nClimate\nWeather\nUkraine-Russia War\nIsrael-Hamas War\nGames\nLabor Day Sales\nMore\nUS\nWorld\nPolitics\nBusiness\nHealth\nEntertainment\nUnderscored\nStyle\nTravel\nSports\nScience\nClimate\nWeather\nUkraine-Russia War\nIsrael-Hamas War\nGames\nLabor Day Sales\nWatch\nListen\nLive TV\nSubscribe\nSign in\nMy Account\nSettings\nNewsletters\nTopics you follow\nSign out\nYour CNN account\nSign in to your CNN account\nSign in\nMy Account\nSettings\nNewsletters\nTopics you follow\nSign out\nYour CNN account\nSign in to your CNN account\nLive TV\nListen\nWatch\nEdition\nUS\nInternational\nArabic\nEspañol\nEdition\nUS\nInternational\nArabic\nEspañol\nUS\nCrime + Justice\nWorld\nAfrica\nAmericas\nAsia\nAustralia\nChina\nEurope\nIndia\nMiddle East\nUnited Kingdom\nPolitics\nTrump\nFacts First\nCNN Polls\n2025 Elections\nBusiness\nTech\nMedia\nCalculators\nVideos\nMarkets\nPre-markets\nAfter-Hours\nFear & Greed\nInvesting\nMarkets Now\nNightcap\nHealth\nLife, But Better\nFitness\nFood\nSleep\nMindfulness\nRelationships\nCNN Underscored\nElectronics\nFashion\nBeauty\nHealth & Fitness\nHome\nReviews\nDeals\nGifts\nTravel\nOutdoors\nPets\nEntertainment\nMovies\nTelevision\nCelebrity\nTech\nInnovate\nForeseeable Future\nMission: Ahead\nWork Transformed\nInnovative Cities\nStyle\nArts\nDesign\nFashion\nArchitecture\nLuxury\nBeauty\nVideo\nTravel\nDestinations\nFood & Drink\nStay\nVideos\nSports\nPro Football\nCollege Football\nBasketball\nBaseball\nSoccer\nOlympics\nHockey\nScience\nSpace\nLife\nUnearthed\nClimate\nSolutions\nWeather\nWeather\nVideo\nClimate\nUkraine-Russia War\nIsrael-Hamas War\nWatch\nLive TV\nCNN Headlines\nCNN Shorts\nShows A-Z\nCNN10\nCNN Max\nCNN TV Schedules\nFlashDocs\nListen\nCNN 5 Things\nChasing Life with Dr. Sanjay Gupta\nThe Assignment with Audie Cornish\nOne Thing\nTug of War\nCNN Political Briefing\nThe Axe Files\nAll There Is with Anderson Cooper\nAll CNN Audio podcasts\nGames\nDaily Crossword\nJumble Crossword\nPhoto Shuffle\nSudoblock\nSudoku\n5 Things Quiz\nLabor Day Sales\nAbout CNN\nSubscribe\nPhotos\nInvestigations\nCNN Profiles\nCNN Leadership\nCNN Newsletters\nWork for CNN\nFollow CNN\nTopics you follow\nManage your email update preferences in\nAccount Settings\n.\nNew: Get the latest updates on topics you follow in your email inbox.\nSign up now\nAdd more topics\nSelect topics to follow\nUnlock your personalized feed and get email updates on topics you follow with a free CNN account.\nPopular\nAI\nAstronomy\nAviation news\nClimate change\nCongressional news\nDOGE\nEric Adams\nExtreme temperatures\nFashion and beauty\nGreen energy\nGun control\nHistory uncovered\nHurricanes\nImmigration\nInflation\nIsrael-Hamas war\nLGBTQ issues\nMovies\nOlympics\nRace & ethnicity\nStorms\nSupreme Court\nTariffs\nTech news\nThe Pope\nTikTok\nTrump legal cases\nUS military\nWar in Ukraine\nWellness\nAll\n5 Things\nAaron Rodgers\nAbortion rights\nAbuse in church\nActivism\nAdam Sandler\nAdele\nAfrica\nAge & Generations\nAgriculture\nAI\nAir quality\nAir travel safety\nAirplane crashes\nAlex Morgan\nAncient creatures\nAngel Reese\nAnimal stories\nAOC\nAriana Grande\nAsia\nAstronomy\nAuto industry\nAviation news\nAwards shows\nBaltimore bridge collapse\nBasketball\nBeatles\nBeyoncé\nBiden family\nBiden's cabinet\nBillie Eilish\nBono\nBrad Pitt\nBradley Cooper\nBritney Spears\nBruce Springsteen\nBTS\nCaitlin Clark\nCampus protests\nCancer\nCardi B\nChildren's health\nChina\nChronic diseases\nCivil conflicts\nClimate & Wildlife\nClimate change\nClint Eastwood\nCoco Gauff\nCongressional news\nCorporate news\nCrime\nCristiano Ronaldo\nCruises\nCrypto\nCulture wars\nDeep space\nDementia\nDemocratic Natl Committee\nDemocratic Natl Convention\nDemocratic presidential candidates\nDenzel Washington\nDigital privacy\nDigital security\nDisability issues\nDiversity and equity\nDOGE\nDolly Parton\nDonald Trump\nDrought\nDrugs in society\nDua Lipa\nDwayne Johnson\nEarthquakes\nEconomy\nEducation policy\nElection polls\nElection security\nElectoral college\nEllen DeGeneres\nElton John\nEndangered life\nEnvironmental disease\nEric Adams\nEuropean Union\nExtreme temperatures\nFashion and beauty\nFEC\nFederal agencies\nFighting disinformation\nFlorence Pugh\nFood & drink\nFood & health\nFootball\nFreedom of religion\nFreedom of speech\nGardening\nGenetics\nGeorge Clooney\nGeorgia election case\nGetting older\nGolf\nGreen energy\nGubernatorial elections\nGun control\nGun violence\nHarry Styles\nHealth care policy\nHeart disease\nHistory uncovered\nHomes\nHouse election\nHouse leadership\nHousehold debt\nHuman rights\nHurricanes\nImmigration\nImmigration politics\nIndependent candidates\nIndia\nIndigenous people\nInflation\nInterest rates\nInterior design\nInvesting\nIsrael-Hamas war\nJanuary 6th\nJapan\nJason Aldean\nJay-Z\nJD Vance\nJennifer Lawrence\nJennifer Lopez\nJessica Pegula\nJob market\nJoe Biden\nJohnny Depp\nJulia Roberts\nJustin Bieber\nKamala Harris\nKanye West\nKaty Perry\nKim Kardashian\nKylian Mbappe\nLabor unions\nLady Gaga\nLeBron James\nLeonardo DiCaprio\nLewis Hamilton\nLGBTQ issues\nLibertarian Party\nLionel Messi\nLively-Baldoni lawsuit\nLizzo\nMadonna\nMaria Sharapova\nMaternal health\nMatt Gaetz\nMax Verstappen\nMedia\nMedicare\nMegan Rapinoe\nMegan Thee Stallion\nMen's health\nMental health\nMeryl Streep\nMexico\nMichael Jordan\nMick Jagger\nMike Tyson\nMiley Cyrus\nMovies\nMusic\nNational security\nNATO\nNew in medicine\nNorth Korea\nNovak Djokovic\nNRA\nObituaries\nOceania\nOil & gas\nOlivia Rodrigo\nOlympics\nOprah Winfrey\nPACs\nParenting\nPatrick Mahomes\nPaul McCartney\nPay & income\nPedro Pascal\nPeople in entertainment\nPeople in sports\nPersonal finance\nPete Hegseth\nPlanned Parenthood\nPolicing\nPollution\nPort workers strike\nPoverty\nPrescription drugs\nPresidential debates\nPrimary elections\nRace & ethnicity\nRafael Nadal\nRail travel\nReality entertainment\nRelationships\nReligion\nRepublican National Committee\nRepublican National Convention\nRepublican presidential candidates\nRespiratory viruses\nRetail consumer\nRingo Starr\nRolling Stones\nRoyals\nRussia\nSam Bankman-Fried\nSamuel L. Jackson\nSean 'Diddy' Combs\nSenate election\nSenate leadership\nSerena Williams\nShaquille O'Neal\nShohei Ohtani\nSimone Biles\nSoccer\nSocial media\nSouth America\nSouth Korea\nSpace programs\nSpace tourism\nState & local races\nSteph Curry\nStocks\nStorms\nStudent life\nSupreme Court\nSupreme Court justices\nSustainability\nSyria conflict\nTariffs\nTaxes\nTaylor Swift\nTech giants\nTech news\nTennis\nTerrorism\nThe Amazon\nThe Caribbean\nThe Middle East\nThe Pope\nThe UN\nTiger Woods\nTikTok\nTim Walz\nTom Brady\nTom Cruise\nTom Hanks\nTrain accidents\nTravel News\nTravis Kelce\nTrump appointments\nTrump family\nTrump legal cases\nTulsi Gabbard\nTupac Shakur killing\nTV shows\nTyler Perry\nUK\nUS elections\nUS military\nUS shutdown\nVaccines\nVehicle safety\nVenus Williams\nVeterans\nVideo gaming\nVisual arts\nVolcanoes\nVoting rights\nWar in Ukraine\nWater availability\nWellness\nWildfires\nWill Smith\nWinding down\nWomen's health\nWork life\nZendaya\nNext\nCancel\nor\nsign in to see your topics\nFind this page again in your account menu. Feedback? Let us know at\nFollow@cnn.com\n.\nDon't miss out on new stories!\nGet updates on topics you follow in your email inbox.\nSign up\nSign up\nUh, oh. Something happened.\nIt could be you, or it could be us, but there's no page here."
    },
    {
      "url": "https://www.cnn.com/2025/08/24/science/video/lunaer-asteroid-2024-yr4-collision-moon-digvid",
      "text": "Video Ad Feedback\nLunar surface may take a direct hit from incoming asteroid\nThe asteroid known as 2024 YR4, a building-sized object that initially appeared to be on a potential collision course with Earth, is now moving beyond the reach of telescopes on its orbit around the sun. However, its revised trajectory is drawing attention to another possible target: the moon.\n01:12\n- Source:\nCNN\nTrending Now\n22 videos\nVideo Ad Feedback\nLunar surface may take a direct hit from incoming asteroid\nVideo Ad Feedback\nThinking about trying out a weighted vest? Watch this first\nSee the moment helicopter crashes into pond\nVideo Ad Feedback\n'He's a human golden retriever': CNN reporter on Taylor Swift's new fiancé\nVideo Ad Feedback\nSee Gap ad with Katseye going viral after jeans ad controversy\nVideo Ad Feedback\nWhy 'Sean the Science Kid' thinks memories are superpowers\nVideo Ad Feedback\nKids can’t get enough of ‘KPop Demon Hunters.’ We asked them to explain why\nVideo Ad Feedback\n'White Lotus' star reveals how he makes his character's accent believable\nVideo Ad Feedback\nSee how a whole church was moved across a city in Sweden\nVideo Ad Feedback\n‘Severance’ star reveals what happens when people meet her in real life\nVideo Ad Feedback\nPanic in Milan airport as man sets fire to check-in desk\nVideo Ad Feedback\nThis hotel has the ‘biggest mattress in the Indian Ocean’\nVideo Ad Feedback\nViral Labubus boost company’s profits by nearly 400%\nVideo Ad Feedback\nVikings face backlash after two male cheerleaders join team\nGas line explosion sends debris flying"
    }
  ],
  "argos_summary": "The article compiles a wide array of current events, from a new documentary on the last two northern white rhinos and the political turmoil that saw CDC Director Susan Monarez ousted, to a tragic shooting at a Minneapolis Catholic school that killed two children. It also reports on Russia’s overnight attack on Kyiv, protests in Israel over the Gaza war, and the Trump administration’s threat to cut federal funding for sex‑education programs that mention gender identity. Additional pieces cover a MIT‑developed bee‑inspired robot, a landmark fast‑radio‑burst observation, and broader topics such as sustainability on college campuses and the state of public health leadership.",
  "argos_id": "GUTGNG4IC"
}