{
  "url": "https://www.washingtontimes.com/news/2025/aug/28/production-underway-armys-second-wave-short-range-reconnaissance/",
  "authorsByline": "https://www.washingtontimes.com/staff/ben-wolfgang/, Ben Wolfgang, The Washington Times https://www.washingtontimes.com",
  "articleId": "5887f08356f0466fa4c0f4ae9726505f",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/19/shutterstock_2478588559_c286-0-3714-2000_s1200x700.jpg?a0d1e114d76c3a290157867a8b9b86d7e820fdac",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T11:10:04+00:00",
  "addDate": "2025-08-28T11:19:00.960449+00:00",
  "refreshDate": "2025-08-28T11:19:00.960450+00:00",
  "score": 1.0,
  "title": "Production underway for Army’s second wave of short-range reconnaissance drones",
  "description": "The Army this week said production is underway on the second wave of short-range reconnaissance drones for its soldiers as the service, and the military as a whole, begin to equip warfighters with small, unmanned vehicles at the tactical level.",
  "content": "The Army this week said production is underway on the second wave of short-range reconnaissance drones for its soldiers as the service, and the military as a whole, begin to equip warfighters with small, unmanned vehicles at the tactical level.\n\nIn a press release, the Army said Teal Drones and the company’s Black Widow system are one of the two vendors chosen to manufacture the next round of craft. The California-based company Skydio said in a May press release that it is delivering its X10D small unmanned aircraft systems as part of the second round of the program\n\nThe short-range reconnaissance drone initiative, the Army said, is “part of a broader Army effort to evaluate how personnel, tactics, and technologies align to meet the demands of modern warfare.” The small drones are easy to transport and relatively easy to use, meaning they can be employed on the battlefield as a way for units to identify threats, find targets, and otherwise complete missions while reducing risk to soldiers.\n\nThe Army said that such systems have become “indispensable assets on the modern battlefield,” and that the attributes of the short-range reconnaissance craft will improve soldier survivability by giving them new tools for real-time intelligence and target acquisition.\n\nSince the project began in September 2022, the Army said that more than 16 brigades have been outfitted with such drones.\n\nMore broadly, the Pentagon is in the midst of a major effort to build drones in massive numbers. Some defense industry sources have told Threat Status that small drones in particular are in many ways becoming like ammunition: Basic, attritable pieces of warfighting equipment that virtually every soldier will soon have in their personal tool kit.",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "small drones",
      "weight": 0.10792594
    },
    {
      "name": "such drones",
      "weight": 0.09419335
    },
    {
      "name": "drones",
      "weight": 0.087707005
    },
    {
      "name": "soldier survivability",
      "weight": 0.0802412
    },
    {
      "name": "Army",
      "weight": 0.0779009
    },
    {
      "name": "such systems",
      "weight": 0.07692749
    },
    {
      "name": "short-range reconnaissance drones",
      "weight": 0.075693905
    },
    {
      "name": "soldiers",
      "weight": 0.07394956
    },
    {
      "name": "new tools",
      "weight": 0.066380374
    },
    {
      "name": "many ways",
      "weight": 0.06617146
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.9482421875
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.8935546875
    },
    {
      "name": "/Law & Government/Military/Air Force",
      "score": 0.52490234375
    },
    {
      "name": "/News/Other",
      "score": 0.48583984375
    }
  ],
  "sentiment": {
    "positive": 0.48426613,
    "negative": 0.054094907,
    "neutral": 0.46163896
  },
  "summary": "The Army is beginning production of the second wave of short-range reconnaissance drones for its soldiers. The move is part of a broader effort to identify how personnel, tactics, and technologies align to meet the demands of modern warfare. The drones are easy to use and can aid units in identifying threats and finding targets while reducing risk. Since the project began in September 2022, over 16 brigades have been equipped with such drones.",
  "shortSummary": "The Army is producing the second wave of short-range reconnaissance drones, using technology from Teal Drones and Army-produced material like camouflage.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a4e87017d1744cbbbd4b9d7286118f5c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The U.S. Army has begun production of a second wave of short‑range reconnaissance drones, selecting Teal Drones and Black Widow as vendors and incorporating Skydio’s X10D system. The program, launched in September 2022, has already equipped more than 16 brigades and aims to give soldiers real‑time intelligence and target‑acquisition tools to enhance survivability. The Army views these small drones as essential, almost ammunition‑like, components of modern battlefield tactics, reflecting a broader Pentagon push to mass‑produce unmanned systems for tactical use.",
  "argos_id": "ITXPTMP37"
}