{
  "url": "https://www.morningstar.com/news/accesswire/1066421msn/investor-webinar-via-investor-meet-company",
  "authorsByline": "",
  "articleId": "2f8a36130b944771ae46cfd023c8ee34",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T01:00:00-05:00",
  "addDate": "2025-08-28T06:29:22.184569+00:00",
  "refreshDate": "2025-08-28T06:29:22.184571+00:00",
  "score": 1.0,
  "title": "Investor Webinar Via Investor Meet Company",
  "description": "",
  "content": "THIS ANNOUNCEMENT AND THE INFORMATION CONTAINED HEREIN IS RESTRICTED AND IS NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN, INTO OR FROM AUSTRALIA, JAPAN OR THE REPUBLIC OF SOUTH AFRICA OR TO BE TRANSMITTED, DISTRIBUTED TO, OR SENT BY, ANY NATIONAL OR RESIDENT OR CITIZEN OF ANY SUCH COUNTRIES OR ANY OTHER JURISDICTION IN WHICH SUCH RELEASE, PUBLICATION OR DISTRIBUTION MAY CONTRAVENE LOCAL SECURITIES LAWS OR REGULATIONS.\n\nCASCAIS, PORTUGAL / ACCESS Newswire / August 28, 2025 / Pulsar Helium Inc. (AIM:PLSR)(TSXV:PLSR)(OTCQB:PSRHF) (\"Pulsar\" or the \"Company\"), a leading helium project development company, is pleased to announce that Thomas Abraham-James, Pulsar's CEO, and Brad Cage, Vice President Engineering, will provide a live investor presentation via Investor Meet Company on 3 September 2025 at 4:30 pm BST (08:30 am PST, 10:30 am CST, 11:30 am EST).\n\nThomas Abraham-James will be providing an update on Pulsar's recent news flow, including:\n• None The recent £3.7 million (approximately C$7 million) fundraise, and how the funds will advance the Company's flagship Topaz Project in Minnesota.\n• None Pulsar's recent major flow test results, with natural flow rates more than tripling those recorded in 2024.\n• None The non-binding US$12.5 million project financing expression of interest from University Bank, Michigan, to finance the construction of a helium processing plant at the Topaz Project.\n\nThe presentation is open to all existing and potential shareholders. Questions can be submitted pre-event via your Investor Meet Company dashboard up until 2 September 2025 at 09:00 am BST, or at any time during the live presentation.\n\nInvestors can sign up to Investor Meet Company for free to meet Pulsar Helium Inc. via: https://www.investormeetcompany.com/pulsar-helium-inc-1/register-investor\n\nInvestors who already follow Pulsar Helium Inc. on the Investor Meet Company platform will automatically be invited.\n\nOAK Securities*\n\n(Joint Broker)\n\nJerry Keen (Corporate Broking) / Henry Clarke (Institutional Sales) / Dillon Anadkat (Corporate Advisory)\n\ninfo@OAK-securities.com\n\n+44 203 973 3678\n\n*OAK Securities is the trading name of Merlin Partners LLP, a firm incorporated in the United Kingdom and regulated by the UK Financial Conduct Authority.\n\nPulsar Helium Inc. is a publicly traded company listed on the AIM market of the London Stock Exchange and the TSX Venture Exchange with the ticker PLSR, as well as on the OTCQB with the ticker PSRHF. Pulsar's portfolio consists of its flagship Topaz helium project in Minnesota, USA, and the Tunu helium project in Greenland. Pulsar is the first mover in both locations with primary helium occurrences not associated with the production of hydrocarbons identified at each.\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nThis news release contains forward-looking information within the meaning of Canadian securities legislation (collectively, \"forward-looking statements\") that relate to the Company's current expectations and views of future events. Any statements that express, or involve discussions as to, expectations, beliefs, plans, objectives, assumptions or future events or performance (often, but not always, through the use of words or phrases such as \"will likely result\", \"are expected to\", \"expects\", \"will continue\", \"is anticipated\", \"anticipates\", \"believes\", \"estimated\", \"intends\", \"plans\", \"forecast\", \"projection\", \"strategy\", \"objective\" and \"outlook\") are not historical facts and may be forward-looking statements. Forward-looking statements herein include, but are not limited to, statements relating to the potential impact of the drill results, flow testing and pressure testing on the next iteration of the resource estimate; the potential of CO2 as a valuable by-product of the Company's future helium production; and the potential for future wells. Forward-looking statements may involve estimates and are based upon assumptions made by management of the Company, including, but not limited to, the Company's capital cost estimates, management's expectations regarding the availability of capital to fund the Company's future capital and operating requirements and the ability to obtain all requisite regulatory approvals.\n\nNo reserves have been assigned in connection with the Company's property interests to date, given their early stage of development. The future value of the Company is therefore dependent on the success or otherwise of its activities, which are principally directed toward the future exploration, appraisal and development of its assets, and potential acquisition of property interests in the future. Un-risked Contingent and Prospective Helium Volumes have been defined at the Topaz Project. However, estimating helium volumes is subject to significant uncertainties associated with technical data and the interpretation of that data, future commodity prices, and development and operating costs. There can be no guarantee that the Company will successfully convert its helium volume to reserves and produce that estimated volume. Estimates may alter significantly or become more uncertain when new information becomes available due to for example, additional drilling or production tests over the life of eld. As estimates change, development and production plans may also vary. Downward revision of helium volume estimates may adversely affect the Company's operational or financial performance.\n\nHelium volume estimates are expressions of judgement based on knowledge, experience and industry practice. These estimates are imprecise and depend to some extent on interpretations, which may ultimately prove to be inaccurate and require adjustment or, even if valid when originally calculated, may alter significantly when new information or techniques become available. As further information becomes available through additional drilling and analysis the estimates are likely to change. Any adjustments to volume could affect the Company's exploration and development plans which may, in turn, affect the Company's performance. The process of estimating helium resources is complex and requires significant decisions and assumptions to be made in evaluating the reliability of available geological, geophysical, engineering, and economic date for each property. Different engineers may make different estimates of resources, cash flows, or other variables based on the same available data.\n\nForward-looking statements are subject to a number of risks and uncertainties, many of which are beyond the Company's control, which could cause actual results and events to differ materially from those that are disclosed in or implied by such forward- looking statements. Such risks and uncertainties include, but are not limited to, that Pulsar may be unsuccessful in drilling commercially productive wells; the uncertainty of resource estimation; operational risks in conducting exploration, including that flow-testing, pressure testing and drill costs may be higher than estimates; commodity prices; health, safety and environmental factors; and other factors set forth above as well as under \"Cautionary Note Regarding Forward Looking Statements and Market and Industry Data\" and \"Risk Factors\" in the AIM Admission Document published on October 14, 2024 found on the Company's web site at https://pulsarhelium.com/investors/aim-rule-26/default.aspx and the Company's Annual Information Form dated as of July 31, 2025 found on the Company's profile at www.sedarplus.ca.\n\nForward-looking statements contained in this news release are as of the date of this news release, and the Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law. New factors emerge from time to time, and it is not possible for the Company to predict all of them or assess the impact of each such factor or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. No assurance can be given that the forward-looking statements herein will prove to be correct and, accordingly, investors should not place undue reliance on forward-looking statements. Any forward-looking statements contained in this news release are expressly qualified in their entirety by this cautionary statement.",
  "medium": "Article",
  "links": [
    "https://pr.report/dpa0",
    "https://www.accessnewswire.com/newsroom/en/metals-and-mining/investor-webinar-via-investor-meet-company-1066421",
    "https://pr.report/dpa1",
    "https://pr.report/dpa3",
    "https://pr.report/dpa2",
    "https://pr.report/dpa4",
    "https://www.accessnewswire.com/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Investor Meet Company",
      "weight": 0.085828826
    },
    {
      "name": "Company",
      "weight": 0.081896156
    },
    {
      "name": "Helium volume estimates",
      "weight": 0.079120584
    },
    {
      "name": "helium volume estimates",
      "weight": 0.079120584
    },
    {
      "name": "helium volumes",
      "weight": 0.06911506
    },
    {
      "name": "helium resources",
      "weight": 0.0663416
    },
    {
      "name": "Pulsar Helium Inc.",
      "weight": 0.05964984
    },
    {
      "name": "primary helium occurrences",
      "weight": 0.05835274
    },
    {
      "name": "future events",
      "weight": 0.05626605
    },
    {
      "name": "statements",
      "weight": 0.05580779
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.99609375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97509765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.921875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.83447265625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.323974609375
    }
  ],
  "sentiment": {
    "positive": 0.2332962,
    "negative": 0.04387789,
    "neutral": 0.7228258
  },
  "summary": "Pulsar Helium Inc. (AIM:PLSR), a leading helium project development company, is set to host a live investor presentation via Investor Meet Company on 3 September 2025 at 4:30pm BST (08:30am PST, 10:30 am CST, 11:30 a. EST). Thomas Abraham-James, Pulsar's CEO, and Brad Cage, Vice President Engineering, will provide an update on Pulsars' recent news flow, including the recent £3.7 million (approximately C$7 million) fundraise, which will advance the Company's flagship Topaz Project in Minnesota, USA, and the Tunu helium project in Greenland. The presentation is open to all existing and potential shareholders. Pulsara Helium is a publicly traded company listed on the AIM market of the London Stock Exchange and the TSX Venture Exchange.",
  "shortSummary": "Pulsar Helium Inc. will present a live investor presentation via Investor Meet Company, highlighting recent developments and potential future developments in its flagship helium projects.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4f8eec736d424330af8484556383e116",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://pr.report/dpa2",
      "text": "#PLSR 📢 Upcoming Investor Presentation. Pulsar Helium is pleased to share that CEO Thomas Abraham-James and VP Engineering Brad Cage will provide a live investor presentation and Q&A via Investor Meet Company on 03 Sept 2025 at 16:30 BST | 08:30 PST | 10:30 CST | 11:30 EST. Key topics will include: • The recent £3.7 million fundraise and its application to the Topaz Project. • Record flow test results, more than tripling 2024 output. • Non-binding US$12.5 million project financing interest from University Bank, Michigan. Investors can register for free and submit questions in advance via this link. 🔗 https://lnkd.in/dJzW-sVQ $PLSR $PSRHF #Helium #TopazProject #InvestorUpdate\nPulsar Helium Inc\nOil and Gas\nCascais, Lisbon 2,450 followers\nPulsar Helium Inc is a primary helium company with assets in Minnesota and Greenland AIM/TSXV: PLSR & OTCQB: PSRHF\nAbout us\nPulsar Helium Inc (AIM: PLSR, TSXV: PLSR, OTCQB: PSRHF & FRA: Y3K) exists to bring clarity to an otherwise opaque and little-known commodity. Opaque in the sense that there is no open market for the trading of helium, and little-known as it is typically associated with its use in balloons, while neglecting its more important applications in science and technology. The prize is developing our projects to the point of potential production, with our Topaz Project in the USA being the most advanced, having been drilled and flowing up to 14.5% helium. Our work program will determine the viability of Topaz to become a commercial operation, should it be successful our intention is to make the production facility carbon-neutral and be an independent producer of helium. We are a dedicated explorer and developer of primary helium projects. The word ‘primary’ is important, as we focus on assets where the primary economic driver is helium, it is not a by-product, and not associated with significant hydrocarbons.\n- Website\n-\nhttps://www.pulsarhelium.com\nExternal link for Pulsar Helium Inc\n- Industry\n- Oil and Gas\n- Company size\n- 2-10 employees\n- Headquarters\n- Cascais, Lisbon\n- Type\n- Public Company\n- Founded\n- 2022\nLocations\n-\nPrimary\nGet directions\nRua Frederico Arouca 251\n2 Frente\nCascais, Lisbon 2750-356, PT\nEmployees at Pulsar Helium Inc\n-\nJón Ferrier\nNon-Executive Director\n-\nMichael Sturdy\nGeneral Manager - Operations\n-\nThomas Abraham-James\nPresident & CEO at Pulsar Helium | Geologist | Entrepreneur | Leader in Mineral Exploration & Resource Innovation\n-\nDan O'Brien\nChief Financial Officer at Golden Oak Corporate Services\nUpdates\n-\n#PLSR RNS ⚡ Pulsar Reports Jetstream #1 Flowing Over 1.3 Million Cubic Feet Per Day & Launches Multi-Well Drilling Program @ Topaz. Summary as follows: * Jetstream #1, high flow under compression: The Jetstream #1 well was flow-tested using a wellhead compressor, which resulted in a peak gas flow rate of approximately 1.3 million cubic feet per day (MMcf/d). * Drilling contract secured: Pulsar has signed a master services agreements with Timberline Drilling, Inc. to undertake a multi-well core drilling program at the Topaz project. The contract covers drilling of up to ten wells, targeting helium-bearing zones at depths up to ~3,937 feet (~1,200 meters). Thomas Abraham-James President & CEO commented: \"This program aims to significantly expand our understanding of the helium reservoir and accelerate our path toward production. Crucially, as we map the reservoir’s continuity, results will be plentiful, regular, and rich in insight - providing the granular detail and real-time analysis needed to successfully guide the program across our land position, target the most prospective locations, and unlock the full potential of this regional-scale opportunity. The outstanding result from Jetstream #1, which flowed substantial volumes of gas with minimal assistance, underscores the reservoir’s exceptional potential.\" Read News Release: https://lnkd.in/dCR54rMZ $PLSR $PSRHF #CriticalRawMaterials Dan O'Brien Neil Herbert FCCA Doris Meyer Brice Laurent Prof. Nick Schofield Michael Sturdy Marc Farrington focusIR Jerry Keen London South East Chart Industries, Inc. TSX Trust VSA Capital MiningMinnesota Yellow Jersey PR Wade Emmerson\n-\n#PLSR Live Webinar hosted by GOLDINVEST with Q&A Today! Date: Monday, August 25 2025 Time: 11:00 EDT | 16:00 BST | 17:00 CEST Register now 👉 https://lnkd.in/dGuRNHyY The session includes a presentation, progress update and a moderated Q&A with investors. $PLSR $PSRHF #CriticalRawMaterials Thomas Abraham-James Neil Herbert FCCA Dan O'Brien Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Marc Farrington focusIR Jerry Keen London South East Chart Industries, Inc. Baker Hughes The Ely Echo The Minnesota Star Tribune TSX Trust VSA Capital MiningMinnesota Yellow Jersey PR Wade Emmerson Battery Commodity\n-\n#PLSR Onsite @ Topaz. ⚡ Last week’s testing at Jetstream #1, Topaz helium project (MN, USA) wrapped with a major leap in performance - natural flow rates more than tripled vs. 2024. ⚡ Further testing and gas analyses to follow. ⚡ Thomas Abraham-James CEO comment: \"This result validates our subsurface model, significantly de-risks the Topaz project, and confirms the reservoir’s outstanding productivity.\" $PLSR $PSRHF #CriticalRawMaterials Dan O'Brien Neil Herbert FCCA Doris Meyer Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Marc Farrington focusIR Jerry Keen London South East Chart Industries, Inc. Baker Hughes Envision Energy James Mercer techUK TSX Trust VSA Capital MiningMinnesota Yellow Jersey PR Jonah Kaplan Philip Bodinet Wade Emmerson\n-\n#PLSR RNS ⚡Pulsar Announces Major Flow Test Results at Jetstream #1, Topaz Project. Pulsar is delighted to report major natural flow test results at the Jetstream #1 appraisal well, part of the Topaz helium project in Minnesota, USA. These latest results mark a major leap in well performance, with natural flow rates more than tripling those recorded in 2024. Summary of the results is as follows: * On August 15, 2025 Jetstream #1 achieved a peak natural flow rate of ~501 thousand cubic feet per day (~501 Mcf/d) on a 38/64” choke at ~30 pounds per square inch (psi) well head pressure (WHP), achieved with no compression or stimulation. No formation water has been encountered; the gas has flowed as dry gas. * Substantial improvement over 2024 tests: In April 2024, Jetstream #1 achieved a peak natural flow of ~150 Mcf/d at 34 psi WHP (~821 Mcf/d under well-head compression) with helium concentrations ranging from 8.7% to 14.5%; the well is now flowing at more than three times the rate recorded in April 2024 under similar pressure conditions. Thomas Abraham-James President & CEO commented: “The deepening of the Jetstream #1 appraisal well to a total depth of 5,100 feet, penetrating the entire interpreted helium-bearing zone, has proven highly successful\" ... \"This is especially exciting considering the 2024 gas analysis for the same well returned helium concentrations ranging from 8.7% to 14.5%. With further flow testing, including under well-head compression, and gas composition analyses to follow, we look forward to sharing further updates, and the results of Jetstream #2. These results underscore the immense opportunity at Topaz and signal the start of unlocking its full potential.” Read News Release: https://lnkd.in/dRMaYf9x $PLSR $PSRHF #CriticalRawMaterials Dan O'Brien Neil Herbert FCCA Doris Meyer Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Marc Farrington focusIR Jerry Keen London South East Chart Industries, Inc. Baker Hughes TSX Trust VSA Capital MiningMinnesota Yellow Jersey PR Jonah Kaplan Philip Bodinet Wade Emmerson\n-\n#PLSR RNS ⚡ Pulsar Announces Receipt of Non-Binding US$12.5 Million Project Financing Expression of Interest from University Bank, Michigan. Pulsar is pleased to announce that University Bank, a Michigan-based banking company wholly owned by University Bancorp, Inc., has provided a non-binding expression of interest to provide Pulsar with project financing of up to US$12.5 million for the construction of a helium processing plant at the Company’s wholly owned Topaz project in Minnesota, USA. University Bancorp, Inc. currently holds approximately 4.9% of Pulsar’s issued share capital. Thomas Abraham-James President & CEO, commented: “We are extremely grateful for University Bank’s continued support and confidence in Pulsar. Their financing interest of lending Pulsar up to US$12.5 million for the construction of a helium processing plant marks another important step towards delivering the Topaz project into production. This potential funding, alongside the extension of our existing line of credit, strengthens our ability to move forward decisively with construction planning and execution.” Read News Release: https://lnkd.in/dWexcYmr $PLSR $PSRHF #CriticalRawMaterials Dan O'Brien Doris Meyer Neil Herbert FCCA Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Michael Sturdy Marc Farrington focusIR Jerry Keen London South East Chart Industries, Inc. Baker Hughes TSX Trust VSA Capital MiningMinnesota Yellow Jersey PR\n-\n#PLSR Cell & Gene Therapy (CGT): Helium’s Expanding Role in Next-Gen Med-Tech Global demand for CGT-enabling infrastructure is growing. According to recent analysis, the market for automated and closed cell therapy processing systems is projected to grow from US $1.5 billion in 2024 to more than US $9 billion by 2034 (Source: Market.us). A wave of derived demand for the critical materials that make this growth possible - including #helium - is expected to follow. This week, UK-based biotechnology company Minaris Advanced Therapies announced the launch of a new GMP facility in Munich, Germany - a move that further expands its global CGT manufacturing network. Minaris, a leading contract development and manufacturing organization (CDMO), plays a key role in scaling access to advanced therapies. Helium - while not directly involved in gene editing itself - plays a vital role across multiple technologies that underpin CGT development, delivery, and diagnostics. Read more: https://lnkd.in/gV62_aMj #PLSRINSIGHTS $PLSR $PSRHF Thomas Abraham-James Neil Herbert FCCA Doris Meyer Dan O'Brien Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Marc Farrington focusIR Jerry Keen London South East Chart Industries, Inc. Baker Hughes TSX Trust VSA Capital MiningMinnesota\n-\n#PLSR The Hidden Catalyst: Europe’s #Hydrogen Ambitions Poised to Accelerate #Helium Demand. While hydrogen plays a central role in decarbonising industrial processes, helium quietly sits at the core - poised to experience a surge in derived demand due to its unique and irreplaceable role as a cryogenic refrigerant. The liquefaction of hydrogen, neon, deuterium, and tritium - gases critical to multiple high-growth sectors - is heavily reliant on helium's unique ability to reach the ultra-low temperatures these gases require. During liquefaction, helium - though not consumed - is essential. It circulates in a closed-loop refrigeration system as a working fluid, absorbing and transferring heat through compressors, heat exchangers, and expansion turbines to reach temperatures near 20 K (-253°C), where hydrogen condenses into liquid. Liquid nitrogen, which boils at 77 K, can’t achieve this. Helium, with its ultra-low boiling point of 4.2 K (-269°C), provides the thermal performance required - making it the coolant of choice for advanced cryogenic applications. Read more: https://lnkd.in/dkDxe6dT #PLSRINSIGHTS $PLSR $PSRHF Thomas Abraham-James Neil Herbert FCCA Doris Meyer Dan O'Brien Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Marc Farrington focusIR Jerry Keen London South East Crux Investor Chart Industries, Inc. Baker Hughes Duluth Area Chamber of Commerce OTC Markets Group TSX Trust VSA Capital MiningMinnesota\n-\n#PLSR UK Government’s £63M EV Infrastructure Investment Signals Surging Demand for #Helium Governments across the UK and EU are ramping up investment in the infrastructure needed to support the electric vehicle (EV) transition. This month, the UK announced £63 million in new funding to accelerate deployment - from pavement-integrated home charging gullies to NHS fleet electrification and depot upgrades. It’s the latest in a wave of policy-driven momentum across Europe, aimed at decarbonising transport and making EV ownership more accessible. The rapid deployment of infrastructure funding supports a UK EV market already in sharp ascent: over 175,000 battery electric vehicles (BEVs) - fully electric cars with no internal combustion engine - were registered in the first five months of 2025, marking a 29% year-on-year increase (Sce: heycar). Across the Channel, the EU continues to post record-breaking EV sales - driven in part by the growing presence of Chinese manufacturers such as BYD, XPeng, and MG. These brands are making significant inroads into the European market, accelerating competition and expanding consumer choice. BEV sales surged 25 - 28% in early 2025, with 570,943 units sold in Q1 alone (Sce: Zapmap). Read more: https://lnkd.in/d2CN73vM #PLSRINSIGHTS $PLSR $PSRHF Thomas Abraham-James Neil Herbert FCCA Doris Meyer Dan O'Brien Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Marc Farrington Jerry Keen focusIR London South East Crux Investor Chart Industries, Inc. Duluth Area Chamber of Commerce BlytheRay OTC Markets Group TSX Trust VSA Capital MiningMinnesota\n-\n#PLSR The Energy Trifecta: Power. Production. Planet. Why the Future Runs on #Helium As global energy demand surges, governments face a new reality: the urgent need to deliver cleaner power at scale. This shift from sheer output to long-term sustainability is elevating the profile of an often-overlooked element: helium. Helium is now indispensable across the clean energy value chain - critical for: > Power generation in advanced nuclear systems. > Production and manufacturing of high-tech electronics and infrastructure. > Planet decarbonisation technologies including carbon capture and hydrogen. This month, xAI - Elon Musk’s #AI venture - announced plans to purchase an overseas power plant to support its sprawling data center in Memphis, which requires up to 2 gigawatts of dedicated power per day to run one million AI processors - enough energy to power nearly 2 million homes daily - surpassing the demand of the largest existing U.S. data centers. The move has sparked concern over emissions and underscored the urgent need for scalable, clean power infrastructure - but the market demands AI solutions, and fast. And AI solutions demand vast amounts of energy. Helium demand is set to rise in parallel, as it plays a critical role across three fronts: ⚡ Producing the chips that power AI systems. ⚡ Enabling the sustainable energy solutions that could ultimately run them. ⚡ Supporting the carbon capture technologies that may one day offset their emissions footprint. Read more: https://lnkd.in/eRqg5eqS #PLSRINSIGHTS $PLSR $PSRHF Thomas Abraham-James Neil Herbert FCCA Doris Meyer Dan O'Brien Brice Laurent Brad Cage Prof. Nick Schofield Michael Sturdy Marc Farrington Jerry Keen focusIR London South East Crux Investor Chart Industries, Inc. Duluth Area Chamber of Commerce BlytheRay OTC Markets Group TSX Trust VSA Capital Oak Hill Financial MiningMinnesota Better In Our Back Yard Bill Tai"
    }
  ],
  "argos_summary": "Pulsar Helium Inc. will hold a live investor presentation on 3 September 2025 featuring CEO Thomas Abraham‑James and VP Engineering Brad Cage. The session will cover a £3.7 million fundraise for its Topaz helium project in Minnesota, record flow‑test results that more than tripled 2024 output, and a non‑binding US$12.5 million financing interest from University Bank for a helium processing plant. Pulsar, listed on AIM, TSXV and OTCQB, is developing primary helium projects in the U.S. and Greenland and aims to become a carbon‑neutral producer. Investors can register for free and submit questions in advance via Investor Meet Company.",
  "argos_id": "J29XFPI2K"
}