{
  "url": "https://www.techspot.com/news/109237-switch-2-sales-outpace-original-75-driving-record.html",
  "authorsByline": "Daniel Sims",
  "articleId": "8777270adc0c45c2869106c5b67dedcb",
  "source": {
    "domain": "techspot.com",
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.techspot.com/images2/news/bigimage/2025/04/2025-04-23-image-17.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T00:34:01-05:00",
  "addDate": "2025-08-28T05:42:07.837521+00:00",
  "refreshDate": "2025-08-28T05:42:07.837525+00:00",
  "score": 1.0,
  "title": "Switch 2 sales outpace original by 75%, driving record July hardware growth",
  "description": "According to Circana and Sensor Tower, the Nintendo Switch 2 sold 2 million units in the US between its June launch and the end of July, outpacing...",
  "content": "The big picture: Nintendo's success in dodging supply constraints has turned the Switch 2 into the fastest-selling console in the company's history. New data confirms this in the US, where the Switch 2 was the only console to drive growth in hardware spending in July.\n\nAccording to Circana and Sensor Tower, the Nintendo Switch 2 sold 2 million units in the US between its June launch and the end of July, outpacing the original Switch's early sales by 75%. Nintendo's new handheld console singlehandedly fueled annual hardware spending growth during one of the best Julys for the video game industry in decades.\n\nTotal hardware spending across the industry reached $384 million, up 21% from last July. This marks the strongest July for hardware since 2008, when spending topped $441 million.\n\nHowever, all other consoles declined significantly year-over-year last month. PlayStation 5 sales fell 47%, the original Nintendo Switch dropped 52%, and Xbox Series consoles plunged 69%. Unsurprisingly, the Switch 2 was the best-selling console, with the PS5 in second place for both July 2025 and the year to date.\n\nThe trend echoes the Switch 2's worldwide record-breaking launch in June, when it sold 3.5 million units in four days to become the fastest-selling console in Nintendo's history. Global sales have likely surpassed 6 million by the time of this writing. By comparison, the original Switch has sold more than 153 million units since its 2017 debut, though its launch was constrained by supply shortages.\n\nDonkey Kong Bananza was the highest-selling physical game on Nintendo platforms in July and the third-highest-selling title overall, trailing only EA Sports College Football 26 and the 2025 EA Sports MVP Bundle. However, when including digital and bundled sales, Mario Kart World would likely rank near the top, as Nintendo has confirmed it is the most popular Switch 2 game.\n\nOther strong performers in July included Tony Hawk's Pro Skater 3 + 4 and Grounded 2. Meanwhile, Elden Ring: Nightreign fell sharply, dropping from first place in June to 16th.\n\nOverall spending on games and content rose slightly year-over-year in July, but by single digits. Accessory spending fell 8%, and all categories outside hardware remain slightly down year-to-date compared to 2024. The year's top-selling games so far are Monster Hunter Wilds, The Elder Scrolls IV: Oblivion Remastered, and College Football 26.\n\nIn total sales and content spending, the market grew by single digits year-on-year in July. However, spending on accessories fell by 8%, and all categories outside of hardware spending have declined slightly year-to-date compared to the same period in 2024. Monster Hunter Wilds, The Elder Scrolls IV: Oblivion Remastered, and College Football 26 are 2025's top-selling games so far.",
  "medium": "Article",
  "links": [
    "https://www.techspot.com/images2/news/bigimage/2025/08/2025-08-27-image-28.jpg",
    "https://www.techspot.com/news/108542-switch-2-owners-report-overheating-crashes-even-less.html",
    "https://www.techspot.com/news/109214-lessons-learned-playstation-studios-boss-changes-introduced-avoid.html",
    "https://bsky.app/profile/did:plc:bhqrrxt7yyfpwguioa7rwa7x/post/3lxf3jiq7dc26?ref_src=embed",
    "https://bsky.app/profile/did:plc:bhqrrxt7yyfpwguioa7rwa7x?ref_src=embed",
    "https://www.techspot.com/news/108271-nintendo-switch-2-tops-35-million-sales-four.html",
    "https://www.techspot.com/news/108905-nintendo-revenue-doubles-switch-2-sales-top-58.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nintendo Switch",
      "weight": 0.11280277
    },
    {
      "name": "record July hardware growth",
      "weight": 0.100872695
    },
    {
      "name": "hardware spending",
      "weight": 0.09995798
    },
    {
      "name": "Total hardware spending",
      "weight": 0.09667062
    },
    {
      "name": "annual hardware spending growth",
      "weight": 0.09654686
    },
    {
      "name": "Switch",
      "weight": 0.09036035
    },
    {
      "name": "last July",
      "weight": 0.08845815
    },
    {
      "name": "July",
      "weight": 0.08514273
    },
    {
      "name": "year",
      "weight": 0.08407002
    },
    {
      "name": "content spending",
      "weight": 0.08323015
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.77734375
    },
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.6640625
    },
    {
      "name": "/Computers & Electronics/Consumer Electronics/Game Systems & Consoles",
      "score": 0.43603515625
    },
    {
      "name": "/Games/Computer & Video Games/Other",
      "score": 0.4072265625
    }
  ],
  "sentiment": {
    "positive": 0.049735546,
    "negative": 0.8738693,
    "neutral": 0.07639514
  },
  "summary": "The Nintendo Switch 2 has become the fastest-selling console in the company's history, surpassing the original Switch's early sales by 75%. This growth led to record hardware spending growth in the US in July, with total hardware spending reaching $384 million, up 21% from the previous year. However, all other consoles saw significant declines year-over-year, with the Switch 2 being the best-seller. The Switch 2's global sales are likely to exceed 6 million units, compared to the original's 153 million units. Meanwhile, Nintendo's Donkey Kong Bananza was the highest-selling physical game on Nintendo platforms in July and the third-highest-selling title overall.",
  "shortSummary": "The Nintendo Switch 2 surpassed its predecessor's sales by 75% in July, driving strong hardware growth and boosting global sales.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4d84f0238eca44bba8e8b4d25d73f277",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Nintendo’s Switch 2 has become the fastest‑selling console in the company’s history, moving 2 million units in the U.S. between its June launch and the end of July and driving a 21% rise in total hardware spending to $384 million, the strongest July for the industry since 2008. All other major consoles saw sharp year‑over‑year declines—PS5 fell 47%, the original Switch 52% and Xbox Series 69%—making the Switch 2 the top‑selling console for both July 2025 and the year to date. Globally the Switch 2 sold 3.5 million units in four days and has likely surpassed 6 million units overall, while its flagship game Mario Kart World and titles like Donkey Kong Bananza and Tony Hawk’s Pro Skater 3 + 4 dominated July sales. Hardware spending grew, but accessory and other category spending fell, with Monster Hunter Wilds, The Elder Scrolls IV: Oblivion Remastered and College Football 26 topping the year’s game sales.",
  "argos_id": "K2JWRPXRV"
}