{
  "url": "https://finance.yahoo.com/news/ethereum-etf-inflows-overtake-bitcoin-110746206.html",
  "authorsByline": "Bhushan Akolkar",
  "articleId": "a86539820a7248b7930273a12ef5aab0",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/coinspeaker_us_106/bac37699bf229d1f49dbff0f43cbb295",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T11:07:46+00:00",
  "addDate": "2025-08-28T11:59:27.988473+00:00",
  "refreshDate": "2025-08-28T11:59:27.988474+00:00",
  "score": 1.0,
  "title": "Ethereum ETF Inflows Overtake Bitcoin ETFs by Nearly 10x in a Week",
  "description": "Inflows into spot Ethereum ETFs have skyrocketed to a total of $1.83 billion during the last five trading sessions. As a result, the Ethereum ETH $4 593 24h volatility: 0.0% Market cap: $554.26 B Vol. 24h: $32.60 B funds have attracted over 10x the inflows seen in spot Bitcoin ETFs ...",
  "content": "Inflows into spot Ethereum ETFs have skyrocketed to a total of $1.83 billion during the last five trading sessions.\n\nAs a result, the Ethereum funds have attracted over 10x the inflows seen in spot Bitcoin ETFs during the same period, which saw only $171million in inflows.\n\nThis clearly highlights investor sentiment shifting from Bitcoin to Ethereum.\n\nOn Wednesday, the trend of stronger inflows into Ether funds persisted, with nine ETH funds recording $310.3 million in net inflows, compared to $81.1 million across 11 spot Bitcoin funds. BlackRock’s ETHA dominated most of the inflows at $262 million, thereby taking the total inflows since inception to more than $13 billion.\n\nThe BlackRock Ethereum ETF (ETHA) recorded net inflows of 57,584 ETH, valued at $265.74 million, on August 27, with $1.6 billion in trading volume.\n\nThis marks the fifth consecutive day of inflows for ETHA, bringing the cumulative total to $1.2 billion\n\nMeanwhile, Nate Geraci, president of NovaDius Wealth Management, noted that spot Ether ETFs have accumulated nearly $10 billion in inflows since the beginning of July.\n\nLaunched 13 months ago, these ETFs have seen total aggregate inflows of $13.6 billion. A large part of the inflows have come just over the past three months.\n\nApart from retail investors, Investment advisers are the biggest buyers of Spot Ethereum ETFs, as per the latest data from Bloomberg Intelligence.\n\nBloomberg ETF analyst James Seyffart reported on August 27 that investment advisers are now the main holders of Ether ETFs. They invested more than $1.3 billion, equal to 539,000 ETH, in Q2, which is a 68% increase from the previous quarter.\n\nVincent Liu, Chief Investment Officer at Kronos Research, stated that as more advisers embrace Bitcoin and Ether ETFs, cryptocurrencies are increasingly being positioned as a long-term diversification tool in traditional portfolios, alongside equities, bonds, and other mainstream assets.\n\nAs a result, Ether price has outpaced Bitcoin this week, climbing 5% from Tuesday’s low. On the other hand, Bitcoin gained just 2.8% over the same period.\n\nThe latest reports show that institutional ETH purchases have been on the rise, amid renewed confidence in the asset.\n\nRead original story Ethereum ETF Inflows Overtake Bitcoin ETFs by Nearly 10x in a Week by Bhushan Akolkar at Coinspeaker.com",
  "medium": "Article",
  "links": [
    "https://secure.money.com/pr/sdccd4b30b28?s1=POM&s2=Vertical",
    "https://www.coinspeaker.com/author/bhushan_akolkar/",
    "https://finance.yahoo.com/news/blackrock-leads-455-million-ethereum-150026294.html",
    "https://secure.money.com/pr/oa80b51d8b14?s1=POM&s2=Vertical",
    "https://www.coinspeaker.com/ethereum-etfs-10x-inflows-vs-bitcoin/",
    "https://secure.money.com/pr/j9884ce60aa0?s1=POM&s2=Vertical",
    "https://www.coinspeaker.com/institutions-flood-into-ethereum-markets-neutral/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ethereum ETF Inflows",
      "weight": 0.1369381
    },
    {
      "name": "spot Bitcoin ETFs",
      "weight": 0.11724232
    },
    {
      "name": "Bitcoin ETFs",
      "weight": 0.11675223
    },
    {
      "name": "spot Ethereum ETFs",
      "weight": 0.11116224
    },
    {
      "name": "net inflows",
      "weight": 0.11096008
    },
    {
      "name": "Inflows",
      "weight": 0.10732838
    },
    {
      "name": "inflows",
      "weight": 0.10732838
    },
    {
      "name": "stronger inflows",
      "weight": 0.106833264
    },
    {
      "name": "Ether ETFs",
      "weight": 0.10663653
    },
    {
      "name": "total aggregate inflows",
      "weight": 0.10483708
    }
  ],
  "topics": [
    {
      "name": "Blockchain"
    },
    {
      "name": "Cryptocurrency"
    },
    {
      "name": "Altcoins"
    },
    {
      "name": "Bitcoin"
    },
    {
      "name": "Ethereum"
    },
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.7236328125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.61767578125
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.41552734375
    }
  ],
  "sentiment": {
    "positive": 0.7986788,
    "negative": 0.03941592,
    "neutral": 0.1619053
  },
  "summary": "Inflows into spot Ether ETFs have surged by nearly 10x in a week, reaching a total of $1.83 billion. This is over 10x the inflows seen in spot Bitcoin ETFs during the same period. This indicates investor sentiment shifting from Bitcoin to Ether. The BlackRock's ETHA (ETHA) recorded most of these inflows at $262 million, bringing total inflows to more than $13 billion. Investment advisers are the biggest buyers of Spot EtherETFs, with over $1 billion invested in Ether in Q2.",
  "shortSummary": "Ethereum ETFs have surged 10x to $1.83 billion, driven by strong investor sentiment, with BlackRock's ETHA dominating inflows.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a81887b8cd4e4926b179e6e8e69244d3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/blackrock-leads-455-million-ethereum-150026294.html",
      "text": "World’s largest asset manager BlackRock led the $450 million inflows registered across all US Ethereum ETF issuers on August 26.\nInflows into Ether ETFs have shot up significantly this week, crossing the $13 billion milestone since inception. The ETH price has bounced back once again, gaining 4.5% today, and surging past $4,600 levels.\nSpot Ethereum ETF Inflows Surge Again, Led by BlackRock\nUS-listed Ethereum ETFs recorded $455 million in net inflows on Tuesday, marking their fourth straight day of gains.\nData from SoSoValue shows that both BlackRock and Fidelity led the surge, with ETHA adding $323 million and FETH bringing in $85.5 million. Grayscale’s ETHE and its Mini Ethereum Trust also reported positive inflows.\nInvest in Gold\nAmid the ongoing development, BlackRock iShares Ethereum Trust (ETHA) is hitting new records with $16.5 billion in assets under management.\nThe asset manager purchased an additional 71,037 ETH, valued at $323.08 million, with $2 billion in trading volume on August 26. This marks the fourth consecutive day of inflows for the fund, bringing its cumulative total to $984 million.\nThe BlackRock Ethereum ETF now holds a total of 3.775 million of Ethereum, with more than 2million ETH accumulated just over the past two months.\nOn Tuesday, the ETHA share price surged another 4%, closing at the high of $34.82. Also, the share price is up by over 100% in the last six months, highlighting strong demand for the BlackRock fund.\nMeanwhile, Bitcoin ETFs recorded $88.2 million in total daily inflows across six funds, continuing a trend where Ether ETFs are outpacing their Bitcoin counterparts.\nOn Monday, inflows into Ethereum ETFs were more than double those of spot Bitcoin ETFs, signaling a “significant rotational shift” from Bitcoin to Ethereum.\nETH Price Rises 4% Above $4,600\nETH price is once again showing strength after a pullback to $4,300 last week. Since then, Ethereum has regained 7% and is currently trading above $4,600 levels.\nAnalyst Daan Crypto Trades noted that ETH price is maintaining its diagonal support while consolidating in the current price range. Key levels to monitor include the 2021 all-time high near $4,900 and local support between $4,000 and $4,100.\nPrice action within this range is expected to remain volatile until a clear breakout direction emerges.\nETH Treasury firms continue to purchase in big numbers. Bitmine Technologies (NYSE: BMNR) purchased nearly 200,000 ETH over the past week.\nRead original story BlackRock Leads $455 Million Ethereum ETF Inflows, as ETH Price Shoots 4% by Bhushan Akolkar at Coinspeaker.com"
    },
    {
      "url": "https://www.coinspeaker.com/institutions-flood-into-ethereum-markets-neutral/",
      "text": "A crypto journalist with over 5 years of experience in the industry, Parth has worked with major media outlets in the crypto and finance world, gathering experience and expertise in the space after surviving bear and bull markets over the years. Parth is also an author of 4 self-published books.\nKey Notes\n- Goldman Sachs leads institutional Ethereum ETF exposure with $721M.\n- Ethereum ETFs saw record inflows, hitting $13.3B by late August.\n- VanEck CEO calls ETH the “Wall Street token” amid stablecoin adoption.\nThe crypto market has cooled into neutral territory, with the Fear and Greed Index at 48. But while retail sentiment hesitates, institutions are piling into Ethereum ETH $4 599 24h volatility: 0.2% Market cap: $555.02 B Vol. 24h: $32.81 B with a never-before-seen optimism.\nBitcoin Fear and Greed Index is 48. Neutral\nCurrent price: $112,934 pic.twitter.com/omih7DGib2— Bitcoin Fear and Greed Index (@BitcoinFear) August 28, 2025\nWall Street Takes the Lead\nBloomberg analyst James Seyffart revealed that Goldman Sachs is now the top holder of Ethereum ETFs, disclosing $721.8 million in exposure, equal to 288,294 ETH. Jane Street follows with $190.4 million, while Millennium holds $186.9 million.\nHere's the top holders of the ETH ETFs according mostly to 13F data as of 2Q.\nFull report can be read here for Bloomberg customers: https://t.co/Zr9t8OuE9Z pic.twitter.com/MxpAM27mhk\n— James Seyffart (@JSeyff) August 27, 2025\nTotal institutional Ethereum ETF exposure has climbed to $2.44 billion, representing 975,650 ETH.\nInvestment advisors dominate the field with $1.35 billion in exposure, while hedge funds hold $690 million and brokerages $253 million. Pension funds and banks, however, have scaled back.\nETF Inflows Break Records\nEthereum ETFs are also seeing explosive demand, with Seyffart’s chart revealing inflows jumping from $4.2 billion at the end of June to $13.3 billion by late August, including $3.7 billion in August alone.\nYesterday, we published our note on the top holders of Ethereum ETFs. Advisors are dominating the known holders and have pulled away from Hedge Funds. pic.twitter.com/qvP6ZGN3VI\n— James Seyffart (@JSeyff) August 27, 2025\nPublic companies are also adding Ethereum to their balance sheets. Seventeen listed firms now hold 3.4 million ETH worth nearly $15.7 billion, with BitMine leading at 1.7 million ETH.\nEthereum as the “Wall Street Token”\nVanEck CEO Jan van Eck believes Ethereum will be the blockchain backbone for stablecoins, calling it the “Wall Street token.”\nHe argued that with stablecoins surpassing $280 billion in supply, banks will be forced to adopt Ethereum-based infrastructure or risk being left behind.\nSpeaking to Fox Business, van Eck said banks and financial services firms will have no choice but to integrate blockchain solutions to process stablecoin transactions.\nARK Invest Doubles Down\nCathie Wood’s ARK Invest has pushed deeper into Ethereum exposure, buying another $15.6 million of BitMine Immersion Technologies shares, lifting its total stake above $300 million.\nHere's every move Cathie Wood and Ark Invest made in the stock market today 8/27 pic.twitter.com/s1t7lgAl9o\n— Ark Invest Tracker (@ArkkDaily) August 28, 2025\nBitMine itself holds $7.9 billion in ETH, making ARK’s investment a major indirect bet on Ethereum.\nThis strategy places BitMine as ARK’s second-largest crypto-equity investment after Coinbase, where it holds $676 million worth of shares.\nIt is clear that while retail sentiment may be flat, institutions are locking in. Amid surging ETF inflows, corporate treasury adoption, and Wall Street’s growing bets, ETH could soon hit the $5,000 price tag, which positions it as the next crypto to explode.\nDisclaimer: Coinspeaker is committed to providing unbiased and transparent reporting. This article aims to deliver accurate and timely information but should not be taken as financial or investment advice. Since market conditions can change rapidly, we encourage you to verify information on your own and consult with a professional before making any decisions based on this content."
    },
    {
      "url": "https://www.coinspeaker.com/ethereum-etfs-10x-inflows-vs-bitcoin/",
      "text": "Bhushan is a FinTech enthusiast and holds a good flair in understanding financial markets. His interest in economics and finance draw his attention towards the new emerging Blockchain Technology and Cryptocurrency markets. He is continuously in a learning process and keeps himself motivated by sharing his acquired knowledge. In free time he reads thriller fictions novels and sometimes explore his culinary skills.\nKey Notes\n- BlackRock’s Ethereum ETF (ETHA) led the inflows with $265.74 million on Wednesday alone, contributing to five consecutive days of inflows.\n- Following yesterday’s inflows, spot Ether ETFs have seen $13.6 billion in inflows since launch.\n- Investment advisers dominate Ether ETF holdings, investing $1.3 billion (539,000 ETH) in Q2, surging 68% from the previous quarter.\nInflows into spot Ethereum ETFs have skyrocketed to a total of $1.83 billion during the last five trading sessions.\nAs a result, the Ethereum ETH $4 593 24h volatility: 0.1% Market cap: $554.25 B Vol. 24h: $32.06 B funds have attracted over 10x the inflows seen in spot Bitcoin ETFs during the same period, which saw only $171million in inflows.\nThis clearly highlights investor sentiment shifting from Bitcoin BTC $113 030 24h volatility: 1.7% Market cap: $2.25 T Vol. 24h: $37.40 B to Ethereum.\nEthereum ETFs Outperform Their Bitcoin Counterpart\nOn Wednesday, the trend of stronger inflows into Ether funds persisted, with nine ETH funds recording $310.3 million in net inflows, compared to $81.1 million across 11 spot Bitcoin funds. BlackRock’s ETHA dominated most of the inflows at $262 million, thereby taking the total inflows since inception to more than $13 billion.\nThe BlackRock Ethereum ETF (ETHA) recorded net inflows of 57,584 ETH, valued at $265.74 million, on August 27, with $1.6 billion in trading volume.\nThis marks the fifth consecutive day of inflows for ETHA, bringing the cumulative total to $1.2 billion\n8/27 BlackRock ETH ETF $ETHA\nNet flow 57,584 ETH ($265.74 million)\nVolume traded: $1.6 billion(5 CONSECUTIVE INFLOW DAY, TOTALING $1.2 BILLION) https://t.co/J0L6jAe7da pic.twitter.com/J9AFoWMweO\n— Trader T (@thepfund) August 28, 2025\nMeanwhile, Nate Geraci, president of NovaDius Wealth Management, noted that spot Ether ETFs have accumulated nearly $10 billion in inflows since the beginning of July.\nLaunched 13 months ago, these ETFs have seen total aggregate inflows of $13.6 billion. A large part of the inflows have come just over the past three months.\nOver $300mil inflows into spot eth ETFs…\nNow $1.2bil for the week.\n$4bil in August.\nApproaching $10bil since beginning of July.\n— Nate Geraci (@NateGeraci) August 28, 2025\nInvestment Advisers Buying Ether ETFs\nApart from retail investors, Investment advisers are the biggest buyers of Spot Ethereum ETFs, as per the latest data from Bloomberg Intelligence.\nBloomberg ETF analyst James Seyffart reported on August 27 that investment advisers are now the main holders of Ether ETFs. They invested more than $1.3 billion, equal to 539,000 ETH, in Q2, which is a 68% increase from the previous quarter.\nYesterday, we published our note on the top holders of Ethereum ETFs. Advisors are dominating the known holders and have pulled away from Hedge Funds. pic.twitter.com/qvP6ZGN3VI\n— James Seyffart (@JSeyff) August 27, 2025\nVincent Liu, Chief Investment Officer at Kronos Research, stated that as more advisers embrace Bitcoin and Ether ETFs, cryptocurrencies are increasingly being positioned as a long-term diversification tool in traditional portfolios, alongside equities, bonds, and other mainstream assets.\nAs a result, Ether price has outpaced Bitcoin this week, climbing 5% from Tuesday’s low. On the other hand, Bitcoin gained just 2.8% over the same period.\nThe latest reports show that institutional ETH purchases have been on the rise, amid renewed confidence in the asset.\nDisclaimer: Coinspeaker is committed to providing unbiased and transparent reporting. This article aims to deliver accurate and timely information but should not be taken as financial or investment advice. Since market conditions can change rapidly, we encourage you to verify information on your own and consult with a professional before making any decisions based on this content."
    }
  ],
  "argos_summary": "Spot Ethereum ETFs have attracted $1.83 bn in inflows over the last five sessions, more than ten times the $171 mn seen in Bitcoin ETFs, pushing total inflows past $13 bn since launch. BlackRock’s ETHA led the flow with $265 mn on August 27, and investment advisers now dominate holdings with $1.3 bn in Q2, a 68 % jump from Q1. The inflows have lifted ETH price 5 % this week, outperforming Bitcoin’s 2.8 % gain, and signal a shift of institutional capital toward crypto as a diversification tool.",
  "argos_id": "NPQ7OMPBT"
}