{
  "url": "https://www.bbc.com/news/articles/cly350nq3dgo",
  "authorsByline": "BBC News",
  "articleId": "2469f9bcd25d4bde82bd83d4848b9289",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/b5f3/live/1bbaab20-f67c-11ee-9dec-59d5c770a05e.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T10:49:38.557000+00:00",
  "addDate": "2025-08-28T11:39:27.426226+00:00",
  "refreshDate": "2025-08-28T11:39:27.426229+00:00",
  "score": 1.0,
  "title": "Councillor Audrey Dempsey who made 'white racism' claim joins Reform",
  "description": "Audrey Dempsey was suspended from Scottish Labour over alleged racist remarks in April 2024 and later quit.",
  "content": "A Glasgow councillor who quit Labour after making an unsubstantiated claim about a rise in \"racist attacks on white children and teachers\" has joined Reform. Audrey Dempsey was suspended from Labour in April 2024 and later quit to sit as an independent after she was accused of making racist remarks. She is now the second Reform councillor in Glasgow, joining the council's former Scottish Conservative group leader Thomas Kerr, who quit his party in January. Dempsey said she hoped to make \"real change\" with Reform as she believed the party was not afraid of having \"difficult conversations\".\n\nScottish Labour launched an investigation into Demsey's remarks last year, but a party spokeswoman said it never concluded because she left the party. Dempsey did not provide statistical evidence for her claim about a rise in attacks, which was contained in an agenda for a recent meeting of the Labour group. She previously told BBC Scotland News that she had asked \"an honest question\". It was not asked at the meeting. Glasgow City Council said it was \"not aware of any rise in incidents of this kind across the city\". When she quit, Dempsey accused the party of a \"character assassination\" and said she felt \"deeply hurt and disappointed\". She has represented Shettleston and Robroyston as an independent councillor since then.\n\nDempsey said there was \"no place\" for an independent in Glasgow and people had to be in a party to make \"real change\". She said: \"We need drastic change and we need it sooner rather than later. We can shape Glasgow Reform to suit the needs of Glasgow. \"Nothing has been changing at all. I feel other political parties are afraid of difficult conversations. They try to brush it aside. \"Reform don't shy away from these conversations.\" Dempsey said she no longer believed that Labour represented the rights of working class people, claiming she \"saw very little evidence of that\" as a party member. BBC News has contacted Scottish Labour for further comment. The councillor added: \"I have done research on the party and Nigel Farage. Everything he says he will do – he does. \"There is no other leader can say that. He has been true to his word.\"",
  "medium": "Article",
  "links": [
    "https://www.bbc.co.uk/news/articles/ceq39x2257eo",
    "http://www.bbc.co.uk/news/scotland",
    "https://www.bbc.com/news/topics/cp7r8vgl20xt",
    "https://www.bbc.com/news/topics/cr0me11dlg6t",
    "https://www.bbc.co.uk/news/articles/cr74kg1vg4jo",
    "https://www.bbc.com/news/topics/cdl8n2edx7vt",
    "https://www.bbc.co.uk/news/scotland/glasgow_and_west",
    "https://www.bbc.com/news/topics/cp07jzgm24jt",
    "https://www.bbc.co.uk/news/articles/c4nmg141l8eo",
    "https://www.bbc.com/lnp/ldrs",
    "https://www.bbc.co.uk/news/articles/cy48p5132qno"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other political parties",
      "weight": 0.100323856
    },
    {
      "name": "Scottish Labour",
      "weight": 0.09898713
    },
    {
      "name": "Councillor Audrey Dempsey",
      "weight": 0.094818905
    },
    {
      "name": "Glasgow Reform",
      "weight": 0.094171904
    },
    {
      "name": "Labour",
      "weight": 0.08705189
    },
    {
      "name": "Audrey Dempsey",
      "weight": 0.08220455
    },
    {
      "name": "Glasgow City Council",
      "weight": 0.077052616
    },
    {
      "name": "Dempsey",
      "weight": 0.07618506
    },
    {
      "name": "BBC Scotland News",
      "weight": 0.0761461
    },
    {
      "name": "BBC News",
      "weight": 0.07181519
    }
  ],
  "topics": [
    {
      "name": "Racial Injustice"
    },
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.96435546875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.87890625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.833984375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.6630859375
    },
    {
      "name": "/News/Local News",
      "score": 0.57666015625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.56494140625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.53125
    },
    {
      "name": "/People & Society/Other",
      "score": 0.52099609375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.398193359375
    }
  ],
  "sentiment": {
    "positive": 0.03793349,
    "negative": 0.7596857,
    "neutral": 0.20238078
  },
  "summary": "Glennish councillor Audrey Dempsey, who was suspended from Labour in April 2024 and later resigned as an independent, has joined Reform, joining the former Scottish Conservative group leader Thomas Kerr. Dempsey was accused of making racist remarks and did not provide statistical evidence for her claim about a rise in \"racist attacks on white children and teachers\". She accused the party of a \"character assassination\" and felt \"deeply hurt and disappointed\". She now joins Reform, stating she hopes to make \"real change\" with the party.",
  "shortSummary": "Glasgow councillor Audrey Dempsey, who quit Labour over unsubstantiated racist remarks, joined Reform, aiming for real change without fear of controversy.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1f7934178e4e4fb786f51d87df941eeb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/c4nmg141l8eo",
      "text": "Labour suspends councillor over racism claims\n- Published\nA Labour councillor accused of racist remarks has been suspended by the party.\nAudrey Dempsey, who represents the Glasgow ward of Springburn and Robroyston, had claimed that \"racist attacks on white children and teachers\" had been rising in schools across the city.\nMs Dempsey did not provide statistical evidence for this claim, which was contained in an agenda for a recent meeting of the Labour group.\nShe told BBC Scotland News that she had asked \"an honest question\" and been subject to \"character assassination\" as a result.\nThe question she proposed asking was “to ask the relevant convenor if they [are] aware of the rising racist attacks on white children and teachers in our schools and how do they plan to tackle this?”\nThe question was not asked at the meeting.\nShe later told BBC Scotland News that she had been contacted by staff and parents from several schools in the south side of Glasgow about the issue.\nA spokeswoman for Glasgow City Council said: \"We are not aware of any rise in incidents of this kind across the city.\"\nComplaints 'fully investigated'\nMs Dempsey had earlier posted a video of her charity Glasgow’s No.1 Baby and Family Support Service helping asylum seekers, which she stated \"contradicts the attempted narrative.\"\nShe said: \"We should never be afraid to speak up when people are suffering. Children should expect equal treatment.\n\"It was an honest question that I asked that has become a character assassination.\n\"If it had been a family of another race that raised concerns I would have handled them the exact same way.\"\nShe added that she was disappointed in \"radio silence\" from the Labour party.\nA Labour Party spokesperson said: \"The Labour Party takes all complaints seriously.\n\"They are fully investigated in line with our rules and procedures, and any appropriate action is taken.\""
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cr74kg1vg4jo",
      "text": "Conservative MSP Graham Simpson defects to Reform\n- Published\nConservative MSP Graham Simpson has defected to Reform.\nSimpson announced his move as he appeared at a press conference in Scotland with Reform leader Nigel Farage.\nThe new Reform MSP told journalists that many would not be surprised to see him defect, and that leaving the Conservatives was \"an enormous wrench\".\nHe is the second MSP to leave the party's Holyrood group in the past week.\nA Scottish Conservative spokesperson said the party remained focused on \"holding the SNP and Labour to account\".\n\"The Scottish Conservatives are determined to provide positive common-sense solutions to drive our economy forward, so we can reduce NHS waiting lists and invest more in education,\" the party said.\n\"Nigel Farage has said he's content with another five years of SNP government. We're going to keep focusing on how to get the nationalists out of power.\"\nThe defection means Simpson becomes Reform's sole current MSP.\nMichelle Ballantyne sat as a Reform member at the Scottish Parliament from January to May 2021, having left the Conservatives the previous year and sitting for a short spell as an independent.\nShe lost her seat at the May 2021 election.\nSimpson has been an MSP for the Central Scotland region since 2016. He is a former journalist with The Sun and Daily Record.\nHe said he would remain in parliament following his defection and would not give up his seat on the Central Scotland regional list.\nSpeaking at a press conference in Broxburn, West Lothian, he said: \"It's fair to say that some of you won't be surprised to see me here, given that the Scottish Tories have been touting my name as a potential defector for months now.\n\"So today, I'm giving them what they want, but perhaps not for the reasons that they think.\n\"Leaving the party that I first joined when I was 15 is an enormous wrench, and I've been through a lot of soul searching in the past few weeks.\"\n- Published23 hours ago\n- Published1 day ago\nSimpson said he decided to join Reform UK to \"create something new, exciting and lasting\".\nSpeaking with leader Nigel Farage by his side, he added: \"I've joined Reform because we have the chance to create something new, exciting and lasting that puts the needs of people over the system, that asks what is going wrong and how we can fix it.\"\nHe said he thought Reform could \"help\" to remove the SNP from office after 19 years in power.\nFarage said Reform will have a Scottish leader in place ahead of the Holyrood election next year.\nThis contradicted previous statements from his deputy, Richard Tice, that a leader would be chosen after the election to prevent internal rifts.\nSpeaking to journalists after the announcement, Farage denied Reform is becoming a new Conservative party and said he would fight to beat the SNP next year.\nHe suggested he could make a deal with Scottish Labour leader Anas Sarwar to keep the SNP out of power.\n\"Mr Sarwar and I don't necessarily get on that well, but it's remarkable after an election what mathematics can do,\" he said.\n\"But anyway, why would Labour beat us next May? We are going to beat them.\"\nFarage had previously said he would not strike a deal with Labour.\nReform's deportation plans\nFarage's visit came against a backdrop of increased tension and rhetoric around the immigration.\nOn Tuesday, the Reform leader launched a scheme called Operation Restoring Justice, aimed at tackling the migrant issue.\nHe said Reform would deport 600,000 migrants over five years if it won power at the next election.\nFarage said his party would bar anyone who comes to the UK on small boats from claiming asylum, under plans announced earlier.\nIt says it would make £2bn available to offer payments or aid to countries like Afghanistan to take back migrants, with sanctions potentially imposed on uncooperative countries.\nHis comments came after a poll, by the David Hume Institute and Diffley Partnership, suggested 21% of Scots think immigration is one of the top three issues in the country, up from 16% in May and just 4% in May 2023.\nIt means immigration is now seen as the third biggest priority for the country, with only health and the cost-of-living crisis regarded as more important by voters.\n'Tories by another name'\nHousing Secretary Mairi McAllan, described Farage as \"the ultimate symbol of Westminster failure\".\nThe SNP MSP accused him of promoting \"ugly, anti-immigrant rhetoric\" and \"whipping up hatred against vulnerable people\".\n\"Labour has failed, and Nigel Farage has nothing to offer,\" she said.\n\"Scotland needs a fresh start – and the only one that will work for Scotland is independence.\"\nScottish Labour deputy leader Jackie Baillie said: \"Yet another lifelong Tory has decided to flee their sinking ship in a bid to save their own career, but it will take more than a new rosette to make Scots forget the damage Tories like Graham Simpson have inflicted on our country over the years.\"\nShe said Reform are \"simply Tories by another name\" and said neither party had answers to the \"challenges Scotland faces\".\nBaillie added: \"The next Scottish Parliament election will be a direct choice between a third decade of SNP failure or a new direction with Scottish Labour.\"\nIt felt like it was only a matter of time until a Conservative MSP jumped ship to Reform.\nWith a Holyrood election next year, the Tory position looks bleak. Reform UK seems to be on the up.\nGraham Simpson's name was one that was doing the rounds as a likely defector.\nThe Conservatives seem to be leaking MSPs fast. Will he be the last to depart?\nSimpson seems to see this as an opportunity to help shape something new.\nIt may also be a route to make his re-election to Holyrood next year more likely.\nGraham Simpson is a big campaigner for recall - the right to essentially fire your MSP under certain circumstances.\nIronically, there will be plenty who think that switching parties should be grounds for that.\nBut Simpson insists it's right that he stays put on the Holyrood benches.\nScotcast: ‘I’m with Farage’ - the Graham Simpson interview\nReform UK's new MSP on quitting the Scottish Conservatives.\n- Published3 days ago\n- Published2 days ago\n- Published18 August"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cy48p5132qno",
      "text": "Scottish Conservative councillor defects to Reform\n- Published\nThe Scottish Conservative group leader on Glasgow City Council has defected to Reform UK.\nThomas Kerr, who represents the Shettleston ward, was first elected as a 20-year-old in 2017 and became Tory group leader in 2019.\nHe was the party's candidate at the Rutherglen and Hamilton West by-election in October 2023, but finished a distant third.\nKerr said he had been \"annoyed and angry\" with the Conservatives for several months, accusing the party of failing to champion working-class communities like those in Shettleston.\nHe said the Tories focused too much on criticism of the SNP and \"lacked a positive vision of centre-right conservatism\".\nThe councillor also suggested Scottish Conservative leader Russell Findlay was not in control of the \"broken\" party.\nHe told BBC Radio Scotland's Drivetime programme: \"The problem is the Scottish Conservative party behind the scenes – Russell is not in charge.\n\"People who run the Scottish Conservative party will not allow Russell to bring the changes that this city and this country needs.\"\nHe also described suggestions that he joined Reform to gain a seat at Holyrood as \"nonsense\".\nKerr said: \"This is not opportunism. I have not spoken to Reform about standing for Holyrood.\n\"They haven't offered me anything like that whatsoever. This is about me putting my constituents first, not myself first.\"\nAs recently as June, Kerr was critical of Reform. He warned voters ahead of the general election, external to be \"careful what you vote for\".\nHe told BBC Radio Scotland that the party had become more professional since the election as part of \"remarkable turnaround\".\n\"The party that I was warning people about is no longer the party that exists,\" the councillor said.\n'Disillusioned and disconnected'\nFindlay described the defection as \"very disappointing\".\nAsked if there could be more defections, he told reporters at Holyrood: \"I can't control what people may or may not decide to do.\"\nFindlay said he understood voters were \"disillusioned and disconnected\" but insisted he was focused on showing \"the people of Scotland that we're on their side\".\nKerr was one of two Tory councillors on Glasgow City Council, and will be Reform's first in the city.\nHe is the fifth former Scottish Conservative councillor to join Reform - with two others in Aberdeenshire and two in North Ayrshire.\nReform leader Nigel Farage said he was \"delighted\" to welcome Kerr.\nHe added that his party was looking forward to the election with \"increasing anticipation\".\nFarage's party is aiming to win its first Holyrood seats at the 2026 election.\nA Scottish Conservative source speculated that Kerr had made the move in the hope of being elected to the Scottish Parliament.\nA recent Survation poll for the Holyrood Sources podcast found Reform was on course to finish in joint third place with the Conservatives on 15 seats.\nA Reform UK spokesperson said: “No discussions have ever taken place regarding the Holyrood 2026 election or list rankings.”\nGreen councillor Anthony Carroll described Kerr's defection as a \"slap in the face\" for voters and said he should call a by-election.\nScottish Labour deputy leader Dame Jackie Baillie said Findlay had \"lost control of his party\".\nShe added: \"After 14 years of incompetence and sleaze in government it's no wonder the Tories are fleeing their sinking ship - but Reform doesn't have anything to offer the people of Scotland.\"\n- Published23 July 2024\n- Published7 May 2017"
    },
    {
      "url": "http://www.bbc.co.uk/news/scotland",
      "text": "Scotland\nUpdates from your News topics will appear in My News and in a collection on the News homepage.\nDeath of hospital infection patient investigated by prosecutors\nMolly Cuddihy, 23, died at Glasgow's Queen Elizabeth University Hospital on Tuesday, seven years after a previous hospital-acquired infection.\n- Attribution\n- Posted5 hours ago\n- Attribution\n- Posted40 minutes ago\n- Attribution\n- Posted5 hours ago\n- Comments\n- Attribution\n- Posted14 minutes ago\n- Attribution\n- Posted5 hours ago\n- Attribution\n- Posted4 hours ago\n- Attribution\n- Posted5 hours ago\n- Attribution\n- Posted5 hours ago\n- Comments\n- Attribution\n- Posted5 hours ago\n- Attribution\n- Posted17 hours ago\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted18 hours ago\nFeatures and analysis\n- Attribution\n- Posted13 hours ago\n- AttributionBBC Radio Scotland\n- Available for over a year\n- Attribution\n- Posted1 day ago\n- Attribution\nThe video playlist\nNews from around Scotland\n- Attribution\n- Posted5 hours ago\n- Attribution\n- Posted13 hours ago\n- Attribution\n- Posted40 minutes ago\n- Attribution\n- Posted15 hours ago\n- Attribution\n- Posted5 hours ago\n- Comments\n- Attribution\n- Posted36 minutes ago\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted23 hours ago\n- Attribution\n- Coverage starts at19:30\nMore news on iPlayer and Sounds\n- AttributionBBC One\n- AttributionBBC Radio Scotland\n- AttributionBBC One\n- AttributionBBC Radio Scotland"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/ceq39x2257eo",
      "text": "Suspended Labour councillor quits party over race row\n- Published\nA suspended Scottish Labour councillor has resigned her party membership following what she called a \"character assassination\".\nGlasgow councillor Audrey Dempsey was suspended from the party this week after being accused of making racist remarks.\nShe had claimed that \"racist attacks on white children and teachers\" had been rising in schools across the city.\nMs Dempsey was suspended from the Scottish Labour party while an investigation took place.\nIn a statement posted on X, external, formerly known as Twitter, Ms Dempsey said concerns she had raised about the direction of the party and its politics had been \"simply ignored\".\nShe said: \"Instead the reaction of some has been to attack my character and reputation with cowardly leaks that have deliberately been twisted to fit a narrative.\n\"I joined the Labour Party as I have a deep desire to fight for working-class communities who need a real champion, I thought they did too. I know see that while I still hold these values close to my heart, the party does not.\"\n- Published9 April 2024\nThe row broke out after Ms Dempsey, who represents the Glasgow ward of Springburn and Robroyston, made a claim that \"racist attacks on white children and teachers\" had been rising in schools across the city.\nMs Dempsey did not provide statistical evidence for this claim, which was contained in an agenda for a recent meeting of the Labour group.\nShe previously told BBC Scotland News that she had asked \"an honest question\". It was not asked at the meeting.\nA spokeswoman for Glasgow City Council said: \"We are not aware of any rise in incidents of this kind across the city.\"\nMs Dempsey has vowed to continue representing the people of Springburn and Robyston and to \"never be silenced on speaking up for my community.\"\nShe is now listed as an independent councillor, external.\nA Scottish Labour spokesperson said: \"Audrey Dempsey is no longer a member of the Labour Party.”\nCandidate suspended\nIn a separate incident, Labour last week suspended an election candidate after she was accused of liking racist and Islamophobic social media posts.\nWilma Brown, the Westminster candidate for Cowdenbeath and Kirkcaldy, appeared to delete her Twitter/X account after local activist Adam Le Grice highlighted the issue.\nThe party said it takes all complaints seriously."
    },
    {
      "url": "https://www.bbc.co.uk/news/scotland/glasgow_and_west",
      "text": "Glasgow & West Scotland\nUpdates from your News topics will appear in My News and in a collection on the News homepage.\nDeath of hospital infection patient investigated by prosecutors\nMolly Cuddihy, 23, died at Glasgow's Queen Elizabeth University Hospital on Tuesday, seven years after a previous hospital-acquired infection.\n- Attribution\n- Posted4 hours ago\n- Attribution\n- Posted4 hours ago\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted4 hours ago\n- Attribution\n- Posted19 hours ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted21 hours ago\n- Attribution\n- Posted20 hours ago\n- Attribution\n- Posted1 day ago\nFeatures\n- Attribution\n- Posted6 days ago\n- Attribution\n- Posted7 days ago\n- Attribution\n- Posted20 August\n- Attribution\n- Posted30 June\n- Attribution\n- Posted17 August\nElsewhere on the BBC\n- AttributionBBC Radio Scotland\n- Available for over a year\n- AttributionBBC Scotland\n- AttributionBBC Scotland\n- AttributionBBC Scotland"
    },
    {
      "url": "https://www.bbc.com/news/topics/cp7r8vgl20xt",
      "text": "Glasgow City Council1 hr agoCouncillor who made 'white racism' claim joins ReformAudrey Dempsey was suspended from Scottish Labour over alleged racist remarks in April 2024 and later quit.1 hr ago20 Aug 2025Scotland's first skatepark to be dug up by archaeologists A University of Glasgow team will undertake excavation and survey work at the former Kelvin Wheelies park.20 Aug 202518 Aug 2025Council's construction firm criticised in report The concerns were strong enough that a new executive director was hired in January from outside the organisation.18 Aug 202529 Jul 2025Council seeks ideas for 'architectural treasure'The Category A-listed property has been vacant for over 30 years and is becoming increasingly derelict.29 Jul 202511 Jul 2025The Barrowland's star-clad façade set for a face-liftProposals for the iconic Glasgow music venue include two huge LED displays/11 Jul 20254 Jul 2025Former Lord Provost banned from going near ex for five yearsPhilip Braat contacted the woman 122 times between July and September 2024.4 Jul 20254 Jul 2025No evidence of stolen data in Glasgow cyber attack The council's information technology supplier discovered malicious activity on servers on 19 June.4 Jul 202524 Jun 2025Librarian cuts 'deeply damaging' to Glasgow schools A professional body for librarians has written to Glasgow City Council expressing concern over the plans.24 Jun 202520 Jun 2025Every Glasgow secondary school set to lose its librarianA principal librarian and a team of assistants would cover Glasgow's 30 secondary schools if council budget cuts are approved.20 Jun 2025..."
    },
    {
      "url": "https://www.bbc.com/news/topics/cdl8n2edx7vt",
      "text": "Scottish Labour1 hr agoCouncillor who made 'white racism' claim joins ReformAudrey Dempsey was suspended from Scottish Labour over alleged racist remarks in April 2024 and later quit.1 hr ago8 days agoLabour MSP Colin Smyth charged over indecent imagesThe South Scotland representative has been suspended by the party after being arrested in Dumfries.8 days ago3 Jul 2025Welfare system will 'explode' without reform, says MurrayThe Labour minister has defended his government's benefits bill after backbenchers forces a major climbdown. 3 Jul 202524 Jun 2025Quarter of Scottish Labour MPs join welfare rebellionTen of the party's parliamentarians have signed an amendment seeking to blocking controversial reforms.24 Jun 202510 Jun 2025Scotland to prioritise renewable energy over nuclear powerThe SNP will keep its effective ban on new nuclear plants through devolved planning powers, a minister says. 10 Jun 202510 Jun 2025New Labour MSP sworn in at the Scottish Parliament10 Jun 20258 Jun 2025Sarwar accuses Swinney of 'dishonest' by-election campaignThe Scottish Labour leader told BBC Scotland's Sunday Show that SNP tactics pushed voters to Reform UK.8 Jun 20256 Jun 2025SNP to 'learn lessons' as Labour wins crucial by-electionLabour's Davy Russell won with 8,559 votes, a majority of 602 over the SNP. 6 Jun 20256 Jun 2025Why Reform was the other big winner in the Hamilton by-electionReform UK recorded their best ever parliamentary election result in Scotland - with a 26% share of the vote.6 Jun 2025..."
    },
    {
      "url": "https://www.bbc.com/news/topics/cp07jzgm24jt",
      "text": "Reform UK1 hr agoCouncillor who made 'white racism' claim joins ReformAudrey Dempsey was suspended from Scottish Labour over alleged racist remarks in April 2024 and later quit.1 hr ago2 hrs agoWill Reform raise political 'spice' levels to vindaloo?Graham Simpson talks to Scotcast about becoming a Reform MSP and quitting the Scottish Conservatives.2 hrs ago6 hrs agoDoes Reform pose an existential threat to the Scottish Conservatives?As a Tory MSP defects, is Reform UK set to replace them on the right of Scottish politics?6 hrs ago17 hrs agoSt George's flags will remain up, says councilA number have appeared around the area as part of the social media-led Operation Raise the Colours.17 hrs ago20 hrs agoReform UK retreats from child migrant deportationsNigel Farage has now ruled out the suggestion, after the party's former chair said it could happen.20 hrs ago20 hrs agoConservative MSP Graham Simpson defects to ReformSimpson announced his move as he appeared at a press conference in Scotland with Reform leader Nigel Farage.20 hrs ago21 hrs agoMP accuses Farage of 'empty slogans' on immigrationCalum Miller says Nigel Farage \"made no effort to understand the people\" of Oxfordshire.21 hrs ago22 hrs agoReform suspends councillor over asylum commentsDurham county councillor Paul Bean is also a Home Office civil servant who processes asylum claims.22 hrs ago24 hrs agoHow achievable is Reform's plan on migration?A Reform government could see the UK leaving the European Convention on Human Rights to deliver its plan.24 hrs ago..."
    },
    {
      "url": "https://www.bbc.com/lnp/ldrs",
      "text": "The journalists are funded by the BBC as part of its latest Charter commitment, but are employed by regional news organisations.\nA total of 165 reporters are allocated to news organisations in England, Scotland, Wales and Northern Ireland.\nThese organisations range from television and radio stations to online media companies and established regional newspaper groups.\nLocal Democracy Reporters cover top-tier local authorities, second-tier local authorities and other public service organisations.\nPrinciples of operation: Questions and answers\nStories written by the democracy reporters are shared with more than 1,100 media titles and outlets that have signed up to be part of the Local News Partnerships scheme.\nTo be awarded the democracy reporter contracts, the successful news organisations had to pass stringent criteria which included financial standing and a strong track record of relevant journalism in the area they were applying to cover.\nThe award decisions were made by senior editorial BBC figures.\nThe full list of organisations that were awarded contracts can be viewed here.\nLocal Democracy Reporter content can be downloaded via an online portal, accessed via a log-in code supplied to all qualifying news organisations.\nThe Local Democracy Reporting Service (LDRS) is a public service news agency: funded by the BBC, provided by the local news sector, and used by qualifying partners. It’s like a franchise: different companies with different approaches, but using common editorial standards and all publishing into the same system.\n- The core purpose of the LDRS is to provide impartial coverage of the regular business and workings of local authorities in the UK, and other relevant democratic institutions such as mayoralties, combined authority areas, P&CCs, quangos, etc.\n- The Local Democracy Reporters' (LDRs) brief is to report on the decision-making process: what decisions are made in the public's name and how they are arrived at, what evidence is presented to the council, etc.\n- The expectation is that LDRs shall endeavour to attend all meetings in person.\n- In two-tier council areas the LDRs should cover district council affairs sufficiently to ensure that significant decisions (eg planning) are reported.\n- LDRs may provide other stories which are focused on local democracy and which are in the public interest so long as that does not detract from the core purpose of the service.\n- All their work must be available to all qualifying partners.\n- National politics is out of scope, but election campaigns and constituency work of MPs, AMs, MSPs and MLAs that specifically relates to relevant local audiences may be covered so long as it does not detract from the core purpose of the LDRS.\nLDRs report to the contract holder, not to the BBC or any other partner.\nWith the guidance and support of the contract holder, LDRs work to the brief covering the stories of greatest public interest and they should not undertake commissions for any partner.\nDirect questions and clarifications relating to content are acceptable, but any suggestions or comments relating to the service should go through a LDR's manager.\nThe only difference between the BBC and others is that it has a right to request interviews or 2-ways for BBC Local Radio. Depending on workload and commitments it is up to each LDR to decide whether or not to agree.\nNo. While meeting the highest standards of accuracy and impartiality, written content may conform to an employer's normal style. BBC training will help create a common standard for media content production.\n- All content must be created for all qualifying partners.\n- Content should be published as soon as possible after a meeting or event.\n- All content must be published using the LDRS Authoring Tool so all partners see it simultaneously.\n- All content must be titled COUNCIL NAME: Story Name.\n- It must be tagged with at least one top-tier local authority, but can have as many tags as are relevant.\n- Images and media must have a descriptive label.\n- Images and media must be rights-free (LDRs should not use their employer’s picture library, or images supplied by agencies or freelance contributors).\n- LDRs should, where possible, assign a \"Feature Image\" to a story.\n- LDRs must provide an Advisory note in the publishing system before the end of every week indicating their diary for the next seven days (or longer).\n- LDRs should source their content. An explanatory Note to Editors at the end of a story regarding the source will reduce queries from partners, especially around whether qualified privilege applies to all or part of a story.\n- LDRs should not file a story based on a press release already in the public domain unless it has been significantly developed with new quotes or information.\n- Embargoed content must explain why publication should be delayed.\n- Posts should be via LDRs' personal accounts rather than contractors' branded accounts.\n- LDRs are encouraged to post an Advisory in the LDRS Authoring Tool to let partners know if they intend live-Tweeting from a meeting, for example.\n- Tagging #LDReporter will help the partnership collate relevant tweets.\n- LDRs should be credited as \"First Name, Last Name, Local Democracy Reporter\".\n- By-lines or references within copy are acceptable.\n- Broadcasters should acknowledge LDRs when they appear on air or when the format allows.\n- Shared credit with other reporters is acceptable if LDRs' content is copied, edited or incorporated into new pieces of work.\n- The LDRS logo can also be used in print, online or on TV, but is not compulsory.\n- LDRs should refer to themselves as \"Local Democracy Reporters\", not \"BBC Local Democracy Reporters\" in all forms of communication, including social media profiles.\n- Corrections and clarifications relating to previously published stories must be clearly highlighted and issued immediately.\n- The headline style should be as follows: 'COUNCIL NAME: Story Name - CORRECTION'.\n- The first paragraph of the body copy should be as follows: 'CORRECTION: An earlier version of this story incorrectly stated that…'."
    },
    {
      "url": "https://www.bbc.com/news/topics/cr0me11dlg6t",
      "text": "Glasgow1 hr agoCouncillor who made 'white racism' claim joins ReformAudrey Dempsey was suspended from Scottish Labour over alleged racist remarks in April 2024 and later quit.1 hr ago6 hrs agoFans lose out as bankrupt promoter pulls plug on music festivalThe In the City festival was due to be held at Glasgow Green on 23 and 24 August, featuring acts including Unkle.6 hrs ago6 hrs ago'My daughter should be in a special school but there is no space'Niamh was due to start primary school two weeks ago but is still waiting to find out if there is a suitable place.6 hrs ago21 hrs agoMan charged over indecent exposure in primary schoolPolice were called to St Mungo's Primary School on Parson Street at about 11:30 on Tuesday.21 hrs ago1 day agoGlasgow to celebrate Sir Billy Connolly with weekend of eventsThe Big Yin Weekend will celebrate the Glasgow-born comedian through a mixture of events.1 day ago4 days agoActor and Citizens director Giles Havergal dies aged 87Mr Havergal presided over the Glasgow venue during one of the \"most celebrated periods in the theatre's history\".4 days ago5 days agoA parade and a peek inside: Citizens Theatre reopensGlasgow's Citizens theatre has reopened after a seven-year refurbishment. The BBC took a first look inside.5 days ago6 days agoSpeeding driver high on cocaine injured six in M8 crashDylan Hood ploughed into an unmarked police vehicle as officers were dealing with another driver.6 days ago6 days agoProposal to expand Glasgow Queen Street station unveiledNetwork Rail said the plan would make it easier to go from the station to the new look George Square.6 days ago..."
    }
  ],
  "argos_summary": "Audrey Dempsey, a Glasgow councillor suspended from Labour over unsubstantiated claims of rising racist attacks on white children and teachers, left the party and joined Reform, citing a desire for \"real change\" and a willingness to tackle difficult conversations. Her move follows a broader trend of defections to Reform, including former Conservative councillor Thomas Kerr and MSP Graham Simpson, as the party positions itself as a new right‑wing alternative in Scotland. Labour has said it never concluded its investigation because Dempsey left, while council officials deny any rise in such incidents. Dempsey’s departure highlights growing frustration among some former Labour members who feel the party no longer represents working‑class interests.",
  "argos_id": "OGKPK3ZTT"
}