{
  "url": "https://finance.yahoo.com/news/india-faces-first-legal-challenge-074833749.html",
  "authorsByline": "Aditya Kalra and Arpan  Chaturvedi",
  "articleId": "0ea3a935afc24767aec2a65b2b8a907f",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/reuters-finance.com/0dedc00e9a1c1d5581b0d93bd49a090b",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T07:48:33+00:00",
  "addDate": "2025-08-28T07:54:29.045491+00:00",
  "refreshDate": "2025-08-28T07:54:29.045492+00:00",
  "score": 1.0,
  "title": "India faces first legal challenge against online money games ban",
  "description": "NEW DELHI (Reuters) -Indian gaming company A23 has challenged the government's ban on online money-based games, a legal filing shows, in the first case against a law that led to the sudden shutdown of popular contests and has thrown the industry's future into doubt.  Prime Minister Narendra Modi's government issued a law last week to ban such games, which the industry says rely on skill and are therefore not gambling.  Gambling was already highly restricted in India.",
  "content": "NEW DELHI (Reuters) -Indian gaming company A23 has challenged the government's ban on online money-based games, a legal filing shows, in the first case against a law that led to the sudden shutdown of popular contests and has thrown the industry's future into doubt.\n\nPrime Minister Narendra Modi's government issued a law last week to ban such games, which the industry says rely on skill and are therefore not gambling. Gambling was already highly restricted in India.\n\nThe legislation is a setback for an industry backed by venture capital firms such as Tiger Global and Peak XV Partners, and that was on track to be worth $3.6 billion in India by 2029, according to industry estimates.\n\nIn a court filing at the High Court of Karnataka in southwestern India, A23, which offers rummy and poker games, said the law \"criminalises the legitimate business of playing online games of skill, which would result in the closure of various gaming companies overnight\".\n\nThe new law is a \"product of state paternalism\", A23 added in its filing, asking it to be declared unconstitutional when applied to games of skill such as rummy and poker.\n\nThe filing, dated August 28, is not public but was reviewed by Reuters. India's IT ministry did not immediately respond to queries.\n\nA23.com describes itself as an online gaming platform with more than 70 million players.\n\nEndorsements by leading Indian cricketers and other marketing efforts have boosted the appeal of apps such as Dream11 and Mobile Premier League, where virtual cricket teams are created based on real players, earning points on runs, wickets and catches.\n\nBoth apps have discontinued their money games after the ban.\n\nMPL has decided to not pursue a legal challenge against the gaming law, and also advised industry bodies to which it belongs to focus instead on free-to-play business models, a senior source at the gaming company told Reuters. The source asked not to be named because they were not authorised to speak publicly on the issue.\n\nDream11 will also not challenge the law, though \"95% of our group's revenues have disappeared overnight,\" its CEO Harsh Jain told CNBC TV 18 this week.\n\nMPL did not respond to Reuters queries, while Dream11 said it plans to \"build a great Indian sports company, driven by AI and the creator economy\".\n\nModi's government has repeatedly expressed its unhappiness over money-based games, saying they cause addiction.\n\nIn announcing the law last week, it said it had a duty to act against \"social evils\".",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "online money games ban",
      "weight": 0.0990713
    },
    {
      "name": "such games",
      "weight": 0.097466946
    },
    {
      "name": "online games",
      "weight": 0.09614153
    },
    {
      "name": "-Indian gaming company A23",
      "weight": 0.08920543
    },
    {
      "name": "games",
      "weight": 0.082769394
    },
    {
      "name": "various gaming companies",
      "weight": 0.08228219
    },
    {
      "name": "industry bodies",
      "weight": 0.073223226
    },
    {
      "name": "industry estimates",
      "weight": 0.070418715
    },
    {
      "name": "first legal challenge",
      "weight": 0.06915566
    },
    {
      "name": "southwestern India",
      "weight": 0.06817761
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Gambling/Other",
      "score": 0.875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.79248046875
    },
    {
      "name": "/Games/Card Games/Poker & Casino Games",
      "score": 0.6298828125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.5966796875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.5224609375
    }
  ],
  "sentiment": {
    "positive": 0.04408229,
    "negative": 0.72796816,
    "neutral": 0.22794957
  },
  "summary": "Indian gaming company, A23, has challenged the Indian government's ban on online money-based games, in a legal filing. This is the first case against the law, which led to the sudden shutdown of popular contests and has thrown the industry's future into doubt. The ban, which is supported by venture capital firms such as Tiger Global and Peak XV Partners, is seen as a setback for an industry that was expected to be worth $3.6 billion by 2029. A23 argues that the law criminalizes the legitimate business of playing online games of skill and would result in the closure of various gaming companies. The government argues that such games use skill and therefore are not gambling.",
  "shortSummary": "Indian gaming company A23 is challenging the government's ban on online money-based games, claiming it violates legitimate business and harms the industry's reputation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "42a7b93ce84641308e17fa6ec7606c56",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Indian gaming firm A23 has filed a legal challenge against a new law banning online money‑based games, arguing it criminalises legitimate skill‑based play. The ban, introduced by Prime Minister Narendra Modi’s government, has forced popular platforms like Dream11 and Mobile Premier League to shut their money‑gaming services and has threatened an industry projected to be worth $3.6 billion by 2029. While A23 seeks the law declared unconstitutional, other major players such as MPL and Dream11 have opted not to fight the ruling, instead pivoting to free‑to‑play models or new business strategies. The move reflects the government’s stance that such games fuel addiction and are a social evil.",
  "argos_id": "OOW8F7L16"
}