{
  "url": "https://seekingalpha.com/pr/20214073-al-sharpton-to-lead-pro-dei-march-through-wall-street-on-anniversary-of-the-1963-march-on",
  "authorsByline": "",
  "articleId": "54a428d00993448f826824de42810847",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-27T23:46:00-04:00",
  "addDate": "2025-08-28T04:05:35.223370+00:00",
  "refreshDate": "2025-08-28T04:05:35.223372+00:00",
  "score": 1.0,
  "title": "Al Sharpton to lead pro-DEI march through Wall Street on anniversary of the 1963 March on Washington",
  "description": "Al Sharpton to lead pro-DEI march through Wall Street on anniversary of the 1963 March on Washington",
  "content": "NEW YORK (AP) — The Rev. Al Sharpton will lead a protest march on Wall Street to urge corporate America to resist the Trump administration’s campaign to roll back diversity, equity and inclusion initiatives.\n\nThe New York civil rights leader will join clergy, labor and community leaders Thursday in a demonstration through Manhattan’s Financial District that's timed with the anniversary of the Civil Rights-era March on Washington in 1963.\n\nSharpton, in a statement, called DEI the “civil rights fight of our generation.\"\n\nSince returning to the White House in January, President Donald Trump has moved to end DEI programswithin the federal government and warned schools to do the same, or risk losing federal money.\n\nIn response, Sharpton's civil rights group, the National Action Network, has encouraged consumers to avoid U.S. retailers that scaled backed policies and programs aimed at bolstering diversity among their employees and reducing discrimination against members of minority groups, women and LGBTQ+ people.\n\nEarlier this year, Sharpton met with Target’s CEO as groups called for a boycott of the retail giant, which joined Amazon (AMZN), Walmart and other major retailers in foregoing DEI initiatives.\n\nThe civil rights leader has also called for \"buy-cotts” in support of companies such as Costco (COST) that have stuck by their DEI principles despite the conservative backlash.\n\n“Corporate America wants to walk away from Black communities, so we are marching to them to bring this fight to their doorstep,” Sharpton said in a statement ahead of Thursday's march.\n\nThe march is expected to start around 10 a.m. in Foley Square, located in downtown Manhattan near the African Burial Ground that's the largest known resting place of enslaved and freed Africans in the country.\n\nThe square is also near 26 Federal Plaza, the federal government building that's become a symbol of Trump's nationwide immigration crackdown.\n\nU.S. Immigration and Customs Enforcement agents have been detaining migrants during their routine appearances at the immigration court located there. A federal judge earlier this month also ordered the Trump administration to improve conditions for migrants jailed there.\n\nMarchers are expected to make their way past Wall Street's famous Charging Bull statue before the event ends with a speaking program.\n\nNew York City mayoral candidates, including incumbent Mayor Eric Adams, state Assembly Member Zohran Mamdani, and former Gov. Andrew Cuomo, are among those expected to join the demonstration.\n\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/trump-holiday-mlk-day-pride-black-hispanic-dei-047bbdbfc12ea6e9a9731f5861d84e70",
    "https://apnews.com/article/immigration-detention-new-york-mistreatment-318cecf0dc4b5427cf9c8a346698bd34",
    "https://seekingalpha.com/symbol/AMZN",
    "https://apnews.com/article/trump-executive-orders-dei-7ef0bf4ce1d465f6b61f3fcfde544593",
    "https://apnews.com/article/dei-trump-school-discrimination-federal-funding-7d1025753b9bd924711ace4069fca399",
    "https://apnews.com/article/target-al-sharpton-dei-520dbc23cd668b57b3bfef76d1bc7cdd",
    "https://www.nps.gov/afbg/index.htm",
    "https://apnews.com/article/target-dei-supreme-court-diversity-7f068dfee61a68a9a1f82b94e135b323",
    "https://apnews.com/hub/diversity-equity-and-inclusion",
    "https://seekingalpha.com/symbol/COST"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Donald Trump",
      "weight": 0.06868998
    },
    {
      "name": "Wall Street",
      "weight": 0.06842439
    },
    {
      "name": "Donald Trump",
      "weight": 0.06721504
    },
    {
      "name": "Al Sharpton",
      "weight": 0.06583013
    },
    {
      "name": "DEI initiatives",
      "weight": 0.06360135
    },
    {
      "name": "Trump",
      "weight": 0.06263816
    },
    {
      "name": "Sharpton",
      "weight": 0.061317388
    },
    {
      "name": "minority groups",
      "weight": 0.060049802
    },
    {
      "name": "pro-DEI march",
      "weight": 0.05898639
    },
    {
      "name": "federal money",
      "weight": 0.058902968
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9716796875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.84326171875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.65283203125
    },
    {
      "name": "/People & Society/Other",
      "score": 0.58251953125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.447265625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.403076171875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.3330078125
    }
  ],
  "sentiment": {
    "positive": 0.0970302,
    "negative": 0.6439367,
    "neutral": 0.25903308
  },
  "summary": "The Rev. Al Sharpton will lead a protest march on Wall Street to call for corporate America to resist the Trump administration's efforts to roll back diversity, equity and inclusion initiatives. The demonstration will be held in Manhattan's Financial District and coincides with the anniversary of the 1963 Civil Rights-era March on Washington. Since President Donald Trump took office, he has moved to end DEI programs in the federal government and warned schools to comply with this. In response, Sharpton's civil rights group, the National Action Network, has urged consumers to avoid retailers that support these initiatives.",
  "shortSummary": "The Rev. Al Sharpton will lead a protest march on Wall Street against the Trump administration's rollback of diversity initiatives (DEI).",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7223b7e638454f7abb5aa549949d1451",
  "places": [
    {
      "osmId": "6802582",
      "road": "Foley Square",
      "quarter": "Lower Manhattan",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Civic Center",
      "coordinates": {
        "lat": 40.714438,
        "lon": -74.0030792941966
      }
    },
    {
      "osmId": "447018423",
      "road": "Wall Street",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10005",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Financial District",
      "coordinates": {
        "lat": 40.7059917,
        "lon": -74.0087767
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/dei-trump-school-discrimination-federal-funding-7d1025753b9bd924711ace4069fca399",
      "text": "K-12 schools must sign certification against DEI to receive federal money, administration says\nWASHINGTON (AP) — As a condition for receiving federal money, the Trump administration is ordering K-12 schools to certify that they are following federal civil rights laws and ending any discriminatory diversity, equity and inclusion practices.\nA notice sent Thursday by the Education Department gives states and schools 10 days to sign and return the certification. It’s the latest escalation against DEI policies, apparently giving the Republican administration a new lever for terminating federal money.\n“Federal financial assistance is a privilege, not a right,” Craig Trainor, acting assistant secretary for civil rights, said in a statement. He said many schools have flouted their legal obligations, “including by using DEI programs to discriminate against one group of Americans to favor another.”\nThe certification asks state and school leaders to sign a “reminder of legal obligations” acknowledging their federal money is conditioned on compliance with federal civil rights laws. It also demands compliance with several pages of legal analysis written by the administration.\n“The use of certain DEI practices can violate federal law,” the administration wrote in the certification, adding that it is illegal for programs to advantage one race over another.\nSchools and states that use illegal DEI practices can face a loss of federal money, including grants and contracts, and can be held liable under the False Claims Act, according to the certification. It specifically threatens Title I funding, which sends billions of dollars a year to America’s schools and targets low-income areas.\nThe department ordered state education offices to sign the certification and collect certifications from school systems.\nIt follows a Feb. 14 memo declaring that any school policy that treats students or staff differently because of their race is illegal. It aimed to fight what the memo described as widespread discrimination in education, often against white and Asian American students.\nThe certification letter drew blowback from critics who said it conflicts with Trump’s promise to return education to schools and states.\n“Is this what the Trump administration calls local control? You can’t say you’re giving control back to states and then dictate how they run their schools,” said Keri Rodrigues, president of the National Parents Union.\nThe new memo appears to lay the groundwork for financial sanctions of the kind the Trump administration has leveraged against colleges. Columbia University recently agreed to several demands after the federal government cut $400 million amid an investigation into campus antisemitism.\nThe government has used similar tactics at Princeton University and the University of Pennsylvania.\nSchools across the U.S. have been scrambling to determine what practices could run afoul of the anti-DEI orders, but the new letter does little to add clarity.\nThe initial February memo declared that federal law prohibits schools and colleges from “using race” in decisions related to admissions, hiring financial aid, housing, student life and more. As justification, it invoked a 2023 Supreme Court decision barring affirmative action in college admissions — a case focused on admissions practices at Harvard and the University of North Carolina.\nThe department later clarified that some practices are allowed, including Black History Month celebrations and programs focused on certain cultures, but it said many schools have “advanced discriminatory policies and practices under the banner of ‘DEI’ initiatives.”\nThe American Federation of Teachers, a national teachers’ union, is suing to block the Feb. 14 memo, saying it violates the First and Fifth amendments.\nThe union’s president called the certification requirement illegal, saying federal law prohibits the White House from telling schools and colleges what to teach, and that federal money cannot be withheld without due process.\n“He’s wielding a cudgel of billions in federal aid to tens of millions of children, of all races and ethnicities, to force educators to kowtow to his politics and ideology,” said Randi Weingarten, president of the AFT.\n___\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org"
    },
    {
      "url": "https://apnews.com/article/immigration-detention-new-york-mistreatment-318cecf0dc4b5427cf9c8a346698bd34",
      "text": "Judge orders ICE to improve conditions after NYC immigration detainees complain of mistreatment\nJudge orders ICE to improve conditions after NYC immigration detainees complain of mistreatment\nNEW YORK (AP) — A federal judge ordered the Trump administration Tuesday to immediately improve conditions at a New York City immigration holding facility, acting on complaints by jailed migrants that it is dirty, smelly and overcrowded.\nJudge Lewis A. Kaplan, ruling in a lawsuit filed on behalf of detainees, issued a temporary restraining order requiring U.S. Immigration and Customs Enforcement to limit capacity, ensure cleanliness and provide sleeping mats in so-called hold rooms at 26 Federal Plaza, a government building in Manhattan.\nCellphone video recorded last month by a detainee showed about two dozen men crowded in one of the building’s four hold rooms, many lying on the floor with thermal blankets but no mattresses or padding.\nIn court filings, detainees complained they had no soap, toothbrushes or other hygiene products. They said they were fed inedible “slop” and endured the “horrific stench” of sweat, urine and feces, in part because the rooms have open toilets. One woman having her period couldn’t use menstrual products because women in her room were given just two to divvy up, the lawsuit said.\nKaplan ordered immigration officials to allocate 50 square feet (4.6 square meters) per person — shrinking the largest hold room’s capacity to about 15 people after detainees said 40 or more were being jammed in. The building, home to immigration court and the FBI‘s New York field office, has become an epicenter of President Donald Trump’s crackdown on illegal immigration.\nThe judge ordered the government to thoroughly clean the cells three times a day and provide an adequate supply of hygiene products. Addressing concerns that detainees weren’t able to communicate with lawyers, Kaplan ordered the government to make accommodations for confidential legal telephone calls.\n“My conclusion here is that there is a very serious threat of continuing irreparable injury, given the conditions that I’ve been told about,” Kaplan said at a hearing Tuesday where a government lawyer conceded that some of the complaints were valid.\n“I think we all agree that conditions at 26 Federal Plaza need to be humane, and we obviously share that belief,” government lawyer Jeffrey S. Oestericher said, adding that he agreed “inhumane conditions are not appropriate and should not be tolerated.”\nThe lawsuit — filed by the immigrant rights organization Make the Road New York, the New York Civil Liberties Union and the American Civil Liberties Union — sought court intervention to end what plaintiff lawyer Heather Gregorio called “inhumane and horrifying conditions.”\nSome detainees have been held at 26 Federal Plaza far longer than the 72-hour norm, Gregorio said.\nMurad Awawdeh, the president and CEO of the New York Immigration Coalition, welcomed Kaplan’s ruling as a “step forward” but said the facility “must be shut down permanently.”\nNew York City Comptroller Brad Lander, who was arrested at 26 Federal Plaza in June after he tried to lock arms with a person authorities were attempting to detain, said the decision “is a much-needed rebuke of Trump’s cruel immigration policies.”\nIn a sworn declaration, Nancy Zanello, of ICE’s New York City Field Office of Enforcement and Removal Operations, wrote that as of Monday, a total of 24 people were held in the building’s four hold rooms — well shy of the city fire marshal’s 154-person cap.\nEach room has at least one toilet and sink, and hygiene products are available, including soap, teeth cleaning wipes and feminine products, Zanello said.\nSergio Barco Mercado, the lawsuit’s named plaintiff, said in a court filing that he was held at 26 Federal Plaza for two days last week after his arrest there while leaving an immigration court hearing.\nBarco Mercado, a native of Peru who said he sought asylum in the U.S. in 2022, said his hold room was “extremely crowded,” cold and “smelled of sewage,” and that the conditions exacerbated a tooth infection that swelled his face and altered his speech.\n“We did not always get enough water,” Barco Mercado said. “There was one guard who would sometimes hold a bottle of water up and people would wait to have him squirt some into our mouths, like we were animals.”\nAnother detainee, Carlos Lopez Benitez, said he fled violence in Paraguay in 2023 and was seeking asylum in the U.S. when he was arrested in July while leaving an immigration hearing. He said officers told him he’d be in detention until a 2029 hearing on his asylum application.\nLopez Benitez said an officer showed him a cellphone photo of his arrest and mocked him for crying. In his holding cell, he said, officers blasted air conditioning and doled out meals that “looked like dog food.”"
    },
    {
      "url": "https://apnews.com/article/target-dei-supreme-court-diversity-7f068dfee61a68a9a1f82b94e135b323",
      "text": "Target is ending its diversity goals as a strong DEI opponent occupies the White House\nTarget is ending its diversity goals as a strong DEI opponent occupies the White House\n▶ Follow live updates on President Donald Trump’s return to Washington\nNEW YORK (AP) — Discount store chain Target said Friday that it would join rival Walmart and a number of other prominent American brands in scaling back diversity, equity and inclusion initiatives that have come under attack from conservative activists and, as of this week, the White House.\nThe Minneapolis-based retailer said the changes to its “Belonging at the Bullseye” strategy would include ending a program it established to help Black employees build meaningful careers, improve the experience of Black shoppers and to promote Black-owned businesses following the police killing of George Floyd in 2020.\nTarget, which operates nearly 2,000 stores nationwide and employs more than 400,000 people, said it already had planned to end the racial program this year. The company said Friday that it also would conclude the diversity, equity and inclusion, or DEI, goals it previously set in three-year cycles.\nThe goals included hiring and promoting more women and members of racial minority groups, and recruiting more diverse suppliers, including businesses owned by people of color, women, LGBTQ+ people, veterans and people with disabilities.\nTarget has long been a fierce corporate advocate for the rights of Black and LGBTQ+ people. In a memo to employees, Kiera Fernandez, Target’s chief community impact and equity officer, described the DEI decisions as a “next chapter” in the company’s decades-long process to create “inclusive work and guest environments that welcome all.”\n“Many years of data, insights, listening and learning have been shaping this next chapter in our strategy,” Fernandez wrote in the memo, which Target shared Friday. “And as a retailer that serves millions of consumers every day, we understand the importance of staying in step with the evolving external landscape, now and in the future.”\nThere’s no doubt the U.S. civil rights landscape has undergone a massive transformation in the five years since much of corporate America adopted DEI goals in response to the Black Lives Matter protests that followed Floyd’s death in Minneapolis.\nA 2023 U.S. Supreme Court decision that outlawed affirmative action in college admissions emboldened conservative groups to bring or threaten lawsuits targeting corporate initiatives such as employee resource groups and hiring practices that prioritize historically marginalized groups.\nWalmart, McDonald’s, Ford, Harley-Davison and John Deere are among the well-known consumer brands that reduced or phased out their DEI commitments in recent months.\nPresident Donald Trump this week signaled his administration’s agreement with conservatives who argue that policies designed to increase minority representation by considering factors such as race, gender and sexual orientation are unconstitutional.\nOn his first day in office, Trump signed an executive order aimed at ending DEI programs across the federal government. The order calls for revoking all DEI mandates, policies, preferences and activities, along with the review and revision of existing employment practices, union contracts, and training policies or programs.\nStill, some prominent companies have resisted public pressure to retreat from their diversity plans. On Thursday, Costco shareholders rejected a proposal urging the wholesale club operator to evaluate any risks posed by its diversity, equity and inclusion practices.\nAccording to preliminary results shared by Costco executives, more than 98% of shares voted against the proposal submitted by a conservative think tank based in Washington. Costco’s board of directors had recommended a no vote.\nApple’s board and the CEO of JPMorgan bank also have expressed a commitment to preserving their companies’ DEI activities.\nUnlike some of the companies retooling or retiring their diversity initiatives, Target’s work to build a more inclusive workforce predated 2020, and the company also was long seen as a trailblazer with respect to LGBTQ+ inclusion.\nBut the employee memo shared Friday said Target no longer would participate in surveys designed to gauge the effectiveness of its actions, including an annual index compiled by the Human Rights Campaign, a national LGBTQ+ rights organization. Target said it would further evaluate corporate partnerships to ensure they’re connected directly to business objectives, but declined to share details.\nGetting corporations to withdraw from the Human Rights Campaign’s Corporate Equality Index and to stop sponsoring Pride activities have been goals of DEI opponents.\nSteering clear of a backlash from conservative customers and organizations is something that Target has tried to navigate for a while. As transgender rights became a more prominent issue in 2016, the company declared that “inclusivity is a core belief at Target” and said it supported transgender employees and customers using whichever restroom or fitting room “corresponds with their gender identity.”\nBut after some customers threatened to boycott Target stores, the company said that more stores would make available a single-toilet bathroom with a door that could be locked.\nIn 2023, Target removed some of its Pride Month merchandise after online complaints and in-store confrontations that the retailer said threatened employees’ well-being. The company decided last year not to stock Pride Month products at every U.S. store."
    },
    {
      "url": "https://apnews.com/article/trump-holiday-mlk-day-pride-black-hispanic-dei-047bbdbfc12ea6e9a9731f5861d84e70",
      "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more\nPentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more\nWASHINGTON (AP) — The Defense Department’s intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events in response to President Donald Trump’s ban on diversity, equity and inclusion programs in the federal workplace.\nThe instructions were published Tuesday in a Defense Intelligence Agency memo obtained by The Associated Press and affect 11 annual events, including Black History Month, which begins Saturday, and National Hispanic Heritage Month.\nThe memo’s authenticity was confirmed by a U.S. official who said the pause was initiated by the DIA and appears not to be policy across the Defense Department. The official spoke on the condition of anonymity to discuss sensitive matters.\n“We are receiving questions across the workforce on the way forward,” the memo said. “DIA will pause all activities and events related to Agency Special Emphasis Programs effective immediately and until further notice.”\nIt also noted a pause on “special observances” hosted throughout the year. While Martin Luther King Jr. Day and Juneteenth were included, the memo said the change would not affect those national holidays.\nThe contents of the memo were first reported by independent journalist Ken Klippenstein and posted to X.\nFederal agencies have struggled to interpret Trump’s Jan. 20 executive order ending DEI programs across the government and have taken a broad approach due to lack of clearer guidance from the White House on how to comply.\nOn Wednesday, Defense Secretary Pete Hegseth directed staff to create a DEI task force to ensure no DEI programs remain in the Pentagon.\n“We’re not joking around,” Hegseth said in an interview Wednesday with Fox News. “There’s no changing of names or softly manipulating something. DEI is gone.”\nIn response to a query from the AP about the memo, the DIA said late Wednesday it “is working with the Department of Defense to fully implement all executive orders and administration guidance in a timely manner. As we receive additional guidance, we will continue to update our internal guidance.”\nThe other annual events listed in the DIA memo are Asian American Pacific Islander Heritage Month, National American Indian Heritage Month, National Disability Employment Awareness Month, Women’s Equality Day and Women’s History Month.\nWhite House press secretary Karoline Leavitt was asked at a briefing Tuesday whether Black History Month would cease to be celebrated.\n“As far as I know, this White House certainly still intends to celebrate, and we will continue to celebrate American history and the contributions that all Americans, regardless of race, religion or creed, have made to our great country,” she said.\nThe changes in holiday observances in some ways resemble the Air Force’s quick elimination of DEI coursework in its basic military training, which temporarily resulted in the service removing videos on the Tuskegee Airmen and World War II female pilots that had been in those courses. After a brief uproar, the Air Force said the history of both groups would continue to be taught."
    },
    {
      "url": "https://apnews.com/article/trump-executive-orders-dei-7ef0bf4ce1d465f6b61f3fcfde544593",
      "text": "Trump’s orders to end DEI programs reflect his push for a profound cultural shift\nTrump’s orders to end DEI programs reflect his push for a profound cultural shift\nWASHINGTON (AP) — President Donald Trump’s sweeping orders to end the government’s diversity, equity and inclusion effort mark a sea change for the country, unwinding decades-long priorities for the nation’s largest employer — the federal government — and broader efforts to push the private sector to ensure its workforce is diverse and inclusive too.\nTrump, only days into his second term as president, has shown with his wide-reaching moves that he’s willing to use all the levers of the government to fulfill a longstanding campaign promise and bring about a profound cultural shift across the U.S. from promoting diversity to an exclusive focus on merit.\nHours after taking the oath of office, the president signed an executive order ending diversity, equity and inclusion programs within the federal government, which he and conservatives have long condemned as discriminatory.\nHis administration then moved Tuesday to end affirmative action in federal contracting — a move first required by President Lyndon Johnson — and ordered all federal diversity, equity and inclusion staff be put on paid leave and eventually laid off.\nThe effort escalates a push Trump made in his last term as president and relies on the very same tools his predecessor, former President Joe Biden, used to try to promote DEI programs across American life by embedding the priority into rules for federal contractors and grant recipients.\nBiden and his supporters cast DEI efforts as a way to ensure that historically marginalized communities are included and represented. Trump has branded the programs “discrimination” and said he wants to restore “merit-based” hiring.\nEverett Kelley, national president of the American Federation of Government Employees, said the government already hires and promotes exclusively based on merit.\n“The results are clear: a diverse federal workforce that looks like the nation it serves, with the lowest gender and racial pay gaps in the country. We should all be proud of that,” Kelley said in a statement.\nKelley called Trump’s actions “a smokescreen for firing civil servants, undermining the apolitical civil service, and turning the federal government into an army of yes-men loyal only to the president, not the Constitution.”\nThe Trump order directs federal agencies to develop plans to deter DEI programs in the private sector and at universities and list potential civil compliance investigations that could be launched to bring about that aim. It’s a marked attempt to chill DEI initiatives across the country, placing them in the crosshairs of the federal government such that even if conducted lawfully, private employers may be forced to respond to federal probes.\nShifting federal priorities between administrations of different political parties is nothing new. But the scale and speed of the country’s onetime embrace of DEI programs and Trump’s systematic effort to root them out is dizzying.\nAt the end of Trump’s first term, the Republican sought to ban federal agency contractors and recipients of federal funds from carrying out corporate diversity initiatives.\nBiden rescinded that order on his first day as president and issued two executive orders aiming to stitch — throughout the government and the workforce at large — a sensitivity about bias and discrimination.\n“I cannot describe to you how influential that executive order was. It really dictated the four years of the Biden administration,” said Mike Gonzalez, a senior fellow at the conservative Heritage Foundation whose writings have included a focus on DEI programs. “The first thing Trump does is rescind that executive order.”\nGonzalez said the breadth of Trump’s actions and the fact that they came so quickly was “a pretty sweeping statement.”\nGonzalez said DEI programs adopted across American society, from the federal government to private corporations, are “dangerous, demeaning and immoral,” and violate the Civil Rights Act and the 14th Amendment’s guarantees of equal protection under the law.\nHe called Biden’s actions on DEI “very misguided and regrettable.”\n“We have gone down that path before as a society,” he said. “We decided this was something we did not want to do, to promote or hire on the basis of race.”\nMost Americans agree that being white and a man helps people’s ability to get ahead in the U.S. today, and that being Black hurts people’s ability to get ahead, according to a Pew Research Center poll conducted in 2023. They’re also more likely to say that being a woman, Hispanic or Asian is more harmful than helpful.\nBut another Pew Research Center poll from 2024 found that U.S. adults are more split on the extent to which white people benefit from advantages that Black people don’t have, or if women still face obstacles that make it harder for them to get ahead than men.\nAnd there are indications that Trump’s supporters are particularly concerned about gains for groups like women and racial minorities coming at the expense of others. According to AP VoteCast, relatively few voters in the 2024 election overall — about 3 in 10 -- said they were “very” or “somewhat” concerned that U.S. society has focused too much on gains for women at the expense of men, but Trump’s supporters were more divided. A majority were “not too” concerned or “not at all” concerned about gains for women coming at the expense of men, but about 4 in 10 said they were at least “somewhat” concerned.\nEven before Trump’s actions, a backlash to DEI programs has been already underway in corporate America.\nDozens of prominent companies started to roll back, or even eliminate, their DEI commitments in the wake of a 2023 Supreme Court ruling eliminating affirmative action at universities, a decision that unleashed a flood of conservative-backed lawsuits against diversity efforts in the corporate world. The trend accelerated sharply after Trump’s election as companies anticipated his aggressive orders to dismantle DEI.\nWalmart, for instance, announced in November that it would no longer consider race and gender when offering supplier contracts, a decision that mirrors reforms the Trump administration will pursue with federal contracts.\nAlready, conservative lawsuits have successfully forced some government agencies to stop considering race when awarding government contracting and financing.\nFacebook owner META, McDonald’s and Boeing are among other companies that have dropped DEI commitments in response to the changing legal landscape and the change of government.\nHowever, many of the country’s top companies have stuck by their DEI policies, including some with government contracts such as tech giant Microsoft and global consulting firm Accenture.\n___\nAssociated Press writers Amelia Thomson-Deveaux in Washington and Alexandra Olson in New York contributed to this report."
    },
    {
      "url": "https://apnews.com/article/target-al-sharpton-dei-520dbc23cd668b57b3bfef76d1bc7cdd",
      "text": "Al Sharpton calls meeting with Target’s CEO amid DEI backlash ‘very constructive and candid’\nAl Sharpton calls meeting with Target’s CEO amid DEI backlash ‘very constructive and candid’\nNEW YORK (AP) — Target’s chief executive officer met Thursday with the Rev. Al Sharpton, whose civil rights organization has encouraged consumers to avoid U.S. retailers that scaled backed their diversity, equity and inclusion initiatives.\nSharpton called the meeting with Target CEO Brian Cornell “very constructive and candid,” according to an update from his National Action Network. Two other NAN representatives, National Board Chair Dr. W. Franklyn Richardson and Senior Advisor Carra Wallace, also attended the meeting at the organization’s New York headquarters.\n“I am going to inform our allies, including Rev. Dr. Jamal Bryant, of our discussion, what my feelings are, and we will go from there,” Sharpton said in a statement.\nBryant, an Atlanta area pastor, organized a website called targetfast.org to recruit Christians for a 40-day Target boycott. Other faith leaders endorsed the protest, which started with the beginning of Lent on March 5.\nA National Action Network spokesperson confirmed earlier Thursday that Sharpton, the group’s founder and president, planned to meet Cornell in New York this week. The news was first reported by CNBC.\nA Target spokesperson couldn’t immediately be reached for comment.\nTarget is among a slew of companies, including Walmart, Amazon and PepsiCo, that have eliminated policies and programs aimed at bolstering diversity among their employees and reducing discrimination against members of minority groups, women and LGBTQ+ people.\nAfter returning to the White House in January, President Donald Trump moved to end DEI programswithin the federal government. He has warned schools to do the same or risk losing federal money.\nThe National Action Network said Sharpton met on Tuesday with PepsiCo CEO Ramon Laguarta and Steven Williams, the CEO of PepsiCo North America, to “get clarity on its stance on DEI, whether they were shutting down their commitments due to pressure from Trump and right-wing activists, and the path moving forward.”\nEarlier this month, Sharpton gave PepsiCo three weeks to meet with him — or suffer a boycott — to discuss reversing the company’s recent move to do away with its DEI initiatives.\nThe National Action Network said Thursday that Sharpton planned to consult the organization’s board members over the Easter holiday “to determine any next steps with Target, PepsiCo, and other companies that have scaled back their DEI programs or pledges.”\nTarget announced on Jan. 24 that it would conclude the DEI goals it had set to increase Black employees’ representation and advancement, improve Black shoppers’ experiences and promote Black-owned businesses. The company also said it planned to stop submitting reports for external diversity surveys.\nIt is also “further evaluating our corporate partnerships to ensure they are directly connected to our roadmap for growth,” according to a memo posted on its website.\nA number of other boycotts were launched of retailers that have pulled back on DEI."
    }
  ],
  "argos_summary": "Rev. Al Sharpton is leading a Wall Street march to protest the Trump administration’s push to dismantle diversity, equity and inclusion (DEI) programs and to urge corporate America to resist boycotts of companies that have scaled back DEI initiatives. Sharpton’s National Action Network has called for consumer boycotts of retailers such as Target, Walmart and Amazon, while Target has announced it will end its DEI goals and stop reporting on diversity metrics. The Trump administration has also ordered K‑12 schools to certify compliance with federal civil‑rights laws or risk losing funding, and a federal judge has ordered improvements at a New York immigration holding facility after detainees complained of inhumane conditions. These actions reflect a broader federal effort to roll back DEI policies across government, education, and the private sector, sparking backlash from civil‑rights groups and corporate leaders who defend inclusive practices.",
  "argos_id": "P9A57NAU9"
}