{
  "url": "https://finance.yahoo.com/news/tasso-shemed-deliver-weight-loss-090433401.html?_guc_consent_skip=1756372516",
  "authorsByline": "GlobalData",
  "articleId": "b8a72496d324454e98e6b0ae93d637b0",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/medical_device_network_744/0ea9b3c5037ee8ce675ac8c6f845a370",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T09:04:33+00:00",
  "addDate": "2025-08-28T09:17:33.296278+00:00",
  "refreshDate": "2025-08-28T09:17:33.296280+00:00",
  "score": 1.0,
  "title": "Tasso and SheMed to deliver weight loss treatments with blood testing in UK",
  "description": "Tasso’s virtually painless device streamlines the blood sample collection process, negating the need to visit a clinic.",
  "content": "Tasso has partnered with women's healthcare company SheMed to offer at-home blood testing for weight loss treatments in the UK.\n\nThis collaboration aims to personalise glucagon-like peptide-1 (GLP-1) therapies by utilising the Tasso+ blood collection device, enabling completion of comprehensive lab screenings before starting these treatments.\n\nThe Tasso+ device, a lancet that collects whole liquid blood samples, is compatible with multiple standard collection tubes and has received US Food and Drug Administration (FDA) Class II Lancet 510(k) clearance.\n\nTasso’s virtually painless device is said to streamline blood sample collection to a brief and simple process, negating the need to visit a clinic.\n\nTasso co-founder and CEO Ben Casavant said: “Simplifying blood collection and expanding patient access to essential health data is at the core of our mission at Tasso.\n\n“Our UK collaboration with SheMed is a powerful example of how patient-centric innovation can close long-standing gaps in care and give individuals more control over their health.”\n\nSheMed's care model is centred around this blood test, revealing essential health markers such as diabetes risk, liver function, thyroid activity and cardiovascular health.\n\nNotably, 99% of individuals display at least one out-of-range result at the time of initial screenings.\n\nThese insights enable the care team of SheMed to identify early health issues, tailor every treatment plan, monitor patient progress, and ensure the safe administration of GLP-1 therapy.\n\nSheMed CEO Olivia Ferro said: “At SheMed, our mission is to empower women to take control of their health through safe, accessible, and personalised treatment. Tasso gives our customers access to high-quality at-home blood testing, allowing us to deliver care that meets women where they are.”\n\nIn 2023, Tasso secured CE mark certification for its TassoOne Plus high-volume liquid blood collection device.\n\n\"Tasso and SheMed to deliver weight loss treatments with blood testing in UK\" was originally created and published by Medical Device Network, a GlobalData owned brand.\n\n\n\n The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "medium": "Article",
  "links": [
    "https://www.medicaldevice-network.com/news/tasso-tassoone-plus-liquid-blood-collection/",
    "https://www.medicaldevice-network.com/news/tasso-shemed-blood-testing/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "blood collection",
      "weight": 0.10229444
    },
    {
      "name": "blood sample collection",
      "weight": 0.10151589
    },
    {
      "name": "blood testing",
      "weight": 0.09415613
    },
    {
      "name": "whole liquid blood samples",
      "weight": 0.08894709
    },
    {
      "name": "essential health markers",
      "weight": 0.07727027
    },
    {
      "name": "essential health data",
      "weight": 0.07661997
    },
    {
      "name": "weight loss treatments",
      "weight": 0.07619563
    },
    {
      "name": "SheMed CEO Olivia Ferro",
      "weight": 0.07327714
    },
    {
      "name": "early health issues",
      "weight": 0.07258615
    },
    {
      "name": "cardiovascular health",
      "weight": 0.07140851
    }
  ],
  "topics": [
    {
      "name": "Nutrition"
    }
  ],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.90625
    },
    {
      "name": "/News/Health News",
      "score": 0.72705078125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.4375
    }
  ],
  "sentiment": {
    "positive": 0.40753683,
    "negative": 0.056766134,
    "neutral": 0.53569704
  },
  "summary": "Tasso and women's healthcare company SheMed have partnered to offer at-home blood testing for weight loss treatments in the UK. The collaboration aims to personalise glucagon-like peptide-1 (GLP-1) therapies using the Tasso+ blood collection device, which collects whole liquid blood samples and has received FDA Class II Lancet 510(k) clearance. The device streamlines blood sample collection and eliminates the need to visit a clinic. SheMed's care model is based on this test, revealing essential health markers such as diabetes risk, liver function, thyroid activity and cardiovascular health.",
  "shortSummary": "Tasso and SheMed are partnering to provide at-home blood testing for weight loss treatments, enhancing patient control and efficiency with Tasso+ devices.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cab16e9fb5dc4d629024da98ed16829b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Tasso has teamed with women's health company SheMed to provide at‑home blood testing for UK weight‑loss patients, using its Tasso+ lancet device to collect whole blood for comprehensive lab screenings before starting GLP‑1 therapies. The collaboration aims to personalise treatment plans, monitor progress, and ensure safety by identifying early health issues such as diabetes risk, liver function, thyroid activity, and cardiovascular markers. SheMed’s care model relies on these tests, with 99 % of patients showing at least one abnormal result at baseline, allowing the team to tailor therapy and deliver patient‑centric care. The Tasso+ device has FDA Class II clearance and a CE mark, underscoring its regulatory compliance.",
  "argos_id": "PFAZJZEP3"
}