{
  "url": "https://www.businessinsider.com/geoffrey-hinton-ai-autonomous-weapons-war-robots-drones-military-effect-2025-8",
  "authorsByline": "Lee Chong Ming",
  "articleId": "ac08dc7d2b31490999c4b69c24f6bd05",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68afd919a17a8c5b4053a0b5?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T05:17:34+00:00",
  "addDate": "2025-08-28T05:24:39.172410+00:00",
  "refreshDate": "2025-08-28T05:24:39.172416+00:00",
  "score": 1.0,
  "title": "The godfather of AI says the tech is making war easier: Autonomous weapons mean 'dead robots' instead of 'body bags'",
  "description": "Geoffrey Hinton says killer robots and drones are lowering the human cost of war — and making conflicts easier to start.",
  "content": "AI could mean fewer body bags on the battlefield — but that's exactly what terrifies the godfather of AI.Geoffrey Hinton, the computer scientist known as the \"godfather of AI,\" said the rise of killer robots won't make wars safer. It will make conflicts easier to start by lowering the human and political cost of fighting.Hinton said in an interview with Katie Couric published on her YouTube channel on Wednesday that \"lethal autonomous weapons, that is weapons that decide by themselves who to kill or maim, are a big advantage if a rich country wants to invade a poor country.\"\"The thing that stops rich countries invading poor countries is their citizens coming back in body bags,\" he said. \"If you have lethal autonomous weapons, instead of dead people coming back, you'll get dead robots coming back.\"That shift could embolden governments to start wars — and enrich defense contractors in the process, he said.\"That'll be just great for the military-industrial complex because they'll be expensive to replace,\" he added.Hinton also said AI is already reshaping the battlefield.\"It's fairly clear it's already transformed warfare,\" he said, pointing to Ukraine as an example. \"A $500 drone can now destroy a multimillion-dollar tank.\"Traditional hardware is beginning to look outdated, he added. \"Fighter jets with people in them are a silly idea now,\" Hinton said. \"If you can have AI in them, AIs can withstand much bigger accelerations — and you don't have to worry so much about loss of life.\"Hinton did not respond to a request for comment from Business Insider.Hinton's comments come as autonomous systems and AI take center stage in real-world conflicts.Ukraine has been developing artificial intelligence-driven drones and other autonomous systems, and the West has been taking notes.Pål Jonson, Sweden's defense minister, said one of the key lessons Sweden learned from the war was the need for more autonomous capabilities.\"The scale and volume and also how quick technological developments have been taking place inside Ukraine: That made us cognizant that this is an area where we need to invest significantly,\" he said.One Ukrainian soldier who works with drones and uncrewed systems told Business Insider in a February report that \"what we're doing in Ukraine will define warfare for the next decade.\"Russia has also increasingly been trialing new types of ground drones as Ukraine's robot war heats up.Their designs of uncrewed ground vehicles include a \"dronobus\" for fiber optic drones, a chair on a buggy, and a box on wheels, Business Insider reported earlier this month.In April, Russia's defense minister Andrey Belousov said Russian firms and volunteer organizations had developed \"several hundred ground robotic systems.\"\"This year we plan to deliver an order of magnitude more,\" Belousov said.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "autonomous systems",
      "weight": 0.08597783
    },
    {
      "name": "lethal autonomous weapons",
      "weight": 0.08573226
    },
    {
      "name": "Autonomous weapons",
      "weight": 0.08550849
    },
    {
      "name": "other autonomous systems",
      "weight": 0.08405109
    },
    {
      "name": "ground drones",
      "weight": 0.0815719
    },
    {
      "name": "fiber optic drones",
      "weight": 0.073088646
    },
    {
      "name": "Business Insider",
      "weight": 0.06903749
    },
    {
      "name": "drones",
      "weight": 0.068633676
    },
    {
      "name": "uncrewed systems",
      "weight": 0.06852328
    },
    {
      "name": "uncrewed ground vehicles",
      "weight": 0.06624652
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.95361328125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.56005859375
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.4697265625
    }
  ],
  "sentiment": {
    "positive": 0.10687611,
    "negative": 0.5851485,
    "neutral": 0.3079754
  },
  "summary": "Geoffrey Hinton, the godfather of AI, has warned that the rise of killer robots will make conflicts easier to start and lower the human and political costs of fighting. This could embolden governments to start wars and potentially benefit defense contractors. Hinton also noted that AI is already transforming warfare, with a $500 drone destroying a multimillion-dollar tank. He suggested that fighter jets with people in them could withstand larger accelerations and thus reduce loss of life. This comes as Ukraine and the West observe developments in autonomous systems and AI.",
  "shortSummary": "Geoffrey Hinton warns that AI-driven autonomous weapons, like autonomous drones, will make war easier to start and increase the political cost by reducing body bags.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6ded8172979f47feb1b8bb79ab3f3537",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Geoffrey Hinton warns that lethal autonomous weapons could lower the human cost of war, emboldening rich nations to invade poorer ones and benefiting defense contractors. He cites Ukraine’s use of inexpensive AI‑driven drones that can destroy expensive tanks, arguing that AI is already transforming warfare and making manned fighter jets obsolete. The conflict has spurred other nations, such as Russia and Sweden, to accelerate development of autonomous and ground robotic systems, indicating a rapid shift toward a robot‑dominated battlefield.",
  "argos_id": "Q8BB871NO"
}