{
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-15042131/Andy-Carroll-united-display-girlfriend-Lou-Teasdale-Ibiza-split.html",
  "authorsByline": "Lily Jobson",
  "articleId": "f51668fe5ddf4bf0ac18158d63728139",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/28/08/101621837-0-image-m-9_1756367531548.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-28T08:53:24+01:00",
  "addDate": "2025-08-28T07:59:38.447306+00:00",
  "refreshDate": "2025-08-28T07:59:38.447308+00:00",
  "score": 1.0,
  "title": "Andy Carroll puts on a united display with girlfriend Lou Teasdale",
  "description": "Andy Carroll put on a united display with his bikini-clad girlfriend Lou Teasdale as they enjoyed a romantic holiday in Ibiza, following their short-lived split.",
  "content": "Andy Carroll put on a united display with his bikini-clad girlfriend Lou Teasdale as they enjoyed a romantic holiday in Ibiza, following their short-lived split.\n\nThe couple split earlier this month after a series of rows, with initial reports claiming the footballer, 36, dumped the make-up artist, 41, after growing fed up with her high maintenance behaviour.\n\nHowever, Daily Mail exclusively revealed it was in fact Lou who called off the relationship, and just four days later, Andy revealed they've decided to give their relationship another go.\n\nIn a series of snaps posted on Instagram on Wednesday, the couple looked stronger than ever as they held hands in a mirror selfie while lunching at Maison Neo.\n\nLou captioned the post: 'Love you x', which cemented their relationship status after they briefly split.\n\nAndy also posted a snap of Lou showing off her snooker skills while dressed in a stylish red bikini.\n\nThe couple revealed they jetted to Ibiza for a romantic holiday, before heading to The MAINE for a night out\n\nLast week, Andy said he's vowed to cut down on alcohol in a bid to save his relationship with Lou, as he confirmed the pair are trying 'to work through their difficulties'.\n\nHe told The Sun on Sunday: 'I love Lou and I love her family. We row like any couple.'\n\nReferring to his divorce from wife Billi Mucklow, who he shares three children with, Andy added: 'Things have been difficult for me and I'm going through a divorce.\n\n'Some of our rows have been about alcohol, as Lou has been teetotal for 14 years and I have a beer or wine at dinner and a drink after the game, but it's not a problem in my life. We're better off together and we're trying to work through our difficulties.'\n\nThe pair, who were together for just over a year, unfollowed each other on social media and Andy wiped all trace of Lou from his Instagram.\n\nThey now follow each other on Instagram and have added their loved-up snaps back to their pages.\n\nA source previously told the Daily Mail: 'It was Lou who ended her relationship with Andy, she walked away a few days ago, it was very much her choice to end their romance.\n\n'She isn't interested in pointing the finger or blaming him and hoped to deal with their split in private, before he blocked her on Instagram and deleted their photos together.\n\n'Lou is very upset by how everything has played out and the arguments between them were especially difficult for her to go through.\n\n'However, Andy wants Lou back and flew to Ibiza via private jet on Tuesday just to find her, even though he has no idea where she's staying.\n\n'He will think it's a romantic gesture but for Lou, she's unimpressed and just wants to be away with her family, she's not interested in any of his attempts at a reconciliation now.\n\n'All she has done all year is love and support Andy, her feelings haven't gone away, but Lou has to protect herself now and ending the relationship is the only way to move forward.'\n\nThe father-of-five returned to the UK with Dagenham & Redbridge last month after a two-year spell in France.\n\nThe couple's last public outing was at an Oasis gig at the end of July, where they packed on the PDA, proving they were still together.\n\nThe date night came after the ex footballer was interrogated about the arguments with his make-up artist lover in a restaurant and at their hotel on the Greek party island, The Sun on Sunday reported.\n\nSpeaking about the first incident, a worker at the Nikolus Tavern told the newspaper: 'He seemed very drunk and furious with his partner.\n\n'He was using very bad words. It was improper behaviour. The woman looked very upset.'\n\nAccording to the restaurant worker, police arrived and took the ex-Liverpool, Newcastle United and England striker aside for a chat, before he was later allowed back to girlfriend Lou.\n\n'Police spoke to him. He was allowed to return, and the couple left after paying for their meal. Andy was very calm when the police arrived — he stood up and spoke to them outside the restaurant', the restaurant worker added.\n\nJust hours later, cops were called again by hotel staff following reports of damage in their room.\n\nDaily Mail understands that the former England forward - once Britain's most expensive Premier League footballer when bought by Liverpool from Newcastle for £35million - was taken to the police station for questioning, but he was not arrested and no further action was taken.\n\nThe incident was confirmed by a hotel employee, who claimed Andy broke the door. That night, Lou left the hotel and spent the night at Soho Roc House.\n\nA joint statement from the couple given to The Sun said: 'Whilst having a private dinner in a restaurant on a quiet holiday in Mykonos, we had a heated discussion of the sort that most couples have had on occasion. It quickly became apparent to the police that there was no reason for them to be there.\n\n'We went outside the restaurant with them together as they insisted they wanted to 'look after' us.\n\nAs far as we are concerned, the situation has been blown out of all proportion by an interested member of the public. No one was arrested and no one was charged with anything.\n\n'We are very happy, in love and looking forward to our future together and we are disappointed that a private disagreement has become a public matter.'\n\nThe pair began dating last year after he separated from his TOWIE star wife Billi Mucklow last September.\n\nAndy and Billi called it quits divorce after two years of turbulent marriage, the footballer confirmed last year.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/tvshowbiz/article-15014859/Billi-Mucklow-family-holiday-ex-husband-Andy-Carroll-Lou-Teasdale.html",
    "https://www.dailymail.co.uk/news/alcohol/index.html",
    "https://www.thesun.co.uk/sport/36323510/andy-carroll-back-lou-teasdale-alcohol/",
    "https://www.dailymail.co.uk/tvshowbiz/article-14996125/andy-carroll-split-lou-teasdale-dumped-ex-premier-league-star.html",
    "https://www.dailymail.co.uk/tvshowbiz/billi-mucklow/index.html"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "girlfriend Lou",
      "weight": 0.08145871
    },
    {
      "name": "girlfriend Lou Teasdale",
      "weight": 0.07899336
    },
    {
      "name": "Lou Teasdale",
      "weight": 0.07859747
    },
    {
      "name": "Lou",
      "weight": 0.07806911
    },
    {
      "name": "last year",
      "weight": 0.07341037
    },
    {
      "name": "Andy Carroll",
      "weight": 0.0714948
    },
    {
      "name": "Andy",
      "weight": 0.070729
    },
    {
      "name": "last month",
      "weight": 0.061051458
    },
    {
      "name": "most couples",
      "weight": 0.061006565
    },
    {
      "name": "Last week",
      "weight": 0.056465365
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9921875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.958984375
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.64697265625
    },
    {
      "name": "/News/Sports News",
      "score": 0.515625
    }
  ],
  "sentiment": {
    "positive": 0.08154666,
    "negative": 0.6105492,
    "neutral": 0.30790415
  },
  "summary": "Andy Carroll and girlfriend Lou Teasdale have reunited for a romantic holiday in Ibiza following their brief split earlier this month after a series of rows. Initially, reports suggested that Carroll, a former Liverpool striker, dumped his girlfriend due to her high maintenance behaviour, but it was revealed that she was the real reason for their split. Despite this, four days later, Andy revealed they've decided to give their relationship another chance and are working towards a resolution. The couple, who were together for over a year, now follow each other on Instagram and add their loved-up snaps back to their pages. The date night came after Carroll was questioned about the arguments with his make-up artist lover at a restaurant and their hotel on the Greek party island.",
  "shortSummary": "Andy Carroll and Lou Teasdale, after a brief split, reunited in Ibiza, where they discussed their struggles but remained committed to reconciliation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8e7c0d02305a41d9a31f5a624cb255d5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-15014859/Billi-Mucklow-family-holiday-ex-husband-Andy-Carroll-Lou-Teasdale.html",
      "text": "Billi Mucklow has the 'best summer yet' during family holiday after ex-husband Andy Carroll's relationship drama with Lou Teasdale\n- Have YOU got a story? Email tips@dailymail.co.uk\nBilli Mucklow said she has had the 'best summer yet' during family holiday after ex-husband Andy Carroll's relationship drama with Lou Teasdale.\nSharing a series of photos to Instagram on Tuesday, the former TV personality, 37, was in high spirits as she enjoyed some time away with her mum and her children.\nBilli split from Andy, 36, last year after two years of marriage and he quickly moved on from her with Lou, 41.\nA few weeks ago it was claimed they had sensationally split after a series of rows, but Andy has since revealed he is back with Lou after Daily Mail exclusively revealed on Wednesday it was Lou who called off the relationship.\nMeanwhile, Billi, who recently showed off her revenge body, soaked up some sun with her three children - Arlo, Wolf, and Marvel Mae - and Andy's children Emilie Rose, 15, and Lucas, 14 from his past relationship.\nProving she was having the best time, Billi captioned the update: 'My superwoman @paulamucklow thanks for the best summer ever! I’ve learnt from the best there is.'\nBilli Mucklow said she has had the 'best summer yet' during family holiday after ex-husband Andy Carroll's relationship drama with Lou Teasdale\nBilli split from Andy, 36, last year after two years of marriage and he quickly moved on from her with Lou, 41\nElsewhere, Andy shared a cosy snap from his date night with girlfriend Lou Teasdale on Monday, days after confirming they were back together.\nThe couple split this this week after a series of rows, with initial reports claiming the footballer dumped the make-up artist after becoming fed up with her high maintenance behaviour.\nHowever, Daily Mail exclusively revealed it was in fact Lou who called off the relationship, and on Sunday, Andy revealed they've decided to give their relationship another go after he vowed to cut back on booze.\nThe Dagenham and Redbridge star shared a snap from his evening at the cinema, where he and Lou, who was tagged in the post, indulged in pizza together.\nOver the weekend, Andy said he's vowed to cut down on alcohol in a bid to save their relationship after boozy rows as he confirmed the pair are trying 'to work through their difficulties'.\nHe told The Sun on Sunday: 'I love Lou and I love her family. We row like any couple.'\nReferring to his divorce from wife Billi, who he shares three children with, Andy added: 'Things have been difficult for me and I'm going through a divorce.\n'Some of our rows have been about alcohol, as Lou has been teetotal for 14 years and I have a beer or wine at dinner and a drink after the game, but it's not a problem in my life. We're better off together and we're trying to work through our difficulties.'\nSharing a series of photos to Instagram on Tuesday, the former TV personality, 37, was in high spirits as she enjoyed some time away with her mum and her children\nProving she was having the best time, Billi captioned the update: 'My superwoman @paulamucklow thanks for the best summer ever! I’ve learnt from the best there is'\nElsewhere, Andy shared a cosy snap from his date night with girlfriend Lou Teasdale on Monday, days after confirming they were back together\nThe Dagenham and Redbridge star shared a snap from his evening at the cinema, where he and Lou, who was tagged in the post, indulged in pizza together\nThe pair, who were together for just over a year, unfollowed each other on social media and Andy wiped all trace of Lou from his Instagram.\nThey now follow each other on Instagram and have added their loved-up snaps back to their pages.\nOn Wednesday, a source told the Daily Mail: 'It was Lou who ended her relationship with Andy, she walked away a few days ago, it was very much her choice to end their romance.\n'She isn't interested in pointing the finger or blaming him and hoped to deal with their split in private, before he blocked her on Instagram and deleted their photos together.\n'Lou is very upset by how everything has played out and the arguments between them were especially difficult for her to go through.\n'However, Andy wants Lou back and flew to Ibiza via private jet on Tuesday just to find her, even though he has no idea where she's staying.\n'He will think it's a romantic gesture but for Lou, she's unimpressed and just wants to be away with her family, she's not interested in any of his attempts at a reconciliation now.\n'All she has done all year is love and support Andy, her feelings haven't gone away, but Lou has to protect herself now and ending the relationship is the only way to move forward.'\nThe father-of-five returned to the UK with Dagenham & Redbridge last month after a two-year spell in France.\nThe couple's last public outing was at an Oasis gig at the end of July, where they packed on the PDA, proving they were still together.\nThe date night came after the ex footballer was interrogated about the arguments with his make-up artist lover in a restaurant and at their hotel on the Greek party island, The Sun on Sunday reported.\nAndy has now vowed to cut down on alcohol in a bid to save their relationship after boozy rows as he confirmed the pair are trying 'to work through their difficulties'\nSpeaking about the first incident, a worker at the Nikolus Tavern told the newspaper: 'He seemed very drunk and furious with his partner.\n'He was using very bad words. It was improper behaviour. The woman looked very upset.'\nAccording to the restaurant worker, police arrived and took the ex-England striker aside for a chat, before he was later allowed back to girlfriend Lou.\n'Police spoke to him. He was allowed to return, and the couple left after paying for their meal. Andy was very calm when the police arrived — he stood up and spoke to them outside the restaurant', the restaurant worker added.\nJust hours later, cops were called again by hotel staff following reports of damage in their room.\nDaily Mail understands that the former England forward was taken to the police station for questioning, but he was not arrested and no further action was taken.\nThe incident was confirmed by a hotel employee, who claimed Andy broke the door. That night, Lou left the hotel and spent the night at Soho Roc House."
    },
    {
      "url": "https://www.dailymail.co.uk/news/alcohol/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Alcohol\nAlcohol News, Effects of Binge Drinking Alcohol and Addiction\nPage\nI was drinking two bottles of wine a night... Then three simple rules took willpower out of the equation - I could finally stop after just one glass\n28/07/25 14:37\nBehind closed doors, Heidi Anderson was drowning in shame and regret. It was a vicious cycle: she drank because she felt anxious, but drinking caused more anxiety. It took her years to master the art of moderation....read\nJD Vance's family holiday destination in Cotswolds 'revealed'\n28/07/25 12:55JD Vance is set to visit Oxfordshire this August for his annual holiday alongside his wife Usha and their three children Ewan Blaine, Vivek and Mirabel.Cotswold town where JD Vance will holiday with his family is 'revealed': US Vice President will 'visit charming market town with quintessential English character' when he stays this summer\n28/07/25 08:05JD Vance is set to visit Oxfordshire this August for his annual holiday alongside his wife Usha and their three children Ewan Blaine, Vivek and Mirabel.We loved boozy dinners, cocktails and champagne. Then I saw crushing truth about what alcohol had done to me and quit... but didn't foresee the impact on my marriage: DAISY BUCHANAN\n02/07/25 11:08Three years ago my husband Dale and I went on a Scandinavian city break. We were on the train between Copenhagen and Malmö when I started crying and couldn't stop.Expert reveals surprising beverage you should be drinking to cool down in the heatwave\n01/07/25 16:01As some Britons experience 35C during the UK's heatwave, many people will be looking for the best ways to cool down. Thankfully, a Scotland-based doctor has revealed a top tip.At 35, I knew I was drinking too much. Then a miracle treatment finally helped me stop at 'just one or two' - and women are hailing it as a 'game-changer'\n23/06/25 13:58There's a saying about alcohol: you know it's a problem when it takes more from you than it gives. But not everyone who reaches that point is an alcoholic - far from it.Married At First Sight fan favourite Foxy JoJo doesn't look like this anymore! TV bride showcases stunning weight loss\n11/06/25 00:07Married At First Sight fan favourite Jo 'Foxy JoJo' McPharlin has stunned fans with her dramatic makeover, after losing 20kg four years ago.The sad, lonely death of a $22million Powerball winner: Josh spent his last $19 on a lotto ticket that should've been his happy ending. It brought one unthinkable tragedy after another\n09/06/25 13:22Despite his good fortune, Josh's life would quickly unravel over the next five years, ending in unimaginable tragedy... Now, friends reveal his desperately sad story for the first time.Aussie actor shares shocking before-and-after photo of his dramatic body transformation after giving up alcohol\n03/06/25 05:01Dan Ewing has stunned fans by sharing a shocking before-and-after post to mark his 40th birthday on Tuesday.Country star Gavin Adcock spends the night in TN jail after arrest for open container and reckless driving\n22/05/25 21:34Last month, the 26-year-old country crooner shared an Instagram video of himself responding to criticism that he drinks too much: 'God forbid I have hobbies'Amber Valletta, 51, was a '90s model who starred in a movie with Michelle Pfeiffer... see her now\n16/05/25 17:52Amber Valletta was a major 1990s supermodel who worked for Versace and DKNY. She had her first major film role as a poltergeist in Robert Zemeckis's supernatural thriller What Lies Beneath.Jackie O Henderson breaks down as she discusses her healing journey after admitting to secret drug and alcohol addiction: 'I never felt good enough'\n14/05/25 02:07Jackie 'O' Henderson tearfully broke down live on-air on Wednesday morning as she discussed her ongoing healing journey.Jennifer Lopez and Ben Affleck make a HUGE cut to $68M asking price for marital mansion after money 'feud'\n08/05/25 21:09That is a massive reduction and one that will likely hit their pocket book as they snapped up the massive home for $60,850,000 in May 2023.Police officer who 'pushed and punched' wheelchair-bound disabled man in town centre is cleared by watchdog\n08/05/25 16:38The constable approached the man in Great Yarmouth, Norfolk, who appeared to be brandishing a bottle. Onlookers said an altercation then took placeJennifer Lopez accidentally reveals she is still living at $68M marital mansion Affleck is 'desperate' to sell\n28/04/25 20:08The looker had her honey highlighted hair down with dewy nude makeup on. As she looked into the camera she showed off a beige sweater worn under a pair of acid-washed denim overalls.Lisa Curry reveals she has permanently quit alcohol after being hospitalised with shock health scare\n19/04/25 14:43Lisa Curry has revealed she has officially given up alcohol after suffering a terrifying health scare while holidaying in Fiji.London bar lambasted for serving 'worst value pint' - with eye-watering service fee added to cost just for pouring it\n17/04/25 10:36Jimmy McIntosh from London was left in shock after discovering the price of a pint of Carlsberg from Munchkins near the British Museum in Bloomsbury, London.Moment French supermarket security guard brutally beats young woman after accusing her of shoplifting before he is fired for 'unacceptable violence'\n27/03/25 12:42The shocking act of violence erupted early Tuesday evening at the Carrefour Market in Mantes-la-Jolie, Yvelines, roughly 35 miles west of Paris.Married At First Sight bride reveals her incredible transformation after being sober for 100 days\n25/03/25 00:07Married At First Sight bride Joanne Todd is celebrating 100 days of sobriety after admitting that alcohol was affecting her life.The groundbreaking drinks that promise to give you the buzz of alcohol with no hangover - but do they work?\n20/03/25 11:46Like so many women who appreciate a fine glass of wine or a nicely mixed cocktail, I've spent years trying to make myself enjoy the alcohol-free versions of these drinks.Meet the 'David Beckham of Asian football' who quit the game and went on to make $28 million fortune from completely different career\n19/03/25 11:54The sky was the limit for Hidetoshi Nakata. 'The Little Jewel' was adored by fans for his exploits on the pitch for his playmaking, while his extravagant style made him an icon on and off the pitch.Influencer Kurt Coleman shows off his incredible 'hot' body transformation that has left him unrecognisable - and reveals how he achieved it\n25/02/25 08:25Kurt Coleman has showed off his fit new look and shared what it took to achieve it.For 20 years, I have seen how alcohol can ruin lives and break apart families. This is how you can help your struggling partner without destroying your relationship: VICTORIA SEED\n21/02/25 12:12Alcohol addiction has the power to destroy lives - and not just the drinker's. For while around 1 per cent of us are thought to be dependent on alcohol, as many as one in ten are significantly affected...No 'pagne, no gain! English sparkling wine is going up in the world - but it's a tough sell for lovers of the French variety\n25/01/25 13:48With its Champagne region, France has long ruled over the sparkling wine market, but now England is coming for that title.Kelly Ripa, 54, reveals how much weight she GAINED when she stopped drinking alcohol\n23/01/25 18:12On Wednesday's Live with Kelly and Mark episode, which saw Andy Cohen fill in for Mark, the 54-year-old talk show host revealed how eliminating liquor from her diet transformed her figure.'WFH drinking' nearly killed me: I survived an aneurysm at 28 and had to learn how to walk again... how could I then let alcohol destroy my life?\n23/01/25 13:28Leola Rose should have been grateful to be alive, but instead she was drinking herself to death - this is her incredible story of injury, tragedy and addiction.Carol Alt, 64, looks half her age in strapless leopard print dress as she reveals her secret to staying slim\n08/01/25 15:19Sports Illustrated Swimsuit Edition cover veteran Carol Alt still looks amazing.Scientists reveal how long it takes the body to recover from a night of boozing - and what you should NEVER do the morning after\n01/01/25 12:52Experts have warned of activities that are popular on a hangover, but could raise the risk of potentially deadly heart problems.Carol Alt, 64, posed for Vogue, acted with Alec Baldwin and wed a NY Rangers hockey star, see her now\n27/12/24 15:03Sports Illustrated Swimsuit Edition cover veteran Carol Alt has had an incredible career, and she has no signs of slowing down.After five months on Ozempic, I have discovered a miracle side effect - but there's still one downside no one seems to want to talk about...\n23/12/24 13:23We'd barely been in the nightclub an hour before I turned to my husband and said, 'I'm sorry, I'm going to head back to the hotel. I really don't feel great.' He looked as disappointed as I felt.I've been sober for three years but terribly miss drinking at Christmas time. Then I remind myself of the profound idea that's changed my life: There's no such thing as 'just a glass': CLOVER STROUD\n20/12/24 11:50Sometimes I urgently miss drinking. It's the week before Christmas and a few years ago, I'd have been feeling all warm and a bit drunk right now.Nine foods that really WILL ward off a hangover: A top nutritionist reveals the surprising things to eat before drinking alcohol... and AFTER\n20/12/24 11:46We asked nutritionist Toral Shah about the best foods and drinks that'll actually help clear your head. From smoked salmon to a chocolatey treat, here's what to stock up on.How weekend drinking sessions can harm your heart even years after you've quit: Doctors reveal frightening truth - and signs you need to know\n05/12/24 11:47Catrina was driving to work earlier this year when she was struck by what she feared was a heart attack. After this was ruled out, she was given less reassuring news.I'm a sex addict and it's a living nightmare. I slept with 300 women behind my wife's back and begged her for sex five times a day... and it's ruined MY life\n04/12/24 04:22I am a sex addict. A recovering one. I have a chronic, destructive disorder, exactly the same as those addicted to alcohol, drugs, food, gambling or stealing.As an oncologist I hardly ever drink. When I see alcohol flowing, I can't block out the cancers I know it causes... and I believe it's taking a terrible toll on young people: PROFESSOR JUSTIN STEBBING\n28/11/24 12:02From enjoying a beer with colleagues at the end of a stressful day, to dawdling over a glass of wine with family, there's no doubt having a drink can be relaxing and restorative.Alexis Bellino 'never would've signed' back on RHOC to be positioned as 'the villain' opposite Shannon Beador\n25/11/24 02:15Bellino, 47, who initially appeared on the Bravo show's fifth through nine seasons spanning 2009-2013, returned in a friend capacity this year.My 'fun friends' tried to convince me I didn't have a drinking problem - but in the depths of my addiction, my husband said something that broke me\n21/11/24 23:58Gemma Kirby promised her husband over and over again she would stop drinking. But weeks, or even days, later she would inevitably find herself waking up at 6am, blurry eyed and nauseous.Shannon Beador settles $75K suit with John Janssen after ugly showdown with his new love Alexis Bellino\n20/11/24 00:09The Bravo star, 60, and her former beau, 64, filed legal papers November 15 for an 'unconditional' dismissal of their ongoing litigation in the next 45 days.An ex-addict's five-question quiz that'll reveal if you have a drinking problem...\n06/11/24 14:53The first time I drank during the working day, I was 29 - and if I could pinpoint the moment my troubles with alcohol began, that day would be it.Hurricane Milton: are these weather fronts the new normal? Plus, immigration has fuelled a record rise in the population - on the latest episode of The Reaction with Sarah Vine and Andrew Pierce\n10/10/24 16:05Florida braces itself for what is predicted to be one of the worst hurricanes of the century, plus a surge in net migration means that there are now over 68 million people living in the UK. Listen now.Matthew Kelly, 74, discusses going sober after his friends nicknamed him 'Muriel Malbec' due to his love of excess as he reveals he got trashed EVERY night for three months\n04/10/24 13:34The broadcaster and actor, 75, shot to fame by hosting some of the biggest shows including Stars In Their Eyes from 1993 until 2004 and game shows You Bet and Game For A Laugh.Roxy Jacenko reveals the surprising number of bikinis she wears a day as she embarks on a luxury holiday\n03/10/24 07:13She is known for her expensive taste and wardrobe overflowing with designer ensembles.'My son was murdered by spiking': University student, 18, died with the equivalent of five ecstasy tablets in his system - but nobody has ever been found responsible\n03/10/24 05:54Greg Mackie, 18, died in a suspected drink-spiking incident while studying Film and Media in Edinburgh.Does your vote match your drink? Daily Mail poll reveals the favorite tipples of Trump and Harris supporters\n29/09/24 11:05If you are what you eat then our latest poll suggests you vote what you drink. The nation's polarization has not only driven a wedge through friendships but it extends even to a drinks gap.Sports Illustrated swimsuit model Carol Alt, 63, looks half her age as she poses with a handsome man in Italy... after joining OnlyFans\n23/09/24 14:30Sports Illustrated Swimsuit Edition cover veteran Carol Alt looked gorgeous in green on Sunday. She had her arm around Joe Ienco.Gen Z students ditch boozing and partying for puppy yoga and cold water swimming as they opt for sober Freshers' Weeks\n20/09/24 06:53For many graduates, freshers' week was all about cheap booze, club nights, and a lack of sleep. But for new UK Gen Z students it's completely different, with many opting for a teetotal week.Baileys launch their sweetest ever drink ahead of autumn\n19/09/24 07:27Established in 1974, Baileys Original Cream, which hailed from Ireland, mixes the taste of whiskey with notes of rich chocolate and vanilla.The truth about what happens if you drink more than 14 units of alcohol a week - and how much it shortens your life by (and it's shorter than you think)\n09/09/24 13:55But how worried do we actually need to be if drinking at or even above 14 units a week - and have the risks been overstated? Dr Ellie Cannon has the answersOklahoma teen Noah Presgrove's family share their heartbreak a year to the day after he was mysteriously found dead as they issue a chilling warning to his killer\n04/09/24 21:54Noah Presgrove, 19, was wearing only shoes when his body was discovered on a desolate stretch of US-81 near Terral, Oklahoma , on September 4, 2023, and a year later his death is unsolved.Elle Macpherson reveals she still attends regular AA meetings following her decision to quit alcohol 20 years ago: 'Without being sober, I wouldn't be here'\n02/09/24 10:23Elle Macpherson has revealed that she attends AA meetings to keep a grip on her sobriety.Powerball jackpot surges to $100million: How big wins can bring bad fortune\n20/08/24 03:45While winning the lottery is often seen as the ultimate stroke of luck, it can also bring unforeseen bad fortune.Un railway journey like no other: A sleeper train trip through Kim Jong Un's North Korea when the border reopens in December promises to be an eye-opening experience. As one intrepid traveller reveals...\n17/08/24 13:06The obvious way in to North Korea is by plane, but adventure blogger Anthony Middleton documented a fascinating alternative - the Pyongyang Express from China.Matthew Perry's longtime live-in assistant Kenny Iwamasa, 59, injected Friends star with the ketamine that killed him\n15/08/24 18:24Matthew Perry's live-in assistant has pleaded guilty to giving the late Friends star the ketamine that caused his death, prosecutors announced on Thursday.Health and fitness vlogger warns people to ditch low calorie sprays - as he advises that olive oil is better for you\n13/08/24 06:50Olive oil is one of the healthiest in the world - but health vlogger Sunna van Kampen, from London, has warned fans to avoid substitutes of the multiuse oil, such as Fry Lite Olive Oil cooking spray.Fancy giving your morning java a cheeky twist? Grind adds Baileys iced coffee to its menu this summer\n07/08/24 07:05A popular UK coffee chain has given customers the option to add an unlikely extra into their daily caffeine dose - booze.Jodi Gordon shares candid details about healing her relationship with her daughter and new job at call centre as she recovers from substance abuse\n03/08/24 12:35Jodi Gordon has shared intimate details of her recovery process as she overcomes substance abuse.Wellbeing expert reveals 5 top tips to help parents destress in a healthy way during the busy school holidays - as it's revealed 40% turn to smoking and alcohol to cope\n28/07/24 16:26Many parents rely on unhealthy habits to cope with Summer holiday stress, according to a new poll from CBD-brand Provacan in collaboration with UK wellbeing expert Dave Gibson.Making six simple lifestyle tweaks can cut your dementia risk, say experts - as diagnoses hit record high of almost 500,000\n22/07/24 08:57Dementia, a condition where the function of the brain is impacted robbing sufferers of the memories and independence, is on the rise with a record number of cases diagnosed in England.Diner is left stunned by 'pathetic' detail on their order after forking out insane amount for classic pub dish\n17/07/24 06:30A Melbourne diner has been left stunned by a 'pathetic' detail in her order after she forked out $31 for a classic pub dish.J.Lo and Ben Affleck are 'selling off art work' from inside $60M home\n02/07/24 10:00Jennifer Lopez and estranged husband Ben Affleck - who have not been pictured together in almost one month - are reportedly selling off art work from inside their home.Jennifer Lopez and Ben Affleck are 'selling off art work' from inside their $60M mansion as the couple are 'on the edge of divorce'\n01/07/24 16:59Jennifer Lopez and estranged husband Ben Affleck - who have not been pictured together in almost one month - are reportedly selling off art work from inside their home.MY LIFE IN DRINKS: Nina Campbell on discovering gin at 13 and drinking with The Supremes at Annabel's\n29/06/24 11:01My favourite drink as a child was blackcurrant and apple Ribena: cold, never hot.Roxy Jacenko reveals her shockingly expensive bill at exclusive Sydney restaurant - after losing 15kg on strict diet\n22/06/24 10:52Roxy Jacenko shared a post to social media on Saturday revealing the staggering bill she received after dining at one of Sydney's most exclusive restaurants.Bring on the carbs! Roxy Jacenko shows off her tiny figure as she stocks up on Turkish bread in Sydney after being on a strict diet and losing 15kg\n20/06/24 09:43Roxy Jacenko looked to be in good spirits on Thursday when she was spotted doing a grocery run in the upmarket Sydney suburb of Double Bay.Family who were evacuated from Rhodes wildfires say they WILL return and relive moment 'nice breeze' was felt before hell was unleashed\n18/06/24 14:15As many as 10,000 UK tourists were estimated to have been staying on the Greek island at the time of the fires amid a searing heatwave at the end of July 2023.Germany's favourite British comedy sketch - Dinner For One - is to get spin-off series 60 years later in Europe... despite being virtually unknown in the UK\n17/06/24 11:58Germany's most famous film studio is producing six brand new episodes. The show will air on Amazon Prime in 2025, starring Alicia von Rittberg. Millions watch Dinner for One every New Year's Eve.Brett Henson: High-flying Mirvac executive who stole a taxi after night out at Sydney's Ivy nightspot learns his fate - as judge makes a ruling on his 'Muslim brotherhood' excuse\n17/06/24 02:42Brett Henson, 42, had a dispute with a taxi driver, Sayeed Ali Khan, over a broken door handle shortly before 9pm on November 4, 2022, in Sydney's CBD.Personal trainer shows off her extreme 13kg weight loss as she poses in the nude after taking part in US reality series Naked and Afraid\n12/06/24 01:17A personal trainer has revealed the huge toll appearing on a hit American reality series has had on her body.As the film lauding the pinot grape, Sideways, celebrates its 20th birthday, the Mail visits the 'hipster' California hotspot where it was set - and finds wine tourism there is in rude health\n07/06/24 07:42Oliver Bennett travels to Santa Ynez Valley, where Sideways was filmed. He discovers it has become a 'funkier' alternative to Napa, with wineries run by exiles from LA and 170 vineyards.Five refreshing summer mocktails to level up your BBQ - including DELICIOUS recipes from Waterloo Sparkling Water\n06/06/24 15:16SponsoredWaterloo Sparkling Water's newest flavor collection can be enjoyed straight from the can or used as a mixer to create delicious mocktails. Check out 5 delicious, easy-to-follow recipes.Pregnant Sian Welby shows off her blossoming bump in her underwear for a gorgeous maternity photoshoot - as she prepares to welcome a baby girl\n06/06/24 09:03The Capital Breakfast host, 38, who announced on Thursday she's expecting a baby girl with fiancé Jake Beckett, posed for a stunning black and white shoot as she awaits her newborn's arrival.Carol Alt, 63, candidly reveals her gown was tight because she 'gained weight' but she STILL manages to look sensational... 42 years after SI cover\n05/06/24 13:52'I have to admit, I had gained weight since my fitting with Zang so the dress popped, but he was with me so it worked!' said the iconic Vogue model after attending Patti LaBelle's birthday party.Man, 84, who is the only resident of Europe's highest and most isolated village opens up about why he keeps living there even after everyone left\n02/06/24 15:01Irakl Khvedaguridze, 84, is the only licensed doctor in the remote Tusheti region of Georgia, which covers about 380 square miles. While everyone has left his village, Bochorna, Irakl has remained put.I was a Virgin flight attendant - these are the routes that are traumatic to work on... and why celebrities can be the worst passengers\n01/06/24 13:32A Virgin Atlantic flight attendant of 17 years - Sky Taylor, 48, has pulled back the glamorous curtain to reveal the downsides of cabin crew life.Capital Breakfast DJ Jordan North, 34, tells Scarlett Dargan about crack-of-dawn coffee and why he can no longer touch cider - or fermented guts\n01/06/24 11:01My favourite drink as a child was Vimto, the fruity soft drink.I'm a cruise ship worker... here are SEVEN must-follow tips for first timers\n01/06/24 07:21Lucy Southerton, 28, from Birmingham , who's racked up an impressive nine years of experience on board, recently took to YouTube channel Cruising as Crew to explain how first timers should prepare.Jimmy Barnes shares the moving reason he agreed to reunite with Cold Chisel as the iconic band announce national 50th anniversary tour\n31/05/24 14:04Jimmy Barnes is going back on the road with his rock band Cold Chisel for their The Big Five-0 tour.The bad habits of the 'wellness' generation: How Gen Z are shunning millennial vices like drinking alcopops and smoking for taking ketamine and vaping - as studies lay bare 'dramatic' impact of social changes\n31/05/24 10:26Dramatic lifestyle changes are affecting the health of young people in Britain and storing up future health problems, experts warn.'Drunk' woman caught in furious row with Kylie Kelce breaks her silence after 'harassing' couple for a picture\n31/05/24 05:11In the clip, which has gone viral, Goldberg can be seen confronting Travis Kelce 's brother and sister-in-law outside a restaurant. She shouted at Kylie: 'I don't give a f**k who you are.'Chef reveals little-known hack to keep lettuce fresh for over 60 days\n31/05/24 02:14A South Korean chef has come up with a 'genius' solution for keeping lettuce lasting and fresh for 60 days using a common kitchen staple.\nPage\nDON'T MISS\n-\nMeghan Trainor looks thinner than ever in jaw-dropping look at LA premiere after weight loss drug reveal and breast augmentation\n-\nAnne Hathaway takes EPIC tumble in her heels while filming Devil Wears Prada sequel in New York City\n-\nBrooklyn Beckham takes inspiration from his new pal Meghan Markle by making JAM in his latest cookery video - after forging a bond with the Royal couple over matching family feuds\n-\nWhat Travis Kelce did on second date with Taylor Swift proved he was nothing like Joe Alwyn, says ALISON BOSHOFF - and what the timing of his proposal says about baby plans\n-\nBruce Willis' wife reveals dementia-stricken actor is living separately from her and their young daughters\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n-\nPrince Harry will return to London on the anniversary of Queen Elizabeth II's death to attend charity awards\n-\nEXCLUSIVE\nMolly Mae's desperate secret you don't find out about: She says she's 'open and honest' about motherhood. No wonder an insider called DOLLY BUSBY and revealed all\n-\nAndy Carroll puts on a united display with his bikini-clad girlfriend Lou Teasdale as they enjoy romantic Ibiza holiday after short-lived split\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nDavina McCall's hairdresser-turned-boyfriend Michael Douglas admits he finds her 'annoying' since brain operation left her with short-term memory loss\n-\nEXCLUSIVE\nBitter Meghan's 'fuming' over public's love of Kate says friend... and she doesn't stop there: EDEN CONFIDENTIAL reveals all\n-\nKhloé Kardashian's ex French Montana is engaged to a ROYAL Princess\n-\nSam Faiers falls victim to mum-shamers as her 'poor parenting' and 'lack of boundaries' are slammed while son Edward, 3, hurls food at his sister\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nEXCLUSIVE\nTaylor Swift and Blake Lively war hits new low: Blake KNOWS she isn't invited to wedding but insists she doesn't care... and is serving up ice cold revenge\n-\nGeorge Clooney, 64, cuts back Venice appearances due to sudden illness as star-studded film festival kicks off\n-\nA-list actress famed for a nineties cult classic looks almost unrecognisable as she arrives at Venice Film Festival - but can YOU guess who it is?\n-\nRylan Clark says it is 'absolutely insane' that illegal migrants are put up in four-star hotels - as he thanks legal NHS migrants who helped save his mother's life\n-\nWant to buy your first home as a couple? How to double up to get ahead\nSponsored\n-\nJamie Laing shares his hilarious reaction after his naked photo is accidentally posted online by wife Sophie Habboo\n-\nMeghan Markle's latest As Ever product launch is hit by technical glitch as Duchess unveils £10.38 orange marmalade\n-\nJames Corden's wife Julia oozes glamour as couple dress to impress at the US Open in New York ahead of his return to Broadway\n-\nThe Chase fans reduced to tears after learning contestant who landed £100k jackpot never got to spend his winnings as he died after show\n-\nChristine McGuinness joins OnlyFans spin-off site to host tell-all series about her life as a mother and TV star\n-\nOasis show descends into chaos as footage emerges of a brawl breaking out at reunion gig in Toronto\n-\nREBECCA ENGLISH reveals the withering comment a royal insider secretly made about Meghan Markle's new Netflix show in the Palace Confidential newsletter\n-\nMeghan's many names! Truth behind what Harry's wife is REALLY called - amid confusion over Sussex surname - and why it's changed so many times\n-\nJo Whiley breaks down in tears as she reveals her husband killed their cat in tragic accident\n-\nBlue-haired North West looks unimpressed with mom Kim Kardashian as they tour Rome's iconic Colosseum\n-\nS Club 7's Jon Lee 'secretly dating hunky Celebs Go Dating star' - after six years of celibacy\n-\nHolly Ramsay shows off her toned abs in skimpy red bikini as she continues to enjoy her 'bridal era' in snaps from weekend away before she ties the knot with fiancé Adam Peaty\n-\nSelena Gomez sweetly celebrates being engaged at same time as BFF Taylor Swift after 'real love' post resurfaces\n-\nTaylor Swift's future mother-in-law Donna Kelce gives her stamp of approval in most heartwarming way\n- Explore the hidden gems just a car ride from your favourite European cities with Skyscanner's road trip planner SHOPPING\n-\nKim Kardashian puts on a leggy display in lace tights as she joins her daughter North West for shopping in Milan as they continue their Italian trip\n-\nCate Blanchett turns heads in plunging black gown as she joins Heidi Klum and daughter Leni at star-studded opening ceremony of the Venice Film Festival\n-\nKevin Spacey's truly desperate last move 'to avoid bankruptcy'... plus why Harry seems set to torch his relationship with William AGAIN\n-\nAnna Kournikova announces shock pregnancy at 44... weeks after sparking concern with health scare\n-\nThe sell-out lymphatic drainage oil users say 'TRANSFORMS' thighs is back in stock - and it's on sale with 20% off\n-\nTaylor Swift fans predict glaring absences from Travis Kelce wedding guest list\n-\nCoronation Street star Adam Hussain breaks his silence on quitting the ITV soap after five years - but he has already teased his return\n-\nBAFTA-winning actress Sophie Willan puts on a VERY racy display as she strips completely nude to show off her growing baby bump in naked snaps\n-\nThe Vivienne's mother shares heart wrenching family update in new documentary Dear Viv after star's tragic ketamine death\n- Struggling to sleep in the heat? Emma Sleep has 25% off cooling bedding while stocks last SHOPPING\n-\nJAN MOIR: Meghan is back, and this second helping of the woman who put the boasting into hosting makes me curl up\n-\nInside Prince Harry and Prince William's surprise reunion for Diana's brother-in-law's funeral... and the courtier complex relationship with the Firm, according to royal author\n-\nJennifer Lopez looks unbothered in busty skirt suit while out in LA after being roasted by former co-star\n-\nRob Kardashian's ex Blac Chyna's face is caressed by a hairless CAT in very strange ad\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nPoisonous war between Tina O'Brien and ex Ryan Thomas over 'nepo baby' GCSE drop-out as insiders whisper toxic facts to KATIE HIND\n-\nStrictly Come Dancing star Thomas Skinner complains he doesn't get paid as much as other celebs for gigs as he reveals he's still delivering mattresses\n-\nDenise Richards gets ruptured breast implants fixed amid Aaron Phypers divorce drama: 'Can't wait for bikini season!'\n-\nAll the private battles that nearly doomed Taylor Swift and Travis Kelce: But after THAT 'breakup contract'... friends know why she fell so hard\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nHollyoaks star looks unrecognisable as she lands sex worker role in steamy period drama - but can YOU guess who it is?\n-\nTeen Mom star Jenelle Evans reacts to son, 16, moving out amid feud... after revealing her massive OnlyFans salary\n-\nFreddie Mercury's 'alleged love child says music legend would have hated his biopic Bohemian Rhapsody' and confesses it is 'full of fabrication'\n-\nSky 'AXES Rob Beckett's Smart TV after just two series as broadcaster plans to move away from panel shows'\n-\nIs YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50\n-\nNip/Tuck star Dylan Walsh had serious medical emergency behind the wheel before crashing car with family inside, rep claims\n-\nOrlando Bloom reveals the jaw-dropping truth behind his drastic weight loss - including the only two foods he was allowed to eat and HORRIFIC side effects\n- Should Meghan ever be allowed to return to royal duties? Have your say in the Palace Confidential poll You've read the headlines and heard our experts' opinions - but what do YOU think?\n-\nLaura Woods opens up about suffering heartbreaking miscarriage and reveals how she turns to her baby Leo for comfort\n-\nLove Island's Nas Majeed and Eva Zapico spark reunion rumours as they're spotted on drinks date - two years after split\n-\nSarah Jessica Parker 'photobombs' starstruck influencer in the Hamptons\n-\nChristina Applegate reveals emotional impact her MS battle has had on daughter Sadie: 'It's broken her'\n-\nAddison Rae's VERY sexy show drives fans wild on her tour\n-\nSpin City reunion! Heather Locklear and Michael J. Fox melt hearts with sweet snap 25 years on\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nAlicia Silverstone, 48, shares shocking secret to her youthful looks after swearing off Botox and fillers\n-\nLeonardo DiCaprio, 50, takes girlfriend Vittoria Ceretti, 27, out for a romantic dinner after two years together\n-\nPedro Pascal set to REPLACE Joaquin Phoenix in gay romance film after pair's tense exchange over 'salute'\n-\nJohn Mulaney celebrates 43rd birthday at US Open in NYC with wife Olivia Munn\n-\nKhloe Kardashian has scary looking medical treatment in Mexico that is BANNED in the US\n-\nRebekah and Jamie Vardy put on a loved-up display in holiday snap and stroll along the beach at sunset with their kids on family trip\n-\nBrooks Nader makes jaw-dropping sex confession about ex Gleb Savchenko\n-\nPamela Anderson and Liam Neeson's romance faces online backlash as trolls call it fake\n-\nKim Kardashian posts shocking thirst trap snaps of her butt in VERY sheer underwear with 'curious' written on back\n-\nGemma Collins flaunts her impressive two-stone weight loss in a chic pink bikini during sun-soaked Cyprus getaway\n-\nBrooklyn Beckham can't resist making another dig at parents David and Victoria as he says there's only one thing he would return to London for\n-\nA-list actress looks unrecognizable in shocking new film role\n-\nFreddy Brazier reveals he was sectioned after struggle with addiction and manic episodes as he claims his nan Jackiey Budden got him hooked on drugs\n-\nEXCLUSIVE\nSecond series of With Love, Meghan proves a turn-off for Netflix viewers as it fails to dent the top ten in the UK or the US\n-\n1000-Lb Sisters star dead at 37: Family say they're 'completely crushed' by devastating news\n-\nFans turn on Peter Kay after they're made to take down TikTok clips of his show - as they complain about paying £150 to listen to 'random singalongs'\n-\nAndy Carroll and his girlfriend Lou Teasdale share first loved-up snaps since rekindling their romance after short-lived split as they jet off for a romantic holiday to Ibiza\n-\nTravis Kelce's dad Ed makes candid revelation about financial arrangement for wedding rehearsal with Taylor Swift\n-\nMAUREEN CALLAHAN: Meghan's latest feat of failure is basic, humorless and so nauseatingly fake. But was this 'sick burn' the moment she finally admitted defeat?\n-\nDame Helen Mirren, 80, admits she 'became a bit of an a******' in her youth because she was 'constantly underestimated' due her looks\n-\nPass the sick bag, Traylor. That was the tackiest thing I've ever seen. KENNEDY's withering take on Swift's 'promposal' (and its all too convenient timing)\n-\nDenise Richards claims ex Aaron Phypers left her Los Angeles mansion in 'disarray' as their bitter divorce saga drags on\n-\nLana Del Rey reveals challenges she has faced with her alligator tour guide husband during 1st year of marriage\n-\nOriginal Harry Potter director takes withering three-word swipe at TV reboot after looking at filming pics\n-\nDashing George Clooney looks sharp as he joins glam Jay Kelly co-star Laura Dern in Venice ahead of the Film Festival premiere after holidaying together in Lake Como\n-\nRosie Huntington-Whiteley flaunts her supermodel figure as she sizzles in yellow bikini on sun-soaked Ibiza family holiday\n-\nLiam Gallagher's 'Downton Abbey-style' Cotswolds mansion with VERY famous neighbours goes on sale for £6M\n-\nDame Emma Thompson swaps Hollywood glamour for a rustic retreat as she gives rare glimpse into holiday with daughter Gaia Wise\n-\nScott Wolf's estranged wife Kelley arrested in Utah for harassment amid divorce... as her son announces estrangement\n-\nGisele Bundchen goes bra-free with kinky boots for first major modeling job since welcoming 3rd child\n-\nLeigh-Anne Pinnock turns heads in a very risqué cut-out bodysuit with feathered wings as she enjoys Notting Hill Carnival\n-\nOlivia Attwood shares a video of VERY wild boat party where she put on a cosy display with friend Pete Wicks as bikini-clad presenter has booze poured into her mouth\n-\nJenny Eclair left 'weepy, shocked and shaken' after suffering agonising injury on This Morning set just moments before live interview\n-\nJohn Stamos enjoys family Disneyland day before celebrating Taylor Swift's engagement with Josh Gad\n-\nEXCLUSIVE\nStaggering amount Taylor Swift and Travis Kelce are set to make from their wedding... but it is not without risk\n-\n'I can't find happiness - every day is a battle': Louie Spence reveals depression and anxiety stopped him becoming a father while praising rarely-seen husband\n-\nDancing With The Stars couple marry in star-studded wedding with castmates and Oscar winners\n-\nWhere are the stars of Blue Peter now? As fledgling show attempts to relaunch for the TikTok age, how its hosts have had VERY mixed prospects\n-\nThe Repair Shop fans reduced to tears as grieving couple unearth secret message left to them by late son\n-\nTravis Kelce's dad claims Taylor Swift was getting 'antsy' about her boyfriend taking too long to pop the question as he shares exactly when sportsman proposed\n-\nTaylor Swift and Travis Kelce's engagement news sparks flurry of hilarious memes as fans brand upcoming nuptials as 'the closest thing America has to a royal wedding'\n-\nTikTok star Natasha Allen dies at 28 following five year battle with rare cancer\n-\nMeghan claims she's had to order one MILLION jam jars and lids to meet demand for her latest AsEver product drop - after previous range sold out\n-\nTravis Kelce responds to Taylor Swift 'fake relationship' conspiracies after engagement announcement\n-\nChristian Bale on heartfelt mission to build brand new $22M foster home village to keep siblings together\n-\nCourtney Stodden poses topless as she reveals the 'heavy' truth about staying sober for 43 days\n-\nTravis Kelce reveals his favorite track on Taylor Swift's new album as he gives never-before-heard details after pair's stunning engagement\n-\nAll the hidden details in Taylor Swift's engagement to Travis Kelce you may have missed - from the very special location to 'secret messages' about their romance\n-\nCoronation Street star Sue Cleaver, 61, shares a glimpse inside her fridge after her impressive three-stone weight loss - and shares her unlikely sugar fix while managing her diabetes\n-\nLoose Women's Nadia Sawalha takes VERY catty swipe at Taylor Swift's engagement ring from Travis Kelce - leaving ITV panel divided\n-\nTravis Kelce accused of cashing in on Taylor Swift engagement after unveiling new clothing line less than 24 hours later\n-\nBruce Willis' wife Emma reveals tough reality of supporting her famous husband amid his dementia battle\n-\nPeter Andre reveals his number one fear for Princess and Junior - admitting he has lost control now they're adults\n-\nDavid Hasselhoff TV show from the 1980s is getting a reboot\n-\nLil Nas X fans worry a mystery medical condition could have led to the star's public meltdown and arrest\n-\nTaylor Swift's post to Selena Gomez about finding 'real love' resurfaces after engagement news\n-\nTaylor Swift's exact engagement dress just came back in stock after selling out in 20 minutes - plus other high street lookalikes\n-\nEXCLUSIVE\nJaw-dropping photos show Hollywood's baddest boy in hiding after vile remarks saw him hounded into isolation\n-\nEXCLUSIVE\nHulk Hogan's body still awaiting cremation five weeks after death as daughter Brooke makes private visit to funeral home\n-\nKaty Perry tells court why she's fighting ailing 85-year-old veteran in multi-million pound mansion lawsuit\n-\nJailed Real Housewives of Salt Lake City star Jen Shah works up a sweat in prison after defrauding thousands\n-\nTravis Kelce the GROOM-zilla! Chiefs star has a wedding-themed Pinterest page as insiders claim it will be HIM 'taking the reins' on nuptial planning\n-\nEverything you need to know about George Clooney's new Netflix movie Jay Kelly as the A-lister and wife Amal host his surprising co-stars at their $100M villa\n-\nHeidi Klum devours an ice cream while Julia Roberts goes makeup-free as both stars arrive in Venice along with Cate Blanchett ahead of this year's Film Festival\n-\nRivals stars Aidan Turner and Nafessa Williams storm TV studios on set of Disney+ 'bonkbuster' in first look at tense season two showdown\n-\nTaylor Swift's engagement steals spotlight from Blake Lively's birthday as singer shares happy news hours after former BFF's big day\n-\nRomeo Beckham shares glum-faced black and white snaps as brother Brooklyn makes another dig amid ongoing family feud\n-\nNoomi Rapace is the epitome of chic in a backless black gown as she graces the red carpet at the Mother premiere during Venice Film Festival\n-\n'Terrifying' new Stephen King film is causing viewer heart rates to skyrocket to 'hazardous' levels\n-\nZoe Kravitz stuns in a pink mini dress at Caught Stealing afterparty - following flirty exchange with Austin Butler and kiss with Harry Styles\n-\nTravis Kelce shares what he really thinks of his fiancee Taylor Swift's new album as he names his favorite song\n-\nTaylor Swift fans fear Travis Kelce's Chiefs teammate who sparked outrage could be invited to their wedding\n-\nAlec Baldwin's controversial wife Hilaria will be joining Dancing with the Stars despite fan outrage\n-\nThe truth about Harry Styles and Zoe Kravitz: He told me exactly what he wants in a woman, says KATIE HIND. That's why I know where this is heading...\n-\nThe unusual breakfast request Princess Lilibet asks Meghan Markle for, as revealed in part two of With Love, Meghan\n-\nAll the hidden signs that hinted at Taylor Swift and Travis Kelce's engagement - from an infinity ring to a VERY subtle phone detail\n-\nI was Fred and Rose West's lodger - these are the red flags in their home I wish I hadn't ignored and the only reason I managed to survive\n-\nJason Kelce screams with joy as he finally breaks his silence on brother Travis' engagement to Taylor Swift\n-\nTaylor Swift's fiance Travis Kelce follows in the footsteps of Sydney Sweeney by working with American Eagle\n-\nBillie Faiers breaks down in tears in aftermath of two-year-old daughter Margot's seizures - and reveals the 'horrendous' impact the ordeal has had on her health\n-\nKaia Gerber shows off her model legs in a navy mini skirt and knee-high leather boots as she steps out to meet pals in LA\n-\nMadonna, 67, throws Labubu-themed party for her twins Stella and Estere's 13th birthday as pop icon's boyfriend Akeem Morris, 29, larks around on waterslides\n-\nBaffled reviewers are all saying the same thing about Meghan Markle's new Netflix series\n-\nMichael Jackson's son Prince is engaged to girlfriend of eight years as famous family reacts\n-\nMove over Love Island! Davina McCall promises 'carnage' on new dating show Stranded On Honeymoon Island - but admits there's one 'huge issue' with BBC series\n-\nIs this when Taylor and Travis will tie the knot? Career commitments hint at when they will marry - after he admitted he's happy to be 'Mr Taylor Swift'\n-\nThe truth behind Ryan Reynolds and Robert Downey Jr.'s 'feud' revealed\n-\nAll the times Meghan Markle wore tights as a working royal: Duchess complains about how she had to wear the 'inauthentic' accessory\n-\nMeghan Markle mocked over her bizarre word salads during latest interview, including phrases like 'when you anchor into your own knowing'\n-\n'I always wanted to be me when I grew up': Maya Jama shows she's content with life in new snaps as she enjoys downtime while her relationship with Ruben Dias heats up\n-\nA complete timeline of Taylor Swift and Travis Kelce's relationship\n-\nEXCLUSIVE\nSecrets behind Taylor Swift's engagement: Insiders spill all on what happened behind closed doors\n-\nThe desperate measures Blue Peter bosses have taken to capture TikTok generation - including a NON-HUMAN host and the end of live shows\n-\nTaylor Swift's cushion-cut diamond engagement ring is fast becoming Hollywood's must-have sparkler - after it was also spotted on Zendaya\n-\nThe Great British Bake Off's secret shame: How show was rejected for FIVE YEARS by TV bosses and compared to 'watching paint dry'\n-\nThe Ultra Violets announce drummer Tyler Harris has died - just weeks after performing at the Isle of Wight Festival\n-\nEXCLUSIVE\nThe Queen director Stephen Frears convicted of speeding near his £2.4million London home\n-\nGorka Marquez 'is RELIEVED to be bowing out of Strictly Come Dancing' as show faces yet another catalogue of controversies\n-\nEXCLUSIVE\nCeleb worlds collide as Danny Dyer and Pixie Lott team up with Hollywood's Eva Longoria, Billy Porter and Kunal Nayyar for A Christmas Carol reboot\n-\nOasis stars Noel and Liam Gallagher's older brother Paul arrives at court to face rape and violent sex charges\n-\nKylie Jenner flaunts her chiselled midriff in skimpy bralette as she poses up a storm in sizzling photoshoot modelling her latest Khy collection\n-\nTrue meaning behind Taylor Swift and Travis Kelce's engagement caption explained as sportsman pops the question to singer in fairytale proposal\n-\nAs Natalie Cassidy admits she only 'did it for the money', how other stars' fitness regimes were exposed as unrealistic\n-\nChannel 4 viewers have A LOT of complaints as they're 'driven bonkers' by 'biased' new social experiment show - raging 'they're all getting on my nerves!'\n-\nMeghan Markle reveals her 'late night indulgence' after she's 'puts Archie and Lili to bed'\n-\nDermot Murnaghan calls for better cancer screening as he discusses his stage four cancer diagnosis\n-\nImogen Thomas jets off to Turkey for boob reduction as she goes under the knife to feel 'body confident again' after weight loss left her breasts 'too big'\n-\nJon Kay bids farewell to BBC Breakfast co-star with sweet tribute - and confirms that her last show has already aired\n-\nConor McGregor in shocking 'bullying' video as he beats up young sparring partners, hours after claiming he is 'at peace with life' in loved-up family photo\n-\nEXCLUSIVE\nJustin Bieber and wife Hailey look stronger than ever as they hold hands in LA after overcoming marital woes\n-\nPaul Bettany and wife Jennifer Connelly look more loved-up than ever after 22 years of marriage as they enjoy a romantic dinner in New York\n-\nTaylor Swift stamps out nasty comments on engagement post... as the SNUBS and support show who is really in her circle\n-\nZoe Kravitz displays abs as she has VERY flirty exchange with Austin Butler at Caught Stealing premiere amid romance rumours\n-\nWilliam and Kate give Taylor Swift's engagement the royal seal of approval as they LIKE her announcement post\n-\nTravis Kelce painstakingly transformed his own garden into magical venue for Taylor Swift engagement photos\n-\nSo much for the 'breakup contract'! How Taylor Swift and Travis Kelce engagement news quashes wild theories they're faking it\n-\nEXCLUSIVE\nKATIE HIND: How Travis proposed to Taylor just weeks before their anniversary... and 'why he popped the question now'\n-\nTaylor Swift's ex-boyfriend reacts to her fairytale engagement with Travis Kelce\n-\nMrs. Americana Taylor Swift wears $42K engagement outfit including dress from iconic All-American brand - and Travis Kelce is styled to match\n-\nThe One Show star Lindsey Russell marries partner Fred Haig in Las Vegas after couple eloped to Nevada for no-frills wedding\n-\nTaylor Swift fans spot hidden clues in Travis Kelce engagement photos\n-\nCardi B admits to calling security guard a 'b***h' but denies slicing her face as she takes the stand in civil assault trial\n-\nJacob Elordi makes a shock admission about the Euphoria film set as cast shoot the third season after the tragic death of their co-star Angus Cloud\n-\nNip/Tuck star Dylan Walsh had open containers of this popular beverage after crashing SUV with four family members inside\n-\nAmal Clooney, 47, looks stylish in butter yellow summer dress as she arrives in Venice hand in hand with her husband George, 64\n-\nLIZ JONES: It's staged and dull... but this is what EVERY reviewer has missed about new series of With Love, Meghan\n-\nEXCLUSIVE\nThe truth about 'Saint' Peter Andre: Katie Price was 'trapped' by her fame-hungry ex, friends tell KATIE HIND\n-\nAngela Scanlon reveals 'creepy' male celebrity asked her VERY inappropriate question seconds before The One Show\n- EXCLUSIVE Love is Blind's Nicole and Ben reveal why they had to keep their marriage secret for a YEAR Keeping it quiet\n- Elizabeth Hurley, 60, reveals her inheritance plans - and her son Damian ISN'T involved in them! Unexpected plans\n-\nTaylor Swift fans convinced Travis Kelce is set to spill inside details on engagement after surprise New Heights announcement\n- How William's deepest pain has moved him to complete work Diana 'would have loved' - as royal author shares powerful similarities between the mother and son .\n- Meghan Markle reacts to Taylor Swift's engagement as it overshadows her latest As Ever launch Special announcement\n-\nEXCLUSIVE\nTaylor Swift's unusual move during engagement shoot to 'humble fan' Travis Kelce revealed by body language expert\n-\nBikini-clad Olivia Attwood and close friend Pete Wicks cosy up alongside topless reveller at raucous boat party in Formentera\n- Sarah Jessica Parker, 60, is unrecognizable as she embraces grey roots after ditching Carrie's curls for AJLT All change\n- EDEN CONFIDENTIAL: Queen's top crime writer in hunt for online crooks Detective work\n-\nKris Jenner, 69, defiantly declares 'for me, this is ageing gracefully' as she speaks out on her $100,000 facelift\n- EXCLUSIVE Eye-watering cost of Taylor Swift and Travis Kelce's floral engagement shoot revealed Pricey\n-\nJack Grealish and girlfriend Sasha Attwood 'devastated' by major update in police investigation into £1m raid on their home\n-\nOliver is 'set for a remake' after woke interpretation of Charles Dickens classic was savaged by outraged fans\n- Harry Kane embarks on new food business venture as he launches his own vegan protein bar Bold move\n-\nDownton Abbey star Elizabeth McGovern admits she is 'over' the series and confesses how she felt filming without Maggie Smith\n-\nTaylor Swift and Travis Kelce announce they are engaged after secret proposal two weeks ago as she shows off HUGE ring\n-\nEmma Willis and husband Matt look closer than ever after 17 years of marriage as they attend Love Is Blind screening\n- Lisa Snowdon puts on a VERY busty display in a skimpy crochet bikini during sun-soaked trip to Ibiza Racy\n-\nThe contents of Prince Christian's lunchbox might surprise you - but it's also one of mum Queen Mary's staples\n- EastEnders bosses 'plan new spin-off inspired by shocking Netflix drama Adolescence' Looking ahead\n- Kim Kardashian lets fans know what her current clothing SIZE is while modeling see-through SKIMS Revelation\n- CHRISTOPHER STEVENS: These jurors leap to conclusions before the kettle's even boiled... Innocent till proven guilty\nMORE DON'T MISS\n- Travis Kelce's ex-girlfriend Kayla Nicole shares her own family news on the day NFL star gets engaged New development\n-\nTravis Kelce's dad Ed reveals secret details about his engagement to Taylor Swift and how family pushed star for weeks to propose\n- Yellowstone cast reunion as THREE of the show's stars join heartthrob Luke Grimes for his spinoff Getting involved\n- Sabrina Carpenter's very different look from the past goes viral The singer looks unrecognisable in old photos\n- Hidden clues that Taylor Swift masterminded her entire engagement announcement Cryptic\n- Rudimental to release 'lost tapes' of collaborations with two major BRIT Award winning stars Exciting news\n-\nTravis Kelce's relationship history: A look at the NFL star's dating life after proposing to Taylor Swift\n- Netflix faces boycott in Australia after sixth price hike since 2015 Customers have vowed to ditch the popular streaming service\n- Travis Kelce spotted for the first time since Taylor Swift announced the couple are finally engaged Big news\n-\nEXCLUSIVE\nWill Taylor Swift get a pre-nup? Star has 'much to protect' in $1.6billion fortune as she gets engaged\n- Blake Lively fails to react to Taylor Swift's engagement news as her celebrity pals send love Curiously silent\n-\nAimee Lou Wood reveals her keepsake from The White Lotus as she models the same red ruffled bikini worn by Chelsea on hit show\n- Travis Kelce's strong hint over wedding date to Taylor Swift on New Heights podcast Confirmed their engagement on Tuesday\n- Bruce Willis' wife reveals subtle symptom that predicted horror dementia diagnosis The actor is battling frontotemporal dementia\n-\nTaylor Swift's relationship history: The singer's trail of A-list exes and where they are now as she reveals fairytale proposal\n- Margot Robbie is upstaged by her crying 10-month-old son during interview: 'That's my baby!' Awkward\n- Taylor Swift's ex Joe Alwyn starts trending on X amid Travis Kelce engagement: 'Paper rings? Never!' Former boyfriend\n-\nMeghan Markle finally reveals her real legal name - after controversy surrounding 'Sussex' surname\n- ITV legend and Grumpy Old Men creator Stuart Prebble passes away aged 74 after cancer battle Sad news\n- Eagle-eyed Taylor Swift fans spot 'secret' detail in engagement ring after Travis Kelce proposal Stunning\n-\nTaylor Swift fans go into meltdown over Travis Kelce engagement as star debuts stunning ring: 'I am crying!'\n-\nColeen Rooney sports her denim as the WAG and Lisa Snowdon join the stars to supporting Jeans for Genes 30th anniversary\n-\nShirley Ballas, 64, shows off her age-defying figure in a stylish bikini as she poses poolside at a Portuguese retreat\n- Country star's wife defied doctors orders to 'pull the plug' after her husband's stroke Believed he would make it through\n- Odds on Taylor Swift headlining Super Bowl halftime show surge after Travis Kelce engagement All bets are off\n-\nPatrick and Brittany Mahomes react to Travis Kelce and Taylor Swift's engagement with heartfelt tribute\n- EXCLUSIVE All the details about Taylor Swift's stunning diamond engagement ring from Travis Kelce Stunning\n-\nSophie Kasaei reveals she had a chemical pregnancy during fertility struggle with boyfriend Jordan Brook\n-\nHow Taylor Swift's most famous song lyrics were echoed in her engagement shoot photos with Travis Kelce\n-\nNew Bond odds puts surprise choice back as frontrunner as 'punters' clear favourite' is revealed\n- Taylor Swift and Travis Kelce break the internet as engagement post shatters records Massive news\n-\nEXCLUSIVE\nEllen DeGeneres bullying scandal explodes with disgraceful claims of monstrous behavior, petty demands\n-\nWho will be Taylor Swift's bridesmaids? The lucky few who will make the cut... and the stars that may be excluded\n- City of Cleveland wins the Taylor Swift engagement coverage with hilarious 'local man' post Funny\n- Hilary Duff, 37, looks slender in a low-cut pink swimsuit thanks to 'mindful eating'... after welcoming 4th child Toned and trim\n-\nVictoria's Secret Angel Stella Maxwell goes topless as she strips down to a thong and heels for steamy photoshoot in Greece\n-\nAstonished Chiefs star Mike Danna learns Taylor Swift and Travis Kelce are engaged at press conference\n- Beverly Hills, 90210 vet Jennie Garth reveals she was mistakenly told she was PREGNANT when she was teen Unexpected\n- Scarlett Johansson latest PDA with her pal Jonathan Bailey divides fans: 'Colin Jost how you feelin?' Close pals\n- Robbie Williams sued by co-writer of smash hit Angels after earning just £7,500 from song Ray Heffernan will fight the British singer\n-\nPregnant Bianca Wallace posts warning after accusing husband Ioan Gruffudd's ex Alice Evans of inventing 'vile' affair story\n-\nNorth West, The Icon! Kim Kardashian's blue-haired daughter, 12, dons another edgy ensemble in double denim\n- Pink Floyd star David Gilmour ordered to tear down garden shed after planning row with neighbours Bitter feud\n- Lil Nas X breaks his silence following 'terrifying' stint in jail after nude public meltdown Speaking out\n- Pete Davidson's pregnant girlfriend Elsie Hewitt flashes cleavage in bikini as she teases shaving her head Hard to miss\n- Taylor Swift and Travis Kelce set new world record through star's New Heights appearance Popular\n- Bruce Willis' wife Emma gives rare positive update on her husband amid dementia battle Sharing the news\n-\nConor McGregor kisses Dee Devlin as they put on a united front during romantic dinner in Italy following 'cheating' scandal\n- Victoria's Secret vet Sara Sampaio stuns in a string bikini while enjoying a beach vacation in Italy Looking good\n-\nMadison Beer is seen again with football star 'boyfriend' Justin Herbert after they were spied at a music video shoot\n- Kristin Cavallari reveals disturbing details of 'brutal' birth that left doctors fearing for her child's life Worrying\n-\nZoe steals Harry's Style! Kravitz copies 1D star's oversized shirt and sharp suit as she arrives at CBS in New York\n-\nCrown Princess Mette-Marit of Norway appears strained in first public appearance since son was charged with rape\n-\nLily Allen fans unearth throwback clip of singer appearing on TV aged 12 and making bizarre Glastonbury claim\n-\nAmanda Owen sparks concern with appearance in latest video from farm - as worried fans fret 'I really hope you're okay'\n-\nVictoria's Secret casts hyper sexy Candice Swanepoel in their ads... two years after going woke crashed sales\n- Netflix fans devastated as crime thriller dubbed 'the new Ozark' canceled Just two months after the show's release\n-\nLiam Gallagher jokes he 'did nothing but stare out the window at school' as he gives kids career advice in resurfaced clip\n-\nHarry Styles finally meets his match with well connected Zoe Kravitz: The surprising truth about how they met\n-\nEXCLUSIVE\nBilly Ray Cyrus' sweet gesture to girlfriend Elizabeth after star posts a gushing birthday tribute to singer\n-\nI made £31k in a month after snapping up a three-bedroom home valued at just £40k at auction - here's how I pulled it off\n-\nShe was married to film icon but is now a major TV star thanks to breakout role - can you guess who?\n-\nAriela La Langosta's death at age 33 is being investigated as a 'targeted' murder after she was shot in her car\n-\nNew Netflix rom-com hailed as a 'roller coaster ride' rockets up the charts just days after release - as fans gush 'there's not a single dull moment'\n-\nEXCLUSIVE\nStacey Solomon QUITS Loose Women after 13 years amid ITV's daytime telly bloodbath with heavy budget cuts and job losses\n-\nHarry Styles' Pleasing beauty line is flying off the shelves - here are 10 items you need to grab before they sell out\n-\nCindy Crawford's daughter Kaia Gerber says Gisele Bundchen and Kate Moss 'inspired' her new collaboration\n-\nBrooks Nader has legs for days in denim mini dress as she joins sisters at Good Morning America before reality show debut\n-\nI bought shapewear from TikTok shop to wear to a baby shower - the horrors that came next left me hospitalised, scarred for life and unable to walk\n-\nToni Terry flaunts her toned figure in an array of skimpy bikinis as she puts on a loved up display with husband John in Italy\n-\nNineties singer looks unrecognisable as she shares glowing selfie - but do YOU recognise her?\n-\nEx-Mouseketeer Nikki DeLoach reveals crisis of faith as Britney Spears and Justin Timberlake soared to fame\n-\nSheree Murphy looks radiant as she celebrates turning 50 with dozens of balloons and flowers from her husband Harry Kewell and their four children\n-\nCoco Austin accidentally shows off something VERY unusual when debuting daughter Chanel's blue hair\n-\nFirst SNL star is brutally axed just days after a cast shake-up was teased as comedian slams show as 'toxic'\n-\nLana Del Rey reveals husband Jeremy Dufrene's comforting promise that made her fall in love 'immediately'\n-\nWill Mellor celebrates his 18th wedding anniversary to stunning wife Michelle McSween with slew of romantic snaps\n-\nBig Brother star shocks fans by revealing she's now a TRUCK driver - 10 years on from controversial appearance on show\n- Thomas Rhett and his wife Lauren are expecting their FIFTH child: 'Here we go again!' Happy news\n-\nThe Fresh Prince of Scarborough! How Will Smith chose an unlikely seaside town to relaunch his flagging career\n-\nIsabel Webster reveals truth behind GB News co-star Eamonn Holmes' health woes - blaming habit that's 'tough on the body'\n-\nMel B shares a hilarious clip of her iconic Spice Girls track playing during a visit to the nail salon (but the staff fail to recognise her!)\n-\nCharlotte Crosby's fiancé Jake Ankers furiously rants at 'obsessed fan' who turned up at their home after burglary\n-\nFurious locals blast ITV drama Grantchester for ruining their village with 'embarrassing' fake wisteria\n-\nCindy Crawford, 59, posts rare photo with her sisters during family gathering, see how they compare\n-\nHilary Duff shows off her incredible postpartum figure on rare sighting with fourth child amid pop comeback plans\n-\nHailey Bieber fans go wild over her bra-free look as she poses by her Beverly Hills swimming pool\n-\n'Like a Montecito Marie Antoinette': Critics deliver soul-crushing reviews of Meghan Markle's Netflix season 2\n-\nJennifer Lopez celebrates child Emme's first day of senior year with Nobu Malibu meal\n-\nTom Brady sends message to ex Bridget Moynahan on parenting... weeks after shot at Gisele Bundchen\n-\nKelly Osbourne hits out at WWE star Becky Lynch after insensitive joke about father Ozzy during wrestling event in Birmingham\n-\nEXCLUSIVE\nThe secrets behind Donatella Versace's face: Expert reveals how the fashion mogul, 70, has reversed her 'cosmetic procedures'\n-\nEXCLUSIVE\nSkins star Megan Prescott reveals working as a stripper inspired her new one-woman show that sees her perform naked\n-\nThe Chase's Anne Hegerty finally sets the record straight after being accused of having a 'secret husband' kept out of the spotlight\n-\nHarrison Ford, 83, makes rare remarks about what makes his marriage to Calista Flockhart, 60, work adding 'old people can love too'\n-\nEx-Blue Peter presenter Katy Hill reveals a BBC producer told her she was fat - despite only being a size 12\n-\nLondon's Burning and Grange Hill star John Alford 'had sexual activity with two underage girls', court hears\n-\nUlrika Jonsson criticises Serena Williams for 'forcing feminism back several steps' by promoting skinny jabs\n-\nDua Lipa shares selfie with fiancé Callum Turner before showing off her abs as she continues to celebrate her 30th birthday\n-\nRachel Bilson goes makeup free on her 44th birthday... 22 years after The OC debuted\n-\nPerrie Edwards dazzles fans in sexy two-piece bikini as body confident singer proudly shows off her stomach scar\n-\nClarkson's Farm star Harriet Cowan looks glam before getting her hands dirty as she reveals she's given up nursing job\n-\nVanessa Feltz breaks her silence on ex-fiance Ben Ofoedu's wedding to 'Vanessa 2.0' as she claims 'I never want to see him again'\n-\nEXCLUSIVE\nHarry Styles is raking in £12 million a year by selling sex toys (with some of his products still sold out!) as singer is spotted 'kissing' Zoe Kravitz\n-\nQueen Mary of Denmark joins her husband to greet beaming crowds on their summer tour\n-\nWhere are the cast of Love Is Blind UK's first series now and which Netflix couples are still together?\n-\nMeghan Markle shows off £236,000 of jewellery in new Netflix show as she prepares biscuits wearing Diana's watch, her £120k engagement ring\n-\nPrincess Andre breaks silence on ITV commissioning second series of her reality show despite it sparking vicious row\n-\nVanessa Feltz has the last laugh after ditching This Morning for her own daytime show amid drastic ITV cuts\n- Holly Hagan displays her sunburnt chest and pokes fun at coming a long way from her Geordie Shore days Banter\n-\nEXCLUSIVE\nJoshua Jackson joins celebrity dating app Raya after being linked to Bridgerton star Simone Ashley\n-\nNewest member of the Royal Family joins Kate Middleton and Prince William to undergo 'Balmoral test'\n-\nEXCLUSIVE\nAccusations of rape and cocaine 'abuse' are threatening to ruin Strictly. This is the very angry star behind the claims: KATIE HIND\n-\nJoey Essex shows off his rock-hard abs in shirtless boxing snaps just days ahead of his professional debut against influencer Numeiro\n-\nMeghan Markle moans she 'had to wear tights all the time' during her time as a working royal - despite breaking protocol with bare-legged public displays\n-\nPerrie Edwards reveals why she went public with two heartbreaking miscarriages in emotional Lorraine interview\n-\nFormer Love Island star is jailed after putting man in hospital with savage attack over Sainsbury's parking space\n-\nMy Hannibal Lecter was the best, says Brian Cox: EPHRAIM HARDCASTLE\n-\nRichard Madeley branded an 'absolute hypocrite' for 'delusional and embarrassing' comments during Good Morning Britain shoplifting debate\n-\nMeghan Markle reveals who said 'I love you' first out of her and Harry, says she 'doesn't like baking' and reveals her love for McDonald's\n-\nWatch heart-wrenching moment Olivia Hawkins breaks down in tears after BRUTAL rejection on Celebs Go Dating\n-\nJennifer Lopez looks effortlessly chic as she poses up a storm in designer clothing during Hamptons bike ride with child Emme\n-\nPeter Andre and Katie Price's toxic relationship: How the singer branded his ex 'a f*****g idiot' and blamed her for his mishaps\n-\nEXCLUSIVE\nTaylor Swift's inner circle: The five people who have heard her new album... and the secrets they've been trusted with\n-\nInside the battle for The Police's millions: How Sting's 'big ego' has caused chaos with his bandmates\n-\nWe've found a £120 version of Meghan's £2,320 As Ever floral dress and it looks just as chic\n-\nEXCLUSIVE\nTriumphant Victoria Beckham sells one of her £32 eyeliners every 30 seconds as she celebrates huge profits for her fashion empire amid family feud\n-\nEverything the Duchess of Sussex has shared about her children in season two of With Love, Meghan - from Archie and Lilibet's hybrid accent to their trendy breakfasts\n-\nMeghan appears to take another swipe at the royal family and says 'she couldn't be vocal several years ago'... but dodges questions about politics minutes later\n-\nAdam Frisby reveals horrific homophobic abuse he and fiancé Jamie have had calling them 'child abusers and sex traffickers' after sharing surrogacy news\n-\nAward-winning sitcom slapped with trigger warning for 'discriminatory language' - despite show creator and lead star launching passionate defence of series\n-\nRevealed: How much Meghan Markle's Netflix wardrobe is worth as she pairs designer dresses with lavish jewellery including £56k pinky ring\n-\nBilly Ray Cyrus reveals bizarre new hairstyle in smitten snaps shared by Elizabeth Hurley... 30 years after rocking his Achy Breaky Heart mullet\n-\nTOWIE bloodbath as FIVE stars break down in tears after vicious row - with one storming out of hotel during holiday from hell\n-\nLiam and Noel Gallagher already raking in millions the year before lucrative tour - brothers are predicted to earn up to £400M from Oasis reunion\n- Jelena Ostapenko explodes after US Open upset loss as victorious Taylor Townsend reveals what was said\n- From Catholic student to lunatic transgender assassin: As praying children are slaughtered, America is left...\n- 'I had to collect my dead baby at 3am - she was laid on a sofa': Second horrified mother speaks out after...\n- Molly Mae's desperate secret you don't find out about: She says she's 'open and honest' about motherhood. No...\n- Even as my brother lay in a coma my mother and I couldn't stop fighting. I ache for her love... but I can't...\n- Rachel Reeves 'plots tax raid on landlords by applying National Insurance to rental income' as Chancellor...\n- Rylan Clark says it is 'absolutely insane' that illegal migrants are put up in four-star hotels - as he...\n- The ultimate guide to the bedding that will give you the perfect night's sleep, revealed by impartial...\n- MAUREEN CALLAHAN: Meghan's latest feat of failure is basic, humorless and so nauseatingly fake. But was this...\n- What Travis Kelce did on his second date with Taylor Swift proved he was nothing like her ex Joe Alwyn, says...\n- France faces Liz Truss-style budget 'catastrophe', PM warns as pressure piles on Emmanuel Macron amid...\n- Bitter Meghan's 'fuming' over public's love of Kate says friend... and she doesn't stop there: EDEN...\n- 1000-Lb Sisters star dead at 37: Tammy and Amy Slaton's cousin Katie passes away leaving family 'crushed'\n- The ten WORST politicians in Britain... by DAN HODGES who isn't afraid of upsetting anyone. Yes they'll be...\n- Bruce Willis' wife reveals dementia-stricken actor is living separately from her and their young daughters\n- A decade after throwing open its borders to millions of migrants, Germany is now proof Farage's deportation...\n- Revealed: The truth about the 'migrant' who a Dundee schoolgirl brandished a knife at... and how wrong...\n- ISIS Beatle 'Jihadi Ringo' who was part of a gang that filmed the killings of hostages makes a bid to return...\n- Someone broke in and ransacked my house. Then I discovered the disgusting thing they left in my desk: JENNI...\n- Disgusting final plea made by Minnesota school shooter in suicide note before slaughtering two children at...\n- People left scratching their head over viral maths problem for child - so can YOU solve it?\n- Meghan Trainor looks thinner than ever at LA premiere after weight loss drug reveal and breast augmentation\n- Prince Harry will return to London on the anniversary of Queen Elizabeth II's death to attend charity awards\n- PETER HITCHENS: You're about to be BANNED from talking about Lucy Letby. It must not happen\n- Brooklyn Beckham takes inspiration from his new pal Meghan Markle by making JAM in his latest cookery video...\n- I'm a female solo traveller - here's what no one warned me about Japan\n- Cops raid Nazi heiress's home to seize masterpiece stolen by her dad...but are shocked to see what was...\n- How two best friends are fighting horrifying injuries after being hit by a speeding taxi in Ibiza - and the...\n- Keir Starmer is set to replace a THIRD senior staff member in less than a year as PM's top official is...\n- The Chase fans reduced to tears after learning contestant who landed £100k jackpot never got to spend his...\n- Taxi driver's heart-stopping close call as he suddenly slams on the brakes after spotting elderly woman...\n- Britain has the most illegal migrants in Europe: How the country is lagging behind Continental neighbours in...\n- LEO MCKINSTRY: Drive through the Dordogne that made me realise France, which is making all the same mistakes...\n- Khloé Kardashian's ex French Montana is engaged to a ROYAL Princess\n- ED Miliband's Net Zero 'lunacy' is blamed for YOUR energy bill hike... after Ofgem confirms wind farms drive...\n- Anne Hathaway suffers EPIC tumble in her heels while filming Devil Wears Prada sequel\n- QUENTIN LETTS: Starmer's so dull-witted and obdurate he reminds me of those male drivers who refuse...\n- Everyone's seen the video of the terrified British schoolgirl who seems to be brandishing a knife and axe....\n- Andy Carroll puts on a united display with his bikini-clad girlfriend Lou Teasdale as they enjoy romantic...\n- Hollyoaks star looks unrecognisable as she lands sex worker role in steamy period drama - but can YOU guess...\n- Stunning detached five-bedroom home hits the market for £650,000 - but people are left spooked by eerie...\n- Davina McCall's hairdresser-turned-boyfriend Michael Douglas admits he finds her 'annoying' since brain...\n- The 100 best state schools in Britain: Experts reveal where to get the top taxpayer-funded education in...\n- The Made In Chelsea star who went on the run with her £80 MILLION art fraudster boyfriend: Couple played...\n- Kim Kardashian puts on a leggy display in lace tights as she joins her daughter North West for shopping in...\n- Why pub-goers wearing England flags were turned away from a Birmingham boozer - and who the brave woman was...\n- MSNBC's Jen Psaki breaks down into tears while addressing Minnesota school shooting\n- Two men accused of torturing and humiliating French streamer Jean Pormanove come together... at his funeral\n- Possible autism breakthrough as 40 per cent of children with autism found to be lacking key nutrient\n- Meghan's many names: The truth behind the Duchess of Sussex real moniker\n- Drunk woman who sexually assaulted man at upscale restaurant as he celebrated getting a cancer all-clear with his wife is spared jail\n- Minneapolis Catholic school shooter shot FOURTEEN children including youngsters aged 8 and 10 murdered as they sat in church pews\n- Minneapolis school shooter Robin Westman revealed as transgender and anti-Trump as Democrats call for shooting to be de-politicized\n- From Catholic student to lunatic transgender assassin: As praying children are slaughtered, America is left looking for clues\n- Riots erupt in Swiss city after migrant teen is killed in scooter crash while fleeing police\n- Terry Wogan's son hits out at Rachel Reeves after being unable to sell his parents' £3.75million mansion\n- Minneapolis school shooter Robin Westman's former GOP lawmaker uncle who defended transgender rights says he wishes killer 'shot me instead:' Live updates\n- Bodybuilder 'Purple Aki' who was jailed for harassing well-muscled males and banned from grabbing men's biceps for 10 years is found dead in flat\n- British grandmother stranded in Turkish hospital is warned complete paralysis is 'best case scenario' after brain tumour deteriorated during family holiday\n- Robin Westman named as Minneapolis Catholic school shooter as chilling videos plotting attack are revealed\n- Revealed: The truth about the 'migrant' who a Dundee schoolgirl brandished a knife at... and how wrong rabble rousers Elon Musk and Tommy Robinson were\n- I was so caught up in my wife's sickness I naively asked ChatGPT if my sore throat could be cancer... now I have five years to live\n- Revealed: Girl, 17, stabbed to death by migrant in Netherlands was highly intelligent, middle-class student - as detectives admit they DON'T KNOW the identity of the suspect they have in custody\n- Costa del solitude: Videos show empty-looking beach and deserted bars on normally-bustling Benidorm strip as tourists describe 'ghost town'\n- The 100 best state schools in Britain: Experts reveal where to get the top taxpayer-funded education in every part of the UK. Did yours make the list?\n- A decade after throwing open its borders to millions of migrants, Germany is now proof Farage's deportation flights pledge can work, writes SUE REID\n- Funeral director accused of keeping dead babies bodies in her 'mucky' living room defends herself and insists she treated every infant 'with love and care'\n- Derelict 'jungle' home left covered by vines after being 'eaten' by nature finally sells for £188,000 - but new owner has a VERY difficult problem to solve\n- Tommy Robinson will not be charged over St Pancras 'assault' as prosecutors 'don't think there is a realistic chance of conviction'\n- Why pub-goers wearing England flags were turned away from a Birmingham boozer - and who the brave woman was that confronted them\n- Groom, 23, is shot dead 'by sister-in-law' on his wedding day in latest celebratory gunfire tragedy in Turkey\n- Stormzy scholar, 23, found dead in Cambridge University halls after taking antidepressants, inquest hears\n- Father of Cambridge graduate, 23, who died after refusing chemotherapy on her anti-vaxxer mother's advice blames 'members of her family' for her death, inquest hears\n- Horrifying moment YouTuber, 22, is swept away in waterfall after wading into a raging river to pose for a drone video\n- Bitter Meghan's 'fuming' over public's love of Kate says friend... and she doesn't stop there: EDEN CONFIDENTIAL reveals all\n- Epping hotel migrant tells court 'I'm not a wild animal' as he denies sexually assaulting schoolgirl - as moment police arrest him is released\n- Dermot Murnaghan calls for better cancer screening as he discusses his stage four cancer diagnosis\n- How two best friends are fighting horrifying injuries after being hit by a speeding taxi in Ibiza - and the fight to get them home to their children\n- I tried to sell my Victorian mansion for £1 but no one wanted it - now I move out every weekend to rent it to strangers just to cover the cost\n- More reviewers savage Meghan Markle's second helping of her Netflix cooking show - calling series two 'confounding' and 'ghastly, tedious dreck'\n- Cops raid Nazi heiress's home to seize masterpiece stolen by her dad...but are shocked to see what was hanging on wall\n- Second series of With Love, Meghan proves a turn-off for Netflix viewers as it fails to dent the top ten in the UK or the US\n- Meghan Markle mocked over her bizarre word salads during latest interview, including phrases like 'when you anchor into your own knowing'\n- Disgusting final plea made by Minnesota school shooter in suicide note before slaughtering two children at mass\n- Pictured: Homeless man who battered 'kind' woman, 36, to death with a mallet just days after taking him into her £1.3million flat\n- 'Purple Aki'll get ya!' The sinister and DEADLY truth behind the playground rumours about notorious bodybuilding bogeyman who roamed northern streets grabbing teen boys' muscles\n- Father of three who 'lived life to the full' plunged to his death in tragedy on notorious Welsh mountain ridge\n- ED Miliband's Net Zero 'lunacy' is blamed for YOUR energy bill hike... after Ofgem confirms wind farms drive cost up\n- MOST READ IN DETAIL\nEDITOR'S SIX OF THE BEST\n-\nJAN MOIR: Four mothers who epitomise everything that's awful about Britain\n-\nEPHRAIM HARDCASTLE: The zipless dress once considered 'risque'... that has proved a hit thanks to the Duchess of Cambridge\n-\nDAILY MAIL COMMENT: Co-op, Labour and a betrayal of values\n-\nTOM UTLEY: At last, a genuine medical condition that explains why I never listen to a word my wife says\n-\nRICHARD LITTLEJOHN: Life's too short to measure a goldfish\n-\nPress the panic button... Lucifer's legged it: The Mail's theatre critic is directing his village's Easter play. So why has the Devil disappeared and did the Bible really feature green underpants"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-14996125/andy-carroll-split-lou-teasdale-dumped-ex-premier-league-star.html",
      "text": "Lou Teasdale says SHE dumped Andy Carroll and claims he flew by private jet to Ibiza for embarrassing bid to win her back\n- Do YOU have a story? Email tips@dailymail.com\nLou Teasdale's friends have hit back at suggestions that Andy Carroll broke up with her due to her high maintenance behaviour - and claim that she dumped him, the Daily Mail can reveal.\nSources close to former Premier League star Andy, 36, said he ended the year-long romance with influencer Lou, 41, this week after growing tired of her following a string of booze-fuelled rows.\nBut now furious pals have claimed that Andy was so desperate to save the relationship, he chartered a private jet to race to Ibiza yesterday in a last-ditch attempt to win her round.\nThe extraordinary intervention came just hours after news emerged the couple had split after 12 months of dating.\nA source told the Daily Mail: 'It was Lou who ended her relationship with Andy, she walked away a few days ago, it was very much her choice to end their romance.\n'She isn't interested in pointing the finger or blaming him and hoped to deal with their split in private, before he blocked her on Instagram and deleted their photos together.\nLou Teasdale has hit back at suggestions that Andy Carroll broke up with her after becoming fed up with her high maintenance behaviour - and claims that she dumped him\nSources close to former Premier League star Andy said he ended the year-long romance with influencer Lou this week after becoming tired of her following a string of booze-fuelled rows\nNow friends of the influencer have claimed that Andy was so desperate to save the relationship that he chartered a private jet to race to Ibiza yesterday in a last-ditch attempt to win her round\n'Lou is very upset by how everything has played out and the arguments between them were especially difficult for her to go through.\n'However Andy wants Lou back and flew to Ibiza via private jet on Tuesday just to find her, even though he has no idea where she's staying.\n'He will think it's a romantic gesture, but for Lou she's unimpressed and just wants to be away with her family, she's not interested in any of his attempts at a reconciliation.\n'All she has done all year is love and support Andy, her feelings haven't gone away, but Lou has to protect herself now and ending the relationship is the only way to move forward.'\nWhile Andy has removed all trace of Lou from his Instagram, the celebrity make-up artist still has a string of images featuring the footballer which demonstrates how close their relationship was on her profile.\nAndy's romance with Lou appeared to be on the rocks eight weeks ago, when the father-of-five was questioned by police in Mykonos over drunken rows they had.\nThe footballer wasn't arrested and no further action was taken with the couple continuing their romance, celebrating their one-year anniversary by attending Glastonbury festival.\nThis summer, the pair has enjoyed multiple holidays together and have gone to see Oasis on tour, and only three weeks ago Andy commented on one of Lou's Instagram posts saying how lucky he was to be with her.\nWhile Andy has removed all trace of Lou from Instagram, the makeup artist still has a string of images featuring the footballer, demonstrating how close their relationship was, on her profile\nA source told the Daily Mail: 'Lou is very upset by how everything has played out and the arguments between them were especially difficult for her to go through'\nAndy and Lou started dating last year after the ex-Liverpool and Newcastle player separated from his wife, Towie's Billi Mucklow, with whom he has three children\nAndy and Lou started dating last year after the ex-Liverpool and Newcastle player separated from his wife, Towie's Billi Mucklow, 37, with whom he has three children.\nReality star Billi is currently holidaying in Mallorca with her family and on Tuesday posted an image of her wearing a bikini by the pool, prompting praise from her former Towie co-stars.\nAndy married Billi in June 2022 as their children Arlo, Wolf, and Marvel watched on but the couple announced their separation two years later.\nIn May 2022, Andy, who also has two children from a previous relationship, was pictured 'passed out' between not one, but two blonde women during his Dubai stag do, causing upset and distress for Billi.\nThe pair's Hampshire wedding went ahead after the reality star forgave Andy and the sportsman later shared the date he and his wife committed to each other online alongside photos from their happy day.\nBut by July 2024, Andy announced he and Billi had split, stating, 'Billi and I have privately separated earlier this year and we are under way with our divorce proceedings.'\nIn April, Andy had teased that he was ready to settle down with Lou by referring to her as his 'wifey' on Instagram, as sources revealed that he was keen to remarry.\nLou Teasdale declined to comment when approached by the Daily Mail."
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/billi-mucklow/index.html",
      "text": "Advertisement\nBilli Mucklow - Latest news, views, gossip, photos and video\nPage\nAndy Carroll and his girlfriend Lou Teasdale share first loved-up snaps since rekindling their romance after short-lived split as they jet off for a romantic holiday to Ibiza\n27/08/25 15:38\nAndy Carroll and his girlfriend Lou Teasdale have proven their short-lived split is well and truly behind them as they posed for their first snaps together since rekindling their romance. The couple split earlier this month after a series of rows, with initial reports claiming the footballer, 36, dumped the make-up artist, 41, after growing fed up with her high maintenance behaviour. However, Daily Mail exclusively revealed it was in fact Lou who called off the relationship, and just four days later, Andy revealed they've decided to give their relationship another go....read\nBilli Mucklow has the 'best summer yet' during family holiday after ex-husband Andy Carroll's relationship drama with Lou Teasdale\n19/08/25 16:53Sharing a series of photos to Instagram on Tuesday, the former TV personality, 37, was in high spirits as she enjoyed some time away with her mum and her children.Ulrika Jonsson hits out at Andy Carroll for 'gallivanting across the Mediterranean' with Lou Teasdale while his ex Billi Mucklow 'chooses to put their children first'\n19/08/25 08:49Billi and Andy have three children together - Arlo, Wolf, and Marvel Mae - and she also raises his two children Emilie Rose, 15, and Lucas, 14 from his past relationship.Andy Carroll shares a snap from cosy date night with girlfriend Lou Teasdale after confirming they've rekindled their romance following brief split\n18/08/25 19:39The couple split this this week after a series of rows, with initial reports claiming the footballer, 36, dumped the make-up artist, 41, after becoming fed up with her high maintenance behaviour.Billi Mucklow shows off her revenge body in carefree bikini snaps amid ex-husband Andy Carroll's relationship drama with Lou Teasdale\n17/08/25 18:52Billi Mucklow looked as though she didn't have a care in the world as she shared stunning new bikini snaps on Instagram on Sunday.Billi Mucklow brushes aside ex Andy Carroll's split drama with girlfriend Lou Teasdale as she enjoys a quiet holiday with their kids in Spain\n15/08/25 10:07Billi Mucklow has shared a glimpse of her quiet holiday in Spain with her and ex Andy Carroll's kids amid the footballer's split from girlfriend Lou Teasdale.Billi Mucklow shows off her sensational revenge body in bikini on family holiday - as her ex Andy Carroll 'is dumped girlfriend Lou Teasdale'\n13/08/25 07:45Billi Mucklow showed off her revenge body in a brown bikini on a family holiday on Tuesday - on the same day her ex Andy Carroll reportedly dumped his girlfriend Lou Teasdale.Billi Mucklow shows ex Andy Carroll what he's missing as she poses in a pink Hunza G bikini during Spanish getaway\n31/07/25 16:29Billi Mucklow showed ex-Andy Carroll what he's missing as she shared a sultry bikini snap on Instagram on Thursday.Billi Mucklow thanks friend for babysitting her kids so she could enjoy rare weekend away... after ex Andy Carroll made major decision about his family's future\n24/06/25 11:09The former TOWIE star has been busy looking after the five children she shares with estranged husband Andy Carroll.Billi Mucklow shows off her revenge body in a blue bikini - after her ex Andy Carroll was 'questioned by police over bust-ups with girlfriend Lou Teasdale'\n23/06/25 08:42Billi Mucklow looked sensational in a blue swimsuit and stylish holiday snaps this weekend - after her ex Andy Carroll was reportedly questioned by police.Billi Mucklow shows ex Andy Carroll what he's missing as she sizzles in stylish bikinis while soaking up the sun in Mallorca\n20/06/25 16:19The TOWIE star has flaunted her incredible figure in a series of scorching bikini snaps posted to Instagram while on holiday in Mallorca.Andy Carroll and Billi Mucklow 'sell their sprawling Essex mansion for huge seven-figure sum' - eight months after filing for divorce\n10/06/25 20:16The ex-Liverpool striker, 36, and his former TOWIE star ex Billi, 37, confirmed their split last September after secretly separating earlier in the year after being together for 11 years.'Tensions between Andy Carroll and ex Billi Mucklow are set to explode' as he shares holiday snaps with girlfriend Lou Teasdale while she's at home with their children\n07/06/25 19:14The ex-Liverpool striker, 36, and his former TOWIE star ex Billi, 36, confirmed their split last September after secretly separating earlier in the year after being together for 11 years.Lou Teasdale and Andy Carroll look smitten as they soak up the sun on holiday amid married footballer's 'plans to propose'\n30/04/25 15:48Bikini-clad Lou Teasdale and her boyfriend Andy Carroll looked smitten as they posed for an Instagram snap on holiday in Magaluf, Mallorca on Tuesday.Bikini-clad Lou Teasdale cosies up to boyfriend Andy Carroll during romantic getaway after it was revealed the married footballer 'plans to tie the knot' with his new lover\n22/04/25 09:13The hairstylist, 41, and footballer, 36, are currently living it up in Magaluf, Mallorca, as they took their mind off Andy's attempts to separate from his wife Billi Mucklow .Married Andy Carroll shares steamy kiss with girlfriend Lou Teasdale in racy snaps after he revealed 'divorce from wife Billi Mucklow can't come soon enough and plans to tie the knot' with his new lover\n16/04/25 15:48The footballer, 36, joined his hair stylist partner, 41, on a lilo in a pool in Bordeaux on Wednesday as they took their mind off Andy's attempts to separate from his wife Billi.Married Andy Carroll 'plans to tie the knot with girlfriend Lou Teasdale after five months of dating' as he tells friends his divorce from wife Billi Mucklow 'can't come soon enough'\n07/04/25 11:22Andy Carroll is planning to propose to girlfriend of five months Lou Teasdale despite still being married to estranged wife Billi Mucklow.Billi Mucklow removes tattoo of ex-husband Andy Carroll's initials on her ribs - five months after confirming they are set to divorce\n14/03/25 10:56Billi Mucklow has revealed she's getting the tattoo of ex-husband Andy Carroll's initials removed on her rib - five months after confirming they are set to divorce.Billi Mucklow shows ex Andy Carroll what he's missing as she looks incredible for night on the town - and gives a peek inside her home\n21/02/25 18:56It's been five months since she confirmed her divorce from footballer ex.Billi Mucklow rushes diabetic son Arlo, 9, to A&E after he falls ill with 'scary' health diagnosis\n14/02/25 11:53The former TOWIE star, 37, who shares Arlo with ex-husband footballer Andy Carroll, 36, updated her fans on Instagram on Friday.Andy Carroll looks more loved-up than ever with girlfriend Lou Teasdale in rare snap after his split from wife Billi Mucklow\n11/02/25 11:43The 35-year-old footballer and celebrity makeup artist, 41, made their relationship Instagram official over Christmas - just months after Andy announced his split from wife Billi Mucklow .Billi Mucklow shows off her 'revenge body' in a skintight jumpsuit as she shares cryptic post after unfollowing estranged husband Andy Carroll on Instagram\n11/01/25 11:57The 37-year-old former TOWIE star decided to cut ties with the ex-footballer during the holiday season, reportedly frustrated with him constantly flaunting his new relationship with Lou Teasdale.Furious Billi Mucklow unfollows ex Andy Carroll for 'shoving' his new relationship with Lou Teasdale 'in her face' with constant social media posts\n11/01/25 01:34Andy Carroll has angered estranged wife Billi Mucklow by flaunting his new relationship with Lou Teasdale on social media.Lou Teasdale says her boyfriend Andy Carroll is her 'favourite person she has ever met' in VERY romantic birthday post after going public with romance following his Billi Mucklow split\n06/01/25 19:37The footballer and celebrity make-up artist pair have been enjoying a ski trip in Megève, Mont Blanc, after confirming their relationship.Andy Carroll spends his first Christmas with new girlfriend Lou Teasdale as couple pose for a plethora of loved-up snaps\n28/12/24 08:11Andy Carroll and new girlfriend Lou Teasdale looked loved-up as they spent their first Christmas together, months after he announced his split from wife Billi Mucklow .Billi Mucklow showcases VERY glam new look just hours after estranged husband Andy Carroll packed on the PDA with bikini-clad new girlfriend Lou Teasdale\n17/12/24 08:08Billi Mucklow has showcased a glamorous new look just days after her ex Andy Carroll shared a loved-up snap of himself kissing new girlfriend Lou Teasdale.Andy Carroll kisses bikini-clad girlfriend Lou Teasdale on the head as they enjoy a loved-up holiday - after footballer took a swipe at estranged wife Billi Mucklow\n16/12/24 15:54The ex-Liverpool striker, 35, packed on the PDA with Lou, 41, as they enjoyed a romantic beach holiday.Andy Carroll takes swipe at ex Billi Mucklow as he breaks his silence over new romance with Lou Teasdale saying the make-up artist has shown him 'a different world' and is someone he 'needs in his life'\n06/12/24 21:15The ex-Liverpool striker, 35, announced his split from the TOWIE star, 36, and mother of his three children in October after secretly separating earlier this year, having been together for 11 years.Andy Carroll, 35, puts on a loved-up display with girlfriend Lou Teasdale, 41, at British Fashion Awards afterparty - after his estranged wife Billi Mucklow caught him sneaking into his former Essex home\n03/12/24 10:04Andy Carroll put on a loved-up display with new girlfriend Lou Teasdale on Monday night as they attended Vas J Morgan 's British Fashion Awards afterparty with ASOS held at Maine Restaurant.Billi Mucklow looks better than ever as she shows off her figure in a black bikini with daughter Marvel Mae, 4, in Dubai after split from Andy Carroll\n26/11/24 09:06Soaking up some winter sun she slipped into a black bikini with a spaghetti straps and low-slung bottoms.Andy Carroll 'caught sneaking into former £8.5million mansion by estranged wife Billi Mucklow'\n16/11/24 21:20The ex-Liverpool striker, 35, was reportedly caught entering his former Essex home without informing his estranged wife.Georgia Kousoulou shows off her bump in skintight pink dress as she celebrates her daughter's upcoming birth with 'dream baby shower' surrounded by her fellow TOWIE pals\n10/11/24 18:17The TV personality, 32, took to her Instagram to post a slew of snaps from the bash, calling it 'the most perfect day', as she prepares to welcome her second child with her husband Tommy Mallet.Former Newcastle and Liverpool striker Andy Carroll and his estranged wife Billi Mucklow put £8.5m home up for sale following their break-up\n10/11/24 12:03Former Newcastle and Liverpool striker Carroll - who now plays for Bordeaux - married reality TV star Billi Mucklow in 2022. They share three children and had been engaged since 2014.Billi Mucklow ditches her wedding ring as she celebrates first birthday since split from Andy Carroll with her children Marvel, Wolf and Arlo\n03/11/24 16:34Billi Mucklow looked radiant while celebrating her 37th birthday with her children Marvel, Wolf and Arlo during a lavish family holiday - after her recent marriage split from Andy Carroll.Billi Mucklow flaunts her gorgeous figure in a crop top and sarong as she celebrates her 37th birthday abroad - while brushing off ex Andy Carroll's new romance with Lou Teasdale\n03/11/24 00:32The former TOWIE star showcased her gorgeous figure in a skimpy black crop top and matching sarong in snaps from her mystery sun-soaked location.How Andy Carroll is happier than ever earning €2,500 a month at 4th tier French club which doesn't even cover his rent... but will 'messy' divorce from wife Billi Mucklow burst his bubble?\n02/11/24 08:26Now playing for French fourth-tier side Bordeaux, on face value it looks like quite a fall from grace for the striker, but he insists he loves the relaxed pace of life - despite being left out of pocket.Billi Mucklow flashes her toned midriff in blue co-ord as she continues to enjoy holiday with her sister and kids while brushing off ex Andy Carroll's new romance with Lou Teasdale\n31/10/24 08:09The former TOWIE star, 36, has whisked away her children and sister Giorgie Dark for a sun-soaked break and has been giving her followers regular glimpses into the trip.Billi Mucklow looks gorgeous in a green swimsuit while enjoying beach holiday with her kids - as she brushes off her ex Andy Carroll's new romance\n29/10/24 15:11Billi Mucklow looked gorgeous in a green swimsuit as she enjoyed a beach holiday with her kids this week - as she brushed off her estranged husband Andy Carroll's new relationship.Is this the reason behind Andy Caroll and Billi Mucklow's split? Friends claim footballer and girlfriend Lou Teasdale were in contact before the break-up as they step out at Halloween bash\n27/10/24 01:03Billi Mucklow fears footballer Andy Carroll was cheating on her with new girlfriend Lou Teasale before their shock split last month, insiders claim.Andy Carroll and Lou Teasdale make their first public appearance after his split from wife Billi Mucklow as they join Lottie Moss and Diana Vickers at star-studded Hallowzeem bash\n26/10/24 01:28The pair attended the Hallozeem Halloween bash on Friday night and looked very cosy as they cuddled up for a picture.Billi Mucklow responds to ex Andy Carroll's PDA-filled trip with new girlfriend Lou Teasdale by sharing sweet snap with their five children\n18/10/24 11:54The former TOWIE star, 36, and the footballer, 35, announced two weeks ago that they are set to divorce after secretly separating earlier this year, as he has quickly moved on with makeup artist Lou.Billi Mucklow seen for first time since her ex Andy Carroll's holiday with new girlfriend Lou Teasdale as she's supported by TOWIE pal Cara Kilbey - amid claims divorce is 'getting nasty'\n16/10/24 09:12Billi Mucklow was seen for first time on Tuesday since her ex Andy Carroll's holiday with his new girlfriend Lou Teasdale.Billi Mucklow breaks social media silence in first update since ex husband Andy Carroll's romantic getaway with new girlfriend Lou Teasdale\n15/10/24 13:54The former TOWIE star, 36, and the footballer, 35, announced two weeks ago tat they are set to divorce after secretly separating earlier this year.Billi Mucklow and Andy Carroll's divorce is 'getting nasty': She is 'determined to get everything she can' while he moves on with Lou Teasdale... as mystery of how they met is solved\n15/10/24 13:25They were once the Posh and Becks of Essex.Andy Carroll can't keep his hands off bikini-clad girlfriend Lou Teasdale as new couple enjoy sizzling weekend away after leaving his ex wife Billi Mucklow 'blindsided' by their romance\n14/10/24 11:46Andy Carroll has taken his relationship with Lou Teasdale to the next level - whisking her away for a romantic holiday.Inside Andy Carroll's ascent to Bordeaux cult hero following his split from TOWIE star Billi Mucklow and new romance with celebrity make-up artist - with ex-Newcastle and Liverpool striker keen to keep playing for another FIVE years\n13/10/24 08:54Bordeaux, six-time Ligue 1 winners, were still smarting from their first relegation from the top-flight in 31 years when their situation went from bad to catastrophic.Showbiz's unlikeliest couple are 'heating up': Lou Teasdale's romance with Andy Carroll has mystified her friends... but they could be getting serious, reveals MOLLY CLAYTON. And Billi Mucklow is blindsided\n08/10/24 12:34One is the ultimate A-list pop star who never puts a foot wrong. The other is a scandal-prone fourth-division French footballer and ex-husband of a star from reality show The Only Way Is Essex.Billi Mucklow left 'blindsided' by Andy Carroll's new romance with makeup artist Lou Teasdale as 'he moved on so quickly' after their split\n05/10/24 07:54The TOWIE star, 36, and the footballer, 35, tied the knot in June 2022, but last week confirmed they are set to divorce after secretly separating earlier this year.Billi Mucklow ditches her £200,000 wedding ring and beams as she is seen for the first time since shock split from husband Andy Carroll\n03/10/24 11:30The TOWIE star, 36, and the footballer, 35, tied the knot in June 2022 in a lavish Hampshire ceremony, but last week confirmed they are set to divorce after secretly separating earlier this year.How Billi Mucklow and Andy Carroll hid their split from fans: TOWIE star continued to share loved-up snaps as the footballer ditched the UK for a low-paid stint at a fourth-tier French club\n29/09/24 08:52Billi Mucklow and Andy Carroll shocked fans when they announced they are set to divorce after secretly separating earlier this year.Andy Carroll and Billi Mucklow SPLIT! Footballer announces shock separation two years after 'passing out in bed between TWO blondes during his raucous Dubai stag-do'\n28/09/24 21:41The Premiere League player, 35, and TOWIE star, 36, tied the knot in June 2022, shortly after the groom was snapped passed out in bed between TWO blondes.Andy Carroll returns to training with French side Amiens - days after the former England striker was 'embroiled in 1am street brawl in Mayfair and shouted 'you f***ing want some?' at bystanders'\n04/07/24 17:37Carroll, 35, who plays for French second tier side Amiens, was seen shouting at bystanders in the early hours of Tuesday morning having clashed with an unknown individual.Former England star Andy Carroll spotted yelling 'You f***ing want some?' at bystanders after the ex-Liverpool forward was embroiled in a '1am street brawl in Mayfair'\n03/07/24 00:20Carroll had reportedly been dining in the Asian restaurant with his wife Billi Mucklow , a former TOWIE star, before an alleged altercation with a man while leaving the restaurant.Billi Mucklow shares shocking pictures of her battle with a mystery skin condition which left her face inflamed and blistered\n12/01/24 11:02TOWIE's Billi Mucklow, 36, opened up about her battle with a mystery condition which left her skin inflamed and blistered - as she shared shocking before and after pictures of her face.EXCLUSIVE: Andy Carroll reveals his and wife Billi Mucklow's 'worry' about keeping their kids safe in the public eye and says the family may head to America where nobody knows them\n20/10/23 17:53The footballer, 34, and TOWIE star 35, share three children, sons Arlo, eight, and Wolf, five, and daughter Marvel, three. Andy also has two children from a previous relationship.Billi Mucklow parties up a storm on girls' trip to Mallorca - after husband Andy Carroll 'is filmed ''dirty dancing'' with DJ at a house party'\n13/08/23 14:12Billi Mucklow has been partying up a storm on a girly holiday this weekend - after her husband former England striker Andy Carroll was reportedly filmed 'dirty dancing' with a DJ.Ex-England striker Andy Carroll 'is filmed ''dirty dancing'' with DJ named Kitty McPaws at a house party'\n13/08/23 11:34The married father, who just last year was caught out for taking two women back to his hotel during his stag-do, is understood to have partied into the night after racking up a £2,000 bar tab in Essex.'He's so brave and took it all in his stride': Billi Mucklow and her husband Andy Carroll reveal their son Arlo, 8, has been diagnosed with a 'life-changing' condition\n15/07/23 15:01The TOWIE star, 34, took to Instagram to share a crucial health update as her son Arlo, 8, has been diagnosed with a life-changing chronic condition, with a very heartfelt post.Inside Billi Mucklow and Andy Carroll's Maldives honeymoon: Couple leave their five kids at home to jet on belated £2k-a-night trip... as they sip rosé, dine with sharks and display VERY dark tans\n15/06/23 10:27The former TOWIE star was documenting the trip in forensic detail, as she shared a slew of snaps from their stay at the Amilla Maldives Resort & Residences'I feel sick to my stomach!' Billi Mucklow and husband Andy Carroll reveal a thief stole her phone from their daughter's hand while shopping at Westfield Stratford City\n12/03/23 20:26The former TOWIE star, 35, revealed she felt 'sick to her stomach' following the incident and alleged security at Westfield Stratford City in London 'wasn't interested'.Recently married Andy Carroll and Billi Mucklow put on a loved up display as they enjoy a boozy night out with pals at Proud Cabaret in London\n25/09/22 08:42The couple, who got married this summer and are both 33, were ever the smitten pair as they headed out to Proud Cabaret with pals on Saturday evening.Billi Mucklow puts her wedding dresses and hen do outfits up for sale just two months after marrying Andy Carroll\n22/08/22 07:02The former TOWIE star, 34, married footballer Andy Carroll in a lavish Hampshire wedding on June 5.Newlyweds Andy Carroll and Billi Mucklow enjoy the sunshine as they step out for a walk with their children in Essex- after Mexican honeymoon\n19/08/22 10:20Billi Mucklow and her new husband Andy Carroll, who married in Hampshire, appeared in great spirits as they stepped out in the sunshine for a stroll with their children on Thursday in Essex.'We got a thing for green': Billi Mucklow poses in a frilly strapless swimsuit as she matches with Andy Carroll on Mallorcan holiday\n09/08/22 13:14Billi Mucklow and her husband Andy Carroll proved they were well-matched when they posed for a swimsuit snap together in Mallorca on Tuesday.'Day date with my hubby': Newlyweds Billi Mucklow and Andy Carroll enjoy loved-up lunch at their favourite Palma restaurant - as they put his stag do antics behind them\n22/07/22 11:09Taking to her Instagram account, a glowing Billie, 34, uploaded a snap of herself and her footballer beau, 33, who placed an amorous arm around her.From personalised PJ's to changing hairstyles: Billi Mucklow shares more insight into her wedding details... two weeks after tying the knot with Andy Carroll\n23/06/22 15:36Following tying the knot with Andy Carroll, the 33-year-old has shared further insight into her wedding prep, as she took to Instagram on Thursday with a slew of snaps.EXCLUSIVE: Newlyweds Billi Mucklow and Andy Carroll enjoy lunch in Essex after returning home from their honeymoon in Mexico - as they put his stag party antics behind them\n21/06/22 15:45The couple, who married in Hampshire earlier this month, looked happier than ever as they headed to the popular Turkish eatery Piya, after the build-up to their big day was plagued with drama.Newlyweds Andy Carroll and Billi Mucklow share a kiss before climbing aboard a quad bike during their Mexico honeymoon - after his stag do shame\n15/06/22 17:09The couple, who married in a lavish Hampshire ceremony, looked as loved-up as ever despite onlookers previously describing them as seemingly 'frosty'.Billi Mucklow exhibits her figure in a black swimsuit while sharing a kiss with husband Andy Carroll during their Mexico honeymoon - after his stag do shame\n14/06/22 07:38The newlyweds shared a loved-up snap to Instagram on Monday during their Mexico honeymoon - following his embarrassing Dubai stag do shame.'We made it one whole week baby!' Billi Mucklow and Andy Carroll celebrate their first days of marriage on Mexico honeymoon - after his stag do shame\n13/06/22 14:50The former TOWIE star, 34, and ex-Liverpool striker, 33, both looked sun-kissed as they posed in a sweet snap together during a romantic meal.Billi Mucklow dons an oversized white shirt while looking downcast alongside husband Andy Carroll during their Mexico honeymoon... following his Dubai stag do shame\n12/06/22 17:03The former TOWIE star, 34, and ex-Liverpool striker, 33, were seen soaking up the sun during their trip to Tulum... after his three-in-a-bed photo threw their wedding into doubt.'Love Of My Wife': Andy Carroll shares a cosy snap with wife Billi Mucklow from their honeymoon - amid claims the couple looked 'frosty' during the break following his stag party antics\n11/06/22 22:55After a lavish Hampshire wedding ceremony just last week, the pair have now jetted off for a sun-soaked honeymoon as husband and wife.'CARROLLCHELLA!' Andy Carroll and Billi Mucklow share more insight into their lavish wedding weekend... from their seven tier cake, romantic first dance and wild Coachella-style party the next day\n07/06/22 11:24The footballer, 33, has shared even further insight into the celebratory weekend - taking to his Instagram to post some inside snaps.'It was an open message in front of their families': Andy Carroll 'hinted at an apology to wife Billi Mucklow for his stag do antics with an emotional first song at their wedding'\n06/06/22 23:42The footballer's raucuous antics at his stag party in Dubai had thrown his wedding with the TOWIE star into doubt, but the pair went onto tie the knot at the Four Seasons in Hampshire on Sunday.Billi Mucklow swaps her flowing gown for a feathered mini dress and silver cowboy boots before dancing with new husband Andy Carroll as couple host Coachella-style wedding party\n06/06/22 16:39Billi Mucklow was in great spirits on Monday as she and new husband Andy Carroll hosted a Coachella-themed wedding celebration, following on from their romantic nuptials.Inside Billi Mucklow and Andy Carroll's wedding: Newlyweds share their first dance as the footballer kisses his bride on the cheek and dubs her the 'love of his life' following his Dubai stag do antics\n06/06/22 09:07The former TOWIE star, 34, and her footballer husband, 33, slow danced as a live singer serenaded the newleyweds in the romantic video shared to Cara Kilbey's Instagram Stories on Monday.Anxiety behind the scenes on the big day: Andy Carroll makes guests laugh as he says he is feeling sick and pal jokingly offers him Diazepam while bride Billi Mucklow leaves him waiting as she walks down aisle 20 minutes late after his stag-do antics\n06/06/22 08:32The couple tied the knot at 3:00pm at Hampshire's Four Seasons Hotel after a tumultuous build-up which photos emerged of Andy passed out in bed with two women during his stag do.Billi Mucklow is shielded by umbrellas as guests converge on five-star Hampshire hotel for her wedding to Andy Carroll - after footballer's stag do antics ALMOST cost him a red card\n06/06/22 00:04The bride, 34, was shielded by umbrellas on Sunday after tying the knot to footballer boyfriend Andy Carroll.The kiss that says all is forgiven! Billi Mucklow and Andy Carroll share their first picture as husband and wife as they exchange vows during five-star Hampshire ceremony - after registrar raises a laugh by asking if anyone has any objections!\n05/06/22 14:55Billi Mucklow and Andy Carroll finally married in a Hampshire hotel wedding on Sunday - just days after the footballer's raucous antics in Dubai.Billi Mucklow and Andy Carroll's wedding preparations get underway as workmen set up elegant floral display ahead of ceremony... after footballer brushed off Dubai stag-do antics\n05/06/22 10:33The footballer, 33, appears to have been forgiven by his bride-to-be, 34, after passing out in bed with two women during his stag-do in Dubai.\nPage\nDON'T MISS\n-\nMeghan Trainor looks thinner than ever in jaw-dropping look at LA premiere after weight loss drug reveal and breast augmentation\n-\nAnne Hathaway takes EPIC tumble in her heels while filming Devil Wears Prada sequel in New York City\n-\nBrooklyn Beckham takes inspiration from his new pal Meghan Markle by making JAM in his latest cookery video - after forging a bond with the Royal couple over matching family feuds\n-\nWhat Travis Kelce did on second date with Taylor Swift proved he was nothing like Joe Alwyn, says ALISON BOSHOFF - and what the timing of his proposal says about baby plans\n-\nBruce Willis' wife reveals dementia-stricken actor is living separately from her and their young daughters\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n-\nPrince Harry will return to London on the anniversary of Queen Elizabeth II's death to attend charity awards\n-\nEXCLUSIVE\nMolly Mae's desperate secret you don't find out about: She says she's 'open and honest' about motherhood. No wonder an insider called DOLLY BUSBY and revealed all\n-\nAndy Carroll puts on a united display with his bikini-clad girlfriend Lou Teasdale as they enjoy romantic Ibiza holiday after short-lived split\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nDavina McCall's hairdresser-turned-boyfriend Michael Douglas admits he finds her 'annoying' since brain operation left her with short-term memory loss\n-\nEXCLUSIVE\nBitter Meghan's 'fuming' over public's love of Kate says friend... and she doesn't stop there: EDEN CONFIDENTIAL reveals all\n-\nKhloé Kardashian's ex French Montana is engaged to a ROYAL Princess\n-\nSam Faiers falls victim to mum-shamers as her 'poor parenting' and 'lack of boundaries' are slammed while son Edward, 3, hurls food at his sister\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nEXCLUSIVE\nTaylor Swift and Blake Lively war hits new low: Blake KNOWS she isn't invited to wedding but insists she doesn't care... and is serving up ice cold revenge\n-\nGeorge Clooney, 64, cuts back Venice appearances due to sudden illness as star-studded film festival kicks off\n-\nA-list actress famed for a nineties cult classic looks almost unrecognisable as she arrives at Venice Film Festival - but can YOU guess who it is?\n-\nRylan Clark says it is 'absolutely insane' that illegal migrants are put up in four-star hotels - as he thanks legal NHS migrants who helped save his mother's life\n-\nWant to buy your first home as a couple? How to double up to get ahead\nSponsored\n-\nJamie Laing shares his hilarious reaction after his naked photo is accidentally posted online by wife Sophie Habboo\n-\nMeghan Markle's latest As Ever product launch is hit by technical glitch as Duchess unveils £10.38 orange marmalade\n-\nJames Corden's wife Julia oozes glamour as couple dress to impress at the US Open in New York ahead of his return to Broadway\n-\nThe Chase fans reduced to tears after learning contestant who landed £100k jackpot never got to spend his winnings as he died after show\n-\nChristine McGuinness joins OnlyFans spin-off site to host tell-all series about her life as a mother and TV star\n-\nOasis show descends into chaos as footage emerges of a brawl breaking out at reunion gig in Toronto\n-\nREBECCA ENGLISH reveals the withering comment a royal insider secretly made about Meghan Markle's new Netflix show in the Palace Confidential newsletter\n-\nMeghan's many names! Truth behind what Harry's wife is REALLY called - amid confusion over Sussex surname - and why it's changed so many times\n-\nJo Whiley breaks down in tears as she reveals her husband killed their cat in tragic accident\n-\nBlue-haired North West looks unimpressed with mom Kim Kardashian as they tour Rome's iconic Colosseum\n-\nS Club 7's Jon Lee 'secretly dating hunky Celebs Go Dating star' - after six years of celibacy\n-\nHolly Ramsay shows off her toned abs in skimpy red bikini as she continues to enjoy her 'bridal era' in snaps from weekend away before she ties the knot with fiancé Adam Peaty\n-\nSelena Gomez sweetly celebrates being engaged at same time as BFF Taylor Swift after 'real love' post resurfaces\n-\nTaylor Swift's future mother-in-law Donna Kelce gives her stamp of approval in most heartwarming way\n- Explore the hidden gems just a car ride from your favourite European cities with Skyscanner's road trip planner SHOPPING\n-\nKim Kardashian puts on a leggy display in lace tights as she joins her daughter North West for shopping in Milan as they continue their Italian trip\n-\nCate Blanchett turns heads in plunging black gown as she joins Heidi Klum and daughter Leni at star-studded opening ceremony of the Venice Film Festival\n-\nKevin Spacey's truly desperate last move 'to avoid bankruptcy'... plus why Harry seems set to torch his relationship with William AGAIN\n-\nAnna Kournikova announces shock pregnancy at 44... weeks after sparking concern with health scare\n-\nThe sell-out lymphatic drainage oil users say 'TRANSFORMS' thighs is back in stock - and it's on sale with 20% off\n-\nTaylor Swift fans predict glaring absences from Travis Kelce wedding guest list\n-\nCoronation Street star Adam Hussain breaks his silence on quitting the ITV soap after five years - but he has already teased his return\n-\nBAFTA-winning actress Sophie Willan puts on a VERY racy display as she strips completely nude to show off her growing baby bump in naked snaps\n-\nThe Vivienne's mother shares heart wrenching family update in new documentary Dear Viv after star's tragic ketamine death\n- Struggling to sleep in the heat? Emma Sleep has 25% off cooling bedding while stocks last SHOPPING\n-\nJAN MOIR: Meghan is back, and this second helping of the woman who put the boasting into hosting makes me curl up\n-\nInside Prince Harry and Prince William's surprise reunion for Diana's brother-in-law's funeral... and the courtier complex relationship with the Firm, according to royal author\n-\nJennifer Lopez looks unbothered in busty skirt suit while out in LA after being roasted by former co-star\n-\nRob Kardashian's ex Blac Chyna's face is caressed by a hairless CAT in very strange ad\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nPoisonous war between Tina O'Brien and ex Ryan Thomas over 'nepo baby' GCSE drop-out as insiders whisper toxic facts to KATIE HIND\n-\nStrictly Come Dancing star Thomas Skinner complains he doesn't get paid as much as other celebs for gigs as he reveals he's still delivering mattresses\n-\nDenise Richards gets ruptured breast implants fixed amid Aaron Phypers divorce drama: 'Can't wait for bikini season!'\n-\nAll the private battles that nearly doomed Taylor Swift and Travis Kelce: But after THAT 'breakup contract'... friends know why she fell so hard\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nHollyoaks star looks unrecognisable as she lands sex worker role in steamy period drama - but can YOU guess who it is?\n-\nTeen Mom star Jenelle Evans reacts to son, 16, moving out amid feud... after revealing her massive OnlyFans salary\n-\nFreddie Mercury's 'alleged love child says music legend would have hated his biopic Bohemian Rhapsody' and confesses it is 'full of fabrication'\n-\nSky 'AXES Rob Beckett's Smart TV after just two series as broadcaster plans to move away from panel shows'\n-\nIs YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50\n-\nNip/Tuck star Dylan Walsh had serious medical emergency behind the wheel before crashing car with family inside, rep claims\n-\nOrlando Bloom reveals the jaw-dropping truth behind his drastic weight loss - including the only two foods he was allowed to eat and HORRIFIC side effects\n- Should Meghan ever be allowed to return to royal duties? Have your say in the Palace Confidential poll You've read the headlines and heard our experts' opinions - but what do YOU think?\n-\nLaura Woods opens up about suffering heartbreaking miscarriage and reveals how she turns to her baby Leo for comfort\n-\nLove Island's Nas Majeed and Eva Zapico spark reunion rumours as they're spotted on drinks date - two years after split\n-\nSarah Jessica Parker 'photobombs' starstruck influencer in the Hamptons\n-\nChristina Applegate reveals emotional impact her MS battle has had on daughter Sadie: 'It's broken her'\n-\nAddison Rae's VERY sexy show drives fans wild on her tour\n-\nSpin City reunion! Heather Locklear and Michael J. Fox melt hearts with sweet snap 25 years on\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nAlicia Silverstone, 48, shares shocking secret to her youthful looks after swearing off Botox and fillers\n-\nLeonardo DiCaprio, 50, takes girlfriend Vittoria Ceretti, 27, out for a romantic dinner after two years together\n-\nPedro Pascal set to REPLACE Joaquin Phoenix in gay romance film after pair's tense exchange over 'salute'\n-\nJohn Mulaney celebrates 43rd birthday at US Open in NYC with wife Olivia Munn\n-\nKhloe Kardashian has scary looking medical treatment in Mexico that is BANNED in the US\n-\nRebekah and Jamie Vardy put on a loved-up display in holiday snap and stroll along the beach at sunset with their kids on family trip\n-\nBrooks Nader makes jaw-dropping sex confession about ex Gleb Savchenko\n-\nPamela Anderson and Liam Neeson's romance faces online backlash as trolls call it fake\n-\nKim Kardashian posts shocking thirst trap snaps of her butt in VERY sheer underwear with 'curious' written on back\n-\nGemma Collins flaunts her impressive two-stone weight loss in a chic pink bikini during sun-soaked Cyprus getaway\n-\nBrooklyn Beckham can't resist making another dig at parents David and Victoria as he says there's only one thing he would return to London for\n-\nA-list actress looks unrecognizable in shocking new film role\n-\nFreddy Brazier reveals he was sectioned after struggle with addiction and manic episodes as he claims his nan Jackiey Budden got him hooked on drugs\n-\nEXCLUSIVE\nSecond series of With Love, Meghan proves a turn-off for Netflix viewers as it fails to dent the top ten in the UK or the US\n-\n1000-Lb Sisters star dead at 37: Family say they're 'completely crushed' by devastating news\n-\nFans turn on Peter Kay after they're made to take down TikTok clips of his show - as they complain about paying £150 to listen to 'random singalongs'\n-\nAndy Carroll and his girlfriend Lou Teasdale share first loved-up snaps since rekindling their romance after short-lived split as they jet off for a romantic holiday to Ibiza\n-\nTravis Kelce's dad Ed makes candid revelation about financial arrangement for wedding rehearsal with Taylor Swift\n-\nMAUREEN CALLAHAN: Meghan's latest feat of failure is basic, humorless and so nauseatingly fake. But was this 'sick burn' the moment she finally admitted defeat?\n-\nDame Helen Mirren, 80, admits she 'became a bit of an a******' in her youth because she was 'constantly underestimated' due her looks\n-\nPass the sick bag, Traylor. That was the tackiest thing I've ever seen. KENNEDY's withering take on Swift's 'promposal' (and its all too convenient timing)\n-\nDenise Richards claims ex Aaron Phypers left her Los Angeles mansion in 'disarray' as their bitter divorce saga drags on\n-\nLana Del Rey reveals challenges she has faced with her alligator tour guide husband during 1st year of marriage\n-\nOriginal Harry Potter director takes withering three-word swipe at TV reboot after looking at filming pics\n-\nDashing George Clooney looks sharp as he joins glam Jay Kelly co-star Laura Dern in Venice ahead of the Film Festival premiere after holidaying together in Lake Como\n-\nRosie Huntington-Whiteley flaunts her supermodel figure as she sizzles in yellow bikini on sun-soaked Ibiza family holiday\n-\nLiam Gallagher's 'Downton Abbey-style' Cotswolds mansion with VERY famous neighbours goes on sale for £6M\n-\nDame Emma Thompson swaps Hollywood glamour for a rustic retreat as she gives rare glimpse into holiday with daughter Gaia Wise\n-\nScott Wolf's estranged wife Kelley arrested in Utah for harassment amid divorce... as her son announces estrangement\n-\nGisele Bundchen goes bra-free with kinky boots for first major modeling job since welcoming 3rd child\n-\nLeigh-Anne Pinnock turns heads in a very risqué cut-out bodysuit with feathered wings as she enjoys Notting Hill Carnival\n-\nOlivia Attwood shares a video of VERY wild boat party where she put on a cosy display with friend Pete Wicks as bikini-clad presenter has booze poured into her mouth\n-\nJenny Eclair left 'weepy, shocked and shaken' after suffering agonising injury on This Morning set just moments before live interview\n-\nJohn Stamos enjoys family Disneyland day before celebrating Taylor Swift's engagement with Josh Gad\n-\nEXCLUSIVE\nStaggering amount Taylor Swift and Travis Kelce are set to make from their wedding... but it is not without risk\n-\n'I can't find happiness - every day is a battle': Louie Spence reveals depression and anxiety stopped him becoming a father while praising rarely-seen husband\n-\nDancing With The Stars couple marry in star-studded wedding with castmates and Oscar winners\n-\nWhere are the stars of Blue Peter now? As fledgling show attempts to relaunch for the TikTok age, how its hosts have had VERY mixed prospects\n-\nThe Repair Shop fans reduced to tears as grieving couple unearth secret message left to them by late son\n-\nTravis Kelce's dad claims Taylor Swift was getting 'antsy' about her boyfriend taking too long to pop the question as he shares exactly when sportsman proposed\n-\nTaylor Swift and Travis Kelce's engagement news sparks flurry of hilarious memes as fans brand upcoming nuptials as 'the closest thing America has to a royal wedding'\n-\nTikTok star Natasha Allen dies at 28 following five year battle with rare cancer\n-\nMeghan claims she's had to order one MILLION jam jars and lids to meet demand for her latest AsEver product drop - after previous range sold out\n-\nTravis Kelce responds to Taylor Swift 'fake relationship' conspiracies after engagement announcement\n-\nChristian Bale on heartfelt mission to build brand new $22M foster home village to keep siblings together\n-\nCourtney Stodden poses topless as she reveals the 'heavy' truth about staying sober for 43 days\n-\nTravis Kelce reveals his favorite track on Taylor Swift's new album as he gives never-before-heard details after pair's stunning engagement\n-\nAll the hidden details in Taylor Swift's engagement to Travis Kelce you may have missed - from the very special location to 'secret messages' about their romance\n-\nCoronation Street star Sue Cleaver, 61, shares a glimpse inside her fridge after her impressive three-stone weight loss - and shares her unlikely sugar fix while managing her diabetes\n-\nLoose Women's Nadia Sawalha takes VERY catty swipe at Taylor Swift's engagement ring from Travis Kelce - leaving ITV panel divided\n-\nTravis Kelce accused of cashing in on Taylor Swift engagement after unveiling new clothing line less than 24 hours later\n-\nBruce Willis' wife Emma reveals tough reality of supporting her famous husband amid his dementia battle\n-\nPeter Andre reveals his number one fear for Princess and Junior - admitting he has lost control now they're adults\n-\nDavid Hasselhoff TV show from the 1980s is getting a reboot\n-\nLil Nas X fans worry a mystery medical condition could have led to the star's public meltdown and arrest\n-\nTaylor Swift's post to Selena Gomez about finding 'real love' resurfaces after engagement news\n-\nTaylor Swift's exact engagement dress just came back in stock after selling out in 20 minutes - plus other high street lookalikes\n-\nEXCLUSIVE\nJaw-dropping photos show Hollywood's baddest boy in hiding after vile remarks saw him hounded into isolation\n-\nEXCLUSIVE\nHulk Hogan's body still awaiting cremation five weeks after death as daughter Brooke makes private visit to funeral home\n-\nKaty Perry tells court why she's fighting ailing 85-year-old veteran in multi-million pound mansion lawsuit\n-\nJailed Real Housewives of Salt Lake City star Jen Shah works up a sweat in prison after defrauding thousands\n-\nTravis Kelce the GROOM-zilla! Chiefs star has a wedding-themed Pinterest page as insiders claim it will be HIM 'taking the reins' on nuptial planning\n-\nEverything you need to know about George Clooney's new Netflix movie Jay Kelly as the A-lister and wife Amal host his surprising co-stars at their $100M villa\n-\nHeidi Klum devours an ice cream while Julia Roberts goes makeup-free as both stars arrive in Venice along with Cate Blanchett ahead of this year's Film Festival\n-\nRivals stars Aidan Turner and Nafessa Williams storm TV studios on set of Disney+ 'bonkbuster' in first look at tense season two showdown\n-\nTaylor Swift's engagement steals spotlight from Blake Lively's birthday as singer shares happy news hours after former BFF's big day\n-\nRomeo Beckham shares glum-faced black and white snaps as brother Brooklyn makes another dig amid ongoing family feud\n-\nNoomi Rapace is the epitome of chic in a backless black gown as she graces the red carpet at the Mother premiere during Venice Film Festival\n-\n'Terrifying' new Stephen King film is causing viewer heart rates to skyrocket to 'hazardous' levels\n-\nZoe Kravitz stuns in a pink mini dress at Caught Stealing afterparty - following flirty exchange with Austin Butler and kiss with Harry Styles\n-\nTravis Kelce shares what he really thinks of his fiancee Taylor Swift's new album as he names his favorite song\n-\nTaylor Swift fans fear Travis Kelce's Chiefs teammate who sparked outrage could be invited to their wedding\n-\nAlec Baldwin's controversial wife Hilaria will be joining Dancing with the Stars despite fan outrage\n-\nThe truth about Harry Styles and Zoe Kravitz: He told me exactly what he wants in a woman, says KATIE HIND. That's why I know where this is heading...\n-\nThe unusual breakfast request Princess Lilibet asks Meghan Markle for, as revealed in part two of With Love, Meghan\n-\nAll the hidden signs that hinted at Taylor Swift and Travis Kelce's engagement - from an infinity ring to a VERY subtle phone detail\n-\nI was Fred and Rose West's lodger - these are the red flags in their home I wish I hadn't ignored and the only reason I managed to survive\n-\nJason Kelce screams with joy as he finally breaks his silence on brother Travis' engagement to Taylor Swift\n-\nTaylor Swift's fiance Travis Kelce follows in the footsteps of Sydney Sweeney by working with American Eagle\n-\nBillie Faiers breaks down in tears in aftermath of two-year-old daughter Margot's seizures - and reveals the 'horrendous' impact the ordeal has had on her health\n-\nKaia Gerber shows off her model legs in a navy mini skirt and knee-high leather boots as she steps out to meet pals in LA\n-\nMadonna, 67, throws Labubu-themed party for her twins Stella and Estere's 13th birthday as pop icon's boyfriend Akeem Morris, 29, larks around on waterslides\n-\nBaffled reviewers are all saying the same thing about Meghan Markle's new Netflix series\n-\nMichael Jackson's son Prince is engaged to girlfriend of eight years as famous family reacts\n-\nMove over Love Island! Davina McCall promises 'carnage' on new dating show Stranded On Honeymoon Island - but admits there's one 'huge issue' with BBC series\n-\nIs this when Taylor and Travis will tie the knot? Career commitments hint at when they will marry - after he admitted he's happy to be 'Mr Taylor Swift'\n-\nThe truth behind Ryan Reynolds and Robert Downey Jr.'s 'feud' revealed\n-\nAll the times Meghan Markle wore tights as a working royal: Duchess complains about how she had to wear the 'inauthentic' accessory\n-\nMeghan Markle mocked over her bizarre word salads during latest interview, including phrases like 'when you anchor into your own knowing'\n-\n'I always wanted to be me when I grew up': Maya Jama shows she's content with life in new snaps as she enjoys downtime while her relationship with Ruben Dias heats up\n-\nA complete timeline of Taylor Swift and Travis Kelce's relationship\n-\nEXCLUSIVE\nSecrets behind Taylor Swift's engagement: Insiders spill all on what happened behind closed doors\n-\nThe desperate measures Blue Peter bosses have taken to capture TikTok generation - including a NON-HUMAN host and the end of live shows\n-\nTaylor Swift's cushion-cut diamond engagement ring is fast becoming Hollywood's must-have sparkler - after it was also spotted on Zendaya\n-\nThe Great British Bake Off's secret shame: How show was rejected for FIVE YEARS by TV bosses and compared to 'watching paint dry'\n-\nThe Ultra Violets announce drummer Tyler Harris has died - just weeks after performing at the Isle of Wight Festival\n-\nEXCLUSIVE\nThe Queen director Stephen Frears convicted of speeding near his £2.4million London home\n-\nGorka Marquez 'is RELIEVED to be bowing out of Strictly Come Dancing' as show faces yet another catalogue of controversies\n-\nEXCLUSIVE\nCeleb worlds collide as Danny Dyer and Pixie Lott team up with Hollywood's Eva Longoria, Billy Porter and Kunal Nayyar for A Christmas Carol reboot\n-\nOasis stars Noel and Liam Gallagher's older brother Paul arrives at court to face rape and violent sex charges\n-\nKylie Jenner flaunts her chiselled midriff in skimpy bralette as she poses up a storm in sizzling photoshoot modelling her latest Khy collection\n-\nTrue meaning behind Taylor Swift and Travis Kelce's engagement caption explained as sportsman pops the question to singer in fairytale proposal\n-\nAs Natalie Cassidy admits she only 'did it for the money', how other stars' fitness regimes were exposed as unrealistic\n-\nChannel 4 viewers have A LOT of complaints as they're 'driven bonkers' by 'biased' new social experiment show - raging 'they're all getting on my nerves!'\n-\nMeghan Markle reveals her 'late night indulgence' after she's 'puts Archie and Lili to bed'\n-\nDermot Murnaghan calls for better cancer screening as he discusses his stage four cancer diagnosis\n-\nImogen Thomas jets off to Turkey for boob reduction as she goes under the knife to feel 'body confident again' after weight loss left her breasts 'too big'\n-\nJon Kay bids farewell to BBC Breakfast co-star with sweet tribute - and confirms that her last show has already aired\n-\nConor McGregor in shocking 'bullying' video as he beats up young sparring partners, hours after claiming he is 'at peace with life' in loved-up family photo\n-\nEXCLUSIVE\nJustin Bieber and wife Hailey look stronger than ever as they hold hands in LA after overcoming marital woes\n-\nPaul Bettany and wife Jennifer Connelly look more loved-up than ever after 22 years of marriage as they enjoy a romantic dinner in New York\n-\nTaylor Swift stamps out nasty comments on engagement post... as the SNUBS and support show who is really in her circle\n-\nZoe Kravitz displays abs as she has VERY flirty exchange with Austin Butler at Caught Stealing premiere amid romance rumours\n-\nWilliam and Kate give Taylor Swift's engagement the royal seal of approval as they LIKE her announcement post\n-\nTravis Kelce painstakingly transformed his own garden into magical venue for Taylor Swift engagement photos\n-\nSo much for the 'breakup contract'! How Taylor Swift and Travis Kelce engagement news quashes wild theories they're faking it\n-\nEXCLUSIVE\nKATIE HIND: How Travis proposed to Taylor just weeks before their anniversary... and 'why he popped the question now'\n-\nTaylor Swift's ex-boyfriend reacts to her fairytale engagement with Travis Kelce\n-\nMrs. Americana Taylor Swift wears $42K engagement outfit including dress from iconic All-American brand - and Travis Kelce is styled to match\n-\nThe One Show star Lindsey Russell marries partner Fred Haig in Las Vegas after couple eloped to Nevada for no-frills wedding\n-\nTaylor Swift fans spot hidden clues in Travis Kelce engagement photos\n-\nCardi B admits to calling security guard a 'b***h' but denies slicing her face as she takes the stand in civil assault trial\n-\nJacob Elordi makes a shock admission about the Euphoria film set as cast shoot the third season after the tragic death of their co-star Angus Cloud\n-\nNip/Tuck star Dylan Walsh had open containers of this popular beverage after crashing SUV with four family members inside\n-\nAmal Clooney, 47, looks stylish in butter yellow summer dress as she arrives in Venice hand in hand with her husband George, 64\n-\nLIZ JONES: It's staged and dull... but this is what EVERY reviewer has missed about new series of With Love, Meghan\n-\nEXCLUSIVE\nThe truth about 'Saint' Peter Andre: Katie Price was 'trapped' by her fame-hungry ex, friends tell KATIE HIND\n-\nAngela Scanlon reveals 'creepy' male celebrity asked her VERY inappropriate question seconds before The One Show\n- EXCLUSIVE Love is Blind's Nicole and Ben reveal why they had to keep their marriage secret for a YEAR Keeping it quiet\n- Elizabeth Hurley, 60, reveals her inheritance plans - and her son Damian ISN'T involved in them! Unexpected plans\n-\nTaylor Swift fans convinced Travis Kelce is set to spill inside details on engagement after surprise New Heights announcement\n- How William's deepest pain has moved him to complete work Diana 'would have loved' - as royal author shares powerful similarities between the mother and son .\n- Meghan Markle reacts to Taylor Swift's engagement as it overshadows her latest As Ever launch Special announcement\n-\nEXCLUSIVE\nTaylor Swift's unusual move during engagement shoot to 'humble fan' Travis Kelce revealed by body language expert\n-\nBikini-clad Olivia Attwood and close friend Pete Wicks cosy up alongside topless reveller at raucous boat party in Formentera\n- Sarah Jessica Parker, 60, is unrecognizable as she embraces grey roots after ditching Carrie's curls for AJLT All change\n- EDEN CONFIDENTIAL: Queen's top crime writer in hunt for online crooks Detective work\n-\nKris Jenner, 69, defiantly declares 'for me, this is ageing gracefully' as she speaks out on her $100,000 facelift\n- EXCLUSIVE Eye-watering cost of Taylor Swift and Travis Kelce's floral engagement shoot revealed Pricey\n-\nJack Grealish and girlfriend Sasha Attwood 'devastated' by major update in police investigation into £1m raid on their home\n-\nOliver is 'set for a remake' after woke interpretation of Charles Dickens classic was savaged by outraged fans\n- Harry Kane embarks on new food business venture as he launches his own vegan protein bar Bold move\n-\nDownton Abbey star Elizabeth McGovern admits she is 'over' the series and confesses how she felt filming without Maggie Smith\n-\nTaylor Swift and Travis Kelce announce they are engaged after secret proposal two weeks ago as she shows off HUGE ring\n-\nEmma Willis and husband Matt look closer than ever after 17 years of marriage as they attend Love Is Blind screening\n- Lisa Snowdon puts on a VERY busty display in a skimpy crochet bikini during sun-soaked trip to Ibiza Racy\n-\nThe contents of Prince Christian's lunchbox might surprise you - but it's also one of mum Queen Mary's staples\n- EastEnders bosses 'plan new spin-off inspired by shocking Netflix drama Adolescence' Looking ahead\n- Kim Kardashian lets fans know what her current clothing SIZE is while modeling see-through SKIMS Revelation\n- CHRISTOPHER STEVENS: These jurors leap to conclusions before the kettle's even boiled... Innocent till proven guilty"
    },
    {
      "url": "https://www.thesun.co.uk/sport/36323510/andy-carroll-back-lou-teasdale-alcohol/",
      "text": "Help us verify you as a real visitor\nAttention,\nOur system has indicated that your user behaviour is potentially automated.\nNews Group Newspapers Limited does not permit the access, collection, text or data mining of any content from our Service by any automated means whether directly or through an intermediary service. This is stated in our terms and conditions.\nIf you would like to inquire about the commercial use of our content, please contact crawlpermission@news.co.uk.\nWhy am I seeing this?Occasionally, our system misinterprets human behaviour as automated. If you are a legitimate user, please contact our customer support team here help@thesun.co.uk\nError Message\nNews Group Newspapers prohibits automated access, collection, or text/data mining of its content, including for AI, machine learning, or LLMs, as per its terms. For commercial use inquiries, contact crawlpermission@news.co.uk.\nThis is stated in our terms and conditions."
    }
  ],
  "argos_summary": "Former footballer Andy Carroll and makeup artist Lou Teasdale briefly split after a series of arguments, but the Daily Mail revealed that it was Lou who ended the relationship. Four days later, Carroll announced they had reconciled and posted affectionate photos from a romantic holiday in Ibiza. The couple has faced public scrutiny over drunken altercations, police visits in Mykonos and a hotel incident, and Carroll has pledged to cut back on alcohol to protect their relationship. Despite the drama, they continue to share love‑filled Instagram posts and appear together at public events.",
  "argos_id": "S57HK7RR8"
}