{
  "url": "https://www.gamesradar.com/entertainment/anime-shows/a-major-anime-company-knows-what-american-audiences-want-more-shows-with-vampire-and-zombie-themes/",
  "authorsByline": "Bradley Russell",
  "articleId": "91e6fa45e34d4e6ebe363fd7ddbc396a",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/zz4xBQtVLiR4fkJiPDkEGe-1280-80.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T11:03:57+00:00",
  "addDate": "2025-08-28T11:10:54.102519+00:00",
  "refreshDate": "2025-08-28T11:10:54.102520+00:00",
  "score": 1.0,
  "title": "A major anime company knows what American audiences want: more shows with \"vampire and zombie themes\"",
  "description": "The Uzumaki studio has a plan to crack America",
  "content": "Prolific anime and manga publisher Kadokawa is aiming to crack America and, now, its chief anime officer Daijo Kudo has outlined one of the surprising ways it can grow on western shores.\n\nWhen discussing Kadokawa's overseas plans in an interview with Toyo Keizai (H/T Anime Corner), Kudo said, \"We haven’t done a great job of it yet, but [at] Kadokawa too we must consider producing anime featuring vampire and zombie themes, which are well-liked by Western audiences.\"\n\nKudo added, \"However, I don’t think there are many shortcuts. We need to create good animation and monetize it in various places, not just through Crunchyroll. Our basic strategy hasn’t changed, so for now, we want to continue on the same path we’ve always followed.\"\n\nWhile there are certainly a sprinkling of zombie and vampire anime (Highschool of the Dead and Hellsing Ultimate say hello), they pale in comparison to the more Japan-centric styles of shonen and isekai that populate the medium. Will there be a widespread change in the next few years? Watch this space.\n\nArguably, anime has never been more popular in the US – and it's not down to the brain-munching undead or garlic-shunning bloodsuckers. Demon Slayer Infinity Castle has already broken pre-sales records before its September release in the US, with the likes of Solo Leveling proving to be a huge draw on Crunchyroll after its own record-breaking performance.\n\nThere's plenty more new anime on the horizon too in the coming fall season – including One-Punch Man season 3, Spy x Family season 3, and the Chainsaw Man movie.\n\nNeed something new to watch? Check out our picks for the best anime shows around.",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/entertainment/anime-shows/dragon-ball-and-one-piece-veteran-director-says-predictable-disney-style-works-are-to-thank-for-animes-increasing-popularity-outside-japan/",
    "https://www.gamesradar.com/entertainment/anime-shows/after-attempts-at-lord-of-the-rings-and-star-wars-anime-one-producer-is-pissed-off-by-hollywood-requesting-everything-be-turned-into-an-anime-there-are-too-many-works-to-check-out/",
    "https://www.gamesradar.com/best-anime/",
    "https://www.gamesradar.com/one-punch-man-season-3-release-date-trailer-cast-monster-association/",
    "https://www.gamesradar.com/entertainment/anime-movies/demon-slayer-infinity-castles-latest-record-breaking-achievement-might-be-its-most-impressive-yet-and-almost-guarantees-a-success-at-the-us-box-office/",
    "https://www.gamesradar.com/entertainment/anime-shows/demon-slayer-infinity-castle-movie-trilogy-release-date-trailer-cast-final-arc/",
    "https://animecorner.me/top-anime-producer-kadokawa-must-consider-anime-liked-by-westerners-also-such-as-zombie-vampire-titles-amid-push-for-global-expansion/",
    "https://www.gamesradar.com/entertainment/anime-shows/solo-leveling-just-broke-a-crunchyroll-record-we-thought-would-never-be-beaten/",
    "https://www.gamesradar.com/chainsaw-man-season-2-release-date-cast-trailer-crunchyroll/",
    "https://www.gamesradar.com/entertainment/anime-movies/as-crunchyroll-shows-off-first-demon-slayer-infinity-castle-footage-behind-closed-doors-its-movie-chief-declares-anime-is-niche-no-more/",
    "https://www.gamesradar.com/entertainment/anime-shows/spy-x-family-season-3-release-date-trailer-story-news/",
    "https://www.gamesradar.com/new-anime-2024-release-dates-upcoming-schedule/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "anime",
      "weight": 0.096643165
    },
    {
      "name": "pre-sales records",
      "weight": 0.07537575
    },
    {
      "name": "Daijo Kudo",
      "weight": 0.071943134
    },
    {
      "name": "Prolific anime and manga publisher Kadokawa",
      "weight": 0.06722493
    },
    {
      "name": "good animation",
      "weight": 0.06548694
    },
    {
      "name": "Western audiences",
      "weight": 0.065126546
    },
    {
      "name": "zombie and vampire anime",
      "weight": 0.06460944
    },
    {
      "name": "Demon Slayer Infinity Castle",
      "weight": 0.06444647
    },
    {
      "name": "Kadokawa",
      "weight": 0.06397025
    },
    {
      "name": "Kudo",
      "weight": 0.06382975
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    },
    {
      "name": "Odd News"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.6220703125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.46630859375
    },
    {
      "name": "/Arts & Entertainment/Comics & Animation/Anime & Manga",
      "score": 0.370849609375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.36572265625
    }
  ],
  "sentiment": {
    "positive": 0.57540375,
    "negative": 0.07474306,
    "neutral": 0.34985313
  },
  "summary": "Anime and manga publisher, Kadokawa, is planning to produce more shows with \"vampire and zombie themes\" in the US. Chief anime officer Daijo Kudo has suggested that this is one of the ways the company can grow in western America. He emphasised the need for good animation and monetization, not just through Crunchyroll. Kudo also suggested that Kadokaw might consider producing more anime with vampire and zebra themes. The company's basic strategy hasn't changed, so it will continue on the same path as before.",
  "shortSummary": "Kadokawa aims to expand its anime portfolio in the US by producing more vampire and zombie themes, emphasizing strong commercial appeal and ongoing development.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "612cdd9910d84595b14ab9918f571f70",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/one-punch-man-season-3-release-date-trailer-cast-monster-association/",
      "text": "One-Punch Man season 3: release date, new trailer, and everything we know so far\nAll the latest on Saitama's heroic return in One-Punch Man season 3\nOne-Punch Man season 3 is coming to our screens this fall. The show's return has been a long time coming, as the first season was originally released a decade ago. Now, Saitama and his deadly fists are back for a new adventure, which will continue the Monster Association arc from the beloved manga.\nIf you want to get ahead of the long-awaited new episodes, we've compiled everything there is to know about One-Punch Man season 3 release date, plot theories, first-look images, and more, including the announcement that the leading manga and anime platform Viz Media acquired the rights across North America. After a six-year hiatus, we are very excited to see the return of the beloved satirical superhero, and we have a lot of interesting details about what's in store.\nThe new season arrives in only a few months along with other very exciting new anime series coming up year, like Spy x Family season 3 and My Hero Academia season 8. Keep reading here for everything we know about One-Punch Man season 3, including a look at the manga chapters it could adapt in the upcoming season, and even where to watch the (literal) hard-hitting adventures of Saitama. For more from the world of anime, check out our collection of the best anime you should be watching right now.\nOne-Punch Man season 3 release date speculation\nOne-Punch Man season 3 is releasing in October 2025. Given that most fall releases drop in the first week of October, we'd expect One-Punch Man to follow suit. However, we're still waiting on an actual date to be confirmed.\nEither way, it's been a long time coming. The first season debuted way back in 2015, while the second season aired in 2019. In other words, we’ve spent over half a decade waiting for the One-Punch Man season 3 release date to surface. Now, we're only months away from Saitama's return.\n“I am truly looking forward to the broadcast of One-Punch Man season 3. We wouldn’t have been able to come this far without the support of our fans. Season 3 will delve deeply into the thrilling new adventures of the S-Class heroes,\" said the manga's creator, ONE, in early July (via ScreenRant).\nOne-Punch Man season 3 story: which manga chapters will it adapt?\nOne-Punch Man season 3 will continue the Monster Association arc from Yusuke Marata's manga, which sees the Monster Association arrive at the Hero Association with a message about wanting monsters and heroes to co-exist – something which quickly turns around to be a ruse.\nBringing all the latest movie news, features, and reviews to your inbox\nInstead, the Monster Association wants an all-out war between heroes and monsters, led by Orochi and Gyoro. Also in season 2, hero hunter Garou is confronted by various heroes wanting to prove their worth to the Hero Association – including Death Gatling. It leads to a fight between Saitama's protege Genos and Garou, with the latter being saved by the Monster Association's Phoenix Man.\nInevitably, Saitama – having been sidetracked by attempting to best King at video games – comes and saves the day. He kills the monster Elder Centipede and remarks that a despondent Genos needs \"power\" to improve as a hero. So, that's where we're at. What's next for One-Punch Man season 3? If you're following along in the manga, we're starting from chapter 86.\nTo confirm our speculations, the official One-Punch Man social media accounts dropped the first two 'Mysterious Being' visuals in early April. These featured Monster King Orochi and Gyoro-Gyoro. So yeah, the Monster Association is basically confirmed at this point.\nA season of One-Punch Man typically covers around 40-50 chapters of the source material. If that's the case again, we could expect this season to end around chapter 123 – and the debut of a character known as Psykos (to say any more would be a significant spoiler…)\nUntil then, expect the perpetually bored Saitama to continue fighting monsters alongside his fellow heroes and Garou to spend more time with the Monster Association as an all-out war ensues. Society's reaction to the monsters differs, with one splinter group – The Monster Worship Party – submitting itself to the monsters.\nOne-Punch Man season 3 trailer\nThe new One-Punch Man season 3 trailer, which you can watch above, shows Saitama flanked by a series of lower-ranked (but no less formidable) heroes as they face down the Monster Association.\nThe clip isn't super heavy on action, and we don't see any massive fights just yet, but it does end with Saitama promising to punch Garou. The music in the teaser is pretty killer as well, so definitely check it out if you want to get hyped for season 3!\nOne-Punch Man season 3 cast\nThe One-Punch Man season 3 cast has mostly been confirmed thanks to its latest trailer. They include Saitama (Makoto Furakawa), Genos (Kaito Ishikawa), Garou (Hikaru Midorikawa), King (Hiroki Yasumoto), and the Monster Association’s Gyoro Gyoro (Takehito Koyasu).\nOther characters include Terrible Tornado (Aoi Yuki), Silverfang (Kazuhiro Yamaji), Atomic Samurai (Kenjiro Tsuda), Child Emperor (Minami Takayama), and Zombieman (Takahiro Sakurai). The J.C. Staff studio are back on animated duties too.\nAs of November 2024, the official One-Punch Man Twitter account has also unveiled season 3 art for the characters Atomic Samurai and Zombieman from season 3 character designer Ryosuke Shirokawa. You can see them for yourself below.\n「#ワンパンマン」ヒーロービジュアル#07を公開！第7弾はアトミック侍！第3期キャラクターデザイン白川亮介さんの描き下ろしですhttps://t.co/fIFaKg2Abe#onepunchman pic.twitter.com/IkK07wtWxVSeptember 6, 2024\n「#ワンパンマン」ヒーロービジュアル#09を公開！第9弾はゾンビマン！第3期キャラクターデザイン黒田新次郎さんの描き下ろしですhttps://t.co/fIFaKg2Abe#onepunchman pic.twitter.com/4OSkRKOlGCNovember 1, 2024\nWhere can I watch One-Punch Man season 3?\nLike the first two seasons, One-Punch Man season 3 will be streaming on Crunchyroll but, as of writing, it's only been confirmed in the UK, Ireland, and Europe.\nUS fans can likely expect the series to also be available on Hulu (just like the other seasons). Again, though, currently this is just speculation on our part. We'll keep you posted as we wait for more information.\nWe do know that the leading manga and anime platform Viz Media has acquired the rights to One-Punch Man season 3 across North America, Latin America and Oceania (via Variety). \"Additional details regarding streaming availability in VIZ Media territories will be announced in the coming weeks,\" they announced on May 27.\nIn the meantime, check out our list of the best Crunchyroll anime if you're looking for something new to watch.\nLook ahead to more of anime’s other big names in our guides to the Chainsaw Man movie and Vinland Saga season 3. Then, discover some of the best anime on Netflix.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Mireia MullorContributing Writer\n- Emma-Jane BettsManaging Editor, Evergreens\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/anime-movies/demon-slayer-infinity-castles-latest-record-breaking-achievement-might-be-its-most-impressive-yet-and-almost-guarantees-a-success-at-the-us-box-office/",
      "text": "Demon Slayer: Infinity Castle's latest record-breaking achievement might be its most impressive yet – and almost guarantees a success at the US box office\nInfinity Castle's box office domination continues\nDemon Slayer: Infinity Castle is showing no signs of slowing down as it gears up for its US release.\nAlready, the movie has broken records at the Japanese box office, and it's nabbed a US record before it's even been released.\nPer Deadline, Demon Slayer: Infinity Castle is garnering record-breaking advanced ticket sales for an anime film, with an estimated combined total of around $10 million from Cinemark, Regal, and AMC.\nPlus, Fandango reports the best first-day presales for an anime film ever, which puts the movie above Mugen Train and Jujutsu Kaisen 0. Considering Mugen Train drew a $21.2 million US opening in April 2021 and Jujutsu Kaisen 0 $18 million in May 2022, that bodes very well for Infinity Castle.\nInfinity Castle is the sixth highest-grossing movie ever at the Japanese box office with the best ever opening weekend, and it has also become the highest-rated anime movie of all time on IMDb.\nMugen Train ultimately grossed $500 million, so, if Infinity Castle does surpass that at the box office, that would be seriously impressive indeed.\nDemon Slayer: Infinity Castle hits theaters on September 12, though there are \"limited\" screenings on September 9 in the US for Mega and Ultra Fan Crunchyroll subscribers.\nAnd, if you're looking to catch up on the anime before the movie, Crunchyroll will host a Demon Slayer: Kimetsu no Yaiba watch party on YouTube for free, starting on August 16.\nIn the meantime, check out our guide to the best Crunchyroll anime or the year's most exciting new anime to fill out your watchlist.\nI'm the Deputy Entertainment Editor here at GamesRadar+, covering all things film and TV for the site's Total Film and SFX sections. I previously worked on the Disney magazines team at Immediate Media, and also wrote on the CBeebies, MEGA!, and Star Wars Galaxy titles after graduating with a BA in English.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/chainsaw-man-season-2-release-date-cast-trailer-crunchyroll/",
      "text": "Chainsaw Man – The Movie: Reze Arc release date, story, trailer, cast, and more\nChainsaw Man is getting a new movie instead of a second season\nThe Chainsaw Man movie is now just a couple of months away. That's right, it's almost time to see the follow-up to one of the best anime series out there make its big screen debut. As you might have guessed from the title, the movie is set to adapt the manga's Reze Arc, which follows on from Denji's origin as a Public Safety Devil Hunter and member of Tokyo Special Division 4. But prepare yourselves, anime fans, as things are about to get a lot bolder – it's referred to as the Bomb Girl arc by fans for a reason.\nHowever, as the upcoming Chainsaw Man movie is practically a season 2 to the hit anime show, there's a lot you need to already know way before you even think about buying your ticket and popcorn. But don't worry, as Crunchyroll is set to release compilations before the movie's October release. We cover all of that and more in our handy guide. Below, we've got everything you need to know about Chainsaw Man – The Movie: Reze Arc, including its US release date, plot details, trailers, and more.\nFor more updates on some of the other biggest anime titles out there, take a look at our guides to Vinland Saga season 3, all the latest on the new anime arriving over the next year, and One-Punch Man season 3.\nChainsaw Man – The Movie: Reze Arc release date\nAs announced during the weekend of AnimeJapan, Chainsaw Man - The Movie: Reze Arc is releasing on September 19 in Japanese cinemas and October 29 in the US and UK.\nReze Arc's release is being staggered in other territories: it's sit to hit most Asian regions on September 25 and September 26, while France is the first western territory to clap eyes on the Chainsaw Man movie on October 22. Alongside the US and UK, several other countries (including Germany and Belgium) will also get Chainsaw Man - The Movie: Reze Arc on October 29. Rounding things off is a release in a clutch of territories (such as Spain, Mexico, and the majority of South America) on October 30.\nChainsaw Man – The Movie: Reze Arc story: recap and what is being adapted next?\nUnless it runs over into a second season, it appears the Chainsaw Man movie will hurtle through the explosive Bomb Girl arc (chapters 40-52) and will set up the International Assassins arc (chapters 53-70) for TV episodes down the line.\nThe synopsis of the Chainsaw Man movie reads, \"Denji became Chainsaw Man a boy with a devil’s heart, and is now part of Special Division 4’s devil hunters. After a date with Makima, the woman of his dreams, Denji takes shelter from the rain. There he meets Reze, a girl who works in a café.\"\nThe first season of Chainsaw Man adapted the first 38 chapters of the manga. So, if you want to read ahead to see what the movie will cover, then you’ll need to start from chapter 39.\nSpeaking of Chainsaw Man season 1, you will have to catch up with the series first before watching the movie, if you haven't done so already. However, Crunchyroll has just made that even easier as the streamer is set to bring Chainsaw Man – The Compilation to the platform in September. The compilation consists of two feature-length recap films that revisit the first season, compiling everything you need to know before seeing The Reze Arc on the big screen.\nAs of right now, it’s unclear how far the feature film will reach in terms of adapting the source material. We’re about 40% of the way through the manga’s first part (the Public Safety Saga), though there’s likely a little too much material to cover for just one movie.\nNo spoilers here, but the woman seen at the end of the season 1 finale – Reze – will factor heavily into the movie, and she'll certainly get close to Denji. The overarching threat of Gun Devil will also be keenly felt as the now-merged Division 4 of Public Safety and its team of Devil Hunters encounter new friends and foes.\nOn the topic of Chainsaw Man season 2: yes, we're just as surprised as you are that the anime is going into a canon movie directly after its first season. A second season will surely arrive down the line and will likely cover the aforementioned International Assassins arc, which (to keep it vague) features Denji's notoriety increasing, something which puts him on the radar of various hitmen.\nStill catching up on one of the best anime series around? The first season of Chainsaw Man revolved around a boy called Denji and his Chainsaw Devil/dog companion, Pochita. After inheriting his father’s debt from the yakuza, Denji becomes a Devil Hunter – but is killed by a Zombie Devil, one of many creatures that manifest from humanity’s fears.\nDenji, however, is revived and fuses with Pochita to become the titular Chainsaw Man. By pulling the ripcord on his head, he can turn into what is, essentially, a sentient chainsaw.\nMuch of the first season saw him grow into his role as Public Safety Devil Hunter alongside partners Power, Aki, Himeno, and Kobeni. They face off against the likes of the Bat Devil, Ghost Devil, and Katana Man – who they eventually capture. The season ends with the Snake Devil killing Akane, the team being on the hunt for the Gun Devil, and the introduction of a mysterious new woman who asks whether someone would rather be a \"country mouse\" or a \"city mouse.\"\nChainsaw Man – The Movie: Reze Arc trailer\nThere have been three Chainsaw Man – The Movie: Reze Arc trailers, with the initial Reze Arc teaser being released in December 2024. A second 30-second trailer followed in March. A full trailer dropped at the Anime Expo in July 2025, where it was accompanied by a full panel with a Q&A. The clip, which you can watch above, establishes the movie's explosive love triangle, gives us a glimpse of Denji's transformation, and teases the movie's new theme song.\nChainsaw Man – The Movie: Reze Arc cast: who could return?\nWe expect Denji (Kikunosuke Toya), Makima (Tomori Kusunoki), Kobeni (Karin Takahashi) Power (Fairouz Ai), and Aki (Shogo Sakata) all to return in the Chainsaw Man movie. One major newcomer will be Reze (Reina Ueda), while we also anticipate much of the English dub cast to reprise their roles.\nThere are some newcomers to the cast, too: Hidenori Takahashi joins as the vice-captain of the Public Safety Demon Suppression Special Section 2, Kenji Akabane will play his colleague Nomo, Kenji Nomura will voice the mysterious man who's after the Chainsaw Heart, and Eri Kitamura is the Typhoon Demon.\nWhere is Chainsaw Man season 2? And is the Reze Arc movie canon?\nYes, Chainsaw Man - The Movie: Reze Arc continues where the first season left off and will be canon to the events of the anime. In short, it's a must-watch if you want to continue Denji's saga - in much the same way Mugen Train was effectively presented (and later adapted) as Demon Slayer's second season.\nHowever, we still expect an actual Chainsaw Man season 2 to be released at some point after the movie. That means, in effect, the watch order will go: Chainsaw Man season 1, Reze Arc movie, Chainsaw Man season 2.\nWhere can I watch Chainsaw Man?\nThe first season of Chainsaw Man is available to watch, subbed and dubbed on Crunchyroll for Premium members. It's safe to assume the Chainsaw Man movie will be released theatrically and will likely stream on Crunchyroll down the line.\nNot sure what to watch next? Here are some of the best anime movies you should be watching right now, plus our guides on how to watch Dragon Ball in order and how to watch Attack on Titan in order.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Mireia MullorContributing Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/anime-shows/spy-x-family-season-3-release-date-trailer-story-news/",
      "text": "Spy x Family season 3: Everything we know so far\nAll the latest news on Spy x Family season 3's release window, story, cast and more\nSpy x Family season 3 is here in just a few months as part of anime's upcoming fall season. So, it's time to get ready for more hijinks with the Forgers.\nBased on Tatsuya Endo's Spy x Family manga, its combination of light-hearted humor and explosive action makes it a great choice for shojo and shonen fans alike. So, it's no surprise that a third season produced by Wit Studio and CloverWorks was announced just after the second season wrapped up. But to get you ready for the next mission, we’ve put together a comprehensive guide on season 3.\nFrom the Spy x Family season 3 release date, story, episode count, and even a brand new trailer, we've got all the intel down below. You can check out our picks for the best anime you should be watching right now next. Then dive into more shonen series with our guides to Solo Leveling season 3, Jujutsu Kaisen season 3, and Demon Slayer Infinity Castle. But for now, let's see what the Forger's have cooking for us!\nSpy x Family season 3 release date speculation\nSpy x Family season 3 is scheduled to premiere in October 2025. The news came via December's Jump Festa 2025 event, although we're still waiting on an exact release date. Expect one to arrive in the coming weeks as we inch towards fall's anime lineup.\nIn the meantime, you can give into some anime marathons with our guides on how to watch all of Dragon Ball in order and how to watch Attack on Titan in order.\nWhere to watch Spy x Family season 3\nSpy x Family season 3 will be streaming on Crunchyroll.\nHowever, past seasons of Spy x Family are also now getting a physical release. So, hopefully, in the future, you'll also be able to buy a copy of season 3 and add it to your collection. While we love all the best streaming services, having anime at our fingertips (with or without an internet connection) is a massive plus in our books.\nBringing all the latest movie news, features, and reviews to your inbox\nSpy x Family season 3 story\nIf you're new to Spy x Family, here's a quick reminder of the synopsis via Crunchyroll's official English description: \"World peace is at stake and secret agent Twilight must undergo his most difficult mission yet—pretend to be a family man. Posing as a loving husband and father, he’ll infiltrate an elite school to get close to a high-profile politician. He has the perfect cover, except his wife’s a deadly assassin and neither knows each other’s identity. But someone does, his adopted daughter who’s a telepath!\"\nSpy x Family season 3 will continue to draw inspiration from the manga it's based on because creator Tatsuya Endo is currently a few arcs ahead of the series in his source material. If broad spoilers don't bother you, here are some details on the upcoming arcs that fans can likely expect to see adapted in Spy x Family season 3.\nAssuming that the anime follows the same path as the manga, the Friendship Schemes Arc, which runs through Missions 64-68, will probably kick things off. The official synopsis reads: \"Yor makes an unlikely friend while Anya tries to improve her friendship with Damian.\"\nMissions 69-78 make up the Red Circus Arc next. The official synopsis for this one reads: \"On their way to a field trip, Anya's school bus gets hijacked by the Red Circus terrorist group, leaving her and her classmates to figure out a way of solving the situation without being harmed.\"\nIt's also possible that the Spy x Family writers will devise new storylines for the anime too, which may be used to fill out the season or even take the Forgers in an entirely new direction. That's what happened with the movie, Spy x Family Code: White, and there's every chance the series could follow suit.\nIf you want to know more about what's coming and channel Bond's ability to get a head start, the future of Spy x Family is already available to peruse via Endo's best-selling manga.\nSpy x Family movie: should I skip the Code White movie?\nIn addition to the Spy x Family manga and series, there's also an anime spin-off film you can watch titled Spy x Family Code: White. Directed by Takashi Katagiri and also produced by WIT Studio and CloverWorks, the film offers an original, standalone story that can easily be enjoyed without prior knowledge of the series. It's unlikely that the events of Code White will be referenced in Spy x Family season 3, so the film isn't mandatory viewing, although it's a lot of fun and definitely worth watching still.\nIf you want to know more, here's the official movie synopsis: \"He's a spy. She's an assassin. Together, Loid and Yor keep their double lives to themselves while pretending to be the perfect family. However, their adopted daughter, Anya, a telepath, knows both of their exciting secrets unbeknownst to them. While under the guise of taking his family on a weekend winter getaway, Loid's attempt to make progress on his current mission, Operation Strix, proves difficult when Anya mistakenly gets involved and triggers events that threaten world peace!\"\nSpy x Family Code: White is also available to stream on Crunchyroll. We also have a list of the best anime movies of all time for you to check out, if you fancy some more recommendations!\nSpy x Family season 3 trailer\nThe first Spy x Family season 3 trailer was released in July 2025. In it, a sizzle reel of the Forger family's upcoming spy shenanigans are shown. It also teases a deeper dive into Loid's past.\nWit Studio and CloverWorks have also kindly treated us to some new artwork ahead of season 3's release.\n／TVアニメ『SPY×FAMILY』Season 3 制作決定🎉✨#嶋田和晃 さん描き下ろし新ビジュアル公開🎨＼デザインはアートディレクター #吉田ユニ さんが担当‼️イベント配信チケット販売中🔽https://t.co/O8Hi8ROJeQ※6月16日(日)19:00まで視聴可能#SPY_FAMILY#スパイファミリー pic.twitter.com/Dw32OUliywJune 9, 2024\nWhen the season 3 renewal announcement came on June 9th, 2024, a picture of Anya sleeping peacefully on her pet dog Bond was released. Anya's adoptive parents Loid and Yor can be seen checking in on them through the doorway.\nOn December 19th, 2024, Spy x Family character designer Shimada Kazuaki shared a new illustration of Anya and Bond to celebrate the news that season 3 will arrive in October 2025.\n／TVアニメSeason 32025年10月より放送決定🎊✨嶋田和晃描き下ろしジャンフェスお祝いイラスト公開🎨＼皆様、お待たせしました‼️いよいよ来年2025年10月、フォージャー家が帰ってきます🥜今後の続報にご期待ください🙏#SPY_FAMILY#スパイファミリー pic.twitter.com/TeR4zZgq4mDecember 21, 2024\nWhile we're waiting for season 3, Crunchyroll has also announced plans to release season 2 of the anime and Spy x Family Code: White on Blu-ray and DVD in March 2025. A Limited Edition version of season 2 is also coming our way.\nSpy x Family season 3 cast\nIt's very likely that Japanese voice actors Takuya Eguchi, Saori Hayami, and Atsumi Tanezaki will return to reprise the roles of Loid, Yor, and Anya Forger in season three.\nAssuming all goes to plan, the same English voice actors will be back as well, which means Alex Organ, Natalie Van Sistine, and Megan Shipman will continue to voice Loid, Yor, and Anya moving forward.\nThe same is probably true of other voice actors working in other countries to dub Spy x Family and bring your favorites to life around the world. We'll update more from the returning (and new) actors once we have official confirmation.\nSpy x Family season 3 episode count speculation\nSpy x Family season 3 is expected to last for 12 episodes, just like season 3, which would take it through October, November, and December in the fall 2025 season. However, this hasn't fully been confirmed yet. So, keep your eyes on this page as more updates come our way.\nFor more 2D fun, check out our guide to all the new anime coming out in 2025 and beyond. Or, if you are looking for more shows, we have a list of the best Netflix anime for you to read next!\nWith ten years of online journalism experience, David has written about TV, film, and music for a wide range of publications including Indiewire, Paste, Empire, Digital Spy, Radio Times, Teen Vogue and more. He's spoken on numerous LGBTQ+ panels to discuss queer representation and in 2020, he created Digital Spy's Rainbow Crew interview series, which celebrates queer talent on both sides of the camera via video content and longform reads. Passions include animation, horror, comics, and LGBTQ+ storytelling, which is why David longs to see a Buffy-themed Rusical on RuPaul's Drag Race.\n- Emma-Jane BettsManaging Editor, Evergreens\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/anime-shows/dragon-ball-and-one-piece-veteran-director-says-predictable-disney-style-works-are-to-thank-for-animes-increasing-popularity-outside-japan/",
      "text": "Dragon Ball and One Piece veteran director says \"predictable Disney-style works\" are to thank for anime's increasing popularity outside Japan\nWish upon a star\nIt's impossible to ignore anime's growing popularity. In Japan, the likes of Demon Slayer: Infinity Castle are breaking records but, in the US and beyond, shows such as Solo Leveling are becoming genuine bonafide hits.\nSpeaking to President Online (H/T Automaton Media), Dragon Ball and One Piece director Tatsuya Nagamine and Toei producer Shinji Shimizu share their grand theories as to why anime has become such a sensation on western shores – and it's partly down to Disney.\n\"I think overseas fans of animation are already tired of predictable Disney-style works,\" Nagamine said, pointing to anime's penchant for more outlandish adventures that are catching on with audiences worldwide.\n\"Right now, only Japanese animation offers bizarre stories where you truly can’t predict what will happen next,\" Nagamine offered.\nShimizu weighed in, \"Japanese anime comes from comics. There is great care put into the characters. Disney, on the other hand, has predetermined storylines, and there is always a happy ending. In Japanese anime, you may see a protagonist die halfway through, or a villain turn out to be a hero – it’s made to be satisfying even for adults.\"\nWhile the pair's comments may seem outspoken, it's not uncommon for Japanese creatives to take aim at Disney's output.\nAs recounted in Steve Alpert's Sharing a House with the Never-Ending Man, Studio Ghibli director and co-founder Hayao Miyazaki criticized the \"terrible\" work on Fantasia 2000 during a studio tour.\nWith a serious amount of new anime on the horizon, it appears anime could yet scale even greater heights. Demon Slayer: Infinity Castle will be joined in cinemas later this year by the Chainsaw Man movie, while the action-heavy Bleach: Thousand-Year Blood War part 4 and more melancholic Frieren: Beyond Journey's End season 2 show the malleability of the medium in 2026 and beyond.\nFor more, check out the best anime movies you should be watching right now, plus all the latest on Jujutsu Kaisen season 3.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/anime-movies/as-crunchyroll-shows-off-first-demon-slayer-infinity-castle-footage-behind-closed-doors-its-movie-chief-declares-anime-is-niche-no-more/",
      "text": "As Crunchyroll shows off first Demon Slayer Infinity Castle footage behind closed doors, its movie chief declares \"Anime is niche no more\"\nAnime fandom keeps growing non-stop in the global scene\nAs Demon Slayer Infinity Castle movie is expected to be a box office hit this year and shows like Jujutsu Kaisen and The Apothecary Diaries are becoming cultural phenomenons on TV, it's clear that anime is soaring in the global scene. With 17 million subscribers and the largest anime library, Crunchyroll is riding this wave, which is predicted to keep growing in the next five years.\nAccording to the latest Crunchyroll study, conducted by National Research Group (NRG), anime fandom is expected to reach at least 1.5 billion by 2030, even without including Japan and China, as its global audience keeps growing non-stop, particularly among younger viewers. \"Anime is niche no more,\" said Crunchyroll EVP of global commerce and head of theatrical Michel Berger (via Variety).\nDuring this year's Annecy International Animated Film Festival, Berger introduced the Crunchyroll Studio Focus 2025 and talked about the anime fandom's growth. According to the study, nearly 60% of viewers from 13 to 17 identify as anime fans. The number goes down to 44% with viewers from 13 to 54, but it still surpasses, according to Berger, other popular genres like K-dramas.\nBerger concluded his presentation by sharing footage from the upcoming Demon Slayer movie, officially titled Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle, which is scheduled to be released on July 18, 2025, in Japan. Crunchyroll will distribute the film in international markets through Sony Pictures Releasing a couple of months later.\nInfinity Castle could easily become a box office hit, at least if it follows the results of Demon Slayer: Mugen Train. The first Demon Slayer film made over $500 million at the global box office, becoming the highest-grossing Japanese anime movie of all time.\nPer the official synopsis, Infinity Castle sees Tanjiro and the Hashira rush to save the Demon Corps headquarters, but they're \"plunged into a deep descent to a mysterious space by the hands of Muzan Kibutsuji. The destination of where Tanjiro and Demon Slayer Corps have fallen is the demons' stronghold – the Infinity Castle. And so, the battleground is set as the final battle between the Demon Slayer Corps and the demons ignites.\"\nDemon Slayer: Kimetsu no Yaiba Infinity Castle is set to premiere in North America on September 12. For more, check out the best anime we'd recommend watching in 2025. If you're still playing catch-up with Tanjiro's saga, you'll need our guide on how to watch Demon Slayer in order.\nMireia is a UK-based culture journalist and critic. She previously worked as Deputy Movies Editor at Digital Spy, and her work as a freelance writer has appeared in WeLoveCinema and Spanish magazines Fotogramas, Esquire, and Elle. She is also a published author, having written a book about Studio Ghibli's 'Kiki's Delivery Service' in 2023. Talking about anime and musicals is the best way to grab her attention.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://animecorner.me/top-anime-producer-kadokawa-must-consider-anime-liked-by-westerners-also-such-as-zombie-vampire-titles-amid-push-for-global-expansion/",
      "text": "Toyo Keizai interviewed KADOKAWA Chief Anime Officer Daijo Kudo about the state of the company’s overseas anime business and growth plans. He shared that he hoped that anime would be born all over the world, akin to how the sushi-inspired California roll was born in North America:\n“One of Natsuno’s [KADOKAWA President Takeshi Natsuno] concepts is ‘Global Media Mix with Technology.’ The company is currently aiming to increase the number of published IPs it creates annually from approximately 6,000 to 7,000 (by the fiscal year ending March 2028), while also creating IPs from its overseas subsidiaries. This initiative [launching the GeeXProductions animation production label for works by overseas creators] is in line with that trend.\nFor example, wherever you go in the world, there are many different types of sushi, including California rolls. Similarly, with anime now being watched all over the world to this extent, wouldn’t it be good to see a future where anime is born in many different places? We haven’t done a great job of it yet, but KADOKAWA too we must consider producing anime featuring vampire and zombie themes, which are well-liked by Western audiences.\nHowever, I don’t think there are many shortcuts. We need to create good animation and monetize it in various places, not just through Crunchyroll. Our basic strategy hasn’t changed, so for now, we want to continue on the same path we’ve always followed.“\nTitles like Castlevania and Blood: The Last Vampire, and the success of adjacent dark fantasy works like Berserk, prove that these themes do sell in places like North America. Kudo’s hope that anime will be born outside of Japan also follows comments of a similar vein about manga by Noboru Segawa, KADOKAWA’s head of the Global Comic Department and editor-in-chief of the new Overseas Manga Editorial Department.\nSegawa discussed its recent overseas manga competition, adding that while they are currently running a scheme to support overseas manga creators debuting in Japan, he hopes to facilitate a future where their work can take off anywhere, not needing to first do so in Japan.\nYou can also check out Kudo’s comments on the North American anime streaming landscape, where he describes Sentai’s (HIDIVE) “weakening” power and Crunchyroll’s dominant position, leading to more “careful” negotiation over prices and uncertainty from Japanese production companies about their overseas revenue prospects for certain works if Crunchyroll doesn’t buy them.\nSource: Toyo Keizai\n©2000 Production I.G/ANX, SCEI, IGA ©Shinichi Kimura, Kobuichi, Muririn/Fujimi Shobo/Matelis Magical Academy\nParticipate In Discussions"
    },
    {
      "url": "https://www.gamesradar.com/entertainment/anime-shows/demon-slayer-infinity-castle-movie-trilogy-release-date-trailer-cast-final-arc/",
      "text": "Demon Slayer: Infinity Castle release date, new trailer, and everything else you need to know\nThe trailer for the first Demon Slayer: Infinity Castle movie is here\nAs Demon Slayer: Infinity Castle continues to break box office records in Japan, the new anime movie is nearing release overseas. That's right, US audiences as well as fans from other territories will soon be able to dive into the first instalment in the upcoming Demon Slayer movie trilogy.\nThe good news is that Japanese viewers have not really spilled the beans online in terms of spoilers, so when the movie does reach theaters across the pond, we'll be ready to witness Tanjiro's final battle with fresh eyes. The bad news is that we still have about two weeks to wait. But until then, you can prepare yourselves with our full guide to Demon Slayer: Infinity Castle, packed full of first reviews and the latest trailers. For those reading along with the source material, we also have the answer to which manga chapters will be adapted.\nSo what are you waiting for? Sharpen your Nichirin Blades and get ready to enter the demons' stronghold as we take you through everything you need to know about Demon Slayer: Infinity Castle, including its release date, trailers, plot details, voice cast, and more. For more from the world of anime, check out the latest on new anime, including Jujutsu Kaisen season 3 and One-Punch Man season 3. Still catching up on Demon Slayer? You’ll need our breakdown of how to watch Demon Slayer in order.\nDemon Slayer: Infinity Castle movie release date\nThe first instalment of the Demon Slayer Infinity Castle movie trilogy will release on September 12 in the US and UK and is out now in Japan, where it's broken several box office records and now holds the top spot for the country's highest opening weekend gross.\nFor more regions, check out Crunchyroll's extensive list of its staggered release plans. It all forms part of a killer fall lineup, which also includes the Chainsaw Man movie and My Hero Academia's final season.\nFrom there? The movie trilogy could continue until 2026 and potentially even 2027, depending on production schedules.\nDemon Slayer: Infinity Castle movie story: what manga chapters is it adapting?\nDemon Slayer: Infinity Castle will likely adapt the Final Battle portion of the manga, which consists of the Infinity Castle arc (chapters 137-183) and the Sunrise Countdown arc (chapters 184-205).\nBringing all the latest movie news, features, and reviews to your inbox\nThe Demon Slayer: Infinity Castle movies will pick up where Demon Slayer season 4 and Hashira Training left off, with Ubuyashiki predicting an approach from Muzan and detonating his entire complex (he and his family along with it) in the hopes of stopping the demon leader.\nWhile Muzan just about escaped, the main Hashira all converged. Despite being beheaded, Muzan wasn't defeated and was able to trap each Hashira inside the demon's HQ of Infinity Castle (hence the name). From there, they must battle to escape, kill the Upper Ranks and, ultimately, defeat Muzan and put an end to the demon scourge once and for all.\nWhile we won’t go into spoilers here, it’s clear from the anime that all roads lead to a final showdown between the Hashira and Muzan’s army of demons, including the Upper Ranks.\nAs the name suggests, that sees the Infinity Castle – Muzan’s HQ – come into play, with the eternal battle between demons and demon slayers being brought to a definitive end here. You won’t want to miss this.\nThe new trailer even reveals which fights we'll be seeing on the big screen. Akaza is returning from Mugen Train to do battle with Tanjiro; Shinobu will face the demon who killed her sister, and Zenitsu confronts Kaigaku.\nThis is the list of arcs so far and how Infinity Castle fits into the bigger picture:\n- Demon Slayer season 1 (Unwavering Resolve arc – Chapters 1-53)\n- Demon Slayer season 2 (Mugen Train and Entertainment District arcs – Chapters 54-97)\n- Demon Slayer season 3 (Swordsmith Village arc – Chapters 98-127)\n- Demon Slayer season 4 (Hashira Training arc – Chapters 128-136)\n- Demon Slayer: Infinity Castle movie trilogy (Infinity Castle and Sunrise Countdown arcs – Chapters 137-204)\nIs Demon Slayer season 5 happening? And is Infinity Castle the finale?\nTo avoid any confusion: no, Demon Slayer: Infinity Castle is not Demon Slayer season 5. We're getting three movies to wrap up the series in cinemas instead.\nDemon Slayer: Infinity Castle is definitely the final arc, however, with Tanjiro, Inosuke, and Zanitsu’s stories drawing to a close once the anime ends. But it's not going to be on television; it's a theatrical exclusive and, for all intents and purposes, replaces what would have been Demon Slayer season 5 in terms of chronology.\nThat’s not to say the saga can continue elsewhere but, right now, Ufotable is only adapting the story of Koyoharu Gotouge’s official manga, which ended in May 2020.\nDemon Slayer: Infinity Castle movie trailer and poster\nThe first main trailer for Demon Slayer Infinity Castle focuses on endings.\n'The Final Battle Begins' reads the text accompanying the trailer, with renewed focus on Tanjiro's upcoming showdown with Akaza, who was the demon behind Rengoku's killing in 2020's Mugen Train.\nThe teaser also featured the reveal of two themes in Infinity Castle, performed by prolific artists LiSA and Aimer respectively.\nIn recent months, we've also seen some incredible posters. One, released at SDCC, focuses on Akaza, while also confirming North American tickets go on sale this August.\nA Place Where Only the Strong StandDemon Slayer: Kimetsu no Yaiba Infinity Castle reveals new visual at @Comic_Con and announces tickets for North America go on sale August 15! ✨#SDCC2025 pic.twitter.com/twvZcQJs7sJuly 27, 2025\nDemon Slayer: Infinity Castle cast: expected returning characters for the movie trilogy\nThe Demon Slayer Infinity Castle cast hasn’t been locked in yet but, like Tanjiro’s keen sense of smell, we’ve got a gut feeling that these will all be returning in some form or capacity throughout the trilogy.\nHere's who we think will return:\n- Natsuki Hanae - Tanjiro Kamado\n- Akari Kito - Nezuko Kamado\n- Hiro Shimono - Zenitsu Agatsuma\n- Yoshitsugu Matsuoka - Inosuke Hashibira\n- Reina Ueda - Kanao Tsuyuri\n- Nobuhiko Okamoto - Genya Shinazugawa\n- Takahiro Sakurai - Giyu Tomioka\n- Katsuyuki Konishi - Tengen Uzui\n- Kengo Kawanishi - Muichiro Tokito\n- Saori Hayami - Shinobu Kocho\n- Kana Hanazawa - Mitsuri Kanroji\n- Kenichi Suzumura - Obanai Iguro\n- Tomokazu Seki - Sanemi Shinazugawa\n- Tomokazu Sugita - Gyomei Himejima\n- Akira Ishida - Akaza (Upper Three)\nIn terms of the English dub voice cast, it looks like the original cast from the Demon Slayer series will reprise their roles in the Demon Slayer movie trilogy. However, it is not clear if all characters listed will appear in Infinity Castle. But there are some new faces too. Self-confessed superfan Channing Tatum has joined the lineup as Keizo, and Rebecca Wang has been cast as the voice of Koyuki, as confirmed by the official Demon Slayer site.\nWhen Tatum's casting was first announced, fans were not happy with a big Hollywood name being involved in the project. However, it is important to note that Tatum voicing a minor character as is a fan of the series himself.\nCheck out the full Demon Slayer: Infinity Castle English dub voice cast below:\n- Zach Aguilar - Tanjiro Kamado\n- Abby Trott - Nezuko Kamado\n- Aleks Le - Zenitsu Agatsuma\n- Bryce Papenbrook - Inosuke Hashibira\n- Brianna Knickerbocker - Kanao Tsuyuri\n- Zeno Robinson - Genya Shinazugawa\n- Johnny Yong Bosch - Giyu Tomioka\n- Ray Chase - Tengen Uzui\n- Griffin Burns -Muichiro Tokito\n- Erika Harlacher - Shinobu Kocho\n- Kira Buckland - Mitsuri Kanroji\n- Erik Scott Kimerer - Obanai Iguro\n- Kaiji Tang - Sanemi Shinazugawa\n- Crispin Freeman - Gyomei Himejima\n- Lucien Dodge - Akaza\n- Channing Tatum - Keizo\n- Rebecca Wang - Koyuki\nWhere to watch Demon Slayer: Infinity Castle\nDemon Slayer: Infinity Castle will air exclusively in cinemas as a big-budget affair, with the possibility of it streaming on Crunchyroll a few months down the line. A Netflix release could also come later.\nFor more, check out the best anime and best anime movies you should be watching right now, plus our list of best anime on Netflix and best anime on Crunchyroll.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Megan GarsideEditorial Associate, GamesRadar+\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/anime-shows/solo-leveling-just-broke-a-crunchyroll-record-we-thought-would-never-be-beaten/",
      "text": "Solo Leveling just broke a Crunchyroll record we thought would never be beaten\nSolo Leveling has raced past One Piece and Demon Slayer\nSolo Leveling season 2 was always to be popular – but we never thought it would reach these sorts of heights on anime streaming service Crunchyroll.\nAs noted by Forbes, Solo Leveling is now the anime series with the most user reviews on Crunchyroll.\nIt's currently on over 600,000 reviews. By comparison, the previous record holder was One Piece's 596,000 reviews. That also had the added benefit of being around for decades and consisting of over 1,000 episodes.\nBeyond that, its nearest contender is the mighty Demon Slayer, and even that's lagging behind with a total of 588,000 reviews. Though we expect the pair to have a close-fought battle with the impending release of Demon Slayer Infinity Castle.\nSo, in case there was ever any doubt – Solo Leveling is not only one of the biggest new anime of recent years, it's fast becoming a major force in its own right.\nThe series, based on a web novel written by Chugong, follows the world's weakest hunter Sung Jinwoo. After getting defeated once more in humbling fashion, he gets a surprising reversal in fortunes – thanks to an assist from something called the 'System', a program that allows him to level up in a world filled with fearsome foes and nasty monsters.\nSolo Leveling's second season is set to come to an end later this month. While we wait on bated breath for a third season announcement, be sure to check out the Solo Leveling season 2 release schedule.\nBringing all the latest movie news, features, and reviews to your inbox\nFor a wider look at the some of the best anime around, you'll need our guides on Jujutsu Kaisen season 3 and Frieren: Beyond Journey's End season 2.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/new-anime-2024-release-dates-upcoming-schedule/",
      "text": "New anime in 2025: the biggest upcoming and ongoing shows, including release dates\nHere are the dozens of biggest new anime shows and movies to look forward to in 2025\nThe fall season of new anime shows is nearly upon us, with big names such as Demon Slayer, Chainsaw Man, and Pokemon just weeks away from hitting our screens. Beyond that, there are dozens more new and ongoing anime releases to get excited about in the coming months, right up until 2026.\nThat might sound intimidating. To help guide you through the summer/fall anime seasons and beyond, you'll find a complete guide to the major new anime releases and ongoing shows hitting television and cinema screens in 2025 below. Everything from Spy x Family to My Hero Academia is covered ahead in our calendar of release dates from anime's summer and fall seasons. Then, we've got a larger and more in-depth entry-by-entry A-Z look at what's coming this year and also in 2026.\nOnce you’re done, be sure to check out our picks for the best anime and best anime movies, plus all the latest on four major names coming soon: Jujutsu Kaisen season 3, the Chainsaw Man movie, Demon Slayer Infinity Castle movie trilogy, and One-Punch Man season 3.\nNew and ongoing anime in 2025\nJust a quick note before we start: anime is traditionally divided into four seasons: winter (January-March), spring (April-June), summer (July-September), and fall (October-December).\nTo start, let's begin with what has already landed as part of the winter schedule, including the year's first major release, Solo Leveling season 2.\nWinter 2025 anime release dates\n- Blue Box cour 2 (Ongoing from January 2, 2025)\n- Blue Exorcist: The Blue Night Saga (Ongoing from January 4, 2025)\n- Dragon Ball Daima [finished]\n- Solo Leveling season 2 (Ongoing from January 4, 2025) [finished]\n- Zenshu (Ongoing from January 5, 2025) [finished]\n- Dr. Stone season 4 (Ongoing from January 9, 2025)\n- The Apothecary Diaries season 2 (Ongoing from January 10, 2025)\n- The Colors Within (January 24, 2025) [MOVIE]\n- ReZero season 3 (Ongoing from February 5, 2025) [finished]\n- Pokemon Horizons: The Series Part 2 (Ongoing from February 7, 2025)\n- Attack on Titan The Movie: The Last Attack (February 10, 2025)\nSpring 2025 anime release dates\n- Devil May Cry (April 3, 2025)\n- Wind Breaker season 2 (April 3, 2025)\n- Fire Force season 3 (April 4, 2025)\n- Black Butler -Emerald Witch Arc- (April 5, 2025)\n- Lazarus (April 5, 2025)\n- One Piece: Egghead arc (April 5, 2025) [ongoing]\n- Witch Watch (April 6, 2025)\n- My Hero Academia: Vigilantes (April 7, 2025)\n- Mobile Suit Gundam GQuuuuuuX (April 8, 2025)\n- Moonrise (April 10, 2025)\n- Yu-Gi-Oh GX 20th anniversary remaster (April 2025)\n- Lost in Starlight (May 30, 2025)\n- Beastars season 3, part 2 (Early 2025)\nSummer 2025 anime release dates\n- Dan Da Dan: Evil Eye (June 7, 2025)\n- Reborn as a Vending Machine, Now I Wander the Dungeon season 2 (July 2, 2025)\n- Dan Da Dan season 2 (July 3, 2025)\n- My Dress-Up Darling season 2 (July 5, 2025)\n- Rent-A-Girlfriend season 4 (July 5, 2025)\n- The Summer Hikaru Died (July 5, 2025)\n- Gachiakuta (July 6, 2025)\n- Rising of the Shield Hero season 4 (July 9, 2025)\n- Dr. Stone Science Future part 2 (July 10, 2025)\n- Sakamoto Days part 2 (July 14, 2025)\n- Jujutsu Kaisen: Hidden Inventory/Premature Death movie (July 17, 2025)\n- Kaiju No. 8 season 2 (July 19, 2025)\n- My Melody & Kuromi (July 24, 2025)\nFall 2025 anime release dates\n- Pokemon Concierge Part 2 (September 4, 2025)\n- Demon Slayer Infinity Castle (September 12, 2025)\n- Chainsaw Man – The Movie: Reze Arc (October 29, 2025)\n- Disney Twisted-Wonderland (October 2025)\n- My Hero Academia season 8 (October 4, 2025)\n- One Punch Man season 3 (October 2025)\n- Spy x Family season 3 (October 2025)\n2025 and 2026 anime release dates (TBA)\n- Bleach: Thousand-Year Blood War part 4 (TBC 2026)\n- Fate/strange Fake (TBC)\n- Fire Force season 3, part 2 (January 2026)\n- Frieren: Beyond Journey's End season 2 (January 2026)\n- Haikyuu VS The Little Giant (TBC)\n- Jujutsu Kaisen season 3 (TBC)\n- Moonrise (TBC)\n- Oshi no Ko season 3 (2026)\n- Sekiro: No Defeat (2026)\n- Tokyo Revengers: War of the Three Titans (TBC)\n- Witch Hat Atelier (TBC)\nCrunchyroll\nWhatever country you're in, it's easy to sign up to Crunchyroll and start working your way through its massive anime library – just head to the website here.\nAnd don't forget that new customers are also able to take advantage of the service's 14-day FREE trial, letting you effectively try before you buy.\nAnime shows out in 2025\nBelow is a look ahead to the major upcoming anime shows coming your way in 2025. It ranges from the likes of Netflix's Devil May Cry, a new season of Dan Da Dan, and sci-fi drama Lazarus.\nBeastars season 3, part 2\nRelease date: Early 2025\nWhere to watch Beastars season 3: Netflix\nBringing all the latest movie news, features, and reviews to your inbox\n2025 marks the year when we say goodbye to Beastars, the anime set in a world of anthropomorphic animals, looking at the rising tensions between carnivores and herbivores. The series focuses on the affable grey wolf Legoshi and his complicated relationship with rabbit Haru at the Cherryton school. The final season has introduced a new villain, Melon, and will finish adapting the remainder of Paru Itakagi's manga\nBleach: Thousand-Year Blood War part 4\nRelease date: 2025\nWhere to watch Bleach: Thousand-Year Blood War part 4: Hulu/Disney Plus\nYes, Bleach is still going, and, yes, it's still amazing. The adaptation of the final arc continues with the fourth and final part of Bleach: Thousand-Year Blood War as the long-running anime comes to a close in 2025.\nFor more, check out our guide on how to watch Bleach in order.\nBlue Exorcist season 4\nRelease date: January 5, 2025\nWhere to watch Blue Exorcist season 4: Crunchyroll\nBlue Exorcist fans sure have been patient. The first season premiered way back in 2011 and the second season arrived in 2017. After another long break, the third season arrived in 2024 and the fourth season continues with an adaptation of the Blue Night Saga from January.\nDan Da Dan season 2\nRelease date: July 3, 2025\nWhere to watch Dandadan: Netflix/Crunchyroll\nThe extraterrestrial adventures of Momo and Okarun - who believe in spirits and UFOs respectively before coming into contact with poltergeists and extraterrestrials amid a budding romance - continues for a second season. It's expected to adapt the Cursed House and Evil Eye arcs. Check out our initial verdict with our Dan Da Dan review.\nDevil May Cry\nRelease date: April 3, 2025\nWhere to watch Devil May Cry: Netflix\nIt's taken a few years for Dante to come to our screens but we're almost there. Of course, the devil is in the detail but it all sounds promising enough: The adaptation of the iconic hack-and-slash Capcom game is heading our way in April and will feature a younger Dante.\nIt's brought to life by Studio Mir, best known for its work on The Legend of Korra. Curious? The synopsis might whet your appetite further: \"Sinister forces are at play at the portal between the human and demon realms. In the middle of it all is Dante, an orphaned demon hunter for hire, unaware that the fate of both worlds hangs around his neck.\"\nDr. Stone season 4\nRelease date: January 9, 2025 [on break until July 10]\nWhere to watch Dr. Stone season 4: Crunchyroll\nAlso known as Science Future, the fourth season of Dr. Stone – one of 2025's first big releases – follows Senku's continuing scientific journey. This season, he reaches for the stars and aims to fulfil a lifelong ambition of making it to the moon. As such, we anticipate Science Future to head into orbit by adapting the Moon Mission arc, with a third cour to round out the adventures of Senku in the near future.\nDragon Ball Daima\nRelease date: Out now\nWhere to watch Dragon Ball Daima: Crunchyroll\nA new Dragon Ball series was announced back in 2023 to commemorate the franchise's 40th anniversary. Before his death, Akira Toriyama revealed that the show will take place in a \"new world\" after Goku and his friends are \"turned small\".\nFor more, read of guide on how to watch Dragon Ball in order and the Dragon Ball Daima release schedule.\nFate/strange Fake\nRelease date: 2025\nWhere to watch Fate/strange Fake: Crunchyroll\nThe latest instalment in the Fate series, Fate/strange Fake sees a new Holy Grail War kicks off and features more Servants from history brought into the fray. It's set to follow on from the Whispers of Dawn movie, which saw all hell break loose in the town of Snowfield in America.\nFire Force season 3\nRelease date: April 4, 2025\nWhere to watch Fire Force season 3: Crunchyroll/Netflix\nFire Force is about to go out in a blaze of glory. The third and final season of the firefighting anime begins this April on Crunchyroll and continues the exploits of Tokyo's Company 8 as they battle raging infernos and discover more about the mysterious 'sigma'. The final season is set to conclude next January, so get ready to mark that down as one of 2026's hottest series\nFrieren Beyond Journey's End season 2\nRelease date: January 2026\nWhere to watch Frieren Beyond Journey's End season 2: TBA\nGiven how its first season is one of the highest-rated anime of all time, the hype for Frieren Beyond Journey's End season 2 is through the roof.\nIts 2026 release date was confirmed in March alongside key art that shows Frieren, Stark, and Fern resting their feet in water.\nThe first season revolved around mage Frieren and her journey to say farewell to deceased friend and hero, Himmel. Along the way, she encounters new friends and ruminates on how she will outlive everyone she cares about.\nJujutsu Kaisen season 3\nRelease date: TBA\nWhere to watch Jujutsu Kaisen season 3: TBA\nJujutsu Kaisen season 3 will adapt the Culling Game arc, which sees sorcerers and newly-awakened sorcerers alike pitted against each other in a battle royale-style tournament. Given it's been a no-show throughout 2025, however, we don't expect it to drop until next year.\nKaiju No. 8 season 2\nRelease date: July 19, 2025\nWhere to watch Kaiju No. 8 season 2: Crunchyroll\nOne of the most popular manga of recent years, Kaiju No. 8, received an anime adaptation from Production I.G. (Haikyu, Ghost in the Shell).\nIn a world devastated by continual kaiju attacks, Kafka Hibino sets about finally making the grade for the Defense Force. Until now, he's only part of Monster Sweeper, the clean-up crew, while his childhood friend Mina Ashiro makes captain. After an incident, Kafka has to hide a monstrous secret from his friends and co-workers. A second season now streaming.\nLazarus\nRelease date: April 5, 2025\nWhere to watch Lazarus: Adult Swim\nBrought to life by Cowboy Bebop director Shinichirō Watanabe, Lazarus is one of the more intriguing new anime shows this year. It centres on a miracle drug that's soon revealed to be a death sentence for those who have taken it. Soon, the hunt is on for the doctor responsible and the life-saving Lazarus vaccine.\nWatanabe has already described it as his 'masterpiece', while John Wick director Chad Stahleski is 'heavily involved' in designing the show's action sequences.\nMobile Suit Gundam GQuuuuuuX\nRelease date: April 8, 2025\nWhere to watch Mobile Suit Gundam GQuuuuuuX: Prime Video\nIf you can overlook its bizarre title, Mobile Suit Gundam GQuuuuuuX has the potential to be one of the spring season's sleeper hits. It's packed with all the mecha thrills you could want from the Gundam series, as well as unburdening itself from its current universe and timeline for a brand new compelling tale, one that sees a young boy on the run with a titular Gundam in tow. Throw in a dream team of talent, including Evangelion's Hideaki Anno, and Mobile Suit Gundam GQuuuuuuX could be on to a winner on Amazon.\nMoonrise\nRelease date: April 10, 2025\nWhere to watch Moonrise: Netflix\nOne of the more overlooked anime releases this year, Moonrise revolves around Jack, a man who enlists in the army after the loss of his family thanks to rebel fighters based on the moon. However, he soon finds out that his former best friend is now on the opposite side of the war. It's being brought to life by Attack on Titan's WIT Studio.\nMy Hero Academia season 8\nRelease date: October 4, 2025\nWhere to watch My Hero Academia season 8: Crunchyroll\nThe long-running superhero anime is finally coming to an end in 2025 with My Hero Academia season 8. While details are scant at the time of writing, we expect it to adapt to the very end of Kohei Horikoshi's manga, which encompasses the fittingly-titled Final War arc and the much briefer Epilogue arc.\nMy Hero Academia: Vigilantes\nRelease date: April 7, 2025\nWhere to watch My Hero Academia: Vigilantes: Crunchyroll\nMy Hero Academia may be finishing up this year, but there's plenty of life left in the superhero shonen.\nVigilantes is an adaptation of Hideyuki Furuhashi and Betten Court's manga and revolves around three vigilantes who use their Quirks to fight off evil-doers.\nOne Piece: Egghead Arc\nRelease date: April 5, 2025\nWhere to watch One Piece: Netflix/Crunchyroll\nOne Piece, the long-running anime featuring wannabe Pirate King Monkey D. Luffy as he searches far and wide for the mythical One Piece alongside his Straw Hat crew, has crossed the 1000-episode mark. It's now adapting the Egghead island arc, and returned from a months-long hiatus in April.\nNetflix's synopsis reads, \"A new adventure unfolds on Future Island 'Egghead', home to the lab of genius scientist Dr. Vegapunk. What awaits the Straw Hat Crew there?\"\nOne Piece remake\nRelease date: TBA\nWhere to watch the One Piece remake: Netflix\nOver 1,000 episodes later, One Piece has become one of the most daunting marathons in television history. Netflix is attempting to get new fans engaged in one of the best anime around as it partners with Studio Wit on a complete remake of the series, which sees Monkey D. Luffy and his Straw Hats sail the Grand Line in search of the mythical One Piece treasure.\nStudio Wit's president has already pointed to modernization as a key driving force behind the remake, and we're excited to see how it all pans out in future.\nOne-Punch Man season 3\nRelease date: October 2025\nWhere to watch One-Punch Man season 3: TBA\nIt's been a minute but we expect to see more from Saitama and his penchant for knocking out supervillains with, you guessed it, just one punch. The hype surrounding the show had died down a little but an incredible new trailer increased our expectations for the continued adaptation of the Monster Association arc.\nOshi no Ko season 3\nRelease date: 2026\nWhere to watch Oshi No Ko season 3: TBC\nTo spoil Oshi No Ko's premise would do a disservice to what was one of the most mindblowing twists in recent years. Needless to say, we'll keep it brief: the anime focuses on two twins who find themselves embroiled in the world of pop idols, all deliciously wrapped up in a murder mystery. The second season arrived in 2024, but we'll now have to wait until 2026 for a return to the stage.\nPokemon Concierge Part 2\nRelease date: September 4, 2025\nWhere to watch Pokemon Concierge: Netflix\nIt's time to head back to the idyllic, sun-kissed Pokemon Resort as Haru and her colleagues help solve a summer's worth of Poke-problems in a second helping of this adorable stop-motion series.\nPokemon Horizons: The Series Part 2\nRelease date: Out now\nWhere to watch Pokemon Horizons: The Series: Netflix/BBC\nSo long, Ash! The winding road that saw Pallet Town's favorite son finally become a Pokemon Master came to an end last year. Now, Pokemon Horizons kicks off a new era, and sees introverted Liko travel the world with the swashbuckling Mighty Volt Tacklers - and its Captain Pikachu. The second part is titled The Search for Laqua and follows Liko and Roy's journey to track down the remaining Hero 'mon as they travel to Laqua. It's out now on Netflix in the US, and there's even a sequel series (Mega Voltage) in the works.\nIf you want to know how the new series fits into the story so far, check out our guide on how to watch Pokemon in order.\nRanma 1/2 season 2\nRelease date: TBC\nWhere to watch Ranma 1/2: Netflix\nThe remake of beloved '90s anime Ranma 1/2 was released on Netflix in 2024. As the synopsis suggested, we went for typically madcap ride from one of the medium's zaniest setups: \"After training, Ranma acquires a mysterious constitution that allows him to turn back into a woman when poured with water, and a man when poured with hot water.\"\nConfusing matters further, Ranma then falls for a young female martial artist called Akane and the two are betrothed. A second season of the unique romcom was announced, but there's no news yet on when it's dropping.\nRe: Zero season 3\nRelease date: February 5, 2025\nWhere to watch Re:Zero season 3: Crunchyroll\nRe:Zero returned for the second part of its third season in February. As you can imagine from Subaru's powers to cheat death, it's not going to get any easier for our hero in the kingdom of Lugunica.\n\"He savors a life of fulfillment while Emilia’s camp stands united for the royal selection—until a fateful letter arrives,\" the synopsis for the third season reads. \"Anastasia, a royal selection candidate, has invited Emilia to the Watergate City of Priestella. But as the party begins its journey, crisis stirs beneath the surface and Subaru meets a cruel fate once again.\"\nFor more, check out the Re:Zero season 3 release schedule.\nSakamoto Days\nRelease date: January 11, 2025 [on break until July 14]\nWhere to watch Sakamoto Days: Netflix\nNetflix laid out its 2025 anime plans, with Sakamoto Days sitting pretty at the top of its sprinkling of releases in January. The show is back for a second part in July, too.\nBased on a manga from Yuto Suzuki, Sakamoto Days turns the John Wick fantasy on its head. The titular character Sakamoto, after all, was once a for-hire killer. However, he retired, got married, and left the assassin game behind. But with fellow hitmen on his tail, the now-doughy Sakamoto must pick up his weapon once more to protect his family.\nFor the latest on the show's release plans, check out the Sakamoto Days release schedule.\nSekiro: No Defeat\nRelease date: 2026\nWhere to watch Sekiro: No Defeat: Crunchyroll\nAn anime adaptation of FromSoftware's sword-slashing masterpiece is currently in the works.\n\"The final product is being crafted to be a truly memorable experience, one that will leave a lasting impression on both dedicated fans of the game and those who are discovering the world of Sekiro for the very first time. Please look forward to it,\" director Kenichi Kutsuna said (via Crunchyroll).\nA first trailer was also revealed at Gamescom's Opening Night Live.\nSolo Leveling season 2\nRelease date: January 4, 2025\nWhere to watch Solo Leveling season 2: Crunchyroll\nSolo Leveling season 2 concluded earlier this year. Continuing Jin-Woo's dungeon-dwelling adventures with the System at his side, this shonen feels like it's on the cusp of a breakout year in 2025. But how will he cope with his newfound abilities as the Shadow Monarch and, worse still, S-Rank demons breaking free from their surroundings?\nIf you're curious as to what's next for the series, we have a guide on Solo Leveling season 3.\nSpy x Family season 3\nRelease date: October 2025\nWhere to watch Spy x Family season 3: Crunchyroll (TBC)\nAnnounced at Jump Festa 2025, Spy x Family is set to hit our screens for a third season in October.\nThe upcoming season will continue to follow the trials and spy tribulations of the Forgers, including Loid, Yor, and Anya. It's expected to adapt the manga's Friendship Schemes and Red Circus arcs.\nUntitled Cyberpunk anime\nRelease date: TBA\nWhere to watch Cyberpunk: Netflix\nWelcome back to Night City, chooms. Given the success of Cyberpunk: Edgerunners, it should come as little surprise to hear that Netflix and CD Projekt Red are teaming up for a new project.\nWhile we know very little about the series just yet, we suspect it won't be a direct sequel to Edgerunners, given how that show ended. Watch this space.\nYu-Gi-Oh GX 20th Anniversary\nRelease date: April 2025\nWhere to watch Yu-Gi-Oh GX: TBA\nNo, you're not seeing things. It's time to duel – again. Set after the iconic adventures – and Shadow Realm games – of Yugi Moto, Yu-Gi-Oh GX sees Duel Academy student Jaden Yuki learning the ropes and making new friends as he aims to beat a new generation of duelists.\nThe 'new' series is actually a 20th anniversary remaster of the iconic anime.\nZenshu\nRelease date: January 5, 2025\nWhere to watch Zenshu: Crunchyroll\nThe first trailer for Zenshu had us very excited. The new undated anime, from Studio MAPPA, follows the plight of Natsuko, a talented young anime artist suddenly thrust into directing her first feature movie.\nDespite that being an unbridled success, Natusko's next project isn't so easy. As per the show's synopsis: \"Her next project is set to be a romantic comedy movie themed around first love. However, having never been in love herself, Natsuko struggles to understand the concept of first love, and as a result, she’s unable to create the storyboard, causing the movie production to come to a standstill.\"\nAnime movies out in 2025\nWe're getting several big anime movie releases in 2025, including entries from Attack on Titan, Chainsaw Man, and Demon Slayer. All told, there's plenty to be excited about. Here's a rundown of the anime movies scheduled to release in the next 12 months.\nAttack on Titan The Movie: The Last Attack\nRelease date: February 10, 2025 (out now)\nWhere to watch Attack on Titan The Movie: The Last Attack: Cinemas\nSurprise! Attack on Titan is ending. Again. A new movie, which brings together the final two chapters of the worldwide anime phenomenon, was released for a limited run in February. Promising improved visuals and 5.1 surround sound, this is going to be the definitive way to watch how Eren's story comes to a close. There's even a new post-credits scene as part of the feature package.\nChainsaw Man - The Movie: Reze Arc\nRelease date: October 29, 2025\nWhere to watch Chainsaw Man - The Movie: Reze Arc: Cinemas\nIn a slight surprise, Chainsaw Man isn't getting a second season - not yet, anyway. The next manga arc (affectionately titled Bomb Girl by readers) will be adapted as a movie. It'll continue the bloody, gruesome travels of Denji, who dies and fuses with the devil dog Pochita to become Chainsaw Man. Naturally. A release date for Japanese cinemas was announced during AnimeJapan 2025 and it's coming to the west this October.\nDemon Slayer: Infinity Castle\nRelease date: September 12, 2025\nWhere to watch Demon Slayer: Infinity Castle: Cinemas\nDemon Slayer is coming to an end with a trilogy of movies adapting the Infinity Castle arc. We can expect showdowns galore as Tanjiro and the remaining Hashira are drawn into Muzan Kibutsuji's titular Infinity Castle in this final act. It's hitting cinemas in September in the US and UK, though it has a seriously convoluted, staggered release plan.\nInfinity Castle is already out in Japan, with first reviews calling it \"fantastic\" but \"flawed.\" The studio has also warned against piracy and illegal recordings of the movie.\nHaikyuu VS The Little Giant\nRelease date: TBA\nWhere to watch Haikyuu VS The Little Giant: Cinemas\nHinata's journey 'to the top' continues in the second major feature film from the volleyball anime series.\nThis time, the pint-sized player's Karasuno team comes face to face with another 'little giant' in the shape of ace Hoshiumi and the rest of the Kamomedai High squad.\nJujutsu Kaisen: Hidden Inventory/Premature Death\nRelease date: July 16, 2025\nWhere to watch Jujutsu Kaisen: Hidden Inventory/Premature Death: Cinemas\nJujutsu Kaisen is following a recent anime tradition by bundling some of its episodes together in a big-screen outing as a stopgap ahead of a new season.\nIn this instance, it's Gojo and Geto's Hidden Inventory/Premature Death prequel arcs from Jujutsu Kaisen season 2.\nLost in Starlight\nRelease date: May 30, 2025\nWhere to watch Lost in Starlight: Netflix\nLost in Starlight is giving us Your Name vibes, and that's no bad thing.\nThe Korean film from Han Ji-won sees astronaut Nan-young (voiced by Kim Tae-ri) fall for musician Jay (Hong Kyung) in 2050s Seoul. But as Nan-young sets off for Mars, the pair tangle with being split apart by a galaxy of stars. Need more convincing? Parasite director Bong Joon-ho has called it a \"visual masterpiece.\" High praise, indeed...\nThe Colors Within\nRelease date: January 24, 2025\nWhere to watch The Colors Within: Cinemas\nDirected by Naoko Yamada, who helmed anime classic A Silent Voice, The Colors Within, the coming-of-age tale brings together three music-mad teenagers who find solace and community as their paths eventually cross.\nChief among them is Totsuko, who comes bundled with a colorful talent: she 'sees' people and their emotions represented by a color.\nAfter meeting Kimi, she soon follows her passions and starts a band with fellow misfit Rui. You can watch the first trailer for The Colors Within now.\nThe Witcher: Sirens of the Deep\nRelease date: February 11, 2025 (out now)\nWhere to watch The Witcher: Sirens of the Deep: Netflix\nGeralt is back! This time, he's voiced by The Witcher game voice actor Doug Cockle for this adventure that takes place during the events of The Witcher season 1.\nIn Sirens of the Deep, Geralt is caught between two warring kingdoms after investigating a series of attacks. On one side, humans. On the other? The watery merpeople. A new clip was released during 2024's Netflix Geeked week.\nFor more, check out own interview with Cockle as he talks bringing over his game Geralt into the Netflix universe.\nFor more, check out all the new TV shows and movie release dates to look forward to in 2025.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/anime-shows/after-attempts-at-lord-of-the-rings-and-star-wars-anime-one-producer-is-pissed-off-by-hollywood-requesting-everything-be-turned-into-an-anime-there-are-too-many-works-to-check-out/",
      "text": "After attempts at Lord of the Rings and Star Wars anime, one producer is \"pissed off\" by Hollywood requesting everything be turned into an anime: \"There are too many works to check out\"\nAnime is big business, but not everyone is pleased\nNot everyone is pleased by the rapid expansion of anime – not least because, according to some studio bosses, Hollywood sees it as a cheap way to create content.\nSpeaking at a recent Machi Asobi event (via Gigazine, translated by Anime Corner), CoMixWave Films founder Noritaka Kawaguchi (who helped produce several of Makoto Shinkai's films) and the studio's overseas business leader Mie Onishi sat down in conversation to discuss anime's far-reaching growth into the west.\nAfter namechecking the likes of Star Wars, Lord of the Rings and Scott Pilgrim, Kawaguchi groused, \"There are a little too many works to check out. I have to watch Japanese anime and I also have to read [Shonen] Jump.“\nOnishi replied, \"That’s right… That’s why it’s not a good idea to animate everything. Anime is just one method, not a genre. In fact, what I hate these days is that when I talk to people in Hollywood, they ask me, ‘Can’t you make this as an anime?’ What lies behind this is something like, ‘It’s cheap if it’s an anime,’ which really pisses me off.\"\nOnishi then went on to mock a request from a Hollywood executive, saying, \"It would cost 20 billion yen to make a live-action movie, so can’t you make it an anime?'\"\nThe proliferation of anime has increased in recent years. Previously, Studio Ghibli and the works of Your Name director Makoto Shinkai stood (mostly) alone from the medium, but a concerted effort has been made to translate anime's popularity into Western properties.\nChief among them is Star Wars, with its Disney Plus show Star Wars Visions. A Lord of the Rings movie – 2024's War of the Rohirrim – also tried to capitalize on the increased attention anime has been getting in recent years with the likes of Solo Leveling, Attack on Titan, and Demon Slayer breaking more into the mainstream.\nFor more, check out the new anime coming your way this summer, plus all our picks of the best anime to watch right now.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/best-anime/",
      "text": "Best anime: 25 shows to watch in 2025\nFrom popular shows to cult classics, these are our essential picks for the 25 best anime shows to watch right now\nThe best anime shows are always up for debate. There are veterans who will always stick with the same canon of classics, while many will argue for the new generation of shonen series that are dominating the landscape. But which anime shows are really the greatest?\nWe have the answer. Ahead, we'll give you our picks for the best anime to watch in 2025. That includes modern-day masterpieces, slice-of-life shows that still hold up today, and even some genres you might not have experienced yet, including my favorite sports series, Haikyuu.\nBelow, there's everything you need to find your next anime favorite. For more, you can also check out the latest on One Punch-Man season 3 or My Hero Academia season 8. We also take a deep dive into the best anime on Crunchyroll for those who want to make the most of their subscription.\nThe 25 best anime shows to watch right now\nAttack on Titan\nBased on a manga series started in 2009 by Hajime Isayama, Attack on Titan's initial premise revolves around humanity's perpetual war against the monstrous Titans that lurk just outside the walls of civilization. Following the death of his mother at a Titan's hands (and jaws), a boy named Eren decides to fight back. What follows is an anime series that is filled with heart-pounding action, nerve-jangling moments of horror, and a body count that would make Game of Thrones blush.\nIt stands taller than most anime for its continued ability to metamorphose amid some truly shocking twists. What began as a seemingly standard 'man vs. monster' anime later transformed into a deeper exploration of morality, revenge, and whether someone should be defined by their history's sins. Essential viewing for all anime fans, especially now that the show has come to a close.\nRead more: Our guides to Attack on Titan: The Movie: The Last Attack, The Last Attack post-credits scene, and how to watch Attack on Titan in order.\nChainsaw Man\nFew anime arrived with as much hype as Chainsaw Man, and few delivered on expectations as effortlessly as the adaptation of Tatsuki Fujimoto's stylish manga. Chainsaw Man revolves around a down-on-his-luck hero named Denji who, thanks to a bizarre twist of fate, is suddenly reborn as a demon-human with the power to transform into a chainsaw-wielding fiend.\nBringing all the latest movie news, features, and reviews to your inbox\nWhat Chainsaw Man lacks in subtlety, it more than makes up for with its brutal action, gang of wildly entertaining cast members, and a cinematic eye that lampoons everything from Quentin Tarantino to The Texas Chain Saw Massacre. With a Chainsaw Man movie on the way this fall, there's no better time to jump into the story of Denji and his lovable chainsaw pooch, Pochita.\nCowboy Bebop\nThe short-lived Netflix live-action series may have soured some on the series, but there's a reason why Cowboy Bebop is almost always seen as shorthand for 'classic anime.' The show's legendary 26-episode run fuses creator Hajime Yatate’s effortless eye for action with composer Yoko Kanno's kinetic jazz soundtrack. The end result? As the show puts it in tongue-in-cheek fashion: \"The work, which becomes a new genre itself, will be called… Cowboy Bebop.\"\nIt has every right to be that confident. The story follows Spike Spiegel and his motley crew of bounty hunters as they attempt to snare some of the galaxy's most wanted criminals in the hope of some woolongs and a warm meal. Each episode explodes in a burst of color and chaos as Spike, the stoic Jet, hair-trigger Faye, energetic Ed, and uber-smart dog Ein move towards their next target in frenetic fashion. Beneath it all, it's tinged with a sense of melancholy, each member of the Bebop crew trapped by their tragic pasts. There's never been a show quite like this. Many have tried to replicate its sense of coolness and charm since. All have failed.\nCyberpunk: Edgerunners\nCyberpunk 2077 landed with a disappointing thud upon its release in 2020. The Netflix anime adaptation Cyberpunk: Edgerunners, set before the events of the CD Projekt Red game, helped form a major part of one of gaming's unlikeliest comeback stories. A breezy 10-episode limited series sees luckless student David Martinez head into the murkier depths of Night City to become an 'edgerunner', a jack-of-all-trades fixer who can live on the edge and lend a hand to some of the dystopian megacity's seedier elements.\nAlong the way, David meets several 'chooms', including netrunner Lucy. It's this relationship that forms the beating heart of Cyberpunk: Edgerunners, but Studio Trigger wisely wraps it up in an impossibly cool setting, flashy animation, and a story filled with megacorps and criminal conspiracies that surprisingly stings hardest when you least expect it to. A true modern classic. It's a little surprise, then, that we're heading back to Night City for a separate Netflix anime in the near future as well as a now confirmed Cyberpunk Edgerunners season 2.\nDan Da Dan\nVery few anime series arrived with as much expectation as Dan Da Dan. Fewer still lived up to the hype right out the gate with a supernatural-infused showcase of why anime is reaching new heights in 2025.\nRevolving around the twin plights of UFO enthusiast Okarun and ghost-believer Momo, the pair grow closer together as they investigate a series of spooky goings-on while, ironically, removing each other's skepticism about the other's occult and extraterrestrial interests.\nBundled with kinetic, poppy style, laugh-out-loud jokes aplenty, and a sense of style that makes it stand out from the crowd, Dan Da Dan is one of the most accomplished anime shows in recent years, and demands to be seen on Netflix.\nFor more, check out the Dan Da Dan season 2 release schedule.\nDeath Note\nIf you're a newcomer to anime and don't know where to begin, start with Death Note. Not only is the English dub just as good as the subtitled version (a real rarity), it's got one of the most recognizable and 'Western' arcs: good-guy-turned-bad, in the vein of a Breaking Bad or Ozark. Light Yagami is a teenager who happens across the titular 'Death Note', a notebook that allows its user to kill anyone anonymously just by writing down their name. Light uses this power to bump off some of Japan's most hardened criminals and, inevitably, starts to dream a little bigger.\nAs the net closes in on Light, a compelling cat-and-mouse game between him and master detective L ensues. A breathless drama that will have you hooked until its very last scene, Death Note deserves to be spoken of in the same breath as some of television’s most talked-about prestige dramas.\nDemon Slayer\nDemon Slayer is the most popular anime on the planet right now – and for good reason: it boasts some of the most exciting and hard-hitting fight scenes ever committed to screen. Animation studio Ufotable has always been renowned for its mastery of action, but it soars past its own lofty standards here. In the hit anime, Tanjiro seeks revenge for his family's death at the hands of demons, leading him down a path to become a member of the Demon Slayer Corps. Throughout Tanjiro's journey, he butts heads with fearsome demons from the Demon Moon clan.\nLike most of the best anime, Demon Slayer juggles its intensity with a sprinkling of genuinely side-splitting moments. Tanjiro's companions, Zenitsu (a cowardly warrior who can only fight when he's asleep) and Inosuke (a hot-headed boy who wears the head of a boar), are always on hand to keep things from ever getting too maudlin. The real highlight here is the show's brutal and balletic demon-versus-demon-slayer showdowns. They're worth the price of admission alone.\nRead more: Our guide to the Demon Slayer Infinity Castle movie trilogy and how to watch Demon Slayer in order.\nDragon Ball\nThere's no denying that Akira Toriyama is the king of Shonen. Dragon Ball is one of the most influential anime out there, laying the way for a ton of different protagonists to follow in Goku's food and fighting-obsessed footsteps. But although watching all of Dragon Ball in order may seem intimidating at first glance (with over 24 movies and 600-plus episodes), what truly makes Dragon Ball a masterpiece is how beginner-friendly it is as an introduction to the Shonen genre.\nAlthough you're probably more familiar with Dragon Ball Z, Dragon Ball was our first introduction to Goku, and we saw him as a kid learning about his Saiyan origins and the power of the Dragon Balls. He sets out to collect all seven magical balls (which summon the dragon Shenron) and combats evil along the way. Dragon Ball is the shortest series in the franchise, but it does a great job laying out the world and is full of charm and laughter. It's a must-watch before you crack on with Dragon Ball Z and then, later, the new anime Dragon Ball DAIMA.\nFate/Zero\nThe Fate/stay night series is a sprawling universe that centers around the Holy Grail, a mythical object that allows whoever obtains it to have their wishes fulfilled. But it's not that easy. Every few generations, magic users – known as Masters – clash in a battle royale-style conflict to get their hands on the Grail. They're aided in that crusade by Servants, legendary warriors pulled from the pages of real-world history and legends, such as Gilgamesh and King Arthur.\nFate/Zero is the perfect starting point for the series. Acting as a prequel to the Fate/stay night anime, the Fourth Holy Grail War features mage assassin Kiritsugu waging war against his fellow Masters. It all culminates in a breakneck rush of entertaining action and plot twists that almost demand the show be binged in one sitting. The best thing? If you like it, there are several movies and series in the Fate universe for you to dive into next.\nFrieren: Beyond Journey's End\nThere's a reason why Frieren: Beyond Journey's End is currently the highest-rated anime of all time. Based on the manga by Kanehito Yamada and Tsukasa Abe, Frieren: Beyond Journey’s End follows the saga of elven mage Frieren who, long after defeating a great evil, returns to see her fellow heroes ravaged by an unstoppable enemy: time itself.\nAs she mourns the loss of one hero, Himmel, she embarks on an epic odyssey of connection, friendship, and belonging in a joyous 28-episode run. A true must-see and, pleasingly, Frieren: Beyond Journey's End season 2 has been announced for 2026.\nFullmetal Alchemist: Brotherhood\nPossibly the greatest anime of all time? It's not hard to see why Fullmetal Alchemist: Brotherhood is so revered thanks to its pitch-perfect blend of world-building, fantasy, action, and drama. After a ritual to bring back their dead mother goes wrong, Edward's younger brother, Alphonse, loses his body, and his soul is trapped inside a suit of armor. As they search for the Philosopher's Stone, they are dragged into a mystic war waged across nations – and a conspiracy that leads to the very heart of their nation's government.\nFMA: Brotherhood's greatest strength lies in its impeccable pacing. It starts off pretty low-key – including that infamous Nina episode – and soon spirals out into epic battles as the seven Homunculi and the mysterious Father stand in Edward's way. It's all wrapped up in the final act that is so inherently bombastic and entertaining that it could only be brought to life in anime.\nHaikyuu\nHaikyuu follows the trials and tribulations of Hinata, a pint-sized volleyball player at Karasuno High harboring lofty ambitions to be the world's best. The magic of Haikyuu, though, is that you don't need to be a fan of volleyball – or sport at all, really – to enjoy it. The show slowly builds up your understanding of the game alongside Hinata, and each season usually climaxes in epic matches that stand alongside any shonen anime in terms of action and raw emotion.\nAs Haikyuu wears on, you'll laugh, cheer, and gasp as Karasuno's eclectic squad – including the miserly perfectionist setter Kageyama and nervous wallflower Sugawara – suffer through the highs and lows of high school volleyball. This is the perfect entry point for those who want to try out sports anime for the first time. The series is set to draw to a close with Haikyuu VS The Little Giant in the near future.\nFruits Basket\nWhile shojo anime can be a bit of a mixed bag, no matter what anime fan you are, you have to admit that Fruits Basket is a touching and well-done story. In fact, it's easily one of the best romance anime around, and the 2019 reboot is especially stunning if you need to pick which version of this classic to watch as well. The show tells the story of a lonely teen girl called Tohru Honda, who begins living in a house with her popular classmate Yuki Sohma and his hot-headed cousin Shigure.\nHowever, there's a twist. It turns out that the spirits of the Chinese zodiac possess her new roommates. With some fun antics around the boys turning into animals during the worst times, laughter is sprinkled throughout an otherwise moving narrative that is packed with tragic backstories and heavy themes. Jealousy, trauma, anxiety, and the pain of fighting against fate are all rolled up into a pretty package here. Fruits Basket proves that shojo anime aren't just wholesome and fluffy affairs; they can easily unpack the darkest and most relatable of human experiences as well.\nJoJo's Bizarre Adventure\nJoJo's Bizarre Adventure is a phenomenon. The anime has already spanned a decade – and continues to this day with Stone Ocean on Netflix and the upcoming Steel Ball Run. The show is an anthology-of-sorts, with each new series telling the tale of another member of the Joestar family, a group imbued with supernatural powers that protect them in their seemingly eternal war against series villain Dio and his many, many disciples.\nThe driving appeal behind JoJo's is its constant ability to reinvent itself. From its first series, through to Stardust Crusaders, and beyond, each season feels like a fresh new anime waiting to be devoured. It's also loud and garish, harkening back to a time when anime was perhaps a little less subdued. As a celebration of the weird and wonderful, with some outright absurd fights thrown in for good measure, you could do a lot worse than JoJo's Bizarre Adventure.\nRead more: How to watch JoJo's Bizarre Adventure in order\nJujutsu Kaisen\nJujutsu Kaisen went from new kid on the block to one of the hottest series in anime in record time. The show revolves around Yuji, a student who becomes embroiled in a world of sorcery and supernatural beings after he, in effect, merges with a 'Curse' being named Sukuna.\nFeaturing thrilling fights, gorgeous visuals, and a story that never loses momentum after a killer first episode, Jujutsu Kaisen is a razor-sharp reinvention of the shonen genre. Last year's second season fired on all cylinders, wowing fans with a further layer of depth and tragedy. It's (probably) the best recent anime around, so well worth checking out. Jujutsu Kaisen season 3 has also been announced.\nRead more: How to watch Jujutsu Kaisen in order.\nMonster\nThanks to anime's proclivity for licensing issues, Monster hasn't had as much acclaim as it so richly deserves. But it's now on Netflix, and you're in for a treat. This is a psychological thriller that burrows its way into your brain and won't leave until long after you've finished the 70-plus episode run.\nMonster sees brain surgeon Kenzo Tenma ostracized after performing a hospital procedure on a young boy instead of the city’s mayor. Soon, bodies start piling up, and Tenma is the prime suspect. Years later, Tenma discovers that the boy he operated on is, in fact, a serial killer. The series deals with Tenma attempting to overcome the fact that he has (inadvertently) created a monster, and what he must do to stop him.\nNeon Genesis Evangelion\nOn the surface, Neon Genesis Evangelion is an anime about a 14-year-old boy named Shinji piloting an 'Eva' mech to save the world from alien threats. Yet, it's far, far deeper than that. What starts as a mecha show soon unravels into an exploration of teenage loneliness, parental abandonment, and mental health issues. Fellow pilots Rei and Asuka also act as in-points for Neon Genesis Evangelion's more mature and introspective themes, with director Hideaki Anno never shying away from the unflinching truths of growing up.\nThat even overruns into the very material itself – its final few episodes, famously, transcend the very boundaries of what you should expect from an anime or any TV show, period. If you thought anime was all about big battles with very little substance, the 1990s classic is here to prove you very wrong. It's a daring, experimental series at a time when the medium was perhaps slightly unwilling to take risks.\nRead more: How to watch Neon Genesis Evangelion in order\nOne Piece\nOK, before we get into this entry, we have to warn you, One Piece isn't just an anime; at this point, it's a lifestyle. With over 1000 episodes (including a sprinkling of One Piece filler), your time will truly be taken by Monkey D Luffy and the rest of the Straw Hat Pirates, but trust us, it's well worth it. One Piece follows the adventures of the rubber-limbed Luffy as he sets out to sail The Grand Line in search of a treasure known as The One Piece and become king of the pirates.\nFew worlds are as colorful and imaginative as the one seen in this anime. From pirate clowns to eccentric villains with powers given by various Devil Fruits, One Piece never gets stale, and even after 1000 episodes and multiple hours, you'll never get bored. Looking at the One Piece manga release schedule and the One Piece Egghead Island release schedule, we're also finally coming towards the end of this epic story, so now is the best chance to start watching the series before the grand finale sails our way.\nRead more: How to watch One Piece in order\nPluto\nBased on the manga by Naoki Urasawa (and itself a remix of an acclaimed Astro Boy arc), Pluto is a gripping sci-fi murder mystery that sees detective Gesicht on the hunt for a serial killer who has been bumping off the world's 'great robots', of which he himself is one. With the clock ticking and a geopolitical powder keg serving as its backdrop, the Netflix series dives headfirst into themes of identity, trauma, and what it means to be human.\nWhere Pluto really kicks into gear, though, is in its juicy premise: with several culprits and an ensemble of richly-drawn cast members (only enhanced by its always-excellent English dub), Pluto charts a similar menacing course to Urasawa's other masterpiece Monster, but infuses it with enough sci-fi sleights of hand and robot trickery to ensure that you'll be hooked from start to exhilarating finish.\nPokemon\nYou may not have realized it at the time, but the Pokemon TV show was very likely your first introduction and gateway drug into the world of anime. Initially revolving around Ash's dream to be a Pokemon Master, the series grew to a behemoth size, encompassing the myriad new 'mon and fresh regions that would be introduced in the game.\nStill, our heart lies with the original clutch of seasons involving Ash, Brock, and Misty. We cheered when Ash got his first gym badge, we cried when he let his Butterfree go, and we hummed along to the inescapable earworm of its theme tune. Its legacy, though, is that it still remains with us – and is a warm hug of an anime that we're happy to return back to today. If you're playing catch-up or simply want to watch 'em all, you'll need our guide on how to watch Pokemon in order.\nRun with the Wind\nRun with the Wind is an anime about running. No, wait, come back! It’s really, really good. The adaptation of a 2006 novel by Shion Miura tells the story of Kakeru, a down-on-his-luck ex-runner who attempts to conquer the Hakone Ekiden relay marathon with his roommates, almost all of whom are beginners.\nAs the show wears on, the hopeless group of runners soon find their rhythm, overcoming personal hurdles in the process. The final stretch of the 23-episode run is among the most tense and gripping on this list, with some genuinely touching moments to boot. An anime about friendship, chasing your dreams, and never giving up, Run with the Wind is a true hidden gem that should appeal to sports and non-sports fans alike.\nSolo Leveling\nWith Attack on Titan rumbling off stage right and Demon Slayer's dying embers being extinguished with its upcoming movie trilogy, anime desperately needed a new hero to step into the fold. Enter: Sung Jinwoo and Solo Leveling, a high-octane, action-packed shonen that will surely become a touchstone for the next generation of anime fans.\nSolo Leveling centers around the story of down-on-his-luck hunter Jinwoo, who suddenly becomes a force to be reckoned with after a chance link-up with The System, a program designed to help rise through the ranks, RPG-style. From there, Solo Leveling fizzes through a series of gripping encounters and crunching story arcs, complete with enough world-building and lore to keep you intrigued well into the upcoming Solo Leveling season 3. It's little wonder, then, that it's currently the most-viewed anime of all time on Crunchyroll.\nSteins;Gate\nFrom its very first moments, Steins;Gate grabs hold of you and doesn't let go. After finding the body of a dead researcher at a time travel conference, 'mad scientist' Rintaro Okabe soon discovers he can send text messages back in time. Unfortunately for Rintaro, this draws the attention of shadowy organizations, who would kill to get their hands on Rintaro's 'D-Mail' device.\nWhat starts as a goofy time travel adventure soon evolves into a fraught, nail-biting drama that's filled with gut punch after gut punch. As the net closes in on Rintaro, he must make an impossible choice to save those close to him. If you enjoy Steins;Gate, there's also the sequel series – Steins;Gate 0 – which is just as brilliant.\nViolet Evergarden\nFollowing a teenage girl as she recovers from injuries suffered while serving in her nation's army, this Netflix anime is a powerful, affecting journey that will have you sobbing like a baby by the time its brief 13-episode run is over.\nDuring the series, the stoic, robot-like Violet Evergarden sheds off the trauma and grief of the war (and her presumed-dead major) to take up letter writing as an 'Auto Memory Doll.' As a scribe, she helps uncover her own emotions while helping others express theirs. Throughout the 'letter of the week' format, mothers become closer to daughters, lovers find the right words to say, and fathers mourn the loss of their children. It's the sort of story that only anime can pull off: a deeply emotional character study on love, loss and longing as Violet slowly becomes more and more human.\nVinland Saga\nThe likes of the God of War reboot and the recent Vikings: Valhalla series on Netflix prove there's plenty of life left in Norse mythology and mythmaking. Vinland Saga takes it a step further, first charting the story of legendary warrior Thors, before his son Thorfinn takes up the mantle.\nRunning parallel to Thorfinn's brutal, personal tale is a Danish quest for supremacy as nations jostle for control of 11th Century Europe. The second season, which aired in 2023, proved Vinland Saga wasn't just a spectacular one-off, taking the show in a brave new direction and reframing its saga as one of pacifism. Let's hope we set sail on Vinland Saga season 3 very soon.\nCrunchyroll\nWhatever country you're in, it's easy to sign up to Crunchyroll and start working your way through its massive anime library – just head to the website here.\nAnd don't forget that new customers are also able to take advantage of the service's 14-day FREE trial, letting you effectively try before you buy.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Mireia MullorContributing Writer\n- Emma-Jane BettsManaging Editor, Evergreens\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Kadokawa’s chief anime officer Daijo Kudo says the publisher plans to expand in the U.S. by producing vampire and zombie‑themed anime that appeal to Western audiences, while continuing its existing strategy of high‑quality animation and multi‑platform monetisation beyond Crunchyroll. The company aims to increase its annual IP output from 6,000 to 7,000 by 2028 and is launching a new production label for overseas creators. Kudo also notes the need for careful negotiation with streaming services as the U.S. market becomes more competitive, and highlights the growing popularity of anime like Demon Slayer, Solo Leveling, and upcoming titles such as One‑Punch Man season 3 and Chainsaw Man movie.”}",
  "argos_id": "VOY2RBUE2"
}