{
  "url": "https://www.nytimes.com/athletic/6578990/2025/08/28/strand-larsen-newcastle-transfer-wolves/",
  "authorsByline": "David Ornstein",
  "articleId": "3b1687fc70bc4ae88e78d5e754a5e79d",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/28063115/jorgen-strand-larsen-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T10:32:10+00:00",
  "addDate": "2025-08-28T10:41:04.284792+00:00",
  "refreshDate": "2025-08-28T10:41:04.284794+00:00",
  "score": 1.0,
  "title": "Jorgen Strand Larsen tells Wolves he wants to leave amid Newcastle bids",
  "description": "Wolves chairman Jeff Shi has informed Strand Larsen that a move would not be possible this window.",
  "content": "Newcastle United target Jorgen Strand Larsen has informed Wolverhampton Wanderers that he wants to leave.\n\nThe St James’ Park club have already had two offers, worth £50million and £55m turned down by Wolves. There has been no third offer as things stand and Wolves’ current stance is that any bid will be rejected.\n\nWolves chairman Jeff Shi has informed Strand Larsen that a move would not be possible this window. Wolves are looking for a striker but view that as supplementary to Strand Larsen, rather than as a replacement for the 25-year-old. If Strand Larsen was to leave, Wolves would have to find two, most likely unproven, players in the closing days of the window, hence their strong stance.\n\nAs reported by The Athletic on August 27, Strand Larsen wants the move to St. James’ Park but is not agitating for the transfer out of respect for Wolves.\n\nNewcastle view Strand Larsen as a replacement for Callum Wilson, who left the club at the end of his contract earlier this summer, rather than Alexander Isak, who wants to leave the club and has not featured for the side this season.\n\nStrand Larsen spent last season on loan at Molineux from Spanish club Celta Vigo and the transfer was made permanent for €27m in July. He has started both of Wolves’ first two Premier League games this season and came off the bench to score twice and give Vitor Pereira’s side a 3-2 win over West Ham United in the Carabao Cup second round on Tuesday.\n\nHe has made 41 appearances for Wolves, scoring 16 goals and providing five assists.\n\nNewcastle have been in search of a striker this summer and have seen several targets move elsewhere. Hugo Ekitike moved to Liverpool, Benjamin Sesko signed for Manchester United, while Joao Pedro and Liam Delap both joined Chelsea. Isak, meanwhile, is still training away from the first team after telling Newcastle he wants to leave and being subject of a bid from Liverpool.\n\nEddie Howe’s team are next in action away against Leeds United in Saturday’s late kick-off, while Wolves host Everton at 3pm.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6577528/2025/08/27/newcastle-wolves-strand-larsen-transfer/",
    "https://www.nytimes.com/athletic/6577712/2025/08/27/strand-larsen-wolves-newcastle-pereira/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Newcastle United target Jorgen Strand Larsen",
      "weight": 0.11902958
    },
    {
      "name": "Strand Larsen",
      "weight": 0.118600965
    },
    {
      "name": "Jorgen Strand Larsen",
      "weight": 0.11534828
    },
    {
      "name": "Wolves",
      "weight": 0.09953705
    },
    {
      "name": "Wolves chairman Jeff Shi",
      "weight": 0.093743995
    },
    {
      "name": "Newcastle United",
      "weight": 0.08999381
    },
    {
      "name": "West Ham United",
      "weight": 0.082189
    },
    {
      "name": "Manchester United",
      "weight": 0.08085667
    },
    {
      "name": "Leeds United",
      "weight": 0.0803306
    },
    {
      "name": "Spanish club Celta Vigo",
      "weight": 0.07989605
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.9716796875
    }
  ],
  "sentiment": {
    "positive": 0.12477313,
    "negative": 0.25094345,
    "neutral": 0.62428343
  },
  "summary": "Newcastle United has been linked with a move for 25-year-old Jorgen Strand Larsen, who has informed Wolverhampton Wanderers that he wants to leave. The club has rejected two offers worth £50m and £55m from Wolves, pending a third rejection. Wolves are currently looking for a striker, but view this as supplementary to Larsen. However, if Larsen is to leave, Wolves would have to find two new players in the closing days of the window.",
  "shortSummary": "Newcastle United target Jorgen Strand Larsen wants to leave Wolves, where two offers from the club have been rejected by Wolves.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "88985c7f4fb642a4a5612ed77822caf3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6577712/2025/08/27/strand-larsen-wolves-newcastle-pereira/",
      "text": "It just had to be Jorgen Strand Larsen.\nIn the kind of plot twist that sport seems to deliver with extraordinary regularity, it felt inevitable that the man at the centre of Wolves’ most intriguing transfer saga of the summer would have a big say in the outcome of the EFL Cup second-round tie against West Ham United.\nAdvertisement\nAs it turned out, the Norway international was decisive in a tie that came to life in the final 20 minutes, having given off distinctly pre-season friendly vibes up until then.\nStrand Larsen’s late brace after stepping off the bench as a second-half substitute secured Wolves’ first win of the season and thrust the Newcastle United transfer target into the limelight. He can expect to remain there over the next week as Wolves and Newcastle dig in for an almighty transfer battle in the final days of trading — the outcome of which remains unclear.\nJust hours after Strand Larsen’s tumbling finish was followed by a towering header to turn a 2-1 deficit into a place in the third round, Wolves rejected a second bid worth £55million ($74m) for the giant No 9. An opening offer of £50m had gone the same way on Monday.\nThe stance of the Molineux hierarchy, led by chairman Jeff Shi, remains unchanged: they are adamant they will not sell Strand Larsen this summer, having paid the balance of a £25m transfer fee to make his move from Celta Vigo permanent just a few weeks ago.\nBut such steadfast positions often prove unsustainable in modern football, as head coach Vitor Pereira tacitly acknowledged in the aftermath of Tuesday night’s drama.\n“Jorgen is our player,” said Pereira in his post-match media conference. “He is a very important player for us. And we’ll see what happens. I understand football. Every player has a price, I believe, even (Lionel) Messi or Cristiano (Ronaldo).”\nFor Wolves, the situation with Strand Larsen is far from straightforward and is one where financial sense and sporting reality meet head-on.\nIn financial terms, a hugely attractive deal is already on the table, and it has the potential to become even more appealing if Newcastle continue to push the limits of their valuation. Wolves have already rejected the chance to make a £30m profit in a year, and that figure seems highly likely to increase in the days ahead.\nAdvertisement\nWith the Wolves owners Fosun’s business model clearly outlined as buying players on an upward career trajectory and eventually selling at a profit, Newcastle are presenting them with the kind of deal that, in terms of money, they ought to accept and even celebrate as a success for their operation.\nYet when it comes to football considerations, it is a deal Shi simply cannot afford to sanction at this moment.\nWolves scored 63 goals in all competitions last season and Pereira has already lost the scorers of more than half of them through the departures of Matheus Cunha, Goncalo Guedes, Rayan Ait-Nouri, Pablo Sarabia, Tommy Doyle and Mario Lemina.\nSelling Strand Larsen would mean the players responsible for 46 of those 63 goals would have left the building.\nIf Wolves had another No 9 in the squad who had waited in the wings behind Strand Larsen, learned about the demands of the Premier League, and was now ready to step up to the challenge of leading the line, the proposal from Newcastle would look a good deal easier to accept.\nSo, too, if Wolves had a new signing ready to move to Molineux with a guarantee of replicating Strand Larsen’s impressive debut season on loan.\nIn reality, the first scenario does not exist and the guarantees that would underpin the second are impossible to give, meaning sanctioning a sale at this stage in the window, at any price, would represent a sporting gamble that could be risky at best, reckless at worst.\nThere is no transfer figure that would change that.\nSo for now, just a few things are clear. Newcastle want Strand Larsen, Wolves are adamant they will not sell, while Strand Larsen would like the deal to happen but has so far been unwilling to agitate for a move out of respect for the club that gave him his chance in the Premier League.\nIrrespective of Pereira’s candid comments, Wolves say their stance will not change. Time will tell how staunchly they can stick to that position if Newcastle increase their bid significantly to a level that might never be on the table again, or if Strand Larsen decides to force their hand. Or, for that matter, if both scenarios come to pass.\nAdvertisement\nAt present, Pereira is confident that the striker will leave his future in the hands of the clubs.\n“In my career, I have known a lot of players in this situation and they just ask me not to play, but Larsen wants to play every time,” added the head coach. “He wants to play and wants to help the team.\n“That means that he has the character, because being a top player is not only about technical things, but also about the character. I have got to know him in the last six, seven or eight months, and I know him very well. He will never, never force (a move).\n“But of course, we know, football is football and we have to be ready for everything.”\n(Top photo: Malcolm Couzens/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6577528/2025/08/27/newcastle-wolves-strand-larsen-transfer/",
      "text": "Newcastle United have seen an improved bid of £55million for striker Jorgen Strand Larsen rejected by Wolverhampton Wanderers.\nThis comes after Newcastle’s opening bid of £50m was turned down by Wolves. The initial bid consisted of straight £50m offer with no add-ons included as part of the proposed deal, and followed what Newcastle feel were positive discussions behind the scenes.\nAdvertisement\nWolves’ stance remains that any bid for the Norway international this summer will be rejected given his importance to the club and there is not enough time remaining in the transfer window to find a replacement who will be ready to play in the Premier League.\nStrand Larsen wants the move to St. James’ Park but is not agitating for the transfer out of respect for Wolves.\nNewcastle view Strand Larsen as a replacement for Callum Wilson, who left the club at the end of his contract earlier this summer, rather than Alexander Isak, who wants to leave the club and has not featured for the side this season.\nStrand Larsen spent last season on loan at Molineux from Spanish club Celta Vigo and the transfer was made permanent for €27m in July. He has started both of Wolves’ first two Premier League games this season and came off the bench to score twice and give Vitor Pereira’s side a 3-2 win over West Ham United in the Carabao Cup second round on Tuesday.\nThe 25-year-old has made 41 appearances for Wolves, scoring 16 goals and providing five assists.\nNewcastle have been in search of a striker this summer and have seen several targets move elsewhere. Hugo Ekitike moved to Liverpool, Benjamin Sesko signed for Manchester United, while Joao Pedro and Liam Delap both joined Chelsea.\nEddie Howe’s team are next in action away against Leeds United in Saturday’s late kick-off, while Wolves host Everton at 3pm.\n(Alex Pantling/Getty Images)"
    }
  ],
  "argos_summary": "Newcastle United has made two offers for Wolves striker Jørgen Strand Larsen, £50m and £55m, both rejected as Wolves refuse to sell him this window. Strand Larsen, who scored twice in a Carabao Cup win over West Ham, wants to move to Newcastle but is not pressuring Wolves out of respect for the club. Wolves’ chairman Jeff Shi insists any bid will be turned down because the club needs a striker and cannot afford to lose a key player without a suitable replacement. Newcastle view Larsen as a replacement for Callum Wilson, while Wolves are reluctant to part with a player who has been vital in their recent attack. The transfer saga remains unresolved as both sides hold firm positions. ",
  "argos_id": "W2POO05FO"
}