{
  "url": "https://www.nytimes.com/athletic/6580155/2025/08/28/ravens-kyle-hamilton-contract-extension/",
  "authorsByline": "Jeff Zrebiec",
  "articleId": "1fd34463857f4526a87c0b95e8270a11",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/27215610/GettyImages-2193937290-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T10:30:21+00:00",
  "addDate": "2025-08-28T10:41:04.285543+00:00",
  "refreshDate": "2025-08-28T10:41:04.285545+00:00",
  "score": 1.0,
  "title": "Ravens and Kyle Hamilton were a perfect match. They’ll be together a lot longer, too",
  "description": "Hamilton is a star, just as Baltimore believed he would be. Making sure he remains a Raven for the foreseeable future was an easy call.",
  "content": "OWINGS MILLS, Md. — As Baltimore Ravens coach John Harbaugh sat across from Kyle Hamilton three years ago, he wanted to know one thing.\n\n“What are you doing here?” Harbaugh asked Hamilton.\n\nHarbaugh wasn’t being disrespectful, and he surely knew that Hamilton was on his pre-draft visit tour that included a stop at the Ravens’ Owings Mills facility. Harbaugh, though, figured it would be the one — and likely only — time Hamilton was in the building.\n\nThe Ravens do their due diligence on every draft prospect, but they thought there was no way they’d get even close to an opportunity to select Notre Dame’s standout safety. They believed Hamilton was one of the very best players in the 2022 draft, a legitimate and unique top-five talent who could help transform a defense with his eclectic skill set.\n\nThose types of players aren’t typically options for teams picking 14th overall. Except Hamilton was, and Baltimore still can’t believe its good fortune.\n\nHamilton is a star, just as the Ravens believed he would be. And making sure he remains a Raven for the foreseeable future was one of the easiest calls general manager Eric DeCosta and company have had to make in a while, even though it came at an eye-popping cost.\n\nWith a four-year, $100.4 million extension, which includes a whopping $82 million in guaranteed money, the Ravens made Hamilton the highest-paid safety in NFL history, which feels both fitting and appropriate because Hamilton has spent the previous two years making a compelling case that he is the league’s best at the position.\n\nThe Ravens don’t think it’s particularly close.\n\n“I think the deal really does speak to how we feel about Kyle,” DeCosta said after announcing the deal. “We’ve had a few players over the years become the highest paid at their position, and I think when you are the highest paid, that’s an important distinction. I think Kyle has proven that he’s going to carry that very well, and we expect him to continue to be an impact player on our defense for years to come.”\n\nThe 24-year-old Hamilton, already a two-time All-Pro, does a little of everything — and does it all at a high level. He covers. He’s shown an ability to take away top tight ends and match up with speedy receivers in the slot. His transition into a deep safety role last year helped change Baltimore’s defensive fortunes.\n\nHe hits. Hamilton has made 188 tackles over the past two seasons, and quite a few of them have left opposing ball carriers on the ground for just a little longer. Throw a screen pass to Hamilton’s side of the field at your own risk.\n\nHe blitzes. He has seven career sacks and 15 quarterback hits, and he’s working on adding moves to his pass-rushing arsenal, because why not?\n\nHe takes the ball away. Hamilton has five interceptions, three forced fumbles and a fumble recovery over the past two years.\n\n“One of the things that you love about Kyle is he’s kind of a unicorn,” DeCosta said. “He can do many different things. He does them all very well.”\n\nAnd this also shouldn’t be overlooked when you analyze a deal of this magnitude. He leads on and off the field and is quite comfortable being front and center. He’s become one of the most vocal Ravens in the locker room, and one of the team’s most willing and cooperative players with the media and out in the community.\n\nHamilton gets it, and he understands the responsibility that he now carries.\n\n“It’s a crazy amount of money, and I am blessed to be in the position I’m in,” Hamilton said before Wednesday’s practice. “But my mom always told me, ‘Money just makes you more of who you already are.’ So, I think it’s a blessing, and I’m excited to help my family, help others with it as well. But I don’t think it really changes my outlook or my perception of who I am as a person. I pride myself on that. No matter what you’re talking about, whether it’s money or experiences or accolades, I try to just stay the same Kyle.”\n\nMake no mistake, the Ravens are Lamar Jackson’s team, and they’ll continue to be. As Hamilton noted on Wednesday, Baltimore will always have a chance to lift the Lombardi Trophy while Jackson is healthy and under center. The two-time league MVP is the face of the franchise, the sporting face of the city.\n\nWith a bloated salary-cap number over the next two years, Jackson could become one of the next Ravens to get a contract extension when he’s ready to return to the negotiating table. Both DeCosta and Harbaugh made clear that they aren’t done trying to sign key Ravens to lucrative long-term extensions, and Jackson obviously would be the priority.\n\nBut this was Hamilton’s day, a culmination of contract talks that started in June and truly got serious over the past three weeks. Hamilton, who was kept well apprised of the negotiations, insists that he wasn’t sweating it even if he wanted the deal done before the start of the regular season to avoid any potential distractions.\n\nThe Ravens have known since Hamilton’s breakout in 2023 that they one day were going to have to make him the NFL’s highest-paid safety. There was an acceptance of that because, from owner Steve Bisciotti all the way down through the organization, they believed he deserved it.\n\n\n\n With all due respect to Roquan Smith, a terrific leader and force multiplier in his own right, and to other accomplished veterans such as Marlon Humphrey and Nnamdi Madubuike, Hamilton is the face of this defense going forward. The contract he signed Wednesday morning, which could keep him in Baltimore through at least 2030, ensures that.\n\nHe’s a homegrown Raven who is seven months shy of his 25th birthday. He is charismatic, good-looking, personable, extremely smart and comfortable in just about every setting. He just happens to be extremely good at football, but he’s one of those rare athletes and personalities who you can picture doing whatever he wants to and finding a way to be great at it.\n\nHe checks just about every box, on and off the field, for an organization that knows a thing or two about producing defensive stars and transformational leaders.\n\nAs if on cue, Hamilton spent a chunk of his post-contract extension news conference talking about the brotherhood he shares with teammates, the impact Jackson had on his decision to want to stay a Raven, the philanthropic plans he has now that his future in Baltimore is secure, and his one big goal as a player.\n\n“Super Bowl, really,” he said. “I think you check a lot of boxes off, hopefully, throughout your football career. Not to toot my own horn, but I feel like I’ve checked a good bit ever since high school, and a Super Bowl still has yet to be checked. So, that’s the next one that I want to check off. All the personal accolades and stuff, that’s cool. But I feel like, as a team, as an organization — I’ve talked to Mr. Bisciotti — and it’s just, a Super Bowl, and we’re not trying to wait anymore.\n\n“We want to get greedy with that. We want to do that now, as soon as possible, and stack them.”\n\nHamilton also couldn’t help but look back to his draft day about 40 months ago. Harbaugh didn’t expect that Hamilton would be there at No. 14, and Hamilton didn’t either. Yet, as the picks came off the board and Hamilton and his friends and family sat uncomfortably in the green room, he remained calm.\n\n“I think back to draft night, and some people have said some things about where I was drafted, this and that, and where I could be drafted,” Hamilton recalled. “At the time, I think I was the least mad out of anybody. I knew that I came to the right place.”\n\nAnd now, he’ll be staying a while.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6578115/2025/08/27/kyle-hamilton-ravens-extension/",
    "https://x.com/Ravens/status/1960734548108697815",
    "https://static01.nyt.com/athletic/uploads/wp/2025/08/27223744/GettyImages-2185273339-scaled.jpg",
    "https://twitter.com/kyledhamilton_?ref_src=twsrc%5Etfw",
    "https://twitter.com/Ravens/status/1960734548108697815?ref_src=twsrc%5Etfw",
    "https://t.co/iSo5G65Pks"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kyle Hamilton",
      "weight": 0.09156546
    },
    {
      "name": "Hamilton",
      "weight": 0.0862361
    },
    {
      "name": "Baltimore Ravens",
      "weight": 0.07174627
    },
    {
      "name": "Baltimore Ravens coach John Harbaugh",
      "weight": 0.067717284
    },
    {
      "name": "key Ravens",
      "weight": 0.06130461
    },
    {
      "name": "Ravens",
      "weight": 0.061004378
    },
    {
      "name": "last year",
      "weight": 0.05476532
    },
    {
      "name": "years",
      "weight": 0.053194914
    },
    {
      "name": "players",
      "weight": 0.04630075
    },
    {
      "name": "Hamilton’s day",
      "weight": 0.046036493
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9921875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9921875
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.389892578125
    }
  ],
  "sentiment": {
    "positive": 0.41951853,
    "negative": 0.1686752,
    "neutral": 0.4118063
  },
  "summary": "The Baltimore Ravens have signed safety Kyle Hamilton to become the highest-paid safety in NFL history with a four-year, $100.4 million extension, which includes a whopping $82 million in guaranteed money. The extension was part of a larger effort to secure Hamilton for the future of the team. Hamilton, a two-time All-Pro and a top-five player in the 2022 NFL draft, was considered a unique top five talent who could transform a defense with his diverse skill set. The 24-year-old Hamilton has made 188 tackles over the past two seasons and has seven career sacks and 15 quarterback hits. Despite the cost of the extension, the Ravens believe Hamilton will continue to be an impact player on their defense for years.",
  "shortSummary": "The Baltimore Ravens' decision to sign versatile safety Kyle Hamilton for $100.4 million (163.4m euros) was based on strong team spirit and strategic awareness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5fa2dd66618941bba1edfe2cac097d13",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6578115/2025/08/27/kyle-hamilton-ravens-extension/",
      "text": "The Baltimore Ravens have made Kyle Hamilton the highest-paid safety in the NFL.\nThey reached an agreement with Hamilton late Tuesday on an extension that will keep the 24-year-old in Baltimore for the foreseeable future. The deal is worth $100.4 million over four years, including $82 million guaranteed, eclipsing the four-year, $86 million pact the Detroit Lions and safety Kerby Joseph agreed to in April, according to team sources.\nAdvertisement\nHamilton, a first-round pick out of Notre Dame in 2022, essentially had two years left on his rookie deal after the Ravens announced in April that they would pick up his fifth-year option for 2026. At the time, the team acknowledged that it remained a priority to extend Hamilton, who has quickly developed into one of the league’s top safeties.\nThe deal comes just 11 days before the Ravens will kick off the 2025 season against the Buffalo Bills at Highmark Stadium.\nHamilton has two Pro Bowl selections in his three NFL seasons, and he’s also garnered All-Pro recognition in each of the past two years. With his smarts, athleticism, versatility and physicality, Hamilton has become one of the centerpieces of a Baltimore defense well-stocked with accomplished veterans and former first-round picks.\nPen to paper on the biggest safety contract in the NFL‼️ pic.twitter.com/Gt5YSVtTdp\n— Baltimore Ravens (@Ravens) August 27, 2025\nHe’s also morphed into an on-field leader for the Ravens and one of the more vocal players in the locker room. Hamilton’s active in the community, too.\nIn 2023, ex-Ravens defensive coordinator Mike Macdonald used Hamilton as a chess piece, moving him around the defense and matching him up in certain situations. Hamilton responded by registering 81 tackles, three sacks, four interceptions, 13 pass breakups and a defensive touchdown.\nWith his defense struggling to limit big plays early last season, first-year Ravens defensive coordinator Zach Orr was forced to move Hamilton to more of a deep safety role. Hamilton proved to be a stabilizer for the pass defense and finished the season with 107 tackles, two sacks, two forced fumbles and an interception.\nThe selection of first-round safety Malaki Starks in April’s draft is expected to allow Orr to utilize Hamilton similarly to how he was moved around during his breakout 2023 season and get him closer to the line of scrimmage.\nRavens general manager Eric DeCosta has long said the team would prioritize taking care of its own players over spending big in free agency. Hamilton is the latest example of that, and it follows an offseason in which Baltimore also reached long-term agreements with running back Derrick Henry, left tackle Ronnie Stanley and wide receiver Rashod Bateman.\nAdvertisement\nThe team has yet to address the contract of two-time MVP quarterback Lamar Jackson, whose salary-cap number rises to an untenable $74.5 million next year. And the Ravens’ 2026 unrestricted free-agent class is primed to include key performers Mark Andrews, Isaiah Likely, Tyler Linderbaum, Odafe Oweh and Travis Jones. However, Hamilton is a big name to cross off the list, and the timing could be critical with safety prices rising in recent years.\n(Photo: Luke Hales / Getty Images)"
    }
  ],
  "argos_summary": "The Baltimore Ravens have signed safety Kyle Hamilton to a four‑year, $100.4 million extension that makes him the highest‑paid safety in NFL history, with $82 million guaranteed. Hamilton, a two‑time All‑Pro and two‑time Pro Bowler, is praised for his versatility, leadership, and impact on the Ravens’ defense, and the deal secures him through at least 2030. The contract underscores the franchise’s strategy of retaining key players rather than spending heavily in free agency, while also setting the stage for future extensions for other stars such as quarterback Lamar Jackson. The move reflects the organization’s confidence in Hamilton’s ability to help the team pursue a Super Bowl title. ",
  "argos_id": "XYZI9PB8E"
}