{
  "url": "https://www.usatoday.com/story/sports/tennis/open/2025/08/28/us-open-food-drink-options/85851692007/",
  "authorsByline": "Scooby Axson",
  "articleId": "7031f1b5536441ce861b0df0639c4eb8",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/28/USAT/85860041007-truffle-golden-nuggets.png?crop=1498,842,x0,y23&width=1498&height=842&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T11:02:38+00:00",
  "addDate": "2025-08-28T11:11:05.160985+00:00",
  "refreshDate": "2025-08-28T11:11:05.160986+00:00",
  "score": 1.0,
  "title": "Inside the outrageous food and drink options at 2025 US Open",
  "description": "The food and drink options at the 2025 US Open are sure to turn some heads.",
  "content": "NEW YORK – The expression \"costs an arm and a leg\" dates back at least a century, but it indeed remains relevant in today's inflation-rampant times ... especially if you are planning to attend, eat, drink, or buy any sort of souvenir at the US Open over the next two weeks.\n\nIf your stomach and wallet can handle it, and you don't have to take out a second mortgage to afford the trip to Flushing Meadows, this year's cornucopia of food and drink choices at the final Grand Slam of the year is sure to turn some heads.\n\nLet's start with the drinks, where smiling (or annoyed, depending on the time of day) bartenders are situated at battle stations every couple of feet. They're ready to charge your credit card and pour you a popular US Open staple, the Honey Deuce, which is responsible for nearly two decades of fans stumbling and bumbling around the grounds with impunity to the ire of the New York City Police Department.\n\nThis mixture of Grey Goose vodka, lemonade, and raspberry liqueur, topped with three honeydew melons that represent tennis balls, will cost you $23. But at least you get the collective glass that comes with the drink.\n\nThe United States Tennis Association sold 556,000 Honey Deuces during last year's tournament (and 2.8 million have been sold since 2011, according to Grey Goose). For you math majors, the organization pocketed nearly $12.8 million off that drink alone in 2024, more than enough to pay the two singles champions, who will take home $5 million each for their victorious runs through the tournament.\n\nOr, if you really want to live on the wild side, the newest drink on the menu is the $39 Watermelon Slice, from IHG Hotels & Resorts, the tournament's official hotel sponsor. It comes in a neon-green wine glass shaped like a tennis ball, with a nice, healthy wedge of – you guessed it – watermelon, to top it off. The drink features an interesting Moët & Chandon Champagne, watermelon juice, elderflower liqueur, and lime. Taste buds, be damned.\n\nBut for some, the food and other amenities are not all they're cracked up to be.\n\nMark Ruggiero, a retired pediatrician from Gardnerville, Nevada, said he had the Honey Deuce about 12 years ago and hasn’t had one since.\n\n“I really liked it for about four hours, and after about the third one, I started to not like it as much,” he said.\n\nRuggiero, who was seated near courtside with his friends Phil and Diane Sheridan while snacking on donuts bought at Doughnut Plant at Grand Central Station, had some pointed advice for those coming to the Open.\n\n“Bring some snacks,” he said, even though security prohibits any outside food and beverages, including water, from being brought inside the stadium grounds. “But there is some food that’s reasonably priced,\" he added.\n\nIf wine and spirits aren't your thing, you could (theoretically) bring an empty water container and enjoy free H2O from the numerous water fountains around the complex, or spend $9 for a 750 ml bottle of Evian or $8.50 for a fountain drink.\n\nWhen it comes to food, the talk of the US Open is the famous Golden Nugget chicken with caviar from COQODAQ, which can be found at Arthur Ashe Stadium's club level and in the Food Village; if that's your fix or piques your curiosity, six \"golden nuggets\" will cost you a cool Benjamin, just for that dish alone, which features Petrossian caviar and crème fraîche. Also, prepare to shell out an Andrew Jackson for sides like macaroni and cheese or a dessert, like the $19 peaches and cream froyo.\n\n\"There’s something magical about the combination of caviar and chicken nuggets. It’s unexpected, it’s playful, and it feels like a celebration,\" Simon Kim, CEO and Founder of Gracious Hospitality Management (COQODAQ, COTE Korean Steakhouse) told USA TODAY Sports. \"That’s exactly what the US Open is - a celebration of sport, culture, and indulgence. Our goal has always been to create a high-low experience, where something as simple as a chicken nugget, which everyone loves, becomes elevated when paired with world-class caviar.\"\n\nCOQODAQ, a Korean fried chicken restaurant in Manhattan located at 12 East 22nd Street, offers other US Open exclusive menu items, such as the \"Gangnam Style\" crispy chicken sandwich, as well as exclusive off-menu surprises. The classic nuggets box, featuring three signature sauces and pickled radish, is priced at $26.\n\nKim said they sold about 100,000 chicken nuggets last year at the Open and expect to double that number in 2025.\n\nYou also can't go wrong with a Maine lobster roll from Red Hook Lobster Pound, which will run you around $40. And for foodies who want to chow down just for the sake of gluttony, Hill Country Barbecue will more than fulfill those needs, with a sliced brisket sandwich ($26) or a loaded barbecue nachos ($24).",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/picture-gallery/sports/tennis/open/2025/08/24/us-open-2025-top-photos-from-the-years-final-tennis-grand-slam/85810493007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US Open",
      "weight": 0.07576579
    },
    {
      "name": "other US Open exclusive menu items",
      "weight": 0.07213875
    },
    {
      "name": "chicken nuggets",
      "weight": 0.06891306
    },
    {
      "name": "Open",
      "weight": 0.059796717
    },
    {
      "name": "last year",
      "weight": 0.05639985
    },
    {
      "name": "year",
      "weight": 0.051464003
    },
    {
      "name": "food",
      "weight": 0.050160114
    },
    {
      "name": "a popular US Open staple",
      "weight": 0.04488781
    },
    {
      "name": "Honey Deuces",
      "weight": 0.043956764
    },
    {
      "name": "Red Hook Lobster Pound",
      "weight": 0.043901652
    }
  ],
  "topics": [
    {
      "name": "Tennis"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Food & Drink/Beverages/Alcoholic Beverages",
      "score": 0.67578125
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.505859375
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Bars, Clubs & Nightlife",
      "score": 0.302001953125
    }
  ],
  "sentiment": {
    "positive": 0.17872751,
    "negative": 0.2817963,
    "neutral": 0.53947616
  },
  "summary": "The food and drink options at the 2025 US Open are high-priced, with prices starting at $23 for the Honey Deuce, a popular mix of Grey Goose vodka, lemonade, and raspberry liqueur topped with honeydew melons representing tennis balls. The US Tennis Association sold 556,000 Honey Deuces during last year's tournament, and sold nearly $12.8 million off that drink alone in 2024, enough to pay the two singles champions who will receive $5 million each for their successful runs through the tournament. The newest drink on the menu is the $39 Watermelon Slice from IHG Hotels & Resorts, the tournament's official hotel sponsor. Food and drink choices include the famous Golden Nugget chicken with caviar from COQODAQ, a Korean restaurant in Manhattan.",
  "shortSummary": "The 2025 US Open offers stunning food and drink options, including Honey Deuce, Golden Nugget chicken, and Watermelon Slice, with affordable drinks and amenities like free water fountains.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "98b8e32cd4c24ca488df43cae3ac7fb7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article highlights the high cost of food and drinks at the US Open, noting signature items like the $23 Honey Deuce cocktail and $39 Watermelon Slice, as well as pricey food such as golden nugget chicken with caviar at $19 and lobster rolls at $40. It cites sales figures, with the USTA earning $12.8 million from Honey Deuces in 2024, and mentions that the tournament’s sponsors and vendors capitalize on premium pricing. The piece also offers practical tips for attendees, such as bringing snacks and using free water fountains, while underscoring the event’s focus on indulgence and celebration.",
  "argos_id": "YA2A1STCV"
}