{
  "url": "https://www.usatoday.com/story/sports/nfl/2025/08/28/dallas-cowboys-dak-prescott-legacy-eagles/85853931007/",
  "authorsByline": "Tyler Dragon",
  "articleId": "9b173206ee6748d8974f5f61458785ba",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/27/USAT/85854058007-usatsi-26863622.jpg?crop=5123,2882,x0,y105&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T10:05:19+00:00",
  "addDate": "2025-08-28T10:09:49.706758+00:00",
  "refreshDate": "2025-08-28T10:09:49.706760+00:00",
  "score": 1.0,
  "title": "Hello, Dallas Cowboys QB Dak Prescott? Your legacy is calling",
  "description": "Quarterback Dak Prescott is closing in on several Cowboys franchise records as he enters Year 10. Is this the year he finally reaches a Super Bowl?",
  "content": "• Dak Prescott enters his 10th season as the Cowboys' starting quarterback, nearing franchise records for touchdowns and passing yards.\n• Despite individual achievements, Prescott's focus remains on winning a Super Bowl, ending the Cowboys' 30-year drought.\n• Prescott's leadership and talent are unquestioned, but his playoff performance remains under scrutiny.\n\nSift through the Dallas Cowboys’ top storylines leading up to Week 1, and there isn’t much mention of quarterback Dak Prescott.\n\nThe contract negotiation stalemate between Jerry Jones and Micah Parsons, and the Cowboys’ Netflix documentary “America's Team: The Gambler and His Cowboys” have dominated the news cycle surrounding the NFL’s most popular franchise.\n\nA stark contrast from a year ago when Prescott was embroiled in contract extension negotiations. Now Prescott is entering Year 10 and currently holds the title of highest-paid player in the NFL (in terms of average annual salary).\n\nIt’s hard to believe Prescott is a few days away from beginning his 10th season as the Cowboys starting QB. Prescott is 36 touchdown passes away from breaking the franchise record and with 2,747 passing yards this season he’ll become the team’s all-time passing leader.\n\n“Yes, I’m aware of it,” Prescott answered this offseason when asked if he knows of the team records he’s approaching. “I didn’t know of the touchdowns necessarily. I knew the yards were coming upon. I don’t want to stop there. It would be awesome. It’s going to be cool, I should say, but that’s not the end goal. I plan to have many more seasons, touchdowns (and) yards.\n\n“Something that I felt like I should be doing. It would be something that’s cool to have but not anything that weighs on me or that I’ll carry and be like, ‘Job well done on.’”\n\nPrescott tossed a career-high and league-leading 36 touchdowns in 2023 and has six 3,000-yard passing seasons. He has a decent shot of breaking at least one of the franchise records if he remains healthy this season. The addition of George Pickens to pair with CeeDee Lamb should only bolster his chances.\n\n“You see their ability to separate and contested balls and things like that,” Cowboys first-year coach Brian Schottenheimer said to reporters of Pickens and Lamb. “Those guys, you don’t have to do much to get them open…Those two guys, they just feed off each other. It shows you when you have one on one side and one on the other, it’s pretty daunting for a defense.”\n\nBut leading the league in passing yards and breaking franchise records isn’t what motivates the 32-year-old quarterback.\n\nPrescott and the Cowboys watched their NFC East rival, Philadelphia Eagles, win Super Bowl 59. The Eagles have won two Super Bowls since Prescott became the Cowboys starter in 2016. Prescott’s won just two playoff games in that span.\n\n“Having fun and winning a Super Bowl, period. That’s what I want. That’s what I want from this game, and I know that’s what everyone wants in this locker room. We have a head coach who I know is hungry for it,” Prescott said. “That’s what’s on my mind 10 (years) in and ready to play another 10 (years). I want that first and foremost now. That is the urgency that I carry with the love and the passion of this game, not only wanting to win for myself but wanting to win for this organization. It been damn long enough.”\n\nPrescott’s 76 career regular-season wins are the fourth most by any QB in franchise history and he’s registered a 33-8 record against NFC East opponents. Yet he’s part of the Cowboys’ 30-year Super Bowl drought. He’s just 2-5 in the postseason.\n\n“They are gonna criticize him because of the playoff performance, and rightfully so. I love Dak and I’m with him. I’ve been with him. Everybody knows how talented he is. Arm talent, he has everything. He’s real smart, he’s a leader. The leadership is unquestioned. He has his team ready to run through a wall for him,” Lamb said to reporters. “I know we are gonna have a good one this year, though, that’s for sure.”\n\nWhat constitutes a good year for the Cowboys?\n\nNot the individual records or the team’s constant presence in the news cycle. It’s dethroning the Eagles on the way to reaching the pinnacle of the sport. Something the Cowboys haven’t done in three decades.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/sports/nfl/dallas-cowboys",
    "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/12/dallas-cowboys-netflix-documentary-review/85609140007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/dallas-cowboys/331",
    "https://twitter.com/TheTylerDragon",
    "https://sportsdata.usatoday.com/football/nfl/players/dak-prescott/591816",
    "https://www.usatoday.com/story/shopping/best-streaming-deals-bundles-free-trials/83951337007/?utm_source=usat&utm_medium=content&utm_campaign=spike",
    "https://sportsdata.usatoday.com/football/nfl/teams/philadelphia-eagles/354",
    "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/27/micah-parsons-filed-grievance-over-fifth-year-option-salary/85855884007/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "quarterback Dak Prescott",
      "weight": 0.094404295
    },
    {
      "name": "Dak Prescott",
      "weight": 0.09424003
    },
    {
      "name": "Prescott",
      "weight": 0.0900223
    },
    {
      "name": "Dallas Cowboys",
      "weight": 0.08886979
    },
    {
      "name": "Cowboys",
      "weight": 0.08819681
    },
    {
      "name": "franchise records",
      "weight": 0.08535381
    },
    {
      "name": "Super Bowl",
      "weight": 0.067884594
    },
    {
      "name": "many more seasons",
      "weight": 0.06661033
    },
    {
      "name": "Cowboys first-year coach Brian Schottenheimer",
      "weight": 0.064843014
    },
    {
      "name": "seasons",
      "weight": 0.06443999
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    },
    {
      "name": "Dallas Cowboys"
    },
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.970703125
    }
  ],
  "sentiment": {
    "positive": 0.40945208,
    "negative": 0.21242094,
    "neutral": 0.37812695
  },
  "summary": "Dak Prescott, the Dallas Cowboys' starting quarterback, is entering his 10th season as the team's starting quarterback and nearing franchise records for touchdowns and passing yards. Despite his impressive individual achievements, Prescott's focus is on winning a Super Bowl, ending the Cowboys' 30-year drought. He currently holds the title of the highest-paid player in the NFL (in terms of average annual salary). Prescott is 36 touchdown passes away from breaking the franchise record and with 2,747 passing yards this season, he will become the team’s all-time passing leader. Despite this, Prescott has expressed his intention to continue playing the game for the team.",
  "shortSummary": "Dak Prescott, as the Dallas Cowboys' quarterback enters his 10th season, is nearing franchise records and aims to win a Super Bowl despite his recent success.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f1ee3ad3672647598e4bb209da0486b8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/12/dallas-cowboys-netflix-documentary-review/85609140007/",
      "text": "'America's Team' Netflix series a fascinating look at Jerry Jones, Cowboys\n- A new Netflix docuseries, \"America's Team: The Gambler and His Cowboys,\" chronicles the Jerry Jones era of the Dallas Cowboys.\n- The series covers Jones' purchase of the team, the dynasty of the 1990s, and controversies surrounding key figures.\nEditor's note: The below review contains minor spoilers for the Netflix docuseries \"America's Team: The Gambler and his Cowboys.\"\n“I don’t like it like that. I like the pain,” Jerry Jones says when he is asked the question of why he doesn’t hire a general manager for his football team, instead of him being in charge of player personnel.\nThat answer certainly isn’t going to fly with die-hard Dallas Cowboys fans, who for years have implored Jones to turn over those duties to a more seasoned football mind, but instead, the team is ridiculed when it reaches an early end during the NFL playoffs or misses the postseason altogether, like they did in 2024.\nBeing relevant in the sports world in this day and age, with the saturation of social media, talk radio, and mindless, numbing, bloviating morning shows, is a golden ticket that you can’t buy. Unless your team is the Cowboys, who haven’t sniffed a Super Bowl appearance in three decades but are talked about ad nauseum as if their exploits on the field recently warrant a minute of anyone’s time.\nThere is one person largely responsible for that: Jerral Wayne Jones Sr., the 82-year-old Hall of Fame owner and general manager of the five-time Super Bowl champions.\nNetflix has hopped on the Jerry’s World bandwagon with a fascinating sports series, titled \"America's Team: The Gambler and His Cowboys,\" premiering Aug. 19 on the streaming service, because let’s be real, there were cameras nearby and a chance for people to talk and dissect the film before the NFL starts its 106th season next month.\nThe film is directed with a slow, grinding pace by veteran documentarians Chapman and Maclain Way (\"The Battered Bastards of Baseball,\" \"Untold: The Race of the Century\"), who certainly benefit from getting unfettered cooperation from those intimately involved with the Cowboys.\nJones' \"gamble\" has certainly paid off: A $140 million investment in 1989 when he bought the team has turned into the most valuable sports franchise in the world, valued at $10 billion. They added three championships during his ownership, and in turn, have helped turn the NFL into its own money-printing press.\nThe eight-part series doesn’t skip any of the major contributors of the 1990s Cowboys, who would have set social media on fire if it existed back then.\nThe dozens of athletes and journalists featured provide context, praise, and biting criticism about Jones and do so with incredible insight, and the series also includes appearances from former President of the United States George W. Bush, Nike co-founder Phil Knight, and former Fox Corporation chairman Rupert Murdoch.\n“The Saturday Night Massacre,” the first episode, centers around Jones buying the team from Bum Bright – and jettisoning anything that wasn’t nailed down – telling you all you need to know about what’s coming. It sets the tone for what essentially most documentaries are these days: In this case, a glorified infomercial with just enough tears, Texas-sized egos, downright delusion, and lies (depending on who is answering the questions) to keep even the most skeptical viewers glued to their chosen device.\nJones doesn't mince his words: His team is the best soap opera this side of “General Hospital”, and he wants the credit for his team's success, direct or not. Yes, even when his team was losing $1 million a month, because he is the owner, president, and general manager.\nThe series has time to go through the paces, consistently going from the 1990s back to Jones’ time at the University of Arkansas, just as “The Last Dance” did in telling the story of the Michael Jordan-era Chicago Bulls.\nFor example, when asked about the infamous White House, a party and drug den near the team’s old headquarters at Valley Ranch, it got the \"no comment\" treatment, like it was a matter of national security from numerous interviewees – except for wide receiver Michael Irvin, who was gleefully willing to spill the tea about his exploits.\nFormer head coach Jimmy Johnson gets a healthy amount of play, especially in the first four episodes, as well as the other \"Triplets,\" fellow Pro Football Hall of Famers Troy Aikman and Emmitt Smith.\n“Dictator” and “a--hole” are the terms most commonly used by Cowboys players to describe Johnson, who, with Jones, bickered like a bunch of third graders, debating who deserves credit for building those championship teams. The exchanges were repetitive, long-winded, and exhausting, sometimes slowing down the documentary; there are only so many times you can repeat the phrases \"500 coaches\" or \"I'm going to fire that (expletive),\" before it gets tiresome. But, of course, with the recent kumbaya singing, it allowed long-standing hurt feelings to be set aside, culminating with Johnson being inducted into the team’s Ring of Honor in 2023, featured in the final episode.\nPerhaps the most emotional part of the documentary is the penultimate episode titled “Cocaine Cowboy,” which focuses on the literal trials and tribulations of Irvin, from his drug possession charge to being the subject of a murder-for-hire plot, to stabbing a teammate with scissors. The raw feelings from those situations, as well as the retirement of the Triplets and the crumbling of the empire, make for a compelling watch, in a \"Taxicab Confessions\" kind of way, and almost makes you feel sorry for all involved – almost.\nWhile nearly an entire episode is focused on Irvin, Jones skirts by with his only mere, or non-mentions of his controversies over the past 35 years, including a paternity suit, him being captured in a photo showing up at a 1957 protest to prevent six African American students from entering North Little Rock High School, or his stance concerning Cowboys players kneeling before the national anthem.\nJones seems reflective, sometimes through tears, when discussing subjects of his past, but also shines when storytelling, including mentions of Teamsters, the mob, and an interesting Jimmy Hoffa soliloquy when Jones attempted to buy the then-San Diego Chargers.\nJones has no doubt done incredible things for his team and the NFL at large, but the documentary doesn’t need eight episodes, some of which were not necessary to get the point across. It is a formulaic (and sometimes cringy) watch, complete with the cheesy western-style background for the subjects who are interviewed.\nOverall, the documentary does its job, satisfying those who love and hate the Cowboys, while telling the story of one of the most fascinating franchises in sports history."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/dak-prescott/591816",
      "text": "See the current futures odds for Micah Parsons to win the 2025 NFL Defensive Player of the Year award.\nSee the current futures odds for Trevon Diggs to win the 2025 NFL Defensive Player of the Year award.\nSee the current futures odds for CeeDee Lamb to win the 2025 NFL MVP award.\nSee the current futures odds for Dak Prescott to win the 2025 NFL MVP award.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/27/micah-parsons-filed-grievance-over-fifth-year-option-salary/85855884007/",
      "text": "Micah Parsons filed grievance over fifth-year option salary\nThe ongoing contract stalemate between the Dallas Cowboys and Micah Parsons has a new twist.\nParsons filed a grievance earlier this year regarding his fifth-year option salary, a person with knowledge of the situation confirmed to USA TODAY Sports. The person spoke on condition of anonymity because of the sensitivity of the matter.\nPro Football Talk was first to report the news.\nThe dispute stems from the fact Parsons believes his salary should be $24 million, the amount slotted for a linebacker. The Cowboys have Parsons listed as a defensive end, which pays him a $21.324 million.\nParsons won the 2021 Defensive Rookie of the Year award as a linebacker. He also made the Pro Bowl in 2022, 2023 and 2024 as a linebacker. He was named a 2021 first-team All-Pro as a linebacker. He was a first-team All-Pro edge rusher in 2022 and named a second-team All-Pro edge rusher in 2023.\nThe grievance adds another layer to the saga between Parsons and Cowboys owner Jerry Jones. Parsons already requested a trade and didn’t participate in training camp because of stalled contract talks.\nJones and Parsons can mend their fences if they reach an agreement on a contract extension. Parsons’ next extension is expected to award him over $40 million a season, no matter the position listed.\nFollow USA TODAY Sports' Tyler Dragon on X @TheTylerDragon."
    },
    {
      "url": "https://www.usatoday.com/story/shopping/best-streaming-deals-bundles-free-trials/83951337007/?utm_source=usat&utm_medium=content&utm_campaign=spike",
      "text": "'Breaks my heart': Minneapolis community mourns after deadly shooting\nNation\nIs U.S. running a secret operation in Greenland? Denmark summons envoy\nWorld\nBengals fan JD Vance fears a Swift-Kelce Super Bowl wedding\nNFL\nEXCLUSIVE − Trump doesn't want troops in cities 'indefinitely,' Vance says\nPolitics\nJohnny Gaudreau died a year ago. What has happened since then?\nNHL\nWhat it's like onboard the new Amtrak Acela trains\nTravel News\nTry one of these numbers in next $950M Powerball drawing?\nGraphics\nWill Trump's showdown with Fed's Lisa Cook end up at Supreme Court?\nPolitics\nKeegan Bradley makes Ryder Cup captain's picks: Who did he choose?\nGolf\nTrump is taking over D.C.'s Union Station. Here's why it matters\nGraphics\nWhat's going on with the Crumbl Cookies co-founder?\nHealth and Wellness"
    },
    {
      "url": "https://www.usatoday.com/sports/nfl/dallas-cowboys",
      "text": "'Breaks my heart': Minneapolis community mourns after deadly shooting\nNation\nIs U.S. running a secret operation in Greenland? Denmark summons envoy\nWorld\nBengals fan JD Vance fears a Swift-Kelce Super Bowl wedding\nNFL\nEXCLUSIVE − Trump doesn't want troops in cities 'indefinitely,' Vance says\nPolitics\nJohnny Gaudreau died a year ago. What has happened since then?\nNHL\nWhat it's like onboard the new Amtrak Acela trains\nTravel News\nTry one of these numbers in next $950M Powerball drawing?\nGraphics\nWill Trump's showdown with Fed's Lisa Cook end up at Supreme Court?\nPolitics\nKeegan Bradley makes Ryder Cup captain's picks: Who did he choose?\nGolf\nTrump is taking over D.C.'s Union Station. Here's why it matters\nGraphics\nWhat's going on with the Crumbl Cookies co-founder?\nHealth and Wellness"
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/philadelphia-eagles/354",
      "text": "'Breaks my heart': Minneapolis community mourns after deadly shooting\nNation\nIs U.S. running a secret operation in Greenland? Denmark summons envoy\nWorld\nBengals fan JD Vance fears a Swift-Kelce Super Bowl wedding\nNFL\nEXCLUSIVE − Trump doesn't want troops in cities 'indefinitely,' Vance says\nPolitics\nJohnny Gaudreau died a year ago. What has happened since then?\nNHL\nWhat it's like onboard the new Amtrak Acela trains\nTravel News\nTry one of these numbers in next $950M Powerball drawing?\nGraphics\nWill Trump's showdown with Fed's Lisa Cook end up at Supreme Court?\nPolitics\nKeegan Bradley makes Ryder Cup captain's picks: Who did he choose?\nGolf\nTrump is taking over D.C.'s Union Station. Here's why it matters\nGraphics\nWhat's going on with the Crumbl Cookies co-founder?\nHealth and Wellness"
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/dallas-cowboys/331",
      "text": "'Breaks my heart': Minneapolis community mourns after deadly shooting\nNation\nIs U.S. running a secret operation in Greenland? Denmark summons envoy\nWorld\nBengals fan JD Vance fears a Swift-Kelce Super Bowl wedding\nNFL\nEXCLUSIVE − Trump doesn't want troops in cities 'indefinitely,' Vance says\nPolitics\nJohnny Gaudreau died a year ago. What has happened since then?\nNHL\nWhat it's like onboard the new Amtrak Acela trains\nTravel News\nTry one of these numbers in next $950M Powerball drawing?\nGraphics\nWill Trump's showdown with Fed's Lisa Cook end up at Supreme Court?\nPolitics\nKeegan Bradley makes Ryder Cup captain's picks: Who did he choose?\nGolf\nTrump is taking over D.C.'s Union Station. Here's why it matters\nGraphics\nWhat's going on with the Crumbl Cookies co-founder?\nHealth and Wellness"
    }
  ],
  "argos_summary": "Dak Prescott is entering his 10th season as the Cowboys’ starting quarterback, close to breaking franchise records for touchdowns and passing yards, but his main goal remains a Super Bowl win to end the team’s 30‑year drought. While Prescott’s individual achievements are highlighted, his playoff record of 2‑5 keeps critics focused on postseason performance. Off the field, the Cowboys’ headlines have been dominated by a Netflix docuseries chronicling Jerry Jones’ era and a contract dispute between owner Jerry Jones and defensive star Micah Parsons. The narrative underscores the franchise’s ongoing struggle to translate regular‑season success into championship glory.",
  "argos_id": "Z2FWL55BY"
}