{
  "url": "https://www.express.co.uk/finance/personalfinance/2090651/black-hole-pension-rachel-reeves-delay",
  "authorsByline": "Rory Poulter",
  "articleId": "c87efb99e18047899999b5991d208be2",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/23/1200x712/2090651_1.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-04T09:13:00+01:00",
  "addDate": "2025-08-04T08:21:49.238259+00:00",
  "refreshDate": "2025-08-04T08:21:49.238260+00:00",
  "score": 1.0,
  "title": "Fears of £100,000 black hole in pension pots as Reeves delays shake-up",
  "description": "The Chancellor is under fire for failing to act swiftly on plans to increase minimum workplace pension contributions",
  "content": "Millions of workers could be left nursing a £100,000 shortfall in their pension pots due to delays by Rachel Reeves in implementing long-awaited reforms, experts have warned. The Chancellor is under fire for failing to act swiftly on plans to increase minimum workplace pension contributions – a move widely seen as vital to help savers avoid poverty in old age. Despite cross-party support for reforms first proposed nearly a decade ago, the Treasury has admitted changes will not be brought in before the end of this Parliament – meaning nothing will happen until at least 2030. Pensions policy expert Sir Steve Webb, a former Lib Dem minister and now with Lane Clark & Peacock, warned: “If you delay these reforms by five years, someone starting work now and on average earnings could have a pension pot that is £100,000 smaller by the time they retire.” Under current rules, employees are automatically enrolled into workplace pensions at age 22 and contributions are only paid on earnings above £6,240 – leaving younger and lower-paid workers falling through the cracks.\n\nThe long-discussed reforms would lower the age to 18 and require contributions on every pound earned, dramatically boosting long-term savings – particularly for part-time and lower-income workers, many of them women. The Government’s own 2017 review concluded these reforms were essential to ensure savers had “an adequate income in retirement”. Former pensions minister Baroness Ros Altmann told the Telegraph: “Delay has already gone on far too long. Every year that passes makes it harder for people to build up decent pensions. We are already facing a looming retirement income crisis.” Experts warn that even under current contribution rates – eight per cent of earnings – millions are not saving nearly enough. The Institute for Fiscal Studies has estimated most workers need to be putting aside at least 12-15 per cent to have a comfortable retirement.\n\nTom Selby, director of public policy at AJ Bell, said: “Delaying these reforms will leave millions of low earners short-changed and make their retirement prospects significantly worse.” In response, the Treasury said: “We remain committed to implementing the reforms to automatic enrolment, enabling more people to save earlier and save more – helping them to achieve the retirement they want. We will set out the timeline to implement these changes in due course.” But industry leaders are increasingly alarmed by the lack of urgency from the new government, despite its pledges to improve living standards and tackle inequality. Steve Webb added: “The longer we leave it, the worse this problem will become – particularly for younger savers who will lose out on years of compound growth.”",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/latest/pension",
    "https://www.telegraph.co.uk/money/pensions/private-pensions/how-much-labour-foot-dragging-cost-you-retirement/",
    "https://www.express.co.uk/finance/personalfinance/2089997/hmrc-warning-major-crackdown-fraud",
    "https://www.express.co.uk/finance/personalfinance/2089932/rachel-reeves-barclays-hcbs-lloyds-natwest",
    "https://www.express.co.uk/latest/rachel-reeves",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "minimum workplace pension contributions",
      "weight": 0.09352241
    },
    {
      "name": "pension pots",
      "weight": 0.09177376
    },
    {
      "name": "workplace pensions",
      "weight": 0.087407485
    },
    {
      "name": "Pensions policy expert Sir Steve Webb",
      "weight": 0.08512042
    },
    {
      "name": "Former pensions minister Baroness Ros Altmann",
      "weight": 0.08156741
    },
    {
      "name": "decent pensions",
      "weight": 0.08060888
    },
    {
      "name": "reforms",
      "weight": 0.080373935
    },
    {
      "name": "current contribution rates",
      "weight": 0.06904001
    },
    {
      "name": "younger savers",
      "weight": 0.06684703
    },
    {
      "name": "most workers",
      "weight": 0.064693324
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9853515625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.8310546875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.5439453125
    },
    {
      "name": "/Law & Government/Social Services/Welfare & Unemployment",
      "score": 0.51611328125
    },
    {
      "name": "/Finance/Financial Planning & Management/Retirement & Pension",
      "score": 0.4375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.345458984375
    }
  ],
  "sentiment": {
    "positive": 0.049957275,
    "negative": 0.7338867,
    "neutral": 0.21582031
  },
  "summary": "UK Chancellor Rachel Reeves has been criticised for delaying plans to increase minimum workplace pension contributions, a move seen as vital to help savers avoid poverty in old age. Despite cross-party support for reforms first proposed nearly a decade ago, the Treasury has stated that changes will not be implemented before the end of this Parliament, meaning nothing will happen until at least 2030. Pensions policy expert Sir Steve Webb warned that if delayed by five years, someone starting work now and on average earnings could have a pension pot that is £100,000 smaller by retirement. The reforms would lower the age to 18 and require contributions on every pound earned, significantly increasing long-term savings. However, industry leaders have expressed concern over the lack of urgency from the new government, despite pledges to improve living standards and tackle inequality.",
  "shortSummary": "Experts warn that delays by Chancellor Rachel Reeves in implementing pension reforms could leave millions of workers with a £100,000 shortfall by retirement.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6e9279558bb14d1587dcb88bd88c1d11",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "Residents have said that their town has deteriorated before their eyes with anti-social behaviour, loud parties and rampant drug usage.\nPeople have been urged not to travel to the estate.\nFollow our live blog for the latest updates on Reform UK's press conference\nThe Met Office has issued a series of updated 11-hour weather warnings that could...\nBBC Breakfast's Jon Kay fired questions at Border Security minister Dame Angela Eagle...\nOnly one local authority in England and Wales saw negative net international migration...\nThis small town is an unmissable spot this summer.\nCharles and Patricia Lester MB bought the 20-bedroom Llanfoist House in Monmouthshire,...\nExpress Sport keeps you up to date with the latest F1 news.\nSome customers were given higher levels of interest on their finance deal so dealers...\nA city council is only doing a four-day work week while providing cooking classes to...\nExpress Sport provides all the latest Man Utd news LIVE, including regular transfer...\nDaily Express\nAll UK WhatsApp users are being urged to take care and secure accounts due to a rise...\nStorm Floris is slamming into the UK with 90mph winds, with a yellow Met Office...\nKnowing she couldn't get a divorce until she was 18, Brittany fled her abusive husband...\nEXCLUSIVE: Keir Starmer has been warned against inflating defence spending to meet the...\nRobert Jenrick argued the Government had a duty to publish the immigration status and nationality of offenders to restore public trust.\nThe British woman's life may be in danger, according to an alert by a missing persons...\nThe young girl was walking with her father near playing fields when the Sudanese man...\nExpress Sport keeps you up to date with the latest summer transfer news.\nMotorists who feel they are affected by the car finance scandal could still be handed...\nThe Chancellor is under fire for failing to act swiftly on plans to increase minimum...\nA train celebrating 200 years of British railway history may have been fitted with an...\nPairing avocados with toast has become a morning favourite for breakfast eaters, but...\nA chef has revealed that swapping one of lasagne's staple ingredients will unlock new flavours for the dish.\nThere's nothing like a summer holiday break - and if you're looking for the ideal...\nThe Duchess of Sussex is celebrating her birthday today, but her special day clashes...\nCampaigners hatch plot for thousands to protest in attempt to overload the police\nThe Government has given its pledge to smash people-smuggling gangs a £100 million boost.\nMeghan Markle has long had a love affair with high heels - and her growing collection...\nA royal insider has claimed Meghan Markle's decision to leave the Royal Family began...\nBarron Trump has maintained a relatively low profile since his father Donald left...\nKyren Wilson beat to win the Shanghai Masters title\nIn the years before his death, physicist Stephen Hawking repeatedly cautioned against...\nThe Darla Floral Duvet Cover and Pillowcase Set creates an eyecatching centrepiece for...\nThe top nine most reliable SUV models on the road have been compiled by specialists...\nTake a trip back in time with an off-grid camping holiday and let the kids run free.\nReform UK's leader warned Labour's plans \"won't stop the boats or the gangs\".\nIt has everything you could possibly need for a perfect UK staycation by the sea. But...\nRussia and China have begun a series of mock combat drills in the Sea of Japan to...\nEXCLUSIVE: State pensioners will have to start paying tax soon, say reports. But many already do - even if they have no other income - due to the '97 rule'.\nNetflix released a documetary chronicling the life and career of David Beckham in 2023\nI'm utterly certain that there's one thing we need to do more.\nThis hobby is one that's good for the environment and which many people take an...\nThe major station had undergone multiple expansions to become the central hub it is...\nThe workhorse is due a well-deserved rest.\nViewers of the ITV celebrity cooking show were distracted by one key element.\nLucy Letby is the focus of a new ITV documentary and her former senior manager has...\nAntiques Roadshow expert Richard Price was left baffled by a mystery timepiece during a repeat episode of the BBC show.\nA 105-mile-long powerline project in Germany has revealed haunting Neolithic secrets.\nDespite the appeal of this decorative item, keeping it near your TV may actually...\nThe Met Office has issued amber weather warnings for the UK on Monday as it predicts...\nOasis have spoken out after a fan fell to their death during the band's Wembley Area...\nCaitlin Clark has sparked a huge frenzy on social media\nA scenic train ride is one of the best ways to see some of Europe's best landscapes,...\nExtreme weather is behind the situation.\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Experts warn that millions of workers could face a £100,000 shortfall in their pensions due to delays in implementing reforms to increase minimum workplace pension contributions, which have been proposed for nearly a decade. The Chancellor has admitted that these changes will not take effect until at least 2030, despite cross-party support and a government review highlighting their necessity for adequate retirement income. Delaying these reforms is expected to worsen retirement prospects, particularly for younger and lower-income workers.",
  "argos_id": "B3V9YJFH4"
}