{
  "url": "https://www.businessinsider.com/ex-airbnb-executive-how-manage-founder-in-founder-mode-2025-8",
  "authorsByline": "Kwan Wei Kevin Tan",
  "articleId": "a0be23fe5231424e9246678969e7b059",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/6890382b85e81483682f3431?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T08:14:16+00:00",
  "addDate": "2025-08-04T08:22:54.315121+00:00",
  "refreshDate": "2025-08-04T08:22:54.315123+00:00",
  "score": 1.0,
  "title": "Former Airbnb executive says this is how you manage a founder in founder mode",
  "description": "Chip Conley was Airbnb's head of global hospitality and strategy. He said he joined Airbnb because he believed in its CEO, Brian Chesky.",
  "content": "Chip Conley spent eight years at Airbnb, where he worked closely with the hospitality giant's CEO, Brian Chesky.Conley, 64, said in an episode of Lenny's Podcast that aired on Sunday that alignment is key when working with a founder in founder mode.\"When Brian or the founder, whoever it is, is beating you up on something, say, 'Well, let me tell you why it looks like that or why we are doing that. It goes back to the three principles or the three goals we are trying to do with this product update.' So try to set alignment on the front end,\" Conley said.Conley added that staff should not be \"overly reliant\" on their presentation slides when presenting to founders, \"especially when you have a combustible founder who may take you off path, such that your deck in its current order makes no sense at all.\"\"I always wanted to really limit the deck as much as possible because I didn't know where the meeting was going to go. The deck's helpful at the start to just sort of set principles, set goals,\" he continued.Conley did not respond to a request for comment from Business Insider.Conley joined Airbnb in 2013 and was their head of global hospitality and strategy. He became a strategic advisor to Airbnb in 2017 and left the company in 2021.Before Airbnb, Conley founded the boutique hotel brand Joie de Vivre Hospitality in 1987. He served as the company's CEO until it was sold to billionaire investor John Pritzker in 2010.Earlier in the interview, Conley said he joined Airbnb because of Chesky's personality and \"growth mindset.\"\"I wasn't sure I liked the business model all that well as a hotelier. So I had to believe in something beyond the business model because I wasn't sure that this business model would work,\" Conley said.\"But I believed in Brian, because the thing that Brian showed up with initially was just a curiosity and an appetite for learning,\" he added.Paul Graham, the founder of startup incubator Y Combinator, first coined the term \"founder mode\" in a blog post published in September 2024. Graham said the term was inspired by Chesky's hands-on management style.\"If I could summarize founder mode in a couple of sentences, it's about being in the details,\" Chesky said of the term in an episode of The Verge's \"Decoder\" podcast that aired in October.\"So, that's really what it means: great leadership is presence, not absence,\" he added.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "founder mode",
      "weight": 0.10804858
    },
    {
      "name": "founders",
      "weight": 0.09635157
    },
    {
      "name": "Chip Conley",
      "weight": 0.08592441
    },
    {
      "name": "Conley",
      "weight": 0.08582751
    },
    {
      "name": "Brian Chesky",
      "weight": 0.08436657
    },
    {
      "name": "Former Airbnb executive",
      "weight": 0.07958105
    },
    {
      "name": "Airbnb",
      "weight": 0.07889578
    },
    {
      "name": "Chesky",
      "weight": 0.06606813
    },
    {
      "name": "Joie de Vivre Hospitality",
      "weight": 0.06365589
    },
    {
      "name": "startup incubator Y Combinator",
      "weight": 0.06327395
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.85595703125
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.4375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.31640625
    },
    {
      "name": "/Travel & Transportation/Hotels & Accommodations/Other",
      "score": 0.313232421875
    }
  ],
  "sentiment": {
    "positive": 0.11694336,
    "negative": 0.47314453,
    "neutral": 0.4099121
  },
  "summary": "Former Airbnb executive, Chip Conley, has shared his advice on how to manage a founder in founder mode. He emphasized the importance of aligning with a founder who may take you off course, particularly when they are dealing with a combustible founder. Conley also advised staff not to rely heavily on their presentation slides when presenting to founders, especially when dealing with founder's behavior. The term \"founder mode\" was coined by Paul Graham, founder of startup incubator Y Combinator, inspired by Chesky's hands-on management style and his focus on detail. Conleys joined Airbnb in 2013 and served as their head of global hospitality and strategy before becoming a strategic advisor in 2021.",
  "shortSummary": "Chip Conley, a former Airbnb executive, emphasizes strategic alignment with founder Brian Chesky, emphasizing the importance of establishing principles and setting goals without relying on presentation slides.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d452720701d6480ab9b23c134cff0ef6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Chip Conley, who worked at Airbnb for eight years, emphasized the importance of alignment when collaborating with founders like CEO Brian Chesky. In a recent podcast, he advised against relying too heavily on presentation slides during meetings, suggesting that flexibility is crucial when engaging with dynamic leaders. Conley joined Airbnb due to Chesky's growth mindset, despite initial reservations about the business model, and highlighted the concept of 'founder mode' as a hands-on management style that focuses on detail-oriented leadership.",
  "argos_id": "F88UVTXRG"
}