{
  "url": "https://www.forbes.com/sites/janicegassam/2025/08/04/no-friends-in-the-pipeline-why-300000-black-women-were-pushed-out-of-the-workforce/",
  "authorsByline": "Janice Gassam Asare, Ph.D.",
  "articleId": "9710faabc41f4729bdbdf53f5fe660b9",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689041488812b60019d247f5/0x0.jpg?format=jpg&crop=2268,1276,x0,y38,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T05:29:02+00:00",
  "addDate": "2025-08-04T05:35:44.350241+00:00",
  "refreshDate": "2025-08-04T05:35:44.350242+00:00",
  "score": 1.0,
  "title": "No Friends In The Pipeline: Why 300,000 Black Women Were Pushed Out Of The Workforce",
  "description": "300,000 Black women left the workforce in the last three months. This piece breaks down how the loss of workplace community and career networks helped make that happen.",
  "content": "A recently published MSNBC article made headlines for a shocking stat: nearly 300,000 Black women have exited the American labor force in the last three months. The article attributes the mass exodus to reasons like federal job cuts and the dismantling of DEI programs, with issues like inflation, student loan debt, automation, and underrepresentation in growing tech sectors creating a compounded economic risk for Black women. This phenomenon not only hurts Black women but has a ripple effect for the entire U.S. economy, resulting in a loss in the country’s gross domestic product (GDP). A less-discussed issue that must be considered is how what is happening is also the cause of a widening network gap faced by Black women.\n\nA 2019 article from LinkedIn’s Vice President of Social Impact, Meg Garlinghouse, explored the network gap: the unequal access a person has to opportunities based on who they know. Garlinghouse’s article cited research that indicates that 70% of professionals get hired at jobs where they know someone who works there. A 2020 study by Chika O. Okafor indicated that non-white job candidates get fewer jobs through referrals because their social network is smaller. With the anti-DEI legislation and a wave of corporate DEI rollbacks, many companies have deprioritized DEI, dismantling programs and initiatives like employee resource groups (ERGs), which provide key opportunities to boost one’s professional network.\n\nAccording to Catalyst, ERGs can be thought of as “voluntary, employee-led groups that foster inclusive work environments aligned with business values, goals, and objectives.” Often ERGs focus on a shared identity (race, religion, being a parent, LGBTQIA+ status, etc.). ERGs provide employees with pathways to network, connect across departments, find mentors, and build relationships but many organizations are quietly shuttering their ERGs amid growing anti-DEI sentiments. Having less opportunities to be in community with employees at different levels in an organization can exacerbate the network gap that Black women face. Mentorship and sponsorship programs, which are often perceived to be DEI or DEI-adjacent, may be halted in the current climate, even though these programs can play an instrumental role in employees’ careers, and Black women’s career advancement.\n\nA wealth of research indicates that Black women leading Fortune 500 companies, as well as those in education, medicine, and tech, routinely report feelings of both hypervisibility and invisibility. Organizational psychologist Dr. Kecia M. Thomas has highlighted the pet to threat concept in her research: the phenomenon in Black women’s career trajectories where they go from being the ‘pet,’ where they are well-liked and celebrated but exploited, to being the ‘threat,’ where they are seen as posing a risk to the status quo. A 2023 report from Exhale indicated that 36% of Black women have exited a job because they felt unsafe. Black women face a slew of inequities in the workplace and must deal with issues of gendered racism and the angry Black woman stereotype. A 2024 Harvard study also found evidence that when Black women have a higher percentage of white team members, they are more likely to leave their job and less likely to be promoted, revealing the systemic inequities that are entrenched in the workplace.\n\nThe rise of AI may be making the problem worse. Many of the AI tools that companies lean on to help with hiring decisions may exacerbate existing biases, contributing to hiring gaps when it comes to Black women. Black women are overrepresented in jobs roles that are vulnerable to AI and automation, explained executive leadership coach Margaret Spence in a LinkedIn article. These factors in conjunction with the dismantling of corporate DEI programs makes building and sustaining professional networks for Black women more challenging.\n\nWhat can organizations do to address this issue? First off, workplaces should be intentional about providing employees with opportunities to network with each other. Do you have active mentorship and sponsorship programs in place? If not, how can you get them started? Ensure that equity is foundational in your workplace; frequently audit company policies and practices to ensure fairness and disaggregate employee feedback from anonymous channels, focus groups, and surveys to better understand Black women’s experiences. What are Black women saying when they leave your organization? Assess exit interview data to see if patterns are emerging from the Black women who have left.\n\nThe current anti-DEI legislation was implemented to sow fear and confusion in the workplace. Be aware of the ever-changing laws and stay up to date on local legislation. Consult with legal counsel to better understand what DEI practices are legal. Despite popular misconceptions, there are still many ways to drive fairness and equity while complying with state and federal laws.\n\nFor Black women, there are some ways to address the network gap. Building community intentionally is vital. Consider joining different community groups, whether in-person or virtually, that align with your goals. This could be an online community for Black women in law, for example, or a meetup group for Black women in cybersecurity. If the community you are seeking doesn’t exist, think about ways to create it. Also consider intentional networking on LinkedIn. Many see the platform as a place to go only when job searching but it can also be a great place to build networks, find your people and directly engage with community members.\n\nBlack women’s mass exodus from the U.S. labor market is caused by several different factors. While some reasons, like the DEI rollbacks and federal job cuts, are more obvious, there are issues that are more insidious at play. It’s important that we understand what the antecedents are and put measures in place to ensure that Black women are given the support that is needed to thrive. When Black women are given the tools to succeed, everyone across the board will benefit.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/janicegassam/2025/06/24/92-million-jobs-gone-who-will-ai-erase-first/",
    "https://scholarworks.uark.edu/cgi/viewcontent.cgi?article=7099&context=etd",
    "https://worklifelaw.org/wp-content/uploads/2022/04/Pinning-Down-the-Jellyfish-The-Workplace-Experiences-of-Women-of-Color-in-Tech.pdf",
    "https://www.forbes.com/sites/keciathomas/2024/01/13/the-persistence-of-pet-to-threat/",
    "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2441471",
    "https://static1.squarespace.com/static/647f783647a6f92ae4a72c97/t/64985e1f2e54835a13ffefd4/1687707169427/The+State+of+Self-Care+for+Black+Women.pdf",
    "https://hbr.org/2021/03/how-a-lack-of-sponsorship-keeps-black-women-out-of-the-c-suite",
    "https://arxiv.org/abs/2006.15988?utm_",
    "https://www.tandfonline.com/doi/pdf/10.1080/00131911.2023.2217358",
    "https://www.forbes.com/sites/janicegassam/2020/09/22/misogynoir-the-unique-discrimination-that-black-women-face/",
    "https://www.hks.harvard.edu/publications/intersectional-peer-effects-work-effect-white-coworkers-black-womens-careers",
    "https://www.msnbc.com/know-your-value/business-culture/300000-black-women-left-labor-force-3-months-s-not-coincidence-rcna219355",
    "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00302-0/fulltext",
    "https://www.forbes.com/sites/janicegassam/2019/05/31/overcoming-the-angry-black-woman-stereotype/",
    "https://www.forbes.com/sites/janicegassam/2025/06/23/what-the-workday-lawsuit-reveals-about-ai-bias-and-how-to-prevent-it/",
    "https://www.linkedin.com/pulse/existential-crisis-black-women-ai-disruption-margaret-spence-mmzke/",
    "https://www.linkedin.com/blog/member/impact/closing-the-network-gap",
    "https://www.catalyst.org/en-us/insights/featured/erg"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Black women",
      "weight": 0.12117256
    },
    {
      "name": "Black",
      "weight": 0.09146586
    },
    {
      "name": "Black women’s mass exodus",
      "weight": 0.06911458
    },
    {
      "name": "Black women’s career trajectories",
      "weight": 0.068512686
    },
    {
      "name": "Black women’s career advancement",
      "weight": 0.06806653
    },
    {
      "name": "the angry Black woman stereotype",
      "weight": 0.06729961
    },
    {
      "name": "Black women’s experiences",
      "weight": 0.06631417
    },
    {
      "name": "employee resource groups",
      "weight": 0.06621448
    },
    {
      "name": "federal job cuts",
      "weight": 0.065794654
    },
    {
      "name": "DEI programs",
      "weight": 0.065316774
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "African American"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Other",
      "score": 0.9404296875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.78125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.74951171875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.607421875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.6064453125
    },
    {
      "name": "/People & Society/Social Sciences/Demographics",
      "score": 0.374755859375
    },
    {
      "name": "/News/Other",
      "score": 0.34130859375
    }
  ],
  "sentiment": {
    "positive": 0.035247803,
    "negative": 0.79248047,
    "neutral": 0.17211914
  },
  "summary": "A recent MSNBC article reported that nearly 300,000 Black women have left the American labor force in the last three months due to federal job cuts and the dismantling of DEI programs. This has led to a widening network gap between Black women and the entire U.S. economy, resulting in a loss in the country's GDP. LinkedIn's Vice President of Social Impact, Meg Garlinghouse, highlighted the unequal access a person has to opportunities based on who they know. Research indicates that 70% of professionals get hired at jobs where they know someone else, and non-white job candidates get fewer jobs through referrals due to their smaller social network. With the anti-DEI legislation and a wave of corporate DEI rollbacks, many companies have stopped prioritizing DEI, dismantling programs and initiatives like employee resource groups (ERGs). These programs provide key opportunities to boost one's professional network. The rise of AI may exacerbate the problem, contributing to hiring gaps for Black women. Black women are overrepresented in roles that are vulnerable to AI and automation.",
  "shortSummary": "Nearly 300,000 Black women exit the workforce annually due to job cuts and the dismantling of DEI programs, highlighting systemic inequities and the rise of AI.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d25a349e53094f39a9ab6767757e9138",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.linkedin.com/pulse/existential-crisis-black-women-ai-disruption-margaret-spence-mmzke/",
      "text": "Existential Crisis: Black Women's Unemployment and AI Disruption\nThe Three Factors Destroying Black Women's Employment\nBlack women lost 304,000 jobs in just three months while America celebrated economic growth—revealing how AI disruption isn't a future threat but a present crisis devastating the community that can least afford it. Federal cuts, the dismantling of DEI, and AI have created a perfect storm for displacement. The future of work is being written now—and Black America must write its own story.\nCould it be that AI is Reshaping Work—But Not Equally? The rise of artificial intelligence is revolutionizing the workforce, but for Black professionals, the promise of innovation also brings disproportionate risk.\nWhile AI is often celebrated as a driver of progress, it is rapidly automating roles that have historically served as critical mobility pathways for Black workers, especially those without access to advanced degrees or elite college networks.\nThe crisis is no longer theoretical—it's happening now. In April and May 2025, Black women experienced the most severe employment setback of any demographic group, with unemployment rates jumping from 5.1% to 6.3% while the national rate remained stable at 4.2%. Black women lost 106,000 jobs in April alone, representing the most significant single-month job loss among all racial and gender groups despite overall economic growth.\nThe scale of devastation is staggering. Black women have lost 304,000 jobs from February through April 2025, with approximately 198,000 jobs lost between February and March, followed by another 106,000 in April. While some recovery occurred in May, Black women remain down 233,000 jobs for the year to date, representing employment levels at a five-month low. This employment collapse happened when the overall economy added hundreds of thousands of jobs, highlighting how economic growth can mask the targeted devastation of specific communities.\nThe Employment Crisis Unfolds: Multiple Forces Converging\nThe spring 2025 unemployment spike reveals how multiple forces converge to devastate Black women's economic security. While white women maintained 3.4% unemployment and Hispanic women stayed at 4.6%, Black women faced a 2.9 percentage point gap—among the most significant recorded disparities in recent years.\nFederal Workforce Reductions: Black women comprise 12% of federal workers versus 7% of the civilian workforce. Since January 2025, federal employment declined by 26,000 jobs since January 2025, and Black women experienced a 33% decline in federal employment compared to just 3.7% for the overall workforce.\nDEI Program Elimination: The systematic dismantling of Diversity, Equity, and Inclusion programs across federal agencies and private corporations removed positions where Black women were heavily concentrated, eliminating critical pathways to professional advancement.\nAI and Automation Displacement: Administrative and office support occupations—where Black women are overrepresented—face the highest generative AI exposure. Nearly 19 million workers in these roles face displacement risk, with Black women bearing a disproportionate impact.\nThis represents a dramatic reversal from early 2024 when Black women achieved historic unemployment lows of 4.2%. The rapid deterioration underscores how quickly progress can unravel when structural supports are removed.\nThe AI Effect Is An Existential Crisis.\nBy 2030, up to 4.5 million jobs held by Black Americans could be displaced by AI and automation. According to McKinsey, this figure represents a 10% greater risk than for the general population. The most at-risk roles are office support, customer service, food services, production, truck drivers, and mechanical repair.\nToday, 24% of Black employees are in jobs where more than 75% of tasks are automatable, compared to just 20% of White workers. For Black women specifically, 79% work in AI-exposed occupations compared to 58% of men, with particular vulnerability in administrative support roles. As generative AI grows more capable, these stepping-stone jobs are being pulled from underfoot. The result? A potential collapse in one of the few accessible bridges to upward mobility for Black communities.\nThe Breadwinner Crisis: Understanding the Financial Stakes\nThe employment data reveals why Black women's job losses create cascading economic devastation. Black mothers carry financial responsibility at rates far exceeding other demographic groups, creating a vulnerability that policymakers and employers have largely ignored.\nThe Three Categories of Financial Responsibility:\nRecommended by LinkedIn\nThis data means Black families face disproportionate risk when employment disruptions occur for Black Women.\nWhen a Black woman loses her job, the family often faces immediate crises: inability to pay rent, loss of health insurance, food insecurity, and potential homelessness. The April-May 2025 data showing 304,000 Black women losing employment represents hundreds of thousands of families pushed toward economic catastrophe.\nThe Scissors Effect: Reskilling Beyond Traditional Middle-Skill Roles\nThe risk isn't just economic—it's existential. Black women face a \"scissors effect\": displacement from traditional middle-skill roles without access to newly created technology positions. Only 3% of computing roles are held by Black women, limiting access to AI-adjacent job creation.\nWhy this financial structure amplifies crisis impact: If these inequities go unaddressed, the racial wealth gap could widen by an additional $43 billion annually by 2045. Already, Black professionals face higher unemployment rates, slower career advancement, and limited access to reskilling. With the onset of AI, those disparities will widen and create calculated barriers to entry for Black professionals.\nThe fear is real. In a recent national survey, 53% of Black professionals reported concern that AI will replace their jobs within five years, compared to 39% of White professionals. The April-May 2025 data proves these fears are justified. And yet, Black workers are also more likely to embrace AI tools proactively, showing both deep anxiety and a strong desire to adapt.\nThe Moment of Truth: What Happens Next\nThe convergence of AI displacement and policy-driven employment devastation has created an inflection point. The spring 2025 data doesn't just represent job losses—it represents a stress test of America's commitment to economic equity. How institutions, organizations, and society respond in the next 12-18 months will determine whether we build inclusive AI-powered prosperity or cement algorithmic apartheid.\nSpeaking recently at the ATD Talent Development Conference, I posed a question that cuts to the heart of this crisis: \"Who gets reskilled and who gets left behind?\" Standing on that main stage, I shared data that made the audience visibly uncomfortable—24% of Black workers are trapped in jobs with over 75% automation potential compared to just 20% of white workers, and 53% of Black professionals already fear AI will replace them within five years.\nThese aren't abstract statistics; they're the lived anxieties of millions of workers who see the writing on the wall. When I revealed that 4.5 million jobs held by Black Americans face automation-driven displacement by 2030, the room fell silent. The spring 2025 employment data proves we're not talking about a distant future—we're witnessing the early stages of a transformation that will either lift communities up or leave them permanently behind.\nFor Black Women: The data validates what many have already sensed—that individual excellence isn't enough to overcome structural barriers. Collective action, strategic skill development, and community-building become survival strategies. The women who navigate this transition successfully will likely be those who combine technical competence with advocacy and mutual support.\nFor Organizations: This is the moment to prove that diversity commitments extend beyond marketing campaigns. Companies that proactively protect and advance Black women through AI transitions will access untapped talent and avoid the reputational and legal risks of discriminatory AI implementation. Those who don't will face workforce crises and accountability measures from increasingly organized advocacy groups.\nFor Policymakers: The employment data demands emergency intervention, not just future planning. Federal employment restoration, AI bias auditing mandates, and targeted reskilling investments aren't just policy options but economic necessities. The alternative is watching entire communities fall through the cracks of technological progress.\nHowever, given the current political environment—where DEI programs have been systematically dismantled, and federal employment is being slashed—we cannot expect policymakers to prioritize Black economic security. The spring 2025 employment data is a stark reminder that when political winds shift, Black communities are the first to suffer. We must stop waiting for institutional rescue and start building our own economic infrastructure. No one is coming to save us—we need and must save ourselves.\nThe Choice Before Us: We can engineer equity into AI adoption or automate existing inequalities at an unprecedented scale. The spring 2025 employment crisis is both a warning and an opportunity, showing us exactly what's at stake and exactly who gets hurt first when we fail to act.\nToday is the moment to choose equity, not efficiency. Purpose, not passivity. And intentional transformation, not another round of disruption that leaves the most vulnerable behind.\nRead the Extended Article on My Substack - The UndisruptAble Woman - where I address the \"What Equitable AI Upskilling Looks Like\"\nI help women thrive through AI disruption. SXSW Speaker: AI Skills Gap for Women | Keynote Speaker | Inclusivity in Talent Management | 3X Best-Selling Author | Host: What's Your Possible?® Podcast\n1moHow do you want to address the increasing unemployment rate for Black Women?"
    },
    {
      "url": "https://www.forbes.com/sites/janicegassam/2025/06/23/what-the-workday-lawsuit-reveals-about-ai-bias-and-how-to-prevent-it/",
      "text": "HR finance company Workday, Inc is facing a collective-action lawsuit based on claims that the artificial intelligence used by the company to screen job applicants discriminated against candidates 40 years old and over. In 2024, Derek Mobley filed an employment discrimination lawsuit against Workday, alleging that their algorithm-based job applicant screening system discriminated against him and other applicants based on race, age and disability. Four additional plaintiffs have now accused the company of age discrimination. In an email, a Workday spokesperson refuted claims that their technology is bias-laden stating, “This lawsuit is without merit. Workday’s AI recruiting tools do not make hiring decisions, and our customers maintain full control and human oversight of their hiring process. Our AI capabilities look only at the qualifications listed in a candidate’s job application and compare them with the qualifications the employer has identified as needed for the job. They are not trained to use—or even identify—protected characteristics like race, age, or disability. The court has already dismissed all claims of intentional discrimination, and there’s no evidence that the technology results in harm to protected groups,” and shared that the company has recently taken steps to ensure the software they use is ethical.\n2025 data compiled by DemandSage indicated that an estimated 87% of companies use AI for recruitment. Frequently used applicant tracking systems like Workable, Bamboo HR, Pinpoint ATS, and Rippling, are used by employers to help navigate the recruitment and hiring process, and often rely on AI to help manage and automate the hiring and selection process. Companies are leaning heavily on AI to make crucial recruitment and hiring decisions, but these tools used so frequently during the employment process have bias baked into their design. One example was an AI recruiting tool used by Amazon.com Inc’s machine-learning specialists, which was found to discriminate against women; the company ended up scrapping the tool in 2018.\nAI bias is pervasive in recruitment and hiring tools. A 2024 study from the University of Washington revealed racial and gender bias in AI tools used to screen resumes. There can be data bias, which is when AI systems are trained on biased data that can contain an overrepresentation of some groups (white people for example) and an underrepresented of other groups (non-white people for example). This can manifest into an AI tool that ends up rejecting qualified job candidates because it was trained on biased data. There is also algorithmic bias, which can include developer coding mistakes, where a developer’s biases become embedded into an algorithm. An example of this is an AI system designed to flag job applicants whose resume’s include certain terms meant to signal leadership skills like “club leader,” “captain” or “president.” These terms could end up filtering out job candidates from lower socioeconomic backgrounds and underrepresented racial groups, whose leadership skills may show up in ways outside of the dominant norms.\nTwo other types of bias, proxy data bias and evaluation bias, can show up in recruitment and hiring tools. Proxy data bias can be described as the bias that shows up when proxies, or substitutes, are used for attributes like race and gender. An example of this is an algorithm that prioritizes job candidates who attended Ivy League or elite institutions, which may filter out candidates who went to historically Black colleges and universities (HBCUs), community colleges or state schools. Evaluation bias is the bias that results when evaluating the data. An example of this is if an organization is assessing a candidate for culture fit (which is notoriously biased), and trains an AI tool to prioritize job candidates who have particular hobbies listed on their resumes or who communicate in particular ways, which can bias candidates from cultures outside of the dominant norm.\nAs more organizations integrate AI tools into workplace processes to guide employment decisions, there are several steps that should be taken to reduce the inherent bias baked into AI tools. Workplaces that are using AI tools to make hiring, selection and recruitment decisions should insist on transparency from vendors in order to get a better understanding of how the data was trained as well as what is being done to ensure that the data has been reviewed and audited for bias related to protected characteristics like race, gender, age and disability. Additionally, companies should ask for regular audits from vendors to test their AI tool for bias. Companies should partner with experts in ethical AI use in the workplace to ensure that when AI is integrated into workplace systems, there are checks and balances in place. For instance, an expert may test to see if job candidates from HBCUs are being filtered out of the talent pool.\nAI right now is the wild wild west and it’s helpful to seek guidance from legal counsel or your legal team to ensure AI tools are compliant with local and state laws. Transparency also applies to workplaces—organizations should be candid about AI usage during the employment process and should always consider alternative evaluation methods. AI, in many ways, has made our lives easier, more convenient and more accessible but there are valid concerns when it comes to AI usage and fairness. If equity is the goal and your workplace uses AI for recruitment and hiring decisions, it’s good to trust the AI (to a reasonable extent) but always verify. AI is a powerful way to complement the employment process but should never replace human oversight."
    },
    {
      "url": "https://www.forbes.com/sites/janicegassam/2020/09/22/misogynoir-the-unique-discrimination-that-black-women-face/",
      "text": "Anti-racism involves exploring the unique ways that anti-blackness shows up in different forms in our everyday life. When trying to understand a person’s experiences, intersectionality is an important consideration. Intersectionality, a term coined by scholar Kimberlé Crenshaw, was initially defined as the unique forms of oppression that Black women face. Now, the term has become more mainstream and is conceptualized as the experiences faced by those with intersecting identities. A newer term, misogynoir, coined by Moya Bailey was developed to describe “the specific hatred, dislike, distrust, and prejudice directed toward Black women.” Anti-racism education and efforts must explore misogynoir, how it manifests and how it can be mitigated.\nMisogynoir is rampant in ways that may not even be realized. The hashtag #SayHerName was created in 2014 to highlight misogynoir and how stories of Black women and girls often go overlooked, unnoticed and untold. These experiences range from police violence to sexual assault and often go unreported. Two very apparent examples of misogynoir in the public sphere can be found in the stories of musician R.Kelly’s victims and most recently, the events that transpired with rapper Megan Thee Stallion. Throughout R.Kelly’s 30-year career, a number of women and girls, mostly Black and underaged, have made claims that R.Kelly has sexually abused them. Despite the growing number of accusations that have been made, it wasn’t until recently when the 2019 documentary Surviving R.Kelly came out that these stories were given credence. Black women and girls who share experiences of abuse, trauma, and assault are largely shunned, criticized and ignored. These experiences are questioned, scrutinized and dissected more than any other group.\nIn July, a video emerged featuring rapper Megan Thee Stallion with what appeared to be injuries to her foot as she was apprehended by law enforcement. In August, Megan Thee Stallion shared that she had, in fact, been shot in the foot by rapper Tory Lanez. Following the sharing of this information, a barrage of criticism directed at Megan Thee Stallion ensued on social media, with many questioning the veracity of her story. Some even labeled her a “snitch” for publicly naming Lanez as her shooter. Despite the wealth, fame and notoriety that Megan Thee Stallion has amassed, the amount of harsh and insensitive comments directed at her is a painful reminder that misogynoir is alive and well, even in Hollywood. Apparently, no amount of prestige, money, or fame can alleviate that. Contrary to what one may believe, money doesn’t insulate Black women from experiencing misogynoir. If those in positions of power and privilege are not shielded from misogynoir, then what protections do Black women who are not in positions of power and privilege actually have?\nMany people are still unaware of misogynoir and how it manifests to collectively harm Black women. The first step to dismantling and disrupting misogynoir is awareness. Anti-racism education should explore misogynoir to increase awareness and understanding. Read books like Minda Harts’ The Memo and Mikki Kendall’s Hood Feminism, which explore intersectional experiences in greater detail and can expand one’s awareness. One of the most critical components to combat misogynoir is listening to Black women. When Black women share an experience, rather than questioning the experience or engaging in racial gaslighting and tone policing, it’s imperative to simply listen. Also important is avoiding behaviors such as white centering and defensiveness during these conversations. The voices of Black women are often muffled, stifled and silenced. Ask yourself what you are currently doing to amplify the voices of Black women. Lastly, consider how you are using your privilege, access and opportunity to uproot misogynoir any time it rears its ugly head."
    },
    {
      "url": "https://www.forbes.com/sites/keciathomas/2024/01/13/the-persistence-of-pet-to-threat/",
      "text": "Despite having published our chapter, “Women of color at midcareer: Going from pet to threat,” over ten years ago, interest in the Pet to Threat concept has not waned. Indeed, interest in this phenomenon that we identified continues to steadily increase. Popular podcasts such as Brene Brown’s Dare to Lead and Dr. Joy Harden Bradford’s Therapy for Black Girls, have shared thoughtful analyses of our work. Perhaps the persisting interest in our work is a reflection of the countless number of incredibly accomplished and credentialed Black women who have been initially tapped for high-status, and nationally visible roles yet denied access to the power and authority those roles require as well as the rewards typically offered to others. In some cases, the appointments never fully materialized.\nTake for example the visible cases of two eminently qualified journalists and scholars, Nikole Hannah-Jones and Kathleen McElroy whose high-profile positions were downgraded over time from tenured endowed chairs to short-term contracts. The failed yet relentless critique of our newest Supreme Court justice, Ketanji Brown Jackson, was further evidence of the suspicion under which Black women must always work. President Claudine Gay’s resignation further highlights this invisible condition of employment. Recently, I spoke with two of my co-authors, Dr. Juanita Johnson-Bailey and Dr. Rosemary Phelps, to reflect on the last decade of Pet to Threat.\nThat 2013 chapter was based on a pilot research project in which we asked a snowball sample of diverse academic women, across career stages, to share their workplace experiences. Those working in disciplines, roles, or organizations in which they were severely underrepresented seem to be most at risk for having early career experiences in which they were treated like ‘Pets.’ That is, celebrated while being exploited for what one of our research participants called their ‘diversity social capital,’ while also being underutilized for the knowledge, skill, ability, and experience they could provide. These professionals are often forced to consider looking for new employment or changing career paths altogether. Increasingly, many others are choosing an entrepreneurial route.\nMore senior women who persisted in workplaces in which they likewise were severely underrepresented, shared experiences in which peers seemed to treat them as though they were a ‘Threat.’ The threat these credentialed and experienced professionals seemed to pose was a threat to the status quo. It is well documented that senior women of color, and Black women in particular, do not reap the same rewards (like pay) and recognition as their peers and that their leadership is chronically undermined. At the same time, service responsibilities (e.g. office housework) are piled on in ways that derail their career mobility and undermine their health. These leaders often experienced workplace alienation and isolation and sometimes an erosion of support systems available at earlier (Pet) stages of their careers.\nAs Dr. Phelps shared, “Pet to Threat resonates for so many because of its insidiousness and that it operates in work environments that historically have been exclusionary. Managing the Pet to Threat phenomenon requires significant energy and time for women who are attempting to excel at their jobs while combating the limiting beliefs and stereotypes imposed upon them.” The untimely and tragic deaths of Black women academic leaders, including the devastating suicide of Dr. Antoinette (Bonnie) Candia-Bailey, are reminders of the often precarious positions in which many pioneering women of color find themselves.\nWomen across industry and career stages frequently reach out to us to say how closely our work mirrors their own experience. Dr. Johnson-Bailey agreed and added, “During this last decade, it’s been fascinating to have women from across the academic spectrum and the corporate world talk about this common environment they unknowingly shared, a workplace that changes and morphs in a gendered response to their job successes and promotions. To these women it seemed that they were existing in Opposite Land —- as they gained power and had more responsibility, their paths and futures became more uncertain and less secure. All of a sudden, accomplished working women found themselves being viewed through a different lens that was severely critical and biased.”\nRecent research from the Harvard Kennedy School seems to reinforce our findings for Black women in particular. Their analysis of performance and retention data demonstrated that when Black women initially work in white teams, their risk for attrition is higher than when any other demographic group works within that same context. Furthermore, within these whiter teams, Black women have higher participation in training and lower performance evaluations, yet these patterns do not appear for Black women working in more multicultural groups.\nPerhaps in diverse groups, the diversity itself undermines the impact of deeply embedded stereotypes to derail fair and equitable treatment of Black women. More diverse work groups likely create more equal opportunities for mentoring, coaching, and career support in ways that are absent when Black women are merely supertokens, which Dr. Elizabeth ‘Dori’ Tunstall defines as, “When talented people from marginalized identities are used to bring surface diversity to an organization, but not necessarily inclusion—and not decolonization.”\nWhat should leaders do to make sure that their institution does not create supertokens that are treated like they are Pets and/or Threats? It seems the answer is as difficult to nail down as it is to answer the age-old dilemma, which comes first, the chicken or the egg? In this case, leaders must focus on both recruitment and culture.\nThe recruitment of a diverse organization is critical in that it derails the probability of any particular type of worker becoming a token. However, numbers alone are not enough and will do little to retain diverse talent if the culture is hostile. It is up to leadership to create a strong culture that treasures diversity and commits and acts to systematically incorporate values around equity, inclusion, and belonging at every level of the organization and in every decision."
    },
    {
      "url": "https://www.msnbc.com/know-your-value/business-culture/300000-black-women-left-labor-force-3-months-s-not-coincidence-rcna219355",
      "text": "In just three months, nearly 300,000 Black women left the U.S. labor force. Their labor force participation rate has now dropped below that of Latinas for the first time in over a year. And more than 518,000 Black women still haven’t returned to the labor force since the pandemic began, leaving their real unemployment rate just above 10 percent.\nThis isn’t a coincidence. It’s the result of federal policy choices — most immediately, sweeping job cuts across public-sector agencies where Black women have long held the strongest foothold in middle-class employment.\nAgencies like the Department of Education and the Department of Health and Human Services have seen dramatic reductions in staff — up to 50 percent in some cases. These are not just institutional losses. They represent the disappearance of stable, often well-paying jobs that historically provided economic security to Black women and the families they support.\nHow we got here: The federal pullback\nFor decades, the public sector has served as a lifeline for Black women shut out of opportunity elsewhere in the economy. Black women make up over 12 percent of the federal workforce — almost double their share of the labor force overall. These roles offer not only pensions and benefits, but more equitable pay than the private sector, where wage gaps remain entrenched.\nThat infrastructure is now eroding at pace. Beginning in early 2025, a wave of federal downsizing — justified as “efficiency reforms” — has disproportionately hit jobs in education, health, and community-facing roles. These are the very sectors where Black women are concentrated.\nAnd as federal budgets shrink, the effects ripple through state and local governments. When public school funding dries up or health departments are hollowed out, it’s often pink-collar jobs held by Black women that are first on the chopping block.\nDEI dismantled\nAt the same time, we’ve witnessed an aggressive rollback of diversity, equity, and inclusion (DEI) programs across the federal government and private sector.\nIn government, DEI roles were among the first eliminated under the current administration. Internally, directives signaled that race-conscious dialogues — even when supported by data — are now restricted or suspect, reinforcing a chilling effect on equity-driven decision-making.\nIn the private sector, DEI budgets have been slashed or frozen. Job postings for DEI roles dropped by 43 percent between August 2022 and July 2024, and the total number of DEI positions fell from 20,000 in 2023 to 17,500 by April 2025. Companies have also scaled back mentorship programs, slowed inclusive hiring, and deprioritized equity benchmarks — treating DEI as expendable — even as the data proves otherwise.\nThe courts are reinforcing this disturbing trend. In 2024, a federal appeals court blocked the Fearless Fund from offering grants exclusively to Black women entrepreneurs, ruling that the program likely violated Section 1981 of the Civil Rights Act. The decision sent a clear signal: race-conscious private initiatives are now more exposed to legal attack, deterring investment in equity just when it’s needed most.\nBroader policy blind spots\nThe economic risks for Black women don’t stop at employment losses. Other recent policy changes compound the threat to long-term financial stability.\nInflation and gender pricing. The current inflation rate for goods marketed to women — like footwear and apparel — is 177 percent higher on average than for those marketed to men. This isn’t because women buy more — it’s because gender is built into how prices are taxed and structured.\nAnd for Black women, who earn just $0.64 for every dollar earned by white, non-Hispanic men, the math is stark: they have 36 percent less coming in and face nearly triple the inflation on essentials going out. That’s not a gap. That’s an economic trap.\nStudent loan debt. The so-called “Big Beautiful Bill” promises relief, but women will pay $13.9 billion more than men under the new plan. And it hits Black women hardest, because repaying student debt takes longer, and they accrue more interest while struggling to cover essentials; in fact, 57 percent of Black women with student loans report difficulty meeting basic expenses.\nAutomation and exclusion from tech. Black women are among the most vulnerable to automation, with 21 percent working in jobs highly exposed to AI-driven disruption. Yet they hold just 3 percent of computing-related jobs. Between February and April 2025, Black women lost 318,000 jobs — even as the overall economy added jobs.\nThis is not just a mismatch. It’s a structural exclusion from both the current economy and the “next” one.\nThe economic fallout\nThis policy-driven displacement has far-reaching consequences — not just for Black women — but for the entire economy.\nMore than 51 percent of Black households with children are led by breadwinner mothers, many of whom are the sole source of income in their homes. When these women are pushed out of the workforce, entire families lose their economic foothold, threatening housing stability, consumer spending and educational outcomes for children. These are not isolated setbacks — they are systemic losses.\nWe feel the shockwaves in the country’s GDP. Every one-point drop in women’s labor force participation costs the U.S. economy an estimated $146 billion in lost GDP.\nAnd when that drop is concentrated among Black women — who are disproportionately breadwinners, caregivers, and entrepreneurs — the ripple effects go even deeper.\nPut simply: when Black women are pushed out of the labor force, we all lose.\nA policy reset\nThe good news? This is not an inevitable outcome, it’s the result of policy choices. It can be undone by better ones:\n- Restore and protect public-sector roles in education, healthcare, and care work — fields where Black women disproportionately contribute and lead.\n- Reinstate and strengthen DEI programs across federal agencies and corporations. These are not feel-good extras — they are performance drivers.\n- Build inclusive pathways into tech and innovation sectors where growth is happening. That means access to skilling, capital and transparent hiring practices.\n- Audit economic policy across trade, tax, labor and education through an intersectional gender lens. Policies aren’t gender neutral — they’re gender ignorant. When we’re blind to gender in policy, we guarantee an unequal outcome. For instance, removing gender from the statistical calculation in trade codes would be a giant step toward closing the gender tariff gap that inflates prices for women by billions each year.\nWe cannot afford to leave Black women behind. Not morally. Not economically. When we protect Black women’s place in the workforce, we’re not just closing opportunity gaps — we’re closing performance gaps across the entire economy."
    },
    {
      "url": "https://www.linkedin.com/blog/member/impact/closing-the-network-gap",
      "text": "Closing the Network Gap\nAt LinkedIn, we believe that two people with equal talent should have equal access to opportunity. But unfortunately, that’s not always the case.\nWe’ve all heard that “who you know” matters, and research proves that’s true. More than 70% of professionals get hired at companies where they already have a connection. And on LinkedIn, applicants who are referred to a job by a current employee are nine times more likely to get hired.\nIn other words, networks matter a lot. But, like opportunity, they are not distributed equally and are built over time. In fact, there are three key factors that contribute:\nWhere you grow up. A member in a zip code with a median income over $100K is nearly 3x more likely to have a stronger network than a member in a lower-income zip code\nWhere you go to school. A member at a top school is nearly 2x more likely to have a strong network\nWhere you work. A member who works at a Top Company is almost 2x more likely to have a strong network\nWe call this difference the network gap. The reality is that where you grow up, where you go to school, and where you work can give you a 12x advantage in gaining access to opportunity.\nWhat we are doing about it\nWe at LinkedIn have a unique opportunity to help close the network gap by focusing on solutions in at least three areas – technology, programs, and people. First, through our technology, by measuring the unintended consequences of every new product or feature we build. We do this by asking, “Does this feature increase or decrease inequality among our members?”\nSecond is through company-led apprenticeship programs that create opportunities for people with non-traditional backgrounds. At LinkedIn, we have introduced programs like Reach, Ramp, and Unlock, to train and hire talent for careers in engineering, recruiting, and sales.\nThird is through each of us. Together, we can make strides toward closing the network gap by reaching out to someone outside our own network.\nTake the Plus One Pledge\nLast year, I started keeping track of the informational interviews I was doing. I realized that almost every one of my meetings were with people who looked exactly like me: white women with four-year college degrees who were already in my network. The irony was not lost on me. Although I spend my days encouraging others to close the network gap, here I was unintentionally contributing to it. I made a commitment that, before helping another person who looked just like me, I would help someone outside my network. This commitment became the Plus One Pledge.\nEarlier this year, we asked our employees to take the Plus One Pledge and intentionally share their time, talent, and connections with someone outside their network. Their response was greater than we could have imagined: more than 60 percent of our employees took the pledge.\nDuring his keynote today at Talent Connect, our CEO Jeff Weiner talked about the network gap and encouraged people to take the Plus One Pledge. With roughly 151 million workers across the country, imagine what could happen if each of us committed to opening doors for people outside our networks. Even if only 10 percent committed to taking the Plus One Pledge, more than 15 million people would be connected to opportunity.\nIf you choose to take the Plus One Pledge, share your story on LinkedIn with the hashtag #PlusOnePledge. Together, we can help build strong networks and increase access to opportunity around the world."
    },
    {
      "url": "https://arxiv.org/abs/2006.15988?utm_",
      "text": "Economics > General Economics\n[Submitted on 26 Jun 2020 (v1), last revised 25 Feb 2022 (this version, v2)]\nTitle:Social Networks as a Mechanism for Discrimination\nView PDFAbstract:I study labor markets in which firms hire via referrals. I develop an employment model showing that--despite initial equality in ability, employment, wages, and network structure--minorities receive fewer jobs through referral and lower expected wages, simply because their social group is smaller. This disparity, termed \"social network discrimination,\" falls outside the dominant economics discrimination models--taste-based and statistical. Social network discrimination can be mitigated by minorities having more social ties or a \"stronger-knit\" network. I calibrate the model using a nationally-representative U.S. sample and estimate the lower-bound welfare gap caused by social network discrimination at over four percent, disadvantaging black workers.\nSubmission history\nFrom: Chika Okafor [view email][v1] Fri, 26 Jun 2020 12:20:23 UTC (451 KB)\n[v2] Fri, 25 Feb 2022 02:19:16 UTC (463 KB)\nCurrent browse context:\necon.GN\nReferences & Citations\nBibliographic and Citation Tools\nBibliographic Explorer (What is the Explorer?)\nConnected Papers (What is Connected Papers?)\nLitmaps (What is Litmaps?)\nscite Smart Citations (What are Smart Citations?)\nCode, Data and Media Associated with this Article\nalphaXiv (What is alphaXiv?)\nCatalyzeX Code Finder for Papers (What is CatalyzeX?)\nDagsHub (What is DagsHub?)\nGotit.pub (What is GotitPub?)\nHugging Face (What is Huggingface?)\nPapers with Code (What is Papers with Code?)\nScienceCast (What is ScienceCast?)\nDemos\nRecommenders and Search Tools\nInfluence Flower (What are Influence Flowers?)\nCORE Recommender (What is CORE?)\narXivLabs: experimental projects with community collaborators\narXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\nBoth individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\nHave an idea for a project that will add value for arXiv's community? Learn more about arXivLabs."
    },
    {
      "url": "https://www.forbes.com/sites/janicegassam/2025/06/24/92-million-jobs-gone-who-will-ai-erase-first/",
      "text": "By 2030, an estimated 92 million jobs will be displaced by AI, according to the World Economic Forum’s Future of Jobs Report 2025. This article explores how different communities will be impacted and displaced by AI. Research indicates that Black and Latino/Hispanic workers are more likely to experience AI-related job losses because these groups of workers are overrepresented in roles more likely to be replaced by automation and AI. Although AI has great potential, and the ability to close societal disparities, left unchecked, it may further exacerbate racial and economic inequalities in the workforce.\nWhile 92 million jobs may be lost due to AI, the same report indicates that 170 million new jobs will be created because of AI, with the jobs expected to see the most growth including farmworkers, delivery drivers, construction workers, salespeople and food processing workers. The jobs most at risk include cashiers and ticket clerks, administrative assistants, caretakers, cleaners and housekeepers. According to a 2023 McKinsey report on the impact of generative AI on Black communities, Black Americans “are overrepresented in roles most likely to be taken over by automation.” Similarly, a study from the UCLA Latino Policy and Politics Institute indicates that Latino workers in California occupy jobs that are at greater risk of automation. Lower-wage workers are also at risk, with many of these jobs being especially vulnerable to automation.\nBlack, Latino and low-wage workers are not just overrepresented in jobs that will be lost to AI and automation—these groups are also underrepresented in AI and tech roles, which were projected to see the most growth in 2025, according to LinkedIn’s Jobs on the Rise list. The Black tech talent gap persists, according to a 2023 McKinsey report, which highlighted the lack of Black representation in the fastest-growing tech roles. A 2024 Axios article highlighted the lack of Latino representation in tech—a problem that starts as early as grade school. The lack of Black and Latino representation in tech can be attributed to several different factors: a lack of exposure to technical career options, a lack of resources for skill development and networking, a lack of access to mentorship opportunities, being overlooked or steered away from STEM fields due to bias, and feelings of imposter syndrome and inadequacy.\nA lack of diversity in tech and AI can have deleterious impacts on the field. Issues like algorithmic bias, which is already pervasive in many hiring and recruitment tools, may be exacerbated by a lack of representation. A homogenous team creating tech tools may be less likely to recognize the need to create with different lived experiences in mind. For example, a lack of representation on a tech team could result in overlooking that a facial recognition system has a higher error rate for darker skin tones. A lack of diversity can lead to missing red flags during the creation of tech and AI systems which can lead to unintentional discrimination.\nWorkplaces must consider how the emergence of AI will widen existing disparities. There should be a concerted effort to ensure that there are workplace policies focused on the recruitment and retention of talent from underrepresented groups. Some strategies that should be considered to address this include: apprenticeship programs, the creation of community partnerships, and participation in job fairs to find candidates from historically excluded and marginalized backgrounds. Equity should be the nucleus of organizational efforts if a workplace hopes to be successful and sustainable moving forward. We must remember: it is imperative that AI is built and leveraged with intentionality, and equity must be forethought versus an afterthought."
    },
    {
      "url": "https://www.forbes.com/sites/janicegassam/2019/05/31/overcoming-the-angry-black-woman-stereotype/",
      "text": "A stereotype is defined as “a standardized mental picture that is held in common by members of a group and that represents an oversimplified opinion, prejudiced attitude, or uncritical judgment,” according to the Merriam-Webster dictionary. Underrepresented minority groups often find themselves having to overcome widely-held stereotypes about their groups. For Asians, they are dubbed the model minorities, with many of the labels and stereotypes about this group being more positive in nature, although they do experience stereotyping about their lack of interpersonal skills and their inability to be assertive. Women in the workplace must overcome the glass ceiling, which is the invisible barrier that prevents them from career ascension and progression. For black women in the workplace, this glass ceiling may seem even more impenetrable. Black women must overcome the angry black woman stereotype, which characterizes black women as bad-tempered, hostile and overly aggressive. For evidence of this stereotype, one must look no further than recent headlines regarding Serena Williams. Other examples of this stereotype being applied include Michelle Obama, Jemele Hill and Shonda Rhimes. The origin of the angry black woman stereotype is believed to stem from the 1950s radio show Amos ‘n’ Andy, which depicted black women as sassy and domineering. The angry black woman stereotype has persisted over half a century later. Columbia University professor Kimberlé Crenshaw states in her research that the intersectionality of the black woman’s experience is unique to that of black men and white women. Crenshaw also asserts that the double minority status of black women makes them more vulnerable to further marginalization. How can black women overcome the angry black woman stereotype in the workplace? What can organizations do to stop this stereotype from persisting?\n1. Educate yourself. Part of the problem and the reason why this stereotype persists is a lack of awareness that this stereotype exists as well as a lack of understanding regarding black women’s experiences. There are a number of different books that detail the black woman’s experience and will give outsiders a deeper understanding of what black women go through on a daily basis. Education is a powerful tool in dismantling prejudiced and racist ideals. A lack of understanding and awareness of the experiences of different marginalized groups only further widens the perceived gap. Take the time to learn more about your black female coworkers.\n2. Express yourself. Although the angry black woman stereotype can lead to negative workplace experiences and outcomes, one ground-breaking study found that because black women are more likely to be thought of as assertive, dominant and exhibiting traits often associated with white male leaders, they were not penalized for displaying these traits, whereas their white female and black male counterparts were. The research found that because of the double minority status of black women, they experienced something like a canceling out effect, which minimized the discrimination they experienced in relation to their counterparts. This research is encouraging for black women who fear expressing their emotions and displaying certain traits at work.\nIn addition, black women were found to experience many negative health outcomes including anxiety, at a greater rate than their white counterparts. Repressing emotions like anger for fear of adhering to the angry black woman stereotype may actually end up being more damaging in the long run. Aside from the fact that bottling up one’s emotions is an unhealthy practice in general, when black women display a range of emotions, this can help others to see that black women are multifaceted and dynamic. Witnessing black women displaying different emotions, whether that be anger, sadness, or joy helps to normalize it.\n3. Check yourself. Unconscious biases may further perpetuate the angry black woman stereotype at work. Diversity and inclusion training should focus on these unchecked beliefs and views that each employee holds about other groups. Employees should be given the opportunity to listen to black women’s experiences and stories. Employees should also be encouraged to amplify the voices of black women and women of color, especially during board room discussions and meetings. When was the last time you supported a black woman at work? What formal or informal mentorship opportunities does your company offer? What are the ways that you could utilize your knowledge and expertise to uplift a black woman are your company? These are all important questions that each employee should ask themselves. It is imperative to speak up when you witness the label being applied to black women. Whether it is you who is being labeled or another employee who this stereotype is being applied to, it is critical to speak up and speak out. When stereotyping goes unchecked, this gives employees the perception that this behavior is acceptable. It might even be something as seemingly benign as a coworker commenting on Michelle Obama’s demeanor or giving an opinion on Serena Williams’ approach. Any employee who is complicit when witnessing stereotypes being perpetuated is contributing to the larger problem. The responsibility of deconstructing racism and sexism belongs to each employee. Using your voice to amplify the voices of black women, learning more about how you could be contributing to the problem, and speaking out against labeling and stereotyping are all methods that employees can utilize to foster a more inclusive workplace."
    },
    {
      "url": "https://www.hks.harvard.edu/publications/intersectional-peer-effects-work-effect-white-coworkers-black-womens-careers",
      "text": "HKS Faculty Research Working Paper Series\nHKS Working Paper No. RWP23-031\nJuly 2024\nAbstract\nThis paper investigates how having more White coworkers influences the subsequent retention and promotion of Black women. Studying 9,037 new hires at a professional services firm, we first document large racial turnover and promotion gaps: even after controlling for observable characteristics, Black employees are 6.7 percentage points (32%) more likely to turn over within two years and 18.7 percentage points (26%) less likely to be promoted on time than their White counterparts. The largest turnover gap is between Black and White women, at 8.9 percentage points (51%). We argue that initial assignment to project teams is conditionally random, based on placebo tests and qualitative evidence. Under the assumption of conditional random assignment, we show that a one standard deviation (20.8 percentage points) increase in the share of White coworkers is associated with a 15.8 percentage point increase in turnover and an 11.5 percentage point decrease in promotion for Black women. We refer to these effects as intersectional: Black women are the only race-gender group whose turnover and promotion is negatively impacted by White coworkers. We explore potential causal pathways through which these peer effects may emerge: Black women who were initially assigned to Whiter teams are subsequently more likely to be labeled as low performers and report fewer billable hours, both of which are predictors of higher turnover and lower promotion for all employees. Our findings contribute to the literatures on peer effects, intersectionality, and the practice of managing race and gender inequality in organizations.\nCitation\nLinos, Elizabeth, Sanaz Mobasseri, and Nina Roussille. \"Intersectional Peer Effects at Work: The Effect of White Coworkers on Black Women's Careers.\" RWP23-031, July 2024."
    },
    {
      "url": "https://www.catalyst.org/en-us/insights/featured/erg",
      "text": "Employee Resource Groups (ERGs) are voluntary, employee-led groups that foster inclusive work environments aligned with business values, goals, and objectives.\nWhether they’re known as ERGs, Business Resource Groups (BRGs), Colleague Resource Groups (CRGs), Diversity Networks, or something else—these initiatives provide professional development, cultivate a sense of belonging, and increase employee engagement. They positively impact the bottom line by boosting retention, attracting top talent, and expanding marketplace reach.\nFor years, ERGs have been a vital component in creating inclusive workplaces. Amidst a changing sociopolitical landscape around inclusion, especially in the US, ERGs remain key to sustaining global workplaces where all employees can thrive. They form powerful connecting tissue among employees—across departments, leadership levels, and demographics.\nNew and established ERGs face challenges such as a lack of alignment with business goals, low member engagement, lack of clarity on how to assess impact, and limited resources. Organizations that want to capitalize on ERGs as they finesse their inclusion strategies must have a clear understanding of how to support them so that both employees and businesses grow.\nENERGIZE is the virtual conference where ERG members, leaders, and sponsors elevate their impact from passion to performance. Save your seat today.\nRead our ENERGIZE 2025 recap"
    }
  ],
  "argos_summary": "A recent MSNBC article highlights a concerning trend where nearly 300,000 Black women have left the U.S. labor force in just three months, primarily due to federal job cuts and the dismantling of Diversity, Equity, and Inclusion (DEI) programs. This exodus not only affects the individuals but also poses a significant risk to the overall U.S. economy, as Black women are crucial contributors to household income and economic stability. The article emphasizes the compounded challenges faced by Black women, including inflation, student loan debt, and systemic biases in hiring practices exacerbated by the rise of AI, which threatens their job security and career advancement.",
  "argos_id": "K68M1HA94"
}