{
  "url": "http://www.techtimes.com/articles/311537/20250804/zai-launches-glm-45-chinas-most-advanced-open-source-ai-model.htm",
  "authorsByline": "",
  "articleId": "b1aa8270f8af484a95ed94b2755bbb6b",
  "source": {
    "domain": "techtimes.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.techtimes.com/en/full/458692/zai.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T01:55:28-04:00",
  "addDate": "2025-08-04T06:03:59.496716+00:00",
  "refreshDate": "2025-08-04T06:03:59.496718+00:00",
  "score": 1.0,
  "title": "Z.ai Launches GLM-4.5: China's Most Advanced Open-Source AI Model",
  "description": "Z.ai's GLM-4.5 introduces China's first open-source Mixture of Experts model, offering fast, cost-efficient, agent-native AI performance for global developers.",
  "content": "New York, July 29, 2025 — Chinese AI company Z.ai has released GLM-4.5, its latest open-source base model that sets a new performance benchmark for open foundation models. Built on a fully self-developed architecture, GLM-4.5 is China's first open-source Mixture of Experts (MoE) model and aims to deliver high performance while reducing deployment costs for developers.\n\nThe GLM-4.5 lineup includes two versions: The 355B-parameter flagship and the lighter GLM-4.5-Air at 106B parameters. Both integrate native reasoning, coding, and agentic capabilities and were evaluated across 12 benchmark tests. GLM-4.5 ranked third globally overall and first among open-source and Chinese-developed models.\n\nDesigned with efficiency in mind, GLM-4.5-Air leads its class in the 100B-parameter range. The models also offer fast generation speeds (100+ tokens/sec) and competitive pricing at $0.11/million input tokens and $0.28/million output tokens.\n\nWhat sets GLM-4.5 apart is its architecture. Agentic functions like multi-step planning, visualisation, and workflow management are embedded directly into the model's core, offering unified reasoning, perception, and action within a single framework.\n\nIn contrast to closed models, GLM-4.5 is released under an open, auditable licence, with on-premise deployment and fine-tuning options—providing more transparency and control for enterprises.\n\nZ.ai has been recognised by OpenAI as one of the few global companies building competitive AI models. It was also listed in Stanford's 2025 AI Index as a developer of and is the first Chinese firm to sign the Frontier AI Safety Commitments.\n\nSince 2020, Z.ai's open-source models have exceeded 40 million downloads. The company's portfolio includes the GLM series, AutoGLM agent models, small-footprint Flash models, and a growing suite of developer tools and APIs.\n\nFounded in 2019, Z.ai (formerly Zhipu) is a leading Chinese AI company focused on developing next-generation cognitive models. Since launching the GLM pre-training framework in 2020, Z.ai has released several industry-leading models, including GLM-130B and ChatGLM, with over 40 million global downloads. Its product suite includes Z.ai, QingYan, CodeGeeX, CogVLM, and CogView, as well as an innovative Model-as-a-Service (MaaS) platform for developers and enterprises. Recognised with numerous industry awards, Z.ai is driving progress towards the era of artificial general intelligence.",
  "medium": "Article",
  "links": [
    "https://www.zhipuai.cn/en"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "open foundation models",
      "weight": 0.111035965
    },
    {
      "name": "competitive AI models",
      "weight": 0.105176896
    },
    {
      "name": "closed models",
      "weight": 0.097490735
    },
    {
      "name": "Chinese AI company Z.ai",
      "weight": 0.097457536
    },
    {
      "name": "AutoGLM agent models",
      "weight": 0.09651954
    },
    {
      "name": "GLM-4.5",
      "weight": 0.08053976
    },
    {
      "name": "Z.ai",
      "weight": 0.07937162
    },
    {
      "name": "multi-step planning",
      "weight": 0.06533145
    },
    {
      "name": "developer tools",
      "weight": 0.06516159
    },
    {
      "name": "Z.ais open-source models",
      "weight": 0.06276049
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.916015625
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.8505859375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.50537109375
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.475341796875
    }
  ],
  "sentiment": {
    "positive": 0.6582031,
    "negative": 0.01979065,
    "neutral": 0.32177734
  },
  "summary": "Chinese AI company Z.ai has released GLM-4.5, its latest open-source base model, which sets a new performance benchmark for open foundation models. The GLM.5 is built on a self-developed architecture and aims to deliver high performance while reducing deployment costs for developers. The release includes two versions: the 355B-parameter flagship and the lighter GLM.-4. 5-Air at 106B parameters. The architecture allows agentic functions such as multi-step planning, visualisation, and workflow management to be embedded directly into the model's core. Since 2020, Z.AI's open-spirited models have exceeded 40 million downloads. The company has been recognised by OpenAI as one of the few global companies building competitive AI models.",
  "shortSummary": "Chinese AI company Z.ai launched GLM-4.5-Air, China's first fully-developed open-source AI model, offering high-performance, efficient, and cost-efficient models with transparent deployment costs and transparency.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "29ecbc2da3984c838cb3ca778461d6e3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Chinese AI company Z.ai has launched GLM-4.5, an open-source base model that sets a new standard for performance in open foundation models. It features two versions, including a flagship 355B-parameter model and a lighter 106B-parameter variant, both equipped with advanced reasoning and coding capabilities. GLM-4.5 is notable for its efficient architecture, offering fast generation speeds and competitive pricing, while also being released under an open license for greater transparency. Z.ai has gained recognition for its contributions to AI, with over 40 million downloads of its models since 2020.",
  "argos_id": "L4XWP5KNJ"
}