{
  "url": "https://www.usatoday.com/story/opinion/columnist/2025/08/04/trump-vance-republicans-democrats-harris-future/85462114007/",
  "authorsByline": "Nicole Russell",
  "articleId": "50fab29d9897494dac20227e4d5032bc",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/07/31/USAT/85454728007-usatsi-25231110.jpg?crop=2397,1349,x0,y0&width=2397&height=1349&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T08:02:52+00:00",
  "addDate": "2025-08-04T08:10:00.517366+00:00",
  "refreshDate": "2025-08-04T08:10:00.517368+00:00",
  "score": 1.0,
  "title": "Democrats have devolved into a clown show. No wonder polls show voters prefer GOP.",
  "description": "The Republican Party could be even more dominant after President Donald Trump leaves office. Democrats, in contrast, appear aimless.",
  "content": "Forget a tale of two cities, the vast differences between today's two major political parties is far more relevant.\n\nA recent Wall Street Journal survey shows that the Democratic Party got its lowest rating from voters in 35 years. Despite President Donald Trump's tariffs, Republicans are still preferred on most issues.\n\nThen Americans learned, while he was running for reelection, that Biden suffered from serious cognitive decline, raising questions about what the Democratic Party knew and when. Americans lost trust that Democrats were transparent and honest.\n\nNine months after Trump was reelected, Democrats still lack direction and competent leaders. Here are a few examples:\n• The party's brightest star, failed presidential candidate Kamala Harris, announced she won't run for governor of California, where she previously served as attorney general.\n• New Jersey Sen. Cory Booker, once seen as a rising star, regularly engages in bizarre political theater to make his points, from lengthy filibusters to clashes with members of his own party on the Senate floor. Booker recently told Sen. Amy Klobuchar, D-Minnesota, not to question his motives after a heated exchange about impending legislation.\n• California Rep. Eric Swalwell posted a video of himself bench-pressing weights at a gym while complaining about the Republican Party. Conservatives mocked him, including Fox News' Greg Gutfeld. In response, Swalwell challenged Gutfeld to a bench-pressing match.\n\nAre Democrats OK? They appear desperate, and increasingly are becoming a clown show without direction or purpose.\n\nThe chaos and aimlessness at the national level also exists in Democratic-controlled states. In California and New York, progressive leaders ensure that residents are hurt by high tax rates and other policies that push businesses to relocate.\n\nCalifornia and New York serve as cautionary tales for much of the country. As Democratic states lose population, Florida, Texas and other deep red states are growing rapidly. A Democrat hasn't won statewide office in Texas since 1994. And no Democrat currently holds statewide office in Florida.\n\nDeveloping new political talent in the second and third largest states in the nation − and in states like Indiana, Ohio and Tennessee − is now almost impossible for Democrats, a reality that is sure to hurt the party's future on the local, state and national levels.\n\nReapportionment after the 2030 Census also is likely to be brutal for Democrats. The Brennan Center, a progressive think tank, reported that \"California would lose 4 of its 52 congressional districts in reapportionment − only the second time the Golden State has ever lost representation. New York, meanwhile, would lose three seats, Illinois two, and Pennsylvania one, leaving all three states with congressional delegations half the size they were in 1940.\"\n\nIt's not just House seats that Democratic states will shed. Red states also stand to gain more Electoral College votes, which gives future Republican presidential candidates a stronger mathematical advantage.\n\nGOP is humming now and into the future\n\nMeanwhile, Trump has accomplished more in his first six months than Joe Biden did in four years. Trump is overhauling the federal bureaucracy, reworking the global economy on more favorable terms for Americans, persuading American allies to pay more for their own defense, forcing universities to better protect Jewish students and faculty and to finally respect conservatives on campus, safeguarding women's rights, promoting the U.S. energy sector and other industries to a remarkable degree around the world, and pushing for peace from India to Ukraine.\n\nTrump also is building a conservative political dynasty that is set to take his place after he leaves office in 2029.\n\nVice President JD Vance is the GOP's most promising star. He has proved to be articulate and passionate on difficult issues, in the U.S. and while representing America overseas. Intelligent and media savvy, Vance has most, if not all, of the positive qualities a leader needs with few of Trump's less savory qualities.\n\nVance is the heavy early favorite to win the GOP presidential nomination in 2028 and could very well lead Republicans to political dominance for years to come.\n\nIt's not only Vance, however, with a promising future.\n\nNew York Republican Rep. Elise Stefanik has made a name for herself standing against antisemitism, especially in institutions of higher education. She's sharp, bold and outspoken about her values.\n\nAt just 31 years old, Texas Rep. Brandon Gill made headlines when he questioned NPR CEO Katherine Maher in a hearing about her leftist political bias.\n\nSecretary of State Marco Rubio is strongly and effectively representing U.S. interests around the globe. Only 54, Rubio, a former senator and presidential candidate from Florida, is a potential Republican presidential nominee for the next two decades.\n\nThe Republican Party is in a strong position now and could be even more dominant after Trump leaves office.\n\nDemocrats, in contrast, look aimless now, and their future appears even more grim. No wonder voters aren't attracted to them.\n\nNicole Russell is a columnist at USA TODAY and a mother of four who lives in Texas. Contact her at nrussell@gannett.com and follow her on X, formerly Twitter: @russell_nm. Sign up for her weekly newsletter, The Right Track, here.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/opinion/columnist/2025/04/02/trump-third-term-2028-vance-haley-rubio/82743857007/",
    "https://www.usatoday.com/story/opinion/columnist/2025/07/29/trump-eu-trade-deal-us-jobs/85340091007/",
    "https://www.usatoday.com/story/opinion/columnist/2025/07/25/columbia-university-settlement-trump-antisemitism/85354418007/",
    "https://profile.usatoday.com/newsletters/the-right-track/",
    "https://www.armscontrol.org/act/2024-10/features/rethinking-us-nuclear-diplomacy-iran-2025",
    "https://www.usatoday.com/story/opinion/columnist/2024/09/04/hamas-hostages-killed-gaza-jewish-americans-antisemitism/75055541007/",
    "https://www.usatoday.com/story/opinion/columnist/2024/06/13/biden-age-mental-physical-decline-hunter-conviction/74062088007/",
    "https://bioguide.congress.gov/search/bio/R000595",
    "https://www.britannica.com/topic/largest-U-S-state-by-population",
    "https://www.weforum.org/stories/2025/07/the-eu-us-trade-deal-explained-eu-competitiveness/",
    "https://www.usatoday.com/story/news/politics/2025/07/30/kamala-harris-california-governor-race/85444711007/",
    "https://thehill.com/homenews/house/5428513-eric-swalwell-bench-press-challenge/",
    "https://bioguide.congress.gov/search/bio/G000603",
    "https://x.com/russell_nm",
    "https://www.youtube.com/watch?v=OHMkYFv97VQ",
    "https://www.youtube.com/watch?v=cVcudC-LIys",
    "https://www.usatoday.com/story/opinion/columnist/2025/07/10/trump-netanyahu-nobel-prize-israel-iran/84505423007/",
    "https://www.usatoday.com/story/opinion/columnist/2025/07/30/trump-gdp-us-economy-rebound-tariffs/85406642007/",
    "https://puzzles.usatoday.com/",
    "https://www.usatoday.com/story/opinion/columnist/2025/07/24/in-n-out-lynsi-snyder-california-tennessee/85324468007/",
    "https://www.brennancenter.org/our-work/analysis-opinion/how-congressional-maps-could-change-2030",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/",
    "https://www.usatoday.com/story/opinion/columnist/2025/07/21/trump-education-department-layoffs/85257106007/",
    "https://www.wsj.com/politics/elections/democratic-party-poll-voter-confidence-july-2025-9db38021?gaa_at=eafs&gaa_n=ASWzDAjGwp6Nbrm8VxAeKsYGWTm4UfkjUTLhK6okKEztKGupgiLKkGVkMvPA2QqesCY%3D&gaa_ts=688b6db5&gaa_sig=a6Adu88NdbTGyIsczM6UKN0JQT_Mc9AKNxKOSrmvLBoZtJRYgKzy2gibtiQuwqP2z-2xxH0A-P18NCycHdO7mQ%3D%3D",
    "https://www.usatoday.com/news/politics/joe-biden/",
    "https://www.usatoday.com/story/opinion/columnist/2025/02/19/vance-free-speech-europe-60-minutes/78960055007/",
    "https://www.youtube.com/watch?v=yZjK7OdVi6U&pp=0gcJCfwAo7VqN5tD",
    "https://www.nbcnews.com/politics/congress/senate-floor-clash-booker-cortez-masto-democrats-rcna222027",
    "https://www.fox4news.com/election/texas-democrat-statewide-senate-president",
    "https://www.youtube.com/watch?v=r4E_hbW8bYo",
    "https://www.politico.com/news/2025/04/24/florida-pizza-democrats-unaffiliated-departure-legislature-00308629"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other deep red states",
      "weight": 0.06452672
    },
    {
      "name": "Red states",
      "weight": 0.061174728
    },
    {
      "name": "Democratic states",
      "weight": 0.06060724
    },
    {
      "name": "future Republican presidential candidates",
      "weight": 0.059813652
    },
    {
      "name": "presidential candidate",
      "weight": 0.059410416
    },
    {
      "name": "states",
      "weight": 0.05874241
    },
    {
      "name": "New York Republican Rep. Elise Stefanik",
      "weight": 0.058659546
    },
    {
      "name": "political dominance",
      "weight": 0.05670496
    },
    {
      "name": "failed presidential candidate Kamala Harris",
      "weight": 0.056492727
    },
    {
      "name": "bizarre political theater",
      "weight": 0.05645015
    }
  ],
  "topics": [
    {
      "name": "GOP"
    },
    {
      "name": "Voters"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.98388671875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.97998046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.7431640625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.7080078125
    }
  ],
  "sentiment": {
    "positive": 0.041107178,
    "negative": 0.78466797,
    "neutral": 0.17443848
  },
  "summary": "The differences between the two major political parties are highlighted in a recent survey by the Wall Street Journal, showing that the Democratic Party has the lowest rating from voters in 35 years. The survey also revealed that the party's brightest star, Kamala Harris, has decided not to run for governor of California, where she previously served as attorney general. Meanwhile, New Jersey Sen. Cory Booker and California Rep. Eric Swalwell have both been criticized for their bizarre political performances and lack of direction and purpose. The report suggests that while Democrats are losing population, Florida, Texas, and other deep red states are growing rapidly. Reapportionment after the 2030 Census is likely to be a challenge for Democrats, with California expected to lose 4 of its 52 congressional districts in this process. Meanwhile the Republican Party is in a strong position and could be even more dominant after Trump leaves office.",
  "shortSummary": "The Democratic Party's decline, led by Kamala Harris' departure, is mirrored by Republican dominance, while Democrats decline as they struggle with leadership and state losses.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5827cb45778f4c58b4594f20f17b968c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/04/02/trump-third-term-2028-vance-haley-rubio/82743857007/",
      "text": "Republicans don't need Trump to run again. Vance is ready to take the lead. | Opinion\nJD Vance has shown he is capable of much more than a supporting role in the years ahead. That is one of many reasons why the idea of Donald Trump running for president in 2028 should be moot.\nWhen I heard last year that Donald Trump was considering JD Vance as his vice presidential pick, I added that to my long list of disappointments in the Republican Party.\nNo offense to the now former senator from Ohio, but Vance came across to me as stuffy, religious and boring.\nBoy, was I wrong. And I've never been more glad to be wrong.\nVance this week factored into the president's response to reporters' questions about whether he might run for a third term. \"There are methods which you could do it,\" Trump said Sunday in an interview with NBC News.\nAlthough the 22nd Amendment to the Constitution bars a president from serving more than two terms, the NBC reporters floated the idea of Vance winning the GOP nomination for president in 2028, selecting Trump as his running mate and then ceding power to Trump once elected.\nHard no, as the kids say.\nRepublicans don't need Trump to use Vance as a Trojan horse to sneak back into office. Vance is the future of the Republican Party, not Trump.\nVance is a great communicator of Trump's agenda\nVance has shown that he is capable of much more than a supporting role in the years ahead. That is one of many reasons why the idea of Trump running for president in 2028 should be moot.\nVance already is a much better communicator than Trump, who often rambles. The vice president is persuasive in all kinds of formats. Whether it's pummeling Minnesota Gov. Tim Waltz during last year's vice presidential debate, speaking to journalists or defending free speech to European leaders, Vance sounds prepared and confident.\nVance also is well-versed in the tenets of the free market, personal responsibility and liberty. On social media and in speeches, Vance is able to communicate how those values work together to make America stronger and Americans' lives better.\nLast week, at the Marine Corps base in Quantico, Virginia, the vice president delivered an inspirational address that explained Trump's vision for the U.S. military better than Trump can himself.\n\"Under President Trump's leadership, we believe in a very simple principle,\" Vance said. \"We don't care who you are, where you came from. We don't care what skin color you are. We care about excellence and we care about patriotism. And if you are awesome and you are a patriotic young Marine, then we are going to do everything that we can to make you the most lethal fighting force the world has ever seen. And that is what we're doing every single day.\"\nSign me up.\nVance has an inspiring story of his own, growing up in a poor family plagued with domestic violence and substance abuse. He eventually graduated from Yale Law School, wrote a bestselling memoir and was elected to the U.S. Senate in his native Ohio.\nVance also appears to be an adoring husband and devoted father, which contrasts with Trump's personal woes.\nRepublicans' deep bench includes Haley and Rubio\nVance isn't the GOP's only strength. Unlike the Democratic Party, Republicans have a deep bench ‒ including former U.S. Ambassador to the United Nations Nikki Haley, Senate Majority Leader John Thune and Secretary of State Marco Rubio.\nIn contrast, key Democratic leaders like New Jersey Sen. Cory Booker and New York Rep. Alexandria Ocasio-Cortez come across as desperate and flailing to recover from their party's disastrous results in last year's elections.\nVance, the first millennial to serve as vice president, can be the bridge connecting Trump's base of support, the still-emerging constituencies of the new right and conservatives like me who still worry about Trump's character and personality.\nRepublicans have the opportunity to chart a new course in 2028. JD Vance may well be the leader the GOP needs to take the helm once Donald Trump's days in the White House are done.\nNicole Russell is a columnist at USA TODAY and a mother of four who lives in Texas. Contact her at nrussell@gannett.com and follow her on X, formerly Twitter: @russell_nm. Sign up for her weekly newsletter, The Right Track, here."
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/",
      "text": "DEFENDING WOMEN FROM GENDER IDEOLOGY EXTREMISM AND RESTORING BIOLOGICAL TRUTH TO THE FEDERAL GOVERNMENT\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby ordered:\nSection 1. Purpose. Across the country, ideologues who deny the biological reality of sex have increasingly used legal and other socially coercive means to permit men to self-identify as women and gain access to intimate single-sex spaces and activities designed for women, from women’s domestic abuse shelters to women’s workplace showers. This is wrong. Efforts to eradicate the biological reality of sex fundamentally attack women by depriving them of their dignity, safety, and well-being. The erasure of sex in language and policy has a corrosive impact not just on women but on the validity of the entire American system. Basing Federal policy on truth is critical to scientific inquiry, public safety, morale, and trust in government itself.\nThis unhealthy road is paved by an ongoing and purposeful attack against the ordinary and longstanding use and understanding of biological and scientific terms, replacing the immutable biological reality of sex with an internal, fluid, and subjective sense of self unmoored from biological facts. Invalidating the true and biological category of “woman” improperly transforms laws and policies designed to protect sex-based opportunities into laws and policies that undermine them, replacing longstanding, cherished legal rights and values with an identity-based, inchoate social concept.\nAccordingly, my Administration will defend women’s rights and protect freedom of conscience by using clear and accurate language and policies that recognize women are biologically female, and men are biologically male.\nSec. 2. Policy and Definitions. It is the policy of the United States to recognize two sexes, male and female. These sexes are not changeable and are grounded in fundamental and incontrovertible reality. Under my direction, the Executive Branch will enforce all sex-protective laws to promote this reality, and the following definitions shall govern all Executive interpretation of and application of Federal law and administration policy:\n(a) “Sex” shall refer to an individual’s immutable biological classification as either male or female. “Sex” is not a synonym for and does not include the concept of “gender identity.”\n(b) “Women” or “woman” and “girls” or “girl” shall mean adult and juvenile human females, respectively.\n(c) “Men” or “man” and “boys” or “boy” shall mean adult and juvenile human males, respectively.\n(d) “Female” means a person belonging, at conception, to the sex that produces the large reproductive cell.\n(e) “Male” means a person belonging, at conception, to the sex that produces the small reproductive cell.\n(f) “Gender ideology” replaces the biological category of sex with an ever-shifting concept of self-assessed gender identity, permitting the false claim that males can identify as and thus become women and vice versa, and requiring all institutions of society to regard this false claim as true. Gender ideology includes the idea that there is a vast spectrum of genders that are disconnected from one’s sex. Gender ideology is internally inconsistent, in that it diminishes sex as an identifiable or useful category but nevertheless maintains that it is possible for a person to be born in the wrong sexed body.\n(g) “Gender identity” reflects a fully internal and subjective sense of self, disconnected from biological reality and sex and existing on an infinite continuum, that does not provide a meaningful basis for identification and cannot be recognized as a replacement for sex.\nSec. 3. Recognizing Women Are Biologically Distinct From Men. (a) Within 30 days of the date of this order, the Secretary of Health and Human Services shall provide to the U.S. Government, external partners, and the public clear guidance expanding on the sex-based definitions set forth in this order.\n(b) Each agency and all Federal employees shall enforce laws governing sex-based rights, protections, opportunities, and accommodations to protect men and women as biologically distinct sexes. Each agency should therefore give the terms “sex”, “male”, “female”, “men”, “women”, “boys” and “girls” the meanings set forth in section 2 of this order when interpreting or applying statutes, regulations, or guidance and in all other official agency business, documents, and communications.\n(c) When administering or enforcing sex-based distinctions, every agency and all Federal employees acting in an official capacity on behalf of their agency shall use the term “sex” and not “gender” in all applicable Federal policies and documents.\n(d) The Secretaries of State and Homeland Security, and the Director of the Office of Personnel Management, shall implement changes to require that government-issued identification documents, including passports, visas, and Global Entry cards, accurately reflect the holder’s sex, as defined under section 2 of this order; and the Director of the Office of Personnel Management shall ensure that applicable personnel records accurately report Federal employees’ sex, as defined by section 2 of this order.\n(e) Agencies shall remove all statements, policies, regulations, forms, communications, or other internal and external messages that promote or otherwise inculcate gender ideology, and shall cease issuing such statements, policies, regulations, forms, communications or other messages. Agency forms that require an individual’s sex shall list male or female, and shall not request gender identity. Agencies shall take all necessary steps, as permitted by law, to end the Federal funding of gender ideology.\n(f) The prior Administration argued that the Supreme Court’s decision in Bostock v. Clayton County (2020), which addressed Title VII of the Civil Rights Act of 1964, requires gender identity-based access to single-sex spaces under, for example, Title IX of the Educational Amendments Act. This position is legally untenable and has harmed women. The Attorney General shall therefore immediately issue guidance to agencies to correct the misapplication of the Supreme Court’s decision in Bostock v. Clayton County (2020) to sex-based distinctions in agency activities. In addition, the Attorney General shall issue guidance and assist agencies in protecting sex-based distinctions, which are explicitly permitted under Constitutional and statutory precedent.\n(g) Federal funds shall not be used to promote gender ideology. Each agency shall assess grant conditions and grantee preferences and ensure grant funds do not promote gender ideology.\nSec. 4. Privacy in Intimate Spaces. (a) The Attorney General and Secretary of Homeland Security shall ensure that males are not detained in women’s prisons or housed in women’s detention centers, including through amendment, as necessary, of Part 115.41 of title 28, Code of Federal Regulations and interpretation guidance regarding the Americans with Disabilities Act.\n(b) The Secretary of Housing and Urban Development shall prepare and submit for notice and comment rulemaking a policy to rescind the final rule entitled “Equal Access in Accordance with an Individual’s Gender Identity in Community Planning and Development Programs” of September 21, 2016, 81 FR 64763, and shall submit for public comment a policy protecting women seeking single-sex rape shelters.\n(c) The Attorney General shall ensure that the Bureau of Prisons revises its policies concerning medical care to be consistent with this order, and shall ensure that no Federal funds are expended for any medical procedure, treatment, or drug for the purpose of conforming an inmate’s appearance to that of the opposite sex.\n(d) Agencies shall effectuate this policy by taking appropriate action to ensure that intimate spaces designated for women, girls, or females (or for men, boys, or males) are designated by sex and not identity.\nSec. 5. Protecting Rights. The Attorney General shall issue guidance to ensure the freedom to express the binary nature of sex and the right to single-sex spaces in workplaces and federally funded entities covered by the Civil Rights Act of 1964. In accordance with that guidance, the Attorney General, the Secretary of Labor, the General Counsel and Chair of the Equal Employment Opportunity Commission, and each other agency head with enforcement responsibilities under the Civil Rights Act shall prioritize investigations and litigation to enforce the rights and freedoms identified.\nSec. 6. Bill Text. Within 30 days of the date of this order, the Assistant to the President for Legislative Affairs shall present to the President proposed bill text to codify the definitions in this order.\nSec. 7. Agency Implementation and Reporting. (a) Within 120 days of the date of this order, each agency head shall submit an update on implementation of this order to the President, through the Director of the Office of Management and Budget. That update shall address:\n(i) changes to agency documents, including regulations, guidance, forms, and communications, made to comply with this order; and\n(ii) agency-imposed requirements on federally funded entities, including contractors, to achieve the policy of this order.\n(b) The requirements of this order supersede conflicting provisions in any previous Executive Orders or Presidential Memoranda, including but not limited to Executive Orders 13988 of January 20, 2021, 14004 of January 25, 2021, 14020 and 14021 of March 8, 2021, and 14075 of June 15, 2022. These Executive Orders are hereby rescinded, and the White House Gender Policy Council established by Executive Order 14020 is dissolved.\n(c) Each agency head shall promptly rescind all guidance documents inconsistent with the requirements of this order or the Attorney General’s guidance issued pursuant to this order, or rescind such parts of such documents that are inconsistent in such manner. Such documents include, but are not limited to:\n(i) “The White House Toolkit on Transgender Equality”;\n(ii) the Department of Education’s guidance documents including:\n(A) “2024 Title IX Regulations: Pointers for Implementation” (July 2024);\n(B) “U.S. Department of Education Toolkit: Creating Inclusive and Nondiscriminatory School Environments for LGBTQI+ Students”;\n(C) “U.S. Department of Education Supporting LGBTQI+ Youth and Families in School” (June 21, 2023);\n(D) “Departamento de Educación de EE.UU. Apoyar a los jóvenes y familias LGBTQI+ en la escuela” (June 21, 2023);\n(E) “Supporting Intersex Students: A Resource for Students, Families, and Educators” (October 2021);\n(F) “Supporting Transgender Youth in School” (June 2021);\n(G) “Letter to Educators on Title IX’s 49th Anniversary” (June 23, 2021);\n(H) “Confronting Anti-LGBTQI+ Harassment in Schools: A Resource for Students and Families” (June 2021);\n(I) “Enforcement of Title IX of the Education Amendments of 1972 With Respect to Discrimination Based on Sexual Orientation and Gender Identity in Light of Bostock v. Clayton County” (June 22, 2021);\n(J) “Education in a Pandemic: The Disparate Impacts of COVID-19 on America’s Students” (June 9, 2021); and\n(K) “Back-to-School Message for Transgender Students from the U.S. Depts of Justice, Education, and HHS” (Aug. 17, 2021);\n(iii) the Attorney General’s Memorandum of March 26, 2021 entitled “Application of Bostock v. Clayton County to Title IX of the Education Amendments of 1972″; and\n(iv) the Equal Employment Opportunity Commission’s “Enforcement Guidance on Harassment in the Workplace” (April 29, 2024).\nSec. 8. General Provisions. (a) Nothing in this order shall be construed to impair or otherwise affect:\n(i) the authority granted by law to an executive department or agency, or the head thereof; or\n(ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n(b) This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n(c) This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n(d) If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.\nTHE WHITE HOUSE,\nJanuary 20, 2025."
    },
    {
      "url": "https://www.britannica.com/topic/largest-U-S-state-by-population",
      "text": "list of U.S. states by population\n- Related Topics:\n- United States\n- U.S. state\nAs of 2023, the United States was the world’s third most-populated country, with more than 335,000,000 people. The U.S. state with the largest population is California, which has some 39,000,000 residents. Second is Texas, with more than 30,000,000. Several states have less than 1,000,000 people, and Wyoming holds the title of the least-populated state, with fewer than 600,000. How do the other states rank? Find out in the table below, which lists the 50 U.S. states by the latest population estimate.\n| U.S. state | population: estimate | population: census |\n|---|---|---|\n| 1. California | (2024 est.) 39,431,263 | (2020) 39,538,223 |\n| 2. Texas | (2024 est.) 31,290,831 | (2020) 29,145,505 |\n| 3. Florida | (2024 est.) 23,372,215 | (2020) 21,538,187 |\n| 4. New York | (2024 est.) 19,867,248 | (2020) 20,201,249 |\n| 5. Pennsylvania | (2024 est.) 13,078,751 | (2020) 13,002,700 |\n| 6. Illinois | (2024 est.) 12,710,158 | (2020) 12,812,508 |\n| 7. Ohio | (2024 est.) 11,883,304 | (2020) 11,799,448 |\n| 8. Georgia | (2024 est.) 11,180,878 | (2020) 10,711,908 |\n| 9. North Carolina | (2024 est.) 11,046,024 | (2020) 10,439,388 |\n| 10. Michigan | (2024 est.) 10,140,459 | (2020) 10,077,331 |\n| 11. New Jersey | (2024 est.) 9,500,851 | (2020) 9,288,994 |\n| 12. Virginia | (2024 est.) 8,811,195 | (2020) 8,631,393 |\n| 13. Washington | (2024 est.) 7,958,180 | (2020) 7,705,281 |\n| 14. Arizona | (2024 est.) 7,582,384 | (2020) 7,151,502 |\n| 15. Tennessee | (2024 est.) 7,227,750 | (2020) 6,910,840 |\n| 16. Massachusetts | (2024 est.) 7,136,171 | (2020) 7,029,917 |\n| 17. Indiana | (2024 est.) 6,924,275 | (2020) 6,785,528 |\n| 18. Missouri | (2024 est.) 6,245,466 | (2020) 6,154,913 |\n| 19. Maryland | (2024 est.) 6,263,220 | (2020) 6,177,224 |\n| 20. Wisconsin | (2024 est.) 5,960,975 | (2020) 5,893,718 |\n| 21. Colorado | (2024 est.) 5,957,493 | (2020) 5,773,714 |\n| 22. Minnesota | (2024 est.) 5,793,151 | (2020) 5,706,494 |\n| 23. South Carolina | (2024 est.) 5,478,831 | (2020) 5,118,425 |\n| 24. Alabama | (2024 est.) 5,157,699 | (2020) 5,024,279 |\n| 25. Louisiana | (2024 est.) 4,597,740 | (2020) 4,657,757 |\n| 26. Kentucky | (2024 est.) 4,588,372 | (2020) 4,505,836 |\n| 27. Oregon | (2024 est.) 4,272,371 | (2020) 4,237,256 |\n| 28. Oklahoma | (2024 est.) 4,095,393 | (2020) 3,959,353 |\n| 29. Connecticut | (2024 est.) 3,675,069 | (2020) 3,605,944 |\n| 30. Utah | (2024 est.) 3,503,613 | (2020) 3,271,616 |\n| 31. Iowa | (2024 est.) 3,241,488 | (2020) 3,190,369 |\n| 32. Nevada | (2024 est.) 3,267,467 | (2020) 3,104,614 |\n| 33. Arkansas | (2024 est.) 3,088,354 | (2020) 3,011,524 |\n| 34. Kansas | (2024 est.) 2,970,606 | (2020) 2,937,880 |\n| 35. Mississippi | (2024 est.) 2,943,045 | (2020) 2,961,279 |\n| 36. New Mexico | (2024 est.) 2,130,256 | (2020) 2,117,522 |\n| 37. Nebraska | (2024 est.) 2,005,465 | (2020) 1,961,504 |\n| 38. Idaho | (2024 est.) 2,001,619 | (2020) 1,839,106 |\n| 39. West Virginia | (2024 est.) 1,769,979 | (2020) 1,793,716 |\n| 40. Hawaii | (2024 est.) 1,446,146 | (2020) 1,455,271 |\n| 41. New Hampshire | (2024 est.) 1,409,032 | (2020) 1,377,529 |\n| 42. Maine | (2024 est.) 1,405,012 | (2020) 1,362,359 |\n| 43. Montana | (2024 est.) 1,137,233 | (2020) 1,084,225 |\n| 44. Rhode Island | (2024 est.) 1,112,308 | (2020) 1,097,379 |\n| 45. Delaware | (2024 est.) 1,051,917 | (2020) 989,948 |\n| 46. South Dakota | (2024 est.) 924,669 | (2020) 886,667 |\n| 47. North Dakota | (2024 est.) 796,568 | (2020) 779,094 |\n| 48. Alaska | (2024 est.) 740,133 | (2020) 733,391 |\n| 49. Vermont | (2024 est.) 648,493 | (2020) 643,077 |\n| 50. Wyoming | (2024 est.) 587,618 | (2020) 576,851 |"
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/24/in-n-out-lynsi-snyder-california-tennessee/85324468007/",
      "text": "In-N-Out owner places order to go − out of California | Opinion\nCalifornia's progressive policies have pushed out major employers like Tesla, Chevron and Hewlett Packard. Now, the owner of In-N-Out says she and her family are leaving her home state.\n- In-N-Out Burger is opening its second headquarters in Tennessee.\n- Owner Lynsi Snyder cited high taxes, cost of living and difficult business conditions in California as reasons for the move.\n- California has seen an exodus of businesses and residents to other states, particularly Texas.\n- California policies, including COVID-19 restrictions and minimum wage increases, are contributing factors to the exodus.\nOne of the simple joys my kids and I experienced when we moved to Texas was finally living near an In-N-Out.\nWe've savored the classic California brand's West Coast vibe, Double-Doubles and Animal Style Fries. Plus, I can feed the five of us for less than $50. Not a bad deal, in this economy.\nI'm not the only one thinking about the economics of In-N-Out. The burger chain's owner, Lynsi Snyder, has announced she is evacuating from deep blue California for the friendlier environs of red state Tennessee, where the company her grandparents founded in 1948 is building a second corporate headquarters.\nSnyder said she's leaving the West Coast for the Mid-South for the sake of her family and her business.\n“There’s a lot of great things about California, but raising a family is not easy here,\" Snyder told podcaster Allie Beth Stuckey on July 18. \"Doing business is not easy here.\"\nI can't blame Snyder for giving up on California. She'll join business leaders like Elon Musk, companies like Chevron and Tesla, and hundreds of thousands of regular people who've fled California for better lives and better business opportunities in other states.\nCalifornia is a bastion of liberalism that's pushed tax rates and the cost of living to ridiculous extremes even as residents' quality of life has declined.\nIn-N-Out owner checks out of her home state\nThe fact Snyder is leaving the state where her family made its fortune nearly 80 years ago is yet another indicator of California's decline. Snyder said state policies, including draconian restrictions during the COVID-19 pandemic, have made it difficult for businesses to operate.\nPeople and companies are not just fleeing California − in many cases, they are relocating to red states with a drastically different approach to politics and policy.\nMy home state of Texas in recent years has become the new home of choice of many former California enterprises such as Hewlett Packard, McAfee, Charles Schwab and Realtor.com.\nOrdinary Californians are leaving en masse too. From July 1, 2023, to July 1, 2024, California lost a net of about 240,000 residents to other states, many to Texas. The state's overall population rose in 2024, after several years of decline, because of immigration from other countries.\nCalifornia, of course, still has extraordinary natural resources, including hundreds of miles of beautiful coastline, majestic mountains, redwood forests, and world-class farmland and vineyards.\nWhat it doesn't have are political leaders with economic sense − or common sense. According to Chief Executive magazine's rankings for the best and worst states for business, California landed in last place. A 2021 Cato Institute study of the best and worst states for entrepreneurs found California placed 48th.\nBut California lawmakers still don't understand the assignment. On Jan. 1, the state's minimum wage increased to a whopping $16.50 an hour for all businesses, and fast-food workers are now paid a minimum of $20 an hour. That means business owners either take a pay cut, charge their customers more or eliminate jobs.\nOr they relocate out of state.\nThe owner of California's iconic burger chain will soon trade the Golden State's beaches for Tennessee's foothills. And if she ever wants to sample the world's best barbecue, she's welcome here in Texas.\nNicole Russell is an opinion columnist with USA TODAY. She lives in Texas with her four kids. Sign up for her newsletter, The Right Track, and get it delivered to your inbox."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/02/19/vance-free-speech-europe-60-minutes/78960055007/",
      "text": "Vance's speech shows VP's star is on the rise. I'm proud of America again. | Opinion\nIf JD Vance's wit and confidence could be turned into a vaccine against leftism, I'd take it every year to ward off weakness and wokeism.\nNow that Kamala Harris is no longer vice president, can I say the quiet part out loud? She was embarrassing and clumsy. She made me cringe.\nWatching Harris speak to a crowd or give an interview made me feel humiliation for our country. I'd think, this is our best? This is who we brought to the world stage to represent us?\nAfter listening to Vice President JD Vance defend free speech and blast censorship last week in Europe, I don't feel like that anymore. Vance has brought clarity, inspiration and leadership to the vice presidency, and he took it on the road to show Europeans who America is now and why we hold Western values so dear.\nVance is the kind of vice president Americans deserve.\nVance blasts European leaders for censoring free speech\nAt the Munich Security Conference, attended by high-ranking international leaders, the vice president blasted European leadership for favoring mass migration and government censorship. To say he was on point is an understatement. I relished every word.\n\"The threat that I worry the most about vis-à-vis Europe is not Russia, it’s not China, it’s not any other external actor,\" Vance said. \"What I worry about is the threat from within: the retreat of Europe from some of its most fundamental values.\"\n\"For years we’ve been told that everything we fund and support is in the name of our shared democratic values,\" he continued. \"Everything from our Ukraine policy to digital censorship is billed as a defense of democracy. But when we see European courts cancelling elections and senior officials threatening to cancel others, we ought to ask whether we’re holding ourselves to an appropriately high standard.\"\nThe vice president wasn't shy about using a sense of humor to blast Europeans for melting down over Elon Musk's comments about Germany's elections when the Tesla CEO spoke of the far-right Alternative for Germany party, \"I'm very excited for the AfD, I think you're really the best hope for Germany.\"\n\"If American democracy can survive 10 years of (climate activist) Greta Thunberg's scolding, you guys can survive a few months of Elon Musk,\" Vance said.\nIf Vance's wit and confidence could be turned into a vaccine against leftism, I'd take it every year to ward off weakness and wokeism.\nInsulting someone can get you arrested in Germany\nVance is right to call out European governments for abandoning free speech. Europe's move to censor political dissidents and religious people has been bone chilling.\nA recent episode of \"60 Minutes\" showed German police raiding the home of a citizen for the crime of posting a meme online. In Germany, posting a personal insult on social media or stating something that government officials decide is a lie can lead to a fine or even arrest.\nNot everyone understands the importance of free speech in America, either ‒ including, sadly, some journalists. On Sunday, in response to Vance's speech, \"Face the Nation\" host Margaret Brennan asserted in an interview with Secretary of State Marco Rubio that the Nazis rose to power in Germany by taking advantage of the freedom of speech.\n\"(Vance) was standing in a country where free speech was weaponized to conduct a genocide,\" Brennan said to Rubio.\nTo his credit, Rubio immediately corrected Brennan: “Free speech was not used to conduct a genocide. The genocide was conducted by an authoritarian Nazi regime that happened to also be genocidal because they hated Jews and they hated minorities.\"\nIn fact, the Nazis murdered anyone who exercised their inalienable right to freedom of speech to criticize the regime.\nExchanges like the one between Rubio and Brennan are why we need Vance's clarity more than ever.\nHave you ever been in a toxic, dysfunctional relationship then met someone healthy and new and thought, \"Wow, I didn't realize how bad things were until now?\" That is how millions of Americans feel now that Vance is representing the United States here and abroad.\nNow that we've seen his clarity and courage so clearly, the Democratic Party looks weaker than ever. Americans deserve a vice president who is a powerful envoy − an ambassador of our ideas.\nWith humor and fearlessness, JD Vance has shown Americans that we deserved better than Kamala Harris all along.\nNicole Russell is a columnist at USA TODAY and a mother of four who lives in Texas. Contact her at nrussell@gannett.com and follow her on X, formerly Twitter: @russell_nm. Sign up for her weekly newsletter, The Right Track, here."
    },
    {
      "url": "https://www.armscontrol.org/act/2024-10/features/rethinking-us-nuclear-diplomacy-iran-2025",
      "text": "\"I find hope in the work of long-established groups such as the Arms Control Association...[and] I find hope in younger anti-nuclear activists and the movement around the world to formally ban the bomb.\"\nRethinking U.S. Nuclear Diplomacy With Iran for 2025\nOctober 2024\nBy Kelsey Davenport\nU.S. President Joe Biden inherited the challenge of an unconstrained Iranian nuclear program and is poised to leave office with Tehran on the threshold of possessing nuclear weapons. Unlike January 2021, however, there is no straightforward path for Biden’s successor to roll back Iran’s nuclear program. Both the United States and Iran have acknowledged that the 2015 nuclear deal, known as the Joint Comprehensive Plan of Action (JCPOA), is beyond revival.1 Even if the deal could be restored, it is no longer a sufficient bulwark to guard against proliferation.\nDespite Iran’s technical advances, a nuclear-armed Iran is not inevitable. Recently elected Iranian President Masoud Pezeshkian has expressed support for nuclear diplomacy and campaigned on the promise of lifting sanctions. Although Iran’s supreme leader, Ayatollah Ali Khamenei, sets the country’s nuclear policy, he appears to have given Pezeshkian a green light to engage. Khamenei said in August that there is “no barrier” to negotiations even as he warned that Iran should not trust the United States.2\nThe next U.S. president will need to move swiftly to engage Tehran because the door for diplomacy may not remain open for long. If Khamenei withdraws his support for negotiations or regional tensions push the Iranian government to determine that nuclear weapons or Iran’s nuclear threshold status is necessary for deterrence, it will be more challenging to persuade Tehran to engage in nuclear talks. Washington also will need a new playbook for reaching an effective, verifiable nuclear deal because Tehran’s advances over the past several years will require a different approach to reducing proliferation risk sustainably.\nThe New Nuclear Threat\nThe risk posed by Iran’s nuclear program has been growing since Tehran began breaching the limits imposed by the JCPOA in 2019, a year after U.S. President Donald Trump withdrew from the accord and reimposed sanctions on the country. The steps that Tehran initially took to violate the JCPOA restrictions and build leverage in response to U.S. pressure were quickly and fully reversible.3 Since 2021, however, Iran has invested in new, more proliferation-sensitive capabilities. This acceleration appears driven by a desire to gain political leverage and reach nuclear weapons threshold status.\nAs a result of these activities, Iran’s nuclear program today is fundamentally different when compared to the pre-JCPOA period. Key differences include a shorter breakout time, expanded pathways to nuclear weapons development, and gaps in monitoring. In terms of the rapid breakout issue, Iran’s research and development activities, particularly on uranium enrichment, better position it to produce weapons-grade material quickly. As of mid-2024, Iran could produce enough nuclear material for one bomb in less than a week and enough material for five weapons in about three weeks.4 The time frame to produce multiple weapons will continue to shrink as Iran’s stockpile of uranium enriched to 60 percent uranium-235, which is nearly the 90 percent U-235 that is considered weapons grade, grows and it installs additional advanced centrifuges, which enrich uranium more efficiently. This shortened time period increases the risk that Iran could try to break out between inspections of its enrichment facilities by the International Atomic Energy Agency (IAEA) or divert material to a covert location to complete enrichment to weapons-grade levels.\nIn addition to affecting the short-term proliferation risk, the decline in breakout time has longer-term implications. In the event of a new deal, the breakout time could be extended if limits were imposed on Iran’s uranium-enrichment program. Yet, Iran’s knowledge gains make it highly unlikely that any new deal could reach the 12-month breakout period achieved by the JCPOA. The United States will need to contend with the implications of a shorter breakout period and Iran’s ability to reconstitute its uranium-enrichment capacity more quickly as it considers the framework for a new nuclear agreement.\nMeanwhile, Iran’s R&D activities over the past several years have diversified the pathways to developing weapons available to Tehran if the political decision were made to build a nuclear arsenal. For example, Iran now can produce weapons-grade uranium using fewer steps than was likely pre-JCPOA. Furthermore, Iran’s development of more efficient centrifuges increases the risk that it could set up an illicit, parallel program to produce weapons-grade material, a path called a “sneakout.”Although sneakout always has been a risk, Iran’s experience producing and operating more advanced centrifuges suggests that the country could pursue this option more rapidly and with less risk than was likely before the nuclear deal. A covert site with a smaller footprint that can produce weapons-grade materials more quickly decreases the likelihood of detection, making the pathway more viable.\nFinally, there are the monitoring and inventory gaps. The JCPOA required Iran to implement voluntarily an additional protocol to its safeguards agreement, which gave IAEA inspectors more access to information and sites. The deal also allowed the agency to monitor every aspect of the uranium-enrichment program, including continuous surveillance of certain activities. This verification regime provided greater assurance that Iran could not divert materials to a covert program without swift IAEA detection and that any deviation from its declared activities, such as enrichment to higher levels of U-235, would be detected quickly. In February 2021, however, Iran suspended these more intrusive measures and now is implementing only the comprehensive safeguards agreement required under the nuclear Nonproliferation Treaty (NPT), which history has demonstrated to be insufficient in preventing proliferation.5\nAs a result of Iran’s decision to reduce monitoring, there is an increased risk that it could attempt to produce weapons-grade material at its declared enrichment facilities between inspections or divert non-nuclear materials, such as centrifuges, from facilities that are no longer inspected to a covert program. As IAEA Director-General Rafael Mariano Grossi stated in 2023, it is no longer possible to ensure that the IAEA is accounting for all of Iran’s centrifuges.6\nBeyond the immediate risk of diversion, the monitoring gaps could pose additional challenges for verifying a future deal. The IAEA already has stated that it may not be able to reestablish reliable baseline inventories in certain areas, such as centrifuge components and uranium ore concentrate. If a future deal imposes limits in areas where the IAEA does not have a baseline, monitoring uncertainty could undermine confidence in implementation.\nIn addition to these technical challenges, Iran’s nuclear posture is shifting. Tehran always has denied illegally pursuing nuclear weapons, despite assessments by the IAEA and the U.S. intelligence community that it had an organized nuclear weapons program through 2003 in violation of its NPT commitments.7 Although Iran still does not acknowledge the pre-2003 weapons program, high-level Iranian officials recently have suggested that the government will rethink its position on nuclear weapons if security conditions change. Pezeshkian emphasized after his election that “Iran’s defense doctrine does not include nuclear weapons,” but the shift in doctrine likely will persist.8 It is unlikely that high-level officials would suggest repeatedly that Khamenei’s fatwa against nuclear weapons could be reconsidered without his tacit approval. For instance, Kamal Kharrazi, an adviser to the supreme leader, said in April that “if the enemy threatens you, you will inevitably have to make changes to your doctrine.”9 Kharrazi made similar comments several days later when he said that Iran has reached “no decision to build a nuclear bomb but should Iran’s existence be threatened, there [will] be no choice but to change our military doctrine.”\nFurther bolstering the threat that Iran could pursue a nuclear arsenal, Iranian leaders have emphasized that the government has the capabilities necessary to develop nuclear weapons. Prior to Kharrazi’s comments, the head of the Atomic Energy Organization of Iran, Mohammad Eslami, acknowledged that Iran has the technical knowledge necessary to build nuclear weapons, as did his predecessor, Ali Akbar Salehi.10\nEven if Tehran does not cross the nuclear weapons threshold, it no longer appears to be using its nuclear advances just to create leverage in future negotiations. Iran’s threats to develop nuclear weapons in response to direct attacks or targeting of its nuclear infrastructure suggest it is using threshold status to deter aggression.11 The more Iran perceives benefits from retaining its threshold status, the more challenging it may be to negotiate a deal that moves Iran off the threshold. This shift underscores the importance of the next U.S. president moving swiftly to engage Iran and the importance of taking Iran’s changing security calculus, as well as its technical advances, into account when developing a new framework for negotiations.\nUsing the Lame Duck Wisely\nDespite expressing support for restoring the JCPOA and nuclear diplomacy, the Biden administration has done little to slow Iran’s advancing nuclear program. Biden does not have enough time left in office to negotiate an agreement with Tehran, but his administration could still pursue deescalation to stabilize the nuclear crisis and reduce the risk of miscalculation. It pursued similar steps in 2023, but progress was derailed after the Hamas terrorist attack on Israel on October 7 and Israel’s subsequent invasion of Gaza.12\nPezeshkian’s support for engagement, however, may have reopened the door for diplomacy on the Iranian side. Iranian Foreign Minister Abbas Araghchi said on September 15 that Iran does not intend to wait until after the U.S. election to pursue negotiations. He suggested that Iran will pursue talks with other states, including European countries, if the United States does not want to engage. On the U.S. side, Biden’s decision not to seek reelection creates more political space for him to provide incentives if Tehran deescalates. In a deescalation package, the Biden administration’s primary focus should be on enhancing the monitoring of Iran’s nuclear program to reduce the risk of undetected breakout and diversion. For example, Washington could propose that Tehran negotiate an access agreement with the IAEA that would allow inspectors to visit nuclear facilities that contribute to the Iranian nuclear program but do not house nuclear materials, such as centrifuge production workshops. The IAEA has not inspected these facilities since February 2021 when Iran suspended the more intrusive monitoring arrangements put in place by the JCPOA.13 This additional transparency also would reduce the risk of the United States or Israel misjudging Iran’s nuclear advances or intentions and prematurely resorting to force.\nIn exchange, the United States could allow Iran to transfer additional funds held in foreign countries to the accounts set up in 2023 in Qatar that can be used to pay for certain humanitarian goods. Another option could be for the United States to allow sales of a certain quantity of Iranian oil. Both options could be facilitated quickly and reversed quickly if Tehran failed to meet its end of the bargain.\nA deescalation package focused on limited relief in exchange for enhanced monitoring will not provide the wide-scale sanctions relief that Pezeshkian seeks, but it would give him an early victory without trading away aspects of the program that Iran views as critical leverage for negotiations on a more comprehensive deal. More transparency also would support Pezeshkian’s claims that the program is entirely peaceful and that Iran is willing to pursue a broader nuclear agreement.\nA New U.S. Strategy\nIrrespective of whether Biden negotiates an interim deescalatory package with Iran, the next U.S. president will need a diplomatic strategy that takes into account the realities of Iran’s advancing program, its shift in nuclear doctrine, and the credibility deficit Washington faces after withdrawing from the JCPOA in 2018, despite Tehran’s compliance. A new approach to negotiations is particularly crucial because Iran’s nuclear advances make a military option, which successive U.S. presidents including Biden have threatened to use as a last resort, less viable.\nU.S. or Israeli military strikes always have risked pushing Iran to make the decision to develop nuclear weapons, and the country’s threshold status and shift in doctrine now increase the credibility of that threat. Furthermore, Iran has hardened and dispersed its facilities in recent years, making military strikes more complex and challenging.14 There also is a risk that Iran already has diverted materials, such as centrifuges, to covert facilities. Iran’s nuclear advances and its possible diversion of materials would make it easier for the country to reconstitute its program after a military strike. As retired U.S. General Frank McKenzie, former commander of U.S. Central Command, said at a gathering in April, military action is the “worst way” to prevent Iran from developing nuclear weapons. “The less you know about the problems and risks inherent in a strike, the more positive about its potential success one tends to be,” he said.15\nGiven these realities, diplomacy remains the best option for reducing the proliferation risks of Iran’s nuclear program in the long term. An effective deal can draw on aspects from the JCPOA, but will need to include several key elements as part of a new framework. The most critical element should be extensive monitoring and verification. The irreversibility of Iran’s knowledge gains, particularly on uranium enrichment, will leave Iran technically closer to developing nuclear weapons even if its nuclear program is subject to limitations under a new agreement. This proximity, coupled with the challenge of verifying that Iran has not diverted centrifuges or other material for a covert program, suggests that monitoring and verification measures will be even more crucial in a future accord.\nIn addition to requiring that Iran implement the additional protocol to its safeguards agreement with the IAEA and agree to intrusive monitoring of fuel cycle capabilities, including real-time monitoring of uranium-enrichment levels, a deal should prohibit certain weaponization-related activities beyond what was required by the JCPOA. The parties also should negotiate verification measures so the IAEA can assess compliance with the weaponization prohibitions. Furthermore, the deal could include specific steps that Iran will take to assist the IAEA as the agency seeks to close the gaps in its knowledge of Iran’s nuclear activities resulting from its decision to reduce IAEA monitoring and access in February 2021.\nBeyond this, the United States and the European signatories to the JCPOA (France, Germany, and the United Kingdom) should support cooperative nuclear activities as an additional means of fostering transparency. As part of a nuclear deal or in a separate agreement, the United States and the European countries could agree to support the establishment of a nuclear security center in the region, for instance. Creating spaces for Iran and other states with established or planned nuclear programs, such as Saudi Arabia and the United Arab Emirates, to collaborate on regionally identified security needs would build ties among expert communities and provide greater insights into the trajectories of each country’s nuclear program.\nA new framework proposal also must involve enrichment limitations, but the limits should be structured to shift the direction and drivers of Iran’s enrichment activities. Currently, Iran’s uranium-enrichment program significantly exceeds the limits set by the JCPOA and the country’s domestic needs. For instance, Iran is enriching uranium up to 60 percent U-235, despite having no domestic justification for uranium enriched to that level, and it has installed more than 50 cascades of advanced centrifuges. Despite the current program exceeding the country’s requirements for enriched uranium, Iran is highly unlikely to agree to limitations similar to those in the JCPOA, which allowed the use of only 30 cascades of its first-generation IR-1 centrifuges to enrich uranium to 3.67 percent U-235, a level suitable for nuclear power reactors. Those limitations were based on an assessment of Iran’s practical needs and the goal of a 12-month breakout period; they are no longer politically or technically feasible. Although achieving a similar 12-month breakout period in a new deal is not necessary from a nonproliferation perspective if the agreement contains stringent monitoring measures, a new agreement must extend the current breakout period and should prohibit more sensitive enrichment activities, such as enrichment of uranium to 60 percent U-235.\nThe United States could look at two options for restricting enrichment limits under a new deal in a way that provides a strong barrier to proliferation but is also acceptable to Iran. One option would be to support regionally negotiated limitations on uranium enrichment. The nuclear landscape in the Middle East has shifted significantly since negotiations commenced on the JCPOA. There is greater interest in civil nuclear energy and other peaceful applications of nuclear technology, such as nuclear medicine and nuclear applications in agriculture.16 Saudi Arabia, which has threatened to develop nuclear weapons if Iran does, also intends to enrich uranium domestically. To reduce proliferation risks regionally, Iran and the Persian Gulf states could agree to cap enrichment at reactor-grade levels and set stockpile limitations for uranium kept in gas form, which can be enriched to weapons-grade levels more easily.\nAn alternative to regional limitations would be for the United States to negotiate limits with Iran as part of a nuclear supply arrangement that would benefit both countries. The United States, for instance, could agree to purchase uranium enriched to 20 percent U-235 from Iran to meet U.S. domestic needs in exchange for Iran agreeing not to enrich above that level and to retain a limited stockpile in gas form. Iran could blend down any uranium produced in excess of that limit. The size of Iran’s enrichment program could be based on supply contracts and monitored by the IAEA.\nSimilarly, the United States, the European countries, or China, another JCPOA signatory, could agree to work with Iran on fuel fabrication, provided Iran limits quantities of enriched uranium in gas form and limits the overall capacity of its enrichment program. This supply-driven approach would provide Iran with additional tangible benefits that would be lost if it breached its obligations and would enhance transparency by forging further connections between Iranian and foreign nuclear communities.\nFinally, there is the issue of incentives beyond sanctions relief. Iran will demand sanctions relief as a core element in any future deal, but the demonstrated U.S. ability to reimpose sanctions reduces the benefits that Iran will receive from the lifting of those measures. It is likely that the United States will need to put more on the table in a future deal to benefit Iran. In addition to studying the JCPOA experience and examining how to provide more tangible and durable benefits when sanctions are lifted, the next U.S. administration should consider additional, durable incentives that would be attractive to Iran. This could include encouraging greater direct investment in Iran, particularly from states in the region; exempting certain regional trade from sanctions;17 and guaranteeing support for cooperative nuclear activities that do not pose a proliferation risk. Nuclear cooperation projects would be specific, required commitments for the United States and other parties to the deal, as opposed to the voluntary ones in the JCPOA, and could include assistance with developing fuel fabrication in Iran, expanding medical isotope production, and constructing proliferation-resistant power reactors. These activities would be consistent with Iran’s nuclear goals.\nSustaining an Agreement\nIf the United States and Iran can reach a nuclear agreement, the next U.S. president will face challenges in sustaining support for the accord, particularly through presidential transitions. A new strategy should include steps to mitigate the risk of a future president withdrawing from an effective nuclear deal, as Trump did.\nIn Washington, the JCPOA experience highlighted that a transactional nuclear agreement likely will be held to a transformational standard. Although the 2015 nuclear deal was never intended to be a panacea for all the problems in the Iranian-U.S. relationship, it still was criticized for failing to address other key U.S. concerns about Iranian activity, particularly the country’s growing ballistic missile program and its support for regional proxies, namely Hezbollah, Hamas, and the Houthis. When Trump withdrew from the JCPOA, he described it as a failure because it did not address these other issues.18\nNegotiating a grand bargain between the United States and Iran would be far more difficult and time-consuming than the JCPOA negotiations. The immediacy of the proliferation risk argues for prioritizing a dedicated nuclear deal. Yet, the next administration should situate its approach to nuclear negotiations within a more comprehensive Iran strategy to demonstrate U.S. intentions to address a broader array of concerns. This strategy could include U.S. support for regional security talks, separate channels for Iran and the United States to discuss issues of mutual concern, and security assurances to U.S. partners in the region. The conclusion of a nuclear agreement should not be tied to addressing these other concerns successfully, but a more comprehensive strategy would demonstrate that the United States is actively engaged on these issues, increasing the likelihood of sustaining an accord. Supporting dialogue between Iran and other states in the region regarding the security environment is particularly critical because Iran is more likely to agree to nuclear restraints if it assesses that nuclear weapons or a threshold status are not necessary for national security.\nIn addition to developing a more comprehensive engagement strategy, the United States needs to bolster nonproliferation norms writ large and demonstrate strong global support for preventing the spread of nuclear weapons. The group of countries that negotiated the JCPOA (China, France, Germany, Russia, the UK, and the United States) was important in demonstrating to Iran the strength of the nonproliferation norm. Unfortunately, that model is no longer viable for negotiations. Russia’s blatant rejection of nuclear norms and failure to hold Iran accountable for safeguards violations demonstrate that it is no longer committed to upholding the nonproliferation and disarmament architecture. This break in unity among the JCPOA parties on nonproliferation has ramifications for Iran: if Iran believes it can flout its obligations with impunity and trusts that Russia will block any punitive action at the UN Security Council, Iran will be under less pressure to negotiate.\nChina, however, has an interest in preventing erosion of the nonproliferation regime. Beijing appears reluctant to use its leverage in Tehran to stabilize the current nuclear crisis, but it may be willing to reinforce nonproliferation norms more generally. If these states were to express shared concerns about certain civil nuclear activities relevant to weaponization or articulate the consequences of a state withdrawing from the NPT or weaponizing a civil nuclear program, it could help demonstrate to Iran that it will face costs for developing nuclear weapons.\nDespite the collapse of the JCPOA, diplomacy still stands the best chance of preventing a nuclear-armed Iran and providing assurance that the country’s nuclear program remains on a peaceful trajectory. Concluding an effective, verifiable accord will be more challenging than ever given Iran’s nuclear advances and diminished U.S. credibility. If the next U.S. president moves swiftly to signal support for negotiations and embeds nuclear talks within a broader strategy to reduce Iranian-U.S. tensions, there is a chance to reach a deal that reduces proliferation risk, benefits Tehran, and contributes to regional stabilization.\nENDNOTES\n1. “Exclusive: Iran Indicates ‘JCPOA Not Good Enough for Us Anymore,’” Amwaj Media, August 26, 2024, https://amwaj.media/article/exclusive-iran-indicates-jcpoa-not-good-enough-for-us-anymore.\n2. Eve Sampson, “‘No Barrier’ to Nuclear Talks With U.S., Iran’s Supreme Leader Says,” The New York Times, August 27, 2024.\n3. Julia Masterson and Kelsey Davenport, “Restoring the Nuclear Deal With Iran Benefits U.S. Nonproliferation Priorities,” Arms Control Association Issue Brief, Vol. 13, No. 1 (March 15, 2021), https://www.armscontrol.org/issue-briefs/2021-03/restoring-nuclear-deal-iran-benefits-us-nonproliferation-priorities.\n4. Valerie Lincy and Gary Milhollin, “Iran’s Nuclear Timetable: The Weapon Potential,”\nIran Watch, June 27, 2024, https://www.iranwatch.org/our-publications/articles-reports/irans-nuclear-timetable-weapon-potential#10.\n5. Trevor Findlay, “Looking Back: The Additional Protocol,” Arms Control Today, November 2011.\n6. Jon Gambrell, “UN Atomic Chief Backs Nuclear Power at COP28 as World Reckons\nWith Proliferation,” Associated Press, November 30, 2023.\n7. U.S. National Intelligence Council, “Iran: Nuclear Intentions and Capabilities,” November 2007, https://www.dni.gov/files/documents/Newsroom/Reports%20and%20Pubs/20071203_release.pdf.\n8. Masoud Pezeshkian, “My Message to the New World,” Tehran Times, July 12, 2024, https://www.tehrantimes.com/news/501077/My-message-to-the-new-world.\n9. Beatrice Farhat, “Iran Warns It Will Change ‘Nuclear Doctrine’ If Threatened by Israel,” Al-Monitor, May 9, 2024, https://www.al-monitor.com/originals/2024/05/iran-warns-it-will-change-nuclear-doctrine-if-threatened-israel.\n10. Toby Dalton and Ariel Levite, “Iran’s Nuclear Threshold Challenge,” War on the Rocks, May 23, 2024, https://warontherocks.com/2024/05/irans-nuclear-threshold-challenge/.\n11. Eric Brewer, “Iran’s New Nuclear Threat: How Tehran Has Weaponized Its Threshold Status,” Foreign Affairs, June 25, 2024, https://www.foreignaffairs.com/iran/irans-new-nuclear-threat.\n12. Humeyra Pamuk and Daphne Psaledakis, “U.S. Says Iran Cannot Access Its $6 Billion in Qatar Any Time Soon,” Reuters, October 12, 2023.\n13. International Atomic Energy Agency Board of Governors, “Verification and Monitoring in the Islamic Republic of Iran in Light of United Nations Security Council Resolution 2231 (2015): Report by the Director General,” GOV/INF/2021/13, February 16, 2021.\n14. Jon Gambrell, “An Iranian Nuclear Facility Is So Deep Underground That U.S. Airstrikes Likely Couldn’t Reach It,” Associated Press, May 22, 2023.\n15. Global and National Security Institute, “GNSI Policy Dialogues: The Iran Enigma - General (Ret) Frank McKenzie Featured Remarks,” YouTube, April 24, 2024, https://www.youtube.com/watch?v=kgJzDXhWfdw&list=PLm9bckPQyMTohGAbdty7uPx0dpzTppEyJ&index=3&t=701s.\n16. Sarah Ruth Opatowski, “Development and Cooperation on Nuclear Research and Energy in the Middle East: Workshop Report,” UN Institute for Disarmament Research, n.d., https://unidir.org/wp-content/uploads/2023/09/UNIDIR_Development_and_Cooperation_Nuclear_Research_and_Energy_Middle_East.pdf.\n17. Ali Vaez and Vali Nasr, “The Path to a New Iran Deal,” Foreign Affairs, May 8, 2023, https://www.foreignaffairs.com/iran/path-new-iran-nuclear-deal-security-jcpoa-washington.\n18. “Remarks by President Trump on the Joint Comprehensive Plan of Action,” The White House, May 8, 2018, https://trumpwhitehouse.archives.gov/briefings-statements/remarks-president-trump-joint-comprehensive-plan-action/.\nKelsey Davenport is director for nonproliferation policy at the Arms Control Association."
    },
    {
      "url": "https://www.brennancenter.org/our-work/analysis-opinion/how-congressional-maps-could-change-2030",
      "text": "New population estimates released this week by the U.S. Census Bureau suggest that the shifts in political power after the 2030 census could be among the most profound in the nation’s history.\nOnce a decade, the Constitution requires the reallocation of congressional seats among states based on the results of the latest census, a process called reapportionment.\nIn the post-World War II era, the nation’s reapportionment story has largely been one of a steady shift of political power to western and the southern states at the expense of northeastern and midwestern states. Postwar domestic migration and immigration, for example, helped California more than double the size of its congressional delegation between 1940 and 2010.\nSo far, the story this decade is shaping up to be different.\nWhile southern and mountain states have continued to grow at a steady clip since the Covid-19 pandemic, the rest of the country, including one-time boom states like California, has seen mostly flat growth or even population losses.\nIf these trends continue for the balance of the decade, California would lose 4 of its 52 congressional districts in reapportionment — only the second time the Golden State has ever lost representation. New York, meanwhile, would lose three seats, Illinois two, and Pennsylvania one, leaving all three states with congressional delegations half the size they were in 1940.\nBy contrast, the South has emerged as this decade’s growth engine, adding almost 3.9 million people and accounting for nearly all U.S. population gains since 2020.\nFour booming southern states stand out in particular: Texas, Florida, Georgia, and North Carolina. These rapidly growing states by themselves account for more than 90 percent of American population gains since the 2020 census, with Texas and Florida alone accounting for 70 percent of growth.\nBased on the most recent trends, Texas would gain four seats and Florida three seats in the next reapportionment, placing Texas within striking distance of becoming the largest state, perhaps as early as 2040. Georgia, North Carolina, South Carolina, and Tennessee also would each gain a new congressional seat, as would three mountain states: Arizona, Idaho, and Utah.\nThese changes would solidify a shift in the regional balance of power. Whereas in 1960, the South, Midwest, and Northeast regions all had roughly the same population, by 2030, the South will be by far the country’s most populous region and home to nearly 4 in 10 Americans.\nAnd, although the Census Bureau won’t release updated figures on the racial and ethnic components of population change until next July, it is all but certain that in most of the country’s increases in population will be driven largely by growth in communities of color.\nOf course, the magnitude of reapportionment changes might not end up being as large as currently projected, given that it is still relatively early in the decade. For example, the significant migration of recent years to southern and mountain states might slow as higher interest rates and rising housing costs impact the willingness or ability of people to move. In similar fashion, a return of international immigration to pre-2017 levels — or something higher — could help stabilize populations in states like California and New York, both of which have seen large outbound migrations of native-born residents of all races to other states in recent years. There are signs that some of this may be happening: the most recent census figures for the period between July 1, 2022, and July 1, 2023, show a decrease in the heightened outbound migration of the pandemic years.\nBut the general trend lines seem fairly clear. Barring something completely unforeseen, the 2020s are shaping up to be the South’s decade. And that, in turn, will have major ramifications for fair representation and fair maps."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2024/09/04/hamas-hostages-killed-gaza-jewish-americans-antisemitism/75055541007/",
      "text": "Hamas murders 6 more hostages – including an American. Biden must do more to save them.\nNo one in America or anywhere else in 2024 can say they do not know about the rampant antisemitism percolating in elite American universities, around the globe and at the hands of Hamas terrorists.\nThe 2023 film \"Irena's Vow\" tells the true story of Polish nurse Irena Gut Opdyke, who became the housekeeper for a German army major in World War II. She manages to hide 12 Jews in the Nazi officer's villa to save them from extermination in the death camps.\nAn innkeeper she meets encourages Irena to keep a low profile to survive. When he realizes she's hiding Jews, he feigns ignorance: \"I don't want to know anything.\"\nNo one in America or anywhere else in 2024 can say they do not know about the rampant antisemitism percolating in elite American universities, around the globe and at the hands of Hamas terrorists.\nBut have times really changed? Have we learned anything from history about how antisemitism infects and spreads?\nIsraeli army recovers bodies of 6 hostages\nOn Sunday, Israel Defense Forces recovered the bodies of six hostages, including Hersh Goldberg-Polin, 23, an Israeli American, from a tunnel in Gaza, where they had been held captive by Hamas.\nHamas insinuated Monday that the captives were executed because Israeli forces were about to rescue them. The terrorist group also threatened to murder dozens of remaining hostages if Israel attempts to free them.\nHamas has released propaganda footage of the murdered hostages, including Eden Yerushalmi, 24. In the video, she said she missed her family, did not think she would make it out of Gaza alive and blamed Israeli Prime Minister Benjamin Netanyahu of abandoning her and other hostages.\nHamas also killed hostages Ori Danino, 25; Alex Lobanov, 32; Carmel Gat, 40; and Almog Sarusi, 27.\nFate of hostages changes each second: US and world leaders must help bring them home\nThe captives were among more than 200 hostages taken Oct. 7, when Hamas invaded Israel and murdered 1,189 innocent people, most of whom were civilians. Hamas continues to hold at least 101 hostages, including seven Americans.\nThe Hamas-controlled health ministry in Gaza says more than 40,000 Palestinians have been killed since the war began last fall.\nBiden blames Netanyahu, but is US doing enough?\nThe murder of hostages has exacerbated a fraught political environment in Israel. As many as 500,000 people took to the streets in Jerusalem and Tel Aviv to protest the hostages' deaths and the way Israeli Prime Minister Benjamin Netanyahu's government has handled negotiations for a cease-fire and the release of hostages.\nEven President Joe Biden agreed on Monday that Netanyahu has not done enough to aid the hostages' release.\nYet, it's not clear how Biden could pin any part of these murders on Netanyahu. After all, an American hostage was killed and more Americans remain in captivity. Is Biden also not doing enough to secure the hostages' release?\nFrom the parents of a US hostage: For five months, we thought our son was alive. Release Hamas hostages and spare others our pain.\nThe fact is that Netanyahu and the Israeli government have tried to secure a cease-fire resolution, even though it was Israel that was forced to defend itself after Hamas' Oct. 7 attack.\nIn August, Israel agreed to the Biden-Harris administration’s cease-fire deal, but Hamas rejected it. And U.S. Secretary of State Antony Blinken said in June that Hamas had refused to accept an earlier U.S.-backed agreement to end the war.\nOn Tuesday, the Justice Department charged six leaders of Hamas with the Oct. 7 attack on Israel for charges that include conspiracy to kill U.S. citizens, conspiracy to support a terrorist organization and conspiracy to use bombs and weapons of mass destruction.\nHarris, Trump must vow to protect Jewish Americans\nAs the war in Gaza rages on, Jews in the United States and around the world continue to face blatant antisemitism. Whether on elite university campuses or on the streets of New York, antisemitism in any form must be rejected.\nBoth presidential nominees Kamala Harris and Donald Trump must make clear that no matter the election outcome in November, the new administration will do everything in its power to protect Jewish people in America and elsewhere.\nOn Monday, the family of Hersh Goldberg-Polin gathered for his funeral in Jerusalem. Only 23, he was kidnapped and held captive for nearly 11 months in Gaza, for no other reason than the fact that he was a Jewish man attending a music festival in Israel on the day that his murderers invaded.\nWe can never say we don't want to know what Hamas is doing to Jews. We cannot feign ignorance for the sake of peace.\n\"May his memory be a revolution,\" Jon Polin said at his son's funeral.\nA revolution is necessary. May it come now.\nNicole Russell is an opinion columnist with USA TODAY. She lives in Texas with her four kids. Sign up for her newsletter, The Right Track, and get it delivered to your inbox."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/10/trump-netanyahu-nobel-prize-israel-iran/84505423007/",
      "text": "Trump deserves Nobel Peace Prize. He's achieved more than those who've won before. | Opinion\nIf stopping the worst state sponsor of terrorism from acquiring nuclear weapons and then ending a war in the Middle East isn't worthy of the Nobel Peace Prize, then what is?\nPresident Donald Trump is the last person the Norwegian Nobel Committee would honor with its Peace Prize. Yet, it should.\nTrump has helped end an escalating war between Israel and Iran, a conflict that easily could have engulfed the entire Middle East, with a single military strike. Now, he is pressing for a lengthy ceasefire between Israel and Hamas as a bridge to a more permanent peace. He's also worked, admittedly without success so far, to end the war between Russia and Ukraine. And he helped settle escalating tensions between Pakistan and India this spring.\nIf Trump isn't a peacemaker, then who is?\nIsraeli Prime Minister Benjamin Netanyahu told Trump on Monday, July 7, that he's nominating the president for the peace prize for his efforts in the Middle East. Those efforts include helping in 2020 to forge the Abraham Accords, which established diplomatic ties between Israel and Bahrain, Morocco and the United Arab Emirates.\nTrump's Nobel nomination deserves serious consideration\nTrump has been nominated before for the Nobel Peace Prize, but this time it should be taken far more seriously. The progress that he helped to orchestrate in recent weeks is extraordinary, including the successful mission to stop Iran's rush to build nuclear weapons followed by a still-intact ceasefire between Israel and Iran. History shows us just how incredible those achievements are in keeping the world safe.\nAt the White House on Monday, Netanyahu told Trump that the president is \"forging peace as we speak, in one country and one region after the other.\"\nThat is undoubtedly true. But Trump's critics, including much of the mainstream media, will never admit it.\nIn 2024, the Nobel Peace Prize was awarded to the Japanese organization Nihon Hidankyo “for its efforts to achieve a world free of nuclear weapons and for demonstrating through witness testimony that nuclear weapons must never be used again.\"\nI'd say that Trump, by heading off a nuclear-armed Iran, achieved that mission tenfold in June.\nAnd Trump's Iran-Israel ceasefire did not seem possible given the Iranian government's close ties to terrorist organizations like Hamas and Hezbollah. Yet, Trump did it, and that also is worthy of recognition.\nTrump's work to secure peace measures up with other presidents' efforts\nIt would not be unprecedented for an American president to receive the Nobel Peace Prize. Barack Obama won the award in 2009, before he had completed the first year of his first term. Theodore Roosevelt was awarded the prize in 1906 for his role in mediating the end of the Russo-Japanese War. Woodrow Wilson and Jimmy Carter were awarded the prize as well.\nTrump's achievements rival those of the past presidents who won the award.\nTrump's critics would melt into puddles of outrage, of course, if it were ever to happen. But I have a question for them: If stopping the worst state sponsor of terrorism from acquiring nuclear weapons and then ending a war in the Middle East isn't worthy of the Nobel Peace Prize, then what is?\nPeace through strength is more than a slogan. It's an idea that has prevented more horrific wars than we will ever know.\nDonald Trump has shown he not only understands that idea but also will act on it. The Norwegian Nobel Committee should as well.\nNicole Russell is an opinion columnist with USA TODAY. She lives in Texas with her four kids. Sign up for her newsletter, The Right Track, and get it delivered to your inbox."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/25/columbia-university-settlement-trump-antisemitism/85354418007/",
      "text": "Trump wins again: Columbia's $200 million fine will reshape higher education | Opinion\nLiberals have howled for months over President Trump's targeting of Ivy League universities. I doubt they'll view the Columbia agreement as a win for students and for our nation as whole. But it is.\n- Columbia University will pay a $200 million fine to the federal government for failing to protect Jewish students from antisemitism.\n- The university also agreed to an independent monitor to oversee compliance with civil rights laws and an additional $21 million fine to the EEOC.\n- The agreement follows Trump's criticism of universities for antisemitism and his withholding of federal funding from Columbia.\nIn an agreement ripped from the pages of President Donald Trump's \"The Art of the Deal,\" Columbia University has agreed to pay $200 million fine to the federal government to settle accusations that the school failed to protect Jewish students from antisemitism on campus.\nThe move is a capitulation to Trump's harsh rebuke of elite universities because of the rampant antisemitism unleashed on campuses after the Hamas terrorist attack against Israel on Oct. 7, 2023.\nThis is a win for Trump, a scathing reprimand of higher education and a message of hope for American Jews.\nJewish students were told to flee campus\nColumbia agreed to pay the $200 million fine to resolve multiple civil rights investigations centering on its failure to stop antisemitic protests on campus. The threats were so severe that a rabbi warned Jewish students to flee campus a day before the start of Passover in April 2024.\nColumbia also has agreed to appoint an independent monitor to update the federal government on its compliance with civil rights laws and to pay an additional $21 million fine to the U.S. Equal Employment Opportunity Commission.\nThese are mind-boggling agreements by one of the country's most elite universities.\nIn March, Trump cut off $400 million in federal funding to Columbia and launched investigations into 59 other colleges and universities because of their admissions policies and the antisemitic protests on their campuses.\nIf you had told me then that Columbia would bow the knee to Trump just four months later, I'd have laughed.\nTrump is reshaping higher education\nColumbia's agreement to pay a $200 million fine is a strong indication that Trump was right about widespread antisemitism on campus.\nEven so, liberals have howled for months over Trump's targeting of Ivy League universities, and I doubt they'll view the Columbia agreement as a win for students and for our nation as whole.\nIt is, though, and they should.\nTrump also froze Harvard University's funding over hiring policies that elevated diversity, equity and inclusion ideology over merit-based appointments.\nProgressives called Trump a \"despot in the making\" and an enemy of free speech. But Trump was in reality standing against a culture on university campuses that promoted progressive values to the exclusion of dissenting opinions. Conservative students were shunned. And Jewish students were targeted because of Israel's defense of its citizens.\nColumbia is now paying the price for that intolerance.\nI hope the Columbia settlement helps reshape higher education in the Ivy League and beyond. Institutions that accept taxpayer dollars must be held accountable for antisemitism and other forms of discrimination.\nBecause Trump took a stand − and took the heat from progressives and the news media − things may finally change for the better at Columbia.\nBall to you, Harvard. You next?\nNicole Russell is a columnist at USA TODAY and a mother of four who lives in Texas. Contact her at nrussell@gannett.com and follow her on X, formerly Twitter: @russell_nm. Sign up for her weekly newsletter, The Right Track, here."
    },
    {
      "url": "https://www.nbcnews.com/politics/congress/senate-floor-clash-booker-cortez-masto-democrats-rcna222027",
      "text": "Sen. Catherine Cortez Masto, D-Nev., clashed with Sen. Cory Booker, D-N.J., this week when he, in a fiery floor speech, tried to block a package of police funding bills as he called for greater resistance to President Donald Trump’s policies.\nAfterward, Booker alluded to his efforts in the face of criticism from Cortez Masto saying, “What’s bothering me right now is we don’t see enough fight in this caucus.”\nIn an interview, Cortez Masto had her own message.\n“I don’t need a lecture from anybody about how to take on and push back and fight against Donald Trump,” Cortez Masto said.\nShe took a shot at “long speeches” as a form of resistance, calling them ineffective as Democrats seek to win back Congress and eventually the White House. In April, Booker broke a Senate record by speaking for 25 hours, warning of the “grave and urgent” threat Trump’s administration posed to the country.\nHe posted a personal record fundraising haul after that speech.\n“If we really are going to take on Donald Trump, we need to win. It’s not long speeches on the floor,” Cortez Masto said. “It’s showing the American public that we’re there fighting for them, that we’re passing commonsense legislation that they care about.”\nBooker's office declined to comment.\nThe whole spat, a rare intraparty clash that played out in public, is indicative of a larger question vexing Democrats as they look toward the midterms and 2028: Is the party hankering for a fight, or does it just want its lawmakers to get the nuts and bolts done for their communities, even if it means working with Republicans?\nCortez Masto, who also heads ModSquad, a political action committee that works to elect moderates to the Senate, is leaning into a Sen. Lisa Murkowski-like strategy that makes bringing home the goods priority No. 1. Murkowski, R-Alaska, was the deciding vote on Trump’s “big, beautiful bill” because of provisions she believed benefited her state — even as she said she didn't overall like the legislation, which heavily cut Medicaid.\nJust this week, Cortez Masto and fellow Sen. Jacky Rosen of Nevada were the only Democrats to vote to confirm Republican Sam Brown as undersecretary of veterans affairs. Cortez Masto then asked Brown for an update on the construction of a national cemetery in rural Nevada to benefit veterans and their families.\nCortez Masto said the path to a Democratic majority is paved by moderates, those who oppose Trump but still work across the aisle to specifically address their states. She pointed to former North Carolina Gov. Roy Cooper’s Senate candidacy and the new ad her group just released. It focuses on Cooper’s getting “stuff done” and doesn’t even mention Trump.\n\"In North Carolina, it’s not about Republican or Democrat. It’s about what you’ll do for our families,\" the ad says.\nTo Cortez Masto, who faces re-election in 2028 in a battleground state that Trump won in November, the answer is less about taking hard-line stances against Republicans or disruptions on the Senate floor than about sticking to “kitchen table” issues that drove the narrative in the last presidential election.\nThe state of the economy, public safety and health care are among the issues dominating conversations with constituents in her home state of Nevada, Cortez Masto said. Some small-business owners fear closing or facing debilitating losses due to Trump’s tariffs, grocery prices haven’t relented, and gas prices — nearly $4 a gallon in the Reno area — are still too high (though lower than their peak in 2022), she added.\n\"Yes, we want to fight Trump and push back on him and hold him accountable and take him on,\" she said. \"But that doesn't mean at the same time we are doing that we are stopping and harming the people in our states.\"\nShe didn’t think the humanitarian crisis in Gaza or the release of the Jeffrey Epstein files ranked high on the list of issues she would talk about back home.\n“If you’re asking me is it the No. 1 issue I hear in my state, no, it’s not, but do some of my voters care about it? Yes, they absolutely do,” she said of the war in Gaza. On Epstein, she called for transparency while protecting victims but reiterated that she didn’t hear her constituents asking about it.\nCortez Masto was among a group of senators who sent a letter to the White House calling for greater action to get aid to people starving in Gaza. But in a sign of support for Israel, she voted against resolutions put forth by Sen. Bernie Sanders, I-Vt., that would block the sale of weapons to Israel.\n“The arms sales all already occurred. So it was, most importantly, a symbolic gesture. At the same time, I understand why they’re doing [it]. … I don’t think we all have to be on the same page for everything,” she said in explaining her vote.\nTo Cortez Masto, the moderate path means supporting border security but taking a stand against raids by Immigration and Customs Enforcement that she described as “absolutely extreme.”\n“There’s fear in my community. I see it. I talk and visit with them all the time. Rightfully so; we have less people going to church, going to school. Some of our workforce are gone. They’re too afraid to come forward,” said Cortez Masto, whose state is roughly one-third Latino. “These aren’t hardened criminals. These are people who came to our country for a good life and opportunity. They’re paying taxes. They want a better life for their kids. They haven’t committed violent crimes, but they’re being swept up intentionally by this administration because that’s what they want to do, and that’s where I think this administration has gone too far.”\nSeparately, Cortez Masto said she fully supported any Democratic efforts to redistrict and create additional seats in Congress for her party the same way Republicans have done in Texas.\n“Right now the process is Republicans are going to redistrict so that they can gain control. The Democrats should, too. Why wouldn’t we fight to take control?” she said. “Does the general public, do we all like the way that redistricting is played for that power? No, we don’t, and we should change the laws, ultimately. But they’re not changing now.\"\n\"The Republicans aren’t going to change them,\" she added. \"Republicans are going to benefit, and so until we can gain control and win some of these races, we should be playing by the same rules that the Republicans are using against us and fight back.”"
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/21/trump-education-department-layoffs/85257106007/",
      "text": "Trump sharpens the ax for the Education Department. Swing away, Mr. President. | Opinion\nDespite the Department of Education's massive budget, students in the U.S. far too often lag behind peers in other industrialized countries.\n- The federal government is the largest employer in the U.S., and the Trump administration is reducing its size.\n- Layoffs have occurred at the State and Education Departments, the latter of which has a $268 billion budget despite declining student test scores.\n- USA TODAY columnist Nicole Russell argues that reducing the federal bureaucracy in education will give more control to states and local districts, leading to better choices for parents.\n- The author notes that federal job cuts are happening amidst a larger trend of companies restructuring and adapting to technological changes.\nThe largest employer in the United States isn't a Fortune 100 company like Alphabet, Amazon or Apple. It's the federal government − and that's a problem.\nThankfully, President Donald Trump continues to slash bureaucratic bloat. On July 11, the administration sent layoff notices to more than 1,300 State Department workers, and three days later, the Supreme Court allowed Trump to move forward with plans to gut the Department of Education.\nThat's bad news for government employees, but great for taxpayers, especially given the Education Department's expense − $268 billion in the last fiscal year − and its lack of effectiveness.\nDespite the department's massive budget, students in the U.S. far too often lag behind peers in other industrialized countries. In 2022, for example, American 15-year-olds scored behind peers from 25 other countries on an international math test.\nAnd we're losing ground. Math and reading scores on the National Assessment of Educational Progress continue to decline. Part of the drop can be attributed to pandemic-related learning loss, but reading scores in the U.S. began to decline in 2019 − before Americans had even heard of COVID-19.\nBut how will pulling the federal government out of K-12 education help? It's important to note that more than 90% of public school funding comes from state and local governments along with foundations and other private sources.\nMuch of the federal education budget is used to feed the bureaucracy, which generates rules and regulations that local administrators and teachers must obey. If all of that bureaucratic oversight consistently produced better results, there might be a case for keeping it. But the data clearly shows it doesn't.\nRemoving federal bureaucrats from our schools should give states and local school districts more flexibility to set education policy, and that should improve choices for parents like me. Returning more control to the states also should improve efficiency and enable schools to better meet students' needs.\nGovernment efficiency is vital for the American people\nTrump isn't cutting jobs only at the Education Department, of course. The State Department layoffs follow reductions at other federal agencies this spring.\nThe cuts are driven by necessity: Our national debt is now more than $37 trillion, and the annual budget deficit will top $1 trillion again in 2025.\nSo, I was surprised to see news reports paint the laid off State Department workers as heroic. Cameras caught teary goodbyes and applause for well-liked employees. I don't recall the same concern when President Joe Biden halted construction of the Keystone XL Pipeline, which cost 1,500 workers their jobs and eliminated plans to create thousands more.\nCompanies often restructure. So should the federal government.\nWhile job loss is certainly scary, and I don't wish it on anyone, federal job cuts should be put in the context of the overall jobs market.\nMicrosoft has announced that it would eliminate 9,000 jobs, not because the company is failing but because it's retooling as the market changes. Other companies, including Intel and Meta, have announced plans to restructure this year as the emergence of artificial intelligence and other technology changes how Americans work.\nThe federal government should be as flexible as our top companies in adapting to a changing world.\nYet, progressives have criticized the Trump administration's efforts to restructure the federal bureaucracy as cruel.\nThe president's job, however, isn't to employ as many bureaucrats as possible. It's to deliver effective services as efficiently as possible to taxpayers. Dismantling ineffective and inefficient bureaucracies like the Education Department is a long overdue step toward achieving that goal.\nNicole Russell is a columnist at USA TODAY and a mother of four who lives in Texas. Contact her at nrussell@gannett.com and follow her on X, formerly Twitter: @russell_nm. Sign up for her weekly newsletter, The Right Track, here."
    },
    {
      "url": "https://www.fox4news.com/election/texas-democrat-statewide-senate-president",
      "text": "No Democrat has won a statewide office in Texas since 1994\nA Texas Democrat has not won a statewide office in 30 years and for a Democratic presidential candidate to win the state, that drought is even longer.\nDemocrats in 1994 successfully defended the offices of Lieutenant Governor, Attorney General, Comptroller of Public Accounts, Treasurer, General Land Office Commissioner and a state Supreme Court seat.\nHowever, the party lost the governor's office that year when George W. Bush defeated incumbent Ann Richards by nearly eight percentage points.\nThe nearly 30 years since a Democrat has held a statewide office in Texas is the nation's longest current losing streak.\nWhen was the last time Texas elected a Democratic senator?\nSen. Bob Krueger, D-Tex. shaking hands with Vice President Al Gore, in Old Seante Chamber, while Krueger's wife, Kathleen Krueger, looks on. Jan 25, 1993. (Photo by Laura Patterson/CQ Roll Call via Getty Images)\"n\nA Texas Democrat hasn't been in the United States Senate since 1993 when Robert Krueger was appointed to fill the vacancy left by the resignation of Lloyd Millard Bentsen. Krueger's tenure in the Senate would last just five months when he lost a special election to Kay Bailey Hutchison for the remainder of Bentsen's term.\nHutchinson held the position until 2013, opting not to seek reelection during the 2012 elections. Ted Cruz would win the Republican primary and later the general election to replace Hutchinson that year.\nBentsen had served in the Senate since winning the 1970 election. Bentsen resigned from the Senate in 1993 to become Secretary of Treasury under President Bill Clinton.\nEyes across the country are on the Senate race between Cruz and Colin Allred.\nDemocrats have seen this race as one they believe they can win, with a recent poll from Emerson College showing Cruz's lead over Allred at just over one percentage point.\nMoney has poured into the race, making it the most expensive Senate race on election ballots with more than $166 million raised by the candidates.\nCruz is no stranger to defending his seat against a strong fundraising opponent. In 2018, Cruz defeated Beto O'Rouke despite being out raised and out spent by the challenger. Cruz would defeat O'Rourke by just 2.56 percentage points.\nThe close race between Cruz and O'Rourke was the first time a Republican had failed to win a Senate race by more than 10 percentage points.\nIn 2020, John Cornyn defeated Democratic challenger Mary Hegar by 9.64 percent.\nWhen was the last time a Democratic presidential candidate won Texas?\nATLANTA -NOVEMBER 1976; President Jimmy Carter celebrates election night victory over Gerald Ford at the Hyatt Hotel in Atlanta January 1977; (Photo by Nik Wheeler/Corbis via Getty Images)\nThe last time a Democratic presidential candidate carried the state in an election, you would need to go back to 1976.\nThat's when Jimmy Carter defeated Gerald Ford by 3.16 percent. Carter would lose Texas by 13.86 points in 1980 against Ronald Reagan.\nIn 2020, Donald Trump won in Texas by just 5.58 percentage points. The race was the closest presidential race in Texas since 1996 when Republican Bob Dole carried Texas over incumbent Democrat Bill Clinton by 4.93 percent."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/29/trump-eu-trade-deal-us-jobs/85340091007/",
      "text": "Trump's EU trade deal ushers in a golden age for blue-collar workers | Opinion\nCritics can hate Donald Trump's personality all they want, but the president's ability to forge trade deals that favor American workers shouldn't be discounted.\n- President Trump secured a trade deal with the European Union that includes tariffs on U.S. imports and significant EU investment in American industries.\n- The deal aims to boost the U.S. economy and create jobs in sectors like agriculture and energy.\n- The agreement follows initial market concerns about Trump's tariff threats, but recent economic indicators suggest positive growth.\n- The deal is expected to benefit blue-collar workers, particularly in skilled trades facing labor shortages.\nBetween golf rounds in Scotland, President Donald Trump secured a deal with the European Union this weekend that promises an extraordinary boon for American workers.\nAfter months of negotiations, the EU succumbed to Trump's pressure on trade, agreeing on July 27 to 15% tariffs on many U.S. imports from Europe. The EU also agreed to buy $750 billion worth of oil, gas and nuclear fuel from U.S. energy producers over the next three years. And Europe's governing body agreed to invest $600 billion in U.S. operations.\nDetails on the energy and investment stipulations are vague for now. But if they happen at anywhere close to the levels promised, they will be a huge boost for the U.S. economy and drive job growth in agriculture, energy and other vital sectors.\nTrump's EU trade deal is fuel for US economy\nThe EU deal is a big deal on multiple fronts.\nWhen Trump threatened high tariffs in April, stock markets plummeted. Critics claimed Trump was wrecking the economy, and analysts raised fears of a recession this year.\nThree months later, the Nasdaq and S&P 500 have set multiple record highs, job growth is strong and forecasters expect a healthy growth in gross domestic product when the second quarter number is released this week.\nI've heard few critics, save perhaps comedian Bill Maher, acknowledge that tariffs functioned as excellent leverage to persuade countries to agree to more favorable trade terms with the U.S.\nMany of those critics underestimated the president's negotiation skills. The Financial Times reported that one European ambassador remarked, “Trump worked out exactly where our pain threshold is.\"\nTrump's EU deal will help blue-collar workers\nThe decades-long push for young people to attend college rather than gain the skills needed to work in a trade has created a labor gap. A McKinsey study released in 2024 found that manufacturers and construction companies face a hiring crunch for carpenters, electricians, welders and plumbers.\nThis EU deal might help change that as hundreds of billions of dollars are poured into the energy industry and other sectors. The financial incentives to work in the skilled trades could well be better than ever.\nMike Rowe, former host of the television show \"Dirty Jobs,\" has become an ambassador for blue-collar employment via his foundation, which offers scholarships to help young people complete a trade program.\nOn July 22, Rowe told Brian Kilmeade on his Fox News show that \"paralegal, and anything creative, writing in general, coding … AI is going to come for those\" jobs.\nBut Rowe said there's never been a better time to become a skilled laborer: \"We are entering the golden age of plumbing, steamfitting, pipefitting, welding, HVAC. Those jobs are not going to be impacted by” artificial intelligence.\nCritics can hate Trump's personality all they want, but the president's ability to forge trade deals that favor American workers shouldn't be discounted.\nI voted for this and would do so again. After months of economic wins, I'd like to know why you didn't?\nNicole Russell is a columnist at USA TODAY and a mother of four who lives in Texas. Contact her at nrussell@gannett.com and follow her on X, formerly Twitter: @russell_nm. Sign up for her weekly newsletter, The Right Track, here."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/30/trump-gdp-us-economy-rebound-tariffs/85406642007/",
      "text": "GDP soars and Trump's economy roars. Liberals still won't give him credit. | Opinion\nWill Democrats put politics aside and applaud as the American economy shows a strength and resilience that so many of them doubted? Probably not.\nThanks to President Donald Trump's bold policies, it appears that the United States will avoid a recession this year − one that so many liberals were predicting only months ago.\nWill Democrats put politics aside and applaud as the American economy shows a strength and resilience that so many of them doubted? Probably not.\nThe Bureau of Economic Analysis on July 30 released more good news about our nation's vibrant economy. Gross domestic product grew a healthy annual rate of 3% in the second quarter after recording a less than 1% decline in the first three months of this year. Fears of a recession should now dissipate like morning haze after the sunrise.\nNearly all markers of a strong economy are in top form. Unemployment is low, hovering at 4.1%. The past three months have seen steady job growth. Average hourly earnings for U.S. workers grew 3.7% over the 12 months ending in June.\nConsumer spending is expected to rise, and there's been a modest uptick in consumer confidence. The Consumer Price Index, which measures inflation, increased 2.7% over the 12 months ending in June, far below the 40-year high recorded in President Joe Biden's term.\nEven the average price of eggs has dropped dramatically, to $3.31 per dozen, down from a spike to $8 in February and back to roughly the same price level as a year ago.\nStock indexes continue to grow at a strong pace, recovering from the sell-off this spring driven by concerns over Trump's tariffs. The Nasdaq and S&P 500 have set multiple record highs in July, a boon to millions of Americans with retirement accounts and other investors.\nOn the tariff front, Trump's new trade deal with the European Union should be a catalyst for further economic growth, particularly in the energy and construction sectors.\nIf this is what a recession looks like, let's keep it coming.\nCritics said Trump was destroying the economy\nDespite such healthy economic markers, I doubt I'll see many kudos offered to the Trump administration for powering past a recession, which the left predicted in doomsday terms.\nNobel Prize-winning economist Paul Krugman wrote in May that Trump and \"MAGAnomics\" were \"destroying the economy and waging war on the middle class and the poor.\" The headline thundered that Trump was \"making America backward again.\"\nInterestingly, Krugman claimed that the U.S. economy was in good overall shape when Biden left office in January. He charged Trump with wrecking the economy in a mere three months. Now, that the data clearly shows otherwise, will Krugman admit his errors? I doubt it.\nKrugman, to be fair, wasn't the only so-called expert spouting off about our supposedly crumbling economy. CNN published an analysis in April with a headline that claimed \"Trump took the US economy to the brink of a crisis in just 100 days.\"\nThat same month, the Center for American Progress bemoaned that \"President Donald Trump's decision to unilaterally launch a global trade war could be one of the worst economic statecraft blunders in American history.\"\nI read these articles in the mainstream news media and wonder if we share the same universe. Do progressives not see the same healthy economic markers that millions of other Americans and I see?\nThe answer, of course, is that they do see − but they are too blinded by partisanship to admit it.\nGood economic news should be nonpartisan\nI don't have a problem with liberals criticizing Trump. Sometimes he deserves it. But when it comes to obvious wins like a blossoming economy, the constant derision is tiresome and pedestrian. A robust economy under any president is good news for Americans, regardless of their party affiliation. Right?\nI didn't care for Biden's leftist policies. But I didn't cheer when the economy struggled. It was bad news not just for Biden but, far more important, also for our nation and its citizens.\nMore than a year after Biden entered the White House, annual inflation spiked to 9% in June 2022, the highest rate in four decades. Americans were hit with sudden increases in food, housing and transportation costs.\nCompounding the pain, the Federal Reserve acted to cool inflation by raising interest rates, which pushed up consumers' payments for auto, housing and credit card loans.\nDemocrats tried to blame decisions made in Trump's first term, including federal spending used to fight consequences of the COVID-19 pandemic. But Biden spent more even as the pandemic began to wane.\nIn 2024, more than half of American voters said the economy was the issue that mattered to them the most. It's why Trump won more than 77 million votes and returned to the White House.\nNow, he is delivering on his promises to rebuild our nation's economy. But not everyone is happy about it.\nIt's too bad liberals can't separate economic success from Trump's party affiliation. I can't help but wonder if they wanted a recession so they could blame Trump even more.\nNicole Russell is a columnist at USA TODAY and a mother of four who lives in Texas. Contact her at nrussell@gannett.com and follow her on X, formerly Twitter: @russell_nm. Sign up for her weekly newsletter, The Right Track, here."
    },
    {
      "url": "https://www.usatoday.com/story/opinion/columnist/2024/06/13/biden-age-mental-physical-decline-hunter-conviction/74062088007/",
      "text": "Forget Hunter Biden. It's Joe Biden's obvious decline that worries me the most.\nHunter Biden's guilty conviction will not persuade Republicans to vote against Joe Biden. Joe Biden will persuade Republicans − and I'll bet you, some Democrats − not to vote for him.\nI'm a Republican, and I don't care about Hunter Biden, his laptop or the fact that he was found guilty of federal gun charges. I don't need to. His father, President Joe Biden, is bad enough.\nPlus, Joe is the one running for president again, not Hunter. Republicans pinning their election hopes on Hunter's conviction are misguided. Stick with the president − he's disappointing enough.\nDoes anyone care about Hunter Biden?\nDon't get me wrong. Hunter Biden has always been a joke. Despite going to rehab, Hunter could not get his relationships, finances or vices under control. (We all have flaws.) Despite having all the powers of nepotism available to him, Hunter, a fugly Kennedy on his best day, could not evade gun charges. See? The system isn't rigged. (I never thought it was.)\nThe people don't care either. A new Emerson College poll found that 64% of registered voters said Hunter Biden’s trial would in no way inform how they vote this presidential election. Only 24% said it makes them less likely to support President Biden.\nHunter Biden is guilty, just like Trump. But Joe Biden's biggest threat is still himself.\nThere is of course the ongoing story that within Hunter Biden's laptop there lies an entire world of unethical connections supposedly stringing his father to Ukraine and bribery. But there's no need for Republicans to hinge their hopes on marring this presidency with even those connections, not when President Biden is doing a bang-up job of looking like a fool all by himself.\nIn short, Hunter Biden's guilty conviction will not persuade Republicans to vote against Joe Biden. Joe Biden will persuade Republicans − and, I'll bet you, some Democrats − not to vote for him.\nPresident Biden's an 'elderly man with a poor memory'\nOn and off camera, Biden appears to be mentally and physically unwell. Like a malfunctioning robot or a zombie glitching during the apocalypse, he's often unable to string coherent sentences together, doesn't seem to know where and how to stand, or where to walk when he's on a platform or in a crowd.\nBiden's declining cognitive capacity seems undeniable, and yet, the White House has gone to great lengths to hide it from the public. That is understandable perhaps from a political strategy point of view, but from the purview of the American public, unforgivable.\nA recent Wall Street Journal headline aptly read, \"Behind closed doors, Biden shows signs of slipping.\" I laughed. Behind closed doors? You mean in front of them, too, or outside of them, as the case may be.\nAt Monday's event to commemorate Juneteenth at the White House, Biden appeared to freeze as guests around him danced and sang during the concert. This just isn't normal and signals that he's not processing information well. During his speech about the holiday, at one point, Biden said, \"She know long! She knew suhlongasuhijeruhhnied our freedom can never be secured.\" Is that a new language? Gibberish?\nFor even accomplished public speakers, it's normal to get tongue-tied or say a word incorrectly here and there. Except there are dozens of recorded instances of the president appearing to be confused, fumbling for words, slurring entire sentences or unsure of what he is supposed to be doing.\nDuring a D-Day commemoration last week, cameras caught Biden fumbling for his seat as other dignitaries remained standing. If you watch, you can see first lady Jill Biden hold her hand over her mouth and attempt to communicate that he should stand.\nIn February, special counsel Robert Hur said he wouldn't bring criminal charges against Biden after a 15-month investigation of how he handled classified documents. Not necessarily because Biden didn't mishandle the documents, but because he'd be difficult to convict. Hur's report described the president as a \"well-meaning, elderly man with a poor memory.\"\nWhen the report was released, Biden argued his memory was fine.\nThe American people deserve transparency\nI don't fault Biden. At 81, most people start slipping, if they're still living. I'll be lucky if I'm stringing sentences together at 81, too. But I also won't be running for president.\nBiden has served his country. He's done his bit. But the jig is up. The White House should hear this loud and clear.\nI'm not judging Biden for being old and slowly declining as almost all elderly people do.\nI'm judging Biden and his administration for continuing to pretend like nothing is wrong when we can see the opposite happening with our own eyes.\nWhy do Republicans still support Trump? You can call Trump's trial a sham while admitting he's a horrible choice for president. I do.\nBiden is not asking America to qualify him to a nice nursing home. He's asking Americans to give him the access to the nuclear codes again. He's asking Americans to decide out of two incompetent men − one a liar and a fraud, the other incompetent and incoherent − who would be the least incompetent. If only neither was truly an option (it is, but you get my point).\nThis might sound harsh, unusually partisan or even mean. But I've called out Donald Trump for other things, including childish ranting, arrogance, narcissism and being a fraudulent, smarmy bully who's now a convicted felon.\nIt's not mean to point out Biden's obvious cognitive decline; it's mean to continue to force him to pretend like he's strong and healthy when he's clearly struggling.\nIt's irresponsible of the White House to force this charade and act like Biden's in fantastic health when he clearly needs help walking or speaking. For the White House to continue to act like Biden isn't in serious decline is not just disingenuous, but also unethical and pathetic.\nIt's our election after all, and our republic. Should we be able to keep it. We deserve to have all the most accurate information about each candidate before us.\nNicole Russell is an opinion columnist with USA TODAY. She lives in Texas with her four kids. Sign up for her newsletter, The Right Track, and get it delivered to your inbox."
    }
  ],
  "argos_summary": "The article discusses the current state of the Democratic Party, highlighting its declining popularity and lack of direction, particularly in the wake of President Biden's perceived cognitive decline. It contrasts this with the Republican Party's rising stars, such as Vice President JD Vance, who is seen as a capable leader for the future. The piece also touches on the demographic shifts in the U.S., particularly the growth of southern states like Texas and Florida, which could reshape political power dynamics in upcoming elections.",
  "argos_id": "MF1XXSEDZ"
}