{
  "url": "https://www.businessinsider.com/katie-ledecky-favorite-lunch-protein-food-olympics-swimmer-athlete-diet-2025-8",
  "authorsByline": "Amanda Goh",
  "articleId": "000b3f3ee4b644538d1f76e213132dea",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68901baaf748d8c055f6cc80?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T06:52:02+00:00",
  "addDate": "2025-08-04T06:54:54.861775+00:00",
  "refreshDate": "2025-08-04T06:54:54.861776+00:00",
  "score": 1.0,
  "title": "Katie Ledecky says she sticks to this high-protein food for lunch almost every day",
  "description": "\"I'm cooking for myself, I'm making all those decisions. I don't have my mom around to cook every meal, although I would love that,\" Katie Ledecky said",
  "content": "Katie Ledecky is one of the most decorated female swimmers in history, but her go-to lunch is surprisingly low-key.In an interview with EatingWell published on Thursday, the nine-time Olympic gold medallist spoke about her diet and the high-protein food she likes to have for lunch.\"Given how long I've been in the sport, you can't have the same things every single day or every single year, but I do find that once I find something that is working well that keeps me fueled before and after practice, I'll stick with it,\" Ledecky told EatingWell.\"I found that with my omelet that I make myself in the middle of the day,\" the swimmer said. \"Of course, I mix up what vegetables I'm throwing in my omelet or what kind of toast I'm having, but for the most part, I get into a routine and I've found what works.\"She said the only meal she switches up every day is dinner.Ledecky says she follows a \"really balanced diet\" that includes protein, carbohydrates, fruits, and vegetables every day to maintain her performance.It's all about staying fueled and ready for her next workout, she said.\"I treat myself every now and then, but I typically have a snack before my morning practice and then a Core Power after, and then I'll have a late breakfast, another snack or small lunch in the middle of the day, and then dinner after my afternoon practice,\" she said. Ledecky has been a brand ambassador for Core Power protein shakes since April last year.At 28, Ledecky says she now has \"ownership\" over what she eats — a shift from her school years, when her mom handled every meal.\"I'm cooking for myself, I'm making all those decisions. I don't have my mom around to cook every meal, although I would love that,\" Ledecky said. \"I love it when she visits and does some of that for me, but I have to do that now for myself and I enjoy it. I enjoy learning about what fuels my body the best.\"A representative for Ledecky did not immediately respond to a request for comment sent by Business Insider outside regular hours.Ledecky isn't the only athlete who has spoken about their diets.Usain Bolt told BI in 2021 that his favorite pre-workout meal during his Olympic career was pumpkins and yams.In February, WNBA player Aaliyah Edwards told BI that she eats a high-protein, vegetarian diet centered on staples such as tofu, legumes, and Greek yoghurt.Last week, Luka Dončić's nutritionist said that the NBA star follows a gluten-free diet and eats at least 250 grams of protein daily during the offseason.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Core Power protein shakes",
      "weight": 0.089298725
    },
    {
      "name": "Katie Ledecky",
      "weight": 0.082443684
    },
    {
      "name": "Ledecky",
      "weight": 0.0790542
    },
    {
      "name": "protein",
      "weight": 0.077916406
    },
    {
      "name": "April last year",
      "weight": 0.06709702
    },
    {
      "name": "small lunch",
      "weight": 0.06677453
    },
    {
      "name": "Core Power",
      "weight": 0.06675011
    },
    {
      "name": "WNBA player Aaliyah Edwards",
      "weight": 0.06298647
    },
    {
      "name": "lunch",
      "weight": 0.060556795
    },
    {
      "name": "Business Insider",
      "weight": 0.056956317
    }
  ],
  "topics": [
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.876953125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.66259765625
    },
    {
      "name": "/Sports/International Sports Competitions/Olympics",
      "score": 0.3046875
    }
  ],
  "sentiment": {
    "positive": 0.2590332,
    "negative": 0.23120117,
    "neutral": 0.5097656
  },
  "summary": "Olympic gold medallist Katie Ledecky, one of the most decorated female swimmers in history, has revealed that she sticks to a low-key, high-protein food for lunch almost every day. The nine-time Olympic gold medalist, who follows a balanced diet that includes protein, carbohydrates, fruits, and vegetables to maintain her performance, says she finds a routine that keeps her fueled before and after practice. She also reveals that she has more control over her diet, having been a brand ambassador for Core Power protein shakes since April last year.",
  "shortSummary": "Katie Ledecky, a nine-time Olympic gold medalist, sticks to a low-key, high-protein lunch routine to fuel her performance during and after competitions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3150edf53a804920a83db8a23814c94c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Katie Ledecky, a nine-time Olympic gold medalist, shared insights into her diet in a recent interview, highlighting her preference for a high-protein lunch, particularly an omelet she makes herself. She emphasizes the importance of a balanced diet that includes protein, carbohydrates, fruits, and vegetables to maintain her performance as a swimmer. Ledecky has taken ownership of her meals at 28, enjoying the process of cooking and learning what fuels her body best.",
  "argos_id": "R1BIAK6E2"
}