{
  "url": "https://www.nytimes.com/athletic/6531171/2025/08/04/cody-gakpo-interview-liverpool-diogo-jota/",
  "authorsByline": "James Pearce",
  "articleId": "e39c1da087144c2cb27d002465fb145f",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/02071651/GettyImages-2190961047-scaled-e1754133500822.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T06:00:19+00:00",
  "addDate": "2025-08-04T06:08:18.597642+00:00",
  "refreshDate": "2025-08-04T06:08:18.597643+00:00",
  "score": 1.0,
  "title": "Cody Gakpo interview: ‘We’ll all miss Diogo for the rest of our lives. We will never forget him’",
  "description": "Liverpool's Dutch forward opens up on team-mate Jota's and why he thinks the Anfield side should dream of winning it all next season",
  "content": "“Unity is strength”, reads one of the well-known banners on the Kop.\n\nFor Cody Gakpo, that sense of togetherness has been a source of comfort as Liverpool’s players, staff and supporters alike grieve the loss of a much-loved team-mate, colleague, friend and fan favourite.\n\nA month has passed since Diogo Jota and his brother Andre Silva died in a car accident in Spain. Coming to terms with such heartbreak has provided the backdrop to Liverpool’s preparations to defend their Premier League title.\n\n“Yeah, it’s been very difficult,” Gakpo says.\n\n“A lot of us were still on vacation when the situation happened. We came together as a team and as a club as soon as possible.\n\n“We tried to be there as much as we could at that moment for the family and together as a team to help wherever we could. We still try to do that, and everyone is still busy a bit more behind the scenes than what is in the news, reaching out and helping as much as possible.”\n\nGakpo was on holiday in the south of France on the morning of July 3 when he received the news about Jota. He quickly made plans to travel to Portugal to attend the funerals in Gondomar, near Porto, two days later.\n\nOn his return to Merseyside, he paid a visit to the shrine that had been created outside Anfield, where supporters had laid thousands of tributes stretching the length of the stadium and beyond.\n\n“The family of Diogo hopefully felt the love we have for them, and for Diogo and his brother,” Gakpo says. “You could see how we try to act as a club and a team, the supporters as well, the whole city, every football fan; as Liverpool, we really try to be a family.”\n\nPart of the healing process was returning to playing again.\n\nFor seven minutes after the final whistle of their opening friendly at Preston North End on July 13, Liverpool players and staff stood on the edge of the penalty area applauding the 5,600 away supporters amassed in the Bill Shankly Kop at Deepdale as Jota’s song remained on loop. There were tears both in the stands and on the field.\n\n“It was emotional, and we could have played that song for 10 more days,” adds Gakpo. “It was beautiful and it showed once again the great character of our fanbase, and we appreciate that for sure.”\n\nLiverpool have retired the No 20 shirt Jota wore and recently unveiled plans for a memorial sculpture at Anfield. The players got together and decided to wear a “Forever 20” emblem on their shirts and stadium jackets for the duration of the coming season.\n\n“t is the least we can do,” Gakpo says. “Obviously, he was an outstanding player, but he as a person was even more wonderful. He was good with everyone. Everyone loved him, and that is also what you saw with how everyone reacted.\n\n“So yeah, it’s more that we want to remember who he was to us. Not as a player, because the player we can see on the highlights on YouTube, but more as the person he was. He will be missed this season, but he will also be missed by everyone in this team and in this club, and by his family, for the rest of our lives. We will not forget him.”\n\nMonday evening’s friendly double-header against Athletic Club at Anfield (the back-to-back games kick off at 5pm and 8pm UK time) will be another poignant occasion. It’s the champions’ final warm-up date before next Sunday’s Community Shield against FA Cup winners Crystal Palace at Wembley.\n\nGakpo is determined to step up and help Arne Slot’s side build on last season’s triumph. The Netherlands international was Liverpool’s second-highest scorer behind 34-goal Mohamed Salah with 18 in all competitions as he benefited from being used off the left flank under countryman Slot, rather than centrally.\n\n“It was my best return for Liverpool, but I always strive to be better and do more,” says Gakpo, who was signed in a £44million ($58.4m at the current rate) deal from PSV in his homeland in January 2023.\n\n“So yeah, hopefully this year is going to be a better one. I am just trying to get more goals and more assists. These things are always in a process. You come to the club, you settle in, and everyone does it in their own time. Some players settle really fast, and (for) some players it takes a little bit more time.\n\n“After last season, when all the factors played in favour of our team and my slight change of position as well, we can become even better than we were last season and achieve even more.”\n\nGakpo has fully recovered from the ankle problem that slowed his momentum in the second half of last season. He had 16 of those 18 goals by early February before injury struck.\n\n“I tried to come back as quickly as possible because we had some important games,” he explains. “But unfortunately, I had a setback in training, and then it took longer to get into the rhythm again, and to get confidence when you are in duels or shooting on target with the ankle.\n\n“That was not nice but this is also a part of football, and you have to overcome it. The last games of the season went better. I didn’t feel it as much as before. Now I just have to start the season fit and move.”\n\nGapko will be playing in a new-look Liverpool, courtesy of a £300million summer spending spree on exciting recruits such as Florian Wirtz and Hugo Ekitike. Gakpo, 26, believes it’s a statement of the club’s ambition to challenge on all fronts after earlier-than-hoped-for exits from the Champions League and FA Cup and defeat in the Carabao Cup final.\n\nHe says, “That is what the club wants, that is what we want as players, and that is what we will fight for.\n\n“Everyone was delighted with winning the Premier League but we lost the final of the Carabao Cup (to Newcastle United), which was a shame, and we also lost against PSG (on penalties in the last 16 of the Champions League).\n\n“It was a close call in both games (with Paris Saint-Germain). It could have gone either way, but went on to win the Champions League, so it was like: ‘Oh, if only we had beaten them…’.\n\n“But that is also part of football and it is why we are working so hard to go again this season, and try and win it.”\n\nFor Gakpo, cherished memories of the title celebrations inside Anfield and then during the trophy parade around the city in May, when more than a million fans lined the streets, provide added motivation to achieve more glory with Liverpool.\n\n“It was amazing,” he adds. “When you have those as a team, you get hungry for more. Not everyone can experience this.\n\n“Over the last eight years, it was Manchester City (winning the league) almost every year and Liverpool in between, and us again last season, so it is not a given to win the league. So if you have the quality to do it, you must go for it and try to get more of those experiences.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/connections-sports-edition",
    "https://www.nytimes.com/athletic/6235236/2025/04/27/liverpool-premier-league-title-inside-story/",
    "https://www.nytimes.com/athletic/6475168/2025/07/06/diogo-jota-gondomar-funeral-tribute/",
    "https://www.nytimes.com/athletic/6516739/2025/07/26/diogo-jota-liverpool-anfield-memorial/",
    "https://www.nytimes.com/athletic/6486703/2025/07/17/liverpool-transfer-spending-criticism/",
    "https://www.nytimes.com/athletic/6490916/2025/07/14/liverpool-diogo-jota-preston-tribute/",
    "https://www.nytimes.com/athletic/6487847/2025/07/11/liverpool-preston-diogo-jota-tributes/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Liverpool players",
      "weight": 0.08042275
    },
    {
      "name": "last season",
      "weight": 0.072904795
    },
    {
      "name": "more goals",
      "weight": 0.065380126
    },
    {
      "name": "Liverpool",
      "weight": 0.06535092
    },
    {
      "name": "Cody Gakpo",
      "weight": 0.06059578
    },
    {
      "name": "Gakpo",
      "weight": 0.05970806
    },
    {
      "name": "more glory",
      "weight": 0.058607444
    },
    {
      "name": "more assists",
      "weight": 0.058028705
    },
    {
      "name": "Cody Gakpo interview",
      "weight": 0.057552192
    },
    {
      "name": "Diogo Jota",
      "weight": 0.055026222
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.966796875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.95947265625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.61328125
    }
  ],
  "sentiment": {
    "positive": 0.32104492,
    "negative": 0.34350586,
    "neutral": 0.33544922
  },
  "summary": "Liverpool player, Cody Gakpo, has reflected on the loss of Diogo Jota and his brother Andre Silva in a car accident a month apart. The loss of Jota has helped Liverpool's preparations for defending their Premier League title. GakPo was on holiday in France when he received the news about Jota's death, and quickly made plans to attend the funerals in Portugal. He returned to Merseyside and visited a shrine outside Anfield, where supporters had laid thousands of tributes. Liverpool have retired the No 20 shirt Jota wore and unveiled plans for a memorial sculpture at Anfield.",
  "shortSummary": "Liverpool's players and staff are united under one clear mission: to remember Diogo Jota, who died in a car accident, and to defend the Premier League.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "35f666c1930d4481a1f71b696d0dbfe9",
  "places": [
    {
      "osmId": "4830206",
      "road": "Anfield Road",
      "suburb": "Anfield",
      "city": "Liverpool",
      "stateDistrict": "Liverpool City Region",
      "state": "England",
      "postcode": "L4 0TH",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 53.430828,
        "lon": -2.9608432174211456
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6516739/2025/07/26/diogo-jota-liverpool-anfield-memorial/",
      "text": "Liverpool have unveiled plans for a memorial sculpture at Anfield as the focal point for a permanent tribute to Diogo Jota.\nArne Slot’s players will wear a ‘Forever 20’ emblem on their shirts and stadium jackets for the duration of the 2025-26 season and the LFC Foundation, the club’s official charity, will launch a grassroots football programme in Jota’s name.\nAdvertisement\nThousands of tributes were left outside Anfield after Jota and his brother Andre Silva died in a car accident in Spain earlier this month.\nThe memorial — including flowers, shirts, scarfs, hats, works of art, flags and banners — has been gradually removed by club staff over the course of the last week, separated and safely stored. Floral tributes are being composted and used in flower beds across all club sites.\nThe remaining artefacts will be recycled by a specialist company and used to help create the memorial sculpture. Liverpool are yet to commit to a specific design but a No 20 is among the options mooted.\nIn the meantime, a temporary area of reflection has been created outside Anfield’s Main Stand so supporters can continue to pay their respects.\nDuring the pre-season tour of Asia, the players will take to the field with a specially designed ‘Diogo J 20’ patch on their shirts. Floral tributes will also be laid before kick-off at the friendly matches in Hong Kong, Yokohama and Anfield.\nThe ‘Forever 20′ emblem will feature on the bottom seam of the players’ new kit following the switch from Nike to Adidas on August 1. Supporters wanting to honour the Portugal international by having ‘Diogo J 20’ printed on the back of their shirts can get it done in club shops or via the official online store with all profits going to the LFC Foundation.\nThe main commemoration, including a special fan mosaic and a minute’s silence, is planned for the first game of the Premier League season against Bournemouth at Anfield on Friday August 15.\nLiverpool announced earlier this month that they were permanently retiring the No 20 shirt at all levels of the club in memory of Jota, who scored 65 goals in 182 appearances for the club.\n(Photo: Christopher Furlong/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6487847/2025/07/11/liverpool-preston-diogo-jota-tributes/",
      "text": "Arne Slot has told Liverpool’s players to not be afraid to be themselves as they prepare to return to the pitch for the first time since Diogo Jota’s death.\nJota and his brother Andre Silva died after a road accident in the early hours of the morning of July 3 in Spain, a tragedy that has sparked an outpouring of tributes from both inside and outside the game.\nAdvertisement\nSlot’s side will return to the pitch for the first time since against Preston North End on Sunday afternoon.\nThe club have confirmed that there will be a rendition of You’ll Never Walk Alone played and the Championship club will lay a wreath alongside the away supporters.\nA minute’s silence will be observed and digital tributes will be displayed inside the stadium. Both sets of players will wear black armbands.\nThe game, which kicks off at 3pm BST, will be broadcast on ITV1 in the UK.\n“We’ll always carry him with us\" ❤️\nArne Slot with a heartfelt tribute to Diogo Jota.\n— Liverpool FC (@LFC) July 13, 2025\nSlot and his players will not do pre- or post-match interviews from the game but speaking to the club website on Sunday the head coach spoke of the need for players to honour Jota’s memory by doing as he always did: being themselves.\n“Nothing seems to be important if we think of what has happened. But we are a football club and we need to train and we need to play again, if we want it or not,” he said.\n“What I’ve said to the players, I can say it here as well. It’s very difficult to find the right words because we constantly debate what is appropriate. What is appropriate in our actions? What is appropriate (for) what we have to say? Can we train again? Can we laugh again? Can we be angry if there’s a wrong decision?\n“And I’ve said to them, maybe the best thing for us to do is handle this situation like Jota was. And what I meant with that is that Jota was always himself, it didn’t matter if he was talking to me, to his teammates, to the staff, he was always himself. So let us try to be ourselves as well. So, if we want to laugh we laugh; if we want to cry we’re going to cry. If they want to train they can train, if they don’t want to train they can not train. But be yourself, don’t think you have to be different than your emotions tell you.”\nJota made 182 appearances for Liverpool and was a key player as Slot’s side won the Premier League last season, the first league title of Jota’s career.\nHis squad number, 20, matched the club’s historic number of titles and the club announced on Friday evening that it will be retired in his honour across the club’s men’s, women’s and academy teams.\nAdvertisement\n“We will always carry him with us in our hearts, in our thoughts, wherever we go,” Slot said.\n“Maybe especially in difficult moments because of what I just said. But in any moment we are here, we will carry him with us in our thoughts and in our hearts. To retire his shirt is the one thing we could, should and have done.”\n(Christopher Furlong/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6490916/2025/07/14/liverpool-diogo-jota-preston-tribute/",
      "text": "Each rendition was louder and delivered with greater feeling than the one that preceded it.\nFor seven minutes after the final whistle at Deepdale, Liverpool players and staff stood on the edge of the penalty area applauding the 5,600 away supporters amassed in the Bill Shankly Kop as one song remained on loop. Emotion was writ large on their faces. Some wiped tears from their cheeks.\n“Oh, he wears the No 20,\nHe will take us to victory,\nAnd when he’s running down the left wing,\nHe’ll cut inside and score for LFC,\nHe’s a lad from Portugal,\nBetter than Figo don’t you know,\nOhhh, his name is Diogo.”\nAdvertisement\nIt was repeated over and over again in the late afternoon sunshine. One banner being held up read, “Diogo Jota 1996 to 2025. Forever Red.” Eventually, the poignant and sustained vocal tribute was replaced with the booming chant of “champions” and then, fittingly, the club’s anthem, You’ll Never Walk Alone, rang out. Those words ring truer than ever at times like this.\nPlayers and staff stand and applaud as the Jota chant goes on and on after the final whistle pic.twitter.com/y5mXQEC7Qe\n— James Pearce (@JamesPearceLFC) July 13, 2025\nAfter the anguish of the previous 10 days, there was comfort to be taken from such a heartwarming show of togetherness. The road back to anything resembling normality will be long and winding for everyone associated with Liverpool, but the first tentative steps were taken at Preston North End on Sunday.\nArne Slot’s depleted squad kicked off their pre-season schedule with a 3-1 victory over the Championship outfit thanks to goals from Conor Bradley, Darwin Nunez and Cody Gakpo. Summer signings Jeremie Frimpong, Milos Kerkez, Giorgi Mamardashvili and Freddie Woodman all took their bows.\nBut this was a day when events on the field were completely inconsequential for Liverpool. You can’t win when you’re still grappling with such an immense feeling of loss. Just fulfilling the fixture felt like an achievement given the deaths of Jota and his brother Andre Silva in a car crash in Spain on July 3.\nCaptain Virgil van Dijk, new boy Florian Wirtz, Ibrahima Konate, Luis Diaz, Alexis Mac Allister and Alisson were among those not involved after all the upheaval with pre-season testing and some training sessions being shelved. It was decided they would be better off doing some individual work at Kirkby earlier in the day, with no risks taken over their fitness.\nUnderstandably, Slot and his players didn’t conduct any post-match media duties at Preston, but the head coach spoke openly to LFCTV before the game about the challenge of dealing with the fallout from such a tragedy.\n“Nothing seems to be important if we think of what has happened, but we are a football club and we need to train and we need to play again, if we want it or not,” he said.\nAdvertisement\n“It’s very difficult to find the right words because we constantly debate what is appropriate. Can we train again? Can we laugh again? Can we be angry if there’s a wrong decision? I’ve said to them that maybe the best thing for us to do is handle this situation like Jota. And what I meant with that is that Jota was always himself. It didn’t matter if he was talking to me, to his team-mates, to the staff, he was always himself. So let us try to be ourselves as well.\n“If we want to laugh, we laugh; if we want to cry, we’re going to cry. If they want to train, they can train; if they don’t want to train, they can not train. But be yourself, don’t think you have to be different than your emotions tell you.”\nSlot showcased his coaching acumen to the world when he led Liverpool to Premier League title glory in his debut season at Anfield. The leadership he has shown in the face of such heartache since has arguably been even more impressive.\nIt was there in the immediate aftermath of the shock news when players and staff descended on the small Portuguese city of Gondomar for the wake and the funeral. It was there in the first meeting back at Kirkby when most of the devastated squad reassembled last Tuesday and someone had to plot a route back to playing again.\nRather than head home after such a difficult day, Slot drove to Anfield with his wife, Mirjam, to visit the shrine created by the thousands of supporters who had descended on the stadium to pay their respects and leave flowers, cards, shirts, scarves, banners, flags, hats and even PlayStation controllers.\nSlot was back there again on Friday as the players and staff were joined by Jota’s wife, Rute, and parents, Joaquim Silva and Isabel Silva, who wanted to see the outpouring of love for themselves.\nEach Liverpool player laid a white rose and a red rose in memory of their team-mate and his brother. Rute also paid a visit to the ‘Forever 20’ wall on the corner of nearby Sybil Road and added a message to the hundreds that had been left on the side of a house.\nA short walk away, a mural of Jota has already been completed outside the Halfway House pub. There are plans in place for another one, too, after street artist Paul Curtis set up a crowdfunding page to cover the £2,000 costs and by Sunday had received £26,000 in donations. The excess will be donated to charity.\n“If you play for this club, it’s unbelievable when you win things, but in moments of tragedy, I think it’s also unbelievable what these fans are doing,” Slot added.\n“The fans cannot have better players to play for them, but us as players and staff can’t have better fans to support us. To represent this club in this city now even means more to me and to my wife than it did before.\nAdvertisement\n“It had a lot of impact on us, but nothing compared to the loss that is felt by his parents, his wife Rute, his children and his other family. The first feeling we all have is one of sadness. The second feeling that comes to my mind is pride. His parents and Rute can be so proud of the player and the person he was.”\nOn Friday evening, fittingly at 20:20, Liverpool announced that the No 20 shirt was being permanently retired in Jota’s honour. It’s a gesture unprecedented in the club’s history and underlines not only the immense contribution he made to the club as a player during his five years on Merseyside, but also the personal impact he had on team-mates, staff and supporters. The decision was made after liaising with Jota’s family.\n“By retiring this squad number, we are making it eternal – and therefore never to be forgotten,” said Fenway Sports Group CEO of football, Michael Edwards. “Diogo joined us in 2020, he won us number 20, and he wore – with honour, distinction and affection – the number 20. As far as Liverpool Football Club is concerned, he will be forever our number 20.”\nForty miles north of Anfield on Sunday, Preston proved to be the classiest of hosts. The black and white cover of the matchday programme featured Jota holding the Premier League trophy.\nBefore kick-off, Preston captain Ben Whiteman laid a wreath in front of the away supporters while singer Claudia Rose Maguire performed You’ll Never Walk Alone. There was a minute’s silence, tributes on the advertising hoardings, and both sets of players wore black armbands.\nIt was emotionally charged, not least after 20 minutes when the Jota song started and then carried on continuously for 10 minutes as a 21,289-strong crowd all stood and applauded. At one point, Mohamed Salah buried his head in his hands.\nBradley pointed to the heavens after opening the scoring at the far post following good work from Federico Chiesa before the break.\nIn the second half, Slot fielded a completely changed line-up. Nunez pounced on a slack backpass and went around the goalkeeper to make it 2-0. Much to the delight of the away end, the Uruguayan frontman did both the baby shark and PlayStation celebrations so closely associated with Jota.\nAfter Liam Lindsay had halved the deficit, Gakpo had the final word late on with a cool finish from Ben Doak’s cross and then held up ’20’ with his fingers.\nThis is a group mourning a much-loved team-mate and friend. In those touching scenes after the final whistle, they felt the collective arm of the fanbase around them.\nAdvertisement\n“We will always carry him with us in our hearts, in our thoughts, wherever we go,” Slot said. “What I take comfort in is that in the last month of his life, he was a champion in everything.\n“A champion for his family, which is the main and most important thing, because he got married. A champion for his country because he won the Nations League, with a country that he cared about so much. And of course, a champion for us by winning the Premier League.”\n(Top photos: Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6486703/2025/07/17/liverpool-transfer-spending-criticism/",
      "text": "The more things change, the more they stay the same.\nLiverpool have already spent more than £200million ($268m) on new players in this summer transfer window if you include the deal for Valencia goalkeeper Giorgi Mamardashvili, who arrived on Merseyside earlier this month but agreed to join last year.\nAdvertisement\nNow, they are preparing to go further, after making contact with Eintracht Frankfurt over Hugo Ekitike (a signing that would probably take their outlay to around £300m), 24 hours after it was revealed that they had approached Newcastle over a proposed £120m deal for Alexander Isak. If either deal is done, it would make this the second-highest single-window spend in English football (behind Chelsea’s 2023-24 summer, which nudged over £400m).\nIt is, by any metric, a mind-boggling sum. For context, Liverpool could have signed a starting XI of Sadio Manes — who became the game’s most expensive African footballer in 2016 for £30m — for such a figure and still have change left over.\nMane arrived shortly before a pre-season tour in the United States, where Jurgen Klopp infamously reacted to the possibility of Paul Pogba re-signing for rivals Manchester United for a fee that was reported to be pushing £100m by implying he would rather do something else with his life than manage a football team if such a sum became the norm. “The day that this is football, I’m not in a job anymore, because the game is about playing together,” he insisted.\nBy the time Klopp left Liverpool in 2024, he would have the lowest net spend of English football’s “Big Six”, yet he — and, by extension, the Liverpool supporters who believed in pretty much everything he said — have been reminded of this quote, as well as a few of the others he directed at Manchester City, Newcastle United and Chelsea, on each occasion the club has subsequently pushed boundaries.\nMaybe Liverpool would be guilty of double standards if the frenzied summer of 2025 was a departure from an old strategy, ignoring years of careful financial management at every operational level and submitting to the whims of on-pitch success by launching into the marketplace like Saudi Arabia’s finest.\nAdvertisement\nThe slightly more boring reality, however, is that this really isn’t the case.\nLiverpool’s owners, Fenway Sports Group, may be risk-averse — a source of continual frustration for a section of the club’s fanbase — but it has also been prepared for the club to spend its own money freely, both on transfer fees and salaries, when the resources have been there and the situation demands it.\nOne of the reasons Klopp was so successful at Liverpool was that, originally, he was largely on the same page as the owners when it came to buying and selling. The aim was clear: buy small or buy big, but sell even bigger and then try to recycle. Under Klopp, Liverpool achieved great success because of the record fees that brought Virgil van Dijk (£75m) and Alisson Becker (£66.8m), but those deals were only possible because Liverpool sold Philippe Coutinho for roughly the same overall cost.\nWith Champions League and Premier League titles following, Liverpool could work the market better, and with the right guidance at executive level, they could command more money than ever for their assets. Meanwhile, the club’s commercial horizons broadened and, steadily, Anfield became bigger, driving more revenues to the extent that they are now England’s most profitable club.\nUnder Klopp, the club played Champions League football in six out of seven seasons (reaching the final again in 2022), and more recently, led by a different coach in Arne Slot, they have become English champions again despite a very quiet transfer market last summer, a decision which now looks like either a masterstroke or a slice of good fortune.\nWhen the club filed its accounts at the end of May, it showed the highest central payments ever received from the Premier League, and, unlike in 2020, FSG has not had to scale back any of its plans due to the uncertainty of a pandemic. Meanwhile, although Slot’s team were knocked out of last season’s Champions League in the round of 16 to the eventual winners Paris Saint-Germain on penalties, their almost unblemished record in an expanded group stage brought in around £90m.\nAdvertisement\nIt is true that vast sums have been committed to securing Van Dijk and Mohamed Salah to new contracts, but there have also been incoming funds. Already this summer, sporting director Richard Hughes has sold two players from the club’s academy for around £45m of pure profit, with others likely to follow.\nThat is all before you consider the futures of Darwin Nunez (another record buy who ultimately has not justified his price tag but appears to still have a reasonable market value) and Luis Diaz, who seems as determined to leave as Liverpool are to keep him.\nEven after Florian Wirtz was bought from Bayer Leverkusen for a record £100m plus add-ons at the start of June, Liverpool were exploring their forward options. This was considered a moment of opportunity: champions can attack the market with more confidence and command better money for their own players.\nIt feels awkward connecting the tragic death of Diogo Jota and any transfer activity, but his passing has given the pursuit of a new striker added urgency and clearly presents a challenge in terms of how and when is best to enter the market, for fear of being seen as insensitive.\nUltimately, they were already spending big in the window and had room in their budget to bring in another key signing. Perhaps the only withdrawal from the norm is the timing of all this.\nIn the past, FSG and Liverpool have invited criticism by not reacting to success and going big. Instead, they have done it to try to catch up with City. Now they are attempting to accelerate away from them.\n(Top photo: Hugo Ekitike; by Stuart Franklin/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6475168/2025/07/06/diogo-jota-gondomar-funeral-tribute/",
      "text": "It was approaching midday and the first-team players at FC Pacos de Ferreira were being put through their paces. They ran and ran under a scalding sun. At the top of the hour, their work done, they walked off, in ones and twos, to seek refreshment and shade.\nIt looked a lot like a normal day of pre-season training. Just around the corner, though, on Rua do Estadio, the club’s flag flew at half-mast. Visible above the west stand of Pacos’ stadium was an electronic billboard bearing a message and a photo.\n“Forever,” it read. The photo was of Diogo Jota.\nInside the main stand is the old first-team changing room. The floor is green and white checkerboard, the wooden lockers starting to show their age. It was here, in October 2014, that Jota pulled on the yellow Pacos jersey ahead of his first match in senior football. When he left to join Atletico Madrid two years later, the windfall allowed the club to build a new eastern stand with more modern facilities.\n“We call that the Diogo Jota stand,” explained Paulo Goncalves, the club’s long-serving technical secretary.\nOutside, Goncalves pointed to the far end of the pitch. “That was where he scored his first goal,” he said. He pointed towards the tribune. “He ran and hugged his mum over there.”\nJota only played 45 times for Pacos. When his career clicked into gear, taking him from this modest club to stardom, he might easily have moved on, cut ties. But his gratitude to Pacos — for launching his career, for taking a chance on him when the country’s big hitters would not — forged a strong connection.\nAdvertisement\nHe acted as a ‘godfather’ to youth players during a summer tournament last year, lending advice and support from afar. He would drop in when he was in the area. “He was always in touch, always sending us messages,” said Goncalves, the emotion audible in his voice. “Especially in difficult moments.”\nOne thing that has become apparent since the death of Jota and his brother, Andre Silva, is that everyone has a story about him — little examples of his decency, his humanity, his heart. The tales come from Liverpool, from Wolverhampton, from a hundred other places.\nTravelling through the north of Portugal, though, what really struck home was the regionality of this tragedy.\nJota was born in Porto. He spent his childhood in Gondomar, a sleepy satellite city, and played for the local team. His grandfather still lives there, down a bumpy path off Rua da Minhoteira. Jota’s parents were in the house next door; the kids learned to play football in the connecting yard. When Jota left SC Gondomar, it was only for Pacos, 30 minutes away. He later returned to the region with FC Porto. His brother played for Penafiel, another local team. Their father, Joaquim, spent his youth in Foz de Sousa, just to the south. Jota’s widow, Rute Cardoso, grew up in Jovim.\nThe entire region is in mourning for the loss of two of its sons. For huge numbers of locals, the loss is all the more acute for being personal.\nTake Vitor Borges, a taxi driver who worked for years with Jota’s mother, Isabel, at the Ficosa car factory in Porto. “Her and her husband overcame a lot to raise those boys,” he said, shaking his head. “And all of it gone, just like that. No one deserves this, but least of all her.”\nOr Miguel Pereira, a former neighbour of Jota and Silva, slightly older but young enough to remember kick-arounds at the red asphalt court at the top of their road. He brought up a photo on his phone: his son Vasco with Jota, taken in May 2024. “It was a year ago but it feels like yesterday,” he said.\nAdvertisement\nPereira had come to the headquarters of Gondomar SC to pay his respects. Vasco and his cousin Goncalo play for the club’s under-eight team. They recently won their local league title and had brought a replica of the trophy with them to lay down in tribute. They wound a Gondomar scarf around it before setting it down.\nGondomar’s academy is named after Jota. His face adorns the side of the main stand. On the clubhouse, there are images of him as a boy, in Gondomar’s shirt, and as an adult, playing for the Portugal national team. On Friday afternoon, the site had been transformed into a temporary shrine. There were flowers, candles and scarves, photos and drawings. There were football jerseys bearing messages written in marker pen. “You will always be our hero,” read one. “Diogo and Andre, forever sons of this land,” read another.\nAt the back of the main stand is a training pitch, the astroturf degraded, and an old club minibus. Jota played here between 2005 and 2013; there’s a good chance that minibus took him and his brother to games in nearby towns, their paths criss-crossing the foothills.\nOn the main pitch, the sprinklers were on. Six starlings perched behind the goal. Through the main gate, more people came: two teenage girls in Liverpool shirts, three young men on their lunch breaks.\nPedro Figueiredo, a Porto fan, had felt an urge to pay his respects. “He played for my club and I admired him a lot,” he said. “He came from nothing and worked immensely hard.”\nEugenia Dias had brought her granddaughter, Bernadita. They laid a hortencia down together. “Diogo was an idol to the people of Gondomar,” she said. “My son played with him when they were small, maybe five or six. We’re all in mourning. We felt he was ours, in a way.”\nA sign just off the main route into Gondomar informs you that this is Portugal’s goldsmith capital. There are around 450 businesses producing jewellery in the city. Their products are sold around the globe.\nThere is an obvious resonance here. Not just because Jota was a gem but because he needed working; we are not talking here about a sure thing, one of those kids who was only ever going to be a superstar. He was still playing for Gondomar at 17. Porto did not want him, hence the move to Pacos. His was a grinding, blue-collar path to the top. It made it all the more meaningful to those who followed it.\nAdvertisement\n“He was a humble man, someone who fought for everything he had in his life,” said Gondomar resident Maria Nogueira. “He was a symbol of the region.”\nShe was stood outside the Matriz de Gondomar church. It was Friday afternoon, just before 4pm. The public wake for Jota and Silva was yet to start but already a large crowd had gathered. Some people strained for a view of the chapel, for a sight of the family. Others took shelter under trees.\nWhen the doors opened, people formed a line. They waited in the afternoon heat: men in polo shirts, men with walking sticks, women with flowers, families. They kissed their neighbours and friends, shared pallid smiles. They came to leave wreaths, to say prayers, to say nothing at all, to be silenced by the senselessness of it all.\n“I just thought it was important to pay tribute,” said Fernando Eusebio, who wore a Porto shirt and admitted he did not know how he would react to seeing the coffins inside. Another man clutched a large bouquet to his chest. He said he was a childhood friend of Cardoso, Jota’s widow. The sentence got caught in his throat; he struggled to get the last words of it out at all.\nAs the public entered, friends and relatives of the family began to depart. There was a girl, wrapped in a Portugal flag, crying. The Porto president Andre Villas-Boas was ashen-faced, as was Diogo Dalot, Jota’s Portugal team-mate. At the chapel’s exit, an elderly woman wiped away tears. Her husband stared into space.\nTheir devastation was comprehensible. The scene inside — Jota’s parents sobbing, Cardoso stricken by grief — was one of almost unbearable sadness.\nWhen the church bells rang at 5pm, the queue was still growing, people arriving at the end of their work days, wearing suits and supermarket uniforms, exhausted but present. They kept coming, too, the line eventually winding around the side of the cemetery, the flow only slowing when the sun had finally begun to tire of its own vigil.\nThe following day, the funeral would bring further emotion. New faces, too: the Liverpool delegation, more of Jota’s Portugal team-mates, flown in from the four corners of the globe. Ruben Neves and Joao Cancelo played in Florida on Friday night at the Club World Cup and were here at 10am on Saturday morning. It would be a world event — testament, in its way, to football’s reach, as well as to the breadth of lives touched by Jota.\nAdvertisement\nBeing here, though, among the queueing locals, it was impossible not to think about roots: those that ground us, that keep us connected to where we come from, if we allow them to. It is obvious that Jota nourished his. Cherished them, too. That, far more than his ability as a footballer, made these people love him.\nFor the family, there is only pain, as raw as it is unjust, a wound they cannot even yet fully comprehend, let alone cauterise. But later, you hope, that will soften into gratitude — for the 28 years they had with him, for the memories, for the beauty he gave not just to their lives but those of so many others.\nWaiting to enter the chapel and say a prayer for Jota, Maria Nogueira held a bunch of flowers with a note attached.\n“Thank you, Diogo,” it read, “for making so many people happy.”\n(All photos: Jack Lang/The Athletic; Illustration: Demetrius Robinson / The Athletic; Top Photos: Rene Nijhuis/MB Media, Octavio Passos/Getty Images, Jack Lang/The Athletic)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6235236/2025/04/27/liverpool-premier-league-title-inside-story/",
      "text": "Arne Slot was seething as he made his way down from the Anfield directors’ box to the home dressing room.\nThe Liverpool players had grown accustomed to Slot delivering calm, articulate half-time team talks, complemented by video analysis to illustrate where they needed to improve.\nThis time it was different. Slot, who had been sitting in the Main Stand alongside assistant Sipke Hulshoff as they completed two-match touchline bans for the visit of rock-bottom Southampton on March 8, erupted after the door slammed shut behind him.\nAdvertisement\nHe delivered a stinging critique of a lifeless first-half display, berating his side’s lack of energy and intensity both with and without the ball. The response in the second half was emphatic as Liverpool turned an embarrassing 1-0 deficit into a comfortable 3-1 win.\n“The reason it was so effective was because it was so out of character for Arne,” remarked one senior person at the club. “It was the angriest anyone had seen him.”\nFor the most part, Slot was an understated, unflappable guiding force as he surpassed all expectations in leading Liverpool to a 20th top-flight league championship, only their second since 1990; becoming just the fifth manager in the 33-year Premier League era to win the title in their debut season in English football.\nAnd his achievement is all the more remarkable given Liverpool were supposedly facing the toughest of transitions following the departure of Jurgen Klopp last May after almost nine years as the club’s manager and figurehead.\nRather than benefit from a big statement of intent in the summer transfer market, Slot developed the talent he inherited and blew away his rivals with a 26-game unbeaten league run between September and April.\nIt ensured that the title race, such as it was, became a procession.\nThe Athletic has spoken to multiple people connected to Slot and Liverpool, who asked to remain anonymous to protect their positions, to gain insights into how the Dutchman made his own slice of history.\nThis is that story.\n“Kill them with passes! Move it!,” boomed Slot as he took training at Lincoln Financial Field, home of the NFL’s Philadelphia Eagles, during Liverpool’s tour of the United States in July.\nThe pre-season wasn’t straightforward.\nMany of his star names reported back late following national-team commitments at the European Championship and Copa America but Slot knew he could not afford to waste any time in getting his ideas across.\nAdvertisement\nChanges in playing style — less high-octane chaos, more possession-based control — were quickly embraced. Klopp himself had talked before his departure about how he felt the group would benefit from new voices and fresh ideas, and so it proved.\n“This is now more me,” academy-graduate midfielder Curtis Jones told reporters during the tour. “The midfielders are going to be the heart of the team. In terms of our build-up, we have to be more calm and play more as a team. We’re not in a rush to attack. We want to have the ball and just break teams down. In the past, it was kind of a rush.”\n“It’s an elegant, Dutch style,” forward Harvey Elliott added. “The players are really excited about certain patterns we’re playing. There’s a buzz.”\nBack at the club’s training base in Kirkby, where Slot had less than two weeks working with his full squad before the Premier League opener at promoted Ipswich Town, the emphasis was on significant tweaks rather than ripping up what Klopp left behind.\nFrom his conversations with the German, who told him he was getting the best job in the world but warned how bad the weather was in the north west of England, Slot knew there was a culture of excellence in the dressing room, with senior pros setting the example. He kept the leadership group of captain Virgil van Dijk, vice-captain Trent Alexander-Arnold, Andy Robertson, Mohamed Salah and Alisson firmly intact.\nThere were, however, some minor changes. Slot made it compulsory for players to eat their breakfasts at Kirkby as he wanted them to start each day sitting together after reporting for work at around 9.30am.\nSlot also informed them they would no longer be staying at the city’s Titanic Hotel the night before home matches, as he felt they would benefit more from sleeping at home in their own beds before meeting up the following morning.\nAdvertisement\nThe installation of a coffee bar just inside the players’ entrance at Kirkby proved a big hit. It had been a long-standing idea of owner Fenway Sports Group’s chief executive Michael Edwards, dating back to his tenure as Liverpool sporting director, inspired by a similar set-up at several clubs in Italy’s Serie A, including Roma.\nIt quickly became a place for Slot’s players to congregate and socialise both before and after training — fostering a sense of camaraderie and togetherness, not to mention a regular source of material for the club’s social media channels. Salah and Dominik Szoboszlai were soon among the regulars for popular barista Alex.\n\"The main man in the house!\" 😎 pic.twitter.com/tppbRKbtjd\n— Liverpool FC (@LFC) November 8, 2024\nThere was a culture shock for the squad in the early months of the season, however: the sheer number of individual and team meetings they were asked to attend at Kirkby. Slot, son of two teachers, was on a mission to educate.\nThere was regular feedback on matches and each training session, with an attention to detail they hadn’t experienced previously. The clips used always accentuated strengths as well as highlighting where a player could get better.\nThe new backroom staff of Hulshoff, John Heitinga (assistant coach), Aaron Briggs (first-team individual development coach), Ruben Peeters (lead physical performance coach) and Fabian Otte (head of first-team goalkeeping coaching) quickly made a positive impression with the squad. Liverpool advertised for a set-piece coach but, unable to find a compelling external candidate, Briggs ended up taking on that added responsibility.\nThere was another important addition to the staff in November, with Roderick van der Ham arriving from Feyenoord, Slot’s previous club, as first-team tactical analyst. When incidents happen during matches that Slot believes need to be highlighted to his squad either at half-time or post-match, he turns and shouts “Clip!” to his analysts.\nWhere Klopp’s approach was all about the collective, Slot is a great believer in individual work, with Hulshoff, Heitinga and Briggs regularly tasked with overseeing one-to-one drills. It is an environment where Slot wants to be challenged and listens carefully to the input of others, but nobody is in any doubt about who is in charge.\nLong days at Kirkby often end with a staff game of padel — another legacy of Klopp, who had courts installed at the complex — with Slot and Hulshoff frequently coming out on top against Heitinga and Peeters.\nWith Liverpool’s entire football operations structure rebuilt, Klopp’s departure sparked the biggest overhaul of the club since the takeover by Fenway Sports Group (FSG) in 2010.\nEdwards’ first job after effectively taking over from FSG president Mike Gordon as the key decision-maker was to appoint former Scotland international Richard Hughes as sporting director. David Woodfine was made assistant sporting director, with Hughes bringing Mark Burchill and Craig McKee with him from fellow Premier League side Bournemouth as senior scouts.\nAdvertisement\nHughes led the search for Klopp’s successor, and last April he arrived at a plush townhouse overlooking the canal in the Dutch city of Zwolle to meet Liverpool’s top target.\n“Why me?” asked Slot. Armed with a hefty dossier packed full of data and character references, Hughes delivered a compelling case.\nHe spoke about the playing style that had delivered such success to Feyenoord and energised the Rotterdam club’s fanbase, how Slot had overachieved based on his available resources, and his proven track record of both developing players and keeping them fit. Hughes succeeded where Tottenham Hotspur had failed a year earlier and got his man.\n“I had a very good relationship from the start with Richard, which is one of the reasons I loved to join the club,” explained Slot, whose office is next door to Hughes’ on the first floor of the Kirkby complex.\nCrucially, Slot was comfortable with taking the role of head coach rather than manager, as Liverpool embarked on a new era with a more collegiate way of operating. Rather than fear the prospect of following in the footsteps of an icon in Klopp, he embraced it.\n“Yeah, big shoes to fill, but you can also look at it as inheriting a squad and a team which has a winning culture,” Slot said at his unveiling in July. “I look at being a successor to someone who was successful as ideal, because there is an opportunity to win something.”\nHughes and Slot were on the same page regarding transfers. Despite the clamour outside the club for new faces, Slot was more excited about the talent already on board and convinced that significant improvement would largely come from within.\nHe set about reinvigorating players such as Ibrahima Konate, Szoboszlai and Luis Diaz, who had lost their way towards the end of Klopp’s reign when Liverpool’s 2023-24 title challenge wilted and they trailed home in third place.\nThe plan was to sign a holding midfielder and an attacker to provide extra depth. However, there was a major setback in August when Real Sociedad’s Martin Zubimendi opted to stay put when Liverpool were prepared to pay his €60million (£51.4m, $68.2m) release clause.\nWith Slot wanting a technically gifted No 6 who could operate in tight spaces and pick the right pass under pressure rather than a ‘destroyer’ to break up play, there was a dearth of suitable alternatives available on the market.\nAdvertisement\nHughes and Slot were in agreement that there was no point panic buying. They were offered Paris Saint-Germain’s Manuel Ugarte, who subsequently joined Manchester United, but they had no interest in him.\nSlot’s solution was to put his faith in Ryan Gravenberch to shine in a deeper role, having seen him perform there for Feyenoord’s Dutch rivals Ajax as a teenager. It was a decision that proved inspired as the Netherlands international flourished en route to winning the title.\nThe only new arrival was Federico Chiesa, who joined from Juventus at the end of the summer window for an initial fee of £10m ($13.3m). However, the Italy international struggled for both fitness and form, clocking up just 33 minutes of league action across four substitute appearances.\nWith the summer sales of fringe players Fabio Carvalho, Sepp van den Berg and Bobby Clark generating up to £62m, Liverpool have returned a profit on their transfer dealings across this season.\nAfter so much upheaval off the field, stability and continuity within the squad proved invaluable as concerns about a lack of investment were dispelled.\n“Phenomenal,” was the verdict of Liverpool’s first-team fitness coach Conall Murtagh.\nSalah had just leapt to the top of the leaderboard in the punishing six-minute race test at Kirkby, a drill where players have to run at maximum intensity around a large square for that amount of time.\nSalah, 32, had not only returned early for pre-season but was in the shape of his life. He had benefited greatly from an extended summer break as Egypt had no major tournament commitments.\nThe forward had endured a difficult end to Klopp’s reign as he struggled to regain rhythm following the hamstring injury he suffered at the Africa Cup of Nations last January. He scored just twice in his final nine appearances of 2023-24 and cut a disconsolate figure.\nAdvertisement\nHowever, early on under Slot, team-mates were struck by how happy and energised he was. Salah made headlines with the TV interview he gave after a resounding 3-0 away win against Manchester United in early September, when he declared this could be his last season at Liverpool, but there were no concerns internally.\nIn fact, the opposite was true — it was viewed as vindication of the direction in which the club were heading. It was the first time that Salah had indicated he wanted to stay at Anfield beyond the expiration of his contract in summer 2025.\n“Before I worked with Arne, I didn’t expect he was this good, then we started working and I’m not surprised at all,” said Salah, who has provided both the dazzling firepower and the creative brilliance, being responsible for almost half of Liverpool’s goals in all competitions.\nThe measured way in which Slot handled all the noise over the protracted contract sagas involving free-agents-to-be Salah, Van Dijk and Alexander-Arnold went down well in both the dressing room and boardroom. He did not create any unwanted headlines or unnecessary pressure with his answers to the media.\nVan Dijk embraced being asked to take on more responsibility to build attacks with his distribution between the lines, while Alexander-Arnold relished the greater focus on one-to-one coaching as Slot helped improve the defensive side of his game.\nEyebrows were raised after victory over Ipswich on the season’s first Saturday, when Slot headed straight down the tunnel rather than going across to celebrate in front of the travelling supporters.\n“Don’t expect me to go after the game and make fist-pumps,” he said. “That is not going to be my style.”\nAuthenticity was important to him and he explained that he intended to create a bond with the fanbase through his entertaining brand of football rather than gestures.\nHe showed his ruthless streak in that first match by replacing young centre-back Jarell Quansah with Konate at half-time after being unhappy with the lack of duels Liverpool were winning. He sat down with Quansah at Kirkby the following day and explained his logic, so no resentment lingered.\nSlot can be blunt but his honesty and clear communication mean he commands respect even among those who have found their game time limited, as they always know exactly where they stand with him.\nAdvertisement\nWith his favoured 4-2-3-1 formation effectively becoming 4-2-4 when Liverpool pressed, the back line found themselves better protected with Gravenberch and Alexis Mac Allister alongside each other as either Szoboszlai or Jones operated in the more advanced midfield role. Slot also got the best out of Cody Gakpo by playing him off the left.\nAnd results on the field quickly offered vindication for Slot’s methods. He became the first Liverpool manager since George Kay 88 years earlier to win his first away league fixture against Manchester United and the first in the club’s history to win his opening three league matches in the top flight without conceding a goal.\nThere were stand-out victories over the champions of Germany (Bayer Leverkusen), Spain (Real Madrid) and England (Manchester City) by a combined score of 8-0, part of a trend which saw the club’s record against the other members of England’s traditional ‘Big Six’ transformed. In 2023-24, Liverpool took just 12 points out of a possible 30 from those games: so far this season, it’s 20 out of a possible 24.\nInternally at Kirkby, November 2 is regarded as one of the season’s most pivotal dates.\nOn a day when Arsenal lost at Newcastle United and Manchester City were defeated away at Bournemouth, Liverpool came from behind to beat Brighton & Hove Albion 2-1, thanks to goals from Gakpo and Salah. Slot’s side were abject in the first half but, helped by his tactical tweaks, clever substitutions and an inspirational Anfield atmosphere, they turned it around. Victory took them top of the table, and they have remained there ever since.\n“When things go against you, you have to show up. Winners always do. Fortunately, we have a lot of winners in our team,” Slot told reporters post-match. “The crowd were incredible in the second half. That’s the loudest since I’ve been here.”\nThe 2-0 home win over champions City in early December was extra special for Slot, given his admiration for opposite number Pep Guardiola as a coach and the fact he had proud parents Arend and Fennie, his brothers Edwin and Jakko, his wife Mirjam and their children Isa and Joep over visiting.\nAdvertisement\nWith the children still in full-time education in the Netherlands, Slot had made the move to England on his own, initially living in an apartment last summer before relocating to a house in the county of Cheshire, a short drive south-east from Liverpool. His evenings were frequently spent with his laptop, analysing an upcoming opponent.\nSlot returned to the family base in Zwolle during the various international breaks to unwind but found the intensive stretch from November through to March challenging, with no winter break, unlike the leagues in other European nations including the Netherlands, and the schedule across four competitions relentless.\nYet on the field, there was no sign of strain. Privately, there was a growing feeling within the coaching and playing staff that the title was within their grasp. City had lurched into crisis and while Arsenal looked the most credible challengers, they also lacked consistency and firepower up front.\nBelief rocketed around Christmas with Liverpool’s ruthless 6-3 demolition of Tottenham, which was swiftly followed by thrashing West Ham United 5-0. It all felt much more sustainable than a year earlier, when they had to regularly rely on energy-sapping late salvage acts to stay in the race to be champions.\nThere was a significant upturn in player availability, which was helped by Slot’s less intense training regime and playing style compared to the Klopp era.\nAnother key factor in Liverpool suffering fewer injuries is greater collaboration between their football and medical/sports science departments. Changes overseen by director of medicine and performance Jonathan Power meant Chris Morgan (head of performance physical therapy) and Lee Nobes (head of rehab physiotherapy) were handed new roles as specialists in certain fields, and empowered to make decisions.\nPeeters’ focus on periodisation has helped to manage players’ workloads, and the level of detail around recovery was cranked up with wellness checks including details on sleep, diet and even bowel movements. More yoga, hydrotherapy and breathing exercises were encouraged.\nPlayers have certainly enjoyed more time at home this season — something those with young children have been especially grateful for — with additional days off built into the schedule.\nThat trust has been repaid with performances.\nThe new year offered up a different set of challenges.\nThe uncertainty growing over Alexander-Arnold’s future finally bubbled over into a concrete offer from Real Madrid, who tried to buy him for £20m in January, ahead of his contract expiring in the summer. That approach was instantly rebuffed. Edwards, Hughes and Slot were all in agreement that the value of keeping the vice-captain for the rest of the season in the pursuit of silverware would potentially be much greater than pocketing that fee halfway through it.\nAdvertisement\nInterest from the Saudi Pro League in Darwin Nunez, specifically from Al Nassr, was also dismissed as they were committed to keeping the squad together for the run-in.\nOn the field, there was a rare defeat at Tottenham in the first leg of a Carabao Cup semi-final, although the real drama around that match came on the journey home, as thick fog and ice meant the team’s flight from London Stansted couldn’t land in Liverpool and had to be diverted to Birmingham. The plane eventually touched down around 3am, with the club having to scramble a coach and cars to transport the various members of their travelling party the final 100 miles (160km) north.\nStaff arriving for work at Liverpool’s John Lennon Airport at 5.30am that Thursday were surprised to see a shivering Salah in the car park, who asked for their help getting his vehicle moving in the treacherous midwinter conditions.\nIn February, fans saw Slot’s feistier side for themselves when he unleashed a furious tirade at referee Michael Oliver following the controversial Merseyside derby draw with Everton at Goodison Park.\nFA charges were subsequently accepted, with Oliver claiming that Slot had said to him: “If we don’t win the league, I’ll f***ing blame you.” Slot was adamant he in fact said: “If we don’t win the league, I will have you to thank for that.”\nSlot was sent off, along with Hulshoff, and was apologetic. “The emotions got the better of me. If I look back at that, I would love to do it differently,” he said subsequently.\nIt wasn’t the ideal start to a crunch run of five league games in the space of 15 days, and when the heroics of Alisson ensured they limped to a nervy home win over relegation candidates Wolves, it was the first time since Opta records began in 2003-04 that the club had played an entire half of league football at Anfield without registering a single attempt on goal.\nAdvertisement\nSlot had regularly made it clear to his players that he could tolerate mistakes but what he couldn’t abide was a dip in attitude and application. That is why he took the unusual step of publicly criticising Nunez in a press conference the morning after his glaring miss had been the talking point in a 2-2 away draw with Aston Villa.\nA month earlier, the Uruguayan striker had come off the bench to deliver a match-winning late cameo at Brentford when he scored twice in stoppage time. Nunez basked in the glow of being the hero that day and the squad were sat on a plane awaiting take-off at Luton Airport that evening when they heard that Arsenal had drawn 2-2 at home to Aston Villa after squandering a 2-0 lead. Suddenly, Liverpool’s lead was six points with a game in hand.\nHowever, for Nunez it proved to be another false dawn in his stop-start Liverpool career.\n“What was a bit harder for me to accept was his behaviour after that chance,” Slot told reporters in the wake of his display against Villa. “The most important message is you can miss a chance but you can’t miss out on work rate.”\nSlot, who had also been riled by Nunez’s lack of effort in that game against Wolves, regarded Wataru Endo as the perfect example of the mindset he expected from his fringe players. Parking his frustration over a lack of game time, the veteran Japan international was always ready to make the most of the limited opportunities he was given as he became one of Slot’s trusted ‘finishers’ off the bench.\nIt was one of the defining images of the season.\nLiverpool had just secured their first Premier League triumph away to Manchester City for nearly a decade and an exhausted Szoboszlai was lying motionless on the turf after the final whistle, having run himself into the ground in pursuit of victory.\nWith Arsenal suffering a surprise defeat by West Ham 24 hours earlier, Liverpool had moved 11 points clear, and the away end at the Etihad Stadium decided the race was run as they delivered the first booming rendition of “We’re gonna win the league.”\nThe City match was a tactical masterclass from Slot, who played without a recognised striker and utilised Szoboszlai and Jones as two No 10s. Liverpool had just 34 per cent possession — their lowest in a league win since Opta’s records began — but were always in control. The Anfield hierarchy held that up as the perfect example of Slot’s acumen as a coach, with the game plan he and his staff came up with being carried out to perfection.\nAdvertisement\nSlot’s phone buzzed with a congratulatory message from Klopp about Liverpool’s performance with the duo staying in regular contact throughout the season. Slot made it clear to Klopp that he had an open invitation to attend games, but the German coach decided he wouldn’t return to Anfield until after the title had been won.\nSlot’s demands on his players have been significant but he has also known when to back off.\nAfter Liverpool endured their most trying week of the season in March, exiting the Champions League on penalties to a vibrant Paris Saint-Germain and then watching Newcastle United lift the Carabao Cup following the club’s worst performance in a major final this century, he decided rest and recuperation were the best responses.\nRather than get the squad back together at the earliest possible opportunity after the conclusion of the ensuing international window, Slot decided to give them a few extra days off to rest and reset ahead of the run-in.\nWhen they did reconvene, there was a frank team meeting at Kirkby ahead of the home game with Everton when the head coach showed the players a selection of positive clips from previous matches that he felt illustrated the high standards which had slipped against Newcastle at Wembley. He told them: “You must never accept being outworked as a team.”\nThe warning was heeded, as Diogo Jota broke his three-month goal drought to settle that Merseyside derby.\nTheir 26-game unbeaten league run was ended four days later at Fulham, but Liverpool were so far clear, it mattered little. The news of Salah and Van Dijk signing two-year contract extensions fuelled the feel-good factor as Liverpool fans prepared for their biggest title party in 35 years, the celebrations of their win in 2020 having been muffled by restrictions relating to the ongoing Covid-19 pandemic.\nAdvertisement\nWithin the squad, morale has been rock-solid.\nVan Dijk, who organised a team bonding night out at plush Japanese-Peruvian restaurant Pirana in the affluent Mayfair area of London, is in charge of the music playlist in the dressing room… with contributions from team-mates.\nOne unlikely anthem in Liverpool’s march to the title has been Sultans of Swing by British rock band Dire Straits, which has regularly blared out of the dressing room after cherished wins. Alisson is a big Dire Straits fan and another of their tracks, Walk of Life, has also become a firm favourite.\nIt speaks to a squad and staff in perfect synchronisation — a group who have been able to block off the outside noise and get on with the task of winning matches with polished efficiency. Ultimately, nobody in the Premier League has come close to challenging them for consistency.\nPlayers and staff gathered together at the club’s Kirkby training base on Wednesday night to watch Arsenal’s game against Crystal Palace in case their title triumph was confirmed. Nobody was disappointed about the champagne remaining on ice as they wanted to clinch it on home turf, which they duly did with a 5-1 win against Tottenham Hotspur.\nThe scale of this achievement cannot be played down.\nFew gave Liverpool a prayer before a ball was kicked in August. Most pundits agreed another top-four finish would represent success after waving goodbye to the club’s most transformative manager since Bill Shankly.\nBut the appointment of Slot proved inspired.\nHe is the football obsessive who has landed the biggest of prizes at the first attempt to get a new era at Anfield off to a triumphant start.\n(Top photos: Getty Images; design: Eamonn Dalton)"
    }
  ],
  "argos_summary": "Liverpool FC is mourning the loss of Diogo Jota and his brother, who died in a car accident, as the team prepares for the new season. Players and staff have come together to support each other and Jota's family, with tributes including the retirement of Jota's No 20 shirt and plans for a memorial sculpture at Anfield. Cody Gakpo expressed the emotional impact of Jota's death on the team, emphasizing the importance of unity and remembrance as they aim to defend their Premier League title.",
  "argos_id": "R4DZ03WDY"
}