{
  "url": "https://finance.yahoo.com/news/2-high-yield-dividend-stocks-073700856.html",
  "authorsByline": "Cory Renauer, The Motley Fool",
  "articleId": "44360bfe71574063ac55bf55a5b7e1d3",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/GWlmlBVtR2gJ6XZY_wRf5A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/416f88575c2f95d758d3d2d6ace0a389",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T07:37:00+00:00",
  "addDate": "2025-08-04T08:09:19.318375+00:00",
  "refreshDate": "2025-08-04T08:09:19.318376+00:00",
  "score": 1.0,
  "title": "2 High-Yield Dividend Stocks to Buy in August and Hold for a Decade or Longer",
  "description": "These real estate investment trusts are well-positioned to deliver heaps of passive income.",
  "content": "• Treasury yields that have been rising have also pushed up dividend yields for reliable real estate investment trusts.\n• At recent prices, Realty Income offers a 5.7% yield even though the company has kept up with a monthly dividend payment for over 55 years.\n• W.P. Carey offers a dividend yield above 5% at recent prices, and it raises its payout every quarter.\n• 10 stocks we like better than Realty Income ›\n\nThe first quarter of earnings reports following the Trump administration's new taxes on imported goods have mostly been announced already. So far, the only thing we can say for certain is that the tariffs are going to sting. Exactly how much they'll hurt is still anybody's guess.\n\nIf an unpredictable trade war has you feeling queasy about the overall stock market, consider adding shares of Realty Income (NYSE: O) and W.P. Carey (NYSE: WPC) to your portfolio.\n\nThese stocks are offering yields above 5% at recent prices, plus they raise those payouts every quarter like clockwork. Here's how buying them now and holding for the long run could lead to heaps of passive income once you're ready to retire.\n\nRealty Income is a real estate investment trust (REIT). That means it can avoid paying income taxes by distributing nearly all its profits to shareholders as a dividend. It's also a proponent of net leases that transfer all the variable costs of building ownership to the tenant.\n\nOn Aug. 15, Realty Income paid a monthly dividend for the 661st month in a row. Since becoming a publicly traded company in 1994, the company has raised that ultrareliable payout 131 times.\n\nIt might be hard to imagine that a stock with such a reliable track record could sink, but that's what happened. The stock is down about 29% from the all-time high it set in early 2020, when interest rates were still extremely low.\n\nNow that investors can receive a risk-free yield of about 4.4% from Treasuries, they aren't as interested in reliable dividend stocks like Realty Income. At recent prices, shares of the REIT offer an unusually large 5.7% yield. That's heaps more than the 1.2% yield you would receive from the average dividend-paying stock in the benchmark S&P 500 index.\n\nInvestors can reasonably expect this REIT's dividend payout to continue growing in the quarters and years ahead. In 2025, management expects adjusted funds from operations (FFO), a proxy for earnings used to evaluate REITs, to land in a range between $4.22 and $4.28 per share. That's significantly more than it needs to meet a dividend commitment currently set at an annualized $3.228 per share.",
  "medium": "Article",
  "links": [
    "https://www.fool.com/investing/stock-market/market-sectors/real-estate-investing/reit/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=b044499b-75a5-4b04-bffc-55bfb6996ef7",
    "https://www.fool.com/terms/n/net-lease/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=b044499b-75a5-4b04-bffc-55bfb6996ef7",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=69297bce-4fd4-42b0-a924-4b5d4d88ae4f&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "reliable dividend stocks",
      "weight": 0.11977407
    },
    {
      "name": "dividend yields",
      "weight": 0.11583729
    },
    {
      "name": "Realty Income",
      "weight": 0.08825101
    },
    {
      "name": "Treasury yields",
      "weight": 0.08201594
    },
    {
      "name": "yields",
      "weight": 0.0771677
    },
    {
      "name": "reliable real estate investment trusts",
      "weight": 0.07488645
    },
    {
      "name": "recent prices",
      "weight": 0.073566355
    },
    {
      "name": "income taxes",
      "weight": 0.07186424
    },
    {
      "name": "passive income",
      "weight": 0.062384143
    },
    {
      "name": "earnings reports",
      "weight": 0.06177373
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Shopping"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96435546875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.95361328125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.74462890625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.5166015625
    }
  ],
  "sentiment": {
    "positive": 0.06744385,
    "negative": 0.671875,
    "neutral": 0.26049805
  },
  "summary": "Real estate investment trusts Realty Income (O) and W.P. Carey (WPC) are two high-yield dividend stocks that offer yields above 5% and raise their payouts every quarter. These stocks have been outperformed by Treasury yields, which have also boosted dividend yields for reliable real estate trusts. At current prices of 5.7%, Realty income offers an unusually large yield, more than the 1.2% yield from the average S&P 500 index. Since becoming a publicly traded company in 1994, Realty has raised its payout 131 times. However, the stock has fallen 29% from its all-time high in early 2020.",
  "shortSummary": "Realty Income and W.P. Carey offer reliable dividend yields of above 5% amid rising Treasury yields and potential long-term passive income opportunities despite market volatility.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7a51384a9d364c7b846c6ab25bd6f120",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/real-estate-investing/reit/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=b044499b-75a5-4b04-bffc-55bfb6996ef7",
      "text": "A REIT (pronounced REET), or real estate investment trust, is an entity that holds a portfolio of commercial real estate or real estate loans. Congress created REITs in 1960 to provide all investors, especially retail investors, with access to income-producing commercial real estate. REITs combine the best features of real estate and stock investment.\nThis guide will walk you through everything you need to know about real estate investing through REITs. We’ll cover the types of REITs, REIT pros and cons, how to invest in REITs, and what qualifies a company as a REIT.\nTypes of REITs\nTypes of REITs\nThere are several types of REITs. Let's start with classifying REITs by access:\n- Publicly traded REITs trade on major stock exchanges, such as the New York Stock Exchange (NYSE) and the Nasdaq Exchange. Anyone with a brokerage account can invest in a publicly traded REIT. Publicly traded REITs must register with the U.S. Securities and Exchange Commission (SEC) and provide audited financial reports.\n- Public non-traded REITs are also open to all investors but don't trade on stock exchanges. Investors can purchase public non-traded REITs through their financial advisor or on online portals sometimes known as real estate crowdfunding platforms. Public non-traded REITs also must register with the SEC and provide audited financial information.\n- Private non-traded REITs aren't available to the public. They're usually only open to high-income earners or high-net-worth individuals. Private non-traded REITs are exempt from SEC registration.\nWithin those REIT types are three subcategories by asset type:\n- Equity REITs own and operate income-producing real estate such as apartments, office buildings, and warehouses.\n- Mortgage REITs, or mREITs, provide financing for real estate by purchasing or originating mortgages and mortgage-backed securities and earning fixed income from the interest on these investments. They typically hold a portfolio of income-producing mortgages, mortgage-backed securities, or other real estate-backed loans.\n- Hybrid REITs invest in a combination of income-producing real estate and real estate-backed loans.\nFinally, we'll look at the dozen equity REIT types by sector or property type:\n- Office REITs own and manage office real estate such as skyscrapers and office parks. Many office REITs focus on a specific region (New York City or the West Coast, for example) or a type of tenant (technology companies, government agencies, or biotech).\n- Industrial REITs own and manage industrial facilities such as warehouses, distribution centers, light manufacturing, or cold storage. Many of these properties are crucial for e-commerce. Most industrial REITs focus on a specific industrial property type or region.\n- Retail REITs own and manage retail real estate such as regional malls, shopping centers, or freestanding retail buildings. Most retail REITs will focus on a specific property type such as grocery-anchored shopping centers or freestanding retail properties triple net leased to essential retailers such as convenience stores and pharmacies.\n- Hospitality REITs own hotels and resorts, usually managed by a third-party hotel brand. They rent space in these properties to guests on a nightly or weekly basis.\n- Residential REITs own and manage residential real estate such as apartment communities, single-family homes, and manufactured home parks that they rent out to residents. Residential REITs focus on a specific property type.\n- Timberland REITs own and manage timberland. They specialize in harvesting and selling timber. Some timberland REITs also own wood products manufacturing facilities and sell portions of their real estate for other uses such as a housing development.\n- Healthcare REITs own and manage healthcare-related real estate such as senior living facilities, hospitals, medical office buildings, and skilled nursing facilities. They lease these properties back to healthcare systems that operate the facilities.\n- Self-storage REITs own and manage self-storage facilities that they rent to individuals and businesses.\n- Infrastructure REITs own and manage infrastructure such as fiber cables, telecommunications towers, and energy pipelines. They lease capacity on this infrastructure to mobile carriers or energy companies.\n- Data center REITs own and manage data storage facilities. They lease space in these facilities to technology companies and other businesses to house servers and other equipment. These REITs also provide an uninterruptible power supply, a regulated temperature, and physical security.\n- Diversified REITs own and manage a diversified portfolio of commercial real estate. For example, they might have a portfolio of office properties, industrial real estate, and retail properties. Some diversified REITs focus on specific markets, owning a mix of residential, retail, and office properties in one city, while others are diversified by property type and geography.\n- Specialty REITs own and manage unique properties such as movie theaters, casinos, farmland, outdoor advertising, or ground leases.\nRelated investing topics\nPros and cons\nREIT pros and cons\nInvesting in REITs has several benefits, including:\n- They usually pay above-average dividend yields compared to other stocks, making them ideal for those seeking passive income from real estate.\n- They offer diversification from the stock market since REITs tend to be less volatile than other stocks.\n- REITs don't pay federal corporate income tax, shielding investors from \"double taxation.\"\n- They offer attractive total return potential, e.g., stock price appreciation plus dividend income.\n- Publicly traded REITs offer greater liquidity compared to owning real estate outright.\n- Public REITs are highly transparent, including providing audited financial statements.\n- Lower cost compared to buying commercial real estate outright.\nHowever, REITs also have some drawbacks, including:\n- Higher tax liabilities because REITs pay nonqualified dividends. Because of that, REITs are often best held in a tax-advantaged account such as an IRA.\n- Sensitivity to changes in interest rates. REIT stock prices often decline as interest rates rise.\n- Property-specific risks such as tenant move-outs, industry headwinds, and technological disruption.\n- The risks of using too much debt.\nHow to buy REITs\nHow to buy in REITs\nInvestors have many ways to invest in REITs. The easiest is to buy shares of publicly traded REITs through a brokerage account. An investor could purchase a diversified REIT or invest in several different REITs to build a diversified portfolio. REITs are relatively inexpensive to buy, with most trading below $100 a share.\nAnother way to invest broadly across the REIT sector is to buy a mutual fund or exchange-traded fund (ETF) focused on REITs. REIT ETFs and REIT mutual funds are also easy to buy and relatively inexpensive to purchase.\nFinally, you can invest in public non-traded REITs through a financial advisor or a real estate crowdfunding portal. That makes them a little more challenging to purchase. They also often have higher minimum investments, usually $2,500 or more to start.\nHow does a company qualify as a REIT?\nHow does a company qualify as a REIT?\nCompanies must meet specific criteria to qualify as a REIT, which receive special tax treatment so they don't pay corporate income tax. These qualifications include:\n- REITs must pay out at least 90% of their taxable income to shareholders as dividends each year. Many REITs will pay out more than 100% of their taxable income because their cash flow, measured by funds from operation (FFO), is often higher than income due to depreciation.\n- Be an entity that would be taxable as a corporation.\n- A board of directors or trustees must manage them.\n- They must have fully transferable shares.\n- Have a minimum of 100 shareholders after its first year as a REIT.\n- Have no more than 50% of its shares held by five or fewer people during the last half of its taxable year.\n- They must invest at least 75% of total assets in real estate assets or cash.\n- Get at least 75% of its gross income from real estate-related sources, including rents from real property, interest on mortgages, financing real property, and the sale of real estate.\n- A REIT must get at least 95% of its overall gross income from those real estate sources and dividends or interest from any source. In other words, 75% of its gross income must come from real estate, and only 5% can come from sources other than real estate, dividends, and interest income.\n- Have no more than 25% of its assets in non-qualifying securities or stock in a taxable REIT subsidiary.\nREITs often make great passive income investments\nCongress created REITs so that anyone could own income-producing real estate. REITs must pay a dividend, making them a great way to earn passive income. Add in their diversification benefits and historical returns, and REITs can be an excellent investment option."
    },
    {
      "url": "https://www.fool.com/terms/n/net-lease/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=b044499b-75a5-4b04-bffc-55bfb6996ef7",
      "text": "It’s very common for a business to lease the property it operates in from a private commercial real estate investor or real estate investment trust (REIT). When this happens, tenants sign one of many types of lease, the most common of which is the net lease.\nWhat is a net lease?\nWhat is a net lease?\nSimply put, a net lease is a lease that includes rent plus other fees. Those other fees are determined by the type of lease and the needs of the tenant or demands of the property. So, when a tenant chooses to lease using a net lease, they agree to pay a base rate of rent plus actual expenses related to the agreed-upon terms.\nFor example, a tenant might choose a lease where they’re responsible for the rent plus the taxes and insurance on the property. Although the rent remains fixed with any escalations that are built-in, the insurance may change due to increased risk factors or claims. So, the tenant will pay the base rent plus the actual insurance and taxes to their landlord.\nWhy use a net lease?\nWhy use a net lease?\nNet leases are the most common type of commercial real estate lease right now, and for good reason. Investors love them because a net lease of any sort reduces the expenses that the landlord has to pay to maintain the property they’re leasing, which in turn should create a higher rate of return on their investment.\nLarge tenants accept them, especially when they’re leasing an entire building, because some types of net leases allow them to choose their own vendors and make decisions about the property as if they owned it.\nTypes of net leases\nTypes of net leases\nThere are three types of net leases, which are called single, double, and triple net leases.\nSingle net leases. A single net lease, sometimes just called an “N” or an “N lease,” is a lease where the tenant pays the rent plus one other item, typically property taxes. Although other types of non-net leases have this baked into the price, in a single net lease, the tenant is paying the actual tax amount, either directly to the municipality or to the landlord, separate from the rent.\nDouble net leases. Double net leases, also known as “NN” or “NN leases,” ask the tenant to pay the rent plus insurance and taxes, generally. They may have a smaller base rent than an N lease, but the additional expenses can add up quickly. The landlord will still pay for maintenance and upkeep, however.\nTriple net leases. If you’re a REIT investor, the triple net lease is really what you’re looking for. In an NNN, the tenant pays the rent, plus essentially all costs associated with the structure, from taxes and insurance to upkeep, repairs, and any modifications that may be needed. Again, the base rent may seem very low initially, but these other expenses can make them much more expensive and unpredictable than a single net lease. For the investor or landlord, however, triple net leases reduce overhead substantially.\nRelated investing topics\nWhat type of net lease is best?\nWhat type of net lease is best?\nThe best net lease depends on who you are in the transaction. For a tenant, a single net lease is ideal, though becoming far less common. You might still see them in places like shopping centers with a lot of small stores or office complexes with many small offices. These leases may charge a higher base rent, but monthly costs are fairly consistent, with the tax burden being spread across all the tenants in the building.\nFor a real estate investor, the triple net lease is the holy grail of leases. They’re becoming increasingly common, especially for stand-alone buildings, or structures that only have one tenant, regardless of the initial design. The triple net lease essentially absolves you from paying any expenses related to owning the property until after the tenant has vacated, which can really increase your cash flow if your tenant stays a long time (as the property also appreciates naturally)."
    }
  ],
  "argos_summary": "Rising Treasury yields have increased dividend yields for real estate investment trusts (REITs) like Realty Income and W.P. Carey, both offering yields above 5%. Realty Income has maintained monthly dividend payments for over 55 years and has raised its payout 131 times since going public in 1994. Despite a recent decline in stock price, the REIT is expected to continue growing its dividend, making it an attractive option for passive income investors.",
  "argos_id": "RN1F8RVFD"
}