{
  "url": "https://finance.yahoo.com/news/wendel-investor-conference-calls-ahead-075700743.html",
  "authorsByline": "WENDEL",
  "articleId": "796784a133f84d1aa955a3518d2ad79d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/globenewswire.com/5fba3ea3bd46a3064f42be5dde52de35",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-04T07:57:00+00:00",
  "addDate": "2025-08-04T08:06:29.424024+00:00",
  "refreshDate": "2025-08-04T08:06:29.424026+00:00",
  "score": 1.0,
  "title": "WENDEL: Investor conference calls ahead of the launch of a potential €500 million 8-year bond issue",
  "description": "Investor conference calls ahead of the launch of a potential €500 million 8-year bond issue Subject to the successful completion of the bond issue, subsequent make-whole redemption of the bonds maturing in February 2027 with outstanding principal of €500 million Wendel announces that it will hold a series of conference calls with investors today in connection with the potential launch of a 8-year bond issue for a nominal amount of €500 million (the “2033 Bond Issue”) in the coming days, subject",
  "content": "Investor conference calls ahead of the launch of a potential €500 million 8-year bond issue\n\nSubject to the successful completion of the bond issue, subsequent make-whole redemption of the bonds maturing in February 2027 with outstanding principal of €500 million\n\n\n\n\n\nWendel announces that it will hold a series of conference calls with investors today in connection with the potential launch of a 8-year bond issue for a nominal amount of €500 million (the “2033 Bond Issue”) in the coming days, subject to market conditions.\n\nWendel intends, subject to the successful settlement and delivery of the 2033 Bond Issue, to exercise its early make-whole redemption option on all of the bond bearing an interest rate of 2.50% maturing in February 2027, with an outstanding nominal amount of €500 million (ISIN FR0012516417), at a price determined in accordance with the provisions of the terms and conditions of these bond.\n\nThe 2027 bond is traded, and the new 2033 bond would be traded, on the regulated market of Euronext Paris.\n\nThese transactions would enable Wendel to extend the average maturity of its bond debt.\n\nThe result and final terms of the 2033 Bond Issue would be announced upon closing of the transaction.\n\nThe 2033 Bond Issue would be conducted by Crédit Agricole Corporate and Investment Bank, Crédit Industriel et Commercial S.A., Mediobanca - Banca di Credito Finanziario S.p.A., Natixis and Société Générale as bookrunners.\n\nThis press release does not constitute an offer, or an invitation to apply for, or an offer or invitation to purchase or subscribe for any securities either in the United States or in any other jurisdiction which may be subject to restrictions. These securities may not be offered or sold in the United States of America unless they are registered or exempt from registration under the US Securities Act of 1933, as amended.\n\nThis press release is an advertisement and not a prospectus within the meaning of Regulation (EU) 2017/1129, as amended (the “Prospectus Regulation”). A prospectus will be prepared and made available to the public, in compliance with the Prospectus Regulation, for the purpose of admitting the 2033 bonds to trading on the regulated market of Euronext Paris.\n\nThis press release does not constitute an offer of securities in France or in any other country. The 2033 bonds are the subject of a private placement in France to qualified investors as defined in Article 2(e) of the Prospectus Regulation and in accordance with Article L.411-2 of the Monetary and Financial Code, and outside France. As of the date of this press release, no prospectus related to the placement of the 2033 bonds has been approved by a competent authority of any European Economic Area Member State.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Investor conference calls",
      "weight": 0.07578419
    },
    {
      "name": "conference calls",
      "weight": 0.06589934
    },
    {
      "name": "the bond issue",
      "weight": 0.0645448
    },
    {
      "name": "European Economic Area",
      "weight": 0.061857972
    },
    {
      "name": "qualified investors",
      "weight": 0.060455374
    },
    {
      "name": "market conditions",
      "weight": 0.060013913
    },
    {
      "name": "its bond debt",
      "weight": 0.055968862
    },
    {
      "name": "outstanding principal",
      "weight": 0.055602722
    },
    {
      "name": "Euronext Paris",
      "weight": 0.05537499
    },
    {
      "name": "securities",
      "weight": 0.055273578
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9658203125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9150390625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.88134765625
    }
  ],
  "sentiment": {
    "positive": 0.13696289,
    "negative": 0.07757568,
    "neutral": 0.78515625
  },
  "summary": "Wendel is set to hold investor conference calls ahead of the potential launch of a €500 million 8-year bond issue (the 2033 Bond Issue), subject to market conditions. The successful completion of the bond issue would allow Wendel to extend the average maturity of its bond debt. If successful, Wendel plans to exercise its early make-whole redemption option on all bonds maturing in February 2027, with an outstanding nominal amount of €500m. The 2027 bond is traded and the new 2033 bond will be traded on the regulated market of Euronext Paris. The final terms of the transaction will be announced upon closing. This press release does not constitute an offer of securities in France or in any other country.",
  "shortSummary": "Wendel will hold investor conference calls to discuss a potential €500 million bond issue, including a potential make-whole redemption option, with results announced later.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1aefd951cc574686b122315781085237",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Wendel is set to hold investor conference calls regarding a potential €500 million 8-year bond issue, known as the 2033 Bond Issue, which is contingent on market conditions. If successful, Wendel plans to redeem its existing €500 million bonds maturing in February 2027, thereby extending the average maturity of its bond debt. The new bonds will be traded on Euronext Paris, with the final terms to be announced upon closing of the transaction.",
  "argos_id": "X6CD1AFD0"
}