{
  "url": "https://techxplore.com/news/2025-09-europe-fastest-supercomputer-boost-ai.html",
  "authorsByline": "Sam Reeves",
  "articleId": "1374b52f687e4f73aa78b4b784696a84",
  "source": {
    "domain": "techxplore.com",
    "location": null
  },
  "imageUrl": "https://scx2.b-cdn.net/gfx/news/2025/jupiter-is-housed-in-a.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-05T04:19:57-04:00",
  "addDate": "2025-09-05T08:26:21.731011+00:00",
  "refreshDate": "2025-09-05T08:26:21.731012+00:00",
  "score": 1.0,
  "title": "Europe's fastest supercomputer to boost AI drive",
  "description": "Europe's fastest supercomputer Jupiter is set to be inaugurated Friday in Germany with its operators hoping it can help the continent in everything from climate research to catching up in the artificial intelligence race.",
  "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nEurope's fastest supercomputer Jupiter is set to be inaugurated Friday in Germany with its operators hoping it can help the continent in everything from climate research to catching up in the artificial intelligence race.\n\nHere is all you need to know about the system, which boasts the power of around one million smartphones.\n\nWhat is the Jupiter supercomputer?\n\nBased at Juelich Supercomputing Center in western Germany, it is Europe's first \"exascale\" supercomputer—meaning it will be able to perform at least one quintillion (or one billion billion) calculations per second.\n\nThe United States already has three such computers, all operated by the Department of Energy.\n\nJupiter is housed in a center covering some 3,600 meters (38,000 square feet)—about half the size of a football pitch—containing racks of processors, and packed with about 24,000 Nvidia chips, which are favored by the AI industry.\n\nHalf the 500 million euros ($580 million) to develop and run the system over the next few years comes from the European Union and the rest from Germany.\n\nIts vast computing power can be accessed by researchers across numerous fields as well as companies for purposes such as training AI models.\n\n\"Jupiter is a leap forward in the performance of computing in Europe,\" Thomas Lippert, head of the Juelich center, told AFP, adding that it was 20 times more powerful than any other computer in Germany.\n\nHow can it help Europe in the AI race?\n\nLippert said Jupiter is the first supercomputer that could be considered internationally competitive for training AI models in Europe, which has lagged behind the US and China in the sector.\n\nAccording to a Stanford University report released earlier this year, US-based institutions produced 40 \"notable\" AI models—meaning those regarded as particularly influential—in 2024, compared to 15 for China and just three for Europe.\n\n\"It is the biggest artificial intelligence machine in Europe,\" Emmanuel Le Roux, head of advanced computing at Eviden, a subsidiary of French tech giant Atos, told AFP.\n\nJose Maria Cela, senior researcher at the Barcelona Supercomputing Center, said the new system was \"very significant\" for efforts to train AI models in Europe.\n\n\"The larger the computer, the better the model that you develop with artificial intelligence,\" he told AFP.\n\nLarge language models (LLMs) are trained on vast amounts of text and used in generative AI chatbots such as OpenAI's ChatGPT and Google's Gemini.\n\nNevertheless with Jupiter packed full of Nvidia chips, it is still heavily reliant on US tech.\n\nThe dominance of the US tech sector has become a source of growing concern as US-Europe relations have soured.\n\nWhat else can the computer be used for?\n\nJupiter has a wide range of other potential uses beyond training AI models.\n\nResearchers want to use it to create more detailed, long-term climate forecasts that they hope can more accurately predict the likelihood of extreme weather events such as heat waves.\n\nLe Roux said that current models can simulate climate change over the next decade.\n\n\"With Jupiter, scientists believe they will be able to forecast up to at least 30 years, and in some models, perhaps even up to 100 years,\" he added.\n\nOthers hope to simulate processes in the brain more realistically, research that could be useful in areas such as developing drugs to combat diseases like Alzheimer's.\n\nIt can also be used for research related to the energy transition, for instance by simulating air flows around wind turbines to optimize their design.\n\nYes, Jupiter will require on average around 11 megawatts of power, according to estimates—equivalent to the energy used to power thousands of homes or a small industrial plant.\n\nBut its operators insist that Jupiter is the most energy-efficient among the fastest computer systems in the world.\n\nIt uses the latest, most energy-efficient hardware, has water-cooling systems and the waste heat that it generates will be used to heat nearby buildings, according to the Juelich center.",
  "medium": "Article",
  "links": [
    "https://techxplore.com/tags/energy+transition/",
    "https://techxplore.com/tags/waste+heat/",
    "https://techxplore.com/tags/heat+waves/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI models",
      "weight": 0.08093862
    },
    {
      "name": "Europe",
      "weight": 0.067520134
    },
    {
      "name": "current models",
      "weight": 0.066320814
    },
    {
      "name": "Large language models",
      "weight": 0.06446115
    },
    {
      "name": "US tech",
      "weight": 0.06379049
    },
    {
      "name": "Jupiter",
      "weight": 0.062675595
    },
    {
      "name": "generative AI chatbots",
      "weight": 0.060133345
    },
    {
      "name": "climate research",
      "weight": 0.059298895
    },
    {
      "name": "Juelich Supercomputing Center",
      "weight": 0.057006475
    },
    {
      "name": "AI drive",
      "weight": 0.056827113
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9921875
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.55078125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.423828125
    },
    {
      "name": "/Science/Physics",
      "score": 0.30078125
    }
  ],
  "sentiment": {
    "positive": 0.56609344,
    "negative": 0.054220337,
    "neutral": 0.37968624
  },
  "summary": "Europe's fastest supercomputer, Jupiter, is set to be inaugurated in Germany and is expected to help Europe in everything from climate research to the artificial intelligence race. The system, which can power around one million smartphones, is based at Juelich Supercomputing Center in western Germany and will be able to perform at least one quintillion calculations per second. It is housed in a center with racks of processors, and about 24,000 Nvidia chips, which are favored by the AI industry. Half of the 500 million euros ($580 million) to develop and run the system is from the European Union and the rest from Germany. Jupiter's potential uses include creating detailed climate forecasts and predicting future extreme weather events.",
  "shortSummary": "The Jupiter supercomputer, launching in Germany, aims to boost Europe's AI efforts and climate research capabilities by providing efficient, energy-efficient computing.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a28f1cf35cd6442dac219de2af96a040",
  "places": [
    {
      "osmId": "158408",
      "town": "Jülich",
      "county": "Kreis Düren",
      "state": "North Rhine-Westphalia",
      "postcode": "52428",
      "country": "Germany",
      "countryCode": "de",
      "coordinates": {
        "lat": 50.9220931,
        "lon": 6.3611015
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Europe’s new exascale supercomputer, Jupiter, will be inaugurated in Germany and is expected to boost the continent’s AI capabilities, helping it compete with the U.S. and China. Powered by 24,000 Nvidia chips, the machine can train large language models and run advanced climate simulations up to 30–100 years ahead. Beyond AI, Jupiter’s high‑performance computing will support research in energy transition, neuroscience, and other scientific fields. The €500 million project is jointly funded by the EU and Germany, and its efficient design aims to minimize power consumption while providing significant computational throughput.",
  "argos_id": "0OBYZ8TBT"
}