{
  "url": "https://www.bloomberg.com/news/videos/2025-09-05/daybreak-europe-9-05-2025-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "457675124c294862a3c5e56845960b2e",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iZ6dvLxDndr4/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-05T07:18:52.093000+00:00",
  "addDate": "2025-09-05T07:40:43.280568+00:00",
  "refreshDate": "2025-09-05T07:40:43.280573+00:00",
  "score": 1.0,
  "title": "OpenAI's Chip Ambitions & Fed Bets Drive Stocks",
  "description": "Bloomberg Daybreak Europe is your essential morning viewing to stay ahead. Live from London, we set the agenda for your day, catching you up with overnight markets news from the US and Asia. And we'll tell you what matters for investors in Europe, giving you insight before trading begins.\n\nOn today's show, The S&P 500 hits a record high on more signs of a cooling US labour market, fuelling bets on rate cuts from the Fed. We'll get non-farm payrolls later today. Broadcom soars on reports of $10 billion of orders from a partnership with OpenAI to design and produce accelerator chips in a bid to take on Nvidia. The French Prime Minister holds last ditch meetings ahead of Monday's confidence vote.  (Source: Bloomberg)",
  "content": "> > GOOD MORNING. I AM LIZZY BURDEN IN LONDON AND THESE ARE THE STORIES THAT SO YOUR AGENDA. THE S & P 500 HITS A RECORD HIGH ON MORE SIGNS OF A COOLING U.S. LABOR MARKET, FUELING BETS ON RATE CUTS. WE WILL GET NONFARM PAYROLLS LATER. THE FRENCH PRIME MINISTER HOLDS LAST-DITCH MEETINGS AHEAD OF THE CONFIDENCE VOTE. WE WILL BREAK DOWN WHAT A DEFEAT COULD MEAN. AND BROADCOM SOURCE ON REPORTS OF $10 BILLION OF ORDERS FROM A PARTNERSHIP WITH OPENAI TO DESIGN AND PRODUCE ACCELERATOR CHIPS. HAPPY FRIDAY. WE ARE HEADING INTO JOBS DAY WITH STOCKS ON THE S & P AT AN ALL-TIME HIGH, TRADERS CONVINCED WE WILL GET A FED CUT IN SEPTEMBER AND IT DOES NOT LOOK LIKE THERE'S ANYTHING THIS PAYROLLS REPORT COULD DO TO PERSUADE THEM OTHERWISE. WITH FUTURES POINTING HIGHER ON BOTH SIDES OF THE ATLANTIC STOCKS ALREADY RIDING THE WAVE OF POSITIVITY. AND YOU HAVE THE TWO YEAR TREASURY YIELD AT ITS LOWEST IN ABOUT A YEAR. THE DOLLAR WEAKER AGAIN TODAY AND LOOK AT GOLD. WE ARE ON FOR A THIRD WEEKLY GAME BUT OIL DOWN FOR THE WEEK AIRED AS WE HEAD INTO THAT OPEC-PLUS MEETING WITH MORE PRODUCTION HIKES. ASIAN MARKETS GAINING AFTER THAT WALL STREET RALLY AS THE SOFT HIRING DATA IS FUELING BETS ON A CUT THIS MONTH. OUR EXECUTIVE EDITOR FOR ASIAN MARKETS JOINS US NOW. LOOKS LIKE A SEA OF GREEN ON YOUR SCREEN. > > GOOD MORNING. IT IS CERTAINLY A POSITIVE DAY IN ASIA. AND IT IS IMPOSSIBLE TO LOOK PAST THE PAYROLLS REPORT COMING UP. WE WILL SEE WHETHER IT HOLDS INTO MONDAY THE WHAT YOU ARE SEEING IS SOME EXPRESSION OF THE RISK ON MOVES YOU WERE TALKING ABOUT IN THE FORM OF A WEAKER DOLLAR IF THE PAYROLLS NUMBERS DELIVERS AS WE WOULD EXPECT THEM. THAT MIGHT PUSH DOWN U.S. YIELDS FURTHER AS PEOPLE PRICE IN A FED CUT. YOU HAD ASIAN CURRENCIES GETTING A LIFT IN ANTICIPATION TODAY AND ASIAN STOCK MARKETS WRITING THAT WAVE. A BIT OF A RECOVERY IN CHINA AFTER A NEGATIVE WEEK. WE HEARD EARLIER THAT THERE WERE MOVES TO TRY TO COOL DOWN THE RALLY THAT WE HAD SEEN IN CHINESE EQUITIES AND THAT CERTAINLY DID HAVE AN EFFECT AS WE HAD NEGATIVE DAYS. BUT TODAY WE ARE RECOVERING SOMEWHAT INTO THE WEEKEND SO SOME SIGNS THAT MAY BE THE AUTHORITIES WOULD BE ABLE TO ACTUALLY ACHIEVE THE SLOWER BULL MARKET. SO GOOD NEWS IN CHINA AND ACROSS THE REST OF THE MARKETS AS THEY PRICE IN AND EVERYBODY WILL BE WATCHING THEIR TV'S AND VIDEO SCREENS TO FIGURE OUT WHAT THOSE PAYROLLS NUMBERS WILL LOOK LIKE AND WHAT IT WILL MEAN. > > PAUL DOBSON, THANK YOU FOR THAT LOOK AT ASIAN MARKETS. BUT HEADING TO THE U.S., THE S & P 500 HITTING AN ALL-TIME HIGH AHEAD OF TODAY'S JOBS REPORT. ANY FURTHER SIGNS OF LABOR MARKET WEAKENING LIKELY TO REINFORCE BETS ON A RATE CUT. JOHN WILLIAMS SAYS HE EXPECTS THEY WILL COME DOWN EVENTUALLY. > > LOOKING AHEAD IF PROGRESS ON OUR GOALS CONTINUES AS IN MY BASELINE FORECAST I ANTICIPATE IT WILL BECOME APPROPRIATE TO MOVE RAIDS TOWARDS A MOVE WERE NEUTRAL STANCE. > > VALERIE TYTEL IS HERE TO SET US UP FOR THE DATA. ARE WE JUST GOING TO GET MORE COVER FOR THESE CUTS FOR WHICH THERE IS SO MUCH POLITICAL PRESSURE? > > CLEAR YOUR DESKS FOR LATER TODAY. A LOT OF VOLATILITY PRICED INTO THIS MARKET ON THIS PRINT. THE ESTIMATE IS FOR 75 K, THE LOWEST ESTIMATE SINCE DECEMBER 2020 AND IF YOU WIPE OUT COVID YOU HAVE TO GO ALL THE WAY BACK TO 2011 TO FIND A RUN RATE THIS LOW. BUT ATTENTION -- ATTENTION WILL ALSO BE ON THE UNEMPLOYMENT RATE BECAUSE THE THEME IS LABOR SUPPLY HAS BEEN DROPPING IN TANDEM WITH DEMAND. IF WE SEE IT DROP QUICKER THAN LABOR SUPPLY WE WILL SEE A RISE IN THE UNEMPLOYMENT RATE. ATTENTION WILL ALSO BE ON THE REVISIONS, WHICH WERE THE BIGGEST IN FOUR DECADES AND THIS IS THE FIRST TIME THEY WILL BE RELEASED WITH A NEW BLS CHIEF. WE ARE NERVOUS HEADING INTO THIS PRINT. WEAK MARKET DATA HAS SPURRED THIS RALLY. JOLTS OFF THE GATE SHOWED A RISE IN LAYOFFS. A MISS ON ADP. PRIVATE PAYROLLS WERE RUNNING ON A RATE OF HALF OF LAST MONTH. AN INITIAL JOBLESS RATES CONTINUE TO CREEP HIGHER. THE HIGHEST SINCE JUNE. AND IT HAS LED A BOND RALLY THIS WEEK. IN TWO YEAR YIELDS ARE NOW AT LOWES FOR THAT POLICY SENSITIVE FRONT END. WE HAVE ALSO SEEN THE FED'S TERMINAL RATE IMPLIED IN THE MARKET THAT'S ALSO HIT A FRESH LOW FOR THE CYCLE SO THE CEASING THAT'S HAPPENING IN THE FRONT END HAS ALLOWED THAT EQUITY MARKET TO BREACH ANOTHER ALL-TIME HIGH. THE FIRST ONE IN FIVE SESSIONS. S & P 500 NOW UP OVER 10.5% ON THE YEAR. > > SAY IT ONE MORE TIME. THE S & P AT AN ALL-TIME HIGH. VALERIE TYTEL WILL BE BACK WITH THE OPENING TRADE. BUT LET'S DIVE INTO THE FED STORY BECAUSE THE NOMINEE FOR THE BOARD OF GOVERNORS HAS PUSHED BACK AGAINST DEMOCRATIC CONCERNS THAT HE WOULD JUST DO THE PRESIDENT'S BIDDING. THERE WERE CONCERNS ABOUT HIS DECISION TO KEEP HIS WHITE HOUSE JOB IF HE GOES TO THE FED. > > THE PRESIDENT NOMINATED ME BECAUSE I HAVE POLICY VIEWS THAT I SUPPOSE HE LIKED. IF I'M CONFIRMED. I WILL ACT INDEPENDENTLY BASED ON MY OWN PERSONAL ANALYSIS OF ECONOMIC DATA AND THE EFFECTS OF ECONOMIC POLICIES UPON THE ECONOMY AND BASED ON MY JUDGMENT OF THE BEST ECONOMIC POLICY POSSIBLE. > > LET'S BRING IN SOMEONE WHO HAS BEEN WATCHING THAT TESTIMONY FOR US. ARE WE EXPECTING HIM TO BE CONFIRMED BY THE FED AND IS THE EXPECTATION GIVEN THAT HIS POLICY ANALYSIS CONVENIENTLY MATCHES THE PRESIDENT THAT HE WOULD BE PUSHING FOR A 50 BASIS POINT CUT. > > THE BOTTOM LINE IS THAT HE REMAINS ON THE FAST-TRACK AND THERE'S A GOOD CHANCE HE WILL BE CONFIRMED BEFORE THE NEXT MEETING. THERE ARE CONCERNS ABOUT HIS INDEPENDENCE AND THE DEMOCRATS PUSHED HIM PRETTY HARD ON THAT. BUT GRILLING THE PRESIDENT'S NOMINEE IS NOT A NOVELTY. HE WOULD NEED TO LOSE FOUR REPUBLICAN VOTES FOR HIS CONFIRMATION TO BE IN JEOPARDY AND THERE IS NO SIGN OF THAT HAPPENING. THE PRESIDENT LIKES HIS POLICY VIEWS. WHAT DOES HE LIKE? LOWER RATES. HE HAS BEEN VOCAL ABOUT HIS BELIEF THAT THE TARIFFS WILL NOT RESULT IN ANY SORT OF SUSTAINED INFLATIONARY PRESSURE SO WE CAN ASSUME THAT HE WILL INDEED BE ON THE OTHER SIDE WHEN THE NEXT MEETING BEGINS IN 11 DAYS. > > AND OF COURSE THEY WILL BE MONITORING THE JOBS DATA. WHAT DID HE HAVE TO SAY ABOUT WHERE THE DATA COME FROM? THE BLS, WHO OF COURSE THE PRESIDENT FIRED THE BOSS OF > > PAY HAS BEEN AMONG THOSE OFFICIALS WHO HAVE BEEN QUITE CRITICAL OF THE BUREAU OF LABOR STATISTICS. HE SIDESTEPPED THE QUESTION ABOUT WHETHER THOSE NUMBERS WERE FAKE OR IF THERE WAS FRAUD COMMITTED. HE DID SAY THERE ARE STRUCTURAL ISSUES ABOUT BLS DATA AND THERE'S BEEN A LOT OF CRITICISM ABOUT THE WAY THAT DATA IS COLLECTED. IT TENDS TO BE VERY NOISY. THAT MAKES IT EVEN MORE INTERESTING. THAT NEXT PIECE OF THE PUZZLE MIGHT CEMENT THAT RATE CUT LATER THIS MONTH > > MEANWHILE WE HAVE THE JUSTICE DEPARTMENT OPENING A CRIMINAL INVESTIGATION INTO LISA COOK, WHETHER SHE COMMITTED MORTGAGE FRAUD. SHE GOING TO BE AROUND FOR THE SEPTEMBER VOTE? > > THAT'S A GREAT QUESTION. IT'S LESS THAN TWO WEEKS TO GO AND WE STILL DON'T KNOW. THE DEPARTMENT OF JUSTICE FILED THIS REFERRAL THAT INCREASES THE PRESSURE ON LISA COOK BUT THE CASE IN COURT CONTINUES. SHE ASKED FOR AN EMERGENCY INJUNCTION TO STAY ON THE FED BUT THEY HAVE NOT SAID WHEN SHE MIGHT RULE ON THAT. THE ADMINISTRATION FILED MORE INFORMATION AND PUSHED BACK ON THE IDEA THAT THE MORTGAGE ALLEGATIONS ARE JUST A PRETEXT AND THE PRESIDENT ONCE HER REMOVED BECAUSE OF HER POLICY STANCES BUT THAT CASE CONTINUES AND WE WILL HAVE TO WAIT FOR THE COURT TO MAKE A DECISION ON WHETHER SHE WILL BE ABLE TO CONTINUE WHEN THE FED MEETS. > > THANK YOU. HAVE A GREAT WEEKEND. WE ARE NOT QUITE THERE YET. AT 7 A.M. WE GET U.K. RETAIL SALES EXPECTED TO HAVE RISEN IN JULY AND GERMAN FACTORY ORDERS ALSO EXPECTED TO HAVE RISEN. AND AT 1:30 P.M. WE WILL GET THAT U.S. JOBS REPORT. THE EXPECTATION IS 75,000 IN AUGUST. BUT REMEMBER THOSE REVISIONS LAST MONTH AND I AM SURE YOU WILL WANT TO TUNE IN FOR THIS. ALSO REMEMBER YOU HAVE TO KEEP AN EYE ON WASHINGTON AS THE WALL STREET JOURNAL REPORTS TODAY IS THE DAY WHEN THE TREASURY SECRETARY START HIS INTERVIEWS FOR THE SUCCESSOR, WHO WILL BE THE NEXT FED CHAIR WHEN HIS TERM EXPIRES IN JANUARY YOU CAN GET A ROUNDUP OF THE STORIES YOU NEED TO KNOW BY LOOKING AT TODAY'S ADDITION OF DAYBREAK. AND COMING UP, BROADCOM SOARING ON A REPORT THAT IT'S HELPING OPENAI TO CREATE A CHIP TO TAKE ON NVIDIA. AND THE FRENCH PRIME MINISTER SAYS HE DOES NOT REGRET THE NO-CONFIDENCE VOTE AND IS LOOKING -- AND WILL PUT THE FUTURE OF THE GOVERNMENT ON THE TABLE. THIS IS BLOOMBERG. ♪ > > WELCOME BACK TO DAYBREAK EUROPE. BROADCOM IS HELPING OPENAI TO DESIGN AND PRODUCE AN ACCELERATOR CHIP FOR NEXT YEAR, GETTING INTO THIS LUCRATIVE SPHERE CURRENTLY DOMINATED BY NVIDIA THEY SURGED AFTER HOURS WITH THEM PLANNING TO SHIP THE FIRST CHIPS NEXT YEAR. IN JOINING ME TO TALK ABOUT THE SIGNIFICANCES ANNABELLE DROULERS. TALK US THROUGH THIS ANNOUNCEMENT AND WHY IT MATTERS SO MUCH BETWEEN BROADCOM AND OPENAI > > IT IS SIGNIFICANT. WE HAD THE EARNINGS OUT YESTERDAY AND IT WAS ONE OF THE KEY THEMES THAT CAME OUT OF THE NUMBERS. BROADCOM INDICATED DURING THE CALL THAT THEY HAD THIS CUSTOMER SIGNED ON TO THEIR BUSINESS. AND IT WAS GOING TO BE MORE THAN $10 BILLION IN ORDERS. THEY DID NOT SPECIFY WHO BUT THAT HAS BEEN THE REPORTING. , THAT THIS NEW CUSTOMER IS OPENAI AND THEY WILL BE WORKING TOGETHER TO PRODUCE AN ACCELERATOR THAT WILL GO INTO PRODUCTION. OPENAI ARE LOOKING TO USE THE CHIP FOR THEIR OWN INTERNAL PURPOSES INITIALLY BUT IT IS SIGNIFICANT GIVEN THAT YOU HAVE BROADCOM SAYING THE EXPECT THE OUTLOOK TO IMPROVE SIGNIFICANTLY FOR THE COMPANY STARTING IN THE COMING YEARS. > > SO IS IT ENOUGH TO SOOTH THE CONCERNS ABOUT THE COMPANY'S SLOWING GROWTH? > > I GUESS THAT IS THE BIG QUESTION. ACCELERATORS ARE ESSENTIAL TO THE DEVELOPMENT OF AI TECH FIRMS. META-FOR INSTANCE, MICROSOFT. THEY ARE JUST SOME OF THE BIG CUSTOMERS FOR THE LIKES OF NVIDIA THAT DOMINATE THIS SPACE. AND WE HAVE BEEN REPORTING THAT OPENAI AND BROADCOM ARE WORKING ON AN INFERENCE CHIP DESIGN INTENDED TO OPERATE SERVICES. IT IS SEEN AS CERTAINLY ONE OF THE BIG FACTORS THAT COULD BOOST BROADCOM FROM HERE. > > WE HAVE PRESIDENT TRUMP SAYING HE WILL IMPOSE TARIFFS SHORTLY AT THAT WHITE HOUSE DINNER HE HOSTED YESTERDAY. WHAT DO WE KNOW ABOUT WHO WILL BE SPARED AND WHAT ELSE CAME OUT OF THE DINNER? > > THE RATE HE DID NOT SPECIFY DURING THE MEETING BUT SAID IT WILL BE RELATIVELY SUBSTANTIAL. SO THIS DINNER TOOK PLACE YESTERDAY EVENING IN WASHINGTON AND IT WAS REALLY THE TECH BROSE BUT IT WAS THE WHO'S WHO OF THE TECH WORLD. THERE WAS SAM ALTMAN, MARK ZUCKERBERG, THE HEADS OF MICROSOFT AND ALPHABET AND ORACLE, AMD AND BILL GATES. IT WAS A STAR-STUDDED EVENT. THIS WAS ONE OF THE KEY TAKEAWAYS. TRUMP SAID THESE SUBSTANTIAL TARIFFS ARE COMING SOON. THEY WILL BE APPLIED TO COMPANIES THAT DON'T ALREADY HAVE SOME SORT OF MANUFACTURING IN THE U.S.. AND DID NOT SPECIFICALLY CALL OUT APPLE, SAYING THEY WOULD BE LOOKING OK GIVEN APPLE HAS PLEDGED TO BOOST ITS INVESTMENT IN THE U.S.. > > AND SPEAKING OF APPLE, JUST BREAKING ON THE TERMINAL, WE HAVE THAT APPLE'S INDIA REVENUE HIT A RECORD JUST HOW IMPORTANT IS THAT MARKET FOR THE COMPANY? > > INDIA IS A SIGNIFICANT MARKET FOR APPLE. APPLE HAS FACED SLOWING SALES GROWTH IN CHINA SO GETTING THIS SORT OF ANNUAL GROWTH IN INDIA AND HITTING THAT RECORD IN THE LAST FISCAL YEAR DOES SIGNAL GROWING DEMAND FOR ITS FLAGSHIP DEVICES. SO IT IS IMPORTANT BECAUSE IT'S EXPECTED TO BECOME A GROWING MARKET IN THE COMING YEARS. WE HAVE SEEN THEM EXPANDING THEIR RETAIL FOOTPRINT EVEN IN THE LAST FEW WEEKS. THEY HAVE BEEN COMMITTING TO FURTHER IPHONE PRODUCTION AS WELL AS MAJOR ASSEMBLERS ARE SETTING UP FURTHER FACILITIES. SO IT'S AN IMPORTANT SALES SURGE TO NOTE, ESPECIALLY BECAUSE APPLE IS FACING SLOWING SALES IN THE MAINLAND MARKET. > > CRUCIAL CONTEXT. ANNABELLE DROULERS, WE THANK YOU. COMING UP, TURKEY'S CENTRAL BANK GOVERNORS SAYS HE'S OPTIMISTIC ON TACKLING THE COUNTRY'S INFLATION PROBLEM. THE DETAILS NEXT. THIS IS BLOOMBERG. ♪ > > WHAT YOU MIGHT NOT KNOW IS THAT THE BLOOMBERG ANALYSIS HAS FOUND CHINA'S MILITARY IS FACING THE BIGGEST PURGE SINCE MAO. XI JINPING HAS OUSTED NEARLY A FIFTH OF THE GENERALS HE APPOINTED SINCE COMING TO POWER AND THE CONSEQUENCES COULD RESHAPE THE NATION AND BEYOND. > > IS THE -- THIS IS THE WORLD'S LARGEST MILITARY. > > AN ELABORATE PARADE SHOWCASING NEW WEAPONS. > > XI JINPING HAD MADE IT HIS STATED GOAL TO MODERNIZE CHINA'S MILITARY AND TURN IT INTO A FIGHTING FORCE CAPABLE OF WINNING THE WARS. > > BUT IT'S UNDERGOING ITS MOST SERIOUS LEADERSHIP SHAKEUP IN DECADES. DURING HIS THIRD TERM, XI JINPING HAS PURGED GENERALS. IT IS THE BIGGEST PURGE OF CHINA'S MILITARY PERSONNEL SINCE THE CHAOTIC MAO ZEDONG AREA -- EIRE. > > EVERY TIME YOU THINK SURELY THIS IS AS HIGH AS IT CAN GO IT SEEMS TO GATE BIGGER. > > HE WANTS TO CENTRALIZE CONTROL EVEN AT THE EXPENSE OF HAVING PEOPLE THAT HE HIMSELF HAS PERSONALLY APPOINTED REMOVED FROM THAT PARTY STRUCTURE. > > THIS IS KEY AS HE NEARS A POTENTIAL FOURTH TERM THAT WOULD STRETCH HIS TIME IN POWER TO 20 YEARS. THE GLOBAL CONSEQUENCES WILL BE FAR-REACHING. TENSIONS BETWEEN THE U.S. AND CHINA RISING ON MANY FRONTS. AND THEN THERE IS THIS. > > A U.S. ADMIRAL SAYS CHINA IS STICKING TO ITS AMBITIONS TO BE READY TO INVADE TAIWAN BY 2027. > > A COMPETITION BETWEEN THE U.S. AND CHINA IS THE MOST DANGEROUS AND IMPACTFUL WHEN IT COMES TO THEIR MILITARIES. ANYTHING THAT CHANGES THE DYNAMIC THERE WILL INEVITABLY CHANGE THE WAY THE WORLD WORKS POLITICALLY, ECONOMICALLY, TECHNOLOGICALLY IN BIG AND SMALL WAYS. > > SUBSCRIBERS CAN WATCH THAT DOCUMENTARY NOW ON THE TERMINAL. NOW TO TURKEY, WHERE THE CENTRAL BANK GOVERNOR HAS STRUCK AN OPTIMISTIC NOTE ON THE INFLATION OUTLOOK FOLLOWING WORSE THAN EXPECTED DATA. SUGGESTING INVESTORS MAY HAVE BEEN TOO HASTY IN REDUCING THEIR FORECASTS. BARREL ACUMEN JOINS US NOW. GOOD MORNING. IS THERE ECONOMY IN GOOD SHAPE? > > THAT IS A GOOD QUESTION AND THE ANSWER DEPENDS ON WHO YOU ASK. EARLIER THIS WEEK WE HAVE SEEN SOME DISAPPOINTING DATA BOTH ON THE INFLATION SIDE IN AUGUST AS WELL AS GROWTH IN THE SECOND QUARTER. AND DESPITE RATE HIKES IN THE SECOND QUARTER, WE SAW DEMAND REMAINED QUITE STRONG. AND THAT HAS WORRIED INVESTORS. IN AUGUST WE SAW HIGHER-THAN-EXPECTED INFLATION. BUT THE CENTRAL BANK GOVERNOR HAS REMAIN MORE UPBEAT AND HAS URGED INVESTORS TO LOOK AT THE BREAKDOWN OF DATA, SAYING THE UNDERLYING TREND AND COMPONENTS OF GDP DATA INDICATE THAT DEMAND PRESSURE IS EASING AND THAT IS CONTRIBUTING TO THIS INFLATION. SO FOR HIM THE ECONOMY IS IMPROVING IN HIS REMARKS COME AS WALL STREET WAS WORRIED THAT THE OUTLOOK WAS NOT LOOKING SO GREAT. > > SO WALL STREET TAKING A DIFFERENT VIEW OF THE FIGURES TO THE CENTRAL BANK GOVERNOR BUT HAS THE REMOVAL OF TURKEY'S MAIN OPPOSITION UNNERVED INVESTORS AND WHAT WILL IT MEAN FOR THE FUTURE? > > ABSOLUTELY. SINCE THE START OF THIS YEAR WE HAVE SEEN THE MAIN OPPOSITION PARTY FACE AN INTENSIFIED JUDICIAL CRACKDOWN THAT REACHED A CLIMAX IN MARCH AS SOMEONE WHO IS SEEN AS THE STRONGEST RIVAL WAS JAILED. THERE WAS ANOTHER COURT RULING THAT REMOVED THEIR ADMINISTRATION AND IT WAS SEEN AS AN INDICATION OF WHAT IS TO COME FOR THE MAIN PARTY. SO THAT IS UNNERVING INVESTORS ON TWO SIDES. ONE, THE MARKET ROUTE IN MARCH WHEN THEY WERE FORCED TO SELL BILLIONS IN RESERVES AND REVERSE THEIR RATE CUTTING CYCLE AND THEY ARE ALSO WORRIED ABOUT DEMOCRATIC BACKSLIDING AND WHETHER THIS WILL CAUSE MORE UNREST AS WELL AS SPILL OVER INTO THE ECONOMY. SO THERE ARE A FEW OTHER CASES LINED UP. MOST PROMINENTLY ONE ON SEPTEMBER 15. THAT IS SHAKING INVESTORS. BUT DURING HIS INTERVIEW YESTERDAY WITH BLOOMBERG, THE CENTRAL BANK GOVERNORS SAID THEY ARE WATCHING THESE EXTERNAL FACTORS THAT MIGHT IMPACT THE INFLATION OUTLOOK AND WILL TAKE STEPS SHOULD ANYTHING WORSEN THE DISINFLATION PROCESS. > > OK. THANK YOU FOR THAT EXCLUSIVE INTERVIEW. NOW TO SOME OTHER STORIES. 12,000 MEMBERS OF THE POPULIST U.K. REFORM PARTY ARE GATHERING TODAY FOR A CONFERENCE, A TEST FOR NIGEL FARAGE. THEY NOW HAVE ALMOST 240,000 MEMBERS. DONALD TRUMP HAS ASKED THE SUPREME COURT FOR PERMISSION TO FIRE THE ONLY REMAINING DEMOCRAT ON THE FEDERAL TRADE COMMISSION, SEEKING TO OVERTURN A DECISION TO REINSTATE THEM. IT TESTS A PRECEDENT THAT ALLOWS CONGRESS TO PREVENT SOME HIGH-RANKING OFFICIALS FROM BEING FIRED. AND A WINDFARM VENTURE IS SUING THE TRUMP ADMINISTRATION IN AN EFFORT TO RESTART CONSTRUCTION OF AN ALMOST FINISHED OFF HER PROJECT ABRUPTLY BLOCKED BY THE GOVERNMENT LAST MONTH. CONNECTICUT'S ATTORNEY GENERAL BLASTED WHAT HE DESCRIBED AS PRESIDENT TRUMP'S ALL I WERE ON WIND POWER. COMING UP ON THIS PROGRAM, EUROPEAN LEADERS PLEDGE TO PROVIDE UKRAINE WITH SECURITY GUARANTEES. ALLIES WAIT FOR THE U.S. TO SUBMIT THEIR COMMITMENTS. WE WILL GET MORE ON THAT MEETING OF THE COALITION OF THE WILLINGNESS TO WITH OLIVER CROOK'S. SO STAY WITH US. THIS IS BLOOMBERG. ♪ > > GOOD MORNING. THIS IS BLOOMBERG DAYBREAK: EUROPE AND THESE ARE THE STORIES THAT SET YOUR AGENDA. THE S & P 500 HITS A RECORD HIGH ON MORE SIGNS OF A COOLING U.S. LABOR MARKET FUELING BETS ON FED CUTS. WE WILL GET THE NONFARM PAYROLLS LATER TODAY. THE FRENCH PRIME MINISTER HOLDS MEETINGS AHEAD OF MONDAY'S CONFIDENCE VOTE. > > EURO-DOLLAR AT 160 AND THE DOLLAR WEAKER. GOLD HEADING FOR ITS THIRD WEEKLY GAME BUT OIL HEADED FOR A WEEKLY LOSS AHEAD OF THIS MEETING THAT COULD DELIVER ANOTHER SUPPLY HIKE. THE FRENCH PRIME MINISTER SAYING HE DOES NOT REGRET CALLING A CONFIDENCE VOTE PUTTING HIS GOVERNMENT ON THE LINE AS FRANCE IS BURDENED WITH DEBT AND THE POLITICAL PARTIES MUCH EACH -- MUST EACH TAKE RESPONSIBILITY. HE SAID HE WAS PUTTING THE FUTURE OF THE GOVERNMENT ON THE TABLE. THE FRENCH PRESIDENT SAYS HE WILL SEEK TO AVOID A SNAP ELECTION IF HE LOSES. AND AN ECONOMIST AND TO BLOOMBERG ECONOMICS HAS BEEN LOOKING AT THIS. WHAT ARE THE DIFFERENT SCENARIOS FOR FRANCE AND CAN YOU TELL US MORE ABOUT YOUR NEW UNCERTAINTY INDEX? > > GOOD MORNING. FRANCE IS FACING A NEW POLITICAL CRISIS AND THIS IS STRIKING WHEN YOU LOOK AT OUR NEW POLICY THAT HAS REACHED ITS 2024 HIGHS RECENTLY AND ILLUSTRATES THE POLITICAL CRISIS FRANCE IS CURRENTLY FACING. IN THIS CONTEXT WE ESCAPE -- EXPECT THE GOVERNMENT TO COLLAPSE MONDAY DURING A CONFIDENCE VOTE. IN THAT SCENARIO HE WILL NAME HIS SUCCESSOR AFTERWARDS AFTER THE COLLAPSE OF THE GOVERNMENT. WE THINK THE NEW PRIME MINISTER WILL LEAN TOWARDS THE CENTERLEFT . IN ORDER TO REACH A DEAL WITH THE CURRENT COALITION, THE CENTER AND CENTER-RIGHT ON THE BUDGET, WHICH IS THE MOST STRIKING ISSUE FOR FRANCE AT THE MOMENT AND IT WILL NOT BE EASY BUT THAT IS STILL OUR SCENARIO. THE MAIN RISK WOULD BE FOR THE PRESIDENT TO DISSOLVE PARLIAMENT AND CALL FOR A NEW ELECTION. WE THINK IT IS UNLIKELY BUT STILL A RISK AND THE DISSOLUTION OF PARLIAMENT AND A NEW ELECTION WOULD LEAD PROBABLY TO A NEW FRAGMENTED PARLIAMENT SO IT WILL NOT SOLVE THE ISSUE BUT COULD LEAD TO A NOTE GOVERNMENT LED BY THE FAR RIGHT PARTY, THE NATIONAL RALLY. THAT WOULD BE THE MAIN RISK. > > SO A TAIL RISK BUT ONE WE NONETHELESS HAVE TO CONSIDER. IT IS A POLITICAL CRISIS ABOUT TO TURN INTO A DEBT OR ECONOMIC CRISIS? > > OUR VIEW IT IS THAT IS THAT IT IS ONLY A POLITICAL CRISIS BUT COULD BECOME A DEBT OR ECONOMIC CRISIS BUT FOR THE MOMENT IT IS ONLY A POLITICAL CRISIS. THE SPREAD OF THE FRENCH DEBT AGAINST GERMANY HAS WIDENED BY ONLY 10 BASIS POINTS, SO IT'S REACHED A LEVEL THAN IT WAS LAST YEAR DURING THE PREVIOUS CRISIS WHEN THE PM WAS OUSTED DURING A CONFIDENCE BOAT. SO WE THINK THE MARKET IS CURRENTLY PRICING IN ONLY A POLITICAL CRISIS AND HIS RIGHT TO TO DO SO BECAUSE THE FISCAL ISSUES FOR FRANCE ARE NOT SHORT-TERM. AND THE DEBT SERVICING COSTS WILL RISE A LOT AND THAT WILL BE THE MAIN ISSUE FOR THIS GOVERNMENT AND THE GOVERNMENT THAT COMES TO CONSOLIDATE THEIR FINANCES AND CURB THE DEFICIT. IT WILL NOT BE EASY WITH A FRAGMENTED PARLIAMENT AND THAT'S ONE OF THE REASONS WHY THE CURRENT GOVERNMENT WILL FALL. SO THAT IS THE MAIN ISSUE. THAT IS THE FISCAL PATH AND THE ECONOMIC IMPLICATIONS OF THIS CRISIS ARE MAINLY THE INCREASING UNCERTAINTY WEIGHING ON DOMESTIC DEMAND. THAT IS SOMETHING WE ALREADY FACE IN FRANCE IF YOU LOOK AT HOW HOUSEHOLDS ARE SAVING. AND THAT IS ONE OF THE REASONS BECAUSE THEY ARE FACING A LOT OF UNCERTAINTY. AND MOVING AWAY FROM THE RECOVERY, ESPECIALLY NEXT YEAR. THAT IS THE MAIN ISSUE BECAUSE WE WERE EXPECTING FRANCE TO REBOUND. FRANCE BENEFITS FROM EASING FINANCIAL CONDITIONS FROM THE ECB BUT IF IT IS FROM A LESS EXPOSED ECONOMY TO U.S. TARIFFS AND THAT POLITICAL CRISIS COULD BE A DOWNSIDE RISK TO THAT POTENTIAL REBOUND OF THE FRENCH ECONOMY. > > SO 77 BASIS POINTS IS WHERE WE LEFT THE SPREAD BUT WE HAVE SEEN THIS MORE GLOBAL SELLOFF AND LONG-TERM MATURITIES. IS THAT SET TO CONTINUE IN YOUR ANALYSIS? FOCUSING ON THE 30 YEAR SEGMENT OF THE SOVEREIGN'S MARKET, THE RISKS ARE CONSOLIDATED ON THE LONG END, NOT ON THE 10 YEAR. THE 10 YEAR POINT WOULD BE THE MOST IMPORTANT PART OF THE CURVE TO WATCH, ESPECIALLY BECAUSE IT'S A MASSIVE ISSUE IN THE EURO ZONE AND AN ISSUE THAT HAS ATTACHED TO THE LONG END OF THE CURVE. ALL THAT TO SAY THAT THE 30 YEAR SELLOFF IS A BIG DEAL FROM A FISCAL PERSPECTIVE IN FRANCE ESPECIALLY BUT ALSO THE U.K. IN JAPAN. AND WHEN WE ANALYZE THE DRIVERS OUR UNDERSTANDING IS THERE ARE A LOT OF COMMON GLOBAL DRIVERS BEHIND THE MOVE AND ONLY SOME RESIDUAL DOMESTIC DRIVERS LIKE THE POLITICAL CRISIS IN FRANCE. IF YOU LOOK AT THE COMMON DRIVERS IT IS BASIC. HIGHER DEFICITS, CENTRAL BANKS DOING QT, A SHIFT IN INVESTOR PREFERENCES BUT ALSO SOME MARKET TECHNICALITIES. SO IT IS NOT A SPECIFIC CRISIS BUT SOMETHING GLOBAL. WE THINK GIVEN THE SELLOFF WE HAVE SEEN IT MIGHT STOP AT THE CURRENT LEVELS THAT WE ARE SEEING. BUT THE MAIN RISK WOULD BE THAT SUCH SELLOFFS LEAD TO A FINANCIAL CRISIS. THAT WOULD BE THE MAIN RISK. IT'S A FINANCIAL RISK REMINISCENT OF WHAT WE HAVE SEEN WITH THE CRISIS IN THE U.K.. AND JUST ONE WORD TO FINISH ON THAT TOPIC AS WE THINK THAT MARKETS SHOULD GET USED TO IT BECAUSE IN OUR VIEW THE VOLATILITY WILL INCREASE IN THE FUTURE AND THE NATIONAL INTEREST RATE WILL INCREASE. SO SUCH EVENTS ON THE LONG END COULD BECOME MORE FREQUENT. > > JAMIE RUSH WAS MAKING THIS VERY ARGUMENT YESTERDAY MORNING. AND I RECOMMEND A LOOK AT THAT ECONOMIC POLICY UNCERTAINTY INDEX FROM BLOOMBERG ECONOMICS. LET'S STAY IN EUROPE AND TURNED TO THE GEOPOLITICS. EUROPEAN LEADERS PLEDGING TO PROVIDE SECURITY GUARANTEES IF A CEASE-FIRE CAN TAKE HOLD. FRANCE SAYS THAT 26 COUNTRIES ARE READY TO CONTRIBUTE, INCLUDING TROOPS, WHILE THE U.S. SUPPORT FOR THE MEASURES WILL BE FINALIZED IN THE COMING DAYS. > > THIS COALITION OF THE WILLING , WHICH IS A COALITION FOR PEACE, AS INDEED PUT ON THE TABLE AND CLARIFIED WITH A MILITARY AND POLITICAL COMMITMENT IN ORDER TO PROVIDE THESE GUARANTEES OF PEACE AND SECURITY TO UKRAINE. > > PRESENCE CAN BE DIFFERENT. IT IS IN THE SKY, THE SEA AND ON LAND. WE ARE ALSO DISCUSSING A MATTER I BELIEVE WE WILL DISCUSS MORE. IT IS THE BACKSTOP OF AMERICA. WE COUNT ON IT. WE ARE GRATEFUL TO AMERICA FOR SUPPORTING AND BEING PART OF THE SECURITY GUARANTEES FOR UKRAINE. > > OLIVER CROOK'S BEEN WATCHING THAT MEETING FOR US. GOOD MORNING. DELIBERATELY VAGUE ON THE REASSURANCE FORCE. WHAT DO WE KNOW ABOUT WHO WILL COMMIT TO WHAT AND WHEN? > > WE DON'T KNOW A LOT OF THE ANSWER. IT IS VAGUE AND PARTIALLY DELIBERATELY BUT PARTIALLY BECAUSE THIS IS A TRICKY POLITICAL THING TO WORK OUT DOMESTICALLY. BUT WE DID GET CLARITY ON WHAT IS INTENDED. THIS COALITION OF THE WILLING HAS TWO MAIN PILLARS MICRON OUTLINED. THE FIRST IS THE PRINCIPAL THERE SHOULD BE NO LIMIT TO CAPACITY OR FORMAT TO THE UKRAINIAN ARMY. THEY EFFECTIVELY WANT TO DEMILITARIZED UKRAINE IN THE EVENT OF A PEACE DEAL BUT BASICALLY A COMMITMENT TO REGENERATE THE MILITARY. THE SECOND PART AND THE THING THAT GETS THE MOST ATTENTION IS THIS REASSURANCE FORCE. WHAT WE GOT YESTERDAY IS THERE'S NOW A FIRM COMMITMENT OF 26 OF THOSE 35 NATIONS TO COMMIT TROOPS IN SOME CAPACITY AS A PEACEKEEPING FORCE IN UKRAINE THE DAY AFTER. THEY WILL NOT BE FRONTLINE TROOPS. THIS IS NOT ABOUT ANTAGONIZING RUSSIA HE MADE CLEAR. THEY WILL BE ABOUT DETERRING RUSSIA. AND OF COURSE THERE WAS ALSO THAT TRUMP CALL IT WAS A CRUCIAL PART OF THE MEETINGS AND DISCUSSION. WHEN HE HAS SAID IS THE U.S. POSITION IS NOT CLARIFIED. WE DON'T KNOW TO WHAT DEGREE THEY ARE WILLING TO SUPPORT THE SECURITY GUARANTEES. WE HAVE REPORTED IN THE PAST THAT THE U.S. SUPPORT CAN TAKE THE FORM OF INTELLIGENCE AND POTENTIALLY AIR SUPPORT. IT WILL CERTAINLY NOT INVOLVE TROOPS AND POTENTIALLY ALSO EQUIPMENT AND HARDWARE. A COUPLE FOOTNOTES ABOUT ALL THESE COMMITMENTS, THE FIRST BEING THAT THERE'S A QUESTION ABOUT MONEY IN POLITICS. WE HAVE KEIR STARMER AND EMMANUEL MACRON SPEARHEADING THE COALITION. THESE ARE WEAK GOVERNMENTS THEY DON'T HAVE A LOT OF SWAY AT HOME OR MONEY. THE LAST POINT IS ALL THIS PLANNING IS FOR THE DAY AFTER. WE ARE STILL VERY MUCH IN THE DAY OF THE WAR. THERE'S NOT BEEN ANY INDICATION WE ARE GETTING CLOSER AS FAR AS VLADIMIR PUTIN IS CONCERNED TO A CEASE-FIRE OR INDEED A PEACE DEAL. > > THANK YOU. WE HAVE BROUGHT YOU ONE CENTRAL BANK INTERVIEW AND HAVE ANOTHER. DAN MARX SAYS IT IS TO CUT ITS ECONOMIC OUTLOOK FOR 2025 SUBSTANTIALLY BECAUSE OF THE WEAKER SALES GROWTH AT NOVO NORDISK. WE SAT DOWN WITH BLOOMBERG AT THE BANK'S HQ IN COPENHAGEN FOR ANOTHER EXCLUSIVE INTERVIEW. > > THIS WILL IMPACT THE ECONOMY BUT THERE'S A COUPLE OF ELEMENTS TO THIS TO TAKE INTO ACCOUNT. FIRST, PHARMACEUTICALS. THERE ARE NOT SO MANY EMPLOYED BY ED. THERE'S ALSO A LOT OF RESEARCH AND DEVELOPMENT. COMPARED TO OTHER SECTORS. NOT SO MANY EMPLOYED IN COMPANIES DELIVERING STUFF TO THE PHARMACEUTICAL COMPANIES. SO THE EMPLOYMENT EFFECTS ARE NOT THAT LARGE AND OVERALL THE EMPLOYEE A LITTLE BIT MORE THAN 1% OF THE WORKFORCE. SEVEN A MACROECONOMIC SENSE IT IS NOT MUCH BUT IT WILL BE IMPORTANT FOR THE PEOPLE INVOLVED THAT A MACROECONOMIC TERMS WE ARE NOT THAT CONCERNED. THERE'S ALSO THIS QUESTION ABOUT WHERE ARE THINGS ACTUALLY PRODUCED. AND WE PRODUCE A LOT OF OUR PRODUCTS ABROAD, MOSTLY IN THE U.S. SO THAT MEANS THE IMPACT ON THE MARKET WILL BE LESS BUT STILL WE ARE TALKING ABOUT SLOWER GROWTH THAN BEFORE . > > IN MARCH, THE DANISH CENTRAL BANK FORECASTED THAT THE ECONOMY WOULD GROW 3.6% THIS YEAR. YOU ARE DO TO PUBLISH NEW FORECASTS LATER THIS MONTH. DO YOU EXPECT HE WILL HAVE TO CUT YOUR FORECAST? > > YES. WE WILL REDUCE OUR GROWTH FORECAST SEPTEMBER 20 OVER 25. THIS IS DUE TO TWO THINGS. AND PROBABLY WE WILL REDUCE IT QUITE SIGNIFICANTLY. THE MINISTRY OF ECONOMICS REDUCED IT FROM 3.5% TO 1.4% BUT THERE ARE TWO DIFFERENT ASPECTS. WHERE THEY ARE GOING FORWARD. BUT THEN THERE'S ALSO OTHER FACTORS. WE WILL HAVE TO PUT IT DOWN. BUT THAT DOES NOT REALLY IMPACTING'S GOING FORWARD. IT WILL BE THE EFFECTS OF TARIFFS AS WE TALKED ABOUT BEFORE. AND THEY WILL BE IN EFFECT FROM THE NOVO NORDISK LOW. IT WOULD PROBABLY BE IN THE U.S.. BUT STILL REDUCED BUT IT'S NOT -- IT IS NOT A COMPLETELY DIFFERENT GROWTH PRINT AS THE NUMBERS MIGHT INDICATE . > > THAT WAS CHRISTIAN THOMPSON SPEAKING TO US ON THE CENTRALITY OF NOVO NORDISK TO THE DANISH ECONOMY. BLOOMBERG IS HOSTING A LIVE Q & A ON NOVO NORDISK THIS AFTERNOON. THE BLOCKBUSTER SUCCESS OF OZEMPIC HAVING MADE THEM SEEM IN -- SEEM UNSTOPPABLE AT ONE POINT BUT NOW FACING A HOST OF CHALLENGES. OUR REPORTERS WILL BE ANSWERING YOUR QUESTIONS THIS AFTERNOON. HEAD TO BLOOMBERG.COM FOR THAT. AND WE HAVE BREAKING LINES OUT OF ALL STEAD. THEY SAY THEY ARE SEEING THAT 24 TO 27 BILLION KRONER. THE ESTIMATE WAS DIFFERENT. BUT PRETTY MUCH IN LINE. THEY SEE THEY SEE A PRIMARY DRIVER FOR THE CUT BEING LOW OFFSHORE WIND SPEEDS AND SEAT FOR YEAR GROSS INVESTMENTS BETWEEN 50 AND 54 BILLION AND AC THEY ARE ADJUSTING THEIR GUIDANCE FOR 2025. OF COURSE WE KNOW THEY ARE SUING THE U.S. GOVERNMENT AS THEY TRY TO REVIVE THE BUILDING OF ITS OFFSHORE WIND FARM IN NEW ENGLAND. IT'S BEEN BLOCKED BY THE ADMINISTRATION DESPITE BEING ABOUT 80% COMPLETE EARED SO DIFFICULTIES FOR THE STOCK AS YOU CAN SEE THERE. AND THE OIL MARKET REMAINS ON EDGE AS INVESTORS LOOK AHEAD TO THE OPEC LESS MEETING THIS WEEK. THE DETAILS NEXT. THIS IS BLOOMBERG. ♪ > > WELCOME BACK. WE HAVE OIL TRADERS ON EDGE AS THEY AWAIT THE OPEC-PLUS MEETING OVER THE WEEKEND THAT COULD SEE THE GROUP SIGN OFF ON ANOTHER SUPPLY HIKE. LET'S BRING IN JOUMANNA BERCETCHE FOR MORE FROM DUBAI. YOU ARE PLUGGED INTO THIS MARKET AND SPEAK TO THE ANALYSTS. WHAT CAN WE EXPECT? > > MAYBE LET'S START WITH THE CONTEXT. IT HAS NOT BEEN A GREAT YEAR FOR OIL IN TERMS OF PRICE PERFORMANCE. OIL FUTURES DOWN 10% YEAR TO DATE AND OF COURSE THE GREEN MULTIPLE FACTORS. YOU HAVE MACRO UNCERTAINTIES PERTAINING TO THE ECONOMIC OUTLOOK, THE EFFECT THAT TARIFFS ARE GOING TO HAVE ON GLOBAL DEMAND, SOME CONCERNS AS THEY PERTAIN TO DEMAND. YOU ALSO HAD SUPPLY HEADWINDS AS WELL WITH OPEC-PLUS SURPRISING THE MARKET EARLIER THIS YEAR WITH THAT ACCELERATED PUT BACK OF THE 2.2 MILLION BARRELS PER DAY CUTS. THEY HAVE COMPLETED THAT FIRST TRANSIENT. THE FINAL CLIP WAS ANNOUNCED BACK IN AUGUST SO ATTENTION NOW SHIFT TO THIS OTHER TRANSIENTLY ALSO INTRODUCED IN 2023 THAT IS 1.6 6 MILLION BARRELS PER DAY THEY ALSO TOOK OFF THE MARKET. OUR OWN BLOOMBERG TEAM HAS SURVEYED A BUNCH OF ANALYSTS. 17 ARE NOT EXPECTING A CHANGE VIS-À-VIS THIS EXTRA SUPPLY THAT COULD BE PUT BACK BUT SIX ARE EXPECTING A MODEST INCREASE. THEREIN COULD CREATE ISSUES WHEN IT COMES TO THE SUPPLY OUTLOOK VERSUS DEMAND. MANY ANALYSTS ARE ANTICIPATING A SUPPLY GLUT NEXT YEAR. GOLDMAN SACHS PUT OUT A NOTE SAYING THE EXPECT AN OVERHANG OF 1.8 MILLION BARRELS A DAY BY THE END OF 2026. IF THAT HAPPENS IT WOULD PUT EVEN MORE DOWNWARD PRESSURE ON THE PRICE OF OIL. THEY ARE FORECASTING WE SHOULD END UP IN THE LOW 50'S RANGE. WE SPOKE TO CITY EARLIER ON IN HORIZONS. UBS IS MORE SANGUINE. THEY SEE OIL BEING RANGE BOUND BETWEEN 60 AND $70 BECAUSE OF THE INVENTORY OUTLOOK WHICH REMAINS PRETTY MUTED COMPARED TO HOW MUCH SUPPLY HAD BEEN ANTICIPATED. THE SECOND THING IS THE FACT THAT OPEC-PLUS ARE SITTING ON LITTLE SPARE CAPACITY. BUT ALL EYES ON THIS WEEKEND. > > INDEED AND WE ARE STUCK IN THAT RANGE. THANK YOU TO JOUMANNA BERCETCHE. WE HAVE PLENTY MORE STILL TO COME. THIS IS BLOOMBERG. ♪ > > I AM NOT EXPECTING THERE TO BE SOME KIND OF LONGER-TERM PERSISTENT INFLATION EFFECTS. THE REASON I SAY THAT IS BECAUSE IN MY VIEW WE WILL DO OUR BEST TO GET MONETARY POLICY RIGHT. SO WE HAVE TO DO OUR PART TO KEEP THE ECONOMY ON TRACK. AND THEN LET THE TARIFFS JUST KIND OF PASS THROUGH. > > JOHN WILLIAMS SPEAKING THERE. JUST LOOK AT HOW TREASURIES HAVE BEEN DEFYING THE GLOBAL SELLOFF WE ARE SEEING IN YOUR BOND SPACE THIS WEEK. THE WHITE LINE IS THE U.S.. YOU CAN SEE THE OTHER MAJOR ECONOMIES ARE HIGHER. AND THIS IS A DOWNTREND BACK SINCE APRIL. SO DEFYING THAT GLOBAL PRESSURE. A LITTLE WOBBLE BUT GETTING BACK ON ITS FEET AS WE LOOK AHEAD TO THAT JOBS DATA. AND FLIP THE BOARD BECAUSE WE ARE WAITING FOR THE BOND VIGILANTES BUT AT THE MOMENT YOU HAVE THE 30 YEAR DEFENDING THAT 5% LEVEL IN THE 10 YEAR DEFENDING THE 4.3% LEVEL. BUT THE FIGHT OVER THE FED CHAIR AND ALL OF THE OTHER GOVERNORS REALLY JUST DEVELOPING SO COULD THESE LEVELS REMAIN DEFENDED? WE SHALL SEE. OF COURSE, THE HIGHLIGHT TODAY IS THE JOBS DATA. FOCUS ON NONFARM PAYROLLS. LAST TIME 73,000. THIS TIME THE EXPECTATION IS 75,000. WILL HE A SURPRISE? COULD ANYTHING KNOCK THESE FED CUT EXPECTATIONS? IT SEEMS UNLIKELY. THE U.S. COMMERCE SECRETARY JOINING SURVEILLANCE AT 1:15 P.M. LONDON TIME. DON'T MISS THAT. THE OPENING TRADE NEXT.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "LABOR MARKET",
      "weight": 0.048703093
    },
    {
      "name": "ASIAN STOCK MARKETS",
      "weight": 0.048623297
    },
    {
      "name": "ASIAN MARKETS",
      "weight": 0.048379365
    },
    {
      "name": "MARKETS",
      "weight": 0.046711247
    },
    {
      "name": "LAST YEAR",
      "weight": 0.045605343
    },
    {
      "name": "WEAK MARKET DATA",
      "weight": 0.045114093
    },
    {
      "name": "NEXT YEAR",
      "weight": 0.044625197
    },
    {
      "name": "MORE SIGNS",
      "weight": 0.043671187
    },
    {
      "name": "U.S. TARIFFS",
      "weight": 0.042575635
    },
    {
      "name": "EXPECTED DATA",
      "weight": 0.041765474
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9892578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96435546875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8203125
    },
    {
      "name": "/Finance/Investing/Brokerages & Day Trading",
      "score": 0.384765625
    }
  ],
  "sentiment": {
    "positive": 0.15710163,
    "negative": 0.6026734,
    "neutral": 0.24022494
  },
  "summary": "The S & P 500 500 hits an all-time high, with expectations that the US will receive a Fed CUT in September, and there are signs of a cooling U.S. LABOR MARKET, and FUTIVE BETS on RATE CUTS. OpenAI has partnered with OpenAI to design and produce ACCELERATOR CHIPS. The company is providing a platform to develop these chips and create innovative designs and applications. The two-year Treasurry Yield is at its lowest point in about a year and the IMF is set to announce its participation in a biennial survey. Meanwhile, Asian markets are gaining after a Wall Street rally, with the soFT HIRING DATA Fuelling Bets on a CUT this month. If the PAYROLLS numbers deliver as expected, this could potentially push down U.K. Yields further downward as people price in response to a Fed cut, potentially pushing the U.N. YIELDS further further. The article also discusses the potential impact of this report on global politics.",
  "shortSummary": "The S & P 500 hits a record high, US stock markets hit record highs, and Fed bets on rate cuts are driving market sentiment as Asian markets rally.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "dac8d4e5565c44909def7e3d46b2015a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The S&P 500 reached a record high as signs of a cooling U.S. labor market strengthen expectations of a Fed rate cut. Broadcom surged after announcing a $10 billion partnership with OpenAI to design accelerator chips, positioning it to compete with Nvidia. Meanwhile, the French Prime Minister is holding last‑ditch meetings ahead of a confidence vote that could threaten the government’s stability.",
  "argos_id": "1FVHGG0VI"
}