{
  "url": "https://www.fastcompany.com/91398523/jobless-claims-rise-private-employers-slow-hiring-august",
  "authorsByline": "Reuters",
  "articleId": "4baab174996e4c368591608db4ee7e33",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/09/2025-09-04T142825Z_3_LYNXMPEL830M7_RTROPTP_4_USA-ECONOMY-RECOVERY-UNEMPLOYMEN.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T19:45:40+00:00",
  "addDate": "2025-09-04T20:01:27.627060+00:00",
  "refreshDate": "2025-09-04T20:01:27.627062+00:00",
  "score": 1.0,
  "title": "Jobless claims rise and private employers slow down hiring in August",
  "description": "The softening labor market likely positions the Federal Reserve to resume cutting interest rates later this month.",
  "content": "The reports were released a day after government data showed there were more unemployed people than positions available in July for the first time since the COVID-19 pandemic. Job growth has shifted into stall-speed, with economists blaming President Donald Trump’s sweeping import tariffs and an immigration crackdown that is hampering hiring at construction sites and restaurants. The slackening labor market likely positions the Federal Reserve to resume cutting interest rates later this month, though much would depend on August’s employment report to be published on Friday and consumer price data due next week. “We continue to see softness growing in the labor market as tariff policy uncertainty lingers, immigration changes take effect, and AI adoption grows,” said Eric Teal, chief investment officer at Comerica Wealth Management. “The silver lining is the weaker the jobs data, the more cover there is for stimulative interest rate cuts that are on the horizon.”\n\nInitial claims for state unemployment benefits rose 8,000 to a seasonally adjusted 237,000 for the week ended August 30, the Labor Department said. Economists polled by Reuters had forecast 230,000 claims for the latest week. Still, layoffs remain relatively low as businesses generally hoard workers following difficulties in finding labor during the pandemic, anchoring the labor market. The unsettled economic environment, stemming from the protectionist trade policy has, however, left businesses reluctant to increase headcount. That hesitancy to hire means people who are laid off have difficulty landing new opportunities. The number of people receiving benefits after an initial week of aid slipped 4,000 to 1.940 million during the week ending August 23, the claims report showed.\n\nThe Fed’s “Beige Book” report on Wednesday noted that “firms were hesitant to hire workers because of weaker demand or uncertainty.” The softening labor tone was reinforced on Thursday with the release of the ADP National Employment Report, which showed private employment increased by 54,000 jobs last month after advancing by 106,000 in July. The downbeat assessment of the labor market was also evident in the Institute for Supply Management survey, which showed a measure of services sector employment contracting for a third straight month in August. Economists, as a result, are bracing for another month of tepid job growth when the Labor Department’s Bureau of Labor Statistics publishes its closely watched employment report on Friday. A Reuters survey of economists estimated nonfarm payrolls increased by 75,000 jobs last month after rising by 73,000 in July.\n\nEmployment gains averaged 35,000 jobs per month over the three months to July compared to 123,000 during the same period in 2024, the government reported in August. The unemployment rate is forecast to climb to 4.3% from 4.2% in July. Fed Chair Jerome Powell last month signaled a possible rate cut at the U.S. central bank’s September 16-17 policy meeting, acknowledging the rising labor market risks, but also added that inflation remained a threat. The Fed has kept its benchmark overnight interest rate in the 4.25%-4.50% range since December. Stocks on Wall Street were trading higher. The dollar rose against a basket of currencies. U.S. Treasury yields fell.\n\nTariffs continued to influence trade data. A separate report from the Commerce Department’s Bureau of Economic Analysis showed the trade deficit ballooned 32.5% to $78.3 billion in July amid record inflows of capital and other goods. The duties have caused wild swings in imports and ultimately the trade deficit, distorting the overall economic picture. A U.S. appeals court ruled last week that most of Trump’s duties, which have boosted the nation’s average tariff rate to the highest level since 1934, were illegal, creating more uncertainty for businesses. Imports soared 5.9% to $358.8 billion. Goods imports vaulted 6.9% to $283.3 billion. They were boosted by a $12.5 billion surge in imports of industrial supplies and materials, which reflected a $9.6 billion increase in non-monetary gold imports. But petroleum imports were the lowest since April 2021.\n\nCapital goods imports increased $4.7 billion to a record $96.2 billion, driven by computers, telecommunications equipment and other industrial machinery. Semiconductor imports declined $0.8 billion. Imports of consumer goods increased $1.3 billion, though pharmaceutical preparations imports fell $1.1 billion. Imports of motor vehicles, parts and engines decreased $1.4 billion. Exports rose 0.3% to $280.5 billion. Exports of goods edged up 0.1% to $179.4 billion. Capital goods exports increased $0.6 billion to a record $59.9 billion, lifted by shipments of computer accessories and civilian aircraft. Exports of excavating machinery fell $1.5 billion. Exports of motor vehicles, parts and engines increased $0.3 billion. Industrial supplies and materials exports decreased $0.2 billion as finished metal shapes dropped $2.5 billion. Non-monetary gold exports increased $2.9 billion.\n\nThe goods trade deficit widened 21.2% to $103.9 billion. The goods trade deficit with China increased $5.3 billion to $14.7 billion. Imports of services increased $1.7 billion to a record $75.5 billion in July, reflecting rises in transport, travel and other business services. Exports of services increased $0.6 billion to a record high of $101.0 billion, driven by the transport, charges for the use of intellectual property as well as government goods and services. Travel services, however, dropped $0.3 billion amid the White House’s immigration crackdown. Trade subtracted a record 4.61 percentage points from GDP in the first quarter before sharply reversing and adding 4.95 percentage points in the second quarter, also the largest contribution on record.",
  "medium": "Article",
  "links": [
    "https://www.fastcompany.com/91397273/trump-ask-supreme-court-expedited-ruling-save-emergency-tariffs",
    "https://www.fastcompany.com/newsletters",
    "https://www.fastcompany.com/section/hiring",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://www.fastcompany.com/91391388/wall-street-dow-interest-rate-cuts",
    "https://www.mansueto.com/privacy-policy/",
    "https://www.fastcompany.com/91391901/fed-chair-jerome-powell-has-to-walk-a-fine-line-between-cutting-interest-rates-and-bowing-to-trump",
    "https://www.fastcompany.com/section/artificial-intelligence"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Goods imports",
      "weight": 0.07288563
    },
    {
      "name": "Capital goods imports",
      "weight": 0.07175476
    },
    {
      "name": "last month",
      "weight": 0.06736615
    },
    {
      "name": "trade data",
      "weight": 0.06365193
    },
    {
      "name": "Capital goods exports",
      "weight": 0.063630186
    },
    {
      "name": "interest rates",
      "weight": 0.06283097
    },
    {
      "name": "non-monetary gold imports",
      "weight": 0.062051848
    },
    {
      "name": "stimulative interest rate cuts",
      "weight": 0.061952487
    },
    {
      "name": "last week",
      "weight": 0.061282482
    },
    {
      "name": "Imports",
      "weight": 0.060875434
    }
  ],
  "topics": [
    {
      "name": "Unemployment"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.94921875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.80126953125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.732421875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.529296875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.427734375
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.406982421875
    },
    {
      "name": "/Jobs & Education/Jobs/Other",
      "score": 0.39013671875
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.35693359375
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.34033203125
    }
  ],
  "sentiment": {
    "positive": 0.0677444,
    "negative": 0.8411623,
    "neutral": 0.0910933
  },
  "summary": "Unemployment claims rose by 8,000 to a seasonally adjusted 237,000 for the week ended August 30, according to the Labor Department. This is the first time since the COVID-19 pandemic that there were more unemployed people than available positions in July. Economists attribute this growth to President Donald Trump's import tariffs and an immigration crackdown that is hindering hiring at construction sites and restaurants. The Federal Reserve is expected to resume reducing interest rates later in the month. The ADP National Employment Report showed private employment increased by 54,000 jobs last month after advancing by 106,000 in July, while the Department of Labor Statistics predicted another month of tepid job growth. The trade deficit ballooned 32.5% to $78.3 billion in July due to record inflows of capital and other goods. Tariffs continue to influence trade data, with imports soaring by 5.9% and goods imports rising by 6.9%. Economists predict that the unemployment rate will rise to 4.3% from 4.2% in August.",
  "shortSummary": "Job growth slowed as unemployment rose and employers slowed down, with the Federal Reserve expected to consider interest rate cuts due to economic uncertainties and trade tariffs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a74d649bbd2b466c981ef65db6dc9d84",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Jobless claims rose in late August, reflecting a slowdown in private hiring amid tariff uncertainty, immigration restrictions, and AI adoption. The labor market’s softness may prompt the Federal Reserve to resume rate cuts at its September meeting, though inflation remains a concern. Trade data shows a widening U.S. goods deficit, driven by high tariffs and a surge in capital goods imports, adding further uncertainty for businesses.",
  "argos_id": "1OCR5PYHL"
}