{
  "url": "https://www.bloomberg.com/news/videos/2025-09-02/bloomberg-brief-9-2-2025-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "050e1820d31e4d74b6f7c2d74672ff5e",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iO.ey3D5hZQ8/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T10:44:01.657000+00:00",
  "addDate": "2025-09-02T12:12:24.430087+00:00",
  "refreshDate": "2025-09-02T12:12:24.430091+00:00",
  "score": 1.0,
  "title": "Inflation Risks; Trump Says India Offered to Cut its Tariffs to 'Nothing'",
  "description": "US equity futures and Treasuries decline as Wall Street return from a long weekend to a week packed with jobs data. President Trump said India has offered to cut its tariff rates on US goods following his imposition of 50% levies as punishment for India's purchases of Russian oil. Valantin Marinov of Credit Agricole says the US economy is likely to be more resilient than consensus, which would disappoint the Fed. Amy Wu Silverman of RBC Capital Markets believes some investors have been taken aback by the stock rally, and have had to roll back the timeframe of when the \"reckoning\" in the market will come. (Source: Bloomberg)",
  "content": "♪ > > 5:00 IN NEW YORK CITY, HERE'S WHAT YOU NEED TO KNOW. MOMENTUM COOLING-OFF. STOCKS AND BONDS RETREAT AS WALL STREET RETURNS FROM A LONG WEEKEND. GOLD HIT A RECORD HIGH. THAT'S AHEAD OF A BIG WEEK OF JOBS DATA AND OF COURSE, NONFARM PAYROLLS REPORT ALL ON DECK THIS WEEK. LET'S TAKE A LOOK AT WHERE WE STAND AS WE KICK OFF A NEW MONTH, THE MONTH OF SEPTEMBER. WE DID HIT A RECORD FOR THE S & P THURSDAY. WE DO SEEM TO BE SETTING UP FOR A LOWER OPEN TODAY, AT LEAST IN THE EARLY GOING. NOT SO MUCH WITH YIELDS. SEEING ALMOST FIVE BASIS POINT IN YIELDS. I WANT TO POINT TO THE DOLLAR INDEX AS WELL, AND LITTLE STRONGER TODAY. WE HAVE WEAKER EURO, WEAKER STERLING AS WELL. VERY INTERESTING MOVING GOLD, BUT IT HAD A RECORD EARLIER ON AND WE WANT TO KEEP OUR EYES ON CRUDE OIL AS WELL, GASOLINE ENDED NATURAL GAS AS WE SEE PUTIN, XI, AND INDIA'S MODI MEETING. SIMPLE LUMINARY AUGUST CONSUMER PRICE REPORTING FOR THE EURO AREA RISING 2.1%, THAT WAS THE ESTIMATE UP FROM THE PREVIOUS MONTH. PRELIMINARY PRICING COMING UP 2.1%. MAYBE JUST A TOUCH WEAKER AS WE SEE THE MONTH OVER MONTH PRICE RISE TO PERCENT IN THE YEAR-OVER-YEAR PRICE RISE 2.1%. LET'S GET OVER TO LONDON NOW FOR SOME STOCKS TO WATCH. > > THIS START WITH NVIDIA BECAUSE THIS CAN BE BLAMED FOR A LOT OF THE ADVERSE PRICE REACTION ON FRIDAY AND IT IS FALLING AGAIN FOR A ROW. DOWN NEARLY 1.5% IN PREMARKET TRADE, TALKING ABOUT HOW ALIBABA IS DEVELOPING A CHIP TO COMPETE WITH NVIDIA'S H20 IN HIN -- CHINA. TESLA, A BIT OF A DISAPPOINTMENT. TESLA SHARES DOWN SEVEN TENS OF 1% ON THE BACK OF THAT DISAPPOINTING SALES FIGURE IN INDIA. LASTLY, I WANT TO HEAD OVER TO EUROPE. NESTLE SHARES ARE FALLING THIS MORNING. THEY WERE DOWN AT LEAST 4% AT THE OPEN. THEY'VE PARED THAT LO ALLS ON THE BACK OF THE COS, . -- DUE TO THE CO BEING OUSTED. VONNIE: LATER, WE WILL SPEAK WITH CO AMY WU SILVERMAN. A SLEW OF DATA COMING, JOBLESS CLAIMS ON THURSDAY AND THE PAYROLLS REPORT FRIDAY. HE FOR THE FED RATE EXPECTATIONS AND THE U.S. DOLLAR OUTLOOK COULD BE THE UNEMPLOYMENT RATE, ASSUMING THAT THE UNEMPLOYMENT RATE COMES TO HISTORIC LOWS AND THE HEADLINE PRINT DOES NOT SUPPORT, WE THINK THAT MANY FED-RELATED NEGATIVES ARE IN THE PRICE OF THE U.S. DOLLAR BY NOW. IN SOME WAYS, IT'S AN OPTIMISTIC WAY OF LOOKING AT THINGS. WHAT MAKES YOU SAY THAT THE LOANS MIGHT BE IN FOR THE DOLLAR? > > I BELIEVE THAT A LOT OF FED- RELATED NEGATIVES ARE INDEED IN THE PRICE OF THE DOLLAR IN THE LABOR MARKET DATA COULD PLAY A KEY ROLE IN THAT. THE MARKETS MAY WANT TO FOCUS ON THE HEADLINE PRINT. THE UNEMPLOYMENT OR INDEED, HOW TIGHT THE LABOR MARKET IN THE U.S. REMAINS. THE CUTS THAT THE MARKETS ARE PRICING IN FROM THIS YEAR FROM THE FED IS FEELING DOVISH. IT IS LIKELY TO PROVE MORE RESILIENT THAN CONSENSUS IS EXPECTING. DOVISH EXPECTATIONS THAT THE MARKET HAS AT THE MOMENT SO WITH THAT IN MIND, A LOT OF NEGATIVE IS ALREADY IN THE PRICE OF THE DOLLAR. THE DOLLAR SHOULD START RECOVERING IN LATE 2020 FIVE, EARLY 2026. VONNIE: YOU SAY THAT THERE MIGHT BE A LEVEL THAT WOULD KEEP THE UNEMPLOYMENT RATE UNCHANGED. WHAT MIGHT THAT BE? > > IT IS BETWEEN 50 K AND 100 K. CLEARLY THE MARKET CONSENSUS HAS ADJUSTED TO THAT AND THAT KIND OF HIGHLIGHTS THE BAR FOR DISAPPOINTMENT. AS I WAS HIGHLIGHTING COME THE FED IS LOOKING AT THE EXTENT OF TIGHTNESS IN THE LABOR MARKET RATHER THAN THE LABOR DEMAND OR SUPPLY IN ISOLATION. SO FROM THAT POINT OF VIEW I THINK WHERE THE MARKET SEES THE FED GOING FROM HERE IS ESSENTIALLY AS DOVISH AS IT WILL GET THIS YEAR. THE DATA HAS TO BE READY WEEK, SOMETHING CLOSER TO KNOW DROP CREATION AT ALL TO RELEASE OF RATES MARKETS READJUSTING. VONNIE: IS THE DOLLAR EXPRESSING AND THE KIND OF VIEW RIGHT NOW? MOST IF NOT ALL OF THE FED NEGATIVES ARE PRICED IN, BUT WE ARE STILL WAITING ON A COURT RULING ABOUT WHETHER PRESIDENT TRUMP CAN FIRE LISA COOK. > > BY ALL MEANS, HAVE TO SAY THAT THE U.S. DATA OR THE QUALITY THEREOF IS REALLY ONE OF THE MANY DRIVERS AT THE MOMENT. AS YOU RIGHTLY SAID, THE ATTACKS ON FED INDEPENDENCE REPRESENT AN IMPORTANT DRIVER IN AND OF ITSELF. THOSE YIELDS HAVE BEEN SLIPPING OF LATE AND THAT COULD EXPLAIN SOME OF THE DOLLAR WEAKNESS. THEN AGAIN, WE REMAIN OF THE VIEW THAT DESPITE TRUMP'S ATTACKS, THE INSTITUTIONAL FRAMEWORK BACKING THE THAT IS STILL QUITE SOLID SO ANY INTERFERENCE IN THE ONGOING OR THE FUTURE FED DECISION COULD BE KEPT IN CHECK BY THAT. THE CONCLUSION WE DRAW ON THE BACK OF THAT IS WE SEE A LOT OF NEGATIVES ALREADY IN THE PRICE FROM THAT POINT OF VIEW. CLEARLY THERE ARE RISKS IN CLEARLY A POTENTIAL FURTHER ESCALATION OF THOSE ATTACKS ON FED INDEPENDENCE ARE ONE OF THE KEY DOWNSIDE RISKS TO THE CURRENT DOLLAR VIEW. VONNIE: WE DID GET THAT PRINT JUST A FEW MOMENTS AGO THAT INFLATION DID TICK UP THAT SLIGHT BIT. DOES THAT IN YOUR VIEW MAKE ANOTHER CUT ANYMORE LIKELY? > > IN COMPARISON TO THE FED, THE ECB OUTLOOK IS CONSIDERABLY MORE BORING. WE THINK THE ECB IS DONE CUTTING RATES AND TODAY'S DATA IS CONFIRMING THAT. WITH RESPECT TO THE PRICE ACTION I THINK ON THE DAY IT'S QUITE INTERESTING BECAUSE ACTUALLY, DIFFERENT DATA IS DRIVING THE PRICE ACTION TODAY. IT'S REALLY THE BOND VIGILANTES IN THE DEVELOPED MARKET THAT ARE DRIVING THE PRICE ACTION. WE SEE THE SELLOFF AT THE LONG END OF THE JAPANESE, U.K., AND EUROPEAN EARLY BOND MARKETS INTENSIFYING AND GOING BACK TO THE EURO, EUROPE HAS A PROBLEM AND THAT PROBLEM IS FRANCE. WE HAVE THAT VOTE OF CONFIDENCE ON MONDAY WHICH COULD RESULT IN THE COLLAPSE OF THE GOVERNMENT THAT COULD BE ALSO FOLLOWED BY NEW ELECTIONS, AND WE THEREFORE THINK THAT WITH RESPECT TO THE EURO, YES, THE ECB OUTLOOK, INFLATION AND ALL OF THAT MAY PLAY A ROLE BUT RIGHT NOW FOR US, THE POLITICAL OUTLOOK AND FRANCE DOES NOT BODE WELL FOR THE EURO IN THE NEAR TERM. VONNIE: YOU SAY THE BOND VIGILANTES ARE DRIVING PRICE ACTION. IS IT PRETTY ORDERLY, WOULD YOU BE EXPECTING PERHAPS SOME RUPTURES IN THE MARKETS? > > I GUESS YOU ARE REFERRING TO A MOMENT IN THE GILT MARKET POTENTIALLY. THESE EVENTS ARE DIFFICULT TO PREDICT. WHAT IS WORRYING IS TO ANSWER YOUR QUESTION, THE MOVES SO FAR HAVE BEEN FAIRLY CONTAINED IN COMPARISON TO THOSE EPISODES IN THE PAST. WHAT IS WORRYING IS THE TRAJECTORY. THIS NO BACKING DOWN OF LONG-TERM YIELDS, THAT PINS THE CONCERN THAT THE TRAJECTORY OF MANY FISCAL POLICIES IN THE DEVELOPED WORLD INCLUDING EUROPE AND THE U.S. IS NOT SUSTAINABLE. THAT IN MIND, I GUESS ULTIMATELY THE QUESTION THAT IS ON EVERYONE'S MIND IN THE FX MARKET IS WHICH ECONOMY CAN AFFORD TO REALLY MAINTAIN THAT SEEMINGLY UNSUSTAINABLE TRAJECTORY, AND I'M AFRAID TO SAY THAT'S NOT EUROPE, THAT'S NOT JAPAN. THE ONLY COUNTRY THAT COMES TO MIND THAT WILL STILL BE ABLE TO SELL ITS DEBT TO FOREIGNERS EVEN DESPITE SUSTAINABILITY CONCERNS WILL BE THE U.S. SO FROM THAT POINT OF VIEW I THINK IT'S QUITE JUSTIFIED THAT THE DOLLAR HAS EMERGED AS ONE OF THE BETTER PERFORMING CURRENCIES ON THE DAY, BECAUSE EVEN IF FISCAL TRAJECTORY REMAINS UNSUSTAINABLE, WHAT REALLY MATTERS ULTIMATELY IS THE GROWTH OUTLOOK AND THE U.S. IS LIKELY TO CONTINUE TO DELIVER MORE GROWTH THAN ANYONE ELSE IN G10, IN OUR VIEW. VONNIE: THANK YOU SO MUCH FOR JOINING US THIS MORNING. NOW TO OTHER TOP STORIES TRENDING THIS MORNING. U.K. 30 YEAR BOND YIELDS ROSE TO THE HIGHEST SINCE 1998, PUTTING FURTHER PRESSURE TO REGAIN MARKET CONFIDENCE. WE WERE JUST SPEAKING ABOUT THIS AHEAD OF AN AUTUMN BUDGET WHERE RITUAL REACHES UNDER PRESSURE TO FIND SAVINGS OR RAISE TAXES TO IMPROVE THE U.K. U.K.'S FISCAL POSITION. RUSSIA'S GAS PUMP SAYS IT SIGNED AN AGREEMENT TO BUILD A LONG ANTICIPATED AREA TO CHINA VIA MONGOLIA. BEIJING HAS YET TO CONFIRM THE AGREEMENT. DISCUSSIONS AROUND THE PROJECT HAVE BEEN STALLED FOR YEARS AND AN AGREEMENT WILL BE SEEN BY THE KREMLIN AS A MAJOR POLITICAL VICTORY. TESLA'S INDIA DEBUT UNDERWHELM'S ACCORDING TO SOURCES. TESLA RECEIVED ORDERS FOR MORE THAN 600 CARS SINCE IT ENTERED THE INDIAN MARKET IN MID JULY. BLOOMBERG HAD EARLIER REPORTED TESLA ORIGINALLY AIMED TO UTILIZE ITS 2.5 THOUSAND CAR ANNUAL QUOTA THIS YEAR. COMING UP, PRESIDENT TRUMP CLAIMS INDIA HAS OFFERED TO DROP THEIR TARIFFS ON U.S. GOODS TO ZERO. MEANTIME, PRIME MINISTER MODI IS IN CHINA WITH PUTIN, KIM, AND XI. MORE NEXT. THIS IS BLOOMBERG. ♪ VONNIE: THIS IS \"BLOOMBERG BRIEF.\" PRESIDENT TRUMP POSTING THAT INDIA OFFERED TO CUT TARIFFS ON U.S. GOODS TO ZERO. THE CURRENT TARIFF RATE ON INDIAN EXPORTS TO THE U.S. STANDS AT A STEEP 50%. OUR TEAM COVERAGE STARTS RIGHT NOW. SOUTH ASIA EDITOR, WHAT EXACTLY HAS TRUMP BEEN CLAIMING THAT INDIA IS IN FACT OFFERING. > > TRUMP POSTED YESTERDAY THAT INDIA HAS OFFERED TO PUT TARIFFS TO ZERO. AND THEN TRUMP REITERATED THE CONCERN THAT HE HAD EXPRESSED ABOUT INDIA BEFORE, SPECIFICALLY THAT INDIA HAS VERY HIGH TARIFFS ON U.S. GOODS WHILE AT THE SAME TIME SELLING OUT INTO THE U.S.. TRUMP CALLED THE U.S. INDIA'S MAIN CUSTOMER, BUT HE ALSO COMPLAINED ABOUT INDIA'S PURCHASING OF RUSSIAN OIL. HE'S CONCERNED THAT THIS MONEY FLOWING INTO RUSSIA HELPS THE UKRAINE WAR, BUT ALSO TRUMP WOULD LIKE INDIA TO BUY MORE OIL AND MILITARY EQUIPMENT FROM THE U.S. VONNIE: AS WE KNOW, BY MINISTER MODI AND THE RUSSIAN PRESIDENT ARE ACTUALLY MEETING. WHATEVER HEARING FROM INDIA'S SIDE REGARDING U.S. TRADE TALKS AND WHETHER THIS OFFER IS EVEN LIKELY TO BE TRUE? > > THERE'S BEEN NO OFFICIAL COMMENT ON DONALD TRUMP TRUTH SOCIAL POST THAT HE POSTED ON MONDAY, BUT WE DID HEAR FROM THE INDIAN COMMERCE MINISTER JUST A WHILE AGO WHERE HE SAID THAT THE TALKS BETWEEN INDIA AND THE U.S. ON TRADE AND A BILATERAL TRADE PACT ARE STILL GOING ON, IT'S KIND OF GOES TO SHOW THAT THE DOOR FOR RESOLVING THE TALKS OR FOR RESOLVING THE IMPASSE IS STILL OPEN. IN FACT, THIS IS COMING AT A TIME WHEN THE U.S. PRESIDENT AND THE U.S. ADMINISTRATION HAS DOUBLED DOWN ON THE TARIFFS AS WELL AS DOUBLED DOWN ON HITTING VARIOUS TOP INDIAN PILLARS AS WELL, THE FACT THAT THE INDIAN GOVERNMENT -- SAYING THAT THE TALKS ARE STILL UNDERWAY SHOWS THAT WHILE THE TRADE TALKS MAY HAVE HIT A STUMBLING BLOCK, THE INFORMAL TALKS ESPECIALLY AT THE LEVEL OF THE FOREIGN MINISTRY IS STILL GOING ON. THAT IS THE SENSE THAT WE HAVE ON THIS ISSUE SO FAR. SO FAR, FIVE ROUNDS OF TALKS HAVE ALREADY HAPPENED. THE SIXTH ROUND OF TALKS THAT WAS SUPPOSED TO HAPPEN HAS BEEN STALLED, THERE IS NO CLARITY ON ANY NEXT DAY FOR IT, BUT IT DOES LOOK LIKE THEY WILL BE SOME SORT OF RESOLUTION TO THIS ISSUE IN THE NEXT FEW WEEKS. VONNIE: BLOOMBERG ALSO REPORTING THAT BRAZILIAN PRESIDENT LULA IS EXPECTED TO HOLD A VIRTUAL MEETING WITH LEADERS ABOUT TRADE NEXT WEEK, WHAT DO WE KNOW ABOUT THAT? > > HE HAS MADE VERY CLEAR THAT HE DOESN'T WANT THIS VIRTUAL SUMMIT TO BE AN ANTI-U.S. SUMMIT OF SORTS, INDIA HAD A VERY SUCCESSFUL MEETING WITH BOTH THE CHINESE PRESIDENT XI JINPING AS WELL AS THE RUSSIAN PRESIDENT VLADIMIR PUTIN AS WELL. THIS MEETING IS GOING TO BE AN IMPORTANT ONE TO WATCH OUT FOR AND COMING IN IN THE AFTERMATH OF HEAVY TARIFFS ON COUNTRIES LIKE INDIA AND BRAZIL, BOTH OF WHICH ARE FACING 50% TARIFFS. THIS ONE IS GOING TO BE AN IMPORTANT MEETING TO WATCH OUT FOR WHERE RUSSIA, INDIA, CHINA WILL BE GETTING TOGETHER TO REALLY CHART A WAY FORWARD AS TO WHAT THESE NATIONS CAN DO TO EMERGE UNSCATHED FROM DONALD TRUMP'S TARIFFS. VONNIE: WE WILL BE WATCHING IT VERY CLOSELY, AND OF COURSE, ALSO IN WASHINGTON. OVER IN CHINA, IS USUALLY PING AND VLADIMIR PUTIN HELD A BRIEF BILATERAL DURING A MAJOR MILITARY PARADE IN THE CAPITAL. PUTIN SPOKE OF THE NATION'S STRONG TIES. > > THE MEMORY OF BEING BROTHERS IN ARMS, TRUST, MUTUAL ASSISTANCE AND FIRMNESS IN DEFENDING COMMON INTEREST FORM THE BASIS OF THE COMPREHENSIVE PARTNERSHIP AND STRATEGIC OPERATION BETWEEN RUSSIA AND CHINA IN THE NEW ERA. WE WERE ALWAYS TOGETHER THEN, WE REMAIN TOGETHER NOW. > > REPORTS OUT OF KOREA THAT KIM JONG-UN HAS NOW ARRIVED IN BEIJING AS WELL. YOU WERE AT THE EVENT YESTERDAY. WHAT ARE THEY TRYING TO SIGNAL TO THE WEST THIS WEEK? > > IT'S GOING TO BE AN ICONIC IMAGE. THOSE THREE LEADERS SPENDING THE DAYS OF MAO ZEDONG IN TIANANMEN SQUARE, IT IS A SHOW OF UNITY TO REALLY CHALLENGE THE WESTERN- LEAD INTERNATIONAL ORDER AND PARTICULARLY FOR KIM JONG-UN BECAUSE IT IS HIS FIRST TRIP TO CHINA SINCE 2019 AND CERTAINLY ONE OF THE VERY RARE OPPORTUNITIES FOR HIM TO BE ON THE SAME STAGE WITH MANY OF THESE GLOBAL LEADERS. FOR PRESIDENT XI THERE 26 LEADERS GRACING THE BIG EVENT. KIM JONG-UN JUST TOURED A NEW MISSILE FACTORY IN NORTH KOREA HEAD OF THIS TRIP TO CHINA. HE UNVEILED THIS NEW PROGRAM FOR THE DEVELOPMENT OF ITS INTERCONTINENTAL BALLISTIC MISSILE AND REALLY IN DEFIANCE IN SOME WAYS OF THE U.S. AND SOUTH KOREA WHICH HAS BEEN PRESSURING THE COUNTRY TO END THE NUCLEAR PROGRAM, BUT THERE HE WILL BE TOMORROW SHOWING THE WORLD THAT HE HAS POWERFUL FRIENDS IN IMPORTANT PLACES BACKING HIM AND PUTIN OF COURSE SIGNING THE IMPORTANT DEAL WITH XI, GOING TO BUILD THIS NEW PIPELINE THAT WILL GO THROUGH MONGOLIA, INTO CHINA TO DIVERT A LOT OF THAT GAS PIPELINE SALE THAT IT USED TO SELL TO EUROPE, NOW TO CHINA. IT'S GOING TO BE AN IMPORTANT LIFELINE FOR A COUNTRY THAT IS SEEN A HUGE PROFIT LOSS AFTER THE UKRAINE WAR. VONNIE: PARTICULARLY IN A WEEK WHERE SCOTT BESSENT HAS SAID THEY ARE GOING TO BE LOOKING AT SANCTIONS THIS PARTICULAR WEEK. OTHER THAN THAT PIPELINE, WHAT TANGIBLE RESULTS OF COME OUT OF THIS MEETING, AS IF THAT WASN'T ENOUGH OF THE SECURITY BLOCK? > > WHEN IT COMES TO THE PUTIN-XI MEETING, THERE HAVE BEEN ABOUT 20 BILATERAL COOPERATION DOCUMENTS SPANNING MANY SECTORS FROM ARTIFICIAL INTELLIGENCE TO HEALTH TO EDUCATION TO SCIENTIFIC RESEARCH. CHINA IS ALSO AGREEING TO GRANT VISA-FREE ARRIVALS TO RUSSIAN TOURISTS ON A TRIAL BASIS, AND THAT IS EXPECTED TO BOOST TOURISM FOR BOTH COUNTRIES AS WELL AND AT THE SAME TIME, CHINA REALLY HIGHLIGHTED HOW IT IS GOING TO INCREASE LOANS AND INVESTMENTS TO SCO COUNTRIES. IT'S GOING TO CREATE THIS NEW DEVELOPMENT BANK AS WELL, SCO DEVELOPMENT BANK, AND THAT IS A BIG WIN BECAUSE IT DIDN'T REALLY GAIN TRACTION UNTIL NOW WHEN ALL THE MEMBERS COME TOGETHER AND FINALLY DECIDE ON THIS IDEA. VONNIE: NO DOUBT MORE TO COME WITH KIM JONG-UN AND NARENDRA MODI AS WELL. THANK YOU SO MUCH IN BEIJING. COMING UP, A WARNING FROM THE HEDGE FUND BILLIONAIRE WHO SOUNDS THE ALARM ON U.S. POLICIES AND WHAT ELSE IS MAKING HEADLINES IN YOUR FRONT-PAGE NEWS. THAT'S COMING UP NEXT. THIS IS BLOOMBERG. ♪ ♪ VONNIE: THIS IS \"BLOOMBERG BRIEF.\" TIME FOR YOUR FRONT-PAGE NEWS. FIRST UP, RAY DALIO WARNING PRESIDENT TRUMP AMERICA IS DRIFTING INTO 1930'S STYLE AUTOCRATIC POLITICS. HE SAID GAPS IN WEALTH, GAPS AND VALUES IN THE COLLAPSE OF TRUST WERE DRIVING MORE EXTREME POLICIES IN THE U.S. HIS COMMENT A RARE CRITICISM OF PRESIDENT TRUMP BY PROMINENT FINANCIAL FIGURE. NEXT UP ON THE WALL STREET JOURNAL, PRESIDENT TRUMP FACING A CHALLENGING SEPTEMBER BOTH AT HOME AND ABROAD. THE STORY LAYS OUT WHAT IS ON THE AGENDA INCLUDING NEGOTIATE WITH CONGRESS TO AVOID A SHUTDOWN AT THE END OF THE MONTH, AND UNCERTAINTY ABOUT THE LEGALITY OF HIS TARIFFS. TRUMP ALSO GAVE RUSSIA AND UKRAINE IN EARLY SEPTEMBER DEADLINE TO MOVE FORWARD WITH A PEACE PROCESS OR FACE POSSIBLE U.S. RETALIATION. END OF THE NEW YORK TIMES, EURASIAN LEADERS EAGERLY MEETING VLADIMIR PUTIN AT THE SUMMIT IN CHINA. PUTIN GLEEFULLY HOLDING HANDS WITH INDIA'S PRIME MINISTER MODI. RUSSIAN PRIME EDITOR PUTIN ALSO MEETING WITH LEADERS FROM IRAN, TURKEY, AND VIETNAM. THIS IS BLOOMBERG. VONNIE: IT IS 5:30 IN NEW YORK CITY. HERE IS WHAT YOU NEED TO KNOW. MOMENTUM COOLING, STOCKS AND BONDS RETREATING AS WALL STREET RETURNS. GOLD IS A RECORD. A BIG WEEK OF JOBS DATA, AND PRESIDENT TRUMP SAID INDIA HAS OFFERED TO CUT THE TARIFF RATES ON U.S. GOODS TO \"NOTHING.\" LET'S TAKE A LOOK AT MARKETS. SHAPING UP TO BE A FASCINATING DAY. A NEW SOVEREIGN RISK WASHING OVER ECONOMIES AND CNET IN U.S. YIELD AS WELL WITH THE 30 YEAR ALMOST HITTING 5% TODAY. THE 10 YEAR YIELD UP FIVE BASIS POINTS AT 4.2 EIGHT. DOWN FOR S & P FUTURES. WE HAD A RECORD THURSDAY AND THEN TRADERS COMING BACK TO START A NEW MONTH. WE WILL SEE A FREE -- IF WE REMAIN LOWER. THE DOLLAR INDEX STRONGER TODAY AND THAT IS PARTIALLY THANKS TO THE FIXED INCOME MOVES. LET'S SEE WHERE WE ARE WITH COMMODITIES. AGAIN SINGLE AT THE RECORDS. A LOT PLAYING IN HERE. ALSO CITING THE POSSIBLE WORSENING JOBS REPORT AND CRUDE WTI HIGHER. LET'S GET TO STOCKS TO WATCH. IN LONDON. > > NVIDIA, THE WEAKNESS THAT KICKED OFF THE EQUITY MOVE ON FRIDAY IS CONTINUING FOR THIS STOCK IN THE RED FOR A SECOND SESSION IN A ROW, DOWN MORE THAN 1%. THERE IS NO REAL CATALYST FOR THIS WEAKNESS BUT PERHAPS THE MARKET RETHINKING CHINA'S OWN HOMEGROWN CHIP CAPABILITIES AFTER THE WALL STREET JOURNAL REPORT ON FRIDAY. MOVING TO TESLA, ANOTHER MAG SEVEN STUCK IN THE RED OF OF THE BACK OF SOME DISAPPOINTING DEBUT SALES NUMBERS IN THE INDIA MARKET, TRYING TO BREAK INTO BUT FACING STIFF COMPETITION FROM THE LIKES OF CHINA BYD. TESLA DOWN .4%. LET'S END ON THE EUROPEAN STOCK, THIS IS NESTLE, THE CEO HAS BEEN OUSTED DUE TO A RELATIONSHIP WITH A COLLEAGUE. THE STOCK THANK AND NOW IN THE RED DOWN .9 PERCENT AS THIS MARKS MORE INSTABILITY FOR IT LEADERSHIP AT NESTLE. VONNIE: THANK YOU SO MUCH. RBCS AMY WU SILVERMAN LOOKING AT THE STOCK MARKET AS INVESTORS COME FOR POSSIBLY THE WORST MONTH. IT REMAINS QUITE REASONABLE AS WELL AS IN THE FIXED INCOME ETF PROXIES. I AM PLEASED TO SAY AMY JOINS US NOW. SHE IS HEAD OF DERIVATIVES STRATEGY AT RBC. UP UNTIL NOW, REMAIN QUITE REASONABLE. DOES THAT CHANGE TODAY GIVEN WHAT WE ARE SEEING IN EUROPEAN FIXED INCOME MARKETS AND ALSO IN THE U.S.? AMY: GOOD MORNING. WE ARE SEEING IT TICK UP AND IT IS NOT TOO SURPRISING IF IT IS TAKE EVERYTHING, HEADLINES AND WHATNOT OFF OF THE TABLE, WE ARE JUST GOING INTO A SEASONALLY WEAKER PART OF THE YEAR WHERE YOU TYPICALLY SEE THE VIX HIGHER AND SPOT RETURNS LOWER COULD I DON'T NECESSARILY THINK THIS YEAR IS ANY DIFFERENT. INVESTORS KNOW THAT. THEY ARE POSITIONING BUT I THINK THIS ASSESSMENT A STORY THIS YEAR WERE THE UPSIDE AND DOWNSIDE HAVE BOTH MEANT RISKS FOR INVESTORS DEPENDING ON IF YOU NEED TO CATCH UP FOR PROTECT YOURSELF. VONNIE: WHAT WILL WE SEE GETTING CHRIST IN TODAY GIVEN THAT SEPTEMBER IS TRADITIONALLY NOT A GREAT MONTH BUT IN HIS TRADITION EVER HELPED US OUT IN THE MARKETS? AMY: TRUE. IT IS WHAT I WOULD SAY IS INVESTORS WILL PROBABLY LOOK FOR IS FROM THE SLEW OF QUITE IMPORTANT DATA POINTS YOU MENTIONED EARLIER AND WE ARE IN A FRAMEWORK WHERE THE MARKET IS EXPECTING SOMETHING FOR SEPTEMBER AND I THINK THE DATA POINTS WE GET THIS WEEK ARE EITHER GOING TO CEMENT THAT OR MAYBE THEY TOSS IT BACK UP INTO THE AIR BUT WHEN YOU LOOK AT THE STRADDLES COME UP WITH THE MAGNITUDE IS PRICING, THAT HAS NOT CHANGED TOO MUCH FROM A WEEK AGO AND WE WILL SEE IF THAT CHANGES AS YOU GET MORE FOLKS IN THEIR SEATS AND REPRICING AS THE DATA COMES IN. VONNIE: YOU TALKED ABOUT THE PADDLING DUCK ANALOGY WHICH WE USE QUITE OFTEN WHERE THINGS SEEM COMMENT ON THE SURFACE BUT PADDLING GOING ON UNDERNEATH AND THAT IS WHAT YOU WERE SAYING IT HAD BEEN PERHAPS GOING ON. WHERE ARE YOU SEEING IT MOST PARTICULARLY RIGHT NOW? AMY: I DO LOVE THE ANALOGY AND I KEEP HAVING TO BRING IT BACK BECAUSE I THINK IT IS SO SYMBOLIC OF WHAT YOU SEE NOT ONLY IN TERMS OF S & P VERSUS THE ROTATIONS UNDERNEATH BUT FOR US SPECIFICALLY THE SPREAD YOU SEE BETWEEN INDEX VOLATILITY, SO SOMETHING LIKE A HEADLINE VIX NUMBER NOT BEING ALL THAT HEIGHT AND YOUR YOU GET FOUR OR FIVE STANDARD DEVIATION MOVES EITHER IN SINGLE STOCK VOLATILITY OR SOMETHING LIKE GROWTH FACTOR IN MOMENTUM VERSUS SMALL TECH VALUE. I THINK ONE OF THE THINGS INVESTORS HAVE BEEN LOOKING FOR FOR A LONG TIME IS THE HUGE CONCENTRATION WE SEE IN THE MARKET SHOULD BROADEN OUT, SO WHETHER THAT WILL BE THE LINING TRADE OR WHETHER WILL BE LARGE CAPS STAY IN THE SUN OR SMALL CAPS WILL HAVE A DAY IN THE SUN. THAT IS REALLY WHAT THEY ARE LOOKING FOR THIS YEAR AS WE HEAD INTO SEPTEMBER BECAUSE RATE SENSITIVITY PLAYS A LOT INTO THESE FACTORS. VONNIE: WHAT WILL YOU BE LOOKING AT IN ORDER TO DECIDE WHETHER THE MOVES WE ARE SEEING TO KICK OFF THE MONTH ARE JUST JITTERS OR SOMETHING DEEPER THAT COULD HAVE A WIDER RAMIFICATIONS FOR THE MARKET? AMY: MAYBE JUST TO REMIND IT BACK TO LIBERATION DAY. ONE THING WE HAD NOTICED POST-LIBERATION DATE WAS THAT EQUITIES WAS STICKY. ALL IT MEANS IS THERE HAD ALREADY BEEN DEMAND FOR HEDGES DURING THE SPECIFIC TIME PERIOD, EVEN AS FAR BACK AS LIBERATION DAY AND THE QUESTION IS NOW THAT WE HAVE ACTUALLY ROLLED INTO THE TIMEFRAME, DOES THIS REMAIN STICKY? OR FLOW THE MARKET WENT OUT AGAIN BY BLOWING THROUGH AT THE HIGHS AT THAT WE HAVE SEEN OVER AND OVER AGAIN? IT HAS BEEN SOME INVESTORS WHO HAVE BEEN TAKEN ABACK BY THE RALLY WE HAVE HAD AN BEEN UNDER POSITIONS AND STILL BELIEVE THAT THERE IS A RECKONING BUT I THINK IT IS A MATTER OF TIME BEFORE IT HAPPENS AND THEY HAVE TO KEEP WILLING THAT TIMEFRAME FORWARD. VONNIE: WE ARE STILL EXTREMELY CLOSE, THE VIX IS ABOVE 17 FOR THAT IS NOT AN INDICATION OF PANIC OR ANYTHING LIKE THAT. HOW MUCH OF THE CONCERN AROUND FED INDEPENDENCE WHICH DOES SEEM TO BE GETTING AS WE WORK -- AWAIT COURT CASE DECISIONS, MORE FRONT AND FROM ZURICH. , IS THAT PRICED INTO OPTIONS TRADING AT THE MOMENT? AMY: -- HOW MUCH HAS THIS BEEN PRICED IN THE OPTIONS TRADING AT THE MOMENT? AMY: OBVIOUSLY A LITTLE TEMPERAMENT DURING POWELL FOOT ON THE FLIP THE FED PLACED IN THE POSSIBILITY WHEN THERE WAS THE TRIAL BALLOON FLOATED FROM TRUMP THAT HE COULD POTENTIALLY FIRE POWELL BUT YOU TOOK THAT BACK WITH IN SOME WAYS THE COOK NEWS IS THE SAME. I REALLY WATCHED THE TARIFF DECISION AND HOW THAT GOES ON WITH THE COURTS BUT ALSO THIS FRIDAY THERE HAS BEEN TALK ABOUT POTENTIALLY NOT HAVING THE DATA EVERY WEEK AND I THINK IT IS A CONGLOMERATION OF ALL OF THE FACTS AND THAT IS OBVIOUSLY THE DIFFERENCE BUT I THINK YOU WILL GET MORE ANGST IF WE GET FILM TO SOCIAL POLLS AFTER THE DATA FRIDAY AND PLUS A POTENTIAL TRIAL ON THE TERRACE. VONNIE: IT JUST GOES ON AND ON. WE HAVE NONFARM PAYROLLS REPORT FRIDAY. WHAT WOULD CAUSE FLOWS TO SHIFT, LET'S SAY, IN THE MARKETS THAT YOU WATCH? AMY: IF WE GET A NUMBER, I THINK TWO THINGS. REVISIONS CAN'T MATTER AS MUCH AS THE NUMBER ITSELF. ANYTHING THAT HAPPENS ON THAT FRONT BUT SECONDLY IF YOU GET FOR THAT IS JUST REALLY MULTI-STANDARD DEVIATIONS OUT AND WHAT THAT MEANS FOR THE REST OF THE RATES CURVE. SEPTEMBER IS BEING PRICED IN BUT WHAT DOES THAT MEAN FOR FUTURE CUTS AND HOW DOES THAT IMPACT THE TRADES LIKE SMALL-CAP AND VALUE VERSUS LARGE-CAP AND GROWTH. VONNIE: THANK YOU SO MUCH TO -- FOUR JOINING US, JAY: --AMY WU SILVERMAN. BOND YIELDS RISING TO THE HIGHEST SINCE 1998 AND PUTTING PRESSURE ON KEIR STARMER TO REGAIN CONFIDENCE AHEAD OF AN AUTUMN BUDGET WHERE THERE IS PRESSURE TO FIND SAVINGS OR RAISE TAXES TO IMPROVE THE U.K. FISCAL POSITION. RUSSIA'S SIGNED AN AGREEMENT TO THE LONG-AWAITED GAS PIPELINE TO MONGOLIA. DISCUSSIONS AROUND THE PROJECT HAVE BEEN STALLED FOR YEARS AND AN AGREEMENT WILL BE SEEN AS A MAJOR POLITICAL WIN. TESLA'S INDIA DEBUT UNDERWHELMED SPARE THEY RECEIVED ORDERS FROM JUST MORE THAN 600 CAR SINCE IT ENTERED THE INDIAN MARKET MID JULY. IT WAS REPORTED THAT TESLA ORIGINALLY AIMED TO UTILIZE THE TWO AND HALF THOUSAND CAR ANNUAL QUOTA THIS YEAR. PRESIDENT TRUMP SAID INDIA HAS OFFERED TO LOWER TARIFF GOODS TO NOTHING. -- TARIFFS ON GOODS TO NOTHING. THIS IS BLOOMBERG. ♪ VONNIE: THIS IS BLOOMBERG BRIEF. PRESIDENT TRUMP TAKING IT TO SOCIAL PRESSURE INDIA AS NEGOTIATIONS CONTINUE. HE WRITES \"THEY HAVE NOW OFFERED TO CUT THEIR TARIFFS TO NOTHING BUT IT IS GETTING LATE COULD THEY SHOULD HAVE DONE SO YEARS AGO. THIS COMING AS INDIA IS FACING A 50% U.S. TARIFF. LET'S BRING IN BRENDAN. HAVE THEY SUGGESTED THEY WILL DROP TARIFFS TO ZERO. WE ARE HEARING FROM THE U.S. I BUT NOT MUCH FROM THE INDIA SIDE. BRENDAN: WE HAVE NOT HEARD ANY OFFICIAL CONFIRMATION FROM THE INDIAN SIDE WHAT WE HEARD THE TRADE MINISTER IN INDIA SAY THERE IS A DIALOGUE THAT IS CONTINUING TO GO BACK AND FORTH BETWEEN WASHINGTON AND NEW DELHI BUT THIS IS A LONG WAY FROM WHERE WE WERE JUST A COUPLE OF MONTHS AGO. INDIA IT WAS IN THE FRONT OF THE PACK TO GET A TRADE DEAL WITH THE U.S. AND THE TRUMP ADMINISTRATION. THEY WERE SOUNDING VERY CONFIDENT THEY WOULD GET THE BREAKTHROUGH THEY NEEDED AND WOULD COME IN PHASES, TWO OR THREE PHASES OF TALKS INTO THE FALL OF THE YEAR BUT THAT HAS ALL GONE AWAY AND WE HAVE HEARD THE TREASURY SECRETARY, SCOTT BESSENT TALK ABOUT INDIA'S RECALCITRANCE AND WE HAVE ARE THE WHITE HOUSE TRADE ADVISOR, PETER NAVARRO CRITICIZING THEM FOR BUYING RUSSIAN OIL AND CALLING IT MODI'S WAR PRETTY RHETORIC IS HEATING UP IS THAT IS NOT AN ENVIRONMENT WERE TRADE NEGOTIATORS WILL SIT DOWN AND MAKE PROGRESS. THE GOAL FOR THE TWO SIDES NOW IS TO COOL THE RHETORIC AND TRY TO GET BACK TO THE NEGOTIATING TABLE AND GET TO THE PROMISE THEY HAVE MADE IT SO FAR. VONNIE: WE WILL SEE ELITE PHOTOS OF PUTIN AND MODI SPEAKING GOES DOWN IN WASHINGTON. WHAT DOES THE COURT RULING ABOUT TARIFFS MEAN. I DON'T SCOTT BESSENT SAID HE WAS GOING TO WRITE A MEMO AND IT WILL GO TO THE SUPREME COURT. BRENDAN: FOR TRUMP, IT WAS STRAIGHT THREE BUT HE IS NOT OUT YET AND HAS A -- AN APPEAL TO THE SUPREME COURT WE DON'T KNOW WHETHER THAT WILL HAPPEN IMMEDIATELY. THE CASE IS EFFECTIVELY GOING TO GO TO EITHER THE SUPREME COURT WILL BE SENT DOWN TO THE LOWER COURTS TO NARROW ITS SCOPE. IN THE MEANTIME, THE TARIFFS STAY IN EFFECT. AMERICAN IMPORTERS ARE PAYING THOSE. YOU HEARD THE NATIONAL RETAIL FEDERATION SAY AFTER THE RULING LATE FRIDAY THAT THIS IS NOT RELIEF THEY ARE LOOKING FOR AND IT IS HURTING THEIR MEMBERSHIP, RETAILERS, EMERGENCE, SMALL BUSINESSES MAINLY THAT THE TARIFFS ARE GOING TO IMPOSE A LOT OF UNCERTAINTY OVER THE COMING MONTHS AND AS THIS PLAYS OUT IN COURT. IT IS NOT GOING TO BE RESOLVED ANYTIME SOON AND SO THINGS LIKE HIRING AND INVESTMENT PLANS JUST GET PUSHED OUT INTO THE FUTURE AND THE BIG IMPULSE THAT TRUMP WANTS TO SEE TO THE ECONOMY GETS PUSHED FURTHER OUT INTO THE FUTURE. VONNIE: THANK YOU VERY MUCH SCOTT BESSENT SAID IN AN INTERVIEW THAT PRESIDENT TRUMP IS WEIGHING DECLARING A NATIONAL HOUSING EMERGENCY. WE HAVE MORE FROM WASHINGTON, D.C. FROM THE COURT RULINGS ON TARIFFS AND THE POTENTIAL DECLARATION OF HOUSING EMERGENCY, WHAT DOES IT MEAN THAT THE TRUMP ADMINISTRATION IS TRYING TO DO GIVEN THAT WE ARE STARING DOWN THE BARREL OF A MIDTERM SEASON? > > IN NOVEMBER OF NEXT YEAR THAT WILL BE THE MIDTERMS WHERE THEY WILL GET THE NEW HOUSE OF REPRESENTATIVES. SO THE BALANCE OF HER IN CONGRESS IS IN PLAY AND THE TRUMP ADMINISTRATION IS TRYING TO DICTATE THE KEYS BY SPOT LYSING THE HOUSING MARKET, TARIFFS AND INTEREST RATES. SO THE TREASURY SECRETARY SURPRISED US YESTERDAY BY SAYING THE TRUMP ADMINISTRATION IS LOOKING AT SOME SORT OF EMERGENCY DECLARATION THAT WOULD MAKE THE HOUSING PRICES IMPROVE. THAT IS AN AREA WHERE THE TRUMP ADMINISTRATION COULD TO SCORE POINTS WITH VOTERS. VONNIE: THIS IS AN INTERVIEW WITH THE WASHINGTON EXAMINER AND WE DO NOT HAVE OTHER DETAILS. ON THE FEDERAL RESERVE, WHAT IS THE LATEST ON LISA COOK'S CASE AGAINST THE PRESIDENT. WHAT DO WE EXPECT TO HAPPEN? AND ALSO WITH THE FED PICK? > > WE EXPECT A LOT THIS WEEK. TODAY THERE WILL BE ANOTHER COURT HEARING FOR LISA COOK. LAST WEEK PRESIDENT TRUMP WAS TRYING TO FIRE HER AND SHE FILED A LAWSUIT SAYING THERE IS NOT ENOUGH OF A REASON TO REMOVE HER FROM THE FEDERAL RESERVE. IT SOUNDS LIKE A JUDGE ISN'T SURE WHETHER HE CAN RULE ON THIS AND ASK FOR MORE INFORMATION AND FUEL. MORE FROM LISA COOK'S LAWYER TODAY GOOD ON THURSDAY, CONGRESS IS BACK. THERE WILL BE A HEARING BEFORE THE SENATE PANEL. IT IS LIKELY TO HAPPEN BEFORE THE FED MEETING IN SEPTEMBER. VONNIE: A LOT TO KEEP AN EYE ON. THANK YOU. STRANGE PRIVATE CAPITAL, THE FINANCIAL TIMES IS REPORTING THAT APOLLO IS PLANNING TO LAUNCH A $5 BILLION SPORTS INVESTMENT VEHICLE. THIS COMES AS MORE AND MORE OF THE PRIVATE FIRMS HAVE BEEN PUSHING TO GET INTO THE SPORTS FINANCE SPACE. JOINING US IS PAUL DAVIES. YOU HAVE SEEN BLUE OWL, ARIES AND OTHERS GET INTO THE SPORT WHAT KIND OF RETURNS ARE THEY EXPECTING TO GET THERE AND THAT THESE AREN'T THE LEAST RISKY OF BETS? PAUL: YOU WILL SEE A LOT OF LENDING IN THESE THINGS AS WELL AS EQUITY OWNERSHIP OF FOOTBALL CLUBS AND THAT SORT OF THING. THE IMPORTANT THING IS THIS IS A SIGN OF THE MATURITY OF SPORTS FINANCE. IT HAS LONG BEEN AN INTERESTING ESOTERIC, PRIVATE AREA OF FINANCE BUT JUST THE SHEER SCALE OF THE AMOUNT OF REVENUE PASSING TO THE INDUSTRY. WE HAVE SEEN THE TRANSFER WINDOW IN ENGLISH FOOTBALL AND A RECORD 3 BILLION POUNDS OR $4 BILLION SPENT ON THE NEW PLAYERS. THAT IS A HUGE AMOUNT OF MONEY, OF MONEY, 50% VERSUS LAST YEAR. HE WILL SET THAT AGAINST THE REVENUE THE CLUBS ARE MAKING AND THE TOTAL INCOME FOR ENGLISH PREMIER LEAGUE FOOTBALL CLUBS LAST YEAR WAS 6.6 BILLION POUNDS ACCORDING TO THE FOOTBALL FINANCE PEOPLE AND THAT WILL RISE SIX POINT 9 BILLION POUNDS THIS COMING SEASON. JUST A SIGN OF THE HUGEST SCALE OF THE BUSINESS NOW. VONNIE: IT IS PHENOMENAL. THIS IS ALSO PERMANENT CAPITAL. IT IS REALLY QUITE SURPRISING IN MANY WAYS THAT PERMANENT CAPITAL WOULD BE ALLOCATED IN A PLACE WHERE IT WHAT IF YOU SEE A TEAM RELEGATED OR WHAT IT FANS SITE THEY ARE NOTHING TO SUPPORT THEIR TEAM AS MUCH. IT HAS BEEN A PLACE WHERE THEY HAVE AVOIDED IT LENDING FOR THOSE VERY REASONS. RIGHT IS A PRIVATE LENDER NOW THINK IT IS A GOOD IDEA TO ALLOCATE PERMANENT CAPITOL HILL QUESTION -- CATHETER -- CAPITAL HERE? PAUL: THE NUMBERS INVOLVED HAVE BEEN SMALLER. IT IS HARD TO MAKE LARGE SCALE PERMANENT FUNDS OUT OF THE SORT OF BUSINESS. THE OTHER SIDE OF IT, LOTS OF THESE SPORTS AND ESPECIALLY ENGLISH FOOTBALL, THERE IS MUCH MORE CERTAINTY OF REVENUE NOW, THE KIND OF INCOME THAT EVERYBODY GETS EVERY SEASON FROM MEDIA DEALS AND MERCHANDISING IS SO MUCH MORE THAN IT USED TO BE. THERE IS MORE A REAL ESTATE FOCUS TO WHAT A LOT OF TEAMS ARE DOING IN TERMS OF STADIUM REDEVELOPMENTS. YOU CAN SECURE A LOAN AGAINST PHYSICAL ASSETS AND HAVE PREDICTABLE REVENUE UPTAKE AGAINST THOSE ASSETS AND IT MAKES IT MUCH SAFER AND MORE INTERESTING LONG-TERM INVESTMENT FOR SOME OF THE FUNDS. VONNIE: IT IS REALLY FASCINATING. THAT IS PAUL DAVIES OF BLOOMBERG OPINION. COMING UP, A HOST OF DATA ON DECK THIS WEEK. THIS IS BLOOMBERG. ♪ VONNIE: LET'S TAKE A LOOK AT WHAT IS AHEAD THIS WEEK. PLENTY OF ECONOMIC DATA, THE LATEST PMI AT 10:00 EASTERN TIME. THEN A SLEW OF JOBS DATA COMING WITH JOBS WEDNESDAY, ADP, JOBLESS CLAIMS THURSDAY AND RUNNING ON THE WEEK WITH THE AUGUST PAYROLLS REPORT ON FRIDAY. LET'S GIVE SOME MICRO MOVERS. NVIDIA EXTENDING THE FRIDAY SLUMP AND LEADING YOU BEING -- LEAVING THE MAG 7 LOWER. MORGAN STANLEY CUTTING TO UNDERWEIGHT, THE PRICE TARGET SET AT $67 AND YOU CAN SEE THE MARKET IS NOT TAKING THAT WELL AND FREE MARKET IS DOWN 2.6 PERCENT. WATCHING ALIBABA AFTER THEY SEARCH IN HONG KONG ON AN AI AT REVENUE SURGE. LET'S GET TO MICRO MOVERS BECAUSE THE BOND VIGILANTES ARE AWAKE TODAY IT WOULD SEEM. YOU ARE SEEING IN YIELDS RISE IN IT EUROPE AND THE UNITED STATES HAVING AN IMPACT ON CURRENCY AND IF YOU LIKE TO TAKE A LOOK AT S & P FUTURES FOR THE FIRST TRADING DAY OF SEPTEMBER, POINTED LOWER AFTER A SELLOFF OF A FRIDAY. HOWEVER, IT COULD ALL CHANGE. THAT IS IT FOR BLOOMBERG BRIEF. SURVEILLANCE IS RIGHT AHEAD. THIS IS BLOOMBERG.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.05746391
    },
    {
      "name": "PRESIDENT TRUMP AMERICA",
      "weight": 0.05397396
    },
    {
      "name": "RATES MARKETS",
      "weight": 0.053272404
    },
    {
      "name": "U.S. TRADE",
      "weight": 0.051703796
    },
    {
      "name": "MARKET",
      "weight": 0.04854372
    },
    {
      "name": "MARKETS",
      "weight": 0.04854372
    },
    {
      "name": "MARKET CONFIDENCE",
      "weight": 0.048449665
    },
    {
      "name": "TRUMP",
      "weight": 0.04835355
    },
    {
      "name": "U.S. YIELD",
      "weight": 0.04788412
    },
    {
      "name": "DONALD TRUMP",
      "weight": 0.047670845
    }
  ],
  "topics": [
    {
      "name": "Inflation"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97998046875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.9677734375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.96044921875
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.72607421875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.4970703125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.40283203125
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.389404296875
    }
  ],
  "sentiment": {
    "positive": 0.032305524,
    "negative": 0.8397051,
    "neutral": 0.12798937
  },
  "summary": "The article discusses the recent \"momentum cooling-off\" as Wall Street Street returns from a long weekend, with gold hitting a record high. This comes ahead of a big week of JOBS data and non-farm payroLLS reports. The article also discusses the doLLAR INDEX, which is seen as a key indicator of inflation, and the potential for a weaker dollar. It discusses the declining value of the dollar, with the Eurozone consumer price index rising by 2.1%, and potential for an increase in pre-market inflation. Meanwhile, there are concerns about the potential impact of the Fed's expected future economic activity on the US dollar. In the article, we discuss the potential implications of inflation and the looming threat of China's proposed \"Modi Meeting\".",
  "shortSummary": "Despite a record high for gold, inflation risks, and volatile markets, with volatile markets set to rise as investors react with mixed signals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9b64ca984ddd4a43b6da27176ef95223",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "US equity futures and Treasury yields fell as markets awaited a busy jobs data week, while President Trump claimed India offered to cut its 50% tariffs on U.S. goods. The U.S. economy is seen as more resilient than consensus, potentially disappointing the Fed, and investors are reassessing the timing of a market reckoning. The narrative underscores trade tensions, fiscal policy concerns, and expectations for U.S. monetary outlook.",
  "argos_id": "3A7VM93AY"
}