{
  "url": "https://www.washingtontimes.com/news/2025/sep/2/xi-jinping-vladimir-putin-reaffirm-old-friend-ties-face-us-challenges/",
  "authorsByline": "Ken Moritsugu, The Washington Times https://www.washingtontimes.com",
  "articleId": "384ba90a8c4e4f83b2994c900f883b0c",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/09/02/China_Russia_05338_c0-209-5000-3125_s1200x700.jpg?a8bd3d48b2f8d33a07e13df86cfc59893ac9a4ad",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T16:00:57+00:00",
  "addDate": "2025-09-02T16:12:05.391387+00:00",
  "refreshDate": "2025-09-02T16:12:05.391389+00:00",
  "score": 1.0,
  "title": "Xi and Putin reaffirm ‘old friend’ ties in the face of U.S. challenges",
  "description": "Chinese leader Xi Jinping welcomed Russian President Vladimir Putin as an “old friend” as the two held a series of meetings Tuesday at a time when their countries face both overlapping and differing challenges from the United States.",
  "content": "BEIJING — Chinese leader Xi Jinping welcomed Russian President Vladimir Putin as an “old friend” as the two held a series of meetings Tuesday at a time when their countries face both overlapping and differing challenges from the United States.\n\nRelations between China and Russia have deepened in recent years, particularly following the Russian invasion of Ukraine in early 2022. U.S. President Donald Trump’s unorthodox approach to the war has added a twist to the relationship but doesn’t appear to have fundamentally changed it.\n\nPutin addressed Xi as “dear friend” and said that Moscow’s ties with Beijing are “at an unprecedentedly high level.”\n\nIn a sign of the importance China places on the relationship, their formal meeting was followed by tea with top aides at Zhongnanhai, the walled complex that is the center of power in China with residences and offices for its top leaders.\n\nChina announced after the talks that it would begin offering 30-day visa-free access to Russian travelers starting later this month.\n\nThe talks come the day after both attended a summit of the Shanghai Cooperation Organization in the nearby Chinese city of Tianjin, and the day before a grand Chinese military parade in Beijing to mark the 80th anniversary of the end of World War II.\n\nThe Soviet Union was neutral for much of the war in Asia, but provided assistance to China in earlier fighting against invading Japanese forces in the 1930s. It also declared war on Japan in the waning days of World War II and sent troops over the border into Japanese-occupied northeastern China.\n\n“We were always together then, we remain together now,” Putin said.\n\nChina says it is neutral in the Ukraine war but has provided an economic lifeline to Russia by continuing trade despite Western sanctions.\n\nA memorandum was signed to build another natural gas pipeline to China, Gazprom CEO Alexei Miller said in Beijing, according to Russia’s Interfax news agency.\n\nThe Russian state gas company also signed agreements with a Chinese state energy company to increase deliveries via existing routes, the news agency said.\n\nThe U.S. and the European Union have also put sanctions on Chinese companies that they say have abetted Russia’s military industry.\n\n“China and Russia face the same problem and must work together to jointly cope with the pressure from the U.S.,” said Li Xin, the director of the Institute of European and Asian Studies at Shanghai University of Political Science and Law.\n\nChina is also one of the main targets of Trump’s taxes on imports, though he has backed down from what was an escalating tariff war and his administration has begun negotiations with Beijing on a trade deal.\n\nThe summit of the 10-member Shanghai Cooperation Organization brought Xi and Putin together with Indian Prime Minister Narendra Modi, who held separate talks with both leaders on the sidelines of the Tianjin meeting.\n\nU.S. President Donald Trump’s steep tariffs on India and the tone coming from the White House have pushed New Delhi closer to China and Russia, though Modi will not attend China’s military parade.\n\nXi has tried to position China as a leader of countries that feel disadvantaged by the U.S.-dominated, post-World War II order.\n\nAt the Shanghai Cooperation summit and again in his meetings with Putin, he proposed an initiative to build “a more just and equitable global governance system.”\n\nChina doesn’t want to overturn the global order but change it so it better serves its interests, Li said.\n\n“China and Russia do not yet have the power to change the world order but they are constantly pushing for reforms that benefit them,” he said.\n\nPutin and Xi held a three-way meeting with Mongolian President Khurelsukh Ukhnaa ahead of their talks. His landlocked country of grasslands and mineral resources is sandwiched between the two giants.\n\nPutin said in opening remarks that the three countries are good neighbors, with a shared interest in developing ties.\n\nIn 2024, Putin made an official visit to Mongolia, where the government ignored calls to arrest him on an International Criminal Court warrant for alleged war crimes stemming from the invasion of Ukraine.\n\nAssociated Press writer Huizhong Wu and researcher Yu Bing contributed to this report.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "China",
      "weight": 0.080016926
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.075064614
    },
    {
      "name": "Chinese leader Xi Jinping",
      "weight": 0.06869164
    },
    {
      "name": "alleged war crimes",
      "weight": 0.0626014
    },
    {
      "name": "Vladimir Putin",
      "weight": 0.062185526
    },
    {
      "name": "Chinese companies",
      "weight": 0.060828887
    },
    {
      "name": "Putin",
      "weight": 0.060642082
    },
    {
      "name": "war",
      "weight": 0.060304742
    },
    {
      "name": "Shanghai Cooperation Organization",
      "weight": 0.058644533
    },
    {
      "name": "Russia",
      "weight": 0.057825737
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98828125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.96142578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9052734375
    },
    {
      "name": "/News/World News",
      "score": 0.8115234375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.7724609375
    }
  ],
  "sentiment": {
    "positive": 0.28324166,
    "negative": 0.3497407,
    "neutral": 0.3670176
  },
  "summary": "Chinese President Xi Jinping and Russian President Vladimir Putin have met to reaffirm their friendship despite challenges from the United States. The talks took place during a series of meetings, with China announcing it would offer 30-day visa-free access to Russian travelers starting later this month. Relations between China and Russia have deepened in recent years, particularly following the Russian invasion of Ukraine in 2022. Despite U.S. President Donald Trump's unconventional approach to the Ukraine war, the relationship has not significantly changed. The discussions follow a summit of the Shanghai Cooperation Organization in Tianjin and a grand Chinese military parade in Beijing to commemorate the 80th anniversary of World War II.",
  "shortSummary": "Chinese President Xi Jinping and Russian President Vladimir Putin discussed improving bilateral ties amid growing tensions with the United States, offering new visa-free access and energy deals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fefb851869214b058c5baba6431c6f18",
  "places": [
    {
      "osmId": "365351685",
      "suburb": "Xichang'anjie",
      "city": "Xicheng District",
      "state": "Beijing",
      "postcode": "100032",
      "country": "China",
      "countryCode": "cn",
      "coordinates": {
        "lat": 39.91359215,
        "lon": 116.37942684327462
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Chinese President Xi Jinping welcomed Russian President Vladimir Putin as an “old friend,” underscoring a deepening partnership amid U.S. pressure. The two leaders met during the Shanghai Cooperation Organization summit, after which China announced 30‑day visa‑free access for Russian travelers and signed agreements to expand natural gas pipelines to China. Both countries highlighted their shared challenges with the United States, citing economic ties and joint efforts to counter sanctions, while China positioned itself as a leader for nations seeking a more equitable global order.",
  "argos_id": "4E57LUI1Y"
}