{
  "url": "https://www.fastcompany.com/91398406/why-your-daily-coffee-is-suddenly-so-expensive",
  "authorsByline": "Anna-Louise Jackson",
  "articleId": "260d4b83b8204511889563c2556d7228",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/09/p-2-91398406-coffee-expensive.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-04T18:15:00+00:00",
  "addDate": "2025-09-04T18:28:56.133575+00:00",
  "refreshDate": "2025-09-04T18:28:56.133577+00:00",
  "score": 1.0,
  "title": "Why your daily coffee is suddenly so expensive",
  "description": "U.S. coffee prices jumped to $8.41 per pound in July, the sharpest rise in years.",
  "content": "Coffee futures, the global benchmark for arabica coffee, have risen more than 33% since July and nearly hit a four-month high in late August as traders have become concerned about the prospect of a slump in coffee supplies coming out of major markets like Brazil and Vietnam amid volatile weather in these regions. Conab, Brazil’s crop forecasting agency, this week slashed the estimate for its 2025 arabica coffee crop by nearly 5% and warned that U.S. tariffs could drive further price gains. The 50% tariffs that President Donald Trump imposed on Brazil took effect last month and put “upward pressure” on coffee prices, according to an August report from the International Coffee Organization. Those factors are likely to mean that consumers will have to pay even more to make coffee at home or buy a cup on the go. Ground coffee prices hit a record high of $8.41 per pound in July, up 33% from a year ago, according to the latest figures from the Bureau of Labor Statistics. After eggs, coffee experienced the second-highest inflation rate in any category of the consumer price index in July.\n\nThe J.M. Smucker Co., which owns Folgers and Café Bustelo, has raised coffee prices twice this year and is likely to do so again this winter as a result of Trump’s tariffs, according to reporting by The Wall Street Journal. Tariffs have become a new ingredient in a coffee market that’s been roiled by weather volatility in recent years. There have been severe droughts in both Brazil and Vietnam, and these two countries are the world’s top two coffee producers, according to Bernstein analysts. But there could be some reasons to be optimistic that coffee prices will start to stabilize. Rains in Brazil could allay some of the concerns about the impact of the drought in the South American country, while the outlook from Vietnam has also improved as the country has forecasted a higher crop output for this year.\n\nPrice pressures “should be easing off” in the near term, Danilo Gargiulo, a senior research analyst at Bernstein, told CNBC. Improving weather and capital investment to boost productivity signal lower prices ahead, while the impact of tariffs on Brazilian imports may be somewhat limited for consumers who buy coffee from the major chains, he added. Finally, there could be some hope for changes on the horizon in terms of Brazil-U.S. trade negotiations. Luiz Inácio Lula da Silva, Brazil’s president, is convening a virtual meeting of BRICS (Brazil, Russia, India, China, and South Africa) nations next week to discuss Trump’s trade policy, according to Bloomberg. The Brazilian president has repeatedly called on Trump to negotiate on trade after Trump imposed the second-highest tariffs on the nation in retaliation for its prosecution of former President Jair Bolsonaro. But Lula has also authorized a retaliation process against Trump’s tariffs, in an attempt to bring the U.S. president back to the negotiation table.",
  "medium": "Article",
  "links": [
    "https://www.fastcompany.com/section/brazil",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://www.fastcompany.com/newsletters",
    "https://www.fastcompany.com/section/trade",
    "https://www.wsj.com/business/retail/j-m-smucker-posts-loss-as-tariffs-raise-coffee-prices-84230c31",
    "https://www.fastcompany.com/section/tariffs",
    "https://www.fastcompany.com/section/productivity",
    "http://fastcompany.com/section/coffee",
    "https://www.fastcompany.com/section/vietnam",
    "https://www.fastcompany.com/section/smucker",
    "https://www.mansueto.com/privacy-policy/",
    "https://www.cnbc.com/2025/09/04/why-coffee-prices-are-so-high-and-where-theyre-headed-next.html",
    "https://fred.stlouisfed.org/graph/?g=1LvDo",
    "https://www.fastcompany.com/section/inflation",
    "https://www.ico.org/documents/cy2024-25/cmr-0825-e.pdf",
    "https://www.ice.com/products/15/Coffee-C-Futures",
    "https://www.bloomberg.com/news/articles/2025-09-01/brics-leaders-schedule-virtual-meeting-to-discuss-trump-tariffs"
  ],
  "labels": [
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "coffee prices",
      "weight": 0.121787
    },
    {
      "name": "Ground coffee prices",
      "weight": 0.113874726
    },
    {
      "name": "arabica coffee",
      "weight": 0.106164485
    },
    {
      "name": "coffee",
      "weight": 0.10352143
    },
    {
      "name": "coffee supplies",
      "weight": 0.102404915
    },
    {
      "name": "Coffee futures",
      "weight": 0.10125083
    },
    {
      "name": "Price pressures",
      "weight": 0.081587434
    },
    {
      "name": "U.S. tariffs",
      "weight": 0.08143928
    },
    {
      "name": "Brazil",
      "weight": 0.08139044
    },
    {
      "name": "lower prices",
      "weight": 0.079210296
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.8642578125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.59716796875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.525390625
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.48291015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.319580078125
    }
  ],
  "sentiment": {
    "positive": 0.5086278,
    "negative": 0.272881,
    "neutral": 0.21849123
  },
  "summary": "Coffee futures, the global benchmark for arabica coffee, have risen more than 33% since July due to concerns about a potential slump in coffee supplies from major markets like Brazil and Vietnam due to volatile weather. Brazil's crop forecasting agency, Conab, has reduced its estimate for its 2025 crop by nearly 5% and warned that U.S. tariffs could drive further price gains. The J.M. Smucker Co., which owns Folgers and Café Bustelo, has raised coffee prices twice this year and is expected to do so again this winter due to tariffs imposed by President Donald Trump. However, there are reasons to be optimistic that coffee prices will stabilize, with recent rainfall in Brazil and an improved outlook from Vietnam.",
  "shortSummary": "Coffee futures rose over 33% due to rising supplies and tariffs imposed on Brazil, but potential stabilizing conditions await future price increases.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7bf9c5b47b384be49f276a95cc88b022",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/09/04/why-coffee-prices-are-so-high-and-where-theyre-headed-next.html",
      "text": "Caffeine levels aren't the only things spiking for coffee drinkers lately.\nPrices for coffee have soared, fueled largely by volatile weather that's reduced crop harvests among major growers like Brazil and Vietnam, according to analysts.\nGround roast coffee prices in the U.S. hit $8.41 per pound in July, a record high and a 33% increase from a year ago, according to Bureau of Labor Statistics data.\nGlobal coffee prices are hovering near a 50-year high reached in February.\nU.S. prices for all coffee varieties (including roasted and instant coffee) were up 14.5% year-on-year in July — the second-highest annual inflation rate for any CPI category behind eggs, according to the consumer price index.\nPrice pressures \"should be easing off\" in the near term, said Danilo Gargiulo, a senior research analyst at Bernstein.\nBut 50% tariffs that the Trump administration levied on Brazil threaten to put \"upward pressure\" on coffee prices, according to an August report from the International Coffee Organization.\n'Precipitation whiplash' crimps supply\nLike all commodities, coffee prices are a function of supply and demand.\nWeather volatility is perhaps the \"most critical\" short-term factor underpinning coffee supply and prices, since coffee cultivation and yield are \"highly sensitive to its environment,\" according to a Bernstein report published in March.\nA severe drought during Brazil's last summer season \"devastated\" the harvest, Berstein analysts wrote.\nBrazil is the world's top coffee producer, supplying about 40% of the global volume, they wrote. The U.S., the world's largest coffee importer, sources the bulk of its supply (32%) from the South American nation, it said.\nVietnam, the world's No. 2 supplier, was hit by a drought that caused coffee production to fall by 20% in 2024, according to Bernstein.\nThat was followed by heavy rainstorms that also crimped production, said Mike Hoffmann, professor emeritus at Cornell University and lead author of \"Our Changing Menu: Climate Change and the Foods We Love and Need.\"\nThe dynamic — \"precipitation whiplash\" — reduces crop yield, he said.\n\"Your standard season isn't as it should be,\" Hoffmann said. \"Drought stresses the coffee plants, then you get way too much water, and it affects the quality and quantity of the bean, the berries.\"\nFurther, as coffee prices have risen, companies like Starbucks chose to draw down their existing coffee inventories instead of buying expensive beans on the open market, Gargiulo said.\nInventories came down \"significantly below historical levels\" in the last few years, Bernstein analysts wrote. While the market can weather a shortfall relatively well when inventories are high, low levels can lead to sharp price spikes if there's a new demand or supply shock, they wrote.\nHow prices might impact coffee drinkers\nConsumers may also feel higher coffee prices differently depending on whether they shop at the grocery store for coffee to prepare at home or consume it away from home, at restaurants or coffee chains, for example, Gargiulo said.\nCoffee prices in the grocery aisle tend to fluctuate more with the commodity cost, meaning they are generally more volatile, he said. Grocers may be quicker to raise store prices as coffee prices rise, and may offer promotions to consumers when coffee prices fall, he said.\nBut prices for food commodities like coffee generally move in cycles, and improving weather and capital investment to boost productivity signal lower prices are likely ahead, Gargiulo said.\nAdditionally, the Brazil tariff \"impact\" may be somewhat limited for consumers who buy from big coffee chains, Gargiulo said.\nHe estimates Starbucks would have to raise prices by 0.5% or less to recoup the full cost of Brazil tariffs, for example.\nMore from Personal Finance:\nWhy inflation is retirees' 'greatest enemy'\nStudent loan borrowers pausing payments have doubled since 2024\n68 jobs may qualify for Trump's $25,000 'no tax on tips' deduction\nOver the longer term, consumers should brace for higher-than-average prices, analysts said.\nExtreme weather that negatively impacts coffee harvests is expected to be more common, and coffee consumption worldwide continues to increase and bolster demand, they said.\n\"The prices will continue to go up, in my mind,\" Hoffmann said.\n\"Climate change isn't going away,\" he said. \"The severity of droughts, flooding, all of that will get worse. It's not just coffee — it's the whole food supply.\""
    },
    {
      "url": "https://www.ice.com/products/15/Coffee-C-Futures",
      "text": "- Trading Screen Product Name\n- Coffee \"C\" Futures\n- Trading Screen Hub Name\n- NYCC\n- Contract Symbol\nKC\n- Contract Size\n37,500 pounds\n- Price Quotation\nCents and hundredths of a cent up to two decimal places\n- Contract Series\nMarch, May, July, September, December\n- Minimum Price Fluctuation\n5/100 cent/lb., equivalent to $18.75 per contract.\n- Settlement\nPhysical delivery\n- Grade/Standards/Quality\nA Notice of Certification is issued based on testing the grade of the beans and by cup testing for flavor. The Exchange uses certain coffees to establish the \"basis\". Coffees judged better are at a premium; those judged inferior are at a discount.\n- Daily Price Limit\nNone\n- Deliverable Origins\nMexico, Salvador, Guatemala, Costa Rica, Nicaragua, Kenya, Papua\nNew Guinea, Panama, Tanzania, Uganda, Honduras, and Peru all at\npar, Colombia at 400 point premium, Burundi, Rwanda, Venezuela and\nIndia at 100 point discount, Dominican Republic and Ecuador at 400\npoint discount, and Brazil at 600 point discount.\nCommencing with the March 2026 expiry, Guatemala will be\ndeliverable at a 500 point premium, and Colombia, Costa Rica and\nKenya will be deliverable at a 1000 point premium.\n- Delivery Locations\nExchange licensed warehouse in the Ports of New York District,\nVirginia, New Orleans, Houston, Miami, Bremen/Hamburg, Antwerp and\nBarcelona.\nThe New York and Virginia delivery points are par; the New Orleans,\nMiami and Houston delivery points are at a discount of 0.50 cents\nper pound; and the Bremen/Hamburg, Antwerp and Barcelona delivery\npoints are at a discount of 1.25 cents per pound.\n- First Notice Day\nSeven business days prior to first business day of delivery month.\n- Last Trading Day\nOne business day prior to last notice day\n- Last Notice Day\nSeven business days prior to the last business day of the delivery month\n- Position Limit\n\"Position Limit and Position Accountability information for all IFUS products can be found\nhere.- Markers\nTAS (Trade at Settlement)\n- MIC Code\n- IFUS\n- Clearing Venues\n- ICUS"
    },
    {
      "url": "https://fred.stlouisfed.org/graph/?g=1LvDo",
      "text": "Source:\nU.S. Bureau of Labor Statistics\nRelease:\nAverage Price Data\nUnits:\nU.S. Dollars, Not Seasonally Adjusted\nFrequency:\nMonthly\nNotes:\nGround, regular caffeine content coffee sold in a can or plastic container, regardless of size.\nAverage consumer prices are calculated for household fuel, motor fuel, and food items from prices collected for the Consumer Price Index (CPI). Average prices are best used to measure the price level in a particular month, not to measure price change over time. It is more appropriate to use CPI index values for the particular item categories to measure price change.\nPrices, except for electricity, are collected monthly by BLS representatives in the 75 urban areas priced for the CPI. Electricity prices are collected for the BLS for the same 75 areas on a monthly basis by the Department of Energy using mail questionnaires. All fuel prices include applicable Federal, State, and local taxes; prices for natural gas and electricity also include fuel and purchased gas adjustments.\nFor more information, please visit the Bureau of Labor Statistics.\nSuggested Citation:\nU.S. Bureau of Labor Statistics,\nAverage Price: Coffee, 100%, Ground Roast, All Sizes (Cost per Pound/453.6 Grams) in U.S. City Average [APU0000717311],\nretrieved from FRED,\nFederal Reserve Bank of St. Louis;\nhttps://fred.stlouisfed.org/series/APU0000717311,\n."
    }
  ],
  "argos_summary": "Coffee futures have surged more than 33% since July, with ground coffee prices hitting a record $8.41 per pound in the U.S. The rally is fueled by droughts in Brazil and Vietnam, a 50% U.S. tariff on Brazilian coffee, and overall supply concerns. While improved weather in Brazil and a better outlook for Vietnam may ease pressure, the tariff remains a key driver of higher prices. The impact on consumers varies, with large chains likely absorbing most tariff costs, but grocery prices are expected to stay elevated for the near term.",
  "argos_id": "BMI4B633O"
}