{
  "url": "https://www.howtogeek.com/hbo-max-shows-weekend-binge-september-5/",
  "authorsByline": "Derek Malcolm",
  "articleId": "e7bcfd037fdc4e05a9287d12ab0c8439",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static0.howtogeekimages.com/wordpress/wp-content/uploads/2025/06/hbo-max-logo-with-several-popcorn-scattered-around.png?w=1600&h=900&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-05T05:01:15+00:00",
  "addDate": "2025-09-05T05:08:23.320717+00:00",
  "refreshDate": "2025-09-05T05:08:23.320719+00:00",
  "score": 1.0,
  "title": "3 HBO Max Shows to Devour This Weekend (September 5 - 7)",
  "description": "3 HBO Max shows you can get through in a single weekend binge.",
  "content": "Many of the greatest TV series of all time—from Oz to The Sopranos to Game of Thrones and beyond— were born on HBO Max (well, HBO). The renowned premium cable network-turned streaming service is still pumping them out, making it harder than ever to decide what to watch.\n\nIf you're looking for a show that you can get through in a single weekend, I've got three picks that you're bound to love.\n\nWith only a couple of weeks to go before they hand out the hardware at the 77th Emmy Awards, there's still time for you to binge season one of The Penguin, the second-most nominated show of the year, with a whopping 24 nominations. Two of those nods are well-earned by The Batman spinoff's two lead actors: Colin Farrell, who is chillingly unrecognizable as Oswald \"Oz\" Cobb, aka The Pengiun, and the brilliant Cristin Milioti as the deadly and underestimated crime boss, Sofia Falcone. The series is worth watching for their performances alone.\n\nThe story picks up where 2022's film The Batman left off, and follows Oz as his obsessive ambition to climb to the top has him dangerously playing both sides of the city's warring crime families, the Falcones and Maronis. But it's Sofia's ambition that Oz really has to worry about. Fresh out of Arkham Asylum, the traumatized daughter of Carmine is cunning, dangerous, a bit unhinged, and poses a serious threat to Oz's plans.\n\nMilioti chews up every scene she's in, which is no easy feat when sharing the screen with Farrell, who endured a three-hour makeup routine with prosthetics and a full bodysuit to play the iconic DC villain. Shot with a cohesive, darker aesthetic, in line with Matt Reeves' Batman film, The Penguin isn't your daddy's top-hat-and-monacle-wearing comic book Penguin, but a whole new breed.\n\nNoah Wyle's John Carter was by far my favorite ER character (suck it, Clooney). So when I heard that the actor was returning to the world of hospital dramas in The Pitt, and the team behind ER was responsible for its creation to boot, I was in like an intubation tube (I've clearly watched a lot of this stuff).\n\nI love this show on HBO Max because it gets to provide a much more realistic look inside the breakneck, brutal, and often dire world of a busy hospital emergency room than network shows like ER or Grey's Anatomy ever could.\n\nWylie plays Michael “Robby” Robinavitch, the chief attending doctor in the trauma ward of the fictional Pittsburgh Trauma Medical Center, aka The Pitt. Much of the show's realism can be attributed to its 15 one-hour episodes, which take place in real-time over the course of a single, exhausting 15-hour shift in the ER.\n\nSeason one not only introduces us to Robby's veteran team, who perform miracles, but also a group of young residents, some on their first shifts in the ER, who get thrown into chaos when a shooting at a music festival floods the department with victims. It's bloody, intense, emotional, and produced with such attention to detail that you'll be left exhausted and in awe of them and the real-life medical professionals who do this every day.\n\nIt may not be the most cheerful show to binge over the course of a weekend, but I guarantee that you won't be able to tear yourself away from HBO's acclaimed five-part miniseries Chernobyl​​​​​​. Created by The Last of Us writer/creator Craig Mazin, the haunting series is a dramatic depiction of the worst nuclear disaster in human history, the meltdown of the Chernobyl Nuclear Power Plant in Soviet Ukraine in 1986. The show opens by taking viewers inside the plant on the night of the event.\n\nThe disaster unleashed tons of nuclear radiation into the atmosphere, a fact that Soviet chemist Valery Legasov (Jared Harris) puts into perspective to Russian leader Mikhail Gorbachev by telling him that \"It’s giving out the equivalent radiation of two Hiroshima bombs every hour!\"\n\nHarris' performance is chilling to the bone as Legasov, the man charged with handling the travesty, navigates Soviet propaganda, politics, and the gruesome effects the radiation is having on the citizens of the nearby town of Pripyat. Stellan Skarsgård also stars as Soviet Deputy Prime Minister Boris Shcherbina, who butts heads with Legasov as the man in charge of the government's response to the disaster.\n\nWhen the show aired in 2019, it was acclaimed for its stark realism and performances, but it was also controversial, prompting conversations and even arguments about its portrayal of Soviet Russia, socialism, and even the realities of nuclear physics. Chernobyl is a must-watch series if you're at all interested in dramatizations of major historical events. It's a good thing that it's just five episodes, because it's an intense, but worthwhile, ride.\n\nHBO Max is the home of some of the best TV series of all time. And even if you don't go for any of the streamer's most recent shows, like The Last of Us, Peacemaker, or The White Lotus, this well runs so deep that you're not likely to run out of older things to watch.",
  "medium": "Article",
  "links": [
    "https://www.vudu.com/content/movies/details/content/3759441",
    "https://www.howtogeek.com/tag/hbo-max/",
    "https://max.prf.hn/click/camref:1011l3DxTc/destination:https%3a%2f%2fplay.max.com%2fvideo%2fwatch%2f21acd328-6298-4928-bb08-e926d776f63d%2f0fc22038-1044-42b7-a146-e6fc0b3f3133",
    "https://disneyplus.bn5x.net/c/156932/564546/9358?subId1=UUhtgUeUpU0&subId2=ehtg&u=https%3A%2F%2Fwww.hulu.com%2Fseries%2Fchernobyl-849bed9a-2da8-484b-8cdf-d7000090fc5d&ourl=https%3A%2F%2Fwww.hulu.com%2Fwatch%2F6f3f46df-d76d-40ea-a33a-68c5f18864bf",
    "https://max.prf.hn/click/camref:1011l3DxTc/destination:https%3a%2f%2fplay.max.com%2fvideo%2fwatch%2f6eb1dbc5-6b70-429c-926d-c66f0f41eb6f%2f6e90c0f9-d3ef-4a9a-9a85-3f31a20d40af",
    "https://www.microsoft.com/en-us/p/Season%201/8D6KGWXMZDMW?episode=8D6KGWXMZDMQ",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.37570879-82e2-4ff7-bb9c-b28c27c92049?tag=hotoge-20&ascsubtag=UUhtgUeUpU0",
    "https://www.vudu.com/content/movies/details/content/1136783",
    "https://www.howtogeek.com/bingeworthy-new-medical-dramas/",
    "https://www.hbomax.com/",
    "https://www.hbomax.com/shows/penguin/5756c2bf-36f8-4890-b1f9-ef168f1d8e9c",
    "https://www.howtogeek.com/675559/the-best-hbo-originals-on-hbo-max-may-2020/",
    "https://screenrant.com/db/tv-show/chernobyl/",
    "https://www.hbomax.com/shows/chernobyl/396999a6-3fff-4af3-802b-10c46d10deff",
    "https://www.hbomax.com/shows/pitt-2024/e6e7bad9-d48d-4434-b334-7c651ffc4bdf",
    "https://disneyplus.bn5x.net/c/156932/564546/9358?subId1=UUhtgUeUpU0&subId2=ehtg&u=https%3A%2F%2Fwww.hulu.com%2Fseries%2Fthe-pitt-ef542800-c81a-4cdc-9193-ab8dee1a2f61&ourl=https%3A%2F%2Fwww.hulu.com%2Fwatch%2Febb08842-0620-4b1b-800a-6a16994b84d2",
    "https://max.prf.hn/click/camref:1011l3DxTc/destination:https%3a%2f%2fplay.max.com%2fvideo%2fwatch%2fe4b915fb-5e6b-42b8-97ac-90ec7d0e3147%2f00d49d4e-4f14-4b27-8c50-b01949609544",
    "https://screenrant.com/db/tv-show/the-penguin/",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.47ae55a8-d139-4b4f-9646-f025c6f8d9b5?tag=hotoge-20&ascsubtag=UUhtgUeUpU0",
    "https://screenrant.com/db/tv-show/the-pitt/",
    "https://www.microsoft.com/en-us/p/Season%201/8D6KGWXXCBBT?episode=8D6KGWXXCBC3",
    "https://www.hbomax.com/shows",
    "https://disneyplus.bn5x.net/c/156932/564546/9358?subId1=UUhtgUeUpU0&subId2=ehtg&u=https%3A%2F%2Fwww.hulu.com%2Fseries%2Fthe-penguin-2b442ca7-a7dd-44a5-880b-4afa7acb56f7&ourl=https%3A%2F%2Fwww.hulu.com%2Fwatch%2F00ae9380-fa87-4907-a40a-b1a8daac0c6a"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "network shows",
      "weight": 0.0687993
    },
    {
      "name": "Soviet chemist Valery Legasov",
      "weight": 0.057112057
    },
    {
      "name": "nuclear radiation",
      "weight": 0.05385281
    },
    {
      "name": "HBO Max",
      "weight": 0.05183141
    },
    {
      "name": "Soviet Deputy Prime Minister Boris Shcherbina",
      "weight": 0.051507466
    },
    {
      "name": "ER",
      "weight": 0.051116124
    },
    {
      "name": "Soviet propaganda",
      "weight": 0.049595717
    },
    {
      "name": "Oz",
      "weight": 0.04876687
    },
    {
      "name": "Soviet Ukraine",
      "weight": 0.047265794
    },
    {
      "name": "Soviet",
      "weight": 0.046111755
    }
  ],
  "topics": [
    {
      "name": "TV"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.958984375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.93505859375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.84765625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.387939453125
    }
  ],
  "sentiment": {
    "positive": 0.32809338,
    "negative": 0.3090063,
    "neutral": 0.36290035
  },
  "summary": "HBO Max, a streaming service of HBO Max, has produced numerous popular TV series from the premium cable network-turned-streaming service. The second-most nominated show of the year, The Penguin, has received 24 nominations, largely due to its lead actors Colin Farrell and Cristin Milioti, who have been well-received for their performances. The series follows the lead actor as Oswald \"Oz\" Cobb, aka The Pengiun, and the deadly and underestimated crime boss, Sofia Falcone, follows him as he navigates both sides of the city's warring crime families. Noah Wyle plays Michael “Robby” Robinavitch, the chief attending doctor in the fictional Pittsburgh Trauma Medical Center, and The Pitt. The show's realism can be attributed to its 15 one-hour episodes, which take place in real-time over a single 15-hour shift in the ER. The acclaimed five-part miniseries Chernobyl, created by Craig Mazin, depicts the worst nuclear disaster in human history, the meltdown of the Chernobyl Nuclear Power Plant in Soviet Ukraine in 1986.",
  "shortSummary": "HBO Max offers compelling dramas like The Penguin and Chernobyl, offering intense drama and realistic storytelling, with Colin Farrell and Cristin Milioti starring.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5476131e38d7458e91b7d47283c21551",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://screenrant.com/db/tv-show/chernobyl/",
      "text": "Chernobyl\nCraig Mazin\nCraig Mazin\nJohan Renck\nHBO\nTV-MA\n1\nCast\nSee All Cast & Crew-\nJared HarrisValery Legasov\n-\nBoris Shcherbina\n-\nEmily WatsonUlana Khomyuk\nSynopsis\nChernobyl is a miniseries dramatizing the 1986 nuclear accident, highlighting the efforts of the individuals who worked tirelessly to mitigate its impact. Released in 2019, this historical depiction captures both the technical and human aspects of one of the most significant industrial disasters in history.\nOfficial Trailer\nSeasons(1)\nCast(25)\nJared Harris\nValery Legasov\nEmily Watson\nUlana Khomyuk\nPaul Ritter\nAnatoly Dyatlov\nJessie Buckley\nLyudmilla Ignatenko\nAdam Nagaitis\nVasily Ignatenko\nSam Troughton\nAlexandr Akimov\nKieran O'Brien\nKhodemchuck\nTomas Žaibus\nSoldier (Hospital)\nCon O'Neill\nViktor Bryukhanov\nAlan Williams\nKGB Chairman Charkov\nDavid Dencik\nMikhail Gorbachev\nMark Lewis Jones\nGeneral Pikalov\nRalph Ineson\nGeneral Tarakanov\nAlex Ferns\nGlukhov\nFares Fares\nBacho\nMichael McElhatton\nProsecutor Andrei Stepashin\nLaura Elphinstone\nOksana\nNadia Clifford\nDr. Svetlana Zinchenko\nSam Strike\nMisha\nSammy Hayman\nTitenok"
    },
    {
      "url": "https://www.microsoft.com/en-us/p/Season%201/8D6KGWXXCBBT?episode=8D6KGWXXCBC3",
      "text": "Important: Microsoft no longer offers new entertainment content for purchase, including movies and TV shows, on Microsoft.com, Microsoft Store on Windows, and the Microsoft Store on Xbox. However, you can continue to access your purchased content in the Movies & TV app on Xbox or Windows device.\nMicrosoft has stopped selling new movies and TV content. You can still access your previously purchased content on Windows and Xbox devices.\n-\nXbox: you can continue to play personal videos on Xbox devices.\n-\nWindows: you will continue to have access to playback, including downloaded playbacks.\nYou can continue to enjoy your previously purchased movies and TV shows using the Microsoft Movies & TV app on your Xbox or Windows device.\nYes, downloads will continue to be available on Windows and in HD max resolution.\nThe Xbox and Windows stores have other entertainment services that offer the latest home entertainment releases. The following transactional services are available today: Amazon Prime Video, Apple TV, and Fandango at Home, among others.\nYou cannot directly move your purchased content to another service. You will still be able to access and play purchased content on the Microsoft Movies & TV App. If you're in the U.S., you can sign up for Movies Anywhere to connect select purchased movies with other Movies Anywhere retailers.\nNo. Per the Microsoft Store Terms of Sale, Movies and TV shows are ineligible for refunds. You can continue to play purchased movies and watch TV shows.\nYes, if you experience an issue regarding previously purchased content, visit Microsoft Support to get assistance."
    },
    {
      "url": "https://screenrant.com/db/tv-show/the-penguin/",
      "text": "The Penguin\nLauren LeFranc\nCraig Zobel\nTV-MA\n1\n60 Mins\nCast\nSee All Cast & Crew-\nOz Cobb\n-\nSofia Falcone\n-\nRhenzy FelizVictor Aguilar\nSynopsis\nCreated by Lauren LeFranc, The Penguin is a crime-drama spin-off television series of 2022's film The Batman. Set shortly after the events of The Batman, Oz Cobb, A.K.A. the Penguin, begins his rise in the underworld of Gotham City as he contends with the daughter of his late boss, Carmine Falcone, for control of the crime family's empire.\nOfficial Trailer\nSeasons(1)\nCast(12)\nRhenzy Feliz\nVictor Aguilar\nMichael Kelly\nJohnny Viti\nShohreh Aghdashloo\nNadia Maroni\nDeirdre O'Connell\nFrancis Cobb\nJames Madio\nMilos Grapa\nScott Cohen\nLuca Falcone\nMichael Zegen\nAlberto Falcone\nCarmen Ejogo\nEve Karlo\nTheo Rossi\nJulian Rush\nImages(250)\nThe Penguin Review: Colin Farrell Is No Phony Soprano In DC's Slow-Burn Batman Spin-Off\nHBO's The Penguin peels back the layers of The Batman's stand-out character for a show that's big on story, violence, and heavy questions."
    },
    {
      "url": "https://screenrant.com/db/tv-show/the-pitt/",
      "text": "The Pitt\nR. Scott Gemmill John Wells Noah Wyle\nR. Scott Gemmill\nAmanda Marsalis\nMax\nTV-MA\n1\nCast\nSee All Cast & Crew-\nNoah WyleDr. Michael 'Robby' Robinavitch\n-\nTracy IfeachorDr. Heather Collins\n-\nPatrick BallDr. Langdon\nSynopsis\nThe Pitt is a gripping drama set in Pittsburgh's Trauma Medical Center, where dedicated staff tirelessly work to save lives in a busy and underfunded emergency department. Released in 2025, the series highlights the challenges and relentless efforts of medical professionals in a high-pressure environment.\nOfficial Trailer\nSeasons(1)\nCast(25)\nNoah Wyle\nDr. Michael 'Robby' Robinavitch\nTracy Ifeachor\nDr. Heather Collins\nPatrick Ball\nDr. Langdon\nKatherine LaNasa\nDana Evans\nSupriya Ganesh\nDr. Mohan\nFiona Dourif\nDr. McKay\nTaylor Dearden\nDr. Melissa King\nGerran Howell\nStudent Doctor Dennis Whitaker\nShabana Azeez\nStudent Doctor Victoria Javadi\nAmielynn Abellera\nPerlah\nJalen Thomas Brooks\nNurse Mateo\nBrandon Mendez Homer\nNurse Donald 'Donnie' Donahue\nKristin Villanueva\nPrincess\nShawn Hatosy\nDr. Jack Abbot\nKim Bonifay\nAmanda Jones\nAlfonso Caballero\nOtis Williams\nJoanna Going\nTheresa Saunders\nDeepti Gupta\nEileen Shamsi\nMichael Hyatt\nGloria\nJackson Kelly\nDavid Saunders\nKrystel McNeil\nKiara Alfaro\nAlexandra Metz\nDr. Yolanda Garcia\nRiley Neldam\nDrew Jones\nVideos(5)\nImages(250)\nThe Pitt Episode 4 Review: I'm Ready For More Of Max's Riveting Medical Drama As Robby's Emotional Arc Finally Takes Shape\nThe Pitt episode 4 continues to illustrate the struggles at Pittsburgh Trauma Medical Hospital as Max's 24-like drama excels at its intention."
    },
    {
      "url": "https://www.hbomax.com/shows/penguin/5756c2bf-36f8-4890-b1f9-ef168f1d8e9c",
      "text": "NOW STREAMING\nThe Penguin:\nStarring Colin Farrell, this HBO Original limited series continues the epic crime saga Matt Reeves began with The Batman.\nPlans start at $9.99/month.\nSYNOPSIS\nThis thrilling crime drama follows Oswald “Oz” Cobb’s quest for control in Gotham City. With the city in peril following the seawall’s collapse, Oz (Oscar® nominee Colin Farrell) seeks to fill the power vacuum left by the death of Carmine Falcone and finally give his mother Francis (Deirdre O’Connell) the life he’s always promised. But first, Oz must confront his enemies, including Carmine’s children, Sofia Falcone (Cristin Milioti) and Alberto Falcone (Michael Zegen); the Maroni family, led by their imprisoned patriarch, Salvatore Maroni (Clancy Brown); and Oz’s own demoralizing reputation as “the Penguin.”\nGALLERY\nVideos\nOfficial Podcast\nHosted by film critic Amy Nicholson, this weekly podcast offers exclusive, in-depth interviews with the creators, cast, and crew on the narratives, the characters, and the making of the series.\nPartnerships\nBatman: One Bad Day Graphic Novels\nIn a city where chaos reigns, delve into the harrowing tales of Batman’s greatest foes, including The Penguin. Experience the dark and twisted minds that dominate Gotham’s gritty underworld in Batman: One Bad Day: Penguin and other Batman: One Bad Day graphic novels. Get your copy today and dare to enter the world of Gotham.\nNYC TOURISM\nWhat’s good in New York City? Everything. From delicious eats and iconic sights to diverse neighborhoods and easily accessible transportation, there’s no better adventure than exploring the inspiration behind Gotham.\nMayor's Office of Media and Entertainment\nMOME’s mission is to support and strengthen New York City's creative economy and make it accessible to all.\nEpisodes\n1. After Hours\nIn the wake of Carmine Falcone’s death, Oz attempts to legitimize himself among ...\n2. Inside Man\nSofia works to secure her family’s strength, while Oz attempts to play both the ...\n3. Bliss\nWhile Oz and Sofia seek to control the future of Gotham’s drug trade, Victor is ...\n4. Cent'anni\nSofia confronts her past in Arkham State Hospital and makes plans for her future.\n5. Homecoming\nWith his nascent operation at stake, Oz makes a desperate move to turn the table...\n6. Gold Summit\nOz seeks to expand his reach in the city, as Victor crosses paths with a former ...\n7. Top Hat\nOz fights to preserve everything he’s built, while Sofia makes a shocking discovery.\n8. A Great Or Little Thing\nTruths are laid bare as Oz Cobb nears the end of his journey and his power strug...\nThe Penguin\nGenre\nCrime, Drama\nRelease Year\n2024\nRating Information\nTV-MA\nWriter and Showrunner\nLauren LeFranc\nDirector (Episodes 1-3)\nCraig Zobel\nExecutive Producers\nMatt Reeves, Dylan Clark, Colin Farrell, Lauren LeFranc, Craig Zobel, Bill Carraro, Daniel Pipski\nAbout This Series\nStarring Colin Farrell as Oz Cobb (aka The Penguin), the eight-episode HBO Original limited series from DC Studios continues the epic crime saga that filmmaker Matt Reeves began with the global blockbuster The Batman. Developed by showrunner Lauren LeFranc.\nStarring\nColin Farrell, Cristin Milioti, Rhenzy Feliz, Michael Kelly, Shohreh Aghdashloo, Deirdre O’Connell, Clancy Brown, James Madio, Scott Cohen, Michael Zegen, Carmen Ejogo, Theo Rossi\nStream Must-See Series, Movies & More\nPlans start at $9.99/month."
    },
    {
      "url": "https://www.howtogeek.com/675559/the-best-hbo-originals-on-hbo-max-may-2020/",
      "text": "Quick Links\nHBO is synonymous with top-tier original entertainment. Its streaming service, HBO Max, offers the best of the best. Skipping obvious hits like The Wire, Watchmen, and Game of Thrones, here are the best original HBO shows, new and old.\nBoardwalk Empire\nCreator Terence Winter worked as a writer on The Sopranos, and Boardwalk Empire has a similar gritty, grounded take on flawed mobsters. It's also set in New Jersey, focused on organized crime in Atlantic City during Prohibition, when the city was a haven for illegal gambling and alcohol.\nSteve Buscemi stars as local politician and mob boss Nucky Thompson, whose rule over the city is ruthless but fragile. The cast also includes Michael Shannon, Kelly Macdonald, Shea Whigham, and Michael K. Williams, among others, making up a stellar ensemble of fascinating underworld characters.\nBored to Death\nJason Schwartzman stars in Bored to Death as a writer and Brooklyn hipster who decides to become a private detective despite his lack of experience or skills (or a license). Mostly a hangout comedy co-starring Zach Galifianakis and Ted Danson as the main character's friends and reluctant assistants, Bored to Death captures a specific 2010s Brooklyn vibe, poised between literary pretension and stoner goofiness.\nIt's as much about goofy man-children bumbling toward maturity as it is about solving actual mysteries, even if they eventually manage to do that, too.\nThe Deuce\nLongtime HBO contributor David Simon is best known as the creator of The Wire, but he's produced quite a few other serious examinations of urban subcultures. The Deuce takes on the adult industry of New York City's Times Square in the 1970s and '80s with thoughtfulness and a wide cross-section of characters. Led by James Franco as twin entrepreneurs (one industrious, the other impulsive) and Maggie Gyllenhaal as a prostitute turned porn auteur, The Deuce finds nuance in a world many dismiss as sleazy and distasteful.\nFamily Tree\nFans of Christopher Guest's mockumentary movies like Waiting for Guffman and Best in Show should seek out Family Tree, an under-the-radar one-season comedy series co-created and directed by Guest. Presented in Guest's familiar improvised faux-doc style, Family Tree follows a middle-aged man played by Chris O'Dowd as he explores his heritage and extended family, meeting all sorts of oddball characters along the way. Guest regulars included Ed Begley Jr., Michael McKean, and Fred Willard make appearances in the funny and surprisingly poignant series.\nInsecure\nStar and co-creator Issa Rae catapulted from a beloved web series to mainstream success with her semi-autobiographical dramedy Insecure. Rae plays Issa, a young single woman in LA balancing her career ambitions and her love life, both of which she's unsure and, yes, insecure about. Rae captures the rhythms of life in LA's Black community, as Issa and her best friend Molly (Yvonne Orji) find their comfort zones between their familiar community and the often white-dominated corporate world.\nPerry Mason\nA reboot of the classic legal drama starring Raymond Burr as the title character, this new version of Perry Mason provides an origin story for the freakishly competent defense attorney. Matthew Rhys plays Perry as a rumpled, melancholy private detective in 1930s Los Angeles, whose investigative work eventually leads to his practicing law. The series retains the moral righteousness of the original while allowing for more nuanced character development and a look into the seedier side of Depression-era Southern California.\nRaised by Wolves\nRidley Scott executive produces sci-fi series Raised by Wolves, and it's easy to see echoes of his well-known sci-fi movies, especially Alien and Prometheus. A pair of androids attempt to raise human children on a harsh, distant planet, while locked in battle with a faction of human religious zealots from Earth.\nAmanda Collin gives a chilling performance as the deadly but nurturing android known as Mother, and the unforgiving environment emphasizes the characters' bleak prospects. The show is both contemplative and suspenseful, much like Scott's best sci-fi movies.\nStarstruck\nNew Zealand comedian Rose Matafeo co-created and stars in the charming romantic comedy Starstruck. She plays Jessie, an aimless London singleton working odd jobs and trying to find direction in her life.\nWhen she unexpectedly has a one-night stand with famous actor Tom Kapoor (Nikesh Patel), she finds herself in a potential romantic relationship with the last person she'd imagine. Jessie and Tom navigate their feelings for each other as they both figure out their future plans.\nFlight of the Conchords\nPart musical, part sketch comedy, part story of two folk musicians from New Zealand trying to make it in New York City, the Emmy-winning Flight of the Conchords is a two-season comedy that ran from 2007 to 2009. It chronicles the miserably wonderful adventures of fictionalized versions of the real-life Conchords, played by real-life Kiwis, Jemaine Clement and Bret McKenzie.\nBecause there are no plans for a Conchords tour any time soon, make sure you don't miss their 2018 reunion show on HBO Max, Flight of the Conchords: Live in London.\nBarry\nAn award-winning dark comedy starring Bill Hader, Barry tells the story of a modern hitman who becomes disenchanted with his current profession when he discovers a new love for acting. Hader himself was the first to doubt his ability the play a former Marine, but his performance and the fantastic writing behind the show blend comedic genius with poignant intimate moments.\nIn terms of original content alone, you might find HBO Max to be well worth the price tag of $14.99 a month, especially if you want to binge all the good stuff now and then rotate your subscription."
    },
    {
      "url": "https://disneyplus.bn5x.net/c/156932/564546/9358?subId1=UUhtgUeUpU0&subId2=ehtg&u=https%3A%2F%2Fwww.hulu.com%2Fseries%2Fthe-penguin-2b442ca7-a7dd-44a5-880b-4afa7acb56f7&ourl=https%3A%2F%2Fwww.hulu.com%2Fwatch%2F00ae9380-fa87-4907-a40a-b1a8daac0c6a",
      "text": "18+ only. Any free trials valid for new and eligible returning subscribers only. For personal and non-commercial use only. Live TV is available in the 50 United States and the District of Columbia only. Compatible device and high-speed, broadband Internet connection required. Multiple concurrent streams and HD content may require higher bandwidth. Streaming content may count against your data usage. Location data required to access content. Live TV may vary by subscription and location.\nClick here to check channel availability in your area. Programming subject to regional availability, blackouts, and device restrictions. Number of permitted concurrent streams will vary based on the terms of your subscription. Pricing, channels, features, content, and compatible devices subject to change. Please review our\nTerms of Use and\nPrivacy Policy.\nU.S. residents, 18+ only. Includes certain combinations of Disney+, Hulu, and ESPN, subject to change. Offer valid for eligible subscribers, devices, and billing partners. Includes access to Disney+ content and additional ESPN Unlimited content in their separate apps. Location data may be required to watch certain content. Select Hulu content available via Disney+ with valid Disney+ and Hulu subscriptions; additional content only available via Hulu app. Hulu content can be streamed via Disney+ on up to 2 devices simultaneously. Additional app feature and device restrictions apply. For more information, including detailed information on billing and cancelation, please visit the\nHulu Help Center."
    },
    {
      "url": "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.37570879-82e2-4ff7-bb9c-b28c27c92049?tag=hotoge-20&ascsubtag=UUhtgUeUpU0",
      "text": "Episodes\nS1 E1 - After Hours\nSeptember 18, 20241 h 6 minIn the wake of Carmine Falcone’s death, Oz attempts to legitimize himself among Gotham’s criminal underworld.Available to buyS1 E2 - Inside Man\nSeptember 28, 202457minSofia works to secure her family’s strength, while Oz attempts to play both the Falcone and Maroni families to his advantage.Available to buyS1 E3 - Bliss\nOctober 5, 20241hHoping to control the future of Gotham’s drug trade, Oz and Sofia must first address the skeletons in their closet. Meanwhile, Victor is torn between his new life and what remains of his old.Available to buyS1 E4 - Cent'anni\nOctober 12, 202459minConfronting the events that turned her into \"The Hangman\" – and led to a decade-long fight to survive in Arkham State Hospital – Sofia makes plans for a more hopeful future.Available to buyS1 E5 - Homecoming\nOctober 19, 202456minWith his nascent operation at stake, Oz makes a desperate move to turn the tables. Meanwhile, Sofia strives to build a new legacy for herself.Available to buyS1 E6 - Gold Summit\nOctober 26, 202454minDespite his enemies’ attempts to smoke him out, Oz seeks to expand his reach in the city. Meanwhile, Victor crosses paths with a former adversary.Available to buyS1 E7 - Top Hat\nNovember 2, 202447minOz fights to preserve everything he’s built, while Sofia makes a shocking discovery.Available to buyS1 E8 - A Great Or Little Thing\nNovember 9, 20241 h 10 minTruths are laid bare as Oz Cobb nears the end of his journey and his power struggle with Sofia comes to a head.Available to buy"
    },
    {
      "url": "https://disneyplus.bn5x.net/c/156932/564546/9358?subId1=UUhtgUeUpU0&subId2=ehtg&u=https%3A%2F%2Fwww.hulu.com%2Fseries%2Fchernobyl-849bed9a-2da8-484b-8cdf-d7000090fc5d&ourl=https%3A%2F%2Fwww.hulu.com%2Fwatch%2F6f3f46df-d76d-40ea-a33a-68c5f18864bf",
      "text": "18+ only. Any free trials valid for new and eligible returning subscribers only. For personal and non-commercial use only. Live TV is available in the 50 United States and the District of Columbia only. Compatible device and high-speed, broadband Internet connection required. Multiple concurrent streams and HD content may require higher bandwidth. Streaming content may count against your data usage. Location data required to access content. Live TV may vary by subscription and location.\nClick here to check channel availability in your area. Programming subject to regional availability, blackouts, and device restrictions. Number of permitted concurrent streams will vary based on the terms of your subscription. Pricing, channels, features, content, and compatible devices subject to change. Please review our\nTerms of Use and\nPrivacy Policy.\nU.S. residents, 18+ only. Includes certain combinations of Disney+, Hulu, and ESPN, subject to change. Offer valid for eligible subscribers, devices, and billing partners. Includes access to Disney+ content and additional ESPN Unlimited content in their separate apps. Location data may be required to watch certain content. Select Hulu content available via Disney+ with valid Disney+ and Hulu subscriptions; additional content only available via Hulu app. Hulu content can be streamed via Disney+ on up to 2 devices simultaneously. Additional app feature and device restrictions apply. For more information, including detailed information on billing and cancelation, please visit the\nHulu Help Center."
    },
    {
      "url": "https://www.hbomax.com/shows/pitt-2024/e6e7bad9-d48d-4434-b334-7c651ffc4bdf",
      "text": "The Pitt\n: Emergency medicine doctors juggle personal crises, workplace politics, and high emotions in this drama series.\nNOW STREAMING\nPlans start at $9.99/month.\nPartner Resources\nIn times of crisis, it’s important to know where to turn. Click “Learn More” for a list of organizations that offer support and guidance to help you navigate through tough times.\nEpisodes\n1. 7:00 A.M.\nWhile attempting to distract himself from the anniversary of his mentor’s death,...\n2. 8:00 A.M.\nRobby helps siblings navigate their elderly father’s end of life care. Later, Sa...\n3. 9:00 A.M.\nSamira does her best to keep Whitaker on the right track. A teen overdose sparks...\n4. 10:00 A.M.\nBets are taken on the whereabouts of a stolen ambulance, while Santos learns a h...\n5. 11:00 A.M.\nSantos and Collins each deal with moral quandaries. Samira’s careful approach ea...\n6. 12:00 P.M.\nWhile Robby handles an ultimatum from the hospital, Mel, Javadi, and Collins eac...\n7. 1:00 P.M.\nAfter examining an influencer with strange symptoms, Samira pushes back against ...\n8. 2:00 P.M.\nWhile Robby attends to an elderly patient with ties to Pittsburgh's history, oth...\n9. 3:00 P.M.\nAfter a staff debrief from Robby, Dana defuses a waiting room brawl, Whitaker fi...\n10. 4:00 P.M.\nWith the Pitt down a staff member, Robby relies on his team to pick up the slack...\n11. 5:00 P.M.\nWhile Robby tries to keep a developing staffing situation under wraps, Collins g...\n12. 6:00 P.M.\nWhen dozens of critical patients flood the ER, Robby and his team struggle to ke...\n13. 7:00 P.M.\nAs the night shift begins, Robby refuses to give up on a mass casualty victim. S...\n14. 8:00 P.M.\nWhile Robby struggles with a loss, Abbott coaches Samira through a risky procedu...\n15. 9:00 P.M.\nRobby resorts to unorthodox methods to convince a father to allow treatment for ...\nThe Pitt\nGenre\nDrama\nRelease Year\n2025\nRating Information\nTV-MA\nExecutive Producers\nR. Scott Gemmill, Noah Wyle, John Wells, Erin Jontow, Simran Baidwan, Michael Hissrich\nAbout This Series\nFifteen episodes, 15 hours, one shift. This medical drama series offers a realistic look at the challenges healthcare workers face, as seen through the experiences of the frontline heroes at a Pittsburgh hospital.\nStarring\nNoah Wyle, Tracey Ifeachor, Patrick Marron Ball, Supriya Ganesh, Fiona Dourif, Taylor Dearden, Isa Briones, Gerran Howell, Shabana Azeez, Katherine LaNasa\nStream Must-See Series, Movies & More\nPlans start at $9.99/month."
    },
    {
      "url": "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.47ae55a8-d139-4b4f-9646-f025c6f8d9b5?tag=hotoge-20&ascsubtag=UUhtgUeUpU0",
      "text": "Chernobyl\nGOLDEN GLOBES® 2X winner\nAvailable to buy\nEpisodes\nS1 E1 - 1:23:45\nMay 5, 20191 h 2 min[HBO] HD. '1:23:45.' Plant workers and firefighters desperately try to control a catastrophic 1986 explosion at a Soviet nuclear power plant.Available to buyS1 E2 - Please Remain Calm\nMay 12, 20191 h 9 min[HBO] HD. 'Please Remain Calm.' With millions at risk after the explosion, Ulana Khomyuk tries to warn Legasov about a second threat.Available to buyS1 E3 - Open Wide, O Earth\nMay 19, 20191 h 5 min[HBO] HD. 'Open Wide, O Earth.' Lyudmilla ignores warnings about her firefighter husband's contamination.Available to buyS1 E4 - The Happiness of All Mankind\nMay 26, 20191 h 10 min[HBO] HD. 'The Happiness of All Mankind.' Legasov and Shcherbina consider using lunar rovers to remove radioactive debris.Available to buyS1 E5 - Vichnaya Pamyat\nJune 2, 20191 h 16 min[HBO] HD. 'Vichnaya Pamyat.' Legasov, Shcherbina and Khomyuk risk their lives and reputations to expose the truth about Chernobyl.Available to buy"
    },
    {
      "url": "https://www.howtogeek.com/tag/hbo-max/",
      "text": "latest\nHBO Max Says It Will Block Password Sharing\nThey seem to be going aggressive, but we'll have to wait and see.\nThese 8 Shark Movies Are So Good You'll Need a Bigger Couch\nLove scary ocean movies? With these films, Shark Week never has to end!\nWatch These 7 Binge-Worthy New Medical Shows, Stat!\nFrom medical mysteries and ER insanity to laughter and drama, these are the medical shows you should be streaming.\nDone, Dusted, and Good—8 Finished TV Shows You Can Binge Straight Through\nNow is the time to finally get caught up on all that must-watch TV everybody talks about.\nThese Prime Video Channels Come with Hidden Perks—Here’s How to Use Them\nSome Prime Video Channel subscriptions include a useful bonus.\nWatch These 9 DC Comics Shows Before James Gunn's Superman\nBinge these shows before and after watching Gunn’s Superman for more DC Comics excitement.\n10 Essential Adult Swim Shows That Defined Late-Night Animation\nWhen all the kids were out of the pool, these shows thrived on Adult Swim.\n10 Must-Stream Cartoons That Defined the 2010s\nThese are the cartoons that blazed a trail for the next generation.\nHBO Max Is Splitting From Warner's Sports and TV Networks\nWarner Bros. Discovery is splitting itself back into two companies.\n10 Essential Cartoons from Classic-Era Toonami\nThese cartoons of Toonami defined an entire generation of anime and action.\n10 Classic '00s Cartoons to Stream Right Now\nThese classic cartoons are a highlight of the 2000s with fantasy, superheroes, and samurai.\nWhy Sesame Street Needed to Be Saved by Netflix\nThanks to Netflix, Sesame Street will keep educating and entertaining the way it always has.\nThe 11 Funniest Original Comedy Shows on HBO Max\nIf you need some good laughs, these HBO Max exclusives are ideal.\n10 Nostalgia-Inducing '90s Cartoons You Should Stream\nThey reshaped how animation on television was defined.\n5 Streaming Shows That Switched Services\nShows that migrated to different services and found a new audience."
    },
    {
      "url": "https://www.hbomax.com/shows/chernobyl/396999a6-3fff-4af3-802b-10c46d10deff",
      "text": "TV-MA\n2019\n1 Seasons\nDrama\nBiographical Dramas\nChernobyl (HBO)\n: Starring Jared Harris, Stellan Skarsgard and Emily Watson, \"Chernobyl\" tells the story of the 1986 nuclear accident in this HBO Miniseries.\nPlans start at $9.99/month.\nFeatured Characters\nSee All\nEpisodes\n1. 1:23:45\nPlant workers and firefighters try to control a catastrophic explosion at the Ch...\n2. Please Remain Calm\nWith millions at risk after the explosion, Ulana Khomyuk tries to warn Legasov a...\n3. Open Wide, O Earth\nLyudmilla ignores warnings about her firefighter husband's contamination.\n4. The Happiness of All Mankind\nLegasov and Shcherbina consider using lunar rovers to remove radioactive debris.\n5. Vichnaya Pamyat\nLegasov, Shcherbina and Khomyuk risk their lives and reputations to expose the t...\nChernobyl (HBO)\nStarring Jared Harris, Stellan Skarsgard and Emily Watson, \"Chernobyl\" tells the story of the 1986 nuclear accident in this HBO Miniseries.\nStarring:\nJared Harris, Stellan Skarsgård, Emily Watson, Paul Ritter, Con O'Neill, Adrian Rawlins, Jessie Buckley, Sam Troughton, Adam Nagaitis, David Dencik, Robert Emms, Karl Davies, Michael Socha, Laura Elphinstone, Jan Ricica, Alan Williams, Douggie McMeekin, Nadia Clifford, Gerard Kearns, Adam Lundgren, Mark Lewis Jones\nDirectors:\nJohan Renck\nWriters:\nCraig Mazin\nProducers:\nCraig Mazin, Carolyn Strauss, Jane Featherstone, Anne Mensah, Gabriel Silver, Sanne Wohlenberg\nCreated By:\nCraig Mazin\nGenres:\nDrama, Biographical Dramas, Mystery & Suspense\nEpisodes:\n1 Seasons Available (5 Episodes)\nRelease Year:\n2019\nRating Information:\nTV-MA\nFind Your Perfect Plan\nWith Ads\n- HBO Max Basic With Ads, Disney+ Basic, and Hulu (With Ads)\n- Full HD video resolution on HBO Max\n- Stream HBO Max on 2 devices at once\nNo Ads\n- HBO Max Standard, Disney+ Premium, and Hulu (No Ads)\n- Full HD video resolution on HBO Max\n- Stream HBO Max on 2 devices at once\n- 30 downloads on HBO Max to watch on the go\nBasic With Ads\nWatch with limited ads.\n- Stream on 2 devices at once\n- Full HD video resolution\nAds served on select live & linear content in No Ads plan. Savings based on regular monthly price of each service. Access each service separately. Content, feature & device compatibility vary by service. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories on HBO Max. Additional terms apply.\nBy signing up for this bundle, HBO Max will share your email address & subscription details with Disney+ and Hulu for eligibility, marketing, and other purposes. For more info about your choices, see the Privacy Center.\nSavings are based on the price of the yearly plan paid upfront compared to the monthly plan paid over 12 months. Ads served on select live and linear content on Standard and Premium Plans. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories. See hbomax.com/information for more."
    },
    {
      "url": "https://www.microsoft.com/en-us/p/Season%201/8D6KGWXMZDMW?episode=8D6KGWXMZDMQ",
      "text": "Important: Microsoft no longer offers new entertainment content for purchase, including movies and TV shows, on Microsoft.com, Microsoft Store on Windows, and the Microsoft Store on Xbox. However, you can continue to access your purchased content in the Movies & TV app on Xbox or Windows device.\nMicrosoft has stopped selling new movies and TV content. You can still access your previously purchased content on Windows and Xbox devices.\n-\nXbox: you can continue to play personal videos on Xbox devices.\n-\nWindows: you will continue to have access to playback, including downloaded playbacks.\nYou can continue to enjoy your previously purchased movies and TV shows using the Microsoft Movies & TV app on your Xbox or Windows device.\nYes, downloads will continue to be available on Windows and in HD max resolution.\nThe Xbox and Windows stores have other entertainment services that offer the latest home entertainment releases. The following transactional services are available today: Amazon Prime Video, Apple TV, and Fandango at Home, among others.\nYou cannot directly move your purchased content to another service. You will still be able to access and play purchased content on the Microsoft Movies & TV App. If you're in the U.S., you can sign up for Movies Anywhere to connect select purchased movies with other Movies Anywhere retailers.\nNo. Per the Microsoft Store Terms of Sale, Movies and TV shows are ineligible for refunds. You can continue to play purchased movies and watch TV shows.\nYes, if you experience an issue regarding previously purchased content, visit Microsoft Support to get assistance."
    },
    {
      "url": "https://www.hbomax.com/",
      "text": "Must-see series, movies & more.\nChoose an HBO Max plan or bundle to start streaming.\nPlans start at $9.99/month\nPlans start at $16.99/month\nU.S. only. Must be 18+. Available only for direct-billed purchases via Disney+, Hulu, and HBO Max. Access content from each service separately. Content, feature and device compatibility vary by service. For details, including info on billing and cancellation, visit the HBO Max Help Center. Use of Disney+, Hulu, and HBO Max are subject to their respective terms and conditions, see each of Disney+ Subscriber Agreement, Hulu Subscriber Agreement, and HBO Max Terms of Use. ©2025 Disney and its related entities. HBO Max ©2025 Home Box Office, Inc.\nBy signing up for this bundle, HBO Max will share your email address & subscription details with Disney+ and Hulu for eligibility, marketing, and other purposes. For more info about your choices, see the Privacy Center.\nFind Your Perfect Plan\nWith Ads\n- HBO Max Basic With Ads, Disney+ Basic, and Hulu (With Ads)\n- Full HD video resolution on HBO Max\n- Stream HBO Max on 2 devices at once\nNo Ads\n- HBO Max Standard, Disney+ Premium, and Hulu (No Ads)\n- Full HD video resolution on HBO Max\n- Stream HBO Max on 2 devices at once\n- 30 downloads on HBO Max to watch on the go\nBasic With Ads\nWatch with limited ads.\n- Stream on 2 devices at once\n- Full HD video resolution\nAds served on select live & linear content in No Ads plan. Savings based on regular monthly price of each service. Access each service separately. Content, feature & device compatibility vary by service. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories on HBO Max. Additional terms apply.\nBy signing up for this bundle, HBO Max will share your email address & subscription details with Disney+ and Hulu for eligibility, marketing, and other purposes. For more info about your choices, see the Privacy Center.\nSavings are based on the price of the yearly plan paid upfront compared to the monthly plan paid over 12 months. Ads served on select live and linear content on Standard and Premium Plans. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories. See hbomax.com/information for more.\nFind Your Perfect Plan\nWith Ads\nNo Ads\nBasic With Ads\nStandard\nPremium\nAds served on select live & linear content in No Ads plan. Savings based on regular monthly price of each service. Access each service separately. Content, feature & device compatibility vary by service. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories on HBO Max. Additional terms apply.\nBy signing up for this bundle, HBO Max will share your email address & subscription details with Disney+ and Hulu for eligibility, marketing, and other purposes. For more info about your choices, see the Privacy Center.\nSavings are based on the price of the yearly plan paid upfront compared to the monthly plan paid over 12 months. Ads served on select live and linear content on Standard and Premium Plans. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories. See hbomax.com/information for more.\nFind Your Perfect Plan\nWith Ads\nNo Ads\nBasic With Ads\nStandard\nPremium\nAds served on select live & linear content in No Ads plan. Savings based on regular monthly price of each service. Access each service separately. Content, feature & device compatibility vary by service. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories on HBO Max. Additional terms apply.\nBy signing up for this bundle, HBO Max will share your email address & subscription details with Disney+ and Hulu for eligibility, marketing, and other purposes. For more info about your choices, see the Privacy Center.\nSavings are based on the price of the yearly plan paid upfront compared to the monthly plan paid over 12 months. Ads served on select live and linear content on Standard and Premium Plans. Live Sports and CNN Max available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. Download limits apply to certain content categories. See hbomax.com/information for more.\nLive Sports\nStream the NHL, NCAA® March Madness®, MLB™, U.S. Soccer, NASCAR, Unrivaled, Roland-Garros, college football, and premier cycling events live.\nLive Sports available only on select plans. Plan availability varies by subscription provider. Check with your subscription provider for details. Select games available and blackouts may apply. ™/© 2025 MLB\nNHL\nNCAA® March Madness®\nMLB™\nU.S. Soccer\nNASCAR\nUnrivaled\nRoland-Garros\nCollege Football\nCycling\nGet the Disney+, Hulu, HBO Max Bundle\nUnlock a world of entertainment with one subscription for one unbelievable price."
    },
    {
      "url": "https://disneyplus.bn5x.net/c/156932/564546/9358?subId1=UUhtgUeUpU0&subId2=ehtg&u=https%3A%2F%2Fwww.hulu.com%2Fseries%2Fthe-pitt-ef542800-c81a-4cdc-9193-ab8dee1a2f61&ourl=https%3A%2F%2Fwww.hulu.com%2Fwatch%2Febb08842-0620-4b1b-800a-6a16994b84d2",
      "text": "About this Show\nThe Pitt\nStill reeling from the effects of the pandemic and the loss of his beloved mentor, Dr. Michael “Robby” Robinavitch (executive producer Noah Wyle) welcomes a fresh batch of med students and interns to the understaffed and overcrowded emergency department at Pittsburgh’s Trauma Medical Center, affectionately referred to as “The Pitt.” Joining a diverse staff of residents, surgeons, nurses, and EMTs, the newcomers soon learn the highs and lows of emergency medicine – all while Robby contends with a hospital administration intent on cutting costs. Realistic and resonant, each episode of The Pitt tackles one hour of the staff’s shift, providing a visceral look at the challenges facing healthcare workers in today’s America as seen through the lens of the frontline heroes working around the clock to save lives.\nStarring: Noah WyleTracy IfeachorPatrick BallSupriya GaneshFiona Dourif\nCreator: R. Scott Gemmill"
    },
    {
      "url": "https://www.howtogeek.com/bingeworthy-new-medical-dramas/",
      "text": "Medical dramas such as the Emmy-nominated The Pitt are making just as many waves this year as crime dramas are, and I, for one, have been loving it. Over the years, medical shows have seen a big shift from mere procedurals to shows with more realistic and often-controversial perspectives, compelling fictional characters, and unique spins, including comedies!\nI've watched pretty much every new medical show of the past year, and here are seven of my favorites across several streaming services.\n7 Berlin ER\n|\nRelease Date |\nFebruary 26, 2025 |\n|---|---|\n|\nEpisodes |\n8 |\n|\nStarring |\nHaley Louise Jones, Slavko Popadic, Aram Tafreshian |\n|\nStatus |\nUnconfirmed |\nAfter facing personal and professional turmoil in Munich, Dr. Parker (Haley Louise Jones) seeks a fresh start in Berlin. This Apple TV+ German-language series follows the talented but troubled doctor as she’s thrust into the chaotic environment of one of the busiest, most overcrowded emergency rooms in the city, where she faces intense cases, resistant colleagues, and her own inner demons.\nBerlin ER is a graphic medical drama with an unsettling narrative arc that’s both engaging and endearing. Its revelation of realistic medical chaos helps draw attention to the interplay between a relentless pace and methodical control while mirroring the dysfunction within the hospital.\nDon’t be deterred because it’s in German. Berlin ER is available dubbed in English and is available with closed captions.\nApple TV+\n- Subscription with ads\n- No\n- Simultaneous streams\n- 5\nIntense ER drama from Germany, Berlin ER is a gritty and realistic watch.\n6 Doc\n|\nRelease Date |\nJanuary 7, 2025 |\n|---|---|\n|\nEpisodes |\n10 |\n|\nStarring |\nMolly Parker, Scott Wolf, Felicity Huffman, Omar Metwally |\n|\nStatus |\nOngoing |\nIf you’re looking for a medical drama with a new angle outside of emergency room chaos, Doc is your show.\nDr. Amy Larsen (Molly Parker) is the brilliant but hard-charging Chief of Internal Medicine at Minneapolis’s fictional Westside Hospital. After a bad car accident leaves her with a traumatic brain injury, she loses the last eight years of her memory, including significant events like the death of her son and a divorce.\nIn addition to navigating an unfamiliar world and having to rebuild her life, Dr. Larsen also has to contend with the medical practice she struggles to remember. Despite her memory loss, she is determined to return to work as an intern.\nDoc is inspired by the true story of an Italian doctor who also experienced a similar form of memory loss after a car accident.\n- Subscription with ads\n- Yes, $10/month\n- Live TV\n- Yes, various plans available\nMolly Parker stars in this mind-bender of a hospital drama about a doctor who must start over as an intern after suffering from amnesia.\n5 Pulse\n|\nRelease Date |\nApril 3, 2025 |\n|---|---|\n|\nEpisodes |\n10 |\n|\nStarring |\nWilla Fitzgerald, Colin Woodell, Jack Bannon, Daniela Nieves |\n|\nStatus |\nUnconfirmed |\nNetflix took its shot with its first medical procedural this year, and while it leans a little more on the soapy side, it makes for an ideal Netflix weekend binge.\nPulse follows Dr. Danielle “Danny” Simms (Willa Fitzgerald), a third-year resident, as she’s unexpectedly promoted to Chief Resident at Miami’s Maguire Hospital after the former Chief, Dr. Xander Phillips (Colin Woodell), is suspended. What makes this situation awkward is that the two had a secret relationship, and they must now find a way to work together without letting the cat out of the bag.\nOh yes, and all of this is taking place as a major hurricane barrels straight for the southern tip of Florida. While Danny and Xander’s dramatic connection is the nucleus of our show, Pulse also focuses on real people working together to navigate their responsibilities, relationships, and cases in a pressure cooker.\n- Subscription with ads\n- Yes, $8/month\n- Simultaneous streams\n- Two or four\nPulse follows young third-year resident Danielle Simms after she is unexpectedly made Chief Resident at a Florida hospital.\n4 St. Denis Medical\n|\nRelease Date |\nNovember 12, 2024 |\n|---|---|\n|\nEpisodes |\n18 |\n|\nStarring |\nWendi McLendon-Covey, David Alan Grier, Allison Tolman |\n|\nStatus |\nOngoing |\nThis hilarious mockumentary medical show provides just as much drama as it does laughs, and it's a ripe half-hour comedy to stream for a quick laugh.\nSt. Denis Medical spotlights the overworked doctors and nurses at a hospital in the fictional town of Merrick, Oregon, where they try their best to treat patients and keep their sanity in check. Devoted nurse Alex (Allison Tolman) has just been promoted to emergency room Supervising Nurse and must now contend with an eclectic staff, each with their own attitude.\nMeanwhile, the facility’s executive director, Joyce (Wendi McLendon-Covey), works to turn the hospital into an international medical destination while Dr. Ron (David Alan Grier) is 100% over it all. Together, they must all work around Dr. Bruce (Josh Lawson), who’s a talented but competitive, insecure, arrogant surgeon with a god complex.\nThere’s no shortage of laughter and feel-good fun in St. Denis Medical. Season 2 returns this fall!\n- Subscription with ads\n- Yes, $8/month\n- Simultaneous streams\n- 3\nFrom the folks behind Superstore, St. Denis Medical is pout to prove that laughter (and stupidity) is the best medicine.\n3 The Pitt\n|\nRelease Date |\nJanuary 9, 2025 |\n|---|---|\n|\nEpisodes |\n15 |\n|\nStarring |\nNoah Wyle, Taylor Dearden, Shawn Hatosy, Isa Briones |\n|\nStatus |\nOngoing |\nIn my opinion, The Pitt is the absolute best medical drama streaming in 2025, and it’s among the top three to date. It was also HBO Max’s most-watched original title globally, and has been nominated for 13 Primetime Emmys.\nThe Pitt provides a realistic look at the functioning of an emergency room and the doctors and nurses who pull off incredible feats there, as well as the hospital administrators who run it. It examines the high-stakes intensity and challenges front-line workers face today, as seen from their perspective.\nOver the course of 15, one-hour episodes, we follow senior attending physician Dr. Michael “Robby” Robinavitch (Noah Wyle) and his team in a real-time, single shift at Pittsburgh Trauma Medical Hospital. The place is severely underfunded and understaffed—a common occurrence.\nAs Robby leads his staff through a shift from hell, he’s also battling his own secret trauma and post-traumatic stress from the loss of his mentor during the insanity of the COVID pandemic. It’s impressive to see him on the verge of a nervous breakdown, keeping it together to do what he’s best at: saving lives.\nIntense, emotional, fast-paced, and extremely well-written and performed, The Pitt makes you forget you’re watching a scripted work of fiction.\n- Subscription with ads\n- Yes, $10/month\n- Simultaneous streams\n- 2 or 4\nDon't miss the full first season of Max's most-watched original series, The Pitt.\n2 The Trauma Code: Heroes On Call\n|\nRelease Date |\nJanuary 24, 2025 |\n|---|---|\n|\nEpisodes |\n8 |\n|\nStarring |\nJu Ji-hoon, Jung Jae-kwang, Ha Young, Choo Young Woo |\n|\nStatus |\nUnconfirmed |\nThere’s something to be said about foreign medical dramas: They know how to bring the tension and trauma.\nKorea has few skilled trauma surgeons and even fewer who do risky, rebellious things like ride a motorcycle into an active war zone to deliver a backpack full of blood and supplies to those in need. Enter war-seasoned surgeon and trauma god Baek Kang-hyeok (Ju Ji-hoon).\nThe Trauma Code: Heroes On Call follows Kang-hyeok as he’s hired to fix a struggling trauma unit inside a major university hospital. He isn’t well-received, due to his blunt attitude and unconventional methods, but that’s expected, given that most of the doctors at Hankuk National University have had little to no trauma training—horrifying, I know.\nThe series highlights the necessity of quick, effective trauma care and features realistic cases, including those involving severe injuries and critical situations, while exploring the tension between the team’s desire to save lives and the hospital’s financial priorities.\n- Subscription with ads\n- Yes, $8/month\n- Simultaneous streams\n- Two or four\nThe Trauma Code: Heroes On Call's eight fast-paced episodes will leave you wanting more of this intense Korean medical drama.\n1 Watson\n|\nRelease Date |\nJanuary 26, 2025 |\n|---|---|\n|\nEpisodes |\n13 |\n|\nStarring |\nMorris Chestnut, Randall Park, Eve Harlow, Peter Mark Kendall |\n|\nStatus |\nOngoing |\nMorris Chestnut stars as Dr. John Watson—yes, that Watson. This Paramount+ medical drama picks up six months after the death of Sherlock Holmes at the hands of Moriarty (Randall Park).\nWatson follows Chestnut as he resumes his medical career by opening the Holmes Clinic in Pittsburgh, Pennsylvania. As the head of a clinic dedicated to treating rare disorders, he only sees patients with strange, unidentifiable issues. However, when evidence surfaces indicating that Moriarty is still alive, Watson knows he must face his past and write a new chapter of this fascinating story with the one person he despises.\nThe show’s foundation is Watson’s investigative spine, which serves as a modern version of one of history’s greatest detectives as he redirects his attention from solving crimes to solving medical mysteries.\n- Subscription with ads\n- Yes, $8/month\n- Simultaneous streams\n- 3\nMorris Chestnut stars as Dr. John Watson in this modern take on the Sherlock Holmes character.\nOnce you finish these unique, wave-making medical dramas of 2025, blast into the past and explore classic medical hits like ER, Grey's Anatomy, and House, or see what gritty crime dramas to watch that are making waves this year, too."
    }
  ],
  "argos_summary": "The article recommends three binge‑worthy HBO Max series for the weekend: the crime drama \"The Penguin\" starring Colin Farrell and Cristin Milioti; the medical drama \"The Pitt\" featuring Noah Wyle as a Pittsburgh ER doctor; and the historical miniseries \"Chernobyl\" about the 1986 nuclear disaster. Each show is highlighted for its strong performances, realistic storytelling, and compelling narratives, making them ideal for a weekend watch.",
  "argos_id": "CTWUQDI4K"
}