{
  "url": "https://www.androidauthority.com/pixel-10-galaxy-watch-pairing-issues-3594948/",
  "authorsByline": "Adamya Sharma",
  "articleId": "9a0ff0a7e5c94d53930a48574a51cb25",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2025/09/Galaxy-Watch-8-classic-fail-to-pair-pixel-10-pro-xl.jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-05T05:42:29+00:00",
  "addDate": "2025-09-05T05:54:23.197938+00:00",
  "refreshDate": "2025-09-05T05:54:23.197940+00:00",
  "score": 1.0,
  "title": "Galaxy Watches and Pixel 10 phones are currently incompatible",
  "description": "We can confirm what countless Pixel 10 owners are reporting. The phones are refusing to pair with Samsung's watches.",
  "content": "If you just picked up a shiny new Pixel 10 series phone and tried pairing it with your Galaxy Watch, chances are you’re running into some connectivity trouble. Reports are piling up across Reddit and Google’s support forums that Samsung’s watches, especially the Galaxy Watch 8 series, Galaxy Watch 7 series, and Galaxy Watch Ultra, simply refuse to connect to Google’s flagships over Bluetooth, and we can confirm the issue is very real.\n\nOn our end, a Galaxy Watch 8 Classic wouldn’t pair at all with the Pixel 10 Pro XL. The setup stops dead at the pairing code stage, whether through the Galaxy Wearable app or manual Bluetooth settings. Resetting the watch and reinstalling Samsung Health as well as the Galaxy Wearable app didn’t help either. We also didn’t have any luck pairing the two together after installing the latest September update on the Pixel 10 Pro XL. Meanwhile, the watch pairs perfectly fine with Samsung’s own phones like the Galaxy Z Fold 7 and Flip 7, so the problem seems limited to Pixel 10 devices.\n\n“I am having serious issues in pairing the phone with the Samsung Watch Ultra. The pairing stops around 85% and then continues to search for a Bluetooth device. The watch has been updated to the August security patch yesterday, and after that had noticed significant battery drain. As a result, reset the watch and has lead to pairing issues.”\n\n“Literally everyone on the new Pixel 10. Hit the search button. Forums are full of it. No fix yet. Yesterday’s security patch did nothing for me.”\n\n“Moved my Watch8 classic over to the 10 Pro XL and it worked fine for a couple of hours, and then, the Galaxy Wearable app stopped detecting the watch. Rebooted the watch and phone and after a bit it was only connecting remotely via Wi-Fi. Factory reset the watch, and now it won’t complete the setup process at all.”\n\n“Not just Ultra 8, I have Ultra 7 watch, have Pixel 10 pro, not connecting via Bluetooth! I had a Pixel 9 and did the latest update to Android 16 to it and no problem connecting! It is only with the 10 pro not connecting”\n\nFor now, if you’re trying to pair your Galaxy Watch 8, Ultra, or even older models with a Pixel 10, you’ll probably need to wait or try multiple workarounds to make it happen. Hopefully, a future software update from Google or Samsung will smooth things out. Since both companies work closely on Wear OS, a fix should be on the way sooner rather than later.",
  "medium": "Article",
  "links": [
    "https://www.reddit.com/r/GalaxyWatch/comments/1n2vjzr/pixel_10_pro_issues_connecting/",
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://www.reddit.com/r/GooglePixel/comments/1n546of/psa_galaxy_watch_8_and_galaxy_watch_ultra/",
    "https://www.androidauthority.com/news/",
    "https://www.androidauthority.com/tag/samsung-galaxy-watch-8/",
    "https://www.androidauthority.com/google-pixel-10-specs-features-price-availability-3588502/",
    "https://www.androidauthority.com/tag/samsung-galaxy-watch/",
    "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
    "https://www.androidauthority.com/tag/samsung/",
    "https://www.reddit.com/r/GooglePixel/comments/1n2g4p1/warning_galaxy_watch_8_and_pixel_10/",
    "https://www.androidauthority.com/samsung-galaxy-watch-8-classic-review-3585894/",
    "https://support.google.com/pixelphone/thread/369084256/can-t-pair-pixel-10-pro-with-galaxy-watch-8?hl=en&sjid=8815582394619887007-NC",
    "https://www.reddit.com/r/GooglePixel/comments/1n7d23i/pixel_pro_10_xl_and_galaxy_watch_ultra_bluetooth/",
    "https://www.androidauthority.com/google-pixel-september-2025-security-update-fixes-3594340/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Galaxy Watch Ultra",
      "weight": 0.12239219
    },
    {
      "name": "Galaxy Watch",
      "weight": 0.11783652
    },
    {
      "name": "Galaxy Wearable app",
      "weight": 0.11506504
    },
    {
      "name": "Galaxy Wearable",
      "weight": 0.11137901
    },
    {
      "name": "Galaxy Watches",
      "weight": 0.099846125
    },
    {
      "name": "Samsung Health",
      "weight": 0.07898814
    },
    {
      "name": "pairing issues",
      "weight": 0.07659903
    },
    {
      "name": "Samsung",
      "weight": 0.07433983
    },
    {
      "name": "phone",
      "weight": 0.07280065
    },
    {
      "name": "manual Bluetooth settings",
      "weight": 0.06946464
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.87451171875
    },
    {
      "name": "/News/Technology News",
      "score": 0.8125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.74853515625
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.6650390625
    }
  ],
  "sentiment": {
    "positive": 0.06749381,
    "negative": 0.6030362,
    "neutral": 0.32946992
  },
  "summary": "The issue between the Galaxy Watch 8 series, Galaxy Watch 7 series, and Galaxy Watch Ultra is causing connectivity issues with Google's new Pixel 10 series phones. Reports have surfaced on Reddit and Google's support forums that these watches, particularly those with the Pixel 10 Pro XL, refuse to connect to Google's flagships over Bluetooth. The issue is confirmed. The problem is also affecting Samsung's Galaxy Z Fold 7 and Flip 7, which are compatible with Samsung's own phones. However, a future software update from Google or Samsung is expected soon.",
  "shortSummary": "Despite recent security updates, Samsung's Galaxy Watches and Pixel 10 series phones are incompatible when paired, causing significant connectivity issues and battery drain issues.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "04e86a418ebf41be9fe91d63973b7240",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/google-pixel-10-specs-features-price-availability-3588502/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nPixel 10, Pixel 10 Pro, and Pixel 10 Pro XL debut as Google's most ambitious lineup yet\nAugust 20, 2025\nYear after year, Google has given us good reason to consider its latest Pixel lineup among the best Android phones you can buy. And while the company pushes both its hardware and software to new limits with each subsequent generation, this year, the Pixel 10 series has got to represent one of the biggest, boldest steps forward for the phones yet.\nOnce again, we’ve got four new additions to the Pixel family to check out, with the launch of the Google Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL, and Pixel 10 Pro Fold. We’re giving the new foldable some special attention of its own, but right now, let’s break down exactly what you can expect from the three new traditional models forming this year’s Pixel lineup.\nLong-term updates\nLoaded with Google AI features\nExcellent cameras\nPowerful AI tools\nTop-notch software\nBest specs and AI features\nGoogle Pixel 10, Pixel 10 Pro, and Pixel 10 Pro XL: Release date, price, and availability\n- Google Pixel 10 (128GB): $799 / £799\n- Google Pixel 10 (256GB): $899 / £899\n- Google Pixel 10 Pro (128GB): $999 / £999\n- Google Pixel 10 Pro (256GB): $1,099 / £,1,099\n- Google Pixel 10 Pro (512GB): $1,219 / £1,219\n- Google Pixel 10 Pro (1TB): $1,449 / £1,449\n- Google Pixel 10 Pro XL (256GB): $1,199 / £1,199\n- Google Pixel 10 Pro XL (512GB): $1,319 / £1,319\n- Google Pixel 10 Pro XL (1TB): $1,549 / £1,549\nWe’ve been looking forward to meeting the Pixel 10 series for ages now, and back in July, Google finally set the date for this season’s Made By Google event. Today, with August 20 finally rolling around, it’s everyone’s chance to officially check out the new family, with Google showing them all off at its Brooklyn launch extravaganza.\nWhile this year introduces some important changes for the hardware that make up Google’s Pixel phones, pricing is blessedly remaining consistent with last year’s Pixel 9 devices, starting at just under $800 for the 128GB base model — and moving up from there.\nPre-orders for the new handsets open up today, so if you like what you see here, you don’t have to waste any time getting the ball rolling on making a Pixel 10 model your next daily driver. For all three of these non-folding Pixels, regular retail availability kicks off next week, on August 28.\nGoogle is once again making its latest Pixel phones available to global audiences, kicking sales of the Pixel 10 series off in all the usual markets, with the addition of Mexico this time around. But this year, there’s an important new distinction to be aware of regarding the hardware coming to the US versus the rest of the world — more on that in just a moment.\nGoogle Pixel 10, Pixel 10 Pro, and Pixel 10 Pro XL: Specs\nGoogle’s definitely not going back to the drawing board with the Pixel 10 phones, and at a glance, it can be quite tricky to tell the new family apart from the last generation. But even with that approach to design remaining consistent, the manufacturer hasn’t been afraid to deliver some impactful changes to the hardware you’ll find within.\nWe’ll be covering some of those more important differences in a little more depth, but here’s your bird’s-eye view at how all this hardware compares across the lineup:\n| Pixel 10 | Pixel 10 Pro | Pixel 10 Pro XL | |\n|---|---|---|---|\nDisplay | Pixel 10 6.3-inch Actua display 1,080 x 2,424 Up to 2,000 nits (HDR) and up to 3,000 nits (peak brightness) | Pixel 10 Pro 6.3-inch Super Actua display (LTPO) 1,280 x 2,856 Up to 2,000 nits (HDR) and up to 3,300 nits (peak brightness) | Pixel 10 Pro XL 6.8-inch Super Actua display (LTPO) 1,344 x 2,992 Up to 2,200 nits (HDR) and up to 3,300 nits (peak brightness) |\nProcessor | Pixel 10 Google Tensor G5 Titan M2 security coprocessor | Pixel 10 Pro Google Tensor G5 Titan M2 security coprocessor | Pixel 10 Pro XL Google Tensor G5 Titan M2 security coprocessor |\nRAM | Pixel 10 12GB | Pixel 10 Pro 16GB | Pixel 10 Pro XL 16GB |\nStorage | Pixel 10 128 GB / 256 GB | Pixel 10 Pro 128 GB / 256 GB / 512 GB with Zoned UFS / 1 TB with Zoned UFS | Pixel 10 Pro XL 256 GB / 512 GB with Zoned UFS / 1 TB with Zoned UFS |\nBattery & Charging | Pixel 10 4970mAh Fast charging – up to 55% in about 30 minutes – using 30W USB-C PPS charger or higher, sold sold separately Pixelsnap wireless charging (Qi2-certified) up to 15W | Pixel 10 Pro 4870mAh Fast charging – up to 55% in about 30 minutes – using 30W USB-C PPS charger or higher, sold sold separately Pixelsnap wireless charging (Qi2-certified) up to 15W | Pixel 10 Pro XL 5200mAh Fast charging – up to 70% in about 30 minutes – using 45W USB-C PPS charger or higher, sold sold separately Pixelsnap wireless charging (Qi2.2-certified) up to 25W |\nCameras (Rear) | Pixel 10 48 MP wide (Quad PD, camera, ƒ/1.70 aperture, 82° field of view, 1/2\" image sensor size) 13 MP ultrawide (Quad PD, ƒ/2.2 aperture, 120° field of view, 1/3.1\" image sensor size) 10.8 MP telephoto (Dual PD with optical image stabilization, ƒ/3.1 aperture, 23° field of view, 5x optical zoom 1/3.2\" image sensor size, Super Res Zoom up to 20x) | Pixel 10 Pro 50 MP wide (Octa PD, ƒ/1.68 aperture, 82° field of view, 1/1.3\" image sensor size) 48 MP ultrawide (Quad PD with autofocus, ƒ/1.7 aperture, 123° field of view, 1/2.55\" image sensor size) 48 MP telephoto (Quad PD with optical image stabilization, ƒ/2.8 aperture, 22° field of view, 5x optical zoom, 1/2.55\" image sensor size, Pro Res Zoom up to 100x) | Pixel 10 Pro XL 50 MP wide (Octa PD, ƒ/1.68 aperture, 82° field of view, 1/1.3\" image sensor size) 48 MP ultrawide (Quad PD with autofocus, ƒ/1.7 aperture, 123° field of view, 1/2.55\" image sensor size) 48 MP telephoto (Quad PD with optical image stabilization, ƒ/2.8 aperture, 22° field of view, 5x optical zoom, 1/2.55\" image sensor size, Pro Res Zoom up to 100x) |\nCameras (Front) | Pixel 10 10.5 MP Dual PD selfie camera with autofocus ƒ/2.2 aperture 95° ultrawide field of view | Pixel 10 Pro 42 MP Dual PD selfie camera with autofocus ƒ/2.2 aperture 103° ultrawide field of view | Pixel 10 Pro XL 42 MP Dual PD selfie camera with autofocus ƒ/2.2 aperture 103° ultrawide field of view |\nDimensions | Pixel 10 152.8mm tall, 72.0mm wide, and 8.6mm thick | Pixel 10 Pro 152.8mm tall, 72.0mm wide, and 8.6mm thick | Pixel 10 Pro XL 162.8mm tall, 76.6mm wide, and 8.5mm thick |\nWeight | Pixel 10 204 g (7.2 oz) | Pixel 10 Pro 207 g (7.3 oz) | Pixel 10 Pro XL 232 g (8.2 oz) |\nDurability | Pixel 10 IP68 dust and water resistance Corning Gorilla Glass Victus 2 | Pixel 10 Pro IP68 dust and water resistance Corning Gorilla Glass Victus 2 | Pixel 10 Pro XL IP68 dust and water resistance Corning Gorilla Glass Victus 2 |\nOS | Pixel 10 Android 16 7 years of OS, security, and Pixel Drop updates | Pixel 10 Pro Android 16 7 years of OS, security, and Pixel Drop updates | Pixel 10 Pro XL Android 16 7 years of OS, security, and Pixel Drop updates |\nAuthentication | Pixel 10 Fingerprint Unlock, Face Unlock, Pattern, PIN, password | Pixel 10 Pro Fingerprint Unlock, Face Unlock, Pattern, PIN, password | Pixel 10 Pro XL Fingerprint Unlock, Face Unlock, Pattern, PIN, password |\nConnectivity | Pixel 10 Wi-Fi 6E (802.11ax) with 2.4GHz, 5GHz, 6GHz, 2x2 MIMO Bluetooth 6 NFC Google Cast Dual Band GNSS GPS, GLONASS, Galileo | Pixel 10 Pro Wi-Fi 7 (802.11be) with 2.4GHz, 5GHz, 6GHz, 2x2 MIMO Bluetooth 6 UWB NFC Google Cast Thread networking Dual Band GNSS GPS, GLONASS, Galileo | Pixel 10 Pro XL Wi-Fi 7 (802.11be) with 2.4GHz, 5GHz, 6GHz, 2x2 MIMO Bluetooth 6 UWB NFC Google Cast Thread networking Dual Band GNSS GPS, GLONASS, Galileo |\nSIMs | Pixel 10 US: Dual eSIM ROW: Single Nano SIM and eSIM | Pixel 10 Pro US: Dual eSIM ROW: Single Nano SIM and eSIM | Pixel 10 Pro XL US: Dual eSIM ROW: Single Nano SIM and eSIM |\nSafety | Pixel 10 -Satellite SOS -Emergency SOS -Crisis Alerts -Car Crash Detection -Safety Check -Emergency Location Service -Emergency Contacts & Medical Info -Android Earthquake -Alerts System -Theft Protection | Pixel 10 Pro -Satellite SOS -Emergency SOS -Crisis Alerts -Car Crash Detection -Safety Check -Emergency Location Service -Emergency Contacts & Medical Info -Android Earthquake -Alerts System -Theft Protection | Pixel 10 Pro XL -Satellite SOS -Emergency SOS -Crisis Alerts -Car Crash Detection -Safety Check -Emergency Location Service -Emergency Contacts & Medical Info -Android Earthquake -Alerts System -Theft Protection |\nColors | Pixel 10 Indigo, Frost, Lemongrass, Obsidian | Pixel 10 Pro Moonstone, Jade, Porcelain, Obsidian | Pixel 10 Pro XL Moonstone, Jade, Porcelain, Obsidian |\nWarranty | Pixel 10 1 year (US, CA, TW, IN, JP, MY, SG, MX) 2 years (GB, IE, DE, FR, IT, ES, NO, DK, SE, NL, BE, AT, CH, PT, PL, CZ, RO, HU, SI, LT, LV, EE, SK, FI, AU, GR, HR, BG, TR, SA, UAE, IL, QA, KW) | Pixel 10 Pro 1 year (US, CA, TW, IN, JP, MY, SG, MX) 2 years (GB, IE, DE, FR, IT, ES, NO, DK, SE, NL, BE, AT, CH, PT, PL, CZ, RO, HU, SI, LT, LV, EE, SK, FI, AU, GR, HR, BG, TR, SA, UAE, IL, QA, KW) | Pixel 10 Pro XL 1 year (US, CA, TW, IN, JP, MY, SG, MX)\n2 years (GB, IE, DE, FR, IT, ES, NO, DK, SE, NL, BE, AT, CH, PT, PL, CZ, RO, HU, SI, LT, LV, EE, SK, FI, AU, GR, HR, BG, TR, SA, UAE, IL, QA, KW) |\nGoogle Pixel 10, Pixel 10 Pro, and Pixel 10 Pro XL: Features\nWhether your priority in a new phone is imaging performance, raw speed, or excellent power management, you should be able to find something about these Pixel 10 phones to make them worthy of consideration. Let’s take a look at some of the highlights.\nCamera\nSome phones really go all-in on camera hardware, and it’s no surprise to see these models with beefy sensors and crazy periscopic zoom options on our list of best camera phones. But even without really jaw-dropping hardware, we also see Google’s Pixel phones join those right up at the top, year after year, thanks in no small part to Google’s exceptional image-processing prowess.\nMaybe the biggest news this year is the arrival of a telephoto option for the base Pixel 10, getting a 10.8MP camera with a 5x optical zoom. Google tries to sell that for a little more than it is, highlighting “up to 10x optical quality” and capable of even tighter zooms with Super Res processing, but we’d be happy either way.\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more. Find out more here.\nWith the Pro models, Google doubles down on that sentiment. Here it pairs a 48MP sensor with that 5x optical zoom, and the company claims this offers the highest-quality zoom you’ll get of any smartphone being sold to US shoppers. Similarly, it’s pushing processing to new heights, with these two boasting Pro Res Zoom up to 100x. That’s optimized for the new Tensor G5 processor, and operates using an advanced diffusion model.\nIn addition to the fancy new zoom capabilities, you can expect some solid improvements to optical stabilization quality and auto-focus speed.\nPerformance\nOK, now we’re getting into it. When your smartphone-obsessed friend advised you to hold off buying that Pixel 9 and wait for the Pixel 10 series, this is likely what they looking forward to: the Tensor G5 chip.\nGoogle’s been building Pixel phones around its custom-designed Tensor processors for years now, but with this generation the company moves from Samsung to TSMC as its manufacturing partner — and as a consequence, jumps from the 4nm process it employed across the past two chips down to 3nm for the G5.\nGoogle's got more to prove than ever this year, with all eyes on the Tensor G5 and its performance.\nUnsurprisingly, this chip is heavily focused on AI capabilities. It can run on-device models with the help of an upgraded TPU, which Google says is 60% more powerful than before. That new production node doesn’t just help the Tensor G5 run on average 34% faster but also aids in keeping power consumption down. And in case you haven’t picked up on it from those incredible camera tricks we were just touching on, this chip’s got an upgraded image processor on board.\nUnlike last year, we’re not getting any big shake-ups when it comes to memory configuration. Google is sticking with the same 12GB for the base Pixel 10 and 16GB on the Pro and Pro XL. We’d love seeing 16GB across the board, but the lack of motion here isn’t exactly surprising.\nYour storage choices also remain largely consistent with the new Pixel 10 generation, still starting down at 128GB, but this time Google drops the 128GB option for the Pixel 10 Pro XL, starting at 256GB, instead — honestly, a trend we wouldn’t hate to see trickle down to the rest of the phones.\nScreen quality and size\nGoogle’s also sticking with what works when it comes to screen size and resolution, returning with the same 6.3-inch sizes on the Pixel 10 and Pixel 10 Pro, and a 6.8-inch panel on the Pro XL. On the smallest Pixel 10, that spells a pixel density of around 420ppi, while you’ll enjoy a slightly sharper image closer to 490ppi on the Pro models. All three support Smooth Display output at up to 120Hz, but only the Pro models can also dial that down as low as 1Hz for power saving.\nPeak brightness should be about 10% higher this time around, from what Google calls “best in class” Actua displays — and better yet, the company claims we’ll get those brighter screens without feeling the impact on battery life. Just like we had with the Pixel 9 series, Google is tapping Corning for some Gorilla Glass Victus 2 protection.\nDesign, colors, and build quality\nWhile last year brought us a major new look, with that new pill-shaped camera island on the back, the Pixel 10 is very much a smartphone cast in the physical mold of its predecessor. And comparing the sizes of these three phones against their Pixel 9 equivalents, the differences are absolutely minuscule: Really, the only distinction you’ll measure is the Pixel 10 and Pixel 10 Pro each coming in a tenth of a millimeter thicker than last year.\nThere is, admittedly, a little heft being added this time around, but it’s on a scale that might be too minor to notice outside of holding one phone in each hand — maxing out at an 11g difference with the Pixel 10 Pro XL.\nJust like on the front, Gorilla Glass Victus 2 protects the hardware around back, with a sturdy aluminum frame making up the middle of our smartphone sandwich. And as we’d only expect, all three carry an IP68 ingress rating, so they’ll have no trouble surviving a brief dunk.\nWhat's your favorite Pixel 10 series color?\nThe question of best Pixel colors is a contentious one, granted, and this year you’ve got your choice of four no matter which Pixel you go with. In addition to the expected assortment of neutral tones, we get a few fun options, like Indigo and Lemongrass on the smallest Pixel 10 and Jade available for the Pro and Pro XL.\nDepending on where you get your Pixel 10, you may notice a low-key omission from the phone’s expected design. For Pixel 10 series phones sold in the US, this year, Google is taking the unprecedented step of going eSIM-only: The phones will lack a traditional tray for a physical SIM card. While some users might not blink twice at that, those who rely upon the flexibility of physical SIMs (especially when traveling) could run into trouble — so be advised.\nBattery life and charging speed\nHere’s one area in particular where we’re feeling pretty optimistic this year — even if that’s one word that’s just positively fraught to throw around when we’re talking all things battery. Instead of making one big change, Google has implemented several, and with any luck, they’ll all add up to make the Pixel 10 series some real endurance champions.\nGoogle started by lowering power demands from phone components, with parts like the 3nm Tensor G5 chip and the updated Actua displays promising to merely sip away at battery capacity. On its own, that might not deliver in the way users hope, but Google pairs that with higher-capacity batteries across the board.\nNow, those gains themselves are a little minor: 270mAh higher on the Pixel 10, 170mAh higher with the 10 Pro, and up 140mAh on the Pro XL. But they are absolutely progressing in the right direction, and we will take all the extra juice phone manufacturers are willing to offer. Maybe most interesting, though, is that this year the little Pixel 10 actually manages to push past the Pro in terms of raw capacity — even though the phones are the same size, we guess not having a few of those Pro upgrades left room within for some extra battery.\nThat’s consumption and capacity for you, but maybe Google’s biggest win with power on the Pixel 10 series will come from how you recharge them.\nWith this generation, Google is finally giving users a full-featured wireless charging experience, and that means Qi2 support, complete with built-in magnets for secure attachment — no case required. The company is taking full advantage of this by introducing new Pixelsnap branding for accessories designed to tap into it — including a long-overdue successor to the Pixel Stand. You’ll enjoy 15W wireless speeds on the Pixel 10 and Pro, while the Pro XL supports even speedier Qi2.2 25W charging.\nWired charging also gets a boost across the lineup, going from 27W to 30W for the Pixel 10 and Pro, while climbing from 37W to 45W on the Pixel 10 Pro XL. Google says that users should expect over 30 hours of battery life, and between all these upgrades, that sounds like it just might be within the realm of possibility.\nSoftware and updates\nUnlike last year, when the Pixel 9 phones arrived still running Android 14, Google has sorted out its development cycle, and Android 16 has arrived well in time to show up at home on the Pixel 10 phones. And with seven years of updates in the pipeline, you’ll be running new Android releases well into the next decade.\nJust like everything Google touches these days, the Pixel 10 series is chock full of Gemini AI-powered features — including a full year of free access to Google AI Pro with the Pixel 10 Pro and Pro XL. Gemini Live is picking up some cool-sounding new tricks, like highlighting stuff in your camera to show you, and the Phone app is adding an impressive real-time translation tool.\nWe finally get to meet what would have been Pixel Sense with the introduction of Magic Cue, an AI-powered assistant with awareness of what you’re working on with your phone, and the ability to offer suggested actions you may want to take next. In case that sounds like a step too far, Google’s privacy controls will let you decide just how much of your data you want AI having access to.\nYou’d have to be living in a cave not to understand how popular journaling is these days. Rather than forcing you to jot your thoughts down in something like Keep, Google’s now offering a dedicated solution in the form of the new Pixel Journal app — complete with PIN protection to keep your private thoughts private.\nThere’s tons more, too, from Call Message offering a hand dealing with your missed calls to Pixel Studio upgrades, new NotebookLM integration with Pixel Recorder and Screenshots, and Camera Coach helping you get your best shots yet. It’s the new Pixel, after all! This is Google’s biggest chance to show off all year! If you don’t want to miss out on that experience, make sure to get your pre-order in now.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.reddit.com/r/GooglePixel/comments/1n546of/psa_galaxy_watch_8_and_galaxy_watch_ultra/",
      "text": "The (un)official home of #teampixel and the #madebygoogle lineup on Reddit. Get support, learn new information, and hang out in the subreddit dedicated to Pixel, Nest, Chromecast, the Assistant, and a few more things from Google.\nPSA Galaxy Watch 8 and Galaxy Watch Ultra currently DO NOT WORK with Pixel 10 models.\nTrying to get as much visibility on this as possible in hopes for a quicker resolution. Quite frustrating to upgrade to a new phone, only to lose functionality for another device.\nMany users are having issues successfully paring, or *keeping* their watches paired after initially transferring it to a new phone.\nYes, users might be able to pair it during the initial set up as I was myself. However, shortly after the phone and watch will only stay connected to one another via a wifi connection. Bluetooth does not work. And the battery on the watch sustains a substantial drain, presumably because they are trying to connect fully to one another. Many users are reporting that a reset for the watch does not resolve the issue.\nThere is also a substantial thread on Samsung's website with users reporting the same.\nReddit Post:\nhttps://www.reddit.com/r/GooglePixel/comments/1n2g4p1/warning_galaxy_watch_8_and_pixel_10/"
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung/",
      "text": "Pages tagged:\nSamsung\nGalaxy S26 Ultra dimensions leak, while mockup render reveals welcome curves\nLeaked dimensions and a mockup render give us a better idea of what we'll see in January 2026.\nHadlee Simons51 minutes ago\n0\nAdamya Sharma1 hour ago\n0\nGalaxy Watches and Pixel 10 phones are currently incompatible\nDeal: This amazing Samsung curved gaming monitor is $600 off!\nEdgar Cervantes5 hours ago\n0\nThe Samsung Galaxy S25 Ultra $300 off, but only in these two colors\nEdgar Cervantes7 hours ago\n0\nPour one out for the Galaxy Note line as updates come to an end\nMatt Horne10 hours ago\n0\nSamsung Galaxy S26 dummies tease a long-awaited charging feature\nMatt Horne18 hours ago\n0\nStable One UI 8 is finally here for one Galaxy S25 phone, the rest still have to wait\nAdamya Sharma21 hours ago\n0\nSamsung DeX finally gets multi-monitor support on the Galaxy Tab S11\nZac Kew-Denniss21 hours ago\n0\nThe Galaxy S25 FE is finally here, and there's good and bad news\nHadlee Simons21 hours ago\n0\nSamsung's new DeX drops desktop UI on tablets, and not everyone will be happy\nZac Kew-Denniss21 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nLenovo shows off a concept laptop with a display that rotates to portrait mode\nIt's one a kind, but we've seen a similar concept before — from another brand.\nTushar Mehta\nThe Lenovo Legion Go 2 is finally here to put the ROG Xbox Ally in its place\nNick Fernandez44 minutes ago\n0\nLenovo undercuts the Galaxy Tab S11 series with a pair of more affordable tablets\nRyan McNeal44 minutes ago\n0\nGalaxy S26 Ultra dimensions leak, while mockup render reveals welcome curves\nHadlee Simons50 minutes ago\n0\nGalaxy Watches and Pixel 10 phones are currently incompatible\nWe can confirm what countless Pixel 10 owners are reporting. The phones are refusing to pair with Samsung's watches.\nAdamya Sharma\nDeal: This amazing Samsung curved gaming monitor is $600 off!\nEdgar Cervantes5 hours ago\n0\nThe Samsung Galaxy S25 Ultra $300 off, but only in these two colors\nEdgar Cervantes7 hours ago\n0\nPour one out for the Galaxy Note line as updates come to an end\nMatt Horne10 hours ago\n0\nOur latest\nGoogle’s Veo 3 lands in Photos, and you don’t need a $250 plan to try it\nMatt Horne12 hours ago\n0\nWant the Galaxy S25 FE? This $6 monthly AT&T offer is too good to ignore\nRyan McNeal13 hours ago\n0\nYour old Google phone may be getting this Pixel 9 livestreaming feature\nMatt Horne14 hours ago\n0\nThe brightest Google TV projector so far just debuted at IFA 2025\nKaitlyn Cimino15 hours ago\n0\nGoogle is expanding the Pixel Weather app to Wear OS\nRyan McNeal15 hours ago\n0\nPixel phones could soon let you set up unique vibrations for each contact (APK teardown)\nMatt Horne16 hours ago\n0\nAUKEY's new modular wireless charger is an absolute game changer\nAamir Siddiqui16 hours ago\n0\nRobot vacuums are conquering their final frontier with the eufy MarsWalker: Stairs\nStephen Schenck16 hours ago\n0\nYour yard has never felt more secure than with the eufyCam S4 and its intruder tracking\nStephen Schenck16 hours ago\n0\nAnker is ready for your new Pixel 10 with Qi2.2 support in latest charging lineup\nStephen Schenck16 hours ago\n0\nThe first Google TVs with Gemini are finally here\nAamir Siddiqui17 hours ago\n0\nGaN fast charging is now coming to your...robot vacuum cleaner?\nAamir Siddiqui17 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/samsung-galaxy-watch-8-classic-review-3585894/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nI spent two weeks with the Galaxy Watch 8 Classic, and I really think it's worth $500\nAugust 15, 2025\nSamsung Galaxy Watch 8 Classic\nMSRP: $499.99\nWhat we like\nWhat we don't like\nSamsung Galaxy Watch 8 Classic\nAt first glance, the Galaxy Watch 8 Classic looks like a smartwatch so many of us have been waiting for. It’s a Samsung watch with a reasonably-sized design, a bright display, tons of health features, and — most importantly — a rotating bezel. Paired with a massive software update and a big battery, it seems to check just about every box.\nBut does it all hold up in the real world? I spent a little over two weeks wearing the Galaxy Watch 8 Classic to find out, and for the most part, I think it does.\nThe Galaxy Watch 8 Classic is Samsung’s smartwatch hardware at its best\nThe rotating bezel is probably one of the main reasons you’re interested in the Galaxy Watch 8 Classic, so let’s start there. Simply put, it’s terrific.\nCompared to the Galaxy Watch 6 Classic, the Galaxy Watch 8 Classic’s bezel has noticeably thicker indents and a chunkier feel when rotated. In practice, I think these changes work out for the better. You can still freely spin the bezel to quickly scroll, but it’s also easy to be precise and slowly turn it. It’s such a satisfying thing to interact with, both for navigating the interface and also to fiddle with as a fidget toy throughout the day.\nThe rotating bezel is one of the main reasons to buy the Galaxy Watch 8 Classic — it's terrific.\nThe rotating bezel may not be a new concept for Samsung in 2025, but it remains one of my favorite smartwatch features of all time. It’s so fun, so unique, and such a great feature to have back after its baffling absence on the Galaxy Watch Ultra.\nThe bezel is also more pronounced than it was on the Galaxy Watch 6 Classic, thanks to its round shape sitting atop a squircle body. There has already been a lot of debate surrounding the Galaxy Watch 8’s squircle aesthetic, and while I understand it won’t be for everybody, I think it works well here.\nBetween the rotating bezel and the number markers it surrounds, the squircle shape is still there, but it’s not as immediately distracting as it appears on the regular Galaxy Watch 8. It adds some visual flair without looking out of place, and it’s something that has really grown on me. The more I wear the Watch 8 Classic, the more I find myself glancing at it throughout the day just to admire its design.\nBeyond its distinctive looks, there’s another reason for the squircle shape: Samsung’s new Dynamic Lug watch band system. Where the Galaxy Watch 6 Classic used standard 20mm watch bands that attached to the watch’s integrated lugs, the Watch 8 Classic’s new system sees watch bands attaching directly to the case.\nPersonally, I love it. For one thing, the new bands couldn’t be easier to add/remove; all you have to do is press a button to pull the bands off or attach them to the watch (there’s no awkward twisting like with the Pixel Watch bands). Additionally, the removal of the built-in lugs means the Galaxy Watch 8 Classic sits so much more comfortably on my wrist than the Galaxy Watch 6 Classic ever did.\nThe obvious downside is that, since this is a proprietary system, any 20mm watch bands you may have collected from previous Galaxy Watches won’t work with the Watch 8 Classic. That’s a very real issue for some people, but if this Dynamic Lug system is what Samsung plans to use moving forward, I think it’s a change for the better.\nFinally, there’s the display. In almost every regard, it’s fantastic. The Super AMOLED panel is sharp and colorful, while the 3,000 nits of maximum brightness mean I’ve never had an issue seeing the screen outdoors. That said, the 1.34-inch size has felt a little cramped.\nFor context, this is the same screen size as the 40mm Galaxy Watch 8. With the Galaxy Watch 8 Classic having a 46mm case, it’s frustrating that the screen is as small as it is — especially considering that the 44mm Galaxy Watch 8 has a 1.47-inch display. It’s far from a deal-breaker, but it’s an annoying quirk nonetheless.\nOne UI 8 Watch is my new favorite version of Wear OS\nWhat’s not annoying, however, is One UI 8 Watch — the latest version of Samsung’s smartwatch software that’s available out-of-the-box on the Galaxy Watch 8 Classic. We were impressed with One UI 8 Watch earlier this year when the beta was rolling out, and having now used it myself, I think it may be my new favorite way to use Wear OS.\nA big part of this is how One UI 8 Watch handles tiles. In all other versions of Wear OS, tiles (Wear OS’s version of widgets) take up the entire screen. So, you can have a weather tile on one page, a calendar tile on another, and so on.\nIn One UI 8 Watch, Samsung forgoes the full-screen experience in favor of allowing multiple tiles on a single page. Tiles now come in two sizes (small and large) and you can seemingly add as many as you’d like to any single page.\nFor example, I have a “Health” page with tiles for my Samsung Health activity, my energy score, sleep tracking, blood oxygen, stress tracking, and an ECG app shortcut. Next to that is another page with a tile for my next calendar event, the current weather conditions, my next alarm, and some calculator shortcuts.\nIn other words, tiles that would have previously taken up 10 separate pages — and required a lot of scrolling — are now reduced to just two pages. This has resulted in me using and interacting with tiles on the Galaxy Watch 8 Classic far more than I usually do on other Wear OS watches, and I’d say that’s a big achievement on Samsung’s part.\nAnother nice touch is the Now Bar. Similar to One UI 8 on Samsung phones, the Now Bar appears at the bottom of the Galaxy Watch 8 Classic for different types of live activities (such as a timer, an active workout, media playback, etc.). Being able to glance at my watch to see how much time is remaining on a timer without having to keep the timer app open may sound like a small thing, but it’s such a nice convenience in day-to-day use.\nAlso, while it’s not directly related to One UI 8 Watch, having Gemini built into the Galaxy Watch 8 Classic is great. Even this early on, Gemini is a substantial upgrade over Google Assistant, and it’s made me no longer despise using voice commands with a Wear OS smartwatch. Good job, Google.\nOne UI 8 Watch may be my new favorite way to use Wear OS.\nAlthough most of my experience with One UI 8 Watch has been excellent, it hasn’t been without a couple of faults. Numerous times throughout my two weeks with the Watch 8 Classic, it’s lost its connection to my Galaxy Z Flip 7 for a few seconds before automatically reconnecting. More annoying is that almost every morning after I wake up and disable Sleep Mode, the always-on display remains toggled off, forcing me to manually re-enable it.\nLike the display size, these aren’t game-breaking issues, but they’re ones I can’t help but notice. Unlike the display size, though, these are issues that Samsung can (hopefully) fix in a future software update.\nLoads and loads of health features\nBeing a Samsung watch, it shouldn’t be any surprise that the Galaxy Watch 8 Classic relies on Samsung Health for its health/fitness platform. Like other modern Samsung watches, that means the Watch 8 Classic is loaded to the brim with health features and sensors. Basically, everything you could ask for is here, including:\n- All-day activity tracking.\n- Sleep tracking (including a sleep score and sleep coaching).\n- Sleep apnea detection.\n- Daily energy score.\n- Stress monitoring.\n- Blood oxygen (SpO2) tracking.\n- Skin temperature sensor.\n- ECG app.\n- Body composition (to track your fat mass, skeletal muscle, BMI, and more).\nFor the most part, all of this works incredibly well. The activity tracking is motivating, the sleep tracking is accurate, and Samsung’s energy score is usually in line with how I’m feeling each day (if a little generous).\nI have noticed that the Galaxy Watch 8 Classic often provides me with inaccurate blood oxygen readings. Most nights while sleeping, the Watch 8 Classic shows my SpO2 levels dipping to 91% or 90%, with other nights going as low as 88%, 87%, and even 84% — which would put me in a hospital. This isn’t the first time I’ve experienced issues with wonky SpO2 tracking on a Samsung wearable, so while it’s not surprising that the issue persists on the Watch 8 Classic, it is disappointing.\nThankfully, other components — like the heart rate sensor and GPS — have been much more reliable. I’ve had precisely one strength workout where my heart rate was recorded much lower than expected, but otherwise, it has been spot on. The dual-band GPS has also been consistent, quickly grabbing a signal and accurately mapping my outdoor runs and walks without any glaring issues.\nSpeaking of runs, one of the main new health features for the Galaxy Watch 8 Classic is Running Coach. You start by doing a 12-minute test run for Running Coach to gauge your performance, after which it assigns you a running level and an accompanying training plan.\nSamsung put me in Level 6, which is the first level for the “Beginners’ half-marathon” section. My first workout was a 50-minute jog, followed by a repetition run, and then a longer 60-minute jog. The runs are pace-based, with Running Coach providing on-screen guidance and audio cues to help you stay on track.\nWhile I can see the limitations of Running Coach for more advanced runners, I’ve been pretty happy with the feature so far. It’s already encouraged and pushed me to run farther than I’ve been doing on my own. It’s also helped me establish a better habit of warming up before and cooling down after my runs. The difficulty spike is a little concerning, as my next run is a daunting 8.07 miles (my previous longest run was 5.8 miles), but I’m looking forward to sticking with Running Coach even after this review is published.\nThere are some other new health features, though I’m not quite as sold on their usefulness. Antioxidant index is one such feature. It claims to rate your body’s antioxidant levels, and while it’s a novel idea, I’m not convinced about its accuracy. My levels are consistently Low or Very low, despite eating a fairly balanced diet. Interestingly, my score actually decreased one afternoon after I’d eaten a cup of blueberries. You also have to remove the Galaxy Watch 8 Classic and place your thumb on the back of it to take a measurement, which is a big enough hurdle that I’ve been inclined to ignore the feature.\nThe other new addition, vascular load, rates your body’s vascular system performance based on your sleep, activity, and stress. My numbers here look good, but outside of yet another reminder to get good sleep and maintain an active lifestyle, I’m not sure how useful it really is.\nAs is often the case with Samsung Health, not everything sticks, but Samsung certainly throws a lot at the wall for people to play with. And honestly, I’m OK with this approach. There’s a lot of health data you can collect with the Galaxy Watch 8 Classic, much of which you won’t find on a non-Samsung smartwatch. In a world where the Apple Watch is still struggling to offer blood oxygen tracking, I have to give Samsung credit here.\nGood battery life, fine charging\nBefore we get out of here and start wrapping things up, a few words on the Galaxy Watch 8 Classic’s battery life and charging.\nThroughout my time wearing the Watch 8 Classic, it’s consistently gotten me through about a day and a half per charge — and that includes at least one workout per day and sleep tracking overnight. If I put on the watch with a fully charged battery at 8AM, I can expect to reach 3PM the following day before needing to find the charger. For context, this is with the always-on display enabled.\nThe fastest I drained the battery was starting with 100% at 7:45AM and dipping to 17% at 10:55PM that night, but that was the day I tracked a six-mile outdoor run with a podcast playing the entire time.\nCharging speeds, on the other hand, aren’t quite as impressive. The Galaxy Watch 8 Classic charges quickly at first, achieving a 50% charge in just 30 minutes, but then takes a full 75 minutes before finally reaching 100%.\nSamsung Galaxy Watch 8 Classic review: The Samsung watch to buy in 2025?\nLooking back on my two weeks with the Galaxy Watch 8 Classic, I don’t think it’s a stretch to say that this is the most I’ve enjoyed a Samsung smartwatch in years. I love the classy design and how the watch feels on my wrist. The rotating bezel remains just as fun as it has always been. One UI 8 Watch is an incredible piece of software, and Samsung’s health/fitness toolkit is one of the largest you can find. Combine that with great performance, display quality, and battery life, and you have a truly impressive package.\nBut is that package worth the $500 Samsung wants for the Galaxy Watch 8 Classic (or $550 for the LTE model)? Personally, I think it is.\nThe counterargument is the regular Galaxy Watch 8 ($349.99 at Amazon). It has all of the same features as the Watch 8 Classic, just with a smaller battery, a simpler design, and no rotating bezel. It’s objectively a better value at $350, but part of the reason I love the Galaxy Watch 8 Classic so much is its bezel and sophisticated design. If those don’t matter to you, the regular Galaxy Watch 8 is a good idea, but its ultra-simplistic hardware isn’t for me.\nThis is the most I've enjoyed a Samsung smartwatch in years.\nAnother strong alternative is the OnePlus Watch 3 ($329.99 at Amazon). It has a great design, an excellent rotating crown, a huge display, and some of the best battery life and charging speeds available on a Wear OS watch today. OnePlus’s health tracking platform isn’t as robust, and there’s no LTE model available; however, it’s still an incredibly good value for $330. And, of course, it’s worth keeping an eye on the Pixel Watch 4, which is expected to arrive on August 20.\nGiven the mounting competition and the Watch 8 Classic’s relatively steep price, I’ll be the first to admit that it’s not the most sensible or practical smartwatch you can buy. If your primary concern is getting the most bang for your buck, you’re better off with something else.\nBut if you place value in how a watch looks and how it makes you feel, the Galaxy Watch 8 Classic can’t be ignored. I adore its design. I can’t get enough of that rotating bezel. It’s how the Galaxy Watch 8 Classic gets the meat and potatoes right while simultaneously being a genuinely fun and attractive timepiece — something a base Galaxy Watch or Pixel Watch will never achieve in the same way.\nIf that’s the kind of Wear OS watch you’re after, the Samsung Galaxy Watch 8 Classic is the one for you.\n- The rotating bezel is back\n- New watch band system is fantastic\n- One UI 8 Watch is a huge upgrade\n- Gemini built-in\n- Endless Samsung Health features\n- Running Coach is a great addition\n- 1.3-inch display feels cramped\n- Wonky SpO2 tracking\n- Antioxidant and vascular load features are questionable\n- Significantly more expensive than regular Galaxy Watch 8\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.reddit.com/r/GooglePixel/comments/1n7d23i/pixel_pro_10_xl_and_galaxy_watch_ultra_bluetooth/",
      "text": "The (un)official home of #teampixel and the #madebygoogle lineup on Reddit. Get support, learn new information, and hang out in the subreddit dedicated to Pixel, Nest, Chromecast, the Assistant, and a few more things from Google.\nPixel Pro 10 Xl and Galaxy watch Ultra Bluetooth connectivity issues\nI am having serious issues in pairing the phone with the Samsung watch Ultra. The pairing stops around 85% and then continues to search for Bluetooth device. The watch has been updated to the August security patch yesterday and after that had noticed significant battery drain. As a result reset the watch and has lead to pairing issues.\nIs anyone else having this issue. Thanks"
    },
    {
      "url": "https://www.androidauthority.com/google-pixel-september-2025-security-update-fixes-3594340/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nFrom Battery Health to fingerprint unlock, Google just fixed a lot on your Pixel\nSeptember 3, 2025\n- Google has started rolling out the September 2025 security patch for Pixel phones.\n- The update is arriving for the Pixel 6 and newer devices, including the Pixel Tablet.\n- As usual, the security update is rolling out alongside the latest Pixel Drop.\nGoogle is now rolling out the September security update to Pixel phones. Over the next few weeks, all supported Pixel devices, i.e., Pixel 6 and above, running Android 16, will get the latest patches. The September update is not to be confused with the latest Pixel Drop, which brings a number of new features to older Pixel phones and other Pixel devices.\nWhen the September security patch is available for your Pixel phone, you should receive a notification alerting you about the update. Alternatively, you can head to Settings > Security and privacy > System and updates > Security update to check for the September patch. We’ve already received the 73.09MB update on our Pixel 10 Pro XL, but the size of the update may vary on your device.\nDon’t want to miss the best from Android Authority?\n- Set us as a preferred source in Google Search to support us and make sure you never miss our latest exclusive reports, expert analysis, and much more. Find out more here.\nOnce again, it’s imperative to check your Android version. The security update will only be available to phones and tablets running Android 16.\nWhat’s included in the September Pixel security update?\nThe September security update for Pixels includes a long list of bug fixes and improvements. Google has resolved some long-standing and known issues, including some impacting the latest Pixel 10 trio. Here’s the complete changelog:\nAudio\n- Fix for issue Call Audio quality in certain conditions\n- Fix for issue causing occasional system instability and performance slowdowns in certain conditions\n- General improvements for system stability and performance in certain conditions\nBattery & Charging\n- Fix for: Battery Health display issues in certain conditions\nBiometrics\n- General improvements for fingerprint recognition and response in certain conditions\nBluetooth\n- Fix for improvements in stability or performance for Bluetooth in certain conditions\nCamera\n- General improvements for camera stability and performance in certain conditions\nDisplay & Graphics\n- Fix for issue with screen turning black during transitions from a webpage in the in-app browser under certain conditions\nFramework\n- Fix for an issue where users are unable to type and keyboard stops responding in certain conditions\n- Fix for issue with the power button stops working, in certain instances when connected to Android Auto and charging via USB-C\n- Fix for secondary language showing up in quick settings in certain conditions\n- General improvements for performance and stability in certain UI transitions\nKernel\n- Fix for a stability and performance in certain conditions\nSystem\n- Fix for a system stability and performance issues in certain conditions\n- Fix for issue causing Pixel launcher crash in certain conditions\n- Fix for issue occasionally causing system instability in certain conditions\nTelephony\n- General improvements for network connection stability and performance in certain conditions\nUser Interface\n- Fix for a crash impacting Android stability metrics\n- Fix for a Java crash in System UI related to the Quick Tap gesture\n- Fix for devices becoming unresponsive to touch across multiple screens or apps in certain conditions\n- Fix for issue where long screenshots would sometimes duplicate content in certain conditions\n- Fix for issues with navigation gestures in certain conditions\n- Fix for issues with Quick Settings (QS) shade in certain conditions\n- Fix for: Home button not responding reliably, leading to a frustrating user experience and difficulty navigating applications\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung-galaxy-watch-8/",
      "text": "Pages tagged:\nSamsung Galaxy Watch 8\nGalaxy Watches and Pixel 10 phones are currently incompatible\nWe can confirm what countless Pixel 10 owners are reporting. The phones are refusing to pair with Samsung's watches.\nAdamya Sharma31 minutes ago\n0\nAdamya SharmaAugust 29, 2025\n0\nThe Galaxy Watch 8 is the first smartwatch I forgot I was wearing\n8 reasons I'd get the Google Pixel Watch 4 over the Samsung Galaxy Watch 8\nKaitlyn CiminoAugust 20, 2025\n0\nAfter using the Galaxy Watch 8, there's one feature I hope Google steals for the Pixel Watch 4\nJoe MaringAugust 18, 2025\n0\nI spent two weeks with the Galaxy Watch 8 Classic, and I really think it's worth $500\nJoe MaringAugust 15, 2025\n0\nHot sale: Samsung's new smartwatches still come with freebies!\nEdgar CervantesAugust 12, 2025\n0\nThis $10 watch band made my Galaxy Watch 8 Classic so much better\nJoe MaringAugust 11, 2025\n0\nSamsung bashes Chinese watches, says it's already working on Galaxy Watch 9, 10\nTushar MehtaAugust 8, 2025\n0\nMy go-to custom Pixel and Galaxy Watch face is down to $0.49 (plus more faces on sale)\nRita El KhouryAugust 6, 2025\n0\nLove your new Galaxy Watch 8? Here's one setting you need to fix immediately\nJoe MaringJuly 29, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nWant more Android Authority? How to set us as your preferred source in Google Search\nAugust 12, 2025\nSince 2007, Android Authority has strived to bring all of our readers the very best coverage of Android and the mobile tech world. And even after 18+ years as a proudly independent media outlet, we’re as driven as we’ve ever been to bring you all the latest exclusive reports, app teardowns, leaks, hands-on reviews, experience-based features, lab testing, and other expert analysis.\nOf course, how we’ve been able to get that coverage to you has changed in countless ways during that time, be it via our website, YouTube channel, social media, or new projects like Authority Insights, which combines our elite reporting with a podcast and a newsletter, as well as our brand new YouTube channel from Android Authority‘s Pixel guy, C. Scott Brown.\nWe want to continue to bring you the very best Android and mobile tech coverage, and you can help us do that.\nWe know and deeply appreciate that so many of you repeatedly visit our website and other channels to constantly see what we’ve been working on, often every day. Every one of those clicks or interactions helps us remain independent and every bit as innovative and ambitious as we’ve been since day one.\nSo, if you want to see even more of our content, guarantee you don’t miss anything from us, or just want to continue to support our mission, we’d like to ask you a big favor and set Android Authority as a preferred source in Google Search. It only takes a few seconds, it doesn’t cost you anything, and it will help us continue to bring you the best possible content for the next decade and beyond.\nThis feature is currently only available in the US and India, but we’ll let you know when other regions are included in this new feature. For those who already have it, here’s how to do it:\nHow to set Android Authority as a preferred source\nMethod 1:\n- Head to this link and you can add us directly to your list of preferred sources.\nMethod 2:\n- Search for a topic that’s in the news and find the “Top stories” header. If you don’t see this, you might need to input a different query. “Galaxy S26 Pro” worked for us at the time of writing.\n- Click on the icon on the right of the “Top stories” header. That’s the icon with the stacked squares and a star on top.\n- Search for “Android Authority” and select it to set it as a preferred source. You can add other websites at this stage, too — support your favorite publications!\n- Refresh your search results to see more from your favorite sites.\nOnce again, a big thank you to all our readers, viewers, and followers — your passion for Android and tech is what pushes us forward. We hope you’ll add us as a preferred source (and please feel free to encourage any other tech enthusiasts you know to do the same!), but even if you don’t, we’re grateful for every one of you that supports our work in any way possible. And as ever, if you have any feedback for us, please drop an email to contact@androidauthority.com.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung-galaxy-watch/",
      "text": "Pages tagged:\nSamsung Galaxy Watch\nGalaxy Watches and Pixel 10 phones are currently incompatible\nWe can confirm what countless Pixel 10 owners are reporting. The phones are refusing to pair with Samsung's watches.\nAdamya Sharma1 hour ago\n0\nRyan McNealAugust 29, 2025\n0\nThe time to say goodbye to your Tizen OS smartwatch is almost here\nPairing your Galaxy Watch with a non-Samsung phone? Here’s what you’re missing out on\nAndy WalkerAugust 16, 2025\n0\nThis is the first thing I set up after pairing my Samsung phone with a Galaxy Watch\nAndy WalkerAugust 9, 2025\n0\nMy go-to custom Pixel and Galaxy Watch face is down to $0.49 (plus more faces on sale)\nRita El KhouryAugust 6, 2025\n0\nApple Watch could get this feature that Galaxy and Pixel Watches have offered for ages\nTushar MehtaJuly 23, 2025\n0\nAndroid 16 QPR1 Beta 3 delivers fix for persistent Galaxy Watch connection problems\nRyan McNealJuly 22, 2025\n0\nGalaxy Watch users might want to stay away from testing QPR1 betas\nStephen SchenckJuly 16, 2025\n0\nUpgrading to the Galaxy Watch 8? I hope you're not too attached to your old Galaxy watch bands...\nAdamya SharmaJuly 9, 2025\n0\nThis $10 accessory was the best thing I ever bought for my Galaxy Watch\nAndy WalkerJuly 8, 2025\n0"
    }
  ],
  "argos_summary": "Pixel 10 series phones are unable to pair with Samsung Galaxy Watch 8 and Ultra models over Bluetooth, with users reporting failures at the pairing code stage and subsequent battery drain. The problem appears specific to Pixel 10 devices, as the watches pair fine with Samsung phones. Both Google and Samsung are working on a fix, expected in future software updates.",
  "argos_id": "HZZ7ARJLA"
}