{
  "url": "https://www.cnn.com/2025/09/01/china/china-axis-of-upheaval-sco-summit-parade-dst-intl-hnk",
  "authorsByline": "Simone McCarthy",
  "articleId": "0a59157ce6594872b6b56b8f876bd4f4",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2232712124.jpg?c=original/w_800",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T04:01:43.875000+00:00",
  "addDate": "2025-09-02T04:07:39.796462+00:00",
  "refreshDate": "2025-09-02T04:07:39.796465+00:00",
  "score": 1.0,
  "title": "Leaders of China, Russia, North Korea and Iran gather in Beijing as ‘Axis of upheaval’ emerges in challenge to the West",
  "description": "For the last three days, Xi Jinping has played host in one of China’s busiest port cities, welcoming leaders from across Asia and the Middle East for a carefully choreographed summit designed to showcase his vision of a new world order.",
  "content": "For the last three days, Xi Jinping has played host in one of China’s busiest port cities, welcoming leaders from across Asia and the Middle East for a carefully choreographed summit designed to showcase his vision of a new world order.\n\nNow, the Chinese leader is set to exhibit a very different image with an ostentatious show of military might.\n\nOn Wednesday he will commandeer Beijing’s main artery – the Avenue of Eternal Peace – for a major military parade showing off the country’s cutting-edge hypersonic weapons, nuclear-capable missiles, and undersea drones, alongside thousands of goose-stepping soldiers.\n\nXi’s message with his multi-day exercise of soft and hard power, is clear: China is a force that wants to reset global rules – and it’s not afraid to challenge those of the West.\n\nHitting that message home is Xi’s guest list for the gathering, a cohort of more than two dozen China-friendly world leaders topped by Russian President Vladimir Putin and North Korean leader Kim Jong Un, which also includes Iranian President Masoud Pezeshkian.\n\nThat also makes the first time that the leaders of a quartet of nations Washington strategists warn are converging to form an anti-American “axis of upheaval” will be together in one event.\n\nFor the Western leaders desperately trying to ramp up pressure on Putin to end his war in Ukraine, those optics will appear stark.\n\nIran, North Korea, China and Russia are seen as an emerging anti-American axis by some observers in the West precisely because Tehran and Pyongyang have fed Moscow weapons and – in the case of Pyongyang – troops, while China has aided its war-torn economy and industry.\n\nAs Xi gives them seats by his side on a symbolic day for China, he is showing himself as the one global heavyweight who could stand a real chance to pressure Putin to end his war – and that he’s not going to use that pull to play by the West’s rules.\n\nFor Xi, China’s longest-serving and most powerful leader in decades, the symbolism – and its timing – will be purposeful.\n\nUnder President Donald Trump, the US is shaking up its alliances and causing economic pain for countries around the world, including among friends and allies, with his global trade war. Xi sees an opportune moment to make what might be his most dramatic showing yet of his challenge to a world based on Western rules and sensibilities.\n\nAlready the optics are paying off for the Chinese leader.\n\nGlimpses of the leaders’ activities in recent days have shown a powerful camaraderie among those gathered, with Modi and Putin greeting Xi animatedly, Modi embracing Putin, and leaders reaching out to greet the Russian leader as he walked walks shoulder to shoulder with Xi.\n\nThese moments are arguably as powerful outcomes as the statements made, signaling a convergence of leaders without the West.\n\n“What Xi is trying to convey is certainty about China’s role in international affairs. This is clearly signaling to people throughout the region that China has arrived as a great power and it’s not going anywhere,” said Jonathan Czin, the Michael H. Armacost Chair in Foreign Policy Studies at Brookings.\n\n“If you’re a US ally or partner, sitting in a capital somewhere in the region, and you have real doubts about whether or not you can rely on the United States as a partner, that’s an uncomfortable split screen to be viewing,” he added.\n\nThroughout his pageantry and diplomacy of recent days, Xi has appeared well aware of the opening the shake-up of American foreign policy has given him.\n\nIn his speeches and meeting with leaders gathered for the Shanghai Cooperation Organization (SCO) on Sunday and Monday – a cohort of leaders from as far afield as the Maldives to Mongolia – Xi played up a message that world is in a state of flux and chaos, and China is the responsible, stable power to guide it into the future.\n\n“We must) oppose the cold war mentality, block confrontation and bullying practices,” Chinese leader Xi Jinping declared as he spoke to a room of gathered leaders Monday, using language that’s long been China’s code to describe what it sees as the US’ behavior. He also pledged hundreds of millions in grants to SCO member states this year – and launched a push to reform the international system.\n\nThe message is not new, but Beijing is betting it lands differently after the leading global superpower has cut off its vast network of foreign aid, slapped crippling tariffs on developing countries, and raised questions among its allies and partners about whether it really has their backs.\n\nAs China’s leader put it in a speech late Monday: “The house rules of a few countries should not be imposed upon others.”\n\nAnd Xi has already seen benefits from the American shift.\n\nLook no further than India, whose Prime Minister Narendra Modi was seen smiling and laughing as he spoke with Xi beside Putin on Monday – a significant show of warmth from a leader long wooed by US as an Asian counterweight to China.\n\nJust last month India was slapped up 50% tariffs on its exports to the US, half of those due as a penalty for its purchases of Russian oil, which the US sees as helping to fund Putin’s war.\n\nAnd even for countries, like those in Southeast Asia, who have long looked warily at China’s growing military power and assertiveness when it comes to its territorial claims in the South China Sea and over Taiwan, the shifting global dynamics could have an effect, observers say.\n\nIf there’s a time to woo leaders that have long tried to hedge between the US and China, said Chong Ja Ian, an associate professor at the National University of Singapore, “the time is now.”\n\nBut as much as Xi is using these his highly choreographed itinerary this week to pitch his leadership to a broad cohort of nations, he’s also using it to push back on Western criticism of his longstanding ties with partners like North Korea, Russia and Iran – all seen as rogue actors by the West.\n\nIn the wake of Putin’s war in Ukraine, voices in Washington have warned of an emerging coordination between what’s been alternatively dubbed an “axis of upheaval” or an “axis of growing malign partnerships” – though experts say so far there’s been few signs of four-way coordination.\n\nAt least until now.\n\n“(China’s military parade) will be the first time that the leaders of China, Russia, North Korea, and Iran are all present in the same place,” said Brian Hart, a fellow of the China Power Project at the Center for Strategic and International Studies (CSIS). “There have been little or no quadrilateral engagements between the four countries, so this is a distinctive moment.”\n\nChina has been careful to not be seen as explicitly endorsing these countries’ aggression – for example it’s widely seen to have sent large quantities of dual-use goods but not lethal weapons to Russia as it wages its war.\n\nBut as Xi gathers these players together, he wants to signal that he can set the rules around who “should be deemed acceptable by the international community, regardless of what the democratic West or the US may think,” according to Steve Tsang, director of the SOAS China Institute at the University of London.\n\nEven still, the optics may also appear less stark with Trump in the White House. Last month, he hosted Putin for an apparently friendly summit where he said he’d “always had a fantastic relationship” with the warring leader and greeted him personally on the tarmac.\n\nThe American president also used a meeting with South Korean President Lee Jae Myung last month to discuss meeting again with Kim. Both would be peace efforts – but Trump is well known to praise these autocrats.\n\nBut Xi’s message is part of a more sweeping vision for the Chinese leader, who may see no more fitting a moment to signal his alignments than the upcoming military parade, which commemorates the 80th anniversary Japan’s surrender in World War II and China’s role fighting the imperial power that waged a years-long and brutal invasion of its lands.\n\nLike Putin, Xi has looked to pull from that history to reshape a narrative that positions China and Russia, which fought in World War II as the Soviet Union, as guardians of a “post-war” international order, distinct from the US-one they see as dominant now.\n\nIn Xi and Putin’s eyes, a key cause of the war in Ukraine today – or even North Korea’s bid to develop nuclear weapons – is not those countries’ aggressions, but the US and its allies ignoring their “legitimate security concerns.”\n\nAnd more broadly, their rhetoric blames the US and the alliances and value systems it formed in the wake of World War II for global crises, confrontation and disparity in the world today.\n\nThis week, Xi is “unapologetically defending a post–World War II order that he sees as under assault by Western powers determined to block China’s rise,” said Tong Zhao, a senior fellow at Carnegie Endowment of International Peace in the US.\n\nAnd as he surveys the global landscape and calls leaders from near and far to his side, Zhao added, “Xi is pressing ahead with a campaign to delegitimize US leadership, weaken Western solidarity, and elevate China as a credible alternative.”",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/2025/09/01/asia/north-korea-kim-jong-un-missile-inspection-intl-hnk",
    "https://www.cnn.com/2025/09/01/china/china-putin-xi-meeting-sco-summit-intl-hnk",
    "https://www.cnn.com/2025/08/26/india/india-china-relations-sco-summit-intl-hnk",
    "https://www.cnn.com/follow",
    "https://www.cnn.com/2025/08/27/china/china-military-parade-putin-kim-intl-hnk",
    "https://www.cnn.com/2025/09/01/china/china-sco-summit-xi-address-intl-hnk",
    "https://www.cnn.com/world/europe/ukraine",
    "https://www.cnn.com/2025/08/30/china/chinas-xi-rolls-out-red-carpet-for-putin-modi-as-trump-upends-global-relations"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chinese leader Xi Jinping",
      "weight": 0.08349136
    },
    {
      "name": "China",
      "weight": 0.0797142
    },
    {
      "name": "gathered leaders",
      "weight": 0.07765922
    },
    {
      "name": "Leaders",
      "weight": 0.07434841
    },
    {
      "name": "leaders",
      "weight": 0.07434841
    },
    {
      "name": "Xi Jinping",
      "weight": 0.06254529
    },
    {
      "name": "Xi",
      "weight": 0.061763432
    },
    {
      "name": "North Korean leader Kim Jong Un",
      "weight": 0.061692487
    },
    {
      "name": "US leadership",
      "weight": 0.060849685
    },
    {
      "name": "US",
      "weight": 0.059297267
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97412109375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.96142578125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.96044921875
    },
    {
      "name": "/News/World News",
      "score": 0.94384765625
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.455810546875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.30615234375
    }
  ],
  "sentiment": {
    "positive": 0.17623995,
    "negative": 0.4530209,
    "neutral": 0.3707392
  },
  "summary": "Chinese President Xi Jinping has hosted a summit with leaders from across Asia and the Middle East to showcase his vision of a new world order. The event, which includes leaders from China, Russia, North Korea, and Iran, is seen as an anti-American \"axis of upheaval\" as a challenge to the West. Xi's message is clear that China is a force that wants to reset global rules and is not afraid to challenge them. The timing of the event coincides with the US's global trade war, which has caused economic pain for allies and allies. Observers suggest this is a powerful opportunity for Xi to pressure Putin to end his war in Ukraine.",
  "shortSummary": "China, Russia, North Korea, and Iran leaders gather in Beijing to showcase their shared vision for a new global order, emphasizing China's military might and global cooperation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1e3230347c1a454c9f8df3f81947d6e5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/world/europe/ukraine",
      "text": "Latest News\n-\nXi and Kim pledge deeper ties a day after unprecedented show of unity with Putin at Chinese military parade\n-\nTrump pushes Europe to stop buying Russian oil and up pressure on China in effort to end Ukraine war\n-\nTrump and Putin both agree: Blame falls on Europe as Ukraine peace effort languishes\n-\n• Live Updates Live UpdatesLive Updates September 4, 2025: Trump administration news\n-\n• Live Updates Live UpdatesLive Updates September 3, 2025: Trump administration news\n-\nPlane carrying EU’s top leader targeted by alleged Russian GPS jamming\nAd Feedback\n-\nPutin hails ‘unprecedentedly high’ relations with China as Gazprom says it signed new gas deal\n-\nTrump readies crushing autumn power plays as Democrats search for direction\n-\nBessent says ‘all options are on the table’ for further sanctions against Russia as Ukraine war continues\n-\nXi and Putin stand shoulder to shoulder as China casts itself an alternative global leader\n-\nNorth Korea releases propaganda video praising its soldiers who fought for Russia\n-\nXi and Modi talk friendship in a ‘chaotic’ world as Trump’s tariffs bite\n-\nProminent Ukrainian politician shot dead in ‘carefully planned attack,’ police say\n-\nNorth Korea leader Kim promises ‘beautiful life’ for families of ‘martyrs’ killed in Russia\n-\nLawyer Alan Dershowitz loses appeal in CNN defamation case\n-\nTrump weighs whether to deepen his involvement in Ukraine war talks – or leave things to Putin and Zelensky\nVideos\n-\n• Video 2:20Video Inside the US military’s push for small, cheap drones that have transformed the battlefield 2:20\n-\n• Video 10:16Video ‘China’s been handed an open goal by the Trump administration,’ says analyst 10:16\n-\n• Video 0:52Video Video: Ukraine strikes strategically important bridges in Russia 0:52\n-\n• Video 2:59Video Russia and China redouble their efforts to reshape the world order 2:59\n-\n• Video 1:06Video Video shows moment Russian missile hits house in Kyiv 1:06\n-\n• Video 13:08Video ‘Putin’s goal is all of Ukraine,’ says journalist 13:08\n-\n• Video 1:10Video North Korea admits its troops died in Russia’s war 1:10\n-\n• Video 2:59Video In the trenches with soldiers defending southeastern Ukraine 2:59\n-\nChina snaps up Russian oil as Indian demand drops following Trump tariffs\n-\nZelensky meeting shows how the White House has remade the press corps to Trump’s liking\n-\nTrump is open to doing business with Russia. That could be tricky\n-\nTrump’s relentless tariff strategy finally crashes into delicate geopolitical reality\n-\nTrump’s plan to punish buyers of Russian oil would hurt America’s own economy\n-\nTrump to speak with Zelensky Thursday as momentum to end Russia’s war in Ukraine stalls\n-\nExperts see fissures despite Xi, Putin and Kim’s show of unity\n-\nTrump is furious at China, but he’s making US foes great again\n-\nCongress returns to a messy fall with Democrats ready to fight\n-\nWinter is coming for Ukraine: What it will take to keep the lights on"
    },
    {
      "url": "https://www.cnn.com/2025/08/27/china/china-military-parade-putin-kim-intl-hnk",
      "text": "North Korean leader Kim Jong Un and Russian President Vladimir Putin will be among more than two dozen foreign leaders to attend China’s massive military parade next week, the Chinese Foreign Ministry announced Thursday.\nThe parade, to be held in Beijing’s Tiananmen Square on September 3, is part of China’s commemorations to mark the 80th anniversary of the end of World War II following Japan’s formal surrender.\nThe announcement, which places Putin and Kim at the top of Xi’s guest list, sets the stage for an extraordinary photo-op with the three autocratic leaders standing side by side atop the Gate of Heavenly Peace in Beijing, in an unequivocal show of unity.\nNorth Korean state news agency KCNA confirmed Kim’s attendance, in what would be the North Korean leader’s first trip to China since 2019. Kim, who has only embarked on 10 foreign trips since assuming power in 2011, last left his isolated country in 2023 to meet Putin at a remote spaceport in Russia’s far east.\nThe parade offers the reclusive head of the world’s most heavily sanctioned regime a rare opportunity to appear alongside other world leaders who are gravitating toward an alternative world order Xi and Putin have pushed to create.\nConfirmation of Kim’s attendance at the parade comes just days after US President Donald Trump said he would like to meet the North Korean leader this year.\nHardware and pageantry\nBeijing is projecting military strength at a time of heightened geopolitical uncertainty as Trump upends American alliances and partnerships. It also comes amid China’s increasingly assertive posture toward Taiwan and its territorial disputes with neighboring countries.\nA total of 26 foreign heads of state and government will attend the parade, including Pakistan’s Prime Minister Shehbaz Sharif, Assistant Foreign Minister Hong Lei told a news conference in Beijing.\nNarendra Modi, the prime minister of Pakistan’s arch-rival India, who will be in the Chinese city of Tianjin for a summit of the Shanghai Cooperation Organization this weekend, is not among the list of leaders attending the parade.\nMyanmar’s junta chief Min Aung Hlaing, who is serving as that country’s acting president after a military coup toppled an elected government in 2021 and plunged the country into a devastating civil war, will also attend.\nOther guests include Russia-friendly European leaders Aleksandar Vucic of Serbia and Slovakia’s Robert Fico.\nNotably absent are leaders from major Western capitals, even though China was a crucial partner of the Allied powers in the Pacific Theater of World War II. The country’s fight against Japan’s full-scale invasion became a major front of the war in Asia, ending only in 1945 with Japan’s surrender.\nConflict continued in China between communist and nationalist forces until the former eventually came out on top in 1949 leading to the creation of the People’s Republic of China that Xi now helms.\nWednesday’s 70-minute parade will feature more than 10,000 troops, over 100 aircraft and hundreds of pieces of ground equipment, showcasing China’s growing military power under Xi, who has made the modernization of the People’s Liberation Army (PLA) a central mission of his rule.\nThe tightly choreographed spectacle will offer a rare glimpse into China’s fast-advancing military technology. Officials have said all equipment on display are domestically produced and currently in service, with many making their debut – ranging from cutting-edge drones, electronic jamming systems, hypersonic weapons, air-defense and missile-defense technologies to strategic missiles.\nBeijing has been the main political and economic patron for North Korea for decades, providing a crucial lifeline for its heavily sanctioned economy. North Korea is also China’s only formal ally, with a mutual defense treaty signed in 1961.\nIn recent years, North Korea has forged closer ties with Russia amid Moscow’s grinding war against Ukraine, complicating East Asia’s geopolitical balance and China’s efforts to maintain regional stability.\nXi, Putin’s most powerful backer, has watched warily as the Russian leader and Kim forged a new alliance that saw North Korea sending troops to join Russia’s war on Ukraine. Last year, Putin and Kim signed a landmark defense pact in Pyongyang and pledged to provide immediate military assistance in the event the other is attacked – a move that has rattled the US and its Asian allies.\nHong, the Chinese assistant foreign minister, hailed China and North Korea’s “traditional friendship” in the press conference Thursday, noting the two countries supported each other in the fight against Japan’s invasion eight decades ago.\n“China is willing to continue to work hand in hand with North Korea to strengthen exchanges and cooperation, advance socialist construction, and closely collaborate in promoting regional peace and stability as well as safeguarding international fairness and justice” Hong said.\nThis story has been updated with additional developments."
    },
    {
      "url": "https://www.cnn.com/follow",
      "text": "Close icon\nUS\nWorld\nPolitics\nBusiness\nHealth\nEntertainment\nUnderscored\nStyle\nTravel\nSports\nScience\nClimate\nWeather\nUkraine-Russia War\nIsrael-Hamas War\nGames\nMore\nUS\nWorld\nPolitics\nBusiness\nHealth\nEntertainment\nUnderscored\nStyle\nTravel\nSports\nScience\nClimate\nWeather\nUkraine-Russia War\nIsrael-Hamas War\nGames\nWatch\nListen\nLive TV\nSubscribe\nSign in\nMy Account\nSettings\nNewsletters\nTopics you follow\nSign out\nYour CNN account\nSign in to your CNN account\nSign in\nMy Account\nSettings\nNewsletters\nTopics you follow\nSign out\nYour CNN account\nSign in to your CNN account\nLive TV\nListen\nWatch\nEdition\nUS\nInternational\nArabic\nEspañol\nEdition\nUS\nInternational\nArabic\nEspañol\nUS\nCrime + Justice\nWorld\nAfrica\nAmericas\nAsia\nAustralia\nChina\nEurope\nIndia\nMiddle East\nUnited Kingdom\nPolitics\nTrump\nFacts First\nCNN Polls\n2025 Elections\nBusiness\nTech\nMedia\nCalculators\nVideos\nMarkets\nPre-markets\nAfter-Hours\nFear & Greed\nInvesting\nMarkets Now\nNightcap\nHealth\nLife, But Better\nFitness\nFood\nSleep\nMindfulness\nRelationships\nCNN Underscored\nElectronics\nFashion\nBeauty\nHealth & Fitness\nHome\nReviews\nDeals\nGifts\nTravel\nOutdoors\nPets\nEntertainment\nMovies\nTelevision\nCelebrity\nTech\nInnovate\nForeseeable Future\nMission: Ahead\nWork Transformed\nInnovative Cities\nStyle\nArts\nDesign\nFashion\nArchitecture\nLuxury\nBeauty\nVideo\nTravel\nDestinations\nFood & Drink\nStay\nVideos\nSports\nPro Football\nCollege Football\nBasketball\nBaseball\nSoccer\nOlympics\nHockey\nScience\nSpace\nLife\nUnearthed\nClimate\nSolutions\nWeather\nWeather\nVideo\nClimate\nUkraine-Russia War\nIsrael-Hamas War\nWatch\nLive TV\nCNN Headlines\nCNN Shorts\nShows A-Z\nCNN10\nCNN Max\nCNN TV Schedules\nFlashDocs\nListen\nCNN 5 Things\nChasing Life with Dr. Sanjay Gupta\nThe Assignment with Audie Cornish\nOne Thing\nTug of War\nCNN Political Briefing\nThe Axe Files\nAll There Is with Anderson Cooper\nAll CNN Audio podcasts\nGames\nDaily Crossword\nJumble Crossword\nPhoto Shuffle\nSudoblock\nSudoku\n5 Things Quiz\nAbout CNN\nSubscribe\nPhotos\nInvestigations\nCNN Profiles\nCNN Leadership\nCNN Newsletters\nWork for CNN\nFollow CNN\nTopics you follow\nManage your email update preferences in\nAccount Settings\n.\nNew: Get the latest updates on topics you follow in your email inbox.\nSign up now\nAdd more topics\nSelect topics to follow\nUnlock your personalized feed and get email updates on topics you follow with a free CNN account.\nPopular\nAI\nAstronomy\nAviation news\nClimate change\nCongressional news\nDOGE\nEric Adams\nExtreme temperatures\nFashion and beauty\nGreen energy\nGun control\nHistory uncovered\nHurricanes\nImmigration\nInflation\nIsrael-Hamas war\nLGBTQ issues\nMovies\nOlympics\nRace & ethnicity\nStorms\nSupreme Court\nTariffs\nTech news\nThe Pope\nTikTok\nTrump legal cases\nUS military\nWar in Ukraine\nWellness\nAll\n5 Things\nAaron Rodgers\nAbortion rights\nAbuse in church\nActivism\nAdam Sandler\nAdele\nAfrica\nAge & Generations\nAgriculture\nAI\nAir quality\nAir travel safety\nAirplane crashes\nAlex Morgan\nAncient creatures\nAngel Reese\nAnimal stories\nAOC\nAriana Grande\nAsia\nAstronomy\nAuto industry\nAviation news\nAwards shows\nBaltimore bridge collapse\nBasketball\nBeatles\nBeyoncé\nBiden family\nBiden's cabinet\nBillie Eilish\nBono\nBrad Pitt\nBradley Cooper\nBritney Spears\nBruce Springsteen\nBTS\nCaitlin Clark\nCampus protests\nCancer\nCardi B\nChildren's health\nChina\nChronic diseases\nCivil conflicts\nClimate & Wildlife\nClimate change\nClint Eastwood\nCoco Gauff\nCongressional news\nCorporate news\nCrime\nCristiano Ronaldo\nCruises\nCrypto\nCulture wars\nDeep space\nDementia\nDemocratic Natl Committee\nDemocratic Natl Convention\nDemocratic presidential candidates\nDenzel Washington\nDigital privacy\nDigital security\nDisability issues\nDiversity and equity\nDOGE\nDolly Parton\nDonald Trump\nDrought\nDrugs in society\nDua Lipa\nDwayne Johnson\nEarthquakes\nEconomy\nEducation policy\nElection polls\nElection security\nElectoral college\nEllen DeGeneres\nElton John\nEndangered life\nEnvironmental disease\nEric Adams\nEuropean Union\nExtreme temperatures\nFashion and beauty\nFEC\nFederal agencies\nFighting disinformation\nFlorence Pugh\nFood & drink\nFood & health\nFootball\nFreedom of religion\nFreedom of speech\nGardening\nGenetics\nGeorge Clooney\nGeorgia election case\nGetting older\nGolf\nGreen energy\nGubernatorial elections\nGun control\nGun violence\nHarry Styles\nHealth care policy\nHeart disease\nHistory uncovered\nHomes\nHouse election\nHouse leadership\nHousehold debt\nHuman rights\nHurricanes\nImmigration\nImmigration politics\nIndependent candidates\nIndia\nIndigenous people\nInflation\nInterest rates\nInterior design\nInvesting\nIsrael-Hamas war\nJanuary 6th\nJapan\nJason Aldean\nJay-Z\nJD Vance\nJennifer Lawrence\nJennifer Lopez\nJessica Pegula\nJob market\nJoe Biden\nJohnny Depp\nJulia Roberts\nJustin Bieber\nKamala Harris\nKanye West\nKaty Perry\nKim Kardashian\nKylian Mbappe\nLabor unions\nLady Gaga\nLeBron James\nLeonardo DiCaprio\nLewis Hamilton\nLGBTQ issues\nLibertarian Party\nLionel Messi\nLively-Baldoni lawsuit\nLizzo\nMadonna\nMaria Sharapova\nMaternal health\nMatt Gaetz\nMax Verstappen\nMedia\nMedicare\nMegan Rapinoe\nMegan Thee Stallion\nMen's health\nMental health\nMeryl Streep\nMexico\nMichael Jordan\nMick Jagger\nMike Tyson\nMiley Cyrus\nMovies\nMusic\nNational security\nNATO\nNew in medicine\nNorth Korea\nNovak Djokovic\nNRA\nObituaries\nOceania\nOil & gas\nOlivia Rodrigo\nOlympics\nOprah Winfrey\nPACs\nParenting\nPatrick Mahomes\nPaul McCartney\nPay & income\nPedro Pascal\nPeople in entertainment\nPeople in sports\nPersonal finance\nPete Hegseth\nPlanned Parenthood\nPolicing\nPollution\nPort workers strike\nPoverty\nPrescription drugs\nPresidential debates\nPrimary elections\nRace & ethnicity\nRafael Nadal\nRail travel\nReality entertainment\nRelationships\nReligion\nRepublican National Committee\nRepublican National Convention\nRepublican presidential candidates\nRespiratory viruses\nRetail consumer\nRingo Starr\nRolling Stones\nRoyals\nRussia\nSam Bankman-Fried\nSamuel L. Jackson\nSean 'Diddy' Combs\nSenate election\nSenate leadership\nSerena Williams\nShaquille O'Neal\nShohei Ohtani\nSimone Biles\nSoccer\nSocial media\nSouth America\nSouth Korea\nSpace programs\nSpace tourism\nState & local races\nSteph Curry\nStocks\nStorms\nStudent life\nSupreme Court\nSupreme Court justices\nSustainability\nSyria conflict\nTariffs\nTaxes\nTaylor Swift\nTech giants\nTech news\nTennis\nTerrorism\nThe Amazon\nThe Caribbean\nThe Middle East\nThe Pope\nThe UN\nTiger Woods\nTikTok\nTim Walz\nTom Brady\nTom Cruise\nTom Hanks\nTrain accidents\nTravel News\nTravis Kelce\nTrump appointments\nTrump family\nTrump legal cases\nTulsi Gabbard\nTupac Shakur killing\nTV shows\nTyler Perry\nUK\nUS elections\nUS military\nUS shutdown\nVaccines\nVehicle safety\nVenus Williams\nVeterans\nVideo gaming\nVisual arts\nVolcanoes\nVoting rights\nWar in Ukraine\nWater availability\nWellness\nWildfires\nWill Smith\nWinding down\nWomen's health\nWork life\nZendaya\nNext\nCancel\nor\nsign in to see your topics\nFind this page again in your account menu. Feedback? Let us know at\nFollow@cnn.com\n.\nDon't miss out on new stories!\nGet updates on topics you follow in your email inbox.\nSign up\nSign up\nUh, oh. Something happened.\nIt could be you, or it could be us, but there's no page here."
    },
    {
      "url": "https://www.cnn.com/2025/08/26/india/india-china-relations-sco-summit-intl-hnk",
      "text": "A relationship frozen after a deadly clash high in the Himalayas five years ago appears to be thawing under the heat of US President Donald Trump’s economic pressure.\nFor the first time since 2018, Indian Prime Minister Narendra Modi will travel to China this week to attend a summit hosted by Chinese leader Xi Jinping, a visit that comes after Trump imposed punishing 50% tariffs on imports from India.\nIn a moment of geopolitical whiplash, the two leaders – whose soldiers fought a brutal hand-to-hand combat with fists, rocks and clubs at their disputed border in 2020 – could now shake hands, prioritizing economic stability over entrenched rivalry.\nAlongside Modi, world leaders from Russia, Pakistan, Iran and Central Asia will join Xi this weekend for what Beijing has said will be the largest summit yet of the Shanghai Cooperation Organization (SCO), a Moscow and Beijing-founded regional security club aimed at reshaping the global balance of power.\nIndia’s presence at the event is the most telling example yet of the warming ties between the two Asian powers – a budding realignment that threatens to undo years-long US efforts to cultivate New Delhi as a counterweight against a rising and increasingly assertive China.\nWhile a thaw in India and China’s fractious relationship was already underway, analysts say Trump’s “America First” policies are making the two leaders, who have built their political brands on a strong foundation of nationalism, explore a partnership of necessity.\nTrump’s imposition of tariffs over India’s purchases of Russian oil have been especially hard to swallow for Modi, who enjoyed a budding bromance with Trump during the US president’s first term.\nThe threat of the levies “infused a certain amount of urgency” in New Delhi’s pivot toward stabilizing its relationship with Beijing, said Manoj Kewalramani, who heads Indo-Pacific studies at the Takshashila Institution research center in the Indian city of Bengaluru. However he said it wasn’t the “primary driver” for a reset, with both India and China looking to stabilize their relationship for their own national interests.\nSuccessive White House administrations have worked to boost strategic ties with India through technology transfers and joint military drills, working with the world’s largest democracy to counter an increasingly assertive China in the Indo-Pacific region.\nLosing India would be “the worst outcome” for the US, analysts have said.\nFollowing a meeting between Chinese Foreign Minister Wang Yi and Prime Minister Modi in New Delhi last week, both sides recognized the recent improvements in their strained relationship.\n“India-China relations have made steady progress guided by respect for each other’s interests and sensitivities,” the Indian leader said. “Stable, predictable, constructive ties between India and China will contribute significantly to regional as well as global peace and prosperity.”\nThe view from Beijing, according to Yun Sun, director of the China Program at the Stimson Center think tank in Washington, is that “this detente was definitely started by Trump.”\n“India is no longer able to pretend that it still has strong support from (Washington),” Sun said. Therefore, Beijing’s view is that because the US has “dialed back” India has to “recalibrate its foreign policy and improve its relationship with China.”\nBut analysts say the summit is unlikely to usher in a fundamental realignment.\n“To me, it’s not a reset in the sense that India is saying ‘we are done with America.’ That’s not going to happen,” said Kewalramani.\n“The United States remains (India’s) most important partner in the world, but China is our largest neighbor,” Kewalramani said. “We have to live with it.”\nFrom brotherhood to rivalry\nThe trajectory of India-China relations has evolved from one of post-colonial brotherhood to modern-day strategic rivalry.\nIndia was one of the first countries to establish diplomatic relations with the People’s Republic of China in 1950, with that decade characterized by a shared vision of Asian solidarity. That nascent friendship was, however, shattered by the 1962 Sino-Indian War, a brief but brutal conflict that established a legacy of deep mistrust and an unresolved border dispute that remains the relationship’s festering wound.\nIn the decades that followed, the countries’ leaders took steps to build economic ties that saw bilateral trade grow, despite ongoing tensions at their shared border. But the deadly 2020 Galwan Valley clashes – which left at least 20 Indian and four Chinese soldiers dead – violently upended this balance.\n“The 2020 clashes are not simply something India can put behind it,” said Farwa Aamer, director of South Asia Initiatives at the Asia Society Policy Institute. “Instead, the aim here is to ensure no such episodes repeat, and that is where rebuilding the relationship rests on reaching a joint understanding on border stability.”\nThere has been a gradual normalization of ties between India and China after Modi and Xi met on the sidelines of the BRICS summit in Russia last October. The two sides agreed to restart direct flights cancelled since the Covid-19 pandemic, Beijing recently agreed to reopen two pilgrimage sites in western Tibet to Indians for the first time in five years, and both started re-issuing tourist visas for each other’s citizens.\nA balancing act\nIndia’s recalibration of ties with China is a textbook application of its policy of strategic autonomy, which prioritizes national interests over rigid bloc allegiance.\nAt the SCO summit, as well as China’s Xi, Modi will be in the presence of the prime minister of traditional adversary Pakistan, with whom India recently engaged in a deadly conflict, as well as traditional partner Russia, whose continued oil sales to India since its invasion of Ukraine have irked the US and pushed Trump to slap 25% tariffs on Indian goods as punishment.\nThis engagement with a China-dominated bloc stands in stark contrast to India’s deepening ties with the Quad – a security grouping with the US, Japan, and Australia – that is widely seen as a democratic counterweight to China’s growing influence in the Indian Ocean.\nWith their border dispute locked in a stalemate, India is choosing to insulate its diplomatic and economic imperatives from the security conflict with China, according to Kewalramani from the Takshashila Institution.\n“While both sides know there are structural challenges and this relationship will remain difficult, both sides realize that a deterioration to the extent that it happened is in neither’s interest,” he said.\nThe path to stability\nIndia’s strategic recalibration toward China is rooted less in a softening security posture and more in economic necessity.\nLast year, China was India’s second-largest trading partner after the US, with bilateral trade reaching $118 billion, according to data from India’s department of commerce. India depends on China not just for finished goods like electronics, but for the essential intermediate products and raw materials that fuel its own industries.\nYet, this economic entanglement exists under the shadow of a tense military reality.\nAny talks between Modi and Xi would be complicated by the tens of thousands of troops still deployed at their disputed Himalayan border and this unresolved conflict remains the primary barrier to rebuilding confidence. Last week, the two sides agreed to 10 points of consensus on their border issue, including maintaining “peace and tranquility,” according to a statement from China’s Ministry of Foreign Affairs.\nAs Tanvi Madan, a senior fellow in the Center for Asia Policy Studies in the Foreign Policy program at the Brookings Institution, notes, it’s “not clear that either side will really trust each other.”\nThe major test, she said, is whether the rhetoric from the two leaders translates to de-escalation on the ground, something that has failed before.\nThe future of the India-China relationship will be defined by their ability to manage this delicate dance.\nThe future, said Asia Society’s Aamer, will bring “perhaps a more stable relationship, where competition isn’t necessarily over, but conflict is at bay.”\nCNN’s Simone McCarthy contributed reporting"
    },
    {
      "url": "https://www.cnn.com/2025/08/30/china/chinas-xi-rolls-out-red-carpet-for-putin-modi-as-trump-upends-global-relations",
      "text": "Autocrats, populists, friends and foes, a strongman waging a war in Europe and the leader of the world’s biggest democracy will all be hosted by Chinese leader Xi Jinping this weekend at a summit designed to showcase Beijing as a global leader capable of providing a counterweight to Western institutions.\nHeads of state and delegations from across Asia and the Middle East will meet from Sunday in the Chinese port city of Tianjin for the two-day summit of the Shanghai Cooperation Organization (SCO), a regional security grouping that has emerged as a cornerstone of Xi and Russian President Vladimir Putin’s drive to rebalance global power in their favor.\nChinese officials have billed the summit as the SCO’s largest yet, with the diplomacy and pageantry setting the stage for Xi to tout his country as a stable and powerful alternative leader at a time when the world’s leading superpower the United States under President Donald Trump is shaking up its alliances and waging a global trade war.\nThe gathering also comes days ahead of a major military parade in Beijing that will offer a different message – that of China’s rapidly developing military might, and draw autocrats like North Korea’s Kim Jong Un and Myanmar’s Min Aung Hlaing alongside Putin and Russia-friendly European leaders Aleksandar Vucic of Serbia and Slovakia’s Robert Fico.\nThe summit also gifts Russia’s Putin some international spotlight, just two weeks after his Alaska summit with Trump, and as he continues to ignore international pressure to end his onslaught in Ukraine. Earlier this week Russia’s forces carried out the second-biggest aerial attack since its full-scale invasion of its neighbor.\nPutin, who arrived to a red-carpet welcome in Tianjin on Sunday local time, praised the China-Russia partnership ahead of his trip as a “stabilizing force” for the world. In a written interview for Chinese state news agency Xinhua, he said they were “united in our vision of building a just, multipolar world order” – an allusion to the two countries’ efforts to revise what they see as a US-led world order unfairly stacked against them.\nSCO members – which include China, Russia, India, Iran, Pakistan, Belarus, Kazakhstan, Kyrgyzstan, Tajikistan, and Uzbekistan – preside over vast swaths of global energy reserves and govern some 40% of the global population.\nLeaders including Indian Prime Minister Narendra Modi have arrived in Tianjin, and Xi has been holding a flurry of bilateral meetings with his guests since Saturday.\n‘Architect and host’\nThe guests at the summit have national rivalries between them and vast differences in political systems. And while this has sparked criticism of the group as too disparate to be effective, it also may serve to underscore Xi’s message.\n“Beijing wants to signal that China is the indispensable convener in Eurasia, capable of seating rivals at the same table and translating great-power competition into managed interdependence,” said Rabia Akhtar, director of the Centre for Security, Strategy and Policy Research at the University of Lahore in Pakistan.\n“The optics are straightforward: China is not just a participant in regional order-making – it is a primary architect and host.”\nModi’s attendance at the gathering also adds heft to Xi’s guest list. The Indian prime minister skipped last year’s summit in Kazakhstan. Now, he has arrived in Tianjin against a backdrop of souring relations with Washington – and as Beijing and New Delhi have moved to ease their own frictions, a nascent realignment that could imperil US efforts to cultivate India as a counterweight against a rising China.\nDelegations are also expected from the SCO’s 16 official partner and observer countries, which include Cambodia, Egypt, Saudi Arabia, the United Arab Emirates, Bahrain, Qatar, and Kuwait, as well as NATO member Turkey, among others, Chinese officials said ahead of the gathering.\nBeijing additionally invited a handful of Southeast Asian leaders. UN Secretary General Antonio Guterres is also expected to attend.\nAcross the city of Tianjin, banners in English, Russian and Chinese heralding the gathering lined highways. Officials heavily restricted traffic in the city center as Chinese leaders welcomed their guests with the ceremony and pomp typical of Chinese diplomacy at the highest level.\nThe location has pointed symbolism for China, as a port that was forced open by colonial powers in the 19th century, with those from Europe and Imperial Japan receiving land concessions – and a key city occupied by Japan during World War II.\nSome guests, including Putin, Iranian President Masoud Pezeshkian and Pakistani Prime Minister Shehbaz Sharif, are slated to stay for the military parade in Beijing, where the ruling Communist Party will show off its military might and play up its role fighting Imperial Japan as part of the Allied Forces in World War II as the globe marks 80 years since the end of that war.\nWhat is the SCO?\nSince its formation in 2001 as a group focused on regional security cooperation between China, Russia, Kazakhstan, Kyrgyzstan, Tajikistan, and Uzbekistan, the Shanghai Cooperation Organization has expanded in its size and scope.\nSCO members conduct joint counter-terrorism drills, share intelligence on combatting “terrorism, separatism, and extremism,” and work to expand coordination across areas like education, trade and energy. They’re also united in a call for a “just” international order – or one not led by a single superpower and its allies.\nIran’s inclusion in the group in 2023 and Belarus’ a year later have been widely seen as an effort by Beijing and Moscow to the make the body more explicitly anti-West. It also is one facet of a tightening of bonds between Moscow, Beijing and Tehran that’s raised alarm in Washington.\nNow, growing frictions and uncertainties between some countries and the US under Trump will loom over the gathering – a reality sure to be referenced prominently if indirectly in remarks by Xi to his guests in the days ahead.\nObservers will be watching whether this summit will produce momentum toward further economic integration between member countries, especially when it comes to regional trade or development finance, but expectations for practical developments are low.\n“Without deeply addressing what the mission of the Shanghai Cooperation Organization should be and how it can resolve internal sources of conflict both between members and between members with external countries, the SCO is just a showcase,” said Shanghai-based foreign affairs analyst Shen Dingli.\nEven as the group regularly calls for “avoiding bloc, ideological or confrontational approaches” to addressing security threats, its summits have yet to produce a joint statement mentioning the war in Ukraine.\nSCO – and its lead members China and Russia – also appeared to have little role in de-escalating a four-day conflict between members India and Pakistan earlier this year.\nThe group did, however, “strongly condemn” the military strikes carried out by the US and Israel on Iran this past June."
    },
    {
      "url": "https://www.cnn.com/2025/09/01/asia/north-korea-kim-jong-un-missile-inspection-intl-hnk",
      "text": "Just days before Kim Jong Un is due to stand with Russia’s Vladimir Putin to witness a display of China’s military might, North Korea has released a propaganda film praising its troops’ efforts fighting for Russia in its war against Ukraine.\nThe 20-minute video, released by North Korean state media KCTV, showed heavily dramatized shots of soldiers on the snow-covered battlefield – handling weapons, holding meetings with Russian soldiers, and installing bombs on trees.\nIt also showed aerial footage purporting to show damage inflicted by North Korean soldiers, with clips of explosions and targeted strikes.\nOther parts of the video emphasized the soldiers’ patriotism – with one shot appearing to show soldiers gazing at a framed portrait of Kim, and another showing a soldier pressing his cheek to the North Korean flag.\nIt’s unclear how much of the footage is authentic, or whether it has been staged or manipulated, as is common in North Korean propaganda. CNN cannot independently verify when and where the videos were filmed.\n“They’re presenting their participation in the Ukrainian war as a major exploit, as another confirmation of (North Korea’s) military might and their loyalty to the party, state and the leader himself,” said Andrei Lankov, a professor of Korean Studies at Kookmin University in Seoul.\nThe video offers a rosy view of the situation on the ground in a theatre that has become notorious for human wave attacks and horrific attrition rates on the Russian side. Western officials estimated that a third of the 12,000 North Korea troops believed to be part of the initial deployment were either killed or wounded.\nThe program, initially shrouded in secrecy, was later confirmed by both Pyongyang and Moscow. In recent weeks, Kim finally acknowledged the loss of troops, holding two events in August to meet bereaved families.\nLast Friday, he promised “a beautiful life” for the families of “martyrs” who perished fighting for Russia, state media reported. Earlier in August, he said his “heart aches,” with state media photos showing the leader embracing sobbing families and kneeling before the portraits of deceased soldiers.\nThe propaganda video on Sunday paid tribute to these soldiers too, beginning with a statement that troops had participated in operations to “liberate” the Russian region of Kursk in October 2024 after Ukraine’s surprise offensive. It also named some fallen soldiers and described how they had died.\nFor decades, North Korean propaganda has emphasized the significance of its military but “had very little real actual stuff to talk about,” said Lankov, pointing to its previous lack of real battlefield experience.\n“Now, they’ve had a real war where, generally speaking, North Korean soldiers were fighting quite well,” he added. “It’s understandable that it’s likely to become a major topic of their domestic propaganda, domestic ideological education and indoctrination.”\nNorth Korea has drawn closer to Russia since the war began, with experts warning that Moscow may be offering military and technological assistance to Pyongyang in exchange for its troops.\nVisit to Beijing\nBoth Kim and Russian leader Vladimir Putin will be in Beijing on Wednesday for a massive military parade to mark the 80th anniversary of the end of World War II – setting the stage for a striking show of unity between the two autocrat leaders and China’s Xi Jinping.\nThe trip will be Kim’s first trip to China since 2019. Kim, who has only embarked on 10 foreign trips since assuming power in 2011, last left his isolated country in 2023 to meet Putin at a remote spaceport in Russia’s far east.\nHong Min, a senior research fellow at the Korea Institute for National Unification in Seoul, said North Korea could have released the video ahead of the Beijing visit to portray Kim as “an important leader with a strategic position in Northeast Asia that is on par with Putin and Xi Jinping at the Victory Day (parade).”\nIt would further the narrative that North Korea is “forming a solidarity front with powerful countries on the diplomatic stage,” Hong added.\nOn Sunday, Kim also examined missiles on a “newly inaugurated” production line and learned about the “overall condition of the state missile production capacity,” state media KCNA reported on Monday.\nImages published by KCNA appeared to show Kim at an undisclosed location inspecting several dozen weapons in various stages of production and talking with uniformed officers.\nAccording to the KCNA report, North Korea had “successfully fulfilled” its five-year plan to expand its missile production capacity.\n“Various kinds of missiles were put into serial production,” the agency reported, adding that Kim had ratified three new long-term plans “related to missile production capacity.”\nNorth Korea has ramped up its weapons program in the last few years, rapidly modernizing its armed forces, developing new weapons and testing intercontinental ballistic missiles that can reach almost anywhere in the United States.\nKim has also ramped up his rhetoric, vowing recently to build up the country’s nuclear program and threatening to use it to destroy South Korea if attacked."
    },
    {
      "url": "https://www.cnn.com/2025/09/01/china/china-sco-summit-xi-address-intl-hnk",
      "text": "Chinese leader Xi Jinping made a veiled swipe at the United States on Monday as he criticized “bullying practices” and cast his country as a new leader of world governance, at a time when President Donald Trump’s America First foreign policy is upending the globe.\n“The house rules of a few countries should not be imposed on others,” Xi told more than 20 world leaders gathering at a two-day summit orchestrated to play-up China’s global leadership and its close and enduring partnership with Russia, as the two neighbors seek to rebalance global power in their favor at the expense of the US and its allies.\nThe meeting of the Beijing- and Moscow- backed Shanghai Cooperation Organization (SCO) in the northern port city of Tianjin is China’s biggest diplomatic event of the year, drawing political heavyweights including Russian President Vladimir Putin, Indian Prime Minister Narendra Modi and Turkish President Recep Tayyip Erdoğan.\nAt the summit, Xi pledged 2 billion yuan ($280 million) in grants to SCO member states this year, and an additional 10 billion yuan ($1.4 billion) in loans to an SCO banking consortium over the next three years.\n“We should leverage the strength of our mega-sized markets and economic complementarity between member states and improve trade and investment facilitation,” the Chinese leader told his guests during opening remarks.\nLater in the day, Xi unveiled a brand new Global Governance Initiative, a sequel to his three earlier “initiatives” on security, development and civilization that together serve as a loose outline for his vision of a reshaped international order.\n“I look forward to working with all countries for a more just and equitable global governance system,” Xi said, pledging to increase the representation and voice of developing countries and practice multilateralism – echoing longstanding calls from the Global South.\n“We should continue to dismantle walls, not erect them; seek integration, not decoupling,” he added.\nXi’s vision pushes back against what Beijing sees as the foundations of a US-led world order, opposing alliances like NATO – which in his view exist to enforce the West’s rules-based system – and calling into question the concept of universal human rights, while seeking to reshape power at the United Nations and other bodies it sees as unfairly dominated by the West.\nWithout naming the United States directly, Xi vowed to oppose “hegemonism,” “Cold War mentality” and “bullying practices” – phrases often deployed by Beijing to criticize Washington.\nAs Trump alarms nations with his global trade war, withdrawals from international organizations, slashing of foreign aid and threats on social media, Beijing views the US as undermining the international order it worked to build – and sees an opportunity to ramp its own vision as an alternative.\n“We should advocate an equal and orderly multipolar of the world, and a universally beneficial and inclusive economic globalization and make the global governance system more just and equitable,” Xi said in his opening remarks.\nEchoing Xi’s remarks, Putin said the SCO laid the groundwork for a “new system” of security in Eurasia, positioning it as an alternative to Western-led alliances that he has long railed against.\nThe new system “would replace the outdated Eurocentric and Euro-Atlantic models, take into account the interests of the broadest possible range of countries, be truly balanced, and would not allow attempts by some states to ensure their security at the expense of others,” Putin said.\nClose rapport\nThe summit is a showcase for closer ties between China and Russia, as well as the friendship struck up over the years by their two autocratic leaders.\nThe deep personal rapport between the two men was on show Sunday evening, when Xi and his wife Peng Liyuan hosted a welcome banquet for attending leaders.\nFootage released by Russian state news agency RIA showed Xi and Putin gesturing animatedly and smiling as they chatted at the event, showing a different side of the typically restrained Chinese leader – and his warm and relaxed demeanor with his Russian counterpart.\nThe SCO summit is also the leaders’ first opportunity to meet since Putin’s summit with Trump in Alaska in August – and comes as Putin resists Western pressure to end his onslaught in Ukraine.\nJust last week, Moscow’s forces carried out their second largest aerial attack to date on Ukraine.\nOn Monday, Putin used his speech at the SCO summit to reiterate his talking points on the war in Ukraine, saying the crisis “did not arise as a result of Russia’s aggression against Ukraine, but rather as a consequence of a coup d’état in Ukraine, which was supported and provoked by the West.”\nMoscow launched a full scale invasion of Ukraine in February 2022, after Russia’s troops previously seized the Crimea and swathes of eastern Ukraine.\nThe Russian leader praised efforts by China and India at facilitating the resolution of the crisis, and described the “understanding” reached with Trump at the Alaska meeting as “opening the way to peace in Ukraine.”\n“During the bilateral meetings scheduled for today and tomorrow, I will, of course, inform my colleagues in more detail and thoroughly about the results of the negotiations in Alaska,” Putin said, adding that he had already informed Xi “in detail” during a lunch on Sunday.\nKremlin aide Yury Ushakov told Russian state media that Putin discussed Ukraine with world leaders on the sidelines of the summit, including Xi and Modi.\nUshakov downplayed the possibility of a meeting between Putin and Ukrainian president Volodymyr Zelensky, which was teased by Trump after he met the two leaders last month.\n“Everyone is talking about a trilateral meeting, (or) about a meeting between Putin and Zelensky … But, as far as I know, there was no specific agreement between Putin and Trump about this,” Ushakov told Russian state media journalist Pavel Zarubin on Monday.\nObservers said the Russian leader would have used the gathering to show that he’s not alone on the global stage.\n“(Putin) will seek to frame Russia’s resilience and China’s backing as evidence that Western sanctions and isolation have not worked,” Li Mingjiang, an associate professor at Singapore’s S. Rajaratnam School of International Studies, said ahead of the gathering.\n“At the same time, he will try to deepen strategic alignment with Beijing, in particular to ensure Chinese supply of dual-use goods and equipment to Russia (and) to show that Moscow has strong partners even as Washington ramps up its push to end the war.”\nUkraine war looms over summit\nChina has emerged as a key pillar of diplomatic and economic support for Putin’s regime since the early days of the Ukraine invasion, even as it claims neutrality in the conflict.\nChinese firms have bought up swaths of discounted Russian oil and provided it with critical trade, including dual use goods that Western leaders say have powered Russia’s defense industrial base. Beijing defends its “normal trade” with Russia.\nTrump earlier this summer threatened to take aim at that partnership, saying China could face major tariffs on its goods if it continued to purchase fuel from Russia as it wages war.\nBut even as the US imposed such penalties on India last week, it has so far slow-rolled that threat as it seeks a broader trade agreement with Beijing.\nWhite House senior counselor for trade Peter Navarro said Monday that the show of unity between Russia, China and India is “troublesome.”\n“It’s time for the Modi to step up. I have great respect Modi. I love the Indian people,” Navarro told reporters at the White House on Monday. “It was a shame to see Modi getting in bed, as the leader of the biggest democracy in the world, with the two biggest authoritarian dictators in the world, in Putin and Xi Jinping. That doesn’t make any sense.”\nTrump’s whopping 50% tariff on India has soured ties with Modi – and accelerated a nascent and cautious rapprochement between New Delhi and Beijing.\nThe Indian leader met with Xi on Sunday in his first trip to China in seven years, as both countries face stiff US tariffs and Western scrutiny over their relationships with Russia.\nOn Monday, Modi highlighted his ties with both his host and the Russian leader at the SCO summit, embracing Putin before the two walked over hand in hand to greet Xi. The three leaders then shared a conversation marked by smiles and laughter.\nModi and Putin also held a nearly hour-long private meeting in the Russian presidential limousine, the Aurus, while en route to their formal talks, according to Russian state media.\n“India and Russia have always stood shoulder to shoulder even in the most difficult times,” Modi said at the start of the meeting. “We have been in constant dialogue on the situation in Ukraine. We welcome all the recent efforts for peace.”\nA readout from the Indian Ministry of External Affairs said the two leaders discussed the latest developments concerning Ukraine. “(Modi) reiterated his support for the recent initiatives that have been taken to address the conflict in Ukraine, and emphasized the need to expedite a cessation of the conflict, and find a durable peace settlement,” the ministry said.\nObservers say that Xi sees the gathering – and a massive military parade that he’ll host on Wednesday in Beijing, expected to be attended by Putin, North Korea’s Kim Jong Un as well as some two dozen other leaders – as a critically timed diplomatic push.\nChinese officials touted this year’s SCO as the largest yet, saying ahead of the event that 20 leaders from across Asia and the Middle East would join. In addition to Russia, China and India, SCO members include Iran, Pakistan, Belarus, Kyrgyzstan, Tajikistan, and Uzbekistan.\nCNN’s Kit Maher and Darya Tarasova contributed reporting."
    },
    {
      "url": "https://www.cnn.com/2025/09/01/china/china-putin-xi-meeting-sco-summit-intl-hnk",
      "text": "Russian President Vladimir Putin hailed a relationship with Beijing at an “unprecedentedly high level” on Tuesday, as the two countries reportedly inked a long-stalled agreement to build a massive new pipeline to send natural gas to China via Mongolia.\nPutin and Xi Jinping spent hours together on Tuesday, meeting with Mongolia’s president, sitting down for their own formal talks, and sipping tea at the Chinese leader’s official residence – in the latest show of solidarity between the two strongmen seeking to present a new world order.\nOn Tuesday afternoon, Russia’s state-owned energy company Gazprom announced that a legally binding agreement had been signed for the construction the massive Power of Siberia-2 gas pipeline, which Moscow has been trying to push off the drawing board for years.\nThe deal is a major win for Putin, who has increasingly turned to China to replace Europe as its major gas buyer. It’s also a collective show of defiance against US President Donald Trump, who is pushing countries to cut Russian energy imports as part of his attempt to end the war in Ukraine.\nThe new pipeline will supply 50 billion cubic meters of gas annually from western Russia to northern China. Analysts have previously said it could offset nearly half of the gas exports to Europe that Russia has lost since the Ukraine war began.\nThe deal includes a 30 year supply agreement and the price of supplies will be lower than Europe is charged, Gazprom CEO Aleksey Miller said, Russia’s TASS news agency reported.\n“It will be the largest, most extensive, and most capital-intensive gas project in the world,” Miller was quoted as saying by TASS.\nChina, though, has not yet confirmed the agreement.\nBeijing has long been seen as cautious about the mega-project, given its push for renewable energy transition and longstanding energy security concerns about being too reliant on a single supplier.\nChinese state media reports on the meeting of the leaders Russia, China and Mongolia make no mention of the pipeline. In subsequent talks between Xi and Putin, the Chinese leader said their countries should “use major projects to drive cooperation.”\nAsked about the deal at a regular news conference Tuesday, a spokesperson for the Chinese Foreign Ministry said China and Russia have “consistently conducted practical cooperation in various fields, including energy,” and asked reporters to “contact the relevant Chinese authorities for details.”\n‘Old friend’\nPutin and Xi sat down on Tuesday for their first formal talks since the Russian leader arrived in China on Sunday.\nThe meeting at the Great Hall of the People in Beijing was the latest show of solidarity between the two strongmen as Putin shrugs off Western pressure to end its war on Ukraine, and Xi casts his country as a new leader of world governance, at a time when Trump’s foreign policy is upending the globe.\nHarking back to Soviet ties with China during the World War II, Putin hailed “the memory of the brotherhood in arms, trust, mutual support, and firmness in defending common interests” as the foundation of their countries’ strategic alignment “in the new era.”\n“We were always together then, and we remain together now,” Putin told Xi at the start of their bilateral sit-down.\nChina-Russia relations have “withstood the test of shifting international circumstances,” Xi said, calling Putin an “old friend.”\n“China is willing to work together with Russia to support each other’s development and revitalization, firmly uphold international fairness and justice, and build a just and reasonable global governance system,” Xi said.\nAfter their formal meeting, Xi invited Putin to his residence in Zhongnanhai, the Communist Party’s walled leadership compound in central Beijing, to continue discussions, according to Russian state media. China’s state broadcaster said Xi and Putin had tea with a small group of aides around noon.\nThe close rapport between Xi and Putin was also on show throughout a two-day security summit in the Chinese port city of Tianjin that concluded Monday. During a banquet dinner Sunday evening, Xi warmly greeted Putin and was seen gesturing expressively in conversation with the Russian leader.\nPutin previously said that he discussed his recent negotiations in Alaska with Trump with Xi during summit activities Sunday. Putin met Trump last month in Alaska as the US pushes for Russia to end its war in Ukraine.\nThe Russian president’s visit to China is also expected to bring him shoulder-to-shoulder with North Korea’s leader Kim Jong Un. Both top a guest list of foreign dignitaries joining Xi at a massive military parade in the Chinese capital Wednesday.\nThe visit is the Russian leaders’ longest to a single country since Russia’s full-scale invasion of Ukraine in 2022, according to a Kremlin record of his overseas visits."
    }
  ],
  "argos_summary": "Xi Jinping hosted a multi‑day summit in Tianjin, inviting leaders from Russia, North Korea, Iran and other allies to showcase a new “axis of upheaval” that challenges the West. The event culminated in a massive military parade on September 3, where Xi displayed hypersonic weapons and staged a symbolic unity with Putin, Kim Jong Un and the Iranian president. The gathering signals China’s intent to reshape global rules, strengthen ties with Russia and its allies, and leverage its growing military and economic clout amid U.S. trade and sanctions pressure.",
  "argos_id": "LQSJ2WO54"
}