{
  "url": "https://www.fastcompany.com/91398008/the-rise-of-vibe-coding-democratizing-engineering-or-just-masking-the-gap",
  "authorsByline": "Anshuman Yadav",
  "articleId": "84233efb865c404db0f4a047d3116fdb",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T21:45:49+00:00",
  "addDate": "2025-09-03T22:07:22.277788+00:00",
  "refreshDate": "2025-09-03T22:07:22.277791+00:00",
  "score": 1.0,
  "title": "The rise of vibe coding: Democratizing engineering or just masking the gap?",
  "description": "Are we preparing capable creators, or just enabling quick fixes?",
  "content": "These are examples of a broader shift. This is vibe coding: building software by using AI, templates, and creativity instead of writing lines of code. This shift favors experimentation over expertise. With tools like ChatGPT, GitHub Copilot, Replit, and Bubble, people from all backgrounds, especially in developing countries like Nigeria, India, and Nepal, can create real products without formal computer science education. GitHub’s 2024 Octoverse shows over 100 million developers use Github. Gartner forecasts a 19% annual growth in the low-code market. These numbers show a wave of inclusion, but raise tough questions. Are we preparing capable creators or just enabling quick fixes?\n\nTHE RISKS OF MOVING FAST WITHOUT DEPTH Some of these new builders launch apps that function well—until something breaks. Then it’s not so simple. One group built a restaurant suggestion tool. It ran fine until the underlying platform changed. Nobody knew how to fix it. GitClear found a fourfold jump in duplicated blocks when Copilot is in play. There’s evidence of weak security, too. TechCrunch flagged Copilot-generated code as vulnerable in over a third of tested apps. The concern among seasoned developers isn’t just about code—it’s about the dilution of craftsmanship and the future of the job market. With more AI-assisted builders entering the space, salaries may dip, and hands-on technical work may shrink.\n\nYet there’s real opportunity. In Nairobi, in Mumbai, in smaller cities across the globe, vibe coders are making things that wouldn’t otherwise exist. Young people are also reimagining how to share and build. On platforms like TikTok and Discord, projects get tested, revised, and relaunched. It’s no longer about coding in isolation. It’s about remixing, collaborating, and publishing fast. HOW CREATION IS BEING REDEFINED This new dynamic is changing how companies think. Quick builds tighten feedback cycles. Teams release prototypes faster. The idea of a minimum viable product is shifting from being an engineering shortcut to a default strategy across roles. Vibe coders are becoming central to this workflow.\n\nThis evolution is not just shaping software, it’s reshaping the talent pipeline. Employers are rethinking job descriptions and skill assessments. Instead of asking for five years of experience in JavaScript, hiring managers are testing candidates on how well they design workflows with Replit or solve problems using AI-assisted tools. In some companies, product managers with no traditional dev background are now taking on technical ownership roles. This flexibility is blurring lines between departments—and that’s not a bad thing. It creates opportunities for more diverse problem-solvers to step in and lead. There’s also a cultural shift in how people approach failure. Traditional software development often treats failure as expensive and time-consuming. Vibe coding, by contrast, treats fast failure as a feedback mechanism. Projects get scrapped and rebuilt quickly, and that learning cycle builds resilience. For younger builders growing up with this model, iteration is second nature. RETHINKING HOW WE TEACH, HIRE, AND BUILD We need to adapt. Education needs to balance AI tooling with old-school problem-solving. Teaching prompt design should go alongside basics like data structures and debugging. Some boot camps are beginning to explore how to blend traditional software skills with AI-powered development tools. Andela, Codecademy, and Coursera are joining in.\n\nAt the company level, onboarding should go beyond showing new hires the tools. Give them real challenges and mentors. Let them learn from friction, not just velocity. Industry leaders and investors should help build the playbook. There’s space for credentials that show someone knows how to use AI, but also understands what the code is doing underneath. OpenAI, GitHub, and developer communities can shape what best practices look like. Not every builder needs to know everything. But if your work touches real users, you should understand the system behind it. Vibe coding isn’t just a trend. It’s a new way of thinking about building. Let’s make sure that this new wave doesn’t just move fast—it moves forward with intention, awareness, and care.",
  "medium": "Article",
  "links": [
    "https://www.mansueto.com/privacy-policy/",
    "https://www.fastcompany.com/section/artificial-intelligence",
    "https://www.fastcompany.com/section/tiktok",
    "https://cyber.nyu.edu/2021/10/15/ccs-researchers-find-github-copilot-generates-vulnerable-code-40-of-the-time/#:~:text=Their%20paper%2C%20released%20in%20August%20through%20ArXiv%2C,might%20need%20to%20do%20for%20security%20issues.''",
    "https://www.gitclear.com/ai_assistant_code_quality_2025_research#:~:text=Emerging%20trends:%204x%20more%20code,moved%20lines%20(code%20reuse).",
    "https://github.blog/news-insights/octoverse/octoverse-2024/",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://leaddev.com/technical-direction/how-ai-generated-code-accelerates-technical-debt#:~:text=About%20the%20author,www.doerrfeld.io",
    "https://blog.tooljet.ai/gartner-forecast-on-low-code-development-technologies/#:~:text=Gartner's%20statistics%20show%20that%20the,in%20Time%20for%20App%20Development",
    "https://www.fastcompany.com/newsletters",
    "https://www.fastcompany.com/section/hiring"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "traditional software skills",
      "weight": 0.06486722
    },
    {
      "name": "Traditional software development",
      "weight": 0.06385706
    },
    {
      "name": "real products",
      "weight": 0.061703842
    },
    {
      "name": "vibe coding",
      "weight": 0.057850208
    },
    {
      "name": "GitHub Copilot",
      "weight": 0.05559341
    },
    {
      "name": "product managers",
      "weight": 0.055325437
    },
    {
      "name": "AI tooling",
      "weight": 0.05515659
    },
    {
      "name": "code",
      "weight": 0.053915866
    },
    {
      "name": "new hires",
      "weight": 0.053432226
    },
    {
      "name": "vibe coders",
      "weight": 0.052552916
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Programming/Other",
      "score": 0.72998046875
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.53173828125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.5107421875
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.4736328125
    },
    {
      "name": "/Computers & Electronics/Programming/Development Tools",
      "score": 0.432373046875
    },
    {
      "name": "/News/Technology News",
      "score": 0.343505859375
    },
    {
      "name": "/Reference/Technical Reference",
      "score": 0.317138671875
    }
  ],
  "sentiment": {
    "positive": 0.10455311,
    "negative": 0.56880796,
    "neutral": 0.3266389
  },
  "summary": "The rise of vibe coding, which involves building software by using AI, templates, and creativity instead of writing lines of code, has been identified as a shift that favors experimentation over expertise. Tools like ChatGPT, GitHub Copilot, Replit, and Bubble allow people from all backgrounds to create real products without formal computer science education. This shift raises questions about whether these tools are preparing capable creators or just enabling quick fixes. With more AI-assisted builders entering the space, salaries may dip and technical work may shrink. However, there is an opportunity in developing countries like Nigeria, India, and Nepal. Vibe coding is changing how companies think about how to release prototypes faster and is becoming central to this workflow. Employers are rethinking job descriptions and skill assessments, with hiring managers testing candidates on how well they design workflows with Replit or solve problems using AI-powered tools. The shift in approach to failure is also creating opportunities for more diverse problem-solvers to step in and lead.",
  "shortSummary": "The rise of vibe coding, using AI and creativity, is transforming software development and training, potentially leading to fewer skilled developers and fewer viable products.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fb08c4e1e4f94fdd8af77368da5c22f0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://leaddev.com/technical-direction/how-ai-generated-code-accelerates-technical-debt#:~:text=About%20the%20author,www.doerrfeld.io",
      "text": "You have 1 article left to read this month before you need to register a free LeadDev.com account.\nEstimated reading time: 3 minutes\nGitClear’s latest report exposes rising code duplication and declining quality as AI coding tools gain in popularity.\nIt’s never been easier to create code. With today’s LLM-based coding assistants embedded in the Integrated Development Environment (IDE), you can create multi-line code blocks with a single prompt or press of the tab key.\nEver since AI coding tools entered the scene, engineering best practices like the don’t repeat yourself (DRY) principle have been slipping.\n“I don’t think I have ever seen so much technical debt being created in such a short period of time during my 35-year career in technology,” says API evangelist Kin Lane, referring to AI-generated code proliferation.\nGitClear’s second-annual AI Copilot Code Quality research analyzed 211 million changed lines of code from 2020 to 2024 across a combined dataset of anonymized private repositories and 25 of the largest open-source projects. It found multiple signatures of declining code quality – sounding the alarm around the long-term repercussions of quick wins with AI.\nCode reuse is dying\nDuring 2024, GitClear tracked an 8-fold increase in the frequency of code blocks with five or more lines that duplicate adjacent code – showing a prevalence of code duplication ten times higher than two years ago.\nYour inbox, upgraded.\nReceive weekly engineering insights to level up your leadership approach.\nThat same year, 46% of code changes were new lines, while copy-pasted lines exceeded moved lines. “Moved,” lines is a metric GitClear has devised to track the rearranging of code, an action typically performed to consolidate previous work into reusable modules. “Refactored systems, in general, and moved code in particular, are the signature of code reuse,” says Bill Harding, CEO of Amplenote and GitClear.\nA year-on-year decline in code movement suggests developers are less likely to reuse previous work, a marked shift from existing industry best practice that would lead to more redundant systems with less consolidation of functions.\nTaken from GitClear’s study, AI Copilot Code Quality.\nMore code lines ≠ success\nUnbridled AI code generation is anticipated to carry a long-term maintenance burden, especially for long-lived repositories. Contrary to perceived productivity benefits, the State of Software Delivery 2025 report by software vendor Harness found the majority of developers spend more time debugging AI-generated code and more time resolving security vulnerabilities.\nThe growing frequency of copy-and-pasted lines in commits might not be alarming to those who’ve copied StackOverflow code during their career. However, the new AI-infused workflow has the potential to dramatically escalate technical debt.\nGoogle’s 2024 DORA report found a trade-off between gains and losses with AI, where a 25% increase in AI usage quickens code reviews and benefits documentation, but results in a 7.2% decrease in delivery stability.\nMore like this\nInfinite code = infinite maintenance\nCode assistants are incredibly valuable, and most leaders agree AI is imperative to competitive agility. But does unchecked LLM-generated code threaten software maintainability?\nData suggests that if current trends continue, defect remediation and refactoring may soon dominate developer workloads. “If developer productivity continues being measured by commit count or lines added, AI-driven maintainability decay will proliferate,” says Harding.\nUnless teams focus on long-term sustainability, AI will push software toward endless expansion – requiring “indefinite maintenance,” he adds.\nNovember 3 & 4, 2025\nLeadDev Berlin agenda is live! 🙌\nThe cost of cloning code\nBeyond maintainability, bloated code has financial implications. “Nobody, including me during much of my 2024 programming, thinks much about the long-term costs,” says Harding.\nDuplicated code isn’t just harder to maintain – it’s expensive. Code storage racks up cloud costs. Bugs multiply across cloned blocks, and testing becomes a logistical nightmare, heightening the developer’s operational overhead.\nAcademic research continually links co-changed code clones – duplicated code blocks that must be updated in multiple places – to higher defect rates. “Code cloning is a common practice that negatively impacts software maintenance,” found a 2023 study by researchers at the Central China Normal University.\nApproach the ‘tab’ key with caution\nOne encouraging finding in GitClear’s research is that the time between commits is shrinking. AI can itself be leveraged to counter some of the drawbacks above too. Cursor, for instance, can help rewrite code to ensure per-line consistency.\nAlthough AI excels at generating one-off code, its context window is limited. Humans still play a critical role in seeing the bigger picture and understanding the full software portfolio. This oversight is essential to make a codebase more cohesive, by refactoring repetitive logic into reusable functions, integrating related modules, or reusing microservices when appropriate.\n“There is a lot of utility that AI provides, but the data from this year affirms why long-term-oriented devs might eye their ‘tab’ key with a faint sense of foreboding,” says Harding."
    },
    {
      "url": "https://cyber.nyu.edu/2021/10/15/ccs-researchers-find-github-copilot-generates-vulnerable-code-40-of-the-time/#:~:text=Their%20paper%2C%20released%20in%20August%20through%20ArXiv%2C,might%20need%20to%20do%20for%20security%20issues.''",
      "text": "A recent study by cybersecurity researchers at NYU Tandon finds that a significant amount of the code generated by Github CoPilot programming assistant is, at best, buggy, and at worst, potentially vulnerable to attack. The researchers drew their conclusion after creating 89 potential scenarios and having CoPilot output 1,692 programs. When these programs were reviewed, about 40 percent included bugs or design flaws that could be exploited by an attacker.\nCoPilot was released by Github in June 2021 with the claim that it “puts the knowledge you need at your fingertips, saving you time and helping you stay focused.” Programmers can submit a brief description of functionality and CoPilot will automatically generate source code. Yet, as noted by the research team of Hammond Pearce, Baleegh Ahmad, Benjamin Tan, Brendan Dolan-Gavitt, and Ramesh Karri, all affiliated with NYU’s Center for Cybersecurity, there had been “no systematic examination of the security of ML-generated code. Their paper, released in August through ArXiv, attempts to fill this void with a study that characterizes “the tendency of Copilot to produce insecure code, giving a gauge for the amount of scrutiny a human developer might need to do for security issues.”\nTheir findings, as summarized in the paper is that “developers should remain vigilant” when “using Copilot as a co-pilot.” The team recommends pairing Copilot “with appropriate security-aware tooling during both training and generation to minimize the risk of introducing security vulnerabilities.”\nThe survey has attracted news coverage from Wired, New Scientist, The Register, and Communications of the ACM."
    },
    {
      "url": "https://github.blog/news-insights/octoverse/octoverse-2024/",
      "text": "GitHub Staff\nGitHub is the world's best developer experience and the only AI-powered platform with security incorporated into every step, so you can innovate with confidence.\nIn this year’s Octoverse report, we study how public and open source activity on GitHub shows how AI is expanding as the global developer community surges in size.\nRemember when people said AI would replace developers? Our data tells a different story. As AI rapidly expands, developers are increasingly building AI models into applications and engaging with AI projects on GitHub in large numbers. At the same time, we’re seeing an unprecedented number of developers join GitHub from across the globe, and many of these developers are contributing to open source projects for the first time.\nIn 2024, Python overtook JavaScript as the most popular language on GitHub, while Jupyter Notebooks skyrocketed—both of which underscore the surge in data science and machine learning on GitHub. We’re also seeing increased interest in AI agents and smaller models that require less computational power, reflecting a shift across the industry as more people focus on new use cases for AI.\nOur data also shows a lot more people are joining the global developer community. In the past year, more developers joined GitHub and engaged with open source and public projects (in some cases, empowered by AI). And since tools like GitHub Copilot started going mainstream in early 2023, the number of developers on GitHub has rapidly grown with significant gains in the global south. While we see signals that AI is driving interest in software development, we can’t fully explain the surge in global growth our data reflects (but we’ll keep studying it).\nAt GitHub, we know the critical role open source plays in bridging early experimentation and widespread adoption. In this year’s Octoverse report, we’ll explore how AI and a rapidly growing global developer community are coming together with compounding results.\nWe uncover three big trends:\nA rapidly growing number of developers worldwide—especially in Africa, Latin America, and Asia. Notable growth is occurring in India, which is expected to have the world’s largest developer population on GitHub by 2028, as well as across Africa and Latin America. We also see Brazil’s developer community growing fast. Some of this is attributable to students. The GitHub Education program, for instance, has had more than 7 million verified participants. We’ve also seen 100% year-over-year growth among students, teachers, and open source maintainers adopting GitHub Copilot as part of our complimentary access program. This suggests AI isn’t just helping more people learn to write code or build software faster—it’s also attracting and helping more people become developers. First-time open source contributors continue to show wide-scale interest in AI projects. But we aren’t seeing signs that AI has hurt open source with low-quality contributions.\nPython is now the most used language on GitHub as global open source activity continues to extend beyond traditional software development. We saw Python emerge for the first time as the most used language on GitHub (more on that later). Python is used heavily across machine learning, data science, scientific computing, hobbyist, and home automation fields among others. The rise in Python usage correlates with large communities of people joining the open source community from across the STEM world rather than the traditional community of software developers. This year, we also saw a 92% spike in usage across Jupyter Notebooks. This could indicate people in data science, AI, machine learning, and academia increasingly use GitHub. Systems programming languages, like Rust, are also on the rise, even as Python, JavaScript, TypeScript, and Java remain the most widely used languages on GitHub.\n💡 Oh, and if you’re a visual learner, we have you covered.👇\nIn early 2023, we celebrated reaching 100 million total developers on GitHub—and that number has climbed at a rapid rate since then. In 2024, developers around the world made more than 5.2 billion contributions to more than 518 million open source, public, and private projects.\nSo, where in the world are GitHub developers most engaged, and where are we seeing the most growth? And as AI allows developers to code in the natural language of their choice, what parts of the world could we expect to see greater growth in? Let’s take a look. 👇\nThere’s both stability and change among the top 20 countries with the highest number of developers on GitHub. While India continues to approach the number one spot (we now predict by 2028 based on updated projections, but more below), the United States continues to have the most developers worldwide on GitHub. Despite this, we have seen greater growth outside the United States every year since 2013—and that trend has sped up over the past few years.\nGlobally, we see developer communities growing significantly. Brazil, India, and Nigeria are especially growing fast, which is notable given they are the most populous regions of their respective continents with linguistically diverse populations.\nOverall, the top 20 developers communities have largely maintained their positions with a few notable exceptions. These include the Philippines (#18) overtaking Australia (#19) and Pakistan (#20) overtaking Poland (#21).\n💡 Stay smart. The rise of these non-English, high-population regions is notable given that it is happening at the same time as the proliferation of generative AI tools, which are increasingly enabling developers to engage with code in their natural language.\nTo identify the developer communities with the highest growth potential over the next five years, we created projections based on current trends. And our prediction from last year changed: India is now on track to surpass the United States in number of developers on GitHub by 2028 (previously, we had predicted it would overtake the United States by 2027 based on linear population growth).\nThe tech sector in Latin American countries is currently seeking to “build on [its] … momentum,” as the region experiences rapid growth primarily in open banking, cloud-based infrastructure, and AI. It’s driven by vibrant tech hubs, a large new graduate workforce, and governmental support that includes incentives for tech startups.\n| Country | Percentage growth | # of developers |\n|---|---|---|\n| Brazil | 27% YoY | >5.4M |\n| Mexico | 21% YoY | >1.9M |\n| Colombia | 25% YoY | >1M |\n| Argentina | 22% YoY | >1.1M |\n| Peru | 27.5% YoY | >583K |\n“Students learn to collaborate and cooperate, they develop their soft skills. I did a survey at the end of the semester and more than 70% of the students indicated that working on projects through GitHub improved their technical and leadership skills.” – José Alfredo Román Cruz // Professor, Technological Institute of Tlaxiaco\nThe number of developers on GitHub in Asia Pacific communities is growing at some of the fastest rates globally—and we expect this trend to continue. This will be particularly true as generative AI increasingly empowers developers to engage with code and communities, regardless of their spoken language.\nIndia has a fast growing developer community and is on pace to become the world’s largest by 2028. India prioritizes open source software and introduced the National Education Policy of 2020, which requires schools to include coding and AI in student curriculum. And notably, a recent study from the learning platform Udemy found that GitHub is one of the most sought after skills in India, comparable to English grammar skills.\nAs part of the United Nations-backed Digital Public Goods Alliance, India also builds its digital public infrastructure with digital public goods (DPGs)—ranging from software code to AI models. Its Open Healthcare Network platform, for instance, is a community-driven project fueled by a small but dedicated team of open source developers who use GitHub Copilot.\n| Country | Percentage growth | # of developers |\n|---|---|---|\n| India | 28% YoY | >17M |\n| China | 10% YoY | >9M |\n| Indonesia | 23% YoY | >3.5M |\n| Japan | 23% YoY | >3.5M |\n| Philippines | 29% YoY | >1.7M |\n“GitHub is like the air we breathe. It’s such a natural part of the way we work that sometimes we don’t even notice it. We cannot imagine living without GitHub.” – Ryuzo Yamamoto // Software Engineer, Souzoh\nEurope and the Middle East are shaping the future of AI in distinct ways. Countries in the Middle East are investing in AI with the aim to become global AI hubs. Meanwhile, over the last five years, the European Union has been putting forward several frameworks and laws to regulate technology and platform providers and generative AI, including the Digital Services Act, Digital Markets Act, AI Act, and Data Governance Act.\n| Country | Percentage growth | # of developers |\n|---|---|---|\n| United Kingdom | 19% YoY | >4M |\n| Germany | 21% YoY | >3.5M |\n| France | 20% YoY | >2.8M |\n| Spain | 24% YoY | >1.8M |\n| Turkey | 19% YoY | >1.7M |\n“Basically, everything we build is iterating on open source. I think it’s only reasonable for a larger organization like us to engage and give back to the community where possible.” – Kay Goebel // Engineering Lead, Zalando\nAfrica is nurturing an increasing pool of developers that is ready to drive the next wave of tech entrepreneurialism—and, in some cases, already are. The continent’s developers have cultivated a thriving open source community with initiatives like Open Source Community Africa and All In Africa.\n| Country | Percentage growth | # of developers |\n|---|---|---|\n| Nigeria | 28% YoY | >1.1M |\n| Egypt | 25% YoY | >990K |\n| South Africa | 23% YoY | >664K |\n| Morocco | 25% YoY | >556K |\n| Kenya | 33% YoY | >393K |\nNigeria, Egypt, South Africa, and Kenya are considered Africa’s “big four” countries focusing on technical literacy, drawing global investors, and securing most of Africa’s startup funding in 2023. For example, Egypt’s Ministry of Communication and Information Technology is developing technical skills through its “Our Future is Digital” initiative.\n“I think it’s important to change the perception that Africans are merely consumers; we are creators as well. By helping people across Africa build projects and showcase their work globally, I hope to change this narrative and demonstrate that Africa is also a hub for innovation and creativity, especially within the open source community.” – Ruth Ikegah // Community Lead, CHAOSS Africa\nIn 2024, developers globally made nearly 1 billion contributions to open source and public repositories across GitHub (this includes open source projects with a license and public projects without a license accepted by the Open Source Initiative). These contributions ranged from popular projects like home-assistant/core to generative AI projects like ollama/ollama (more on that later) and commercially backed projects like vercel/next.js.\nSimilar to last year, we saw commercially backed and generative AI projects attract the most contributions in 2024. But where those contributions came from is notable with regions outside North America and Europe surging in overall activity.\nMore developers are consuming open source with a 15% spike in JavaScript packages through the npm registry. The top 50 packages saw net positive growth, which signals solidification and maturation of the JavaScript ecosystem. This also suggests that more people consume open source as key ecosystems—as with JavaScript—mature.\nWe see some differences between the top regions on GitHub and the top regions contributing to open source. For instance, Germany ranks as the third largest region contributing to open source on GitHub—but as of 2024, they are the seventh largest community on GitHub by developer population.\nThere’s a continued increase in first-time contributors to open source projects. 1.4 million new developers globally joined open source with a majority contributing to commercially backed and generative AI projects. Notably, we did not see a rise in rejected pull requests. This could indicate that quality remains high despite the influx of new contributors.\n| Top 10 open source and public projects attracting the most first-time contributors in 2024 on GitHub | |\n|---|---|\n| 1. | microsoft/vscode |\n| 2. | home-assistant/core |\n| 3. | microsoft/PowerToys |\n| 4. | Kas-tle/java2bedrock.sh |\n| 5. | ultralytics/ultralytics |\n| 6. | flutter/flutter |\n| 7. | langchain-ai/langchain |\n| 8. | Ultimaker/Cura |\n| 9. | platformio/platformio-home |\n| 10. | Koenkk/zigbee2mqtt |\nThe top open source projects by contributors on GitHub. home-assistant/core and flutter/flutter continue to rank among the top projects by contributors on GitHub, reflecting their popularity and community strength. Notably, vercel/next.js showed up again in the top 10 list for all contributors, which indicates its continued growth and stature in web development.\n| Top 10 public projects by contributors on GitHub | |\n|---|---|\n| Project | Contributor count |\n| home-assistant/core | >21K |\n| microsoft/vscode | >20K |\n| ProvableHQ/leo | >20K |\n| firstcontributions/first-contributions | >13k |\n| flutter/flutter | >10K |\n| NixOS/nixpkgs | >9K |\n| vercel/next.js | >9K |\n| langchain-ai/langchain | >8K |\n| godotengine/godot | >7K |\n| ollama/ollama | >7K |\nDevelopers are driving societal change through popular open source projects. GitHub’s For Good First Issue is a curated list of DPGs that need contributors, connecting those projects with people who want to address a societal challenge and promote sustainable development. As more developers continue to join GitHub globally amid investments in connectivity and AI, we expect continued contribution growth in DPGs.\n| Top 10 For Good First Issue projects attracting first-time contributors in 2024 |\n|---|\n| frappe/erpnext |\n| truenas/charts |\n| globaleaks/GlobaLeaks |\n| ersilia-os/ersilia |\n| ckan/ckan |\n| learningequality/kolibri |\n| ushahidi/platform |\n| coronasafe/care |\n| rubyforgood/human-essentials |\n| rubyforgood/casa |\nSignificantly, 34% of contributors to the top 10 For Good Issue projects above made their first contribution after signing up for GitHub Copilot.\nFirst-time contributors have contributed to projects that assist youth in the foster care system, facilitate drug discovery in middle- and low-income countries, enable whistleblowing around wrongdoings, and more.\nMore than 82% of GitHub contributions are made to private repositories. Developers made 4.3 billion contributions across more than 181 million private repositories in 2024. These numbers show the sheer scale of activity happening out of view in private repositories through free, Team, and GitHub Enterprise accounts—especially since we started offering private repositories to developers with free accounts in 2019.\nA spike in Jupyter Notebooks use shows that open source underscores a growing community, especially as Python surges to become the most used language on GitHub. Since 2018, we have seen the use of Jupyter Notebooks steadily grow—and that growth surged in 2022 as research and experimentation with generative AI and machine learning took off. Since 2022, Jupyter Notebooks usage on GitHub has spiked more than 170%. And since last year, usage has increased by 92%. Data scientists and machine learning researchers commonly use the open source application for machine learning, data visualization, and more.\nOver the past year, generative AI has moved beyond the hype of 2023 as developers and organizations alike look for results over experimentation—and data on GitHub shows as much. In 2024, developers on GitHub created over 70,000 new public and open source generative AI projects and made almost 60% more total contributions to all generative AI projects on GitHub.\nAI models become part of the developer’s tech stack. We’re seeing innovation in generative AI on GitHub move into public repositories, showing that developers are building more and more in the open. As developers identify more and more use cases for AI, the role of generative AI models in software development has shifted from helping developers write code to a new building block in developing applications.\nDevelopers on GitHub are trying to lower the barrier to AI experimentation. The top 10 public generative AI projects work to improve access to AI models to make experimentation easier. Applications range from creating user-friendly interfaces that improve text-to-image generation to building autonomous AI agents for task management. To pull this data, we looked for repositories that use generative AI-related keywords collected from our research last year.\nWhile we see consistency in developer interest in image generation via AUTOMATIC1111/stable-diffusion-webui and AI agent development via Significant-Gravitas/AutoGPT, we also see some shifts in AI development work on GitHub:\nMore than one million open source maintainers, and verified students and teachers have used GitHub Copilot at no cost. In 2024, we saw a 100% increase in teachers, students, and open source maintainers using GitHub Copilot in our complimentary program. This underscores AI’s utility in education and upskilling (like learning a new programming language). In the last year, over 450,000 GitHub Education users were first-time contributors to projects on the platform.\n| 💡 If you’re a student, teacher, or maintainer, you can apply to get complimentary access to GitHub Copilot. |\nWe see a correlation in increased activity among developers who regularly use GitHub since the launch of GitHub Copilot. Among developers who use GitHub regularly and use GitHub Copilot, we see higher activity (between 12-15% among developers who use GitHub five days a week and 8-15% among developers who use GitHub once a week) across open source and public projects. This echoes research conducted into AI coding tools’ impact on overall perceived and quantitative productivity gains among developers.\nWe are already seeing growth in global contributions and contributors to generative AI projects. Developers in the United States, Hong Kong SAR, India, Germany, and France are among the top groups driving contributions to generative AI projects. India, for instance, had a 95% increase in year-over-year contributions to generative AI projects on GitHub while France had a 70% increase. These communities also saw some of the largest year-over-year growth in contributors.\nOther communities saw some of the highest percentage growth in contributors to public generative AI projects, like the Netherlands (291%), Ethiopia (242%), Costa Rica (171%), Serbia (175%), and Vietnam (143%).\n💡 Stay smart. When comparing regions with a high number of generative AI contributors versus regions with a high number of contributions, we see that while growth is still happening globally, the regions with larger developer populations are rising to the top.\nIn 2024, developers across GitHub used secret scanning to detect more than 39 million secret leaks. We also saw developers and open-source communities respond more quickly to security incidents through new generative AI security tools, automated alerts, and proactive measures. This isn’t just helping make software more secure—it’s leading to faster fixes, too.\nThe most common security vulnerabilities in 2024. Injection\n, an admittedly large category of security issues, was the most common type of vulnerability found across public and private repositories via CodeQL, a code analysis engine developed by GitHub to automate security checks. Meanwhile, Security Logging and Monitoring Failures\nvulnerabilities were found more often in private repositories.\nDevelopers are increasingly using AI for code reviews and security vulnerability remediation. AI doesn’t replace security experts, but it can augment their knowledge and capabilities while helping address a global shortage of security professionals.\nDevelopers on GitHub are using automation to manage increasing security responsibilities. For instance, developers are merging an increasing number of pull requests generated by Dependabot, which sends alerts about outdated or vulnerable dependencies in a pull request. The gap between pull requests opened by Dependabot and pull requests merged by developers continues to shrink year over year, too.\nWhile developers are using automation and AI to secure their code and applications, there’s room to improve. Government regulations increasingly demand developers know the ingredients going into their software artifacts, which increases demand for implementing tools that automate governance and compliance.\n94% of the top 50 open source projects are using the OpenSSF Scorecard to help ensure their projects implement security best practices. We evaluated this by looking at roughly 1 million repositories that have OpenSSF scorecards in place from the top 50 most popular open source projects. The OpenSSF Scorecard action assesses repositories, runs checks for security best practices, and generates a security scorecard with real-time feedback.\nBecoming familiar with GitHub security features, such as code scanning and secret scanning (which are free for open source developers), and supply chain governance features like artifact attestations is a good first step towards automating best security practices. Enterprise developers can also turn to their OSPOs for support in navigating regulations and implementing security measures across their open source dependencies, as OSPOs will play increasingly critical roles in compliance.\nDevelopers are increasingly automating more aspects of build, test, and security activities using GitHub Actions in public and open source projects. In 2024, we saw developers use 10.54 billion total GitHub Actions minutes (measured in CPU minutes). That’s up almost 30% year over year from the 7.3 billion GitHub Actions minutes developers used in 2023.\nThe rising number of developers employing automation was mirrored by growth in the number of GitHub Actions in the GitHub Marketplace. Some of the most popular actions include Gosec Security Checker, Super-Linter, PHPLint, and Metrics embed.\n“We get everything we need from the GitHub Actions marketplace to build and support our tailored CI/CD pipeline.” – Bjoern Bengelsdorf // Senior Software Engineer, Otto Group\nAmong the most popular GitHub Actions in the GitHub Marketplace are OpenCommit, which augments commit messages with meaningful AI-generated content when pushing to remote, and Replexica, which provides AI-powered code translations across multiple programming languages. These actions suggest that developers are finding more use cases for generative AI in their workflows.\n| Check out the GitHub Marketplace and make your own GitHub Actions. |\nPython becomes the most used language on GitHub, overtaking JavaScript after a 10-year run as the most used language. This is the first large-scale change we’ve seen in the top two languages since 2019—and it speaks to the rise in Python that’s accompanied the generative AI boom we’ve seen over the past two years.\nNotably, JavaScript still ranks first for code pushes alone. More developers still use JavaScript more often to push code, but in absolute activity across all contribution types on GitHub, Python now outranks JavaScript. In addition to Python’s relative ease, it is also a popular choice for data science and generative AI—both of which have grown sharply on GitHub over the past two years.\nJavaScript still maintains a massive developer base as we see increases in npm package consumption. The language is versatile in running on both client and server sides, and easily adapts to different frameworks and standards, among other reasons for its popularity. And as its robust ecosystem continues to mature, we’re seeing strong growth in the consumption of packages via the npm registry with a 15% year-over-year increase.\nRust continues to gain popularity for its safety, performance, and productivity. Originally intended to serve as a safer alternative to C and C++, Rust has exploded in popularity and adoption, with top applications, such as Microsoft Windows, using Rust to rewrite core libraries with its memory-safe code.\n| 🦀 Learn how Rust developers are making the web safer and why Rust is the most admired language among developers. |\nBased on emerging and top languages, the notion of a developer extends beyond software developers to roles like operations or IT developers, machine learning researchers, data scientists, students, teachers, and mathematicians.\nRead more on why Python keeps growing >\nThe continued popularity of HCL and Go reflect growth in operations and IaC work, particularly around managing cloud-native infrastructure. Since we first saw massive growth in cloud-native development in 2019, IaC has continued to grow in open source. The 25% year-over-year growth of HCL in particular suggests developers increasingly use declarative languages to dictate how they’re managing cloud deployments.\nThe popularity of HCL and Go as well as Dockerfiles suggest that developers are scaling work in cloud-native applications. Increased Terraform use follows the increased use we’ve seen in Dockerfiles and other cloud-native technologies over the last decade. The increased adoption of IaC practices also suggests developers are bringing more standardization to cloud deployments.\nAs the developer’s tech stack evolves, so does their role over time. We leave you with three takeaways:\nThis report draws on anonymized user and product data taken from GitHub from October 1, 2023 through September 30, 2024.\nMore data is publicly available on the GitHub Innovation Graph—a research tool GitHub offers for organizations and individuals curious about the state of software development across GitHub. Only public activity is included, and metrics for economies are only reported when there are 100 or more unique developers performing the relevant activity within the time period.\nFor a complete methodology, please contact press@github.com.\nSee what’s happening at Universe 2025, from experimental dev tools and career coaching to community-powered spaces. Save $400 on your pass with Early Bird pricing.\nDelegate coding tasks to Copilot and track progress wherever you are on GitHub. Copilot works in the background, creates a pull request, and tags you for review when finished.\nDiscover the latest trends and insights on public software development activity on GitHub with the quarterly release of data for the Innovation Graph, updated through March 2025."
    },
    {
      "url": "https://www.gitclear.com/ai_assistant_code_quality_2025_research#:~:text=Emerging%20trends:%204x%20more%20code,moved%20lines%20(code%20reuse).",
      "text": "Get the latest installment of AI code quality research that has been cited by industry leaders like\nAI Copilot Code Quality: 2025 Look Back at 12 Months of Data\nStack Overflow's 2024 Developer Survey showed that 63% of professional developers are currently using AI in their development process, with another 14% saying they plan to begin using AI soon.\nWe examine 5 years worth of data (2020-2024), using the largest dataset that has been brought to bear -- 211 million changed lines from repos owned by Google, Microsoft, Meta, and enterprise C-Corps. The focus was to understand how AI Assistants influence the type of code being written. Are there measurable differences in code quality metrics between AI-assisted blocks and non-AI-assisted code?\nWe observe a spike in the prevalence of duplicate code blocks, along with increases in short-term churn code, and the continued decline of moved lines (code reuse).\nStart reading to learn:\n- What code quality metrics are threatened by the proliferation of AI?\n- What do Technical Leaders need to be on the lookout for 2025?\n- How can you measure the impact of AI on your team's code quality?\nAbstract\nCode assistants diligently accepted a far greater share of code-writing responsibility during 2024 than ever before. According to Stack Overflow’s 2024 Developer Survey, 63% of Professional Developers said they currently use AI in their development process. Another 14% say they plan to soon.\nThe 36,894 developers who answered “most important benefit you’re hoping to achieve with AI” overwhelmingly picked “Increased productivity.” Developers seem to view AI as a means to write more code, faster. Through the lens of “does more code get written?” common sense and research agree: resounding yes. AI assistants do beget more lines.\nBut if you ask a Senior Developer “what would unlock your team’s full potential?” their answer won’t be “more code lines added.” To retain high project velocity over years, research suggests that a DRY (Don’t Repeat Yourself), modular approach to building is essential [4] [5]. Canonical systems are documented, well-tested, reused, and periodically upgraded. This research aims to evaluate how today’s profusion of LLM-authored code is influencing the maintainability of tomorrow’s systems.\nTo investigate, we analyze the largest known database of highly structured code change data. 211 million changed lines of code, authored between January 2020 and December 2024, are assessed on quantifiable “code quality” metrics. The research finds that the percentage of changed code lines (associated with refactoring) sunk from 25% of changed lines in 2021, to less than 10% in 2024, while lines classified as \"copy/pasted\" (cloned) rose from 8.3% to 12.3% in the same period."
    }
  ],
  "argos_summary": "Vibe coding, a low‑code movement powered by AI tools like Copilot and Replit, is democratizing software development by enabling non‑technical creators in emerging markets to build products quickly. While this inclusivity fuels rapid innovation, it also introduces risks such as fragile code, increased technical debt, and security vulnerabilities, as studies show a rise in duplicated and buggy AI‑generated code. The trend is reshaping talent pipelines and hiring practices, blurring traditional roles and encouraging a culture of fast iteration and collaborative remixing. However, without careful education, governance, and security practices, the wave may erode craftsmanship and depress developer salaries, underscoring the need for intentional, sustainable adoption.",
  "argos_id": "MTHV54IG8"
}