{
  "url": "https://www.techtimes.com/articles/311811/20250905/iphone-17-pro-max-price-hike-rumors-safe-tariffs-increase-coming.htm",
  "authorsByline": "Isaiah Richard",
  "articleId": "e3b764b765214ade9a685d1d1e2cc286",
  "source": {
    "domain": "techtimes.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.techtimes.com/en/full/458985/apple-event-september-9-2025.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-05T01:40:20-04:00",
  "addDate": "2025-09-05T05:52:28.714343+00:00",
  "refreshDate": "2025-09-05T05:52:28.714346+00:00",
  "score": 1.0,
  "title": "iPhone 17 Pro Max Price Hike Rumors: Safe From Tariffs But Increase Is Coming",
  "description": "Apple's iPhone 17 Pro Max is getting a rumored price hike despite being safe from tariffs, according to the latest rumors.",
  "content": "The iPhone 17 Pro Max is rumored to be more expensive than last year's iPhone 16.\n\nReports indicate Apple's iPhone 17 lineup will not be impacted by Trump administration tariffs, but all four models are still expected to see a price increase.\n\nA report from Trendforce suggests all next-generation iPhone 17 Pro series units will have a price increase. Estimates indicate the iPhone 17 Pro will see the highest price bump, followed by the iPhone 17 Pro Max.\n\nThe iPhone 17 Pro Max may cost up to $100 more than last year's model, with the base variant starting at $1,299 and featuring 256 GB of memory.\n\nOn the other hand, the base iPhone 17 Pro release will reportedly see a $200 price bump compared to the iPhone 16 Pro, which will now start at $1,199.\n\nBoth the Pro series models are expected to use the upgraded Apple A19 Pro chipset, while the base variant, as well as the rumored iPhone 17 Air, are getting the A19 processor.\n\nApple's iPhone 17 Is Safe From Tariffs, Still Increasing\n\nCNBC reported that the iPhone 17 series, which is expected to be released later this year, would not be affected by the Trump tariffs. Despite this, there seems to still be a looming price increase set to apply to the lineup, with other analysts also expecting a $50 bump to the base iPhone 17.\n\nThe iPhone 17 Air, on the other hand, is expected to start at around $1,099 with 256 GB of storage.\n\nThe next Apple event is already set for next week, and it is expected to unveil the latest iPhone 17 lineup. Various rumors have talked about new changes coming for the iPhone 17 Pro Max, which includes the new position of the Apple logo as it will reportedly be slightly off-center due to the new camera bump island.\n\nIn the past releases of the iPhone Pro and Pro Max variants, it focused on delivering neutral colorways, but that may be about to change. Each year, a new exclusive color arrives for its flagship devices, and for 2025's iPhone 17 Pro series, rumors revealed that it would be a vibrant orange color.\n\nThe iPhone 17 Pro series is expected to debut other upgrades like a the A19 Pro chipset, a small memory boost, and other improvements to the camera lenses.\n\nThat being said, earlier rumors suggested that Apple will opt for more eSIM-exclusive iPhone 17s coming to multiple regions worldwide after initially making it a standard among US releases in the past years.",
  "medium": "Article",
  "links": [
    "https://www.techtimes.com/articles/311380/20250717/iphone-17-pro-leak-new-orange-color-could-mark-vibrant-comeback-apple.htm",
    "https://www.techtimes.com/articles/311200/20250706/iphone-17-pro-render-unveils-new-apple-logo-position-aluminum-frame-design-revamp.htm",
    "https://www.cnbc.com/2025/09/03/apple-might-raise-iphone-prices-despite-its-handling-of-tariffs-so-far.html",
    "https://www.trendforce.com/presscenter/news/20250904-12700.html",
    "https://www.techtimes.com/tags/iphone-17",
    "https://www.techtimes.com/articles/311794/20250903/apples-llm-siri-coming-early-2026-says-analyst.htm",
    "https://www.techtimes.com/articles/311765/20250901/apple-iphone-17-clear-case-esim-exclusivity-leaks-share-more-details-ahead-sept-9-event.htm"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "iPhone Pro",
      "weight": 0.16460179
    },
    {
      "name": "Pro Max",
      "weight": 0.13278839
    },
    {
      "name": "iPhone 17s",
      "weight": 0.12546402
    },
    {
      "name": "A19 Pro",
      "weight": 0.12464373
    },
    {
      "name": "iPhone 17 Pro Max Price Hike Rumors",
      "weight": 0.10782353
    },
    {
      "name": "iPhone 17 Pro Max",
      "weight": 0.096987136
    },
    {
      "name": "iPhone 17 Pro series",
      "weight": 0.09681433
    },
    {
      "name": "the iPhone Pro and Pro Max variants",
      "weight": 0.09031465
    },
    {
      "name": "iPhone 17 Pro",
      "weight": 0.087293275
    },
    {
      "name": "the upgraded Apple A19 Pro chipset",
      "weight": 0.08332493
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8583984375
    },
    {
      "name": "/News/Technology News",
      "score": 0.81787109375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.73828125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.69287109375
    }
  ],
  "sentiment": {
    "positive": 0.38621747,
    "negative": 0.094323725,
    "neutral": 0.5194588
  },
  "summary": "Apple's iPhone 17 Pro Max is expected to be more expensive than last year's version of the iPhone 16. However, all four models are expected to see a price increase, with the iPhone Pro Max estimated to cost up to $100 more. The base version of this model will reportedly see a $200 price increase compared to the previous year's iPhone 16 Pro. Both the Pro series models and the base variant, the rumored iPhone 17 Air, are also expected to use the upgraded Apple A19 Pro. Despite this, there is still a looming price increase set to apply to the lineup.",
  "shortSummary": "Apple's iPhone 17 series is expected to see a price increase, with the iPhone 17 Pro Max reportedly costing $100 more than last year.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "506242a749f143d8996ea70d19814e60",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/09/03/apple-might-raise-iphone-prices-despite-its-handling-of-tariffs-so-far.html",
      "text": "When Tim Cook gifted President Donald Trump a gold and glass plaque last month, the Apple CEO was hailed by Wall Street for his job managing the iPhone-maker's relationship with the White House.\nCook, Wall Street commentators said, had largely navigated the threat of tariffs on Apple's business successfully by offering Trump an additional $100 billion U.S. investment, a win the president could tout on American manufacturing. But despite the 24-carat trophy Cook handed Trump, the true costs of those tariffs may finally show up for Apple customers later this month.\n\"Thank you all, and thank you President Trump for putting American innovation and American jobs front and center,\" Cook said at the event, which brought Apple's total planned spend to $600 billion in the U.S. over the next five years. Trump, at the event, said that Apple would be exempt from forthcoming tariffs on chips that could double their price.\nBut as Apple prepares to announce new iPhones on Tuesday, some analysts are forecasting the company to raise prices on its devices even after all Cook has done to avoid the worst of the tariffs.\n\"A lot of the chatter is: Will the iPhone go up in price?\" said CounterPoint research director Jeff Fieldhack.\nAlthough smartphones haven't seen significant price increases yet, other consumer products are seeing price increases driven by tariffs costs, including apparel, footwear, and coffee. And the tariffs have hit some electronics, notably video games — Sony, Microsoft and Nintendo, have raised console prices this year in the U.S.\nSome Wall Street analysts are counting on Apple to follow. Jeffries analyst Edison Lee baked in a $50 price increase into his iPhone 17 average selling price projections in a note in July. He's got a hold rating on Apple stock.\nGoldman Sachs analysts say that the potential for price increases could increase the average selling price of Apple's devices over time, and the company's mix of phones have been skewing toward more expensive prices.\nAnalysts expect Apple to release four new iPhone models this month, which will likely be named the \"iPhone 17\" series. Last year, Apple released four iPhone 16 models: the base iPhone 16 for $829, the iPhone 16 Plus at $899, the iPhone 16 Pro at $999 and the iPhone 16 Pro Max at $1,199.\nThis year, many supply chain watchers expect Apple to replace the Plus model, which has lagged the rest of the lineup, with a new, slimmer device that trades extra cameras and features for a thinner, lighter body.\nThe \"thinner, lighter form factor may drive some demand interest,\" wrote Goldman analysts, but tradeoffs like battery life may make it hard to compete with Apple's entry-level models.\nAnalysts have said they expect the slim device to cost about $899, similar to how much the iPhone 16 Plus costs, but they haven't ruled out a price bump. That would still undercut Samsung's thin Galaxy Edge, which debuted earlier this year at $1,099.\nApple did not respond to a request for comment.\nHow Cook has managed tariffs thus far\nWhen Trump announced sweeping tariffs on China and the rest of the world in February, it seemed like Apple was in the crosshairs.\nApple famously makes the majority of its iPhones and other products in China, and Trump was threatening to place tariffs that could double Apple's costs or more. Some of Trump's so-called \"reciprocal\" tariffs would hit countries like Vietnam and India where Apple had hedged its production bets.\nBut seven months later, Apple has weathered the tariffs better than many had imagined.\nThe U.S. government has paused the most draconian Chinese tariffs several times, smartphones got an exemption from tariffs and Cook in May told investors that the company was able to rearrange its supply chain to import iPhones to the U.S. from India, where tariffs are lower.\nCook also successfully leaned on his relationship with Trump, visiting him in White House and taking his side in August, when Cook presented the shiny keepsake to Trump. That commitment bolstered Trump's push to bring more high-tech manufacturing to the U.S. In exchange, Trump said he would exempt Apple from a forthcoming semiconductor tariff, too. And Trump's IEEPA tariffs were ruled illegal in late August, although they are still in effect.\nApple hasn't completely missed the tariff consequences. Cook said the company spent $800 million on tariff costs in the June quarter, mainly due to the IEEPA-based tariffs on China. That was less than 4% of the company's profit, but Apple warned it could spend $1.1 billion in the current quarter on tariff expenses.\nAfter months of eating the tariff costs itself, Apple may finally pass those costs to consumers with this month's launch of the iPhone 17 models.\nA history of careful pricing\nApple has been judicious about hardware price increases in the U.S. The smaller Pro phone, for example, hasn't gotten a price increase since its debut in 2017, holding at $999. But Apple has made some price changes.\nThe company raised the price of its entry level phones from $699 to $829 in 2020. And in 2022 when Apple eliminated the smaller iPhone Mini that started at $699, the company replaced it with the bigger-screen Plus that costs $899. The Pro Max also got a hike in 2023 when Apple bumped it from $1,099 to its current price of $1,199.\nIf Apple does increase prices on its phones this year, don't expect management to blame tariffs.\nThe average selling price of smartphones around the world is rising, according to IDC. The price of smartphone components, such as the camera module and chips, have been increasing in recent years.\nApple is much more likely to focus on highlighting its phones' new features and quietly note the new price. Analysts expect the new iPhones to have larger screens, increased memory and new, faster chips for AI.\n\"No one's going to come out and say it's related to tariffs,\" said IDC analyst Nabila Popal.\nOne way that Apple could subtly raise prices is by eliminating the entry-level version of its phones, forcing users to upgrade to get more storage at a higher starting price. Apple typically charges $100 to double the amount of the iPhone's storage from 128GB to 256GB.\nThat's what JPMorgan analysts expect Apple to announce next week.\nThey forecast that Apple will leave the prices of the entry level and high-end Pro Max models alone, but they wrote that they expect the company to eliminate the entry-level version of the Pro, meaning that users will have to pay $1,099 for an iPhone 17 Pro that has more starting-level storage than its predecessor. That's how Apple raised the price of the entry-level Pro Max in 2023.\n\"However, with Apple's recent announcements relative to investments in US, the assumption is that the company will largely be shielded from tariffs, driving expectations for limited pricing changes except for those associated with changes in the base storage configuration for the Pro model,\" wrote JP Morgan analyst Samik Chatterjee.\nWhen Cook was asked about potential Apple price increases on an earnings call in May, he said there was \"nothing to announce.\"\n\"I'll just say that the operational team has done an incredible job around optimizing the supply chain and the inventory,\" Cook said.\nWATCH: Apple explores using Google Gemini AI to power revamped Siri, reports say"
    },
    {
      "url": "https://www.techtimes.com/tags/iphone-17",
      "text": "Phones/Tablets/Mobile TechiPhone 17 Price Projection Shows Potential $100 Hike for Pro Model, But There's a Catch Analyst predicts iPhone 17 Pro could see a $100 price hike with more storage included, while other models may hold steady ahead of Apple's big reveal.by Jose Enrico\nTechApple's iPhone 17 Crossbody Strap Is the Latest Accessory Coming for the Smartphone, Says Leakerby Isaiah Richard\nPhones/Tablets/Mobile TechiPhone 17 Base Model to Feature A19 Chip, Analyst Confirms Ahead of Launchby Jose Enrico\nApps/SoftwareApple's New iPhone Ringtone Leaks in iOS 26 Beta—Hidden Sound Could Drop With iPhone 17by Jose Enrico\nTechiPhone 17 New Speculations: A18 Chip, Smaller Dynamic Island, More Rumored—Hints Coming This WWDC?by Isaiah Richard\nPhones/Tablets/Mobile TechiPhone 17 Air Rumored to be Lighter Than Samsung Galaxy S25 Edge: What Other Surprises Will Apple Bring?by Jose Enrico\nPhones/Tablets/Mobile TechGoogle Trolls Apple Over iPhone 17's New Camera Bar: Copycat Claims Fly in Latest Pixel Adby Jose Enrico\nPhones/Tablets/Mobile TechiPhone 17 Rumored to Feature 12GB RAM Across All Models: Will iPhone 18 Get the Same Improvement?by Jose Enrico\nTechiPhone 17 Lineup to Get New Colors, 'Shakeup' Reportedly Coming Due to Massive Changesby Isaiah Richard\nPhones/Tablets/Mobile TechRecent iPhone 17 Dummy Leak Reveals Apple's Thinnest Smartphone, Including Other Modelsby Jose Enrico\nPhones/Tablets/Mobile TechiPhone 17 Pro Rumored to Prioritize New Telephoto Camera: Is Apple Ditching 5x Zoom For This?by Jose Enrico\nPhones/Tablets/Mobile TechiPhone 17 to Reportedly Get ProMotion Display—Do iPhone Users Really Care About High Refresh Rates?by Jose Enrico"
    },
    {
      "url": "https://www.trendforce.com/presscenter/news/20250904-12700.html",
      "text": "Apple is set to unveil four flagship devices—the iPhone 17, the iPhone 17 Air (tentative name), iPhone 17 Pro, and iPhone 17 Pro Max. Beyond a refreshed design, the new lineup will feature enhancements in processor performance, thermal management, and imaging capabilities, all of which are expected to help stimulate demand. TrendForce projects that total shipments of the iPhone 17 series will rise by 3.5% compared with the iPhone 16 lineup in 2024, with the Pro series remaining the main sales driver. However, sluggish global economic conditions and the potential for higher prices on premium models may temper overall demand.\nThe introduction of the iPhone 17 Air signals Apple’s official entry into the thin-and-light flagship category. Yet, the Air may fall short of satisfying consumers who prioritize large batteries and high-end photography by reducing battery capacity and trimming camera specifications. TrendForce expects initial shipments of the Air to align with historical levels of the Plus series, though its actual sales performance remains to be seen.\nThe iPhone 17 and Air are expected to feature the A19 processor, while the Pro series will adopt the A19 Pro. DRAM capacity will be increased to 12 GB on the Air, Pro, and Pro Max, and NAND Flash storage will start at 256 GB for these models, scaling up to 1 TB.\nThe Air model will use a silicon anode battery and eSIM configuration to balance slimness with endurance. Notably, the entire iPhone 17 series will see major camera upgrades, with the front camera moving from 12MP to 24MP and all rear cameras raised to 48MP. The Pro models will go a step further, featuring a redesigned rectangular array and optimized software algorithms to enhance optical zoom and image resolution.\nIn terms of pricing, the base iPhone 17 model is expected to hold last year’s levels, while the Air, Pro, and Pro Max will see increases of US$50–$100 per comparable capacity to reflect their design breakthroughs and hardware enhancements. The Air’s price point is expected to compete directly with Samsung’s Galaxy S25 Edge, underscoring Apple’s strategy of strengthening brand appeal through product differentiation.\nThe launch of the Air, together with next year’s anticipated foldable model, highlights Apple’s broader strategy to diversify its product portfolio and capture a wider user base. TrendForce notes that Apple may adjust its release cycle going forward, launching a sub-flag shipment model in the first half of the year, followed by the Air, Pro, Pro Max, and foldable in the second half—creating a richer, more clearly segmented product matrix.\nFor more information on reports and market data from TrendForce’s Department of Semiconductor Research, please click here, or email the Sales Department at SR_MI@trendforce.com\nFor additional insights from TrendForce analysts on the latest tech industry news, trends, and forecasts, please visit https://www.trendforce.com/news/\nSubject\nRelated Articles\nRelated Reports"
    },
    {
      "url": "https://www.techtimes.com/articles/311765/20250901/apple-iphone-17-clear-case-esim-exclusivity-leaks-share-more-details-ahead-sept-9-event.htm",
      "text": "The upcoming Apple event is shaping up to be the iPhone 17 event people are expecting, according to the latest leaks, and new details still continue to appear about the devices' clear cases and eSIM exclusivity.\nApple iPhone 17 Clear Case Leaks Ahead of Sept. 9 Event\nSeveral leakers, including Majin Bu and Sonny Dickson, have shared alleged actual, on-hand photos and videos of the iPhone 17 and iPhone 17 Pro clear cases, which are reportedly coming alongside the device's official release.\nThe new set of cases seems to confirm a previous rumor about the latest smartphone of the company, particularly the redesigned rear camera bump that will take over the upper part of the device's back.\nHowever, the images shown by both leakers are not what the public expected as its \"clear case\" design is not exactly all transparent, with both images showing off a covering from under the camera bump.\nIt was revealed to be a cover for the MagSafe charging magnets integrated into the case, which features the off-center Apple logo that is repositioned to accommodate the enlarged bump.\nBoth media shown by the leakers were claimed to be original Apple accessories.\nRead Also: Apple's iOS 18.7 Could Be the Last Update for Older iPhones: Here's What's Next With iOS 26\niPhone 17's eSIM Exclusivity Is Expanding\nTechRadar also shared a follow-up to the latest report about the iPhone 17 Air's eSIM exclusivity for regions outside the United States, claiming that it would also apply to other models under the lineup.\nThe report said that Apple is also shipping out eSIM-only models of the iPhone 17, iPhone 17 Pro, and iPhone 17 Pro Max to other regions, joining the eSIM-exclusive setup of the iPhone 17 Air.\nAll Eyes on Apple's Upcoming Event\nIt has been almost one week since Apple confirmed that there will be an upcoming showcase set for September 9, which was widely considered and expected as the much-awaited iPhone 17 announcement.\nIn a social media post by Apple CEO Tim Cook, he said referred to it as an \"awe dropping\" event.\nSince the event's confirmation, different analysts and insiders focused on Apple have gone full-on with details and news on the iPhone 17, with many also talking about the accessories launching with it.\nOne specific accessory is the Crossbody Strap, which is said to feature magnets all over it to secure it in place with original Apple iPhone 17 cases.\nWith iPhone 17 leaks talking about its A19 chipsets, new rear camera bump design, eSIM exclusivity, and more, there were also other reports about the expected hardware joining the event.\nApple is reportedly also setting up the stage for the rumored AirPods Pro 3 and the new Apple Watch versions, like Series 10 and Ultra 3.\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    },
    {
      "url": "https://www.techtimes.com/articles/311200/20250706/iphone-17-pro-render-unveils-new-apple-logo-position-aluminum-frame-design-revamp.htm",
      "text": "The iPhone 17 Pro is at the center of a new leaked render that showcases the latest look of its rear, focusing on the new placement of the Apple logo, as well as the device's aluminum frame. Various rumors talked about the iPhone 17 Pro's design revamp which would add a new island that would house the rear camera array, as well as the flash and its sensors.\nAlongside this, it was also rumored that Apple is going back to using aluminum components for its chassis as opposed to the iPhone 16 Pro series' titanium body.\niPhone 17 Pro Render Unveils New Apple Logo, Aluminum Frame\nLeaker and insider Majin Bu has shared a new image via X which shows off a render of the upcoming iPhone 17 Pro lineup featuring its latest design rumored to be coming this year.\nThe most notable change here is the new camera island that is set to replace the square camera array of the iPhone's Pro series. While it would still feature three lenses, it is now housed by a rectangular bar which takes up the entire upper third of the device.\nIt is important to note that the Apple logo also moves lower than its previous positioning which was located in the middle of the iPhone's backside. Instead, it will make way for the larger rectangular bar and be positioned at the center of the remaining space of the iPhone 17 Pro's rear.\nOn the other hand, the render also shows off the aluminum frame, which was rumored earlier this year, as Apple is set to switch back to this material after the iPhone 16 Pro lineup's titanium use.\nApple's Design Revamp for iPhone 17 Pro\nThese two elements of the iPhone are only some of the many expected changes coming to the iPhone 17 Pro lineup in this speculated design revamp. The image shows two identical devices that only differ in their size as the render showed off the changes to both variants of the lineup, the iPhone 17 Pro and the iPhone 17 Pro Max.\nMoreover, the design seemingly shows off a third-party case manufacturer's render of the accessory for the iPhone 17 Pro series, unveiling its new look in the process.\nApple iPhone 17 Pro Rumors\nEarlier this year, rumors started talking about the upcoming changes expected for the iPhone 17 Pro. Some have talked about a new layout for the rear, particularly as it will bring a new Camera Island that would have the entire camera array housed in a new bar, considered as its biggest redesign since 2019.\nMany users who got the iPhone 15 Pro and iPhone 16 Pro series were pleased with Apple's choice of titanium as the material of the device's chassis, but it seems like this was not a popular choice for the company. Rumors claimed that Apple will revert to an aluminum frame in the next release, dropping titanium and opting for the cheaper and lighter build that combines the previous metal and glass.\nAdditionally, all models of the iPhone 17 series are set to receive a 4GB memory boost as rumors claimed that they will feature 12GB RAM, alongside the revamped Dynamic Island and more.\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    },
    {
      "url": "https://www.techtimes.com/articles/311380/20250717/iphone-17-pro-leak-new-orange-color-could-mark-vibrant-comeback-apple.htm",
      "text": "The iPhone 17 Pro lineup could be Apple's most colorful launch ever.\nApple is apparently planning to release its flagship phones in a vibrant orange color, a shade that might give the classic colorful handsets of Nokia and Motorola a run for their money, as per recently leaked images and renders.\nWhereas Apple has historically played it safe with muted colors such as black, silver, and white, the firm seems set to break design barriers by introducing bright color options for its next-gen iPhones.\nShould it be true, the change might attract renewed interest from fashion-conscious customers seeking something different from the traditional color palette.\nTwo Leaks Suggest iPhone 17's Wider Color Palette\nAccording to Digital Trends, there are two significant leaks providing insight into Apple's future iPhone 17 series.\nThe first was from reputable tipster Sonny Dickson, who posted pictures of metal camera lens guards on X. The images reveal glimpses of the fresh colors, specifically a premium light blue and the speculated orange for the Pro versions.\niPhone 17 Pro and Pro Max will supposedly arrive in five colors, including Black, Silver, Gray, Orange, and Dark Blue (Pantone 19-4025 TPG Mood Indigo)\nBack in April, another iPhone 17 Pro leak suggested that Glass and Aluminum would return in exchange for Titanium.\niPhone 17 and iPhone 17 Air Also Get a Color Refresh\nOutside the Pro series, Apple will also introduce the iPhone 17 and a fresh ultra-slim iPhone 17 Air, the latter ready to go toe to toe with Samsung's Galaxy S25 Edge.\nBoth devices will feature a wider range of pastel and metal color options, including Light Blue (Pantone 658 U), Light Green (Pantone 2282 U), Gray (Pantone 18-4005 TPG), Purple (Pantone 530 U), and Black and White (repeating from the iPhone 16 series).\nMeanwhile, the iPhone 17 Air will also feature blue-grey, black, silver, and light gold, though with minimal render data available, total visions are speculative.\nA Trend That's Gaining Momentum\nColor innovation has long been restricted to budget-friendly smartphones, with high-end phones remaining conservative in colors for years. This is changing with brands like Motorola and Samsung.\nBright orange and mint colors grabbed attention in Motorola's Razr Ultra 2025, and Samsung's latest Galaxy Z Flip 7 series boasts coral red and mint. This is a much-needed boost to the foldable segment.\nFinally, the Cupertino titan acknowledges users' interest in being more expressive in their devices. It speaks volumes when the orange color leak came out.\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    },
    {
      "url": "https://www.techtimes.com/articles/311794/20250903/apples-llm-siri-coming-early-2026-says-analyst.htm",
      "text": "Apple is reportedly planning to bring \"LLM Siri\" in early 2026, with a well-known analyst claiming that this will be the version of the AI assistant that brings advanced knowledge and capabilities.\nHowever, this LLM Siri is not exactly the upgraded Siri that the world has been waiting for since the announcement at WWDC 2024 as this is only a web search tool.\nApple's LLM Siri Is Reportedly Coming by Early 2026\nMark Gurman shared a new report via Bloomberg which reveals a different version of Apple's AI assistant possibly coming early next year.\nThis new technology will be an integrated Siri feature that has the capabilities to share answers and information on general search queries, according to the analyst.\nIt has also been revealed that this will greatly mirror what OpenAI and Google have available for searches on their platforms via AI Overviews.\nThe feature would initially be part of the features offered by Siri, but the report claimed that Apple may integrate it into other iOS functions like the Spotlight search and its web browser, Safari.\nLLM Siri will be able to summarize search results in one write-up, offering users a brief and concise answer that captures various information from different sources. Its interface would support text, multimedia, and other local points of interest, as per MacRumors.\nRead Also: Apple's Siri AI Upgrade Is Coming This 2026, New Report Suggests its Releasing via iOS 26.4\nLLM Siri is the 'Answer Engine' says Apple Execs\nApple executives have been internally referring to this version of Siri as \"World Knowledge Answers,\" and some call it the \"answer engine\" as it is capable of giving significant information on different topics and more.\nIt was revealed by the analyst that LLM Siri would be part of next year's Siri updates that are already lined up, but no specific release dates have been provided.\nUpgraded Siri: When Is the AI Assistant Coming?\nWWDC 2024 shared a sneak peek to Siri's generative AI upgrades as part of the company's plans to transform the AI assistant into a more advanced technology.\nThe showcase also made it appear like it would launch alongside the iPhone 16 lineup coming that same year. However, Apple delayed Siri's AI upgrades, which greatly dismayed fans, and this led to some users filing a lawsuit against the company for false advertisements regarding the new AI features.\nMany users have awaited the upgraded Siri since 2024, and users are still counting the days until it finally becomes available. Other analysts and leakers claim that Apple will ship it come 2027 via iOS 28 (then iOS 20), but some forecast it to be released sometime next year.\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    }
  ],
  "argos_summary": "Apple is expected to raise prices on its iPhone 17 Pro series, with the Pro Max potentially costing up to $100 more than last year’s model, while the Pro could see a $200 bump. The company has avoided Trump‑era tariffs on its devices, but analysts predict that tariff‑related cost pressures will be passed on to consumers. The new lineup, featuring the A19 Pro chip and design updates, is slated for launch at a September 9 event.",
  "argos_id": "MW52K7BJA"
}