{
  "url": "https://www.pymnts.com/news/retail/2025/lululemon-embraces-ai-to-accelerate-design-and-go-to-market-processes/",
  "authorsByline": "PYMNTS",
  "articleId": "1474ce96558d4c6dae83106640fd7807",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/09/lululemon-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-05T01:46:58+00:00",
  "addDate": "2025-09-05T01:50:34.414185+00:00",
  "refreshDate": "2025-09-05T01:50:34.414187+00:00",
  "score": 1.0,
  "title": "Lululemon Embraces AI to Accelerate Design and Go-to-Market Processes",
  "description": "Lululemon Athletica aims to leverage artificial intelligence (AI) and technology to enhance its ability to develop new products and bring them to market.",
  "content": "Lululemon Athletica aims to leverage artificial intelligence (AI) and technology to enhance its ability to develop new products and bring them to market.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nWhile reporting that the athletic apparel, footwear and accessories company is “not happy with the current results in the U.S. business,” Lululemon CEO Calvin McDonald said Thursday (Sept. 4) during an earnings call that it is making changes to turn things around.\n\nMcDonald said these efforts will be aided by Lululemon’s first chief AI and technology officer, Raju Das. The company announced in an Aug. 26 press release that Das would begin that role Tuesday (Sept. 2), would report to McDonald and would join the senior leadership team.\n\n“This is a new role at Lululemon and represents and elevated mandate to enable AI and technology to help expedite our product innovation process, improve our agility and speed to market, and increase personalization across our guest experience,” McDonald said during the call.\n\nDuring the quarter ended Aug. 3, Lululemon saw its Americas comparable sales decrease 4% year over year while its international comparable sales increased 15%. Overall, the firm’s comparable sales increased 1% year over year, according to a Tuesday earnings release.\n\nMcDonald attributed the decline in the Americas business to the company letting its product life cycles run too long, becoming too predictable and missing opportunities to create new trends. He added this happened at a time when there has been an industrywide decline in the market for premium athletic wear in the U.S.\n\n“Consumers are spending less on apparel overall, spending less on performance activewear, and are being more selective in their purchases, seeking out truly new styles,” McDonald said during the call. “This makes it even more important that we meet and exceed the expectations of our guests.”\n\nIn addition, the company’s go-to-market process failed in some cases to meet customer demand for new styles introduced by the company, leaving some customers disappointed, McDonald said.\n\nMoving ahead, the company plans to increase the share of new styles among its overall assortment from the current 23% to 35% by next spring, McDonald said. It is also working to accelerate its design capabilities and its go-to-market process.\n\nReferring to the company’s new chief AI and technology officer, McDonald said: “I’m excited Ranju has joined us, and I look forward to partnering with him as he and our technology teams implement and accelerate these strategies.”",
  "medium": "Article",
  "links": [
    "https://www.linkedin.com/in/ranjudas?trk=public_post-text",
    "https://corporate.lululemon.com/media/press-releases/2025/09-04-2025-210520895",
    "https://corporate.lululemon.com/media/press-releases/2025/08-26-2025-113010087",
    "https://ca.linkedin.com/in/calvin-mcdonald-72207271"
  ],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Lululemon CEO Calvin McDonald",
      "weight": 0.08947955
    },
    {
      "name": "new products",
      "weight": 0.08521766
    },
    {
      "name": "new styles",
      "weight": 0.08493145
    },
    {
      "name": "Calvin McDonald",
      "weight": 0.07864858
    },
    {
      "name": "McDonald",
      "weight": 0.07701896
    },
    {
      "name": "new trends",
      "weight": 0.07379003
    },
    {
      "name": "Lululemon Athletica",
      "weight": 0.06924006
    },
    {
      "name": "technology",
      "weight": 0.067852706
    },
    {
      "name": "Lululemon",
      "weight": 0.06728503
    },
    {
      "name": "Market",
      "weight": 0.066769764
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.890625
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Marketing",
      "score": 0.53515625
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Other",
      "score": 0.393310546875
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.361328125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.3037109375
    }
  ],
  "sentiment": {
    "positive": 0.05188117,
    "negative": 0.8155304,
    "neutral": 0.13258837
  },
  "summary": "Lululemon Athletica is using artificial intelligence (AI) and technology to enhance its ability to develop new products and bring them to market. The company's CEO, Calvin McDonald, stated that the company is not satisfied with its current results in the U.S. business and is making changes to turn around. These efforts will be assisted by Lululemo’s first chief AI and technology officer, Raju Das, who will report to McDonald and join the senior leadership team. The move comes amidst an industrywide decline in the market for premium athletic wear in the US. The firm plans to increase the share of new styles among its overall assortment from 23% to 35% by spring and is working to accelerate its design capabilities and its go-to-market process.",
  "shortSummary": "Lululemon Athletica is leveraging AI and technology to accelerate its product development and go-to-market strategies, following a 4% sales decline in the Americas.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "83bb099a547c4a748471c561934f7e0d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://corporate.lululemon.com/media/press-releases/2025/08-26-2025-113010087",
      "text": "20+ Year Technology Executive Brings Deep Experience Across Enterprise Systems, Digital Innovation, and AI and Machine Learning\nVANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon (NASDAQ:LULU) today announced that it has appointed Ranju Das as Chief AI & Technology Officer, effective September 2, 2025. In this newly created role, Mr. Das will be responsible for leading the company’s technology organization and driving the development and execution of the next phase of lululemon’s technology and AI strategy. He will report to Chief Executive Officer, Calvin McDonald, and will join the company’s Senior Leadership Team.\n“We see an exciting opportunity to further leverage AI and technology to advance our product innovation process, improve our agility and speed to market, and bring more engagement and personalization to our guest experience,” said Mr. McDonald. “Ranju’s breadth of expertise and proven track record of leading large-scale technology and AI transformations make him the ideal individual to drive this work forward at lululemon and take our technology organization to the next level. We’re thrilled to welcome Ranju to the team.”\nMr. Das has over two decades of leadership experience scaling global organizations and driving AI-first innovation in healthcare, financial technology, and consumer technology. He previously held the role of CEO and founder of Swan AI Studios, where he led the development of cutting-edge AI platforms and applications across industries.\nBefore founding Swan AI Studios, Mr. Das served as CEO of OptumLabs, the R&D arm of UnitedHealth Group, where he led transformative AI and data-driven initiatives across healthcare and insurance verticals. Prior to OptumLabs, he spent nearly eight years at Amazon, ultimately serving as General Manager for Amazon AI Services, where he built and scaled some of the company’s key AI offerings. His career also includes 12 years of engineering and leadership roles at Barnes & Noble, as well as co-founding a number of startups. Mr. Das began his career as a software engineer and holds a Bachelor of Science in Civil and Structural Engineering from Annamalai University.\n“I’m excited to join lululemon at a pivotal time in the company’s technology transformation journey,” said Mr. Das. “The opportunity to leverage technology and AI across the retail value chain to elevate how we serve our guests has never been greater. I look forward to working with lululemon’s teams to advance the company’s data, technology, and AI strategies to drive ongoing growth, operational excellence, best-in-class product, and exceptional guest experiences.”\nlululemon also announced today that Chief Information Officer Julie Averill will depart the company in September as part of a planned leadership transition to pursue other opportunities.\nMr. McDonald added, “I would like to thank Julie for her leadership and the strong technology foundation she has helped build at lululemon over the past eight years. We wish her all the best in her future endeavors.”\nAbout lululemon\nlululemon (NASDAQ:LULU) is a technical athletic apparel, footwear, and accessories company for yoga, running, training, and most other activities, creating transformational products and experiences that build meaningful connections, unlocking greater possibility and wellbeing for all. Setting the bar in innovation of fabrics and functional designs, lululemon works with yogis and athletes in local communities around the world for continuous research and product feedback. For more information, visit lululemon.com.\nForward-looking statements:\nThis press release contains forward-looking statements, which reflect lululemon’s current expectations and plans. These statements are subject to various risks and uncertainties that could cause actual results to differ materially from those expressed or implied. Factors that could affect our future performance are included in our filings with the Securities and Exchange Commission, including our most recent reports on Forms 10-K, 10-Q, and 8-K. We undertake no obligation to update any forward-looking statements to reflect events or circumstances after the date of this release.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250826643394/en/\nInvestor Contacts:\nlululemon\nHoward Tubin\n1-604-732-6124\nor\nICR, Inc.\nJoseph Teklits\n1-203-682-8200\nMedia Contact:\nlululemon\nMadi Wallace\n1-604-732-6124\nSource: lululemon athletica inc."
    },
    {
      "url": "https://ca.linkedin.com/in/calvin-mcdonald-72207271",
      "text": "Calvin McDonald\nCEO at lululemon\nVancouver, British Columbia, Canada\n131K followers\n500+ connections\nAbout\nI am proud to be the CEO of lululemon, a technical athletic apparel, footwear, and accessories company. We create transformative products and experiences that build meaningful connections, unlocking greater possibility and wellbeing for all. I also serve on the Board of Directors of lululemon and The Walt Disney Company. I am a triathlete and enjoy time with my family (four kids), and with the people of lululemon.\nArticles by Calvin\nActivity\n-\nThis afternoon, we shared our Q2 FY25 results, and I would like to thank our lululemon teams around the world for their hard work and dedication to…\nThis afternoon, we shared our Q2 FY25 results, and I would like to thank our lululemon teams around the world for their hard work and dedication to…\nShared by Calvin McDonald\n-\nI’m pleased to share that Ranju Das is joining lululemon as our first Chief AI & Technology Officer. Welcome to the team, Ranju! I’d also like to…\nI’m pleased to share that Ranju Das is joining lululemon as our first Chief AI & Technology Officer. Welcome to the team, Ranju! I’d also like to…\nShared by Calvin McDonald\n-\nI like to consider myself a storyteller – a large component of my work is communications, and in the end, it's all storytelling. And, I realized…\nI like to consider myself a storyteller – a large component of my work is communications, and in the end, it's all storytelling. And, I realized…\nLiked by Calvin McDonald\nExperience\nEducation\nSkills\nMore activity by Calvin\n-\nExcited to share the lululemon SeaWheeze Half Marathon and Sunset Festival is returning to Vancouver next year. I’ve previously had the chance to…\nExcited to share the lululemon SeaWheeze Half Marathon and Sunset Festival is returning to Vancouver next year. I’ve previously had the chance to…\nShared by Calvin McDonald\n-\n🎾 Meet You Courtside. 🎾 lululemon has arrived at the US Open. This pop-up features incredible tennis product, for both on-court and off-court…\n🎾 Meet You Courtside. 🎾 lululemon has arrived at the US Open. This pop-up features incredible tennis product, for both on-court and off-court…\nLiked by Calvin McDonald\n-\nIn the midst of an international growth push, lululemon active brand has been getting its passport stamped all around the world. Already this year it…\nIn the midst of an international growth push, lululemon active brand has been getting its passport stamped all around the world. Already this year it…\nLiked by Calvin McDonald\n-\nToday, we are thrilled to announce that we will be opening our first lululemon store in Italy on Saturday in the heart of Milan’s iconic shopping…\nToday, we are thrilled to announce that we will be opening our first lululemon store in Italy on Saturday in the heart of Milan’s iconic shopping…\nShared by Calvin McDonald\n-\nRooted in experience, rising into what’s next... Last month, I was one of 150 team members impacted by a company-wide layoff at lululemon following…\nRooted in experience, rising into what’s next... Last month, I was one of 150 team members impacted by a company-wide layoff at lululemon following…\nLiked by Calvin McDonald\n-\nProud of our entire lululemon team for earning this recognition. Thank you for the passion, creativity, and impact you bring to our organization…\nProud of our entire lululemon team for earning this recognition. Thank you for the passion, creativity, and impact you bring to our organization…\nShared by Calvin McDonald\n-\nA strong week doesn’t start by hoping — it starts by preparing. Lately for me that’s looked like keeping things simple, focused, and grounded in…\nA strong week doesn’t start by hoping — it starts by preparing. Lately for me that’s looked like keeping things simple, focused, and grounded in…\nLiked by Calvin McDonald\n-\nIt was incredible to be a part of the lululemon event in London celebrating our “No Holding Back” campaign this week. The event included a candid and…\nIt was incredible to be a part of the lululemon event in London celebrating our “No Holding Back” campaign this week. The event included a candid and…\nShared by Calvin McDonald\n-\nHow lucky am I to lead this amazing team in this iconic destination? 🏔️ Summer 2025 is here, and with it comes our first summer peak season in…\nHow lucky am I to lead this amazing team in this iconic destination? 🏔️ Summer 2025 is here, and with it comes our first summer peak season in…\nLiked by Calvin McDonald\n-\n🏎️ Fits right, feels unstoppable. 🏎️ From coast to coast, catch Lewis Hamilton in the iconic lululemon Metal Vent Tech at select North American…\n🏎️ Fits right, feels unstoppable. 🏎️ From coast to coast, catch Lewis Hamilton in the iconic lululemon Metal Vent Tech at select North American…\nLiked by Calvin McDonald\n-\nThank you to our lululemon Educators and Associates across the globe for all the ways you show up and deliver for our guests and communities. Your…\nThank you to our lululemon Educators and Associates across the globe for all the ways you show up and deliver for our guests and communities. Your…\nShared by Calvin McDonald\n-\nToday, we shared our Q1 FY25 results, which illustrate the enduring strength of the lululemon brand globally. Thank you to our teams across the…\nToday, we shared our Q1 FY25 results, which illustrate the enduring strength of the lululemon brand globally. Thank you to our teams across the…\nShared by Calvin McDonald\n-\nLast week, we proudly opened our first store in Istanbul, marking our official entry into the Turkish market in collaboration with our franchise…\nLast week, we proudly opened our first store in Istanbul, marking our official entry into the Turkish market in collaboration with our franchise…\nLiked by Calvin McDonald\n-\nCounting down the days until May 21st! We cannot wait to share this beautiful space with everyone!\nCounting down the days until May 21st! We cannot wait to share this beautiful space with everyone!\nLiked by Calvin McDonald\n-\n💙 Live like summer won’t last forever. 💙 To wish lululemon’s iconic Align Pant a happy 10th birthday, North American stores received a big, blue…\n💙 Live like summer won’t last forever. 💙 To wish lululemon’s iconic Align Pant a happy 10th birthday, North American stores received a big, blue…\nLiked by Calvin McDonald\nOther similar profiles\nExplore collaborative articles\nWe’re unlocking community knowledge in a new way. Experts add insights directly into each article, started with the help of AI.\nExplore MoreOthers named Calvin McDonald in Canada\n-\nCalvin McDonald\n--\n-\nCal McDonald\nSales Leader | Cloud Security & Analytics | Driving Revenue & Scaling a High-Performance Team in Cannabis Tech\n-\nCalvin Mcdonald\nStudent at NAIT (Northern Alberta Institute of Technology)\n-\nCalvin McDonald\n7 others named Calvin McDonald in Canada are on LinkedIn\nSee others named Calvin McDonald"
    },
    {
      "url": "https://corporate.lululemon.com/media/press-releases/2025/09-04-2025-210520895",
      "text": "Revenue increased 7% to $2.5 billion, or increased 6% on a constant dollar basis\nComparable sales increased 1%\nDiluted EPS of $3.10\nVANCOUVER, British Columbia--(BUSINESS WIRE)--\nlululemon athletica inc. (NASDAQ:LULU) today announced financial results for the second quarter of fiscal 2025, which ended on August 3, 2025.\nCalvin McDonald, Chief Executive Officer, stated: \"While we continued to see positive momentum overall in our international regions in the second quarter, we are disappointed with our U.S. business results and aspects of our product execution. We have closely assessed the drivers of our underperformance and are continuing to take the necessary actions to strengthen our merchandise mix and accelerate our business. We feel confident in the opportunity ahead and plans we have in place to drive long-term growth.\"\nFor the second quarter of 2025, compared to the second quarter of 2024:\n-\nNet revenue increased 7% to $2.5 billion, or increased 6% on a constant dollar basis.\n- Americas net revenue increased 1%.\n-\nInternational net revenue increased 22%, or 20% on a constant dollar basis.\n-\nComparable sales increased 1%.\n- Americas comparable sales decreased 4%, or 3% on a constant dollar basis.\n-\nInternational comparable sales increased 15%, or 13% on a constant dollar basis.\n-\nGross profit increased 5% to $1.5 billion and gross margin decreased 110 basis points to 58.5%.\n-\nIncome from operations decreased 3% to $523.8 million and operating margin decreased 210 basis points to 20.7%.\n-\nThe effective income tax rate for the second quarter of 2025 was 30.5% compared to 29.6% for the second quarter of 2024.\n-\nDiluted earnings per share were $3.10 compared to $3.15 in the second quarter of 2024.\n-\nThe Company repurchased 1.1 million of its shares for a cost of $278.5 million.\n-\nThe Company added 14 net new company-operated stores during the second quarter, ending with 784 stores.\nMeghan Frank, Chief Financial Officer, stated: \"In the second quarter, we exceeded expectations on EPS, but revenue fell short of our guidance driven predominantly by our U.S. business. We are also navigating industry-wide challenges, including higher tariff rates. In light of these dynamics, we are revising our full year outlook. As we begin the back half of the year, our brand and balance sheet remain strong, and we will continue to exercise financial discipline and strategically invest in our growth potential.\"\nBalance Sheet Highlights\nThe Company ended the second quarter of 2025 with $1.2 billion in cash and cash equivalents and the capacity under its committed revolving credit facility was $393.2 million.\nInventories at the end of the second quarter of 2025 increased 21% to $1.7 billion compared to $1.4 billion at the end of the second quarter of 2024. On a unit basis, inventories increased 13%.\n2025 Outlook\nFor the third quarter of 2025, the Company expects net revenue to be in the range of $2.470 billion to $2.500 billion, representing growth of 3% to 4%. Diluted earnings per share are expected to be in the range of $2.18 to $2.23 for the quarter. This assumes a tax rate of approximately 30.5%.\nFor 2025, the Company now expects net revenue to be in the range of $10.850 billion to $11.000 billion, representing growth of 2% to 4%, or 4% to 6% excluding the 53rd week of 2024. Diluted earnings per share are now expected to be in the range of $12.77 to $12.97 for the year. This assumes a tax rate of approximately 30%.\nThe guidance for 2025 includes an estimated reduction in gross profit of approximately $240 million, net of currently anticipated mitigation efforts, including vendor savings, and pricing actions, reflecting our current assumptions about higher levels of tariffs on imports into the United States and the removal of the de minimis exemption. Actual results could differ materially from these estimates if tariff rates, sourcing savings, consumer demand, or the timing of regulatory changes vary from our current assumptions, or if our mitigation initiatives are less effective than currently expected.\nThe guidance does not reflect potential future repurchases of the Company's shares.\nThe guidance and outlook forward-looking statements made in this press release are based on management's expectations as of the date of this press release and do not incorporate future unknown impacts, including tariffs and macroeconomic trends. The Company undertakes no duty to update or to continue to provide information with respect to any forward-looking statements or risk factors, whether as a result of new information or future events or circumstances or otherwise. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of risks and uncertainties, including those stated below.\nConference Call Information\nA conference call to discuss second quarter results is scheduled for today, September 4, 2025, at 4:30 p.m. Eastern time. Those interested in participating in the call are invited to dial 1-833-752-3550 or 1-647-846-8290, if calling internationally, approximately 10 minutes prior to the start of the call. A live webcast of the conference call will be available online at: https://corporate.lululemon.com/investors/news-and-events/events-and-presentations. A replay will be made available online approximately two hours following the live call for a period of 30 days.\nAbout lululemon athletica inc.\nlululemon athletica inc. (NASDAQ:LULU) is a technical athletic apparel, footwear, and accessories company for yoga, running, training, and most other activities, creating transformational products and experiences that build meaningful connections, unlocking greater possibility and wellbeing for all. Setting the bar in innovation of fabrics and functional designs, lululemon works with yogis and athletes in local communities around the world for continuous research and product feedback. For more information, visit lululemon.com.\nShifted Calendar for Comparable Sales\nDue to the 53rd week in 2024, comparable sales are calculated on a one-week shifted basis such that the 13 weeks ended August 3, 2025 is compared to the 13 weeks ended August 4, 2024 rather than July 28, 2024.\nNon-GAAP Financial Measures\nWe report certain financial metrics on a constant dollar basis, which is a non-GAAP financial measure.\nA constant dollar basis assumes the average foreign currency exchange rates for the period remained constant with the average foreign currency exchange rates for the same period of the prior year. The Company provides constant dollar changes in its results to help investors understand the underlying growth rate of net revenue excluding the impact of changes in foreign currency exchange rates. Management uses constant currency metrics internally when reviewing and assessing financial performance.\nThe Company's fiscal year ends on the Sunday closest to January 31st of the following year, typically resulting in a 52-week year, but occasionally giving rise to an additional week, resulting in a 53-week year. Fiscal 2024 was a 53-week year while 2025 will be a 52-week year. The expected net revenue increase excluding the 53rd week excludes the net revenue for the 53rd week of 2024. This enables an evaluation of the expected year-over-year increase in net revenue based on 52 weeks in each year.\nThese non-GAAP financial measures are provided in addition to, and not a substitute for, the corresponding financial measures calculated in accordance with GAAP. For more information on these non-GAAP financial measures, please see the section captioned \"Reconciliation of Non-GAAP Financial Measures\" included in the accompanying financial tables, which includes more detail on the GAAP financial measure that is most directly comparable to each non-GAAP financial measure, and the related reconciliations between these financial measures. The Company's non-GAAP financial measures may be calculated differently from, and therefore may not be directly comparable to, similarly titled measures reported by other companies.\nForward-Looking Statements:\nThis press release includes estimates, projections, statements relating to the Company's business plans, objectives, and expected operating results that are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. In many cases, you can identify forward-looking statements by terms such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"outlook,\" \"believes,\" \"intends,\" \"estimates,\" \"predicts,\" \"potential\" or the negative of these terms or other comparable terminology. These forward-looking statements also include the Company's guidance and outlook statements. These statements are based on management's current expectations but they involve a number of risks and uncertainties. Actual results and the timing of events could differ materially from those anticipated in the forward-looking statements as a result of risks and uncertainties, which include, without limitation: the Company's ability to maintain the value and reputation of its brand; its highly competitive market and increasing competition; its ability to anticipate consumer preferences and successfully develop and introduce new, innovative and differentiated products; the acceptability of its products to guests; increasing costs and decreasing selling prices; its ability to accurately forecast guest demand for its products; its ability to expand in light of its limited operating experience and limited brand recognition in new international markets and new product categories; its ability to manage its growth and the increased complexity of its business effectively; changes in consumer shopping preferences and shifts in distribution channels; its leasing of retail and distribution space; its ability to attract, manage, and retain highly qualified individuals; seasonality; its ability to safeguard against security breaches with respect to its technology systems; its compliance with privacy and data protection laws; any material disruption of its information systems; its ability to have technology-based systems function effectively and grow its e-commerce business globally; changes to U.S. tariff and customs policy, including the elimination of the de minimis exemption; macroeconomic volatility, inflationary pressures, and shifts in consumer sentiment; global political and economic instability and related trade actions; changes to tariffs, customs rules, and other trade restrictions; changes in tax laws or unanticipated tax liabilities; its ability to comply with trade and other regulations; fluctuations in foreign currency exchange rates; global or regional health events such as the COVID-19 pandemic and related government, private sector, and individual consumer responsive actions; disruptions of its supply chain; its reliance on a relatively small number of vendors to supply and manufacture a significant portion of its products; suppliers or manufacturers not complying with its Vendor Code of Ethics or applicable laws; fluctuating costs of raw materials; its ability to deliver its products to the market and to meet guest expectations if it has problems with its distribution system; increasing labor costs and other factors associated with the production of its products in South Asia and South East Asia; imitation by its competitors; its ability to protect its intellectual property rights; conflicting trademarks and patents and the prevention of sale of certain products; climate change and related pressures; heightened scrutiny and legal risks from competing pressures regarding ESG; its exposure to various types of litigation; and other risks and uncertainties set out in filings made from time to time with the United States Securities and Exchange Commission and available at www.sec.gov, including, without limitation, its most recent reports on Form 10-K and Form 10-Q. You are urged to consider these factors carefully in evaluating the forward-looking statements contained herein and are cautioned not to place undue reliance on such forward-looking statements, which are qualified in their entirety by these cautionary statements. The forward-looking statements made herein speak only as of the date of this press release and the Company undertakes no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances, except as may be required by law.\nlululemon athletica inc.\n|\n| |\nThe fiscal year ending February 1, 2026 is referred to as \"2025\" and the fiscal year ended February 2, 2025 is referred to as \"2024\".\n|\n| | | | |\nCondensed Consolidated Statements of Operations |\nUnaudited; Expressed in thousands, except per share amounts |\n| | | | |\n|\n| Second Quarter |\n| First Two Quarters |\n|\n|\n| 2025 |\n|\n|\n| 2024 |\n|\n|\n| 2025 |\n|\n|\n| 2024 |\n|\nNet revenue\n|\n|\n$\n|\n2,525,219\n|\n|\n|\n$\n|\n2,371,078\n|\n|\n|\n$\n|\n4,895,879\n|\n|\n|\n$\n|\n4,579,969\n|\n|\nCosts of goods sold\n|\n|\n|\n1,048,017\n|\n|\n|\n|\n958,893\n|\n|\n|\n|\n2,035,551\n|\n|\n|\n|\n1,892,716\n|\n|\nGross profit\n|\n|\n|\n1,477,202\n|\n|\n|\n|\n1,412,185\n|\n|\n|\n|\n2,860,328\n|\n|\n|\n|\n2,687,253\n|\n|\nAs a percentage of net revenue |\n|\n| 58.5 | % |\n|\n| 59.6 | % |\n|\n| 58.4 | % |\n|\n| 58.7 | % |\nSelling, general and administrative expenses\n|\n|\n|\n951,658\n|\n|\n|\n|\n871,959\n|\n|\n|\n|\n1,894,529\n|\n|\n|\n|\n1,714,385\n|\n|\nAs a percentage of net revenue |\n|\n| 37.7 | % |\n|\n| 36.8 | % |\n|\n| 38.7 | % |\n|\n| 37.4 | % |\nAmortization of intangible assets\n|\n|\n|\n1,730\n|\n|\n|\n|\n—\n|\n|\n|\n|\n3,360\n|\n|\n|\n|\n—\n|\n|\nIncome from operations\n|\n|\n|\n523,814\n|\n|\n|\n|\n540,226\n|\n|\n|\n|\n962,439\n|\n|\n|\n|\n972,868\n|\n|\nAs a percentage of net revenue |\n|\n| 20.7 | % |\n|\n| 22.8 | % |\n|\n| 19.7 | % |\n|\n| 21.2 | % |\nOther income (expense), net\n|\n|\n|\n9,737\n|\n|\n|\n|\n17,994\n|\n|\n|\n|\n21,523\n|\n|\n|\n|\n41,277\n|\n|\nIncome before income tax expense\n|\n|\n|\n533,551\n|\n|\n|\n|\n558,220\n|\n|\n|\n|\n983,962\n|\n|\n|\n|\n1,014,145\n|\n|\nIncome tax expense\n|\n|\n|\n162,646\n|\n|\n|\n|\n165,298\n|\n|\n|\n|\n298,485\n|\n|\n|\n|\n299,802\n|\n|\nNet income\n|\n|\n$\n|\n370,905\n|\n|\n|\n$\n|\n392,922\n|\n|\n|\n$\n|\n685,477\n|\n|\n|\n$\n|\n714,343\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\nBasic earnings per share\n|\n|\n$\n|\n3.10\n|\n|\n|\n$\n|\n3.15\n|\n|\n|\n$\n|\n5.71\n|\n|\n|\n$\n|\n5.70\n|\n|\nDiluted earnings per share\n|\n|\n$\n|\n3.10\n|\n|\n|\n$\n|\n3.15\n|\n|\n|\n$\n|\n5.70\n|\n|\n|\n$\n|\n5.69\n|\n|\nBasic weighted-average shares outstanding\n|\n|\n|\n119,600\n|\n|\n|\n|\n124,721\n|\n|\n|\n|\n120,116\n|\n|\n|\n|\n125,358\n|\n|\nDiluted weighted-average shares outstanding\n|\n|\n|\n119,680\n|\n|\n|\n|\n124,857\n|\n|\n|\n|\n120,262\n|\n|\n|\n|\n125,600\n|\n|\nlululemon athletica inc.\n|\n| |\nCondensed Consolidated Balance Sheets |\nUnaudited; Expressed in thousands |\n| | | | | | |\n|\n| August 3,\n2025 |\n| February 2,\n2025 |\n| July 28,\n2024 |\nASSETS |\n|\n|\n|\n|\n|\n|\nCurrent assets\n|\n|\n|\n|\n|\n|\n|\nCash and cash equivalents\n|\n|\n$\n|\n1,155,794\n|\n|\n$\n|\n1,984,336\n|\n|\n$\n|\n1,610,112\n|\nInventories\n|\n|\n|\n1,722,570\n|\n|\n|\n1,442,081\n|\n|\n|\n1,429,043\n|\nPrepaid and receivable income taxes\n|\n|\n|\n323,227\n|\n|\n|\n182,253\n|\n|\n|\n210,969\n|\nOther current assets\n|\n|\n|\n327,137\n|\n|\n|\n371,632\n|\n|\n|\n321,620\n|\nTotal current assets\n|\n|\n|\n3,528,728\n|\n|\n|\n3,980,302\n|\n|\n|\n3,571,744\n|\nProperty and equipment, net\n|\n|\n|\n1,917,361\n|\n|\n|\n1,780,617\n|\n|\n|\n1,614,893\n|\nRight-of-use lease assets\n|\n|\n|\n1,605,009\n|\n|\n|\n1,416,256\n|\n|\n|\n1,302,947\n|\nGoodwill and intangible assets, net\n|\n|\n|\n182,215\n|\n|\n|\n171,191\n|\n|\n|\n23,925\n|\nDeferred income taxes and other non-current assets\n|\n|\n|\n290,126\n|\n|\n|\n254,926\n|\n|\n|\n230,626\n|\nTotal assets\n|\n|\n$\n|\n7,523,439\n|\n|\n$\n|\n7,603,292\n|\n|\n$\n|\n6,744,135\n|\nLIABILITIES AND STOCKHOLDERS' EQUITY |\n|\n|\n|\n|\n|\n|\nCurrent liabilities\n|\n|\n|\n|\n|\n|\n|\nAccounts payable\n|\n|\n$\n|\n373,333\n|\n|\n$\n|\n271,406\n|\n|\n$\n|\n317,348\n|\nAccrued liabilities and other\n|\n|\n|\n423,933\n|\n|\n|\n559,463\n|\n|\n|\n396,423\n|\nAccrued compensation and related expenses\n|\n|\n|\n148,895\n|\n|\n|\n204,543\n|\n|\n|\n174,702\n|\nCurrent lease liabilities\n|\n|\n|\n297,919\n|\n|\n|\n275,154\n|\n|\n|\n278,067\n|\nCurrent income taxes payable\n|\n|\n|\n26,746\n|\n|\n|\n183,126\n|\n|\n|\n19,231\n|\nUnredeemed gift card liability\n|\n|\n|\n252,334\n|\n|\n|\n308,352\n|\n|\n|\n250,754\n|\nOther current liabilities\n|\n|\n|\n34,186\n|\n|\n|\n37,586\n|\n|\n|\n32,126\n|\nTotal current liabilities\n|\n|\n|\n1,557,346\n|\n|\n|\n1,839,630\n|\n|\n|\n1,468,651\n|\nNon-current lease liabilities\n|\n|\n|\n1,464,799\n|\n|\n|\n1,300,637\n|\n|\n|\n1,180,823\n|\nDeferred income tax liability\n|\n|\n|\n62,400\n|\n|\n|\n98,188\n|\n|\n|\n28,876\n|\nOther non-current liabilities\n|\n|\n|\n51,615\n|\n|\n|\n40,790\n|\n|\n|\n34,140\n|\nStockholders' equity\n|\n|\n|\n4,387,279\n|\n|\n|\n4,324,047\n|\n|\n|\n4,031,645\n|\nTotal liabilities and stockholders' equity\n|\n|\n$\n|\n7,523,439\n|\n|\n$\n|\n7,603,292\n|\n|\n$\n|\n6,744,135\n|\nlululemon athletica inc.\n|\n| |\nCondensed Consolidated Statements of Cash Flows |\nUnaudited; Expressed in thousands |\n| | |\n|\n| First Two Quarters |\n|\n|\n| 2025 |\n|\n|\n| 2024 |\n|\nCash flows from operating activities\n|\n|\n|\n|\n|\nNet income\n|\n|\n$\n|\n685,477\n|\n|\n|\n$\n|\n714,343\n|\n|\nAdjustments to reconcile net income to net cash provided by operating activities\n|\n|\n|\n(475,755\n|\n)\n|\n|\n|\n(143,679\n|\n)\n|\nNet cash provided by operating activities\n|\n|\n|\n209,722\n|\n|\n|\n|\n570,664\n|\n|\nNet cash used in investing activities\n|\n|\n|\n(319,960\n|\n)\n|\n|\n|\n(266,625\n|\n)\n|\nNet cash used in financing activities\n|\n|\n|\n(744,823\n|\n)\n|\n|\n|\n(916,543\n|\n)\n|\nEffect of foreign currency exchange rate changes on cash and cash equivalents\n|\n|\n|\n26,519\n|\n|\n|\n|\n(21,355\n|\n)\n|\nDecrease in cash and cash equivalents\n|\n|\n|\n(828,542\n|\n)\n|\n|\n|\n(633,859\n|\n)\n|\nCash and cash equivalents, beginning of period\n|\n|\n|\n1,984,336\n|\n|\n|\n|\n2,243,971\n|\n|\nCash and cash equivalents, end of period\n|\n|\n$\n|\n1,155,794\n|\n|\n|\n$\n|\n1,610,112\n|\n|\nlululemon athletica inc.\n|\n| |\nReconciliation of Non-GAAP Financial Measures\n|\nUnaudited\n|\n| |\nConstant dollar changes |\n| |\nThe below changes show the change compared to the corresponding period in the prior year. Due to the 53rd week in 2024, the below changes in comparable sales are calculated on a one-week shifted basis such that the 13 weeks ended August 3, 2025 is compared to the 13 weeks ended August 4, 2024 rather than July 28, 2024.\n|\n| | |\n|\n| Second Quarter 2025 |\nNet Revenue |\n| Change |\n| Foreign exchange |\n| Change in constant dollars |\nUnited States |\n|\n—\n|\n%\n|\n|\n—\n|\n%\n|\n|\n—\n|\n%\n|\nCanada |\n|\n1\n|\n|\n|\n—\n|\n|\n|\n1\n|\n|\nMexico(1) |\n|\nn/a\n|\n|\n|\nn/a\n|\n|\n|\nn/a\n|\n|\nAmericas |\n|\n1\n|\n|\n|\n—\n|\n|\n|\n1\n|\n|\n|\n|\n|\n|\n|\n|\n|\nChina Mainland |\n|\n25\n|\n|\n|\n(1\n|\n)\n|\n|\n24\n|\n|\nRest of World\n|\n|\n19\n|\n|\n|\n(4\n|\n)\n|\n|\n15\n|\n|\nTotal international\n|\n|\n22\n|\n|\n|\n(2\n|\n)\n|\n|\n20\n|\n|\n|\n|\n|\n|\n|\n|\n|\nTotal\n|\n|\n7\n|\n%\n|\n|\n(1\n|\n)%\n|\n|\n6\n|\n%\n|\n|\n| Second Quarter 2025 |\nComparable Sales(2) |\n| Change |\n| Foreign exchange |\n| Change in constant dollars |\nAmericas |\n|\n(4\n|\n)%\n|\n|\n1\n|\n%\n|\n|\n(3\n|\n)%\n|\n|\n|\n|\n|\n|\n|\n|\nChina Mainland |\n|\n17\n|\n|\n|\n(1\n|\n)\n|\n|\n16\n|\n|\nRest of World\n|\n|\n12\n|\n|\n|\n(3\n|\n)\n|\n|\n9\n|\n|\nTotal international\n|\n|\n15\n|\n|\n|\n(2\n|\n)\n|\n|\n13\n|\n|\n|\n|\n|\n|\n|\n|\n|\nTotal\n|\n|\n1\n|\n%\n|\n|\n—\n|\n%\n|\n|\n1\n|\n%\n|\n__________\n|\n(1) |\nOn September 10, 2024, the Company acquired the lululemon branded retail locations and operations run by a third party in Mexico. Wholesale sales to the third party by lululemon athletica canada inc. prior to the acquisition are disclosed as net revenue recognized within Canada.\n|\n(2) |\nComparable sales includes comparable company-operated store and e-commerce net revenue. Comparable company-operated stores have been open for at least 12 full fiscal months, or open for at least 12 full fiscal months after being significantly expanded. Comparable company-operated stores exclude stores which have been temporarily relocated for renovations or have been temporarily closed. Company-operated stores acquired as a result of the acquisition of the Mexico operations will be considered comparable beginning October 2025, after 12 full fiscal months of sales from the date of acquisition.\n|\nExpected net revenue increase excluding the 53rd week\n|\n| |\nThe Company's fiscal year ends on the Sunday closest to January 31st of the following year, typically resulting in a 52-week year, but occasionally giving rise to an additional week, resulting in a 53-week year. Fiscal 2024 was a 53-week year while 2025 will be a 52-week year.\n|\n| | |\n|\n| Fiscal 2025 |\nExpected net revenue increase\n|\n|\n2% to 4%\n|\nImpact of 53rd week\n|\n|\n2%\n|\nExpected net revenue increase excluding the 53rd week (non-GAAP)\n|\n|\n4% to 6%\n|\nlululemon athletica inc. |\n| |\nCompany-operated Store Count and Square Footage(1) |\nSquare footage expressed in thousands\n|\n| | | | | | | | |\n|\n| Number of Stores Open at the Beginning of the Quarter |\n| Number of Stores Opened During the Quarter |\n| Number of Stores Closed During the Quarter |\n| Number of Stores Open at the End of the Quarter |\n3rd Quarter 2024\n|\n|\n721\n|\n|\n28\n|\n|\n—\n|\n|\n749\n|\n4th Quarter 2024\n|\n|\n749\n|\n|\n21\n|\n|\n3\n|\n|\n767\n|\n1st Quarter 2025\n|\n|\n767\n|\n|\n5\n|\n|\n2\n|\n|\n770\n|\n2nd Quarter 2025\n|\n|\n770\n|\n|\n15\n|\n|\n1\n|\n|\n784\n|\n|\n| Total Gross Square Feet at the Beginning of the Quarter |\n| Gross Square Feet Added During the Quarter(2) |\n| Gross Square Feet Lost During the Quarter(2) |\n| Total Gross Square Feet at the End of the Quarter |\n3rd Quarter 2024\n|\n|\n3,075\n|\n|\n156\n|\n|\n—\n|\n|\n3,231\n|\n4th Quarter 2024\n|\n|\n3,231\n|\n|\n153\n|\n|\n12\n|\n|\n3,372\n|\n1st Quarter 2025\n|\n|\n3,372\n|\n|\n50\n|\n|\n7\n|\n|\n3,415\n|\n2nd Quarter 2025\n|\n|\n3,415\n|\n|\n99\n|\n|\n3\n|\n|\n3,511\n|\n__________\n|\n(1) |\nCompany-operated store count and square footage summary excludes retail locations operated by third parties under license and supply arrangements.\n|\n(2) |\nGross square feet added/lost during the quarter includes net square foot additions for company-operated stores which have been renovated or relocated in the quarter.\n|\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250904449107/en/\nInvestor Contacts:\nlululemon athletica inc.\nHoward Tubin\n1-604-732-6124\nor\nICR, Inc.\nJoseph Teklits\n1-203-682-8200\nMedia Contact:\nlululemon athletica inc.\nMadi Wallace\n1-604-732-6124\nSource: lululemon athletica inc."
    },
    {
      "url": "https://www.linkedin.com/in/ranjudas?trk=public_post-text",
      "text": "“Ranju is a team player that always gets the job done. He is an outstanding manager that has developed a team that delivers world class results. He is tireless and does what it takes to deliver four nines reliability for his area. Ranju's maturity and business acumen is that of a seasoned professonal.”\nAbout\nActivity\n-\nTwo Years of Building, Breaking, Learning — and Building Again. The last two years have been intense, humbling, and deeply rewarding. I’ve made bold…\nTwo Years of Building, Breaking, Learning — and Building Again. The last two years have been intense, humbling, and deeply rewarding. I’ve made bold…\nPosted by Ranju Das\n-\nAn amazingly mission driven thoughtful group of healthcare leaders with a clear objective to bring true innovation in global healthcare.\nAn amazingly mission driven thoughtful group of healthcare leaders with a clear objective to bring true innovation in global healthcare.\nShared by Ranju Das\n-\nJust back from an invigorating experience at the Global Family Office Investment Summit in Dubai, held collaboratively with Lives Amplified — a truly…\nJust back from an invigorating experience at the Global Family Office Investment Summit in Dubai, held collaboratively with Lives Amplified — a truly…\nShared by Ranju Das\nExperience & Education\nRecommendations received\n2 people have recommended Ranju\nJoin now to viewMore activity by Ranju\n-\nLooking forward to attending Lives Amplified Partner Event – Dubai Global Family Office Summit. https://lnkd.in/eeXGGtcJ\nLooking forward to attending Lives Amplified Partner Event – Dubai Global Family Office Summit. https://lnkd.in/eeXGGtcJ\nShared by Ranju Das\n-\nExcited about moderating the panel on \"Responsible AI at Scale – where Govt, Capital, and Innovation meet\" hosted by the Lives Amplified AI Council…\nExcited about moderating the panel on \"Responsible AI at Scale – where Govt, Capital, and Innovation meet\" hosted by the Lives Amplified AI Council…\nPosted by Ranju Das\n-\nhttps://lnkd.in/ez2vHbMx Excited to be part of Lives Amplified's AI Council, contributing to global impact across diplomacy, education, climate…\nhttps://lnkd.in/ez2vHbMx Excited to be part of Lives Amplified's AI Council, contributing to global impact across diplomacy, education, climate…\nPosted by Ranju Das\n-\nMatt Wood has a very unique way of looking at technology and articulate it in ways that most can understand and identify with. This one really…\nMatt Wood has a very unique way of looking at technology and articulate it in ways that most can understand and identify with. This one really…\nShared by Ranju Das\n-\nSuper excited about the state of art AI work done by Shailu Verma ,Vasant Manohar, and team from Mila Health! Our customizable, personalized AI…\nSuper excited about the state of art AI work done by Shailu Verma ,Vasant Manohar, and team from Mila Health! Our customizable, personalized AI…\nShared by Ranju Das\n-\nWhy 99% of Pitch Decks Fail Only 1% of startups secure venture capital. The difference? Details that most founders overlook. Here’s what top…\nWhy 99% of Pitch Decks Fail Only 1% of startups secure venture capital. The difference? Details that most founders overlook. Here’s what top…\nLiked by Ranju Das\n-\nAnyone attending Vive 2025, please go and meet Shailu to experience Mila - the amazingly powerful AI - healthcare worker that’s helping providers…\nAnyone attending Vive 2025, please go and meet Shailu to experience Mila - the amazingly powerful AI - healthcare worker that’s helping providers…\nShared by Ranju Das\n-\nIt was great to speak with John Moore to share insights from our recent Digital Core research and what we see as key trends in our Gen AI client…\nIt was great to speak with John Moore to share insights from our recent Digital Core research and what we see as key trends in our Gen AI client…\nLiked by Ranju Das\n-\nPatience... Persistence... Perseverance ... You Did It….... Congratulation Team Skygear ! Let’s celebrate our win on Independence Day - 2024. Jai…\nPatience... Persistence... Perseverance ... You Did It….... Congratulation Team Skygear ! Let’s celebrate our win on Independence Day - 2024. Jai…\nLiked by Ranju Das\n-\nIt was an amazing couple of days HealthNext Summit. It was humbling to meet such an amazing group of panelists, speakers, moderators, and attendees.\nIt was an amazing couple of days HealthNext Summit. It was humbling to meet such an amazing group of panelists, speakers, moderators, and attendees.\nShared by Ranju Das\nOther similar profiles\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top contentOthers named Ranju Das\n-\nRanju Das\nHR Professional Specializing in Talent Acquisition | Driving Organizational Growth through Strategic HR Initiatives | Committed to Diversity & Inclusion\n-\nRanju Das\nSTORE OPERATIONS MANAGER AT FIRSTCRY. COM\n-\nRanju Das\n--\n-\nRanju Das\nSenior Sales Executive at \"Cavincare || Raaga Professional || Professional Product Devision\"\n106 others named Ranju Das are on LinkedIn\nSee others named Ranju Das"
    }
  ],
  "argos_summary": "Lululemon is appointing a chief AI and technology officer to speed product innovation and improve market responsiveness. The company plans to raise the share of new styles from 23% to 35% by next spring, addressing weak U.S. sales and industry‑wide demand shifts. AI‑driven design and supply‑chain automation aim to shorten cycles and enhance personalization for customers.",
  "argos_id": "QY8SXMH88"
}