{
  "url": "https://www.bloomberg.com/news/videos/2025-09-05/horizons-middle-east-africa-9-5-video?srnd=phx-markets",
  "authorsByline": "bn",
  "articleId": "cb471b3513704405a0caa19894823eea",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/in73kpy0t__8/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-05T07:46:17.853000+00:00",
  "addDate": "2025-09-05T08:13:52.803113+00:00",
  "refreshDate": "2025-09-05T08:13:52.803117+00:00",
  "score": 1.0,
  "title": "US Jobs Report; DeepSeek To Prep New Model",
  "description": "Bond and currency traders await the US jobs report, with investors almost fully pricing in a Fed rate cut this month. Also on the show: China's DeepSeek is working on an AI model with more advanced features to compete with US rivals; oil is heading for a weekly decline ahead of an OPEC+ meeting; MTN Group is eyeing its smaller rival, Telkom. Guests include: Gareth Nicholson, Nomura International Wealth Management, Chief Investment Officer and Head of Managed Investments; Livia Gallarati, Energy Aspects, Global Crude Lead; Max Layton, Citi, Global Head of Commodities Research.\n\nHorizons Middle East & Africa is your daily spotlight on one of the world's fastest-growing regions. Live from Dubai, we bring you the latest global markets and analysis, plus news-making interviews, with a special focus on MEA. All that and more, as you head to the office in the Gulf, pause for lunch in Hong Kong, or start your day in London or Johannesburg.  (Source: Bloomberg)",
  "content": "JOUMANNA: GOOD MORNING. THIS IS \"HORIZONS: MIDDLE EAST AND AFRICA.\" FUN AND CURRENCY TRADERS AWAIT TODAY'S U.S. JOBS REPORT WITH INVESTORS ALMOST FULLY PRICING AND A FED RATE CUT THIS MONTH. CHINA'S DEEPSEEK IS WORKING ON THE A MODEL WITH MORE ADVANCED FEATURES TO COMPETE WITH U.S. RIVALS, INCLUDING OPENAI. AND OIL ON EDGE AS TRADERS AWAIT UN-OPEC-PLUS MEETING THAT COULD SEE THE GROUP SIGN OFF ON ANOTHER SUPPLY HIKE. IT HAS JUST GONE 8:00 A.M. ACROSS THE EMIRATES. TRADERS AROUND THE WORLD ARE BRACING FOR TODAY'S JOB FIGURES. IT LOOKS LIKE WE HAVE BEEN LEADING UP TO THIS ALL WEEK. FIXED INCOME RALLY COMING BACK YESTERDAY. 10 YEAR TREASURIES BACK NOW. THIS IS THE TWO-YEAR, BUT 10 YEAR TREASURIES ARE BACK TO 4.2%. AT ONE POINT, WE WERE TALKING ABOUT A MAJOR SELLOFF EARLIER IN THE WEEK. TODAY'S FIGURES WILL BE KEY IN TERMS OF WHERE WE GO FROM HERE. SEPTEMBER IS PRETTY MUCH BAKED IN. IF WE GET A MUCH WEAKER NUMBER, THEN MARKETS MAY BE QUICK TO PRICE IN A MUCH FASTER AND MORE AGGRESSIVE RATE CUTTING CYCLE. EQUITY FUTURES LEADING TOWARDS THE GREEN. ANOTHER HIGH FOR THE S & P. TWO YEAR YIELDS, 3.58. WE HAVE ONE RATE CUT PRICED IN FOR SEPTEMBER, BUT FIVE CUMULATIVE BY THE END OF 2026. USD IS DOWN. DOWN ABOUT 0.7% FOR THE MONTH. DOWN ALMOST 10% FOR THE YEAR, 9.5% FOR THE GREENBACK. WE CONTINUE TO TALK ABOUT WEAKNESS IN THE USD. ALL EYES ON THIS GROUP OF OPEC-PLUS. A VIRTUAL MEETING THIS WEEKEND. THERE IS TALK POTENTIALLY ABOUT THIS OTHER CLIP OF 1.6 6 MILLION BARRELS A DAY TAKEN OFF THE MARKET. MAYBE THEY WILL START TALK ABOUT IT, BUT FUNDAMENTALS DICTATE WHERE WE GO FROM HERE. MANY ARE EXPECTING TO SEE A SUPPLY GLUT ON THE OIL SIDE IN THE COMING MONTHS. KEEP AN EYE ON THE OPEC-PLUS DECISION THIS WEEKEND. LET'S ALSO CHECK IN ON HOW MARKETS IN ASIA ARE FARING. ANNABELLE DROULERS IS IN HONG KONG. ANNABELLE: THANKS. I REALLY THINK ASIAN MARKETS ARE REFLECTING ALL THOSE THINGS YOU WERE TALKING ABOUT. IT IS ALL ABOUT THE FED. THE U.S. JOBS REPORT COMING UP LATER TODAY. TALKING THROUGH SOME OF THE DYNAMICS, SOVEREIGN BONDS, YOU ARE SEEING THAT GENERAL PULLBACK IN YIELDS. IT ECHOES WHAT WE HAVE FOR THE TWO-YEAR TREASURY THAT RETREATED OVERNIGHT DOWN TO ITS LOWEST LEVEL IN AROUND A YEAR. YOU SEE DOLLAR WEAKNESS PLAYING OUT BECAUSE YOU ARE SEEING A LOT OF ASIAN STRENGTH IN THE CURRENCIES TODAY. ALSO WHAT WE ARE SEEING IN STOCKS BECAUSE TAIWAN DOLLAR IS UP, MORE INFLOWS COMING INTO TAIWANESE EQUITIES. BUT BENCHMARK HAS BEEN A GAINER FOR THE SESSION. FUTURES UP 1.1%. JAPAN ALSO ONE OF THE STANDOUTS. WE HAD PRESIDENT TRUMP SIGNING AN EXECUTIVE ORDER TO BRING THAT TRAY DEAL INTO EFFECT, AND WATCHING CHINA VERY CLOSELY TODAY, GIVEN YOU HAVE THAT DAY TWO REACTION TO THE BLOOMBERG SCOOP YESTERDAY, QUESTIONS RUN REGULATORS LOOKING TO STEP INTO TRY TO COOL DOWN THAT RALLY. WE HAVE NOT HAD ANY CONCRETE STEPS. MAYBE THERE HAS BEEN A SELF CORRECTION IN THE MARKET. THE FIRST SESSION REVERSING THE EARLIER LOSSES FROM YESTERDAY. AS WE AWAIT THE JOBS FIGURES, HOW MUCH VOLUME WE ARE SEEING. IF YOU PULL UP THE ATV FUNCTION, WE ARE OFF THE 20 DAY MOVING AVERAGE. MAYBE THERE IS A LITTLE BIT OF CAUTION IN THE MARKET. INVESTORS REALLY WANT TO SEE THESE JOBS FIGURES TELL US IN ORDER TO KNOW WHAT THE FED IS GOING TO BE DOING NEXT. JOUMANNA: IT IS ALMOST ONE OF THOSE CASES WHERE AS STOCK MARKETS CONTINUE TO MAKE RECORD HIGHS, LIQUIDITY VOLUMES ARE DRYING UP. THERE IS LESS PARTICIPATION IN THOSE MOVES. WE WILL TALK ABOUT THAT AND MORE. ANNABELLE DROULERS, THANK YOU SO MUCH. BONDS AND CURRENCY TRADERS ARE BRACING FOR THE CRUCIAL JOBS REPORT. IT IS EXPECTED TO SHAPE MARKET EXPECTATIONS FOR FED POLICY. JOINING US AS THE CHIEF INVESTMENT OFFICER AND HEAD OF MANAGEMENT INVESTMENTS. GREAT TO HAVE YOU WITH US. LET'S TALK ABOUT TODAY'S PRINT. I FEEL LIKE THE MARKET WHISPER IS PROBABLY THE LOW NUMBER. GIVEN LAST MONTH'S SHOCK, WE ARE PROBABLY ALL BIASED TOWARD SEEING A WEAKER NUMBER TODAY. WHAT DO YOU THINK THE MARKET REACTION WOULD BE IF WE GET A SLIGHTLY LOWER PRINT? > > I THINK YOU ARE RIGHT. NORMALLY WHAT WE ARE LOOKING FOR IS THE CHANGE. IS IT AN INCREASE OR DECREASE? RIGHT NOW IT IS WHAT THE ELF SALUTE NUMBER IS. IF WE RELEASE 100,000, THAT IS THE FOURTH PRINT. I THINK IT WOULD GUARANTEE A RATE CUT. 75, THAT STARTS TO MOVE TOO, IS THIS AN INSURANCE CUT OR GROWTH SCARE AND THE FED IS BEHIND? JOUMANNA: A TWO WEEK NUMBER WOULD CONSTITUTE A GROWTH SCARE. IT WOULD CONSTITUTE A CHANGE IN NARRATIVE. > > EQUITIES WILL START THINKING, MAY BE OPPRESSIVE EARNINGS ARE NOT PRICING IN THIS GROWTH SCALE. THE SWEET SPOT IS BETWEEN 75 AND 100. ANYTHING LESS THAN THAT, WE WILL STOP WORRYING ABOUT. IS THE FED BEHIND, WILL THEY HAVE TO START CUTTING QUICKER, WHAT WILL HAPPEN TO THE MARKET? I THINK THE NUMBER TODAY WILL BE INTERESTING. JOUMANNA: ALL OF THAT WILL IMPACT THE FRONT END OF THE CURVE AND WHAT IS PRICED IN. 10 YEAR YIELDS PLUS, THAT HAS BEEN IN FOCUS THIS WEEK. A COUPLE DAYS AGO, EVERYONE WAS TALKING ABOUT THE FIXED INCOME ON DROUGHTS COME ON I ARE SITTING AT LOWELL -- LOWER LEVELS THEN WE STARTED THE WEEK. ANOTHER BIG RALLY YESTERDAY. WHAT IS YOUR VIEW ON THE MARKETS HERE? > > 10 YEAR AND ABOVE WILL BE THE MOST INTERESTING FOR TRADERS. IT WILL GET THE MOST BANG FOR ITS BUCK. IT WILL COME DOWN TO CREDIBILITY. IN THE U.S., THE FED, THERE IS NEW INTERVIEWS GOING ON FOR THAT. THERE IS THE VOTE OF CONFIDENCE IN FRANCE COMING IN. BOND LEVELS ARE THE HIGHEST WE HAVE SEEN IN DECADES. IT IS COMING DOWN TO, DOES THE MARKET BELIEVE CENTRAL BANKS CAN CONTROL THIS LEVEL OF DEBT, CAN CONTROL THIS SUPPLY THEY NEED TO KEEP THE WHEEL TURNING? AND THERE'S QUESTIONS THERE. STEEPENING THE CURVE IS A BASE CASE. IT PUTS THE PRESSURE ON MANY PARTS OF GOVERNMENT TO FUND IN THE FUTURE. AND IT IS QUITE NERVE-RACKING BECAUSE THAT IS NORMALLY SEEN AS A FOUNDATION FOR MARKETS, AND IT IS SHAKING THEM A LITTLE BIT. JOUMANNA: HOW MUCH OF A SYSTEMIC IMPACT DO YOU THINK THE FRENCH BUDGET ISSUE COULD HAVE WITH THE CONFIDENCE VOTE COMING UP NEXT WEEK? THE GOVERNMENT IS EXPECTED TO COLLAPSE ONCE AGAIN. IT RAISES QUESTIONS ABOUT WHO THE NEXT PM IS GOING TO BE, PLUS THE ELECTIONS. A DOMESTIC FRENCH STORY, BUT THERE HAS BEEN A VISIBLE FOOTPRINT ON THE BOND MARKET. IT IS NOT LIKELY TO AFFECT OTHER BOND MARKETS AS WELL, OR WILL IT BE RATHER IN DETAINED TO FRENCH SPREADS? > > WHEN WE LOOK TO WHAT HAPPENED IN THE U.K. AROUND -- > > THE MANY BUDGET -- MINI BUDGET? > > EXACTLY. THAT WAS A LOCAL ISSUE THAT RAN AWAY FROM ITSELF. NOW YOU HAVE THE SECOND BIGGEST ECONOMY IN EUROPE, THE CONFLICT, SEEING SPREADS BETWEEN FRANCE AND GREECE BEING HIGHLIGHTED. THAT IS SOMETHING YOU WOULD NOT HAVE THOUGHT OF. I THINK THAT WILL PUT A LOT OF PRESSURE. THEY NEED ACCESS TO FUNDS. IF THE LONG AND IS GOING UP, THAT WILL MAKE IT HARDER. VERY IMPORTANT TO KEEP AN EYE ON THAT AND MAKE SURE IT DOESN'T RUN AWAY. JOUMANNA: LET ME BRING IT BACK TO EQUITIES AND SOMETHING ANNABELLE WAS POINTING OUT. WITH THE ASIA PACIFIC, THE SAME THING WITH THE S & P, EVEN THOUGH WE GET HIGHER AND HIGHER, THE VOLUMES ACCOMPANYING THOSE SEQUENTIAL HIGHS AND RECORD HIGHS, AND WHEN IT COMES TO THE S & P, HAVE BEEN THINNING OUT. I WONDER WHETHER FOR YOUR -- FROM YOUR PERSPECTIVE, IF THEY ARE LOSING SOME OF THEIR LONG-TERM CONVICTION VIS-A-VIS U.S. EQUITIES, OR IF THEY FEEL THEY ARE POSITIONED ENOUGH AND DO NOT NEED TO CHASE THIS RALLY FURTHER? > > A LOT OF OUR CLIENTS ARE HEAVY U.S. BREADTH IS NARROWING WITH THE VOLUMES GOING DOWN. I DON'T BELIEVE THE NVIDIA EARNINGS WERE BAD BY ANY MEANS. THEY WERE PRETTY SOLID. BUT WHEN YOU HAVE A RATIO LIKE THAT, IT NEEDS TO BE AMAZING TO SEE THE SAME LEVEL. WHEN YOU GET TO THESE PRICE TO EARNINGS, YOU NEED STRONG NUMBERS TO COME THROUGH. TOP-PERFORMING AI THAT CAN BE MONETIZED. SOME OF THE DEFENSE NAMES. YOU NEED A FEW TAILWINDS TO KEEP THE MOMENTUM GOING. OUR BASE CASE IS STILL GOING TO GRIND HIGHER, EQUITIES. BUT NEXT YEAR, IT IS GOING TO BE A LOT HARDER TO KEEP THE MOMENTUM. JOUMANNA: I'M SURE THERE'S PLENTY OF INTEREST FROM YOUR CLIENTS TO INVEST IN THE AI WORLD. IF YOU HAD INVESTED IN NVIDIA. NOW COME OTHERS VALUATIONS, THINGS EXTREMELY EXPENSIVE. YOU HAVE TO BE MORE DISCERNING ABOUT WHICH OF THESE AI MODELS, APPLICATIONS ARE ACTUALLY GOING TO BE SUCCESSFUL. HOW DO YOU SCREEN FOR THEM AND HOW DO YOU ASCERTAIN AT THIS POINT IN TIME WHICH ONES ARE GOING TO BE THE WINNERS IN THE NEXT FEW MONTHS OR YEARS? > > THAT IS ONE OF THE HARDEST QUESTIONS. TO YOUR EARLY POINT, THEY INVESTED MONEY IN THE STOCKS SO THEY DON'T MIND A BUYBACK. BUYING THE DIP IS STILL GOING TO BE AN ENVIRONMENT WE WILL SEE, WHEN YOU HAVE DONE SO WELL FOR SO LONG. IT WILL NEED A SERIOUS SCALE FOR PEOPLE TO CHANGE THAT CONVICTION. BY ANY NEW MONEY, PEOPLE ARE SAYING, WHAT IS THE NEXT NEW INTEREST COMING THROUGH? WE ARE SEEING INTERESTING THINGS AROUND THE ADOPTION OF AI IN ROBOTICS AND HEALTH CARE, EVEN ENERGY EFFICIENCY THAT IS PLAYING OUT QUITE NASTY. THAT IS NOT FOCUSED PURELY ON THE U.S. BUT MOVING INTO CHINA AND JAPAN. THOSE ARE AREAS WE WILL START TO SEE NEW MONEY MOVING OUT. WHERE IF YOU HAVE MATURING MONEY OUT OF CREDIT, THAT MONEY YOU WILL SEE IN ROTATION. JOUMANNA: DEEPSEEK ARE LOOKING TO DEVELOP THEIR OWN AI AGENTS. THE FOCUS COULD BE SHIFTING EAST. REALLY GOOD TO CHAT TO YOU. GARRETT NICHOLSON. FOR A LOOK AT SOME OF THE OTHER STORIES WE ARE FOLLOWING. PRESIDENT TRUMP'S PICK FOR THE FEDERAL RESERVE BOARD OF GOVERNORS HAS PUSHED BACK AGAINST DEMOCRATIC CONCERNS HE WOULD DO TRUMP'S BIDDING AT THE CENTRAL BANK. AT HIS CONFIRMATION HEARING BEFORE THE SENATE, STEPHEN MYRON AFFIRMED HIS COMMITMENT TO FED INDEPENDENCE AND PLEDGED TO MAKE DECISIONS BASED ON HIS OWN ANALYSIS. BUT THERE WERE CONCERNS ABOUT HIS DECISION TO KEEP HIS WHITE HOUSE JOB WHILE AT THE FED. > > I HAVE RECEIVED ADVICE FROM COUNSEL THAT WHAT IS REQUIRED IS AN UNPAID LEAVE OF OPTION -- ABSENT'S. CONSIDERING THE TERM FOR WHICH I AM BEING NOMINATED IS A LITTLE MORE THAN FOUR MONTHS, THAT IS WHAT I WILL BE TAKING. AS LONG AS THAT IS THE ADVICE OF COUNSEL, I WILL FOLLOW THE LAW. > > WELL, YOUR INDEPENDENCE IS ALREADY SERIOUSLY COMPROMISED. YOU ARE GOING TO BE TECHNICALLY AN EMPLOYEE, BUT AN INDEPENDENT MEMBER OF THE BOARD OF THE FEDERAL RESERVE. THAT IS RIDICULOUS. JOUMANNA: SOURCES SAY PRESIDENT TRUMP WELT RENAMED THE DEPARTMENT OF DEFENSE THE DEPARTMENT OF WAR. IT IS A MONIKER THAT HAS NOT BEEN USED SINCE THE 1940'S, AND A TRUMP IS EXPECTED TO SIGN AN EXECUTIVE ORDER ON THIS TODAY. THE CHANGES INCLUDE RENAMING THE PENTAGON'S BRIEFING ROOM TO THE PENTAGON WAR ANNEX AND MODIFYING THE DEPARTMENT'S WEBSITE AND SIGNAGE. BLOOMBERG HAS LEARNED THE U.S. JUSTICE DEPARTMENT HAS OPENED A CRIMINAL INVESTIGATION INTO WHETHER FEDERAL RESERVE GOVERNOR LISA COOK COMMITTED MORTGAGE FRAUD. SOURCES SAY FEDERAL PROSECUTORS HAVE ISSUED SUBPOENAS SEEKING INFORMATION RELATED TO THE ALLEGATIONS. LAST MONTH, TRUMP MOVED TO FIRE COOK BEFORE SHE SUED THE JOB, AND MAINTAINS SHE NEVER COMMITTED MORTGAGE FRAUD. STILL AHEAD, THE OIL MARKET REMAINS ON EDGE AS INVESTORS LOOK AHEAD TO AN OPEC-PLUS MEETING THIS WEEKEND. WE HAVE DETAILS NEXT. THIS IS BLOOMBERG. ♪ JOUMANNA: WELCOME BACK TO \"HORIZONS: MIDDLE EAST AND AFRICA.\" OIL FALL FOR A THIRD DAY, HEADING FOR A WEEKLY DECLINE AHEAD OF AN OPEC-PLUS MEETING THAT MAY SEE THE GROUP SIGN OFF ON ANOTHER SUPPLY IKE. BRENT CRUDE FUTURES HAVE DECLINED BY 11% THIS YEAR DUE TO CONCERNS OF A GLOBAL GLUT AND WORRIES OF ENERGY DEMANDS. JOINING ME IS BLOOMBERG'S ASIA ENERGY TEAM LEADER. EVERYONE IN THE INDUSTRY IS KEEPING A CLOSE EYE ON WHAT HAPPENS WITH THAT OPEC-PLUS MEETING. IS THERE REALLY ANYONE OUT THERE WHO EXPECTS OPEC-PLUS TO SURPRISE THE MARKET ONCE AGAIN WITH A DECISION TO BRING EXTRA PRODUCTION BACK TO MARKET? BECAUSE, OF COURSE, THERE IS STILL A 1.66 MILLION BARREL PER DAY OUTPUT THAT COULD BE UP FOR DISCUSSION. STEPHEN: RIGHT. THAT IS A REALLY GOOD QUESTION. WHO IS EXPECTING THIS INCREASE? BLOOMBERG, WE HAD A SURVEY OF ANALYSTS AND MARKET WATCHERS, AND THE VAST MAJORITY THINK THE MEETING THAT WILL BE HELD ON SEPTEMBER 7 WILL BE RUBBERSTAMPING AND THERE WILL NOT BE AN INCREASE. THERE IS A SMALLER GROUP OF ANALYSTS WHO THINKS THERE COULD BE A MODEST INCREASE TO PRODUCTION FROM THE NEXT MONTH. THAT IS INTERESTING BECAUSE IN THE PAST COME ON THE ANALYSTS HAVE NOT ALWAYS BEEN RIGHT. WE HAD SURPRISE HIKES HAPPENING SINCE APRIL. BUT THEY SIGNALED THOSE HIKES HAVE BEEN FINISHED AFTER THOSE 2.5 MILLION BARRELS HAVE BEEN ENTERED INTO THE MARKET. THE BIG QUESTION IS, DO THEY WANT TO ADD THESE 1.66 MILLION BARRELS, STARTING TO DO THAT NOW? BECAUSE THE PLAN WAS TO DO THAT BY THE END OF 2026. SO, THERE'S A LOT OF WIGGLE ROOM. YOU ARE IN A REALLY FROTHY MARKET. IS THIS ABOUT ADDING BARRELS TO THE MARKET BECAUSE THEY THINK THERE'S STILL SOME TIGHTNESS? OR IS THIS ABOUT CAPTURING MARKET SHARE? I THINK THOSE WILL BE THE TOPICS THAT WILL BE DISCUSSED WHEN THEY MEET ON SUNDAY. JOUMANNA: AND TO WHAT EXTENT DO YOU THINK SOME OF THE GEOPOLITICAL CONSIDERATIONS ARE ALSO GOING TO HAVE TO BE FACTORED IN? WE TALK ABOUT THE ONGOING POTENTIAL DISCUSSIONS BETWEEN RUSSIA AND UKRAINE. PRESIDENT TRUMP HAS FLOATED THE POSSIBILITY OF EXTRA SECONDARY SANCTIONS ON COUNTRIES THAT BUY RUSSIAN OIL. HE HAS DONE THAT WITH INDIA COME ALTHOUGH IT HAS NOT HAD A NOTABLE IMPACT ON RUSSIAN OUTPUT. HOW COULD THAT BE A DETERMINATE IN WHERE WE GO IN TERMS OF OPEC-PLUS DECISION-MAKING AND THE PRICE OF OIL IN THE COMING MONTHS? STEPHEN: CERTAINLY, GEOPOLITICS IS SWINGING THE PRICE OF OIL QUITE A BIT OVER THE LAST FEW WEEKS, MONTHS, YEARS EVEN. TRUMP AND WHAT HE SAYS HAS A LARGE IMPACT. WHAT HAPPENS BETWEEN RUSSIA, THE WAR IN UKRAINE, AND THE PRESSURE THE PRO-TRUMP ADMINISTRATION PUTS ON CERTAIN BUYERS DOES ALSO HAVE AN IMPACT ON GLOBAL OIL FLOWS AND THE PRICE OF OIL. NOT JUST INTERNATIONALLY BUT ALSO IN THE UNITED STATES ITSELF, SOMETHING TRUMP CARES DEEPLY ABOUT. WHEN YOU TALK ABOUT GEOPOLITICS AND RELATIONS BETWEEN COUNTRIES, ONE OTHER THING THAT PERHAPS OPEC-PLUS WILL HAVE TO BE LOOKING AT CLOSELY IS THE IMPACT OF TARIFFS. WHERE IS THE HEALTH OF THE GLOBAL ECONOMY? THAT IS SOMETHING THAT IS EASIER TO MEASURE COMPARED TO WHAT IS TRUMP GOING TO DECIDE ONE DAY? WHEN YOU LOOK AT MEASURES AND THE TARIFFS ON THE TABLE, OPEC-PLUS WILL BE LOOKING AND THERE ANALYSTS WILL BE LOOKING AT ECONOMIC GROWTH OR ECONOMIC SLOWDOWN BECAUSE OF THOSE TARIFFS. IT IS ONE OF THE MAJOR FACTORS THAT WILL BE IN PLAY HERE BECAUSE WHEN YOU LOOK AT CHINA, FOR EXAMPLE, CHINESE DEMAND HAS NOT BEEN LIVING UP TO WHERE ANALYSTS THOUGHT IT WOULD BE THIS TIME OF YEAR. THERE HAS NOT BEEN THE GROWTH THAT WAS TO BE EXPECTED. YOU LOOK DOMESTICALLY IN THE UNITED STATES, THEY WILL BE SEEING WHAT U.S. POLICIES WILL DO TO THAT MARKET BECAUSE THE U.S. IS A MAJOR CONSUMER OF OIL. EARLY INDICATIONS ARE THAT DEMAND MAY NOT BE THERE EITHER BECAUSE WE HAVE SEEN AN INCREASE IN INVENTORIES THIS WEEK AT THE MAIN CUSHING FACILITY. AT THE SAME TIME, YOU ARE SEEING RUN RATES AT REFINERIES AT THE LOWEST LEVELS IN MONTHS. THOSE TOGETHER ALSO INDICATE A BIT OF A WEAKER MARKET, AND THOSE FACTORS, THE GEOPOLITICS BUT ALSO DOMESTIC POLITICS OF AMERICA, WILL HAVE AN IMPACT ON WHAT THEY DECIDE. JOUMANNA: STEPHEN, THANK YOU SO MUCH. BLOOMBERG ASIA ENERGY TEAM LEADER. WE ARE GOING TO BE TALKING MORE ABOUT ENERGY FOR THE REST OF THIS SHOW WITH GUESTS COMING ON, SO STAY TUNED FOR THAT CONVERSATION. COMING UP AS WELL, DEEPSEEK SET TO BE DEVELOPING AN ARTIFICIAL INTELLIGENCE MODEL TO COMPETE WITH OPENAI. WE HAVE THE DETAILS NEXT. THIS IS BLOOMBERG. > > SHIPS AND SEMICONDUCTORS, AND WE WILL BE PUTTING TARIFFS ON COMPANIES THAT AREN'T COMING IN. WE WILL BE PUTTING A TARIFF VERY SHORTLY, PROBABLY PUTTING A VERY SUBSTANTIAL TARIFF. THROUGH READING ABOUT YOU AND STUDYING, KNOWING A LOT ABOUT YOUR BUSINESS, WE ARE MAKING IT. JOUMANNA: PRESIDENT TRUMP WARNING OF MORE PAIN AHEAD FOR THE CHIP INDUSTRY WITH TOP TECH EXECUTIVES. BUT HE CLARIFIED THAT GOODS FROM COMPANIES THAT HAVE PLEDGED TO BUSH -- BOOST THEIR U.S. INVESTMENTS WILL BE SPARED. THE WHITE HOUSE MEETING COMES AMID COMPETITION BETWEEN SILICON VALLEY AND CHINESE TECH GIANTS. DEEPSEEK IS DEVELOPING A NEW MODEL WITH ADVANCED AI AGENT FEATURES TO COMPETE WITH THE U.S. RIVALS SUCH AS OPENAI. SOURCES SAY THE MODEL CAN EXECUTE MULTISTEP TASKS WITH MINIMAL PROMPTS AND LEARN FROM ACTIONS. LET'S BRING IN ANNABELLE DROULERS. GOOD TO SEE YOU AGAIN. YOU MENTIONED THIS TOWARD THE END OF YOUR MARKETS HIT. TELL US, WHAT IS THE LATEST ON THIS SCOOP WE HAVE REGARDING DEEPSEEK? ANNABELLE: DEEPSEEK, WE KNOW THEM AS THE AI START UP INSIDE CHINA, CAUSED A STIR THIS YEAR WHEN THEY RELEASED THEIR FIRST REASONING MODEL. BUT IN THE TIME SINCE JANUARY, IT HAS BEEN VERY INCREMENTAL UPDATES FROM THE COMPANY. GETTING THIS SCOOP OVERNIGHT WAS QUITE IMPACTFUL FOR MANY. IT HAS BEEN VERY WELL WRITTEN. ESSENTIALLY, DEEPSEEK IS LOOKING AT A NEW AI AGENT THEY WANT TO TRY TO RELEASE AT THE END OF THIS YEAR. THAT IS WHAT WE ARE HEARING FROM SOURCES. AND AI AGENTS, THIS IS WHAT WE HAVE ALREADY SEEN FROM COMPANIES INCLUDING THE LIKES OF ALIBABA, BUT MICROSOFT, OPENAI AS WELL. THEY HAVE ALREADY HAD A FEW OF THESE AI AGENTS BEING RELEASED TO THE MARKET. THE IDEA OF AN AI AGENT IS THAT IT CAN DO MORE THAN A TYPICAL CHATBOT LIKE CHATGPT, WHERE YOU PUT IN A TEXT PROMPT AND IT SPITS OUT A FEW SENTENCES. AN AI AGENT IS ABOUT ACTING AUTONOMOUSLY, EXECUTING MULTIPLE STEPS SO IT CAN START TO ACT LIKE A PERSONAL ASSISTANT IN A LOT OF WAYS. THAT IS WHAT DEEPSEEK WANTS TO BE ABLE TO DO, AND THAT IS WHAT WE GOT FROM OUR SOURCES. BIG QUESTION, WHAT WOULD THIS AGENT LOOK LIKE AND WILL IT BE SO IMPACTFUL AS WE SAW WITH THE R1 TO COST MORE SHOCK WAVES ACROSS THE GLOBAL AI INDUSTRY? JOUMANNA: SO INTERESTING. ALSO, ANOTHER STORY THAT CAME OUT OVERNIGHT, BROADCOM LOOKING TO HELP OPENAI DESIGN AND PRODUCE AN AI ACCELERATOR FROM 2026? IS THIS SIGNIFICANT? ANNABELLE: THIS IS SOMETHING CERTAINLY WE HAD THE BROADCOM CEO SPEAKING ABOUT THIS CUSTOMER THAT THEY HAD ACQUIRED FOR THE AI ACCELERATOR BUSINESS, AND THEY WERE TALKING ABOUT IT BEING WORTH $10 MILLION. WE DIDN'T GET THE DIRECT REFERENCE FROM THE CEO TO WHO THAT WAS, BUT WE UNDERSTAND FROM SOURCES THAT ARE FAMILIAR WITH THE MATTER THAT IT IS REFERRING TO OPENAI. AND THEY HAVE JOINED UP WITH BROADCOM TO PRODUCE AN AI ACCELERATOR. IT WILL BE COMING INTO MARKET IN 2026. A VERY LUCRATIVE SPACE, ONE THAT IS DOMINATED BY NVIDIA. THE QUESTION IS, CAN THEY BE COMPETITIVE AGAINST THAT TECHNOLOGY? JOUMANNA: ANNABELLE DROULERS, BLOOMBERG'S TECH CORRESPONDENT, THANK YOU SO MUCH FOR THE LATEST. LET'S CHECK IN ON THE MARKETS BECAUSE WE'VE GOT SOME OF THOSE TECH NAMES PLAYING OUT IN ASIA. OF COURSE, A LOOK AHEAD TO THE BIG PAYROLL PRINT COMING OUT LATER TODAY. JOBS MARKETS IN THE U.S. CLEARLY IN FOCUS WITH THE S & P AT AN ALL-TIME HIGH, HITTING ANOTHER RECORD. AS WE HEAD TOWARDS THAT PRINT, S & P FUTURES ARE LEADING TOWARDS THE GREEN. NASDAQ UP ALSO 0.3%. EURO MARKETS LOOK LIKE THEY WILL HAVE A MORE POSITIVE START TO THE SESSION. BUT WHERE WE GO FROM HERE IS A FUNCTION OF WHAT HAPPENS LATER TODAY IN TERMS ESPECIALLY OF WHAT IS PRICED IN FOR A FED RATE CUTS THE REST OF THIS YEAR AND NEXT YEAR. COMING UP, OIL PRICES ON TRACK FOR A WEEKLY LOSS. MY NEXT GUEST SAYS NUMBNESS TO SUPPLY RISK FROM THE RUSSIA-UKRAINE WAR COULD BE RISKY. WE WILL SPEAK TO THE GLOBAL CRUDE LEAD FROM ENERGY ASPECTS NEXT. THIS IS BLOOMBERG. JOUMANNA: GOOD MORNING. THIS IS \"HORIZONS: MIDDLE EAST AND AFRICA.\" OUR TOP STORIES THIS MORNING. BOND AND CURRENCY TRADERS AWAIT TODAY'S U.S. JOBS REPORT WITH INVESTORS ALMOST FULLY PRICING IN A RATE CUT. CHINA'S DEEPSEEK IS WORKING ON AN AI MODEL WITH MORE ADVANCED FEATURES TO COMPETE WITH U.S. RIVALS, INCLUDING OPENAI. AND MTM IS CONSIDERING REVIVING TALKS TO ACQUIRE TELKOM AS THE WIRELESS CARRIER LOOKS TO CLOSE THE GAP WITH ITS RIVAL . THIS IS THE SCREEN FOR YOU. YOU HAVE THE S & P LEANING POSITIVE, UP 60 BASIS POINTS. TWO YEAR YIELDS AT 3.58. WE ARE TRADING AT THE LOWEST LEVELS AND YIELD TERMS IN THE PAST YEAR AS INVESTORS CONTINUE TO PRICE IN FOR THEIR INTEREST RATE CUTS OUT OF THE FED. YOU HAVE SEPTEMBER PRETTY MUCH FULLY BAKED IN FOR NEXT WEEK, THEN ANOTHER FOUR FOR 2026. IT TAKES THE TERMINAL RIGHT TO AROUND 3%. LET'S SEE IF THAT CHANGES WITH THE JOB FIGURE. WE WILL SEE IF ANY UPSIDE OR SIGNIFICANT DOWNSIDE IN PRICES, AFTER LAST MONTH'S DOWNSIDE SHOCK. USD SLIPPING AS WELL. THE THEME CONTINUES TO BE ONE OF WEAKNESS. THE UST DOWN 0.7%. STILL, NINE POINT 5% WEAKER ON THE YEAR. INVESTORS NOT GIVING A LOT OF LOVE TO THE USD. THEN ENERGY, WE WILL BE TALKING WITHOUT WITH OUR GUESTS, SOME OF THE DYNAMICS. WE ARE TRADING JUST SHY OF 67 DOLLARS, DOWN 0.2%. LET'S MOVE ON AND CHECK ON THE MARKETS IN ASIA. ANNABELLE DROULERS IS IN HONG KONG. WALK US THROUGH SOME OF THE DRIVERS IN THE MARKETS TODAY. ANNABELLE: THANKS, JOUMANNA. IT IS GREAT YOU JUST MENTIONED WEAKER U.S. DOLLAR, THESE ARE ALL FACTORS THAT AFFECT EQUITIES. YOU HAVE GREEN ACROSS THE SCREEN , EVEN IN CHINA. WE WERE TALKING ABOUT THAT SCOOP THAT REGULATORS WERE GETTING WORRIED ABOUT THE RALLY MOVING TOO FAR, TOO FAST. MAYBE THEY ARE LOOKING AT WAYS TO SLOW IT DOWN. WE SAW A BIG SELLOFF YESTERDAY. TODAY, A BIT MORE RECOVERY. JAPAN ANOTHER WENT TO NOTE BECAUSE IT HAS BEEN RISING. WE DID SEE PRESIDENT TRUMP SIGNING THAT EXECUTIVE ORDER INTO EFFECT. TAIWAN ONE OF THE STANDOUTS, UP 1% IN THE SESSION. THE TAIWAN DOLLAR ALSO LEADING AGAINST THE GREENBACK TODAY, AS WE SEE MORE FOREIGNERS PILING IN TO EQUITIES. YIELDS, WE HAVE SEEN THE RETREAT IN THE TWO YEAR YIELDS. WE ARE SEEING THAT REFLECTED TODAY IN ASIA. WHAT IS INTERESTING IS WHEN I TAKE A LOOK AGAIN AT WHAT IS LEADING IN THE SESSION TODAY, IT IS THE SAME THING WE HAVE HAD FOR A COUPLE SESSIONS NOW. IT IS CHINESE SOLAR STOCKS. TAKE A LOOK AT HOW THEY ARE PERFORMING TODAY, RISING AGAIN. THE STORY HAS BEEN THIS SIMILAR THEME. THERE IS THIS QUESTION NOW, IS SOLAR GOING TO BE THE FIRST INDUSTRY IN CHINA THAT TACKLES ANTI-OR EXCESS CAPACITY? THAT HAS BEEN THE HOPE, AND WE HAD THAT INTERVIEW WITH A CEO SAYING WORDS TO THAT EFFECT. YOU ARE CONTINUING TO SEE ANOTHER DAY OF GAINS IN THIS SECTOR. JOUMANNA: BELLE, THANK YOU SO MUCH. OIL PRICES ARE UNDER RENEWED PRESSURE, HEADING FOR A WEEKLY DECLINE AHEAD OF THE OPEC-PLUS MEETING. THE MARKET IS PRICING FOR THE POSSIBLE SUPPLY HIKE, EVEN AS INVENTORIES CLIMB AND DEMAND CONCERNS WAY ON SENTIMENT. WE ARE JOINED BY THE GLOBAL CRUDE LEAD AT ENERGY ASPECTS. GOOD TO HAVE YOU WITH US. WHAT PROBABILITY WOULD YOU PLACE ON OPEC-PLUS ACTUALLY REVIVING TALKS OR BEGINNING TALKS ABOUT PUTTING BACK THE EXTRA 1.66 BILLION BARRELS A DAY THAT WERE TAKEN OFF THE MARKET IN 2023? > > YES, WE DO THINK IT IS A LIKELY SCENARIO AT THIS POINT. I THINK THERE WAS INITIALLY REASONS TO BELIEVE THE GROUP WOULD BE MORE ON THE CAUTIOUS SIDE AND WAIT TO SEE WHAT THE IMPACT OF THE UNWINDING OF THE PREVIOUS VOLUNTARY CUTS WOULD DO TO THE MARKETS. BUT OUR LATEST FINDINGS FROM THE GROUP SUGGEST THEY ARE VERY MUCH CONSIDERING UNWINDING THAT FINAL TRANCHE OF CUTS, THE 1.66 MILLION BARRELS OF DATA YOU MENTION, SOONER RATHER THAN LATER. AND IT COULD BE AS SOON AS OCTOBER, MAYBE A LITTLE BIT LATER, BUT NOT INTO 2026 AS SOME OF THE MARKET EXPECTED. JOUMANNA: I WAS GOING TO SAY, WHY DO YOU THINK THEY WILL FEEL LIKE THE TIMING IS RIGHT TO DO THIS? BECAUSE ALREADY, WE ARE TALKING ABOUT AND OIL BACKDROP THAT IS PRETTY BEARISH. THE OIL COMPLEX IS DOWN ALMOST 10% YEAR TO DATE. LIVIA: YOU ARE RIGHT. I THINK THE EXPECTATIONS FOR Q4 AND LOOKING INTO 2026 IS THAT THE MARKET WILL BE BUILDING, AT LEAST THAT IS WHAT CONSENSUS IS SHOWING. THE KEY THING IS THE MARKETS HAVE NOT BEEN AS SLIGHT. WE HAVE NOT SEEN THE BIG DEALS SHOWING UP YET. THERE IS SOME EXPECTATION THAT IT WILL COME IN SEPTEMBER AND OCTOBER. HIGH-FREQUENCY DATA NOT POINTING TO THAT JUST YET. THE FLAT PRICE HAS DECLINED IN RECENT MONTHS. BUT THE MARKET IS STILL HOLDING UP QUITE WELL, GIVEN WE ARE PRICING IN TURNAROUNDS. ALL OF THAT POINTS TO BENCHMARKS BEING TIGHTER THAN EXPECTATIONS. THE KEY THING IS THE PRODUCTION THAT OPEC HAS BEEN UNWINDING ON PAPER ACTUALLY HASN'T EQUATED TO A CORRESPONDING INCREASE IN EXPORTS TO THE MARKETS. SO, THE MARKET HAS SEEN LOT LESS SUPPLY THAT WAS SUPPOSED TO BE UNWOUND COMING TO THE MARKET, AND WE THINK THAT IS GOING TO BE A STORY CARRYING INTO 2026, EVEN IF THERE IS AN ADDITIONAL TRANCHE OF CUTS. JOUMANNA: WHAT IS YOUR OWN HOUSE VIEW ON THAT SUPPLY-DEMAND MISMATCH? BECAUSE THERE'S A WHOLE RANGE OF FORECASTS OUT THERE, BUT MOST PEOPLE AND MOST OF THE NOTES I SEE POINT TO AN EXCESS SUPPLY OF ANYTHING FROM ONE MILLION BARRELS A DAY UP TO 2 MILLION BARRELS A DAY, DEPENDING ON WHO'S RESEARCH YOU ARE SEEING. LIVIA: WE ARE IN THAT SAME RANGE ON SPREADSHEETS. WHAT WE HAVE BEEN SCRATCHING OUR HEADS ABOUT, AND A LOT OF PEOPLE ARE IN THE SAME POSITION, WE ARE NOT SEEING THAT COME THROUGH THE MARKETS. AS DATA HISTORICALLY COMES OUT, WHICH EVERYBODY KNOWS THE DATA IN THE OIL MARKET IS ALWAYS VERY BACKWARD LOOKING, BUT WE HAVE SEEN DEMAND OUTPERFORMING EXPECTATIONS. CASE IN POINT, THE U.S. PRINT THAT CAME OUT LAST WEEK ON DEMAND WAS VERY STRONG DESPITE CONCERNS ABOUT THE MACROECONOMIC VECTOR. AND SUPPLIES ARE NOT KEEPING UP PACE. THAT GOES FOR THE OPEC-PLUS GROUP, PLACES LIKE RUSSIA THAT ARE STRUGGLING TO INCREASE PRODUCTION. EVEN SOME OF THE MIDDLE EASTERN PLAYERS. IN OPEC PRODUCTION AS WELL GENERALLY UNDERPERFORMING EXPECTATIONS AS WELL. JOUMANNA: INTERESTING. LET ME ASK YOU ABOUT THE RUSSIA QUESTION IN ALL OF THIS BECAUSE IT COULD GO BOTH WAYS. IF THERE IS A PEACE DEAL, ASSUMING THERE IS, THAT COULD POTENTIALLY LEAD TO A LIFTING OF SANCTIONS AND RENEWED AMOUNTS OF RUSSIAN OIL BEING SUPPLIED TO THE MARKET. ALTERNATIVELY, THINGS COULD GO THE OTHER WAY. PRESIDENT TRUMP COULD DECIDE TO PLAY HARSHER SECONDARY SANCTIONS ON COUNTRIES THAT CONTINUE TO BUY RUSSIAN OIL. HOW DO YOU TRADE THE RUSSIA FACTOR IN THIS MARKET? LIVIA: I WOULD SAY THE MOMENT PEOPLE DECIDE THERE IS NOT A LOT OF RISK FACTORED INTO THE MARKET WITH THE POTENTIAL STRONGER SANCTIONS FROM THE U.S. GOVERNMENT, I THINK BECAUSE RUSSIA'S SUPPLIES TO THE MARKET HAVE BEEN RESILIENT IN FACE OF U.S. SANCTIONS ON THE SHIPPING SECTOR, THE MARKET IS VERY SKEPTICAL WHEN IT COMES TO ANYTHING THAT MIGHT MEAN THAT RUSSIAN SUPPLIES ARE LOST. SO, UNTIL THERE IS A MEANINGFUL SIGN THAT SOMETHING IS HAPPENING AND THERE IS AN IMPACT ON PHYSICAL FLOWS, I THINK THERE WOULD NOT BE MUCH REFLECTED IN THE PRICE. JOUMANNA: AND WHAT DO YOU THINK ABOUT THESE RECENT UKRAINIAN ATTACKS ON RUSSIAN ENERGY INFRASTRUCTURE? IS THAT LIKELY TO SHOW UP? LIVIA: WE HAVE SEEN A LOT OF REFINERIES IN PARTICULAR COMING UNDER ATTACK FROM UKRAINIAN DRONES. IT IS NOTHING NEW. WE SAW THAT HAPPENING LAST YEAR. BUT THE SCALE AND INTENSITY OF THESE ATTACKS, IN AUGUST IN PARTICULAR, I WOULD SAY IS QUITE UNPRECEDENTED. THERE WERE A LOT OF REFINERIES STRUCK DOWN. IT HAS HAD A MEANINGFUL IMPACT ON DOMESTIC RUN IN RUSSIA. IT IS CURTAILING PRODUCT EXPORTS TO THE BOND MARKET. INTERESTINGLY, IT IS NOT LEADING TO HIGHER CRUDE IN THE MARKET, WHICH NORMALLY WOULD HAPPEN IF YOU HAVE YOUR RUNS DOWN. YOU JUST REDIRECT MORE CRUDE TO THE MARKET. WE THINK THAT SPEAKS TO THE FACT THAT RUSSIAN PRODUCTION IS NOT INCREASING THAT MUCH ON AN UPSTREAM POINT OF VIEW. THEY ARE REALLY STRUGGLING WITH THE LEGACY ASSETS IN THE MARKET. JOUMANNA: THANK YOU SO MUCH. REALLY GOOD TO CHAT TO YOU AHEAD OF THIS OPEC-PLUS MEETING AND BEYOND. LIVIA GALLARATI. AND COMING UP, HEAR WHY CITI REMAINS BULLISH ON GOLD BUT IS TURNING LESS BEARISH ON COPPER AS TRADERS AWAIT KEY U.S. JOBS DATA FOR FRESH CLUES ON THE FED'S RATE PATH. THIS IS BLOOMBERG. ♪ JOUMANNA: WELCOME BACK TO \"HORIZONS: MIDDLE EAST AND AFRICA.\" I'M JOUMANNA BERCETCHE IN DUBAI. GOLD IS ON TRACK FOR A THIRD STRAIGHT WEEKLY GAIN AHEAD OF THE KEY U.S. JOBS REPORT THAT COULD CEMENT EXPECTATIONS FOR A FED RATE CUT LATER THIS MONTH. DESPITE HITTING OVERBOUGHT LEVELS, THE METAL IS STILL UP BY MORE THAN 30% THIS YEAR, MAKING IT ONE OF THE TOP PERFORMING MAJOR COMMODITIES. JOINING US IS MAX LAYTON. YOU JUST PUBLISHED YOUR PIECE, AND OUTLOOK FOR VARIOUS COMMODITIES, NOT JUST GOLD. BUT I WANT TO START WITH GOLD. WE TALKED WITH THE PRICE-PERFORMANCE IN PERCENTAGE TERMS, UP 30%, BUT IT IS DIFFICULT TO GET MY HEAD AROUND THE IDEA THAT GOLD STARTED OFF THE YEAR TRADING AT 2600, BUT CLOSE TO 3500, ALL-TIME RECORD HIGHS. BUT YOU REMAIN BULLISH ON GOLD. WHAT IS GOING TO DRIVE THE NEXT LEG UP FROM HERE? IT IS ALREADY VALUED SO MUCH. MAX: THAT IS A GREAT POINT. THERE IS THIS MASSIVE SPENDING ON GOLD FROM LOOKING AT IT IN A HISTORICAL CONTEXT. YOU LOOK AT THE VALUE OF GOLD SPENDING AT THE MOMENT, AND IT IS RUNNING ABOUT $600 MILLION ANNUALIZED, WHICH IS WELL OVER 0.5% OF GDP, THE HIGHEST IN ALMOST 50 YEARS OF DATA. THERE IS A HUGE AMOUNT OF GOLD. WHAT TAKES IT HIGHER IS WHAT THE GOLD MARKET IS TRYING TO DO IS THESE NEW BUYERS, THESE PEOPLE BUYING FOR A VARIETY OF REASONS, BUT THE NEW BUYERS ARE TRYING TO GET THE STOCKHOLDERS TO SELL. ON OUR ESTIMATES, YOU ARE TRYING TO GET A LOT OF STOCKHOLDERS TO SELL AROUND 1% TOTAL STOCKHOLDERS NEEDING TO SELL THEIR STOCKS TO CLEAR THIS MARKET TO ME THAT FRESH DEMAND TO BUY GOLD. SO, THOSE STOCKHOLDERS OVER TIME, THE WEAKER HANDS SELL AND THE STRONGER HANDS WANT HIGHER PRICES, AND THAT'S WHAT WE ARE SEEING. WE ARE SEEING GOLD MOVE UP TO GET THOSE STOCKHOLDERS TO SELL. JOUMANNA: TO WHAT EXTENT IS WHERE WE GO FROM HERE, DEPENDENT ON WHAT HAPPENS ON THE MACRO SIDE OF THINGS? LET'S SAY THE FED DON'T END UP CUTTING AS MUCH AS PRICED IN, OR INFLATIONARY PRESSURES DON'T EMERGE TO THE EXTENT SOME PEOPLE IN THE MARKET ARE ANTICIPATING. DOES THAT CONSTITUTE A HEADWIND? MAX: IT CERTAINLY DOES, AND THAT IS PART OF THE REASON WHY WE SEE A SMALL AMOUNT OF UPSIDE IN THE BASELINE SCENARIO. WE DO SEE PRICES GETTING UP TO 3600 DOLLARS, AND THAT IS BECAUSE THE FOMC HAS A DUAL MANDATE AND INFLATION IS ABOVE TARGET. YES, THE MARKET IS SLOWING DOWN, THE LABOR MARKET IS SLOWING DOWN, BUT IT IS NOT SLOWING DOWN DRAMATICALLY. IT HAS BEEN SLOWING DOWN FOR THREE YEARS. IT IS A BIT OF AN ACCELERATION IN THAT. BUT OVERALL, THE U.S. ECONOMY IS DOING OK. AND THE FED HAS A DUAL MANDATE, SO THIS IS SOMETHING THAT IS GOING TO BE SUPPORTIVE. JOUMANNA: EARLIER IN THE YEAR, WE WERE TALKING ABOUT HOW SILVER WAS NOT ENJOYING THE SAME RALLY AS GOLD, GOLD'S COUSIN, IF YOU WANT TO CALL IT. BUT IT HAS BROKEN THROUGH $40 AN OUNCE, LEVELS NOT SEEN SINCE 2011. FIRST OF ALL, WHY DID IT TAKE SILVER SO LONG TO CATCH UP? AND ARE YOU AS BULLISH ON THE OUTLOOK FOR SILVER AS YOU ARE FOR GOLD? MAX: YEAH, I THINK THE FACT THAT GOLD GOT TO RECORD HIGHS AND HAS GONE UP SO MUCH THIS YEAR HAS RESULTED IN SOME INVESTORS SHIFTING INTO SILVER AS A LEVERAGE ON GOLD. DEMAND HAS PICKED UP IN PARTICULAR OVER THE LAST THREE TO FOUR MONTHS. ON TOP OF THAT, YOU HAVE A GENUINE DEFICIT MARKET IN SILVER, AND THAT DEFICIT MARKET HAS BEEN ONGOING FOR SOME TIME. IT IS NOT A TRUE DEFICIT, LIKE WE SPOKE ABOUT EARLIER. WE ARE TRYING TO PRICE THE MARGINAL SILVER STOCKHOLDER TO SELL FOR NEW INVESTORS. AND THEY ARE REQUIRING HIGHER PRICES AS WELL. JOUMANNA: I WANT TO SWITCH OVER AND TALK ABOUT OIL BECAUSE WE HAVE THIS OPEC-PLUS MEETING COMING. THE CITY VIEW IS YOUR SELLERS OVER $70 A BARREL BUT BUYERS SUB-$60 A BARREL. I'M GUESSING YOU SEE THIS TARGET RANGE AROUND $60 TO $70. WHY NOT MORE BEARISH? SO MANY ANALYSTS HAVE STARTED REVISING THEIR FORECASTS LOWER AS WE GET INTO 2026 ON ANTICIPATION OF A SUPPLY GLUT. MAX: THE FIRST REASON IS WE ARE NOT SEEING THESE BUILDS TO MATCH THE SURPLUSES, THE HEADLINE SURPLUSES. IT LOOKS LIKE A LOT OF PEOPLE HAVE IT AT $1 -- ONE MILLION BARRELS PLUS. PERHAPS DEMAND GROWTH, THE LEVEL OF DEMAND IS HIGHER THAN PRETTY MUCH EVERYONE IS MODELING. OR, FOR EXAMPLE, CHINA IS STOCKPILING A LOT OF THE SURPLUS. SO, WHAT IF THE DEMAND LEVEL STAYS HIGHER THAN IT EXPECTS OR CHINA CONTINUES TO STOCKPILE AT A RECENT PACE? IF EITHER OF THESE THINGS HAPPEN, THE SURPLUS NOT JUST THE LAST QUARTER, THIS QUARTER, IF IT ACTUALLY DOESN'T SHOW UP TO THE MARKET IN TERMS OF THESE BUILDS, AND CERTAINLY OUR BASELINE IS THAT CHINA IS STOCKPILING A LOT OF THE RECENT HEADLINE BALANCE SURPLUS. IF THAT CONTINUES, WE WILL NOT GO AS LOW AS CONSENSUS BELIEVES. JOUMANNA: I WANT TO ROUND UP WITH A QUESTION ABOUT TARIFFS. THERE ARE QUESTIONS ABOUT RECIPROCAL TARIFFS, BUT NOT THE SECTORAL TARIFFS, WHICH COVERS A LOT OF THE COMMODITIES YOU COVER. DO YOU THINK COPPER, ALUMINUM, STEEL HAVE FULLY PRICED IN THE SCALE OF THE TARIFFS THAT WERE APPLIED BY THE TRUMP ADMINISTRATION? OR ARE THERE STILL DISLOCATIONS? MAX: SURE. THE MAJOR METALS THAT PRESIDENT TRUMP HAS SPOKEN ABOUT, WHETHER IT IS COPPER, ALUMINUM, OR STEEL, I THINK, YES, THE MARKET HAS PRICED THE TARIFFS. BUT IN THE OTHER METALS, THAT IS WHERE WE COULD SEE SOME REALLY INTERESTING THINGS FOR THE NEXT SIX WEEKS BEFORE THAT INFORMATION COMES BACK. IN PARTICULAR, PALLADIUM LOOKS VULNERABLE TO BEING TARIFFED, AND THAT COULD SEE UP TO 50% UPSIDE. SILVER AS WELL, BUT ALSO PALLADIUM, GIVEN THE ANTIDUMPING CONCERNS, THE CONCERNS ABOUT DOMESTIC PRODUCTION HAVING COME DOWN OVER THE LAST FEW YEARS. I THINK THAT IS AN AREA THAT COULD BE VERY INTERESTING FOR INVESTORS. JOUMANNA: SO INTERESTING. MAX, THANK YOU SO MUCH FOR COMING ON OUR SHOW AND RUNNING US THROUGH SOME OF YOUR KEY OUTLOOKS ON SOME COMMODITIES. GLOBAL HEAD OF COMMODITIES RESEARCH AT CITI. THANK YOU. COMING UP, A POTENTIAL NEW DEAL ON THE HORIZON. AFRICA'S LARGEST WIRELESS CARRIER MTN GROUP ARE REVIVING TALKS TO ACQUIRE SMALLER SOUTH AFRICAN RIVAL TELKOM. DETAILS NEXT. THIS IS BLOOMBERG. ♪ JOUMANNA: WELCOME BACK TO \"HORIZONS: MIDDLE EAST AND AFRICA.\" I'M JOUMANNA BERCETCHE IN DUBAI. AFRICA'S BIGGEST WIRELESS CARRIER MTN GROUP IS ONCE AGAIN EYEING ITS SMALLER RIVAL TELKOM IN SOUTH AFRICA. SOURCES TELL BLOOMBERG THE COMPANIES ARE CONSIDERING REVIVING TAKEOVER TALKS BEFORE THE END OF THE YEAR. FOR MORE, WE ARE JOINED BY LONNIE TRUNZO. WHY ARE THEY CONSIDERING A TAKEOVER OF TELKOM, AND WHY NOW? > > GOOD MORNING. THE BIGGEST TELECOM OPERATED IN SOUTH AFRICA MANAGED TO GET A DEAL THROUGH FOR FIBER AFTER MANY YEARS OF BEING STUCK WITH THE COMPETITION. IT SOUNDS LIKE THIS HAS GIVEN THEM MORE CONFIDENCE OR MORE HOPE THAT SOME SORT OF DEAL CAN BE DONE WITH TELKOM. SPECIFICALLY LOOKING AT FIBER, IT SOUNDS LIKE. THE OTHER THING IS ALSO THE GOVERNMENT HAS BEEN A BIT MORE VOCAL AND THEY WANT EVERYONE IN SOUTH AFRICA TO BE CONNECTED IN FIVE YEARS, SO THAT IS QUITE A SHORT TIME SPAN. COMPANIES ARE ARGUING WE NEED MORE CONSOLIDATION TO MAKE THAT COMMERCIALLY VIABLE. JOUMANNA: WHAT HAVE BEEN THE HURDLES IN THE PAST TO MAKING A DEAL HAPPEN? > > SOUTH AFRICA HAS QUITE A STRICT COMPETITION OF AUTHORITY, AND THAT HAS BEEN THE BIGGEST CONCERN. THERE WERE ALSO TALKS THE LAST TIME. THERE WERE CONCERNS OVER EXCLUSIVITY OF THE TALKS BECAUSE ALL OF A SUDDEN EVERYONE CAME FORWARD AND ALSO WANTED TO TALK TO TELKOM ABOUT A POSSIBLE MERGER OR CONSOLIDATION. THERE WAS RAIN, THE PREVIOUS TELKOM CEO THAT WAS ALSO INTERESTED. THERE WERE A FEW CONCERNS AND IT FELL FLAT. BUT I THINK IT WAS MOSTLY THE COMPETITION CONCERNS THE PREVIOUS TIME. JOUMANNA: HOW BIG OF A DEAL WOULD THIS BE FOR SOUTH AFRICA? > > IN TERMS OF WHAT SOUTH AFRICA IS BUSY WITH CURRENTLY, THEY ARE THINKING ABOUT STARTING TO REFORM 3G. PEOPLE WANT THE RURAL AREAS TO BE CONNECTED, BUT SPECIFICALLY WITH 4G AND 5G. SO, YOU NEED FIBER INFRASTRUCTURE TO GET THERE. IT IS EXPENSIVE. THAT IS WHY WE SAW THAT DEAL BETWEEN VODACOM AND RAIN. ALSO NOW, THEY NEED THE EXTENSIVE FIBER THAT TELKOM ACTUALLY HAS. AND TELKOM ALSO PLAYER NUMBER THREE IN THE MARKET. WE ARE NOT SURE IF THEY ARE A WILLING SELLER, BUT WE WILL SEE HOW THESE ROUNDS OF TALKS GO, IF THEY LAUNCH IT. THERE WAS THINKING ABOUT RELAUNCHING TALKS THAT DIDN'T HAPPEN. BUT IT SOUNDS LIKE CONSOLIDATION IS MAYBE REQUIRED, OR AT LEAST SEEKED BY THE TELECOM OPERATORS. JOUMANNA: A STORY WE WILL CONTINUE TO WATCH. THANK YOU SO MUCH. BILLIONAIRE DESIGNER GIORGIO ARMANI HAS DIED AT THE AGE OF 91. HE ESTABLISHES NAMESAKE BRAND IN 1975 AND CREATED A RETAIL EMPIRE, SELLING EVERYTHING FROM JACKETS TO SUNGLASSES AND SHOES. AND BECAME A CULTURAL PHENOMENON. THE ITALIAN PATRIARCH ENTRUSTED THE FUTURE OF OUR MONEY TO CLOSE ASSOCIATES. A FASHION LEGEND. GIORGIO ARMANI DIES AT ONE. AND THAT IS IT FOR \"HORIZONS: MIDDLE EAST & AFRICA. STAY WITH US FOR \"DAYBREAK: EUROPE.\" THIS IS BLOOMBERG. ♪",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "JOBS MARKETS",
      "weight": 0.06685793
    },
    {
      "name": "MARKET",
      "weight": 0.063314244
    },
    {
      "name": "MARKETS",
      "weight": 0.063314244
    },
    {
      "name": "MARKET EXPECTATIONS",
      "weight": 0.063277364
    },
    {
      "name": "STOCK MARKETS",
      "weight": 0.0626022
    },
    {
      "name": "OTHER BOND MARKETS",
      "weight": 0.06146098
    },
    {
      "name": "ASIAN MARKETS",
      "weight": 0.061084483
    },
    {
      "name": "MARKET WATCHERS",
      "weight": 0.06071351
    },
    {
      "name": "MARKET SHARE",
      "weight": 0.060339086
    },
    {
      "name": "EURO MARKETS",
      "weight": 0.060285732
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "AI"
    },
    {
      "name": "Africa"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.529296875
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.50732421875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.41015625
    }
  ],
  "sentiment": {
    "positive": 0.061055202,
    "negative": 0.7337046,
    "neutral": 0.20524016
  },
  "summary": "The US Jobs Report, along with the Fed's reduction in the unemployment rate, are featured in \"HORIZONS: MIDDLE EAST and AFRICA\". This comes as China seeks to develop a new model with advanced features to compete with U.S. Rivals, including China's DeEPSEEK, and OPEC-plus. The IMF is set to make a decision on the OPEC-PLUS (OPEC-pluss) decision on OPEC membership. The US dollar is currently down 0.7% for the month, with the S & P. at an almost 10% annual rate for the year, and the greenback at 9.5%. Meanwhile, Asian markets are showing signs of improvement, with Asian markets seeing strong Asian strength.",
  "shortSummary": "Joumanna's report on US jobs and currency trading highlights global market trends, with significant market changes expected, while China's economic reforms prepare for competition with the US.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6385bb497d5a4cfbaf46d90f8bf2fc4d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bond and currency traders are braced for the U.S. jobs data, with markets pricing in a Fed rate cut this month. China’s DeepSeek is developing an advanced AI model to compete with U.S. rivals. Oil prices are expected to fall ahead of the OPEC+ meeting, while MTN Group is considering acquiring South Africa’s Telkom.",
  "argos_id": "RKXPXPPVF"
}